{"text":"I like the patio on a nice day. There can be quite the wait.   I usually order the fish tacos or the seared tuna salad. The fish tacos are nicely battered and the dipping sauce provides a nice kick.   The salad is filling for me and it's light and refreshing for the summer."}
{"text":"Had the Gyoza to start. Excellent. New York steak was very good and was served with amazingly done potatoes! Hit the spot!"}
{"text":"3.5 stars... I was fortunate enough to snag an invite to the media launch - free drinks and appetizers is enough for me to be tempted and the food was good enough for me to return for a non-comp'd dinner a few days later.  The launch party was held in the lounge area of the restaurant. The lounge is spacious with big-screen tvs. The bar is a large square with the ingenious wine dispensing system that keeps wine fresh for days. I got to sample the cheeseburger sliders - burger, cheese, pickle and the special sauce on a brioche type bun. Slider was one of the better ones I've had in an era where sliders are generally rock hard and flavourless. I had my eye on the Lobster Grilled Cheese from the get-go. Lobster, cheese and bread - how can you go wrong? You can't. Joeys was perfectly buttery, the only downside was the little portion wasn't enough I could have inhaled the entire platter. Flatbreads were tasty but forgettable.   On my return trip for dinner, I decided the Cheeseburger sliders were worthy of an appetizer. They didn't disappoint but I could have just eaten them as a main if they gave me a few more. The dinner menu is an eclectic mix of just about everything from burgers and ahi tuna tacos to chicken and ribs and miso soup ramen.   Lobster Ravioli was an interesting combination of lemon, dill, diced tomatoes and grilled tomatoes. My only complaint was that the ravioli was a little too chewy for my liking and a more tender pasta would have garnered another half star from me.  Roasted Chicken came as a half chicken with mashed potatoes and seasonal vegetables. I would have preferred the chicken be at least sliced into quarters rather than plopping a whole half chicken on the plate a la Swiss Chalet.   Dessert was forgettable with only three options. As a die hard souffle fan (a la Splendido) I opted for the Chocolate Lava Souffle. It essentially ended up as a chocolate lava cake that was too rich for even my chocolate sweet tooth.   Joeys also serves crispy mashed potatoes that are similar to spring rolls in that they're rolled up and deep fried with all the fixings... heart-attack on my waist line but I'll be back to try those.  Overall Joeys is a fresh unique take on the traditional hum-drum chain of restaurants Toronto is used to. It will definitely be a challenger for Milestone's, Jack Astor's and the like. I'll be back if only for the fact that I'm tired of traditional chains."}
{"text":"Overall a great restaurant-Both the lounge and the dining room offer different experiences. Service is excellent and consistent. Food is good. Drinks are well made - love the supernova vodka soda. Patio upstairs in the summer is partly shaded with nice bar area. Highly recommend this restaurant!"}
{"text":"Always get amazing food and amazing service when i go here! Ahi tuna salad, sliders, paella, baby back ribs are some of my faves. Missing those szechuan edamame beans though!!!!"}
{"text":"The ambiance at this location is one of the best in the GTA Joey chains.  The reason I didn't give it more stars is because there seems to be more emphasis on the environment then on the food.     The food isn't bad, I just think that they could try a little less to be everything to everyone and a little more focused on their offerings.   Having said that it's a great chain"}
{"text":"Favourite spot for me and my girlfriend"}
{"text":"I went to Joey Don mills the other night with my wife and I have to say I had a great experience. I ordered the sirloin and my wife ordered the steak frites. Even though her steak came out cold, our server was all over the situation. It's been a while since we've gotten such great service. Bahar was taking care of us and she made sure we had everything we needed. A manager even stopped by our table to make sure everything was ok. I find it's how a server deals with the error that really sets them apart. We definitely left satisfied...would recommend the sirloin! Also the pesto shrimp flatbread our server recommended was fresh and delicious. We will be back."}
{"text":"Had their California Chicken Club with meat substitute which was surprisingly good. Their flat breads are pretty decent too. Would pass on the fish tacos and lobster grilled cheese though. Nice place to dine but the line up is insane. Parking is crazy too but there's complimentary valet parking for diners so that helps."}
{"text":"I've been here many times already and I love the Ahi Tuna Salad.  The tuna is seared perfectly and I just love the ginger/ cilantro dressing. Their lobster grilled cheese sandwich is also amazing and the bread wasn't overly buttery or soggy.   The atmosphere was upbeat and just a great place to hangout with friends. Servers were friendly and food was delivered quickly."}
{"text":"The food was good. I also liked the service and atmosphere. A nice decent place to hang out with friends."}
{"text":"If you're looking for a nice quite place, this may not be your best option. The music here is pretty prominent, but not loud in a way that it intrudes conversation and warrants yelling. I kind of liked the atmosphere. Really stylish and chic, without being pretentious --perfect for lunch or post work get-togethers.  Killer Ahi Tuna Tacos ($11.99) -seared rare, toasted sesame, ginger coleslaw, wasabi aioli - the tacos come with a crunchy brittle shell making them very messy to eat. -The combination of coleslaw,  tuna, and wasabi sauce just didn't work for me. -cloleslaw flavours too prominent, covers up any freshness from the tuna. felt like I was eating crunchy coleslaw tacos.  -disappointing since the Ahi Tuna was so fresh and good  Mushroom Cheddar Burger ($14.49) -This gigantic juicy burger is overflowing with mushrooms, and topped with no shortage of sauce.  -I LOVED the fries that came with it. Usually I don't care for fries after they get cold, but these ones were equally as tasty after cooling a bit.    Bomaby Butter Chicken ($17.49) - almond basmati rice, grilled naan -My friend ordered this  and he said it wasn't bad - butter chicken sauce had a nice spicy kick, and was creamy to a point of puree  Ahi Tuna Club ($16.49) -grilled rare, bacon, red pepper, relish, arugula, panko onion rings -one word: AMAZING.  -much better alternative than the Ahi Tuna tacos we ordered  Pumpkin Spiced Mini Donuts ($7.99)-with coffee Dulce de Leche for dipping -they taste exactly like tim bits except crispier on the outside and dipped in cinnamon sugar.  -I would recommend sharing, this portion is pretty big!"}
{"text":"I used to enjoy going to Earl's when I was out west.  The food was interesting (they had seasonal menu items) and reasonably priced.  Joey is owned by the same family that runs Earls so I was hoping for the same.  The food was good but everything was over-priced for lunch which is probably why the restaurant was mostly empty.  If they want to be expensive they can be expensive at dinner.  But at least offer a reasonably priced lunch menu.  A tasting menu or a prix-fixe option.  I'm looking forward to Earl's opening up in Toronto.  I won't be back to Joey."}
{"text":"- Great place but always packed, and make you wait for your table.  - Loud, so not the best place if you want to take a group of friend's to catchup. **This is best with 2 or 3 people tops, to be able to hear them.  - Patio is great and better than inside.  - Fish tacos are really good!! Do it."}
{"text":"I've been to Joey's several times and not once have I been disappointed. In addition to the excellent food and atmosphere, this is a restaurant that really understands good customer service.   It's hard to get a reservation at this place, especially on a weekend night. The hostesses on the phone will usually tell you to \"arrive before 6 p.m.\" to get a table, but who wants to eat dinner at 6 p.m. on a Saturday? Anyway, though the wait can sometimes be long (I've waited up to an hour), the hostesses usually bring out plates of appetizers from the kitchen and let everyone in the waiting area have a sample. I've tried four or five different items, as well as small glasses of wine, while waiting for a table. It's a small gesture, but it makes the wait so much more pleasant!   I've always found the waiters to be really friendly and helpful, and they are constantly recommending dishes to try (which are always delicious). I've never had to fight to get a waiter's attention or been faced with one who's rude or unpleasant.   I'm not really one to comment on décor, but I will say that they have a great outdoor patio and I would highly recommend a seat up there during the summer months.   Some of my favourite menu items include the Ahi Tuna Burger; Ahi Tuna Salad; Baja Fish Tacos; Prawn Curry Bowl; Lobster Ravioli; and, of course, the Chocolate Molten Lava Cake for dessert. Also, Caesar lovers will be happy to know this place makes a great one - comes with a spicy green bean and just the right amount of celery salt!   Would highly recommend this place for a casual night out with friends. It's reasonably priced for the quality of food you're getting (prices are in line with what you'd pay at say, Jack Astor's) and it's a fun atmosphere to enjoy a meal."}
{"text":"First time visiting the restaurant for my mother's birthday. Had such high expectations set by my siblings. They fell short on many different areas from service to cleanliness and finally food. My server did not know the composition of my salad or other dishes we ordered. We had to also hunt our server down because he's either talking to coworkers or out having a smoke. Some of our utensils had residue of dried food. There were also food on the floor. Finally, the food was bland or too much of something.  I had their lettuce wraps and it was too sweet and was supposed to have chicken while it only had one small piece. Their 'special' fried mashed potatoes were dry. My mothers's steak was overcooked while specified to be medium rare. My father barely touched his bland try dish. My brother only received 5 pieces of scallops. The fish tacos that my sister brags about is nothing special, fish did not taste fresh and nothing to be excited about  The Only dish that tasted good was the donut for dessert. Also, their bellinis were also appetizing since it had real fruit.  It took us 38 mins exactly to get our first dish and 24 mins to get the bill. Plus the main course came before my appetizer."}
{"text":"Joey Don Mills - to tell you the truth I never even heard of Joey before going for a business lunch with one of my associates last month in December.  The atmosphere has a nice laid back feeling with very upscale decor (but not overly fancy).  The menu is pretty much your standard mix of sandwiches, burgers, pastas, salads, soups, etc - but each dish has a little uniqueness and originality not found in other restaurants.  For example the fries are amazing and come with a really good sauce ... I had the lobster grilled cheese - was pretty good!  I disagree with Karl about the service.  Maybe because I was sitting at the bar for my business lunch - but the service was quick and friendly.  Yes the bartenders are beautiful - but that doesn't add to the service - what did add to the service was that each bartender was friendly and actually interested in the conversations that were happening around the bar - some people can fake it but to me they all looked like they were all enjoying their job.  Even the manager (who's name i don't remember, ed? edward? who cares) took some time to chat with us and just shoot the ish about business ..   Joey takes pride in their business - and it shows, shows in the food, in the service, in the quality."}
{"text":"I've been coming to joeys ever since they opened. Food is great. Love their twice baked potato. However I feel like service is slow sometimes even when it's not too busy. Great place to have a nice night out."}
{"text":"Had lunch here on a sunny Friday in June up on the roof top patio.  The roof is mostly covered and the walls are so high that you have no real view of anything around you so I have to ask, why bother build a patio like that?  It wasn't crowded yet so we had no problem getting a table and had no need for a reservation.  We were kind of amazed at the spilled food on the floor and a few chairs.  All those pretty girls in black dresses and high heels seemed more interested in giving out a super model \"cleaning is beneath me\" kind of vibe than actually working so don't expect the staff to do anything about it.  My wife had the Baja Fish Tacos which where rather small with only two tiny shrimp in each and very small bits of breaded fish.  They came 3 to an order.  I had the Lobster Grilled Cheese Sandwich which was also very small but at least was very tasty with plenty of lobster in it.  It is just as rich, greasy and fatty as all the other reviewers have mentioned, but hey, that's what grilled cheese is all about so don't order it if you want to eat healthy.  The fries that came with it were good, but there were not nearly enough.  The prices were very high for what turned out to be just an okay kind of meal, but if you want to help pay off Joey's bill for the architect and interior designer of the place or you have so much money burning a hole in your pocket that you absolutely must spend it somewhere then Joey's is the place for you."}
{"text":"my very first visit to joey's was amazing! i went with my boyfriend and the food was really really good, i had the lobster grilled cheese and he had the ahi tuna club as the waitress had recommended and both of us LOVED the food. service was pretty good as a lot of people seem to beg to differ. however i've been there a few other times and have had to wait a long 50 mins just for a table. there is a slight pro to it though, they sample free red wine and appetizer tastings while you're waiting.  dessert menu was a little disappointing without much variety...i was expecting something just as amazing as their main menu however...wasn't super thrilled with my options, so that was a little unfortunate.  reservations are also extremely difficult to make...they dont take reservations over the phone at all and they have to be made approx 2 weeks in advanced through email...which i did one time and got a confirmation however when i arrived at the front door they informed me that i had no reservation...which is extremely frustrating, lucky for us and them...it wasn't busy that night and we were able to get a table right away. had the restaurant been more busy and them not reserve a table for us, things would've been extremely frustrating.  other than that...food is AMAZING (if you dont mind the wait, of course) service seems to fluctuate depending on who your server is...we got lucky the first time we went, but service definitely isn't consistent throughout our visits."}
{"text":"Excellent food: butter chicken, lava chocolate cake, mini hamburger... all in a gorgeous and well exposed patio."}
{"text":"I was invited to a dinner get together with some friends, at Joey Don Mills Grill Lounge, i was impressed with the atmosphere not just inside but outside as well. They have valet parking out front which is surrounded by an outdoor shopping mall with upscale shops.  This might sound broad but inside is like a modern sports bar/restaurant/lounge. But i liked it, The staff is beautiful - I think they only hire hot models to work there. Near the bar they play every sport that's on TV, shown on several big screens and one big projector in the center.  As for the food and drinks they offer pitchers with a nice selection of beers on tap, and also a good selection of cocktails with premium selections.   Our party ordered lots of apps, calamari was delicious cooked very well with an awesome sauce, crab meat tacos, also very good. Then we had sliders, they were boring, there are many other cooler apps to try.   I got a bacon cheddar burger, for my main, It was an amazing heart stopper burger, and they cooked it medium well, which i am very picky about, I hate a dry burger. But i liked my side dish the most, crispy mashed potatoes, fired in a filo dough and topped like a baked potato, worth trying."}
{"text":"Well ...we went back to Joey again in June 2014 but our experience was different. We sat in the open area upstairs, near the bar area, we had our usual - sliders, fish and pasta. The fish was blackened a bit much but the pasta was so salty that we could not finish it.  Since the server did not come back and asked how our food was for almost 15 minutes, we decided not to bother with the feedback. (Someone else dropped off our food)   Also we had to ask for cheese for the pasta and pepper ..  After our dinner, our server did not ask whether we wanted dessert or tea / coffee.  The people who ordered wine around us seemed to get more attention. I guess this practice is normal since they assume we won't spend enough.   Disappointed food, disappointed service.   We will have to go to the Joey at yorkdale because both makrham and don mills have disappointed us."}
{"text":"Visited  Joey's last night for the first time. Excellent service and the Beach Salad amazing.  A bit noisy but overall a good experience. Will return again with my girlfriends."}
{"text":"Amazing!!!  I went to Joey today for a lunch meeting and it was fabulous! I'm a bit of a tough case, being a strict vegetarian with a fish allergy ... and the staff was so accommodating!!!  They told me exactly what was in the food and made sure the kitchen knew about my dietary restrictions.  They have a separate vegetarian menu too, which is very cool.   I had the Beach Salad with soy chicken and it was delicious!   I also splurged and had one of their Italian Donuts in lemon curd and it was one of of the best deserts I've ever had. I highly recommend it!   The atmosphere is really great too.   All around, a great place :)   I can't wait to go back!"}
{"text":"I came here for dinner a few weeks ago and overall, I had a pretty pleasant experience. I had previously been to the JOEY at Eaton Centre once before, having ordered the ravioli, and I substituted the usual sauce with a rosé sauce. I found huge grains of salt in my meal, however, and I haven't been back since.  The food at the Don Mills location was significantly better. We asked to be seated in the patio, which proved to be a good choice because it was a beautiful evening. The patio overlooks the town square and once it gets dark, the lights that come on inside create a wonderful, warm atmosphere.   I ordered the ravioli with a side of garlic bread ($23) once again, this time sticking with the original sauce. The dish itself was delicious and savoury, and surprisingly filling. For dessert, we ordered the molten chocolate cake ($9) which was pretty good as well. However, the vanilla ice cream melts relatively quickly seeing as it sits beside the cake, which comes out warm. Taste-wise, the combination of the cake and the ice cream was fantastic.   As for the service, our hostess was friendly and she came around periodically to refill our water.  Overall, the food and service here was pretty good. Although I would come back again, I would not come often because I'm a broke university student."}
{"text":"Avoid.  The kind of horror story every diner can relate to:  We arrived and were sat promptly by the hostess.  So far, so good.  Unfortunately, that's as far as the good went.  In the first twenty minutes I watched a group of waitresses eating and talking in the kitchen from where we were seating and said to my wife, 'I sure hope they don't turn out to be our waitress'.  Having not been greeted by anyone I got up finally (who knows how long we would have sat there?) and asked the hostess if we had a waitress.  She summoned her a few minutes later and sure enough, it was one of those who had been chatting and eating happily, her name was Arasteh.  She apologized by saying that it was a 'shift change.'  I asked her what beers were on tap and she said, 'Just read the bar menu there. There's a lot.'  (Oh boy; it's gonna be one of those experiences...)  At least she then took our orders but she also conveniently disappeared again for 20 minutes.  When she returned with the drinks, as should be expected, two (waters) were missing, which I had to ask for.  One water arrived subsequently but not the other which we gave up on-- lost cause.  When the food came, apps and entrees arrived together and what was surprising considering the timing, all were cold/lukewarm.  Were they sitting in the kitchen for a while?  I would think probably. Were they eaten from? Is that why the portions were so small compared to our last dinner at Joeys?  who knows?  Needless to say we didn't stay for dessert as we had been planning.  A terrible experience, the kind of thing we all hate and dread as diners.  Despite the fact we've been to Joeys Don Mills dozens of times in the past and never had anything like this happen to us, it will surely be a long time before we return, if ever..."}
{"text":"This was our first visit to Joey's - though one of our party had been before.   We came on a Monday so it wasn't at all packed. We ordered the Bellini (it is on special on Mondays) and a Pomegranate Mojito. Both were delicious!  The menu is quite varied so it is going to be a good place to go if you don't know where to go or what to eat as they have lobster, burgers, sashimi, steak and salads and a whole lot in between.  We ordered appetizers which came fairly quickly - we decided on the Ahi Tuna Tacos and the Blazing Wings which pretty much just tasted like Buffalo Wings to me.  For entrees we ordered the Rotisserie Chicken, the Sashimi Tuna Salad, the Original Burger, the  Lobster Grilled Cheese, Steak Aux Champignons and the California Chicken Burger. Seems no one had any complaints - we ate everything!   I very much liked the Sashimi Tuna Salad with the mixed greens, mango, and peanuts. I am so tired of walnuts on my salad, or toasted this or toasted that. The peanuts were a welcome change. And you get a lot of tuna with the salad, as you should at $ 18.  All in all, a good night out. We will almost definitely come here again."}
{"text":"If you're looking for a gaggle of young, good looking women anxiously waiting to greet you when you walk in the door and then slide into sleek banquets surrounded by equally sleek decor, you came to the right place.  The white glove treatment is nice, but all the hotness of the hostess(es) and servers doesn't make up for the price-tag of truly, uninspired food.   it's not that it's bad, its just that it's been done so many times before.  It's the same shit, different decor.  The only think that really differentiates Moxies, Milestones & Joey, actually is the decor and the length of the dresses.  I should note that Moxies redefines the mini-skirt by being no longer than the labia majora. At Joey, it is indeed a little more tasteful. I digress.   The bar area is nice, with lots of flat screens and I suppose if you are looking for an upscale sports bar, this might be your best bet.  If you are looking for a global menu with something for everyone, this might be your best bet.  If you have no idea what you want and you just want to see hot women bring you food, this might be your best bet.   I'm not going to write about the food, because at an operation like milestones, Joey or moxies the recipes are so routine and tested and that it almost always comes out tasting pretty good. It's consistent, which is nice.   Price-wise you aren't going to get out of here for less than $30 per person."}
{"text":"This is the first restaurant I tried at the Shops At Don Mills plaza! I can say I am a fan!   What I like the most is their roof top patio. Too bad it's only open during the summer / fall. Their theme is green, you feel like you're having a drink in a small garden. They got trees surrounded the whole patio, so it makes you forget you're at donmills, you won't see commercial buildings from the patio. I really liked it, it's a very cool place to hang out with friends.   However, being said that, it gets really packed on Friday nights too. If you plan to come in at 8:30pm or 9pm with a group of 4+, don't expect to get a seat, the wait is always at least 30 mins to 1 hour  Food - I think there is room for improvement. Only a few items on the menu really attracts me.... they have quite a bit of fusion dishes, which i am totally not a fan of.   Drinks - it's a bar, so they do have lots of good selection."}
{"text":"My boyfriend and I go to most joeys locations in Toronto (Yorkdale, eatons and don miplls). We love joeys and usually have a great meal and a great time.   We just left joeys don mills feeling completely disappointed. I ordered the blackened salmon Cesar which was EXTREMELY overdressed for my liking, it was more dressing than salad, and the salmon portion was laughable, maybe 4oz at most and very flavourless for a blackened salmon.. I ate two bites of my meal and asked the waitress to take it away- she didn't even ask me if there was a problem, and that just showed me she didn't care at all.    My boyfriend got a steak which was as usual, amazing. The service was poor, which isn't expected at joeys. I spent half my meal without water, and she never brought us napkins after taking our napkins from the appetizer course. My boyfriend ate a steak with no napkins- pretty funny to watch but not impressive that the waitress was that inattentive.   Overall I'm pretty upset, the experience deterred us from getting our usual whisky and soufflé after dinner- it might be enough to stop us from coming to joeys altogether, which is sad. I'll miss the crispy mash!"}
{"text":"It's ok if you can tolerate the regular alcoholics who stare like zombies at any female. It's a little sketchy for my liking, too many Russian and Columbian drug type people there. The food is mediocre for the price. The wait staff are good, but like I said, I felt very uncomfortable between the alcoholics and drug dealers."}
{"text":"I have been here a number of times and have had a good experience almost every time. The ambiance is very nice and modern, if a little loud, and it is always packed. The wait times are usually quite long, so I recommend going in to put your name down for a table and getting them to call you as you explore other areas of the shops when your table is ready. They will also sometimes bring you a little wine to taste or some appetizers while you wait to be seated.  In terms of appetizers, I have tried the chili chicken, which is just okay (I don't think I would order it again), the fried calamari, and the yam fries, which were both good.  The lobster grilled cheese is probably my favourite thing on the menu. It's just cheesy and buttery enough! Both the regular and sweet potato fries are very good. For mains, I have tried the burger with a side garden salad, which was good, and the chicken fettuccine alfredo, which was okay, but could have been cheesier, creamier, and less runny. My favourite thing on this menu is the lobster grilled cheese. It's perfectly cheesy and buttery with just enough lobster. Their drinks are also amazing, but it looks like they've changed the menu since then, which is disappointing. Their slushy peach bellini was the best, but it looks like they don't make it with slush anymore, which is really disappointing. The apple pie and chocolate souffle are also good, but not amazing.  The service is usually quite good, but I also recall coming here once and being stuck with the rudest waitress I've ever had at any restaurant.   I'm giving this place 4 stars because I think the food is generally good. I've tried many things on the menu and don't recall not liking anything, but it really is pricey for what you're getting and I think you're paying mostly for the atmosphere and presentation. I've docked one star for this, along with the long wait times and the fact that they don't have their old drink menu anymore."}
{"text":"I really don't like Joey.   The food is delicious and reasonably priced. It's a great place to watch a game and grab a drink. Yummy eye candy abounds. It has ample free parking. The servers are nice to everyone, and on numerous occasions my group has been given free appetizers, wine samplers, and desserts. It's so fantastic, it is has quickly become the go-to Friday night hangout  for my uptown friends.  As I said above, I don't like it.   Joey is not that easy or pleasant a trek for this car-free downtown-gal. When my friends suggest it as their hangout-of-choice, I grin and bear it. I'll trek up there for a birthday or another special event - other than that, I'm hanging with my downtown friends. Sorry Joey.  I hear Joey is coming to the Eaton Centre soon. If that's true, I think Joey and I will be back on good terms."}
{"text":"I beg to differ from the majority.  Service, great. Manager's attention, great. Food hot and served in a timely manner. Sure, the waitresses were all great looking in their high heels, no complaints  BUT - We had made reservation days ahead. One of us uses crutches full-time. Still a long wait for the table, over 25 min at 6.30 PM on a Friday.  AND - The sound level was appalling. I happened to carry a sound level meter from my day-job. The level was NEVER below 95 dBA and we were far from the blaring TVs - a level NOT acceptable for workers in this country. - We couldn't hear each other even screaming across the table, on par with a disco where we, a 60 + age group don't go.  AND - the lighting level was totally unacceptable. Thanks to our cell-phones that can be set to \"bright\" we were able to descipher the menu.  As for seeing what we ate - the nicely decorated dishes and desserts were not appreciated for their decor - we couldn't see much of it.  AND - the place may be a year old and so much is \"high tech\" - a bunch of the LEDs at the entrance were burned out and there was evidence of a lack of \"technical attention\" in more places.  Will we go back? Never - why go to a place where we risk lose our hearing and cannot see?"}
{"text":"The food has always been beyond expectations, cooked perfectly. The decor and layout of building is beautiful and fun to be in especially the roof patio.  My only Complaint is regarding the servers; the last 3 times i have been here i was ignored and had slow service because there was some sort of large table of guys that clearly go there for the beautiful servers and would tip huge. My most recent visit aug2015 the final straw was sitting there with our food boxes all ready to go and waited 20 min for the bill.   5 star food"}
{"text":"The hostesses and servers are SO NICE! They are all very professional. The food is good, the atmosphere is nice and the place is always full."}
{"text":"I have been going to Joey's for about a year now, going every month or so to eat dinner when the urge for the Ahi Tuna Club sandwhich hits! The food overall is very well prepared as they offer a selection of burger, sandwiches, pasta's and even sushi on the menu. The Ahi Tuna club sandwhich, which is my favourite dish, is always cooked to the write temperature, and the bacon, onion rings and sauce really compliment each other.  The restaurant itself is very up scale and has much of a modern feel to it, very nice and clean feel to the restaurant. Seating can be difficult during the dinner hours, especially during the weekend, as they don't have a lot of big tables. However, this is a very nice place to drink, as the large tv's and seating in the bar offer a great place for drinks with a small group of friends during the evening.  The only reason why i am giving this 4 stars is because the services was extremely slow once, when i was siting with 3 other people in the patio area. It took nearly 30 minutes for her to even get our drink orders! Furthermore, i was dining in the patio at around 10:30 on a saturday night."}
{"text":"(3.5*) After many tries to get a seat in this restaurant for dinner, I finally had a chance to try this place out when I went for an early dinner last weekend (I recommend you get a seat before 5:30pm).  We got to sit upstairs in the heated patio which was a nice experience. In the summer time, it serves as a nice roof top patio in the summer time. Like all Joey's the seats are very comfy and spacious and there are booth and regular table options available.  The menu has a number of options which generally has something for everyone. My favourite menu item is surprisingly The 500 which is a Quinoa salad ($14). It's very flavourful and loaded with ingredients. My friend ordered the burger with fries and she said that was very tasty as well.   Overall service was great, very professional and the food arrived fairly quickly as well."}
{"text":"4.5*  This is def one of my fav Joeys in Toronto. Been here a few times, services has always been GREAT! Food is tasty and price is average with any \"bar food\". The best part about this restaurant is that it has an open patio on their second level. Its got a nice view and fresh air especially during the summer time. If you haven't made your way up there, you should!  They are also located right next to a good ice creme shop. Def a plus!"}
{"text":"The food is delicious I don't care what anyone says everything is pretty good. If I wanted steak I'd go to the keg but other than that everything is better than their chain counterparts and often better than some of the best restaurants I've been to. If I had to be nit picky then yes portions can be small for Most ppl and wine is quite expensive but it is my go to place"}
{"text":"Probably a great night for our waitress. She was able to hang out with friends and ignore us totally! Love that customer service is second to whatever the other priority is. No second round of drinks, no dessert...no clue."}
{"text":"Food and service both good. Limited parking despite our 5:30 pm arrival. Steak sushi and paella all quite good. It was a warm summer evening so the patio was completely full.  Even so the server did not try to rush the meal."}
{"text":"Nice place. Pleasant service. Good food. The dumpling appetizers were brilliant and burger is as good as they come. The sweet potato fries with aioli were very good. The Stella on draft was fresh but should have been a bit colder. We tried the ahi tuna tacos based upon another reviewer's recommendation, but found them to be a little tasteless and the shells exploded on first bite leaving a mess in  my hand. Much is made of the attractive waitresses and they are pretty in that Americas Next Top model kind of way, but not really my cup of tea."}
{"text":"Pricey!!! Would only reason I would go back to this place is the roof top patio in summer time, it is absolutely amazing in the afternoon/evening!!! Although if you tend to take your time and stay for more than 2 hours they make sure to keep bugging you and make you feel as if you are intruding. The service is really snobby and aggressive, all the servers in that place are strictly female and if you would pay attention you would notice that they must have picked them out based on some sort of a standard as they all have the exact same \"physical attributes\", dress the same, even talk and move the same way... it is almost as if you are surrounded by a bunch of robots. The decor inside is quite aweful everything is way oversized, they seat a couple in what seems to be a booth for 10 meanwhile people are waiting to be seated. God forbid you have a larger group you will never get seated... The food is not spectacular, the usual pub items, very few salads on the menu"}
{"text":"This review is only on the ALCOHOL (BEER) and not the food.  My friends and I have been going to Joeys recently and we noticed something about the beer. IT IS WATERED DOWN, YES....sad but true.    There is no way in a span of 2 and half hours my friend and I  can consume 10 pints each and walk out of there without staggering or slurring. We actually thought our alcohol tolerance had increased however at any other bar, usually 4 to 5 pints is good before we call it quits. Please be mindful when you order beer at Joeys, the same holds true for Joeys Eaton Centre and Yorkdale. BEER IS WATERED DOWN"}
{"text":"Despite the long wait, the food and service does make up for it. Had tuna tacos, tuna salads and another fish taco and ribs. The ribs was average, but everything else was amazing!"}
{"text":"my favourite restaurant!  all their dishes are amazing, good service! usually a line up but they give you sample alcoholic drinks and appetizers while you wait.. love it!   on the pricier side but affordable, great environment!"}
{"text":"No matter how many times we visit Joeys, we are never disappointed. We had the pleasure of speaking with Kristoff Wint throughout the night, a manager we met over a year ago when he was at the Markville location.  Without fail, he checks in on us multiple times throughout the night- making sure everything is in order. He is so professional and represents the restaurant so well.  Our server tonight- Elijah, was outstanding! Friendly, attentive and on the ball.  The food is ALWAYS consistent and it is always a pleasure having a night out there! Hats off to a company well run!!"}
{"text":"3.5 stars sound like fair rating for Joey but my experience leans towards 3 stars.   Foods were good but for the price we expected better. Calamari appetizer had nothing special about it although it tasted good. Gyoza was greasy but then again it was yummy. I had blue cheese sirloin for entree, which was delicious. I think steaks here are pricier than the ones at Keg Steakhouse but I didn't think it was better than Keg's. My friend liked her pasta.   I was surprised to find some sushi on the menu. There were some Asian fusion foods, which I cannot comment on as I didn't order them. But if you like that stuff this place might be worth a try.   Service was so so but I have conflicted feelings about it. Our server was friendly and always smiling, but he was nowhere to be found to refill our water and drinks. I also had to walk up to the counter myself to get a new knife after dropping it on the floor. Then again, our server was so nice."}
{"text":"The wait staff is slow.  Valet park because the parking isn't that good if you want something close by.  The wait time is always double what they tell you and there is always a wait time form Thurs to Sun.  Most of the people who come are not there for the food, they are there to be seen.  People dress like it's a club when they go.  I just go in my chucks.  IMO, this isn't a \"dress up\" restaurant, it is more of a casual restaurant.   The food is really good.  For the price compared to Moxies, Alice Fazoolis and so on, they are much better.  The food is quite consistent as well, whether it be a slow day or a super busy day.  My favorite is the fish tacos but you can very well get anything and be satisfied.   The portions are relatively generous.  We rarely finish all of our food."}
{"text":"Great atmosphere in a great area. Service is non existent at this place. Sitting at the bar which has 4 bartenders, of which 2 are doing inventory before midnight, only to be ignored by the other two. After finishing our first round of drinks and ordering a meal we had to sit at the bar for 20 minutes with an empty glass before being asked if we want another drink. The saddest part is that the bartender collected the bills from the parties to our left and right before taking a drink order from us.  Really really disappointing experience as I have really expected a lot more from this location."}
{"text":"I ordered the famous lobster grilled cheese and it was deliciously buttery and moist. It came with a side of fries, which were the thin type (my fav!). Anyways, service was excellent and I enjoyed the fact that they gave complimentary wine and appetizers for waiting guests.  Food was excellent, service was excellent and not to mention the location is great! You can walk off your guilt about eating buttery cheesy goodness at the Shops. Although I don't feel guilty about it whatsoever."}
{"text":"Visited my family in canada and the first thing i heard when we got there was we're going to dinner at Joey's and they have LOBSTER GRILLED CHEESE!!!! i was already sold i didnt need to look at the rest of the menu when i got there. i already knew what i wanted.   the place was packed but we had reservations...so please, have reservations. very nice, modern hip place. Theres an upstairs outside seating which looked lovely. semi casual dressy setting. youd kinda stick out with just a t-shirt and shorts on.   looked at the menu and i couldnt stop looking at lobster grilled cheese so of course i ordered it. it looked small when it came but it was the perfect size. crunchy buttered layer on the bread on the out side...and chessey lobster goodness on the inside. they werent shady with the lobster either. french fries had that perfect crunch everytime. i was in food heaven for that 30mins. also tried my sister in laws raspberry iced tea....and it wasnt your usual lipton rasp iced tea....it actually had iced tea with rasp puree or something in it. it was amazingly refreshing.   overall, the next time im in toronto....im coming back to try more for sure!"}
{"text":"I love the atmosphere! Make sure to get the cute table and comfy chairs by the window :)   Been here a few times and have never been disappointment. Lobster grilled cheese, beach salad, chicken sandwich are amazing. and I never go a visit without having a sushi cone! Excellent.  Their apple pie is fresh and amazing - but it's rather big so it's better to share!"}
{"text":"I work near Joey's so I have mostly only been there for lunch.  Service for the most part is pretty good.  Since i was there on a lunch break today, we made sure to tell the server that we had to be back at the office in an hour, they made sure to bring the food and bill quite quickly.  Today I had the Tandoori Chicken flat bread (which I've had before) and the sweet potato fries.  Both are great (but the sweet potato fries I find are a bit expensive for the serving - $7.99).  Overall everything was great, and they have complimentary valet service (which is good, since parking at the Shops on Don Mills can be a little annoying)."}
{"text":"We walked in with our 11month old and a stroller, surprisingly we were greeted and seated immediately with the server taking the stroller into consideration.  Ordered new york steak and flat bread, the steak was ok, cooked perfect but they put fresh herbs and seasoning on the steak that over powers the taste. The crispy mash is excellent so is there flat bread.  Service A++++ Food Quality A+ Price is Standard  2 steak dinners, flat bread, 9 oz wine and ice tea $115 with tip."}
{"text":"I like this place. Nice patio.  Sides were good too. Pricey, but it's a pretty classy place. Casual works here too, but the overall ambiance was relatively upper scale.   Mains were delish. I had a panini. It wasn't filling, sad to say, but it was far from disappointing. I had ordered a more \"ethnic\" kind, and usually restaurants that attempt fusion tend to butcher the experience with the quality of the food. But no, that wasn't the case at all here. The food was awesome.  I didn't need much servicing, but the waiter was very attentive to some of my more demanding friends. He made a couple of jokes that they liked too. Definitely a relaxing environment.   Price to quality, everything was above par. It's a bit far for me, but I wouldn't hesitate going again if I'm in the area."}
{"text":"Tried this place again and I had to say that the food was awesome this time around. I had a delicious steak and my fiance's burger was super juicy. The service was great and atmosphere popping as usual. Good stuff!!"}
{"text":"I absolutely enjoy the restaurant experence at Joey's from beginning to end. As soon as you walk in the front doors, you are AWE-strucked with the dim ambiance, relaxing vibe, and young scenary. Definetly a place for young adults and recent graduates to spend our hard earned money.   I would highly recommend the Ahi Tuna Taco's to start. They add a tuna sashimi that is always fresh and tasty. The taco in itself was a crunchy shell with a zesty & tangy sauce with a hint of chipotle. I personally enjoyed the Baha Tuna tacos (similar but with soft shell) and the Burger Sliders were bomb too. The burger meat was significantly more tastier than anything you could find at moxies or milestones.   For Entree you could either go light or heavy.  For a lighter selection, I would highly recommend the Grilled cheese lobster sandwhich. The combination of a melted cheese with freshly cooked lobster is out of this world. The lobster was not overcooked and was soft enough that you could taste the lobster by its juice on every bite. The heavier recommendation would be the Blackened Basa fish which is actually a white catfish. This is cooked to PERFECTION! I have never tasted a more deliciously made fish as it was seasoned to perfection. Also it was not overcooked so much that it was flaky, but not undercooked so much that it was too chewy. It was made perfect. Also it lies on a bed of rice where its juice just gladly thrusts itself upon and a side of veg.   For dessert, the Molten Chocolate Lava Cake is unbelievably good. I recommend this to anyone that comes to this fine establishment. If you only have a small appetite, forget everything else, unbuckle your belt, and order this cake. You will not regret it."}
{"text":"very similar to the high end chain rest. food was actually very good and service was great"}
{"text":"The 500 salad is my favorite  My daughter always asks me to bring her there for that chocolate cake desert and I love their apple pie with maple ice cream"}
{"text":"I've been here for lunch about 5 times in the past couple years.  It can get quite busy during the weekdays.  They don't always take reservations.    I would describe the ambiance/waitresses as an upscale Moxies Restaurant.  They are much classier.  The last time I was at a Moxies during a weekday lunch, it was a room full of old dudes gawking at the waitresses (who were probably the age of their daughters).  I only order one thing here.  The Ahi Tuna Club sandwich.  Rare in the middle, tender all round.  This sandwich is hands down the best item on the menu.  I've tasted a few of the other menu items, and they are just okay."}
{"text":"First thing you notice-the waitstaff.  I'm like, uh, is it just me or are all of the waitstaff here GORGEOUS?!  Guys and dolls folks, both sides here.  Once you peel your eyes off them and unto the menu, you'll be surprised with the offerings.    A step up from the regular lounge menu, we especially liked the asian fusion dishes.  We had the ahi tuna burger, the lobster grilled cheese, viva salad, and california club.  I'd eat the tuna burger and viva salad again. Pass on the rest.     Can't wait to go back.  It's definitely a fun place to go with a group of friends.  So put on something nice, share a bunch of plates, and order a few bevvies.  It's definitely a fun Friday night."}
{"text":"THE GOOD:  The view and the food.  Wait staff must be hired from a modelling agency.  How can so many good looking people congregate in one restaurant?  I must have accidently walked in the 'good looking people' club.  I would normally scoff at a place like this but was out voted.  To my surprise, the food was fresh and well prepared.  We had lots of appetizers.  It was a great way to spend the evening and elevate the class of a work function.  THE SO-SO:  Prices and parking.  Expect to pay a premium for appetizers and the view.  This is the good-looking-people's club afterall.  This place is at Shops at Don Mills.  Parking can be a real pain and with good reason.  The area is a breath of fresh air for North York.  Lots of well designed walkways, buildings and nicer shops.  THE BAD: Line ups.  They tell you there is a wait even when there seems to be lots of seating.  Interesting strategy: low supply = greater demand."}
{"text":"The first ever Joey's location I've been to and probably my favourite location. The dishes we're perfectly prepared and the service was really good. Some may find that the prices at Joey's is a bit on the expensive side but I feel that it is quite average seeing that the plate portions are quite large. My personal favourite is the Maple Salmon. In addition to that, the Ahi Tuna Tacos and Tandoori Chicken Flatbread is a must try as well. Classy environment, all staff is very well dressed and professional, great atmosphere for gatherings and dinner events."}
{"text":"I have been to this place a few times.  The first impression is that it is a upscale restaurant located at Shoppe at Don Mills.  The décor is modern and classy.  The waitresses are all very good looking.  It most likely is one of the hiring criteria.  That's not all for their quality.  The last time when we went back again, the same waitress remembered us and could repeat what we had ordered.  Amazing memory!  In addition, they are always very polite and smiling.  The flatbread is very oily.  You can see the sizzling oil on top.  The famous Baja fish tacos cannot be missed.  Although I did not try the sushi, it looks good. The dessert chocolate lava cake should be ordered even though you are full.   This is the restaurant that you will come back often"}
{"text":"The Waitress here are hot. They all look like models. Long wait for tables for weekend's dinner. If I plan to eat here, I would go as early as I could to avoid long wait. I like their food but love their Tuna burger the most. check out the funky drink menu too. Free valet parking too as with most of the eatery in the mall."}
{"text":"I came here for Valentine's Day this year. We missed our booking for the one at Yonge/Dundas so we called an hour ahead to get on the waitlist. Unfortunately, when we got there, they couldn't find us on the waitlist and we had to wait an extra 45 minutes. The night wasn't off to a good start.  However, we were quite pampered during our wait. The servers treated us to samples of wine, tandori chicken, sushi.. the service was definitely above par aside from the initial screw up.   Finally after being seated, we were offered menus. You can basically get anything here - it's more like a fusion restaurant. From curry to Asian wontons to steak.. it's all up for grabs. I personally ordered the filet mignon to satisfy my love for steak. Alongside, I ordered a Peach Bellini.   The drink was excellent. I don't like how some restaurants serve an alcoholic drink and you don't taste any of the alcohol. JOEY did a good job of creating this balance. I would recommend this to ladies who enjoy sweet drinks!  Onto the mignon. Mmm. Portion was on the smaller side but it was nice and soft. Simply marinated with salt and pepper is how I like it and is how it was done. To be nitty gritty, I think the meat could have been even more tender. I also enjoyed the side, which was cheese, bacon and mashed potatoes all stuffed inside a thinly layered, crispy spring roll. All this tasty goodness was topped with a layer of sour cream. This was a good contrast to the steak.  Overall, I enjoyed the fancy dinner in a casual, dressy environment. I will definitely give it a go again, but maybe not for special occasions like this."}
{"text":"This place is one of my favourite go to spots in my neighbourhood.   Summer time the upstairs patio is heavenly.   Their drinks selections are really nice.   Their food selections are average.   My favourites are their ahi tuna salad and their fish tacos. Those are done spectacularly.   Their rotisserie chicken with veggies is very bland and a bit too oily with way too much chicken skin.   Their portion sizes are average.   A nice to kick back and have a few drinks with some friends.   I've hosted my birthday dinners there twice and it was a pleasant experience.   The ambience is quite nice."}
{"text":"Ridiculously friendly staff and good food. I've been to every restaurant in the area and, despite my best efforts to like Glow, it's the one I like best."}
{"text":"Great restaurant. Service is great and food is always unique and yummy. I specially love their shrimp flatbread. Steak was so so but the burgers were great. I love the atmosphere and the decor, but they could be a little more accommodating when it comes to reservations."}
{"text":"Likes: Fantastic atmosphere, great location, delicious sweet potato fries Dislikes: They are always busy with wait-times of 30 mins or more, the ceasar salad made me terribly ill and when I complained online no one got back to me."}
{"text":"I was disappointed with the Panang Prawn Curry Bowl. The serving was small and I was expecting prawn to be included in the dish. It turned out to be small shrimps and the taste was of the shrimp was nit even flavorful. The presentation and Panang sauce were the only bright spots of the dish!"}
{"text":"I'm not sure why the crazy lineup at this place but a lot of people seem to like it. My friends like this location for the patio which I've yet to check out as it was still winter when we went a few days ago.   The service is good but the food is only OK--not really worth the wait though. When we were trying to order, one friend was having a hard time, not because he can't read but he commented that \"there's too much to choose from\". Thing is, there is, but there isn't, mostly because there's a lot on their menu that I would never order.  We were a group of six and most ordered some apps, sandwiches which all come with fries (salty ones): one had the tuna club ($17), the others had the California chicken club ($15), a lobster grilled cheese ($15); and then there was the blackened basa ($19.50), along with drinks and desserts. I find most of their stuff to be salty as was the case with the lobster grilled cheese. I've had it before at other locations and I guess the saltiness is a standard across the board. As with spicy items, menus tend to note them with a pepper, Joey should have a little salt shaker icon next to most of their listings.  We started with the fried calamari and spinach & artichoke dip ($12 each). Among the calamari was some fried asparagus and fennel which I wasn't expecting (even though it is mentioned on the menu!). It was decent but the calamari were so tiny that you needed a spoon to serve yourself. Of all things, the spinach dip was almost watered-down and actually needed a little more salt. It came with a few nacho chips and bland salsa.   The chicken clubs seemed to have a fair-sized piece of chicken in it but didn't seem to have a whole lot else going on; ie, just the usual. And it wasn't a double-decker sandwich, but still a club. I don't get it. The one who ordered the tuna said he liked it so I'll take his word that it was good. The basa platter seemed to have a lot going on: the fish had a southern rub happening which at first bite was *surprise* a little salty but the rice (spiced with I think cumin and a hint of curry perhaps?) with some tzatziki on top seemed to help mute the saltiness of the fish. Surprisingly, all those flavours combined seemed to get along. The basa came with a tiny bit of salsa and cherry tomatoes, and braised root vegs that I love~ It wasn't over the top but I did like this dish which contained all the things I really like, plus it was filling.  We had a lot to drink with our food: beer, standard cocktails, and some of us had ordered from their daily featured drinks list, among which were various flavoured stoked vodka which were pretty yummy and went down easy. The blueberry was my fave. For dessert we ordered a few chocolate lava cakes ($8) which *haha* had a salted cake that worked well with the oozy-gooey chocolate inside, served with a scoop of ice cream, and some Italian donuts ($6 for 5 pieces the size of macarons). I really liked the donuts: still warm, crispy on the outside with cloud-like insides, served on a goopy pile of lemon curd (I think I saw some vanilla bean in there, which I'm allergic to but ate anyway). the donuts are a must!!!  I would never wait more than 20 mins for a table here again but you know how it is when you're not the one making the decisions. ;) You definitely feel like you're at a chain resto at Joey, in fact it reminded me a lot of Moxie's or of Milestone's when they first came on the scene. I would go back if in the area."}
{"text":"For me, Joey is the place to go if I feel like I want to treat myself to a glass of wine.  Since they opened, I have been there many times and was never disappointed.  The first time I stepped into this place, I was just by myself since I had been shopping at the shops at Don Mills.  Feeling exhausted, I stepped into Joeys.  And let me tell you.  The service was impeccable.  In most restaurants, coming in as a single lady, you get the crappy table and almost no service.  At Joeys, they treated me like the Queen and I did not feel uncomfortable at all.  That made me return over and over, alone or with friends and/or family.  At one of my visits with two friends, the place lost its electricity.  The waiter apologized and brought each of us a free drink. On another visit, we had to wait for a table since the place was packed.  Of course, they offered us a free sample (quite a bit) of wine and also free appetizer while waiting.  Food is always good, nothing spectacular but consistent good quality.  But the service is what brings me back here."}
{"text":"We've dined here a few times or just gone in for a drink and appetizers. The experience has always been great. The servers are very polite and the food is deliciouso!!"}
{"text":"Took my mom out to Joey's for her birthday. There was a total of 5 people in our party.  First time i walked in the establishment, I was impressed by the revolving door and the upscale decor. Staff were mostly friendly. Now about the food ....  Appetizer: AHI TUNA TACO  to start.  It tasted just \"ok\".  Each taco had a piece of cold seared ahi propped on top a pile of creamy coleslaw nestled in a taco shell. It was messy to eat as everything fell apart.  Each item seemed to stand alone without correlation to the other ingredients.  Entree: -BABY BACK RIB WITH YAM FRIES (at no extra cost) . It was fall off the bone good. BUT! the sauce was disappointing. It tasted like the sauce was quickly brushed on and did not have time to soak up all the flavours. So i tasted the boiled pork first , then the sauce after. I was a little disappointed as i had higher expectation from Joey's -KOBE BEEF MEATBALL SPAGHETTI  was delish! I might just order this one on my next visit. -STEAK was decent.  Dessert:  -We had the BANANA CAKE WITH COCONUT ICE-CREAM was surprisingly delish and flavourful. Quite refreshing and not too heavy. -We also had the APPLE PECAN CRISP WITH MAPLE ICE-CREAM. It was a pretty good comfort food. Reminds me a bit of Beaver Tails only way better.   Drinks:  MOJITO - I've  had much better ones elsewhere MARGARITA SHAKEN - This one was good.  Overall, the food i ordered didn't make me go wow! but I will give Joey's another chance and try out some of their other dishes."}
{"text":"Love this place.  I have come here since almost its inception and every time I was provided with the same great quality. It's a bit pricier than usual but it is worth every penny. (4.5 stars)  Make sure to call in and reserve if you're dropping by during weekend."}
{"text":"This is only a review of drinks and service, I'm sure I'll end up putting something in my tummy sometime soon and then update the review.  I work near here and without the Shops at Don Mills my coworkers and I would have absolutely nowhere to go for drinks. Joey is an easy choice for our after-work gatherings. The roof-top patio is gorgeous, but we most recently went last Thursday when you couldn't have paid us to sit inside.  We were a group of around 10 and the hostesses were inventive in figuring out a way to seat us all. Our server was friendly and comfortable with a large group, separate checks and people coming and going at different times.  Thursday's drink special is some sort of ginormous double vodka soda with slush and goodness. I enjoyed one and had I had the foresight to have not driven to work that day, it would have been a few."}
{"text":"Definitely the best Joeys in Toronto, when it comes to food.  I come here for lunch with by hubby every so often on the weekend, it's not to busy.  But for dinner, if you don't have a reservation expect to wait at least an hour for a table.  1. Ahi Tuna Tacos - Must try 2. Sliders - OK 3. Lobster grilled cheese - it was ok a little to greasy for my liking 4. Lobster pasta - its ok to share, but to have this dish to yourself I think it is a bit rich 5. Crispy mash - Amazing!  6. Ahi Tuna salad - tastes similar to the Ahi Tuna tacos, so i enjoyed it  Overall the food is ok, but i gave it 4 stars because it has the best food compared to the eaton centre and yorkdale location."}
{"text":"Any Joey location deserves this star-review. I visit a Joey restaurant at least once or twice a year, and the food is just getting worse. I've ordered almost everything on the menu, and all of it is cheap, out-of-the-box, over-processed food. I've worked at a chain restaurant, and I KNOW that most of these establishments serve pre-packaged foods.   October 2015 - I went for my cousin's birthday and I ordered and split the Mezza Plate, the Truffle Oil Fries, the Top Sirloin (with spring rolled mashed potatoes - yuck, so gross!), Paella, and Burger. All of it was just terrible. I find that the menu isn't that expensive (steak was 27.00), and you get what you pay for. I'm sure most people go to Joey for the ambiance - It's a trendy place for 21-35 year olds. They play house music and have big screen TVs that show the game and the outdoor patio that's still open now.   Do not go here to eat! Go for drinks, with friends if you live nearby. But if you want a cheap steak, go to the Keg. If you want a good burger, go to a burger joint known for burgers. They're opening a Joey in Richmond Hill and what a waste of real estate that is! But I think the young adults (and mothers) will like it as a place to go hang out."}
{"text":"Joey has turned into my default restaurant to go to when I want to catch up with friends, eat somewhere before a night out, etc. The food is ALWAYS great. I dont think Ive ever even tasted something bad there. The ambiance is nice, and it is always full of life. Service is also really good and Ive been going there for years. Would definitely recommend"}
{"text":"Always great service. They really do a great job of giving guests a great experience. Food is over-priced, but good. I usually go here for drinks only"}
{"text":"The one thing I hate about these types of \"restaurants\" is that the patrons have to be so attentive to the staff to make sure they get it right..I don't care about seeing pretty girls who can barely walk in stilettos, boys who want to be loved by the pretty girls or have undertrained teenagers working in the service industries.  We come to dine and be with the group of friends or family with us, not to be a babysitter of the damn waitress/hostess/bartender.    The food is cookie cutter pedestrian fare and this is just a cover-up for a well oiled chain restaurant.  You can impress my 13 year old but it's me with the Visa card who will pay.  We had:  tuna tacos, roast chicken, steak, fettucine alfredo, calamari, lettuce wraps (working for your food with this one).  All over priced .... and nothing new and exciting.    The waitress was so \"undertrained\" ( I'm being nice here),   I wanted to say why don't you sit here and I'll go get everything.   I don't want to be insulting but she was dumb as a fence post!!!!!   If your one of those 20 something guys on the prowl this place is perfect for you, go mosey up to the bar and have a few.  You may even get lucky."}
{"text":"I personally think the food at joeys is by far, the best compared to other restaurant groups like Moxies, Boston Pizza, Milestones, etc. This location is particularly good in that it is large and spacious, the valet service parking is great and the food was awesome. Tandoor chicken flatbread is fantastic! Spicy and salty but just the right amount. The Panang Prawn curry bowl was Great!!! I was surprised by how much I enjoyed it especially comparing it to other Thai food. The yellowfin tuna salad is one of my all time favorite salads. Finally, for dessert a classic molten chocolate lava cake. They are also really accommodating to vegetarians providing options for substitutes. The staff here at this particularly location was super friendly & the ambiance is always cool here."}
{"text":"Solid spot.  Beer is always there to water with.  Pub grub is above average.  People there do carry themselves a little better than normal.  Plenty of people have written about this spot, so my quick tip:  Yes, there is sometimes a lineup there.  NO, you should have better things to do then wait an hour or so in line.  So your tip, leave your name and go to Beir Market next door. Unfortunate Joey's doesn't want all my money, but, good place, and my workaround keeps me from being thirsty :)  Enjoy!"}
{"text":"I like coming here for the atmosphere, the service is usually good, but food wise it's usually good. I tried their salads mainly from the ahi tuna and the farmers market chicken and straight up it's not filling. Their crispy mash potato is different but great. Their sushi is actually good and fresh at least when I got it.  Preferred the second floor since u get to see the Don Mills square. Good for dinner dates."}
{"text":"Got their beech salad which was amazing !! Great service and great environment. Will defiantly be going back!"}
{"text":"The reservations were for 16 people, that turned out to be asking for too much. The place advertised itself as a restaurant, and the exterior suggested that was the case. How I would describe it would be: \"Toronto's most tolerable sport's bar.\" Imagine Spice route, but where all of the yuppies wore jerseys instead of suits.  Maybe they weren't yuppies at all..more like middle-aged professionals. Muppies?  Plasma screens decked the halls like it was Christmas, really made me wonder why they bothered to decorate the place at all. There's about five girls by the door, and ten waitresses working the floor. All of them wearing cheap black tube-like dresses, it really did feel like Spice Route, only louder. I only saw one blonde Woman roaming about in a zebra print shirt, probably the manager. When I asked her for a serviette, she didn't seem to understand my request. \"What is your definition of a serviette?\" She asked. \"Something to place on my lap\" I responded. She unfolded a napkin made from recycled paper and placed it on my lap. \"There you go!\" \"How industrious.\" Resisting the urge to strangle her, I smile.  I had the Blackened Basa fillet with rice, and Gyozo (dumplings), it exceeded my very low expectations. The music was unbearable, I had to use my outside voice. I was at such an intimate distance to my friend when speaking to her, it was almost..umm, intimate. Don't get the Alfredo, regardless however your server praises it.  I almost swallowed my fork from the sudden bursts from vivacious reactions of the sports fans at the bar.  If it weren't for the company, I'd probably..well, there's a lot of probability there lets just say. I paired my meal with a raspberry cocktail, the drink was fine, the raspberries were revolting.   Joey, the name of the bastard child of an one night fling between King Street West pretentiousness, and Bay Street's desperate attempt to appear as if the people who worked there were real human beings."}
{"text":"Went for lunch today in a group of 6.  We all enjoyed our meals.  Quotes about;  Appetizer - CHILI CHICKEN in light tempura with chinese chili sauce and cool cucumbers. \"Nice combination of sweet and spicy!\"  LUNCH SALMON grilled medium-moist salmon with maple butter sauce served with aromatic rice. \"It was very good.  Best I've ever had.  Mention that it was done perfectly.  Try the rice...it's delicious.\"  AHI TUNA SALAD seared rare ahi tuna, mango, amorosa tomatoes, fresh mint, peanuts, crispy noodles with a chili lime dressing. \"Good flavours.  Fresh and well prepared.  Peanuts may have been a little off.\"  CLASSIC FETTUCCINI ALFREDO with fresh cream, garlic and grana padano parmesan. \"Very good.  Just the right amount of sauce.\"  SPAGHETTI WITH KOBE BEEF MEATBALLS seasoned with rosemary, toasted fennel & fresh basil with rich tomato sauce. \"Awesome.  Beef was tender and delicious.  Nice complementary flavours.\"  BAJA FISH TACOS crispy fish and shrimp in corn tortillas with guacamole, cilantro & mexican hot sauce. \"They were pretty good.\"  BOMBAY BUTTER \"CHICKEN\" served with toasted almond basmati rice, grilled naan bread and lentil papadum. I had the vegetarian, soy-substitute version with brown rice.  It was tasty, if not particularly authentic.  The papadum and rice were good, the naan a little weird.  Regular coffee - \"OK\". Decaf coffee - \"Excellent\".  (Pretty sure this was a decaf Americano.) Americano - \"Not good.\" Served in a glass mug, which is a big pet peeve of mine.  Our friendly server, Lauren, brought us a scoop each of the coconut, vanilla and maple ice creams for us to taste and share.  A nice touch.  Lunch for 6 was 150 bucks.  A tad over-priced, methinks, but it's well prepared and the service was great."}
{"text":"I went on a Tuesday and it was still pretty happening.  Had a Blueberry Mojito which was really delicious! I could've had three!!! Also ordered the Calamari which was really good. 3 people at my table ordered the Lobster Ravioli and we all loved it. One of us ordered the Chicken Club which looks ridiculously saucy and messy to eat. Another ordered the Fire Roasted Chicken entree which came out cold. We sent it back and they refired it, but came back with very little improvement. However, they took care of the chicken on the bill without our asking so we were pretty pleased.  Overall the service was pretty good. I noticed that all the waitresses are brunettes wiith jiggly titties -- not complaining, but duely noted!"}
{"text":"I went there last week for my boyfriend's birthday. It was my first time. I really enjoyed their atmosphere and pleasant service. The place was busy but they accommodated as right away.  I had mushroom soup and salad with chicken. It was really good. The salad was fresh and dressing was \"homemade\", which I really liked. I think all the restaurants should make food from scratch. My boyfriend had steak and sushi. He said that steak was great but sushi was a bit different (I think they had some crab meat inside). The portions are different depending on what you order. It was good for me but steak and sushi was a bit small, particularly for a guy. I think they should add some fries or salad to it.   This place has a nice decor and atmosphere so I would recommend this place for any occasion."}
{"text":"I forget how many times I've been to this Joey location. At least 10 times since it opened back in 2010.    I've tried: Lobster Grilled Cheese Baja Fish Tacos Seafood Linguine Panang Prawn Curry Bowl Blackened Basa Yam Fries Pesto Shrimp Flatbread....   ok, so basically I love this location. Service is top-notch and consistent.   P.S. If you're booking a big group, they will NOT take reservations until 9 or 9:30pm (I have tried to for my birthday and reserved for 9:30). That said, I've celebrated 2 birthdays here and I loved the Molten Lava Cake!! Some of the prices are a bit overpriced but then again, you're paying for the ambiance. My next goal is to get a patio seat, there's always a 2 hour wait in the summer.  Anyway, I recommend it. All the things I've tried are great! :)"}
{"text":"I'm a BIG fan of Joey's: It's a great chain restaurant that really caters to various moods and cuisines. The atmosphere has the perfect combo of adulty-lougy feel, but is also a great place for casual get-togethers and big group dinners.  My two fave locations are the one's at Yorkdale and Shops on Don Mills (but I have never had a bad experience at the one by Eaton Center...except it's always very busy).  Tonight was a dinner before a movie so went to Joey's fairly early. By the way, you can now make online resos? One star just for that!  For appetizers, the must orders are def the Gyoza and Fried Cauliflower which tastes like lovely pieces of meat. The sirloin for the main actually was good! Medium rare came out medium rare and the table ordered a side of mushrooms, which although a tad bit salty, went really well with the main.  My only complaint tonight was when my dad and I first arrived, no one came to take our drink orders for 12 minutes, which is really too long. Then finally, a girl came, quite curtly, to take our drink orders. But soon after, a new waitress came and she was all smiles and bubbles, so most likely, our initial waitress was on her final shift-minutes.  Overall, can't go wrong with Joey's."}
{"text":"Joey's at Don Mills don't have to give a crap what we yelpers think of them because they are killing the restaurant industry. I really mean that, they're always busy.  The food is good for the price point and the atmosphere is akin to chains like Moxies, Milestones, etc but with televisions playing sports all over the place. Upscale sports bar I guess. The food is well presented, well cooked and certainly fresh enough. The servers where we were were all pretty women.   We called the day before to make reservations for a Thursday evening and were told we'd need to call about a week in advance to get a table but that they have wait list you can get your name on. We decided to risk it which meant getting on their wait list on our way over through their website. We managed to get a table in the bar without too much of a wait.  I had the \"Beach Salad\". Delicious and a nice big size too.  Anyway, if you're looking for reasonably priced food in an upscale sports bar, this is your place. Good luck getting a reservation."}
{"text":"The patio during the summer is spectacular, the food is always solid here, however it has lost a bit of its flair.  It needs a brand uplift, perhaps a new Reno, and some new faces.  Can be a bit pricey, often the food experience does not match the dollars spent.  Give it a try and see, maybe it's for you.  Cheers"}
{"text":"Great atmosphere, brought a friend visiting from out of town to see the shoppes on Don Mills area and eat some good food with a great ambiance.   Pros: - nice area to walk around afterwards - tasty food - see pictures - great ambiance and decor, including a patio on roof for when weather allows. I've brought friends, family, as well as business people here.   Cons: - gets quite crowded, which is why some people probably said service wasn't good. Expect to wait in the evenings if you don't have reservations - pricey option (especially for drinks) , but you pay for the ambiance... Our total cost was $88 after taxes for two people, including one appetizer, two meals, and two beers each.   About area (Shoppes on Don Mills): pretty upscale Plaza with an outdoor open public space square where events and music is sometimes hosted and allows you to walk around, shop, or just sit and enjoy a Gelato or coffee and people watch."}
{"text":"Packed at lunchtime on a Friday. Sat at the bar.  Service was quick and friendly.  Bartender introduced herself and said \"nice to meet you\", top notch.   I had lobster grilled cheese and yam fries.  Quite possibly the greatest grilled cheese ever. Fries were so so. Lemon truffle aiole and cocktail sauce were from a bottle.....meh.  When will you Canadians understand you must BREW tea for iced tea. Lipton and Nestea from a tap is not, repeat NOT iced tea.  This is a great place. All female staff dressed in \"LBD\"s. Men are dressed trendy/bus/cas. I recommend."}
{"text":"Had lunch here a few weeks ago.  Food (4.5/5) - Baja fish tacos - Lobster grilled cheese sandwich - Caesar salad - Fairy Tale Service (4.5/5) Price (4/5) Ambiance (4/5)"}
{"text":"We visited JOEY Shops at Don Mills because we've always heard good things about the place and never had a chance to try it out. We were in the area, so decided to finally give it a try. Ambiance was great, modern and sophisticated. Staff were great, attentive and quick - had our waters refills multiple times without having to ask, and service was quick although it wasn't too busy as the restaurant had just opened.  We were quite surprised that the menu was not as big as we thought it would be - the selection was limited. We decided to share the chicken lettuce wraps, which were amazing - 5/5 for flavour and presentation. I opted for the chicken Parmesan as there wasn't anything else that appealed to me; it was nothing special. The chicken was a bit soggy as it was placed under the pasta. My fiancé ordered the seafood paella and enjoyed it quite a bit.  Overall, the food was mediocre for the price. Although we enjoyed the chicken lettuce wraps, it doesn't warrant a second visit to JOEY."}
{"text":"Excellent food, service and beautiful decor! I have many food allergies and our server took the time to double check the items I could eat, and make changes if needed! Food was delicious and couldn't have asked for better service. We highly recommend it!"}
{"text":"I'm going to keep this review uncharacteristically short and sweet as my stay was just that. Short and Sweet.   I'd say this is a great place to watch the game with the fellas or go on a date. The bar side is lively and animated. I don't know what my friends were talking about Joey's doesn't have scantily clad waitresses (bummer) they were actually quite striking while remaining well put together and classily dressed.   I was just hear for a couple of drinks last week with a friend and didn't get the whole Joey's experience. They did have a premium selection of Vodkas (many options) as well as a healthy draft beer selection. I was even more so impressed by their fair assortment of craft beers. I dove into 2 pints of Muskoka and finished them off quickly as they came.   One flag for management would be to ensure your servers are attentive to even those patrons only having a drink. We went dry twice and there was no server around to top us off - lost funds for you guys. Also our servers lack of service led to another missed opportunity when we were looking to order grub.   Decore and menu seemed impressive enough for me to return at which point ill update my review and see which way it swings. 3 star for now, not unimpressed or impressed. I reserve final judgement. Food did look yummy though :)  17/30"}
{"text":"Had the chance to give this another try. The steak was definitely better than the first time I had it. It was a better experience overall, including the crispy mashed potato this time.  But I'm still not sold on the steak unfortunately. I've had more flavourful sirloin at cheaper prices that don't claim to be top 2% of meat."}
{"text":"JOEY has a large capacity but is almost always full. It is a hot spot for young people with a chill, trendy environment. The food is also surprisingly good. I had the rotisserie chicken and while it was slightly overcooked, it was still flavourful and delicious. I will definitely return to JOEY in the future."}
{"text":"I just had dinner there with my family and was terribly disappointed with the food; all of us were actually.  My brother and I had the Cab Steak (apparently their most flavourful one) and the irony is that it had absolutely no taste (and it wasn't even warm).  For a minute I thought I was eating at Shoeless Joe's or Casey's.  Never in my life have I not wanted to finish a steak before, until this evening.  I did finish it, however, as I don't like to waste meat, and I was hungry.  The potatoes were equally bland.  I guess the attractive waitresses are there to distract patrons from how poor the food is?  Our original server didn't even know anything about the menu (which is unacceptable, considering how small it is).  This dining experience left a really bad taste in my mouth; in more ways that one.  I definitely won't be coming back."}
{"text":"Had a great experience at Joey's - shops at Don Mills location. The atmosphere, service and food were all great. I was going with 3.5 stars but a ridiculously good Apple pie easily pushed the rating up to 4 stars (apple pie gets 6 stars).   Walked in and was greeted immediately by the hostess. I didn't have reservations but was seated immediately. Our drink orders were taken quickly, followed by our food orders. We were asked multiple times if everything was to our liking. My beer was filled every time I could see the bottom of the glass (for those who know me - that's important). I didn't expect this level of service for a \"chain\".  Food was good. We started with the Spinach & Artichoke dip - one of the best ever but was a little runny (but no impact on taste). I had the Peppercorn new york steak. Steak was average but served with a killer brandy and cream reduction which more than made up for it. It was served with a spring roll that was  stuffed with mashed potato. It sounds odd but was delicious. My dinning companion had the lobster ravioli which was just OK in my opinion. And I can't forget - homemade apple pie to die for.   The drink menu was average in my view. A few decent beer selections but mostly standards. Was not a big fan off the Muskoka Mad Tom IPA but enjoyed the Mill Street Tankhouse Amber ale. They had about 10-12 beers on tap. The cocktail special was Bellini's for $4.50 that night.       The restaurant looks great, nice clean modern look. Lights are dimmed, a great date place. Prices were not unreasonable but slightly above average. My steak at $36 was a bit high given the quality. Drink prices were rather good. Getting to the washroom feels like climbing Mount Everest after a few beers.   I will be back for sure. Although the food gets 3 stars, the service, atmosphere and  apple pie push my overall rating to four stars. I was there on a Monday so curious to see if the service holds on a busy Thursday-Saturday night.    On an odd note, I was flanked by two separate mid-40 year old couples making out at their tables. What's up with that?  BK"}
{"text":"Joey is a great place to take a friend out to dinner or just come for a quick drink around the bar.  The service is pretty decent and they are open late.  I usually come here for dessert, since everything else at Shops at Don Mills closes at around 10pm.    It's hard to get a seat here during peak times, bt it's expected.  When it's nice out and summer is in full swing I would say finding a seat is impossible without reservations.  Parking is another real pain as you'll need to park around the grocery store or other side shops as there is only 3-4 spots dedicated to Joey guests out front.  Food here is average and comparable to Jack Asters or Moxies.  The desserts are also not top notch, but they get the job done.  The doughnuts and cakes are good.  The lemon pie, not so much.    Overall I just really come here when nothing else is open.  Otherwise I would be grabbing some gelato or desserts at the cafe nearby.  It's convenient because they are always open late."}
{"text":"Such a great atmosphere. The food and the service were pretty good. I was here with friends for drinks so I can't speak too much about the menu, but Joey's offers a great range of dishes. Highly recommended if you're looking for a place to hang out for a little while."}
{"text":"This is a very typical, safe, but boring with very predictable food menu, quality and service. It is like watching a very average movie again. I would perhaps pick this as a place to have business meetings, but nothing more."}
{"text":"I love coming here in the summertime. It's a nice area to walk around. Joey's always has a wait when I come so I make sure to go during a time when the stores are still open so you can pass the time. There are coffee shops around so that helps too. They will take your name and number to call you. If you can get a spot upstairs on the patio, go for it. It's a lot less noisy. If you do wait inside and it takes awhile, they usually offer wine or apps, which is a nice touch. My must favourite thing to get here is the crispy mashed potatoes. It's mashed potatoes inside a spring roll covered with sour cream and cheese (and bacon but I don't eat pork, so I get it without it). It's just a side accompaniment. Their tandoori chicken flatbread is so flavorful. I've had their chicken Alfredo but there's something about the taste I'm not a total fan of. The chili chicken is a great app too, and you can eat it with the wonton chips they provide. I've never had any issues with the service. Great place to check out!"}
{"text":"Very good quality food and nice ambience. This is a great place to bring a date. The price point is a bit high but the quality matches the cost. They make a roast chicken meal that costs $22(!!) but it will be the best roast chicken you've ever had and the portions are quite large. This isn't Swiss Chalet, it's the good stuff. The menu is quite varied and there are lots of good selections but some are just okay, so ask your waiter for recommendations."}
{"text":"I would honestly give this a 5 star rating, but it's quite far from Mississauga and Toronto. Located in the North York/Scarborough border, it's a very posh and upcoming shopping area. It kind of reminds me of the outdoor shopping areas in California. It's actually nice this winter. There's an outdoor skating rink in the main middle area of the shopping area.  Let's talk about the food. The best way I describe this resto to people, \"It's a mix of Japanese, Mexican, Indian, Thai, Chinese and American foods.\"  I've been there too many times. So much that I've pretty much had most of the items on the menu. Ahi Tuna Tacos, Crabmeat Tacos, Chinatown Lettuce Wraps, Calamari, Ginger Beef, Blazing Wings, Spicy Italian Flatbread, Simple Green Salad, Ahi Tuna Club, Lobster Grilled Cheese, Baja Fish Tacos, Bacon Cheddar Burger, Bombay Butter Chicken, BBQ Ribs, Molten Lava Chocolate Soufflé and the Baked Apple Pie. I have never left there unhappy.   I HIGHLY RECOMMEND... - Crabmeat Tacos (but ask for the green wasabi lime dip) - Ginger Beef - Garlic Bread - Baja Fish Tacos (comes with three tacos) - Lobster Grilled Cheese Sandwich (very buttery)"}
{"text":"Ate there last night.  Had to wait extra time as my reservation was bumped so as to accomadate a larger party!  Both the food and the service was horrible.  Staff responded very rudely when told that food was served cold.  Would never recommend this place to my worst enemy!"}
{"text":"This is really a 3.5 star rating. Joey would get a 4 star, but they only have 3 items on their dessert menu. WHAT THE EFF???! Everyone knows dessert is the most important part of a meal aside from the alcohol!   I'm a Joey regular. I come here almost once a week. Location is perfect for my friends because we live spread out across GTA, from Etobicoke to Whitby and all the cities in between.  The service is unbelievable. The 1st time I set foot in Joey's I was greeted with a free sample of their house red wine. Which then proceeded with 3 more free drink samples during my visit (beer, bellini and another wine).   My 2nd visit, the waitress kindly gave us 1 of our appys for free AFTER she gave us the bill. She didn't have to do that. But when she came back after receiving payment, she told us she removed 1 of the appetizers because she was so happy we were promoting their restaurant to all our friends. And that shaved off $10 from our original bill.  Yes, Joey is a west coast chain, but I enjoy the food here. Their menu items aren't the typical items you see at chains plus they are tasty and satisfying. The items I often devour are:  - ahi tuna tacos - California crab tacos - lobster grilled cheese - baja fish tacos - ahi tuna sandwich - lobster ravioli - (side) mash potato spring rolls with the works  A tip to the boys, all the waitresses and hostesses are HAWT!!! So there's lots of eye candy for you!"}
{"text":"We had a very nice early dinner at Joey Don Mills. Having never been before, we didn't know what to expect, save for the Yelp reviews, many of which are pretty harsh. Well, as we all know, bad food and bad service are often random occurrences, and very unfortunate.   Fortunate for us, we had a very good meal. Two of us had steaks, the others had a few different appetizers. The steaks were cooked to perfection, and were on the hole, pretty good. The other appetizers we had along with the sides were also tasty. The mashed potato packed into a spring roll wrap was a new take on this old staple, and really quite good.   Service was spotty at first, but our server was replaced and all was good after that. Honestly, if you don't know how many sliders (and the sliders were really good) are on a plate, you shouldn't be on the floor serving. It's not a huge menu - take a few minutes and learn it. And, maybe some proper training is in order. We had to ask for details on the size of the steaks, after we overheard a server at another table providing full disclosure. (BTW, it's inappropriate to position your restaurant as having a great selection of steaks, and not to list the weight of the steaks on the menu - bad form, and of course, our first server didn't know).  Drinks were very nice - we had a few cocktails as well as a couple of whiskys. Again, BTW, whisky is a category with subcategories. It's not appropriate to sneak in a Canadian whisky without saying what it is. Again, bad form. You need to state if it's bourbon, scotch, Canadian whisky or Irish.  All in all, the food was very good, service turned around and finished well. We're looking forward to the opening of the Sherway Gardens location."}
{"text":"I appreciate the atmosphere Joey brings, I especially like this location because of their patio upstairs entirely made up of window. You get lots of light. The service is good most times I come here. The food is great and the helping size is good. This is my favourite location to visit, I always get the steak and sushi and I love the sushi cones as well"}
{"text":"This place was surprisingly good. Shouldn't have judged in the first place, but I thought it was going to be one of those mall restaurant type of deal.  Came here with a friend for drinks on a Tuesday night, ordered the drink special - Bellini, which was very good. We ordered the Baja Fish Taco and Embarcadero Salad for our meal, both were made fresh and delicious.  Our server was very friendly and knowledgeable, she looked liked she really enjoyed working there, which is always nice to see.  Next week, going to come here on Wednesday for the Long Island Ice Tea Slush Special. Can't wait!"}
{"text":"so many ppl rave about how the food is good here but really its nothing special.  I would say its the same thing if you go to moxie's for a meal. The spinach and artichoke dip was pretty good. Had an entree salad the 500 with chicken and it was actually really filling and presentation was nice (though it was lacking on the chicken).  Ended with the Italian donuts and it was nothing great, though the vanilla mascarpone cream it came with was yummy!"}
{"text":"Had dinner last night and lunch today.  (Adventurous, I know-work deal).  Food was good, with an interesting menu and nice wine selection.  I'm giving it 4 stars for mostly the decor and atmosphere.  For even a Monday night the vibe was fun and lively.  And yes, the staff is attractive day and night.   Love the humor in the drink menu.  Kept us entertained while we waited for our waitress Megan.  In all fairness, she was the only one in our section so that could explain the lengthy time between visits. For dinner I just had lettuce wraps and dumplings, both appetizers.  Both were good, if not original.  Today at lunch had the lobster grilled cheese.  Loved it.  Decadent and rich, just as I expected.  Good thing the portions of this were small. I liked it and will be back."}
{"text":"Look, I've never been here before but a friend was celebrating her farewell party with 10 work friends so I just dropped in for 2 beers.  The place was very crowded, music blasting away, lots of tv screens showing Olympics, and staff scurrying about.  Finally decided to get my own drinks at the bar after waiting 15+ minutes and not see the server for the group.  Wow, bottled Coors Light for how much?  Service was not great for me, nice place...but I've paid these alcohol prices for places that have a brass pole installed...if you get my drift!  Don't see myself dropping in again if I don't have to."}
{"text":"Had high expectations for Joey's and the one at Don Mills.  While staff intiallly appeared attentive, it seemed to be more schmooze than an actuald desire to do a good job.  Starters were ordered and received in good time.  No 'plates' were provided or extra napkins.  Had to request both items.  The server brought 2 napkins for a party of 4?  Is that a big deal, in the grand scheme no, but it was not busy and the lack of attention was dire.  On the food side it was mediocre at best.  The chicken lettuce wraps were however excellent.   This is not intended to be negative, but it really was not worth the hype sadly.  I have had much better service AND food at less expensive restaurants."}
{"text":"We dined at this location for the first time for a dinner with my family and it was quite a pleasant experience.  Restaurant had a bustling dinner crowd.  We luckily scored a table as a few of us had arrived early for our reservation and wanted to hang out beforehand; our small table then combined with another to make our group table for dinner, nice transition for us.  Drinks menu had a good variety; I was able to go for a soda, being pregnant.  We were promptly tended to; orders for our apps and entrees were quickly filled and served.  My first choice for entree had unfortunately sold out so opted for another instead.  Overall, loved the ambiance of the restaurant; drawing the blinds really added nice natural evening lighting."}
{"text":"1 + hour wait  - UGH  RUDE hostesses who really don't know how to smile or anything about service in general - UGH  Waitress - Erin - made up for it with her great service  Oh ya the food....it was great - I had the lobster grilled cheese and a bellini....YUM 10/10 for that...  But the rude ladies at the front...gotta go...you are seating people...and jotting down names...so take the attitude down a few notches..."}
{"text":"Sometimes I go into a restaurant with a bad attitude that its going to be a wretched experience. Joeys had the feel walking up it was going to be snobby posh place with gut wrenching food. I love being surprised! As soon as I walked in I was greeted warmly by the host. It seems that they try to hire only attractive people at this place, which is probably one of their competitive advantages. We went upstairs to their lovely rooftop bar areas. Its a huge area where it could be a restaurant all by itself with its vast room. Drinks were served quickly with their beer selection being above par. I also love it when places serve beer in the companies beer glass. Our appetizers were tasty having the goat cheese dip and the calamari. The calamari also had some fried asparagus and onions rings hidden in. The chips for the goat cheese dip came in a fryer basket which was a lovely touch. They put time into putting nice touches and excellent presentation into their food. Our waitress always made sure our drinks were full and was always promptly at our attention. She even warned us when a large group came in that she might be a little behind and asked us if we thought we would need anything soon. Nice job! Overall a great spot to go and a beautiful patio. I will be back if I can.   Pros  Good Food  Great Service  Fair Prices  Good Beer  Cons  None"}
{"text":"Love the atmosphere here. Their rooftop patio is a must in the summer. Decent food & presentation. Come for their happy hr for their awesome drinks! Great area for a bit of shopping and then dining!"}
{"text":"Any place that has Somersby cider already gains brownie points in my book.   Started off with the meat and cheese platter. Bread was sliced and each slice was the size of my finger (skinny and short btw). Two types of cheese, salami and prosciutto and a few scattered pecans and olives with plum preserves. I could make this at home, you r better off going to Bier Markt rather than paying 17$ for a few slices of mediocre cheese and meat. As T.I raps, I don't want no mediocre!   Got the lobster grilled cheese while bf got the Baja fish tacos.  The grilled cheese was not that great as everyone on yelp hyped it up to be. Couldn't taste the lobster at all, just the cheddar. It had a nice crisp to the bread, other than that nothing special. If you want a good grilled cheese, go to Turtle Jack for their bison meatloaf grilled cheese, the best ever!  The fish taco however was pretty good. The yam fries are good, similar to Jack Astor but JA has better dipping sauce.   All in all, it was okay. Presentation was fancy, ambiance was nice. You are paying to feel like you are dining somewhere hip and rich.  Better off going to the Keg where the food is always amazing."}
{"text":"Went at about noon-ish on a weekday.. Service was extremely slow, but the burgers were amazing! I wouldn't order any of the asian dishes or the seafood those were alright."}
{"text":"Solid service. Large beer menu. Debatably slightly overpriced, but the upstairs patio really is quite amazing and nice to sit somewhere and not hear a hundred cars quizzing by. Chicken ceasar was great."}
{"text":"I think ive quite had it with Joey. I used to love this place and recommend it everywhere ..  They keep taking everything good off the menu and the quality is just getting very shit tbh.   I went a couple weeks ago for some drinks on a sat night..  Saw the happy hour whatever menu, im like ouu!  So i ordered steak and sushi and sangria off of it..   DO NOT order off of happy hour.  So, because its a bit cheaper, they dont give u the proper rainbow roll as a steak and sushi normally comes with.  Comes with just chunks of rice with Cooked tuna or some shit in it. Horrible.  Steak was dry and crap too. When i asked , she goes yea its because its from the happy hour menu..   ???  So why dont you mention that youre going to give me a plate of shit because youve made it a 'special' like 5 bucks cheaper? I wouldve gotten something else proper for 23 plus tax ..  sangria off the happy hour menu also.. just fkn juice .    Done with Joeys. Nothing left to enjoy"}
{"text":"Went there for the 3rd time this week.  First two times was excellent.  The server was super nice and friendly and the food was delicious  (had the ahi tuna taco and key lime pie).  Had a great time!!!  This 3 star rating is for my experience at Joey's last night.   Went there with my friends for their anniversary.  First we were told that the ahi tuna salad were all out.  So we asked wether is just the ahi tuna salad that's out or every ahi tuna dish.  We were told that it's all ahi tuna dish.  Which was fine, so we were going to order something else.   Then our waitress came back to tell us that they can make the ahi tuna club for us (Great! Less thinking for me). When the food finally came, the ahi tuna burger came watery and soggy and completely cooked.   My friend's had a really fishy piece too (they shouldn't taste fishy if the tuna is fresh).  So we just told our server about it and her response was \"yea, that's how it's suppose to be when it's pan seared\".  I told her that's not how a fresh pan seared tuna should taste like- since I'm a pescetarian.  Maybe she got angry about that and we never saw our her again that evening.  Please know that we know what we're talking out when we tell you there's something wrong with our food, it's not our first time eating out :)   Anyways, manager came over, super friendly.  Offered to cook us a new plate or pick something else (Thank you!!!).  He wants to make sure we're having a good time (which we always do at Joey's).  So overall, it was a good evening."}
{"text":"Joey brands itself as a trendy restaurant. They have attractive wait staff and it's a see and be seen crowd. Even the food plating is done to be instagrammed. The price is okay. Their business is driven by volume of big parties out for a social event and for the drinks. The menu is mainstream. The food is okay but nothing special. It is good looking food with good looking people in good looking clothes out for a good time. That was me in my 20s and early 30s but now I just want good food without the show."}
{"text":"Love the food...i had the sushi and stake which was very delicious and well designed ...the waitress however was a bit rude"}
{"text":"If you didn't get my ZZ-top reference in regards to the legs, you 1) haven't been to Joey's 2) arn't a child of the 80s.  I almost feel badly for the girls as they're in little black skirts with heels all day.  They're all smiles when they're taking your order, but their faces say other wise when they're moving between tables and the kitchen.  They also remind me a bit of the old Robert Palmer video, and yes I am addicted to Love.  I'll tell you what else I'm addicted to.  The Mashed Potato deepfried in an Egg Roll wrap.  Genius!  This was the signature creation of Chef Chris Mills when he went to to Japan to be on Iron Chef.  I had the steak that accompanied that mash.  It was cooked to a proper medium rare, but a bit flavourless and under seasoned.  I also caved in and got the berry peach Bellini which was very tasty.    Overall I was very satisfied, but nothing about this place makes me fall in love with it.  The service is good, the decor is nice, the food is decent, and the grade \"A\" Alberta beef is nice (and I'm not talking about the steak).  But there's just no spark.  Joey Don Mills will be a good friend, but she'll never be my lover.  Okay.. maybe a few one night stands here or there."}
{"text":"I was sooo glad to have the chance to come back and eat here again!  We ate in the dinning area, nice booth in the back. Service was decent, except they forgot about the yam fries, but ended up brining them out after.  We ordered the Tandoori flatbread. OMGGGGG SO AMAZING. We actually ordered 2!  We also ordered a mushroom burger with yam fries. Burger was alright. fries on the other hand were amazing!  It was actually my bday weekend, the server was told about it and brought out the dessert we ordered ( MOLTEN LAVA CAKE, TO DIE FOR) with happy bday on it.   Over all great!"}
{"text":"So I think I just have horrible luck here. (For this visit, I brought my girlfriend with me instead, who didn't believe me at first.. ).   If you read my previous post, you would know I mentioned my first two experiences wasn't so great. Finally, my third visit. Service was awesome but the kitchen messes up. My medium rare steak was over cooked (even the second time around wasn't much better... ) AND we found hair in our chili chicken appetizer. \"Yummy.... \"   Overall, seems to be very inconsistent here. Really, I would only give them two stars... BUT.. I'll give them the extra star for their effort ~ They did try really hard to get it right."}
{"text":"Aj is the coolest  Sat at the bar solo and enjoy some local beers and a nice chat with her. Going back to check out the rooftop patio soon"}
{"text":"Joey Don Mills Location: 15 O'Neill Road, Toronto, ON, Canada Access: TTC Bus, Free Parking Available Price: $35-$50 per person Blogsters' Rating: 2.5/5    Went to Joey Restaurant with my girls at Shops on Don Mills last Friday. The whole place was packed before 7pm (probably due to the Happy Hour promotion that they have from 3pm-6pm). Luckily, we got a table near the window. The restaurant was nice and cozy, and the table we got is probably at one of the best spots in the restaurant. You can see all the TVs playing different sports channels at the bar area, yet you can also see all the commotions happening outside the restaurant.   Yam Fries | Grated grana paddano, truffle lemon aioli | We started off our night with yam fries. I like it very much as it is crispy on the outside and soft on the inside. The truffle lemon aioli brings out the sweetness of the yam even more. I found myself keep munching on them, as they are very light, much lighter than potato fries.    Sashimi Tuna | Seared rare, mango, peanut, avocado, crispy noodles, cilantro ginger dressing | I was not impressed with this dish. Both the sashimi tuna and the green salad do not look fresh. The taste was average, nothing extra ordinary. You can definitely get something similar with fraction of the price at some other restaurant.    Hand-Pressed Burger | All the groceries, certified angus Beef | The burger was huge, it also came with a large amount of skinny potato fries on the side. I wasn't able to finish it. The patty was very juice. You can certainly taste that it is angus beef. Mushroom cheddar or cheddar bacon also be added on for extra cost.    Molten Chocolate Cake | Fresh raspberries, Tahitian vanilla ice cream | The lava cake is the best dish of the night. It was baked perfectly. As soon as you break the outside of the cake, the liquid chocolate comes oozing out. The raspberries sauce also balanced out the sweetness of the chocolate. It was amazing.  The only problem we have that night was the amount of times we have been interrupted by our waitress. She will come by every 15-20 minutes or so, to check upon us. I  know this is part of her job, however it was to the point where we felt like she's trying to take the food away from us and kick us out of the restaurant. I'm not sure if I'll come back to Joey, as their price is on the higher end and the food was not exceptionally good.  xoxo Janet"}
{"text":"Nice venue and excellent service but the food is no better than average and at fine dining prices it seems like a rip off....i have never been to a restaurant anywhere in the world that makes their sushi rice with cheap white vinegar, which makes me very suspicious about the ingredients in all their other dishes!"}
{"text":"Booked a birthday party for 13,  we had 2 waitresses assigned to our table, they clearly didn't communicate with each other.  You would think the drinks would be made fresh when i saw the bartender pour my long island iced tea out of a lcbo premixed bottle I asked the waitress are your drinks fresh to which she confirmed most are premixed.  Few of the guests asked for refills for water after 3 tries finally came.  Our bills were all screwed up and I was told because people moved but really one person traded spots, how does that suffice for the rest of the people? Had high exportation's of this location being at Shops @ Don Mills, POOR."}
{"text":"Worst service ever!!! Pretentious crowd...typical of this shopping arcade but the waitresses are too busy flirting with each table to increase tips that they forget they have more the one table to serve.  Food is mediocre at best but I will never return to this location because of service.  I live downtown and will stick to my eaton centre location."}
{"text":"First time here, We came here to eat and drink. Its quite spacious. Comfy chairs. Wonderful and friendly service. Music is a bit loud though. I asked the waiter if anything here is vegan and he pointed out to a vegetarian section and he informed me that anything there can be veganized. I ordered the veggie burger and when it arrived I noticed that the buns were replaced with lettuce leaves. I asked the waiter regarding that and he informed me that their burger buns are not vegan. It didn't look so appealing to me at first (picture below) and honestly I was too hungry to send it back so I gave it a try. It was delicious! Surely tasted better than it looked. The lettuce was crispy and the patty was flavourful. There was a perfect avocado inside that added even more flavour.   Overall I liked this place. Its perfect for meeting friends. Next time I'm trying something else in their veggie menu."}
{"text":"I went here about a month ago, only recently made a Yelp account. Thoroughly enjoyed my experience here, will be returning."}
{"text":"I absolutely love this restaurant. First time was at Motreal, extremely thrilled to see one here in Toronto. Love the food variety and the quality is superb. My personal favorites are as follows: Sushi wraps, sliders, fish tacos and molten chocolate cake. In addition, service is good and fast. Hope you get to go and try it out. Enjoy"}
{"text":"Crowded on Friday night, had to wait 45 minutes, but the free drinks and appetizers were a a very nice touch!    Valet parking is a must, as this area has few spots outside the parkade.  We were disppointed with some of the food, it was far-too-greasy.  At the end I had a stomach ache.  The dishes do not have a balance to them, they are heavy, full of fat and lack depth of taste and interest.    Did not like: Spicy Chicken appetizer (reminded me of chicken wings ,no more no less) , Lobster Grilled Cheese Sandwhich (grease fest, heart attack on a plate),  Tandoori Chicken Flatbread (tasty on first bite, but boring afterwards).  The Malaysian Shrimp was decent.  The atmosphere and service were very good.  There were ample staff and all very attentive.    It's too bad the food was not better, we were truly expecting better as we heard good things about this place.  Do not bring a date here, you will feel too full and sloth like afterwards.  Good for:  -after work meet for drinks with friends -drinks , greasy snacks, watching sports -higher end sports bar -people that don't get out much and just want grease  Bad for: -food lovers -picky eaters -lovers of good food that the GTA has to offer"}
{"text":"We went here for my birthday last week...it was a fantastic experience! I was surprised by how busy it was on a Tuesday night - but that gave me some confidence that we were at a good restaurant. I had looked up the menu before hand and it definitely sounded right up my alley - and I was NOT disappointed! The food was delicious - I loved the Ahi Tuna Tacos and the Fried Chili Cauliflower!  The service was actually fantastic too - our server was very polite, and food was very prompt! Super impressed. And they even made me a little happy birthday dessert :) Which by the way, if you are looking for a decadent dark chocolate dessert, you HAVE to order their soufflé...best dessert I've had in a long time!  Will definitely be back again sometime!"}
{"text":"I loved this restaurant as I did with my previous experience at Joey Eaton centre but there were some aspects that were lacking. Service was great as usual, when we requested a different table under a heated area we were promptly moved (it was strangely cold for an august night) however we were charged for a birthday cake when most restaurants don't charge for birthday cakes which was a little bit disappointing. I wasn't told that we'd be charged. Besides that, everything was delicious, and the drinks were great as usual. We had a really lovely shiraz with some chicken fettuccine Alfredo and a garden salad and yam fries on the side. Everything was fresh and wonderful, we really enjoyed it. Will definitely not be swayed from returning next time as the food and drinks and overall vibe of this place is hard to beat!"}
{"text":"Busy, but great place for a group dinner. With great amount of space, great decor and the noise generated by the bustling the many television sets and patrons there, I first visited this restaurant with a group of my college classmate's friends and cousins back in the spring of 2011. Located in a busy open air commercial plaza, the food and drink at the restaurant was the right touch for a great night with friends.  Traditional fare such as burgers, salads, pastas, and pizza are found here and the place is ideal for large group dinners.  Highly recommended for those wanting a great night on the town at a non-chain restaurant such as Milestones. JOEY definitely delivers."}
{"text":"Wow...where to start.  I don't even know why we chose to go to Joey's on Shops at Donmills. It's...  - busy - the female staff look like they're trying way too hard...  - very judgemental tones from all the staff/waiters   Plus... I got food poisoning from their steak sandwich. I don't even know why I ate it. Just looking at it looked gross. It was dry and it came with a dipping sauce/soup. I'll never have that again. I didn't call the location but I wish I did. I couldn't be bothered because I was sick for a whole week. I knew it came from this because the meat didn't look 100% .   Terrible experience. I won't be coming here again.  Peace out."}
{"text":"Don't order the crispy mashed potatoes because it sucks ass. It's basically flavourless mashed potatoes inside of a rolled wonton wrapper. They drizzle sour cream, garnish with measly pieces of bacon, and a few shreds of cheddar, but overall it sucked. I had the steak and sushi (rainbow roll) and it wasn't that bad. By no means is the steak worthy of praise, and it was just 'arite'.  The calamari (Calamari Fritti as they call it..lol) was over cooked and the pieces were measly. What a disappointment. The Japanese Gyoza (pork dumplings), meh...could care less. The tandoori chicken flatbread, was ookay, but nothing special. It's pretty small for a $15 appetizer. Believe it or not, the only thing I really enjoyed was the lettuce wraps LOL. But for $14(+$3 for shrimp)...come on now."}
{"text":"The food use to be a LOT better. They started being really stingy with the portions and they got rid of their best salad on the menu! The beach salad is gone!!! They replaced it with some disgusting rotisserie chicken salad. Not tasty at all don't waste your money on this one. If they get rid of the ahi tuna salad there really is no reason to eat here since everything else seems to be on the downgrade at Joeys anyway."}
{"text":"Pretty good food and good atmosphere. Definitely loud so it makes it hard to have a conversation but all in all a nice night out. I had the ahi tuna club which was delicious and my friends got the blue cheese sirloin and the lobester grilled cheese. Everything was delicious minus the grilled cheese which had a weird funky taste. On Tuesdays they have the super sonic gin and tonic on special which is amazing. Our server was good too we will return!"}
{"text":"The best JOEY location! I've been to the other ones many times, eatons, markville, yorkdale, but I find the food here tastes the best. It all depends on the chef in the kitchen I suppose.   JOEY I my fave chain restaurent, the salads are huge and delicious! The steak & sushi entree is best of both worlds. The apps are amazing! Especially the sweet potato fries.   The blueberry mojito is a must have drink! However they sometimes don't have blueberries but will be able to sub other fruits in there.   The valet parking is a great convenience also!"}
{"text":"Visited for a lunchtime during a Wednesday afternoon and we were seated without a wait. Within minutes someone can to take our drink order. There were lots of lunch options on the menu.  I had a bbq salmon rice bowl with veggies and it was very healthy and yummy. The perfect portion size.  I would definitely recommend if you like salmon.  Price was fair."}
{"text":"I always eat the same thing here - the full rack of ribs. Quite happy with it but recently the service was on the slow side even when it wasn't busy. Overall pleased though!"}
{"text":"Wonderful friendly staff and a great location  Looks great in the inside and the food is also particularly lovey   I won't go in to all the detail of my food on the visit as it was a salad and I'm Ashamed I got one .... However it was a very delightful salad indeed"}
{"text":"Always my go-to restaurant!! Joeys is the perfect restaurant if you don't want something too upscale or something very casual. It's the perfect middle ground. I normally order fried calamari at every restaurant I go to but, I honestly have to say that the calamari served here is the best one hands down.  Gyoza dumplings are also fabulous. Love the texture, sauce, and filling. Not too heavy or salty.  My other favourite dish is the BBQ salmon rice bowl. I would say to order an appetizer or something before this meal since I find the portion a bit too small. For dessert, the chocolate lava cake is a must! So rich and warm. It's the perfect bite after a meal. Also, their upstairs patio is very nice. One of my favourites."}
{"text":"Joey's is still my favourite restaurant.  I've been there a million times now and have tried I think everything on the menu. The food is always great, the waitresses are hot, great patio in the summer time. I really have no complaints for Joey's except for when they are really busy and you have to wait, but even then they treat you with complimentary appetizers and wine, and you are free to walk around and browse all of the stores in shops at Don Mills. So back to my original statement, I have no complaints for Joey's.  My favourites on the menu are....(I have a lot but I will try to list them in order)  Apps 1. Calarmari 2. Ahi Tuna Tacos or Shrimp Flatbread 3. Gyoza  Salads 1.The beach salad 2.Sashimi Tuna  Mains 1. Ahi Tuna Club or Lobster Grilled Cheese 2. Grilled Chicken Taglitelle  Desert 1. Apple Pie  Drinks 1. Super Sonic Gin and Tonic (Gin and tonic with Lemon/lime Slush)   Everything at Joey's is good, but these are my goto faves."}
{"text":"Joey's is a good place to hang-out for drinks and have overpriced meals.  The patio upstairs is perfect in the summer! There are lots of seatings, and the place could get crazy busy during peak lunch hours.  Even if you come during busy hours, service level doesn't change, servers are always friendly, and food's always been consistent.  I love their lobster grilled cheese. It's the food I always get!   Unfortunately they no longer sell Blueberry Mojitos :(  Review 70 of 100"}
{"text":"The food ofcourse is... phenomenal! It's Joey! The service at the Don Mills location, however is TERRIBLE. Every. Single. Time that I've been here, I've had to wait more than 30 minutes for the bill...we even have to wait more than 20 minutes to get a drink. This is after waiting a long time to get seated (which I don't mind if I'm showing up without a reso but jeeze seriously?!). They need to retrain their staff on how to be friendly & the meaning of customer service."}
{"text":"Went several times to this location  Food is great and the atmosphere even better  They have a rooftop patio that you can venture out on during the summer time  In front of the restaurant it can become a car show as the valet is just out front and some folks like to show off their rides  Food as usual is great  Big fan of their sliders and the tandoori chicken flatbread  Def a fav spot to hang out"}
{"text":"Never Again!! Girl's night Not welcome, this place favours the high turn over of first dates and business dinners I guess. The food & drink was good but I would have enjoyed it more if our server had actually brought us what we ordered. Lesson learned- stay there longer than two hours and you've overstayed your welcome \"No Soup For You\" or rather no dessert for me and my girls- no apologies gtfo. Even if you've purchased more alcohol than humanly necessary (and don't bother waiting to get water, you'll have to ask special...wtf?) Oh & then the best part; you'll get a special lesson on exactly how the tip works when you're spitting the bill...are u kidding me?! Yes thank you I know how tipping works...do you know how serving works?! Apparently NOT ;) thanks anyways Joeys. Byeeee"}
{"text":"Came here on Saturday for an Emergency Birthday Dinner!  We called earleir on in the day, and they told us they weren't taking reservs, so we had to line it up :)   Got there at 8pm, and the line was about 2 hours. We put our numbers down, and found the LCBO in the same area..   Anyways, 2 hours later.  We're seated in this cool round booth-ish contraption. Super comfy (even for me, and I'm huge yo)  For drinks, we all did the Sapporo special (5.99/16oz)  We ordered:  Appzzzzz 1. Calamari - Delcious! With deep fried Fennel and Asparagus and a yummy yummy dipping sauce! Two of my friends that night had never had the calamari before, and even they loved it!!! (4/5!)  2. The Chili Chicken - Deep fried chicken bits covered in a sweet chili sauce served with cucumbers and fried wontons - Also delicious! Thous the portion was a lot smaller than the calamari...it went fast.  3. Sushi Cone (Tempura Hand Roll?) - It was awesome! The rice was really flavour, the Prawn in it wsa huge and sexy. And it was wrapped in green rice paper rather than seaweed which made for a delicious alternative.  Dinner:  1. The Rotisserie Chicken : I had this, and subbed the rice for Fries. It was a ridiculously huge portion. I did not expect it to be this big. It came with Half a chicken + a huge portion of fries *that even I couldn't finish!* and some delicious grilled veggies. It was amazing. It's hands down been the first time I've ever had a roti. chicken breast that wasn't dried out max. I have faith in white people again.  2. The Lobster Grilled Cheese:  After reading the yelp reviews, I made my friend order this. It was amazing. But a tad salty.  The cocktail sauce was a pass for me though.   3. The beef dip - Just like a regular beef dip..but the jus was..immaculate.  4. The steaks - My friends got them well done, and I wasn't happy with them. WHO EATS A STEAK WELL DONE??? WHY ARE YOU MASSACRING THE NOMS LIKE THAT? But the sides were great (Loaded mash + veges)   Desert:   It was my friends birthday, so they gave us a chocolate souffle and wrote happy birthday on the plate with raspeberry sauce. The ice cream was fucking amazing.    4/5 (-1 for the crazy wait.)  But our server tells us that if you download the Joey app beforehand, you can put yourself on the waitlist before hand..."}
{"text":"One of the best places to eat at Shops at Don Mills.  Great place to hang out with friends while having dinner. Everything on the menu is great.  My favourite and absolute must have while there is the Deep Fried Mash on the side or with your steak. Its delicious!!!"}
{"text":"This place completely impressed me. Not only is it located within my new favourite destination, Shops @ Don Mills but it's got a great vibe and great service and most of all, it's got good food.   The decor is that of a typical new bar, dark wood, ambient lighting and modern. The bar is made out of the trunk of a tree that was probably 300 years old sliced vertically. They've got large booths that seat up to 6 adults which is pretty wicked since booths in any other place will seat max. 4 people.  The downside is that the bathrooms are located upstairs, the upside, there's an elevator or a really wicked lit staircase that leads you up to it, very cool when you've got a few cocktails in ya.  Every day there's a drink special, always a beer and a cocktail, something for him, something for her, awesome times all around! The drinks menu is a great read, there are some tips and tricks to having a great night out. Trust me, it's a hilarious little tidbit to add to your night out.  The drinks menu is vast and full of delectably, delicious goodies to try and savour for the night. If you get the drink special it is $5.99. Oh and btw, every drink is always a double!  The food, oh the food. I haven't tried everything as of yet but I know the staples when I taste it. The ahi tuna sandwich is a MUST TRY! Tuna cooked medium rare with a panko crusted onion ring, lettuce and a sweet salsa, this will have your taste buds doing the happy dance. The appetizer cheeseburger sliders are amazing, these little suckers will get you wanting to order seconds and thirds! And my personal favourite, the lobster and crab ravioli, this is my go to dish as it's delicious with a creamy dill sauce. Another quirky favourite is the lobster grilled cheese, sounds plain jane but it's anything but.  For dessert, I would highly recommend the individual apple pie. Now it says individual but if you were to eat this on your own, I say good luck! It's the size of a dinner plate, topped with either vanilla or maple ice cream, take the maple ice cream, it's to die for! The only down side to this apple pie is that the apples seem to be the worse part of it all, it was a bit too sour for the rest of the flavours rolling around in my mouth.  And to top everything off, there's free valet service. Especially in the cold winter nights, not having to walk all the way to your car has an extra bonus, all you have to do is tip the dude fetching your car, no need to do it twice, just once when they bring your car around.  This place has become my go to restaurant and at time I even crave to go there. The atmosphere is great, the servers and really friendly and they serve little snacks and drinks while your waiting to be seated! What's not to love?"}
{"text":"We walked in and we were greeted warmly. The patio had a 45 minute wait so we sat in the restaurant. The girls here are VERY attractive and VERY tall haha. Not that i'm short but wow. they were tall. lol our waitress was sweet and recommended the calamari. I would have to say the calamari here is one of the best i've had. It had the right seasoning wasn't over fried also they had 3 pieces of fried asparagus and the dressing is this red pepper aioli sauce. I got the fish tacos and my friend got the original burger. He said that the middle of the burger was slightly dry but the fries was very good and that he liked the thousand island dressing on the burger. my fish tacos were DELICIOUS. it came with 3 fish tacos and on each other there fried onions, fried pieces of fish, guac, fried pieces of shrimp with cilantro. since i dont eat hot sauce i had these just the way they were. honestly i found them delicious.as night approached, the restaurant started to get busier and it was slightly hard to wave down our waitress for the bill and after we did ..it toke a while for it to come.   but all in all i would definitely come back again."}
{"text":"The space My party of seven did not make any reservation but we did get a table right away although it was in a corner. I heard the patio upstairs was really nice but may not be able to handle our party at the time.  The service Nice and simple. No mistakes, courteous and timely.  The California Sandwich A moist grilled chicken sandwich. You can taste the charcoal flavour. The cheese and bacon along with the spicy mayo made the burger creamy, savoury, comforting and memorable. Tomatoes balanced out the richness. The chef was pretty heavy handed with sauce. This was pretty consistent across all dishes based on my party's observations. The Portuguese bun was soft but strong enough to hold all that sauce and contents."}
{"text":"Amazing location and decor. Huge patio and nice atmosphere. Got their steak this time and tasted fine."}
{"text":"Great atmosphere and decor, great staff but their food is god awful.   Came here on a busy Friday night and quickly got seated. Server came quickly and we were served our drinks very quickly. Food came soon after which was great until we tasted it. I had the burger and it was possibly the worst I have ever tasted. Beef had absolutely no flavour what so ever. I asked for hot sauce but to put on top of it to add flavour but it was downhill from there. Hot sauce tasted like water mixed with a lot of salt. The chefs should try tasting the garbage they're sending out.   Only thing worth while here is their beach salad other than that i wouldn't bother with it at all."}
{"text":"Really disappointed! My boyfriend made reservations last Friday for dinner to actually propose after we came here for our first date 5 years ago. He had everything planned champagne on the table, same booth we sat in 5 years ago. We arrived 20 mins before our reso's and nothing was set or planned at all... my poor boyfriend was so upset. They finally got us to our booth. They had to ask the ladies to move over and actually bought them a bottle of wine. We had terrible services for the rest of the night and nothing went as planned.   My boyfriend actually called and someone got back to him after 4 days and they had been nice enough to give us a gift card. We went to dinner again and it was slow service and for the the price of dinner not worth it \"thank God it was free\" I guess it doesn't matter the tables are always full.. but it will always leave a sour taste in my mouth"}
{"text":"Haven't been here in over 5 years, and the drought FINALLY came to an end. The menu has changed a bit as well as the beer/wine list (as to be expected), so the choices were fresh ones.   When I perished the menu there were several choices I could have made, it could have been the salmon, one of several steak choices, burgers, but in the end I settled on the full rack of ribs. The ribs was something that I have never had at Joey's, and I paired that with a tall glass of Blanc de Chambley beer, a wheat beer.   All in all it was a great meal, with great prompt service. I have to admit that doing to Joey's tends to be easy on the eyes as their wait staff are very attractive ladies.   Well done Joey....well done."}
{"text":"Food is pretty good.  Servers are very pretty.  Nice ambiance.  Sometimes too busy and don't want to wait."}
{"text":"I was actually pleasantly surprised by this place. I had to meet a friend here for dinner because he doesn't live or work in the city, and we chose this place (I chose it based on the yelp reviews actually). I have to thank my fellow Yelpers, because it was quite good.  Despite the cheesy staff in their little black dresses (or as Rita coined it, LBDs), everything was really good. You certainly know you're not downtown just from the age, size and attire of the other customers, but that's cool by me. Don't need the \"hip\" factor all the time. In fact, it was refreshing!  We all shared the tuna tacos, sweet potato fries, a tandoori chicken flatbread, and the lettuce wraps with chicken. Everything tasted fresh and delicious. This is a damn good chain. While the vibe feels like Jack Astors, the food is much better. I don't live anywhere near here, but I can totally get why this place was packed on a Tuesday night. These semi-suburbanites must be thrilled to have this place in their hood. I have tons of choices by me, and I wouldn't mind having Joey around either."}
{"text":"I've been to here at least 4 or 5 times. Joey's can be categorized as a high-end pub. It is both a nice place to have dinner with family and a modern bar with lots of screens and young patrons to have a few drinks and catch a game. The nicely dressed and good looking staff also adds to the appeal. Food-wise, I find Joey's pretty decent. You won't get a culinary experience but I don't think that's why you'd go to Joey's anyway. I don't recall having anything that we didn't like. The Tuna tacos were one of my favorites. Their molten chocolate cake is a dessert favorite also.   Overall, Joey's is one those places that comes to mind whenever we are looking to go somewhere that we know it won't be disappointing.  Food: 4/5 Atmosphere and service: 4.5/5 Price: 4/5 Overall: 4/5"}
{"text":"3.5 stars  After reading the menu and chef's history I was really excited to dine here.  I ordered the ahi tuna tacos, lobster ravioli and my gf ordered the calamari and Fettucini Alfredo.  The food had a lot of taste and a great mix of textures from the taco but it just felt like it missed the mark. The tacos were difficult to eat for me but the fresh herbs gave it an awesome flavour.  We asked for extra sauce but never got it which disappointed me.  The rest of the food was great and this place would get 4 stars if the waitress didn't forget my sauce.  I may be tight but I do expect quality service from a restaurant with the high quality calibre chef.  Would I come back? Yes I would give it another go but in hopes of experiencing the potential it has."}
{"text":"Really great food. It took a little long to bring the food but it worth the wait. Really satisfied specially with the chocolate soufflé at the end."}
{"text":"Came here last weekend for a friend's birthday.  I ordered a 9 oz of Pinot Grigot. I found it to be fairly expensive compared to other wine prices. It was $16.50 where as most places charge about $12 for a 9oz.  I ordered the Lobster Grilled Cheese with some fries. It was delicious! No complaints there!  Everyone else seemed to enjoy their meals as well. Most ordered the chicken fettucini alfredo.  My only issue was with the waitress we had. Overall, she seemed ok and attentive. I had asked if she could leave one of the menus because my boyfriend was on his way. Finally he arrived and my gosh! This waitress was being flirty right in front of my face!  I am not kidding ...like, the looks she was giving were not how she was looking at us. She looked all shy and licking her lips. I was a little taken back. I thought i might be paranoid so I didn't say anything. Then TWO friends mentioned it to me before we ended up leaving.  Because I got there early and was buying my friend drinks, I told the waitress to separate my bill. She looks at me and points with her finger \"So...you two aren't together then?\"  To which I replied \"Yea, we are together but we are going to be paying separately tonight.\"  Other than that, I had an overall good meal and I like the ambiance!"}
{"text":"What is the best recipe for a steady flow of customers? Well Joey's - shops at Don Mills seems to have nailed that formula down as: pretty Girls, a safe menu, and a great patio area that can be taken advantage of during warmer weather. This joint is a trendy and upscale restaurant/bar setup that seems to cater to businessmen during the day and a young crowd at night especially on the patio. I have been here a few times now during various times of the day/night and it seems to always be busy.   On my most recent trip, my buddy and I decided to check this spot out for lunch. We came in and were immediately greeted by a pretty face and brought over to the bar area. After being seated another pretty face came by and offered menus and promptly came back to ask if we wanted a few drinks. They have a standard bar menu with good selection of beer and drinks. There seemed to be a good selection of food but all seemed a bit unhealthy. Not because I am a health freak by any means but just seemed over the top to me. After perusing the menu I decided to order the Ahi Tuna sandwich with sweet potato fries. This sandwich not bad and a solid OK rating. The Tuna was cooked pretty well but the bun seemed a bit overly big for the sandwich overall but just getting picky here. I have had a few other items off the menu and all were just OK I would say. I think what is really notable about this joint is the patio at night. It's a great atmosphere and just popping at night so I give it a lot of credit. I think this establishment realizes that they have nothing fundamentally wrong and charges to prove it. All in all a good place but since it is just an atmosphere place, I would probably venture closer into the city and find more established bars."}
{"text":"Love it here, awesome food, vibe, great addition to the neighborhood. Love coming here especially in summer on their rooftop patio"}
{"text":"This was my first time going to JOEY Don Mills, and I really enjoyed it. It was neat how they had valet parking, but then again all the other restaurants had it too. It was a Friday night (holiday night) and it was pretty busy, but we were seated quickly at the lounge/bar area. If you are looking for a casual and fun dining experience, JOEY is definitely the place to go! There was also a leafs game on that night and we had great seat for the game.  Once we were seated, our server came soon after. I noticed that the restaurant did have a lot of staff. which was great since I would say the overall service for the night was fantastic! We ordered 2 appetizers for the 4 of us- tempura-fried calamari and the spinach and artichoke dip. I really love how this chain also adds some asian touches to their menu- very unique and does work well. For the entree, I ordered the ahi tuna club. I did change the bread to sour dough, which was the best choice I have ever made since I have had this same dish at the Eaton Centre and Yorkdale locations! I find that in the regular burger bun of some sort, it was very difficult to eat and so I asked the server if I could substitute, and she checked for me and it worked!  My other friends ordered, the oh so yummy lobster grilled cheese (you can never go wrong with this one!), and the herb crush salmon...once of my friends substituted the mash potatoes with brown rice. All the mains were really good, and I have to say that every time I have tried the salmon at JOEYs it was cooked to perfection. I also ordered the summer sangria, and it was good girly drink I'd say- I wished the weather was actually a little warmer for me to thoroughly enjoy it.  Another JOEY visit awaits...I will be back!"}
{"text":"Decided to visit this restaurant last Friday night, the location is nice and central for those of us living in suburbia. Had no problem getting a nice table by the window and we arrived at about 6pm. That being said, by the time we left, there was a huge lineup and the place was packed. To say that the decor is like a \"glorified sports bar\" is really not doing it justice. Yes, there are televisions in there but to be honest, I didn't really notice until I thought back on the experience. Very open and warm space.  The staff was great! Yes they are all young and dressed in the typical black outfits, although some of the waitresses had on purple sweaters . . . anyways, not important. The guy who took us to our seats was very nice and recommended the fish tacos to us, and actually came by later to see what we ordered and if we liked the tacos, a nice and charming touch I think. Our waitress was very nice and also recommended the fish tacos and a great wine.  I, of course, got the fish tacos and my husband ordered the lobster ravioli, which he absolutely loved but I felt needed a bit more sauce and was a little fishy, but maybe fish taco+lobster+crab dip=everything tastes fishy. That being said he raved about his dish. I liked my fish tacos very much, the texture, which isn't something I usually note, was great and the combo of the cheese and salty fish was tasty but the red sauce was a bit spicy for me and I'm not sure why because I can usually take some spice. There were 3 tacos in the entree, which didn't seem like very much but to my surprise I could only finish 1 & 1/2. We ordered crab dip and yam frites for a starter, the yam frites were typical, crispy and good, which are served with a lemon curd mayo dip, also good. The crab cheese dip was ok, I felt the texture was strange, watery but the odd chunks of cheese or crab. Did not make for graceful eating to say the least!  Next time I am going to try the Maple Salmon with their signature crispy mashed potatoes.  I also appreciated seeing a nice selection of local wines.  All in all I am giving it a 4 with a wish I could give it 4.5 because walking out of there I really felt like it was a good experience and there are a lot of duds out there so anyone who does pretty much everything right gets high points in my book."}
{"text":"WOW! for some reason I've overlooked reviewing Joey's DM! This is probably one of my go-to place if I dont feel like going downtown. Located in beautiful Shops on Don Mills, among other restaurant options in the area, Joey's is a great place to take a date, catch up with friends, and even catch a game on tv.  The servers, though good looking, are helpful and as usual, try to make an effort to please their patrons. For the most part I am actually quite pleased there have been a handful of JOEY locations that have always kept its reputation up as a great local place for food, drinks, and ambiance.  The location is not too bad, though it can be tough to find parking considering its in a busy area full of restaurants, and a movie theatre.   Ill be coming back!"}
{"text":"I was at Joey on a Wednesday for a work function, with about 9 other people. We were able to make reservations and get seated quickly. The waiter was very quick and diligent at taking our orders, and anticipated when we needed refills and brought them without us asking which was a very nice touch.  It's on the pricier side, but a great spot for work functions, dates, or catching up with your girlfriends! I've heard great things about the patio, so I will be making a trip back to check it out!"}
{"text":"It's been awhile since I've been here and I'm usually not disappointed with the food and service.   It is out of the way for me to come here as it is midtown and traffic does get a little busy in the mall/plaza.   So this day, I had to pick up my friend at parkview BMW and were debating for the longest times what to eat than Joey's came up and we're like.. let's go!   We were greeted promptly at the door for lunch, got seated almost immediately... I like their booths becuz its big and comfy... they didn't hesitate to give us a comfy seat as some restaurants do.. *arhmm* Moxies...   Our server was nice and gave us enough time to figure out what we wanted. We ordered the calamari, flat bried and lobster sandwich...   The calamari is fried to perfection with asparagus...I didn't think that fried asparagus worked but it indeed did.. at least here.. =)  flat bread was also delish topped with veggies and meat (it was too delicious, I didn't have time to figure out what was on it =p)  now the lobster sandwich, it was to die for... omgoodness, although they sliced the sandwich in small pieces.. it was more than enough to fill... lobster meat was real not the fake stuff that alot of restaurants pretend..   All in all, I'm coming back no doubt..I'm just lazy to drive down here..."}
{"text":"Always awesome, joeys never fails, sushi and burgers a perfect combination, Always packed and loud a perfect lunch spot"}
{"text":"I've been to Joeys before (Eaton Centre & Markville) and I would have to say all restaurants are consistent with their food quality and service.   Decided to write a review to say to try the Panang curry! I went for a friend's birthday, and wanted to try something different. The server recommended it. It's probably not an authentic thai curry, but it's ALMOST on par with salad king. Nice spice. I wouldn't go out of my way for it. But if you find yourself at a Joey's and want something different, you should try it!"}
{"text":"Did not know what to expect from this restaurant as I have never heard about it. Once I stepped in and saw all this people dressed in fancy business attire, I realized BOY am I outta place with my baggy jeans and a shirt.   Looking through the menu, they have some impressive items. Unfortunately, their appetizers sound better than their entrees. So I decided since it's a 'fancy' restaurant, I go all out and order their 9oz steak and grilled prawns just to see if they can even cook a steak properly.   When my dish came, I cut into my steak, I immediately knew that it was not cooked to my medium choice but rather near medium-well. Not only did my 9oz steak look like a 5oz, it was on the salty side. It came with some vegetables and two things that looked like spring rolls. Well they weren't spring rolls, they were actually mashed potatoes wrapped in crepes. I know that they're trying to be different and a little fancy with the wrapped mashed potatoes but in my opinion, they failed. I would rather just have mashed potatoes and gravy.   Their desserts menu was disappointing. They have a HUGE dessert menu consisting of only THREE items... talk about huge huh? Their desserts didn't even sound good. Baked apple pie for $7.49?? C'MON, I can make these desserts at home. Anyways, we decided to split the Molten Lava Cake (between 3 people) because my friends were full from their dishes... I wasn't. To my surprise, the cake was actually good... not good as in oh my gosh I want another one but just good.   Service was pretty good, although our waitress came to our table one too many times just to ask how the food was... if the food was great the first time you asked, what makes you think it'll change 2 minutes later when you ask again?! But that's ok cause she was pretty and reminded me of Jennifer Garner. She did sucker me into ordering a side of sauteed mushrooms for my entree somehow... must of been her eyes and bright red lip stick.  One thing I thought was pretty neat was that each person's meal were separated on the bill, which made it easier to figure out how much each person pays. My meal came close to $50 somehow and all I ordered was the $30.99 steak and prawns and a glass of ice tea. For that price, I coulda went to the Octagon Restaurant (which I recommend for steak lovers) and got a 12oz steak cooked to perfection.  I guess the place was worth trying once, but I most likely will not be going back."}
{"text":"Came back here on a Wednesday night. This place was packed. Even on a Wednesday night. I mean, I know it's near New Years but Christmas is over so don't people have to go to work? Apparently not. Well, my friend and I managed to get 2 seats at the bar. Since I had just gotten back from a week of partying and lying on the beach in Rio, I didn't really want to drink to heavily like I usually do here. So only 1 Grey Goose dirty martini and a pint of Alexander Keith's. I finally found out that they constantly change their menu which is probably why they are still packing in a ton of people. Even on a Wednesday. Tried this new dish that they had. Halibut and shrimp on a bed of spaghetti with a sun-dried tomato sauce. I'm not going to lie, the sun-dried tomato sauce with the spaghetti and shrimp was really really good. So good that if not for the over-cooked and under seasoned halibut, I would probably get it again.   Joey's still gets 4 stars."}
{"text":"The service we rec'd was excellent - went on a Sat and it was packed (no surprise as its pretty much packed everynight from what i have heard and seen driving by).  The staff offered free drink samples and also free appetizers to those waiting for a table.  Once we finally got a table, we couldn't make up our mind b/t 2 appetizers so they brought one out for us to taste!   The food was pretty decent - nothing too exceptional...but a nice place to go that is nearby.  Be prepared to wait for awhile however -"}
{"text":"The food here is ok - seems a bit over priced (yes I paid about $20 for some lettuce on a place and tiny bits of fish).  As for aps, the edamame is ok, it has a spiced flavour, the cheese dip was a bit weird and watery.  The fish tacos are popular (whatever that means), and the blueberry mojito wasn't bad...over all not a great place to eat, not alot of food for $50, but the atmosphere and decor and nice, and our server was pleasant.  She tried very hard.  A semi-hipster bar in the middle of nowhere."}
{"text":"I like this place.  The food is decent. I've had good and bad meals here. The location is great.  The service is \"horr\"-ific.  Can't go wrong when the ladies serving you smell and look like exotic dancers.  It's a high end hooters with even more cleavage.   Take out the servers and you have yourself a chain that will not last 1 week in a month of Sundays.   Admit it boys, you go here for the view(s)."}
{"text":"Gah I don't know what to say about this place. It's pretty on the inside, it's big, it's relatively pricey and it's the kind of place where a dude who doesn't really put a lot of thought into a date but still wants to impress you by taking you to Shops takes you on a date. Does that make sense?   I don't think there is anything here that makes it special. The staff are BEAUTIFUL. A carefully selected, hand picked group of men and women - pleasant to look at, well dressed (kind of like a restaurant version of Emirates flight attendants!).   Our server was attentive and nice, he came around with water, brought us our food, took out money. Pretty much did what he is supposed to do so props for that.   I had calamari as an ap ($13) and the ahi tuna sandwich as a main (i think it was $17). The one thing about this place is that Ahi tuna is literally in every section of the menu. There's sushi (what...?), burgers, salads, steaks, etc. - all can be ahi-ed. I don't really see what the big deal is about Ahi tune, it's got nice texture but the taste is whatever. I would just rather have sashimi grade salmon, seared. Anyway, the burger had two onion rings on it which added a crunch, and there was a sweet puree type sauce on it which I quite enjoyed.   It's fishy. The actual piece of tuna was BIG, so that's good. Portion size was standard.   That's the thing about this place...it's so average. Busy and poppin' on a Friday night, about 30-40 min wait for a table. But there are so many places I would have rather been on a friday evening. There's nothing here that I would come back for again.   OMG THE PARKING IS RIDICULOUS YOU CANNOT FIND IT PARKING DOES NOT EXIST!!!! So annoying. Shops at Don Mills really isn't my cup of green tea apparently.   Mediocre. If your boyfriend starts taking you here - your relationship has hit a plateau and you need to spice things up!"}
{"text":"The delicious food, sleek décor, and prompt service always blows me away. I've always had a consistent experience which is why I've given it 5 stars. It's generally priced at $5 more than the typical Jack Astors/Kelseys/Pickel Barrel meal but the quality of the food is on a completely different level.     I've been to this JOEY an embarrassing amount of times. My wallet is not happy; I've tried too many items on the menu.  My go-to and favourite item is the Baja Fish Tacos. Last time I was there, all four of my friends and I ordered this. The fish pieces pack a punch: crispy yet juicy and flavourful. The guacamole, cilantro, and other sauces make for a delicious combination. Even with the fried fish, I always feel refreshed after this item, like I just drank a smoothie. While it comes with only three tacos and no fries, I always feel full every time. Highly recommend!  For desert, the molten lava cake is rich, with a crispy exterior, and perfect if you adore chocolate. Perfect with the vanilla ice cream.     Other items I've had, ranked in order of how highly I would recommend:   Spicy BBQ Chicken: This burger is delicious! I love anything with Bbq and this hits the spot with the pulled chicken and sweet & spicy Bbq sauce. The coleslaw that this comes with is tasty as well. With a lot of Bbq sandwiches, it's easy to feel overwhelmed and slightly sick after the overload of Bbq sauce but I didn't feel that way after finishing the burger.  Tuna Sashimi Salad: Dear those who (incorrectly) think that salad is just lettuce with some dressing, please try this salad. It's so different from anything I've had before. The dressing is delicious and pairs perfectly with the veggies that Joey has. The tuna is always seared perfectly.   Lobster Grilled Cheese: A delicious combination of creamy cheese and rich lobster. While the cheese has a strong flavour, it wasn't overpowering and I could still get the taste of the lobster. I wasn't blown away but it was very good.   Ravioli with Lobster Cream and Grilled Prawns: This item looks gorgeous! My friend posted a picture on Facebook and I knew that I would have to give it a try. However, the portion was really small but I guess that's expected with ravioli. It was delicious but I didn't feel full after it. Considering the price, I don't think it was worth the money.  Panang Prawn Curry Bowl: This wasn't anything special, just a curry bowl with rice and prawns. I can think of many Thai places that do a much better job with this at a significantly lower price. I'd recommend you avoid this item. I'd also stay away from the ramen and butter chicken even though I've never tried it as I'd assume that many ramen and Indian restaurants would have this item at the same or better quality for literally half the price."}
{"text":"After trying all the restaurants in the Shops of Don Mills, we have renamed the place as Flops of Don Mills.  We found Joey the best of those mediocre establishments, and went back today for a second time to have lunch.  We first tried the upstairs patio, but we found it rather unpleasantly wet, and opted for a downstairs table.  The place was full on a weekday, compared to the other eating places, which suggests that even the normally tolerant Toronto crowd must have agreed with our conclusion.  Although the wait time for our serving was much longer than the tight skirts of the wait staff, the food was quite good.  We could see from senior citizens to business people in dark suits enjoying their food and the atmosphere.  As we live close by in the Don Mills area, we decided if we want to get a quick meal, we may go back to Joey in the future.  Food lover"}
{"text":"Liked my dining experience here enough for me to create a Yelp account and rave about JOEY Don Mills.  Today was my third time here at this location and it was a surprisingly pleasant and charming experience despite the initial order mix-up and followed by the rock-hard brown rice that was served to me. Because our server, Sean C, was absolutely flawless in his follow-up to ensure that we had an enjoyable evening. And the management was more than accommodating to double confirm with us that our night was going well.  JOEY had consistently delivered great tasting food (their burgers and salads have yet to disappoint me). And today, they really shined in the delivery of  total customer experience and customer-obsessed service. I would not hesitate to recommend this restaurant to a friend for a good meal and even better dining experience.  Thanks, Sean and Management. For a great night. And an absolutely deviously delicious molten chocolate lava cake."}
{"text":"I have been to this location many times.  I didn't write a review yet because I really have not much to say about this place except that I love their Ahi Fish Tacos so much and possibly their ambiance.  Service is ok but definitely nothing special.  It is a franchise and therefore I don't expect too much.  I like that I can walk-in and make the reservation first if there is not a table available yet.  I can either stay or walk around Shops at Don Mills.  A text message will be sent to me when a table is available.  So far so good.  However, their upstairs patio bar chairs are a fail.  I don't know why they chose to use all metal material.  They are certainly durable but they are freezing cold during the colder season and they are burning hot during hot Summer days.  Besides, chairs are definitely not deigned for anyone who is 5'5\" or shorter.  Absolutely uncomfortable!"}
{"text":"I never expected this restaurant to be so upscale until I attended a staff dinner early last week. The chique, modern layout and decor are impressive but the centre piece in the restaurant was bar with the dragon scale concept wall. It was entertaining to watch the bartenders shake up the drinks and mingle with the patrons who sat there. Our servers were also pretty attentive and there was a good brigade of them who brought our drinks and meals at the respective moments.  The only low point I found was with the simple lay-out of the menu. A lot of the items on the menu could be described in a way that would allow them to stand out and be significant of the restaurant.   As for my choices  Drinks:  a Caesar: Woo! pretty spicy kick upon the first sip with a good balance of the clamato juice                   and vodka   a Classic Mojito: Very refreshing and I got a good equal taste of the rum and mint with each                            sip. It went well with my appetizer and main.  Appetizer and Main:  Tandoori Chicken Flatbread: Definitely liked the slight thickness of the bread and the flavor of the chicken and the yogurt.  Lobster and Shrimp Ravioli: It was the simplest looking dish at the table. There was a subtle hint of lobster flavoring the sauce and it paired well with the grilled shrimp. The ravioli was al dente and tasted well with the sauce.  The other dishes also looked great. I exchanged a portion of my flatbread with one of my co-worker's Pesto Shrimp Flatbread and I liked it. But the most eye-catching dish was a Seared Sashimi Tuna Salad which looked so much like a painter's palette, the colors in the dish were so sharp. A Spanish Paella that another co-worker came out served in an individual sized \"paella\" pan. Also interesting was the way the mashed potatoes for the steak were served in the form of spring rolls. They looked so tasty and I would not mind ordering them as an appetizer.  Overall, the atmosphere is pretty trendy and the service is definitely satisfactory. It's a good choice for coming here for a weekend evening drinks and dinner.A"}
{"text":"The bomb diggity!   The moment I walk in this place it was jam packed! Which is always a great sign. The modern contemporary look goes great with the atmosphere. The dark lighting, which is normally a problem with me, blends well with the whole concept of the restaurant. Theres a  staircase right in the middle which leads to the washrooms and the patio. To the right is the lounge/bar area and to the left is the dining area. I love how the staircase splits the two areas apart. The music playing in the background goes great with the ambience and is not too loud.  The greeter and waitresses at the front was very friendly and informative! The one girl told us about the menu and some of the most popular items people get as well her favourite items. The  other waitresses that were working at the front consistenly made sure that you were okay by offering drinks and food while waiting for a table as well kept you informed on how much longer till your table was ready . Normally I do make a reservation for places like this but this time I really didn't mind not making one and probably wouldn't make one anyways when I do come back b/c the staff and restaurant made up for the waiting time.   While waiting the waitesses came up and gave us some samples that the restaurant had to offer from drinks to food. It was a good concept b/c it made the wait seem that much shorter as well it gave us a chance to get a bit of a tease of the food they had to offer. The drinks that they let us try was white wine, red wine, and a bellini. The first thing me and my friends thought was how many places give you a free drink while waiting? Especially an alcoholic drink? The bellini was the best out of the 3 it had the right mix of rum and peach. For food the waitress gave us a sample of soup, pan fried gyoza, and pesto shrimp flatbread. The soup was very tasty, unfortunately I didn't get the name of it but it was a little spicy pretty thick and rich. The pan fried gyoza was very well done, the pork was very tasty, the wrapping of the dumpling was very crispy on one side and moist on the other side which was a perfect combination. My only complaint about the dumpling was the soya sauce they use was very ridiculously salty and is honestly not need for those dumplings b/c it's already packed with flavour. As for the pesto shrimp flatbread it was so good, very cheesy add that with the sun dried tomatoes, chipolte for some spice and lots of shrimp. I would have ordered that flatbread if it wasn't for the fact that I had my eye on something else for an appetizer.  After waiting for about 40 minutes, which felt like only 15 minutes, we got our table. Nothing too fancy about the table we sat at, very simple our waitress came and was very friendly and easy to talk to, we asked her what she recommend and she basically said the same thing all the waitresses at the front said, with a few differences. Very satisfied with the fast, friendly service considering how busy the restaurant was and I didn't have to ask once for a refill b/c our girl was definetly on top of it.  For appetizers we got the BAHA FISH TACOS and AHI TUNA TACOS. The baha fish tacos were tasty, the combination of the soft tortilla with shrimp and fish was amazing, add the hot sauce that came with it and you've got a flavourful taco. The ahi tuna tacos was my favourite out of the two. The medium rare tuna was very juicy and perfect the way tuna should be cooked. Add the coldness of the coleslaw the crispy shell, the wasabi lime sauce and you are in heaven.  Main course we got the LOBSTER RAVIOLI, BC HALIBUT & PRAWN SPAGHETTINI, and LOBSTER GRILLED CHEESE. The ravioli was very creamy, the dill that they added to the sauce gave it that extra punch which made it stand out from most pastas you would normally get anywhere else. The filling for the ravioli was very well done, jammed packed and you could taste all the ingredients from the shrimp, crab and especially the lobster. The spaghettini was very good as well but it came with black olives, I am not the biggest fan of black olives which kinda got into my head a bit that I might not like this as I thought I would. After a few bites it started to catch on and I really enjoyed it the halibut was seared perfectly and was a great combination to the pasta. As a fair warning this pasta is hella spicy, so for those with a sensitive tongue you might not want to get it. Lastly the lobster grilled cheese was very cheesy and creamy, lots of meat in that sandwich. That is an amazing blend that can be put into a sandwich.   Overall an excellent experience food and atmosphere is outstanding, for all the guys out there this is a must go to place b/c the waitresses are helpful and out of this world beautiful. Something tells me I'm gonna be a regular here. :-D  Items to definitley get  - Ahi Tuna Tacos - BC Halibut & Shrimp Spaghettini - Pesto Shrimp Flatbread - Lobster Grilled Cheese - Bellini - Baha Fish Tacos - Baked Apple Pie"}
{"text":"For an uptown resto/lounge, this place is decent.  We enjoyed the edamame, which came slathered in szechuan garlic soy sauce; and the lettuce wraps with crispy noodles and chicken in a peanut/teriyaki-like sauce.  If I were you, I'd skip the cheeseburger sliders (good but not great) and go for the baja fish tacos (yum). For dessert, KEY LIME PIE. Awesome.  The \"sangria\" which I suspect never met real fruit or real fruit juice, was kool-aidy sweet if you like that sort of thing. In fact, most of their cocktails are made with their signature \"limoncello slush\". So...not very sophisticated, but tasty if you're a \"girl drink drunk\" like me (random Kids in the Hall reference).  Also worth mentioning, since this was not my first time at Joey Don Mills, on weekends this place gets busy and the lounge turns into an uptown 'scene'. That's just an FYI if you're looking for a fun (older) vibe in this neck o' the woods.  But I'm only giving it 3 stars because it doesn't blow me away...we went during a weeknight snowstorm and the place was kinda empty, yet despite that, the server took our cocktail order and then brought my drink but forgot my friend's drink. It took nearly 10 minutes before we could flag someone down to tell them. What's that about? Also, the napkins are those shitty brown recycled napkins. Hey Joey, maybe splurge on some cloth nappies?  Quibbles aside, I find myself craving those lettuce wraps and will therefore be back here soon."}
{"text":"This restaurant was a real surprise.  The food was better than I expected.  It's an upscale restaurant and definitely a great addition to the Shops on Don Mills.  We were there on a Saturday night and the place for packed.  Our wait was 40 minutes so we left them our cell phone number and went for a walk around the shops.  When we got the call we came back.  The food was amazing.  We had the Ahi tuna tacos as an appetizer then we had the maple salmon, the lobster ravioli and the steak.  We all love the food.  They had a crunchy mash potatoes which is just a spring roll wrap around mash potatoes as a side with our food.  Then we had a chocolate lava cake with ice cream.  The food was actually really really good.    This restaurant was so good I would recommend it to anyone in the area. Definitely better than any Milestone or Pickle Barrel.   There is also free valet parking so don't worry about finding parking here.  Prices were not cheap but it wasn't ridiculously expensive as well. Try this place you won't regret it."}
{"text":"We went there couple if times for drinks and dinner. It is located in nice area which i like to have a walk after dinner. The patio upstair is great specially in summer time. The servers are also generally nice."}
{"text":"Joey Don Mills used to be my go to dinner location. Great food, service, vibe. Over the past few months I have had 5 visits of which 3 were bad (bad enough for me to complain and in general, I'm not a complainer...), 1 was ok, and my visit yesterday was AWFUL.  Although I'd agree with some reviewers about the portion sizes for apps (particularly the calamari which is a small pile of dime sized rings topped off with 2 asparagus spears), that's not where Joey Don Mills lost the stars for me, it's in the service which is vastly inconsistent.  My experience last night was awful and completely ruined my night. While waiting at the bar for a table to open up I was asked to leave my visa in the till to start a tab (I know that isn't protocol and sat back and watched as I was the only one asked). Management apologized and shook their heads in disbelief... They told me that there was no reason for her to ask me to leave my credit card in the till. Like... REALLY?! When going out to dinner you pay later, without putting your house up for collateral. That was some clear discrimination.  Then I get a text that my table has finally opened up meanwhile I have a plate of calamari, 2 glasses of wine, 2 glasses of water... There's only 2 of us. So I go to the hostess to get the table and let her know that I have a plate and drinks at the bar. She told me point blank to go get them. Then added unless you need my help. I politely declined and we carried our purses, wine, water and calamari across the restaurant (everyone was staring) (can't blame them tho, we looked ridic and I almost dropped the plate twice).  After being seated at our table everything was pretty lacklustre. Our empty plates just sat there on the table with waitstaff walking by. After flailing my arms for a lengthy period of time, I eventually called out a few times before getting my waiters attention to bring the bill.  I did get some $ off the bill and a GC, but my time is precious and my night was ruined.  So unfortunate, but it looks like we are gonna have to cross Joey off our fav list.  Joey Don Mills... It's over. Sorry, not sorry."}
{"text":"I was looking for good place to have lunch at the Shops at Don Mills, and decided to try JOEY's, based on the Yelp reviews. I never heard of it and thought why not, and I'm happy with mu choice. I was pleased with the very friendly greeting, retro modern look of the place, and very pleased by the super cleanliness, even the toilets were spotless.  My wife had the Ahi Tuna Club and loved it! It was more like a tuna steak on a bun. It came on a really soft super tasty egg bun with a not to sweet, sweet pepper relish. All around a really great sandwich, if you like fish give it a tray, you won't be disappointed. The fries were also excellent very good.  I had the Chicken salad made with the made in house rotisserie chicken, very juicy and super tender! It was all around a really good salad, I would order it again."}
{"text":"Ok, to update my previous review, I was slightly disappointed with the Salads here this time as compared with my previous visits. They use to offer HUGE decadent salads so this was a one of my fave lunch spots, but they seem to have been pulled from the menu now. The prices are still the same $14-18 for a salad but they are much smaller than last time, and didn't seem to come with as many of the nice touches from before.  The ambience however, is still great. Next time I will venture upstairs as it looks like the have an opulent outdoor patio on the terrace."}
{"text":"I really love this place. There can be a bit of a wait for Patio during the season but this place is great for girls night out or even casual dates"}
{"text":"For establishment that considers itself high class and makes server dress up like club girl, u need dairy alternative! It 2017!  Bathrooms up many stairs. Had workout before lunch.   Fish taco were delicious! Very yummy."}
{"text":"Oh Toronto, how I thought I missed you so.  After being away from my country of birth for the past 15 years, I was happy to finally touchdown on the land. Eating out everyday, I usually tried something new. Everything was usually great. The places, the people,everything. Unfortunately good things must end.  Joeys was the beginning of the end.  I walked in with a party of five. It was my cousins birthday and she didn't usually do this type of thing(go out for dinner). So I took her and her family out to celebrate the occasion. The place looked nicely packed on a Sunday.  I saw some wonderful booths that I didn't mind waiting for, and an open one that I thought was being prepared for us, the only waiting party. But instead I was ushered to the back of the restaurant in no man's land where my only view was the kitchen. It was almost as if they wanted us out of the way. An isle of empty booths and us. And eventually employees of the restaurant started conjugating at a booth next to us. Yes, that's where they sat us. Far from the entertainment, far from the tv, far from seeing other people wine and dine. Far from seeing people come, far from seeing people go. I was in no mans land. My cousins, my aunt, my mother, and bar backs/waiters/servers sat together in harmony away from the paying patrons.  I didn't expect that in Toronto, I mean c'mon it's CANADA. And I've lived in the Dirty South for the past 15 years. Needless to say I was surprised, saddened, and forced to question whether the rest of Toronto has become like this.  So I guess reviewing the food would be pointless and devoid of taste and artistry.  Never again shall I return, and I'll widen the scope and stay out of the Don Mills Area in order to protect myself from such an undesirable feeling. How unfortunate to return \"home\" to not feel wanted."}
{"text":"Love this place. Great atmosphere. Excellent menu with lots of choices. I love the lobster grilled cheese. The paella was great too. Lettuce wraps are a must - even the veggie version of the lettuce wraps were great!  Servers are very friendly and accommodating. I was impressed with their \"clamp on\" high chairs for babies! What an awesome idea. It clamps right to the table so it doesn't take up any floor space. Quite brilliant actually! I've been to this location several times, and I'd definitely return."}
{"text":"FINALLY.  After so long, my friends and I went to Joey to eat.  We had reservations on a Thursday at 7:30 PM.  We got there 10 minutes early, and they said that our tables weren't ready yet, but we could eat in the lounge.  So we ended up there.    Unfortunately, Joey is a really really loud restaurant, so having a good intimate conversation would be over (not suggested for a first date, people!)  Decor is chic and nice.  No complaints there.  (However, the dancing lady avatar near the washrooms confuses me).  My friends and I ordered two different things among the four of us.  The ahi tuna club and the baja fish tacos.  Although everybody tells me that the ahi tuna club was amazing, however, I am in LOVE with the baja fish tacos.  It was AMAZING.  Words cannot describe."}
{"text":"Normally when I order salad, I don't want my salad has tons of cheese, bitter vegetables, or olive. Joey just offered me my perfect salad! This is so great, I will come as often as I can."}
{"text":"We finally tried out Joey at Don Mills and had a fabulous lunch.  I had the Lobster and Prawn Ravioli and the hubby had Steak Frites with the Foppiano Petite Sirah.   It was fab. I will have that pasta again and paired it with a nice glass of white wine (Yealands Sauvignon Blanc). For the perfect finish, follow with that Chocolate Volcano soufflé  and you will be sitting there with a happy tummy.   Staff were friendly and efficient.  Nicely dressed and more on the upscale side.  We sat at a nice comfortable booth.    Ambiance is great.  The place does a great biz. Once you've eaten there you will see why!  End to end it was a great meal!"}
{"text":"I like Joey's but not this location, primarily because they don't know how to sear tuna. They only know how to cook it through like you're cooking tuna for a tuna salad. I thought it was bad luck the first time but after three times, it's confirmed that the tuna searer needs to go back to basic culinary school."}
{"text":"Gah! The food is so good here. All of it. Every last morsel.  Don Mills is the location I usually go to, but I've also been to the Yorkdale & Sherway ones and it's just as good. The chain is very consistent.   I could probably eat the Sashimi Tuna salad daily and never tire of it. There's so many great flavours in that salad and everything is so fresh tasting.   What else is good? Korean Fried Cauliflower, Ahi Tuna Tacos, Lobster Grilled Cheese, Baja Fish Tacos, Steak Frites, BBQ Salmon Rice Bowl, oh... and EVERYTHING ELSE.   They're happy to accommodate large groups too - we usually call ahead and get one of the long tables downstairs. Amazing (huge) rooftop patio too.   The Don Mills location is also a fun little shopping area to walk around after your meal."}
{"text":"Have been to Joeys a few times now and it never fails to deliver.   Their bacon cheeseburger is delicious, the service is great and the restaurant has a great feel to it.   Will definitely return."}
{"text":"What a pleasant surprise.  I didn't expect much for this place for some reason,  maybe the lackluster reviews of all the restaurants in this area.  But I liked this place. The ambiance was very nice,   the staff very friendly and helpful.  The food was tasty and seemed to be well mute together.   The lettuce Wraps with chicken were very good,   nice crispy noodles were a nice addition.  The chili chicken starter was also tasty,   quite similar to what Milestones serves.  I had the chicken, bacon cheese sandwich which was also good,  with a nice mushroom soup on the side.  We finished with the apple pie which was delicious too.  Nice light crust and a tasty butterscotch topping. Also had a nice quava lemonade which was great.   So really quite pleased with this spot and will hit it again."}
{"text":"Their drinks menu is a good read. Cracks me up every time.   I've been to \"Joey\" in Edmonton, and this one was a definite upgrade!   I like to call these restaurants LBDs (Little Black Dress, not to be mistaken as Loser Buys Drinks) because the servers are always in black dresses/short skirts. My (male) coworkers get a kick out of it. I just like the friendly faces. Anyway, I'd feel bad for the loser that ends up buying drinks here.... kinda steep... unless the winner ends up liking the daily special.   FYI, Bellinis are Tuesday's special. Mmmmm!  So I ordered their mushroom soup & boy did it come out fast! I also ordered their lobster grilled cheese. It came with a side of cocktail sauce. I tell ya... grilled cheese is one of my favorites when it come to comfort food. But lobster grilled cheese.... I just about settled in for a nap. They didn't skimp out on the meat or the cheese. Much appreciated. It's a little on the oily side, but that's where the acid in the cocktail sauce plays in so well.  They usually serve it with fries on the side, but you can swap out for veggies, like I did -- asparagus, lightly salted.   I'd say it was an excellent meal. Will I be back? You betcha!"}
{"text":"This place is really good! The best restaurant in the area! The food there is really tasty - especially the Ahi Tuna Club sandwich, Lobster Ravioli and the tandoori chicken flat bread.  They also have mock chicken for those who are vegetarians.  Gorgeous patio for the summer time."}
{"text":"From the ashes of the sleepy old Don Mills Center rose midtown's now go-to destination filled with trendy joints at Shops at Don Mills.  I generally try not to hang out here as my office is also located here and hanging out at any number of \"swanky\" places after work just isn't my idea of relaxation or unwinding.  However, on odd occasions where I'm meeting clients or business associates for lunches, Joey has always been my choice.  I've once walked into McEwan's and walked right out after seeing some of the price tags but that's a different review all together.  I've had many business lunches here with occasional after work bevvies so my review will reflect just that.  I'm not sure how many patrons actually come here for food as it is pretty obvious from the moment you walk in that their staff is the main attraction.    As a lot of the other reviews suggest, unless you have a reservation, wait time can be  ridiculously long.  Once seated, the service is brisk and the bevvies start to flow with good consistency.  My favorite here is their flatbreads.  I've had all 3 (?) varieties and with the shrimp pesto leading the way, these flatbreads can be a meal in itself.  Served hot on a wooden serving paddle straight out of the oven, the flatbread is nicely doughy, good crunch on the crust with well baked and generous amount of toppings.  Can't go wrong with these any day of the week.    Their burgers are also decent but nothing to write home about with all the usual condiments.  It's hard to wow me with a burger.  Their steaks are also just about average.    Joey is just another franchise establishment much like Moxies, Milestones..etc and if  that's your thing, this place may please you more.  As far as I'm concerned, I'll probably continue to meet my clients here for many more lunches but more out of convenience than anything else."}
{"text":"This place has a great patio upstairs, but it IS small, so get there asap when the sun's out. The food's good (I got the lobster and brie grilled cheese--good, but not amazing), although a little pricey, the service is great and it's an all around good place to hang out with friends for a drink in the summer."}
{"text":"This is the first time for me at joeys and it might be my last.In order to really appreciate the place one should always bring a miners hat-if not you are in big trouble.We had the eat a mammy which was quite good but I had the worlds smallest steak frites-I think it must have set a record for its lack of size.Its good it was so dark because I really couldn't tell how big or small it was.My wife had the fish which looked good through the haze and my sons had steaks which again appeared fine.All in all from what we could see it was a rather dark experience."}
{"text":"Came here for a buddy's birthday in another snow-mageddon. Target audience is quite clear, with the heat cranked up so that the staff can all wear black form-fitting dresses.   Had the lobster grilled cheese based on everyone's reviews, it's quite meh. Can't go wrong with a greasy grilled cheese but barely any lobster.  If you come, you're paying more for the ambience than the food, imo"}
{"text":"As an industry person I am always hard to please, but Emma our server tonight provided excellent service in the lounge, an asset to this location! Olivia the bar manager also stopped by to see how everything was. Emma's service was just incredible from start to finish. Made excellent suggestions and was on the ball with refills and ensuring our food was coming out in a timely manner. Will definitely ask for her again! Somebody give this girl a raise."}
{"text":"Had lunch with a friend here today. Nice atmosphere on the upstairs patio and good service.  The Baja fish tacos were delicious. My friend had the Beach salad which looked very delicious and had very little quinoa in it."}
{"text":"I think Joey's is a great place for a quick after work bite/drink and would suggest getting a seat in the lounge/bar area if you are in a rush or simply really hungry! The wait for a table in the dining area can be quite lengthy. I have waited for close to an hour quite a few times. Rooftop patio is also fantastic in the summer.   As a pescetarian, my two favourite entrees at Joey's are the lobster grilled cheese and the Tuna salad. Both absolutely delicious.   Great wine selection, friendly service and great atmosphere, just like every other Joey's I have been to."}
{"text":"Came here on a Thursday night for dinner and drinks with a pal. I really like meeting friends here because of the location - it's conveniently located for most people in the city. The patio was nice (a little cold, but this year has had a crazy long winter). It's a little expensive - dinner for two with two glasses of wine was about $100. The food is okay, but everything else pushed my review to become a four star and to a 'yay I'm a fan' level. Service was excellent with a capital 'E.' Our server should work in a higher end restaurant as he definitely has what it takes. I also really loved the atmosphere. It's a great place to meet up with people over drinks and dinner.  Good for: drinks, dinner"}
{"text":"I love their butter chicken and fish tacos. This place reminds me of milestones or movies however the food is much better and the girls are in much smaller outfits."}
{"text":"Went here last night for a friend's birthday! I have been here many times before for gathering with friends. As usual the place was packed and I heard the hostess saying there i was 30-45 min wait time. The service last night was a little slow, but I think it may be due to how busy they were, so I am not going to hold it against them. I think our waiter tried his best to multitask, we were a table of seven.   I was contemplating between the ahi tuna club or the ahi tuna tacos. I ended up going with the tacos, which were pretty good but..... I would have preferred to pay more and get the club. Thanks to my Sommersby cider my big appetite wasn't in play last night so the tiny four tacos sufficed.   I would recommend the tacos as an appetizer or for people who have small appetites. My description of the tacos is , a wonton wrap fried and folded into a taco shape, the filling was a slaw with cabbage and green onions, and a slice of tuna sashimi placed on top of the slaw. I would have preferred larger pieces of the ahi tuna, because the pieces were too small. Also the green dip it was accompanied with wasn't the greatest and I am a dipper (lover of dips).    Its a good place for a night out with friends or a date! Their patio/ terrace is nice as well in the summer time. If you are on a date you can always end the night, with a stroll around the parkette and the shops!"}
{"text":"Grreat food!   Lobster Grilled Cheese is OMG. Food IS fab.Always packed though..shocked we actually got a seat on a Friday night.  Not feeling the 45-minute waits that usually result in us leaving. Reserve in advance because its not for the spontaneous at heart.Thats why it lost points."}
{"text":"My husband and I took our daughters after a dance competition to celebrate. Service was okay by server, drinks came out on time.  Though when it came to the mains only 3 of 4 mains came out and no one came to check. I had to find server and informed her that my daughters food was missing. She left to inquire though was gone for almost 10 minutes I gave my daughter my dinner and went to open kitchen area to look for her, told her colleagues that if they forgot to make it to forget it now as my daughter ate my meal. Later a manager came by and said sorry , though no one too ownership for mishap that ruined our family dinner out.   No meal compensation was provided or a meal packed to go.  I had to go across road and by myself a dinner to eat at home.   I won't be going back as I feel that the service for my family was sub par, there are many other options I the area."}
{"text":"Enjoyed lunch here on Sept 22/14. Had the crispy chicken sammy but grilled not fried. This sammy was amazing. Served with cole slaw on it but the bread was the high point. It was heavily sesame seeded &'I love that flavour profile. It came with skinny fries which were solid as well. This is a recommend from me."}
{"text":"I've been dying to dine at this restaurant because the first time I came across this restaurant when it newly open, there was a long line up (and all I wanted was dessert). So my friend and I vowed to to come here on a less busy day for lunch or dessert.  We came here for lunch and I got a lobster ravioli. I thought that it was a bit too salty. My friend ordered a salad and she absolutely loved it. Even though my ravioli was a bit salty, I'm not going to completely write off this restaurant because there were so many other choices on the menu that I want to try. As well, the service here was good so with that in mind, I will give this restaurant another try."}
{"text":"I really like Joey Don Mills I have been here 3 times now and each time I try something new Everything I have had is delicious!!!! I had the beach salad and I have had the viva salad BOTH were great! lots of toppings, the viva salad had lots of rotisserie chicken and the croutons and torittila were a nice addition  i also have the lobster grilled cheese.. REAL lobster (unlike at crappy Moxie's) and i have had the ahi tuna tacos (app) .. also really nice and tasty..lots of great flavour the burger is quite nice too everything is tasty imagine nicer and better food but a similar price range to a milestone's or moxie's i guess  the only thing that sucks is that they dont take reservations (at least not for lunch when we went) and that can mean a really long wait"}
{"text":"I tried Joey Don Mills with my friend for lunch today, and I am very surprised to see how many people are there. The patio was almost packed and it is a huge patio ( at least 20 tables ). Seriously, Wednesday noon? Nobody needs to go to work any more?   I ordered lobster Grill Cheese and my friend ordered a rainbow roll. My lobster grill cheese is good: super crispy outside, tons of lobster inside, and come with fries. Considering the location (Shops at Don Mills), fancy decoration, and great customer service, I wouldn't say $17 dollar is overcharged . I also tried a piece of the rainbow roll of my friend. It is tasty, but nothing impressive.   I would say Joey Don Mills is a fantastic place to hand out with friends, and I can assume how popular it will be for dinner or weekend. For girls who love shopping, you can definitely stop by there and grab something to drink after a long-day shopping."}
{"text":"This is actually my favourite restaurant in Toronto right now. I was walking around the Shops at Don Mills and an inebriated woman walked up to me raving about the amazing food at Joey Don Mills. I assumed they must have good drinks as well.   Outstanding food and service. Keep in mind I am not exactly a \"foodie\" - I am more a fan of your typical comfort foods and flavours, so Joey appeals to me more than the nearby Glow restaurant.   The upstairs patio is now a summer staple for me and the indoor dining is where I plan on taking friends for birthday dinners and other events worth celebrating. Go to the patio for lunch one day and you won't be disappointed. The vibe is much different during the day, at night it is much busier and people are more social.   I highly recommend trying their mashed potato rolls.   I'll end this review with a public \"thank you\" to the lady who had too many peach bellinis and felt social enough to approach me while I was shopping at Don Mills."}
{"text":"I've only been here for lunch or drinks after work a handful of times, but every time this  place looks to be full of businessmen and little else. The food here is just a notch above Moxies in terms of quality and presentation, but the waitresses look about the same. There's enough fake tan to supply a small troupe of Oompa Loompas and I'm sure these ladies would pay good money for a foot massage after walking around in their stilettos for hours on end. Yikes! I have too much sympathy to really hate 'em.   The lobster grilled cheese sandwich is a great order to share with a friend as an appetizer - Joey's does a good job. Mahi salad is good if you're looking for a light meal. Lots of drink selection and the patio is a great bet in hot weather!"}
{"text":"I would give it a 3.5 if I could, with the -.5 for only hiring artificial-looking waitresses that make you want to say  \"I'll just have a water and leaf of lettuce please - hold the dressing\".  That said, the food here is delish and the menu offers up some very neat and different choices for those who are sick of the usual offerings from the restuarant chains. My favourite are the flatbreads - tandoori chicken is a straight up party in your mouth, and a ton of characters are invited. The mix of the spicy tandoori with the cool yogourt is perfect, and I will never complain about sundried tomatoes being included in any of my dishes. The shrimp flatbread is also a great choice - the amount of shrimp vs. toppings is perfect, no flavour is too overpowering.  I also highly recommend the salads for lunch - but don't kid yourselves into thinking they're low cal. My favourite (name escapes me, but it has the word \"Beach\" in it) comes loaded with warm candied pecans....mmmm!! The porition size is also perfect for lunch.  The place is busy  and does not take reservations during the lunch hour. If you can manage to grab a spot and maintain your appetite while old buisness men lear at waitresses who are likely  the age of their own daughters, it's a tasty spot with amazing, out-of-the-ordinary food that won't break the bank."}
{"text":"We got there on a Wednesday evening and got seating right away. There was no space in the walking area between tables for a stroller so we ended up getting seating in the booth right next to the kitchen. It was a little distracting but they gave us a comfortable hook-on high chair where my son was seated comfortably. We first ordered the pizza for my son and the waitress went quickly to make sure the order was placed so it would come out quickly. We ordered the pesto shrimp flatbread and California chicken sandwich minus the bacon. We got the pizza and my son enjoyed it. The pesto shrimp flatbread was quite flavourful with the sun dried tomatoes, chipotle and mozzarella. It tasted fresh and was baked just right. We got sweet potato fries with the sandwich and it was good to! We've been here a few times and food has been consistent. It would be nice to have a small kids menu!"}
{"text":"I'm usually wary of these loungey Americana bar & grill chains, but Joey left me impressed! The space feels huge yet comfortable, in that you could see the entire first floor but at the same time your own table feels private enough.  I got the ahi tuna sandwich, which came with fries. The fries were pretty average -- your standard fries -- but the sandwich was really really delicious. The portion was big enough that I couldn't finish my sandwich (packed it at the end), but not in a way where you feel grossly bloated at the end. I didn't get to try any other food, but the menu overall looked pretty impressive, with a lot of interesting fusion flavours.  I just got black tea for drinks, but that wasn't bad either. (Can't go too wrong with black tea, right?) My friend and I both got tea with milk and sugar on the side and they didn't serve us anything to stir with! This seemed like a rather obvious oversight but wasn't a big deal.  I don't know how I feel about a place where good looks are SO obviously part of the hiring criteria, though. I definitely appreciate the professionalism of a waiter presenting themselves at their best, but you don't need a 99% thin white woman waitstaff to have that professionalism! I digress though. It was maybe a poor decision to place our group at a table right in the direct sunlight but the waitstaff was friendly and helpful enough otherwise.  It's a little expensive for a mostly casual joint, but if you factor in the nice ambience and food quality, I think it's worth it when you have the money to spend."}
{"text":"I had lunch today at JOEY Don Mills.  I ordered what I always order at a JOEY restaurant ... Rotisserie Chicken (minus the veggies).  I've had it there before and it was delicious.  Today it was just okay.  I have had this dish many times and today was the first time the gravy was served in a separate container, rather than being on the chicken and potatoes.  When I asked, I was told that sometimes it's in a container, sometimes it's on the chicken.  I would think from a brand perspective, it should be consistent across the restaurants and especially in one restaurant.  Plus the chicken was smaller than usual."}
{"text":"Other than slow service... This dinner was a 10/10. You know it's good when my 92 year old grandmother who ALWAYS sends her food back didn't complain ONCE!!! There were 7 of us.. And all of our appetizers , main meals and desserts were perfect. Tasted great and no complaints. I've been to Joeys before but I've never had this great of an experience. The items that stood out were the Hawaii tuna tacos ,  ribs and chicken dinner and the veggie burger! The rainbow sushi roll was over sauced , unfortunately. The veggie burger looked like art! This is definitely a place I would come back too with a group of friends or a date. I'm impressed joeys."}
{"text":"Went there to celebrate my birthday dinner with my girlfriend. Tried the lobster ravioli and it was spectacular. Amazing.   The only thing they should work on is their drink menu and offer more cocktail options   Overall, great portion size for the ravioli- just enough to fill you"}
{"text":"Dope spot. Liveliest you'll get in North York. Cool, attractive patrons and staff. Good appetizers. Food is overpriced but whatever all good. MUSIC IS SO GARBAGE. Non-stop shitty techno remixes of songs that are actually good. Get on that Joey Don Mills. Just play the hits man don't get fancy. Every song is just whackatry. Love y'all though I come here weekly."}
{"text":"I come here for 2 things the tuna tacos and sometimes the sliders. Everything else on the menu is edable but not great. Service is hit or miss. Management if your reading this your coffee cups are badly stained and when someone says the soup is cold do table check when you bring a new one it was cold the second time."}
{"text":"Joey's sort of reminds me of a slightly more upscale Moxie's. The decor is similar, the menu items are similar and the waitresses look similar, except these ones wear more modest pencil skirts, as opposed to the mini skirts that Moxie's favours.   That said, I don't think I have ever had as good a meal in a Moxie's.   I was having a HUGE craving for grilled cheese. I couldn't get it out of my head! So I went onto Yelp and typed in grilled cheese and this place came up as being open and not too far away.   So off we went to the Shops at Don Mills. I've never been to the Shops at Don Mills before, although I have heard of it many times. I'd be interested to come back sometime when stores are open, but in the meantime, into Joey we went. That sounded funny....  Anyway, we ordered calamari appetizer and drinks (beer and a cocktail). The calamari itself was alright, but I really liked the asparagus on top and the aioli.   Problems arose in terms of the drinks. The waiter recommended the bellini, but then it turned out that the slush machine was umm....slushing. I had to wait until after my meal came to get the bellini, but the waiter was very apologetic and gave regular updates to the progress. It wasn't a huge deal, but I can't help but take points off. When you are paying $60 for two peoples' dinner, you don't really have a choice, right??  My husband ordered a simple caesar salad, which was good, but basic...that's not their fault, that's just what caesars are. I liked the freshly grated parmesan cheese on top though. Better than the powdery stuff that comes from a jar.  Now...my sandwich. I of course ordered their grilled cheese, but this is not any grilled cheese, it is a LOBSTER grilled cheese...oh yes....oh yes....  The bread was buttery and crispy, the cheese perfectly melted and most importantly, it did not overpower the lobster. You could taste the lobster, which was in big chunks in the sandwich. It was delicious.   The sandwich comes with a large helping of their \"skinny fries\", which are similar to McDonald's fries, but less salty, thank God!   I NEED to have this grilled cheese again and this place is open late nightly, so good to keep in mind, next time I get a grilled cheese craving. The service is good, prices a little steep, but to be expected in the area. Next time I think I'll order the soup with the sandwich, because I feel like it will work more nicely together. I could be wrong. It remains to be seen!"}
{"text":"1st time...very busy. Chose Joey's to treat my friend to dinner for her birthday. Rather than wait for a table in the dining room, decided to sit at a \"communal\" table.  Service very good. Told the waitress it was my friends birthday, she said Happy Birthday, but left it at that. Not a big deal.  Tried appetizer... coconut curry dip with Naan bread - very tasty and unique.  Dinner was Herb Crusted Salmon - excellent. Great mix of flavours.  My friend had a Spanish dish which she wasn't very happy with. She said the rice was oily and not cooked well.  The rest was Good, but the quality of the rice spoiled the dish.  Great atmosphere.  A little surprised they use paper napkins in a seemingly classy dining atmosphere. I can fathom paper napkins after giving a cloth napkin to start.  As mentioned...the service was professional and somewhat personal in quality.  Impressed by this in spite of how busy they were.  I would return.  Good diverse menu."}
{"text":"The food is good.  Love the ahi tuna salad and key lime pie. Customer service could be better. Waaaay better. That's the only reason I gave 3 stars."}
{"text":"Forget about finding a seat if u come here on the weekends without reservations during peak hours. Super hard ! Either drop by extremely early or late (close to closing) and u will have better luck.  We had a nice meal here though. I loveeee the Grilled lobster cheese sandwich. Tastes so good w/ the yam fries :D It was just perfect. It looks like this will be something I will always order when I come here. Same w/ the bellini. It had a generous amount of alcohol in it...as opposed to moxie, pickle barrel, etc.  Service is always excellent here. But it's like another one of those yuppy places. They just have a 'right' to charge more for everything."}
{"text":"If i was being forced to go to a sircorp chain restuarant (alice fazooli's, jack astors, etc) i would force my friends out of it and go to Joeys on Donmills.  It's an interesting place, in the newly renovated don mills centre, and it seems progressive for the area.   The food is not bad at all - not amazing food, but well priced and interesting enough. The ambience of the restaurant is nice and upscale and the service is quite good.  What springrolls did to chinese food is what Joey's did to the $20-$30 chain restaurant sector.   For foodies around town, you're not going to have your socks rocked, but more than likely your group will enjoy themselves, especially if many of them are not real foodies.   It's a super busy place though, just to warn you.  It seems a convenient venue for those large group birthdays and out of town guests that you don't want to spend an arm and a leg on but still want the experience to be somewhat memorable."}
{"text":"We returned to Joey Restaurant after having a disappointing experience last month.  We were greeted by the manager and he brought us to our table.  We opted for a nice Riesling to start with, and our apps were Ahi Tuna Tacos and Sweet Potato Fries.   Our mains were the Tenderloin and the Maple Salmon.  Dessert was the Apple Pie and a Cappuccino.  I'm fussy with steak and my steak was cooked perfectly.  The food was amazing.  Management came by a couple of times to make sure we were enjoying ourselves.  Our server was attentive and she ensured all of our needs were met.  We left having an extremely positive experience, and we will be sure to return in the future."}
{"text":"We were introduced to Joey by a friend who likes to go places to be seen. While Joey has a great ambience and during lunch and after work is packed with young business professionals looking to mix and mingle this does not get in the way of the excellent food and super customer service.   The menu has a great variety of North American, European and Asian cuisine. We are particularly pleased with the Tempura appetizer. The veggies are crispy on the outside and warm and brittle on the inside. The sauce has just the right amount of tang.  My most memorable mains have been the french dip sandwich and the blue cheese sirloin. True these are not far out dishes but if a restaurant can get it right then you know you're in a good place. Joey Don Mills gets it right.  The wine selection is extensive and while our server hasn't always been the most knowledgable, someone has always come by our table to make suggestions. We've also brought our own bottle, paid the corkage fee and enjoyed our wine.  The noise can get a bit excessive in Joey and your best bet for a weekend night is to stop by around 4 or 4:30 p.m. to put your name on the waiting list. We've done this and when we walk in we're at the head of the line. We do this because their online reservation system only makes very limited spots available."}
{"text":"I came by this past Saturday, and despite how busy they were, felt very welcomed by one of the managers, Tarin, who got me a table on the dining room side. She recommended the lobster ravioli, which was extremely rich with plenty of pesto. Here is photo of the chocolate lava cake we had - the raspberry puree was a nice touch.   The food is always good, but I think Joey's service is where they stand out. This is a great place for dessert or appetizers + drinks with friends, since the atmosphere and service are great but the food is slightly overpriced."}
{"text":"On more than one occasion I have been disappointed by this location. Just to name a few:  1. Brought my sister here for her 19th birthday for her first legal drink and the waitress had spent so much time entertaining the table next to us of men than to see if we were okay. Our food was cold when coming to the table and tasteless and yet we couldn't say anything because getting this waitress was just as fun as pulling teeth. Once she FINALLY came over we decided just to get the bill - (even though I did mention this was a special event my sisters birthday) she just said \"oh happy birthday\" and walked away  2. It seems like getting anyone's attention while there is difficult, regardless of what time of day it is.   3. The last straw for me was when my boyfriend picked up a salad for my lunch at work and there was RAW chicken in the salad. (I called the establishment to let them know, not because I need anything more so that no one else will complain to them)  As much as the few times I go and things go well I have been ever so disappointed there is no point anymore. Every time I bring it up to my boyfriend \" HEY lets go to Joey's\" he always makes sure to remind me that I always leave upset so we always chose something else.  I do want to mention the manager I had spoke to in regards to the raw chicken was extremely nice and I do appreciate the effort that she had done for me, however one person definitely doesn't make do for everything that happens."}
{"text":"I have been to this place on numerous occasions and have always found my experiences quite enjoyable. It's an upscale restaurant with a great menu and good service. There is usually a wait to get seated at any time of the day throughout the entire week. This, I definitely recommend making reservations on weekends or else you'll find yourself waiting for AT LEAST half an hour.  I've tried many of the items on their menu and definitely found the following items delicious: ahi tuna tacos, seasoned edamame, ahi tuna sandwich, 500 salad, steak frites and their chocolate molten lava cake. Their food is consistently made very well and I have yet to have a complaint about it. Some of the staff can sometimes comes off a bit snobby (especially the front of the house), but the service is consistently professional. On my last visit on Thursday, I had a very sweet waitress that made sure my boyfriend and I were having a great time.   Overall, I think Joeys is a very nice place to eat. I love the area in which it is located and will definitely keep coming back here."}
{"text":"atmosphere: 4/5 food: 5/5 service: 0/5 drinks: 1/5 inconsistent drinks, clearly depends on which bartender is there. food is always fantastic. service is always disappointing, just terrible. if the company is only looking toward their image, they will fail, as there are better restaurants nearby that can provide a consistency in all areas. will reiterate: HORRIBLE SERVICE. never fails in that area each time we visit."}
{"text":"I just went there on a business lunch today and it was *Delicious*. After reading some of the reviews here and knowing my love for all things 'grilled cheese', I knew I had to try the Lobster Grilled Cheese.  SO GOOD. Lobster, Crab, Brie and Cheddar. It sounds odd but totally worked. Their prices weren't bad at all. The atmosphere was young and fun, not intimidating. It was packed in there at noon but it didn't feel hectic. Everyone is right about the waitstaff as well, beautiful girls were everywhere (which isn't a bad thing, even Monk's Diner on Seinfeld only hired Chesty Leroux's lol) but they do their jobs well to boot so everyone wins. I'll definitely bring clients there in the future."}
{"text":"Myself and a few colleagues visited for lunch during our work break and was extremely disappointed.  We have visited several times before due to location convenience but this time was the absolute worst.  We waited 10 minutes to be seated, waited 15 minutes for our sever to take our order - we had mentioned that we were on a time constraint because we had to get back to work. After waiting another 20 minutes, our food finally arrived - but it was ALL COLD! We alerted our server to this and he would have everything re-heated (which took another 10 minutes).  The negative experience made for a tense and unpleasant lunch and consequently we late returning to work.  We will not be visiting again and will be discouraging others from attending your restaurant as well.  Your service and quality has been comprised since you first opened.  With all the competitive dining spots in the city and the fast paced nature of our society - I would suggest you re-examine your operations to ensure a decent level of customer satisfaction."}
{"text":"Was not terribly impressed by the service here.  Arriving on a Sunday afternoon about 3 ish, the place was moderately full but we could definitely see there was lots of capacity for seating.  The hostess could give a toss that we were waiting to be seated as she gabbed away on the phone.  Well we waited and waited as server after server, manager after manager passed us by until finally I waved at hostess like I was flagging signals to emergency land a plane to get her off the phone.  Finally after much ballyhoo we were seated. Whew!  Despite the lackadaisical service the surroundings were pretty posh and modern, for a sports bar I'd say it was very aesthetically pleasing.  I kinda agree with Tony F's observations regarding Joey's Fembot Bimbo servers or Fembos, as I've dubbed them.  Was terrified one of them would wipe out with tray of drinks in tow, as some Fembos hobbled around amateurishly in their heels.  I've seen 5 year old pageant divas walk with more confidence! I digress...  The menu is actually very drool worthy as much of the food is of the deep fried or smothered in richness variety.  Let's see...hubby orders the Lobster grilled cheese and for myself I order the cheeseburger sliders and the Yam fries.  The food is so-so. My sliders and yam fries were pretty ordinary...hubby's lobster grilled cheese is decadently delish, and definitely heartburn friendly.  Not surprisingly the highlight of my visit to Joey's was the bathroom. It was a treck up a myriad stairs to get there but ahh what a sanctuary!  An oasis of mirrored splendour with  high dark wood stalls and petrified trees acting as sculpture adding natural warmth to the tiled and serenely sterile scheme.   Joey's is a \"classier\" flatter chested version of Hooters with a better menu and nice decor.  A great destination for  \"dudes\" and  \"bros\" with lowered dining expectations, who are willing to forgo service for a leggy, albeit 2-dimensional experience ."}
{"text":"One can look at high-end casual restaurants like JOEY in three ways:   1) From a pure foodie standpoint, one star. The food is uninspired, gussied-up renditions of familiar meals for the unwashed masses; oversalted and underportioned, a vehicle to promote alcohol consumption and swank.  2) From a dude standpoint, three stars. Pretty hostesses, wide booths and an overall relaxed vibe are more comforting than the food, which is geared towards guy-ish tastes; rotisserie chickens, allegedly healthy salads, safe versions of curries and asian fare, and a pretty decent beef dip on a pretzel bun sided with crispy fries, a creative taken on a club sandwich with seared tuna and delightfully crispy pancetta on springy fresh focaccia, or a slightly greasy grilled cheese studded with lobster bits. An easy answer to \"where should we go tonight\", or \"where can we meet up with the folks\", or \"I'm tired after shoe shopping, what's a good place to eat\". Less rowdy than Beirmarkt, more upscale than Panera, it is a restaurant shape to fill a lack. I could do without quite so many TVs, or slightly quieter music, but these are minor complaints.   3) For diners who seldom go out to eat, or whose taste runs strictly along meat and potatoes lines, five stars. Service is slow, but very courteous and unassuming. Portions provide good value, and you're not out of place in a suit or jeans. Releatively easy on the wallet, but still feels special.   I've occupied all three perspectives, and well, you can see where I land."}
{"text":"I like this Joey slightly more than the downtown (Eaton Centre) location, but I think that's just because this one doesn't have as many douchebags hanging about!  This time I tried the \"steak and sushi\" dinner, which was actually quite good. A 6 inch tenderloin comes sliced alongside a rainbow roll. Roll was nicely presented and fish was fresh which surprised me. I got to eat my steak with chopsticks, heaven!  We tried the rare tuna fish tacos for an appetizer. I was disappointed they were served in some kind of deep fried crispy shell, but otherwise these were delicious!  One of the things I dislike about these Joey restaurants is the sluttyness of the waitstaff. Okay, fine - at the Eaton Centre location, the sexy waitresses suit the atmosphere. But at this location, the clietele is primarily families - lots of people bringing their children here. Is it really necessary to have waitresses wearing hoochie gear serving kids? Lets stay classy, Joey!"}
{"text":"Myself and my boyfriend :)  Service - REALLY horrible when you come in. They offered us the patio or the dining room. It was a nice day so we asked for the patio and had to walk up a lot of these really steep stairs, that's not a problem. Problem was, once we got up there nobody offered to seat us. Are we to just pick a chair and a menu ourselves? Walked back down and told her we'd sit in the dining room. Nice waitress, a little too....informative? Every time we ordered she would tell us what we were ordering, which was the same information that was already in the menu. But she was very attentive and she was a good icebreaker on a first date, after we hadn't seen each other in forever (damn long distance relationships).  Food -  Chili Chicken - we shared, it was REALLY good! No complaints.  He had Lobster Ravioli - It was forgettable, he wished he ordered what I got. I let him eat my fries :P  Ahi Tuna Club is the BEST ever thing, I've EVER eaten at a chain. Not on the menu online, but it came with some sort of aioli on it that was just the best.   No dessert, we were stuffed. He got his leftovers to go and it came in this cute little box.  Also a little note on the area, it can be a bit pretentious...but if you don't care and dress decently you won't have a problem fitting in. Parking was a bit of a hassle but not that big of a deal. It was also hard finding the place after we parked the car, thank goodness for maps!  EDIT: read another review...valet parking? Huh. Good to know :)"}
{"text":"Of all my visits to Joey's, I must say this was the most disappointing one.  I ordered the spicy Korean fried cauliflower appetizer which tasted like batter, not cauliflower. My boyfriend ordered the ahi tuna tacos - It was not worth it, rather have ordered the baji fish tacos which has a better bang for buck. The wasabi mayo didn't taste wasabi, just tasted green colored lemon mayo. I ordered the chicken and pancetta club, with subtituting the fries for yam fries. Turns out my $2 substitution came with 10 fries, and yes you could easily count them all. Might as well sticked with the tall skinny fries when I could have gotten at least twice the more quantity. After this experience, I don't see myself coming back. I only gave them a 2 star rating because of their service."}
{"text":"I would have to give it a solid 3.5 This location is always busy which is good, never dead. Went today with 5 other girls after a bridesmaids fitting. I like how they have their online waitlist (http://www.joeyrestaurants.com/reservations) so if you are 6 or less you can click on it and it tells you how long the wait is and you can put your name on it in advance - tres smart! They have a vegetarian and gluten-free menu that you have to ask for if you are a vegetarian (moi and my cousin is a vegan) I always get the same thing - the beach salad minus grilled chicken. What I like is that they reduce the price if you don't have chicken on it, all restaurants should do this b/c that salad w/o meat is def not worth $16+. We started with the seasonal edamade which was yummy.  I have been here prob a dozen times before at the lounge for food/drinks and just the service isn't the best there. I was really impressed this time with our server in the dining room. Maybe they just get the better girls to work in the dining room vs. lounge. I really have had a handful of issues with the lounge girls in the past. The manager came by to ask if everything was ok for us which they did before, that was nice. But I still can't get one particular time I came here with a bunch of my gfs in the lounge, the waitress was such a disaster and unfortunately had an iq of a squirrel. she got all our orders wrong and got mad at us for it at the end, I can't rem what other disasterious stuff she did but she was horrendous. But I mean the food is good and it is a happening place so 3.5 it is!"}
{"text":"In the Don Mills shopping centre that I never knew about. A little square with a bunch of shops. There is a rooftop area that is pretty full. The prices are pretty average for the drinks. A nice bar/sitting area."}
{"text":"I come here on occasion for some drinks and the atmosphere. My go-to has always been the \"Lobster Grilled Cheese.\" Never really considered this much of a 'burger place,' but was pleasantly surprised.   The \"Hand-pressed Burger\" (upgraded to mushroom/cheddar) was impressive. The patty was thick and juicy...the extra mushrooms were also thick and juicy..the cheddar was not thick nor juicy, but tasted good and was non-processed. Accompanying straw fries did the trick.  The service here, like all the Joey's is a bit slow/inattentive, but nothing horrific. This will be a place I come back to for drinks, my LGC, and now, burgers."}
{"text":"I came to Joey's with my family and we got there at a later time and the food was great. I really enjoyed my steak and the little spin they had on traditional mashed potatoes by putting them in a spring roll. Although the food was great I found our server to be a bit slow and she kind of talked to us with a very uninterested tone. I understand that it was later in the day but service is still service."}
{"text":"A very nice place to spend a Friday night with a group of friends, very good location a spacious restaurant and a great menu. Staff are very nice and helpful and funny as well. I did order the shrimp flat bread a good portion and very tasty with a good spice. Don't leave the place without trying he chocolate raspberry souffle with ice cream. Going back there for sure"}
{"text":"We visited this place a few weeks ago and, based on the style of restaurant (read: chichi) a fairly good meal.  Sort of an end of summer treat.  Booking is kind of odd - you can book a reservation and/or be put on a list but we were also told that they do have walk in seat available.  Based on this fact, we could not get a booking at Markville and chose to come to this location as we would have found other places to eat if we couldn't get in.  Thursday afternoon in September - not going to waste time with a list.  We arrived just after 1pm and actually were seated quite quickly.  A rather interesting observation - I tend not to make them and/or have never made one like this - I would put money on it that 80% of the staff are tall.  The two female hostesses were quite tall, along with most of the waiters.  The only exception was who I believe was a manager - quite petite.  Also note they have two waiters - for drinks then for food.    Staff were pleasant but also I found the staff was a bit noisy.  During our meal they came to change/add/whatever the pepper.  Don't think they should touch things on tables being used.  Closer to 3pm I am sure they would have ample time to do that.  The decor is often mentioned in Joey reviews and definitely it is along the lines of high end to over the top.  Meanwhile, the decor directly in front of us, OUR TABLE was wobbling so I took a table coaster and put it to better use on the floor - added a nice flair to the floor decor.  The bathroom was clean and had a nice Dyson hand dryer - a very small version that hung on the wall (v. the larger one you move your hands up and down with) \"note to self ... might be a good one to put in our powder room that gets no air circulation to dry the towels - a great replacement\".  Meal wise I ordered the CAB® Prime Sirloin.  It came with asparagus and mashed potatoes in a spring roll shell.   (!!).  The sirloin was about 7oz and I ordered it well (I tend to get medium well but find that most times outside my home it comes a tad more cooked than I want).  It arrived not as warm as I would like but nonetheless it was very good.  However, I could have used the extra ounce.  Per their menu: \"CAB® Prime steak is graded the top 2% of all steaks in North America  We have selected CAB Prime for all of our sirloin cuts\". ... said another way ... expect smaller for more money.  Could I tell it was within the top 2% of ...?   No I did not (but my wallet did ...)  My better half had the Roast Chicken Entree.   The chicken apparently are \"brined for maximum moisture and spit-roasted to perfection.\"   It was a half chicken (enough to take some home) and it came with a rather delicious gravy.  She substituted mashed potatoes for fries but they were an utter disappointment.  Tasted \"okay\" but compared to the rest of the roast chicken entree, sirloin steak, amazing Dyson hand dryer, over the top decor, and statuesque staff, the fries were plain and nothing more special than say McDonalds.  At the very least red potato fries from McCains would have been more worthy.  Work needs to be done here for sure.  I have given THIS location a 4 star but it is more a 3.5 at this time.  I already baked in from the get go that this wasn't a value play - so accept that at face value .. hey they didn't list soft drinks on the menu so I am sure I couldn't afford them.  Chuckle.  Takes AMEX."}
{"text":"Great crowd, great sound, and definitely a great place to go with a bunch of friends after a stroll around the outdoor mall. The mall always reminds me of \"the village\" in Vancouver for those of you who are familiar with the West coast and that's why I love the place so much. I always give attention to detail and Joey's restaurant met all my expectations. My guests were entirely satisfied with their meals and so was I. In fact we ended up ordering sushi on a second round because it was this good! The food is a bit pricey, but you do get your money's worth!  I always comment on every restaurant's restroom and this place gets a 10/10 on the cleanliness, spaciousness and decor. When I walked upstairs and saw the patio, I promised myself to come here when its patio season."}
{"text":"Came here after work for dinner and we were blown away by the delicious food and exceptional service! You should definitely give it a go at the Steak Sushi! Very comfortable and relaxing atmosphere to dine or just to have a few drinks. Recommended!"}
{"text":"Ate here on my first visit to the Shops at Don Mills. The venue, particularly the patio, looked great. This location reminds of the cool Californian outdoor malls in the OC. The service was fantastic, mainly because it was so quiet. The servers were super attentive and pleasant. The menu goes beyond regular pub food with a heavy focus on steaks. The ahi tuna tacos were decent appetizers. I also had the hand pressed burger, which was delicious. The accompanying fries were too salty. Overall, I think I prefer this location over the one downtown, simply because it's not as busy."}
{"text":"Nice restaurant bar. Excellent location. Great view from upstairs. Reasonably-priced' & good staff... I've been to the oberlechner in Bellevue WA and this place is huge."}
{"text":"Came here for a casual dinner on a Thursday night. Place was semi-full when walked in, waited few seconds to get great by a host then taken to our table. The waitress was very professional and friendly and took few times back and forth to discuss drinks' options with my guest.  All questions about the menu were answered  properly, and she had recommended few things on the menu which worked out perfectly.  We got the Calamari for an appetizer which was Amazing! Along with the chilli chicken which was a great choice as well.  I then had the protein burger with the house salad, and that was pretty good for what it is...the house salad was the star of the dish. While my guest had the 500 super salad, which was pretty good..might be too \"grainy\" for a salad, could've certainly used more greens than grains. But all in all, pretty good location, Service and quality."}
{"text":"Joey Don Mills in Shoppe of Don Mills is A-OK if you are looking for a place midtown to meet up with your friends. I definitely suggest to avoid coming here on Fridays and Saturdays evening as it is not really worth the wait....  Starter Caesar Salad ($6.99) - for $7 this is the smallest Caesar Salad I ever have... I definitely suggest to skip as you can get Caesar at half the price and as good somewhere else   Grilled Lobster Cheese Sandwich ($15.99) - cheeeeeeseeeee and lobbbbbbbbbbbbster - fries are cold and soggy when served, but  waitress got us another one immediately that is fresh after I complain..  Halibut Pasta ($19.99) - Halibut nicely done...  - my dinner mate finished the whole plate without offering me any.. so I guess must be quite good  Chocolate Souffle ($7.99) - Warm Chocolate Lava Cake with Ice Cream  - I had better but this one is quite decent   My waitress is nice and sweet with her little black dress. But I definitely think she has too many tables to look after and it is hard to get good services. Our meals were just served by someone else without even asking if we need anything else.. and we do need freshly grounded black pepper....   I do love their daily drink specials...  Maybe I drop by on a weekday when Joey is not too busy!"}
{"text":"I've been coming to this Joeys since it first opened and have generally always had a pleasant experience, with good food and drink. But I came back 2 weeks ago for lunch and 1/3 way through my chicken salad, I noticed a hair in it. I politely asked the waitress to take it back to the kitchen and explained that I found a hair in it, and she said nothing for a good 5-10 seconds while she inspected the dish with an annoyed look on her face as if I was inconveniencing her somehow. She didnt apologize, but said she would take it back to the kitchen. I believe a supervisor or manager came out to apologize after, which I appreciated. She said the dish would be re-done, and it came back out a little while later. I was honestly pretty shocked though that when they bill came, they offered no discount or comp for the salad as a good gesture. I work in the restaurant business and even when a dish is slightly late/delayed, we've given discounts/comps out. That's just how you attract customers to come back and to spread the good word about your customer service. But instead, here I am now, letting you all know that if you find a hair in your food at Joeys, they dont care to make a better impression on you, nor do they care if you come back"}
{"text":"4 stars for ambiance and service. Food is \"okay\" to \"good\", depending on what you decide to get. I got the baja fish tacos, which were tasty and filling enough, but I would not crave it. It was  a dish of 3 tacos, but I don't think it was worth $15. Also got the calamari fritta appetizer which was okay as well, but came as a smaller portion than imagined. But other things that seemed popular and tasty at the table were ahi tuna burger (thick slice of tuna topped with two onion rings in between two burger patties) and the \"sushi\" selection on the menu, including the rainbow roll. I also enjoyed my $9 sangria - you could really taste the \"fruit\" part of it, unlike other cheap sangrias I've had from other restaurants before.   Place was really popular and busy on a nice warm Friday night. There was a bar in the back of the first floor with tall tables and tall chairs nearby. Lots of people (i.e. after-work crowd) seemed to crowd around there and seemed to be really enjoying themselves. There was a huge TV in the bar area and smaller TVs dispersed throughout. But there is also regular seating for just dinner/drinks as well. Took a peak on the second floor which is a nice enclosed patio area with lots of nice lighting. There also seemed to be a bar up there as well. The place started winding down at 11pm-midnight, even though it closes at 2am on a Friday night.  Overall its a good place to go with friends and catch up. Nice ambiance and lighting. You don't really go there for the food. Seemed to cater to the young adult crowd."}
{"text":"Love the location and the restaurant overall. The staff were friendly, however, the service can improve. I feel like the waiters tend to be a bit slow, even if it's not crazy busy.   However, the food is amazing. For the main meal, I would recommend the Bombay butter chicken, it's so good! I have also tried the molten chocolate cake.. to be honest, it's not the best, but the vanilla bean ice cream which is on the side, is amazing."}
{"text":"One of my fave places in toronto. The ambience, the food and the drinks are all awesome. A must to come if u ever visit toronto  for dessert get the apple pie  a must have Is the lobster grilled cheese sandwich and the ahi tuna club."}
{"text":"After having sub par service at the downtown location, I am pleased to say that the Don Mills JOEY's had excellent service, with friendly and attentive staff. This location is quite nice; the dining area is more spacious and there is a gorgeous patio area on the second level, which is a great place to dine on beautiful days. My friends and I ordered the Spinach and Artichoke Dip to start, which turned out to be more of a cheese dip with flakes of spinach. However, we tried all of the salads, and they all turned out to be great choices: fresh, large-portioned, and satisfying. Overall, the experience was great and I would definitely go back!"}
{"text":"Last Friday my friend and I ended up at Joey's. This had been our second time there.. we arrived closed to 11:30pm and could not believe how packed the pace was (that is a good sign). We were able to get seating in the dining area but not the bar.. a little disappointing but understandable. When the waiter came around we weren't ready to order yet so we started with some water and lemon... when the waiter returned he only brought us water. I then decided to order \"The Lucky Country\"  - Australian Shriaz Red wine. I asked for a 9oz which would have costed $15. My friend decided on a coke and she was the DD for the evening. Along with my wine order we decided to order the Spinach & Artichoke dip which came with warm corn tortilla chips and jalapeño salsa. It was very tasty. My friend also order a mushroom soup. She said it was very rich with flavour and delicious.  When the waiter came with my wine and the food I didn't even see him put down a plate of lemons for our waters. I didn't even have to ask him a second time. I remember telling my friend after the water came, \"Why do I bother to ask with lemon, they never bring it.\" This time I decided to not ask a second time and I didn't have to.   We then decided to order the Italian Flat bread with tomatoes, peppered salami, olives. This item was so mouth watering and full of flavours that I have decided this will be a staple and a must order when I go back there. At this time I decided on a second glass of the same wine.   When the bill came I was expected to see a $30 charge for my wine and noticed there was only a $20 charge. This all began to make sense because I normally only order 1 glass of 9oz wine when I go out and to have gone through it quicker than usual I should have realized it was a 6oz opposed to the 9oz I ordered.  All in all great place to go and have a social night out with friends or even a hot date :)"}
{"text":"It was freezing and after shopping in the cold, a nice light lunch would be perfect as my curiosity popped why there's valet parking for this restaurant.  It must be an amazing place and expensive!  If it's packed at this hour, high price must be worth it.  Wrong place for a light meal!  Calamari rings are mini ringlets like dime size with two fried asparagus.  I would say that two small squids were sliced thinly then dipped in batter to make them look big lol....crazy!  And they call this dish for sharing?  I suggest that they remove this item under sharing.  We also ordered a Rainbow roll which is nicely plated but sushi rice is overcooked. Geez. I thought kabuki's Chirashi was bad with a big bowl of perfect sushi rice but only few pieces of sashimi.  Joey made this Rainbow roll into a five star meal but one star taste."}
{"text":"I'm quite a fan of Joey, to be honest. Although slightly too pricey for my liking, I can always count on Joey for a good meal.  One thing that I love is that they offer you complimentary appetizers while you wait (and the wait is usually longggggg). I've snacked on their gyoza, Italian flatbread, sliders, apple pie and sipped on red wine while I waited for a seat. I'm glad that they take reservations now, but you still have to book many many days ahead!  Some of my favourites include:  Lobster Grilled Cheese: so buttery and delicious!  Baby Back Ribs: I love the ribs at Joey! incredibly fall-off-the-bone tender and flavourful!  Lobster Ravioli: creamy and rich, not the healthiest option but absolutely delectable!  Mushroom Soup: very intense mushroom flavours. You can order it with a salad and a wedge of garlic bread for $12.99   I also used to love their Italian flatbread, but they've since modified that item, and I like it less now because it uses salami instead of Italian sausage.    Services is usually great, and the place gets very busy. The only thing I have to really"}
{"text":"Oh, Joey. You win again.  When you step inside, the outlet mall vibe slips away and you're hit with \"sleek,\" \"dark\" and \"modern.\"  I can't speak for their food but they have a large variety of beer and cocktails on their menu. Impressive for a shopping mall location, I thought.  It's a great place for large groups. There are comfortable leather seats and booths all around. It's truly a lounge where you can just chill out and have a few drinks.  The service isn't great. My cousin brushed off this observation, explaining that they haven't been open for very long.  I accused him of being biased because he thought all the bartenders were hot (which they are). He started to defend himself but his eyes were lost in \"thought\" or something.   But hey, I'm not bitter.  Whatever. Just don't expect incredibly fast or attentive drink service, even if you order from the bar area.  The overall vibe is cool and the drink menu is great so if you've got some time, get a big group and go."}
{"text":"I love Joey. All their dishes are delicious. We waited about 30minuted to eat our dinner, but the manager came to the table to apologize. At the end, we didn't have to pay except the waiter's tip."}
{"text":"Dinner was absolutely delicious and all 4 dinner items we've ordered were fresh, the flavours perfect and unique. We will definitely come back again."}
{"text":"YahhhhJoy of foods.....love the interior and foods. And people...in my opinion, the food are decent and good to share with other.."}
{"text":"As we arrived we decided to eat and drink directly at the bar. Overall service was the worst I've ever experienced here.  First I had to get the bartenders attention to get served. There were three bartenders behind the bar.   Second I ordered the sushi and steak. The food was good. The bartender didn't give us any condiments. We had to ask for everything.  After dinner I ordered a coffee. When I received my coffee, it didn't look right. The bartender was too lazy to get a fresh cup from the back so he put two shots of espresso and hot water to top off the cup. Too lazy!!! After I complained he went and got me a proper cup of coffee. Again I had to ask for cream and sugar.  What happened to this place. The service has really deteriorated since it first opened. I guess this is why is was quite empty on a Friday night, primetime."}
{"text":"I have been in this time few times . I love them all . This place is classy and has nice atmosphere . I love their calamari , salad The steak was absolutely nicely cooked, juicy and highly recommended.   However, the atmosphere was more like when groups hang out. The waitress set us to a seat surrounded by large of groups...very noisy the whole meal. A little bit disappointed.   Will go again!"}
{"text":"Love the decors and service there. Pretty ladies everywhere!   The salad and butter chicken were pretty good. I was expecting hardcord westernized indian/thai food, but the quality surprised me.   Fav place to eat for work lunch."}
{"text":"I've been coming off and on to this location since it opened years ago.  The formula still works.  Put in a large cool bar and stock it with more alcohol than needed to inebriate a small country.  Add to the wow factor by having attractive and tightly cladded servers and hostesses.  Joey's Don Mills does it one better by putting a rooftop patio with retractable roof and another cool bar.  A collection of bar stools, high tables, booths, and low seating makes hanging out in the sun enjoyable for everyone.  Service has always been spot on.  Happy hour drinks are nice - $4 beers and $2 off on glasses of wine.  Food on the other hand is passable.  I usually stick to appys and not eat a meal but sometimes you have to and when you do, stick to the classics.  Some of the fusion stuff and sushi things are not that great.  Parking is horrible.  Don't circle around.  Park in the tower and take a short walk.  You're gonna want to take a walk back to the car to guage your drive-worthiness after a night at Joey's.  If you can't walk back to the tower, you know it's Uber-time!  Cheers."}
{"text":"Just wanna say I never ever complain restaurants or servers.I'm server as well.I understand how hard situation.It's really hard job.Anyway I got their Ravioli.I ate a few raviolis and found hair.We all said ok it can happen we all human.Some of us server so we were nice with server.Then she said they gonna take care of my food I said it's ok.I asked for second plate and then guess what happened? Again hair and bigger than other in my ravioli.I didn't even touch as soon as I can I called server.I was so hungry I just came from work.After seen hair 2 times in my food my appetite gone.Didn't wanna eat anything else.I just got desert.They didn't charge my desert.I got only my drink bill.But come on we all said should be free dinner.I mean how much drink cost for them$1-2 half of them is ice anyway .Forget everything.I expected to see manager .The reason I didn't tip her she should bring manager to our table.That is proper attitude and customer service .All night could be better at least manager could come to our table and say sorry.I ordered cake for my friend birthday no one sang for her.That was other thing as well.So if anyone go there before you eat check your food please if hair in food or not! First and last visit!"}
{"text":"Food is standard Joey's fare; service can be better (latest visit, the service was HORRIBLE)."}
{"text":"I get many requests for this restaurant from my customers so I figured I should try it out.   I brought my favourite shopping buddies and we headed out into the cold. I warned them in advance of the \"models\" that worked there lol. They seem to contain them to the lounge so it wasn't too obnoxious.  I liked the decor and the location couldn't be better.   We started with the Earth and Turf. What a fabulous idea! Why don't more restaurants think of combining calamari with deep fried veggies? Very very good.  My friends both had burgers and I had the chicken club on a ciabatta bun. All of it was great. My yam fries with lemon aioli were so good!  Had I not eaten every single of one I might have had room for dessert. Oh well good excuse to go back! The burgers were apparently very good and very big. It's always shocking when not one of us orders dessert but we were really really full. Oh and the best part was the bill - $25 each. Not too bad considering the location.   We will definitely be going back."}
