{"text":"Came here with my boyfriend for drinks and ended up playing pool for a few hours. Super friendly staff but limited menu. Prices seemed alright and the popcorn they give out at the bar was really good!"}
{"text":"Stopped in here after seeing it change from trapuzanos.  The first thing that caught my eye was that they have good/drink specials every night (see picture) and happy hour weekdays from 5-7 (half off drinks).  The atmosphere is definitely upgraded from the previous places and hopefully the specials will draw in more people.  The highlight of the improved atmosphere was the pool table lounge area.  The draft list was pretty good with several nice craft options. Only got a beer today.  I'll update when I go back for some food."}
{"text":"I was an avid fan of Trapuzzano's and to my surprise, the re-branding was even better!  The space is great and the food (esp. the Wedding Soup) is delicious!  Great job!"}
{"text":"The drink was well made, but overpriced especially for a place was empty on Jam on Walnut night when literally every other bar on Walnut street was packed. Weird vibes here and for a place that is clearly not doing that well, way too expensive. You have to lure people in with cheap drinks!  Won't be going back."}
{"text":"I liked everything about this place!  The food, the drinks, the specials, the staff!  Highly recommend for casual dining."}
{"text":"For a grill restaurant, I would expect my medium cooked meat to not be dry and tasteless. Johnny  Os suck in this aspect. Even after I told the waitress that my meat isn't cooked as I asked,  she doesn't send back the plate.   Their service is slow,  portion size is small and the food is just meh."}
{"text":"Why do I feel like the only people writing positive reviews about this place are likely employees trying to fix the already poor ratings. Truth be told, nothing that ever went into this space has ever done well, since Max and Erma's left years ago. This place will fail, just like every other establishment. The space is too large and a 2nd floor kitchen/dining area is on the floor is inconvenient for guests. On top of that, after reading a review that an employee of this establishment threatened to STEAL from a PATRON is absolutely insane. Even if meant as a joke, that person should be terminated immediately, and has no business being in the service industry, and would be better off on the street. That being said, it's clear whoever is leasing the space is trying to be a hero/savior, and turn the place into competition for Marios and William Penn, but with many successful business in the same corridor already existing, there really isn't room for another. Bad business decisions leads to bad hiring, which leads to bad employees and bad service, which leads to an empty establishment. Sorry, Johhny O's. For now, we're gunna call you Johnny No Thanks. I'll stick to Stacked, Tavern, and others."}
{"text":"I have not had a chance to try their food but this review regards their employees.  Friday, April 29th, my friends and I went to dance and enjoy the DJ which is usually fun. The bartender who was abrasive the whole night called last call at 1:30, but then denied to sell instantly after which was surprising, buy we ignored it. The shock was when another employee began threatening to steal from us. After 15 minutes (1:45), the bartender came over and yelled at us saying we had to leave (close at 2AM) and again as we were leaving the male employee threatened theft and tried to intimidate us.  This is a newer establishment, which is currently not popular and generally not busy. This is not a way to treat patrons. We will definitely not be back."}
{"text":"If you are looking to drink for cheap while playing darts or pool, this place might work for you.  If you want to eat, I would look at almost any other bar in Shadyside.  The menu is really small and really just 4 options for burgers, flatbreads, salad, and pasta.  (There was an advertisement for soft pretzels and dip on our table, but they don't even have that on the menu which was weird.)  I came to Johnny O's with my two friends, and we were the only people here besides some guys playing darts.  The service was SO slow, and the bartender spent the whole time texting and watching TV.  It took over 40 minutes for us to get soft drinks.  The kitchen got our food out quickly, but the burgers are so bland.  I ordered the Western Burger ($8), which had bacon, BBQ sauce, Pepperjack cheese, lettuce, tomato, mayo, and pickles.  The BBQ sauce was not good at all, the bacon was kind of a weird color and under-cooked, and the cheese did not taste at all.  One friend ordered hers without tomato or mayo, and those still showed up on her burger.  The burgers were so greasy that the bun was mush before I made it to the end.  The actual beef burger was pretty good so I might consider getting a cheeseburger if I returned, which is unlikely.  The bar is really large, and the single pool table is cute.  But with The Yard, Stack'd, Harris Grill, and so many other places with good food and drinks nearby, I am mostly unimpressed.  Unlikely to return."}
{"text":"Concentration Camps probably had better food than this place. Just turn this horrible restaurant location into apartments already. They should call this place Johnny No's"}
{"text":"Knuckle-headed patrons in a knuckle-headed environment acting like knuckleheads....evidence that Walnut Street has \"jumped the shark\". Note to Johnny O's staff: keep your resume handy cuz you will be circulating it shortly. This place is circling the drain."}
{"text":"Really like this place. I have a feeling this place will be hopping once people start hearing about their incredibly reasonable prices.  When I went in earlier this week I was astounded as to how big this place was.  Their menu was pretty  affordable for Walnut St also their drink prices were not bad at all. I love the fact that they have a nice dart board and a pretty sweet pool table.   I didn't order any food, but I did have a taste of their fries, which were pretty darn good. Oh and their burger looked delicious. The beef patty looked freshly made, so that was something I totally appreciate. Excellent addition to the neighborhood."}
{"text":"We were frequent flyers at Trapazano's and are disappointed that the establishment decided to close. That being said, we stopped in Johnny's during the art festival and had a pleasant time with friends having a few craft beers during happy hour. The bartender is very sweet and knowledgeable.   The disappointment is that management is not ensuring good housekeeping. Bathrooms needed a lot of attention and we couldn't help but notice how dusty it was coming up the steps. As a business, you know what this makes customers wonder.  We went elsewhere for dinner."}
{"text":"We figured the prior establishment (an Italian chophouse) wasn't going to last but it was decent so when they revamped and decided to give it a shot under a different name (Johnny O's) - we were skeptical.  Rightfully so.  The service was abysmal, manager oblivious and more concerned with a girl at the bar, and the food clearly prepared with major cost cuts in mind.  I understand the notion of trying to compete with Marios but that means you have to actually be trying.  These positive reviews are more than likely fake."}
