{"text":"Typical bar food but pretty good. Good beer selection"}
{"text":"Great selection of beer, decent menu offering.  I often have lunch here and wish I could enjoy one of the many varieties of beer available.  I've eaten lunch here over 30 times and dinner here many times.  The lunch specials are an ok deal at $6 for food, side and a drink.  And the food is some of the best in the area (which says more about the food selection in the area than the quality of food here). The salads are huge with fries on top, the pizza is good with a slightly sweeter sauce, the hoagies are too big for one person at lunch, but still good.
The big downside here is the service.  You might be the only table there at lunch and it will still take you over an hour to order, get ur food, eat, and pay.  They don't have a real sense of urgency here, though it is a tad faster than Lucci's down the road.
For those rating this as a 5 star restaurant,  I urge you to eat somewhere other than a place with a drive up window. This is bar food at bar food prices.  The beer selection is 4 stars, but in general because it's bar food and slow service I've got to give it a 3 star rating overall."}
{"text":"Good food. Service is usually pretty good. Jessica is always a pleasure I you are lucky enough to have her take care of your table."}
{"text":"One of the best places in the area for good \"bar style\" food. I can't really complain about this place because it everything you want and more. They have a wonderful and deep selection of craft beer and the place looks small but it is quite big inside, more than you expect. The service is very good too. You never have your drink empty. If you're going to get anything I suggestion the wings or loaded sandwiches.

Cheers!"}
{"text":"If I had to choose between this place and another place I would always choose the other place. Everytime I go there the service is slow and not friendly. They act like it is a burden for you to be there. Also I have gone to go there at 9:30 at night and they are supposed to be open till 2 am and they were already closed for the night at around 9pm. This has happened on multiple occasions. It is close to where I live so I try to give it the benefit of the doubt but every time it proves my point of why I never go there. The food is ok nothing to brag about. The beer selection is wide and is really the only reason to go."}
{"text":"Have been there twice , both times servers were unfriendly.  Never had the wings, but the sandwiches are small, not generous portions at all.  We had a party of 8, two separate checks, and the server added her tip in.  That is fine, but let us know instead of dropping off the check and walking away."}
{"text":"We were a party of  four adults, three children.  The place wasn't busy at all. We had to wait 10 Minu for someone to wipe one of six tables clean so we could sit. Drinks came I'm a timely manor.  However waited what seemed like forever to order dinner. And at that it took over 46 minutes for or order to arrive, at that two meals were wrong.  One meal fixed right away, the other took 20 minutes to fix.  Our server was a wreck!  Wrong dressing, wrong drink, didn't bring refills, kept repeating that the kitchen was making all the mistakes!  This was by far the worst \"dinner out\" I've ever experienced!  Maybe it's a good place to go to have a couple of drinks, but not for dinner!!! On the brighter side, food was average!"}
{"text":"My friend and I went to Johnny's Wife's Place II on a Tuesday about 6pm.  They have the place partitioned between the bar area and the more family friendly dining area.  I am more of a fan of sitting at the bar especially if there is a party of 2, but she preferred the dining room so we settled over there.

The place is kind of divey, but it wasn't dirty.  My friend commented that they did some remodeling since the last time she was there.  The service was nice and not slow.  They do offer craft beers but like so many places they don't include the ABV and when ordering IPA's I find this an important fact to know, especially if you are the one driving.  So as I found out later the IPA I ordered was nearly 10% ABV!  Gee I wish I knew, I had two of them...shhhhhh....

The food was ok.  But again this is not a dinner restaurant.  They serve bar food.  Wraps, app's, burgers, salads, wings.  Now these things can be good or bad or just mediocre.  I had the roasted red pepper wrap and it came with house made chips.  It wasn't bad but pretty standard.  I think this place is a good stop to watch a game, have lunch, or as stated for some typical bar grub.  I wanted to try their wings but they were \"market price\" I believe half a dozen was about $9.00, and a dozen about $16.99.  A bit pricey for a bar in Irwin."}
{"text":"Sweet and spicy wings were very good, hot cheese balls excellent, burgers and wraps very good...nachos good do not recommend adding the pork to them though it was dry"}
{"text":"Food was so k but an 830 last call (not the first time for us) is horrible. Servers act as if there doing you a favor... I am very over it"}
{"text":"Local bar that serves bar type food. There is separate dining area that has a few tables and video games for the kids.   This is the type of place to get some casual food and beer.   Overall, the food is good, and the beer selection is large enough to satisfy everyone."}
{"text":"This the third time I've tried the wings here. They are nowhere near as good as the original in Jeannette. My wife and I went Monday 12-30-2013 for the wing special. The wings were not cooked enough, not seasoned with anything. They came out quickly like they were sitting in the back ready, only they needed cooked further. The hot sauce that came was not the one I wanted. I asked the shorter dark haired waitress for another kind. I tried to explain which one but she was not willing to be helpful. After waiting for minutes and asking her again, (she said she was trying to get back into the kitchen, but she was just making drinks) I finally got the hot sauce. The hot sauce in Jeanette is also much better. If you live in Penn Township it's worth the extra miles to drive to Jeannette. The short dark haired girl hopefully was just having a bad night, if not she should not be in the service industry."}
{"text":"Different atmosphere than the original in Jeannette. They renovated again recently, but I can't say exactly how long ago. Some things I like about the remodel - the bar area is much bigger and can accommodate larger parties. They also have booths, which I prefer over a high table. The bar area is clean and has plenty of tv's...so it's a good place to watch a game. One problem is that now there is all this open space in the middle of the room, which is kind of awkward. I went here for a work lunch recently and, since there were five of us, we sat a high table in the middle of the room. It was uncomfortable. The other problem is, they cut the dining area way down, so now there's just a handful of tables over there and it's completely separate from the bar area. So frankly, one would feel really \"left out\" sitting over there, like a kid who got sent to the corner for a time out. Just a weird set up.

The food is good and they have the same menu as the original JWP in Jeannette. But, if you're watching your calories, you're out of luck. Most of the things on the menu are fried...it's definitely bar food. My favorite sandwiches are the grilled chicken, bacon, and cheese sandwich and the Jayhawk, which is a chicken sandwich and comes with blue cheese and hot sauce. Their salads are also good, but again not a healthy option, with the Pittsburgh tradition of fries on top and most come in a fried tortilla shell. However, you can obviously opt out of the fries and/or shell. Their wings are delicious, but as I've noticed with most other places, so expensive anymore! 

Service is hit or miss. I've come here and had a great server...other times, not so much. I stopped in here earlier this week to pick up a to-go order and there was one waitress/bartender (that I saw) for the entire bar area. For a Monday night, the place was very busy. She was running around, never acknowledged me standing awkwardly by the bar. After she flew past me for the third time, I stopped her and said I have an order to pick up. She quickly got it for me and gave me my change. I'm sure I'll be back, but I still prefer the original."}
{"text":"It has been about a year and many visits since I review Johnny's, and they are still doing great things.

The appetizers are always delicious, and they are not too outrageous either.  Not to mention, they always come to the table nice and hot.

I am a huge fan of their wings, and yes, they may be a little on the expensive side, but they are worth every penny.  Last time I reviewed I said that I did not like the fact they had the sauce on the side, but actually now that I have been there so many times, I have gotten used to it and truthfully do not mind dipping each wing.  Hell that also lets me try a few different sauces.

Did I mention that the staff is great, and the Bartender is absolutely hilarious.  I would literally just come to the bar to talk to him and have a drink."}
{"text":"It should be noted that this is now called Black Sheep Bar and Grill. 

As soon as we sat down and got a curt reply when asking about the beer menu (that was posted on the wall on the other side of the restaurant) we knew this was going to be an interesting experience. 

We placed our order, including appetizers. After our order was taken that was the last time we saw a waitress or anyone checked on us for 40 minutes. We did not see her again until she noticed us being increasingly annoyed with the neglect we were receiving. Empty drinks, no appetizers, forgotten customers. 

Once she came back we mentioned the appetizer that we have yet to receive and she did apologize that the wings were taking so long. Our fries came out cold and with all the cheese solidified. 

It was 50 minutes before we received our food. Still with no drink refills. The wings were hot and the sauces were delicious. The sweet and spicy BBQ was excellent. 

The service was slow and terrible. I would recommended getting take out and avoid spending anytime in there unless you got all night."}
{"text":"My boyfriend and I love johnnys 2. We usually sit at the bar. Bartenders are always nice and attentive. They always have something that I like on tap and have a pretty good bottle selection too. Every food item I've had here has been amazing. The turkey bacon club is my favorite and the fries are delish. Buffalo chicken wrap, pizza, and the wings are all awesome too. We live closer to johnnys 1 but make the trip to this one because we like the atmosphere, food, and employees a lot more. Try it out you won't regret it!"}
