{"text":"This was a fun place to watch the Italy -v- England game on Saturday. One big screen, plus one GIANT, cinema-sized (well, nearly) sized screen ensured everyone had a good view. This was impressive in itself, how often do you go into bars to watch a game and are left straining, ducking, crouching, ninja-jumping and stretching to catch a glimpse of what's going on?

The bar was full of Italians, with a smattering of English people, lots of neutrally-interested Canadians, and a few Irish wrathfully cheering the Italians on. Excellent!

It was great fun, the staff were nice and the prices of the drinks were average. It was nice to see they didn't hike their prices way up for the World Cup or the ongoing Taste of Little Italy festival. We didn't order food, but they had pizza on offer and those eating it said they were very impressed with its taste and value.

I would definitely return here to watch a game if I was in the area, but its not without its flaws and annoyances ...

1) We reserved a table so we could go about and enjoy the Taste of Little Italy festival safe in the knowledge that we could return to the bar and have a good view for the game, without having to get there crazy early. The friendly server gladly took our reservation, but when we arrived ten minutes before the game, the seats around our reserved table had been taken. The TABLE (one of those circular mini-tables to rest on and stick your drinks on) was happily reserved for us, but we had no bar stools to sit on. The staff had allowed the accompanying seats to be taken by other customers, despite a big 'reserved' sign being on the table. Surely that's the point of RESERVING a table - to actually have seats as well?! So all we actually reserved was a table to put our elbows on. Very annoying. We stood at the bar with our useless table, which was also used by about ten other people, for the entire game.

2) The first of my two bottles of beer was warm. Almost hot, in fact. If it had been a coffee I would have been impressed with how fresh it was.

3) Washrooms are grimy.

3.5 stars - if it wasn't for the reservation ridiculousness I probably would make this 4.5 despite the other two annoyances."}
{"text":"I'm torn.  

I had the poutine.  Fresh fries, flavourful gravy, cheese curds were not squeaky but melted nicely under the hot gravy, and it was topped with bacon!  Very generous portion.  Solid four stars. 

I went to the bathroom and it was a disaster  zone.  1 star.

The place was packed solid because it was a special night. The air was hot and heavy.  They need better air circulation.  2 stars.  

I liked the bench on one side and tables with chairs on the other.  Way more seating than expected, always a plus.  4 stars.  

I had a great time...  But please, check up on the bathrooms once in awhile or appoint an attendant, especially on a crazy busy night."}
{"text":"This place gets 5 stars because it creates a positive vibe where people can indulge in modern and retro hip hop and r&b in an upscale setting, in a good part of town.

The drinks are reasonably priced.   Some nights there is cover, other nights none.  The clientele is made up mostly of people who intended to come here for friends, associates, or to be part of the club scene.

The DJs who play here are from the who's who list.  From time to time famous people (rappers, NBA players, actors, singers) etc come by and add a bit of pizzazz to a night.   I attended a Playlist Thursday, which drew a packed crowd of upscale hip hop and r&b enthusiasts.

The promoters for the club are top of the line, and have experience at all the best clubs in the city.   Their connections and vast network are a big reason why this place is such a success."}
{"text":"I was there for a 30-something birthday and the DJ was playing some great 90s tunes!  It got people dancing. There was even an Emcee that got the crowd pumped! 

The attractive female bartenders were really good despite the crowd, it was packed that night but I didn't have to wait too long for my drinks. 

My friend ordered the burger and fries and said the fries were really good, but the burger could have used a little more seasoning. Like salt!  Interesting menu choices: Fried Pickles, poutine...I will go back to try more.

It's in such a great spot in Little Italy/College Street. I would imagine that during the World Cup, this place would be great!"}
{"text":"I don't have much experience at Johnny Jackson, but after trying their Gilles Poutine as part of my Poutine Passport I feel comfortable saying that it's the best bacon poutine I've had in the city. I also like the fact that everything is $10 (taxes in) on their menu--it just gives this place a great vibe. Give it a shot if it's late and you're hungry, as they're open til 4am Friday and Saturday."}
{"text":"Okay - I knew I was going to like this place from the name alone.  I am sometimes called 'Johnny' (among other things) and I was born and raised on a Jackson St.  You know how people have that \"porn star name\" formula -- where you combine your first pet's name and the street you grew up on?  Well - as much I would love to have the moniker, I simply do not deserve the nom de guerre of \"Onyx Jackson\" -- unless I starred in my own blaxploitation film.  But I could rock \"Johnny Jackson\"...

But I digress - my advice to you: DO NOT GO TO JOHNNY JACKSON.  Seriously - despite it being new, I don't want this place to change.  It's basically a no-frills bar with solid food and music.

DO NOT ENJOY THE MUSIC.  On the Saturday night we dropped by, it was a fine blend of nostalgic R&B and classic and newer hip-hop.  There's a small dancefloor in the back and it was bumping.

DO NOT PARTY WITH THE CROWD.  It was quite the odd mix - (at the risk of sounding like Stefon) hipster-hoppers, frat boys, cougars, urban crowd, post-work people -- nice variance in age range.  It is loud - but I think it's pretty difficult to not feel comfortable here for most people.  Or maybe it was seeing everyone hitting up the cupcake truck parked out front and then carrying cupcakes into a bar that made everyone seem friendlier.

DO NOT ORDER THE FOOD.  All food is $10 (tax included) and comes in a box.  You order from the pick-up window in the back and they have it ready pretty quickly.  The entire menu is 10 items: poutine, burger, pulled pork, mac & cheese, grilled cheese sandwich, deep-fried pickles and deep-fried Mars bar.  Kitchen closes at 3:30AM.  This is motherfuckin' genius - it's all food you want if you were pissed drunk.  And you can order and carry the food back if you're leaving the bar for the night.  Portions are generous and food was sufficiently tasty -- it's good old greasy, heavy food for drinking.  Thought it would be a bit awkward to pick up a couple boxes of food and then maneuver through the dancefloor carrying poutine. Also, they have two names for every menu item - the normal term and some pop culture references -- I asked the staff what the difference was:  there is no difference.  Okay - so it's being a bit forcefully trendy - whatever.

DO NOT PLAY PAC-MAN IN THE WASHROOM.  No - Pac-Man isn't some drug/sex euphemism.  Ladies, do not play the tabletop Pac-Man machine in the washroom.  Men - unfortunately, there are no such toys in the gentlemen's lavatory... so you really can't play.  This really isn't fair.  I've never had the urge to enter a ladies washroom until now.

The only serious knock is that booze selection is limited - two beers on draft and normal selection of bottled mega-beer.  Also, the list of spirits is low as well.  Oh well.  Every drink I order that night was $6.

But this place is mega-fun.  Cheap, simple, loud and fun with a bit of hip hop hipster sprinkled on top.  I really like it now - if I was a few years younger, I would LOVE it.

And finally, DO NOT GO TO JOHNNY JACKSON.  You will hate this place.  Don't show up and make this joint over-crowded.  Don't show up and force them to have meathead bouncers and lineups outside.  Don't show up and force them to start charging cover.  Seriously, just leave this place alone -- you will ruin it.  Trust me."}
{"text":"Johnny Jackson is the latest addition to College Street West. Right in center of Little Italy, this place is new and has yet to develop it's own personal style. Nonetheless, the place is already popular and packed with business at night. The place is another dinner-drinks lounge. After 10, the place becomes packed with the typical party-drinks crowd, a DJ to set the mood and the lights get turned low. 

I haven't tried the food yet, but the place is a welcome addition for partying with no cover charge,  DJ's spinning various kinds of music including TOP 40 and ethnic. I guess the owners are trying to gauge who they're going to get the most business from, and what kind of music will do best for them. As it stands, they intend on primarily focusing on TOP 40 with some global influences in their sets.

The place is decent enough, long, slightly wide with two mini bars set up. The bartenders have yet to get used  to the faster evening pace, but i'm sure with time, this place will sort itself out. As of now, the only thing i can say about this place is it's yet to be determined."}
{"text":"We went to Johnny Jackson to use our Poutine Passport from Joylister. We were supposed to get a poutine the Gilles which comes with bacon but didn't realise until we got home that it was a regular poutine. So that's sort of a bait and switch and leaves a bad impression. The fries in the poutine weren't properly cooked, there were chunks of the fries that were raw. Not cold, just raw. They might want to check their produce or cooking temperatures. 

Also I was under the impression they served their food in cardboard boxes (as per the pictures on Joylister), yet our poutine came in Styrofoam, which cheapens the experience and is not very enviro friendly.

To be fair we ordered at 2 am on a Friday night but still they're open like 3 days a week so they shouldn't be having issues stocking things like bacon and cardboard boxes. Especially if they're kitchen is open until 4 am as advertised."}
