{"text":"Atrocious. 

We stopped by at about midnight while heading home from another bar (post Indians game) and walked in to just a vast array of clientele. It was so incredibly loud that we couldn't even really get through a conversation and 90 percent of the patrons were just a hot mess.

I think we spent about 15 min tops in here before we were forced to walk out from the horrible music. (TKA.. Stevie B... Vanilla Ice). ick."}
{"text":"First time I came here was over 10 years ago and been back a few times since.  Was just there last week and it's still as awesome as the first time. I've only had the burger there and this thing is on my Top 5 list.  Couple it with the huge onion rings and one of the craft beers they serve and it's heavenly.  The ambience is great, super low key, old school Cleveland historical decor and unassuming decor.  The staff is friendly and love to chat you up and make you feel welcome. Always a recommendation to people I know who go to Cleveland."}
{"text":"As a local dive and burger joint, this is THE spot in Cleveland. Has an old school feel to it and staff is very familiar and casual. Can fill up and get loud quickly, only really one area where more than 4 people can sit together, its a little bar as the name suggests.

Burgers are awesome but cant go wrong with the pasta and other options, have never had something that didn't feel well made there"}
{"text":"Food was good.  Was busy bc it was a sat night.  The server was not good - seemed annoyed w/ the place being so busy.  Many better options downtown that provide way better service."}
{"text":"This place is a great lunch spot and used to be great for dinner as well but has slipped a little. They are by no means known for their service either. It is very slow and a lot of the woman servers are rude. I am giving it four stars on a good day mainly for their burgers. 

Lunch: Their burgers are definitely the best around when on point. They always have a \"burger of the day\" which are amazing. One knock on the place is they are very inconsistent. I have had burgers that were mind blowing and then went back the next day and they were decent. No matter what you will never be disappointed. I wouldn't order any of their other specials for lunch as their burgers are the highlight with the occasional good soup. Their homemade chips and fries are good too.

Dinner: Most people know they have great burgers for lunch but don't realize that they serve dinner too. I believe they get dishes from Johnny's and serve them at the little bar for a cheaper of the price. i just went back though and they increased some of the prices and the portion sizes are smaller. It is still a decent deal but when you factor in the blaring music and poor service it loses some of it's flare. Their potato crusted cod has always been one of my favorites and although still good, the increased price and decreased portion size make it less desirable. Their chicken cacciatore is generally very good although it is sometimes inconsistent. When they have the mussels as a dinner special get them as they are huge and delicious. Their chicken tenders are perfect as well. They also serve late which is nice bc it's a cool bar too. 

I would recommend that everyone tries it at least once for lunch and possibly dinner if other options are limited"}
{"text":"Busy Saturday night, bartender was on point, talked beer, was good for a joke, and the burger, is what you want from a burger. Nothing fancy, just quality meat, served with lettuce, tomato, onions, and a pickle. Cooked like the chef has been making burgers since he was in the womb. I was very satisfied and happy with the burger, and will be putting them on my list for when I need to satisfy the burger urges.

Note, that it is a small place, and can get crowded quick. Otherwise the perfect burger dive when you are in the warehouse district."}
{"text":"I was downtown picking up my marriage certificate. Since it was our 1 month anniversary. We stop In to eat a white cheddar jalapeño burger and side of fries. 
Burgers were flame broil on the grill and hand made. Our bill was 34.00. Not bad at All."}
{"text":"If you love hole in the walls with great burgers, then this is the place that you would like to head to on a late night. But...  Be warned that it may reek of dirty fryer grease and beer.  I followed a friend to the establishment and she opted for leaving when I was already there.  I wanted a shot of Jack and Great Lakes, something.  I received both.  I sat at the bar, ordered my burger and eventually were surrounded by a ton of industry folk, who apparently don't like to see single women drink alone.  

Love this place!  Food was great, atmosphere (though torn, worn and old) was shoulder hunching.  I'd go back."}
{"text":"Great dive bar right off of W. 6th.  The burger lived up to the reviews, the bun was a bit big though.  Nice beer selection, great service.  We were there while it was slow though.  

Love dives like this.  The contrast to the swanky Johnnys bar up front is also very cool."}
{"text":"I arrived in Cleveland form Dallas for a 10 day visit with my son. One evening after work, he said let's go have some burgers and beer.  So we took a little walk across the street from his apartments.  What a cool \"little\" bar!!  The two bartenders on duty were most friendly, cordial and were very attentive.  My son said they had the best burgers in Cleveland....so I went for it.  They had that backyard off the grill flavor and were done to perfection.  They don't use the typical hamburger bun like we use down here in Texas....it was more like a roll....so there was a little too much bread for me.  But hey.....all I did was remove the remainder of my bun and ate the rest of the veggies and meat by themselves.  YUM!  Thanks for a really FUN time!!"}
{"text":"Great place to stop for a beer and an absolutely amazing burger! Very small place but certainly one of Clevelands' hidden gems."}
{"text":"Best true bar downtown!  4 Star food at 2 Star prices!  Best burger in Cleveland; and possibley the best bartender staff downtown too!!!  This place rocks!  Keep up the great work!"}
{"text":"Great dive bar. Lots of beers to choose from. Very laid back and nice staff. 

Also go for the cheese sticks. They sent the healthiest thing on the menu but let's be real your at a bar. So grab a beer and nom some cheese sticks."}
{"text":"Best 1/2 lb Burger I've had!!  Very cool, chill atmosphere. Great, friendly service!"}
{"text":"Little bar is one of the best unknown spots in Cleveland.  It is hidden down a small dark alley located off West 6th street. It is the little brother of Johnnys restaurant.  I have been about 4 times, and each was a pleasurable experience. The burgers are top notch. I have heard they mix in part of the leftover Johnnys steaks for flavor. Great selection of beers on tap also.  Little bar is a casual, relaxed, comfortable atmoshpere that serves solid food.  Check it out next time downtown!"}
{"text":"Cleveland landmark. I've been goin to Little Bar for quite some time, great place to go for lunch, during a game or late night. This is one of my fav spots to recommend to out of towners. Kind of place where you can be in a suit or Carhartts and not feel out of place. Laid back atmosphere, strong drinks and great food. Aside from that, the same \"kitchen\" that is whippin up $30 + plates next door (Johnny's Downtown) is fixin you a $10 burger. Check it out, you won't regret it."}
{"text":"We were in Cleveland for the ball game and came across this place. It's a really nice friendly atmosphere. I ordered the prime rib sandwich that was really good. My wife got the burger and I had some of it. This was one if the better burgers I have ever had. Great place will definitely come back when were in town."}
{"text":"The burgers here are well worth the hype. I had a burger with egg, bacon and cheese. It was one of my favorite burgers of all time. The beef was about 10oz. I highly recommend this place for a fantastic burger."}
{"text":"Johnny's has been a favorite for grabbing a tasty burger for lunch for a while. But the last visit I was appalled by the charcoal fog that hangs in restaurant. After your meal you are left with the lingering smell of charred meat in your clothes and a sore throat. Any sufferers of respiratory ailments, or anyone that doesn't want to inhale large amounts of carcinogens while eating lunch, should not even consider coming here until they fix their grill ventilation."}
{"text":"We were seeking out burger place before it was cool. This has been one of our favorites for years. When in Cleveland I always make a point to stop in. More than adequate beer selection that include that standards as well as IPA and even Chimay. Daily specials are homemade comfort foods."}
{"text":"RACIST!!! RACIST ESTABLISHMENT!!!! 

     I wouldn't recommend this place to visiting African Americans or out of Towners or anyone that will be offended by the racist conversations you might hear from the Patrons. Regular frequent Patrons.  
    They don't cater well to New faces or none regulars, especially after restaurant Hours.  Prepare to get in a fight if you're alone and having a good time, they will test you. 
    Prepare to feel out of place. Be aware of the Patrons and servers. Everyone there knows everyone. Don't trust anyone that loves this place, because it's very reflective of the majority of late night clientele. 
   This review is specifically for None Whites mostly because it's clientele is mostly White. I've frequented this place. I Had to tell a regular patron expressing hate speech off on separate occasions, twice it's almost got physical. DO NOT PATRONIZE THIS BUSINESS."}
{"text":"This is the kind of place I love to love but the experience left me bummed out. They were way under staffed and we felt bad for the bartender who was also the only waiter.  A burger and reuben order took over an hour to show up and was OK.  The bartender insulted the co-worker I was with and seemed to take pride in it.  I am all for a place that can give people a hard time but it crossed the line.  I was very disappointed as this really is the dive type of place I love to find when traveling.  I won't be headed back unfortunately."}
{"text":"We were looking for cheap-ish parking for the US Soccer Match at the Browns stadium and we parked across the street form Johnny's Little Bar. I was thirsty and peckish after the ride down from Detroit so we stopped here. Wowza! What a fantastic burger. One of the best I have had. Beer menu was beer snob friendly too. Just a great little place in an alley in downtown Cleveland. I would definitely make it a point to stop here on my next visit to Cleveland.
The staff were great too. A nice bonus."}
{"text":"I love this place. Generally go for lunch a few times a month. Depending on the size of the group, we often get out within 40 minutes; so not super fast but not slow either.

Beer selection is limited, favoring lagers and ales; but good diversity in those two categories."}
{"text":"You feel like you went back 50 yrs when you walk in which is kind of cool. The burger was good. The fries are not crunchy at all which was a little bit of a disappointment. I made the mistake of asking for the steak sandwich well done and I ended up eating completely burn steak. The place is small and can get a little loud. For that kind of bar, I wouldn't expect to pay $6 for a beer like Blue moon. I may give it another chance to try the fish sandwich that I heard is great... however, I don't think I will ever go here for drinks. I almost forgot to mention that the bartenders are really nice."}
{"text":"I want to give it more stars because the food was good,  and our server did a good job- however on a busy Sat night when every table was booked,  he was alone. Getting drink refills was nearly impossible.  The atmosphere was dive but fun.  Music selection was great.   It was also odd that 2 police stood at the door the entire time.  It was not a scene that warranted it in my opinion,  no underage,  no one carried away. It seemed peculiar.    Overall not bad and I'd prob give 4 stars if it weren't for lack of service."}
{"text":"Really great place if you want to escape the city! Total hole in the wall. Like a towny bar in the middle of the city. Definitely try the burgers while you're there, fries could use some work though.  Myself and 3 girlfriends headed to Johnny's a while back because I work downtown and want to find places to suggest to people and a lot of my coworkers come here so I gave it a chance and the experience with the bartender was ABSOLUTELY AWFUL. Maybe she was having an off night, maybe she was still upset because she seemed to have broken her wrist, I'm not sure but her service was unacceptable. She was rude, condescending and unattentive. 
However we met some wonderful strangers there and the vibes were good, they totally made up for the bad service.
Just stay away from the female bartender with dark hair and you'll have a decent time!"}
{"text":"They claim to be Cleveland's best burger...hard to argue!

Went to a recent weekday Cav's game and took my two girls along for their first ever visit.  They were not happy we had to walk all the way from the other side of the Q, but I assured them it would be worth it.  It was!

We each ordered a burger and also some fries and onion rings for good measure.  They had a nice selection of draft beers, so I ordered one to wash down the burger with.

I ordered a bacon cheeseburger (cheddar) and so did my older daughter.  My younger one ordered the burger special which was like a breakfast burger with cheese, sausage and eggs (runny of course!)...we \"held\" the syrup.

When the burgers arrived everyone's eye got real big!  These bad boys were huge!  We cut them in half (to share styles) and the juices started flowing (served a perfect medium rare) all over the plate.  They were so tasty and delicious they were hard to put down!  The fries were okay, but the onion rings were really good...very crispy and not overly big.

The cold beer made all right with the world...and we headed over to The Q very satisfied with the adventure we had undertaken.  And the Cav's won to boot...what a perfect night!"}
{"text":"Just got done having dinner. The burgers were great. Priced right . Love dive bars. The bartender and server were very personalable and friendly. Would definitely go back"}
{"text":"Johnny's Little Bar sports one of the best burgers I have ever had. They use the steak cut offs from the front restaurant and add them to the ground beef. Add their onion rings and a giant Yuengling and you can't go wrong.

The location looks like it may have been a speakeasy back in the day with the entrance located in the ally. Very cool building with a super friendly and knowledgable staff inside. They just got a new jukebox which is way too expensive ($1 per song) but to be fair, lots of pubs in the area have the same one.

I really want to give this this place five stars but the smoke from the kitchen is a reality you have to deal with. For me, the rest is good enough to put up with it."}
{"text":"Like a scene out of the movie, \"The Fog...\" in the middle of our conversation a \"food fog\" overtook the bar.  Apparently they were cooking some burgers and didn't have the proper ventilation in the kitchen.  The fog lay like pea soup in the restaurant and it became comical watching my date across the table because he went from being in sharp focus to blurred focus.  Once the fans kicked on and the front door was opened a few times it cleared up.  And yes I left the bar smelling like a burger...all this aside, JLB is always a good corner joint to grab a beer."}
{"text":"I was trying to get out of the city and those Hollywood jerks had traffic all crazy. I was on the East bank of the Flats when I realized that, thanks to traffic, I wouldn't be able to get where I wanted to go before running out of gas. I mentally ran through all the places I might want to visit for dinner downtown, and I recalled Johnny's Little Bar. I knew exactly how to get there from where I was, so I and my unwilling date walked up to the location, a door in an alley between W. 6th and W. 9th.

Inside was a cozy, little multi-level space with maybe a dozen little tables and several seats at the bar. Most of the exposed surfaces were brick, and there were a couple doorways that led to stairs up to the bathrooms and another, currently unused bar area.

The man who told us to sit wherever also gave us some menus. He was friendly and made us feel welcome. I knew from Yelp that we would probably want the hamburgers, so there wasn't much deliberation needed. We both ordered hamburgers and fries, and they were really great. My only complaint would be that they should open a window for ventilation, as it was a little stuffy inside. Later my asthma felt aggravated.

So, to sum up, the environment was interesting and fairly comfortable, the service was attentive and congenial, the food was really good, and we had a decent time. I will go back the next time they block off the highway for a major movie shoot, maybe even before."}
{"text":"Best hamburger in Cleveland and maybe the world.  Great spot to park near and eat at before or after a Cavs game. The Italian food is the same as the Restaurant upstairs but at a fraction of the price.

Try the parm!"}
{"text":"I've been here twice and have not been disappointed. Johnny's is a nice, somewhat small bar with great pub food, good beers, and a small-town feel. I almost want to say intimate atmosphere - but not the kind of intimate that goes on behind closed doors. The kind of intimate where you're with a group of good, old friends. Does that make sense? Hopefully!

My first visit was during the opening ceremonies of the 2012 Olympics - my roommate and I sat here and watched the parade of athletes while sipping on G+Ts and V+Ts (Sweden...you have some good looking Olympians!). Very reasonably priced drinks, decent service, friendly bartenders.

One downside - the music is entirely jukebox driven. If no one pays, there's no music. And on the flip side, someone can pay a ton and just be the DJ for the night...whether you like it or not. That being said, when it's playing, the music isn't loud enough to be disruptive. 

My second time at Johnny's was during the AFC championship game, and my friend and I were the only people there for about an hour - but the staff was still friendly, and I still had a good time. I got onion rings and mozzarella sticks, and oh my goodness both were delicious. I'm sure my arteries needed a plunger after that, but it was certainly worth it. If you are choosing between the two, go with the onion rings - the portions are huge and so, so perfectly crispy."}
{"text":"I went to this place to meet some friends after the Santana concert around 11 pm. I'm a vegetarian and asked the server if someone in the kitchen could just make a simple salad for me. It turned out to be an incredibly tasty salad with very fresh ingredients -- bright colors, no iceberg lettuce. The cook added a toasted hamburger bun on the side, and it was the best bun I've ever had. I sincerely appreciated how accommodating the server and cook were. My friends said their burgers, fries, and onion rings were amazing. The server had been dealing with my friends for several hours during the Spurs game and was very pleasant."}
{"text":"Hey gang! Ok?? Thought this place was supposed to be little or something? Anyway I'd say definitely more of a medium size place. I mean, give me a break there's whole upstairs area that you can rent out (-and that sorta thing). So they have a self-proclaimed best burger in town policy, and I agree to agree!!! Too bad the waitresses aren't slightly more smiley but I would split a burger with any of them any day of the week! Kind gals. YELP!"}
{"text":"Had the cheeseburger and fries. The burger was very good, fresh, and juicy.  I will visit again."}
{"text":"This is a great little place in downtown Cleveland that had lots of beer choices and a really really good burger.   Fresh soft bun.   
It was a busy Saturday night but the bartender/servers work well together and were extremely friendly.   They were truly happy we were there.  
Would go back every time I visit Cleveland.
I will tell you it did get really loud.   Don't go there if you want a quiet evening."}
{"text":"Good, inexpensive divey bar. Very limited menu but everything we had was good. There are a lot of other more expensive restaurants close by and if that's what you're in the mood for, fine. But if you just want to hang with some friends, grab a beer and some food you'll do well here. The food is very good and the service was good too.

I had a cheeseburger with grilled onions & mushrooms. A friend had Caesar Salad with Grilled Chicken Breast. She liked it a lot too. Tall 20 oz. draft beers served. A small but good selection."}
{"text":"Speakeasy dive bar with great burgers!

This was my first time visiting Cleveland and was close to where I was staying.  An online article said this place has the best burger in town. I agree.  Mine was a little over cooked (medium well instead of medium rare), but my table of 6 all got burgers, so it's very understandable.  The price was cheap and well worth the few add ons of sautéed onions and fries. 

I didn't get an alcoholic drink, so I can't stand speak to the bar side of things."}
{"text":"Best wings in town and good happy hour. The beer selection is decent. Fully stocked bar. It can be loud. Bathrooms are upstairs!"}
{"text":"If you're looking for casual, divey atmosphere with great service and good food, then this is it.  I came in on a Sunday night from out of town and I had already decided I wanted to try this place.  It was just what I wanted.  A cold beer, casual food and friendly people and I got it.  I felt like I was at Cheer's or something.  They only had limited menu, but I got a burger that was yummy and juicy and just perfect."}
{"text":"Cheap drinks, great service. Awesome jukebox and generally a good vibe. Don't be alarmed if bar patrons begin singing when their jam comes on. A lot of fun and a great late night grilled cheese!"}
{"text":"Always a stop while enjoying Cleveland, the burgers here are great, the bar staff are nice , very friendly place ."}
{"text":"I love the location of this place. It is hidden down an alley, next to some trash cans. The space is pretty small, and definitely has a dive feel to it.

The food is decent, but I felt it was a little pricey for the location. I got the burger once and the steak sandwich on another visit. Both times it took awhile for the food to come out, and my friends and I did not receive our food at the same time.

This place is better suited for drinking. Nice casual environment, good songs on the jukebox, and decent beer prices.

The bartenders were friendly, but the servers were kind of cold. I don't think that will keep me from coming back though."}
{"text":"Best Burgers in CLE. The food is delicious and the ambience is very nice of that a small bar."}
{"text":"Great burgers! The service can be lousy but it can also be great depending on when you go. Food is always good, and the specials are all delicious. 

There are plenty of good draft beers, and it has a true Cleveland dive bar feel. It is an enjoyable place to grab a beer while watching the game, or to grab a cheap dinner after work."}
{"text":"An okay place, they had what was wanted so we went for it.
 
The place was dead when we got there so we were seated right away. Our waiter was nice and attentive but should have been since we were pretty much the only ones there. We all ordered quickly and we were served quickly.
 
We pretty much all got burgers and fries. They were good and we all ate all of our food and felt full in the end.
 
This place is more of a bar that has food. I wouldn't really suggest coming here for a sit down meal but if you are drinking and want a burger then you will like it better. There is an upstairs to the place but it seemed extra rundown up there.
 
The restaurant is a bit run down, outdated, and dirty. I went to go to the bathroom and wound up just walking away. The bathroom was really small, smelled terribly, was filthy, full of graffiti, the toilet seat wasn't even attached to the toilet. I held it and just went to a coffee shop after dinner.  
 
After seeing the upstairs and then the bathroom, I felt a bit worried about what I just ate and I truly hope the kitchen is in better shape than other parts of the restaurant/bar.
 
Overall, if you want a couple of drinks this can work but I wouldn't come back here. I don't want to go somewhere that is dirty and the bathrooms are disgusting. There are so many amazing options in this area and I would prefer somewhere else over here."}
{"text":"I've never been to Johnny's at night, but I have been here for lunch during the day.  It's a pretty awesome place for a burger.  I wasn't sure where it was ... basically its down a little alleyway, and if you walk too far you find yourself at the doorstep of a stripclub. Sounds seedy, but its not. Its right off the main drag where Johnny's Downtown and Crop are.

Johnny's is definitely a hole in the wall dive bar - feels like you are in some restaurant's back room (which you probably are), but the lunch crowd was pretty much all young professionals pigging out on burgers and fries and onion rings. Which were delicious, by the way. It felt like a cozy little place, dark and tucked away, but friendly and not stuffy at all. I am definitely a fan, and will definitely be going back any time I'm craving a good fresh juicy burger for lunch."}
{"text":"Why are you reading Yelp reviews right now? You're looking at the page for Johnny's Little Bar because you've got a burger craving and you want to see if it's the real deal, right? 

Stop reading. Go. Go now. Quickly. The burgers are all they're cracked up to be. The beef is fresh ground from the steaks at Johnnys on 6th, so don't order it medium well (or well done, you monsters!). Order medium rare, slice of American cheese, and give in. 

It's a hidden gem downtown, great little hole in the wall pub with a decent beer selection, at a reasonable price."}
{"text":"Greasy Burgers until 1am?  Check
Downtown?  Check.
Un-pretentious?  Check.
Gin and Tonics and draught beer until 2am?  Check.
Crowds of 22 year olds getting drunk and throwing up on their \"going-out\" clothes?  Around the corner and up the street at the Blind Pig."}
{"text":"Johnny's Little Bar is definitely home base for me. My friends and I usually end up here after a day of drinking or hopping around the city. Low priced drinks, great music and the best burgers I've ever had in my life. But seriously. If you're an OU alum, this place feels like a smaller Jackie O's to me. Love it!"}
{"text":"If you are a \"local bar\" kinda guy or gal this is a sure hit. Great bartenders great beer selection and one of the best burgers you are going to find anywhere in the US. Cheap prices and if you dont love the burger your taste buds are DEAD.  Try this place. If you are named Muffy or Buffy you may want to skip it though. Really a taste of Cleveland!"}
{"text":"I spent an hour in this place and came out smelling like charred, ground beef.  And no one was even cooking anything!  Will definitely not return."}
{"text":"In search of celebrating \"National Cheeseburger Day\", I found Johnny's Little Bar on a Cleveland list of recommended places to go in honor of this special day. My friend and I came in for lunch and each ordered whatever the regular burger was with fries. The burger was great and the meat was rich. The fries were ahmaaaazing too, very fresh and delicious.

The problem here: We nearly walked out after waiting around for 10 minutes just to be seated. There was no one else here except a couple dining at the bar. The girl working just stared at us, no greeting, no \"I'll be with you in just a minute\", no \"we're closed right now\", no nothing! We began thinking to ourselves maybe we are in the wrong place and started walking around and realized there was an upstairs. We went up and realized that it was closed up there. She didn't even bother telling us to not go up there. Seems like she really didn't give a crap about anything.

Anyway, I finally went up to the bar and asked if the kitchen was open. She says yes, sit wherever you'd like... why couldn't she just say that when we first came in? She only lasted the first 5 minutes of us ordering our drinks and food, it was then taken over by a gentleman who was so pleasant that he changed the entire experience for us.

This place would get four stars if it wasn't for that crappy service to begin with, and although I think the gentleman was great, I just don't think thats the way you treat anyone. 

Prices are fairly priced and food is tasteful, I may return depending on who I see working that day..."}
{"text":"I really dig the \"little bar\" atmosphere. It was absolutely packed on Saturday night during the OSU-MSU football game, and service was a little slow....but the burger was worth it. 

Here's a tip. If you go to their website and sign up for their email club, they send you a $10 gift certificate. So I ended up getting a great burger, onion rings, and a drink for $2.50...can't beat it."}
{"text":"I Love the little bar. Unique, quiet and Cleveland. Don't expect anything healthy. Order the burger with everything and a great lakes brewing company Dortmunder Gold. Onion rings are great too. The guys who work here are very friendly and will remember you when you come back."}
{"text":"Went here with a group of people after a Browns game. It's crowded but  that's what you get for coming on a day like this. The place is tiny! They  have a bar right up front when you walk in and also an upstairs which lead to the bathrooms. The name does say \"little bar\" and it was definitely little, lol.

We just grabbed a beer and a couple of bites to eat. Had their jalapeno poppers and mozzarella sticks. You can't really go wrong with them because you can't expect too much. It's a dive bar but the atmosphere is laid back so it's nothing too crazy. They have the Tunes machine so at least I got to play my favorite song :)"}
{"text":"Visited bar on the recommendation of another patron at Bar Louie. Not disappointed! It's an alley bar but personal \"Cheers\"bar. Billy and Taylor are amazing! Mix a great strong drink. The beer selection for beer lovers is on point! Red Strip is a far way from home. Love this place!! I'll be back!"}
{"text":"Great food, great atmosphere. Awesome Bar tender, he was very friendly and accepting to us Chicagoans. Definitely recommend this hidden gem."}
{"text":"Love this little hidden gem. Great friendly crowd. Dislike they changed their onion rings from battered to panko crusted."}
{"text":"This is a tiny dive bar where you can't go wrong with the burgers.  The patty is THICK but worth the price.  I recommend checking out their special burger of the day written on the board to the right when you first walk in.  I got the special that day which was a burger with bacon and a fried egg.  I was sold since bacon and eggs are generally my favorite foods.  Johnny's Little Bar definitely did that burger justice because it was perfectly cooked.  Highly recommend and would come back if I was ever in Cleveland again."}
{"text":"Best Burger in Cleveland.  Hands down.  Doesn't need crazy toppings or side dishes.  Meat, Cheese, lettuce, Tomato...med-rare......AMAZING.  Decent beer selection, with a below-average liquor selection.  Can't go wrong with Touchtunes either."}
{"text":"This place is great. Excellent beer, even better food, and one of the best little hang out places in downtown. The staff is friendly and talkative, which is great for a little bar.

I find this to be one of the best places to go have a non-pretentious beer while not sacrificing any quality on food. In fact the quality of food is great for the type of bar and even better for the price. There's a lot of cool places to go downtown but honestly sometimes you just want to go into a place to hang out and not worry about having to dress up or pay for overpriced fare.

If you want a cool little place to go to that's not going to break the bank, check Johnny's Little Bar out. They're also open late so they're perfect for that close-the-night bar."}
{"text":"So I sat there for over 20 minutes without service. Finally the bartender, who was the only one working, came over and asked what I wanted to drink. I told him I'd like to see a menu. And he said, \"ya, what do you want to drink.\" I said, \"I'm not sure,  I would like to see a menu first.\" He walked away. 10 minute later he still had not come with a menu. So, I left and won't be back."}
{"text":"Johnny's Little Bar is the epitome of a dive bar, in the best possible way. It has that very down-to-earth feel and the service always reflects that, as well. 

I have only ever had the wings here because they are SO good, I can't get myself to order anything else. They are just perfect- perhaps my favorite in Cleveland. The hot isn't too hot and although they have given me heart burn in the past, I can't say no. Just gotta get some fries to soak it all up :) Whenever I crave wings, Johnny's is the go to place. The name should be Johnny's On the Spot, because it is always on point. 

Can't wait to go back the next time I am in need of a wing fix!"}
{"text":"Johnnys is perfect if you're looking for a dive bar where you can still get good food and service. Their cod is great and the salads that come with meals are also very good. I'm especially a fan of this place because it's low key but still has a lot to offer. The bartenders are awesome, friendly, and welcoming.
The burgers are also great here, I'm pretty sure that the bread comes fresh from a local bakery or something.

The only reason I docked this a star is because sometimes it's really loud... like to the point that you have to yell to talk to the person next to you. 

Overall, definitely recommend it."}
{"text":"If you're looking for a burger and a beer, there are maybe 5 places in town where you really get what you're looking for and this is one of them. Tucked away. No attitude. No muss. No fuss."}
{"text":"this place is amazing!  i didnt know about it until recently...tucked on a side street downtown.

ive been here twice and they do not lie, they do have the best burgers in town!  i had a cheeseburger with an egg on it, which they had no problem doing for me, and the 2nd time, i got a chili cheeseburger which was so tasty!  

the bartenders are very nice, sociable and attentive.  great spot and always ask about the burger of the day!"}
{"text":"It's been a long long long time since I've been downtown and was part of the downtown after work bar scene. By long time I mean never LOL. I've never worked downtown. But in a weird way I've always envied those who do work downtown. My neighbor and I had tickets for the Indians game go tribe and he's having office downtown right around the corner from this bar. And of course by its name it's really is a little bar. Generally if you had not known it was here you could see the sign but it's not something that you would initially feel comfortable just walking into. However once you're in there the bartenders are jovial and attentive and we brought our son's in there who are 10 and 12 and I know what you're thinking why did you bring kids into a bar. But it was really cool because it was 6 so it wasn't heavy drinking time in the bartenders were actually pretty attentive to them which was very nice of them. After having a couple beers we ambled off to a an Indians win and I'm sure I'll be back to a little bar again."}
{"text":"Many restaurants called their burgers a \"steak burger\" but I think Jonny's is the only place that isn't lying! Being the back room of a fancy steak joint has its perks. The leftover cuts and trimmings are grounded and made into burger patties then served at this little bar. Immediately you can taste the difference in texture, fat content, and flavors with the cuts of beef that's in the patty. Great smoky flavors and the burgers are juicy! Not only is the meat really good, its served on a great brioche bun! 

You can go with their regular 1/2 pound burger off the menu or try their special burger. You won't be disappointed! Last but not least, there's a pretty good selection of drafts as well."}
{"text":"Cool little bar.
On Eric V's review we got a burger and it was EXCELLENT!!!!!!!
Yelp wants me to write more so I will - we came here the night before a Brown's game and had a GREAT TIME!"}
{"text":"Checked out Johnny's Late night after a late night drive into Cleveland.  We got there pretty close to closing time... and don't be fooled- there is no \"late night\" about this bar.  It closes right along with the other bars.  But we were able to pound two beers.  It really isn't that \"divey\" either- there was sports on the tv.  But it served its purpose - giving me beers after a 5 hour drive.  The walk down the alley is not that far and felt pretty safe.  Probably the closest thing to a dive bar you'll get in Cleveland."}
{"text":"All the kudos for the cheeseburger are well deserved. Came out perfectly medium rare as ordered. Still had plenty of delicious char. I particularly liked the obvious care that was put into the slicing and proportions of the lettuce, tomato and onions. Somebody has put some thought into every element. Onion rings were great as many have observed. I had several friendly servers checking back often to make sure everything was OK (maybe a little too often since everyone seems to serve the whole place). Great food, beer, and atmosphere!"}
{"text":"The food here is unusually good for bar food.  Not only is their basic stuff good, but it is artfully done.  The burgers are good, although in my opinion not the best in town.  They have good fish at times too.  But what I will always remember: I ordered a side of cole slaw once and it came with mixed red/white cabbage, seasoned with caraway seeds, and hardly any mayonnaise.  I will always remember eating the second-best cole slaw of my life at this little hole-in-the-wall.

They always have good beers on tap too, usually with 2 great lakes offerings, which are rotated.  The atmosphere is down-to-earth and unpretentious too.  And the location is cool...right in the downtown, but off the beaten path.  I would have never noticed this place if someone had not taken me here."}
{"text":"Great food. Fantastic burger & onion rings. Even had great service. Beer selection was great. However, the.$6 bottle of great lakes took me for a shock. 2 burgers a piece, 3 beers each 70$ is steep. Order draft...."}
{"text":"I've lived in over 25 metropolitan markets across the U.S., eaten a hell of a lot of burgers, and this little dive in downtown freakin' Cleveland, Ohio puts out the best damn burger I've ever tasted. 

I don't even know what to add to this.  It's an incredible burger.  

11 stars."}
{"text":"Not impressed with the service at 5. We decided to meet after work as it was halfway walk. I was surprised as there were no happy hour foods or specials and with only one person at the bar and two people at a table.  After being told to sit where we wanted, were asked to then move and sit at a smaller 2 person table. Not a problem as I guess they may have been expecting a crowd. We had my backpack brief case and big cold weather coats so squeezing to sit at tight table was a little tough, but we were certainly open to do our part for the bartender who asked. I was hoping to at least get a draft and some wings but the bartender seemed to busy cleaning glasses to ask what we wanted. He said he did not know what the food would be as the chef was busy and had not made the decision yet. After 10 minutes of dead silence in the bar and no offers we decided to leave and try \"The Harp\" on Detroit Ave. Near the Shore-way close by. \"The Harp\" was awesome with great service, plenty of happy hour options including a great 5 dollar burgers and a pint of Guinness. We are glad we left, what a super place!"}
{"text":"Oh Johnny's Little Bar, I can actually hear my arteries clogging as I eat your delicious food. It sounds a lot like:

\"Om nom nom nom, grilled cheesed-french fried-cheeseburgered happiness in my belly!\"

And you know what? It's totally worth it. Heck with the diet! If you're coming to Johnny's you'd better be having a big, juicy burger! 

Along with my wonderfully calorie-fllled meal, I usually grab a brew from their collection of micros, imports and domestics. It usually depends on the size of my wallet at the time, but it can range for a cheap, cold draft to a more sophisticated beer. Whatever your choice is, Johnny's has it.

This place is the epitome of the little corner bar. I noticed that a bit of everyone in Cleveland ends up here. Plus, a lot of industry peeps, which lets you know this place is cool and noteworthy. 

Perfectly cozy, worn and a great fit for anyone. Friendly, fast staff and an open upstairs for bigger parties. The bathrooms are mildly scary, but it's part of the charm. Love this place! And who'dah thunk that fancy-smancy Johnny's could do a dive bar so well?

Good beers, fantastic burgers. I.want.now."}
{"text":"All the beer is old and crappy selection. Food is bad, bar style food that's overpriced. Interior is ratty, old and worn. What I picture my grandfather would love to sit at back in the 50s and it probably hasn't been touched, or cleaned, since."}
{"text":"amazingly good burgers and they have raspberry lambic!"}
{"text":"A small, very dark, dive bar for sure--hidden away around the corner and past a couple of trash cans from West 6th and its more highly-esteemed counterpart--but they do serve the meatiest burger in town (at least, that I have seen so far).  Notably, though, my girlfriend ordered the same burger and got served a slightly smaller patty--a possible lack of consistency.  The accompanying house-made chips were thick cut but very oily and reminded me a lot of the chips at the pre-Kafeteria cafeteria (i.e., Dine On Nine) in 200 Public Square.  The fries (extra charge) were similarly unremarkable.  But really, the burger remains the star, and while they could top it with a fried egg, throw in some arugula and the word \"aioli\" somewhere and compete with the other gourmet burgers around town (and compete well, at that), Johnny's Little Bar refrains and stays true to its roots...and we are thankful."}
{"text":"This DIVE rates a 4.  Restrooms are up a dark stairway, thru a dark room.  Server was gruff, unhelpful, and busy tending bar and tables.  The hamburger lives up to it's Yelp billing.  Good but not huge selection of drafts."}
{"text":"Love!! Wings and burgers are a must. They have a good beer selection and hard cider but no GF beer as of yet :( I hope they change their mind!  it's really loud and crowded in there sometimes in a good way with a great vibe and sometimes it's just a nice more chill atmosphere. We have come here with my friends and also my parents :) I love this little hidden find!"}
{"text":"This is the best burger in town!! Hands down! I had a cheeseburger with bacon and onion rings!
It was delicious!! I've had their turkey sandwich ..which was also very good!
The bartenders are so nice and the vibe is super laid back! Beer on tap is great and they always the game on! I would highly recommend this place!"}
{"text":"So I met the Mr and some of his buddies at Johnnys Little Bar. I was inmediately instructed to order a burger by them. And boy was I ever happy I did. Seriously one of the best cheese burgers Ive ever had literally in my entire life! Fries were awesome as well. Loved the atmosphere as well. I know where I will be going the next time I get a craving for a great cheeseburger!"}
{"text":"I am shocked anyone would rate this place 5 stars. I have been there two times now. I have had disinterested staff both times and sub-par to downright poorly prepared food. Nothing about this place would ever leave me inspired to try the more expensive version up front. The scene is a good throwback I suppose, but when it is the backdrop for a burnt overpriced burger it just doesn't fly. There are a number of places in the same price range that don't rest on the laurels of their past to keep customers coming. Go elsewhere for a good burger."}
{"text":"We were just walking along the street, dead tired and hungry when we spotted this little gem. Doesn't look like much, but the burgers were perfect and the TV was showing the Crossfit Games, decent beers on tap, we were treated like friends. Service was slowish, but super friendly."}
{"text":"Great little bar! This place has an awesome hometown feeling. Not really the best spot to watch a game."}
{"text":"Wonderful little bar in downtown Cleveland. The bar has a comfortable, cozy, worn in feeling, but a step up from a dive. The food, or at least everything I've had, is excellent...but, as others have said, the burger is in a league of it's own. The drinks are good and quite reasonably priced, and the beer selection is well above par."}
{"text":"A perfect, no frills, chargrilled burger. Simply a large burger, soft bun, your choice of cheese and then lettuce, tomato, onion, mayo on the side to dress up the patty to your liking. I personally think it's great with a bordering-on-embarrassing amount of mayo and all of the onion (who needs good breath when you're eating a burger the size of your face?) The fries that come with it are fresh cut and you better believe I'm dipping them in that extra mayo...a rare treat but this is the kind of place to do it!

I love the laid back feel of the bar, that they ask if you want another beer before you've even finished the one in hand, and that there is always an interesting assortment of people just trying to get their grub on. Kuddos, Little Johnny!"}
{"text":"Find this little joint!  I saw a Yelp review and decided to try it. I sat at the bar, got the house special lasagna and a salad $10.99. Easily some of the best lasagna I've had. I think they use the same kitchen of a very upscale restaurant right next-door.  The staff was friendly and attentive."}
{"text":"Loved my visit to Johnny's! 

This place truly was a \"little\" bar, and an old space. The size was very tight and there's no place to stand, so if you don't find a seat, you'll be leaving. We lucked out. Guessing it seats about 40... or twenty so common and grab your jukebox money... really seats about 40 and has a jukebox!

I had to try the burger, and WOW! Yummy. I'd like to try other things. There are a limited number of staff and they don't seem to have any organized way of who's serving whom... you just wave one of them down and they're happy to get your order. It was packed but we always got what we ordered in a timely manner... just don't be surprised to have to go to the bar to order it.

I appreciate and like dive bars and this is one. What was a tad concerning was the upstairs. The bathrooms are up a steep old staircase and there is another whole room up there filled with smoky, stale air. A guy sitting up there said it was from the kitchen. It was filthy as well as the bathrooms. Yuck. I'm surprised the place meets codes. Other than the one guy I talked up there sitting alone, it was empty upstairs. That was strange. I'd like to go back to try the wings!"}
{"text":"God I love this place. Yes all I've had is the burger...but it really is the best in CLE. there's strange rumors how they pull it off...but however it's done, the meat is awesome. I've never tried anything else...but why would I with a burger this good. Plus the bartenders are all super friends, great spot to just post-up at the bar like a bro."}
{"text":"I've probably walked this place a thousand times, totally missing out on all the gloriousness it contains.  It's definitely a dive bar, nothing fancy, but it is clean.  Bartenders are friendly and helpful.  They've got great beers on draft, including the crowd favorite Great Lakes Christmas Ale.  But really the reason to come here is for their burgers.  Oh yeah.  They're really, really good.  Rumor has it they use the fat they cut off their fancy steaks at Johnny's fancy restaurant in their burger.  They are deliciously juicy and full of flavor.  The bun they serve them on is a bakery fresh bun that just makes it even better.  I really enjoyed the fries a lot, but I've heard others say the onion rings are a must have.  And what's even better are the prices!  8 bucks for a delicious burger and fries.  YUM!"}
{"text":"When it comes to a perfect burger this is as good as it gets.  I cant speak for the rest of the menu as the burger is the only thing I've had.

  Awesome laid back atmosphere.  when you enter Little Bar the last place you will feel like your at is downtown.  Reminds me of the hole in the wall bars back in my hometown. 

Good beer. Good prices. Great atmosphere!"}
{"text":"A treasure!  Service rocks, prices solid and great food for the price.  I shouldn't tell you this, since small so stay away!!!"}
{"text":"I'm surprised by all the 4-5 star reviews. Sorry but this place didn't do it for me at all. Burger was bland and not tasty. Consensus of the group I was with felt the same. Never going back."}
{"text":"If you're looking for a place to be yourself while enjoying some of the best bar food in Cleveland, you've found it. Great beers on draft and bottle. The bartenders are skilled and friendly. Highly recommend. Decent TVs if you are looking to watch a game."}
{"text":"Pretty good bar food but terrible service. We had a rude server who called us a pretty inappropriate name strictly for asking for 5 separate checks. A simple \"no\" would've been fine, but he used an expletive I don't even feel comfortable repeating. We tried to talk about it with a manager and it was brushed off. I'm sad to say that when I enjoyed my burger, but I will never go back."}
{"text":"Burger is what you came here for. Shares the kitchen with the one of the best restaurants in Cleveland next door and the meat tastes and smells like it.  It's a small dive with top notch burgerstein - come get

Good beer"}
{"text":"the burgers are good but they don't make up for the crappy service. i mean terrrrrible. 
the bartender/waiter could care less if we needed to order, get our food, or pay our bill."}
{"text":"The name does not lie, this place is tiny, yet cozy. Something about the wooden walls, friendly bartenders and a board of draft beers just makes this place an instant hit!"}
{"text":"I absolutely LOVE Johnny's Little Bar for multiple reasons. First and foremost they have the best burgers in Cleveland! I always get mine with mushrooms, onions and Swiss and it is utter perfection! You can also carry out anything on their menu and they serve food past midnight. 

While it can get busy on the weekends, weekday nights tend to be relaxed and chill. They have a good variety of beers both craft and cheap domestics. 

Overall, if you like good bar food and a laid back atmosphere, Johnny's Little Bar is your place!"}
{"text":"First off I have to admit my buddies Dad used to own this place in the 60's so I am partial to it.  Use to hang out here when the Roxy Burlesque was still in business down the street.  Great bar food and burgers.  Always friendly staff.  Usually can get something to eat until at least 1am (not many places in Cleveland serve late).  If they still have perch on the menu buy it.  For me it is more of the Cleve vibe here that attracks me."}
{"text":"After getting over my hunger and checking out Johnny's again, I need to reconsider my rating. Yes, the burgers were still good, and the onion rings crispy. But the service is slow, the prices aren't that competitive, and our server was cold, rude, and brusque. I am sorry, blonde braid woman, if you're having a bad day, but you were among one of the most disappointing servers I've ever met. Your glaring and snapping ruined our day, too. May someone give you a very big hug and tell you everything will be ok."}
{"text":"One of the most fun and best places to hang out downtown. Food is out of this world--the burger is second to none-tastes like a steak in burger form. Great atmosphere, and very friendly employees. Hands down the best dive bar in Cleveland"}
{"text":"This place is fantastic. Nice place to go eat lunch. Came here with about 15 coworkers and we took up about 6 tables upstairs. Our waitress was on the ball! She didn't mess up anyone's orders and didn't mess up checks. I had their Johnny's burger. I got it medium well, it actually came out medium, which was ok. It was big , juicy and full of flavor. The fries were great as well. My coworker got a side salad with her burger and the lettuce looked great. No brown spots or gross leaves. Dressing was good. My friend the tuna melt and he loved it. The tuna was made perfect, didn't taste too fishy, bread was not burnt. We all had a great experience there and I'm planning on going there again. The tables were clean, not sticky and fluffy people friendly. Spent about $20 with a tip, food and drink."}
{"text":"JLB has some great things going for it...they have IMO one of the very best burgers in Cleveland, hands down.  But their best asset is an awesome staff that takes great care of the clientele. Awesome spot for both food and cocktails!"}
{"text":"Perhaps my review is a little tainted by the fact that I read so many good reviews I had high expectations for this place. So take that into account. Due to the reviews we both got the hamburger. Expecting it to be the best burger in Cleveland I was disappointed. I've had better elsewhere and I've made better burgers in my house. It was a fine burger but nothing to come back for or even rave about. The service was good and the drinks were good although you only get happy hour prices at the bar, just fyi. They had Dogfish Head 90 minute on tap so that made husband happy. But overall not a place we'll go back to."}
{"text":"Ordered a medium cheeseburger.... received a well-done cheeseburger with 5 potato chips on the side.  Not sure what all the hype is about..... very dissatisfied.  Yelp will not update my review for some reason"}
{"text":"When in Cleveland don't miss Little Bar.
Best damn burger ever.  Michelle's medium rare cheddar burger with hand cut fries rendition, rocks!  Thanks to Mike from the Horseshoe for the referral!
Try the 90 Minute IPA.  Most excellent!  

A hidden gem!

Meeting locals like Eric, and getting additional tips on the best locations for breakfast, must see sights, and local history .... worth the stop by.

Hours are limited and they don't stay open much past 11:00 PM but again, worth a stop. Clientele very diverse, jeans to three piece suits. Enjoy!"}
{"text":"First I didn't know if I was in the right place because their is a Johnny's out front as well. Overall venue is not taken care of but it is a dive bar. All the employees take care of anyone. The burgers were okay the bar filled with smoke just expected a little better."}
{"text":"I was staying at the Renaissance in Downtown Cleveland when I was struck with the burning desire to demolish a really GOOD burger. The concierge told me there was only one place I should try. They weren't kidding. 1/2 lbs of very well-seasoned, quality beef on an airy roll. Good selection of beers (I had cider), quality service, and a beat up, old roadhouse feel. If fate happens to drop you in Cleveland, go here."}
{"text":"Pretty good place. Menu is kind of limited Johnny's is famous for the burgers but I font eat beef. I mostly get the turkey sandwich or chicken tenders. I would go back but not my top 5 places downtown"}
{"text":"the fried food hat-trick 
played out at Johnny's late night 
wings, rings, cheeseburgers 

A colorful cross section of downtown Cleveland during all hours of the day. Business suits, off duty cops, off duty waitpeople, and an occasional frat boy looking all wide eyed being in a real dive bar. Lots of beers, and a good stiff drink. Great food at the bar too a few notches above the average bar menu to say the least, since it is \"Johnny's\" after all. The cheeseburgers are charred to perfection, and the onion rings are the best in town. From the well worn bar, to the prison grade restrooms, its a great dive.

Carry on."}
{"text":"This was the perfect dive bar to stumble across during my short visit to Cleveland. Nestled in an alley way and behind the bougie \"Johnnys Downtown\" they serve up bar grub and reasonably priced drinks in a cozy, welcoming atmosphere. We tried the soft shell crab meuniere appetizer from the steakhouse in the front (it was recommended to us) and our server with a man bun got us a round of shots because I think he thought my mom was hot. Cheers, Billy! When I'm back in Cleveland I'm sure you'll see us again."}
{"text":"Went in for lunch today. I like the setting, its like a little dive bar with the entrance of a side side street. The main issue was the service. I think only two people we working when i first stepped in. I had to sit myself at a dirty table. It took about 20 mins to just get the table clean and drink order down. After ordering my food took another 30 mins for the food to come out. But the food was good. I got the turkey club on wheat, very simple dish but 8 out of 10 would get again. While the servers were having a hard time they were friendly. I think i just came in on a bad day. I am going to check it out again."}
{"text":"Yeah....just reading the previous reviews I have to completely agree.  I think that this little dive is perfect for a quieter downtown experience if you just want to hang out for some good convo, tasty food, and cheaper-then-average drink prices for downtown.  I love their burgers but keep going back for the mussels that run on special every once in a while.  These were some of the biggest I have ever seen.

The bar itself is dated as expected, bathrooms are acceptable but a tad small, the service is great, beer selection varies but the usual suspects are there, and if you are feeling really fancy without the clothes, you can order from the Johnny's upstairs menu and have it served to you in the Little Bar.  This is one of those places that I have to stop by for a beer if I happen to be walking by.  I'm sure it will become one of yours too, so go in and hope they have some mussels, must try.  Wings were really good too as a last mentionable to this review.   

There is no pool table or darts but I do believe they have a jukebox.

Cheers."}
{"text":"One of the best burgers in downtown Cleveland. Service can be a tiny bit slow but otherwise this is a very off the beaten bath destination for downtown."}
{"text":"I wanted a good burger and fries for lunch and I always saw the sign out front that said they have the best burger in Cleveland. Not sure that it is \"the best\", but I will tell you that it is a very good burger, definitely in the top ten. My service was also good, but I could see that if they were busy, you might not get the best service.  There was only one person working in the bar."}
{"text":"Not a bog fan of burgers, but this place made me change my mind. Was very impressed... place is small but a lot of fun and great burgers"}
{"text":"Outstanding food and great bartenders - Pat and Lindsay are the best!!  That Lazarus below is a tool never heard a complaint about this place, top shelf!"}
{"text":"Always a 5 star experience here. Staff is great, service is great, value is great. Arguably the best dive-y type spot in downtown, on a top 10 list in the city. What are you waiting for?"}
{"text":"Best burger I've ever had. Love the beer selection and service!  Great chicken tenders too. The only problem is that it can get you smokey at times. They need better air circulation."}
{"text":"This is an awesome place in Downtown Cleveland to drink and eat and just hang out nothing fancy but a rustic clean establishment off on the alley on West 6 st . Very nice staff , and I'm just gonna say best burger in Cleveland haven't found a place to beat em yet. I had their wings once they was pretty good too . There drinks and drink prices are great also for this area. Kudos little bar"}
{"text":"delicious burgers and quick service! the brunch menu available before morning Brown's games is diverse and unique. I would highly recommend this restaurant to anyone attending a sporting event in Cleveland!"}
{"text":"Johnny's had good food and prompt service, which is why it kills me to rate them one star.  They get one star for their deceitful behavior.  I don't want to call it stealing, but I don't know what else to call purposefully overcharging everyone in the party $5.00.

A group of friends and I went to Johnny's after tailgating to watch the Browns game.  The menu given to all of us showed Burgers as $8.75 (I even looked at the menu attached to this site--$8.75).  However, when our tabs came, every person was charged at least $13.75 for a burger.  When we started asking for our itemized receipts bc our totals looked way off, our waitress started treating us with a huge attitude & somehow, no one could find a menu with pricing in the whole restaurant.  

I would not ever go back here & would encourage any future patrons to carefully review their itemized receipt (and maybe keep a menu with pricing at the table as proof)."}
{"text":"I went in with every intention of eating \"the best cheeseburger in town\" as advertised on the little sign out front that directs you towards the alley.  Once I sat down and looked over the menu, I took a gamble and decided I was in the mood for pasta and went with the spaghetti with a veal meatball.

And you know what?  It was SO GOOD.  And it was $9! It's a tiny little place with a massive beer selection and a well-stocked bar.  The food was pretty slow coming out, but that's probably my fault for ordering from Johnny's main kitchen. 

It was late on a Friday night but it wasn't filled with the usual West 6th crowd - and for that I'm very thankful and will definitely be going back."}
{"text":"Do you love good burgers? Do you like smelling like good burgers? If so, I have just the place for you!

Little Bar is behind Johnny's and is exactly what the name describes: a little bar.  The bar itself is probably a 6 or 7 seater.  The whole place isn't huge, but accommodates plenty of patrons at tables and has a good size upstairs.  The bartenders and staff are always hard working and friendly; doesn't mater is there are 4 people at the bar or 80 after a Browns game.

So I spoke highly of the burgers.  They do them well.  And cook them in the tiny kitchen.  What happens when you cook in small enclosed spaces? Everything smells like burgers, but who doesn't like smelling like burgers? Are you un-American?  They also feature specials from Johnny's and their wings are pretty good.  Some of their other fried food is decent, especially if you are one of those 80 post-tailgate Browns fans."}
{"text":"Everybody is right when they say these are the best burgers in Cleveland if you are looking for a normal, non-gourmet burger without really weird toppings."}
{"text":"Definately little but very cute! They have a nice menu especially for a light lunch or dinner. The service is fast and so friendly! You can eat for under $25."}
{"text":"I got the \"World Famous 'Little Bar' Burger with Chips\" (real chips, not fries). The meal was good. I've had better burgers, but the reason I'd go here isn't for the food. 

I enjoyed the casual and cozy atmosphere. The music was good. The place has a hard core local vibe and is a good spot to hang out or watch TV. 

I'd definitely add this to a list of places to bar hop or watch sports."}
{"text":"What an awesome hidden gem! My boyfriends new office happens to be right by Johnny's. We stopped by on a whim late one weekday night. The Food, service, atmosphere were all perfect. It's a fun local spot, perfect for some late night grub. I got the burger with Swiss cheese. It was enormous! You better come hungry!"}
{"text":"cheap, low key dive bar-esque joint. 
you're coming for the cheap food that tastes great. big portions as well. thumbs up."}
{"text":"Recommended by a mutual friend of ours, this was the first place we hit as we rolled into town. BEST burgers in Cleveland. You can taste the seasoning they used in their meat. Want to know what it is - go try it. :)  

Prices were decent. Seats at the bar. Beer was FREEZING cold and the fries were plentiful with each burger. We'd def go back!"}
{"text":"A great place for a quick lunch or beer in downtown Clevland.  Old school, Cleveland staple with strongs drinks, great burgers and bar food with great service."}
{"text":"Two words for this place... HIDDEN GEM! Seriously... a half pound burger made to order... what's not to like! The service is not always on par, but it's a dive, and you really shouldn't expect must more than that! This is the cream of the crop of all dive bars solely because of their infamous burgers! It's a monstrosity of juicy finger-licking deliciousness. Unfortunately, everything is an add-on with the burger (except for lettuce, onion and the bun), so you can easily spend $10-12 on the burger getting the meal customized to your liking. But don't get me wrong, you will be satisfied and full when you walk out of there! It comes with chips, but the onion rings or fries upgrade are worth it! Also, this dive bar is the sister restaurant to the upscale Johnny's on W. 6th. They even share a kitchen for some of their menu items, so you can expect their entrees to be high quality food served at a cheaper price than its counterpart."}
{"text":"A hidden gem in Downtown Cleveland.  This dive bar makes some of the best burgers in town.  While the lunch crowd keep this place busy, if you are looking for a place to grab some food at night, i highly recommend it.  The bartenders and staff are very friendly, making sure you get your food and any drink(s) quickly."}
{"text":"A very small divey bar but fun! It's a hidden gem tucked away in an alley and when you are inside you don't feel like you are in the middle of a city. The burger is definitely one of the best I've had...and the tall beers were not too expensive!"}
{"text":"Perfect place to go to to complete the Cleveland Experience.  25 yrs Ago this was the deal, now we have a lot of Bistro Pubs and clubs to navigate....  forget it.   Music is great Rock, Food tip top, drinks are nice price."}
{"text":"Would have been 5 Stars but they don't have the homemade dip anymore!  Bring it back!!  Get the homemade chips - it's worth it!!!"}
{"text":"Why has it taken me so long to go here?  

First of all, I LOVE dive bars.  This place is perfect for watching a game or just hanging with friends.  I hate to call this a \"dive\" bar because of the negative connotation, but it's really laid-back and not flashy.  There was a nice mixture of ages and cultures present.  The place is clean and the bartenders are friendly.
 
The past reviewers have been raving about the burger, so that's what we ordered.  I am so hesitant about burger reviews because everyone's tastes are different.  However I was pleasantly surprised by the quality.  It was served on a fancy white plate, so they must share the same dishes with the upscale restaurant next door.  My dining companion raved about the onion rings that she ordered as a side.  I tried one and they had the perfect amount of breading-to-onion ratio.  The burger is top notch.  I would definitely put it in my top 3. 

I am looking forward to going back and trying out some of their Italian fare!"}
{"text":"Did seem to have a sizable beer selection. Nothing particularly unique & nothing priced any better than what's readily available at all the other bars in the area. 

It did have a quaint, small setting, but what nobody enjoys in a first visit is a smartmouth bartender that is completely devoid of tact. Understand you probably think you're just showing personality, but that only works if you also possess charm. Ya didn't

Worst part of the experience is getting lied to your face. They claim to serve food til 1 am, you show it is clearly 12 minutes to 1, & they respond with an oh well, thems the breaks shrug.

If management or ownership has any pride in their product, they won't stand for this lack of character display on the part of the staff or failure to uphold their service promises

Good luck & cheers"}
{"text":"This is the late night little brother of Johnny's Downtown, that while attached to Johnny's, is only accessible by walking down a trash filled alley...but my oh my is it worth the trek.

We were looking for a late night bar in Cleveland after our convention ended for the night an exhausting the hotel bar.  The bartender said that some of the bar staff would head to Johnny's Late Night on occasion if they were going out after close, and that sold us.  We got directions and meandered our way through the foreign streets of Cleveland, and down the aforementioned trash filled alley, and there it was: Johnny's Late Night!

It was divey, dark with regulars looking at us like the strangers we were, although they still engaged us in conversation which was very much appreciated.  We all ordered food and drink, with no complaints.  My mixed drink was poured deeeeep and the chicken fingers we're perfect to soak that drink up...the chicken undoubtedly came from an genetically engineered mega-chicken, and it must've gone through at least 8 dips in the deep fryer...perfect.

We stayed still close, and by the end I was sold.  As we returned back to the hotel all we could talk about was how great Johnny's Late Night was, and of course the hundreds of bats circles the lit skyscrapers of Cleveland.  Still waiting for an explanation regarding the bats, and awaiting my next trip to Johnny's Late Night as well!"}
{"text":"As I started to write my review, I realized that everyone was on the same page.  Last night, a busy Friday for downtown CLE, we ducked into the \"little bar\".  We were greeted by a very friendly, attentive  bartender, even though, the place was packed with an obvious office holiday party. 

Service was awesome, very friendly and quick.  And of course we had the burgers!  Perfectly cooked, HUGE, and on a very soft, yummy bun.  Reason for only the 3 Stars...is I would have preferred a different type of lettuce, preferably shredded iceberg, and I am a huge pickle person.  I need them on the burger, not just on the side.  But,  I am very excited to go back and try other menu items. 
The atmosphere is comfortable, inviting, and not for the snooty.  If you are looking for a Bar Louie type place, then go to Bar Louie.  Johnny's little bar is casual.  And yes, you may leave smelling like a burger...and a DELICIOUS one at that!!"}
{"text":"Small quaint place in one of west 6th's alley ways which can make it hard to miss despite a wooden board that claims that place has the best burger in CLE. Unfortunately lots of people abuse that phrase but in this instance I stand by their claim. I learned that this place is indeed part of the famous Johnny's restaurant and Johnny's little bar's savory burgers are made from meat shavings from the big restaurant. You get a nice thick slab of meat, they know how to cook a real medium rare. Price is decent $8.75. The room is a little small so it can get smoky in there when they're cooking your burger. I'm a burger fanatic and would definitely give this place my title for Cleveland's best burger"}
