{"text":"It is what it is......Dogs should never be grilled......steaming brings out the flavor and juice. Drop your dimes elsewhere inside the market."}
{"text":"Johnny Hot Dog looks like hell when you walk up to the counter.  The same two ladies from when I went with my Dad in the 70's are still there - a bit grayer, but still with that W.25th street vibe.

It's got to be a chili dog with \"the works\" .... 'Nuff said"}
{"text":"Looking for a quick and delicious hot breakfast at Wsm this is the place to go. And the owner is super friendly! Get the pierogi for lunch!! Best in the market"}
{"text":"Today 3 of us went to the West Side Market today, Saturday, arriving about 9:45 AM
and 2 of us decided to start off with a Johnny's Hotdog which we have both had in the past.
A big disappointment.  In the past we've experienced their hotdogs with a snap to them and juicy.  Today neither the snap or juiciness was present.
There weren't too many hotdogs on the grill so I believe that they were serving hotdogs left over and warmed up from the previous day-the ones they didn't sell.
So folks, don't buy a Johnny's Hotdog early in the morning.
Better to try one in the afternoon.
You would think they would want to put out their best product."}
{"text":"This place is your one stop shop to get a quick bite to eat. Whether it's corned beef sandwich, perogies, ham and cheese, hot soup or just a simple chili hot dog. This is the place and they have it all. Come get some corned beef even before saint patricks day."}
{"text":"Update:  On a summer nitrate filled hotdog bender.  6 Johnny-dogs a week.  God help me.  Johnny Hotdog.  I need you.


I love this place.  If you ask for a burnt hotdog, odds are you will find 2 tubes in the bun.  Helluva non-designer cheeseburger too - use the 5 minute wait to wander the market, and eat up on the balcony to view the human-drama below.  The balcony entrance is at the top of the stairwell by the wsm's front (w25 side) main entrance doors.  Good and real stoner food, I'd give it five stars if they had grilled onions and celery salt as thats all thats missing on their delightful hotdogs...
In warmer weather, or for even more \"human drama\", sit outside in the park across the street.  hmmmm - maybe not."}
{"text":"Classic hot dog stand like your dad use to go to back in the 1970s. Nothing has changed. The people working here, are working here. They're nice, but it's nothing super trendy, don't expect your fancy Food Network TV star to show up and talk about how innovative their dogs are. They're not. It's just a old school place to grab a bite like you use to back in the day.

Biggest issue is the rude trendy people walking into you right after you order your wiener. Yeah I see you have a nicely groom beard, now go find your kimchi you hipster and get out of my way. I've got to go eat my food while standing up at the shelf by the empty bun racks. 

If you didn't read this with the voice of the muppet from \"Johhny T's tourist tips for New York\" you're doin' it wrong. Go watch it then come back and read this again."}
{"text":"Look,
the 'point' of Johnny Hot Dog is less the taste (2 stars) and more the ambiance (4 stars). The kitschy time-machine decor with it's yellowed photographs and dated signage are the perfect ending to a day shoving your face full of the awesome randomness of West Side Market.

A bunch of us grabbed about 5 dogs ranging from your basic mustard and ketchup to a couple chili dogs, they would have just been 'meh', but paired with sitting on the heaters of the upper balcony overlooking the market below, bundled in out winter gear made them perfect.

Your in Cleveland, your at the West Side Market. Shut up and eat your damn hot dog."}
{"text":"My Uncle Nate use to own this stand originally. I believe he sold it a while ago and I haven't been to the Cleveland West Side market in years, BUT when I was young this was the best place to visit at the West Side Market. I would remember my dad buying me a Superman comic book from the news stand and eating a Johnny Hot Dog. I ended up drawing Johnny Hot Dog for my Uncle Nate and he would proudly put those drawings up on the bulletin board (my early entry into the Marketing Arena.) I would highly recommend checking this place out just for the nostalgia!"}
