{"text":"This is hands down the best burger I've ever purchased. The fries are excellent as well. The only thing i could wish for would be for them to offer free range organic beef."}
{"text":"Just a well made (large) cheeseburger. Bravo. No weird additions just fresh ingredients. Will for sure be coming back."}
{"text":"Loved this place as Lobby's, and had a pretty good experience with the Johnny's version until the last couple of visits. 
Burgers have been over-cooked and dry, Italian beef not dipped as requested, and over-cooked beef to boot. Makes for a dry sandwich.
Fries are still great, and shakes good when they are remembered. 
I know they're capable, just lost a step and now becomes less desirable, especially with a $40 to-go tab plus tip.

T"}
{"text":"Amazing work! 
The customer service is great nothing bad just that they all do a good job! I enjoy my meals here can't beat it!"}
{"text":"Wow. This place has been across the street for some time and I finally decided to give it a try. This place is absolutely phenomenal! Burger was juicy but the best part was the bun and the service was quick! They toasted it and it takes the burger to the next level. This place can definitely be compared to The a chuckbox in terms of quality. 

I'll be coming here for a very long time!

PSA Do not skip on the cheese fries. They are to die for!"}
{"text":"I had the Italian beef combo with french fries absolutely delicious extra peppers. Very clean restaurant employees very nice and courteous my new favorite spot!!!"}
{"text":"I ordered chili cheese fries and a burger. No flavor on either one. I even had to dip the chili cheese fries in their special (thousand island) dressing. Good concept, lacking seasoning."}
{"text":"MMMM... this is a Tasty burger

Italian beef with hot peppers dipped... real good."}
{"text":"I am from Cali, and it's hard finding a good order of chilli cheese fries or a good pastrami. Even though pastrami isn't on their menu yet (hopefully soon) their chilli cheese fries and chilli burgers are the best. I have to drive to Phoenix for a good pastrami  (the burger shoppe) on Thomas Rd is really good also. Anyway keep up the good food."}
{"text":"I went to Johnny's for lunch. I bought for myself a chili cheese burger. The chili was good, but the cheese burger was much to rare for my liking. I tried to call Johnny's to let them know but no one picked up and no way to leave a message. I also purchased chili cheese fries and a cheese burger. Chili cheese fries are great. 

Debra M"}
{"text":"This place should be call BiG Ass Burgers!! Wow...just an outstanding juice flavorful burger.  Pressed fresh on the grill - I took a run at the Double Cheese and just barely got through it..  Fires were good - could use some seasoning to finish off the meal. Well done Johnny!"}
{"text":"This place serves a great burger! My daughter and I were in the neighborhood and after seeing the reviews, we thought we'd drop in. Glad we did! Good food, good service. We will definitely be back."}
{"text":"This place has the best burgers!  They use actual ground beef that they form into patties right there in front of you, and all of the toppings are so fresh!  The fries are kind of bland, but the dipping sauce is perfect, or you can get chili, cheese, bacon, or some other toppings on the fries.  And don't bother with the caesar salad, stick with the burger."}
{"text":"Soooo good!  They were so nice, bathrooms were clean, and there was something for everyone (family of 6) which is very hard to do for us because we have a mix of big kids, little kids, carnivores and vegetarians.  Loved it!"}
{"text":"Good stuff. If you order soda, it's fountain soda, not bottled. Tastes fine, though.

Weirdly, the burger patty on my burger was substantially wider in diameter than my buns, which made feasting on the unearthly delight which is their chili cheese burger messier. Fries were good. Everybody liked their burgers. Fry sauce is on point.

DO NOT ORDER ONLINE. It will go through a half-dozen middle-men before they even start making it. It took over an hour for the restaurant to even GET my order doing it through Yelp. Save yourself a headache--call them! They'll start it right away. Not \"Johnny's\"'s fault.

The delivery guy forgot my chocolate milkshake, but they went so far as to make me another and make the delivery guy bring it! I mean, sure, I paid for it, but they didn't have to do that! It's obvious they care about their customers being happy. It was a really delicious chocolate milkshake, too, so I'm happy they didn't just offer my credit or something.

Recommended!"}
{"text":"I just tried this place out for the first time this past weekend. Food was amazing! I couldn't believe how big the portions were. Definately blows Portillos out of the water. Friendly staff, the food came out quickly, and despite my friend's annoyingly complicated order, everything came out perfect."}
{"text":"OMG OMG It's baaaaack!

We loved Lobby burgers and then our world came crashing down when it shut down suddenly,  For weeks we waited and waited and hoped that they would come back to us.  And then about a month a go I noticed a new sign. OOOOOHHHHH  Could it be???  YES!  My husband and I used Door Dasher and then food was amazing.  Still hot.  Burgers were indeed medium rare and juicy.  Fries were just as yummy.  
If you were a Lobby fan, you will be so please.  If you have never been there and tried there food, GO!  I promise you, you will not be disappointed.

Thanks Johnny's for bringing a little food bliss back."}
{"text":"I've been here a few times now and I must say they have never disappointed me. The chili is tastiest chili I have had in AZ, I add it to everything; I would compare it to my grandmas recipe which is saying A LOT. The hot peppers are a MUST! They were perfect on each of my meals (I have had the cheeseburger, chicken sandwich, fries, and chocolate milk shake). The staff was super friendly and the place was very clean and it looked inviting. Before coming here I thought the freshest fast food burger was in-n-out, but I actually do a calorie intake every single day and it turned out that Johnny's burger patties were much leaner :) Also, ask the staff for the fry sauce, it is all homemade and full of flavor. YUM! I would and have recommended this place to my family and friends."}
{"text":"If you are craving MEAT, this is the best burger I've found in Tempe...It's simply delicious!"}
{"text":"Good burger. Had a cheeseburger. Good quality. Okay price. Could've been cheaper. Since you pay for drinks and fries separately. Clean place. Clean tables and chairs. Staff walked order out to us. But didn't greet when we walked in"}
{"text":"Alright where do we start, let's start with the burgers. First in foremost the burgers were very dry and bland. Next the cheese fries. If they decided to stop being so cheap and put a little more  cheese on the fries they would be delicious. I personally thought everything there was super dry and hard. I only recommend this place to those who are seeking dry food"}
{"text":"This is the 2nd time I have been to Johnny's. The first time I only ordered cheese fries, and boy I tell you.. I love cheese fries and they did not disappoint me at all. so I went back ordered cheese fries and a burger. the burger has the most delightful taste along with the homemade sauce. Once again I was VERY PLEASED. The service is quick as well!!"}
{"text":"Great burger place for the \"not so fond of hamburgers\" type person. They don't offer a gluten free bun so I opted for the regular hamburger wrapped in lettuce. The burger meat was flavorful, cooked to perfection with delicious crispy edges. I opted for grilled onions and no special sauce (mayo/catsup) mixture. The pickles were delicious and the fries were very fresh. Great place!!"}
{"text":"Found this place on accident looking for the yogurt shop that closed down in the same parking lot so we stopped and grab something to eat I'm glad we did great food great prices good service"}
{"text":"Such a great find.  Thank you for the reviews that led to us going here. The hamburger was amazing!! 
The hot dogs had such fresh ingredients. Stsff frindly and understanding of us newbies. Definitely a place we will return."}
{"text":"Really satisfying greasy homestyle comfort food! The Italian beef sandwich is delectable with sauteed onions and green pepper. Going back for the Italian sausage and  burgers next time.   Atmosphere is very utilitarian, though. Seating is about a dozen hard plastic booths, but still feels homier, more authentic and a lot less \"assembly line\" than Portillo's. Didn't see the need to have two TV sets blaring in a place this small."}
{"text":"I am from Chicago and this place is just ok. There is a high school nearby so as my 20 yr old daughter and I sat there quite a few students came in after school. Almost every one of the students ordered the cheese fries. My daughter had the hot dog and I had the chicken sandwich. My daughter said her hot dog was ok. My chicken sandwich had some kind of sauce on it. I think it might've been thousand island salad dressing. Eww. My daughter and I shared an order of cheese fries. Not that this place was bad, it just wasn't impressive. I will definitely go to Portillos if I want authentic Chicago style food."}
{"text":"First timer. Clean, small, and friendly staff. Ordered a burger....it was so good! Really enjoyed it and made fresh to order. My only downside that isn't their fault at all, is that they are right next to a high school. Place filled with teens eating only cheese fries. Be aware and stay away during those times of when the kids are out. I'll definitely go back!"}
{"text":"Lobbys revived. This has alway been one of my favorite places for burgers. Menu is the same as Lobbys and the food is awesome."}
{"text":"Mediocre at best. The burgers were saturated in grease, the hot dogs were luke warm, the fries were generic and clearly previously frozen. The woman who brought out our food was scowling and silent. The menu was mundane and uncreative. It's always worth a trip to somewhere you've never been to support small businesses, but I honestly can't imagine how this one stays in business. Don't waste your time, especially when Ted's hot dogs is right up the street. I promise that extra 3/4 of a mile will be worth it."}
{"text":"Edit: Having gone back and tried their burgers, added another star. Burgers are definitely their specialty, not Italian beef. They cook everything up in front of you and you don't wait long before you are faced with a massive, greasy, perfect burger. 

I definitely want to go back and try the burgers, because they looked and smelled amazing. Made the mistake of trying the beef/sausage combo sandwich instead. Definitely not their specialty. Portillo's all the way. Meat was dry, despite the whole sandwich being dipped. I didn't really care for the flavor so I picked it all off and just had the sausage. Grease ran down my chin as I attempted to eat that colossal mess. Seriously, this is a huge ass sandwich. I felt disgusting eating about 2/3 of the sandwich and admitted defeat. Meanwhile, my boyfriend complained that he didn't like the flavor of the au jus, and half-heartedly picked the meat pieces. The cheese & hot pepper mix was fine on the sandwich, but the grilled onion strings definitely did not go with the sandwich. I had been hoping they would be chopped, but even then they belong on a burger. 

The cheesey fries & chili cheese fries are an insane portion. Each one is a meal for two in itself. I only could eat a few bites... there's more cheese than fries. However this isn't really a complaint. The chili has an excellent flavor, and you can tell it's their own original recipe."}
{"text":"This is seriously the best ever! Burgers beef sandwich fries!!!everything is fresh and cooked to order the crew is friendly.  Beats any chain hands down!!"}
{"text":"Updated: I have been coming here for years (when it used to be Lobby's) and am very disappointed lately. My burger was way too over cooked. I always eat it all the way up until the last bite, savoring my last piece and I couldn't even get through half of it this. Unbelievable.. Don't know if I'll be coming back for a while.  2 stars because it's happened twice in a row now."}
{"text":"Awesome hot dog , chilly tasted great ,  nice soft bun . Presentation was good .  Cheese fries were also yummy . Wish I wasn't from out of town or I'd be a regular here .  Employees were really friendly and helpful . Saw a couple other items people ordered . They all looked good. Looks like you can't go wrong with anything"}
{"text":"This place is great! The chili cheese burger is to dang good ! I can't get enough of it ! I just ate there and I'm already craving it again ! The service was very friendly and great and not to mention prices ! All the prices are very low and you get more then what you pay for"}
{"text":"Run, don't walk, to Johnny's Burgers & Dogs! I had the double cheeseburger combo and this is, simply put, an outstanding burger. All the ingredients were very fresh, the burger was thick and just the right amount of juicy. But what I really loved is that the kitchen staff took the time to actually construct this burger. It was beautiful and dare I say, \"camera-ready.\" The burger was absolutely delicious-not drippy, not salty-- just a perfect burger experience with a substantial bun that holds it all in place without being too heavy. Did they have a group of engineers put together this burger? It seems like they did because all the things that could potentially be wrong with a burger were absolutely RIGHT at Johnny's.

Even the crinkle-cut French fries were perfect-not too hard, not too soft, not too big, not too small. Johnny's gets a big \"A+\" for having fresh cooking oil, too. I can't stand it when I get fries and they taste like stale or old oil. Every burger chain in town should take note of this place because THIS is how you do fries.

I also loved this restaurant for it's straight-forward and easy-to-understand menu and the place is ridiculously clean. I dare you to find anything remotely dirty or icky at Johnny's-you won't find it. This is one of those places that you just know the owners, managers and staff are really stepping up and taking care to give a great dining experience to the restaurant's guests from start to finish. The modest restaurant sits in the shopping center on the northeast corner of McClintock and Southern and is definitely worth a stop. Did I mention they have shakes, too? Alas, I had no room for a shake. Darn.

If I hadn't been so stuffed, I would have tried a grilled Italian sandwich, a Chicago-style hot dog or one of their salads, but this just gives me another reason to go back. I'll see you there five minutes... HURRY!!"}
{"text":"Holy shitake- this place is amazing!

This is the best cheeseburger I have ever had. I have been to all the usual suspects, including places that are fancy and expensive and purport to have the best burger. Johnny's is just perfect. 

I had the double cheeseburger, fries, and strawberry shake. What impressed me the most, is that the attention to detail on all the items. Each ingredient is top-quality and all of the parts combined come together in perfect harmony. 


I ordered:

-Strawberry shake= perfection
-Crinkle cut fries= perfection
-Double cheeseburger= second to none

I really cannot say enough about the food. Just amazing. My meal was $13, which you might think is a little high- until you taste the quality and flavor. It's well worth every penny. They have a Yelp check-in deal for 20% off, but I skipped it- I want this small business to survive and don't want to take from them. 

The place is immaculately clean, the staff were super friendly. It's just perfect. I've heard the rave reviews and they were right! 

My only request is that they offer Malts in addition to shakes. It would be super simple to just buy some malt powder and charge .75  for it. 

If you are a burger enthusiast- run, do not walk to Johnny's! Your taste buds will thank you- and you will have a new bar in which to measure all burgers."}
{"text":"How I love Johnny's! Great burgers made with fresh quality beef. A number of topping if you want to load up your burger. The fries are made to order and come hot and crispy.
For a change, I sometimes get a chili cheese dog. Be prepared , it comes loaded with cheese and chili.
The service is fast and the staff is very friendly. No Mickey D's attitude at Johnny's.
We have been coming to Johnny's since they opened and have never been disappointed.."}
{"text":"Went during lunch and got the burger combo with bacon and mushrooms. Was a great tasting burger and had plenty of fries left over. Overall was happy and pleased with how filling the meal was."}
{"text":"I'm sure glad to see Johnny's come to rescue and resurrect the old closed down Lobby's location. It was so sad to see the doors of the previous place locked with a handwritten note on the door stating there was a problem.

The menu and ingredients are virtually identical to the last place and the freshness and high quality of the product are exceptional. You can even watch them cook it in their nifty open kitchen. Just come on over and give them a visit and you'll see for yourself.

Usually order one of their delicious Hot Dogs, or maybe an Italian Beef. Their juicy handcrafted USDA Choice Beef Burgers are spectacular and a must try. The crinkle cut french fries are nothing special until you dip them in their top secret famous fry sauce. Yes!

Service is always friendly and the inside is very clean and tidy. It is very easy to order too much food and end up overeating until you explode. It happened to me and I had a hard time getting motivated to go back to work. Just tell your boss you went to Johnny's.

See you there next time. You won't be disappointed. I'll be the guy rubbing his belly as he leaves the building. TOUCHDOWN!

4.75 STARS"}
{"text":"Solid burger joint with great tasting burgers. Burger patties look homemade, red onions, lettuce cheese, big thick pickle slices and their sauce which is like a thousand island blend of sorts. Got the chili cheese Crinkle cut fries. The cheese is straight up nacho cheese which is so movie theatre gangsta and ratchet simultaneously. Loved it. Chili was not too shabby.  Was it the best? No but it was tasty and different and affordable. The service was friendly and the place was super clean."}
{"text":"Great food and awesome service. The cheese fries are killer. The 2 guys that were working were nice and asked us how are food was. Check this place out for sure, it's just like Lobbys (same spot) but they have some more items on the menu."}
{"text":"Great little burger, hot dog joint.  Has that retro type menu and preparation in a modern setting.

Very good Chicago dog, nice proportions, hot crinkle cut fries in a white paper bag.  The hamburger tasted fresh and put together with care.  

Friendly staff, clean eating area, free refills on soft drinks, easy to find, easy parking, reasonably priced."}
{"text":"Ordered sandwiches dry but somehow they were soggy 8 min later when I got home? Weird. I just moved to Tempe and thought I'd try this place instead of Portillo's. Won't make that mistake again. It's a very similar menu, similar price point, lesser quality product."}
{"text":"This place is great! My favorite is the chili dog. The place is clean and the staff is friendly.  It's the best wiener I've had in a long time!"}
{"text":"I got one of the chicken burgers. I think it would've been a lot better without the sauce. The sauce kind of reminded me of Chili Cheese Fritos x B.O. I couldn't really tell why I kept eating it, but it happened When I finally got to the fries, they kind of just tasted like plain, frozen crinkle-cut fries. On the bright side, the service was wonderful, and the people around the register were friendly. I'm probably not coming back, but then again, I'm not even from Arizona to begin with..."}
{"text":"Delicious burgers and Italian beefs! I'm from the Chicagoland area and pretty picky about my Italian beef and this one hits the spot. Love their double cheeseburger - it's huge and a meal in itself. Only 4 stars because I feel it's a pricey burger, especially for not including fries. Good fast casual option though!"}
{"text":"Classic burger and hotdog joint. 

Walked in to a friendly welcome greeting from the cooks. Food came out quick. Was very affordable. The burger and ingredients tasted great. The fries were awesome. Great lunch spot - especially if you think the line over at Teds is stupid."}
{"text":"The fixings for the Chicago dog and the bun with seeds was right, but it was not Vienna beef. Wrinkled fries were perfect. Italian beef is below par from true Chicago style. No chicago style tamales either. Staff was excellent and friendly."}
{"text":"When Meg and I heard that Johnny's had opened up in place of Lobby's, it felt like Christmas had come around all over again. We immediately made our way out to Johnny's to try them out. 

I got my usual standby: Cheese Burger with mushrooms. Meg got a combo burger so we could share the fries, drink, and fry sauce. The burger was cooked perfectly with the same great ingredients as it's predecessor. It's like they never left. The bun did taste a little different the first time around as if they used a potato bun or something but it didn't hurt the burger at all and they have either changed it back or it's no longer noticeable. Crinkle cut fries tasted great and the fry sauce is to die for.

Today, I decided to put Johnny's to the test. For anyone who as read my scathing review of Poritillo's, you know I had recommended coming here instead when it was still Lobby's, despite the fact I had not had an Italian beef here. My faith in Lobby's at the time was unshakable and I had faith that Johnny's was no different. Today proved me 100% right. Meg and I shared a half dipped Italian Beef sandwich with hot peppers. I will say this, Johnny's does not mess around with the portion size. This thing could feed four people that's how huge it is. But we destroyed it as if we hadn't eaten in weeks. The beef was well seasoned with an Italian herb blend, had the perfect amount of au jus sauce,  and the hot peppers were legit hot which is a major plus to me. I could not have been more pleased with this sandwich which means now I have to have an internal debate every time I come in on whether or not I want a burger or this awesome sandwich. Only critique I have is that it came wrapped up in paper which, had it not been dipped, would have been fine. But in this case or even a fully dipped one I would recommend asking for it in a container instead or risk accidentally eating the wrapping.

Every time we've been the staff has always been friendly and seemed genuinely happy to be there. On our first visit and most of our subsequent stops here the manager/cook Carlos took the time to greet us and even come talk to us once he had caught up on the food orders. Very friendly and remembered our names (or nickname in my case, no judgement though ;p ) even after only the first visit. He even remembered Meg just from a Yelp Talk thread showing he definitely takes a lot of time and pride in what he does here. 

All in all, Johnny's is an amazing experience with great food and great people. I am happy to have them back and as good as ever."}
{"text":"I went with my kids. The burgers were a bit pricey. My hamburger was dry. The fries were OK. Not worth the cost or taste. Staff could of been more friendly.  My son liked his cheese burger, daughter thought it was just OK."}
{"text":"I used to come here when this place was called Lobbys so it's been a few years. Well the burgers and dogs are still delicious if not better! The chili cheese fries are the best around. The cook is super nice and brought stuff we needed to our table without us having to ask. Great job Johnny, we'll be back!"}
{"text":"Wow. Visiting Tempe for daughter's college tour and found this place on Yelp. Fresh made burgers that taste fresh. Chili cheese fries are also great. But the star is their fry sauce!  The manager gave me a small cup to sample with my fries and this stuff is amazing. When we get back to Tempe we'll definitely be back to this place!"}
{"text":"Great lunch spot for a burger or dog. Italian beef is great too! Kids (high school) love this place as well as adults."}
{"text":"Honestly, I can't stand this place. My husband loves it and it's Fathers Day so I came with a smile. He loved his burger. This time I tried a Chicago Dog instead of a burger. The dog was luke warm, steamed not grilled and bland. How does bland happen on a Chicago dog?!!  Their tea tastes funky and disgusting, I don't drink coffee or soda, the lemonade is too sweet and the water from the machine is nasty. I tired half lemonade/half water but funky water doesn't dilute to a pleasing flavor. 

All that being said, service was good (nothing special but good) and my husband loved his burger and fries. 4.75 from him and 1.25 from me, so I'll average it out to a 3/5. 

Since its Fathers Day I ate with a smile. Only my review tells the truth about how I felt about this meal."}
{"text":"Johnny's makes a very solid hamburger for a great price. Its prices are competitive with fast food, but the ingredients are so much better and more fresh so the burger I ordered was much more akin to a burger I would make at home. Also, it was huge. I ordered the double not thinking I would get a monster of a burger with two not-paper-thin 1/3 pound patties. I could barely fit this thing into my mouth. The patties were even cooked to a nice medium well, not your standard fast food well-done. I added mushrooms which were well cooked and plentiful which is a big plus. The fries were good but nothing out of the ordinary. Definitely order some fry sauce to accompany them because it elevated them at least. The only reason I didn't rate this place 5 stars and my new hands down go to fast but not fast food burger joint is the hamburger patties lacked in seasoning. Just a little seasoning salt, pepper, and granulated garlic and/or onion powder would have made this burger sing. Even so, it's a place I'll definitely come back to instead of other fast food chains who don't cook but instead manufacture their burgers."}
{"text":"I ordered a cheese burger with fries and my boyfriend got the Italian beef with friends. They were both absolutely delicious! Also got fry sauce which kinda tasted like chorizo to me. I would come here often if I lived in Tempe. It's Chicago themed which my boyfriend appreciated because that's where he's from. Fast, friendly, and fresh food!"}
{"text":"Great hot dogs!  We had chilli dogs, and to tell the truth, I really wanted to order a few things from the menu.  Chili had a good consistency, was not spicy, just a good taste.  The dogs are boiled, which I like.  Definitely going to go back to try more."}
{"text":"I really wanted to love this place.  

First negative was no kids menu. 

Second negative was the beef sandwich.  It looked so good and was packed with the perfect thickness of meat.  Was dipped.  However, I like simple goodness and this sandwich had way to much seasoning.  I wan't the texture to be soggy bread, and lots of meat.  This had way to many \"chunks\" of season.

Third negative - my kids would hardly eat her food.  First complaint was the french fries tasted \"fishy\".  I'm not sure what she was tasting... maybe old oil?  She had a similar complaint about her plain cheeseburger after eating less than half.  Perhaps it was the butter/oil they slathered on the bun to toast it?

Only positive part of the experience was the cheeseburger.  Cheese was perfectly melted and the lettuce was very crispy and the pickles were delicious.

$21 not totally wasted."}
{"text":"I was a huge fan of Lobby's, and when I found out the same place was back as Jonny's I got excited. I had not had a good Italian Beef in 2 years. Well my first trip today to Jonny's was a let down. The place still has the same strange smell the old place had. It may be the oil they use in the fryer, but it's an off smell. I got the Beef sandwich with hot peppers, and had them soak it. It looked great, but the beef had a strange taste, like maybe it was freezer burned. I thought at first it was that the oil in the hot peppers was rancid, but after finishing it I found it was the meat that was not good. I truly hope this was just an off day, and I will try them once again. Stay tuned."}
{"text":"Had a chili dog, maxwell street polish, hambuger and cheese fries.....third time ordering....awesome great food..maxwell st polish is gonna be my favorite. Best stuff. Used uber eats...fast hot food."}
{"text":"I love Johnny's! They have the best cheeseburgers! Their thousand island sauce is so bomb. The cheese fries are also good with their sauce.  The chocolate shake was perfect.  It wasn't over sweet either. I will definitely be back!"}
{"text":"I had a cheeseburger with the fries and a soda. I thought the burger was serviceable and I can think of a lot better burger restaurant options. The fries were just okay for me. So once you peel back the onion on this place you'll find that it's just an average burger joint."}
{"text":"Delicious and giant burgers. Toasted buns, home made pickles and yummy crinkle cut fries. We ordered this for delivery from the yelp app and it arrived on time, fresh and hot. What a great find!"}
{"text":"Small little joint. The food was decent. I wasn't impressed with the chicken sandwich at all (it was tasteless, honestly). The hot dogs were definitely good and I would order them again for sure. Super confused about why the relish is extremely green (added food coloring- idk?). Small place inside but there were 3 tables taken on a random evening."}
{"text":"I saw the reviews so I decided to check it out. I got the italian beef and it was great. The sandwich was packed with beef. This was one of the best beef sandwiches that I have had. I got it to go and had the au jus on the side which let the sandwich travel well. I will definitely be back to try the rest of the menu. the staff was friendly and the wait time was pretty quick."}
{"text":"Pretty darn good burger. This joint popped out of nowhere in my old neighborhood. The cheeseburger is tasty while the fresh lettuce, onion, thinly sliced cucumber and semi-crispy bum give it that crunch in every bite. Can't put it down 'till you put it down. Fries are crispy and golden. I'll be back baby!"}
{"text":"If you remember this spot as Lobby's then you remember exactly what this place is.

Aside from a minor name change and a different color scheme this place is literally the same everything. The Italian beef is just as good as you remember the fries are just as crisp and the fry sauce is just as good.

Even the guy making the burgers is the same. I actually spoke to the new owner who actually helped build the original Lobbys menu and train the staff and he said when Lobby left the business he bought it and everything is running the same as it ever was.

I love the food here and it is a favorite spot of mine for lunch or a good filling meal. The Italian beef and sausage combo is still my favorite but the burgers are on point. The Italian beef can be favorably compared to portillos and in my mind is probably better.

My only gripe is a carry over from Lobbys which is you should get at least 1 fry sauce free when you order frys. It shouldn't be extra. That is a minor complaint though and I still love this place/"}
{"text":"Burger was tasty and juicy.  Place was clean.  Service was fast. Really enjoyed it.   Will go back."}
{"text":"Where else in the valley can you get a full-sized real ice cream shake for just $2.99? Most places want $5 for a small shake and most times it is not even made with real ice cream, just some chemical concoction with high fructose corn syrup. I used this luscious baby to wash down my cheeseburger ($5.69). The meat tasted very good and included onion, lettuce, tomatoes, and pickles, as well as the American cheese. The bun was a little different than when this place was called Lobbys, but it held up to the hearty burger very well. 

The man at the counter wanted to know if I wanted fries with this. I told him that I was going to be lucky to get this volume of food down, so the fries were going to have to wait until another visit.

Super clean for a burger joint, parking is close to the door, and the staff is friendly and fast. I plan on trying the Italian beef sandwich on a future visit. Note: Unlike the prior Lobbys (which opened at 10am) Johnny's does not open until 11am."}
{"text":"Ok burgers, very generic nothing special about them.  Ok for the price but I wouldn't call them the best burgers I tempe."}
{"text":"Another great find through UberEats!  Italian Beef sandwich was perfect.  Cheese fries were drenched to perfection!  (Who doesn't love cheese sauce?!?)  Will definitely try a hamburger for my next visit.  (Or delivery!)"}
{"text":"I always forget how amazing their burgers are. One of my favorite burgers in Arizona."}
{"text":"We came back again.. 2nd visit. This time we all had a different dog. They were scrumptious! !"}
{"text":"While the burgers and dogs are awesome, I felt like trying their grilled chicken sandwich. Not good!! Meat was flavorless, rubbery and dry. Major disappointment and I used my 20% Yelp discount."}
{"text":"Pretty good except the menu led me to believe I would have received lettuce, tomato and other fixings of a traditional burger when I ordered the chili burger. Was dissapointed with crinkly fries, would have preferred hand cut. Crinkle fries always makes me think I could have bought from the store. 

Taste is good, friendly staff, just didn't meet expectations."}
{"text":"Walking into this place I noticed the cleaniliness, the staff greeted me, someone was ready to take my order. No wait :) I ordered a Chicago dog, which didn't take long to come out, less than 5 minutes. Then I sat down took a look at my food, it looked scrumptious but I realized one thing...the hot dog was boiled- if you're a hot dog and burger joint it makes sense to prepare it in other ways. Minutes later the bun became soggy and it got messy. Delicious crinkle cut fries though, they were crispy and hot.

As I was finishing up my food, I glanced around and I saw one of the employees biting into something - for sanitation reasons that shouldn't be done in the kitchen where the food is being prepared.

Maybe I'll come back, maybe not, overall a nice place if you want only fast friendly service."}
{"text":"Best burgers! I always look forward to them. The Italian beef is also some of the best I've had. My kids like the hot dogs, minus all the good Chicago style toppings. Add some hot peppers or grilled onion to the bugers."}
{"text":"Super delicious and they really are the best burgers in Tempe! They have a cute little seating area inside and easy to park with tons of shading. They have a variety of burgers and hot dogs to choose from. They have chili cheese fries and cheese fries which i had and were really good. They are very generous with their portion sizes that i was able to share with 2 other people. I will be back for sure on my next cheat day while I'm at work."}
{"text":"Thank GOD Johnny's picked up where Lobby's left off, it would have been a shame for the world to miss out such tasty eats.  Whenever I suggest a good burger joint to my mom, she one of her criteria is that the patty be seasoned which is commonly overlooked.  Well Johnny's cooks their burgers to perfection, seasoning included.  The fries are also crisp, hot and delicious.  Prices are reasonable and the shop is immaculate (restroom included)."}
{"text":"I'm not sure this place has figured itself out yet.  I was excited to see a nice little yelp check in discount, but after getting a couple of combo meals it still ended up being almost $25 which seems a little ridiculous.  I can understand the upcharge, but the end result did not match what the menu said (certain things that were 'free' ended up showing up with a 60 cent charge).

I got the Italian beef - and specifically asked for the au jus on the side.  Sadly, even though that happened, my sando got dipped and was completely soggy by the time I got it.  Above that, the meat was completely unseasoned and to my chagrin was overcooked.

The fries / fry sauce is certainly what they have going for themselves, and is something that can be built around.  My friend got the brat, and said it was really good but I was completely underwhelmed with my sandwich.  I just can't recommend it unless you're only craving fries with their awesome fry sauce."}
{"text":"Good food. Costed a little more than $10 for my cheesburger combo so it's more expensive than most burger places, but it was a really great burger. -1 star because they gave me the wrong order (with weird ass vegetables as toppings like carrots and celery and cauliflower, which I didn't ask for. that was a surprise!) and also because they charge extra for fry sauce. It's not like it costs a lot but still, it's not cool when places are stingy with their sauces"}
{"text":"Johnny's is the new Lobby's! Place has kept the same menu, same quality, and Fry Sauce. The guys in there seem really nice and I can't begin to say how happy I am about have my favorite burger joint back.

For those of you who miss Lobby's and are skeptical know that Johnny was a partner in Lobby's and helped develop the menu."}
{"text":"We seriously found this place by mistake and I am so glad we did! I had the cheeseburger plus bacon and grilled onions, my friend had the cheeseburger with chili, and my other friend had the same as me. The patties where cooked to perfection and so juicy I felt like I was eating at home! The fry sauce has a special tasty kick and doesn't taste like your typical sauce..

The location is difficult to see from the main road and we actually found it by trying to look for the Outback! Service was great and the food came out quickly, non of has a word to say.. Just juicy cheeseburger stuff on our faces!"}
{"text":"Great staff and always amazing food!
Make sure you add bacon on your chili cheese fries and double cheese burger. 
The place is always clean and presentable."}
{"text":"best burger in phx! fries are great! fry sauce is yummy! if you want a huge big juicy burger then just go and get the double!! it does not get much better then this, if you get it to go the bottom bum will be gone just about lol"}
{"text":"We would say to Johnny's: don't change anything! We ordered the cheeseburger, fries, chili cheese fries and a chili dog through Uber Eats delivery. We loved the crinkle cut fries and everything was so flavorful. The only thing we would do next time is to order the chili dog without the onions or ask for light onions, other than that the fries weren't too salty like other places, the burger wasn't greasy, and the chili cheese fries were great. Not the healthiest of choices but very good when you want something not so healthy. Also, Uber Eats delivered before the estimated delivery time so that was a plus."}
{"text":"I can safely say that Johnny's blows Portillos out of the stratosphere. The service was good and the food was spectacular. The burger I had was juicy and, paired with the fresh toppings and homemade \"house sauce\", flavorful and satisfying. Even the pickles were top quality, not your standard flat dill flavored disks that are typically used for burger toppings, it tasted like they were made from scratch. I also ordered the chili cheese fries. The container was filled to the brim with fries and it was loaded with a mountainous pile of chili and cheese. Even after accidentally tipping my container over and knocking some of it onto my tray, I still had enough chili cheese covering my fries.

If you are looking for an inexpensive burger joint but crave higher quality than your typical fast food joint like McDonalds, I highly recommend this place. Two burger juice covered thumbs up!"}
{"text":"First time trying this place and I loved it! I can't believe I've never seen this place and I always pass by it. I don't know how long it's been open, but I'm sure it's been a while. This place is clean and well maintained. The food...everything about it is FRESH! The beef, I'm pretty sure it was in the form of a meatball when it hit the grill so that tells me it's FRESH beef and not a frozen patty. Lettuce, tomatoes, onions were all crisp, cool and delicious...FRESH! If you enjoy a good burger I'd give this place a shot. The only thing though is it's lacks salt, but hey I'd rather salt my own food then have someone put to much."}
{"text":"it was alright. nothing special in comparison to other burger/hot dog places. it took FOREVER to get our food even though we were the only ones there when we first arrived."}
{"text":"Really good and great portions. They are not stingy like most places that charge you extra for a topping. It's a fair amount. Overall the taste was great and timing to get my food was faster then expected."}
{"text":"Great food, flimsy hotdogs but in a good environment, first time trying will come back!"}
{"text":"First time at Johnny's.. and wishing it had been sooner!  This place hit the spot for my burger craving.  The burgers here are big, fresh & jam packed full of flavor. Having eaten at In-N-Out Burger every time I'm on the West Coast, and Shake Shack a gazillion times when I'm in NYC, I can honestly say that Johnny's has stolen my heart in the burger stakes.

The crinkle cut fries are the perfect crispy accompaniment to their burger.  Oh, and might I suggest adding grilled onions to your burger? SO GOOD!"}
{"text":"Just finished an excellent lunch. I can only compare their burgers to Five Guys for taste and quality, and I would have to try them side by side to choose a favorite. The fries are long crinkle cut, and their fry sauce is fantastic. I always order it added to the burger. Love their Italian Beef sandwich. Service is always friendly and prompt."}
{"text":"Love any place with cheese fries! Pickles on the burger are a must. It's always an internal battle whether to get an Italian beef or double cheeseburger."}
{"text":"I've been here several times -- can't go wrong with the double burger. And now they have The Beyond Burger!!!!  You can't even tell that it's not meat!  So happy that this place has it. 

The service is fast. The staff are super helpful. The restaurant is clean. 

If you're craving a burger, this is THE SPOT!"}
{"text":"HIDDEN GEM!!!

This place has burgers to haunt your dreams, rarely do your end up craving a burger from a single place....but when I get a burger craving now, it's \"I gotta get a Johnnys burger.\"

In fact writing this review gave me a craving for their bacon single w/ the works....going back there tomorrow."}
{"text":"I would give this place a 3.5 star overall due to the many shortcomings. The fries and cheese fries are very good here and you get a lot of them with your meal. The burgers however, are hit or miss. They are never greasy and disgusting, which is a plus, but I feel that a lot of the time they are overdone and the meat and bun are very dry.

 A major annoyance is that everything is extra. Bacon? Extra Grilled onions? Extra? Fry sauce? Extra. The milkshakes only come in one tiny size and they refuse to put it in the bigger cup for you, even if you offer to pay extra. I guess the owners before and after the name change decided that saving the .03 cents of ice cream was worth putting their foot down."}
{"text":"Very good burger, it has just the right amount of fixings. I'd say this burger is better than any Five Guys or habit burger type joint out there."}
{"text":"Had their Italian sausage. It was WAY too greasy, to the point that the bun was soggy and gross. Fries were really bad too. How could a burgers and dogs place not get their fries right? 
My experience was terrible and way overpriced too."}
{"text":"WOW!! I am soooo glad I had to go to the Ross at McClintock and Southern last friday for a special pick-up or I would have NEVER found this place!! One word...AMAZING!! I am a hotdog lover and the sign said hotdogs so thought I would chance it.  I ordered the NYC dog with mustard and kraut...typically very basic...but it was incredible! The hotdog was HUGE and juicy, the poppy seed bun soft and delicious and the kraut completed the experience! DELICIOUS!!! 
     As I waited I noticed the person behind me ordered a burger and I watched the cook throw a round, raw FRESH MEAT burger patty on the grill and smash it! I saw the onions go on next to the burger and I knew next time I had to try it...it smelled incredible....
    Today was the \"next time\" and I knew I had to try that burger even though I am not a burger person typically. I ordered the Cheeseburger with mushrooms and mustard.  I watched him place my \"meatball\" onto the grill and toss a handfull of FRESH mushrooms onto the grill right next to my burger! My mouth was watering right there looking at those fresh ingredients! 
     I was not disappointed... It was definately one of the best burgers I have eaten! I wish I would have taken a photo to share, but I was so hungry after watching the chef all I could think about was that first bite! Sesame bun soft, plenty of cheese and the mushrooms....the freshly GRILLED mushrooms...perfect!! It was huge and I cut it in half (to eat only half) but it was so good I finished if off...much to my overstuffed tummy's opposition!!!  I immediately wanted to smoke a cigarette afterwards (even though I don't smoke) because it was THAT GOOD!! LOL!! :)
     Don't miss this \"hidden gem\" that I never knew existed! If you are visiting from out of town, entertaining guests from out of town or just a local who loves a good burger/dog, you can't go wrong at Johnnys'!!  YUM! :)"}
{"text":"Very delicious burger, I never had a burger like it before so I was kind of shocked. Had a very professional and well crafted taste to it. I've had every other burger in Tempe and I can say this is worth the money. The fries were good, nothing to rave about but they got the job done, ( a filler after some bites of the burger! )I'll definitely come back again!"}
{"text":"This is the second time I have been here, and I am just as happy, if not a little less. I didn't order the milk shake because I was so full! The service is very kind and the food is abundant. If you are looking for a great place with big plates, don't hesitate, go for the burger and chili fries."}
{"text":"Good burger but good god......standard krinkle cut fries???
A burger that good deserves a good frie....get to work guys!!
Easily 20.00 for 2 cheeseburger combos.
Look on the bright side.....its cheaper than 5 guys and right next door to the 
Great Venezias pizza !!"}
{"text":"Food: I got a cheeseburger without pickles and added grilled mushrooms, with a side of fries. I'm actually not quite sure why these reviews are so hype; the burger was nothing special. The meat was a little dry, although I will admit it was pretty cool to watch them draw a big ball of raw meat on the grill, and it smelled heavenly. The sesame bun was perfectly fluffy, it looked like the bun you would choose if you were shooting some kind of food commercial. The onion strands were a little long and overpowering, so I took them out halfway through the burger. The fries were nomnomnom though! Crinkle cut, fresh, and perfectly crispy.   

Service: The two guys behind the counter were super nice, and they also brought us our food to the table, although it was clearly an establishment where one usually picks up their food at the counter. It was super sweet of them."}
{"text":"Tried this place because we were in the neighborhood, and a check-in on Yelp gave a 20% discount on a combo meal.

First impression, place is clean. Menu is pretty straight-forward and isn't over saturated with \"specialty\" items. Employees were nice and as soon as I placed my order of a burger, the patty was on the grill, which was great.

The food came out in about as much time as it took for me to get a fountain drink. So no time at all. Place wasn't poppin', but still incredibly fast service. Looking at the burger and deconstructing it, it looked like a mix between Smashburger (slightly thicker and wider in diameter) and a McDonald's Quarter Pounder. Fries were crinkle cut and piping hot.

The food wasn't too bad. I got the bacon cheeseburger. Bacon was slightly over-cooked. Like Smashburger, the patty was a little too salty for my liking. Fries were hot and crisp which was nice. Solid 3 Stars. Pricing is on-par with Five Guys."}
{"text":"I went here last night for the first time ever which was Tuesday 10/3.. the girl working the register was awesome!! As well as the cook. They defiantly were the perfect hire for this job. She convinced me to order Italian beef and it was the best hot sandwich I've EVER had. Make sure you add the hot peppers! Excited to come back again!! It's the next day and I'm already craving another Italian beef sandwich.."}
{"text":"I used to love  this place. After the time previous to this review. I have it a 4 because of all the good times. Owner said come back and try. I'd did Ordered the Beef with giardinara and Again just isn't as food as it used to be.  Look at the pic that is not Giardinara"}
{"text":"Get the chili cheese fries with the spicy peppers!  I don't recommend doing it everyday but you should definitely do it. It's the tastiest way to eat 700 calories in one setting. Perfect size for two people."}
{"text":"Loved it! One of the best chili dogs I've ever had! Little messy but I dipped mu fries in whatever was left over. My husband said his burger was good too!"}
{"text":"I try to stay away from burgers and dogs, but when my friend asked me to go there with her, I said why not? I love that it is not a chain restaurant, and I am always on the lookout for a good burger spot. 

The decor shows a clean, smooth, refreshing  and very welcoming atmosphere. Menu was clean cut. To the point. Easy to read. I got a burger, and Chilli Cheese Fries, with bacon, and mushrooms. 
The burger, was very tasty, crunchy, and huge! (Glad I didn't get the double) the pickles were the best of the best. Even as I write this review my mouth waters. The meat is premium. You can taste it right away. It is very well seasoned, cooked to juicy perfection. 
The fries are crisscut, and crispy. To me they were nothing exceptional, then again I'm not big on fries to begin with. However the chilli, super thin grilled onions, perfectly thick, seasoned mushrooms, and bacon on top, had me eating every last bite. 
I definitely recommend this spot and look forward to going back and trying the hotdogs next time."}
{"text":"So good! We had the cheeseburger and bacon, the fries, and the fry sauce. Let me tell you, it was the best burger in town! The people were friendly and the service was very fast. Come check it out!"}
{"text":"Love this placed. Loved it before. So glad it reopened with new owners. Fry sauce is where it's at."}
{"text":"Great customer service! Immediate greet at the door and even when you leave! Chili cheese fries are amazing! The cheeseburger was good, but the Beef and Italian sausage was DELICIOUS! I will drive just for chili cheese fries.  =)"}
{"text":"Love coming here & enjoy everything on the menu! The food never fails & I surely won't be finding another burger joint anytime soon. It's a well maintained place & the employees are friendly."}
{"text":"Johnny's was okay. The burgers were on the greasy side and I made a huge mess eating mine. We were there in the evening and pretty much the only people there. It would be a good alternative if you're not feeling McDonalds or BK, but definitely not as good as In N Out."}
{"text":"Love love love love love Johnnys! You guys are amazing. Game changer for sure. I used to be an in-n-out girl, but the size of these burgers and the taste are both unbeatable! Love a genuine burger! I will forever be a customer as long as I'm in Tempe!"}
{"text":"Johnny's is Lobby's 2.0, guys. 

And thank goodness it's back - That was a long four months of fry sauce withdrawals, lemme tell you!

Same cook.
Same delicious menu.
Same delicious fry sauce.
Same squeaky clean burger joint. 
Ran by a former partner of Lobby's that brought life to the place we all know, love and crave!

After seeing a check-in from Jared R., Dude and I made a late night burger run high on our weekend to-do list.

Carlos was quick to greet us and make conversation of how this place rose from the ashes of the Lobby's closure drama. 

Interesting story; we'll leave it at that. You'll have to ask yourself.  

Johnny's staff is on their social media / online reputation game like no other, going beyond the Yelp reviews. Something that's SOP in today's Customer Experience Battleground, yet so many business owners aren't consistent about monitoring.

For example, Carlos immediately recognized me as the \"Gal who started a Talk thread about the Lobby's reboot\". (http://www.yelp.com/topic/chandler-lobbys-burgers-rebooted-as-johnnys-burgers-and-dogs-rejoice#qN2iVwsVu98yzSns-eypqA) They were reading the thread before we came in. Neat!

I noticed no difference in the food or sauce. Went with my standby, a hearty, 1/3 lb lettuce wrapped bacon burger, topped with fresh lettuce, tomato, onion, huge pickle slices and a shared order of fries. 

*drool*

Dude said the bun tasted a little different (I wouldn't know as I forgo them) but it wasn't a deal breaker.

. . . Sorry, Taric W. No Tacos Atoyac \"Taco Divorce\" drama here! ;) 

Go ahead. Splurge for the larger cup of fry sauce. It sucks you have to pay extra, but oh-so-worth it! 

That 20% off a combo check-in offer will help you out. 

Can't wait to try the Italian Beef!

All the best to you and your business, Johnny. And PLEEEEEAAAAASE - Don't go mysteriously closing up shop again - The last time almost sent me to rehab!"}
{"text":"Oh my gosh, this place is amazing. The service was friendly and the food was ready quickly, even though they cooked it to order. The restaurant was clean and cute inside. But most importantly,  the food was delicious. I seriously had NO complaints. The burgers were super juicy and cooked to perfection , the frys were crispy and the cheese frys were so big it was enough for 2 people with some left over. We loved the special sauce and had to buy extra. This is definitely going to be our \"go to\" place in the area."}
{"text":"Ok so it's not lobbys but it's almost as good, the fry sauce taste the same and the atmosphere is the same. Don't know what's up with the green paint on all the walls but ok... Now the food well what can I say when it comes to the double burger it's big and looks beautiful, the taste though could be a little better maybe a bit more salt or something but in all it was nice hot and juicy. Fries where crispy and hot. Next time I think I will try the chilli dog."}
{"text":"When it comes to chili cheese dogs my husband likes to go to Ted's, but we decided not to go this time because of the long lines. So I checked on Yelp to see what was close by. This was the closest with ratings even better than Ted's! My husband was skeptical about whether it would be better, but this gem did not disappoint!

The good:
At 7:15pm there was no wait when ordering
They served the food very quickly! (Under 5 minutes when there is no rush)
The chili cheese is amazing! My husband is especially particular with his chili, but he couldn't get enough of this one. The cheese is also not overwhelming, which can be the case often.
The portion of fries they give you is generous
They serve quality hotdogs/sausage

The bad:
I don't really have any so far!

During this visit I had the Italian dog with Italian beef on top as well as sweet peppers. My husband had the chili cheese dog. And we both shared some chili cheese fries. It was all really delicious!"}
{"text":"Heeeere's Johnny's! With a menu that is virtually the same as Lobby's, Johnny's serves up the same high quality, superb Chicago style eats. I think the only differences in the menu are the additions of salads and the slightly different buns for the burgers. 

We stepped in and ordered a mushroom burger, vanilla shake, fries, and Italian beef. The burger was a heavenly concoction of juicy, well seasoned beef, crisp lettuce, sliced tomato, red onion, with flavorful sauteed mushrooms. The sesame bun it was on was lightly toasted and provided some nice texture balance with the sesame seeds, slight crispness around the bun's edges, and the soft bun itself. The Italian beef is as good as ever, with the broth soaked bun, expertly flavored, thinly sliced beef, and added toppings (We added hot peppers and onions). Oh so good. 

The shake was creamy, thick, and delicious, and the fries were crinkle cut and crispy. Service was excellent and we were greeted with a smile by the cook and Johnny, who was manning the front when we were here. He even came by during our meal to ask if everything was OK, and thanked us for coming when we left.

Here's hoping Johnny's is here to stay for a very long time!"}
{"text":"My boyfriend RARELY finished his French fries but he ate his AND some of mine, he's lucky I love him. The burger itself was absolutely incredible, as well. Plan on coming again soon."}
{"text":"Was looking for Lobby's but Johnny's has moved in that spot.  The Italian Beef with hot peppers was fantastic."}
{"text":"Had a delivery order. I cannot comment on the taste. The bag holding my cheeseburger and Chicago hot dog was soaked through the bottom. I pulled the items out of the bag, juices from the burger clearly soaked through its wrapper, partially soaked the through the bun of the hot dog and the brown paper bag as well. 

I tried to unwrap the burger but the soggy paper disintegrated as I did. The bun was visibly wet. The entire order went in the trash. 

I ordered via Door Dash. The driver said it looked bad while pulling my order out and that I could probably get another. Not taking that risk, I've requested a full refund. 

I'll try the burgers in store as I'm sure they live up to positive reviews here but don't waste your time on delivery of a greasy, wet mess."}
{"text":"I've had two or three Italian beef sandwiches from Johhny's and they were all delicious. Johnny's is not skimpy with the beef, which is of a higher quality than their competitors. I go fully dipped for the best experience as the Italian seasoning however traditional is seriously satisfying. Also major props for having giardiniera that packs a punch! Although Potbelly is the king of this pepper blend Johnny's gets a strong B. My mouth is watering just thinking of this spicy and crunch condiment of the gods. This sandwich comes highly recommended.

Two negatives. Things are $1-$2 overpriced and if you go for a combo you are looking at over $10, which is somewhat of a turn off for fast food. The second minor grips is the pedestrian fries. If I'm going to splurge on the calories, fries need to be something special. You get basic crinkle cut frozen fries here, although the nockoff canes sauce is satisfying."}
{"text":"Hey Now...
Ordered the Regular Hamburger combo and got my 20% discount from Yelp... The burger was very delicious with all the trimmings... You can tell the beef was fresh as well the trimmings.... Also ordered the Chili Cheese Dog and I like the that even better... Next time will be definitely the Chili Cheese Dog... Thanks Johnny's"}
{"text":"I enjoyed this place quite a bit. I recently relocated back to Arizona after living outside of Chicago for the past 10 years. I'm quite familiar with Italian Beef having owned and operated a Chicago Style Eatery for 7 years.
I think Johnny's is an excellent representation of true Chicago Style food. The Italian Beef was excellent and the sweet peppers were done right. The burger? Outstanding, they use the smash and scrape technique ala Shake Shack and it leaves a beautiful crust and flavor on the burger that a char grill just can't replicate. I didn't care for the fries hence  leaving off the fifth star but I'd definately recommend this place to anyone for a damn good burger and excellent Italian Beef."}
{"text":"This is hands down my favorite chili cheese fries place, it tastes just like my Coney Islands back in Detroit. I also like that their facility is very clean and the staff was super friendly!! I will definitely recommend this place to everyone I know"}
{"text":"Fries are the best in the valley. The Italian dipped sub is my go to with hot peppers and onions grilled. You really can't beat this place. It's the best burger place in the east valley."}
{"text":"Wow. 
My first time here after hearing how good the burgers were. I ordered a double cheeseburger combo and asked if they had non sesame buns or if I could have 2 button buns. I was then informed that neither was an option. I was then told that they couldn't use the tops and there was no way to just charge me for a bun (as I was willing to pay extra).....

Then they watched me walk out the door.

door.

******UPDATE******VERY HAPPY NOW******

The owner reached out to me almost immediately to apologize for my experience and his employees response to my request. He stated that I could definitely have 2 bottom buns at no charge. I can say with conviction that I am glad that he pursued resolution and that I was able to go back. I just ate an absolutely awesome double cheeseburger! It was quite possibly the biggest cheeseburger I have been served in the East Valley. Very fresh, perfectly cooked and awesome. The fries were killer as well and I may have also snarled down a chili dog, which was just what it should have been....covered in chili, cheese and onions. I will be returning again soon."}
{"text":"Finally.  I was in the neighborhood after catching a movie.  It was kinda late for them on a Sunday, they close at eight and we arrived just after seven.  We still got the welcome smiles, though.

While at the theater, I was perusing Yelp to figure out what to eat for dinner.  I remembered all the hoopla over Lobby's/Johnny's and how just about everybody on the planet raved about them.  How come only 50 some-odd reviews then?  Anyway, some of my most trusted reviewers popped to the top of the list, and to a person, gave a five-star review.  Maybe I'm just a little pickier, but while really good, I was not wowed enough for five stars.

Love the hand-formed burger patty.  Fresh veggies on the burger and the cheeseburger comes with Cheddar.  I wasn't asked how my burger should be cooked, but hey, I can see it would be tough to cook one of these burgers med-rare.  The wife had a plain burger and I had a cheeseburger.  I would come back just for the burgers, and maybe try some of the add-ins, like bacon (swoon), jalapenos, and other stuff.  What really attracted me were the crinkle-cut fries.  Cooked properly, they should remain crispy on the outside, and creamy-soft on the inside.  Johnny's does them proud, I would come back just for the fries.  The burgers were delicious, however, in my case, they lacked seasoning, which was remedied by the salt/pepper offered at the condiment station.

I also had a strawberry shake.  I love strawberry shakes.  Johnny's does too, judging from this shake.  I would come back just for this shake.

So, I guess what I am saying is, cost is reasonable, food is delicious and a great value.  I would come back for this ish."}
{"text":"I think this is the best local burger place. There's not one person we have brought that hasn't craved it after they went home. They have a typical fast food feel and their workers are always friendly and willing to give you tips on what to order. Their burger quality, taste and portion is perfect. I really love that after eating here I don't feel like I ate a stick of butter like at most preservative heavy fast food places. They have a wide menu selection and I haven't been disappointed yet. They also have crinkle cut fries ! Now how do you go wrong with that. 

To try:
Cheese burger 
Italian beef 
Crinkle cut fries with their house fry sauce"}
{"text":"I've had Johnny's bookmarked for years. I just never really been in Tempe for lunch very often. For some reason I was in Tempe on a Saturday afternoon so I was really excited to go to Johnny's. Heard so many good reviews. Even their window says The Best Burgers in Town and that is a very bold statement. 

Anyways, we walk in and basically the menu is on the wall, order and pay at the counter, and they will bring your food to your table. Very nice and the people are extremely friendly. 

We ordered the double cheeseburger, Italian Beef dipped, and fries. So the double cheeseburger came with mayo, lettuce, tomato, pickles, and red onions. Huge burger. Huge patties on a really soft bun. Everything was very fresh but the only problem is that the patties were basically tasteless. Was disappointed with this but we still gobbled it up. 

Also, we had the Italian Beef sandwich with sweet peppers and dipped. It was huge. Just looking at it you wonder how you get your mouth around this monstrosity. Anyways, I always like it dipped to add more flavor and make it more juicy. Only problem is that it seemed like the beef was dry. Not a lot of taste. My wife got the Italian Beef and asked if we could switch. So I really thought that it was okay. Nothing to write home about. 

Then again the fries were very crispy and fresh. Just how I like them.

I was very surprised that while we were there at 2pm that a bunch of people kept on coming in. A majority of the tables were full which I thought was very impressive cause it was outside of the normal lunch time. The people behind the counter were very friendly greeting us and even thanking us for coming in. I really even liked how they brought our try of food to your table. No yelling out order number or anything like that but excellent customer service. 

Now don't get me wrong. I really wanted to love this place. I respect my fellow Yelpers and maybe it was because I came in at 2pm on Saturday. Not sure. 

So to show respect to Johnny's, I need to come back again. Maybe it was one of those things that day. I will be back"}
{"text":"Great tasting burger, the beef patty is probably the best I've had in Arizona. The pickles are thick and delicious. Would prefer different kind of buns, but the burger itself and the toppings were great. Haven't tried anything else like their hot dogs or Italian Beef sandwiches and probably won't because the burgers are too good. Definitely best burgers in Tempe, maybe all of the east valley that I have tried. Close to my work and go a few times a month. Get there before 11:45 a.m. to avoid the high school lunch rush, high school right next door."}
{"text":"The burger was great!  Piled high with fresh meat and veggies. Service is fast too. They also have Chicago style Italian beef and Italian sausage sandwiches. I'll try those next time."}
{"text":"Excellent burger and fries. Quality ground beef, fresh vegetables, good size toasted bun. This is not your typical wimpy burger. Fries had nice crunchy outside with soft center. Fry sauce was great."}
{"text":"I enjoyed the chili cheese burger, I added pickles which are awesome, thick. The fries are crinkle cut and tasty. Everything was good, reasonably priced. Grade B+"}
{"text":"I ordered a Chicago Style Hot Dog without sport peppers. It did not include fries. When you check out they have a section to fill out for a tip (no wait staff)
I paid over $5 for this. 
I think that is expensive.
Whether you want sport peppers or not, you pay the same price.
There are plenty of other places that charge way less and include fries."}
{"text":"Burgers and hotdogs, and fries, and FRY SAUCE omg. Drool. Calories. Drool. Amazeballs. 

We went here after a friend found out the gender of her baby for a celebration of sorts. She wanted meat. This place had meat. 

We were a big group, adults and kids. Everyone got something a bit different. Burgers, cheeseburgers, hotdogs, sausage of some sort, fries, and of course FRY SAUCE. I think the fry sauce is just a combo of ketchup and mayo and mustard, but its the bomb diggity. I personally ordered a burger with sauteed onions and mushrooms with no bun, wrapped in lettuce. And obvy the fries with fry sauce. This place is great because you watch the guy cook the food right in front of you. No man hidden in the back possibly wiping his nose while he cooks your food. It's a standard grill and fryer right there next to the cashier."}
{"text":"Johnnys is my favorite burger on earth, I've been a regular for over 5 years, big burgers, fresh veggies and the fry sauce completes it all"}
{"text":"So we live nearby and after seeing the sign out front decided to try it.    We bought one cheeseburger and took it home and cut it in 3.   
As we had already eaten but wanted to try it.   Well we were so pleased we came back a few days later and not only is this our favorite place we bring others here.    The meat is fresh , not frozen.  
The burger is juicy and the pickles are the best not your normal tiny dill pickles.    Heads up it is the best."}
{"text":"What an awesome new spot! I won a bet and chose this gem for my free lunch and it did not disappoint. The place was very clean and the staff was extremely nice.

I ordered the Italian beef with an Italian sausage and added hot peppers. There is an option to have the sandwich dipped in au jus (which I did of course). The sandwich tasted every bit as good as it looked! The fries were okay - not that important as most of my attention was on the sandwich.

Get out there and give this place a try!"}
{"text":"*Cries tears* ::sniff:: ::sniff::  They are open again. 

I don't know the story, but I'm happy they are back!  Now I get a chance to try the other items on the menu!

Great burgers - cooked to order. I want them to stay in business so let's get back in there!

I saw a woman look in the window as I was leaving. She started to head to Subway at the other end. I pulled my car over and yelled to her that they have great burgers. She thank me and went back to the business."}
{"text":"Yeppers, this is the place again. I was lost trying to find a burger place after Lobby's closed up. Well guess what? I found a new favorite burger joint after searching all over.  I found it the most usual place. The new Johnny's opened in the same location WHAAAT. Yep that's right . Same great menu same outstanding food. Mario is back as well as the other chef.  Mario and his crew makes the best burger in town. Thanks Johnny for bringing them all back!"}
{"text":"Not bad, but not a place I would visit again. I came here with my 2 year old son who likes hot dogs, so I ordered him a plain hot dog which had to be the Chicago dog for $4.19 but plane as they had no other options. That was a little frustrating. I ordered a cheeseburger for myself which was just your ordinary cheese burger and fairly bland. The fries were okay but much better with the housemade dipping sauce. I would recommend more hot dog options."}
{"text":"Wow.. these guys really do have the best burger in town!  Very reasonably priced and so good. I got the grilled onions and mushrooms cheeseburger with their special fry sauce.. it was absolutely amazing. I will be coming back regularly!"}
{"text":"Wait, hold on. *takes another bite* mmm, okay. *napkin* Alright...

Johnny's has THE best burgers out here. I always want to try a beef, but I keep going back to that flat-top grilled burger! I do mine without cheese, no onions. Pickles are key for me and theirs are always crisp, also cut larger than most round slices. The lettuce and tomato are fresh every time and piled on along with their amazing secret sauce. Fries are crinkle cut and crispy without me having to ask, a perfect burger experience. For non-meat eaters, they have a vegetarian patty to offer, along with a couple of salads and of course fries. They also have chicken sandwiches, Italian sausages, and Italian beefs. Always hits the spot. Thank you Johnny's!"}
{"text":"Amazing burgers! It was my first time there, the food was great, and the staff was even better. I haven't met a more friendly group of guys at any place."}
{"text":"The chili burgers were delicious and not disappointing in size. The french fries were also out of this world. Will definitely be back!"}
{"text":"The chili cheese fries were awesome, so glad I stopped in. Huge serving, enough for your whole meal or to share with a couple people."}
{"text":"They're back under a new name same menu, same quality, same grill cook. Just had them tonight so delicious. I'm so glad they are back. Best burgers, love the fry sauce."}
{"text":"My boyfriend and I stopped here for lunch last week, he got a burger with the works and said it was the best burger he has ever had. You could tell the ingredients were fresh from the bun to the patty. The lettuce and pickles were nice and crispy and you could tell their special sauce was homemade. I had the veggie sandwitch and cheese fries and oh my god... That cheese is amazing. I asked for an extra side to smother on my sandwich I probably could of eaten it by the spoonful  we got milkshakes to go and they were a great end to an amazing meal."}
{"text":"Great place to eat. I went in after lunch and it was relatively slow so I got my food in like 5 minutes. Just awesome food"}
{"text":"Been there quite a few times now.I Usually get the Grilled Italian sausage sooo good! Chili fries are great too.As far as the beverage the Strawberry shakes are to die for!!! Large portions I always have leftovers to warm up later. Very reasonable prices."}
{"text":"Food is good but $4.19 for a hot dog, really?  No hot dog should ever be over $3 IMO.  With fries and drinks you're looking at over $7.  Then paid over $7 for an Italian beef with hot peppers.  Everywhere I've been, sweet & hot peppers should be free.  As I said, the food is good but good luck getting return customer's with these kind of prices.  Hope they adjust these prices so they can stay in business."}
{"text":"Since shortly after it opened, my family has been coming to Lobby's... err... Johnny's regularly.  

The new owner, Johnny, told me he used to be Lobby's manager awhile back.
It makes sense.

The restaurant has great Italian Beef (Portillo who?) with hot giardiniera (and they don't skimp like the chains...).

On my most recent visit, I had a stroke of Genius and ordered some hot giardiniera on my cheese fries.  DELICIOUS.  I will not have them any other way.   

My family comes here about once a week.  If they are coming more frequently, they are not telling me about it.  Of course, there was one week we went twice.

I love Johnny's and it is SUPER CLEAN, which is saying a lot for a burger joint.

May you have a successful future Johnny!  If you decide to give me that recipe for your Italian Beef, we can be forever friends."}
{"text":"Shared the Italian Beef Combo with Italian Sausage which had mushrooms, fried onions, sweet peppers and provolone, the bacon cheeseburger along with the chili cheese fries with bacon and regular french fries.

The restaurant was empty when we walked in but began to have a steady flow of people as we waited to receive our order.

The Italian Beef was on the dry side even though it was dipped in juice. The sausage was tasty and the chili cheese fries with bacon was pretty good and would recommend that. The burgers are good and should be the main thing to order here.

Service was good, but the food was just okay. 

With so many places to choose from would rather go elsewhere."}
{"text":"I was hovering between three stars and four.  I ordered the Italian beef, hot peppers, dipped/wet (forgive me, I'm not from Chicago).  It was really good, but the beef was a little tougher/dryer than others I've had around the valley.  The peppers were good.  The fries were perfect and that fry sauce is great.  I'll be back to try the burgers and dogs."}
{"text":"I swung by this restaurant while on the prowl for some good eats! I was not disappointed. I went with my fiance, and he ordered the cheeseburger combo with provolone cheese. It came with fries and a drink for around $7.99, I ordered the chili all beef hotdog with mustard and sauerkraut. Neither of them disappointed! They were both really great portions & VERY delicious! You can even order your hotdog grilled, if you don't like them boiled. That was a tip the friendly cashier told me about. 
We came back a second time & we both got the cheeseburger combos which totaled about $16.00 and it was yet again very delicious! This place does not disappoint & I am so glad we came in. Everyone is very friendly here & they are so helpful. Ive noticed they also offer uber eats which is cool for anyone in the area. This place is a must try & we will be back!!!"}
