{"text":"I went here for my birthday dinner with my family. We haven't been in a while, but I was really in the mood for good pizza, so I decided to give it a try! 

We got the fried seafood, grilled calamari and two orders off the special's menu - both of them mussels. I personally only like mussels in a red sauce, so I asked our server what the italian description meant and if it would be served with a red sauce. He ensured that yes, it would be served with a red sauce, but 10 minutes later, another server brought out our dishes and the mussels were in a white sauce! 

I did speak to the waiter, who re-read the menu and said, ah it comes in a spicy sauce. Well, the sauce was spicy, which was the saving grace and essentially was what kept it's 5-star rating. However, I did urge that if he wasn't 100% sure, he should double check next time. He seemed nice about the error. 

For our mains we got the calabrese picante pizza, veal stuffed with mozzarella and prosciutto, veal marsala and another special - venison with a blueberry, wine sauce. Everything was excellent. 
-My pizza was cooked in a wood-burning oven, and it was crispy, gooey and spicy. 
-The stuffed veal was a huge portion, and was so tender, gooey with cheese, salty and yummy.
-The veal marsala was also a large piece with great mashed potatoes. 
-The venison, though apprehensive to try, was cooked a perfect medium-rare and not drowning in sauce. It was a tasty gamey meat, but SUPER tender. Really surprising good.

Next time I'll hopefully leave room for dessert!

I'd go back in a heartbeat!"}
{"text":"My husband and I had dinner here on a Saturday night with another couple. This was our second time here. First time was excellent, this time not so much. Our waiter in particular was a bit too eager. Asked us multiple times, in a matter of 15 minutes that we arrived, what drinks we would like to order. Then again was too quick to remove our glasses of drinks that we were still enjoying. Maybe new waiter? Eager to please? An appetizer we ordered was sold out (this was at 730 pm) my main entree was lukewarm. Pizzas others ordered were good. For dessert we had creme brûlée  which was more of a vanilla pudding than creme brûlée.  Sorry Joia we weren't  overly impressed."}
{"text":"This is a great Italian Restaurant. They have wood oven pizza and great selection of wine. However the service is a bit slow, which don't be in rush and enjoy your dinner."}
{"text":"So this is my second time going here. The first time was decent, I had pizza and no wine. This time however the mistake to order wine was made. It was a 70 dollar bottle (their price) so after we got home I decided to check what the LCBO sells it for. They charged 25. That's 3 times more I mean okay they want to make some money but jeez that's stupid. Most restaurants it's double, okay yeah you get the experience of dining out but nope not here. 

It took 50 mins for a salad. It's not like a pizza or something it's a salad it's simple 5 mins to make at most. We saw our waiter 3 times through the night. Once at the beginning once when he asks how your food was and then to collect his tip. 

So now that it's like an hour and a half in we get our meals. I had the special pasta which is spaghetti and meatballs. It was overly salty, like enough to salt the roads lol. So 2/3 meals were salty. Once had like chunks of sea salt and the other was just plain salty. So when our waiter shows up (2nd time) we tell him and he takes it away. So 2 meals were taken away so we got to watch the 3rd person we were with eat how nice. They bring our food out about 5 minutes later. It's still salty and doesn't really taste that great. But I sucked it up because I was starving. Overall I would not come back here. Would recommend Roma it's about 5 mins north of upper Canada mall. 

Summary of the review: do not eat here unless you want marked up wine and salty food"}
{"text":"Yeah Yelp. This is as good as it gets. Don't agree with my fellow reviewers. I love Italian food done well with old-time classic professional-level waiters. I can't go all the time because yes, it's not cheap but my favourite treat in Aurora. We're lucky to have them."}
{"text":"Lately had been going to Joia, service is very friendly. Food is amazing. Their mussel and beef cappacio are delicious."}
{"text":"Went will 2 other couples and found the ambience great, service outstanding with a smile, food excellent and extensive wine list. After looking over the list the waiter suggested I try a couple of house wine. Hit a white and a red that were excellent with the meal and good value. I definitely will be back soon."}
{"text":"Tues night dinner for two. 8pm arrival in out of the pouring rain. Warmly greeted and shown to a four top beside the fireplace. Excellent

Quick service to offer drinks. My request for a glass of Shiraz gets me a well-recited description of two choices. Well served glass full of fruitiness  yummm and delish. Dinner companion had Stella in a bottle. Not happy with \"on-tap\" selections but was middling on the beer by bottle

Bread and oil/balsamic delivery speedy and courteous. Server's suggestion of veal and shrimp was awesome and paired with penne at my request rather than veg as I have a thing for arrabiatta. Might be an urban myth but I was told the owners' parents grow the peppers in their home garden. Yowza!!  Excellent kick!

Love to give report on a second dish but the description of the veal was enough to tempt the both of us 

I would recommend this to anyone looking for an upper edge dining locale that delivers quality food and attentive service. 

$100 for dinner for two with no apps, 3 drinks, and a well deserved tip"}
{"text":"Four of us celebrated an anniversary with dinner here recently. Our table was not available when we arrived and we were sent to the for a pre dinner drink. No problem. We were seated shortly after and our waiter brought menus & water. We were brought bread but no oil & balsamic. We ordered one large Caesar salad for all of us. Very good!
I ordered penne alla vodka. My favourite. Maybe the least tasty version I have ever eaten. It was simply penne in bland tomato sauce, no pancetta, no onion, no flavour! The other 3 diners said their pasta dishes were simply okay. Nothing special. We had two bottles of their less pricy California Merlot and coffee. $320 for 4 with tip. Will not be in a hurry to return."}
{"text":"If your in the mood for pizza, their siciliana  pizza is absolutely mouth watering. I always start off with the muscles, fantastic and amazing priced dinner. Me and my girlfriend love this place!"}
{"text":"Great atmosphere.  First time at this restaurant, celebrating 3 birthdays and the owner was extremely nice and gave our group of 10 free dessert.  I had the kale salad with goat cheese, which was perfect.  I shared the fried calamari, not my favorite but I also didn't like the dipping sauce, most restaurants are serving aioli but I prefer a simple tomato seafood sauce.  I had the special, bucatini with sausage and truffles.  Not bad but I'm a little biased because I make orechiette with sausage and truffles and its to die for.  Overall, great service, owners were wonderful and the food delicious.  Would definitely recommend and return."}
{"text":"One of my favourite Italian restaurants to eat at. I've had so many great experiences there. I hosted my husbands birthday there with about 20 guests and everyone could not stop talking about how delicious the food was. The calamari was scrumptious, the bruschetta was finger licking as I bit into the fresh red tomato slices marinated in fresh garlic, the pasta/lasagna prepared to perfection and for dessert, the tiramisu, I have no words. I think I almost cried when I was at my last bite. The service is excellent in small to big parties. I will make a habit of going there whenever I crave Italian!"}
{"text":"Went to Joia on Saturday night. The food was perfect and the staff were amazing. We were served by Dan such an amazing guy. He was a great server, not to complain about here. Will go back again."}
{"text":"We usually come here when we want a delicious and satisfying Italian meal couple with the great service and ambiance."}
{"text":"This is a nice little restaurant in Aurora, amazing food, great wine selection and really good service, would probably go again, it's worth the visit."}
{"text":"We celebrated New Years eve at this restaurant last night. The staff was amazing. It was crazy busy and they were clearly working very hard to make sure everyone was having a wonderful dining experience. We appreciate all your hard work!

The menu had a lot of selections and we found it difficult to choose. Everything sounded so good. 
 
I finally decided on the escargots just because I haven't had those in years. Brought back some good memories. The main course I chose was the linguine with lobster and shrimp in a Sambuca sauce. It was divine. The portion was generous. For dessert we all had the cannoli. Very good, we all agreed. And a lovely presentation with fresh fruit, sauces and shaved dark chocolate on a long white plate.

Thanks again to all the staff for making this a very special New Years Eve dinner with friends. Perfect in every way. See you in 2015!"}
{"text":"Joia is a fantastic restaurant.  Service was outstanding, food was delicious, and the restaurant is just elegant.  I came here with my girlfriend for her birthday and it went undeniably well.  

After ordering, we promptly received some fresh bread served with balsamic vinegar and olive oil.  The bread wasn't anything special, but it was fresh and warm and that's one of the most important things.

We got the escargots with Portobello mushrooms to start and it was FLAVOURFUL. The escargots were cooked just right and I enjoyed them very much.

As our mains dishes, we got a risotto and the veal marsala.  The veal was tender, and the marsala sauce complimented the meat very well.  The veal came with a side of truffle mash and grilled vegetables which give it a very pleasant smell and taste.  The risotto comes with green peas, red onion, and mascarpone cream.  Again the risotto had a pleasant and creamy scent.

Lastly, I wanted to go over the service here.  It is hands down one of the best that I've experienced in my life.  The staff are courteous, attentive, friendly, and humourous."}
{"text":"Joia is a cozy restaurant tucked away in Aurora.

Joia has a daily menu in addition to the regular menu which can be viewed online. We were served bread with oil/vinegar after we ordered.

For our appetizer, we ordered escargots with portobello, onion and garlic in a merlot sauce on crostini. It was SO delicious, definitely my favourite part of the dinner.

Our mains were veal marsala and risotto, both were amazing. The veal marsala was quite a thin sliced portion but very filling as it was served with truffle mash and grilled veggies. The risotto was also great, mixed with green peas, red onion and mascarpone cream..I just wish for $23, the risotto would be served with some kind of protein.

The service at Joia is one of the best I've ever had at any restaurant, the staff are all very friendly and professional."}
{"text":"At best this place is \"meh.\"

As you walk in, it feels like this place is stuck in time - reminding me of the 1980's, Sade, and Mariah Carey.

It's everything I \"love\" about living in the burbs - the perfect destination for the velour track suit crowd.

Men beware - cougars are on the prowl.

The menu is too big, the dishes are unoriginal, and the food is laden with olive oil.

Nothing is horribly bad... Except that it reminds you that you live in the burbs, and that there are few dining choices.

#depressingsituation"}
{"text":"Best Italian food in Aurora and Richmond Hill. Huge menu and family atmosphere. Food is excellent and service is always good. Enjoy this place!"}
{"text":"The food was pretty good at Joia.  Although I would say I'm a bigger fan of Zefferini's veal dish.   I had a veal scalolpini dish.. My husband had a penne with sausage.

I think that next time I would go for pizza and salad there next time.

We had bruschetta as a starter and we both really enjoyed that"}
{"text":"Delicious food, great wine list, good service. Try the stuffed chicken, you won't be disappointed!"}
{"text":"Amazing food and great service. I loved the environment. They make their own pasta too. It was yummy. Also I recommend getting dessert and a cappuccino. Delish 
This is a great place for a date night or parties. I saw families but it's a romantic place for a date night. My husband and I went there alone and really enjoyed ourselves. Their wine list is crazy amazing. Even people form the city recommended them because they were the only ones to carry certain bottles of brands we wanted. Also they make their own pizzas in a fire brick oven   Try the pesto pizza."}
{"text":"First time going to this restaurant and some of my friends have raved about it.  Cute restarting, nice bar area and dining room as well.  It's small so be sure to make reservations.  We made reservations but had to wait 15 minutes for our table.  We started off with some appetizers such as bruschetta, fried calamari, charcuterie and stuffed portobello mushrooms.  The bruschetta was a big disappointment as it was only sliced tomato (not even red) basil and shredded garlic. They had no olive oil, salt or balsamic on it. Was really bad.  The fried calamari were excellent along with the dipping sauce.... Very delicious.  The mushroom filing was good however mushroom was ok.  The charcuterie plate only had two olives on it, no cheese and very small.  We had to ask the waiters several times for bread basket and olive and balsamic.  For dinner I had one of the specials, a fresh made stuffed ravioli with prociutto cotto in a cream size.  The plate only had 4 ravioli, the sauce was ok and the filing was very salty.  Also someone else had penne alla vodka and there was only 2 little pieces of pancetta in it and big onions that weren't even cut.  Disappointing food and of this place is known to be the best Italian I aurora then someone else needs to set up shop there to show how's it done.  I will not be back."}
