{"text":"I came in to get some boba tea and there was a employee eating behind counter that wasn't professional. The cashier seem rude and unhelpful."}
{"text":"Don't buy the groupon!!!!! Travelled an hr to get here! Was told only one groupon per visit the groupon makes you buy three. Here i was thinking its a good deal me and family can try something new. Terrible service. And hard as rocks boba."}
{"text":"The first time I visit a boba place I always get the plain, traditional milk tea boba. I'm not sure why, since I get boba so infrequently it's not like I remember the characteristics of the last one I had. But it's best to start with the basics I guess. And it's a good thing, or it would have taken me another three hours to decide what to get. Their menu is just daunting. There are literally more than a hundred flavors on their chalkboard menu. And there are options besides boba too.  Oh, and the place is clean and decorated with cool lighting, and this milk tea boba is really damn tasty. 9/10, would suck chewy lumps through oversized straw again."}
{"text":"This place makes good tea and boba drinks with lots of flavors and varieties, but its too bad the customer service doesn't compare. The menu is huge and there are many different ways to order a drink, although there is \"directions\" it can be confusing if it's your first time. I went in with a couple coworkers and when one of my coworkers ordered their drink the wrong way, they wouldn't  refund it because she did not order it correctly. I had a bad experience myself when I ordered one of their teas. I asked the girl taking my order what all came in the tea and it said it came with aloe and chia. I didn't want anything but the tea. Well when I got it and took a sip it was sweetened. I mentioned I did not want it sweetened and the other worker made it a big deal and told me that if I did not want it sweetened I needed to let whoever was taking my order know that, even though when I asked what all came in the tea she didn't mention honey. It is just the one particular girl that is rude and I think she may be the lead or something, but I've never had an issue with any other workers there."}
{"text":"This place is not authentic boba if you want the delicious stuff I recommending somewhere in California. Unless you like water down drinks then I recommend. The service is bad and they like to fire their employees for some nonsense"}
{"text":"First of all, I was excited about having a boba house so close to us. The place is modern, nothing to wow about. I came to give it a try. There was only one guy working at the counter & I only order a 24 oz taro boba... The serving time was about 10 minutes & this was not a busy day. Just imagine on Friday  or Saturday when people are getting off from the movie. I was disappointed to say the least. If they want to grow , they need to work a little quicker.  11-8-14. Return to this place after the movie. Place is full & people actually leaving before placing their order. There are 4 people behind the counter & wait time this time is 20 minutes. I suggest to the owner to find a solution. People are walking out--that translate to loss revenue. Go to California, learn from Tapioca Express.. They are quick & efficient.  I was actually though about bringing a Tapioca Express franchisee here in Arizona ( Maybe next to JT Boba House)."}
{"text":"I'm happy that I found this place. I've read all the reviews and it seems like people were having a hard time reading the menu. When I first came here, I'm confused as well. I did not understand what the __insert_flavor__ \"Snow\" meant. All I know is the tea I ordered tasted better when they're on their \"snow version\". It would be nice to remake the menu, because it will help a ton (especially with new costumers). Anyway, the people who work here are nice whenever I visit. I have not seen anyone on their phone like what other people complained about. Everyone is all busy making boba. Overall, I love the variety of boba flavors and toppings they have. My favorite flavors are Matcha, Mango, Lychee, and Cotton Candy. All in snow version with lots of tapioca."}
{"text":"Drinks are decent at best. It's a fun place to hang out and play some games. Very overpriced in my opinion and the boba tends to be warm sometimes in my past experiences."}
{"text":"I'm a regular here ,but my experience is always different with the variety of flavors ! I bring my family and we play the games they provide. It's a great place to bond. I recommend blueberry watermelon ,or blue bubble gum  snow , yum! :) Thank you Jt Boba house!"}
{"text":"The people here are so friendly, and the product is amazing! I love JT Boba House. So does my wife and son, we go there all the time - I highly recommend them, especially with their wide range of flavors and their friendly service!"}
{"text":"I really love the Flavored tea here that is all I ever order. However today I had a crappy experience. I asked one of the cashiers about two of the flavors the tiki and the tropical blend. She said she couldn't describe the tiki but that it wasn't that good. So I said okay how about the tropical blend she said it was good. I asked if it was fruity she said yeah so I said okay let me have two regular FLAVORED TEAS. When I got order the girl gave me milk teas. So I was nice about it and said I ordered flavored teas not milk teas. She then comes up and tells Me that she explained it to me twice. At this point I had no idea what she was saying. I said explained what to me twice? Not once did I say milk tea. So she goes to her manager and she comes back and says she's going to have us remake it this one time but next time you need to make sure you know what you want. I couldn't believe this stupid girl had the nerve to be rude to me after she has made the mistake. I'm not one to be rude to anyone but this girl really does not know customer service. I later called the manager to explain to her that her employee was extremely rude and I didn't want to cause a scene so I would have rather call instead. But she also seemed to try to blame it on me. When I was clear about what I wanted. I've been to this place many times before and I've never ordered anything else. So just putting it out there beware if they make a mistake because they take Zero responsibility. And they still have the nerve to ask For a tip on the receipt. I'll still return but hopefully I don't see that rude girls faces ever again."}
{"text":"For those of you who are looking for something remotely similar to the \"Night Market\" food served in China/Taiwan, this is it! Boba drinks are just like the drinks you find in China; and the snacks (like their fried Chicken) is made the same way! They put the basil leaf and hot powder on their fried food just like they do in China. This is my new snack shack and I am so glad I found it!!!"}
{"text":"I think they changed ownership because if something didn't taste right, they would remake it. Not anymore!  They would rather lose you as a customer than spend a few cents to remake it.  I'll just take my business across the street."}
{"text":"I have been going to this establishment since they opened a couple of years ago. I love boba and milk tea so I would frequent here quite often when I'm in the area. Their menu is rather large, and their drinks are pretty pricey. But when I like something, I like it. They don't make the best milk tea, but they are one of very few in the west valley so they satisfied the craving until I am able to get back home to California to visit. I have been drinking milk tea for 13 years and I have traveled and had it all over the country so I'd like to think I know what a good milk tea and good boba tastes like as it is one of my favorite drinks. I prefer the almond milk tea, but I've tried many other flavors as well. So I went in the weekend before Halloween and the first thing I noticed was that they had new staff. I am very familiar with the owner. We speak to one another whenever I'm there and she always greets my daughter when I have her with me. I ordered a Taro milk tea with boba and it came out to a little over $6 which is normal. I paid in cash. My drink came out, and as a tasted it, it was really grainy as if they put too much powder in it. Normally if I don't like something, I just chalk it up and go on about my business but this drink was $6 so I was going to make sure I enjoyed every bit of it. I asked one of the staff if I could have another drink made and she said that they can only remake the drink I ordered, they couldn't give me a different drink. So I agreed and let them make it again. The \"remade\" drink came out and it tasted exactly the same! So at this point, they're trying to explain to me how it's \"supposed\" to taste (when I know how it's supposed to taste, but I sat there and listened anyway). I asked them if I could just get a different drink, and was told that they could risk losing their jobs if they made me a different drink. So I said ok, just give me my money back. At that point I was told that the manager was on vacation and they were not allowed to call her and she was the only one who was able to do refunds. So I sat there perplexed at the fact that they could not make me another drink, they couldn't give me my money back and they couldn't get a hold of the manager to rectify the situation. So I was in a lose lose situation here! I gave them the drink back because it wasn't drink-able and I wasn't  going to make myself sick trying to drink it. Needless to say, I left there with no drink and $6 less in my wallet. The staff wrote refund on my receipt and asked me to come back when the manager came back from vacation so that I could get my money back. When I asked when the manager would be back, the response I got was \"I'm not sure\".....great! (Not really). I didn't even waste my time going back and will not step foot in that place again! If you want boba, go across the street to Bomboba or if you're in Phoenix, go to Snoh."}
{"text":"The atmosphere is amazing. Very clean and inviting. So many flavors and food to choose from as well."}
{"text":"The drink I ordered was good. A cherry vanilla peach snow with strawberry bursting boba. My boyfriend on the other hand did not get so lucky in liking his drink. He ordered a cookie dough snow with chocolate bursting boba.   We kindly asked the teenaged girls working to remake us a new drink since it was AWFUL, didn't taste like cookie dough but straight sugar-milk and the bursting boba tasted like vile oil/gasoline mixed. They told us they don't remake drinks if people don't like them. The best they could do was change the drink we ordered but not remake it. They ended up literally scraping the boba out of my boyfriends drink and reusing the same nasty cookie dough snow in a new cup with mango boba. It was still disgusting, he ended up throwing away a $7 drink because they refused to make us something different.   The girls were very rude, snobby, and on their phones. Probably won't come back to this location because of their terrible customer service."}
{"text":"Terrible service. The lady didn't even acknowledge me as I walked in. I ordered a large Thai tea with boba my drink came out it was left on the counter and it was only half way filled. Terrible service, the Thai tea has no taste and I paid for a large cup that was half empty. Bomb boba is across the street I will definitely not be coming back here ever again."}
{"text":"Excellent service and a wide selection of teas. The caramel coffee snow boba was great as a mid afternoon snack"}
{"text":"Very yummy drinks chill friendly vibes , nice place to just sit talk and relax. Been here a couple times I recomend it and the bursting passion fruit Boba is the best . I recommend it more then the chewy Boba !"}
{"text":"I was excited to hear there was a boba place opening near my house and I didn't have to travel all the way to Bombboba or Yo & I anymore just for good boba. My kids told me they've tried it when the place first opened and that the boba was terrible. I figured I'd give their milk tea boba a try, you can't mess up milk tea, right?! I was wrong. My milk tea was pretty weak though I've been told the boba has improved since they first opened.   I asked the girl behind the counter about a menu item and she had no idea what I was talking about. Granted she wasn't Asian and didn't know what banh mi Or a Vietnamese sandwich was, but better training would help. Why have it on the menu and not have your employees be knowledgeable about it?!"}
{"text":"Customer Service??? I think this company needs to spend more time training their employees including the manager. I will never return to this boba house. I highly recommend Bomboba just across the street. 9897 W. McDowell Rd. Tolleson AZ 85353. If you continue to visit this boba house make sure you record yourself and the cashier when ordering your boba drink.  If you tell them that the order is not correct they basically humiliate you in front of all of their other customers. The manager supports her staff 100% because they do not want to make another drink for you.  Quite honestly......worst customer service I have ever received."}
{"text":"This place the only boba place next to my place, they are good but only have two sizes 16oz and 24oz pricing at 4.25 and 5.50...They don't have that much flavors but it could be because they are new.  I got thai tea and it's good... my friends got red guava and mango snow and they  really like it..... the place is cute and bright... they also have snack running from 5.95 to 6.95..."}
{"text":"I am extremely frustrated with this location because I come here 1 hour before closing and for the past 4 times they always run out of the regular boba... this is the only boba place that I have been too to not have boba. It is annoying having to settle or simply change your order because the employees do not let you know till you are ordering. They don't seem to plan according to how much they will need for the day . I would understand if I happens once but it has gotten out of hand. I would not recommend to come here to anytime near closing because they will not make any since it is \"almost closing\" even when there is still an hour left and on a weekday."}
{"text":"I live in California and visit Phoenix at least once a month. I love boba and milk tea and usually frequent chai time in California. I have been coming to Jt boba since they opened and after EVERY.SINGLE.VISIT. I question why I come back. The answer is the teas taste very fresh and healthy not powdery. So why do I question my return? Because the customer service of the owner is TERRIBLE. She is literally one of the rudest people I've ever encountered in a restaurant and keep in mind, this is west Phoenix where terrible customer service and being rude to clients is the norm. She just comes across as so cheap and stingy with everything, like the smallest amount of boba and she's very impatient when you are making a decision. You would think she'd like to build and secure her client base up considering there is a bomb boba 30 seconds away. On a side note, the other ladies there are always super sweet and recommend drinks they'd like etc. as long as boss is not there looking over their shoulder second guessing them. If this place could just get the owner to stop being so damn rude and appreciate her customers, they'd have a line out the door."}
{"text":"Horrible customer service!!!! Doesn't even deserve the one star!!!!  Not that great go to boba tea company if u want real boba!!"}
{"text":"Love this place.. The employees are incredibly nice and everything I have tried so far is amazing. =]"}
{"text":"There Bobba Is So Far The Best I've Tasted & Then There Is The Teas. They Left No Taste Bud Unsatisfied With Me."}
{"text":"Super cute boba cafe. Nice ambiance. Boba is not that bad either! Nice to see more boba places pop up on this side of town. If only we can get more international mom and pop places for food instead of all these chain restaurants and not having to drive to the other side of the state to eat at these places. West valley has so much potential!! Anyways...back to the boba. I would come back and refer to family and friends. It's a great spot to hit up after catching a movie at the Harkins or a dessert drink after eating at one of the many dining options nearby. One thing I did notice was they use powder flavoring with some of their drinks in which I am not a big fan. Still, the drinks the Hubs and I got was delish. Check it out if your in the area :)"}
{"text":"I come home every weekend from college to spend time with my family. I also find time to get my boba fix every once and a while here at JT boba house since it is so close to my house. I usually get the same flavor drink every time since it is my favorite. I have to say that the flavor of my drinks are never consistent. Some days they are sweet and on point, other days they're  bland and all you can taste is the ice. I decided to buy a large sized drink tonight and asked for double the amount of boba which I payed 50 cents for. The flavor was once again a bit bland. I also asked for snow, which means the consistency of the drink should be very fluid and extremely refined. But  I found large ice chucks in every sip... On top of that the extra boba I ordered seemed to have been disregarded. There was only one single serving of boba.   I suggest that when making a larger sized drink, consider the proportions of ice/milk/powdered flavoring. Since a larger amount of ice is used, obviously more milk and flavor should be added to maintain the same taste and potency. And since there is more ice, it should probably be kept in the blender longer to refine the ice.   Overall, the drinks here are not bad. I just wish they were consistent with the flavoring and blending is all. And at the prices they charge (which are slightly above other boba shops that I have been to) quality is expected every time."}
{"text":"I would give this place 3.5. New spot in the west valley for boba/tea lovers. Its a little bit pricey. And drinks are pretty good.I tried the house tea and matcha green tea. Boba was tender and fresh. I also ordered the bulgogi and chicken and sweet potatoes. The sweet potatoes are the best. I would go to boba house in chandler but its too far from my house. So this place will do for my boba craving fix."}
{"text":"The drinks are not bad but way over priced. Now they started to charge extra to put the boba in the drinks! The owner is rude!! Staff is pretty nice and try their best but the owner lingers around and is a Debbie downer on the whole experience. I have read the reviews a, which just confirmed to myself it wasn't just in my head. She has a RBF and rude. My friend went with me and even bought the groupon! To my surprise, you can only use the coupon for less than half of the menu and yep you pay extra for boba. It's just not worth the headache of going.. I am going to the boba place down the street."}
{"text":"Good place for a Boba drink.  Recommend it to anyone willing to try the unexpected.  Wait time is reasonable but worth it."}
{"text":"Service is very bad and the drinks are way overpriced.  Will not be back. It was a older Asian lady the helped me she was rude and seemed annoyed when I was asking a few questions. I will give my money to bomboba across the street in the honey baked ham shopping center"}
{"text":"I recommend all of laveen to visit the boba house in avondale!  It is so delicious and simply a great place to hang out"}
{"text":"Love the place. The only thing the owner or management should conisder, in my opinion, is lowering the music down. Cashier can't even hear you place the order.  People enjoying the area begin to speak louder and louder.   Music adds a comfortable atmosphere to any place but once you are talking toooooo loud in a group it begins to sound worse that starbucks!  Poor cashier has to be repeating herself over and over and sure enough the order comes back wrong because they simply didnt hear correctly."}
{"text":"I absolutely love this place. Always fast and friendly! They know how to mix the milk tea just perfect so it isn't really sweet. Download their app for discounts and their reward program!"}
{"text":"I've been coming here for a year and I think I have finally had enough. These have be the rudest people I have paid for food since the lunch ladies in high school.  Know your order before you approach the register. They will not help you. The menu is absolutely confusing. Symbols with no explanation are confounding.   I ordered a lemon lavender tea from the classic teas menu. I assumed that meant a brewed tea. Turns out it is a syrup. I cancelled and asked for a simple brewed tea. I was referred to a list of teas mixed with a bunch of items. Simple brewed tea, right? I couldn't get her to listen to me. My husband asked for a blueberry tea. After much discussion, they were out. Absolutely no pleasantries or attempt at customer service. We drove 40 minutes from Surprise and left empty handed because the employees here have not been trained in customer care.   They blow you off or avert their eyes. Unacceptable and unprofessional. And honestly, just not nice. It's not nice to treat your customers liked they are expendable. A good customer will support you for decades and bring others. Pity they don't get it."}
{"text":"Ok, where to start. We've been to this boba house 3 times now, and honestly, the first two we're less than impressive. However, this last time was the LAST time. I've never seen such bad service! To start, the woman working there had a huge hickie on her collar bone! I mean I'm no priss, but if you're going to work in customer service, at least TRY to look professional and respectable. Second, the woman actually taking out order didn't even know half the things on the menu! How can you work at a boba house and not know what mochi is!? And then ask us like we're crazy!? My wife had to literally point to it on the menu to make her believe it was a real item! Lastly, we waited, and waited and waited some more! There were 4 order that were called before us and their numbers were AFTER ours! Come to find out they let her \"snow\" boba sit on the counter for almost 10 min! It was water by the time my wife got her boba. I would suggest people go 5 min down the street to another boba house, or better yet, 20 min north to yo and I where there service is actually existent."}
{"text":"It's good but i waited over 20 minutes for my drink....they weren't exactly busy either. I went twice and both times the wait was too much for me. Maybe I'll try one more time because it's good."}
{"text":"I'm very disappointed with the service at JT boba. I have been a faithful customer since they opened spending up to $10 everytime I'm there, which is often. I usually get the same drink but decided to try something different. I didn't like the flavor and asked politely to exchange it for something else if possible and offered to pay. The owner rolled her eyes and said that's the flavor you chose. I said I still want a different drink.  I then had to redeem my \"free drink\" on my stamp card to get the other drink. Which I really should have gotten for free the next time, as I'm always there. She also charged me an extra 54 cents for the new tea \"to pay the difference\". I won't be coming back again!"}
{"text":"TL;DR - The drinks here are good most of the time, but 1. it might take you a while to find what you are looking for on the menu, it is massive.(I could only find milk tea on their website) 2. If you don't like your drink expect to be met with mistrust and blame, so good luck with your dice roll. My small sample size says it is a 1/8 or about 13% chance of a bad one.  I have been here four times since moving to Goodyear. I am used to minimalist milk tea drinks so the slush and other super flavorful drinks were a bit of a shock. They are still quality drinks, for what they are, but not what I was looking for. I spent time looking on the Tea House's website to find the milk tea section, which I was never able to find on the in store menu (could be there, but it is a rather large menu), and went back to see if they were a bit more tame.  I have a Ceylon, milk tea and shared it with my wife. We both liked it and came back the next day and tried one more of those for her and a high mountain oolong. Again, both good drinks. They certainly are not just tea, milk and a simple syrup. Either the syrup has some spices in it or the tea leaves are blended with cinnamon and maybe cardamom.  The third time I ordered a Thai tea and my third Ceylon for my wife and drove off. She didn't have time to test it because she was corralling a two year old into the car. We didn't go far, but by the time we parked, my wife had told me she didn't like it. I tried it and I couldn't taste tea but it was very astringent, like when I have try to get a few too many steeps out of some loose leaf tea at home. No idea what actually happened.  We do our business at our stop, drive back with the cup 2/3 full after everyone has tasted it, included the toddler and doesn't have a discerning palette. We are told that they would not remake our drink. They say that we have taken too long to come back(they said it was an hour, I pulled out my receipt and showed them it wasn't) and it's probably our fault. The ice melted and made the drink taste bad. Now this is silly: 1. There isn't much ice to begin with, especially in portion to the amount of tea. 2. My wife and I are used to drinking boba tea like this. We have a two year old and we aren't going to buy him his own massive drink. So he will usually take a sip and hold onto the cup until he is done with his few sips. At that point, in phoenix metro weather, there's not going to be any ice.  Either way, I have never been to a tea house or coffee shop that mistrusts their own customers so much. I don't agree with the reviews that say that the owners and workers are rude. They were helpful and treated us civilly even during the disagreement, but I don't feel like I was treat as a guest and they can't trust me to be honest when telling them that there is something wrong with their drinks, on the flip side, I can't trust them to back up the quality of their product and my family and I won't be coming back. This place is located near a movie theater though, so I doubt this will have an effect on their bottom line.  Drinks 4 1/2 Stars Experience 1 Star"}
{"text":"Owner won't remake your drink if you think the taste is off , they spent more time Arguing with you  rather then making the customer happy by remaking the drink . I don't usually write Yelp reviews but today was just an awful experience . I'm a regular customer here or I was. Rude staff , bad customers service in general ."}
{"text":"First time trying boba great plus right next to my work. I can now say I am literally addicted to boba now and they have so many flavors to choose for your drink and your boba. Love love love this place"}
{"text":"A little angry/irritated because I've been a regular customer for some time now and literally the cashier said I can't add regular boba in my snow smoothie because \"it messes with the taste\" I've been ordering it the same way since I've been coming here. I nicely asked why and said, \"doesn't the customer get to choose?\" My friend ended up settling for what they wanted for her but I'm angered because the customer is always right. And if it made us happy before why not give it to us the way we want it?! It doesn't make sense. I wasn't asking for something they don't have just regular boba instead of their flavored boba. Plus I've been paying over $8 for a boba when at other places it's $5-6 bucks! I should get quality service for that price. That's like a meal."}
{"text":"Boba is delicious despite being pricy. However i was not impressed with the food, which was not high quality. Wouldn't eat there again but i would go back for boba."}
{"text":"This shit is not even real boba and the \"chocolate boba\" was sour and tasted like old milk !!! Not worth the money"}
{"text":"We are not that impressed with the drinks, the food is nasty. The powder jars and fake mixes to make the drinks that are wayyy over priced. The customer service was good and friendly but i just dont see what all the hype is about."}
{"text":"This place sucks... drinks aren't that great and the wait is long! Go to Bombboba just down the road."}
{"text":"Decent boba tea shop for anyone wanting to check it out for the first time. They get pretty busy/crowded with the theater nearby but the drinks were as expected for a reasonable price."}
{"text":"I've only tried one other boba drink shop, but I definitely recommend this place.   I spotted the shop as I parked to go see a movie at the Harkins and decided to give em a shot. I was impressed by the number of flavor combinations available, probably over 30, and serving preferences are just as varietal. The staff is very friendly and responsive, and were sure to inform me that if I didn't enjoy my drink they'd make me something different right away.  I had an almond milk \"snow\" (think creamy snow cone) with star fruit and boba. The ingredients were really good - I think the star fruit might have been candied, it was sweeter than I expected, but not too much - the boba pearls were cooked well, with the consistency of gummy bears. The mixture was also surprisingly well proportioned, I got a little bit of everything with every sip right up to the end and it tasted great.   I really enjoyed what they have to offer and I'll definitely be returning to try more flavors.   For those wondering:  The prices are reasonable, expect to spend about what you would at Starbucks, and about the same amount of seating. There also appears to be free WiFi if that floats your boat."}
{"text":"The last few times I've gone they have already run out of boba. Very disappointing since it's waaay before they close."}
{"text":"I had the watermelon slush with strawberry boba. That Was Really good!! The only reason I didn't give it 5 stars is because they take FOREVER!! I've only been here twice and each time I waited 20 minutes or more just for my drink. They need to have more then 1 person behind the counter, especially on the wekeend!"}
{"text":"Was super excited to find a boba place in the West Valley. Unfortunately it was a big disappointment. The drinks were pricey and not very good. I almost always finish my boba drinks, but this was the first place in a long time where we threw our drinks away  after a few sips.  Maybe if they kept their menu more simple they could focus on actually making a smaller list of good drinks. Sorry, looks like we'll still be driving \"far\" for some decent boba drinks."}
{"text":"This store has a really strong bleach/cleaning product smell, as soon as you walk in it hits you in the face. Ordered avocado milk tea with lychee jelly and tasted nothing like avocado.. can't even describe what it tasted like..just flavored water basically. Would not be my go-to spot if you're craving boba."}
{"text":"I'm 40....this place isn't for me and it's not meant to be the type of place for someone my age to come hang out and sip drinks with my friends, we have places to do that.  This place is designed to appease a younger crowd and from the looks of it on a Saturday night the are doing just that.  Milk tea, boba drinks and snow seem to be all the craze right now.  Ample seating, todays top hits playing over some Bluetooth speakers, some board games and upbeat energetic staff seemed all that was necessary to lure 20+ teens.  Maybe it's just not my scene, I drink my coffee black and only drink tea with lemon and honey when I'm sick....but my wife likes the taro coconut drinks."}
{"text":"What a great Boba Place they have at least 40 flavors of boba lots of choices of gummies and different flavors of the Boba I had the taro which is quite delicious very sweet though I think I would get the 30% sugar  next time the staff was very friendly explained everything because their menu is a little confusing at 1st I think that there pricing is on pair with everyone els  will be back very soon"}
{"text":"LOVE THE DRINKS!! But the STAFF could use a little bit more of FRIENDLINESS!! I have not been greeted kindly after being there so many times! Awesome little place though with variety."}
{"text":"Though I would return, service was not all that friendly and the menu was just ridiculous. It is so extensive and who can navigate it when the cashier doesn't seem to have the patience to explain it to you. I hate to be on the harsh side. Regardless, overall  I had a decent experience here. Boba was cooked well, tea was tasty and not overly sweet"}
{"text":"I always like coming here with my family, the drinks are amazing, but today was a different story. The customer service we received was horrible. The app on my phone for the boba house would not open and the manager gave me a hassle about redeeming the stars (which is suppose to be a perk for coming back). My kids order wasn't made correctly due to some mis-communication and I was scolded and argued with by the manager for the order being ordered wrong, instead of a quick and simple \"I'm sorry, let me remake that for you\". She would have rather gave me back my money instead of make 2 new drinks. I didn't feel like a valued customer and I'm not sure I'll be going back there just because of that. I can sure spend my money else where. It's unfortunate when you have people with no customer service running this beautiful business cause it can ruin everything."}
{"text":"Did the owners change? Or just the staff? The old staff was way better. They used to have a white paper with all kinds of choices for drinks and I asked the girl for it and she told me they don't have them and I told her they used to and she acted like I was stupid and I had no idea what I was talking about. Definitely don't go as much as I used to because the rudeness. The drinks are always a hit or miss. Either really gross (like their taro is the worst one I've ever had) or the best drinks ever."}
{"text":"I am on business trip in Avondale and find JT Boba House.  Decoration is so modern and neat. Service was very friendly and helpful. I tried their Taro Milk Tea with boba and I loved it!! Taro milk tea was so yummy and so as their boba. Boba is lightly sweetened with chewy texture. Just the way I like~~~ If I came to visit this area in the future, I will definitely come to this boba place again.  I decided to come back today before I headed back to LA. I was told they serve green boba. It is so X'mas feel. So I decided to order Strawberry Snow with Green Boba. What else can make it look more like a X'mas color?!!!  I was pleased by the drink presentation and took the first sip. OMG!! Strawberry Snow was so delicious~~~ : ) I could even tasted the small bits of strawberry pulp. Green boba was nice and chewy like their regular boba. I was fully satisfied by this holiday drink~~~~ Well done, JT Boba House!!!"}
{"text":"After coming to this location many, many times from my first review.  My experiences have tremendously improved.  My drink (same one I order every single time) has been consistent and the service is friendly and quick."}
{"text":"Customer service is the worst. Employees are so rude even when it's not busy at all, and they always mess up my order in some way or another."}
{"text":"Very good once you figure out what the heck you're supposed to do. Very confusing for a first timer. Fairly expensive as well.  I'll go back for sure as the coconut pineapple slush was great."}
{"text":"My go-to boba house! Not because it located near me because tbh there are closer ones but the staff here is really friendly, there boba is AMAZING (soft chewy all of the above), and they have an EXTENSIVE menu!   To a new comer it might be overwhelming but after you go there a few times it almost as if it's a game of which flavors would match and taste well with others!   Not to mention there's usually space to sit and play games which is always nice if you're waiting for your movie time or just want to hang out there. They also have snacks and things to eat if you're hungry.   JT Boba also has an app which is always good to have because thats where they keep track of your punch card if you go as frequently, or would like to go as frequently, as I do! Lol"}
{"text":"I LOVE THIS PLACE!!! BEST BOBA IVE EVER TASTED. They have SO many flavors it's endless and you can do combination. And there's so many types of boba from tapioca boba, popping boba and jelly ! I had the Watermelon slush with green apple popping boba and I loved it so much"}
{"text":"My daughter & I love boba & we try to locate it where ever we try. This store was fairly new & it showed.  Very unorganized & extremely slow.  Although the boba tea was ok, it took far too long to receive it. Plus the flavor was not as strong as it should have been. Perhaps next year when I visit Avondale,  I'll give it a 2nd chance...if it's still around.  If not, oh well, I'll continue to travel to Snoh Ice Shavery in downtown Phoenix...its AWESOME.  JT should visit too, he could probably pick up a few tips. SNOH ROCKS!!"}
{"text":"Great place to get boba drinks. Nice selection but f drinks however not for snacks. The kitchen was closed at 6PM? Strange."}
{"text":"So sad because I love boba. I ordered a honeydew milk tea with boba and a watermelon snow with boba and they were so disgusting. It tasted perfumey like hairspray or air freshener. So gross."}
{"text":"Intro: yelped a boba place on my drive through Phoenix   Pros: -boba is chewy for the most part and super flavorful. -the avocado/pistachio snow had great flavor and super sweet. -ambience was super well lit and tastefully decorated. There were also plenty of people hanging out playing card games. Pleasant pop music played on a nice sound system. -topping, boba, and drink selection is insane. Do they actually have all that in stock at any given time? Seems absurd.  Cons: -some bobas in my cup were chewy and some were crumbly. Bleh I hate crumbly boba. It's not the worst boba I've had but it could be chewier and softer.  -bathroom was clean but didn't look as well decorated as the rest of the place and felt a little dingy. -the menu doesn't have prices so when it was my turn to order, I thought I was going to order a harvest green JT classic drink but I was told it was going to be over $8 and I was like \"daaaaaaaaayum!\"  -I was charged 25 cents for using my credit card on my transaction because it ended up being under $10. The Yelp coupon helped to off set that but I didn't notice any overt signs about this charge...  Conclusion: A meh out of 10. It's out of my way to drive here so probably won't be back."}
{"text":"Went in later in the day and ordered A iced tea boba, it was amazing! Soo much boba and so yummy! Can't wait to go back!"}
{"text":"Went tonight (645pm) & got a Pineapple Strawberry Snow with Pom boba.  Suuuuuper delish!  Earlier this week I tried a mango tea with Almond milk & blueberry boba-  I wouldn't recommend the blueberry boba, but the drink was still good!  This visit was 5 stars because of the service. I had questions and the girl who helped me was knowledgeable, friendly, quick, and great!  My drink was great and I got it quick. Will be back to try another soon!"}
{"text":"I love boba tea. I decided to try this new boba tea joint.  It's a family-owned spot (a plus for me), the service was fast and helpful.  They have a bazillion boba choices PLUS teas. Looke for the choices with a \"heart\" as it's one of their popular items.  The price was fair and the drinks were delish!  * Kauai Coctail with chia & aloe * Desert Pear Boba Milk Tea over ice with 2% milk"}
{"text":"Love this place! My boyfriend and I come here all the time. At JT Boba, expect a *huge* variety of tea flavors and boba types, freshly prepared and sealed cups, fair prices, and a relaxed, wonderful-smelling environment. And, you can try a sample of any boba pearl that you'd like! $5.50 for a regular size cup (which is massive, by the way!) and $7.50 (I believe?) for a large. Definitely worth a try if you have never been here before! My favorite tea from here is the thai milk tea with the classic boba pearls, but they also offer all of their bobas in a regular tea, milk tea, slushie, or \"snow\" (like a milkshake) consistency. JT Boba is awesome!"}
{"text":"First time here, was recommended by a few friends. I was overwhelmed by how many options there was to choose from. I was disappointed on the lady taking orders, I asked for her recommendations and she simply said they're all good, so I asked which one is the most popular and she didn't care to help she simply wanted me to hurry and ordered. I gave it 4 stars because the Boba I randomly was pressured to select was delicious, I would give it a 5 if the service was has great as the Boba mango- kiwi slush."}
{"text":"Great place very great people! America's Best AMT crash courses,LLC recommends this place! The best boba drink is the house drink very good! Also, kenja was a great help and makes the drinks very delicious! JT boba did great on hiring staff.  Location needs to stand out more Inside well maintained and clean  Food was great!  Tvs inside great for kids and adults  Overall 10+ stars on this location.   America's Best AMT Crash Courses,LLC"}
{"text":"I like that they allow you to mix different flavors of teas. I'm from the east valley and not many shops have that as an option.   Also the boba challenge caught my eye. $225 gift card to the shop if you can finish a 2ft 3in glass of boba in 30 mins - or you pay $75. As much as I love myself some boba milk tea, I don't think I'd even be able to make a dent within that time frame! Something I'd definitely be interesting in coming in to watch happen though"}
{"text":"Finally some good Boba close to home! Great selection and good atmosphere. Try the popcorn chicken."}
{"text":"I absolutely love the popping boba no matter the flavor! My favorite is coconut snow with coffee flavored popping boba! Parking sucks on weekends so go during the week it's easier to get to!"}
{"text":"I always come to this place and I am never disappointed! They have such a wide selection of flavors for boba and drinks. They also have almond, coconut and soy milk as options with no extra charge. The place itself is nicely decorated and they even have games there that you can use while waiting. They do not take too long on making the drinks, but it can be a long wait with a lot of people. The staff there is amazing and they're there to answer any questions, they are a really big help if you don't know what to order. I definitely recommend trying as many different flavors of drinks because it's all so good and the boba is to die for!!"}
{"text":"Oooh emmm geeeee! This place is the bombdotcom. They girls at the counter are always friendly and suggest some pretty good drinks. I'm currently obsessed with their Thai Milk Tea! Love that they serve you these drinks in a decent sized cup so its actually worth what you pay for! I've gone to many other Boba places and this one is by far the best."}
{"text":"I really like boba and since moving from SoCal to the Phoenix area I have found I have to travel wide and far to get boba. I found this location and started going bc it was close to work and I could sneak over during lunch. The boba is really good and they have tons of options. However the little things were starting to add up. From being out of things, few order errors. Things kinda went south when I ordered a boba with coconut milk and got regular milk. My stomach hurt all evening as I am severely lactose intolerant. Theres was only one other person there so it was bc they were to busy. So word of advice be careful if you have any special request. Otherwise this is a good plave to get quality boba."}
{"text":"My second review because I'm very upset...  Omg the service here is so horrible. I understand that this place is trying to be different with their styles with their drinks, but I went in and ordered green milk tea and the girl was so nice and ask what style I want. I said what? Styles? She said that there is a healthy style and boba style... I'm like hmm interesting... So I said boba style cause honestly what is healthy style???   Then I told the owner I ordered green tea but on the cup it said jasmine...so I asked the owner if it was the same thing and she started explaining all her teas in like an attitude way without offering a replacement on my drink (which I told her I didn't like). I was being honest about how I felt about how nasty my drink was and she still going on about how her drinks is unique or whatever..  Like I'm sorry I don't understand your complicated menu... The owner is just pure rude with no customer service.   I immediately threw my drink in the trash and she stand behind the counter and starts calling for me telling me to come over to her. I didn't get an apology and she still going on about her different style in teas. Like omg your wasting my time either say sorry or offer a new drink.   Although her employees are much more nice and more professional than the boss.   I will never order a drink here again. Everything here is just to complicated and this is not my first time ordering a drink. Their consistency is not good at all.   1 star for the rudeness of the owner and my drink that honestly tasted like Ensure milk mixed with jasmine or green tea whatever it is... Gross.."}
{"text":"Boba cups are very odd now... They use a different one for drinks depending if its a slush or tea  Prices have definitely gone up... It shouldn't cost 12 dollars for 2 drinks... At least not for the quality you get here. Boba here is decent, and the variety is still the same. There's like 60+ drink combinations here! Confusing for first timers.   Overall I think its still an acceptable place to go for your boba and drinks!"}
{"text":"The best boba place ever!!! Great staff and great atmosphere!!! Of course the drinks are awesome! They can make a simple drink and even custom make you one depending on mood.   In addition a big plus, they serve real restaurant quality food! Try the Galbi, which essentially is a Korean short rib and the egg rolls are to die for!  Come and support this new establishment!"}
{"text":"Drinks are bomb they do take alot to make them do to the fact of 2 people only working. But i dislike the workers here not polite at all"}
{"text":"First time EVER trying Boba and decided to stop by this place & I was very impressed! The cashier was very knowledgeable and explained how to order (since it was our first time) They have SOOOO many flavors to choose from so it was kinda difficult. I got a walnut strawberry snow with strawberry boba. My fiancé and I enjoyed it very much and now know what the Boba hype is all about. Will definitely go again!"}
{"text":"Jt boba is my favorite place. I've had so many different drinks here. I have  loved every single one of the drinks I've gotten. The price is decent for the size of drink you get! They taste so good. The workers are so nice and friendly. :) I definitely recommend coming to JT boba house."}
{"text":"New place around my house! Yeassssss been waiting for it! I love their jasmine milk tea. I love the service there and already I love the food. All I got to say is go try this place out, if your a tea person get the jasmine if your a little hungry try out their food :) I personally like the Bulgogi lunch box.;)"}
{"text":"Bad. It is just bad.  The menu has like 200 items. They ran out of almost everything. The staffs don't even know how to make the drink. It took them forever looking back and forth the menu before randomly make something. After making it, they didn't even know the name of the drink.  Bad. Really bad."}
{"text":"I brought my daughter here to get a boba drink, and now have a new favorite place to get our boba fix.. lol"}
{"text":"Loved everything about it. So many choices and possible combinations, I'll definitely be coming back. Also had an order of the Egg Rolls. Perfect snack size and delicious. Dipping Sauce also good stuff."}
{"text":"Horrible service. No manager on site to resolve the problem we had. Employees will argue with you. Refuse to take coupons as terms are described on them."}
{"text":"2 stars for the design! Too crowded, the wait is forever !!! Customer service is a 0 . The owner just doesn't know how to run the store and her employees. The drinks are nasty and taste water down. I question my bf - if the drinks are even \"boba\" too. The employees are rude and so is the owner . I gave them 3 chances and each time I come - the dissapointment just add on!"}
{"text":"First time here, wow what a selection of teas! The owner was helpful in explaining and very nice! I ordered the I  My Fertility (I think that's how you spell it!) and it was good!  I will be back!! Happy Eats!!!"}
{"text":"Found this new boba place by my house and thought I give it a try! Nice small spot tuck all the way in the back.. nice decor and has a games station like jenga and uno and other games you usually see at boba joints.  I got myself a milk tea! It was good but it doesn't quite have the traditional taste of milk tea that I like but nonetheless it was good.  The service is excellent ! My girl friend had gotten a lavender milk tea and she did not like it at all but the person at the counter replace it with another flavor with no additional charge! He was very friendly! Would have given this place a 3 star but their customer service got them one more :)"}
{"text":"With alllllll of the great boba places in the valley, I will NEVER support this place again. Horrible customer service. The people that work here either really hate their job, or have a crappy life. The owner is rude and bitter as well. She never smiles, and just has a crappy attitude in general: Their milk teas aren't that great compared to other places I've been, they're kind of watered down and lack flavor. Avoid this place. Go across the street to BOMB BOBA instead for BETTER service and better boba."}
{"text":"Not the best I ever had but its pretty good stuff. It feels like they don't want to take creative freedoms even when asked too. They make what you ask them to make, just as you say it, without missing a beat. I don't feel like I can try new things here though since it's hard to get a creative creation or blend that will work well. I shall return for more when I pass through and get my usual."}
{"text":"This place is a joke!! Has anyone ever been to a place that won't let you ADD (meaning PAY for an extra)?? For example, when you get a sandwhich you can add avocado for an additional price you can. Or if you order food and DONT want want something on your food, you can ask to not have an ingredient??? This place only offers L OR XL.. so two Large teas is $14??? I asked for a green tea and wanted to add coconut milk.. they said no. They said they don't modify their drinks. So I asked to just buy a  side of coconut milk and I would add it myself. She said no. I'm sorry, the way I drink tea may not be the same way everyone else drinks tea, but for 7.00$ a tea you should be able to add a SPLASH of milk. If you Have $7-10 to splurge on a drink and not have it the way you want it, this is your place!  JOKE!!! Horrible service from the manager. What is the point of add ons if you can't add on??? Bummer they lost a good group of customers."}
{"text":"I came to this boba place because it was the closest to my house. It was very disappointing because they ran out of boba... what boba place runs out of boba? Settled for a Thai tea snow with coffee jelly instead. The drink itself was pretty good, but I was really craving boba. Cravings not satisfied. :("}
{"text":"AMAZING boba place! I'm from Los Angeles and there's boba joints all over the place and they're usually hit and miss. This definitely hit the spot in so many levels! The wide range of flavors is incredible. My husband and I have gone three times in one week. We think about what we want to try next when we come back. That's how much we love it!!"}
{"text":"We have been here several times and each time has  been a tasty experience.  They have put the drink in Harkins cups so you can go to the movies with a slush or snow.  The taro snow with almond milk is awesome, or try the caramel snow with almond milk, coffee jelly and chocolate boba for a deconstructed caramel mocha."}
{"text":"Super overpriced. Spent SIXTEEN DOLLARS on two drinks that were lackluster. Coconut mango lime slush was okay. I ordered an XL pistachio milk tea and it had no pistachio taste whatsoever...extremely watered down and lukewarm due to the thin layer of ice that melted minutes after leaving. Extremely disappointed and it took everything in my being to not turn around and demand a refund. Stick to basic flavored and you should be fine. Don't waste your time getting a large or XL it's not worth it."}
{"text":"I've gone to this boba shop many times before, but it wasn't until my last visit that I had problems with them. One of the employees misheard me while I was ordering and gave me the wrong drink. I was very polite when I corrected them and asked for the drink that I actually ordered and the employee responded by saying, \"It doesn't work that way\". In the end, they gave me the right drink, but they were very rude about it. My suggestion to customers: speak loudly and clearly while the blenders in the restaurant are on so that you don't have the experience I did."}
{"text":"Wasn't happy. We've been there several times and I finally tried something new which was pretty nasty. I asked if they'd swap it out and they said no with an attitude. I've never been somewhere that doesn't replace food or drink if you're unhappy. I also don't need some kid giving me an attitude. I won't be going back."}
{"text":"I've been to several boba places in the area and I was very disappointed with this place. So far every boba place I've been to has ube ice cream but not this place. I always at any boba place order the Taro snow with 2 scoops of ube ice cream and man having it without the ice cream makes a huge difference. The taro snow here was very watery with little taste to it. There was a lot of boba in it though lol. This is the nearest boba place to my house but if I'd want a drink with taste & worth my money I'd drive the extra miles to Bomboba."}
{"text":"We went to Bomboba... Amazing!! They are so nice there and very knowledgeable! Delicious drinks! We will not be returning to JT Bobahouse."}
{"text":"Unfortunately I got what maybe the owner dam rude not friendly biatch. Drinks were good other girls were friendly but dam I don't want to give money to a rude b*tch"}
{"text":"I was out visiting my friend. I wanted to tryout something different. The boba places out in California ( the ones close to where I live) are nothing compared to this place. Perfect place to talk and hangout with friends. They have so many options for drinks that I didn't even know what to pick. Which by the way I wanted to try everything. I picked a holiday specialty drink that was perfect. And the the size was pretty big perfect for sharing. My kids loved it as well. Definitely going back when I visit Arizona again. The staff was helpful as well."}
{"text":"We were hoping to get some popcorn chickens and we came right at opening at 10am but their kitchen was closed :/ . The boba drinks are just okay, the taste didn't impress me. I really don't like the big size cup that they use because it doesn't fit in a cup holder in the car!"}
{"text":"Great place with huge selection on teas, flavors, and add-ons. I've been there numerous times and although I like to try different drinks, I always get their popcorn chicken. It sounds crazy to order popcorn chicken at a boba shop but they have some of the best I've ever had.   The earl grey milk tea with boba was good but their drinks are usually on the sweet side but they're gladly willing to adjust the sweetness to your liking. Really good place to bring your friends to hangout or play cards, and would definitely be coming back!"}
{"text":"The tea is decent but it's wwaaayyyy too expensive. $12 for two regular size flavored tea. WTF??? There better be alcohol and crack sprinkled in there. If this place fail it would be of greed."}
{"text":"Went back to Jt boba house. Thought I would give them another chance. Omgad! I seriously wanna slam my drink on the counter & say, I WANT MY REFUND. But me, I know better not to do that. Anyways, went there last night and got myself a strawberry & kiwi flavor tea with boba & jam. I thought I would try jam because when I had it in Cali. Omg, I was amazing. Had it here, it was a failure. Everything about my drink was just a no no!!!! Plus I even asked my boyfriend how was his Thai tea. He said \" it taste water down\" then I asked my little sister in law how was her lychee drink. She said \" I hardly can taste anything but water\". Fix your drinks because its definitely not good at all. Never coming here unless someone pays for my drink but I probably just get myself a cup of water :)  Sincerely, a customer that knows what's good & whats not good"}
{"text":"Best Boba place in the valley. They now have karaoke on the weekend. They have full food menu and a Boba drink contest. Check it out."}
{"text":"OMG...today was my first time trying this deliciousness in a cup. I had a reg size mango/pineapple snow with mango boba. It was AMAZING!!!"}
{"text":"Avondale went a LONG time without having a boba spot. JT boba house is located in the same space Lollicup once occupied. This is currently my go-to for boba :-)   Decor is cute. Looks like an ikea show room, lol. For drinks, they have sweet levels so you can decide how sweet you like your drink. I get the milk tea boba, it tastes pretty light to me (compared to Bomboba's), which I can appreciate.   Their menu board can get a little busy sometimes, so much written up there. I like simple but I guess others can dig the variety of drinks they offer. Clean unisex restroom, games at the very back to keep the kids busy.   TIP - When you go, get a stamp card. 10th stamp = free drink.   I would give 5 stars, but I'm giving 4 this time because... They got rid of the kid size drink at $4ish. I now have to order a small, which runs at $5.50ish. That price change is huge. The cup is a weird size as well, it does NOT fit in a car's average cup holder. How can I enjoy my boba drink to go? :-("}
{"text":"The boba drinks are all right at best. I usually get the Thai tea drink at other places but it tastes like it's watered down here. Shame."}
{"text":"I absolutely loved this place! There's so many options it's crazy! I am from Cali I wish they had this down here! But I tried the Thai tea with honey burst bobas! The small size got me full! But I couldn't stop drinking it LOL"}
{"text":"Stopped at this location twice while in Arizina. The best Boba choices I have ever seen. Delicious drinks and the Price and service isn't bad either! If in the area, I will stop by for Boba again!"}
{"text":"Just purchased two teas and was extremely grossed out. My husband found two medium sized cockroaches in the dining area. No one said sorry for the disgusting inconvenience as we made our way out. I have a phobia of cockroaches and I know I looked frightened!! I understand food establishments can have pest issues and might be in the process of ongoing treatment. If they are having pest issues and taking care of it then they should have a manager or other staff constantly scan the business for dead pests for the convenience of its customers. My husband and I will not be returning."}
{"text":"The boss is rude and does not understand customer service. My Thai tea was watered down and didn't have flavor."}
{"text":"I was looking forward to a Boba place near this side of town, but I was disappointed. I ordered  a 24 oz Lychee snow with Boba which came to about 6 bucks. I expected milk in my snow slush, but there wasn't  any. The Boba was 'eh' texture, not soft enough. The lychee flavor was there, but seemed syrupy with chunks of lychee. I also found a few big chunks of ice still at the bottom. I wouldn't recommend this place."}
{"text":"The place is bright with a lot of plugs so you're able to enjoy a drink or snack while working on homework or whatever you'd like. They have an extensive menu & the staff was friendly.   I had the 16oz Thai tea with Boba, and I wasn't too impressed. It lacked a lot of flavor I might of enjoyed the boba at the bottoms of the cup more than the actual drink.   Overall I would give it another chance it's nice to have something like this around. In case your not really in the mood for ice cream while you wait for your movie showing."}
{"text":"This is best boba place in all of Phoenix hands down! They have so many slush/snow/tea flavors the choices are infinite! I always like to mix different boba flavors with different jelly, boba, and pudding flavors. So I never get the same thing twice . This place is so good that I have friends from LA who always suggest we come here first when they visit. I'm so glad I live in Avondale, because this place is right around the corner from my house."}
{"text":"I've been here several times since it's the closest in the West Valley. The matcha green tea snow & taro snow are not bad here however the milk tea, Thai tea and passion fruit tea are just ok compared to Boba Tea House. The prices are more expensive but they do have a stamp loyalty card. Majority of the time I go there, the wait is too long even though there's barely anyone there. Other than that, if I want something close by, I would consider JT!"}
{"text":"HANDS DOWN, BEST BOBA IN THE WEST VALLEY! Their drinks are made with quality ingredients (the real stuff) so if you order a taro milk tea you get REAL TARO instead of the nasty artificial powdered one would get at a typical boba house. My kids love this place because of the game area, yummy popcorn chicken and of course, boba!"}
{"text":"I love me some boba, so I was stoked to see this place pop up not so far from where I reside. Checked it out and thought it was pretty swell. I mean, they have a long list of flavors to choose from and they offer half off on any one item to Yelpers who write a review (and no, it doesn't say it has to be positive). If you like boba tea, and you like variety, I'd advise you to check this place out."}
{"text":"This is a nice very lit boba place. I tried their Taro coconut milk tea and it didn't disappoint. They had so many flavors that it was hard to choose. From what I tasted, it was not too sweet which is good. I've had boba where it was almost pure sugar and the texture wasn't right.   Their cups are a little different and possibly bigger than normal cups which you will see in the price increase. They are basically wider and fatter than a normal cup. It's almost like a bowl. A medium will run you almost $6.   It was fast and friendly and clean. So no complaints here! Come drinks some tea and watch Korean drama on the HD TV.... with no subtitles so you won't know what's going on. But hey! Everyone on the shows are extremely pretty so dialogue is not needed. Haha."}
{"text":"They have a wide selection of drinks and teas! Their menu is huge and double-sided. They also have a good selection of bursting boba, that's what they call it. Their drinks are really good.  They do have a small lounge area; when I wait for my drink to be ready, I feel like I'm gonna brush against somebody sitting near the counter. This is a reason why I give it 3 stars  The other reason I give it 3 stars is because the times I've been here, (usually Saturday nights) the staff is rude and sassy. I know that they know the menu & what not but don't make the customers feel stupid. Many haven't tried boba tea & they're ruining their experience. I thought a slush was made out of milk and snoh was with ice. The chick who helped me snapped on me and gave me a lecture what was what.   I normally don't do reviews but when staff annoy me & give me attitude when I don't give them attitude, I do!"}
{"text":"Not sure why this place isn't rated higher.. they have such a huge selection of interesting tea, ranging from sweet to fruity to classic Assam or oolong. I mean the menu is EXTENSIVE and I wanted to try everything.  Ended up getting genmaicha jasmine milk tea with chia seeds, almond milk, 0% sugar and 25% ice. This only comes in large size btw. They used a jasmine tea base and then added genmaicha on top of that (genmicha freshly brewed from loose leaves as I saw them prepare it behind the counter). Props!  Without added sugar, the tea tasted really fragrant without being overwhelming, with a hint of nutty flavor and some sweet/creamy taste from the almond milk.  Prices lean more on the expensive side for bubble tea- mine was $7-8 for a drink... and that's pretty steep. Maybe that's why their ratings aren't as high. But aside from prices.. Customer service was great! They didn't mind customizing my order even with a long line of other customers. Usually 3-4 workers behind the counter. Wifi provided, just ask for the password as I didn't find it posted anywhere inside.  It's located in a huge shopping center so you really gotta drive around looking for it, but it's all the way on the inside, across from peter piper pizza, and near PT Pho Vietnamese restaurant."}
{"text":"Horrible service!!.. I didn't even get a hello when I walked in and the girl that took my order acted like she hated her job then the worst part is they charge 25 cents to use a debit card probably cause they know people will have to pay it.. The owner made my drink and handed it to me like she did me a favor and not even a smile or thank you when obviously it's us customers paying for her to stay open!.. I will never come back here again and will always recommend Bomboba across the street to anyone looking for these drinks and better atmosphere and service for sure!!!!! I was going to suggest hiring new staff but what's the point when the owner is rude herself"}
{"text":"The drinks are OK, however when I came here on Christmas Eve around 1pm I received very rude customer service. The two workers did not understand my order and succumbed to a condescending tone. Her attitude made me feel unwelcomed in this establishment. She gave a look to her coworker and just let her coworker take my order instead., without a word to me. Also noticed this worker using the same rude tone to the customer before me, as well as them speaking in Spanish all while glancing at my group and I. Will not be coming back here and will take my business to Bomboba across the street instead which is a shame since this spot has been my go-to boba for years. I hope management finds better employees capable of actual customer service."}
{"text":"The boba is top notch, but the service is even better! I went in & wasn't really sure what I wanted . So I asked the male behind the counter (Mark) what I should get. He mentioned so many good flavors & found the perfect flavor to match my picky taste buds. You can count on my consistent service because of Mark!  P.s get the taro strawberry snow with boba , AMAZING"}
{"text":"Coconut avocado pistachio boba hmmm heaven it's honestly the best boba in all of Arizona ! You get your monies worth."}
{"text":"Good location. Decent prices. I've been here several times in hopes that they would do better than the time before and they never get better. My drinks always taste strange and they have messed up my friends drinks EVERY time. The girls behind the counter are always on their phones when i am there. This is their job and they should act like it. I don't think i will come back."}
{"text":"I wanted to love this place because I love boba.  I love the decorations and the clean look.  I got the almond milk tea with boba, but it tasted watered down.  I also got the beef bulgogi lunch set.  It was surprising good!"}
{"text":"Soo many flavors to choose from. Very laid back environment, many games to choose from to play with friends while you snack on appetizers. I've tried their Piña Colada Snow, Mango Snow, Peach Snow, and Guava Snow, all with regular boba. Never a disappointment!"}
{"text":"Love this place customer service is excellent the dining area is clean they have games u can play while u wait for ur order or even after I always get different drinks they have so many to pick from"}
{"text":"The default size for some reason was large. Very expensive. I asked for oolong tea and they were confused even though it was part of the menu. They asked around two employees to see if it was available. The drink itself did not taste like oolong, it was more like syrup drink. For their benefit, the boba balls were good and my friend really enjoyed her drink.  This was my second time here and I've been disappointed both times. However they get a lot of customers so it might just be me."}
{"text":"Not bad... When I asked for a Vietnamese coffee with boba, I got a blank stair.  Basically a coffee with boba is what I received.  Will have to come back and explore their menu a bit more."}
{"text":"This place has a huge menu, and I mean, so huge that we had to sit down and dissect it. It seems that they put all the possible combinations of drinks on the menu. Probably not, but it seemed that way.  Anyways, finally ordered, the drinks came quickly. We paid $12 for two drinks. They were huge, I drank half of it and had to throw the other half away. I rather pay less and get a reasonable size drink instead of the giant-not-cup-holder-friendly cup size.  Above that, the drinks were just okay. Meh.  They do have a huge selection of popping boba flavors to choose from- those where you bite into it and all this juice comes out of it. I'm not a big fan of those either, so the big selection didn't really do me any good.  The experience itself wasn't bad, but the price and quality of the drink falls below my expectations."}
{"text":"This would be a great place but for several major things.   They burn incense and those of use with asthma, or get migraines from heavy scents and odors will not be able to put up with it.     I like the bursting beads... if they give you the flavor you ask for....but it's not like it's natural, so artificial.  Be prepared to look at the menu for a long time to figure out what to get the combinations are vast. Or download they app and decide before you get there.         Also if the are out of something they won't tell you they just substitute something of the same color.   Such as the cantaloupe bb\"s they give you peach bbs instead . They are not even close only the same color :( because peach is tart and I don't like peach.  But they don't even tell you... they have done this twice to me.     They do things weird. They have signs for order here pick up here but they don't follow them.  Pick up is on the other side. Where the glass case is. So things get cramped and bottlenecked.  Instead they should  have order here where the pick up here sign is.   And have the pick up where the order is.  It would not be bottle necked anymore  Unfortunately, I bought a bunch of groupons so I'm stuck going here for a while."}
{"text":"I can't believe how much they charge for drinks here! I paid $7 for a regular sized Boba Milk Tea... the SIMPLEST most BASIC boba drink there is! I wish I would've known the prices before ordering. Never again will I come here for boba unless they become more reasonable with their pricing. I'm honestly surprised they are even still in business with their ridiculous pricing, the drink itself wasn't THAT good, sheesh!"}
{"text":"Fantastic drink selection. Prices are reasonable, military discount. Right next to the movie theatre at 99th ave. Great customer service. Had a bohemian vibe to it. Great place to meet up with friends."}
{"text":"Good boba . Good atmosphere Only downside is they laaaaag Very understaffed. But so worth the wait lol  My boyfriend and I come all the time"}
{"text":"I've been to JT boba a couple of times.. The boba is good.. Pricy but good..  The women who takes the orders seems to always have an attitude and can be rude and unwelcoming. I asked for an extra cup to share with my son and one of the guy workers was very kind and handed it to me but before it could even be out of my sight the owner, women who takes the orders, scold me about giving me a cup.  I thought that was a bit unprofessional and not to mention embarrassing for the guy. The other time I went I got a large Thai tea boba i took maybe 3 sips of it before my 1 year old pulled the straw and it fell on the floor. When I went to let them know that I spilled my drink the women looked ANNOYED that that had happened and even bothered by the fact that they had to clean it up.  What bothered me the most is she didn't even offer to refill it or even give another at discount. It's all about costumer service.. You want your want your customers to feel welcomed and appreciated for their service. Everywhere that I've been where I've accidentally spilled a drink or dropped it they were always kind enough to either refill it or give me another at a discount. Especially if it was an accident caused by a one year old.  I will not be coming here again."}
{"text":"I am a boba lover but this place is horrible.  Ordered 4 drinks today and all 4 drinks tasted awful.  They are expensive.  Had to throw all 4 drinks away because it was awful to finish it."}
{"text":"As a native bay area person, I really like this new boba joint.  But living in Arizona now, its hard to find good Asian food or boba and the traditional snacks! But I think im finally found a place that comes really close to what we have at home.  Its not going to compare to so cal or bay area boba but its really darn close.  Tried the red bean milktea and the papaya milk tea both with boba and honestly its pretty good.  The red bean was the best!  Reminds me of t pumps red bean milk tea! Havent tried the food here yet but will definitely be back to try it.   The place has really high tech drink mixing machines, a ton of board games to play with and lots of very comfy seating! Definitely recommend if youre from Cali and crave a little piece of home!"}
{"text":"The place is pretty big and decorated nicely. I ordered the taro snow with boba and it was  decent."}
{"text":"I been coming here since it opened. I have had great experiences, even when it's busy, until today. JT has a somewhat new team member who needs to be trained on better customer service. Yes, I returned a drink because it tasted terrible but there's no need to insult a customer by saying \"make sure it's the first and the last time.\" The rest of the staff was polite and welcoming. Don't get the Açai, it tastes nothing like the actual fruit. The majority of everything else is great!"}
{"text":"Groupon brought me here. First timer and love this place! Its cute, bubbly and offer free WiFi. :)  Regular sized drinks are $5.50 and honestly you dont need a bigger size for one person! They are big! Plenty of boba to choose from! I highly recommended looking at the menu ahead of time since there is ALOT to choose from. I got a peach/strawberry/coconut snow with almond milk and I would totally get again. 25% sweetener was perfect!"}
{"text":"Finally a new boba place by my house. It used to be Lollicup coffee and tea before, but I'm glad it's another boba place, probably with a new owner. I love their new interior design, they renovated the place.. (As you can see in the photos). Service was great, the girl who helped us was really friendly. She also said if we didn't like what she suggested, we can return it and exchange it to a different drink. The drink tasted really good but the boba needs improvement, usually boba are soft and chewy.. not all of the boba were chewy, some are hard in the middle. The egg rolls was delicious! It came out hot & fresh, i almost burnt my tongue!"}
{"text":"Rude hostile people,  This place has had multiple complaints and yet the business never changes. Clearly they don't care. Also the boba tasted watered down."}
{"text":"Young hip kids that have great customer service and very friendly.  Showed us what to order.    I was boring and just got a taro with plain boba.   The selection of boba was pretty incredible.   Just passing through but I'll remember this place when I'm this side of town.   Yummy and refreshing."}
{"text":"I've been to a lot of boba places from LA to NYC and this place is about equal.  I've never had the boba at JT's but I've had the taro snow with red bean and its delish.  I would recommend it since it's one of the only boba places on the west side."}
{"text":"Friendly staff ! Super clean very chill environment Im a huge fan of the rose milk tea so amazing !!"}
{"text":"I would highly encourage you to find your Boba Tea elsewhere. I purchase a Groupon and the company does not abide by the limit one per person policy of Groupon. Cashier stated it is per day when it clearly said limit one per person per visit..I came with six people to treat my foreign exchange student and some fall break guests. Needless to say, I had to use my own money and my Groupon was worthless. Thankfully, Groupon has a great policy but this company does not clearly abide by the explicit letter in the \"fine print\". I showed her the Groupon for six trampoline visits that I also purchased same day and that company had the same \"fine print\". They did not have an issue with it because I wasn't trying to use all six to myself. The cashier then told me that she only has Groupon to get people in the door and make you come back multiple times.  FYI the milk Tea was actually pretty watered down and diluted. It barely tasted of blueberry, chocolate chip cookies dough, and mango (all in different drinks). The BBs were flavorful but that is prepackaged anyway so it doesn't count. Bottom line--save your $ and visit other more authentic tasting boba shops."}
{"text":"I love this place. Great to have something like this on the west side.  The atmosphere is light and fresh. Very clean. The drinks are a little too sweet for my likings but they are very happy to accommodate any changes you like. The staff is great. I love the different substitutes for dairy they have too.   :)"}
{"text":"The food is bomb the staff is bomb and the decor is bomb specially fabian and karely :D kawaii in the house"}
{"text":"Fantastic little place to get your boba fix. My favorite is the snow (today I had cookies and cream ) with tapioca boba."}
{"text":"This is my favorite boba place! I come here at least three times a month with my family. My favorite is the French vanilla mocha. The staff never get my order wrong, and they always provide excellent service. I highly recommend JT Boba House."}
{"text":"Great little boba place here in the west valley. The snows and slushes are the best items in my opinion, especially in the arizona heat. The boba itself is always fresh and chewy, not undercooked like in some other places. Have yet to try any of the food."}
{"text":"Good boba spot but so over priced.   Plus they limited their sizes to large and super sized. I don't need a large and my 8 year old definitely doesn't need a large.  It cost us over 20 dollars for three drinks!!! That's more than when I go to Starbucks!!! Bring back smaller sizes and it would be nice if it didn't cost an arm and a leg. Just saying."}
{"text":"Very rude customer service. I will not be coming back to this location. I ordered a taro special, and it tasted like water. So I just asked if they could remake my drink and apologized. You would have thought I asked for an arm and a leg with the attitude."}
{"text":"This review is strictly rating the manager/owner. She is so rude. They messed my order up and put boba in it. I can't have boba and when I mentioned it wasn't supposed to have boba in it the manager got very rude with me and said well it is written on it as having it. One of the workers looked so frightened of her because she was going to remake it. The owner said no. She made her scrap the drink out of the cup with boba into a new one. I was I. Shock! Who does that!?! Just remake it. What if your customer is allergic!?! Makes me not want to go back. The drinks are great, but not sure I want to give my money to someone who orders her employees around like they are her servants and uses shady practices."}
{"text":"To me, this is more of a tea house. I haven't tried the boba here yet, which is unusual for me, since I love boba! This is different, in that, they have several combinations of teas. Like imagine Tevana teas, but a larger scale. The menu for the first time can be a little daunting. It's huge with very small print. If you know what you like, you can narrow it down easier, but if you want to read everything, you're gonna need to move to the side, cause there is a lot to read. They have specials on the chalk board behind the register, but what I don't like is you have to ask what's in each one. But despite that, each time I've been here, I've enjoyed my tea. My last one was the romantic tea, it was pleasant, light, and not sugary, which is what I'm looking for. I'd recommend checking this place out!"}
{"text":"Overpriced, complicated ordering system, drink did not taste good. For a drink that is approximately $6-7, one would validate it if it was a health drink, coffee and/or tea or had quality backing it.  Was in the area and stopped by here with a colleague to check out this \"unique tea shop\", mind you I am well acquainted with boba shops. Typically, at new shops I ask the staff on their ordering style and what they recommend themselves or what drinks are popular. They have a similar ordering style to boba shops I've frequented where you control the sweetness, ice level, milk options and toppings. The menu is by far the most extensive menu I have ever seen, it's basically an encyclopedia of flavors and combinations. As for the recommendations, the staff listed multiple drink combinations from slush/snow to signature items and milk teas. Overwhelming. I feel that the inability to suggest or recommend one drink they can stand behind is a bit sad. I ended up getting a Green Apple Lychee as I've tried this combination before and it works well. As for toppings, lychee jelly and boba.  Large cup, awful drink. Well blended drink, but whatever they use for flavoring or milk resulted in a boba drink leaving a residual flavor to that of coffee creamer or Ensure. A very artificial milk flavor and a distinct tin-like aftertaste. It is a possibility as some boba shops use non-dairy creamer to create drinks. The lychee jelly and boba were fine, but it's hard to get those wrong. It was difficult to finish the drink.   Will not be back even with their 15% off check-in offer."}
{"text":"First time customer and I was helped more than I could ask. I was in shock because I had never seen a boba with so many options/flavors. The sizes for the price is ridiculously amazing. I forgot the young lady that helped me at the front (I'm sorry!!) but she was super helpful and that's the way customer service should be anywhere you go. (She had pretty eyelash extensions if that helps lol)"}
{"text":"I love this little place, it took me driving around the whole shopping center twice to find it since its in really small green letters next to Sally's. But the drinks are spot on delicious! I'm from Houston and there's a bunch of boba tea house so it's usually very cheap around $3-4 per drink. This is a little on the pricey side, but it taste good (not too sweet) so it's worth it. I had the jasmine milk tea and hubs got red bean snow. The egg rolls were good too."}
{"text":"The boba is good, but I've had better. The service on the other hand SUCKS.  They arent really friendly. They kind of just stare at you until you're done."}
{"text":"Their boba wasn't good at all.. and their prices were on the pricey side.. I have had a quite few smoothies from other boba places that didn't charge so much more extra for the boba. The staff were very pleasant though"}
{"text":"The only boba for miles...and it's good! They have soooo many options to choose from, as well as a cute little storefront. Definitely worth your time if you're in the area and in the mood for boba, or if you're shopping in the surrounding stores.  Overall, it's a go."}
{"text":"Yay! A boba tea cafe in Avondale!  Stoked to see a boba tea house so close by. It is small, but a modern and cool space with WiFi a nice crew that appears to be getting their game on. Tons (I mean TONS) of options for you boba order, so be prepared to wait for the people in front of you and then on yourself. The board has enough choices to overwhelm.  My wife and daughters liked their taros boba slushies. I thought the Almond Milk Tea with boba was too sweet. However, the boba were perfect and I can tell them to make it less diabetes-inducing for me next time.  All together now... GOOOOOO BO-BA!"}
{"text":"I'm so glad there is a bobba cafe it is the best- lines can be very long and wait can exceed 25 min. Get there early or don't go if you are in hurry."}
{"text":"Excellent boba!  Hundreds of flavored. Beginners may be overwhelmed with the choices but some of the best boba in town. Great modern clean sitting area. They have board games you can sit and play while you enjoy your boba."}
{"text":"i am really torn how to review this.  the truth is, if you have no food allergies or concerns, this place is five stars all the way. the selection is amazing, and cups are enormous, and the prices are good.  but if you have food allergies, i'm not sure what to say to you. i've successfully consumed a few almond milk taro boba drinks there. but then i tried a strawberry lemonade (which had strawberry bursting boba and fresh mint), and i was INCREDIBLY sick after. i have celiac and generally a kind of sensitive stomach, but boba teas theoretically should be fine (tapioca, sugar, artificial flavorings). i don't know if i was glutened (or HOW), but it felt like i was glutened. and now i'm afraid to go back.  really sad about this experience, because i love love LOVE boba drinks. so i dunno.   if you've got a normal stomach and immune system, you totally should try this place, though.  PS: beware the music is often very loud, they burn very strong incense constantly, and there's often a laser light machine running while you're in there."}
{"text":"Best Boba Tea in the West Valley.  Though they really need to get vehicle cup sizes.  The cup sizes are way too big, like a mini paint can.  The price is well worth it.  The parking could get a little difficult during weekends, due to Peter Piper pizza and Harkins Theatres traffic.  Otherwise, there isn't a flavor you can not try or that they will not have.  Highly recommended , and much better than that new place on Litchfield and Van Buren - Teabo....."}
{"text":"Went in yesterday for a boba and was pleasantly surprised. It was honestly one of the best bobas I've had, ever. I even tried the black milk tea boba which I normally don't like and it was good enough that I would consider ordering one next time. The people working the counter were also very nice and helpful. Check it out."}
{"text":"The employees and the owner are rude and don't  understand customer service. I was a regular customer and I always order the same drink. A couple days ago the owner told that it was impossible to make my drink the way I wanted it. The owner was really rude to me when she was explaining to me why they \"couldn't\" make my drink. I will never come here again not only are the employees rude but the drinks are also overpriced. If you are looking for a good Boba place, I recommend bomb boba they have great service and their drinks are tasty."}
{"text":"This place is very overpriced. I tried it once when it was recently opened, the customer service on my first visit was wonderful. I was greeted with the owner of the shop, I assumed. The drink was a little melt down but I still came back for a second time to try other options. The second time I was greeted with a woman and I have to say, I was not pleased at all. I asked for recommendations, she gave me an attitude and tried to hurry me to order so my bf went first and ordered a tropical punch after asking her what is it like, her response was just \"good\". It was nearly $7 for just sparkling water and a few pieces of jelly. My taro slush was very decent but I think the other drink was not worth the price at all."}
{"text":"I always get the honey matcha green tea and this is my favorite green tea boba that I've had! The drinks are a little pricy but are also huge, two people could share their smallest size! I also like that they offer almond milk at no extra charge, and white boba for an extra dollar that is 0 calories!!"}
{"text":"Jt Boba has never disappointed me in any of the drinks I've tried. Prices are good for the size of the drinks, plus having the app I get free drinks. The owner and employees are always friendly when we come in. Would defiantly recommend this place."}
{"text":"This is the first Boba House that I have visited and I have to say that I am impressed. This is a nice place with friendly staff and the smoothie I tried out was delicious. I look forward to coming back in the future."}
{"text":"It's a cute and trendy place, plus they have games to play, but the boba I ordered was too sweet. Since it's the only boba shop close to home I can't really complain but I had better."}
{"text":"Best place ! So many flavored and I'm trying to catch up to all of them ! I love it !"}
{"text":"The tea was excellent but it was a little over priced. Almost $6 is a bit high for a cup of tea. Also, the menu was quite confusing.  Biggest complaint...I Wasn't able to order on my own, menu too confusing."}
{"text":"One of the better boba tea houses I have found in The Valley.  Yep, that's right... right here in Phoenix!  So, take that Southern California!    So why only 3 stars?  Well, the reason for my 3-star review is twofold.  First, the prices are just too high for boba drinks, especially in the West Valley.  Second, the customer service is still just... lacking.  They have been open long enough to have worked out these issued , so it's frustrating as a customer who wants to see them survive.  And this is especially so since Bomboba has opened up a second location just a couple blocks away from JT and Bomboba has provided stellar customer service to me on EVERY single visit.  I know a big part of owning a restaurant is making enough money to pay the bills and enjoy some profit, but it's time to lower your prices a bit and stay competitive.  And... maybe bring in a customer service consultant to train the entire staff (and unfortunately, the owner too).  This really would be a wise investment.  So, with that out of the way, if you want a real treat, then get the taro pudding in your smoothie or slushy instead of boba!  I'm sort of in love with that taro pudding... like real love."}
{"text":"My favorite boba place, definitely better than BOMB BOBA, reason being, the atmosphere is lovely, the service is friendly, and the drinks are amazing !"}
{"text":"Probably the best boba place in AZ right now. They have a wide available selections of tea flavors. To top it off they have a great snack item that is a must try! Get the popcorn chicken!"}
{"text":"The worst Thai milk tea I've ever had, it lacked flavor and sweetness, couldn't even finish it! I went back a second time hoping that maybe they had an off day but no, gross!"}
{"text":"Always on the hunt for good boba and this one was really good. Tried the coconut cream and it actually tastes like coconut not fake or powdery like other places.  Will be going back to try other favors."}
{"text":"I haven't had too much boba tea, but the drink I had here was pretty good! They seem to have endless combinations and flavors... I can't wait to go back and try more."}
{"text":"Been here at least 4 times already. My favorite is my custom Coconut-Cantaloupe snow, with coconut jelly and regular boba. My mom loves the avocado-coco-pistachio snow with regular boba. The regular size is huge, which surprised me when I first got it. It gets pretty busy fast, but the workers are pretty quick about making everything. They have different types of \"creamer\" (almond, soy, lactaid, etc), so I think just about anyone can have something. Besides milk teas, they have herbal and fruity teas; as well as different types of lemonades. Also, they serve a few hot food items....though I haven't tried any yet. Love how huge their selection is! I've tried other milk tea places where you can taste a strong floral note in their green tea (which always vaguely reminds me of jasmine tea), but I haven't gotten that from JT Boba's teas.....which I prefer.  Give this place a whirl or two. They're awesome!"}
{"text":"I'm sure the boba is excellent here, but the customer service I received on my visit here is a huge concern. I came in on 5/24/15 around 1PM which the shop was somewhat busy, and was overwhelmed by the huge selection they had (in a good way). I ask the cashier if they had a milk tea flavor, and inquire a bit more, she immediately tries to rush me through the order and asks what size I want it in. I wasn't ready to order just yet, so I asked for a menu, which she pointed at one. After browsing through the menu, I get behind the customer currently ordering, another group also walks in. What really made me upset is that the cashier takes the order of the group behind me and completely ignores the fact I was next in line. I am very upset about this, and the end result is me leaving the establishment ordering nothing.   I've worked retail, and know that it's common courtesy to check in with your customers even when it is busy. Even more important to let them know you acknowledge their existence. I'm sure this establishment provides an excellent product, but the customer service is crucial as well. You let me down as a customer, and didn't give me the time of day, or rather you didn't appreciate my willingness to be a patron."}
{"text":"Best boba ever!!!! Love the variety of flavors and food and all the workers there are very friendly.... defenetly coming back ;)"}
{"text":"The cups are huge!! I already couldn't couldn't finish the regular size I don't know how I'd be able to finish the large! I got the JT ice milk with caramel drizzle, egg pudding, and regular boba. The first time I got my drink they forgot to put the boba in which was kind of upsetting. Also, they took forever to put the boba in my drink... The drink itself was good for the first few sips, but after awhile it became to sweet! The egg pudding was in little square which made it easier to drink. The boba was just right! Soft and chewy. P.s. check into Yelp and you get 15% off your order!"}
{"text":"Rosehips, milk thistle, goto kola, burdok, eye of newt, ...  Just kidding about the eye of newt. Looking at the menu, I thought I was taking Herbology at Hogwarts. *falls outta my damn seat*  I can't remember if I've been to JT Boba but I do remember coming here when it was Lollicups. Let's just do this review as a first time customer because if I have been here, it was years ago.  $7.08 for a cup of Linden Flower Buddha Tea with chia seeds and aloe. They barely put any aloe or chia seeds in it so what the heck. The tea was brewed fine and the amount of sweetness was proper. After a quick Google search though, I learned that for the price I paid, I could have bought nearly 18 teabags of this tea. What the flying fuc---! JT Boba, you are way overpriced, homie!   We came here because we saw that they had food. Imagine our surprise when we learned that they didn't serve food. Ugh. So really, there's no point coming back. If you're gonna be bougie, go relocate to Scottsdale. That's all."}
{"text":"I love this place on a weekday.  Friday to Monday morning forget about it.  They are in such a hurry to get you your drink they don't even bother to check what you ordered.  Talk about a waste of money if your allergic to something and they mix up the order :/  I ordered a Peach flavored black tea with rainbow jellies and I was ordering for my sister and she ordered a Peach flavored black tea with mango jellies well she ended up with two drinks and none for me.  I will not be going back during Friday or a weekend ever again.  This is the second time they have messed up my order on a busy day.  I'll just go back on a non-busy day."}
{"text":"The lady who works here is very nice but the owner is not a pleasant person, she's outright rude. Customer service here is sub par and is a secondary concern. Not coming back here again."}
{"text":"I just realized this place was right around the corner from me, and I've been searching for a boba tea place. The staff here is extremely friendly and helpful. The place is very clean looking and well decorated. The actual tea itself is good. I got pineapple milk tea. The only cons to this place are that it is a little pricey and, as mentioned before, the cups are oddly sized. I know that sounds stupid, but once you hold a large and get a good grasp on it, you'll see. Other than that, I'll be coming back."}
{"text":"Whatever they call Durian on the menu isn't really Durian. Maybe that was Jackfruit."}
{"text":"Best Boba in the West Valley. They have so many flavors to choose from and the atmosphere is great! Highly recommend this place."}
