{"text":"We get breakfast here almost every Sunday!  The staff are so sweet.  The French Toast is fantastic.  They put real fruit on top of the pancakes and french toast.  This place is bangin' for breakfast!"}
{"text":"For years, this was a go-to breakfast spot, but the quality of food has declined beyond the acceptable. These \"cooks\" can't even pull off an over easy egg anymore. Over easy eggs here = clear, snotty, uncooked egg whites and Over medium eggs = over extra hard with completely cooked through yolks. Why spend money on something you can cook better yourself?!"}
{"text":"a nearby neighboring business that I've eaten at multiple times - I like the quality of the food and the prices are reasonable for a downtown location - seating choices are varied but not overly crowded, service can be the only wildcard depending on who you get but all are friendly some of the waitresses are quicker and multitask better, good spot for business dress or for the casual student - favs are the southwest steak wrap and the French onion soup"}
{"text":"Restaurant opens at 8am, not 7 as sometimes posted. Food is great, chef is friendly and courteous, price point is also great for downtown Cleveland."}
{"text":"Ordered a large order for our company for lunch. I, along with my coworkers, were pleased with our meals. The salad are divine. Prices are a steal."}
{"text":"Great place to have lunch in downtown Cleveland. Located in the lobby of the renovated 100 yr old Statler Hotel (now luxury apartments).  It would seem very convenient for tenants too.

The food is mediterranean (Lebanese origins) and prices are very reasonable.  The falafel wrap is one of the best values.

Caution:  its hours are kinda goofy, because of the downtown business clientele.  Some days they're open for 3 squares; others only two."}
{"text":"i've not had good experiences at juji's.  and i even gave them the benefit of the doubt and returned for meals after the bad experience.
and each one was two thumbs down.

today i was there to meet my friend for lunch.  i ordered the grape leaves because...well, in my mind, how can you make a bad grape leaf?

well, you can.

things you learn.
by me."}
{"text":"I am giving this an extra star to get to two stars because the waitress of limited capacity seemed to be trying her best. We showed up with a group of 12 for breakfast on a Saturday morning. We were the only customers in the restaurant (red flag?). The waitress was quick to bring out water but it went downhill from there. 

Coffee came out and then the waitress disappeared for 15 minutes. We could actually see her talking to the cook not performing any duties. We had to go get her so that she could take our order. It took another 15 minutes to get the orders taken. 

:45 minutes later some food made it's way to the table. Slowly, each order arrives one by one. Two people got the wrong omelette, the pancakes were terrible. The Greek omelette was decent, it just took an hour from the time we sat down until the food arrived. 

It is a very basic breakfast menu that doesn't really offer anything special. The service was the slowest and least professional I have seen in a while. This place should be packed on a stir day morning in the lobby of an apartment building. Now I know why it wasn't."}
{"text":"The food was excellent and so are the prices. Decent variety. This is cafe style. You can get things to go at the counter or sit down restaurant style. The atmosphere is sort of a hotel restaurant feel. I do recommend this place overall."}
{"text":"This is shitty food. Period. Maybe the chili cheese fries are good.....other than that, it's just kinda shitty food. Sorry....."}
{"text":"Juji's Cafe is a diner-ish type of cafe located in the Statler arms building. They serve a variety of breakfast items and greek food for Breakfast and Lunch. 

Overall, the place is actually fairly decent! They have large portions and quick service. Their lunch items could be a bit tastier (looking at you... Spinach Feta Pie), but is priced adequately. And their breakfasts are pretty solid breakfasts. 

The thing I liked best about this place was they delivered food to your apartment if you lived in the Statler arms - made for a great Sunday brunch in bed!"}
{"text":"Convenience is convenience.  And for acceptable food at a reasonable price, you can't beat Juji's!"}
{"text":"I orderd a rice platter about 9.45 PM for delivery I was wating gor it about 1 hour and nobody came and worst part they did not even informed me that nobody is coming to deliver."}
{"text":"Horrible service. Staff is rude, including the manager and slow. The food is just \"ok\" waste of money...Never Again!!!!"}
{"text":"It's been years since I've been to Juji's.  I was pleasantly surprised.  Service was a bit laid back, and it took some time to receive my order, but all-in-all the food was fresh and tasty.  I ordered the daily special, which was the chicken caesar wrap with fries ($7.50  I substituted chips for fries.  The wrap arrived panini'd which I didn't expect, but was filled with lots of grilled chicken, which was seasoned nicely, accompanied by tomatoes (by request), romaine lettuce and caesar dressing.  I also had an opportunity to peek at dishes ordered by surrounding patrons, and those looked good as well.  Huge salads, nice sandwiches, good price point."}
{"text":"I originally gave it 5 stars for the tasty food and generous portions for the price. However, I've been back several times, and while the food is still good, I think I have to downgrade it because the service is always bad. Very slow, even when it doesn't appear that busy. Nothing particularly unique on the menu, which is mostly American and Middle Eastern. My fiance and I returned several times since it usually isn't busy on the weekends, and we lived right around the corner for two years. However, now that I no longer live downtown, I'm not compelled to return."}
{"text":"Standard crappy middle eastern food that is found all over cleveland. I really feel bad for the people who gave it 5 stars, they should head out to an actual city and try the real thing. The food here is just soaked in sauce to hide the lack of marination. It is cheap and edible though."}
{"text":"This is a pretty good, quick and relatively cheap place to catch lunch downtown. 

I've been there several times and have really never had anything bad. 

They have a diverse menu for a small diner. I've had beef and cheddar sandwich, Cajun chicken, burgers, fried fish, and different omelets. There's a lot more I haven't tried.

The food quality is good, better than what I'd expect from a small diner. It's not the typical greasy diner food. There's probably something on the menu that would fit most peoples tastes. 

The service is good, and the staff is pretty friendly. The place is kept clean. The weird part is that it's in the lobby of an apartment building. But there has never seemed to be a lot of foot traffic from the residents so it's not that big of a deal. 

I'd recommend this place if you are in the area and are just trying to have a quick lunch. It's not anything too special where you would make a special trip."}
{"text":"Juji's Cafe is a small diner operation in the lobby of the Statler building.  A selection of Mediterranean wraps and kabobs augments a pretty basic menu of salads, soups, and burgers.  The open-to-the-lobby layout reminds me of a restaurant you would find in an airport.  A cold draft can come across the lobby when the building doors open, which can be a welcome breeze in summer and a biting chill in winter.

I had the Smothered Burger (sauteed onions, mushrooms, and your choice of cheese with lettuce, onion, and tomato) with butter green beans.  The green beans were exactly what you would get frozen from the supermarket and microwaved with some butter poured on top.  Ordering the burger at \"medium rare\" didn't really make a difference with the frozen patty that ended up dry and mealy.  You would be better off grabbing a burger at Wendy's.  Total cost was $12.15 before tip and with an iced tea.

The low quality of the food merits a particularly low two star review; the only saving grace being that there is such a dearth of quality food options on East 12th."}
{"text":"Soooo good and super cheap too. I love how they deliver to my apartment on lazy Sunday's. I've ordered almost everything on the menu and it is ALL yummy. The Italian sub is my favorite for lunch and for breakfast it's all banging! 

The portions are very generous and u can be full off of $8."}
{"text":"HORRIBLE!!!!!
Ok I dont know what is going on here but I placed a BREAKFAST ORDER at 830 thru Grub Hub.. Promised delivery at 954. Then at 1030 or so it was revised to 1052 ( told this on text) now its 1115 AND STILL NO BREAKFAST!! I AM LIVID!! Talked to GrubHub now its 1130!!! Thats 3 hours after I placed the order!!!! Im literally shaking because my blood sugar has dropped from not eating. Completely unacceptable!!!"}
{"text":"Juji's is one of my favorite go-to places for a quick lunch. Food is mediterranean in flavor and I've never had a bad dish. (Well, the falafel can be a bit dry but it's still good.) For an extra treat, get the black bean salad....it's more delicious than it looks. Trust me, you be addicted to the flavor. In fact, I've ordered it to take with me to parties and there is never any left by the end of the night. Jump off the Euclid corridor train, err, bus and stop in!"}
{"text":"Be careful with ordering online. I live .7 miles away and live too far for delivery, despite Yelp saying that I live within range (and living within 1 mile). Where do they deliver to? On a positive note, the staff was quick to call and address the issue in a friendly manner. (But really-where do they deliver to?)"}
{"text":"I was looking for some good Lebanese food, as mentioned in the description. My expectations were not high, but this place really did not deliver. The tabbouleh was essentially cilantro salad. The falafel were horribly unflavorful and oozing with oil. I really wanted to like this place, since I live right down the street from it. But unfortunately I will not be back... I wouldn't waste your time or money here unfortunately. Just hoping that I don't get sick now..."}
{"text":"I don't know how this place got Yelp's Top restaurants in 2016.  This is my third time here and I have yet to be wowed.  The first two times I came I ordered Greek inspired sandwiches for take out.  The wait was really long both times.  A co-worker told me that it is best to call in the food before heading there especially around lunch time. He also suggested I try the burgers and stay away from their specialty sandwich items.  So I went there today for the third time - the weather is beautiful and I had time to kill so I didn't order ahead I just went on over.  It was about 11:15am, so before the lunch rush.  

Decor - restaurant seemed clean. Cheap table settings.

Service - wow, the lady at the register (short white lady with jet black hair) just seemed like she was totally confused.  She and the cook were going back and forth the whole time I was there trying to figure out a phone order and then she dropped the \"F\" word - right in front of me! Wow.  The waitress (an African American woman with a side ponytail and tattoos all over both arms) acted like I didn't even exist - no smile, no \"hello\", no nothing.  I was the only one there for take-out at the time so the food did not take too long to come.

Food - so I did order a burger this time. The burger could've been cooked another minute or so to get the medium I asked for.  It was rather flavorless but edible.  The fries were sad! I mean they looked like they sat in oil for days and then microwaved.  They were not appetizing to look at and also had very little flavor - they just seemed downright old.  For $8.00 it was completely not worth it. I'd rather drop $6 at McDonalds and get a Big Mac, fries and a drink lol.

I gave it three chances and won't be going back."}
{"text":"Juji's Cafe is located in Statler Arms Apartments building. If you do not live in there you will have to wait for someone to open the gate for you after 8 pm.

I wouldn't say that I had any great dining experience in Cleveland but I would say that Juji's is not that bad.
I had one of their omelets and it was good, the side, home potato, could've been better. Their steamed broccoli, though, was really good.

Their Salmon is no good and the cooked potato was not cooked enough. Their Falafel is over spiced, nothing like the good falafel would be which is as simple as salt-only spiced.

I have to say that they know their targeted market which is mostly Statler Arms Middle-eastern residents; they have a Halal menu for them.
However, I have seen some of those in the kitchen prepare food and it seems like bacon fat could be on any sandwich they toast(which is so not Halal)"}
{"text":"Worst felafel ever...totally dry.  I know felafel, I have one nearly every week for all sorts of places.  This one was extremely dry and tasteless.  All I tasted was parsley.  Where was the tahina sauce? It was presented in a \"wrap\" form not in the typical folded over pita bread style. After two bites it went into the trashcan. For a place that specializes in Middle-Eastern foods I am highly disappointed."}
{"text":"They have the worst food ever it has no taste at all no salt and the cashier very rude you feel like they give you the food for free if you don't believe me try it and you will see even subway much better"}
{"text":"**Edited and downgraded a star to reflect the fact that while they offer/promote calling and placing carry out orders, the man who I presume owns this place is always extremely rude about it when he answers the phone. 

This place was unexpectedly good! Weirdly dead when we went for brunch on Saturday morning, but sometimes downtown can be hit or miss like that. It took us a while to get seated - the one staff member was sweeping and weirdly ignored us after making eye contact - but eventually we got to sit down. I got a three meat omelette with rye toast and potatoes and it was AMAZING! The potatoes were crisp and well salted, and the omelette was good as well. It was also really affordable. This is a great choice for some quick, easy, affordable breakfast!"}
