{"text":"We stopped in for a quick bite after a day of baseball. Fish tacos were tremendous. The Ahi Tuna salad was consumed by my son. My Mahi Mahi sandwich was great.

Side of Asparagus was tasty. 

No chips available - it was July 4th.
Fries a bit greasy. 

Our server Ryan, was patient and attentive. 

We will be going back!"}
{"text":"Wonderful restaurant for food poisoning. Ordered the salmon and within 4 hours was violently vomiting whole chunks of fish. I spent the whole next day only able to eat Jello without throwing up. Staff seemed condescending, although the environment was fantastic. Girlfriend's dinner was fine, but I will not be going here again."}
{"text":"My husband and I have been going to juniper grill at least once a week for over a year now but recently notice that the drinks have been very weak and and the martini's are not full to the rim...when you are paying $9.50 per drink I would like the glass to be full....... martini glass's are not that big to begin with and would like some liquor in it!  Food is good but I can still can get a good meal and better drinks else where for a better price so I guess we will skip juniper grill for a while."}
{"text":"Rude wait staff and a complete waste of my time. Food was okay but unbelievably disappointed."}
{"text":"This a really nice spot for a nicer dinner. Have not had a bad meal here yet and the service is always steller. Lovely atmosphere. It is a smidge pricey, but you get what you pay for. It's always a wonderful experience coming here."}
{"text":"Really great food and drinks!  I have enjoyed lunch and dinner at this location.  Highly recommend the brisket quesadilla, fish tacos, and salad with bacon dressing!  We have never had a bad meal.  Only issue is it's a little pricey - but so worth it!"}
{"text":"Highly recommend the Raspberry Bellini Martini and BBQ Brisket Quesadilla! Love the atmosphere and have always had great service!"}
{"text":"best restaurant in mcmurray!!"}
{"text":"Our group of four came in for lunch and enjoyed everything - the food, atmosphere, and service were wonderful.  I highly recommend it and plan to go back again."}
{"text":"Fabulous food and service to match!! Salmon was off the charts awesome! Strip steak melted in the mouth tender!! Incredible dinner without the stuffy, pretentious environment or staff! Far exceeded our expectations! The atmosphere is comfortable, elegant & classy (and super clean!) the staff are over the top fabulous!"}
{"text":"This is our first time here. Upon pulling into the center we were easily able to find parking plus there was plenty of additional parking for other cars.

The first impression upon entering the restaurant was excellent modern tasteful and classy but not overdone. We were greeted by a nice hostess who quickly sat us to our table. We sat right in front of the kitchen and had a nice view of all the food coming out of there.

Our server immediately came over and provided us excellent service throughout the entire meal. Her name was Laura and she was excellent.

She gave us a great description of the menu and really made some really good recommendations. We started with the chips and salsa and guacamole. The guacamole was homemade daily and you can easily tell that it was fresh.

My wife had the three fish tacos in the portions were huge. Instead of the rice and beans she had the fries which word fresh-cut fries and were delicious.

I had the fish special which that day was tilapia with a lemon herb sauce. It was perfect.

We also shared their famous cornbread which was the star of the night.

We're looking forward to our next trip back."}
{"text":"I've had better. . . or maybe I get bored easily. One page Tex-Mex menu & a just little pricey comparatively, unless of course you like to overpay for \"average\" Great atmosphere with nice decor and decent service.  Simply just not enough to make me want to go back again"}
{"text":"Great food every time I eat there !  I love the fish tacos and they have the greatest burgers in the area. I love the wine list and fun drinks"}
{"text":"Food is fabulous. Flies were horrible though. Excellent service. Had my fave single malt scotch"}
{"text":"I am truly shocked by the good reviews and the credit that this place has received. Last week I tried Juniper for the first time, especially after knowing that Atria's owners are also the owners of this establishment. 
First we waited to be seated for about 10 minutes before someone acknowledged our presence. Then, we got seated at the bar area while there was seating available in the \" dining area \" as well. No problem so far and no reason to start complaining because the worst is yet to come. 
After our humus appetizer, which was quite ok, we ordered the chicken sandwich and the fajita. The sandwich came out with overly blackened chicken that still had the taste of burned charcoal after flushing down an entire glass of water. The waitress acknowledged this and friendly suggested to order something new. My wife's order came to the table after about 5 minutes and to our surprise the cheese on top of the shell was cold, as well as the inside. I quickly turned to the waitress and canceled my order. I wanted to pay for the appetizer, but a very friendly manager would not let us, and offered us a 50 dollar gift card. I have to say that management handled the issue very professional, but the experience was still below expectation. Two stars for professionalism and that' s all they get! Stick with Atria's across the street!"}
{"text":"Love the atmosphere and the bar and that is about it.  Believe me I want to love this place because we need more places like this (non-chain, modern dining) but the food is not good at all.  If you want to meet a friend for a drink this is the perfect place then go somewhere else for dinner."}
{"text":"I have been here a couple of times and the food and drinks are always good. A little pricey, but good."}
{"text":"I went back a second time and it was much better.  The Brisket Sandwich was delish!  And the homemade BBQ chips I could sit down with a beer and munch on for Happy Hour.  But they are very salty for those of you who are watching your sodium intake.  But...that is also why they are so frickin' good.  I heart salt.  The food came out faster this time as well and they were still very busy.  The outdoor seating area is going to be amazing come warmer weather!"}
{"text":"Favorite place. There is just something about driving away from the city and going somewhere that should be in the city yet its not. Its not fancy but I took my fiancee here for Valentines Day and it was the place I took her for dinner right before I proposed to her. If you're not picking up on it yet this is our favorite place. Food is great from salads fresh, great appetizer selection and their meats are cooked perfect every time. I recommend the chipotle skirt steak or the brisket. 

Lots of seating and during the summer they have a roofed deck area where you are practically over the lake. Not that canonsburg lake is anything fancy but its a nicer view than a parking lot or road lol. Staff is friendly and on the ball. Drinks are cold fresh and well priced, as is the food. You won't be let down."}
{"text":"Great go-to for nights when you don't want to cook. The rotisserie chicken salad with bacon dressing is bomb, and I love the seafood enchiladas, very rich."}
{"text":"It saddens me to have to give the two stars. Juniper is a place that we would come to for excellent fare and usually excellent service. Today at lunch however the trail derailed. My wife ordered the California Burger which is her go to every time. A Cheddar burger came out instead and our server seemed to be implying that it was us placing the wrong order. She offered to correct it which she did by bringing out a rebuilt version of the burger. I get food costs, but if I made a wrong order at my establishment I would not scrape of product and \"rebuild\" the burger.  A new burger would be made because it was an error on my behalf.  I thought that this could have been handled a little bit better."}
{"text":"Hadn't been there for a few years. Much improved menu and really enjoyable. We'll be back!"}
{"text":"Really disappointed this time around. I've been there in the past and it was delicious,...wow they went downhilll. Despite the bad experience, the server was friendly and efficient. 

We ordered the cheesy bacon dip for an appetizer. While chewing, I noticed there was something crinkled in my food. Upon spitting it back in my napkin, it was a large crinkled up receipt or paper of some kind. To make matters worse, I swallowed part of it, yuck! Absolutely disgusting!

It was taken off our bill, but the manager did not even come over to the table. One would think with this being a  health code violation, he or she would have stopped over. The dinner we ordered was mediocre. The grilled asparagus was still raw. Someone in their kitchen should return to culinary school.  Poor customer service. Will not be returning."}
{"text":"The entire waitstaff was talking, eating etc. while we were suffering through uneven service, no dressing on two salads, delays, etc... this was actually one of the worst dining experiences I've had and I eat out a lot.  food was average at best. Not coming back, ever."}
{"text":"This place was good, well thought out design. Someone complained that this place was really loud. I didn't think so and the place was pretty full. I tried a little bit of everything that my friends had and I ordered the BBQ beef brisket. I thought that my brisket could have been better because I like the flavor of smoke meat.  It was lacking in the smoked flavor department, I just tasted possibly liquid smoke, so I smothered it in BBQ sauce and thought it was worth what I paid for it. The brisket was also very tender. MY friends dishes; Fish Tacos really good, Chicken Enchilada delicious! Shrimp flatbread appetizer was very good, and the Guacamole was pretty good as well. The drinks we order from the bar were also executed perfectly. I also thought that the waiter we had did an awesome job, he was so on top of stuff that we almost felt rushed through our dinner.

 I think that in a place like this there is always room for improvement that is why I only gave 4 stars. The price of the meal was moderate but didn't think it was overpriced by any means but a little bit presentation of the entrees might make people enjoy their meal even a little bit more. I think this place has the right idea with quality not quantity. I will go back in a few months.

Good Place!"}
{"text":"My girlfriend and I are visiting the Pittsburgh for a few days and we wanted to find somewhere nice; Yelp pointed us towards Juniper Grill.

We decided to live the whole experience that Juniper had to offer. We started with their sipping tequila, had some guac and chips (really great fresh guac made in house!), we shared a bottle of wine, had some brisket, ribs, and accidental \"over order\" of corn bread (which was the best accidental over order.) We went for the whole experience and got dessert as well, the Chocolate Layer Cake and Chocolate Pecan Pie. Both were quite nice.

The ambiance was nice, the service was good, the food was flavorful, the price wasn't too high. I would recommend this restaurant to anyone in the area as a worthwhile stop."}
{"text":"This is a great restaurant with a patio that overlooks the water. Our table started with the hummus & grilled pita and the guacamole and salsa with chips. The hummus was creamy and not too garlicky.
The guacamole was freshly made and just chunky enough, making it easy to scoop up the deliciousness with the chips.
The table had the Amish Chicken (huge portion), Steak, Mahi Mahi and Grilled Romaine Salad with Chicken. There wasn't a bad meal between us. We also shared the Skillet Cornbread. This is a must have, for any cornbread lover.
We finished off the meal with coffee, a rich Triple Chocolate Layer Cake and a tart Key Lime Pie.
My only complaint was the location of our table. Not because of what it was near, but what was not close enough. We were one of the only tables without a fan above us.  On a muggy day like today, I would recommend the indoor seating."}
{"text":"We've eaten at Juniper Grill perhaps a 1/2 dozen times.  The most recent time for us was a few days ago.

Juniper is one of these places that seems to do everything right, but just lacks the extra zing or the extra punch to really put it over the top.  I can't quite put my finger on it, but it's definitely tangible each time I'm there.

This most recent time, the Filet was incredibly tender, had a great sear, and was flavorful.  It was slightly underdone for my preference (and I asked for it one-step above my normal...) but is most forgivable.  Let me repeat that it was TENDER!! I grabbed my butter knife by mistake, and noticed that I had no trouble at all going through this steak! Fantastic!

The salmon was tasty but nothing to put it over the top.

The appetizer, a brisket quesadilla was good and spicy -- but just seemed too flat.  You've got to get more of the bbq brisket in there.  These things should be overflowing.  If they fall apart, then so be it!

The prickly pear margarita was great, especially with the salt on the rim.  I could have drank five of those. (but only had two!)  The wines were reliable.

The service was good, friendly, and fast considering how busy they were.

I've had the fish tacos on numerous occasions and they are great.

Juniper can be on the expensive side, but it's a nice place.  Nice chairs to sit in if you have to wait for a table.  And a nice covered patio which is great when the weather cooperates."}
{"text":"Juniper has really good food! It is close to southpointe, so I've eaten lunch here a few times. I find the menu is a little pricy for lunch, however, the food never disappoints. I like to sit in the back of the restaurant which is like an enclosed deck. The salads are large and the corn bread is delicious! Parking usually isn't an issue since they the lot wraps around to the back. I would recommend Juniper as a nice lunch spot for work. I can't speak for dinner as I've never been there during dinner hours."}
{"text":"Lunch or Dinner - have great food for either. Indoor and outdoor seating good location with ample parking. Probably the best CORNBREAD you will ever eat ! You just gotta try it, its truly amazing ! The service is good as well."}
{"text":"Very good! Had the ahi tuna salad. It was delicious, full of mango and avocado. Decor was nice and the seats at the bar where comfortable (that's important)."}
{"text":"Love the bar maid Lauren! She's fantastic, killer good time and makes a hell of a Long Island! Food isn't to die for but if ur looking for a few pricey drinks and a nice bar maid to talk to, this is the place! Most of the staff make that place!"}
{"text":"One of the better places to eat in the South Hills.  I have been here numerous times and never have had a bad meal. 

Salmon was great. 
Ribs are very good
Fish Tacos are always very good

Very reasonable.  

The only issue is the menu does not change at all.  Change it up every once in a while."}
{"text":"Stopped here on our way back to Chicago from East coast. Enjoyed the atmosphere. Wood-fired grill made the restaurant smell delicious. Our table had: chicken pub \"burger\" & garlic broccoli, California burger, ribs, & fish tacos. All were delicious.
Handcut fries with the burgers were great. I enjoy fish tacos with some crunch, so slaw would've been nice on them, but otherwise they were great--sautéed tilapia, mango salsa, sauce with a little kick to it. Prickly pear margarita was tart and yummy. Husband really enjoyed the local brew Fathead IPA. Place was busy on a Saturday night, but service was still great from our server, Patrick. Great experience--would come again when in Pittsburgh area."}
{"text":"Great food and great service.

I had been meaning to try a Juniper Grill for a while now. Being that they are the sister restaurant to Atria's I knew I would like the food. During a recent lunch date my wife and I decided to check them out.

Once we enter we were greeted by the very friendly hostess. She noted our reservation and took us to our table. the decor is very nice with lots of dark wood and there is even a patio to enjoy the warm summer weather while it lasts. A few minutes later our server Paige came over and offered us drinks and told us about the days specials.

The menu had a lot of great choices including, beef brisket, burgers, chicken, enchiladas, quesadillas, baby back ribs, short ribs, tacos, seafood, steaks and salads. They also have an extensive Gluten Free Menu for those of you that need it.

We both went with the Rotisserie Roasted Chicken & Avocado Salad since we were trying to be healthy. The salad was absolutely delicious. The chicken was seasoned and cooked perfectly and was full of flavor. The dressing was very tasty as well. I really liked the cornbread crotons. What a unique touch. I will have to order a skillet of cornbread next time. One cool thing is that you can pay your bill right from your smartphone!

The couple behind and across from us each had someone at their table order a burger. They both looked epic and have been put on my to do list on a return visit.

My only complaint is that there are only two Juniper Grills. This one and the one in Cranberry. There are a ton of Atria's so please open more Juniper Grills."}
{"text":"Good dinner, had chicken avacado salad.  Waiter was very attentive and it was a nice experience."}
{"text":"I've been to Juniper Grill twice; once for a midday business meeting and once for a family dinner.  Both experiences were great.

The first time was at lunch for a meeting.  The restaurant was a quiet enough setting for a meeting, despite the fact that there were a handful of other tables nearby occupied.  I had the fish tacos, which were great.  They were light (grilled, not fried) and fresh.  The fish was cooked perfectly and the toppings and garnishes were fresh and complimented the fish well.  And despite being very simple, the rice and beans that accompanied the dish were very tasty.  

My second visit was to celebrate my birthday with my wife, infant daughter and my parents.  We were worried about taking our daughter out to a restaurant for the first time, as we did not want to be a distraction to other diners; however the hostess was able to put us at a more remote table and was very accommodating.  This time I tried the half Amish roasted chicken.  It was amazing; extremely moist and perfectly cooked.

The decor and atmosphere are also great.  It is very classy and upscale, yet still comfortable and casual.  From what I have heard, the outside dining in the summer is great, but I have only visited during the winter.  When it is cold, the windows are closed and gas heaters warm the porch area, which is still a great place to eat, even when it is cold outside."}
{"text":"Took a friend who suffers from celiac disease to Juniper Grille for dinner and drinks.  Very pleased with the care they took preparing and serving celiac friendly menu options.  More than half of the menu items were gluten free.  Highly recommend this as your go to celiac friendly restaurant in Peters Township.  The corn tortilla chips and guacamole dip appetizer was outstanding."}
{"text":"Probably one of my favorite restaurants around. Preparation always on point and consistent which is important to us.
Atrias did it right with this concept. Awesome Moscow Mules and their tacos are to die for."}
{"text":"We went here on the suggestion of my brother and sister in law.  I had hummus and street tacos, both very good.  We also shared a cornbread and it was ok.   Service was adequate.  Everyone in my group enjoyed their meal, so I assume they had no complaints.  If back in the area, would consider this place again ."}
{"text":"Went to Juniper Grill for the first time with a girl friend on Saturday. We had a 6:00 dinner reservation and were seated immediately. I love that they had some unique beers on tap, they also had a tequila sampling menu and several other upscale alcoholic choices that I did not expect. I would consider the menu to be Mexican/American. Lots of barbeque and taco/enchilada choices. I had the Choose Two Barbeque Platter with ribs and chicken. I also had a salad with the ginger vinaigrette. The meal came with a small side of cowboy caviar (black eyed pea salad/salsa type dish) and fries. I'm a barbeque fan, and found my meal to be delicious! My friend ordered the Amish Chicken, but they were out (it's a popular item, but they have a limited amount of servings per day), so she when for a smoked chicken sandwich and thought it was very good as well. She had the grilled pineapple Mojito. I'm not a big fan of sweet drinks, but MAN that thing was GOOD! I plan to go back in the very near future with my hubby for a date night...and I'm hoping to grab a seat on the patio!"}
{"text":"Excellent atmosphere. Fast and attentive service. Reasonable prices. Short wait for your meal. I ordered the chicken & avocado salad and it was one of the best salads I've ever had in my life! It was a medley of colors, flavored and textures. The size was also very generous for its $13.50 price tag. The corn bread is a must try as well. We finished the meal off with key lime pie, which was light, creamy and aesthetically pleasing. This was one of the best meals I've had in a long time. I plan to be back."}
{"text":"A real mix. Four dinners, three ok one cooked poorly. A grilled salmon that could have been used for shoe leather. Would have sent it back but the waiter was so absent that never had the chance. When they cleared the table, I told them the salmon was bad and the manager took an appetizer off the bill but not the poorly cooked meal. A disappointing dinner experience. Too many other good places to eat nearby to go back here."}
{"text":"The food is really good, and the atmosphere is lovely. However, twice now, the same male server has waited on us. Both times his demeanor had that of a patronizing tone. I will ask for another server, if I go back."}
{"text":"Great new place. The decor , food and service were outstanding. I had the prime rib sandwich...mmm. The bar area is very trendy. This place has an open air patio that overlooks Cannosburg lake in summer and the restaurant has it enclosed during the winter. Great view."}
{"text":"Really good place for lunch or dinner.  Food is very good, service is as expected in this kind of place, and the location is convenient.  The wait staff is excellent!  You definitely need to try it if you haven't already.  The roasted romaine salad is outstanding."}
{"text":"Have been here multiple times and always have great service when I come here. Usually come during odd hours like after a midday Pure Barre class around the corner or later at night, so I've never had to deal with crowds or feeling rushed. I usually order the rotisserie roasted chicken with avocado, which is huge! I really love the dates in it. The last time I had it, however, it had too much cheese...and I love cheese. I love the chicken in it, so at dinner last night, I decided to order something else--the Pick Two with baby back ribs and the rotisserie chicken. The ribs were very good and tender. But I didn't care too much for the chicken. It was pretty tough, so I'd probably get something else next time. I love the cornbread that came with it, though. I sometimes don't order it at other places because it ends up being dry. But at Juniper Grill its very moist and delicious. Hoping to try their cornbread dessert sometime. Also they have amazing drinks like the jalapeño margarita or their fruit mojitos. Always have a good overall experience here and will be coming back."}
{"text":"Went on Saturday night, another successful night out at Juniper!  Great food, great drinks, great atmosphere. Amazing cornbread, I would suggest you start there. I had the special trout, delicious and I love that they don't over do it on portions. 

What was exciting is that we where one of the last tables there and never once did we feel pressured to leave.   We will be back soon!!"}
{"text":"Really good food! Tried the bison burger and potato salad myself and my coworkers had the fish tacos and veggie enchiladas. Everything was delicious - recommend the fish tacos most. After dinner, we all ordered a dessert: one chocolate pecan pie, one key lime pie, and one strawberry shortcake type dessert made with cornbread and a multitude of berries. I would show you how beautiful they all looked, but we gobbled them up so fast all I got a picture of was our cleaned off plates. The only complaint about the night was the slow service. In part they were busy, but I also think sitting right up front at the first table by the door didn't help. The waitress was very sweet and made good recommendations - she just did not get refills quickly on our drinks. Then we waited on our checks. When we finally got our bills, everyone at the table handed her our cards right away. Unfortunately she bussed a couple tables over with them under her arm instead of taking care of our tabs.  Regardless, while I was not super impressed with the service, the Food was definitely good eats!"}
{"text":"For the money paid, it was barely average. I had filet special. It was very bland. The vegetable medley with cheese bake was room temp. The cheese looked like it had been sitting for a while. The waiter, while very polite, was very difficult to communicate with. His English was tough to understand. Atmosphere was good except for the arctic blast we felt every time the front door opened. But really, it all comes down to food and service. Service was less than prompt, food was average. Sorry Juniper Grill, not sure if I'll return."}
{"text":"This place is amazing. We needed a place like this in the area. Get the cornbread. It's the best in the world. Great service, good drinks, better food!"}
{"text":"I had the pleasure to have lunch here a few times. I loved that with yelp check-in I got a free appetizer (chips and salsa). Thank you for that! I also ordered the fish taco for main course. Two turned out to be more than enough. I couldn't even eat dinner later because it was so filling. The place is pretty and clean, service is good. We were also there in a pretty slow time. The only thing I didn't like was their coffee. I had one sip and just couldn't drink it. I have to remember next time I go there not to get that."}
{"text":"Juniper Grill is the most recent addition to the restaurant scene here in McMurray, PA, if McMurray, PA can be said to have a restaurant scene. I went with my husband for dinner one night, and it was fairly bustling, although we were early enough to avoid the wait. I had the tortilla soup and the street tacos, and, of the two, the tacos were a winner, very authentic flavors and very good corn tortillas, while the soup was just OK. Hubby had the pulled pork sandwich, and was not impressed...said the sauce was too sweet and the roll they served it on did not go with the other flavors in the sandwich. I'm looking at the menu on line, and I don't see that sandwich, so maybe they pulled it.  It was good enough that I will go back and try more of the menu."}
{"text":"Good food with nice service. Described as a little more upscale Friday's or Applebee's. Seems appropriate. Well accommodated our party of seven in a comfortable atmosphere. Maybe not the first place I would think about but a solid place to eat and visit with friends and family."}
{"text":"I was here last Thursday and was extremely disappointed in my experience! My food order was wrong twice. The server was rude and only came back to drop off the check! The manager was rather snarky and not very nice about the entire situation! In the past, I have enjoyed this restaurant but will not be going back anytime soon... No so much because of the errors but because how it was handled!"}
{"text":"Nice casual place for a date night or special celebration. Food was wonderful it was a dinner for work that brought us here and both myself and burly fiancé loved the food. Cornbread was delectable and worth the extra to  try as well as Sarris  ice cream for dessert. Decor is modern and inviting,  views are very beautiful. I would come here again and if traveling thru would not be sad to stop here again. Very nice place keep up the good work. Staff were hospitable and well trained as well as clean and respectable and knowledgable of specials and menu. I like a well groomed staff and this place didn't disappoint. We took 2 to go plates back to the hotel and ate them for breakfast. Adequate portions of modern fare."}
{"text":"Awful. Bland in every sense of the word. If beige was a flavor, this would be it. Food is under seasoned and unimaginative.  The staff couldn't be less interested."}
{"text":"Love this place for lunch & dinner. Very swanky interior, but casual feel. Food is excellent, love their grilled fish. Extensive drink list. The The Raspberry Bellini Martini is a must have drink."}
{"text":"Awful service, mediocre food. 2 colleagues and I were quite disappointed with the service we got at juniper grill on
7/7/14, the ambiance is nice but wasn't enough to compliment the unwelcoming host, the terrible waitress and the unsalted food. By 6:30 pm they were sold out of Amish chicken. In my perception if the first item on your entree menu is sold out in 1 hr it means you're not making enough. They don't serve dinner rolls either but don't ask for cornbread because it will come out at dessert time instead of with your meal. Fish tacos had no salt, no lemon served with it and waitress doesn't revisit the table after our initial bites to see if anything is needed. The meal just looked pretty just like the staff did but both left more to be desired."}
{"text":"My daughter's wedding shower was here recently. It was on the porch and was beautiful. She had white linens and pink napkins. There was plenty of space for extra tables and gifts. You could come in an hour before to decorate. The staff was super and the food amazing! We had 37 guests, but could have comfortably fit at least 50. For an appetizer we had the cornbread, chips and salsa. Also had an open bar. For the buffet we had chicken, salmon, asparagus, mashed potatoes and salad... all excellent. The bridesmaids provided a cake, but it was served with vanilla ice cream. Coffee, drinks and anything guests wanted were brought quickly. It was very casual yet professional. I would highly recommend! Ask for Beverly."}
{"text":"I went here it knowing what I was getting into beside a small wait on a weekend evening. The fish tacos is what I ended up ordering. An Wow! I couldn't eat the fast enough."}
{"text":"Do not stop here for a quick drink and a bite to eat. The bartenders here sit around and chat while the bar is a mess and unkept. Looks terrible. Very slow service. Who would want to eat around all that filth while the bartender just stands around chatting to their friends about her kids and soon to be baby. What a mess...

Now if you get a table and want to eat, the food is very good. Just looks like your typical place where the bartenders run the show with no management overseeing them. Makes it easy on your pocket though. No need to tip much.

Won't eat at the bar here again. Franco's, Bistecca, or even Anthony's are way better options because of the much more attentive staff at those venues."}
{"text":"It was a really great experience. Food was on point and the service was phenomenal. The waitress was attentive and concerned with our dining experience by making sure we were happy the entire time. She never let our drinks go empty, the restaurant did not allow for plates to collect either. It was a real shift in service after eating at the Olive Garden the night before. 
Food was all delicious and correctly cooked with everything we wanted. We already plan on returning again and we are recommending it to all of our friends and family. 

It went from 5 stars to 1.  Waitress was not allowing us to switch sides, which damaged my view of the establishment. This was my go to \"fancy joint\" but after how I was treated the last time, after trying to order their more expensive menu options-- not going back. I wanted to switch the squash with mash potatoes (which is cheaper than squash) and the waitress told me I couldn't, she Absolutely would not budge. No manager was to be seen, not one asked how we were feeling, which I would have told them then. Also emailed their restaurant and got no reply. Still no reply after weeks. They DONT CARE."}
{"text":"Great atmosphere, fresh menu items at a reasonable price. They also have an extensive drink menu."}
{"text":"On April 15th my fiance and I picked a spot for dinner that he and I had never been to before, Juniper Grill. I made a reservation because it was his birthday and had read some great reviews online. Sadly this is not at all what we encountered once we arrived and ended up leaving the restaurant before we had even ordered because our experience was so bad. 

We arrived at 8pm for our reservation and were greeted by three high school girls who were not friendly, acted as though they wanted to be anywhere but work and didn't really know what they were doing. I asked one of the young ladies if it was possible to sit in the outside area since it was our first time there and we were there for a special celebration. The oldest looking one gave the most annoyed response telling us she wasn't sure there was anything available because they were expecting a large party. She then offered to go look and when we took her up on her offer she gave us a look and walked back to the outside area, as slow as she could, to check. She finally came back and told one of the other girls to seat us. So, because we had asked about outside, and the girl had gone to check, we assumed we were sitting outside since no one said anything otherwise. Halfway to our table the girl turns to us and says \"there are no tables outside, so this is your table\" and seats us. Wouldn't you think that since we requested they go look for available tables you update the customer before taking them to a completely different table than what they had requested?

We were seated in a booth that was large and would have been okay for the evening except it was halfway between the dining room and the bar and right next to the servers station where they input food. The table ended up being extremely busy with people going by and the servers station became extremely  backed up causing servers to basically be in the booth with us. At one point a high school aged server had his arm across the entire back of the booth and was swung into the seat of the booth while talking to another server- had zero care that there were customers seated. Then another server arrived and somehow tossed a used napkin onto my fiancé (I wish I was kidding). The server was clearly not going to say anything until my fiancé picked it up and gently threw it back at the server in which the server just laughed. Our server was alright but, again, seemed annoyed and like she wanted to be anywhere but there. We ordered waters and she threw down the straws like we were a pain and then disappeared for a very long time before coming to check on us again.

At this point I was fuming. I was trying to take my fiancé out for his birthday, do something nice and not one thing had gone right. We were both excited about the restaurant but both of us were beyond annoyed by this point. As I tried to take a deep breath and enjoy the evening I witness the same high school hostess walk by us with a party of three and seat them on the patio. At that point I had had enough and my fiancé and I decided to leave. We had been ignored and disrespected and were not going to continue to sit there.

We ended up leaving and going to Atria's across the street (which I would highly recommend) where we sat outside and were treated with the utmost respect, as a paying customer should. They heard it was my fiancé's birthday and went out of their way to make it special.

I was appalled by the service at Juniper Grill and decided to write to the management the morning after our dinner. The manager of this location was quick in her response and seemed apologetic. She offered to send us a gift card so we would return and experience the restaurant in a positive light. She also promised to speak with her staff about our experience. Because I had been excited to try the restaurant I was optimistic about the idea of going back and hopefully having a different experience, however, I never received my gift card and never heard any more from the management after my initial complaint. I am not writing this review to complain about not getting a gift card but to warn people about the service of this place and to underscore how little they care about customer experience. If they had been concerned about my experience and really wanted us to come back, they would have been certain to do everything they could to make us happy...including putting a gift card in the mail. 

I would never recommend this place to any family or friends and would warn others before they stop by for dinner."}
{"text":"I like almost this entire menu. 

Some of my favorites are the salads though. Ask for a steak knife with the brisket salad. 

If you are into carbs, try the cornbread. 

The chicken tortilla soup is outstanding. 

While I'm usually here for lunch, they have a good drink menu and dinner options too."}
{"text":"Stopped in once. More than enough! Seated well after reservation time and was not given the outside seating we reserved even though several seats went empty on the patio for our limited stay. Waitress was uninterested in us and took forever to take our order. After a table mishap that lead to spilled water, our waitress brought us one extra napkin, went to get more water and did not come back for 15 minutes. Honestly, I am not sure if she ever did come back because after those 15 minutes we left without any attention from any staff! To say I was disappointed by this experience is an understatement but I will not make that mistake again. Sadly I had to give them 1 star since 0 stars was not an option!"}
{"text":"I've eaten here twice and both times have been very happy.  First time I had the fish tacos and the second time the grilled chicken caesar salad.  Both were excellent.  The cornbread is also very solid.  Service is good and the back area is a nice outdoor experience in warmer months and a good enclosed area in the colder months.  The atmosphere is good enough for business meetings, dates, or a family dinner."}
{"text":"It's refreshing to have a non-chain restaurant in the McMurray area (even though I guess it's technically part of the Atria's group). 

Pros:  The street tacos - they are listed as an appetizer, but are perfect for dinner and are delicious.  The french fries.  The wine list - it goes a bit beyond the Yellowtail type of offerings by the glass.  

Cons:  The noise level - I've been three times, all in the evening, and it's always been incredibly loud.    The price point - for what is basically tex-mex food, the prices are high.  

I'd highly recommend making a reservation.  We went without one and had to wait nearly an hour to be seated on Friday night.   This may improve when the weather is nice enough to have the patio open."}
{"text":"The service is very good, and you can make reservations via opentable.  they have a number of signature dishes,  I recommend the Brazilian beef skirt (\"churrasco\").  Great bar area and happy hour.  There is an indoor and a covered outdoor section.  Prices are not on the low end but not too expensive either - I average $60 for two including several glasses of wine."}
{"text":"Stopped in for lunch . Had cheeseburger Ff.  Bun was fresh but quality and taste of meat seemed cheap.. grissley and lacked flavor.. nice atmosphere. .. The bill was15.00...   fries were greasy. Nothing really special potatoesalad was too much mayonnaise   Won't be eating there anymore nothing special. Too many other good places to eat"}
{"text":"Pros: atmosphere was great. We were seated on the patio and enjoyed the ambiance as the sun set. Cons: food was bland and lacked salt and seasoning. Our server was disinterested in us. I wanted to like the place more based on its atmosphere but it really fell short."}
{"text":"In the mood for a FAT sandwich? And no, I don't mean Phat, as in good. I mean fat as in globby, gross, inedible animal fat. Well if that appeals to you order the Beef brisket sandwich at Juniper Grill. It has a thin 1/8th inch layer of beef, with another solid inch of fat on top, covered in BBQ sauce, lettuce , tomato, and horseradish sauce. Yum. Complimenting the fat sandwich are some fresh cut fries, served cold. A meal fit for a King- assuming King is the name of your dog."}
{"text":"Ate here for the first time tonight.  Heard good things so decided to try for ourselves.  Nice ambiance.  Seated directly under a large bose speaker in the back and could barely hear our server Manny.  Service and food was good.  Had Fish tacos and a burger and fries.  All were good.  Don't go for the 3 tacos for 2 extra bucks as two were plenty especially with the large side of drunken beans and rice.  The A team bartenders must have been off tonight as the Amaretto sours was straight up sours and my negroni was a large ice cube in a small glass with no orange slice.  Wouldn't complain but my drink wasn't 11 bucks so should be done correctly.  Give it a try as may be better on a night other than Monday but we probably won't go back."}
{"text":"Not our favorite on any level. There are several better places nearby. We tried their creme bulle and it was just wrong. The custard was runny with lumps. The crust was way too thick. On the plus side the service was good, but not great. The place can handle larger parties and the noise level is tolerable."}
{"text":"We went to Juniper Grill last night for dinner - we had made a reservation for 7, but that doesn't mean a whole lot on a busy night there - we still had to wait for almost a half hour.  But after we were seated, our experience got significantly better.  We started with the shrimp cocktail which was pretty run of the mill, but we also got the street tacos which were completely out of this world!  Soft, savory, sweet and spicy, they were incredible.  They had a hint of shaved coconut on the top, very original and delightful!  Next, I got the short ribs which were nothing short of awesome and my husband got the chicken enchiladas, which were delicious, I mean just awesome.  And the portions are deceptively large, we were full and I mean full!  But the highlight of the evening was the incredible, delectable cornbread - it was more like a cornbread cake.  It has a beautifully layered flavor profile, starting with a dusting of sugar on top, all the way down to the jalapeños hiding inside.  I was blown away.  Definitely a place we'll be going back to again, but not on a busy night, the sheer volume of people definitely detracted from the overall experience."}
{"text":"Food is outstanding! Best seared ahi tuna salad; ever! I've soon picked up a dozen times here and you must go to the bar area, lunch workers at the bar area is mean! Tossed my checked down before me. Literally."}
{"text":"My boss and I went here for lunch today. I had a sweet tea and the salmon with bacon Brussels sprouts. My meal was excellent, but not hot enough. My boss had the salmon also, but he had the rice and beans as his side. He didnt have any complaints, although I feel like his rice and beans could have had better presentation. Mike took care of us, and it was a good stop. I might go to Juniper Grill again, but it is pricey for what you get."}
{"text":"Our first visit to the Juniper Grill did not disappoint! The atmosphere was great, with terrific mood lighting, classy decor, and great tunes. Skillet cornbread was a great start, along with the shrimp flatbread and hummus/pita. Salad was good, with tasty sesame dressing. I had the fish tacos with drunken beans & rice on the side. Everyone in my party of 9 (including 3 children) were satisfied with their meals. No kids menu, but the waitress had children's selections that she read to us. Turns out they offered much more than the standard chicken tender/pizza/burger options for the kids which is great! Good beer and wine selections. We will definitely make a point to return to Juniper Grill."}
{"text":"Stopped in here only because the restaurant I wanted to eat was completely packed. I had eaten here before and it was good but not anything to bring me back. Today that was not the case. It looked like a different menu than before and it was only good changes. I got the tuna sandwich and it was amazing. It was cooked perfectly and the bacon jam and wasabi stuff they put on it was so very delicious. My husband got one of the seasonal entrees, the pork and peach tenderloin skewers. They were good too, but not as good as my sandwich. Then came dessert, and oh my Lord in Heaven. It was also a seasonal menu option, the peach sundae. It was two grilled peach halves with a crystallized sugar top like they torched it and a scoop of Sarris ice cream and a balsamic drizzle. We finished it in about thirty seconds and almost ordered another one. We will probably go back for dessert tomorrow night. Lol. So today it was definitely an experience that will bring us back in."}
{"text":"This is the best place to eat in McMurray.  The menu is great.  The drink menu is awesome.  I love the homemade chips.  I have never had a bad meal here and I have had almost everything on the menu.  The prices are affordable and the quality is great!"}
{"text":"My favorite dinner spot near our home! I love all their salads- fresh ingredients and will accomodate dietary restrictions etc. Never had a bad meal here and the service is always friendly and quick. Their gin & juice martini is THE BEST!!!"}
{"text":"I've gone to Juniper Grill several times with my family and we have always enjoyed it. The atmosphere is nice, but, as others have mentioned, it gets a little loud as it gets more crowded. 
The fish tacos, steak, mahi, and guacamole are all excellent. I would also recommend the cornbread (watch out for the jalapenos!). Juniper Grill also has several delicious varieties of mojitos and good margaritas, as well. 
The service here has been consistently excellent."}
{"text":"The servers lurk in the area in front of the kitchen like the ghosts from Pac-Man watching you eat until they're set free to come swoop in on your table. I had the chicken/avocado salad--avocado was old and the field greens tasted like \"refrigerator\", though the bacon dressing was good. The bus boys habitually brushed me in my chair, unapologetically. Positives: the food came fast and the place looked clean-- though the  decor was uninspired. I'm sure the place is a nice alternative for the local crowd but not a re-do."}
{"text":"I don't feel that this area of town has alot to offer, so I was excited to see this pop up. I went with a friend a few weeks ago and although I really enjoyed the atmosphere (we sat outside) the food was just average. I got the fish tacos which they seem to indicate on their menu as a specialty or popular item, but after tasting it I realized very quickly that I've had better. 

We had the chips and guac as an appetizer and again, while \"A-OK\", I've definitely had better. So all in all, if you're in this part of town, might as well take a chance, but if you head closer to the city there are many more options with better food."}
{"text":"Worst customer service ever!  Waiter talked too much & only wanted you to accept his opinions.  Tried to order the 4 taco appetizer.  When asked if I wanted pork or chicken, I asked for 2 of each.  Waiter said I could not split them & had to order all 4 the same.  I asked for a manager & waiter got angry.  Took forever for the manager to come to our table.  He was very argumentative.  I asked for a new waiter & he was very defensive.  Tried convincing me this guy was his best waiter & that everyone loves him.  I told him I was frustrated with his customer service & could not understand why they could not accommodate a simple request.  He was defiant & pretty much had the take it ir leave it attitude.  My friend suggested we leave.  When I mentioned I would be putting a review in Yelp, he stated that we didn't need to pay the bill.  So all the aggravation got us a bottle of wine and an order of guacamole.  But I would not return to a place with such poor customer service.  Ended up going to Arias.  What a difference.  Now that place knows what customer service means!"}
{"text":"Great meal! Sat at the bar and got the Brisket Quesadillas which were something to brag about. Big enough for an entire meal. Bar was nice to sit and grab a drink before our table was ready. Quiet ambiance in the room, dimly lit, and low level of music. Really enjoyed eating here. Staff was attentive, overall a great experience. Four stars"}
{"text":"From the outside it looks like a chain restaurant, once inside, it has that classic 50's and 60's classic restaurant look, dark wood, lots of mirrors and classic square bar that is surrounded by older regulars, 20 and 30 somethings watching sports on the televisions and me and friend Jimmy. Nice decor, not a dive if thats what you were thinking.

We started out in Cannonsburg, we both felt like some pub food, so we were headed to Big Jim's Roadhouse. We pull in and they are closed on Sunday. Back inside the automobile, Jimmy says, hey we can head out to 19 and go to the \"Jupiter Cafe.\" Never heard of it, looked it up on YELP, no listing. \"I know where it is and GPS Jimmy takes over, he knows all the back streets of Washington, Cannonsburg, Houston, McMurray and surrounding area. After A little drive GPS Jimmy says \"WE HAVE ARRIVED, DESTINATION ON THE RIGHT.\" I look at the sign which doesn't say JUPITER CAFE, it says Juniper Grille. Well we both had a belly laugh over that and walked in.

Not very packed for a Sunday I thought, but then again there are a lot of restaurants on 19. So we sit at the bar, a very friendly bartender took out drink orders, I got an IPA, Jimmy decided a Jack and Coke would hit the spot after another spat with his girlfriend. GPS Jimmy is a burger enthusiast and had the california burger, described as a third pound patty with lettuce, tomato, Guac, and Bam Bam Sauce, later we both decided it was a mayo based sauce with chipotle and other things designed to burn your mouth. The menu was packed with a cajun theme, lots of spicy seasonings, my mouth was watering! I decided on the veggie tacos, not on the menu mind you, I just had fish tacos minus the fish with sliced portobello mushrooms in place of the fish, it came with a side of \"drunken black beans and rice.\"

The tacos were huge, I got two, but for three bucks more I could have had another, but two was plenty. The tacos were filled with shredded lettuce, the grilled and tender portobello mushrooms, a delicious mango salsa and the above mentioned bam bam sauce and a nice scoop of Guac. The Drucken Beans & Rice were perfectly cooked, a bit too wet for my tastes, but delicious, not too spicy, but not bland. The tacos were the perfect blend of salty, sweet & Spicy.

All in all I really liked my meal at Juniper Grill, I discovered a new place I'd never knew existed and had a good time with a friend. Life does NOT get any better!"}
{"text":"Ahmazing!!! Had the skirt steak and it was perfect. The service was great even when we had a large party. Someone I was with had the burger and I tried it and it was also fantastic. Will definitely be going back! And their shareable Sarris Ice Cream sundae was delicious. Hand cut fries were good also."}
{"text":"First time was could not have been better, great food and service. Second time food was not as good and the waitress was horrible downright bitchy for some reason. I dont believe in judging a place by just one waitress so i will go back again because i still remember the first experience which could not have been better. Atmosphere is a little on the loud side but not obnoxious, more fun and delightful."}
{"text":"Margaritas are awesome. As is the chicken sandwich h with quacamole. Hummus is great. Also love love love the cornbread."}
{"text":"Awesome spot, their Russian Standard vodka Moscow mules are spot on and look like a piece of art. Dinner recommendation: Amish chicken, lunch: ahi tuna salad"}
{"text":"I stopped by late one evening on my way home after a long day of travel.  I was pleasantly surprised by a friendly waitress who made me  fresh coffee and recommended the chocolate pecan pie. The pie was amazing.  I have not had anything quite like.  I will be making this a regular part of my routine!"}
{"text":"Nice place. Loved the smoked pork enchiladas and the side of grilled vegetables.  Bigger than it looks from outside-- for sports lovers, the front room with the bar has the televisions as well as tables for dining, but if you want quiet, the room in back is nice, and it has a nice porch/party room behind that."}
{"text":"This is a good location.  It is probably even better in the summer when the outdoor area is open.  Our server was friendly and attentive.

I started with a cup of the rotisserie chicken tortilla soup.  It had very good flavor.

For my main course I chose the pick two with beef brisket and smoked sausage.  Both were tasty as was the barbecue sauce drizzled over them.

For my sides I ordered the cole slaw and homemade potato chips.  The slaw had a unique flavor.  It was different and good.  The chips were also good.  They were crispy and had good flavor.

Overall this is a good location for a casual dinner."}
{"text":"We've had a few meals here. The restaurant itself is very nice and homey. We've tried the chicken avacado salad with a bacon dressing. The short ribs with potatoes. BBQ ribs and chicken, and the seafood enchiladas. All were very well prepared and very good. I wouldn't say outstanding but all very good. Service has been very good as well"}
{"text":"Their fish tacos are incredible! It's hard for me to go in there and try new things because they're so good, lol. I love it when their veggie of the day is brussel sprouts, let me tell you how good those are! To die for!"}
{"text":"I am a regular at this restaurant and my favorites are the chicken avocado salad, the street tacos, short ribs, Amish chicken, and the chicken enchiladas. Yes there may be one or two menu items that are over priced like the guacamole and chips or that just fall flat like the filet (over charred and tough). But overall I think it's a great restaurant.  The atmosphere has a cozy lodge atmosphere (without feeling dated) that is great for a romantic dinner but also great for a business lunch.  Their house margarita is one of the best I've had in the Pittsburgh area! They use hand squeezed juices in them and you can really taste the difference. I think people that complain about their high prices fail to recognize that this restaurant uses high quality ingredients, probably better than any of the other restaurants in the area which sets them apart from the others. I recommend reservations via open table whenever possible because it is packed on the weekends for dinner and during noon during the week for business lunches."}
{"text":"Standard, almost like a chain but one. Their offerings seem to be skewed toward spicy southwestern which is surprisingly spicy for the area. Service was very good and not too loud even though we were seated next to the bar. I would probably return here if I were in the mood for spicy when visiting the area."}
{"text":"I like the location because it is close to home and also because it is not a McDonald's or some other chain. I know that it is a seafood restaurant hence the lack of vegetarian options but at least do those few dishes right. The food was marginal at best and the service was on the same level as the food."}
{"text":"Hard to say how many times we've ate at Juniper grill. 12-15 maybe? There's a reason for that. It's a solid restaurant. Wait staff can be a little interesting at times depending on who you get, however, it's a great go-to. 

They have a pretty solid smoked brisket. I've had it several times. Only once or twice has it been a bit on the fatty side. They have awesome french fries. Their smoked chicken can be hit or miss. It's either excellent or it's a smokey block that's dry dry dry. 

The chicken street tacos are absolutely excellent. Their cornbread is excellent. They have a nice side salad with a great choice of house made dressings. 

One great thing for me is they serve Chimay Premier Trappist Ale. I know when I go there I can count on drinking a true Belgian beer with my meal. I do feel their mixed drink prices are a bit absurd. $10.00 for a house margarita is a bit of a stretch, but they're pretty good. 

I've tried a good bit of everything they serve and I've liked everything I've ate at Juniper Grill. One thing that particularly stands out to me is their Chipotle Skirt Steak. It's very nice.

Soups are great also, however, it's unfortunate that they do not service the roasted poblana cheddar soup on a more regular basis. It's great."}
{"text":"I went here with a group for a holiday lunch.  We had the guacamole appetizers,  it was good but lacked salt.  I ordered the grilled romaine salad with salmon.   It was very good,  usually my standby dish.   I'm not sure why but the romaine ribs were very tough and I had to use a knife to cut through.  I was a little disappointed because they were already out of the catch of the day entree and it was only 12:30 when we arrived.   They usually have a great daily special.   My biggest problem with this restaurant is the parking situation.   I among others were circling the parking lot multiple times looking for a space.  It was very frustrating and had I not been meeting others there I would have went elsewhere."}
{"text":"I was meeting some ladies for dinner. The person in charged called ahead of our visit because we wanted to sit on the patio. She was told that it wouldn't be a problem. She got there first and we couldn't get a table outside. They told her that in the next half hour that one would come available. It didn't. By the time most of us were there, a table was still not available. We finally agreed to sit inside so they pushed tables together. It was crazy because it was a Tuesday night, not even a weekend night. 
We had a wonderful waiter. He was kind and he gave us great service. 
I ordered the Amish Chicken. It's only available after 5pm and their is limited availability. When it arrived it looked very good. It was served with mashed potatoes and a side of greens and tomatoes. Both sides were very good. The chicken, however, was only ok. It fell off the bone but the skin was soggy. All of the herbs and spices seemed to be on the skin so when I removed the soggy skin it left it bland. I definitely would not order it again. 
For dessert I ordered the Chocolate Pecan pie ala mode. It was delicious!!i would recommend it to anyone. 
If I went again I would order the tacos or enchiladas. The ladies who ordered those items really liked them.  I wanted to order the guacamole and chips for an appetizer but $9 for that is steep. You can get it made fresh at other restaurants for $5, occasionally $7. Other than that I thought their prices definitely matched the quality of the food."}
{"text":"Amazing cocktails. Cornbread is a must. All the appetizers are to die for. I've never had an entree I didn't like."}
{"text":"I love Juniper Grill because I know what to expect every time I come here. The rotisserie chicken salad with avocado and goat cheese is to die for. I usually eat half of it and take the rest for lunch the next day because the portions are so large. The service is great and it is a first half way point when meeting friends who don't live in the city."}
{"text":"We decided to have Sunday dinner here on a whim. Showed up and was caught off guard when the hostess asked if we had a reservation, didn't strike me as the type of place that you needed one.  After reading some of the reviews on  when we sat down I guess people in this area treat Juniper Grill as somewhere they celebrate big occasions which kind of surprises me.  It is not a high end restaurant and certainly isn't what I would consider a fancy establishment. Maybe it is the area, maybe I'm just too much of a food snob. Haha.  Our waitress Tanya was superb, she was the highlight of the meal for me.  As I mentioned I started to check Yelp reviews after sitting down and noticed they had a free appetizer with check in so we took advantage. We went with the pork tacos.  They were awesome. 4 tacos totally filled with pork, taco slaw, salsa, and cheese. For our main course we went with the Amish chicken, needed a longer cook time, was still pink around the bone, but the flavor was good.  It was an entire half of a chicken and the bbq sauce it came with I loved.  We also had the smokehouse platter.  The meat selection was good, not the best bbq ever, but when you aren't in a bbq joint you can't expect that.  The cornbread that came with the platter was super tasty, a nice touch of honey flavor.  Overall the dinner was good.  Service was great and there was nothing offputting about the food, so we will likely be back again.  No military discount at Juniper Grill"}
{"text":"The prices at the restaurant initially scared us off, but after a year of driving past it my parents were in town so we decided to try it out.  
Firstly, it was surprisingly kid friendly, so that was a great start.  I ordered a burger and it was the juiciest, run-down-your-arms, oh so good burger I've had in a very long time.  I'd recommend it any day for that alone!
We had a very large group and the service was great plus I got to try a little of everything.  The drunken beans were yummy, the cornbread fantastic (we liked it so much we got the dessert version, too!), and overall everyone very much enjoyed their meal.  I'd recommend it to anyone wanted a nicer option with guaranteed good food.


NOTE:  They have a separate gluten-free menu, and even though it looks similar to the regular menu MAKE SURE THE WAITSTAFF KNOWS that you'd like your dinner gluten free.  Get the special menu."}
{"text":"Who would expect Mexican street fare here?!  We lived in Souther California for almost three decades and we know Mexican tacos.  Their street tacos and seafood tacos are one of the best.  No over seasoning; and the spice level is upon request.  Today the flavor was close to how they would prepare it in the Ensenada fish market stalls.  Food is ample enough that you get to take home."}
{"text":"We went on our way to Tanger Outlets for lunch. I had the cheddar burger (hold the cheddar), my husband and SIL had the brisket sandwich. All in all, everyone enjoyed their meals and would happily go back again. Only thing we wished we had done differently was order a sampling of sides because the side of french fries were enough for two. 

Bonus: it was kid friendly (with a lot of little ones scattered throughout), nice atmosphere, and friendly servers and staff."}
{"text":"I visited the Juniper Grill on a recent trip to the steel city. I've been constantly surprised at the quality of dining available in Pitt. Juniper grill is no exception. As soon as you walk in, the smoky smell of the grill and cedar wood hits you.  You know then that dinner will be kick ass.

The waiter was nice and knowledgable. He recommended the fish tacos, apparently named the best in Pitt.  But that smokiness in the air had me going for the brisket.  It did not disappoint.  The smoky flavor and buttery texture of the brisket were like music to my ears.  I paired it with Steel City ale.  The meal was incredible.  Highly recommended."}
{"text":"It wasn't my choice to dine here but I'm not mad that I did. The atmosphere was pleasing and the waitress was nice enough. She was attentive and knowledgable of the menu, made some great suggestions. She was honest to a fault, which is great for us customers... Maybe not so great for her employer. 

While the portions appeared small, they turned out to be perfectly satisfying. My salmon was basted with some sweet heat type of sauce that paired nicely with the yukon gold mashed. Everyone cleaned their plates... From salmon to shrimp salad to a mixed meat platter, we all enjoyed our dining experience. 

Not much more to say but good food doesn't need many words. The menu is small but it is all quite delicious... Two satisfied thumbs up!!"}
{"text":"Ate lunch at Juniper Grill today.  Service was friendly and food was good.  I only gave 3 stars because of the manager.

I wanted to book the restaurant on a Tuesday night for 50 people on the deck, checks by couple, order off the menu.

The manager said NO.  I had to guarantee the group spending $1250 and no separate checks.  Everyone had to be on one bill and that is impossible to decipher. Why would a restaurant turn down business on a Tuesday evening?  I guess 50 people are too much trouble; however, I have taken the group to other restaurants in Bethel Park, South Park, and Peters and it was never problem.  Guess Juniper Grill doesn't want business."}
{"text":"Eaten there twice about a year apart. The first time was okay at best (burger), the second was disappointing (Ribs). I am perplexed by all of the good ratings for this place. I guess it depends on what you have experienced and what you expect."}
{"text":"Ate here on Saturday with my fiancé. The service was amazing, kept up with refills and was extremely polite. We ordered bacon cheesy dip which was great then got the slow roasted pork ribs which were overpriced but very delicious. My fiancé ordered a steak salad which was $18 for lunch. The food was good but over priced. I'm giving it four stars due to the location and the service. I would probably come back in the future"}
{"text":"Very spotty. Sometimes great. Sometimes mediocre. Same with wait staff. Sometimes very spicy and other times good spice. It's just inconsistent. Go for the surprise...or NOT"}
{"text":"I love juniper grill, but I would really appreciate if you added more vegetarian/vegan/and gluten free options. I don't come here anymore because of that. Besides that, there's always incredible service."}
{"text":"This is very local for us, so we go several times a year, though less now that Mad Mex has moved in nearby.
Went today and just wanted to make a couple comments.
First, select wine was half off by the bottle today so, thank you! It's nice to have wine with a meal and not break the bill! We had the Mercer red blend and enjoyed it very much. (Would have been very disappointed if we'd  paid twice as much!!)
One of our group had the beef and potato soup. She found it too salty and I volunteered to fall on that sword and took it, but after a few bites, I returned it to the waitress - and I like salty food usually!
I had the grilled fish sandwich done cajun style and really enjoyed it! Very tasty, not overcooked, nicely seasoned. But I had the mac and cheese as a side and I don't know if they used turmeric or cheese powder to get it orange, but I'm pretty confident there was no actual cheese involved in the preparation!
My wife had the rotisserie chicken salad, holding the dates and enjoyed it. I will note that for some reason, all the salads seem to have sweet stuff in them, and I am not a fan. Savory, please, I'll have dessert if I want a sweet!
Guac appetizer very good and generous portion - i put the leftover on my fish sandwich!
Cheers!"}
{"text":"Friday afternoon, lunch for 5 people

Love the upscale casual decor and appreciate the sound baffles in the ceiling. Lots of dry-stacked stone, dark wood and leather upholstery, hefty table- and glassware. A nice step up from Atria's and a nice one page (!) menu!!

I ordered the grilled fish tacos with mango salsa. The fish was unidentified on the menu, but I've got to guess it was tilapia. Nice seasoning, cabbage slaw---but getting good mangoes in Pittsburgh isn't easy for anyone--restaurateur or home cook! Not enough to make it a favorite (Kaya gets that nod)

No problem when my sis mentioned her gluten allergy, adjustments made to her grilled salmon entree (no sauces, clean the grill, etc) were made without drama. 

Also to our table: Seared ahi tuna salad, beef brisket sandwich, prime fillet. Good reviews from everyone at our table. We had no time or appetite to sample the desserts.

Oh, if you want a straw for your iced tea or water, I think you have to ask for one.  

Will return for sure"}
{"text":"My husband and I came here for our first anniversary dinner. The setting is perfect for a romantic evening (cozy booths, dimmed lighting). I had the trout which was on special and it was great. Get the brownie skillet with a scoop of ice cream, you won't be disappointed!"}
{"text":"Juniper has a small, but diverse menu with quality food. They have Guinness on tap, so that's always a plus in my book. 
Good food, but pricey."}
{"text":"I met with some co workers the other night, beautiful restaurant. The brisket was very good and flavorful. We all shared and loved the cornbread. I would go back again."}
{"text":"Good family friend restaurant. The hummus is extremely good as well are the \"hand pies\" filled with meat or cheese.

Being a fan of locally owned establishments you can't help but like the local flavor of Juniper Grill."}
{"text":"The restaurant was super empty and quiet when we visited, so it was a great setting for our lunch with a large group. The service was very attentive and quick, which was nice. The appetizers we ordered were delicious, but my entree of the fish tacos was pretty lackluster. Cornbread was also amazing. Would definitely visit again!"}
{"text":"The atmosphere was nice, the service was excellent, and the food had nice flavor, but, the portion was small, and my biggest complaint:  the \"short ribs\", which were priced like short ribs, was actually a very cheap pot roast that was tough and stringy. I like pot roast. But I would expect to pay about $12 less for it. I don't like pot roast mislabeled as short ribs. I DO really like the atmosphere, but if come here to drink, not eat. Frankly, Appleby's is across the street, and might be a better option."}
{"text":"my wife and I stopped here for lunch this afternoon on our ride home from Pittsburgh. We were here and enjoyed this place when it was Table 22 so we thought we'd give Juniper a try. My wife is gluten free and asked if they could accommodate a gf allergy. Wow their selection for GF is amazing but their care, detail and knowledge of food allergies were what really amazed us. They took pride in providing personalized attention and this showed by their attentiveness in listening to my wife and interacting with her to create the perfect dish that would address her allergies.  You see gluten is just the start, she is also dairy intolerant and night shade vegetable intolerant.  Michael seated us and provided some summary information then introduced us to our waiter David who went into details and walked through the entire menu.  Even before we received our food we were totally impressed by the level of care and service.  When the food came out the quality was excellent.  We loved our dining experience and definitely recommend this for anyone - regardless of whether you have dietary restrictions or not - who enjoys great service and excellent food."}
{"text":"We've been to Juniper Grill multiple times, and they never disappoint. Great in the spring/summer months to dine outside on the covered patio. Nice atmosphere inside as well.

I must recommend the housemade margarita - - you can tell the ingredients are extremely fresh and this drink is consistently well made.

The house salad is great (with homemade croutons to die for).

And, I cannot end this review without mentioning my favorite menu item - - the FISH TACOS. They are incredibly delicious visit after visit."}
{"text":"I am really impressed with this location.  It has high-quality food, amazing ambiance, and stellar service.  I recently hosted a birthday party on their back, enclosed patio (very intimate and quiet) and we had lots of room, a tasty buffet (their beef brisket is to die for), and two dedicated servers that were very attentive.  When I had a concern over our tab, management stepped in made sure that it was immediately corrected.  Now that is great customer service!

If you are looking to host a party of 20+, this is the place to go!  Bravo, Juniper Grill.  Bravo!"}
{"text":"I had a pleasant experience my first time at Juniper Grill. The waiter was very nice. Service was quick and smooth. The side salads are a very nice portion. I'm not sure if it's just me, but the croutons in the Caesar salad seemed to have a hint of vanilla. I really liked them. I got the shrimp tacos for lunch which had a slight Asian spin to them. Very tasty. The black eyed pea salad was a nice surprise. Served cold with an Italian or vinaigrette dressing. I don't tend to visit chain restaurants more than once, but I'd come back to Juniper Grill if I was near one of their locations."}
{"text":"The Juniper Grill falls under the window of Atria's. There are only 3 locations at present, none of which are in the Pittsburgh city limits. My husband and I went to the one in McMurray for lunch.

The atmosphere is trendy with a full bar and TVs. There is also a seating area where you can watch the chefs cook. In addition they have an enclosed heated patio sitting area where you can view the Canonsburg river.

Dress is casual and they offer free WiFi as long as you ask for their passcode.

My husband and I each wanted to try something different. He ordered the bison burger which comes with a choice of side. He chose potato salad. I decided to have the wood grilled salmon with asparagus.  Our waitress was very attentive and helpful. She explained to us that some of the menu items were made \"in house\" and those are noted on your menu by an appropriate mark.

We got our meals. Portion sizes were not that big but the food was delicious! Their prices are a bit higher for lunch than I expected, nevertheless, for good food it is worth spending a little more. We each decided to try a dessert. I ordered the white chocolate peppermint creme brûlée which was today's special and he had corn bread with berry sauce. That comes with a choice of Sarris ice cream. They do serve Sarris' ice cream as a stand alone dessert but you have a limited choice.

The place wasn't overly crowded and made for a nice afternoon meal. Certain menu items are not available until after 5 when they switch over to dinner. 

Please note that even though they fall under the Atria's umbrella they do not accept their gift cards if you have any. You can pay with your smartphone if it is so enable.

If was a great visit and will come back when the occasion warrants it."}
{"text":"It is a lovely place but the food just falls short. I found it to be quite bland. I sampled foods from my dining companions and didn't  find any of the dishes to be very special. The grilled romaine salad was not bad. The steak, while tender had an odd taste that I didn't think worked. The fish tacos just flat out failed. They looked great but the taste was bland. The cornbread was probably the highlight if the meal. Oh and it was raining and the roof was leaking on out table."}
{"text":"Yum! The menu is a bit limited but there seems to be something for everyone. I had their daily fish special (blackened grouper.) it was a large 8oz portion and was delicious! My Mom had a chicken avocado salad which she loved as well (minus the hair.). They have a great outdoor patio and full bar.  We also ordered some sides And the cornbread was simply amazing.  I would have given 5 stars but...the hair in my moms salad and the menu was a bit small.  Hard to find healthy choices.  Overall, I will visit again when in this area of town."}
{"text":"After many disappointing meals in the area, finding the Juniper Grill was wonderful. I had the brisket quesadilla, very tasty. They have a good beer selection and I tried a sangria. Definitely will be back when we are in the neighborhood."}
{"text":"This restaurant is my favorite in Pittsburgh at the moment. Every time you go everything is so fresh and orders are always correct and the wait staff is so nice. Their cornbread side could feed a whole family -if you haven't tried it you need to. I was so happy to see them at Taste of Pittsburgh too!  Only reason they get 4/5 stars is because the other clientele thinks they're Gods gift to earth and are at times rude."}
{"text":"For someone that grew up in Peters, I wish this place was around when I lived there.  4 stars for the food and atmosphere in comparison to what there is in the area, however, it cannot be compared to upscale restaurants or true 'foody' places.

The atmosphere is good and it is always packed.  Even with a reservation, I have had to wait both time's i have gone.


The street tacos are amazing, i highly recommend ordering them.  I have also had the Chicken and Goat Cheese Salad on both occasions, simply because i liked it so much the first time. The chicken is awesome, and you can tell it is freshly roasted. 

The creamy tomato soup is pretty good as well.  


I hope this place continues to do well, as Peters and the South Hills has always been in desperate need of some good restaurants and bars."}
{"text":"I'd really like to give 3.5, but I can't...

First off, I generally like Juniper Grill.  Nothing I've had there has been bad, and service is usually pretty prompt.  

Tonight, my drink was AMAZING. Never had a Negroni before, but if they all taste like that, I want them all the time!!  So good, so smooth, beautifully presented.  (See photo!)  unfortunately, the food this time there was just underwhelming.  Chips and guacamole for $9.  I mean, it was ok.  I've had better free chips and guacamole than what we got from Juniper Grill tonight.  It seemed like it had been made many hours prior, and by the time we had gotten there to eat, we were at the bottom of the container.  I understand, but I also don't understand.  It's not hard to make guacamole fresh every time someone orders it.  You chop up some veggies and mash them up with avocado.  It's not like it takes 20 minutes to prepare.  And finally for dinner, I had the Santa Fe bowl.  I did not take a photo.  It wasn't exciting to look at, and it wasn't exciting to eat.  It came in a really big bowl with some sour cream based sauce over it that was -- I guess -- their take on a green chile sauce/salsa?  Not good.  Not correct at all.  If they say green chile, I want green chile.  That was creamy something with green flecks.  The quinoa was just that, and the other ingredients were unfortunately few and far between.  Again, it seemed like they took the last beans and corn and tomatoes from the  bottom of the containers.  I was left severely wanting.  I chose brisket as the protein.  It was good until I got to a piece that was overly seasoned with rub.  It was very salty, and unfortunately made me stop eating.  

Service was a little spotty tonight.  Our original server was cut early, so he had only gotten us our drinks.  The server taking over was nice and pleasant, but not super attentive.  It was nice that they were both giving us time to talk, on one hand, but on the other, I could have ordered my sad Santa Fe bowl about a half hour earlier (potentially keeping it from being sad) had they popped around more frequently.  

Don't take this one experience as their usual.  This was not the norm, and I'm hoping it's just the weird way the night turned out."}
{"text":"Parents live near here so we headed over since the name itself intrigues me. My mother swears by the skirt steak but I've never liked skirt steak. I had the BBQ Brisket and this was fantastic. Very little fat and very tender. Cooked just perfect, and the mashed Yellow Gold potatoes needed nothing else. Jeremy explained the beers and I chose the Pious Monk Dunkel from the local microbrew Church Brew Works. It was wonderful! The Erie Railbender beer was NOT good. SKIP IT. Great food, but I wish there was more of it. Also, it was terribly pricey."}
