{"text":"We just came back after eating the most delectable dinner. The crusty rolls and the saganiki along with the Greek salad and Mediterranean bread were great to go along with the beef and chicken souvlaki (which was for the chicken along the dry side), but good and tasty. A great dining experience with the service, food and atmosphere."}
{"text":"Just Greek? More like JEST Greek. Ooooooh snap.  Seriously though, a handful of friends and I converged on this little restaurant for a buddy's birthday the other day and missed our reservation by ten minutes. We were then told that we would have to wait for a table. I guess it was given away? That sounded alright... until we passed the 20 minutes mark of waiting... Then things we're so great anymore.   The rest of the night went off without a hitch once we were finally seated. The meal was pleasant and service average. The food was filling (as expected).  Probably won't eat there again."}
{"text":"Over the years, this restaurant has evolved from a standard - and spartan - blue checkered table Greek restaurant to a more cozy and classic Hellenic eatery.  The decor has changed but the food is just as tasty as ever.  The souvlaki dinners range from $13 to $18 come with rice, potatoes and veggies (gone are the mushy peas, replaced by mixed veggies).  Every dinner also comes with a \"Greek\" salad (it has lettuce) which appears to be bigger than ever and the feta cheese on it is soft and velvety smooth.  Fresh buns are also served and olive oil for it is already on each table.  The saganaki is nice too, it's not the best I've ever had but it scores points for its size!"}
{"text":"Went here this past Sunday for an early dinner. There were two of us and we shared Saganaki and I had a Greek Salad. Good value for money though not the best saganki I've had. Salad was fresh and bountiful. Service was efficient. My one comment would be the air quality. After only being there for an hour so, my clothes smelled for 3 days! Usually a sign that the exhaust hoods are in need of cleaning!"}
{"text":"it took SO long to get our food. Probably over an hour. We were ravenous by the time we were served. The portions are pretty big, and the Saganaki was to die for. Everything else was pretty standard."}
{"text":"I've been a patron for years. They've recently updated their decor; the food is still fantastic. Great chicken souvlaki, fresh greek salad & bread. They also have take-out business in the back of the restaurant."}
{"text":"They have great lamb chop, very yummy, but it's overpriced for a regular meal. If you are going for special occasions then the price is reasonable.   The gyro pita has a lot of meat in it, there is no lettuce or french fries in it, only tomato and onion. The gyro meat didn't taste that good, but the quantity is big so it's good lunch meal.  If they add french fries and lettuce in the pita and increase the quantity of the lamb chop I will definitly increase the ratings."}
{"text":"What happened?  This use to be my favorite Greek restaurant.  The food was consistently excellent but I went there over the weekend and what a disappointment!  The service was the worst I've ever seen anywhere.  Dirty dishes were left in front of us for close to 30 minutes.  Nobody came to ask if we wanted dessert and coffee.  We had to stand next to the door to get our bill.  Now, about he food, I was brought burnt dried out chicken souvlaki.  It had obviously sat on the grill too long.  I was surprised they served it.  It took 20 minutes to get another one.  This one had no seasoning or flavor whatsoever.  The tzaziki (sp?) had no garlic in it - it tasted like plain yogurt.  I was extremely disappointed.  I saw the same cooks in the kitchen.   Maybe the people prepping are different? Obviously no quality control....  I hope management reads this and does something about it.  It's not a one of.  My sister went there a couple of months ago and had a similar experience. She warned me about it.  She was right.  It'll be hard to go back."}
{"text":"We ordered from the menu posted on Just Eat. We ordered a chicken souvlaki lunch entree (to include salad, potatoes, and rice), a small Greek salad with chicken and no tomatoes, due to a severe allergy which was noted and written, sweet potato fries, and rice. More than an hour later, we got cold, soggy sweet potato fries and rice. That's all, except two rolls we didn't ask for.  We called the restaurant and after dealing with a person who couldn't understand the complaint, a manager came to the phone. When he heard what was wrong, he yelled there was no such thing as a chicken souvlaki lunch entree. I yelled back that they then shouldn't have it on their Just Eat menu and they SURELY shouldn't have charged me $13 for it. He hung up on me.  Luckily, Just Eat agreed to refund our entire bill. But order from this restaurant at your peril."}
{"text":"Been here twice once with my boss and second time with my girlfriend.  Food is amazing.  It also great for groups.  We also recieved complementary desert at the end of the night ."}
{"text":"Food was decent and about what you would expect for the price.  Don't get an appetizer as you will regret it when the entree comes.    We had the Kalmari and Sausage for appetizer and it wasn't bad but not great.  Carrot cake and Baclava was above average, although they only had the chocolate Baclava and was out of the regular one for the last two days."}
{"text":"Came here with the boyfriend for lunch the other day after craving greek food. He got the chicken souvlaki lunch entrée and I got the gyro dinner lunch entrée. Both came with  a greek salad to start and were served with rice, potatoes, and peas. I have to say that the gyro and the salad were not the best that I've had, but they were just okay. I enjoyed the rice and peas, I thought they were good together. For lunch it was a good sized portion and I wasn't able to finish it. Overall, I didn't leave disappointed or overly satisfied."}
{"text":"I come here for lunch pretty often. The chicken souvlaki lunch is perfect. I love the fluffy buns that come out before the meal."}
{"text":"Laid back atmosphere, friendly service. Good spanakopita dinner, which is all ive had here. Reliably a decent place to go to for dinner."}
{"text":"Great place for Greek food it is one of the best places to eat in the Bloor West Village in my  opinion"}
{"text":"We ordered just Greek last night from door dash.   TIP: the chicken souvlaki comes as a meal with rice, potatoes and peas and a small salad (it is not listed this way.)  We had:  3 dips and pita: Tsaziki, taramislada, humus. 4/5  tsaziki was really good, the other 2 were nothing special.  Chicken souvlaki meals 3/5- the chicken was very good, the sides were okay.  I would order from here again."}
{"text":"I'm reading the reviews as I'm just about to order from here.  I'm quite surprised that the ratings of late are low.    I find the food very good and consistent in both eat in and take out.  Portions are very generous.    Chicken souvlaki is fantastic and their tzatziki is fantastic.    Calamari is great.   Service always as fast as you want and a very friendly and comfortable atmosphere.  I've been going here for years and I will be ordering from there tonight."}
{"text":"Just Greek is a great value for your money - for around $15, you get a really big main dish along with big bread rolls and a starter salad. I find there's no need to order an appetizer or a dessert, as you get so much food with your main. So it makes for a very reasonably priced, satisfying meal.   My one complaint is that the food quality is very inconsistent. I have been here before where the rolls have been warm and fresh out of the oven, the meat perfectly cooked, and the sides delicious. Other times, I have been served hard, stale bread and dry, overcooked meat. It's a shame, because when they are on, they are quite good and you get so much food for your money."}
{"text":"Every time I come here I get the same meal - octopus with potatoes, rice, veggies and a glass of red wine.  Nothing super special but good, hearty food nonetheless. Staff is accommodating and friendly - had a 15 person birthday party here just the other day and the staff was great with us. Even brought us free deserts!"}
{"text":"The restaurant is appealing, but the food and service is very inconstant. The calamari is cooked from frozen and is not recommended neither is the fried cheese, they gave me a hotdog bun. Just dont go"}
{"text":"So they say a typical food craving lasts 4-12 minutes.  My cravings will last months until I cave in to them.  About once a year I get a craving for a beef/lamb gyros and since there are zero Greek restaurants where I live downtown this craving will last weeks until I find that heavenly meat shaved off a stick and jammed into a pita.  The restaurant was really clean with cool decor and the staff was was friendly.  When ordering take out the whole kitchen was visible so they keep it neat as well.   The gyros was a good size jam packed with thick slices of meat and the tatziki was garlicky. Tomato, lettuce, and onion were super fresh as well.   The gyros there were awesome.  I suspect my next craving will be sooner than the usual 12 months as Just Greek is now my favorite place for take out.  PS: There's a parking lot behind the restaurant as street parking is horrible in that area."}
{"text":"I frequent this place quite often, it is good greek food for the \"west-siders\".  Love when it gets warm and they open up a little bit of a patio area. The service is always great. Their potatoes are the best, lemon and thyme I believe but are always cooked to perfection. The menu is pretty straight forward with typical greek restaurant items. The prices are good for the area."}
{"text":"Easily my favorite Greek restaurant. All souvlaki are excellent (lamb, beef, chicken, pork). The owner (Bobby) is a class act."}
{"text":"Food is ok, but we ordered 2 large flicker Greek salads tonight and waited an hour to get the wrong order! Got the salads, but no chicken!!  The pita bread was cold too!  I won't be going here anymore!!!"}
{"text":"We've picked up take out from here a few times now.  Food is decent, but the service is less than spectacular. The gentleman taking my order was pretty abrupt with me and every other customer he spoke to but hey what do I know.  Our fave menu items are usually the tirokafteri (aka hot cheese, spicy feta), greek salad, and the chicken souvlaki.  Last time we ordered the food just didn't taste super fresh plus our Greek fries were missing the feta and spices (or all of the toppings). I was already half way home when I realized and didn't feel like going back. Womp Womp."}
{"text":"Tried the Moussakka. Overall the dish was ok. Not really something I'd try again. The person I was with had the veggie peppers but in his view they lacked flavor.   Also found a hair baked in the rolls they brought out when we arrived.   Probably won't return."}
{"text":"I'm sitting at dinner with my family of three, it's one hour and thirty minutes into our visiting at this restaurant, we just had our food arrive to our table. I ordered the large chicken dinner and my mother order a small, my order had one extra piece of chicken besides that our meals are identical. Same amount of rice and potatoes. However, I'm paying $6 more for the large.  When I asked the owner what is the difference of the large and small was I got a rude respond that the large had an extra ounce of meat which is not true. I asked this questions because I was curious due to the waiter stating I would have lunch for tomorrow that's how large it is. This was false!!  I don't think the large is worth the extra $6 as another stick of chicken is around the price of $5.  My food is boring and tasteless, I would not recommend this place to others. Maybe just maybe try it on a weekday during lunch when they are not busy however don't go on weekend or weeknights. And if you do, expect to wait 2hours for your meal that could of been better spent ordering takeout somewhere anywhere but here!!   I will say when ordering take out from this place, its bomb but don't waste your time coming in to eat. You'll regret it!!"}
{"text":"Delicious greek food in the west end of the city!  My husband and I came to Just Greek for lunch on a Saturday.  We had the Chicken Souvlaki and the roast pork wrap with fried calamari.  The roast pork was sooooooo delicious; juicy and tender with the right amount of seasoning! The greek salad was delicious, good balance of oil, vegetables, and feta.  We will definitely be back again.  Great value for quality food."}
{"text":"I am sitting here wondering how my partner parted with $56.00 considering what he brought home tonight from Just Greek.  Our salads were a bland combination of red onion, cucumber, and two oddly large slices of tomato pressing the brown edged iceberg lettuce into the container.  My partner wondered aloud where the dressing containers were, just our bad luck, they weren't anywhere to be found.  Upon emptying the containers we were even less enthused to find they pre-dressed the salads... and the feta was a low grade shaved cow dairy product. Fail #1 Just Greek.    I ordered the chicken souvlaki with potato and rice.  The chicken was dry to the point of being stringy, the rice unfortunately was under seasoned and visually void of any color from vegetable which even made the white of the rice a dull shade of grey MEH. Oh wait I forgot, there were vegetables separating my rice from my potato, however after ingesting a couple of zucchini that turned to a gelatinous mush on my tongue I decided to push them aside, over cooked.... bland.  The potatoes, while missing the appropriate seasoning, were cooked properly.  The tzatziki was the highlight of the dish as it was properly executed with a nice acidity, light touch of dill and freshness of cucumber.  It was perfect to moisten the chicken enough to make it palatable. Fail #2  My partner had the Mousaka with the same rice and soggy vegetable accompaniment.  The Bechamel was dry in places and wasn't evenly spread amongst the piece, it also had tell tale signs of being nuked prior to delivery.  The eggplant layer was thin and stringy plus the bottom layer of eggplant was burnt a lovely blackish brown.  In between these two layers of textural bliss was a thick layer of medium ground beef with lack of any traditional spices such as cinnamon or nutmeg and zero tomato sauce... Wasn't a lick of moisture from fat either boooo.  Fail #3  Sorry Just Greek you Just struck out....."}
{"text":"Went there with a few friends about a month ago. Service was great and I was very satisfied with the Pork Souvlaki dinner. The wait was a little long but other than that the service was good and the waiter was quite funny. For the area its great value for money."}
{"text":"Pretty good Greek food. Some dishes i haven't seen elsewhere including the awesome shrimp Varka that I had (grilled shrimp, tomatoes, mushrooms, feta). The service is good and there's a patio. Good wine selection also and the dolmades are made in-house."}
{"text":"Food was decent, service staff was lovely, but be prepared to stay a while... Slooooow and seemingly understaffed. Some stuff was better than I'd had before, others were worse. All in all, relatively satisfying, with a bit of \"meh\" at the end."}
{"text":"Always great food! So fresh, tasteful and wonderful staff! Pricing is pretty good too! Must try :) Will upload pictures next time.. couldn't wait to eat lol!!"}
{"text":"Yum yum yum!! I remember walking into Just Greek four years ago, before the renovations... the food had been good, well-priced, the restaurant itself made me think of a fancy cafeteria, but it was a good place.  Fast forward! The restaurant had undergone renovations (not sure when) and is very elegant... no more cafeteria! I have been here four times in the past two months! And considering my average \"going out to eat-ness\" is at 3 or 4 times a YEAR, this says something... where to start? The waiter at the front (there's a second waiter for the back part of the restaurant who shows up for dinner) is super attentive, quick, very nice, and in no way intrusive. He somehow knows the best times to fill up a glass of water or remove empty plates so that he is barely noticed.  The food is phenomenal. I have eaten A LOT of Greek food in my short life (I have a friend who's mother cooks almost nothing but delicious, authentic Greek food, AND I have tried almost every Greek restaurant I have seen). This place tops them all, friend's mom included (Sorry!). The Greek salad is not an authentic Greek salad (it has lettuce), but makes your mouth water. They do NOT skimp on the imported Greek feta, the tomatoes are always juicy, fresh, and ripe (like my dad grows in our backyard). One \"large\" salad is enough to feed my fiancé and I for dinner. If you're looking for authentic Greek salad, grab their \"Village\" salad: equally as tasty. Each souvlaki dish is authentic and savoury. The meats are grilled to perfection, lean, and well-spiced. Their potatoes are nice and lemony... yum! If you order a dinner, you get a side Greek salad (nicely portioned). You also get freshly baked bread at your table with every order. They accommodate children with ease (the high-chair beats the diners to the table, the kids can get separate items from a full dinner at a side-dish cost, even if it's not a side dish).  When I went out with my parents: 3 souvlaki dishes (chicken, pork, lamb), plate of spanakopitas, mango-cherry cheesecake, 2 teas = $60.47 (tax and tip) When I went out with my fiancé: 2 large Greek salads, 2 iced teas, one tea, feta cheese bread, saganaki = $41.11 (tax + tip)  I will be coming back very very soon... *goes to come up with an occaison for dining out*"}
{"text":"I had a great dinner here on Tuesday night. My friend and I ordered the chicken souvlaki and it did not disappoint. A great spot."}
{"text":"I didn't like it. The gyros were dry and lacked flavor, same with the rice and potatoes that came with it. The tzatziki sauce seemed too chunky, almost like cream cheese. The salad was okay and there was a bun that came with it instead of the usual flat bread. I also tried the shrimp appetizer which they said was wrapped in phyllo and served with mediterranean sauce. It turned out to be too greasy and was no different from panko-crusted shrimps. The \"mediterranean\" sauce was nothing special either and I found it overpriced for both the small quantity and poor quality. Frankly, I would have been happier with Jimmy the Greek. If their gyros suck, then I won't bother trying anything else in their menu."}
{"text":"The service was decent, and the food ordinary as in most such restaurants. I find the meat is very short and veggies excessive. If you can't find something else you like in the area, this is fine for a quick sit down meal."}
{"text":"This is one of the few areas in T.O. that has great restaurants with affordable prices. I have been very happy with the prices, food, and service. The restaurant is very clean and staff more than pleasant. Like most Greek restaurants,  they are open later than many of the restaurants  in the area. I doubt you will be disappointed here :)"}
{"text":"I've eaten here about 7 times before. The food is good for the price you pay. However, after the last incident that took place at Just Greek, I'm not sure if I will return.  The story starts when my friend and I go in for lunch (this was my 5th visit). One particular female server wasn't very engaging. She was super nice to all the people around us (seemed like they were regular customers or maybe she knew them from before) but she was not serving us the way we wouldve liked to. She asked if she could bring us water and didn't come back until 10 min later back to our table (without the water), realized that she forgot, and then brought it within 30 seconds. Following that we found a piece of plastic in our salad. They were nice about it and didn't charge us for one of the items because of this.   The second visit, I went in for dinner. The same server once again was not engaging with us as much as she was with other people. My friend wanted to order underneath the sandwich/wraps section but the server told us that its not available because its part of the lunch menu. However, right beside the Sandwich heading there was a heading that read \"Kids Menu\". It doesn't make sense how a kids menu is on the same page as the lunch menu.  Once we got our food and finished it, she asked if she could take our plates, and we let her. She asked if we were gonna have anything else and we ordered tea.  A few minutes later she comes to us with one bill even though we didnt ask for it. When we told her we wanted to pay separately she seemed annoyed and she stop above me with the machine waiting for me to tell her how much half of the bill would come out to. Then she grabbed the receipt so hard her hand banged on the table. She came back with two copies and thew them on our table once again hitting her pal down to the table as she left the receips there. I did not leave her ANY tip, instead went to the manager and complained.  After this, I went back once more, she was serving me again and this time she wasn't saying anything but I can feel the negativity coming off of her. After this, I do not crave their food, nor do I ever consider them as an option."}
