{"text":"First off I should say the staff at this place are very friendly and nice, and the restaurant was clean, and the lentil soup was good, but this is where the compliments end. The food that I ordered, I can honestly say, was some of the most mediocre and most expensive takeout I have received. All of the meat was bland, tasted like it had come from a freezer and was bordering on under cooked in the case of the chicken. And for our party of four, this cost us $80 or so, for basically some kebab meat and rice. I would recommend staying away from here, unless they have really put some work in since I was there a few months ago."}
{"text":"This place has most amazing soup you will ever taste..the kebabs are juicy and perfectly seasoned. . Owner Mehdi really takes pride in his work and it show in the quality of his food.. Looking forward to coming back for more delicious food"}
{"text":"Nice owners. Delicious kobideh. Affordable lunch specials. Def worth checking out if you're in the area"}
{"text":"Delicious Falafel, lentil soup, rice, EVERYTHING. Amazing service and a nice change for Aurora."}
{"text":"Best Persian food in Aurora and arguably best food joint in town. Mehdi the owner and company provide an authentic dining experience that brings a taste of the middle east right to the heart of the city. From the homemade bread to the succulent meats wth traditional seasoning this restaurant has made its way into my routine after only two visits. 5/5"}
{"text":"Great addition to Aurora. Fantastic Parisian kebabs. Overall the food was very good. Definitely will be visiting again soon."}
{"text":"Love it. Not only right across the street from the Marketing Garage but great food (soup is unbelievable) and great service. Aurora's best new restaurant I'd say."}
{"text":"Awesome find in Aurora, great kobideh and barg for dinner. Excellent flavor and generous portions. Loved it!"}
{"text":"So happy i found this little gem in aurora, usually i have to go down to North York for some good quality take out Persian food! Lovely service as soon as you walk in. And the food is made fresh to order! The owner gave me and my friend a sample of their delicious lentil soup, i would have definitely gotten it if we hadn't order so much food. Nice quaint resturaunt, veryy clean and the Persian music in the background was lovely. Delicious food + good service = good time. I will definitely be getting take out from here more often, but it's perfect for a casual dine in as well or even for date night! Loved it :)"}
{"text":"These reviewers must be family or have never tried real Persian food. Sorry but whenever you run out of rice before your meat/chicken is done is just wrong. Rice portion was enough T to feed my 4 year old.  Definitely not a 5 star. Unless your a non middle eastern who doesn't eat much Persian food."}
{"text":"I love their food really excellent but the workflow and mismanagement is frustrating. Once I ordered they donot have sufficient food but they  took my order  after waiting for 30 min they told me they are cooking rice then they gave some free stuff but that is not the point .  Another day I ordered take away we we're little late to pick it up When I went to pick up they were in disbelieve that why am I there they thought we will not  come then when I brought the food  yo my friends house , half the good is missing what an embarrassing position for us ,  When he took my order never ask for the phone no , so that they can call you back to let you know if anything needed  to be told  I hope they become professional"}
{"text":"I found this place on Yelp and stopped in with a friend. We tried the beef and the chicken platters and split them. One of the beefs, I think it was the sirloin, had great flavour! The chicken and other beef was very good too but the showstopper was the sirloin. Also, their lentil soup is the best I've ever had. For 5 stars I would have liked some kind of sauce/yogurt/sour cream to accompany the plate but the dish did have terrific flavour.  Prices are also very good and the owners are very pleasant."}
{"text":"INCREDIBLE. I'm super happy I found this and I'm super happy with my meal.... so filling !!    My bf and I got 2 flaffel sandwhiches , one meal & one chicken sandwhiches. And it came out to $46( kinda pricy) than the owner gave us samples of the soup ( WHICH WAS AMAZING ) so I decided to buy it and he gave it to me for free because I was waiting. He was super nice ! Family owned which I loved.   Amazing food and the rice IS SEASONED SO WELL I DONT KNOW HOW   the only down fall is the price. Which it's okay if you want to pay a little more for quality sure  Def would go back !"}
{"text":"Great food, location, hours and a passionate owner.  Latest order was a rather magical beef wrap and navy bean soup.  A high-quality casual eatin' place that definitely enhances the fun factor of Aurora."}
{"text":"Renovations were completed for 2 months before I got a chance to try. Appears to be under new ownership as well. The food is definitely head and shoulders above what it used to be.   The place has nice decor, very homey and relaxing atmosphere. In terms of price, it is around $5 more on average per plate than most Persian places I've visited. Compares to kababsara which is just down the street, the flavors of kebab and chicken I ordered were less intense and likely less salt. This isn't to say it's bad, as if isn't. It's really good if you want ot taste the flavor of the ground beef and chicken a bit more as opposed to herbs and spices. It trades away the salad I could get at kababsara with more rice.   The rice was fluffy and had quite good texture and aroma.  Overall the place is a rock solid 4 out of 5, mainly due to the higher price compared to other similar restaurants. This could be because it is in a busy interaction with building sold to new owners just a year ago.   Would I go again and should you give it a try? While it's a nice atmosphere, i always value quality and quantity of food more than decor. I would go if I wanted a nicer sit down place with friends or going on a date. Otherwise, there is better value to be found elsewhere."}
{"text":"I went in and tried the steak kabob plate a few weeks ago I think its named after a king. Anywho the meat was cooked to perfection, the basmati rice had a lovely aroma of saffron and butter in the rice. The price was a bit expensive for a stick of steak (almost $20) in such a casual place too. The service was friendly but my meal took a little too long. I would go back to try some of there other plates and wraps because the meal was very delicious though. The owner gave me a small sample taste of their lentil soup and it was off the charts! Delish.  I think this place is fairly new still so perhaps speed will improve. I did notice the pizza area in the back and the dough is made on site. I would like to try as it looked really yummy. I'm giving a high amount of stars because aside from the price and quantity of food the taste was delicious."}
{"text":"Fantastic Middle east flavors in Aurora, Canada.  Soups are tasty and the meats cook to perfection  I travel a lot (actually visiting from California) and to find this delicious gift from Medhi, the owner, is a bless."}
{"text":"Business visit at Richmond Hills for few days, and I look around for Persian food and I came across this place. I trust Yelp reviews.  I was with few colleague from seminar, and I brag about Persian food whole time during seminar. It was four of us and I ordered Mediterranean Salad which includes Romain lettuces (looked old), tabooli, black olives, Hummus, Red Onions, tomatoes, Feta cheese balsamic dressing and also I had Falafel ( solid rock) wrapped in home made Naan (Lafa) and topped with fresh toppings.     Food was bad, and also one of my colleague ordered Beef Koobideh Kaboab from menu and when he was paying for it he realized he was charged more and when I asked the guy behind register he gave me long story of renovation, new price, and been short handed.  He did not say sorry or anything and at end asked for 5 stars on Yelp."}
{"text":"Kebaba recently underwent a huge renovation and as a result have put their prices up for eating in.  I'm not sure if its also reflective of their takeout menu.  I'm not super happy about the surcharge given they are one of the more pricier kebab places to begin with but at the same time their kebabs are incredible.  I think they make the bread in house as I haven't found anything like it anywhere else.  Their lentil soup is also amazeballs.  They give it as a complimentary taster when you're eating in.  So the food is absolutely delicious.    Parking is available behind the building and you have to walk up to the front which is not ideal BUT it's definitely worth the stop, park, walk.    So removed a star for the price.. but would otherwise be 5 stars from me for the actual food."}
{"text":"Ordered a wrap and found a piece of plastic in my wrap. Quality is nothing to write home about. The other reviewers here must be family because this is definitely not the best food place even within a 2 minute walk."}
