{"text":"The food from here is horrible. It is pre-cooked and they don't even heat the food before serving it to you. The chicken kabab was tasteless and there was no gravy to go with the rice. The owner was not helpful and couldn't be bothered about the customers waiting in line. No value for money and would not recommend that you go here. The place is dingy and I would think 20 times before I sat on the chairs. Bad experience."}
{"text":"I had chicken biryani at this place. It was average with very few meat in it. There was no gravy. Rice was bad. i had to pay $11 for it which pissed me off. I have had better food for lesser price in neighborhood areas. Ambience can be a little better. No complaints with service or anything else otherwise."}
{"text":"The place is, indeed, dingy. The owner is somewhat kind but for a $9 lunch special, all I get is 80% rice with 2 piece of tiny chicken curry and a bit of lentils. The food is pre-cooked and left without any heat to keep it warm. He offered to heat it up but he was going to put the styrofoam container into the microwave! That releases toxic chemicals!! I immediately said 'no thank you' and left.  The food tastes like re-heated frozen food. Bland, not much flavour. Will not be returning."}
{"text":"First off the restaurant is a sort of convenience store selling cigarettes and candy etc.  Its has a dingy and drab atmosphere inside, not even a fresh smell of cooked food. The chicken kabab I had was dry and tasteless, the man preparing my kabab wrap was not wearing gloves and actually licked his fingers to taste the hot sauce I asked for as im guessing he did not even know what was inside those bottles, he then proceeded to place his licked hand under running water for maybe 2 seconds to \"wash\" it, didnt bother to use soap OR dry his hand and with that wet hand continued to roll my wrap. If the food was amazing I MIGHT have considered forgiving that but the whole experience was disgusting. This place is dirty, the food is dirty, and you will definitely not ever return unless you need a 5 hour energy drink or cigarettes."}
{"text":"@TOFoodInspector #YELPTO  I am unlikely to ever use my \"Elite\" status on Yelp, but I am hoping my review is the first one to pop up here. This review is really just a warning. DO NOT EAT HERE.   Yelp wasn't bringing many results for \"Biryani\" near my place. This was one of them. It was a cold night. I had a few friends over. And the pizza concept was getting old. So I thought, why not order some biryani! We all excitedly agreed over this idea. Having lived in GTA, a biryani craving is legit mouth-watering when you know what to expect.   The biryani arrived looking like nothing that we expect. It was soggy, bright yellow in color, with some bright green pieces of rice as well. In other words, unappetizing. Then, we started eating it. And the whole thing was stale. 4 boxes of it. STALE.   I called the place to complain. Obviously, nobody cares when things have been paid and done for. But I had to complain because this was absolutely unacceptable. The guy over the phone informed that the biryani was cooked 11am in the morning. So, that apparently clearly \"justifies\" why the biryani must have not tasted fresh at 9pm. I tried explaining that it was stale - like a day old, maybe more - STALE. And he handed the phone over to his cook; who then informed me that this is their process day in and day out and nobody has ever complained about their food. That they cook it in the morning, and serve it till 2am everyday. If this is indeed true, which it shouldn't be if you're running a business in Toronto, something's totally wrong with their preservation process. He kindly offered to add in a bit extra for free next time I ordered from them. Well. THAT IS NEVER HAPPENING. You think I'll ever order again? I'd be crazy to.  If I die from food poisoning tonight, you know what happened. #deathnote Can I complain about this anywhere? anyone? Do advise if you're reading this."}
{"text":"Worst experience ever. Ordered on Uber eats... ordered chicken and received beef. Called to ask why that was and the man was extremely rude and told me it was chicken and that I could come there and he would show me. I know the difference between chicken and beef and had 5 friends with me who all said it was clearly beef. Terrible customer service, not only was it the wrong order but it wasn't even good, not to mention I don't eat beef! Don't eat here!! Especially from Uber eats."}
{"text":"Exactly \"ah...ok\"  Lots of taxi driver go and eat there but I guess they have a special discount there.  Food is OK, fresh (likely) as quite a good turn around, on the spicy side, but a bit expensive for what it is... I always have the impression that I would get twice the amount of food (and a little bit less fast food type) for the same price at Lahore tikka...."}
{"text":"Fresh naan at 2am for just over a dollar.  Hard to not like this spot for this fact alone.  The food itself is pretty standard, good but not amazing.  It is very reasonable however and open very late.  It is frequented by a lot of cabbies which likely accounts for its long hours.  If you are in the neighborhood late at night and hungry, a very good option."}
