{"text":"Abdul at the main desk was charming and the cook prepared some of the best kubideh and shish kabob I have had. The dishes are filling - kabob, rice, pita, salad, and kachummar with sumac, yogurt dip, and spicy green chili sauce on the side.   Very fair prices, fast service, and great location only minutes driving from the Strip. I will return here when I visit Vegas again."}
{"text":"Stopped in for lunch today and was happy to be greeted by friendly staff. The recommendations were delicious and I will be sure to stop in for a quick lunch the next time I'm in the area. Had both the chicken and beef kabobs, both were great. Five stars for great food and great value."}
{"text":"Excellent Indian food fast and good price. Staff was very friendly and helpful. I need to return to try some of the other dishes."}
{"text":"Wonderfully prepared food. This was my first time at Kabob Express.  I am absolutely satisfied and thankful we tried the resturant. Service was great, food was great, very clean spot anf overall JUST satisfying!"}
{"text":"I have eaten here a few times already and feel bad I haven't written a review sooner seeing as I've enjoyed every trip I've made here. I picked up food for the hubbie and I today and it's exquisite like usual. We ordered the Chicken Tikka Masala, Chicken Vindaloo, Samosas, and the Chile Garlic Naan. The flavors and spice are beyond amazing and the portions are huge compared to what you spend. It is truly something special and I feel so lucky to have a family owned establishment in my neighborhood of Laveen. This place is so yummy that even if we moved away I would make the drive to get my fix. Do yourself a favor and stop in and support them so we can keep them in business for many years to come! Remember what you spend in a local business stays local!"}
{"text":"I loved the food here! My favorite is the borani badejan! It's my go to place! I HIGHLY recommend this restaurant, you won't be disappointed. It's clean and the staff is very friendly. The owner was the one to take my order, he was a very nice guy and the food came out promptly! Love this place :)!!"}
{"text":"I am officially addicted to this place. I have passed by it many times and finally tried it for the first time. And it will not be the last. The curry was very good. Especially when you have a mix with chicken or lamb and rice. I highly recommend this place"}
{"text":"Great freshly made and grilled kabobs! The server was super friendly and so patient when we couldn't decide what to order. I've had a lot of kabobs and this one is a definite keeper! My entire family really enjoyed the meal."}
{"text":"Food was excellent. Service was a little subpar. Person taking orders seemed disinterested and not willing to help us."}
{"text":"Delicious! Ordered the Chicken Tandoori and it was amazing! Good customer service. Clean sitting area."}
{"text":"We just arrived at our hotel in Vegas and I was looking for a good Kabob house so I can order to go for a nice dinner for 4 at our cozy hotel.  Rating Summary:: - 4 Stars, For Vegas Standards: Yay, I'm A Fan - 3 Stars, Compared to SoCal Kabob Houses (Zankou, Kabob Exp, Open Sesame): Just A-OK   I order 4 items and mixed it up a bit so we can try all the meats: - Plate 1: Chicken Breast and Beef Tika Kabobs - Plate 2: Chicken Breast and Kofta (ground beef) Kabobs - Plate 3: Chicken Breast Kabobs, side dish - Plate 4: Beef Gyro Wrap - Sides: Salad and Bread  Summary of Plates Eaten: [see pictures] - Plate 1: Chicken (too dry) Beef Tika (good taste, little chewy) - Plate 2: Chicken (dry, bland) and Kofta (good taste) - Plate 3: Chicken Breast, side dish (my boy liked it, finished it) - Plate 4: Beef Gyro Wrap (my boy liked it, finished it) - Sides: Salad (need to get used to the dressing) and Bread (good eats)  Did I forget the hummus and tahini? I'll ask about it next time.  We'll be back in October to give it another try and see if the meats are still cooked the same way. Hopefully the chicken shish kebabs will be a bit bigger with more seasoning so it won't be so dry and bland.  -FM"}
{"text":"Always a pleasure to come in and eat. All the negative reviews always complain about customer service but never have I had issues and the reason being for this is because I am not picky and rude to the staff. If you come here, sit down, take your time, and enjoy your food as it should be then it will definitely be worth it. All the food is made from authentic family recipes and made fresh from full kosher (halal) meat. This restaurant is a hidden gem. My favourite recommended plate is the number 8 (chicken and beef sultani). The chicken is marinated in a delicious yogurt based marinara and the food is cooked over an open flame grill. Delicious. Another recommended plate is the chicken shawarma wrap with fries and a drink.   If you love small genuine places to eat this is one. The manager and employees will remember you and they will become your second family."}
{"text":"This is probably the best afghan restaurant in las vegas. The food and the service was great. I recommend this place if your looking for best kabob, and do try the yogurt drink."}
{"text":"My fiance and I love this place! We usually get a Chicken Beef Sultani with an order of hummus and some Maast Wa Khiar sauce. It's one of those places where you wouldn't expect such good food to come out it, but you would be pleasantly surprised. The word \"Express\" in their name, really doesn't do them justice. The food is very well prepared. It's a hidden gem located on the east side of town."}
{"text":"They take forever and both the fish wrap and falafel are average. Service was also sub par. They left our meals sitting on the counter for 5 minutes while taking more orders. Meh."}
{"text":"Great food - quilt free and healthy options available. Prepared and presented well."}
{"text":"Ordered food to-go. Man on the phone says 15 to 20 mins. Went there 20 mins later. Man says another 20 mins - rice is not cooked. Offers me French fries instead of rice. Price online on their website and store do not match. Needs updating. Took me total 40 mins to get food to-go."}
{"text":"I've been a regular at this place for a long while. I always get the tandory chicken kabob, it's my favorite! I also like the bread they give, it's really soft. The green chutney is also nice, kind of tangy. I knocked one star off because I've noticed the size of the chicken pieces has dramatically decreased. The meals used to have large breast pieces, now they're almost bite size, even though the meal costs the same. Tasty but too small!"}
{"text":"Good food.  Lousy customer service.."}
{"text":"My mother and I stopped by kind of randomly searching for tacos and when we saw this place we both said at the same time... what about kabob? I turned the car around to go back.. (Sorry Mexican food, as much as I love a taco carts, middle eastern food wind hands down almost every time).   The cashier and cook were bright eyed guys that seemed much smarter then their present positions. The cashier was very proud of and passionate about the food and the cultures it came from and had quite a lot of information to share about the word derivatives spellings pronunciation and history of the same foods in different regions of the middle east. We both found him welcoming and playful, not over serious about the information, just happy to share. he was explaining the language bases of Iran, Afghanistan, and Arab states talking about how Persian language is actually an Indo- European language with a barely modified Arabic alphabet and Arabic influence.. I never stopped to think it was closer perhaps to French then Arabic.  The food...pretty awesome. It was clean, well made, and delicious. My mother was particularly enamored with the rice. The only thing we didn't finish was the pita. it was nothing special and a little dry.  The menu was limited in terms of vegetables. This was my only real complaint. I guess its better to do something small and do it well but places with limited vegetables lowers the standard a little for me. I eat meat but don't always and am a much happier eater if there are lots of  veggies. Wile there were several options for kabob there were only sides of a grilled eggplant dish, a spinach dish, and a green salad and the same green salad with chicken on it as an entree. more veggies please!  The atmosphere was well lit and clean. There was some culture specific art on the walls from Afghanistan (remember  that haunting national geographic photo of the girl with the amazing eyes?) and Iran and there was a fair amount of seating and the tables and chairs were better then usual for a strip mall restaurant but you could still tell you were in a strip mall. We carried out because we were dressed poorly having stopped there after doing some construction in the house. I  was afraid I'd get  construction dust on the chairs if i sat down. And the other diners were dressed like  professional people, some button down shirts a few polo shirts and slacks.. so it was nice enough for me in my ripped and paint covered work clothes to feel well under-dressed. I'd say its classy for a strip mall but you still go to the counter and take your order and get served on a standard red restaurant tray.  Other customers were speaking in what sounded like the few farsi words i know. To have a place be frequented by people of the same culture is always a good sign.  I would definitely recommend this place and so would mom."}
{"text":"Update: my husband went back and spoke with the manager, who insisted that there is no way they can accept paper vouchers despite the fact that Yelp states that they can. Caveat emptor."}
{"text":"We greatly enjoyed our date night here. The Lamb Biryani was great. I had the Chicken Kabobs and thought they were good but not great. Try the Mango Lasi!!"}
{"text":"This place is my new boom. Their kabobs are seasoned and grilled to perfection, tantalizing the taste buds with every bite. The great portion sizes are suitable for two, which makes sharing a plate ideal. I pass this restaurant frequently but am glad I actually stopped this time"}
{"text":"i have never been treated worse than I was here they literary 86ed me for having one of their own coustomers kids help me pick up my change i spilled"}
{"text":"Excellent Middle eastern food at a low cost. Staff also very friendly. Probably the most valuable place in Vegas."}
{"text":"Tha most amazing chicken  tikka masala  I've ever had !! If u in tha Area definitely stop and try this place"}
{"text":"Went here based on the reviews and wasn't disappointed   Fresh,  very flavorful food. Picked up for lunch for my colleague and I and we both really enjoyed it."}
{"text":"The wait is worth it! Your food is cooked to order. Quaint place with really good chicken kabobs that I am still craving again. I loved the spices on the chicken. I ate everything on my plate- it's that good. Great service and good price."}
{"text":"I was pleasantly surprised but Kabob Express.  The food was tasty delicious and the service was fine.  Its not a place I went to because I expected wonderful table service. All in all it is excellent and I would definitely go again."}
{"text":"This is one of those quick serve, dine in, or take out places, but it doesn't quite feel like one of  THOSE places.   It's very clean and inviting on the inside. The men who run the cash register/cook here are friendly and work fast.   The food is high quality and fresh. I ordered the combination plate with chicken and steak kabobs served on top of a heaping mound of rice. The meat was tender, moist, and hot off the grill. A small salad and diced cucumber/tomato is served on the side along with a thin, spicy,  green sauce which you can tame with their cooling tzatziki.   I recommend ordering a side of the hummus. It's not grainy, stale, or bland like the hummus at other places.  It's blended smooth,  served with a sprinkle of paprika and drizzled with oil. You can actually taste fresh lemon and garbanzos.   Light eaters will be able to split their plates into two portions.  Others won't leave hungry either. I will be returning to eat here soon!"}
{"text":"Most delicious chicken tikka masala. So obsessed with this place! Looks like just a little hole in the wall but you have to give it a try! The portions are huge - you can get at least two meals out of one order! Worth every penny :)"}
{"text":"A co-worker and I passed by this place on our way to get Chinese food but decided to give Kabob Express a try and was glad we decided to skip on Chinese.   The place is pretty small but very clean and the gentleman at the front was very welcoming.  Everything on the menu looked good but wanted to try a little bit of each of the meats. I decided on the meat combo which consisted of chicken, beef, and kefta. Each of the combo plates came with your choice of meat, rice, salad, and a pita bread. I wanted to go all protein so asked for the combo without rice but the cashier highly recommended the rice. You can certainly tell he was very passionate about his food and stood by it 100%. I also got a free soda with a yelp check in which I gave to my co-worker. Since I didn't order a drink for myself the cashier went ahead and offered me another free soda. Nice!!  As the food came out I noticed the portions were pretty big. The meats were very tender and the chicken was very moist. The beef to my surprise was so tender I was able to separate it with just my fork. My favorite was the Kefta. I believe its made with a combo of beef and lamb but the spices is what really makes it stand out. Oh and be carful because you'll get the garlic burps after eating the kefta. I didn't mind since I was able to taste it throughout the day, it was that good. Also ask for the cucumber yogurt sauce and the spicy green sauce as both go perfect with the meal.   Overall this place fully satisfied my protein craving. I would definitely come back. Awesome kabobs."}
{"text":"Chicken curry was delicious as well as the naan bread! I think the price is right on point for the portions you get."}
{"text":"Laveen has very few choices for restaurants and most of them are typical fast food, so I was thrilled when I saw a restaurant with the word \"Kabob\" on it! We stopped in and at first glance, Kabob Express looks like your typical hole-in-the-wall take out joint, but there was a line of people ordering ahead of us and we soon found out why.  The woman at the cash register was very friendly and helpful. I ordered Chicken Korma and my fiancee ordered the Beef Biryani and we ordered some garlic naan. I'll preface this by saying that I'm a huge fan of Indian and Pakistani food and have been eating it since I was a child, back in NYC, so I'm very picky about my Indian and Pakistani food and have high expectations.  If you're looking for a restaurant with decor and ambience, this isn't it. This place is all about the food. It has red plastic booths (one of which was loose when I sat on it) with chairs, and purple walls. There are boxes stacked towards the back. That was a turn off and truthfully it's the only reason I gave this restaurant four stars and not five.  We didn't have to wait too long for our food which was brought to us in plastic take out containers.  My Chicken Korma was rich, creamy and flavorful, filled with a lot of dark meat chicken. It wasn't too salty (as some korma tends to be). The one word to describe this dish is \"heaven\". It's absolutely the BEST Chicken Korma I've ever eaten in my life. So good, in fact, that even though I was full, I wanted to continue to eat. My fiancee enjoyed his Beef Biryani...a large bowl of rice with chunks of beef, which he said weren't tough but they were flavorful. It's served with a sliced lemon and cold hard boiled egg on top (He wasn't fond of the hard boiled egg). The garlic naan was home made and fresh and absolutely delicious. Dipping that in the korma sauce was incredible.  Prices are a little on the high side for a take out restaurant, we paid about $30 for our meal (including a can of Pepsi that we shared....they didn't have ice to serve fountain drinks that night).  If you're looking for really great food in Laveen, this is the place. If you're looking for great Indian/Pakistani food anywhere in the Phoenix area, this is worth the drive. I know they just opened but if they can spruce up their decor a bit and get some ice, this place is going to make a mint.  Fantastic food!!"}
{"text":"The food is delicious but the service could be better/more organized.  It is really nice to get great food and a little diversity, especially since Laveen doesn't have many places to eat outside of a drive through.  My order was wrong and the lady wanted me to wait in line to correct her mistake, they could be a little bit more organized with the orders and service especially when you're paying 15.00 for a plate of food."}
{"text":"There was a cockroach on the counter as we were giving our order. I could not believe my eyes. I would recommend not going to this place until a health inspector pays them a visit. Id rather eat horrible food that's clean than the cockroach infested stuff they're serving. STAY AWAY!!!!!!"}
{"text":"Excellent food! Great prices.... I love the #6 Steak and kobedah( ground Beef) with rice and salad. About $10"}
{"text":"The place is great; not fancy, but clean with service provided by a courteous staff.  My wife and I stopped here to pick up some feta cheese, olive oil and other Mediterranean groceries, saw the dining room and decided to stop for lunch.   Her felafel sandwich was terrific, my kabobs were great - both served with saffron spiced basmati rice.   It's a twenty minute drive from the strip but worth the short trip. Try it!"}
{"text":"I've been eating east Indian food all my life, from California to Indiana, and Express Kabob is some of the best Indian food around!  Food is Cooked to Order, choice of mild to spicey. Staff is friendly, and place is clean.  I've tried their Chicken Korma (my fav), Chicken Tikki and their Chicken Curry at a medium spice and each dish was delish!!!  If you like Indian food or Kabob's come check it out! The best and only local restaurant for east Indian cusine."}
{"text":"Apologies to the owners, as this place hasn't been there long, i've been waiting a while to try them out. This doesn't do justice to the food...I stopped by after work and grabbed a mixed grill (multiple tandoori, looks like it'd be good for 2 people). got it home, and i'm not sure, but I thought it was supposed to come with rice and naan...I only got the naan. Naan was good, chicken was good, but the shrimp was dry, and the beef (lamb?) was super overcooked. Very dry, and i just had to spit it out and move on. Lettuce and tomato/cucumber was meh, not what I came for. and no sauce at all? no yogurt? everything was just average, and that is terrible for a 16$ entree (18 after tax). Maybe I'd try it again, but not likely. Go to curry corner instead."}
{"text":"Simply Amazing!  Flavorful foods.  Nice staff.  Relaxing environment.   My girlfriend and I both had an order of chicken shish kabobs and an order of hummus.  The hummus was so flavorful and the pita bread was warm and perfectly made.  The chicken on the kabob plates was moist and very well seasoned.   The rice... oh my lawd was that great rice!  Yes, this place is a \"hole in the wall\", but dang the food is good!  Will be returning again in the future!"}
{"text":"Ordered falafel, gyro, and fresh tzatziki. All very good and earned a solid 4 stars until the metallic tasting hummus that came with the falafel dropped this foodieview down to 3 stars. It's common foodie knowledge that hummus has citrus juice in it, but don't store it in metal containers without first lining the container with a barrier between the contents and the metal. In any case it's a good practice to use a lining in all metal containers when using them with food. The metallic taste of the hummus had me wondering how long they've been serving that batch before making a fresh one. A&E Foodieviews plans on stopping by Kabob Express again because well made falafel is far and few between, and hopefully the guys in the kitchen will have some proper hummus ready to serve."}
{"text":"Finally some food diversity in Laveen.  I tried the chicken tikka masala and it was the best I've had anywhere, including New York.  I'm definitely looking forward to trying other items on the menu.    This would be a Five Star review on taste alone, if not for the food being on the expensive side."}
{"text":"This is the best Kabob place I've found on the East Side. We usually do take out and the meat is cooked and seasoned perfectly and the rice is delicious. Very gracious staff as well. I usually order the beef kabob and I love it."}
{"text":"Absolutely delicious! I went for the first time and ordered the chicken kabob and I was really impressed. The cashier was friendly the restaurant was clean and the food was perfect! Definitely worth the drive if you don't live close by. I can't wait to go back yummy!!"}
{"text":"Place has very unique South East Asian food to offer from spices from different countries. Food is prepared, when ordered. Friendly staff."}
{"text":"Come here every week. Love their lamb and beef biryani. Medium spice is really hot. I like hot, so I get medium spice. If you can't handle extra spices, I suggest you get mild. Food is fresh and good service.  Only complain I have is the upwelling. I don't drink my calories. So I don't drink soda or anything. I like plain old tap water."}
{"text":"Price matters.  The prices are exorbitant; just too high.  I found the kabobs to be tasty but the portions were disappointing.  I wish I could have rated the place higher but the prices would be considered high even for an established restaurant with servers and atmosphere.  I also waited 30 minutes for my order despite there being one couple seated; it was clear to me that the kitchen wasn't ready to work on one order at a time.  I won't come again."}
{"text":"Food and service are bith great, those guys care about their customers and know how to serve people and make good food. I only give them 4 out of 5 cause the sitting area is small and need some decorations. Would go back there for sure."}
{"text":"Just moved to area and figured I'd give it a try.  I will be back!  The flavors used were amazing.  You can choose your level of heat with the spices.  Super excited that they deliver in my neighborhood as well!"}
{"text":"My husband and I found this place like 2 years ago and when we in the mood we go there for him it's the gyro combo and for me it's the lamb kabob plate. So yummy . Half way thru the meal we stwich and i get my Husbands fries and he gets my rice. The green dressing is so good (but beware it's spicy). They use a special blend of spices for they fries  and they are  so good. No prepared food they cook when u order so if they busy it can take a while.  Also the hummus is really good.  Really good middle eastern food."}
{"text":"The food here is amazing! My brothers and I eat here at least one or twice a week. I usually order the chicken tandoori plate and the portion is huge. The food is tasty, always fresh. The customer service is pleasant as well. Also, if your a fan of hot sauce ask for it! It is one of the best hot sauce I have ever had. Keep up the good work Kebab Express."}
{"text":"The Kabob Express is in a satellite section of a Mall anchored by a Marketon Grocery Store. Right on the southeast corner of Tropicana Avenue at Eastern Avenue. It is an unassuming place in the middle of this small strip area at the front corner of the entire Mall.  Libby and I went in and looked at the menu items up on the wall. We ask the Fellow at the counter a question or two, made our decisions, ordered, and paid. We took some of the plasticware and filled out drink cups. We took a nice table with a view of the parking area and the intersection.  I ordered a Number 5, Lamb Kabob Dinner and Libby a Number 3, Chicken Breast Kabob. I do agree that it took a while for our order to arrive. The Chef cooked each order separately in a very hot kitchen area. Two families were already eating, one table of two was waiting and then us. The interior was clean, spacious, and cool. It didn't bother us to wait but, I believe that this Express is really a \"Local\".  Our food arrived. Mine was a full plate of seven pieced of wonderfully cooked lamb. Cooked and browned well on the outside and medium rare within. The pieces were about 1.5\" X 1.5 \". They were really nice sized chucks of juicy meat. There was also some romaine with a creamy dressing, seasoned rice, and a nice portion of tomato, onion, parsley salad that I usually call Israeli Salad. It was cold and flavorful.  Libby's chicken kabob dinner was just like mine with the exception of the chicken instead of lamb. The chicken pieces were a hair smaller than my lamb pieces. They were cooked nicely and had a yellow color that I believe was the addition of some turmeric to the chicken marinade. Her chicken was moist and done perfectly. The pita on each plate was about a 3\" size, warm, flavorful, and soaked up a lot of sauce.  I had asked for some Maast Wa Khfar which is yogurt and cumber sauce. It is known in Greek as Tzatziki Sauce. It was cold and had a fine flavor that went well with my Lamb. With our dinner cam a small plastic cup of a green vinegar sauce that was like fire. I am still trying to find out what is in it other than \"grated spices\". So, beware of this \"Green Dragon\"  if you have a tender palate.  All in all this was a fine stop for us and a belly full of food for $20.00 bill. It was good enough that I ordered a pair of lamb kabobs and  container of the cucumber sauce to take home.  Give this place a try. the food is well worth it. Remember though, it is running on the \"local\" track and is definitely not an express train.  My FIVE STARS for the food."}
{"text":"Perfect Tandoori Kabob, had a wonderful experience here with a group of 4. Enjoyed to #10 King Platter which comes with Lamb, Beef, and Chicken Kabobs. The chicken kabobs were seasoned with tandoori masala and they were perfect. The other kabobs were seasoned well. Price is great for Las Vegas."}
{"text":"I got the paalak paneer and garlic naan for lunch takeout and had enough leftover that I ate it for dinner too. Was still making yummy noises when I finished it off. My husband got the beef biriyani and was very happy with it. Plus, we got mango smoothies and if you can imagine rainbows accompanied by the sound of angels singing then you pretty much understand the effect of their deliciousness."}
{"text":"First time and fell in love with the food, they take some time to serve but you get something freshly cooked and delicious, I recommend Sultani, It's very clean and inviting on the inside and the food is high quality and fresh."}
{"text":"Good food at a good price.  Better than Parsley and I would put them on par with Stefano's."}
{"text":"I'm reluctant to write this review because I want to see more diversity of food offerings in the area, but I gave Kabob Express a try last night and it wasn't a good experience.  I ordered the lamb shish kabob and it was overcooked to the point of being hard.  The flavor wasn't right either - far too much black pepper.  Even the side of onion rings I ordered was overcooked and hard.  I'm hesitant to give the restaurant a second chance."}
{"text":"I love this place. Clean place and excellent customer service. The food was amazing, me and my wife had lamb and chicken. It was jucy And tender. This is my first time eating lamb. The price is affordable and the portions are very big. My recommendation to anybody."}
{"text":"Ordered takeout on a Sunday night and food was hot and ready at the promised time. Ordered: lamb vindaloo (med), aloo gobi (med), and chicken biriyani (mild). The chicken biriyani was my favorite, good portion size and plenty of tender flavorful chicken-will definitely order again! The lamb vindaloo was decent- the lamb was tender and the flavors were good, but the lamb to potato ratio was off (lacking lamb, considering price.) Aloo gobi was a little soft, but that could be my fault since I ordered it as takeout.  Other notes: probably wouldn't order the samosas again-I've had much better. Also the naan was a little different in flavor and texture than I am used to. However, my husband enjoyed both.  Tip on heat: if you're on the fence about ordering some spice, leaning toward possibly less spice, go with the mild. The medium has a definite kick, which was ok for me, but with this knowledge will go with mild next time (unless I am feeling particularly spicy).  All-in-all, the food earned 3 stars compared to other Indian food I've had (both on the east and west coasts of the US and traveling through India). But earned a 4 star because the food was considerably much much better than most other restaurants you could find in this area."}
{"text":"Unbelievably amazing curry!!!! If you know me you know curry is my favorite food, and this place does not disappoint! The hot lamb curry was delicious and very filling, and not too hot. Will be coming back as much as possible. Coming back later to get lunch for tomorrow"}
{"text":"The food is delicious! This was my first time here, and I'm so glad I decided to give this place a try."}
{"text":"A \"no-frills\" place (e.g. plastic utensils) but good, inexpensive food, a big menu, and friendly service!"}
{"text":"My family loves Persian food, so we decided to try out this place based on great reviews here. It turned out to be a disappointment. The food was relatively fresh but average taste, it was strange that they add salsa to the plate. I'd say the food is just eatable, nothing great or special about it for how much we paid."}
{"text":"The food was great and also the service. We ordered almost every type of kebab on their menu. The meats were tender and tasty. Chicken was well cooked and moist. I was very happy with their rice as it had a subtle taste of a spice which is popular in Afghanistan. The manager was also very nice and friendly. Just beware they don't have a restroom, just a faucet to wash your hands."}
{"text":"The Shawrma was good but it doesn't fill you up atleast for that price. I would prefer to go next door to El Tizon where for about the same price you can get a pretty good sized hearty meal but thats just my opinion. The mexicans sure know how to feed people maybe one day they can master the kabob and open one up of their own mexican version of a kabob joint."}
{"text":"The best Afghan food in Toronto. No matter what time of day we go, the food is always fresh. The staff is always friendly and welcoming!"}
{"text":"Kabob express! What can I say. I crave for you everyday!   Their staff are so friendly and have good customer service. We didn't even have to wait long for our food to get served. This is our go-to place here in the office. The food is so worth the price, and I love how they have shawarma too! Yum. :D"}
{"text":"Don't come here if you are in a rush, definitely not \"express.\" We came in at 1:30 and it took about 25 mins to get food. The food is marginal, but the prices are acceptable. The chicken in the shawarma is plain and all the ingredients are also plain. Bread is 2 stars. We also got the tandoori chicken which was a little better with more flavor. The rice was the only thing that was good. We will go somewhere else next time."}
{"text":"Not a great price to Value ratio but the food is fresh the service is good portions are descent"}
{"text":"I had the chicken biryanis.  The chicken was undercooked so I only had a few bites.  The rest of the dish was okay but not something I would be that interested in having again.  We also had the lamb kabob.  The lamb was quite chewy and not as tender as you'd like.  The salad that came with it was iceberg lettuce with a slice or two of tomato and cucumber.  The garlic naan was okay and a little doughy.  It's a casual fast food type setting on the inside.  Clean and comfortable.  The staff was very nice and very helpful in going over the menu.  I doubt that we'll go back."}
{"text":"Easy to find, SE corner of Eastern & Tropicana. Small restaurant promotes friendly service. Good food at a reasonable price. Beef and chicken Sultani platter - $11. Large portions."}
{"text":"I had the chicken tikka masala and my husband had the tandoori chicken. I've had Indian food in fancy Scottsdale restaurants and this was just as if not better than what I've had! Everything was so good! And the mango lassi was yummy!!!! Will DEFINITELY be coming back!"}
{"text":"Kabob Express is a great local gem here in Laveen.  The food is authentic and homemade. My favorite is the butter chicken and daal tarka. The food is cooked fresh, therefore takes a little time.  Definitely worth the wait.  I've been to many Indian restaurants and this by far is one of the best!  I would definitely recommend trying out this place. Staff is very nice as well."}
{"text":"Best Kabob I've ever had. I love their House Dressing its Delicious! I sure miss it now that I changed my job location.!! Love their spicy sauce which I can never remember the name."}
{"text":"Been coming here since 2008  Always good!!  Great food!  Good atmosphere.  Wish they would sell alcohol!"}
{"text":"Ummm...not so good. Lamb was way overcooked. Bread was rubber. Medium heat on food was way too hot. It was a trip to the bathroom at 0100 for myself and others in the house that indulged."}
{"text":"Finally! We have amazing Indian food in Laveen. If you like authentic Indian food or have never tried it, you must give this place a try! From the outside, this place can be deceiving. It almost appears to be fast food, and we had overlooked it for a few months. Upon trying it, we found that they have an amazing menu and awesome lunch deals. The owners are so friendly and accommodating, and it is obvious they are passionate about their food. The chicken korma and lamb tikka masala are dynamite. Great naan. They also have a mango smoothie, which I honestly believe is just pure mango. It's a definite favorite of our family- we often get it to go as dessert. You can also order takeout, which we do on the regular. We've never been disappointed."}
{"text":"Place was kinda disorganized and the owners looked lost, But at the end of the day I left with a smile  The chef in the back knows what he's doing. Try the kofta #4 Literally best Persian food I've ever had, yes a  very bold statement! Food came out fast and fresh. Prices are decent  And Food is also halal!"}
{"text":"We came in here because we were shopping nearby, and glad we did. The prices were reasonable, the service friendly, and the food really great. We both had the beef tikka kabob platter and it was amazing. Some of the best hummus too! Clean dining room and welcoming atmosphere. I would definitely come here again."}
{"text":"Best kabob place in town hands down. Had beef kabob w egg plant and spinach food tastes very  authentic  can't beat that!!  Lot of food enough for two people to share @ a reasonable price. Highly recommended good customer service too."}
{"text":"Kabab express has been the greatest restaurant that has happened to Laveen.  The staff is so inviting and humble, the food is extremely amazing with such an authentic Indian taste.  Every order is freshly made for take out and dine in.  The butter chicken is to die for,  the Daal Tarka is so tasty and recommended it 100%. I recommend everything.  Come in and see it for yourself!"}
{"text":"Not good. Low quality food. But it's cheap. The portions are small and there isn't much of a selection of healthy drinks."}
{"text":"This is the place. The King Sultani is my favorite. I've tried many similar restaurants back in the San Francisco bay area, and was hoping to find a local one after moving to Vegas. So now this is my go to place for some nice kabobs."}
{"text":"I love kabob express, a friend told me about it and I never know what to think when people tell me about new places to eat, but I was really happy going here.    First thing you have to understand, this isn't a full restaurant, this is not like the hookah lounge; Kabob Express is a specialized place. I often compare this place as the in-and-out of the mediterranean world. In-and-out, only has a few things, but they are GREAT at what they do have, and they have KILLER Fast Food; compared to Mc.D, Wendy, Burger King, etc..etc.. In-n-out isn't as good as some of the high end burger places here in vegas ( if you want to spend 80 dollars a burger). However In-n-out is killer for great food fast. Well Kabob express is the same way, The wife and I went there last night, it was 21 dollars, and she had lamb ( yum) and I had a gyro. The food is fast, it is as good as home cooked, and we love it. We have been there 10+ times and never a problem. If you want really high end mediterranean or some place for a nice romantic dinner, this isn't the place to go. However if you want to sit down and eat some great food after shopping, or a day at work, go here and you will love it.."}
{"text":"As an Indian food aficionado, Kabob Express is amongst my top 3 favorite Indian restaurants in the Phx metro area. It's a small, family run business that is absolutely killing the Indian food game in south Phoenix/Laveen! The owners are so sweet and make you feel welcome in their restaurant!   I have ordered the chicken tikka masala, chicken biryani and naan several times. All items were a 10/10! The chicken is tender and the sauce is SO flavorful. You can tell they infuse love into their cooking.   RUN, don't walk, to Kabob Express!"}
{"text":"We tried this place on a huntch...and been craving it every since. I like the beef kabob and the bronie....cooked perfect EVERYTIME we've come. Hubby loves the gyro. The  tzatziki sauce is the BEST. Excellent customer service. Delicious food. Always cooked fresh."}
{"text":"Those of you who live in Laveen know that there are a lot of restaurants around here now, but it's usually the same old stuff over and over. I saw Kabob Express a few months ago and hadn't tried it. I wanted to do something different today.  I went there this morning after they had been open for just a few minutes; there weren't any other customers at the time. I had seen a review about the butter chicken and wanted to try that out. the ladies at the front were very friendly and gave me some suggestions. I went ahead and ordered the butter chicken curry (medium heat [I like my Indian food spicy but I wanted to gauge their spice first]) and some garlic naan.  They cooked it up relatively quickly, about 10 minutes, and I took it home.  When I cracked open that container, all I could smell were the warm spices from that sauce. The rice? Perfectly cooked and fragrant.  Popped the curry and rice in a bowl and took a bite.  Maaaaannn... where have I been?  That butter chicken was unbelievable.  It was white meat and was a little firm, but the immense flavor of the dish made that easy to overlook. The sauce had a nice spice to it that lingers in the aftertaste (may try it a little spicier next time!).  All of it goes great folded up in a piece of that chewy, crispy naan.   If you haven't had Kabob Express or Indian food in general, give it a try. Don't expect to pay fast food prices for it, either; this is the good stuff and it's well worth it."}
{"text":"Food was good. Flavorful sauces, spices, and rice. Staff is arrogant. For example, we have been to the restaurant a couple times so they know us, last time I had a cast on leg, my friend and I were the only ones in there, we asked if he would bring the food tray over to us, he would not. That was both rude and odd. I guess its a cultural thing."}
{"text":"Be-aware its not an Afghan restaurant, just have limited traditional middle-eastern food which is avg in test. I wasted my time by driving 20 minutes to this restaurant for Afghan food. You wont find traditional afghan dishes like Qabli Pulao, Bolani etc here."}
{"text":"First time here.. OMG.. Incredible... We tried the butter chicken, lamb, beef curry.. Hands down the best curry we've ever had!"}
{"text":"Love this place, I always stop in when I am in the neighborhood. Never had a bad meal at Kabob Express. The place is clean and the owner is pleasant."}
{"text":"Amazing! The best Kabob joint in Vegas by far. Reply authentic cuisine. Consistent quality, friendly staff and very affordable food. Too bad they don't have real silverware and serving dishes. Foam plates and plastic forks are so beneath the food."}
{"text":"The chicken tikka masala deserves 5 star because it's on point but the garlic naan, not so much....  But then again today is their soft opening so maybe in 2 weeks things will change for their grand opening.   Garlic naan was a little on the thick side but it had a weird taste to it. Also the garlic wasn't cooked all the way."}
{"text":"I was in Vegas for a couple days and came across this place. Amazing delicious food. Highly reccommend."}
{"text":"Well this gem is a little out of the way, but well worth the drive. The best butter chicken I have found in Az. The spice level was perfect, the flavor was amazing. The garlic naan is delish. This is not a place of high design or ambiance, but the food is great. Served in take out containers even though we dined in, however we ended up not finish it so it was already packed to go. I will travel back for the food, seriously it is addictive!"}
{"text":"Kabob Express is a great spot for a quick healthier lunch. I usually get the chicken wrap, the combo comes with fries and a drink. The wrap is very flavorful, a little messy but very tasty. Make sure you get the hot sauce to go with it. I've still got the kabob and other meals in my list to try."}
{"text":"Great gyros, but the lamb and rice is to die for. Prices are reasonable and the service is great."}
{"text":"I can't help but notice how many reviewers keep using the term \"soft opening\".  I don't even know what a \"soft opening\" is, but how long is it supposed to last?  The man who worked the front area was very friendly, and also mentioned this soft opening thing.  What this meant to me: half of the menu was unavailable and as others have said over a MONTH ago, they have no ice.  I really want to like this place and I want it to succeed, so I will do a pros and cons.  Pros: - The food that I did get was VERY good.  My family shared the paneer tikka masala and the mixed grill platter.  The platter came with a salad and plain naan bread.  The tikka masala comes with a side of rice which is very good.  We also ordered an extra side of garlic naan.  Everything was delicious!  We would come back here over and over just for the paneer tikka masala. - The portion of the mixed grill platter was huge!  Three of us couldn't finish it, though we did have bread and the paneer tikka masala as well.  The bread is a good size. - Friendly staff.  The man at the counter did his best with what he had and he was very friendly and attentive.  My girlfriend got a little choked up on a raw onion and he was very apologetic and concerned for her. - The location.  This is the only Halal restaurant that I've been able to find within a 15 mile radius.  The fact that the first few dishes we tried were AMAZING makes me hopeful that they can overcome the cons.  Cons: - I had to change my order about 4 times because most of what I wanted was not yet available because of this strange soft opening phenomenon.  I wanted a beef kabob.  This was not available at a place with kabob in it's name. - The lamb in the mixed grill was dry.  I don't have a lot of experience with lamb, but I would imagine it could be a little better. - We paid $40 for the two dishes and extra bread.  That's pretty pricey, considering many places who serve the same kind of food have all you can eat buffets for $9.  Maybe lower the prices a bit. - This place is really disorganized.  When we walked in, the only menu available was the paper one on each table, in looking at the yelp pictures, TVs used to display the menus, but during my visit they were all off.  I understand growing pains, but the nice man at the register seemed to have more excuses than solutions.  Sick cooks, managers on vacation, etc.  They have a HELP WANTED sign on the door, and while we were eating a man came in asking for an application.  He was told to come back next week, the man in charge of that was on vacation apparently. - Confusion abound!  I watched 3 or 4 customers walk in, grab a menu, stand awkwardly and then leave.  That's a lot of sales lost and I guarantee it's the confusing setup of this place.  The man at the register didn't really help much to explain to those people, and had a hard time ringing me up.  I really like the guy and he said he was new and he was trying really hard, but this place really needs to step up the game in the eating area.  We were the only people there the whole time, that's worrisome. - Some customers came in who I'm assuming know the owners and employees and are from the same part of the world, so they were speaking in their native language.  Those people seemed to get preferential treatment over other customers who came in and out, which is another point for lost sales.  I understand it's great to see someone from your home, but don't ignore everyone else while you converse. -$1.75 for a small bottle of Fry's bottled water.  Nuff said. - My biggest beef?  When I ordered, he asked me if I wanted it for here or to go.  I said for here.  When he brought the food, it was all in to go containers and he gave us plastic utensils.  for $40, don't serve me food in a Styrofoam box and put my panneer tikka masala in a plastic cup.  We had to awkwardly unpack everything at our table. - The salad that came with the mixed grill in the Styrofoam box had zero salad dressing on it.  I saved it and took it home to put dressing on, but what the heck?  Why? - I agree with the other review that mentions how long it takes.  It took forever, so yeah, the Express in their name is ironic.  I want to make this a 4-5 star place, so I will be going back in a month or so to see if they've made any progress.  If it's the same painful experience, as good as the food is, it's not worth all the money and effort."}
{"text":"Cliff's Notes: food was good but the register jockey was a d-bag and I was charged extra for food I never got.  Went in with restrained expectations based on what I read here.  I never hold service against a place, I'm going for the eats, not the conversation.  A friendly chat is nice but not required for me.  Well, the butthole at the counter met my expectations on the crap conversation.  Had an attitude with everyone he served.  Anyway, that's fine.  What's not fine is charging me extra for hummus and eggplant and not giving them to me.  I got takeout so it's my fault for not checking before leaving, right?  Wrong.  It's not my responsibility to check.  But from now on, I will.  Sick of getting shafted like that.  Anyway, won't be back.  I'll try somewhere else next time, someplace they maybe don't care to chat but at least actually care enough to give you what you paid for instead of shooing you out the door to get back to their texting.  What food I did get - a few little meat chunks on a broad expanse of rice with some undressed iceberg lettuce on the side - did taste pretty good so enjoy your second star, you unlovable bastards."}
{"text":"I have tried so many Indian places so I know what good Indian should taste like. Here, I tried the butter chicken and chicken tikka masala. Overall, the flavors were okay to pretty good...but the reason I give 3 stars is consistency of the sauce. The sauce is sooooo liquidy. Very runny and confusing almost like water. Rice is good, chicken tastes good, paneer tastes good. I recommend another Indian restaurant that has normal sauce consistency."}
{"text":"Afghan-style kebabs:  chicken, beef or eggplant.  No lamb or goat (BUMMER!)  The beef kabob offerings looked more interesting than the chicken, but I'm allergic to beef.  The chicken kabobs were not as interesting as I'd hoped, but they were good.  I would have liked dark, slightly oily, slightly stringy chicken better.  This was good-quality white chicken breast.  The salad and chopped tomato/onion/cucumber relish were both great, though."}
{"text":"I smelled this place while I was actually driving to another fast food restaurant. It was an amazing smell that superseded the other unpleasant smells in the area. So I went inside and ordered the #8 which is a chicken and beef kabob. Comes with saffron rice, one 6\" pita circle, lettuce and a side of what looked like greek pico de gallo (I didn't eat it). The meats were flavored so well! The rice was really good too. The staff was friendly and I ordered to go. It took about 15 minutes to get my food and there wasn't anyone else in there but I wasn't in a huge rush. Good food takes time to cook so I didn't mind. But the name suggests (to me) that you should be in and out of there in 5, no later than 10 minutes. I'll be back for sure."}
{"text":"This was one of those \"been meaning to try this place\" and I finally did.  Airy and clean and it smelled so good when entering!  I really wanted a vegetarian kabob, but since it wasn't on the menu I opted for the chicken tandoori kabob.  Seasoned nicely and the chicken was juicy and tender - and they pulled the wooden kabob so I didn't have to fuss with it.  Yea!  I will definitely be back!"}
{"text":"Worse service ever! I came in at 5:55 and I know that time to be exact because I came out of appointment next door at that time. I ordered. It is now 6:15 and I  still waiting. The cashier got the manager when I complained and the manager argued with me over how long I have been waiting. He said \"you've been here for 10 mins max\" he I continued to argue with me and in a snotty tone said \"I can give you a refund or I you can wait just like everyone else.\" This is no way to be a manager especially when Yelp exists! I'm still standing here waiting. No apology nothing. I've never been here before and I will never return to a place who treats their customers so poorly. In a world full of options why would I spend my money and get treated like dirt!"}
{"text":"I've been coming here for years and the quality and service of Kabob express has never faltered.  Khalil is a gracious owner who knows how to run a business, treat his customers well and ensures that the food is incredible.  The servings are always generous and you can pick how spicy you want your food.  I always ask to get my food spicy and topped with grilled onions.  You can't go wrong with the chicken tandoor or the fish kabobs.  Both are cooked and seasoned to perfection.  Afghan rice is always perfect with the various meats.  I could eat the rice by itself.  If you're looking for real-deal Kabob then this is the place.  Skip the competition.  None of them even come close.  Furthermore, you'll always be treated like royalty."}
{"text":"I got gyro combo with fries and soda $9.5.  hubby got chicken and beef kabob plate #10 ($11) and we shared hummus $3.5.  In my opinion, hummus and its pita bread are the best, they added lot of cumin in it, pita bread is moist and soft (really close to naan texture). Chicken kabob is moist and perfectly cooked.  The beef kabab is a little bit chewy.  I guess kafta maybe better.  Mint sauce is good.  gyro meat is not super salty like the other one.  Total is less than $25.  We finished the pita bread before our main dishes came.  We asked if we can get extra pita bread, the guy is nice enough to give us 2 small bread to finish the hummus."}
{"text":"Good effort.  Had the tandoori chicken which was tasty but a bit small portion of meat.    Their fountain drink choices were also a bit limited.   Why the sign \" no public restrooms\"?   Us costumers are public."}
{"text":"Simply the best, can't lose with anything on this menu. But my personal fav is the chicken tandory kabob 2nd the kofta."}
{"text":"Some of the Best Gyros around town. I have been coming here for 2 years now. They have good customer service and it doesn't take long to get your food. Chick it out!!!"}
{"text":"This is place is the all around Afghan Champion. The food was amazing, the workers were super nice and the price was surprisingly low to say the least. I had combo 1 with the rice. The rice was hands down best Afghan rice. Didn't think it could get better but the chicken, my mouth is watering thinking about it. Salad was great and for the first time at an Afghan restaurant I actually finished it. Over all the best Afghan place I have been to and I have been to a lot. The only place I believe they can improve on is the closing times 9pm, seriously? Even 11 seems early for a restaurant of this quality."}
{"text":"HUGE portions!!!!!  Love the chicken and the beef... not found on the lamb, but im sure others love it.  The only problem, if you order it there, it does tend to take FOREVER!!!!  you are able to call your order in ahead of time, so that is VERY helpful if you are on a lunch break!"}
{"text":"Pretty good food with great prices. I had the chicken tandory kabob which came with a tasty bed of rice, side salad, and pita bread. $8.60 w/tax. This was a different type of taste for me but still good nonetheless. This location could use remodeling. If I do come back it'd be to try one of their gyros."}
{"text":"I just moved to NV from VA and oh boy this kabob place is awesome! For almost $8 I got the chicken breast kabob and it was a pretty big portion for one person! I'm stuffed. It comes with lots of rice, pita bread, little pico de gallo but with cucumber and lettuce. Some green sauce, ranch and yogurt sauce I think. Really good!!"}
{"text":"The standard gyro here is a massive portion of meat wrapped in giant pita for a low $7. One of the best deals on this side of town, which isn't known for high prices to start with.   Staff is friendly, location is clean, and if they gyro isn't enough for you a side of spinach might hit the spot- topped with roasted tomatoes and caramelized onions, it's way better quality than I expected though a bit oily for my personal preference.  A complete meal with drink and side will barely set you back $10 and you'll likely have leftovers. Damn delicious gyro with tons of thick-cut meat and a hefty portion of tzatziki sauce to top it with."}
{"text":"The quality of the food is amaaaaazziiiiiiing and I highly recommend you check this place out.  Like the others have said, you will need to have patience.  This food is probably made on demand with a minimal staff, so don't expect \"express\" although the name implies it. You could probably ask for what menu items are quickly made if you're in a hurry.  If you're looking for something quick, go have crappy Burger King with 50% beef, 50% unknown mystery emulsifiers.  Take some time with your life, order some good food, and have a conversation with whomever is accompanying you. #yolo  We had the chicken tikka kabob (A7) and the chicken tikka masala (C7). Both were better, and slightly more unique, than most Indian food we've had."}
{"text":"Good change from Bamiyan. The chapli is my favourite. Nice and spicy"}
{"text":"Very good food. Beef tika is my favorite. Rice is as tender as can be. Beef has great flavor.  Not a lot of tables in the place and they don't rush so don't be in a hurry. Every mouthful is worth the wait. You might want an extra pita bread because it's delicious."}
{"text":"* after leaving this review they sent me a message saying FU. This place is the worst!!!!   If you want to wait for 30 minutes then please come to this place! Unreal how poor the services is. I've been her 3 times trying to give it the benefit but it's the worst service.   Food is okay and they have messed it up all three times I've been in but I tried and can try no more. Peace out kabob express"}
{"text":"I keep looking for a restaurant that offers better service as the employees are not Americanized and don't care if you come to their establishment or not, but in looking for a place that can compare...I've been hard pressed. The food is great. Its always fresh, well prepared. They don't have a menu that is so extensive that you can't ever decide what to order. Its very simple and very well done. Doesn't ever seem to be too busy either, its an excellent choice with good food at a reasonable price. The only other thing you could ask for is slightly friendlier service however at the same time, it definitely keeps it low key. Show up in our pajamas if you want, wear a suit and tie if you want."}
{"text":"Stopped here on Memorial Day for lunch because our first choice for Mediterranean food was closed.  We were they only customers in the restaurant the whole time we were in there.  The person at the counter seemed bothered that my wife and I were only getting 2 gyros and a side of fries to share and not interested in getting full meals or soft drinks.  He seemed unfriendly and a bit rude.  We did order 2 ice waters which never came.  I also don't like the tablet at the counter that asks how much you want to tip... is tipping necessary when you order from a counter and bus your own table?  I did leave a tip, however, because I was afraid he would only become more upset with us if I didn't!  The food was good but the sauce was a bit lacking.  There is no public restroom in the restaurant, nor in the strip mall that we could find, and not even at the gas station 4 blocks south... ???  We ended up driving to Walmart for restrooms and water!  I am usually not very picky but stopping here for lunch left me feeling disappointed and ended up interfering with our plans for the day."}
{"text":"I love their chicken kabobs.  They seem very fresh and tasty.  The price is reasonable too.  I've always gotten takeout.    The only reason I don't give them 5 stars is that communication on the phone is challenging with this company.   However my order has always been correct, and the cashier is pleasant."}
{"text":"Some of the tastiest Indian food I've had, always cooked fresh, not sitting under a heat lamp. I'm a fan of their Tika masala and curry chicken, but it's all good. Can't get enough of their samosas either. Call in your pickup order if you are in a hurry, it does take a bit to prep that fresh batch!"}
{"text":"First time here. Thanks to Yelp we found this place. Not too far from our hotel where I was at on the Vegas strip. Very friendly staff there. The person that took my order definitely had a language barrier, but I tried my best to understand him. I ordered the hummus plate, served with warm pita bread. Would have been great if they offered more pita bread to go alongside. I did use the rest of the hummus to eat along side the entrees I ordered. For my entrees I tried both the King Sultani combination plate of beef, kofta (seasoned ground beef) and chicken. Also serves with basmati rice, a salad that included cucumbers and tomatoes, also some warm pita bread. The other entree we tried was the kofta combination plate that included all the items with the Sultani plate. The large dining area filled up quick, but yet I was able to get in there and enjoy my lunch. Will definitely be back to enjoy more of the menu."}
{"text":"Little place with big flavor. Love the green cilantro sauce that comes in a tiny cup. Hot and spicy. A real surprise to someone new to the place.   Atmosphere is warm and pleasant."}
{"text":"Veryvery GOOD HUMMUS! not dry its truly authentic and flavorful ... i got the king Sultani platter (3 meats) and it was delicious! The green hot sauce was one of the best hot sauces ive ever tasted, and the fish kebob was tastefull too. will be coming back!"}
{"text":"Trying something new and pleasantly surprised. The food is fresh and tasty. The naan bread is the best. I'd come here just for the bread. Yummy!"}
{"text":"We love this place. Very courteous and friendly. As soon as I order they just know what I was talking about."}
{"text":"We have been frequenting Kabob Express for several years.  We found it when we were visiting and looking at property.  Our Best find in Las Vegas!!!  The food is always consistent and we visit here at least twice a month when returning home from the Airport.  The chicken kabob is always moist.  The Kafta Kabob is the best we have had.  The staff are always pleasant.  And in comparison to similar restaurants you can not beat the price.  If this was closer to our home, we would frequent much more."}
{"text":"Best homemade yogurt drink ever!  Had gyros for lunch.  Generous amount.  Green cilantro sauce was great.  Wish i lived closer.. server very friendly and engaging."}
{"text":"Excellent food, amazing service! I ordered the Chicken & Beef plate, it was so good with their special green sauce..hummus is also great! highley recommended!"}
{"text":"Delish!! Fresh and tasty. I highly recommend this place. Courteous and friendly staff. Service was on point. This place is clean and smells amazing when you walk in. My new go to Persian spot."}
{"text":"2nd Best kabobs and gyro I have found in Vegas and I have been on the prowl because I love Mediterranean food. I got the chicken and beef kabob plate and a gyro. The kabobs were both so tender and delicious and the gyro although it looked plain upon first seeing it, did not disappoint! Plenty of protein which is a big thing for me. I hate when they skimp on the meat and I eat mostly carbs and filler veggies. But they did not skimp on the meat.  The employees were not the most friendly or welcoming upon entering the establishment, and even told us to hurry when giving us our food because they were closing which bothered me a little because that has never happened to me before and they had over 30 minutes before closing but the food was so delicious and priced extremely fairly so they still get that 5 star rating. Definitely check this place out if you love kabobs or gyros just maybe not on a Sunday night so the staff is a bit more cheery."}
{"text":"This place needs to update its look but the beef kabobs are mouth-watering and that's all that matters! The wait time is long but the food is always fresh here and the portions are big."}
{"text":"When we walked in the place was very clean & the music and mood was set. They have really nice slab tables. The chairs could be replaced. But the food was really good. The beef was juicy and cooked just right. I'm used to having silverware and clay plates but they had styrofoam ( which isn't actually bad, unless you need to cut something ). I got number one and my partner got number 8. He said the chicken was cooked perfectly. Overall the atmosphere was good, it's in a good shopping center. I'd definitely recommend this place."}
{"text":"This is a pretty nice restaurant. It is extremely clean and tidy. The servers are nice and food comes fast it is rather expensive (looking at $10 for kebab, rice and salad.) but the flavour is there. The menu is mostly rice and different types of kebabs. I recommend checking it out if you do pass by the area."}
{"text":"Tried this spot about four months ago because I love this type of food. I wasn't crazy about it but one of my coworkers insisted I give it another shot.   Went again Friday and once again, wasn't wow'd.   When I got there I ordered and found a place to sit. The table was dirty so I started wiping it down and the guy who took also had taken my order at the register came over and wiped it and apologized. He was telling us how he has several duties and just got behind. No big deal at all. He was super nice.   They also have no public restrooms which was kinda unfortunate because I also didn't enjoy my food as much since I had to use the restroom. They do have a hand washing station in the main restaurant area for convenience.   Most importantly- the food: My only negative about the food was that one of the pieces of chicken breast had a really strange consistency. I have experienced it before with chicken breast and I really can't explain it but it's unpleasant. The beef was very tasty and the rice and salad is good.  The prices are reasonable, the portion sizes are decent. $12.95 for the chicken and beef combo I usually go with. The slice of pita could be bigger in my opinion. Since it's so inexpensive, why not throw larger piece on the plate to fill us up a little more...  Overall I think the place is solid. If I'm in the area and really need something to eat I'd go back. But unfortunately it's not one of my top choices for this genre of food in the valley.   I'd still say give it a try for yourself though."}
{"text":"This place is always busy but good food places are always busy the kabobs can't be beat best gyros in town add the green chutney sauce on it"}
{"text":"Excellent food!! Rice is soft and chicken shawarma wrap is an excellent tasting Persian burrito"}
{"text":"Kabob Express makes the tastiest kabobs on the eastside.   After trying out several kabob places, I've always come back to Kabob Express for lunch or dinner.  Unlike the other kabob places, Kabob Express makes afghan style kabobs.  According to the owner, the meat is marinated for 24 hours to seal in the taste.   Other kabobs, like Persian, don't do the marination and thus requires that they be eaten with sauce (like tzaiziki).   I would have to agree.   Kabob Express' beef is tender and full of flavor.  The chicken is the best from all the places I've tried because it is moist and tasty; the chicken at other places tend to be very dry.  I recommend getting #8 Chicken Beef Sultani for $12.  At that price, it is a great deal because you get two kabobs, one beef (not ground) and one chicken, along with rice, lettuce salad, cucumber salad, and pita bread.  You get a huge ranch dressing and a little tzaiziki sauce.  Be aware that the kabobs are not 100% consistent in quality.   Sometimes, the beef is a little tough, instead of tender, or the meat is cooked too much (dry).   Most of the time, the meat is tender and cooked perfectly (still moist).   So try them at least two times.  Indoor seating is spacious, though with few tables.  Parking is plentiful in the plaza."}
{"text":"Awesome new restaurant. Great food. Friendly owners. I'm definitely coming back whenever I'm in town."}
{"text":"Delicious, healthy food, good meat, cheap meals, clean place and nice staff. What else to expect :)"}
{"text":"Fresh and great food. Gyro and chicken sharwama are really .... Will come here again to try some other stuff"}
{"text":"Love this place Always clean and good atmosphere  Meat fresh and delicious, sooo many choices  I will recommend this place to everyone"}
{"text":"Really yummy food!  I had the kafta kabob meal (about $9), which came with a load of rice, salad, and a pita bread.  The kabobs were spiced ground beef shaped into sausage-like bodies.  Paired with the accompanying sauce (tasted like cilantro?), the result was flavourful and fresh.  Tons of food and tasty.  The small but well-kept interior is cheery as is the staff.  My only quibble is that my meal took longer than expected for this \"express\" establishment (~15-20min....I was the 2nd to order out of 2!).  However, I'm willing to wait for made-to-order yumminess done right.  Great lunch place that doesn't break the bank."}
{"text":"There's a bit of a language barrier here but that just means more authenticity to me! I ordered a gyro combo. I'm not too big on French fries so I asked for a salad instead which is usually more expensive but the manager didn't charge extra so customer service kudos there! The gyro itself wasn't very good though. Sauce was delicious but my bread fell apart immediately and there definitely was not as much toppings as I was expecting. I might come back we'll see!"}
{"text":"Just now finished and wow.  I don't know anything about this type of food but what we ate was very good.  Husband had  beef and chicken number 8 I think. The meat was very tender and well seasoned.   I had the chicken gyro sandwich I forget the name and it was definitely worth eating.   We got there little after 11 and only one other customer ahead of us.   No problems with the staff or the wait time.   I did  get the feeling that women are not important, all conversation was directed to him.   place isn't as small as I imagined and it was definitely clean.   The tables are large.   The price was a bit higher than what I would have liked.  But not outrageous and we will go back."}
{"text":"Get the #1! You won't be disappointed! Never had this kind of food before...probably one of the best meals of 2015 and its already November. Definitely been sleeping on this spot! Not anymore!    Yelp! For a free drink too  #Halal-Lejuh #ItsLit"}
{"text":"I love King sulltani Express combo super good 3 kabobs side of salad rice and pita also must say they're kofta is very well seasoned and chicken is great so is the beef can't complain about anything if you go there be sure to order the spinach or the eggplant as a side dish both excellent as well as the side salad which is a basic salad with some really good dressing super good with the combo been here many many times live right down the street much props"}
{"text":"I love this place! the food is always fresh, the environment always clean! reasonable price, Their hummus is so delicious... highly recommended"}
{"text":"Every time I came to Vegas, I have to stop to Kabob Express at least 3 times during my visit. There food is  fresh, gooooooooooooooooood, Deliciousssssssssssssss and verrrrrrrrrrrrrrrry affordabbbbbbbbble. If you're looking for exotic, delicious, tasty, appetizing, mouth watering and affordable food then you need stop to KABOB EXPRESS and you would not regret.  Bon Apptit :)))  Phone :702.433.7499 Website http://KabobExpresslv.com"}
{"text":"The service in this restaurant was great. I ordered the number 7 Chicken Tikki, salad and naan. I was taken back by the price of $12.99 but decided to try it anyway.   The Tikki had a good flavor but it was overcooked and dry. I didn't think the amount of food on the plate warranted the $12.99 price tag, it seemed like one, maybe one and a half, chicken breast were used to make this dish."}
{"text":"Kebob Express is an unsuspecting gem! From the moment we entered, we were welcomed with kindness and the gentleman explained all the dishes since it was our first time dining there. We ordered the chicken tikka and chicken sheeh kebob and they were the most flavorful chicken dishes we've ever had!! The chicken and naan were so fresh and delicious! We will be back!"}
{"text":"always quality food, they care about it a lot, and show you your dinner before you leave if it is to go so you see the quality and there is no mistakes etc. Friendly people too. I go here lots, always good."}
{"text":"Last few times I have gone here, the food just has not been very good.  Last time I noticed the \"B\" from the health department on the wall.  No more Kabob Express for me."}
{"text":"Fresh, healthy food. Excellent, authentic flavors. Friendly employees. Good value!   You won't be disappointed."}
{"text":"I love the chicken tandory kabob  I order delivery from this place often and it's always great!"}
{"text":"Wasn't sure what to expect when I opened the black-tinted door at lunch, but was happily surprised by the warm smells of curry & spice.  I was pleasantly greeted by the young lady at the counter.  Studied the menu briefly when I noticed the lunch specials posted below.  I ordered the Veggie Combo and was more than impressed with the quality and quantity.  You get rice, veggie curry, lentil daal, veg pakoras, small salad, naan & raita and a drink...all for $8!!  The pakoras were fantastic.  The curry had just the right amount of heat to make my nose run.  I'll be back to try some more of the finger foods and start running down the list of kabobs when I'm really hungry.  Glad I walked through those darkened doors!!"}
{"text":"I came here for my lunch break during work as I work nearby. I ordered a Tikka kabob plate and a bolagnee (I hope that's how it's spelt). I've been to many restaurants which offer similar kind of cuisine and to be honest this place seemed a bit sub par.   The meat was a bit chewy and the bolagnee seemed overstuffed and not fresh. The food was not bad I still left satisfied, maybe it was just an off day so I'll definitely give them another try."}
{"text":"Damn good food yo!  This is my second time here. First time I had the Gyro and it was pretty good. This time I ordered the Kofta Kabob and Chicken plate (#7) and it is DELICIOUS!  Fast service, affordable and so yummy. The only reason I dropped one star is because I only wish it came with a side of hummus. Though you can get it for $4."}
{"text":"Food is great very close to authentic. I'm middle eastern and it isn't simple to find good Arabic food. I was thrilled with this place. Nice menu and nice staff. Will be back!"}
{"text":"Great gyros and kabobs, They are very nice and up to speed on all orders, very tasty and one of our favorite places to go!"}
{"text":"This spot offers amazing, authentic food served by kind, hospitable staff. After my visit, I could not have asked for more. I personally favor a homely, familial type feel with places I eat at and Kabob Express did not fall short from this. I ordered the chicken Tikka Masala and it was, by far, the tastiest chicken Tikka Masala I've ever had. The authenticity and tremendous flavor of the dish completely took me away. I recommend this dish to any visitor, regular or first time. I also ordered the chicken biryani and mango lassi -- these dishes together made for an amazing meal. Overall, Kabob Express is my go-to spot for authentic Indian, Pakistani food and I couldn't be happier with this restaurant! Beautiful food, generous staff"}
{"text":"It was a very hot day in Vegas and we craved something fresh. The food was great and there was awesome customer service. I would definitely recommend it."}
{"text":"Delicious food and always very kind people working here. I recommend it for sure! Order extra bread! It's so good that you can't have just one."}
{"text":"Kids and I love this place but going to be honest havent tried much. We love the mango chicken / rice and garlic naan"}
{"text":"VERY quality food and a extremely welcome addition to the food desert here in Laveen. Super friendly service, large portions and fair prices. I've tried about 5 different dishes and my wife (vegetarian) has tried several; all of them were good.  Honestly it's one of the better Indian restaurants in the valley, so very happy they are right down the street from my house!"}
{"text":"The food it's good and tasty,,  the only thing I didn't liked was that I called to order My food  because  I was in my lunch break and they still took to long to serve me! but I would  give them another chance.."}
{"text":"I went here a couple of weeks ago. I was really skeptical at first, whether or not the food would be good, because of the restaurant's location. Man, was I wrong! I ordered a Ck Bf Sultani and I was blown away by just how flavorful their rice is! I was really not expecting to have saffron rice! It's like all I can think about now! I must go back so I can obtain more of their delicious rice!"}
{"text":"Their chicken salad is very delicious.  What makes this is the yummy chicken skewer pieces, with great spices and it must be curry to make them a little yellow.  The dressings very good - the owner (I think) gave me three.  I was on my lunch hour and their were quick enough.  They have other items I would like to try - I want to come back.  Check it out!"}
{"text":"The falafel wasn't the greatest. The gyro was on point but I really had a craving for falafel the service was nice and the place was clean. But the food while not bad was not great."}
{"text":"Best gyro in Las Vegas! Friendly counter people too."}
{"text":"Great food, good prices, speedy service .. I'll be back here in the future :-)  Best food in the area in my opinion."}
{"text":"Nice atmosphere. Good gyro for only $7. Gentleman behind the counter was very nice. Not too noisy, which I love."}
{"text":"I must say they have GREAT FOOD Home cooked styled meals. My mom makes a great chicken and potatoe curry similar to there vindaloo (a little spicier than hers) but nonetheless still fantastic! They also have some bread called Naan if u like garlic I'd tell u to get one FOR SURE. If I was being picky I'd say the rice is a little more on the crunchier side then it is soft"}
{"text":"This is really a great east side spot. I went in last week for the gyros, as I was in the mood. The meat was tasty and well flavored, the fries were made to order, and the veggies were fresh. It really hit the spot!  Yum.  I will be back for sure. To top it off, the owner was super friendly and chatted with me while my lunch was being prepared."}
{"text":"omg! Quality of the food awesome,taste was awesome,price awesome,management awesome, store was clean and this was my first time here  for the first time will be back!, Loved it!!!"}
{"text":"If your looking for a quick healthy meal for a reasonable price when your at Vaughan Mills Mall make sure to check out Kabob Express. It's located in the small plaza on the north side of the mall.  Kabob Express is a small sit down/takeout Afghani restaurant that serves homemade fresh Afghani food.  I decided to order the Chicken kabob meal for $9.99 that consisted of a salad, rice, a chicken kebab skewer and naan bread. You can also order the same meal without rice for $7.99.  The portions were adequate, the salad was fresh with plenty of tomatoes, onions and cucumbers. The naan was whole wheat and lightly toasted. The chicken was superb, lightly seasoned, moist and tender. The brown rice was also good but it's not your basic brown rice, it has a distinct flavour because of the seasoning they use.  Overall it's a 3.5 stars and it's a place I would frequent when I'm in the area and I'm craving a delicious healthy meal."}
{"text":"I got the number 10, king sultani, as recommended by the cashier. The steak was pretty tough. I didn't particularly like either of the two salads.  The chicken, ground beef, and rice were pretty good though"}
{"text":"The food was good, good service, no complaints here. If I were a local I'd probably frequent it. Loved the pita bread they serve it's the thicker kind more doughy, which is exactly the way I like it & severed warm.  Great local restaurant, no frills, simple & good."}
{"text":"The beef was tender, cooked perfectly! The place was clean and busy when we got there at about 1 on a Sat. The service was friendly and the food arrived  hot! There's a little cup of green spice sauce that had an after kick...so watch out! Interesting enough, they were playing Christmas Music softly in the background! Made for a nice atmosphere on this cold rainy day!"}
{"text":"Loved the food, reminded me of home :') l have been coming here since the first week...l am very impressed with amount of work that was put into their menu setp on the TV screen, awesome work! Also food wise, their butter chicken and palak panner is the best! Will definitely come back! Their customer service is also very genuine and nice! Good work Kabob Express!"}
{"text":"Might be the best halal place in Vegas. I don't give too many 5* reviews but this place deserves it. Service was outstanding. Our food was a little late to come out so the owner gave us another entree for free. Didn't need to but did it anyway. That's awesome. I got a chicken shawarma wrap and it was outstanding. Meat was seasoned really well and everything was just very fresh. The sauces that come with it are really really spicy. I can handle my spice, so this was perfect. Prices are very fair and the portions are reasonable. Will always come back here whenever I'm in Vegas."}
{"text":"Absolutely delicious.  The salmon was prepared perfectly. The rice and vegetables were tasty. The colorful plate looked beautiful. We will definitely be back.   My BF has been wanting me to go for awhile and now I know why :)"}
{"text":"When a place knows your name and your 2 year old son's name, recognizes your order on the phone, and puts a big smile on the toddler's face as you pull into the parking lot ... you know it's a keeper!  Okay, the kafta kabob plate here is my half-Palestinian half-Israeli son's go to meal. If he's screaming, whining, or even being super cute and we're east of Decatur, we're going to Kabob Express.  I sometimes order the Tandoori chicken, which is a hit or miss on being cooked properly, but the flavor is there and either way the rice is delicious.   The shawarma here is not shawarma, you should know that ahead of time. The hummus is super Americanized and the pita is always dry/hard.   My issue here comes with the guy who is apparently the weekday cook and even the owner. The weekday cook is rude and whistles while making the food - a very bad omen in the eastern end of the world. Regardless, it's plain old annoying in such a small place and when a customer, especially a regular, brings it up, the owner should do something about it.   This is going to potentially sound racist here, but it might be smarter to hire people from the region of the cuisine you're making at your eatery rather than people you try to train who don't know what the flavors are supposed to be.   Well, the 'front of house' staff is amazing and Kabob Express always makes my toddler happy, so, hey, it's an overall winner in our book.  Tip: Call 15 minutes before you get there so your order is ready to go.   Bonus: Halal certified."}
{"text":"Great tasting food. We ordered the medium and it was spicy. The chicken vindaloo was my favorite. Would eat here again."}
{"text":"Good food but a little on the pricey side. Especially for the $17 mixed grill which consists of mostly chicken. You do get a few shrimps and other meat but for the price, I expected more. The curries are fabulous. I have yet to try the mixed rice biriyani. Edit: I've tried them and it's mouth watering ! The lunch combo was a great value until they raised the prices. Glad to have this in Laveen. It's one of a kind in Laveen and I'll definitely be coming back for more."}
{"text":"Soft opening was today so I decided to check it out. Amazing, the Naan was on point, and the chicken was delicious. The service was very friendly and helpful and they were completely looking to receive feedback and help any way they could. Will definitely be back. P.s. you can tell them how spicy you like it and they will make it to your taste!"}
{"text":"Truly a hidden gem located closer to the east side area!   Today was my first time trying kabob express and it definitely won't be my last. I'm already planning when I'm gonna make my way back out to this place.   I had the tilipia kabob. It comes with rice, pico de gallo, pita bread, and salad. The Greek yogurt dressing was delicious and they have a house sauce that is green and a little spicy.   Not to mention the prices are amazing, 8.95 for the fish kabob and when you check in you get one free soft drink!"}
{"text":"To my surprise, I really enjoyed my MEAL here during my lunch break with a few others. I've always recognized this store front as EITHER the restaurant in-between Sunset Grill and Pho Mi 99 OR the place where a Korean restaurant used to exist.   It has always been an AFTERTHOUGHT and I've never understood why myself as I'm open to try anything else this planet throws me. Unsolved Mysteries category for sure.   Enough of that! As I walked in the quite an open dining area that seemed to have too LITTLE Table/Seat ratio in comparison to the floor space. A few scenery photos posted on the fall to keep the atmosphere a mixture of Fast Food and Casual Fine Diner. No tip is required here if you're curious.   We walked pass them to go to the Fast Food setup order counter where we look at menu boards and try to come to a conclusion on something we actually made it a little difficult as very little explanations were there for the name of the dishes.   It's not until I picked up a Takeout Menu which gave more descriptions however the gentlemen was nice to unmystify our enquiries as we looked quite puzzled.   This HALAL restaurant offered a good variety which meant we had to go for the ultimate Dinner for Four deal. 2 Shamie Kabobs, 2 Chicken Kabobs, 2 Chaplees, 1 Tikka Kabob, Rice, Salad, 4 Naans.   Everything came out FRESH & HOT cooked to order just the way I like it. I could see steam from the BBQ Meats so you know it's not been sitting on a skewer all day or that it's in the steam tray somewhere.   Chicken Kabobs, 2 Chaplees, 1 Tikka Kabob, Rice, Salad, 4 Naans were all very TASTY and cooked to perfection. Chicken is white meat that is not over cooked. Chaplees although priced the lowest was a Beef Patty I would be happy to consume.   Tikka is tender Beef Chunks that is just as good as the rest however the Shamie was probably the most unwanted of the bunch. Rice is a good accompaniment and the NAAN looks to be a wheat bread that helped fill as up. The portion size definitely offer value to this $39.99 for Four Deal.   Lunch and Dinner offer the same products and pricing. There is one section of the board for these meals with 1 SKEWERS and another section for 2 skewers.   If you come by I definitely suggest getting the selection that comes with a combination of 2 meats which seemed to be just $1.00-2.00 more. Wraps are also available for the lighter snackers."}
{"text":"Love this restaurant and feel compelled to visit it when I am in the neighborhood.  Khalid the owner is very personable and I like the fact that he shares his Kabul heritage if you care to ask.  The food obviously is cooked from scratch.  So, be very patient, because it is well worth the wait -- especially because the prices are so extremely reasonable.  It is not really \"fast food,\" it truly is a home-cooked meal with quality ingredients.  Addendum, updated 06/03/2012: I went there again today and once again the food was simply amazing!  The care that is taken to cook AFTER it is ordered.  Everything is made like your Great Aunt would do it if, of course, she was from Kabul, Afghanistan and if she was following cherished family recipes and if she were using only the finest ingredients.  Just taste the rice and you will know what I mean.  Then try any of the expertly spiced and prepared meats.  You will be hooked.  Khalid was not there this afternoon but Tommie was and he was just as gracious.   I go to Kabob Express when I want a great meal for an incredible price and when I want to impress a friends or family.  It truly is a bonus that the prices are so low."}
{"text":"It's a casual place but the food is amazing! They have different spice levels and a variety of meats. I love coming here alone or with the family. If you're looking for some fresh naan, a side of meat, salad and lovely sauces you're in for a treat!"}
{"text":"Today was my first visit here and I was not disappointed. I had the gyro sandwich which was made up of beef and lamb. There were red onions in there and other stuff that I couldn't really see because it was tightly wrapped in the bread. It was very delicious and I thoroughly enjoyed my lunch.  I'll be back to try other items on the menu!"}
{"text":"Ordered for one of my co workers birthday who picked this place. We were the first order of the day and it took them forever to get the food done (an hour). By the time we got the food it was cold. The order was not complete, meaning they didn't fulfill all requests per order.   The food was bland, dry and just less than mediocre..  I can't really say much more.. We all had the chicken kabobs combo.."}
{"text":"Found this place on a whim... BOY did we every luck OUT!  We showed up around 8:15pm (they close at 9pm) and we were greeted from the cook in the back working on the grill.  I love a place that is so closely connected to the consumers that they all take part in the dinning experience  for the incoming customers.  I order the King's Dish... It was a DELIGHT!  The meats were freshly grilled and not over seasoned and SO moist!  Food like this makes my heart smile!  Just clean, simple and fresh fair!  Thanks Guys we'll be back!"}
{"text":"We are visiting Vegas and the kids really wanted some halal food. Thank you yelp reviewers for pointing us in the right direction! This place did not disappoint. It was just a few minutes off the strip, excellent prices, good portions and delicious fresh food.  We did take out, but saw quite a few people dining indoors. We had the chicken tandoori kabob, chicken breast Kabob dinners and chicken shawarma sandwich. The food was ready in 10-15 minutes. They packed extra sauces (I especially liked the green sauce - it has a bit of a kick to it!), utensils and napkins. The man at the counter (Agha) greeted me warmly and had the order ready.   The food - the kids ate it so quickly, I didn't even have a chance to take a picture! The dinners came with naan, rice, a generous portion of chicken and salad. The sauces were a good addition. The chicken wrap was pretty good too.   We would love to come back and try other menu items. They have a halal certificate. Good food and great service. Thank you!"}
{"text":"For a place called express this place is slow as molasses. I got a combo plate with Kafta and chicken and my buddy a chicken wrap. Took almost 30 minutes to get out food and this was with the place mostly empty at 8pm on a thursday.  The food was very good when we got it but the wait was just too much to overcome."}
{"text":"Decent food here. Probably the best of the Arab/Muddle eastern food places in the area that I've tried. I am disappointed in the Middle Eastern food in Vegas, but this place wasn't bad."}
{"text":"So good!! So far my favorite place for hummus and their chicken kabob was so yummy!! We will definitely be coming back!"}
{"text":"The lamb kabob is great this place is always a good pick for the lunch crowd highly recommended"}
{"text":"Ooooommmaaaaagaaawwwdddd!! The food is immaculate. Packed with so much flavor!!! The staff is a little rough around the edges but it might be the culture difference?? Idk..Other than that this place is heavenly."}
{"text":"I ordered the shamie kabob with rice for lunch, the plate comes with little so called salad and bread and 2 skewers of meat.  I love Afghan food and I try to check out each one I come across. This one wasn't bad  UT not great either."}
{"text":"This is place to get freshly grilled food. I love their sandwiches. Order in advance if you would like to get timely order as the chef takes pride in cooking freshly made food. Friendly owner who works really hard to provide great service. I will eat here anytime..Go Kaboob.."}
{"text":"Love  love love their food! I would refer my family and friends to eat here! I live in Henderson, I don't mind driving all the way to Tropicana and Eastern."}
{"text":"I loved this place. It's nothing fancy but is a very clean place with great simple food. Very delicious homey style. good variety of middle eastern food with very fair pricing. Close to strip and airport."}
{"text":"Very nice people, good service and delicious Afghan food !! Good selection of kebabs like lamb, chick, beef and fish kabob. Everything marinated  in good recipe with amazing afghan taste.  Has enough table n chairs too for groups."}
{"text":"The chicken shawarma wrap was delicious. The white meat chucks was full of flavor. The portion size was well worth the 5.95 plus tax price. The pita and filling were warm and fresh. The jalapeno spread was a nice addition.   This place will definitely be one of my go to's when I'm in the area. The restaurant is small but clean and comfortable. The staff was also friendly."}
{"text":"I ordered delivery. There is a $25 minimum and a $5 delivery charge via grubhub. The order showed up on time as promised, but was missing 4 sodas, so that was disappointing. Opted to get a refund for those rather than make the guy schlep all the way back over. As for the food, the portions were large for the price - they don't skimp on the chicken in terms of kebab size. They use the standard take away styrofoam boxes, with the big half containing rice with your meat on top. The two smaller areas of the container had a little tomato/onion salad type thing and some shredded lettuce. There was a small pita in the box as well. Both the standard and tandoori flavors were great. I would happily order either again. I also got a side of tzatziki and it was appropriately tart and creamy. The small was big enough for two people to intermittently eat."}
{"text":"Service was friendly I checked in for the free drink which was awesome. I ordered the kind sultani. The portions were very good for the price and they gave you a ton of rice. The food tasted fresh. I referred my friend to check it out and he loved it too. I will be back for sure"}
{"text":"I came by this place on the way home to pick up dinner. Gentleman at the counter was nice enough to help me order. I ordered two plates. He asked if I wanted hummus, eggplant or some kind of spinach thing. I said hummus is fine. He rang me up and I was trying to figure out why it was so high. Come to find out the hummus was not included in it and he upselled me without letting me know. I pointed that out and he said he could refund me if I wanted it. I said no I'll take it. Let me tell you how shady that is. Not cool at all. The correct way and ethical way is to ask if I wanted a side item not make it seem as though it was included in the price. Just for that reason alone might make it a reason for me to never come back here again.....  Will update post when I get home. Currently waiting for food to be made.  Came home and ate the food. Omg it was so good. Steak and chicken was perfectly seasoned and tender. I loved it. Would like to come back but didn't like how the order processed went down"}
{"text":"Good food, don't pay attention to the building. We had a chicken and beef kabob dinner that was great. Lots of food. The hummus had great flavor but was thinner than what I'm used to. Also had wonderful, fresh bread!"}
{"text":"Came to Vegas from Oakland ca to circus circus.. great halal restaurant ate here twice thank you!! Allah bless you brothers m!"}
{"text":"I never give five stars. I do now, because Laveen desperately needs food that isn't poison. They could've served me fried rat (FDA approved) and I'd have still recommended it.   FOOD: They haven't done their grand opening yet, but if the soft opening is any indication, it's a keeper. It's not \"shoot-me-in-the-face-because-I-will-never-experience-something-this-good-again\" good, but it's probably in the \"punch-me-in-the-face\" range. I recommend the chicken/paneer tiki masala for those new to Desi food.   SERVICE: They apologized for the order taking a while to make and also made eye contact. If you eat at Desi joints often, then you know this is 10/10.  PRICE: $9.99 a platter comes with a decent-sized box with a big side of rice. A bit steep, I think, but I'm cheap. Also, it's really only expensive compared to fast food, and I would not classify this as fast food."}
{"text":"Great food. We like the chicken vindaloo and lamb korma. The garlic naan is also excellent."}
{"text":"I was in the mood for something different and was willing to try something different..it was a great choice"}
{"text":"This place just happens to be around the corner from me, and thank goodness because I can't eat anything around here anymore. Fast food has taken over. We need more places like this! It appears to be family run, appearance inside isn't so appealing but the food speaks for itself. If it wasn't for the interior it would be 5 star"}
{"text":"Been here 3 times and the food is always so good! The Price Is a little expensive we pay $37 for two, but it is a large portion, I guess we could share but me and my husband hate sharing food. The atmosphere is really underwhelming, every time I been there there, no music playing and  the set up is kinda cheaply done with stuff just not completed. It's kinda like siting at a doctors office waiting for the doctor to come in and give you results! Needless to say just get your food to go!"}
{"text":"Kabob Express is an absolute gem. They they're in the food desert that is Laveen Village just makes this wonderful place shine even brighter. I'm not any sort of ethnic food expert but I've tried all kinds of combination orders there and everything has been (a) delicious and (b) priced right. Plus the service is always on point.   We all talk about shopping local. We all talk about spending our dollars at quality restaurants who provide great service. We all talk about supporting our neighbors. Well, if you want an easy way to put your money where your mouth is, just grab a bite at Kabob Express. You will not be disappointed."}
{"text":"My husband and I shared the butter chicken & garlic naan... Both were amazing and the service was great. I would have liked a little more meat in the entree and it seemed a little overpriced... But we'll definitely go back to try more!"}
{"text":"Best Persian food I've had in Las Vegas. The Kabobs were cooked perfectly and the meat tasted so fresh and like they got it from a very good butcher. Their basmati rice had so much flavor and it was perfect with the grilled meats. I ordered their King Sultani and it was definitely worth the price. Not only was their food great, but the price was awesome too. Wish I knew about this place when I was still going to UNLV. Definitely will be back!!"}
{"text":"When I came to Kabob Express for the first time, I did not know what to expect but after trying there food I was pleasantly surprised. The staff was friendly, respectful, and helpful when deciding what to get. When I went, I had the chicken tikka masala along with some rice and garlic naan (pita bread). The food was amazing and top quality. The portion size was also great and could be shared with multiple people. The only downside is that it is a little pricey but for the way the food tasted, I did not mind paying a little extra."}
{"text":"I've been going to Kabob Express for a couple of years now. If you're in the mood for delicious authentic kabobs complemented by awesome service that is reasonably priced, this is the place to eat. I would suggest the Kofta Kabob, but anything you order from their menu you won't be disappointed.   Side Note: This place serves all Halal Meat, which is an added bonus."}
{"text":"This place is great! The owners are really friendly and the food is delicious. I order the chicken Tikka Masala"}
{"text":"Was really excited to find this restaurant so close to home. Did not try the kabobs but had lamb vindaloo and aloo gobi along with the chicken biriyani, samosas and garlic naan and all were great! Very tender lamb and great flavors all around that really satisfied our craving for Indian food! Will definitely be back to try more things.  Very fast and friendly service and well packaged for take-out."}
{"text":"Love this place! The best place to obtain 100% authentic Afghan food. Service is always awesome because they make you feel like family. Recommend this spot for any occasion."}
{"text":"This place has the best chicken wraps EVER! So yummy. The kabob plates are delicious as well. Great food, good prices!"}
{"text":"Always a convenient spot to stop for a good kebab. The place screams fast food but the kabobs are all prepared daily fresh on site and cooked to perfection over coals at the time you place the order. Great place to take out a good kabob and rice dish..."}
{"text":"Great food, consistently tastes amazing ... Meat is always tender and juicy and love the fresh rice and bread as well.  Location isn't sit-down nice ... More like a quick take out or a casual bite.  Food is made fresh so does take a bit of time (15-20 minutes)... So do make sure you have the time/patience because it's not as quick as shawarma or mcdonalds."}
{"text":"I came here today for lunch with my husband he got the beef wrap and I got number 8 it was chicken and beef cube with rice salad pita and they had this wonderful spicy green sauce that taste so good with the meats, when I got my food the portions are pretty big and I actually finish everything I would definitely come here again.."}
{"text":"Omg!!!!!! So delicious. My daughter got the lamb kabob and it was absolutely delicious, perfectly cooked. I got the gyro and I thought it was fantastic, it tasted divine."}
{"text":"The chicken breast kabob and chicken beef soltani were great! Best kabob I had in Vegas so far"}
{"text":"Not the best but also not the worst. The best cucumber yogurt I've had in years, could improve on the beef kabob. Place was clean, but no air conditioning so it was warm to almost hot inside."}
{"text":"The food is really good and you can't go wrong with any thing on the menu. The staff is really friendly. We had party of 7 and they let us finish our food without rushing due to closing time."}
{"text":"Afghan place owned by an afghan person very nice and warm person with descent quality Persian  / afghan food which is almost the same they have Good food with descent price as well if you are in  Vegas and you do not want to go to fancy dinner or lunch this is a place to go"}
{"text":"Ordered takeout from this place and must say it was pretty damn good! I ordered the chicken tikka and and my friend had the chicken curry, which both came in sizable portions with rice. Each dish was delicious! However, I'm glad we got them to go - the atmosphere inside the establishment left much to be desired. Would definitely return for takeout next time I'm in the area!"}
{"text":"Decent prices for a nice alternative to regular fast food.  My chicken kabob and rice was tasty and the staff were friendly. I'd go back for a pre Wonderland snack any time."}
{"text":"Really good! The guy helping us was very patient and answered all our questions. I got the Sultani Kabob and it was delicious. My sisters got the chicken shawarma and the Chicken Sultani and they were all very tasty. Quick service, tasty food. Love it"}
{"text":"A-OK, was OK.  This is the second time I've been there and it was better last time.  Maybe I was a little thrown by the fly swatter sitting on top of the steam table?  Hey, mistakes can happen, otherwise the place appears clean, and I think they have an A from the health dept.  Moving on, I bought a $9.99 chicken lunch combo.  The good: taste was good, lots of rice and a good size and good tasting naan.  The no so good, the salad dressing was very watery, the meat portions were small.  If I hadn't eaten all of the rice and naan, I would've left hungry.  Atmosphere is something, and the place had none.  It seemed really drab and I was the only customer there, which kinda concerned me.  I won't go back.  I left feeling sad, lol."}
{"text":"Just did a take out order at this place right now. The food turned out great and plenty. 2 of us ate from 1 order of Kofta Kabob. We are planning a team event for LegalShield nearby and are going to order from here. Thank you."}
{"text":"Best steak combo by far. Friendly service and great options. It was my first time here and I can't wait to come back and try more!!!"}
{"text":"Only ate here once but I plan to come back. We ordered take out and got a combo platter- the lamb was good, nice quality cuts not full of grizzle. The chicken was tender and not at all dry. The sauces were tasty and the portions were perfect."}
{"text":"I was in town for the asd show and I stopped by for some halal lunch. We ordered beef tikka kabobs it was delicious. Khalil was real helpful!"}
{"text":"Kabob express was a very nice Persian experience. The attendant behind the counter was a very friendly young man. He helped us out with the yelp deal and was very accommodating. The food tasted great and the prices were just right for being off the strip, just 2 miles away from MGM. Will be back every time I want some great kabob! Chicken Tandoori kabob was the best!"}
{"text":"Great Mediterranean food. Quick and a good price. I dont have a photo to share since i cleaned my plate. I got the King Sultan plate and it was great! Come in if your looking for some delish food!"}
{"text":"First time eating here but would come back soon. Service is a bit slow when there are to many people here but the food is worth it."}
{"text":"Yummz! Ya get in here and get your grub on. Clean, the owner was very personable and friendly. Reviews are accurate, so if you want a kabob, you have come to the right place.."}
{"text":"This is one of my favorite places to eat. The meat is so tender and flavorful. They give huge portions. I usually order a chicken and beef combination and always have plenty of leftovers. I LOVE their sauces! The tzatziki is not too overpowering (as I've noticed at some places) and the green sauce (whatever it is) is amazing. I always ask for an extra. The service is always great. The people working there have always been pleasant and accommodating. They truly seem to value your business. I usually call in my order so it's ready when I get there but I've noticed when I don't, it doesn't take very long. I live near another kabob place but drive 20 minutes to Kabob Express instead of eating there. That is how much I love their food. I don't normally leave 5 stars but in this case I have to!"}
{"text":"The food is good, but the platters have way more rice than meat. Although the quality of food is good, given the average ambience of the restaurant, it is slightly overpriced. With that being said, it's still worth at least checking out if you're interested in Middle Eastern cuisine."}
{"text":"Great fast persian / afghani food.  The dishes are smaller than a typical persian place so order extra.  You won't be disappointed.  Great value for the price."}
{"text":"As an Iranian, I say that the lamb, beef and chicken Kabobs are very good. But Koobideh (Kiftah) kabob is just beef which is not the Iranian style. They use their special spice in kabobs which I liked, but it depends on your taste. It is a very clean place with very respectful owner. The sandwiches are good, but not so special. The food is Halal. I will come back for the kabobs on my next Vegas trip."}
{"text":"Great Afghan food! Very tasty and reasonably priced. Reminded of of Pashtun cuisine back home."}
{"text":"My fiance is Afghan and it has been completely impossible to find any Afghan restaurants here in Vegas. This place  labels itself as Iranian & Afghan. So here we are. So far I didn't see anything Afghan on the menu. Mostly your typical kabob menu. We just ordered the combo #10 with kofta, beef and chicken. My fiance changed the rice they typically serve to a rice named qabuli. We also ordered boraani as a side dip. Its made of eggplant with a yogurt drizzled on top. Food arrived. Loved the kofta. Beef over cooked but spiced well. Chicken spiced well but a little dry. Rice was not a good quality brand and had too many carrots. I wasn't into the dip and fiance had no comment really. I'm giving this place 4 stars for the KOFTA! Atmosphere is very very casual with the restroom  located thru a maze directly in the kitchen."}
{"text":"This place is a gem in the desert! The taste of the food is captivating! and people here are amazing.. I feel that I'm lucky to find it on Yelp. Coming here is a must on my future checklists for all visits to Vegas!!"}
{"text":"Oh so Good!! So happy to have another restaurant in Laveen. I was craving Indian food earlier today and almost drove into Phx.  Glad I saw this place. I had the chicken tikka masala and naan.  The owners were so kind and brought me some deep fried veggies while I waited.  Service was wonderful.  Food was amazing.  They won't be having their grand opening for another couple of weeks, so they aren't serving everything on the menu yet, but they certainly had what I wanted.  I may go back tomorrow!!"}
{"text":"A little pricey, but most Indian food is in Arizona. Good selection, good tasting food. Naan was delicious, and pillow-y just like it should be.   Sign says they will have lunch time buffet soon, so I cant wait for that."}
{"text":"We ordered beef kabob and ayran. Beef was juicy. Everything was delicious, for sure we will come back"}
{"text":"This place is a dump. The place was totally empty! The inside needs a makeover. I ordered the chicken wrap it sucked all I can taste is lemon and its wrapped in a tortilla it's more like Mexican food than middle eastern food.   I won't be returning to this establishment."}
{"text":"Wow. Just wow. Amazing flavor and great quality food. Awesome prices also. Friendly people, great service. I live in CA, I wish I lived closer to come here more often."}
{"text":"This is what a great restaurant looks like. Instead of focusing on the fancy environment they focus on food quality. I got beef tika kobob and kofta kobob; both were great."}
{"text":"Really good gyro meat and portions for the combo. Came back a second time with my only disappointments relating to the lack of ice tea and public boys rooms."}
{"text":"I really enjoy this place. The chicken and steak are well seasoned. The rice is full of flavor. Great portion sizes."}
{"text":"My first experience with Indian food and it was delicious! My husband had it before but thought this place was better than his experience elsewhere. Not fast food. Cooked just for you. Can't wait to go back. Only bad part, wanted more rice with the meal. But can order a side for $1."}
{"text":"Their food is great ! The service is excellent ! I definitely will go again next time at Vegas ."}
{"text":"Wow, their food is AMAZING...I am from NY, I went to so many Desi Indian Restaurant in Jackson Heights and Jamaica but Kabob Express is exceptional. Really craving for Indian food and this one happen to open, so we gave a shot...it was the best shot ever....I had Chicken Tikka Masala, which is awesome. Their Byriany was on point, not to spicy not plain, and talk about the Lamp Curry, totally mouth watering food. And the stuff was very welcoming. Totally going back again....."}
{"text":"The owner did call me (not because of this review), but because his worker did tell him I wasn't happy, so that impressed me. Most owners won't do that.  He offered me a free meal & while it was ok, it still wasn't upto the standards when I went there the first & second time. The eggplant dish was HUGE slabs of eggplant instead of chopped up, so I had to use my teetch to cut it. It also didn't have that same taste.  Oh well, they tried."}
{"text":"When it comes to Kabobs, I am really picky. This place knocked it out of the park. The staff greeted me when I walked and helped me navigate their menu. He made a couple great suggestions for me to which I ordered a little of everything. The food was freshly prepared and only took about 10-15 minutes. I will definitely be back. Thank you!"}
{"text":"This place has the best beef kubideh and the rice is simply amazing. After eating here, I don't get heartburn which usually accompanies most Vegas kabob places. The order comes with two healthy portions of salad and white sauce. The place itself isn't anything to rave about but if you're looking for good food, this place has it."}
{"text":"One of the best spots to eat at if your in the Vegas area. The Lamb meal is a must try #1"}
{"text":"I stopped by here for lunch from a conference and loved it!!!!  staff was friendly and the food good, a little bit of a longer wait, but definitely worth it.  Definitely coming back when I hit Vegas again."}
{"text":"Exceptional Customer service! Delicious Persian Food! Great Atmosphere! Definitely my new fav lunch break getaway"}
{"text":"The food is delicious, and the owner (who is usually working the register) is polite and courteous.  Kabob Express was the first place I've ever tried kabobs (or Afghani food in general), and I've been addicted ever since.    I've tried the chicken breast plate and beef plate, along with the one that comes with both.  Both were delicious, but I think I prefer the chicken.  Been to the place a couple times already, and it never ceases to disappoint."}
{"text":"This is a small place in a strip mall. Nothing against that as long as the food is good. And, the food was very good. Not the best middle eastern we've had and the menu was a bit limited, but still good and satisfying. I took off one star because I think it was just a tad higher in price than I think it should've been given the portions.  Although it was good, we'll probably try other middle eastern places before returning. Not enough wow for the price. The 3 of us spent $40. At around $33, this would definitely would have been a 5 star experience."}
{"text":"I have been having lunch here for a couple of years now and always leave looking forwarded to the next time."}
{"text":"Good kabobs but the pilaf needs improvement. I was very pleased with the customer service and the timely matter that the food was given to me."}
{"text":"So a few years ago I went to a party and had these Kabobs, not like the ones you put on the grill with some onions and pepers some REAL  kabobs!  OMG these were so good they have been in the back of my mind thinking about them for years now.  I FOUND THEM they are around but searching yelp for someplace different on the way home I ran across this place.  Let me just say I'm a pretty happy girl.  I had a hard time deciding between the Gyro and the Kafta Kabob because like I said I had this at a party so I didn't know the name.  So I asked the front guy (I think he might have been one of he owners NICE guy) which he thought I should have, he said the Kafta kabob had more seasoning and flavor, who's going to argue with that, right?  So it comes with a small salad, a kind of pico salsa, lots of seasoned rice and a pita, Kabob oh and a mild hot sauce (very good).  The salad was fresh no icky pieces, nice.  A kind of pico salsa had a bite or two but didn't want to waste space for the main coarse.  The Pita was lightly buttered I believe with maybe a bit of garlic? not sure on that one but it was lightly grilled just slightly browned on the edges and oh so nice.  The rice Mmmm seasoned fresh long grain Mmmmm I took a bite with every bite of kabob so it left a lot less room for anything.  So onto the Kafta Kabobs Oh My this is a blend of beef and just a tiny bit of lamb for flavor a lot of people stay away form lamb because it is quite a strong flavor but you have to trust me on this one and try the blend it is light and adds so much to it, I loved it.  There is many others seasons but come on I'm not that good ;)   Sooo years after my kabob experience I have found it, the one.    The decor is nice it is mellow you can watch the variety of people walk by.  The wait wasn't bad it is a small restaurant btw so if its packed and you don't have time you might want to move on (waited 8 minutes) but if you want food that takes time to taste good then wait.  BTW again I had leftovers big portions and they have a yelp offer check in and get a free soft drink.   I will be back for sure..."}
{"text":"This place had tasty freshly grilled meats, however it needed a tad bit more marinating and was kind of dry. They did offer some dipping sauces, but in smaller portions. It's good, but I still prefer Flame Kabob on  Sunset."}
{"text":"I'm a new fan!  Already planning to return.  Mixed Grill plate ($16), large portion, enough to share (but order extra naan).  Great flavor, loved the chicken and shrimp, but the lamb and beef were dry. Next time, I'll stick with the chicken tandori.   Tikka Masala ($11), AMAZING flavor blew me away.  To echo another reviewer, not enough rice!"}
{"text":"Fantastic food,  highly recommend the hummus.  Service is also great,  the guy at the counter was super nice and insisted on giving us a second hummus to go when the kitchen accidentally plated it for here. Will definitely come back again."}
{"text":"Ordered two sandwiches today. The bread was fresh. Great customer service and friendly."}
{"text":"This place is so freakin good!!! Chicken tikka Masala was the most delicious chicken plate I have ever tasted. The heat from the curry warmed my bones and put a perfect buzz in my mouth.  The different seasonings came alive at different times as I savored this amazing morsel of a meal. Please get the cheese naan with this and kind of use it as a spoon and a sponge. The Chai tea is pretty great as well and they are super friendly but allow you your privacy.  If you live in Laveen you have just met your comfort food go to!! WOOT WOOT!!"}
{"text":"I love the chicken beef sultani so much that I would literally eat it once a week if we ate takeout every night. The bonus would definitely be that since the portion sizes are so large, I'd always lunch the next day! The prices are incredible considering the quality and portion sizes. I never feel guilty indulging in takeout when it's from Kabob Express since it's so healthy. The dining area is small but clean. It can get a little warm if you sit near the windows at dinner time, just so you know. But the takeout packaging is so sturdy and you're out the door in a flash, it's really wonderful. The service is always friendly and speedy as well. See you again soon!"}
{"text":"This place is absolutely delicious! Best chicken tikka masala I've ever had! I have never dined in, I always get it to go so I can't review the service but when I pick up they are always very friendly!"}
{"text":"Must go here kabobs always fresh to order with the best seasoning. Nice portion plates, reasonable price. One of my favorite kabobs place.  Nice employees too."}
{"text":"Very good place to drop by for lunch. Prices are reasonable and portions are ok. I wouldn't go there for kabobs if I was starving. Cashier was very friendly and gave me a free drink for being a UNLV student (no idea if it was an official student discount they offer).  I ended up ordering the chicken kabob plate. It was good, but I was expecting something more juicy and tender. Still, I liked it. The beef kabobs are probably much better. I'm going to have to drop by again to try the gyros."}
{"text":"I am giving 5 star for the food, 3 star for the service. The man took the order was not energetic and the other guy was not very friendly. We had to ask for extra plates twice and got a very shy response. Now, lets come to the food. We tried the plate with chicken, Shish and Ground meat kabob and they were really good. The rice was less in quantity but tasted good. Fries are kind of average but the mint chilli chatney was excellent witth the fries. If we go again at Vegas, we will try the place agai."}
{"text":"One of my favorite middle eastern restaurants in Las Vegas, a hole on the wall. The food is mainly Iranian. I've tried most their combos and none of them have disappointed so far, the meat is so tasty, tender and juicy, perfectly cooked. I love the salad, the green sauce and the yogurt. The owner and staff are very attentive, I've been a frequent costumer for 3 years and my experience has been great every time."}
{"text":"Don't try tandoori chicken it was way too spicy and I when asked the person on counter (not owner) his response was that's how they make it which is a lie.  I have eaten tandoori there before and it wasn't spicy."}
{"text":"Not good. Beef kabob was gross and gyros was blah. Fries were cr@p. Stay clear of the combo. Waste of time and money."}
{"text":"A VERY delicious quick lunch. Stopped by for a Chicken Shwarma sandwich with extra hummus and baklava.  I enjoyed and the young man behind the counter was nice to talk with and pleasant. I WILL return on my next trip to Las Vegas."}
{"text":"I got chicken beef kebab and it was so delicious recommend it for sure. nice people and nice service"}
{"text":"Great kabobs! They have great afghani food here. Its between a take out place and a formal restaurant. The food quality is definitely restaurant but the atmosphere more of take out. They do not have authentic Kabuli Palow or other more traditional dishes as entrees but the kabobs r amazing. Be sure to ask for white sauce. We came here twice on our trip to las vegas. Highly recommend if your in the mood for some amazing chicken shish beef kabobs!"}
{"text":"Went there yesterday after 3 years and food was still as I remember it! Awesome food Great service  Had the tandoori kabob platter and it was so good Hidden gem!"}
{"text":"Great costumer service! They're very nice and the food is really great too. Highly recommend the place."}
{"text":"Pretty big let down - what are you thinking Yelp people?! Chicken was super chewy and had a sour taste. The beef was chewy but flavorful. Yogurt and cucumber dip was inedible. Also, there's Spanish soccer games blaring while radio with tons of static is playing. Real unpleasant. Skip this one, 4.5 stars is hard to understand."}
{"text":"Omg!! I've been waiting for this and it smells so good.  Fresh and hot off the grill I love the grill flavor!  A must try if you are in the area and enjoy eating mediterranean/afghan/Persian food. The dish I order was the King Sultan which consists of steak, chicken, and ground beef with rice, salad, and Pico de Gallo lime. VERY DELICIOUS DISH!"}
{"text":"Great food!   Awesome customer service!   The chicken and beef are sooooo flavorful!"}
{"text":"Love the food here, and prices are great. Love the fact that you can order just the kabob as a side. Portion sizes are perfect. Overall a great place to have some fresh Mediterranean food."}
{"text":"Awesome food with great service. Definitely coming back!! My gps wouldnt let me link to yelp for some odd reason but i definitely will know how to find my way back here without it. Thank you to tommy and the folks here for the excellent customer service."}
{"text":"This place is not Express, need to change the name. Ordered the lunch combo which is a different advertised price outside the store than the higher price they charge you. I figured the lunch chicken combo would be fast  waited over 30 minutes for their featured meal. People waiting received partial order waiting for rest . Another customer came back with wrong order. I assume this is abnormal based on all the high reviews or there are a bunch of bogus reviews. The chicken was good when I finally got it but the meal was not impressive for the price. If in a hurry try another place."}
{"text":"Eaten here twice and will definitely be back! Delicious, good quality and generous portions!"}
{"text":"This review is long overdue. My family, bfs family & I have been coming here for YEARS. Out of the many \"kabob\" places in Vegas this is our #1. We love it for so many reasons.   1. Location. It's in central Vegas, close to a LOT of places.  2. Reasonable prices. This isn't a restaurant where you get a small portion for your hard earned money.  3. The amount of food you get is more than satisfying, even the gyros & shwarmas.  4. The location is spacious, you will almost always find a place to sit.  5. You can ask to make your food spicy!   Overall, if you are looking to eat \"kabobs\" PICK THIS PLACE FIRST. You won't regret it!"}
{"text":"Quick, not too pricey, and excellent quality.  Their rice is unbelivably good.  Salads too are off the hook!!!"}
{"text":"Clean place. Hummus, yum!! Their lamb is so good and very tender. The bf liked his chicken shawarma. Good portion for the price! Friendly staff. All in all, good experience. Will come back."}
{"text":"I visited Kabob Express the other night for the first time! I live literally a 5 minute walk away and have always wanted to try it, but I finally had the opportunity so off I went.  When I walked in, there were about 10-15 other customers eating in the small dining room. There was one Middle Eastern customer waiting to order in front of me, and then a few minutes later, another Middle Eastern customer was waiting behind me. Here is where I started to have a problem: Even though there were TWO men manning the cashier stand, neither of them knew what they were doing. They did not know how to take orders, how to make change, or how to talk with customers.   Finally, after at least five minutes, it was my turn. However, the two men looked directly past me at the other customer BEHIND me and invited him to the cashier stand instead of me. I was very confused but continued to wait. After they took his order, they both pulled out their phones and started texting. I was pretty furious at this point so I marched up to the counter and asked if I could order. Both of the men seemed caught off guard that I would actually want to eat, but finally managed to take my order (amid much confusion over what I wanted, how to spell my name, and how to make change). I didn't even use my free drink from Yelp because I knew it would just waste more time because of all of the confusion.   The only reason this review is getting 2 stars instead of 1 is because my chicken tandori kabob with rice was SUPER good. I almost didn't want it to be good because I was so disgruntled, but it was amazing. Don't put much stock in their bread (it was a HARD piece of pita) or salad (a few lettuce pieces thrown in the corner of the to-go box), but the kabob and rice ALMOST makes me want to go back. Almost. Not quite."}
{"text":"Great experience here! For the connoisseur of middle eastern food, there is a full menu of standard kabob as well as some exotic selections which are served with salad, bread and rice. Free soft drink available with check in as well for a complete meal! I gotta admit that I'm not quite enlightened on some of the offerings so I got a gyro, with fries and drink for under $9! What's even better is that the portion size was so generous that I took half of it home for dinner the next day. World Cup playing on 2 screens was an added bonus. Great value and I'll definitely be back!"}
{"text":"The food here is always pretty decent but probably not better then bamiyan.  I prefer the charcoal taste at bamiyan and their bolanee. Still kabob express is definitely not bad at all."}
{"text":"This place is amazing. Great food and a great value. Come here every time Im in Vegas for a convention. The owner/manager is really nice. There kabobs are ways flavorful and cooked perfectly. I would definitely recommend this place."}
{"text":"Delicious Tikka Masala. Super friendly service. Reasonable price. Only gripe:  not enough rice.  I'd definitely recommend!"}
{"text":"First of all, the Afghanis we met here are very friendly and we exchanged a few stories about BAF and KAF. We are very happy for them to be able to survive the war and come to the USA after supporting our troops outside the wire. Congratulations and best wishes with your new life and business.  We ordered the Kafta Kabob, Tandoori Chicken and the Eggplant side dish. We ate family style and all the food was delicious  This experience has satisfied our craving for Afghan food since leaving Afghanistan over 2 years ago. Highly recommended and we will visit again when we're back in town."}
{"text":"I decided to try this place because of the Yelp reviews and it was a very pleasant surprise.   I was in the area and saw the check in offer.   The place is pretty small and in a strip mall. You can't miss it though; the name is in 3 foot tall letters with a yellow background.  The dcor was nice and not overdone.  The owner was there and was really nice and cordial. I asked him what he likes and he said the lamb kabob was one of his favorites. And the green sauce that comes with it is one of his house specialties.  The lamb was perfectly seasoned and cooked nice and tender. I don't eat lamb the often and this was a really delicious treat! The sauce, wow, spicy but not too spicy. The kind that keeps you going back for more.   Now let's talk about the rice. OMG, I honestly and not a huge fan of rice but this rice was deeeeliscious. it was long grain rice. I don't know what they put in it but damn. I ate all of it and would have eaten more if there was more on the plate until I was in a carb coma. I think they sprinkle the top with a mixture of cayenne and sumac.  The price was right too, I think I spent $13 including tip  I would definitely visit again!"}
{"text":"Had the #10 king sultani  everything  was amazing  . One of the best lunches  I've had in a long time . I think I  have a  new favorite  spot"}
{"text":"After intensive search and finally got the Nintendo Switch for my kids at the nearby Walmart, I called Kabob Express to order some to go food (I originally thought this place was the same one that used to be in downtown Vegas). When I came to pick up, I realized that this place was different than what I expected. I'm glad because the food here is soooooooooooo good. I ordered the sultani kabob, which comes with two skewers of beef and rice and salad. They all tasted soooooo good, I want to eat more. The price is decent, not cheap but not expensive either, for the amount of food they give. I would definitely visit this place again."}
{"text":"I saw this and checked on yelp to see if that had any coupons. My coupon was for a free refreshment if any choosing but when I went to pay and use my coupon my little one had snuck my phone away and I couldn't find it. They were nice enough to honor the coupon anyways.   I got the lamb plate, my son got the combo meat plate, my daughter got the wrap. Everything tastes fresh. The only that tasted off was too much seasoning. I cook most of my meals and can't cook with out my spices, as I hate bland food and my kids are the same way. However, the meat at this place seemed overly seasoned. The yogurt sauce helped tone it down.   I also try to stay away from soda/pop and it was nice to see that they had refrigerated refreshments other than just soda pop."}
{"text":"Great food!i usually I  get a #4 kofta kabab is really good and the rice omg love it,try them on"}
{"text":"You need to try the Kofta kabob, made with ground beef. Very good value and good quality food for the prices."}
{"text":"What wonderful Indian food. I ordered the butter chicken at a medium heat and garlic naan and it comes with a side of mixed rice. The sauce was a deep red color and you could taste the spice the heat could have cranked it up a bit more and the chicken was tender. The garlic naan was lightly buttered and the garlic was tasty without destroying your mouth or those around you. This will be a regular lunch spot. It is a little pricy but it is really enough for two meals."}
{"text":"Not bad, but nothing to write home about. The food is tasty and fresh but not particularly well executed. I was quite excited looking at the available options, but the food didn't seem to have as much character as I'd hoped. From a value standpoint things seemed to be a little disappointing. Portion was relatively small compared to the price. I wouldn't make a point of coming back."}
{"text":"I keep coming here smh. But I feel less guilty knowing that it's natural and healthy :-) I've reviewed this before but wanted to add that it is indeed GMO free, non-antibiotic, no hormone, grass fed, and the list goes on... I can't help but notice my body feel better after avoiding junk. It's also a great feeling knowing I get full/satisfied.  [-] As of now, only one location. No public bathroom, however sink available. Wish area was a bit bigger since sometimes it gets busy and seating may be limited.  [+] Amazing flavors. Fair prices. Wide-ranging yet not overwhelming. Genuine with character!  I still recommend gyros, Sultani, side of lamb, and B. Badenjan"}
{"text":"Not a good place to eat kabob. Meat has no flavor, salad is bad, drinking yogurt is horrible"}
{"text":"It was just amazing.. especially for veggie guys like me who dont eat meat. fresh and different ! try the eggplant dish - too good. Nice customer service and was friendly too !"}
{"text":"I will not be returning to this restaurant again. I ordered 30 meals for a lunch we provide to senior citizens and had a horrible experience. To start, it was difficult to place the order because the manager was not available the first two times I called and no one else could take the order. Then, when I did place the order and told them we are tax exempt, he still quoted me a price with tax. Not realizing that he included tax, I told him it was a bit high compared to what I expected. He offered to give me a discount and brought the price down 10%. I was appreciative for that since we are a non-profit and have to keep our costs down.  Well, when I arrived to pick up the order, I asked for a receipt showing what I paid for and they could not provide me with one because of the discount. During this discussion, I discovered that my 10% discount was applied to the total INCLUDING tax! So he really gave me a 2% discount since we don't pay tax to begin with. The man who was there (Surprise, the manager was not there again) was very nice and tried to help me. He called the manager on the phone so he could figure out how to give me the receipt I needed, but the manager was very rude. When I explained the situation and what I needed, he said he couldn't do it because the register doesn't allow him to. His best offer was to charge me full price so that I could have a receipt that matched the credit card slip.  When I got the order back to the office and began serving to our clients, we were not pleased. The order was chicken breast kabobs, rice, salad, and pita bread. The chicken was dry, the salad was just chopped iceberg lettuce, and the pita was cold and some pieces were moldy. The only thing I can compliment them on is the flavor of the rice.  They charged me for 30 individual meals, and fortunately, we had a few cancellations because they did not provide enough chicken to feed 30 people. I agreed to allow them to provide the food in catering trays rather than box up 30 meals, but all this allowed them to do was short us.  This was not the first time we had ordered from them, but it will be the last after the treatment I received and the frustration of the whole experience."}
{"text":"This place is good.  I was concerned at first because I am used to Iranian style kabobs. I would have preferred a larger piece of pita bread but that's it.   No other complaints.  If that's my only complaint for a kabob place then the place is good."}
{"text":"This is a mediocre kabob joint that seems to specialize in nothing. Everything we tried was \"okay\". Even the hand thrown naan was just okay."}
{"text":"This review is for food alone since the boyfriend is the one who checked in and picked up the food .   Beef Gyro - Standard pita stuffed with beef onion and tomato. Maybe they dont put lettuce so it wouldn't get soggy wrapped in the warm pita and hot beef. For $5 I would eat it again they definitely didn't skimp on the meat. Smother that bad boy in some of their yogurt sauce and it's bomb.com.   Kofta Plate - ground beef seasoned yummily ( I just made that word up ! ) and made into almost sausage. Then it's grilled and served with rice , a salsa which is almost like pico de Gallo except it has cucumber and parsley instead of cilantro. Also comes with bread and Tzatziki sauce.    Been meaning to try and take it off my bookmarks. So great success !"}
{"text":"We enjoyed our dinner here!  After walking Vaughan mills we were looking for something quick to take home for dinner and we came across kabob express. The smell is amazing and the man at the counter was patient while we looked over the menu board.  We decided on the ground beef kabobs and the chicken and ground beef double skewer combo. Both meats were tender and flavourful. The salad and rice were also good, as was the 'naan' (more like toasted pita). The prices are decent for the area but a bit on the higher side than places I've been to in Richmond Hill by maybe $2-$3 but that could be a location downfall. The quality is just about on par with other places I've tried. The rice is really good and the salad, although a bit warm and soggy by the time we got home, was nicely dressed and tasty. Meals with rice range from about $10-15 and come with rice, salad, naan and the meat. You can forego the rice and save $2-3 but I'd recommend getting it with!  The restaurant is large but is really more of a takeout or quick bite type of place. You order, pay and pick up your food at the front counter and there's no table service. They have trays set up across the counter almost like a fast food restaurant. We took our food to go. It's not the prettiest restaurant but it's clean and inviting enough. The man serving us was efficient and friendly enough, but as a takeout place, the service isn't particularly notable.   The wait was about 10-15 minutes which we found to be a bit long considering their name is \"kabob express\", but not a big deal, we weren't in a rush.   They also serve wraps, and a few other snacks and side dishes.  I don't think I'd be running out to this place unless I was in the area and looking for a quick bite but it's a good option for the Vaughan mills area if you don't want to spend a lot of time or money on food after a day of shopping!"}
{"text":"The most amazing food I have ever tried on the face of earth .. Would never ever leave Vegas without it !! Even  my husband had to bring it for me to make up with me  ..pleasant ppl good service and delicious food ..love the kofta kabob and tandori chicken"}
{"text":"Love there chicken kabob. Rice quality is very good. Delicious healthy fast food."}
{"text":"Bought it for my girlfriend so it is all her. She didn't like it. It was also rather expensive after all was said and done for what we got. They tried to help but since it was 10pm at night, I don't think the meat was cooked properly or something.   Ah well. Pass this one by."}
{"text":"I found this hidden gem while I was still in FL. and considering the restaurants in my new hood of Laveen, AZ. I bookmarked it right away and couldn't wait to visit as we love Indian food. I've been here less than a week and have already visited twice. First for dinner on a Friday night. We ordered the Butter chicken (to die for), Chana Masala (freaking amazing), Garlic Naan, Mango Lassi, Vegetable samosa (probably the best I've ever had-and I've had a lot). You order and they bring it to you, it took awhile but so worth it. It tasted as if someone's grandma is in the back and they just made it fresh to order. It was delicious and so hot! I don't mind waiting if the food is this good. We ate in, but many patrons do take-out. I can understand why. I will definitely be doing take out in the future as well. Today I went for lunch and we got a vegetarian combo as well as a non vegetarian combo. Everything was quite delicious. Absolutely perfect. Back home we had about 5-6 Indian restaurants within 15min and we frequented them often so I can tell you Kabob King's food is legit. I love the hole in the wall/no frills feel of the place. Come here if you want some really delicious Indian food made with love."}
{"text":"Best kabob in town, miss going to this place. Basmati rice great with sultani kambo"}
{"text":"Just came to visit from LA where Indian food is on every corner, good and bad. This place ranks with the really good ones!  @Laveen's best Indian food"}
{"text":"Amazing food and super fast!   First and foremost I looked up a place around where I was shopping for something different and found this spot on yelp. It was rated good so I figured why not :)   It took only five minutes to get my food ! And the cashiers were happy to serve ! I would definitely go again super yummy!!  Their beef and chicken combo kabob plate is amazing omg!"}
{"text":"Owners are amazing and so helpful. This it's one of my most favorite places to eat. Food it's so yummy and prices are fair. I'm just grateful I live close."}
{"text":"Amazing x100 on customer service. I placed the order over the phone. Went to pick up and I was just pleased with everything. He read out my order and open each container to make sure everything was there, labeled the containers with everyone's name. Even asked to help me carry out my food. I ordered the fish kabob with a side of fries. Food was tasty I was a little sad the order came with pita bread but no hummus. (Hummus is a side dish) I also order grilled vegetables which was only onions, one whole tomato and  jalapeo I expected something different. Over all I would recommend this place."}
{"text":"Just had the lunch special with a co-worker which was totally excellent.  Laveen is sorely in need of good restaurants and Kabob Express is definitely in our lunch rotation now.  Will definitely have to try dinner here."}
{"text":"I'm so happy this restaurant is here!!  I stopped in tonight and tried a little bit of everything.  Beef Kabob, hot Lamb Curry, and Chicken Biryani were all just delicious!  I'm assuming the nice woman at the front is the owner, and she is very friendly so the service was excellent.  I know people have mentioned it's a bit pricey, but I'd rather pay a little bit more for yummy food, and trust me, this place is delectable!!  Grand opening is going to be on April 9th!!"}
{"text":"Good kabobs! I ordered over the phone & ran in to get my food. The restaurant was clean and the employees friendly. Would recommend."}
{"text":"I recently moved here from Virginia, which is home to as many Afghan restaurants as there are Casinos here and this place is by far the best Afghan food and experience I've ever had! And I'm Afghan sooo I know Afghan food."}
{"text":"I love the Chicken Tikka Masala and the Butter Chicken.... The price is just at the tail end of what I am willing to pay for good diverse cuisine in the area. I would vote 5 stars if they gave a larger portion size of rice and the nan was slightly cheaper. Overall, a solid 4.3/5.0"}
{"text":"Amazing food, and a lot of it too! We had the Kofta Kabob, Sultan Kobob, and the Chicken Beef Sultan  plates. All were tasty, fresh, and yummy!"}
{"text":"What a jem of an Eastern Indian cuisine restaurant in the middle of Laveen Arizona! The curries are absolutely delicious and my husband loves the kabobs. Incidentally, my husband claims not to be very fond of spicy ethnic foods in general, but he loves this place so I think that says a lot. My favorites are the lamb korma, chicken tikka masala, and curried shrimp and vegetable dishes. Thanks Kabob Express!! ;)"}
{"text":"I recently tried this place because my girlfriend said it was good.   I will say that the food is really good.  We had the Chicken Tikka Masala and the Lamb Korma.  The rice that comes with them was really tasty and both dishes were well prepared.  We also got extra sides of garlic naan.  I ordered 2 sides but only got 2 pieces - I thought it was 2 pieces per side but maybe it changed or I am wrong but I was home before we found out and at that point it was too late to try and deal with it.    The staff was friendly enough.  The decor is no frills so you are going for the food.  It took a little while to make (there was only one other person in the restaurant when I was there).  I also think it is a little pricey.  I have had equally good food at other similar establishments for less money but there are very few options in Laveen, so it is what it is.  Overall, it was good and I would come back again."}
{"text":"The food to price ratio is very good. The portions are awesome should get just about anyone full. I orders the saltani basically a steak kabob and a ground beef kabob. I like the steak kabob more than the ground beef. The plate came with a basic lettuce salad and another salad consisting of cucumber tomatoe and onions. Almost like a pico de gallo without the cilantro. They also give you a generous amount of flavored rice and a small pita like bread.  I also ordered the hummus it was decent but wished they give you a little more bread to dip in. Overall I enjoyed the meal and would go again.   My only complaint no restrooms. They do have a hand washing station for the customers tho."}
{"text":"I am a picky eater when it comes to desi/indian/paki food. I am hard to impress when it comes to these kinds of food. But Kabob Express nailed it!!! The first time I had their chili chicken and chicken biryani...I couldnt believe it. It was very flavorful yet not too spicy. Perfect combination for the non-spicy eaters out there.   Highly recommend this place to anyone who has never had indian/paki/desi food before. Gotta try it to believe it. And i believe it."}
{"text":"This place was a quick stop after a workout  The kabob plate has all the protein and carbs you need ! The chicken is well marinated  The rice is good quality  The salad has a tasty dressing  The hummus is excellent  All in all a good quick bite and the price is very reasonable  Will be back"}
{"text":"amazing. I haven't had this kinda food since I been in Philly it's so good food amount and amazing  tandoori chicken.. don't forget to get baklava for dessert"}
{"text":"Delicious! It's not authentic, but the food hits the spot. It looks more like a Roberto's, but the cooks put it down! I recommend the tandory chicken and the hummus. The price is right and the food is fast."}
{"text":"Enjoyed dinner here- fresh pita bread, lamb kabob was delicious, beef kabob slightly tough. Friendly service. We'll definitely come back!"}
{"text":"I love this place. Their chicken and beef plate is amazing! The meat is tender and the cucumber salad is mouth watering!! Have nothing negative to say about Kabob Express"}
{"text":"Great food and great service. Not to expensive and the foods organic and healthy! People must come here!"}
{"text":"It's usually pretty packed at night and in spots during the day. I have only personally had the Gyros, chicken shawarma, chicken wraps, baklava and fries. Everything always taste fresh and flavorful. Baklava is basic, store bought. Nothing special. The place is usually very clean, but I admit I have never used the bathroom there. I would be a lot more likely to go there if some stuff was just $0.75-$1.00 less but the prices are reasonable."}
{"text":"5 stars for the fresh made mango laasi but i think the prices were a bit too high for the portions we were served.  Will come back anyways."}
{"text":"Food is amazing at a great price!!!!!! Try the tandoori chicken and the hummus! ! YUMMYY"}
{"text":"Wonderful food and friendly people.  We go in so often that they now know us.  The portions are more than adequate and we always bring home leftovers.  I'll be eating some of those for dinner tonight!  Our daughter joined us last night and we shared the King Sultani plate with an added lamb kabob and garden salad.  I brought home one large and one small box of leftovers as well as the French fries they gave us.  We go here at least every other week.  AWESOME PLACE!  Maybe just not the place to go for catering, Melissa K."}
{"text":"#3 to go. Hot and fresh, ready to eat. Price are decent. I enjoy their green sauce (kinda spicy) on the side, it adds in more favor. Right amount foods and can fill you up yet does not leave you feeling heavy if that makes sense. Shrugs. Definitely will be back to this place whenever I feel eating kabobs. Oh, free drinks when you check in on Yelp"}
{"text":"One hour drive for us... no matter. This place ROCKS!!  Can you believe how lucky the people in Laveen are to have this gem. Wife is picky.. we tried a bunch of places and this is tops... her go to is lamb curry.. I search and try biriyani. Beef Vindaloo MEDIUM SPICE. Don't be afraid..  Naan is always good too. Best mango lassi.."}
{"text":"I ate every grain of the rice.  The meat was perfectly seasoned and cooked.  Easy to find/park."}
{"text":"Absolutely delicious Afghani food. Everything is fresh and made on site. They have the best tea, and their meat is so fresh and delicious. The recipes are authentic--spices are perfect. And the prices are very reasonable. The dinners are hard to eat in one sitting, they give you so much food, so you'll have a great snack for later to take home. If you want to get off the strip and enjoy a meal without the sound of slot machines, head down to Eastern Avenue and enjoy a great meal at a great price. It's in a strip mall, a little hard to find. It's behind the electronics store, in the middle strip mall of the shopping center. You'll love it!"}
{"text":"Love the food but I'm gonna have to stop going there since they switched to plastic cutlery and styrofoam plates. Styrofoam is BAD for the environment and I don't want my food served on it. Will have to find a different place to eat until they go back to a more sustainable way of serving dine-in guests."}
{"text":"The food was really good. Would've been 5 stars but it took way too long to get our order placed and even longer to get our food. I would highly recommend placing your order prior to arrival. Maybe the name express is what had my hopes up and my patience down."}
{"text":"I have been to this place twice now and both times I was passing by Vegas enroute to Utah. Both times during my visit the the restaurant was clean and the tables were wiped out well which is a positive and hygienic sign for every customer. The food tastes really good. Both time I have ordered the beef and chicken platter. The meat is always marinated well and then grilled to perfection. Served with rice, pits bread, yogurt and mint chatni the whole meal is worth your time to drive down from the strip into the neighborhood of the city of Las Vegas where this place is located. A must recommended place to everyone who love good food."}
{"text":"Fabulous food & so thrilled to have a restaurant of this type in Laveen. Fast & friendly service w/delicious, flavorful food. I've lost count of how many times we've eaten here since they opened. Highly recommend the veggie samosas & biriyani (my fave so far is the lamb). Can't wait to try it all once their full menu becomes available."}
{"text":"Clean place. Fast service. Portions are huge. My favorite hummus in the city, not too much lemon, drizzled with oil & flavored perfectly. King sultan I is delicious & a chance to try different style of meats."}
{"text":"This is a great place for authentic Mediterranean food on the outside of the strip. I ordered the Sultani Kabob. It was so good."}
{"text":"I found this place via yelp. Place was clean and deserted when i got there. Except for myself the person tending the cash register and cook there was nary a soul in the place. Wasnt sure what to expect but the reviewed looked really good and so did the previous reviews of their food. I had the sultani platter, a side of fish and hummus. Food was great and cooked just right. I really like the fact that the side salad had a bit of kick to it with the chopped peppers.    Only thing that turned me off was the hummus, it was slightly on the grainy side & had a similar texture to chunky peanut butter. I prefer mine to be smooth in consistency. But i was quite satisfied overall with the meal & will re-visit again the next time I am back in LV."}
{"text":"From the time I placed my order to the time I finished my meal it had hardly been 25 minutes. Despite some woman complaining her food took too long, I was very satisfied! It's been 6 years since I've had shawarma and I had a regular place before moving to Vegas, so I was nervous to try a new place. I'm so glad I stopped into this place! If I wasn't so full I'd be ordering another! I will definitely be returning!"}
{"text":"I eat here about once a week on my lunch break.  The service is indifferent, but friendly enough.  The Kofta Meal is absolutely incredible for the price. The rice is well seasoned, the tabbouleh is fresh, the pita is crisp. It's just tasty... and it doesn't make you feel awful after you clean your plate.  Don't expect a Michelin-star experience. But if you come in hungry you'll probably leave satisfied."}
{"text":"The prices have ridiculously gone up and the portions extremely small.  Will not be back ever again"}
{"text":"Just tried this place and was very pleased the service was great and very friendly staff. The food was very delicious I had the gyro combo and chicken tandoori which was cooked just right. I'll definitely be coming back to try the rest of the menu!!"}
{"text":"Few years ago I would have given this restaurant 5 stars. But it seems like as their prices go up, the cut of their meats gets smaller. Though I still think they have the best kabob in town with regards to flavor but I just don't if it's worth the trip to go to that side of town."}
{"text":"We're visiting from out of town and this was a great meal! Delicious flavoring, fresh delicious food. The home made hummus is worth it, it all hits the spot. Very affordable, kind employees. I definitely recommend this place!"}
{"text":"The ground beef and beef soltani were just about perfect, great place to eat. We will definitely be back soon!"}
{"text":"I have been eating here for about a year. I get the eggplant dish or fish kabob. My husband gets the chicken and kofta kabob. It is always delicious. The service is consistently good and the restaurant is clean."}
{"text":"The food was okay, not really a big fan of kabobs, but still worth a try and the price was fair"}
