{"text":"Friendly hostess. The chef was on point with the omelette . Also ordered Halim, very good. Would definitely recommend. Inside sitting as well as outside. Great Place."}
{"text":"Great place for breakfast and coffee.  Breakfast was a amazing with great spices to the dishes."}
{"text":"4/5! We randomly came across this place while we were looking for brunch places. Banu is on my list of places to try because it has good reviews, so we assumed the sister restaurant would be great as well. I ordered the Mirza ghasemi (a thick garlicky purée of tomatoes and roasted aubergines). It was fantastic. In order to give it a 5/5 I need to go back and try the dinner menu. Stay tuned..."}
{"text":"Awful food man.  I don't like to disgrace.  But for 16.95 and 2.95 tip.  Awful food and they even turn on foodora for some reason.   Don't get the ghormeh sabzi.  Go to steels and Yonge.  THE BEST UP THERE.   Downtown.           Is nooooo goooood!"}
{"text":"Went to kadbanu tonight and I should say I am very disappointed with the food quality and the portion size ! We ordered the cutlet ( it was waaaay too breaded  and burnt ) and beef stroganoff (the taste was ok but too small ) and the tongue sandwich ( thinnest slice of meat I've ever seen + no taste ) .I give kadbanu 1 star because their drink menu was fairly good ( we tried the vodka albaloo and vodka sekanjebeen) I won't go back cuz it's not worth 75$ and I've had better Iranian food."}
{"text":"Don't come here unless you have all day to spare.  We came for lunch on a weekday.  It wasn't particularly busy.  Our lunch took an hour to arrive.  A whole hour!  We complained and the waitress was mildly apologetic.  The food was ok, nothing to write home about (my wife's family is Iranian so I know Persian food).  The portions were small, and we left hungry and annoyed.  Can't recommend."}
{"text":"I came in almost a month ago and had the tongue sandwich. It was so delicious and fresh. The sesame bread was so yummy.   It was a really hot day and the waitress was really sweet and gave us ice water while we waited to get my sandwich to go. Great service! Delicious food! I wouldn't hesitate to go back. Based on reviews I'm going to have to try the brunch."}
{"text":"I only got a latte to go, but this was the worst latte I have ever gotten in Toronto by far. It was served to me so hot I have to wait 10 minutes before I could drink it. The milk was not properly aerated and a little burnt. It was actually so bad I threw it in the trash. I will give Kadbanu two stars because I have not had the food yet.   Please watch a youtube video tutorial on how to make a latte."}
{"text":"My friend walked by Kadbanu this week and suggested that we come here for a girls brunch. The place is a bit small so we made a reservation to avoid any wait. I called in before our reservation to let them know that we were running a few minutes late and they were extremely nice about it. We were greeted politely and seated promptly. The decor is simple yet chic - a brunch place. I ordered the shashouka (see picture). The tomato/egg was okay but the sesame bread was amazing! Absolutely delicious!   I'm a sucker for sweets and the dessert (of the day?) was Baklava Cake which a cranberry/pomegranate  (?) molasses. Let me tell you... this was the BEST dessert I've had in a long time! The cake itself was delicious but the tartness of the cranberry/pomegranate molasses complimented the cake extremely well - I HIGHLY recommend this dessert.   I will be coming back to try the other meals and maybe their non-brunch items (assuming they serve non-brunch items as well? not sure). The place is cute, chic, and very trendy - for all you foodie photographers ;)"}
{"text":"Great Persian food and service! Especially loved the white colored theme and decor. My only complaint would be to have more meat in the Ghormeh Sabzi. But everything was delicious. Definitely recommend."}
{"text":"Don't call it the Persian food. IF you want to have a measure of  worst possible quality and taste, try it!"}
{"text":"We went for an early dinner. The rice was so bad. In Persian cuisine, making rice is a basic technic that every chef should know about. Their rice was so blend and it wasn't fresh at all maybe the leftover from 5-7 days before. The \"mirzaghasemi\" wasn't good either. I tried the cutlet and I didn't like it, raw on the inside and burned on the outside.  I won't come back here."}
{"text":"I really enjoyed owner's attention to details in order to provide the customer with a fabulous dining experience. I had brunch at this place today and enjoyed every moment of it. If you are seeking an authentic Persian cuisine, obviously you've had the wrong expectations in mind. Here's a place which gives you a unique contemporary perspective of the culture and takes you through a journey that you've never experienced before. Give it a try!"}
{"text":"This place is wonderful. A sister restaurant to Banu on Queen. Kadbanu focuses on dishes other than kabobs. We were here for a very unique brunch. They serve a mix of traditional Persian breakfast items, along with some Persian dishes that have been tweaked to make them more \"brunchy\". I had a smokey eggplant dish topped with a sunny side up egg. My friend had haleem, a thick sweet porridge. It's all quite different than your typical brunch place: a nice change of pace if you are sick of waffles or French toast or bacon and eggs. They have take out sandwiches and some Persian groceries I'll have to check out another time. The interior is nice and bright. It's a corner restaurant with giant windows and high ceilings. Service friendly and personable. I am a fan."}
{"text":"They have a great selection of dishes for brunch, mixing the Persian cuisine and putting a brunch twist. Wish I tried the more traditional dishes though (tachin and ghormeh sabzi). Would definitely come back for just a lunch or dinner."}
{"text":"Went there with a few friends for the first time and was skeptical tbh. I was very surprisingly delighted! Amazing authentic Persian recipes with gorgeous modern presentation. The service was also on point. Can't wait to go again! Definitely try the tahchin & the cow tongue!"}
{"text":"A little hyped for it is really is - small portions of decent food. Just leaves you a bit unsatiated at the end which is the greatest shortfall of any place intending to serve good food.   Space is nice and unique, but quite cold in the winter."}
{"text":"I love this place! Big beautiful open space to eat and talk with marble tabletops. Delicious rose water added to my pomegranate juice with no sugar. And a sweet smelling tea to finish the satiation from the delectable brunch food. We had warm fresh bread with creme de la cream and homemade jams. Scrumptious veggies with eggs and amazing service and a smile from the beautiful hostess."}
{"text":"Lovely place for brunch! Beautiful open space! Good service and delicious food Mirza Ghasemi!"}
{"text":"Give it a chance.  It may be neighbours to the trendy but this place can hold their own.  The braised sliced tongue melts in your mouth with tenderness and rich flavours and Pairs perfectly with rice.   Just great flavours all around"}
{"text":"I live around the corner from this place. I always get the soup and sandwich and am never disappointed. I have had the curry chicken sandwich, the veg on veg, as well as the dill and potato soup, and a pureed squash soup. Everything was well seasoned, balanced, and just overall very good. The hostess/server is always very chatty and inviting. For takeout they do a tax included 10$ sandwich with soup or salad and it is SUCH a bargain. I really cant say enough about how nice it is to live around the corner from such a nice spot."}
{"text":"Good little spot for brunch. The food is good but felt as though there wasn't enough flavour in any of the dishes. Good portions however and well priced."}
