{"text":"Love love love this place! Simple, yet to the point! Amazing coffee, great prices and stylish design! My go to for great coffee in the junction!"}
{"text":"To me, this little place is exactly what a coffee shop should be; effective delicious coffee prepared with care, in a space that is stylish AF and gorgeously designed (the logo and typeface hand applied to the front window in gold and black is wonderful).

If I have one suggestion for improvement, it pertains to the ceramic 'for here' mugs, and this isn't a fault found only with kaffebar; the mugs used 'for here' are either the small cappuccino style, or the very large bowl type latte mugs. Neither of which are well suited to my drink of choice, the americano. The cappuccino mugs are too small of course, and the latte ones are just too big. You end up getting a watery looking americano and the crema dissipates very quickly. But worse still, is that fact that the coffee rapidly cools do to the large surface area exposed to atmosphere. As I alluded to above, this scenario happens at nearly every coffee shop for some reason and that means that I end up getting my coffee in paper cups more often than if like to.

I'd like to point out however, that kaffebar uses PS lids that are fully recyclable, so at least I don't have to feel too bad when I take my delicious coffee to go."}
{"text":"Wonderful spot for an espresso and handmade treat. Love everything about this beautifully put together café."}
{"text":"This truly is a gem in Toronto, and not just in the Junction. I was driving with my mom and the weather was absolutely miserable (snow, rain, slush, cold) and when she pointed out Kaffebar, I thought, \"sure, why not?\"

One of the best decisions ever. 

It's a super small space inside but cleanly kept, especially the bathrooms. I loved that the signs displayed all the prices *including* tax so I knew exactly how much I'd be paying. We ended up getting a black decaf Americano and hot chocolate and they were two of the best drinks we've ever had. The decaf Americano was smooth with a clean, quick-finishing taste, while the hot chocolate was sweet without being syrupy or saccharine. We also ended up getting ginger cookies, which had a subtle taste and a nice soft layer of sugar on top. Total price for two drinks and two cookies: $8

If I had to nitpick about anything, it'd be to see a wider food selection than cookies and croissants. But once you're sitting there, listening to the barista's excellent taste in music (Ella Fitzgerald, Frank Sinatra), every worry in life melts away.

Awesome place to go!"}
{"text":"Amazing service and great coffee; the space is synonymous with Scandinavia."}
{"text":"Cute little espresso bar, which looks like it will be a good place for work on a quiet weekday afternoon, I ordered a double americano and the housemade skolebrød (both 2.25). Everything was great and the skolebrød is a must try. I will be back."}
{"text":"Simple espresso-based,hot chocolate, and tea menu made fresh and with care. Turnaround time is quick and great customer service from the get go. Serves both hot and iced beverages, and has decaf too. Doesn't serve drip coffee. offers both soy and almond milk for all. They also offer organic honey, cane sugar, and white sugar. 

Great to sit down and have a chat with friends, and great to grab and go. Serves a revolving list of fresh baked goods from local suppliers. 

The storefront is small but laid out well so it doesn't get too crowded, and the decor is very European. There's always some catchy music playing in the background - not too loud to do work. Free wifi for those wanting to relax. In the summer, nice bench on the outside to sit and enjoy your coffee and people watch in the Junction.

Barista is extremely friendly, and will even let regular customers text in their order in advance.

Extremely reasonably priced, great value.

Doesn't accept debit but cash and credit is accepted. 

Highly recommend for those wanting to support local business and get some great coffee!"}
{"text":"When I went to Kaffebar alone, the coffee was always great. Usually I got a latte or americano, loved her cardamom latte in the fall. But after going alone a bunch of times I took my husband. My coffee came first and was great, his came second and was awful. The first time I thought this was just an error and maybe she forgot something. By the third time this happened to us we decided to stop going. I don't know what's going wrong but the second coffee she makes is always terrible. First one is still good so if you're going alone then thumbs up."}
{"text":"Quick and dirty visit on Sunday as I was in a pinch and needed a quick little bite and a coffee to wake up. It's super SUPER tiny, likely not much more than 250-350 square feet, which is good bc it keeps the crowd moving in and out for what they need.

Ordered an Americano and when I was told they didn't have \"food\" I just went for one of their pastry options - a chocolate croissant. 

The americano and the croissant were both exceptional - seriously really great. Price was on par with local spots so no complaints there.

They have free treats near the door for your dog while they wait, which is a great bonus for you dog owners or dog walkers. 

My only wish was that they had some more food options - that's really it."}
{"text":"Unpretentious and friendly with excellent espresso-based drinks pulled using beans from either Pilot Roasters or Cut Coffee.  Even though I was originally intending to simply buy a bag of beans and split they offered a complimentary espresso for making the bean purchase.   How could I say no?  This place is a little gem!"}
{"text":"I had the best decaf almond milk latte this weekend. Smooth and rich. It's my favourite latte place in Toronto."}
{"text":"Not enjoying quite as much. Only coffee shop in the area that doesn't have a loyalty card.
But my real issue is that the hours are inconsistent-especially when Kim isn't there! It's the worst when I have to be at work and I'm sitting outside waiting. So I switched to Full Stop most mornings. A shame as I like Kim's baked goods."}
{"text":"Kaffebar is a very cute little coffee shop worth a stop in if you're around the area :)! Kim is a very sweet person and amazing barista. I usually order a latte with almond milk. Consistently they come out amazing - very rich and thick with foam and the coffee she uses is great. She usually has pastries on display as well, so occasionally I'll pick up one or two of those. I've tried the Americano as well which was very well done! Every time I come in Kim is quick to remember my order and chat about whatever we were discussing the last visit (she has an amazing memory!) definitely a go-to when I'm in the area! And definitely worth a few trips for some amazing coffee!"}
{"text":"Enjoying a walk down Dundas Street West yesterday, I started thinking about eating.. Eating anything but Thai. Too much Thai of late. Thought I would look into \"About a Girl\" and it looked fine but did nit appeal to my mood. Back up the street the Kaffe Bar awaited in all its pristine modernity. Beautifully upgraded petite space with fine coffee, good blues music and outstanding conversation. Kim has created a wonderful oasis that could be in any part of town though small makes it intimate. And the intimate space is rare in this mixed 'hood. Here is to rewards aplenty with this bold new venture. Already looking forward to returning as much for the great conversation as the excellent Americano."}
{"text":"Small, quaint and plain looking place.  

I actually searched it out after reading it was open.

Walked in and ordered a decaf americano.  

They \"ran out\" of decaf.

Walked out."}
{"text":"The perfect place for this tourist to stop for a latte and a baked good before hopping on the subway to explore Toronto. I am a coffee snob and my latte was perfect. The warm, just out of the oven banana bread made it even better. Barista was friendly and knowledgeable, giving us numerous suggestions for lace to visit and explore. Will stop by again, in the morning before heading home."}
{"text":"latte was creamy and Easy to drink. Not bitter at all. Just a Simple and small coffee store."}
