{"text":"On a snowy wintry day, Kahwa is my type of cafe. Wooden chairs and tables, couches in the back corner, string lights, enough space to move around comfortably--but small enough enough to still feel cozy. There's a big window to let enough light in the day, and fogs up just right to make you happy to be inside.

I find their coffee to be a bit weak and watery. Last time I decided to give a latte a go here, but I was disappointed. It  felt like I was just drinking a big bowl of warm milk. No thanks. Their date pastry and baklava is pretty good, it's a nice change of pastry options which I really like.

They have a pretty decent selection of Kusmi teas, drinks and desserts. Although I often visit the cafe, I make an exception for mediocre coffee because of the nice ambiance, reliable wifi and friendly barista."}
{"text":"Ouawou coup de coeur pour ce café! Il y'a tous ce qu'il faut pour rendre heureux n'importe qui! Bagels, soupes, couscous, pâtisseries,...

La soupe du jour était super bonne et pour un prix plus qu'abordable! L'endroit est calme mais animé, parfait pour travailler dans une ambiance chaleureuse! Le wifi est disponible gratuitement ainsi qu'une terrasse pour prendre l'air!"}
{"text":"Returned here on my second trip to Montreal to find the veggie couscous as savory and filling as ever (I went from painfully famished to painfully full before finishing my portion) and the nice switch (seasonal perhaps?) of a chili sauce for a sweet relish on the side. The staff is helpful and courteous, and the wifi is a great bonus. This is the sort of spot where one can sit for a bit to write, study, or socialize, without fear of getting the evil \"time's up\" eye (does this happen in Montreal? Maybe it's a NYC thing). I haven't had the coffee yet but plan to try it."}
{"text":"Really good coffee.....dark, rich espresso....truly EXCELLENT Tunisian couscous, and friendly service. A great place to meet a friend or come as a tourist and hang in one of the best cafes on the \"Plateau\". Two blocks from Montroyal metro, with a view of the mountain."}
{"text":"Love stopping here for coffee with my husband after a ride around Mt Royale, especially after those multiple hills. We always stop by after our rides when we visit Montreal. The cafe is cute, sunny and clean and the staff is friendly. The coffee taste great, aka never burnt. Had the latte and americano before and both were nice. Love the math and physics writings on the wall."}
{"text":"Really awesome atmosphere, and friendly staff! Had a great chai latte!"}
{"text":"Years ago this cafe was incredible it has a nice mystical energy. Great for inspiration for a project, life etc ..  I appreciated how it was very different from others. Nice cultural touch. 
Over the years it seems to have lost that. 
It is not as cozy. The seating is too close and it can get very stuffy. 
They are not nearly as friendly as were. 
The do still serve nice teas and ready to go food though!"}
{"text":"Best coffee we had in Montreal. I wish I had tried the cous cous. I saw it and it looked fabulous.  Service was excellent."}
{"text":"J'ai adoré mon chocolat chaud. Ils avaient l'option lait d'amande, moi qui suit intolérante au lactose. Superbe déco tout à fait dans mes goûts. J'ai trouvé le barista un peu bête, il semblait prendre son temps et s'en foutre un peu..."}
{"text":"A cosy little coffee shop with eclectic decor. The coffee is decent, the vibe is relaxed, they have a nice little terrace out back, what more to ask for? Oh and they have interesting mugs. Its the details like this that make me really enjoy a place. I like it best for sitting out on the back terrace, enjoying a little sun, drinking a beverage.  It's as close to a back yard as I'm getting for the moment.

I find service is hit or miss depending on who is working the counter. Sometimes its super friendly, sometimes a little dry. No matter, the coffee and the vibe are why I choose to stop in."}
{"text":"On vous accueille ici avec un beau sourire. Le café est très bon et que dire des odeurs qui se dégagent du four! Ça ouvre l'appétit. L'endroit est lumineux et on peut s'y installer pour travailler. Il y a des prises de courant pour brancher un ordinateur. On y sert des couscous mais aussi des petits déjeuners et des patisseries. Très bien situé sur Mont-Royal."}
{"text":"Found this cool little joint while taking a self-guided walking tour of Montreal. Great little coffee joint on a cool street.. AND they have free wifi.. can't beat that!"}
{"text":"Encore un lieu où je suis passée des dizaines de fois devant en me disant \"à tester\" sans jamais passé la porte! 
Et pourtant c'est si simple de passer cette porte, pour pleins d'occasion différentes : un café seul ou entre ami, déguster un merveilleux thé à la menthe avec une de leur exquise pâtisserie et surtout pour assouvir une folle envie de couscous. Leur version végé était particulièrement bonne, la semoule très goûteuse ainsi que les légumes! Assez épicé (comme un couscous diront certains) par contre, si vous êtes sensibles peut être le préciser."}
{"text":"Under-rated. 
I ordered veggie couscous and got a large portion for $8.50, topped with tagine style whole veggies (zucchini, carrot, cabbage) not small pieces. The veggies were seasoned well and easily came apart with a gentle push of my knife. I'd come back for breakfast, lunch and dinner to eat that.

Ambiance: Coffee house, can be busy but I think that adds to the feel."}
{"text":"Good latte and snacks. I need to try the couscous sometime, it looks good. Nice, laid-back staff and atmosphere. New location is just a few steps away from the old one, just east of Henri-Julien."}
{"text":"Didn't stay here long but I got the Vanilla Hot Chocolate to go! It really enjoyed it!

The decor is quite unique! It's a really cozy coffee place! Staff were very friendly and engaged in conversation with us, which made me feel like we were more than customers!

They also have a nice terrace in the back! 
Btw, \"Kahwa\" in Arabic means \"coffee\"! Just thought you should know that :) haha"}
{"text":"I loved this place more for its decor than its coffee. Lots of wood, very eclectic and definitely has lots of personality. They also have a small, cozy terrace out back. For those of you who don't like coffee, Kahwa also offers a selection of Kusmi and LOV tea. I ordered a latte that was so/so. It was a little too bitter for my taste somewhat lacking in flavor. It wasn't what I would call,  tasty (I like tasty!). As well, the guy behind the counter (owner, maybe?) wasn't very friendly. I found him to be a little dry."}
{"text":"We were visiting from Portland, OR and we were taken away by this great Tunisian place! Good customer service , Coffee is amazing and the CousCous is what my great great Grandma would make Amazing. The owner is hands on and strives for perfection ! Best north African food with a cultural twist of Canadian French   !"}
{"text":"Our friend chose this spot because \"they make really hot coffee, which I value over taste, and tea with fresh leaves, which is kind of cool\". We only got whoopie pie and drinks - tea, coffee, and hot chocolate - all were good. We weren't hungry for a meal - but the cuscus looked good. The furniture is a bit eclectic and make it a bit hard to move around. My girlfriend had to get up so that someone else can go back to their seat. It's self service here - get your food / drinks and sit yourself down wherever you find an available spot. Getting water is also self service - I went for 4 glasses and they had to wash some on the spot and made it a bit awkward. The crowd is mixed - from students with laptops to couples on dates, and the vibe is casual and nice. It's good.. not supreme but a nice hang out for a lazy weekend afternoon."}
{"text":"Great coffee and a decent selection of sandwiches and salads. They also have a great terrace hidden in the back. You should give it a try!"}
{"text":"Le couscous à l'agneau est délicieux . Un gros morceau d'agneau accompagné de pomme de terre carottes céleri et juste assez épicé."}
{"text":"Kahwa = Coffee in phonetic Arabic translation and this place certain has it.  My first time in the establishment, so I took in the ambiance, and my first sense is that the owner loves this place! After settling my \"office\", I looked around and felt like a chess piece which, in this case meant it felt kinda cool. 

My other observations:
- the square wooden tables, the wooden detailed chairs: all mismatching-ly matching, 
- the mathematical equations running down a blackboard strip on the ceiling and the pencil art on the walls gave off an energy left behind by a lab coated genius who just made a breakthrough discovery
- the terrace in the back - so awesome!
- Coffee aroma wafting around the length of the space

Others:
- An Old Boys Meeting: a trio of 50-somethings taking in espresso and conversation
- Solo Macbookers toiling away at their work
- bicyclists making the most of the late-morning post-ride

I had a Iced Latte and using the Île sans fil so I was set. The espresso was tasty, robust, not bitter but awkward to drink from the bowl type used with a straw placed in it. I chose crispy delicious baklawa, the other desserts are all owner-made . I glanced over at the sandwiches/wraps and made a mental note to try a bit later, with their wholesome looking salad. Bonus: accepting cash, credit, debit

Another mention on the decor - love the thought put into the wood framing, and the apple crate shelving, and the service counter.

Alas decor, feeling all chess-piece like, and the allure of the hidden-gem of a terrace could not make me stay because of the hot day + lack of air conditioning. I was melting and very conscious of the rising temperature which blocked me from working, so I forwent the lunch and headed for the next new café with a cold front on my list of should try."}
{"text":"Le kahwa tu peux te faire plaisir de différente manière et ca c'est le pied.
Après avoir testé le chocolat chaud (à en boire des litres), les pâtisseries ou le couscous je me dis tout simplement que je n'ai pas assez d'appétit pour tout manger à chacune des mes visites :)
Parlons du couscous qui avec sa semoule te fait voyager au magreb. Les légumes sont bons et les viandes parfaites. Que demande le peuple ?
C'est donc l'endroit pour venir le matin, le midi ou le soir. Tu trouveras toujours un truc qui te donnera envie suivant l'heure. Qui dit mieux ?
Au niveau des prix c'est tout à fait correct et ca c'est cool

Le kahwa ce sont des srabs, y a pas photo :)"}
{"text":"\" kahwa\"  veut  dire café en langue arabe .

  Le service à la clientèle est vraiment rapide. Il m' arrive d'y aller quelque fois pour y étudier ou faire des échanges linguistiques avec des amis. On nous reçoit de manière chaleureuses. Le décor est vraiment original avec un art abstrait .  J'adore le nouvel emplacement  de  leur café . 
  L' espace est plus grand que dans l'ancien café . Leur chocolat c'est du vrai cacao  c'est vraiment bien ."}
{"text":"It's a lovely café that provided an iced Americano when I wanted to cool down for the summer heat. There's a lot of space to sit at the wooden tables or at the window bar, whether you're solo or with a friend. 

It's also a great spot to sit and work as a few people had set up camp with their laptops and worked. Kahwa Café offered that friendly ambiance where one could work with ease."}
{"text":"My favorite coffee place in montreal, and this is coming from someone who's not a huge fan of coffee. I really like the atmosphere, it's very quirky and cosy. They have one the best chai latté i've ever had, and they serve all their drinks in the cutest mugs. 

They have a good selection of ksumi tea but I always stick to lapsang souchong. I also love the music they play, very eclectic and not too loud."}
{"text":"It is home grown! Earthy warm and good for reading on a dirty Sunday. Healthy coffee with snacks inexpensive to your leisure."}
{"text":"Decor: Moroccan artifacts and temporary art, some beautiful  (I personally don't like photos of naked women in disguised of art).
We went there twice. Once for coffee, my partner had Americano, I had latte, they were both good. We returned to try the couscous with Lamb. I am very familiar with this dish, my partner never had it before. We both declared as superb. The lamb shank just melted in your mouth, lot's of vegetable with the couscous and great flavours. The service was good and the price beyond reasonable ($15)."}
{"text":"Went to lunch here last week and the food was good. But they brought out the wrong dish....however it's still yummy so we just ate it. The lemonade was great and so was the date square!"}
{"text":"Le kahwa café offre un cadre chaleureux et original. On y trouve de grandes tables en bois parfaites pour les groupes mais aussi des tables plus petites ainsi que de fauteuils. La (bonne) musique en fond sonore et le bruit des conversations n'en font pas moins un endroit calme parfait pour travailler (en plus le wifi est gratuit et la connexion de bonne qualité), discuter ou juste se détendre.
J'y suis allée plusieurs fois et j'ai pu constater que le personne était vraiment gentil, en effet, un jour j'ai eu un grand latté pour le prix d'un petit suite à une erreur de la part du serveur, une autre fois, il manquait de lait de soja pour mon café mais le serveur est allé à l'épicerie du coin en racheter directement,... Bref, je me suis retrouvée face à des gens souriants qui avaient vraiment à coeur de bien accueillir les clients. De plus, leur café est excellent (petit coup de coeur pour le latté au sirop d'érable) et leur soupe aux lentilles délicieuse ! 
On peut aussi y manger du couscous (végétarien ou non), des bagels mais aussi des desserts (mais je pense malheureusement qu'aucun n'est vegan) et tout est à un bon prix. 
Vraiment un café qui vaut le détour à montreal !"}
{"text":"Middle eastern/arab friendly coffee shop, the guy behind the counter was rude, not respectful and unfriendly, I'm sorry, I'll go elsewhere on the Plateau spend my money or in the Mile-End with the hispters! My americano was good though. Free wifi here!"}
{"text":"So great! They have chalkboard paint everywhere with drawings and math equations scrawled here and there, and they sometimes have events and live music (came here on a random Sunday afternoon and there was amazing live Flamenco)!

The coffee is good and the couscous is delicious.

Unlike most cafés, the artists they feature on the walls are actually interesting and relevant and the overall feeling and look of the place is great.

Do it!"}
{"text":"Mettez-vous dans ma peau quelques minutes. Il est vendredi de matin. Il fait soleil, mais frette. J'ai décidé d'aller reconduire mon chum à son travail à la condition d'arrêter prendre un café dans un nouvel endroit. On entre donc au Kahwa, avant même d'avoir consulté Yelp (mon téléphone était oublié chez moi) moi en pensant que ça allait être bon parce que j'avais marché devant quelques fois déjà, et mon chum, un peu grincheux avec son air de « je n'en ai jamais entendu parlé, et je ne l'ai jamais remarqué, même si je passe par là à tous les jours, donc ça doit pas être si bon que ça.»

Pourtant, à peine 30 secondes dans notre première visite et on était tous deux charmés, surtout quand le proprio nous a dit lorsqu'on a demandé pour un simple café filtre, « Ben là! J'ai tu l'air de quelqu'un qui fait du café filtre? Je fais juste du vrai café moi! », tout en montrant d'un élan de bras la superbe machine espresso (elle est vraiment belle, en bronze et tout!) et le menu des café espresso. C'était le coup de foudre. En plus, les croissants qui étaient encore dans leur boîte de livraison, et donc qui avaient l'air de sortir tout droit du four, on été le parfait accompagnement pour des lattes délicieux dans des tasses si jolies.

Le décor est à la fois éclectique et artistique, sans que ça ait trop l'air « broche à foin. » En fait, il y a plein de détails qui attirent l'attention sans trop crier comme le rhinocéros volant à l'extérieur, les tables avec des dessins de personnages comiques ou bien même le plafond parsemé de formules mathématiques! L'ambiance est parfaite pour étudier, travailler, jaser, lire lorsqu'on aime être entouré de gens, et même pour emmener des p'tits bout d'choux!"}
{"text":"This is a very special, and very bizarre, cafe serving food and coffee drinks in a really cool Montreal neighborhood. The food is a weird mix: grilled cheese, and couscous. I tried the couscous, and it was magnificent. The food is only part of the reason to come here, though. The place is just plain funky. Two rhinoceros heads stick out of the front wall, for instance. The entire neighborhood is really cool, and if you're looking for a taste of what makes Montreal special, this would be a good place to start a pleasant afternoon."}
{"text":"We stumbled upon this place on New Year's Day, when most places in Montreal are closed, so our options were limited from the start and this was one of the only places open. We ordered the couscous with sausage which had obviously been microwaved (you can't make this stuff up...), given that some parts were obviously cold (seriously!) and other parts very hot. The meat didn't taste the freshest either, and I ended up not eating it. The americano I ordered was also stale and bitter tasting.  It was so disappointing considering the environment and setup of the cafe have so much potential! I will say the baklava was delicious though! Very flaky, not too sweet and had an excellent flavor."}
