{"text":"Great meals at reasonable prices. Just gets very busy on weekends, huge wait and over crowded."}
{"text":"We were in Canada for 4 days in May and OMG...this was the BEST BEST lamb tika kabob we ever had.  The lamb was very tender and rich in flavors, it wasn't over marinaded...it was just perfect!!  

The palow (brown rice) that came with the kabob was also delicious and very flavorful.  My brother and I are specifically going to Toronto again next month because of the place :)

Atmosphere is like a fast food place, loud and self service but the food is amazing and makes up for it.  I have been recommending this place to everyone thats going to Toronto!!"}
{"text":"Terrible customer service, Rude staff, over charging, mixing orders, 
Every time I order Bolani they don't have it, so why have it in the menu?
Naans are usually dry and stale and reheated the next day, 
No fixed time to open, last time we waited 10 minutes outside after 12 noon, Hours of business are not posted on front door.
I will not go back.
BTW, the above review is for their Scarborough location."}
{"text":"The food is OK, nothing special,
But this place has horrible customer service, I have been there 3 times, rude staff placing wrong orders, Over charging and no refund or apologizing for their mistakes, the paper manu has different pricing on some items compare to the display menu above the counter.
 Had to wait 10 minutes after 12 pm outside the door,  and there is no business timing displayed on the door, 
There are better Afghan eateries in town with much nicer customer service, 
I am done with this place !!"}
{"text":"This place has an interesting mix of a 'real restaurant' environment and McDonald-style self-service, with the plastic trays and everything. The food portions are big, and the meats are well-marinaded - I'd describe it as an above-average food court fare."}
{"text":"Waited 20 minutes and the slim waitress was rude when asked about our order.

Drive for another 5 mins north and you'll arrive at Bamiyan."}
{"text":"45 minutes for food at lunch hour is not acceptable....the service is much better at Bamiyan"}
{"text":"I've given this place a couple of tries and although the food is good. The service is quite slow and have witnessed the cashier/waitress get in arguments with customers over items that could easily be rectified. I'll be driving the extra 5 mins and go to Bamiyan instead."}
{"text":"The food was so good. Huge portions which I need two days to finish. The rice was yum! And I'm not even a huge rice fan. Its casual dining with modern ambiance. Price was reasonable as well. Will definitely be back."}
{"text":"Food is good! Fresh and yummy but worst place for babies. They have broken highchairs, and shaky.. very dangerous for active babies... All of those are shaky outdated expired highchairs.. BEWARE"}
{"text":"Amazing food and quality , taste is so authentic , has a prayer room too .. Wow .. My fav place in Toronto"}
{"text":"Customer service is terrible. The cashiers are rude but the food totally makes up for this and it's what makes me keep returning for more! Amazing food, great taste and good quality meat"}
{"text":"We were the only people in the store when we ordered our food, then they told us their system was down. They said that they were going to call us when the food was ready and we could pay then. We waited for 20 min noticing other people were coming and leaving with their food. I approached the person who put our order through and she told me our order did not go through because we did not pay. I repeated what she had told me when we first ordered. She said \"I know I'm sorry\" they should have approached us and told us that our food order did not go through while we were the only people in the store not after 4 orders came and gone. Extremely unimpressed with the professionalism and service here."}
{"text":"One of the worst experiences I ever had. I am writing this from the restaurant itself because the service is so terrible. 

I went in there with a few friends. We had to wait over 20 minutes after we ordered the foods and there were only two people before us. The food is mediocre at best. I also ordered a pop with food and it was not cold; it was at room temperature. I asked them replace the coke and they refused to give me a cold one saying I already opened it. And the attitude of the attendants are rude and snobby. 

Truly a place to avoid. Terrible food and horrible service."}
{"text":"Came here with my colleagues for the first time and I must say I am impressed. 

First impression of the place is not too bad. Looks clean and had some nice waterfall glass decor.

The meals are made fresh and was pretty quick. I went around noon so it wasn't too busy. I ordered the lamb chops and they were super tasty! Some parts were a little burnt resulting in it being overcooked.. 

Overall was a good experience."}
{"text":": I want to Kandahar kabab what I nice rest. Super service nice food great to go whit family friends"}
{"text":"THE WORST CUSTOMER SERVICE:This was my favourite restaurant. From past couple of experiences I have observed the service are way below average. Today I really had worse experience I don't think I will ever want to go again. The rates which are displayed are not the same what they billed. The staff who take the order will not bother about the customer service anymore. since they are huge lineups for the food they don't  need to be attentive. Today I have ordered 2 dishes 1 dish for dine in and 1 for take out and the clerk made both take out. When I asked her to make 1 dine in, just gave the parcel boxes in a tray. There were no spoons or knives to eat. They made me to wait for a while to get the cutlery. By the time I started eating the food was already very cold. I had similar kind of experience last time also. I don't think if the management is not talking care of this things soon they will lose loyal customers like me. They will not have line ups anymore."}
{"text":"This place used to be good, but it has gone from bad to worse. The other day I went in for dumplings and it took them almost an hour to make the worst dumplings ever. It raw, stinky, and did not taste like Afghan mantoo. Never going back!"}
{"text":"Food tastes good. But had to wait 40+ mins for the order to arrive. Would've understood if it was busy that day, but it wasn't. 
Servers behind the counter just kept talking to each other instead of answering a question. They have made their rice portions smaller than before. Overall food quality has gone down but still pretty good."}
{"text":"ABSOLUTLY  AMMAZING  FOOD! !.  100%!!.  NO LIE...EAT HERE.....  simple clean friendly. ..And The Kabob  is So Good  ..NO JOKE..  You eat and feel so relaxed.. you wanna sleep..  plate size is Large...everything  is cooked fresh To order. . The side Sauce,  makes you  ask for More...  10 out of 10..  absolutely  No Complaints. .100% Recommended! !!  .."}
{"text":"I would not mind going back here, but I have been to better restaurants that I have felt fully comfortable and content at. The kebabs were good, and the chicken was exceptional. The decor is nice what with its fountains and chandeliers, but one thing I was not happy about whatsoever was that when I was chewing a piece of kebab, I felt something hard in my mouth. After rolling it around a bit in my mouth to see what it was, I took it out. I though it might be a tooth, a bone, or an uncooked piece of meat but it turned out to be a gold, metal, something of a screw! :O  I do not know if it is a piece of the grinder, but I hope that if I do go back here, this will not happen again or to anyone else for that matter. But, I suppose the manager made up for it with how sincere he was when informed about what happened and giving us free dessert, which was delicious. All in all, this is an alright place but they better make sure to watch out for anything that may have made it into their food throughly."}
{"text":"This place has the most tender veal filet mignon I've ever had. Their chicken and beef kofta is extremely flavourful and moist. Also, this place has the best naan I've had. I could eat it forever. The lineups and organization of the place make no sense to me and it can take a ridiculously long time to get your food during peak hours but the wait is totally worth it for the meat!"}
{"text":"Gorgeous Reno of a former gym. Food took an hour to arrive. Rude front staff, food mediocre, one way exit. Stick to BAmiyan!"}
{"text":"This is one of my go to places for lunch - if I have time to spare. Strictly speaking, if the ratings were based on just how the food tastes, Kandahar Kabab would deserve a 4 star. However, as others have alluded to before, the wait time here is unacceptable! Whether there's a long line of people in front of you or the store is empty, it'll take at least 30 mins to get your food."}
{"text":"I had such great things about this place and was so excited for it to open up. First time i went was in Ramadan, food was not on point at all, meat was tough and lamb were under cooked ( i chalked this up to the fact that it was iftar time and restaurant was packed) Recently we went another few times and its so disappointing because some thing or another is always missing here from the menu. Usually whatever I want to order is 'sold out' for that day. 

The food is okay, the staff isnt that professional either."}
{"text":"Food is amazing.. mouth watering even thinking about it. Best afghan food in scarborough.. will definitely recommend it to my friends."}
{"text":"Waited over an hour for our food. There was no organization, people crowded around the counters so you couldn't even get through to get ur food when it was finally ready. The worst part though was the service. One of the servers was incredibly rude and actually started yelling at us because we couldn't get through to pick up the order. The food was good but not worth being treated like shit."}
{"text":"Kandahar kabab and Chicken breast kabab are my favorites. Very busy on the weekend nights, be prepared to wait for 45-60 minutes after ordering."}
{"text":"Bring your appetite as portions are a fair size as well as your patience.  I had dinner here on the weekend and it was very busy.  Customers were placing their take out/dine in orders over the counter and the lineup moved slowly.  Two thumbs up for the chicken kebab as it had a good flavour served with plenty of rice."}
{"text":"Amazing food, so tasty and full of flavor. It's sad to see all these low reviews. Must go in person and try it out. The meat was so tender and customer services was amazing."}
{"text":"worst service. worst owner/manager. treats her employees with so much disrespect and especially her customers."}
{"text":"this has to be the best afghan food in scarborough/markham. they are pricey and are super busy , but if you catch them at a good time their food is great. ive eaten at other places but this place honestly serves way more food and it tastes way better. their white based mayo/ranch sauce is DELICIOUS. though i would say their food is pricey and they do need to expand their front desk to serve more people. considering the restaurant itself is pretty large, they should have more cashier stations. i get the boldak kebab which always tastes great !"}
{"text":"The food here is amazing and comes in huge portions. I personally don't enjoy the pita and salad (especially the salad) that comes with the meal so I ask for extra rice as a replacement instead. One meal is good enough for two people. Definitely ask for extra sauce, tastes better with it. This place is kind of food court style where you order your food, get it and sit down and eat. There are no servers so you don't have to tip if you don't want to. All in all, great place for kabobs and rice! Definitely recommend - extremely affordable!"}
{"text":"When going with a large, you want good quality food, with reasonable quantity at a decent price. Well Kandahar Kabab checks out on all three levels. Went with a party of 12 people, and we only needed to get 6 full size plates. Got a mix between Sultani Kabab and Herati Kabao and the quality and quality of food was great. It's easily possible to split a plate between two people and be satisfied. Their rice is amazing and make sure you get the bread with the dipping sauce. The price is very reasonable especially when you can share a plate between two people. The waiting time for the food is a bit longer than usual especially when it is a little busy so be prepared for that. Also, the service could use some major improvements just with the attitude of the front staff."}
{"text":"Few reviewers liked this place better than Bamiyan's, I would like to differ. I would agree that they have huge portions. Their menu is good too, you may taste two different types of kebabs in the meal but I believe that the kebabs at Bamiyan taste much better.

The food here is amazing value as I was only able to finish half of it. I took a parcel to eat it next day, but didn't feel like it as the taste was okay at best. It was a little too salty for me."}
{"text":"I was checking something on the restaurant and I realized my review of this restaurant crapy and doesn't do just to the location. I think I had Just joined yelp and wrote a line or two on this awesome restaurant.

I prefer Kandahr kabab over Watan Kabab as the food is better and over Bamiyan kabab as the seating is way better.

I love any of their kababs and the meat was spiced well and cooked to perfection with the Juiciness and tenderness intact. You enjoy it the meat with rice or there nice soft naan bread. You can also get their Kabuli rice which are is topped with fried sliced carrots and raisins. i also love there 2 sauces (white and red). I have also tired thei lamb chops and they were AWESOME!!! and if you are into delicacy food the quail bird is served here and it was quite nice.

The price is great for the portion they serve. To top it all the food taste really great. The area is great lots of tables for big families!!!

A tip - Ghava (tea) is free...just ask at the counter, it enjoyable to have it over the meal.

It's part of a plaza so there is plenty of parking available.

For my Muslim Brother and Sister - They serve halal meat"}
{"text":"A popular Scarborough self-serve fast food place. Self-serve as in there are table seatings but you order your own food at the counter like any fast food restaurant but you have the choice of siting at the restaurant with real plates and cutlery. 

Their portions are generous and pricing are fair. They are relatively new. Their interior design is nicely done. They also have a point system to receive free items. 

Overall, I'd come back for a meal or two. Their dishes typically come with salad and rice. They take credit/debit/cash"}
{"text":"Really enjoyed this place. My sister kept talking about it so we decided to give it a go. Their portions are big so be prepared to pack some up or share with someone. We got chicken kebabs combo, quail combo and a wrap. The meats are super juicy, tender and well marinated. The rice is moist and fluffy. The naan isn't your typical naan, it's a little harder, smaller and thicker but nonetheless really good. I am absolutely in love with their hot sauce and garlic sauce. If I can get a pail of each and eat it with everything, I would.

Service is self-serve (food court) and a little slow but I think it's because they make all their meats fresh to order so we didn't mind waiting longer even though I was starved. I would definitely come back!"}
{"text":"Had one of the best meals in a beautiful Afghan restaurant. The experience made me feel like I was a royalty. Guaranteed to please all foodie senses out there. They have awesome hot sauce dips and their meats are cooked well. Scarborough deserves this beautifully decorated restaurant for family & friends to enjoy"}
{"text":"Not a big fan of Afghani food but i think there chapli kabob is the best. Rest of the stuff I have tried it once and it's alright."}
{"text":"Wife and I were in the mood for kebabs about 2 weeks back (as of this writing).  It was late into the evening.  Still a lot of customers.  First time for afgan cuisine.  Price is a bit higher than we are used to however..for the portions we saw other customers chowing down on the prices seem justified.  Tho the price on their single kebabs could be a tad lower, 1 stick for over $4 bux seems a bit much.

We ordered take out since we wished to eat at home.  Tho we found out the portioning for take out vs dine-in was very different.  The chicken kebabs for us was very tasty.  We also enjoyed the yogurt dill sauce that was provided.  Their hot sauce had quite the kick for both of us.  It had us reaching for a glass of milk (we're not really into super spicy foods/dips) to quench the flames our taste buds were experiencing.

For future cravings of the kebabs we may opt to dine-in since the portioning is more.  Nothing really special to comment on their salad offering..might opt out on the salad on the next visit.

The only main advantage for us kebab wise, is that it is the closest one to us.  Haven't tried Bamiyan Kebab yet, but I have a friend who has recommended it."}
{"text":"I don't dine here as often due to the HORRIBLE service. The skinny tall dark skin lady...total B*tch. I ordered 3 dinners to go and she only prepared 2, she was busy on her phone while I was ordering. When I pointed that out she had the nerves to tell me to speak clearly when I order. I took the initiative to tell her off in her own language! So she left, I guess to embarrassed to talk to me and the cook came and took my order and wouldn't stop apologizing and offering me a discount. I told him my argument isn't about the discount but she should be more professional and get off her damn phone. 

I like the food, chicken is marinated differently than the other Afghan restaurants. 

Do not dine here during Ramazan. Fights over tables. Lots and lots of loud annoying children. I find more brown -Indian and Pakistani people dine here. I guess because Afgahns don't fast lol but omg it's like a zoo. No joke. My mom and sisters wanted a nice peaceful dinner  everything but peaceful. We weren't even done eating and we got approached by 2 ladies for our table. When we got up this other chick sat and the original lady and her were arguing over the table. 

Take out and get the hell out is my thing next time. 

Double check your order for take out...they enjoy screwing up orders. 

If your Afghan you won't like their bolani, they put all spice mix in the bolani, that spice is for rice and meat dishes. 
It tastes bitter. 

Someone told me Pakastani people bought it and the food taste different now. I wouldn't be surprised."}
{"text":"Food quality is good. Nice juicy kebabs and flavorful rice!
But bit pricey considering it isn't a full service restaurant. It is a self service place, with options for take-away or dine-in. Meal for two costs anywhere above $32. I don't like the fact that not even water is served. 
Service quality is extremely slow. An order takes around 20 to 30 minutes to be served. (when the restaurant is almost empty and it wasn't in the rush hours)"}
{"text":"I get the chicken kababs and the veggie soy kebab - which in itself is an amazing idea for vegetarians. The food is fresh, flavourful and spicy. The chicken is good quality white meat. The sauce that comes with your order is delicious and spicy. It's too good. 

This pricing is a little expensive, but the food IS good. But it could use a dollar less on all the main dishes.

I haven't eaten dine in here, but went to get take out. The restaurant looks new, with nice waterfall pillars and lighting and etc. totally a step up from the old restaurants here. 

I just don't like the wait for the take out. Perhaps I should call in next time to place an order so I can come, collect and pay."}
{"text":"I picked up takeout here for a group at work. Only 1 person had been here before, so he did the ordering and the rest of us had no idea what we were getting ourselves into.

We got Chicken Kabab, Beef Chapli Kabab, Sardari Kabab and Kabul Kabab. I'd only had Afghani food once before and it was not in kabab form, so I didn't know what to expect. The chicken had a yellow colouring, making it look like curry, but it wasn't. It was tender, juicy with great seasoning. This was a crowd favourite.

The beef chapli was INTENSE. It's a beef patty at first glance, get closer and you can see it's jam packed with spices. I had to drink some water and eat some rice to cleanse the palette before diving in again. Be ready! Only a couple people could handle it....I was not one of them. :(

The other kababs looked the same, but were not. They both came with sliced chicken under the kabab. Sardari kabab was spiced lamb. I love lamb! Kabul kabab was made with beef. The seasoning was similar, just need to choose which meat you prefer.

The portions were huge! All came with on giant bed of plain basmati rice plus salad. we ordered 5 meals for 6 people and 2 people had the leftovers for lunch the next day. The rice was plain, was hoping it would've had a little something to it. 

They've got a decent sized menu and it's all halal. If you're not sure about something, just ask. They know their stuff! It's a beautiful place, I wouldn't mind going there for a meal now that I know what to order!"}
{"text":"The rice was cold and the kabobs were burned,, never coming here again ... for best Afghan food and best customer service go to naan and kabob restaurant..."}
{"text":"Went here yesterday and ordered a barg kabab and chicken breast and a bolani. The bolani was undercooked and had absolutely no filling in it like none whatsoever.  Was told that \"This is how we make it.\" It was literally the worst bolani I've seen.  The barg kabab was also not cooked all the way through that we only found out when we got home and ate some.  There was another lady behind us who complained about the portion sizes and the salad. The salad we got was less then half the box and consisted of 1 cucumber slice and the end of a tomato that you would normally throw out. Was given another box of equal quantity of salad after complaining about it.  Their orange sauce was doused in hot sauce and completely undigestsble unless you're into super spicy throat burning sauce. The lady returned the food and got her money back and I'm thinking I should've done the same. Definitely won't be going back. The cooks have definitely changed because it used to be good. I might have given it another chance if it wasn't for that other lady and her recent experience."}
{"text":"The food is good, not great but good. They have 3 veggie options but the veggie mantoo and that potato folles bread is never available.

The service is hordenous. I had a take out order and the chef in the back literally had to tell the server 3 times to just hand me my meal so I could go. Even he was annoyed!

I would never go out of my way to go here."}
{"text":"I visited Kandahar Kabab about 2 months ago and I was extremely impressed with their food. The place has been on my list for about 2 years now but for some reason I've was always been a little reluctant to go when push came to shove. Likely because this is the second Afgan restaurant I have been to and my first experience was not the best. Kandahar Kabab is quite large but can become very crowded during peak hours (recommend making a reservation if you go with larger crowds). You order food at the front and they call you once it is ready, after which you can take a seat. The food does not typically take too long to cook and the portions are very generous. They also provide you free naan while you wait. I ordered the lamb chops and chicken kebabs which also came with salad and rice. The food was very delicious and I would likely take my family the next time I go. The price is decent for the amount of food that you get but I would suggest that you go with an empty stomach as it will fill you up very fast. Also, don't get too full with the Naan."}
{"text":"My family & I often visit this restaurant. It's usually very busy in the evenings & around 'desi' dinner time. 
Although the restaurant is big, seating can be a nightmare! The few times I've visited in the day, we found seating easily. However, at night you may have to wait for a long time standing around, eyeing diners who are almost finished to 'conquer' their table after. Finding a table along with other families also 'hunting' is like a flock of birds scavenging - 1st to fly over & sit has won. Sometimes families that are almost done are nice enough to let you know ahead of time. There is no reservation system from what I've experienced, no hostess to seat you either. You walk in, order, find a table or vice versa if you're dining in. I wish they would have a reservation system or hostess at least, it'd make it less chaotic. This chaos really brings out how polite fellow diners can be or show their lack of manners i.e. glaring looks, body shuffles to move you out of path to a table, dirty tables. I don't advise going their for dinner during special Islamic holidays or Ramadan, it's war people! It can be very noisy, with large families, young children & sometimes crying babies. I've seen young kids running around, tripping & bumping their heads, crying when it's busy - the parents do nothing & the staff do not say anything. Parking can be a similar nightmare.

The cleanliness of customers versus the staff are different. The decor is nice compared to other Halal restaurants. The entrance & cash area have a nice glass water fall thing & some chandeliers. The benches & chairs are a leather look with marble like tables. The place is spacious - with the few staff that are at the front (usually 4-5), they do their best to clean the tables after customers have left their dirty trays or demolished an area with rice scattered everywhere & on the seats. When it's busy, tables don't get cleaned right away, so you might have to find a staff to clean it, once you've asked a member of your party to hold the table. Some customers, including myself, do take our empty plate & trays to the drop-off station.
The staff can be friendly sometimes & sometimes like zombies. There is Afghani music playing in the background. There is a separate Wudu/Prayer area.

To order food, line up at the cash & order off the menu. We usually order the chicken kofta kabobs with rice or the chapli kabobs. I preferred how they cut their salad when they first opened in Scarborough, I don't like the new style, it's cut very small & hard to fork. The salad is an average salad consisting of lettuce, tomatoes, cucumbers & onions. The meat is very flavourful & tender. Sometimes, on busy days, they run out of a specific meat by the end of the evening - so they'll say no chicken, etc. Their rice is long grain & non-sticky. Their sauces are a big hit, I love the hot sauce especially. They serve Afghani bread with a white sauce to start. I usually skip the bread as it fills you up already & I can't finish my main meal. Prices are usually in the $11 mark per main dish. I like their mango drinks & yogurt drinks. Once you pay, your receipt has the order number & they call your number once your food is ready. The portions are great, fills you up well."}
{"text":"This place is a hit and miss. Sometimes they have really good food . Sometimes not so good . Same goes for the service. Unfortunately. I come here for their chops"}
{"text":"I'm writing this review after 3 visits to Kandahar Kabob.  Last night was the final straw.  We arrived at restaurant around 9pm.  The place was packed.  We placed our order and had a seat.  After 30 minutes we went to the counter to see where our food was since we'd been waiting for a long time.  The indeifferent girl at the front counter said it would be a few more minutes.  10 minutes later we went to the front to pick up the food.  Here are the complaints (in no particular order

1. my boyfriend ordered beef kabaobs.  When he received the meal it was chicken.  the girl at the front actually asked \"is that okay\"  His response was I guess it will have to be since I don't weant to wait another 30 minutes.  To this she responded, i'm not sure why he made chicken.

2. No rice with the dinner--apparently the cook forgot.

3. The lettuce in the salad was half brown

4. I went up to the front counter to ask for more sauce with the dinner to which the girl responded \"yeah yeah 1 second\"

This restaurant has a lot of potential but needs major organization.  The staff need some customer service training as well as proper uniforms.  A carefree attitude will only turn away more and more customers.

Forfot to mention, there was a gentleman who only received half his family's meal.  he went up after half the family finished eating to ask for his food.  The girl at the front counter actually began arguing with him.  I think an apology would have been more appropriate.  

All I can saw is NEVER AGAIN"}
{"text":"Very nice interior. Lots of seating. Went on a Sunday evening yand was really busy yet only had one cash open which was weird. Got the herati Kebob with one chicken Kebob and one beef kofta Kebob. Took about 30 minutes to be ready. 

As a regular bamiyan customer I will compare the two. Bamiyan wins hands down. The chicken was over cooked and te rice was too dry. Even the bread wasn't as fresh. Overall good experience but with bamiyan only a 10 min drive north I'd rather drive over for far superior food."}
{"text":"Nice place. One of those pay first and wait in line  for your number to be called to pickup your order and take it to the table.

Nice and clean inside and out. Good potions I actually could not fully finish my meal though it was decent food. Would require a second trip to this place to fully review the dish."}
{"text":"Exec Summary: A newer version of Bamiyan Kabab across the street. A bit more expensive, and all meals come with rice so I wouldn't recommend for lunch.  The do have additional sauces though, that Bamiyan does not have.  Food is comparable.

What I had: chicken breast dinner

Cost: About $10-12 + tax

I'm a fan of Bamiyan (across the street) which has always been good, at both locations I've tried.  But with a new player in town, I decided to give Kandahar a try, and lo and behold, it was very, very similar to Bamiyan. I guess there's not much you can do to change up this type of cuisine. This review will largely focus on the differences between the two.

The main difference is that Kandahar doesn't seem to give you an option to get a meal without the rice so you end up with a ton of food, more than I like to eat for lunch anyway. 

It's also a bit more expensive than Bamiyan for similar meals.

They do have lamb chops, which Bamiyan doesn't have, but I've yet to try it.

The naan here is better than Bamiyan in my opinion (Bamiyan's cardboard-y naan is my one complaint). 

They also have two kinds of sauces/dips that Bamiyan doesn't have, and they're both quite good. 

Wait times were longer, but not significantly longer than Bamiyan. 

I'm not sure what the big fuss is on the previous reviews. I didn't see any issues with cleanliness, but maybe I wasn't paying enough attention. All in all, I'll try it again for the lamp chop dinner, but definitely not for lunch as it's just way too much food!"}
{"text":"Horrible experience. Extremely slow service. Food is OK but make sure you don't bring kids cuz they are charging you $7 dollars for lame ice cream that is coming from cheap icecream buckets. You can probably get 20L bucket for 20 dollars at Costco. Just one tiny scoop for 7 bucks.... as if they are Some high end ice cream place. Whatta rip off it was. Workers were busy on their cell phones. So much apathy towards customers. We never went back and it has been 3 years now."}
{"text":"please do not waste ur time and money if u are a foodie. non athuntic afghani food. use of dil an almost sin for this type of cusine . icing on the cake they served it with saracha sauce.

very bad food exprience."}
{"text":"This place used to be a 5/5 but due to service I've had to reduce it to a 2 which is a shame because the food is still excellent. The meat is always well seasoned, salad is fresh, naan is the perfect balance of crispy and soft and the dipping sauces are my all time favourite. The 2/5 rating comes from the dirty state I've seen the restaurant in on multiple occasions and poor service. The restaurant is run by family members and there is a clear lack of professionalism and training. The cashiers handle cash and food at the same time, they often screw up orders and have no sense of what it takes to run a restaurant properly. Really hope they make the much needed improvements to keep the restaurant clean and hire qualified staff."}
{"text":"Hands down the best kabob place I've had in Scarborough. The line up might get long in peak hours buts it's so worth the wait. Although their beefs kabobs are great I love the chapati kabob. Can never go wrong with the chapati kabob, order it on your next visit!"}
{"text":"Kandahar Kabab is my favourite spot for afghan cuisine in Toronto. They offer quite a variety of kababs  but my favourite is the Sardari Kabab which comes with a chicken breast and kofta kabab. Almost all of the dishes are served on a bed of rice and salad along with two kinds of sauces ( one of which is a lot spicier than the other).

The kababs are always juicy and tender and the portions are huge, the naan bread that comes on the side is a bonus as well. I always leave this place with a serious case of itis haha just because of how full I am after. I have been to this place numerous times and have never left disappointed I would highly recommend this to anyone I know."}
{"text":"This place was horrible, and the food was dry. I ordered the chicken kebab but only got one skewer of the kebab. Not only that, but it was sooo hot inside, and the AC was not turned on. Overall, I had a terrible experience and would not recommend this place. Food quality is NOT good."}
{"text":"I went to Kandahar before there were any reviews for it on Yelp. It looked nice from the outside and, while passing by, I saw a crowd of people outside the restaurant and thought it might be worth a shot. Here's my two cents on the place: 

The Appearance:

Good - Nice from the outside, nice inside, similar to other Afghan places in the area. 


The Service is:  

SLOW -  My order took forever. While waiting, I asked the girl at the counter/register what the sauce was that she was putting in the bags of other customers and she replied that it is hot sauce. I then asked her if it is tomato-based or if there is tomato in it (because I like the tomato sauce at other Afghan places). She replied that she did not know. I asked her to ask one of the other people there and she replied that no one there knows what is in the sauce. Wonder who makes the sauce...

CONFUSED - Anyway, so after waiting all that time, out came my food on a tray, when I clearly stated that it was a take-out. The girl did not like that and she gave it to one of the ladies inside that was putting things together to put my food in the box.

UNSANITARY - When food was ready, same girl opened the box and LIFTED THE KABABS WITH HER BARE HANDS to put a sauce container in the box. When confronted she first denied that she had touched the food. She then proceeded to argue that the people inside also touched my food, to which I had to point out that the people inside are wearing GLOVES. She then had to admit that she had indeed touched my food and asked me what she could do now and apologized. Not wanting to wait any longer for my food I left, hoping that the food will somehow validate my decision to try this place. It didn't.

The Food

I ordered the boldac kabab, which is a combo of lamb chops and kofta kabab. I also got a side of the kabouli rice. The lamb chops were stringy and chewy fat that I had a difficult time biting off with my teeth, let alone cut with my utensils. As far as lamb chops go, those were some of the most poorly cut and poorly cooked pieces of meat I have had in my lifetime. The kofta was slightly better but really the lamb chops were meant to be the star of that dish. The kabouli rice was pretty disappointing as well. 


The Verdict

Kandahar fails on several fronts. Its biggest failure perhaps is that it fails to give a reason to return."}
{"text":"Been there twice now, once for a sit in lunch and once takeout for four. All vegetarians, BTW. The veg chaplee Kabab was too greasy. The minced Kabab platter was good. The fries were a bit soggy. The rice was good as well. The two sauces they give you are good, specially the spicy. A tad bit pricey. Also tried the veg stuffed mantoo or stuffed ravioli. They were good, but they drizzle a lot of oil, will ask them to cut it next time. Free Wi-Fi"}
{"text":"This is the best Afghani restaurant.  The chicken kebab and the kofta are amazing.  The rice and the garlic white sauce and red hot sauce they give you is so delicious.  Everything you ordered from this place is fantastic.  You won't be disappointed at this restaurant.  The location isn't the best but the food makes up for it."}
{"text":"4 stars no doubt! 1 star deduction because this place needs to be better maintained.

This place is busy so be ready for the wait, wait to make the order, wait for the table, wait for the food....You basically have to go and find your own seats because there is no one to seat you. You order and wait for your number to be called but be ready to struggle through the crowd of men to reach your food. Crowds also makes it very confusing to understand whether they are waiting for their food or standing in line to order.

The place needs more attendants to clean the table during the busy hours. It's too much for one guy.

This is often compared to Bamiyan Kabob and personally I like them both but I personally feel like the meat at Kandahar Kabab is more tender plus they take cards whereas Bamyan primarily takes cash. Also like Bamyan, this place needs better management. I feel like all the people are just standing in crowds in front of the counter to get their food (whenever that is prepared)."}
{"text":"around 10 pm for a quick bite. first we had to wait about 5 minutes for a cashier to come take our order. then when we ordered we waited 23 minutes for the food. when the food arrived, the rice was not fully cooked and all food was very dry. it was very hard for us to swallow the food down throat. my friend ordered the chicken cubes skewer and it was OKAY.

i would not recommend this to anyone

sorry Kandahar, but you have a lot of work to do.  Learn from Bamyan next door...."}
{"text":"I'm being generous with 2 stars, Kandahar Kabab put all their thought into the interior of the restaurant and not the food, kabob skewers are too small for a $12-$14 plate of food. Meat doesn't have flavour here, bland! 

There are far better Afghan places in the neighbourhood with higher quality."}
{"text":"First time going to a place specifically for kabob. Meeting up with a couple old friends who I hadn't seen much for a while - lots of catching up. 
Guess I need to go to more of these kabob places cuz the format threw me off....you gotta go to the front, place your order and then when it's ready, you bring the tray of food to your table, which you can take if available. Pretty simple but different.
The kabob dinner is a very good amount of food for reasonable price - similar to a souvlaki dinner at a greek place. 
Skewer of kabob + lots of rice + salad + naan. 
Rice is flavorful, well-cooked. Naan is not hot and too chewy. 
I got the chicken kabob (generic name, but thats what it is :P)...which is nicely cooked and flavorful, however the flavor profile is hard to completely figure out. 
Friend got the chicken seekh kabob, which tastes a little better. 
The one thing that I like most about this food is that it is on the healthier side. Nothing fried or soaked in oil."}
{"text":"The food here was really really delicious although I wish there was a little bit more clarity on the menu on exactly how the items were cooked because many of them said that it was ground beef or ground chicken or it just said chicken and beef but it didn't go into detail about if it was ground or if it was pieces and how it was grilled. The food was delicious they were very large portions and I liked the fact that I could add fries instead of salad for just a dollar more. The cost was fairly reasonable but it did take quite some time to order and we waited a bit to get our food. I would definitely come back here again and again The food here was really really delicious although I wish there was a little bit more clarity on the menu on exactly how the items were cooked because many of them said that it was the ground beef or ground chicken or it just said chicken and beef but it didn't go into detail about if it was ground or if it was pieces and how it was grilled. The food was delicious they were very large portions and I liked the fact that I could add fries instead of salad for just a dollar more. The cost was fairly reasonable but it did take quite some time to order and we waited a bit to get our food. I would definitely come back here again and again"}
{"text":"Went there 3 years back,  excellent bbq Afghan food.  Loved the white sauce.  They have renovation going on so check before you go."}
{"text":"This is a very good halal Afg restaurant, with a nice atmosphere and layout inside that includes many tables that can also accommodate a party of 30. Saw it with my own eyes. 

Their food is cooked to order. Everything is fresh. Freshly cooked kabob, chicken & bread/pita with salad and rice is what I get every time. Their hot sauce & white sauce is very good too. 

Would've gave this a 5 star if the older lady at the cash was nice & helpful."}
{"text":"First off the decorations and photos of Afghanistan are absolutely amazing. The restaurant it's self is very small and cramped up. But despite my criticism the food is amazing and plated  beautifully. My favorite is the Lamp and there dipping sauces and don't get me started on how good the fresh bread is."}
{"text":"This place is disorganized.  I came with family.  Half the items on the menu are not available.  They seem to have run out of the Chapli Kabab.  No Boulanie.  No kabli plow.  Etc.  Etc.  I would not recommend this place and will not be coming back.  Slim pickings on the menu.  No accommodations.  No apologies.  And when we did order we waited 30 mins for the food.  And then there was a big disgusting hair in my plate.  Do not eat here.  Go to another Afghan restaurant."}
{"text":"I ordered the sultani dish with Palau Rice and it came under cook and the rice was hard which they corrected.   My buddy whose Afghan got veggie chapli and there was absolutely no seasoning or flavour just a mashed veggie patty.   The meat kabobs came burnt and super thin."}
{"text":"Eric C was right this place is indeed superior to Bamiyan.

Nice Afghan kebab spot at Markham and Finch.

Most definitely worth a try if in the area or craving kebab in the East end.

Tried the bar kebab and the meat itself and the spiced sauce tasted great together.

Try this place out you won't be disappointed."}
{"text":"I am completely disappointed. First and last visit. I had high expectations considering I've heard the food was good, and was pretty excited about it. 
Like other reviewers mentioned, customer service is lacking. They are impolite, rude, and have yelled at my friend and I just because I received the wrong order. 

I was patient with my order, and as I was waiting, the lady had yelled at her cooks to do their job properly. I felt bad for the cooks because they were doing their job however the lady over the counter was flat out mean to her workers, and was demanding them to work faster. 

The restaurant itself was dirty. They didn't have any one cleaning the floors or tables as there were food on the ground from the previous customer. 

I will never support this business, and I will spend my time at another restaurant. This has left a distaste impression, and as mentioned I will definitely will not come back."}
{"text":"Food was great.  Portions were good.

Just came before 530 pm so wasn't that busy no lineup but lineup started after 6 pm.

Filet mignon was delicious and worth a second trip."}
{"text":"Best Chapli kabab in town. Serving size is huge, can be shared by 2 ppl. Chicken breast kabab is another great dish. Gets busy during lunch hour but still great service and super food at good price"}
{"text":"When they first opened they were great, but unfortunately it's gone downhill.   We've ordered food a couple of times and each time it's been worse.

This was the last straw for me when I ordered dinner yesterday for a Ramadan and found out at home that they stashed stale bread in my takeaway instead of fresh bread.  It was very embarrassing for me in front of my guests whom I  purchased the meal for.  

Another couple of things I wondered about is why they switched from black seeds to black sesame seeds on the bread (tastes totally different! Stick to the authentic, I'm tired of seeing all these new afghan places try to change things around and \"modernize\".  The last time I walked into a new afghan place they said they had poppy seeds on the bread and of all things no kabuli rice because they were afraid people would find it \"strange\")

I'm utterly disappointed with Kandahar kabab, even their kabuli rice wasn't up to par, the carrots were soggy and it just wasn't anything like when they first opened up.  


Such a shame."}
{"text":"The customer service is poor but the food is pretty good.we order kafta  and beef tika its yummy and the red orangeish dipping sauce its hot and delicious.bread is best."}
{"text":"I'm one of those people who prefer Quality over Quantity. Than being said I can only give Kadahar Kabab 3 stars. 

It's not that there's anything wrong with the food....I tried both the Barg and Chicken Breast Kabobs. Both are served on mountains of rice accompanied by (I think whole wheat) naan. To their credit, the chicken breast kabob was nicely seasoned, moist, and plentiful. The barg was decent but still feel that their neighbours across the street *cough* Bamiyan *cough* serve up better fare. I can't say the food was bad, but it lacked that certain yumminess factor that would keep me coming back for more. 

The reason I can't give it more stars is because of the enormous wait times for your meal! Both times I went I waited 20+ mins to get my food, and on top of that the restaurant wasn't even very busy! NOT COOL.

BTW - why is everyone tripping over the red sauce? It's just sambal oelek mixed with mayo!!!!!!!"}
{"text":"Best afghan food in the city by far, better than Bamiyan. 

Food:
If you're coming here for the first time try the \"Sardari Kabob\", It's a chicken breast and kofta kabob combination, you can have the best off both worlds on one plate and its marinated to perfection! Get extra garlic and hot sauce because that's one of the reasons I come here!

Avoid the KK fish though, looks delicious but its super dry!

Atmosphere:
Very cute! However it is cafeteria like style, you order your food at the front... when the food's ready they call you to pick it up. There are no servers!

Service:
Can be improved, cashiers aren't really that friendly."}
{"text":"I'm not afraid to say it but I prefer the food here compared to bamiyan kabob. The portion sizes are larger and the meats are juicier, and more tender. They are literally grilled to perfection! And their yogurt and hot sauces are to die for. You won't be disappointed with the food here that's for sure. Service might be another issue.

We ordered the chicken breast kabab ($8) and the signature Kandahar kabab ($15) which came with one stick of lamb and one stick of filet mignon. They were all delicious. I would definitely come back here to try the others! Everything on the plate was delicious, the rice was fragrant and flavourful and even the fresh salad provided nice contrast with all the components of the plate (smother more yogurt sauce over it!). The naan was nothing special though. The food is somewhat on the pricey side (the full meals), but is definitely worth it. 

It took 20 mins for our food to be called which was a tad too long for a place like this and many tables weren't cleaned up with trays and food. While you are expected to put your finished trays in the carts, I expect that the tables be cleaned so patrons can sit. Plus it's just unappetizing seeing plates full of bones, rice and half eaten naan. Luckily there were many tables and seats when we went late in the afternoon. I may be nitpicking here but the lady at the cash just didn't seem very friendly. But overall, I had a good enough experience with the food and the service didn't detract too much from the overall experience."}
{"text":"Went to this restaurant last week. 
We ordererd..
1) yogurt salad (it was average)
2) green salad (average)
3) barj kabob (Delicious) 
4) lamb chops ( thats where the two stars came from)

Very disappointing. First of we ordered two olates of lamb chops one medium rare and one medium. 
Now the concept is you order at the cash and then they will call you and you pick up the food and seat yourself. So the cashier called us and i went up there to get my two orders of lamb chops. And she said \" oh the cook forgot to cook the one medium rare and just cooked both medium\" like seriously instead of redoing my order and get the temperature i asked for they just gave me the wrong temperature so it doesnt come out of their pocket. Second the lamb chops were not even cooked medium they were medium well and too hard to chew and its just tasted awful and dry. 

Will not be back except for the barg kabab that they have."}
{"text":"The food is very good, I prefer the overall flavour over Bamiyan Kabab. They don't wait on you, you just wait for your order number to be called and go find a seat. Their white sauce that comes with the salad is yummy, I always get extra. Also I would not recommend the mango drinks, it just tastes like watered down mango syrup from a can."}
{"text":"Very delicious food with good portions. Their chicken and beef kabobs are worth going back for. There are no waiters though which is a bit odd. Still very good food at a fair price."}
{"text":"Worst place to order a takeout, they will just hang up in the process. If they don't care I'll take my business elsewhere..."}
{"text":"Ah, sucks that this gem has such a low rating!

Kandahar was my \"go to\" lunch spot from work as I used to work in the area. Now, if I am ever in town - this is one of the first stops. 
We usually get the Sardari kabab place and opt for 2 portions of just the chicken kabob. The chicken is super tender and soft - No idea how they get it so perfect every time. The rice is cooked perfectly and their sauces are off the hook. The naan can be a hit or miss - there has been times that we have gone and got cold naan which sucked. 

They also have a dish called \"bolani\" which is a flat bread stuffed with potato. They serve it with yogurt and it is super yummy and reminds me of my mom's homemade paranthas. 

I've also had a chance to try their \"dough\" drink which is an Afghani yogurt drink and it was delicious. For all the Poonjabs, it is basically our indian Lassi. 


Taking off a point because service can also be hit or miss. It's a family run business so if they are busy - they really don't know how to get their shit together and deliver. Its havoc and you can tell on the ladies face who seems to be the owner. But if you go on an empty day, then food is prepared nicely and its top notch quality!

If they can work on better serving the lunch crowd - this place would be a total 5!"}
{"text":"Authentic Afghan food. Portion sizes are very big so order wisely. One platter can serve 2-3 normal people."}
{"text":"Wow! This place is amazing! With options in this neighbourhood such as Tim's and Wendy's, Kandahar Kebab HAS to be your choice! It's healthy and natural and delicious. Portions are definitely substantial. Great place to know about."}
{"text":"Me and my family had first gone to another restaurant but we went a little too close to closing time. The staff there was extremely rude and gave us a lot of attitude. Much to our benefit, we ended up coming to this place instead. The restaurant was very busy and as soon as we went to order, the man at the counter informed us that they had run out of bread but in return, they would give us free drinks with each of our meals. I ordered a pistachio milkshake thinking that would also be free but actually the soft drinks were free. However, they still gave us a $3.00 discount on the milkshake! Which was very tasty by the way. The food was very flavourful and delicious. I especially loved the yogurt sauce that came with our plates. The decor in the restaurant was also beautiful. Furthermore, after such a bad experience being yelled at at another restaurant for going in too close to closing time, it was refreshing to see all the (young) staff here were so friendly and polite. It's definitely a place I recommend and a place that I would go again. Wonderful customer service."}
{"text":"I ordered the chicken breast dinner with kabuli rice. Food was good overall . The chickn was tender and very flavorful. The sauces they provided to go with the meal was also wonderful. The service at this place could use a little work but overall since the meal was very good, i have to give this place 4 stars.  The place could use a better speaker system. I almost burst my ear drums when the mic went of in the washroom!"}
{"text":"went to this restaurant with another family. restaurant was full all the tables were taken. tables are kind of long however you see only 2 people on the table so other 8 chairs are just wasted.
we finally found the place to sit and proceeded to cashier to place order, we got to the register and waited and waited some more, then we were told that cashier would be with us shortly and then we waited again. finally this young girl maybe 16/17 year old showed us and was just full of attitude. will just not listen to us and we had to repeat our order several time, while we were placing our order this angry gentlemen started yelling that he had been waiting for an hour. what, is he serious? yes he showed us the receipt and yes he had been waiting for over an hour. now i got worried but lucky for us our food came showed up after 35 minute wait, food was good  both quantity quality wise good."}
{"text":"Just discovered this place and me & my family all loved it ... the food tasted fresh & done very well. The only meal we didn't think was great was the veggie kabob so steer away from that and everything else tastes great! Highly recommend lamb & the chicken breast"}
{"text":"My go to Afghan place!! If you have any doubts about going, trust me you should go! It beats bamiyan by far in my opinion.

My favourite is the herati kebab with extra white sauce (make sure you ask for it, cause they're pretty stingy) The skewers are cooked to perfection and the sauces make the entire meal. The portions are also outrageous and can be shared between two people, unless you're like me and can devour the whole thing.

The only problem that I can think of is the service as it can take a while to get your food ready. There's been multiple times where I've called ahead to order and by the time I get there (around 20 minutes) it's still not done. But it's not that much of a problem as the food will be all worth the wait :)"}
{"text":"When I'm craving Afghani food, this is my place to go. I find the portions and price the same as the more popular Bamiyan Kabob, but the flavours and taste at Kandahar are far superior.

I always order the Kandahar Kofta Kabob platter that comes with filet mignon and ground beef skewered and grilled. The platter comes with salad, rice and naan.

This platter is more food than an average person can eat and I always bring home leftovers. There is so much fragrant rice on the platter that is spills over onto the tray. The salad is a bit plain but tastes great with the tangy white sauce. The hot sauce that they serve isn't too hot but tastes very good. The naan is crispy and tasty and doesn't taste like a brick like the ones at Bamiyan. The best part are the meats which always come out juicy, so flavourful and extremely tender."}
{"text":"I loved their food! I went there for the first time a few weeks back and I've loved it so much I've been back a couple times now. The place is ideal if you want to go out for a casual dinner with friends. I really enjoyed their rice and naan. All of their kababs were yummy. 
I think if the place had servers to serve you at the table, if would be more popular but other than that I enjoyed my experience there. The food was also reasonable priced!"}
{"text":"Food was excellent here! Would definitely return.
We just happened to catch them on a bad day when the electronic system was not running very well...difficulty with payments and ordering leading to a 35 minute wait. But it was totally worth the wait with succulent meat that was well cooked.
I highly recommend the Chapli kebab. Great for something with a little bit of spice."}
{"text":"Very good Afghani kabob! My first time there today. The chapli kabob was great and excellent value for $10 which included a large naan, salad, two large chapli kabobs, raita, hot sauce and rice. There was so much I only finished half and saved the other kabob and the rest for tomorrow. The kabob was grilled to perfection, the rice moist."}
{"text":"Food was mediocre as I had better Afghan food else where, service is HORRIBLE!! Don't recommend this place at all!!!"}
{"text":"I bought Chicken Chaplee Kabab lunch. I got two huge Kababs with Rice, Salad and Naan. The Kababs were quite tasty. The amount of meat used is quite generous. The portions are big and good value for money. I was only able to eat half and save the rest. I ordered take out during the day and it took about 15 minutes. They have a spacious and clean restaurant.

June 29, 2018

This time they were out of both of Chaplee Kababs and Lamb Chops. I ordered a meal of Chicken Kababs and asked if I could substitute the salad for something else. I confirmed that it would be at the same price. The lady gave me fries and later I noticed they had charged me extra. The fries were cold and stale. I left most of them untouched.

It was 7pm and the restaurant was busy. It was also disorganized. The servers do not serve tables but, as is usual in self serve places, there is no place to get your own water. I went looking for water and a gentleman standing by kitchen doors asked me what I wanted and then directed a server to bring me a  glass of water. I did not have the heart to ask for another glass as the servers looked pretty busy behind the till. The same person was helpful when I needed a carry-home container as they are stacked quite high.

The place where you leave your trays was full. They really need one person clearing that space constantly when it is busy. And someone to bring water to customers. Or perhaps install a fountain where customers can get their own water."}
{"text":"I and family went to their This new location. Wait was aprox 45 min. I guess they were short staffed that day.
I tried their quail kabob and rice. It was spicy but really really tasty. Everything was done to perfection. 
Best place to eat Afghan food. 
Reasonably priced."}
{"text":"Excellent flavour and great value for money. 

We are big and of the Sardari kabob meal ( chicken) and the House special - Kandahar kabob (meat and comes with grilled vegetables)

Ordering takeout can be a challenge as it's busy for them and they never came seem to hear despite yelling into the phone - but the meal is worth it."}
{"text":"Came here with some friends and thoroughly enjoyed it! The portions were huge, the rice was tasty, the meat was juicy. I find that this place is much better value than Bamiyan kabobs. Looking forward to coming again."}
{"text":"Their food is amazing. Definitely beat out Bamiyan Kabob with the Huge portions! Decor is very nice and leather booths very comfortable. Their spicy sauce is amazing, as well as their white sauce. The chicken and Kofta Kebabas are packed with flavour. You definitely want to try it out and we will definitely be coming back. 
Price is average $11.99 for a huge plate of chicken & kofta with rice and salad, also including their fresh bread."}
{"text":"35 minutes and counting for chicken breast and kofta and on top of that, my order was processed as completed and I had to go up and ask about my order. If it was a busy day I can understand. But it's not and this isn't acceptable. And after I asked where my order was they didn't even apologize for their screw up. Excellent service :/"}
{"text":"I've been coming here for a long time. I am just amazed by the size of the portion of food they give you like it is big enough to feed at least 3 people I usually get the Kandahar kabob they also have other delicacies such as Mintoo which is like a dumpling definetly worth the price"}
{"text":"Great Afghani food for lunch/dinner. Very similar to other Afghani places but their hot sauce is different and really nice!"}
{"text":"I love this place! I was visiting Toronto and received a recommendation from family friends to visit Kandahar. We went twice during our visit (because the food was so good!) Portions are generous. I think that the wait time is a bit longer than most places, but the food is so fresh that it is worth it!"}
{"text":"Love this place! The food is fresh and delicious, and portion sizes are HUGE for the price. I love their kebab dinners, especially the special Kandahar kebab that come with grilled onions and tomatoes. Their shawarmas are also fantastic - they make the bread for the wrap fresh to order! Their white (garlic) and red (hot) sauces are amazing as well! Can't recommend this place enough!"}
{"text":"Environment was very fancy. They had very good, we'll portioned  food at a reasonable price. I got the kandahar kofta chicken skewer which was juicy and flavourful along with the spicy and white sauce. I was just disappointed with how hard the naan was.  Seems like they may have reheated it. Other than that, I would give Kandahar Kanab a second chance."}
{"text":"First time trying this place. I have to say meat and rice are good. The salad sucks. It's just lettuce with virtually no tomatoes and like 1 sliver of an onion if that.  Worst thing about this place is the service SUCKS. 

I ordered take out and had to wait 48 mins till I got my food. The ladies at the front are lost and have no idea what is going on. 

Food is good but not worth waiting 48 mins for take out while standing. 

I will not return."}
{"text":"I went back to this place again and it was very busy. The food took more than half an hour. The chicken breast kabob was very dry and overcooked this time and the naan tastes very stale, like it had been reheated. Not sure that I would come here often anymore."}
{"text":"Food is so good it's just sad that the service it so bad. I have eaten here at least 20 times and maybe once got good service. The food is always good thought but I only come here when I am in a good mood or feeling patient because I get easily pissed off by bad service"}
{"text":"Went to check this place out with coworkers. Heard good things about it. It's spacious and decorated nicely. You sit where you want, no one seats you. There were many spaces available (Went on a Tuesday evening around 4pm) basically the place was empty. You have to go up to the counter to order. They didn't have some of their items available from their menu (no mantu, no veggie mince skewers, no lassi, no ice cream.) Service was not the greatest. Food was okay...barg kabab was over cooked but the bread was really good. No one checks up on you at any point."}
{"text":"We visited on a Sunday evening. The place was busy. There was plenty of seating available. I had the vege platter. Nice to see the vegetarian option. But it had full coriander seeds and was under done. Not very pleasing to the palate. The vegan bread was sold out. The regular Afghan bread is a bit dry. The meat plates were tasty. It was a lot of food. Portions are very big. Best to order one full meal and single servings of meat if you go with a group.  Dough is a salt lassi. The mast- plain yogurt was good. I have eaten at fancy Afghan restaurants and was looking for a cilantro/ mint condiment. That was missing in this place.  Also the menu on the wall is very small and tough to read for older folks."}
{"text":"This is my 2nd time here. The first time i didn't notice anything as the crowd and line up was shorter. The food is pretty good but all of them go down the drain as the service is horrendous. First of all there are 3 servers and cashier who is completely clueless what to do. Instead of one person taking orders, and 2 person handing the food out to the customer, they have 3 of them doing the same thing and often time confused themselves. How can you get confuse at the things you are doing repeatedly? Not sure how hard is it for them to get the naan, sauce, drinks and salad dressing. I mean doesn't take a rocket scientist to do that. And the big no-no was when they handled the food with their bare hands and then touched everywhere in the counter and the cash register. I mentioned several times, please don't place your finger in the food, please use a gloves or tongs, they just ignore it and continue putting their finger into everyone's food and then use the same finger to touch the cash register and anywhere around the counter. They have great potential but run by kids who have no idea what they are doing. Basic food cleanliness and hygiene people! Come on!

Oh ya, when the counter ran out of space to put the take out food, they decided to put the food on the floor!. ON THE FLOOR!! then when customer came back to pick up the food, they just pick it up on the floor yet the customer who saw it say absolutely nothing about it. Are you kidding me? Is it me? Well, there you have it, this place nasty but food taste good. Sorry that to me is like eating from the toilet bowl. YUCK!"}
{"text":"I too am writing this review while in the restaurant. 

When my boyfriend and I entered the restaurant the woman behind the counter was talking on her cell, and only put it down briefly while I placed my order, which was placed for take out.

I grabbed their take out menu so that my boyfriend could call someone to ask them if they wanted to place an order. When he approached the counter she was hiding in the corner on her cell phone again, and told him \"Sir, it will be another ten minutes.\" He had to say he wanted to place another order.

Finally when our order was ready, they were plated. We told her that this was for take out. She told us we didn't say so and tried to hand us the food anyways.

Just terrible customer service. Not surprised that there is no tip jar."}
{"text":"Having driven by this place on numerous occasions for the past 5-6 years, finally decided to stop and try the food. I have tasted Afghan food at other places and I have always liked the kebab and rice, so I knew this would be good, I wasn't wrong!

We arrived around 715pm which was perfect because we missed the crowd that followed us. It is Ramadan and fasts were being broken.

Decor (3/5)

The place is nice. It tries to be fancy with the chandeliers but it doesn't work. Some great pictures and images on the wall depicting Afghan life and culture. We sat in a booth, and my seat was slightly tilted foward which is very annoying.

Service (4/5)

Here you place your order first, sit down, and they will call your number. The staff were friendly and accommodating.

Food (4/5)

Just as expected the food was delicious. They give you so much that you will have to pack a parcel for home. We ordered the sultani kebab and the Kandahar Kebab. Both were good, the little orange spicy sauce was yum.

The place was soon busy and got packed.

Great place to bring the family for some good Afghan food."}
{"text":"It has been a few years since I first reviewed Kandahar Kabab. I went back a few times this week. Things have changed and so has my perfect-star rating. I have it down to 3.5 stars.

The food still tastes good. In the past, the side salad consisted of sliced cucumbers and tomatoes. These days, you get short sticks of them.

On Monday, my boyfriend and I were there for lunch. Our usual place, Royal Jasmine, was closed due to water damage from the ice storm last weekend. We decided to give this place a try. He had never been there.

He got the beef kofta, which consists of two ground beef skewers. He opted for salad only. I went with the chicken kabob (you get one skewer) with rice and salad.

I had asked for no salad dressing on my salad. The woman said that could be arranged. I also got a can of Diet Coke.

They call your order number on the speaker system. Your order number does not get called numerically. It does sound like a random generator the more you listen in.

Our order was ready. We went up to fetch it. I got to my table and noticed that there was dressing all over my salad. The problem is that the dressing has dairy in it and I am borderline lactose-intolerant.

My boyfriend took my food back to the order area and asked for a fresh salad without the dressing. I got a clean plate with everything I had originally wanted.

The food was good. The chicken morsels were seasoned nicely and juicy. The salad was crisp and good. You also get pita bread with your order.

We went back there for lunch on Tuesday. I ordered the chicken tikka. I decided to not get the rice. Once again, I specified not having any salad dressing. Guess what? I got dairy salad dressing on my salad. Ugh!

I asked to get my order corrected. Yep, it happened a second time. It was the same woman at the counter who didn't convey this detail to the guy preparing the food.

We came back to this restaurant after work on Thursday. I got the beef kofta, as did my boyfriend. He ordered first. I then said that I wanted the same thing as he had ordered. The same woman taking the order paused for a good thirty seconds before she asked what I wanted again. I said that I wanted the beef kofta with salad, but without the dressing.

Okay, so it takes the third try to not get dressing on top of my salad. I like progress! The problem? There were a couple. My boyfriend also didn't get dressing on his salad, either. He was okay with it. The other issue was that I never said I wanted rice. I got rice.

The beef kofta is saltier than I recall. If you are on a sodium-reduced diet, the kofta is not for you.

My rating has gone down to due getting my order incorrect three times this week on all three visits. It can pose a serious issue if you have a food allergy or a special dietary need, and you completely ignore it as a staff member at a restaurant.

Yesterday, we both decided to go for lunch at a different establishment. We gave this place enough chances to get our order correct. Perhaps a few more tries, and it may be the case.

(166)"}
{"text":"Let me start off by saying that I don't eat meat. we checked their website and they have a special section for their veggie food. we found out that they don't have veggie options available on their menu. so I didn't order anything since the person who was putting in the order was not accommodating enough to mention any other options. after my friends got their food, they asked for a spoon. the spoon was taken right out of a water/liquid bucket and dried with a hand towel infront of us and given to my friend. so disgusting. poor service and messy place with the harsh kabob odor."}
{"text":"[LOCATION] - 5/5
Located at Finch Ave & Markham Rd. Just look for the a big, orange sign that says \"Kandahar Kabab Afghan Cuisine.\" 

[SERVICE] - 1/5
Disorganized self-serve style service. Customers place orders and pay for food at the cash register. Then, grab your own seat. The cashier will call-out your order number on the PA system when your food is ready. Unfortunately, the system does not work very well on a busy Saturday night. My friends and I had to stand in line, decide what to order, and also stare at people until they finish their meal so we can take their seats! We stood in line for 15 minutes, ordered our food, and waited another 45 minutes for our food. The cashier did not even inform us that the wait-time was going to be that long! 

[DCOR] - 4/5
This place is huge, but unable to accommodate the high volume of customers on a Saturday night. 

[FOOD QUALITY] - 4/5
Quality was pretty good overall. Chicken meat was average, but kofta (ground meat) was pretty high-quality. Salad was fresh, and rice was was infused with aromatic seasonings. 

[ORDER] 
- Sardari Kabab - $13.00: comes with chicken breast and a kofta kabab: chicken breast meat was a little dry, but paired well with the seasoning and sauces on the side. Kofta kabab was seasoned very well, soft, and juicy. Also came with a huge quantity of rice & salad. 

- Herati Kabab - $12.50: comes with a chicken kabab & kofta: chicken meat had the same consistency as the chicken breast meat. They used the same kofta in this platter and the Sardari Kabab. This dish also came with lots of rice and salad. I would just order this platter because it is less expensive than the one above, but the chicken meat is pretty much the same in both of them. 

[OVERALL] - 3/5
Overall, the platters were really good and came in large portions. I would recommend this place if you enjoy delicious Afghan food. However, you risk encountering a long line, limited seating, and a long wait before you receive your order. Good things come to those who wait, right?"}
{"text":"Stumbled upon this place after going for a hike at Rouge Park. This place was on our way home, and the 4 star rating and photos on Yelp helped us make the decision in coming here. 

The only other Afghan restaurant I've tried is Bamiyan Kabob. This place was pretty similar. Upon arrival you're greeted with 2 huge fountains and pretty lighting fixtures. My son loved them. The restaurant is huge and decorated nicely. Lots of spacing. We visited on a Sunday afternoon and it got really busy after we ordered. Lots of families!

The ordering is also similar to Bamiyan, where you place your order at the cashier and then they'll announce when your order is ready over a microphone.

The wait was a bit long, but the food made up for it. Our chicken combo came with salad, rice, and naan with hot sauce and a white yogurt-like sauce. Rice was great, naan was warm, salad came with cucumbers and sliced tomato, and the chicken kabob was delicious. The chicken kofta was also good, but kabob stood out more. 

Will definitely return to try out other items on the menu!"}
{"text":"The only time I come here is with my buddy MUZA he loves this place I don't know why they looks the same food is good but a bit pricy but good will still come here enjoy"}
{"text":"It's really unfortunate when a business suffers due to customer service. This is probably the best kebab place I have been to on terms of food. They just add a little extra something that makes their food taste better and I prefer their condiments so kudos to the chef

BUT the service is lacking. Not only was the wait for the food really long, the servers/cashiers were inattentive and too caught up in their cell phones and conversation to stop and help. I read that they have some sort if complimentary tea. I was excited to try it because I am a lover of tea. When I asked for it she said \"the machine is plugged out,\" at that point I was so disappointed in the service I didn't even bother to ask her to plug it back in.  Side note, the cashiers aren't mean they are just not customer service orientated.

For me to give this place 4 stars I must have really enjoyed my meal."}
{"text":"I always go here for lunch and usually get the chicken shawarma wrap. I honestly am so annoyed of their inconsistency. Sometimes the wrap itself is so hard to chew because it's hard or sometimes it's too soft and undercooked. There's only a few times it's been perfect and my coworker said the exact same thing.

There's a few pics of different times you'll be able to see the difference. They even put in the end of an onion. Today there was no onion or pickles, so confused! 

#annoyed"}
{"text":"Saying that I had a terrible experience here would be the understatement of the year.  I am sad to say that I wasted a \"cheat day\" on one of the worst customer service experiences in recent memory.  

My tale begins when I decided to call in an order at 7:20 PM on Saturday night.  The order was rather easy and painless and I was told my a rather cheery voice \"Your meal will be ready in 20 minutes.\" By the time I got to the restaurant it was 7:45 and I quickly queued up and paid for my order. 

I waited 5 minutes, then 10, and finally the cashier asked me what my order was.  When she spoke to the girl sorting out orders in front of the kitchen I could over hear them say my order had been given to another customer.  When the cashier returned she told me, \"we are about to prepare your food, sorry for the wait.\"  For some odd reason she had not felt it important to communicate the error to me, i guess honesty isn't their best policy.  In any case, I waited another 10 mins, then 15 minutes.  I asked them what the hold up was and they said \"it was coming, be patient\".  

I stood around waiting for a further 10 minutes before I saw some activity where 3 staff members were looking up at the order screen confused as if they were trying to read ancient hieroglyphs.  They finally sorted the orders out and one employee walked over and handed me my food, saying \"sorry, we have added extra kebabs\".  

As I attempted to voice my concerns about their service the staff member who handed me my food walked away from me as I was talking to her!

For anyone following along, the total time spent standing around waiting for my food was?...anyone?...35 minutes, not including the 20 minutes they quoted me when I placed my order, in addition to the 20% of battery loss on my phone while perusing Facebook.

The kicker! When I got home and opened the container there wasn't any extra food comped for the excruciatingly long wait.

In all fairness... the food was OK, but the service I experienced that night was among the worst I have witnessed.  With service like that, I cant imagine how they will be able to survive against the likes of Bamiyan or Afghan Cuisine just down the road.

Absolutely abysmal - 1 Star"}
{"text":"Our warehouse is very close to this place.
We order for 8 people from Kandahar kabab.
They gave us the breads from yesterday we couldn't even eat the breads with our kababs.
The money you pay is a lot and you can not even enjoy your food.
Come on!!"}
{"text":"The food is better than Bamyan and Naan/Kabab ! Portion size is a lot bigger, I never regret going there all the time. Food is great. atmosphere is very noisy and so many people come there. 

Try to avoid weekends if you want to eat in peace!!"}
{"text":"This place is disorganized.  I came with family on a Sunday. Half the items on the menu are not available.  They seem to have run out of the Chapli Kabab.  Boulanie.  No kabli palow.  Etc.  Etc.  I would not recommend this place and will not be coming back.  Slim pickings on the menu.  No accommodations.  No apologies.  Go to another Afghan restaurant."}
{"text":"Worst service on earth! went there at 8:45 and ordered a dinner plate, a skewer of kandahar kabob and a drink. That order ... which was supposed to be ready in 15 mins according to the cashier took an HOUR to come! there was no apology or explanation as to why the order was taking so long. the servers didn't know what the hell they were doing and worst part is the people who ordered after us got their food delivered before us. Supposedly, they give more importance to the \"eat in orders\" and give little to no importance to the people doing take out! our order was 163 and orders 173,171,170,168,169,167 etc were all being served right in front of us. Now onto the food, nothing great, not even decent. kabob was dry, rice was very little and bread was despicable. Please do yourself a favour and go to ANY other afghan restaurant ... there are so many good ones like naan and kabob, bamiyan etc. This is a joke of a restaurant with idiots working in it. Dont even deserve half a star let alone a one star."}
{"text":"Nice ambience, but comparatively  I absolutely love Bamiyaan much better... These guys are also pretty good but I felt their chicken was super oily left a trail of oil on my rice .. And wasn't a fan of their sauce plus chicken was spicier .. Didn't taste like a true afghani restaurant like Bamiyaan does."}
{"text":"Amazing kababs! The portion sizes are fantastic! Not a very big fan of the self service style which takes away from the restaurant experience. But the food makes up for it! Usually very busy during the weekends and evenings. Great for takeout."}
{"text":"Please be aware: I have recently seen their service and quality gone down the hill. I went their today after about two months, was very disappointed by Kandahar kabob. In my past experience I realized that food wasn't too bad but they had horrible customer service."}
{"text":"Came here to get lunch with two of my friends on New Years. The service was just okay. The girl at the cash didn't seem like she knew any background knowledge of the place she works at. The menu tends to change (because it's on a screen), and she was just staring at us.. we had to tell her were waiting for the menu to come back. We asked her what the difference between two dishes are, and she just pointed to the menu.... we were like okay then.

I got the breast chicken kabab and wow the portions are HUGE! We decided to dine in, so when our order number gets called, we have to go pick up our dish. Once I placed the dish infront of me I'm like WOW this is a lot and smells so good! However, after trying it I realized that it was pretty bland and did not have enough flavour. I mean, it wasn't horrible but definitely not the best Afghan food that I have tried. They should put more flavour into their dishes. I feel like the dishes are worth the prices they charge, because it's a huge portion that also comes with a huge piece of naan (I actually loved the naan), two sauces (the white sauce is so good) and salad. They also give free water."}
{"text":"Good food. Good decorated restaurant. Prices are pretty fair. The only thing I dint like was their souce and naan bread"}
{"text":"Top notch.  Everything about this place is beautiful.  Cleanliness, atmosphere, employees and customers of all nationalities.  Oh ya, the food.  Well is just amazingly tasty and cooked to perfection !  I mean, there's nothing fresher than seeing your food (raw meat) get pulled out of the cooler and right onto the open flame.  Makes my mouth salivate just writing this complimentary note.  If you are wanting to try this place but are holding back because you've never had \"afghan\" food before YOU are MISSING OUT people.  Try something different for a change... You will not be disappointed.   First Gen Canadians from Italian decent bringing his family here says a lot.  I'll be back again with friends and more family.  Thank you KK.  Btw-  large portions, two dipping sauces, tasty meat and only have to wait 15- 20 minutes none peak times."}
