{"text":"Sequestered in historic Inglewood, this Cool and Interesting Diner plays host to a great menu and delicious food.  Fun for nostalgia with a 50's diner look and feel."}
{"text":"I have been to Kane's a few times and while I'm not a Harley fan myself it is a fun retro type diner. The food is usually consistently good....not great and because it's a diner even if there are people lined up at the door the tables move fairly quickly so I've never waited more than 5 minutes. Sadly on my last visit there were tons of little bugs flying around. I don't mean like 5 or 6 but hundreds. I assume they were fruit flies but there were so many I just about went bonkers. Given it was the middle of winter I know they weren't just there because of an open door or anything. They were landing in my food and drink and it really killed my appetite for eating. I gave them a 3 because my first two visits would have been a rated 3 or 4 and my last a 1. 

I'm not itching to go back but yah never know."}
{"text":"The place looks great and has an ideal location. It was 8:00 am on a Saturday morning and I feared I wouldn't get a table, but I was the only person there! Needing a quick meal before an appointment I ordered a Breakfast bowl and a coffee. The scrambled eggs an bed of hash-browns were covered in an unpleasant salty holladaise/bechemel sauce that didn't work.
 I asked for the bill half way through the meal and was told I had to go to the front to use my debit card as they didn't have the \"portable kind\", and \" it's slow because dial-up...\" explained the sole waitress (in a diner that could seat 60) on a Saturday morning. This suggests to me that they know from experience one waitress will be adequate!?. On a Saturday? The place aspires to be really good and looks the part, but execution is just not there. This place begs to be taken over by an experienced restaurateur."}
{"text":"This is one of those little-known spots in Calgary. I've been a frequent visitor for about 10 years and love the place. I often take clients here for breakfast as well.

I can't vouch for dinner, but breakfast is always great. Atmosphere is very 50s, with a fair amount of Harley related decor (It is Kane's after all), so if you're looking for a cool, genuine (and likely less expensive) alternative to Diner Deluxe, this may be it."}
{"text":"Love this gem in Inglewood. Why did it take me so long to go there?! I've been a few times now and just totally dig the atmosphere. Diner food that is just fun and delicious. I've only done brunch here and have thoroughly enjoyed it each time. Nice spot to relax, then finish shopping in Inglewood. 

Staff are friendly and attentive!

Great spot to stop in for brunch in Inglewood."}
{"text":"If I could give this place a 0 I would.
We walked in, sat ourselves (As the sign says), waited, waited, waited for a menu. 
The waitress saw us many times, WE MADE EYE CONTACT, but never acknowledged us by saying \"hi\" or \"I'll be right with you\" and instead of coming over to give us menus she walked around the back visibly on her cell phone playing games.
At this point it had been almost 15 minutes so we walked out & will never be back which is too bad because I've wanted to visit for many years."}
{"text":"If you are looking for a little bit of nostalgia while you nosh, then Kane's Harley Diner in historic Inglewood is where you should be dining.  Full of fantastic kitsch and characteristically cheeky staff, Kane's is your number one spot to grab a milkshake and fries.  There is so much great Harley Davidson decor as well.  Even if you aren't a bike (I am definitely not) it is a fun place to hang out and people watch.  All types come in here for a great meal.  Both the breakfast and lunch menus are great -- haven't tried the dinner menu yet but I bet it is filled with delicious diner food.

This is a great place for a date, a fun family lunch out, or just a place to grab a quick bite.  Definitely a landmark of Inglewood.  Grab some lunch here and head over to Recordland afterwards to pick up some records of the songs you heard on the jukebox in Kane's."}
{"text":"Cool atmosphere (1950s-esq with motorcycles) and friendly staff. We just stopped in for milkshakes, which were huge and there were several cool options. We found them a bit sweet for our taste however"}
{"text":"This place is a cute little diner in a great location! Didn't have to wait for a table on a Saturday at 10:30am. The prices were really reasonable but I'd have to say 3/4 of our party of four had something wrong with our meals (i got poached soft when I wanted poached medium, my partner had green onions in his omelet when the menu said nothing about that, and our friend had tomatoes in his omelet when he never wanted tomatoes and it made his omelet soggy). Our other friend and myself also didn't like the pancakes and they were so tough to cut through. The butter or margarine also had a weird flavor--like it was old or something (it's hard to describe). I did really enjoy the hashbrowns and we had a responsive server who kept the coffee refills coming!!

Everyone said that they would not come here again, but I'd personally give it another chance but I think I'd skip the pancakes next time and stick with eggs, toast, bacon, and hashbrowns. 

Another thing that irked me was that the waitress seemed so annoyed at us for wanting to pay our ourselves separately, despite the fact that we left them a 20% tip which I thought was very generous considering our experience. 

2 stars for my experience today, but I'll review it again next time I'm in the mood to try it out again!"}
{"text":"Went here for brunch, the service was fast and polite, no waiting time for a table, the food was awesome, had our meals within about 15 minutes of sitting. The atmosphere was perfect, nice and quiet but still chatter and slow blues in the background!"}
{"text":"The atmosphere is a bit dated or ktchy depending on your pov. The food is what you would expect from a diner - some great items like meat loaf or mac and cheese and some so so items with interesting names. The hours are a bit weird so make sure you check times before venturing down 9th. 

It is the staff that really shine. We go for Sunday lunch with grand kids about 6 times a year and Mardy (the server) remembers them by name and what they had the last time we were there. It is hard to find such a family friendly venue that treats kids like an important part of the table."}
{"text":"I've been to Kane's Harley Diner a few times. It's a cool 50s style diner, decorated with motorcycle paraphernalia. It's starting to look a little run down, but the food is good and the prices are great! They have fun \"nostalgia\" foods, in addition to a really nice vegetarian selection. I really like the diner and have taken friends and family there."}
{"text":"People in Calgary LOVE LOVE LOVE breakfast.  That is why I've never understood why no one in this city knows about Kane's Harley Diner.  

Admittedly, I'm last the last person you would find any where near a Harley, but this is my favourite place to grab a breakfast.  It is never too busy, but there are always just enough people around to make your experience interesting.  The service is reliable and fast.  That probably comes from the fact that the staff there are \"lifers\" and are good at their jobs.

I don't experiment much when it comes to breakfast, I like the traditional fare with eggs, bacon and toast.  And this diner nails each and every time.  

You are going to be scared to be walk in the doors, but once you do, you'll be happy as a Hell's Angel getting out of jail!"}
{"text":"Great brunch food though by noon they were only serving the one breakfast special (2 eggs any way, choice of meat, potatoes and toast). That didn't float my boat so I chose the BLT. The sandwich was stellar but my side salad had wilted lettuce with black edges. 

Staff was overwhelmed & understaffed. My husband was happy with his breakfast so we would try again on another day. Overall, I can see that this place could be great if they had enough waitstaff."}
{"text":"Great place for a burger.   I had a mushroom burger with swiss.  It was great with just the right amount of everything. Great flame grilled taste on the party.   And a fun decor"}
{"text":"Springer Burger is one of the best burgers in town. Fresh cut fries and real ice cream shakes? What more does a diner need to do? So good."}
{"text":"I went her with friends for the first time last weekend, and we seemed to be the only customers without leather biker vests or jackets.  The food is what you would expect from a good classic diner - I ordered eggs over easy with toast and bacon and it was a great breakfast.
I would recommend Kane's to friends mainly because of the fast and colourful service.  Our waitress was a pro, and her playful lippy attitude is irresistible.
In my opinion the eggs were way better than wat i've had at the Hose across the street, or eat! eat! down the road.  if you're in inglewood for breakfast or brunch this is the best choice.  my meal was also very reasonable for the portion and quality."}
{"text":"The ambience in this place is really cool! It has a 50s feel to it. We had plenty of time to check it out though because no one came to see us for about 10 minutes. We were hungry though and wanted to check out the special. 

When we finally got our drinks and meals ordered we had a good chance to chat and again enjoy the place. It is really cool and there were only two people on the floor but we weren't acknowledged at all. 

When the food came it was really tasty. Quite enjoyable. I think they had an off day but they didn't say anything about it and they charged us extra on the bill which we had to wait to correct. 

The food was good though!!"}
{"text":"My bf and I went here a couple weeks ago and were really excited to try it out. It wasn't especially busy for a Sunday morning, one table of 4 and a few couples seated. We sat and waited and waited and waited, the server ( girl with dreadlocks) literally walked past our table about 4-5 times and never acknowledged us once. I ended up going over to the counter and getting us menu's myself at which point another server said \" Did you not get a menu?\" I said no and that we had been waiting awhile and have had nobody come over. To that she replied \" Yeah well that's not my section and walked away\" about 10 minutes of waiting again ( our server continuously walking by and ignoring us) finally came over and asked us if we wanted drinks. No apology for the wait and a snarky attitude to boot. We placed our orders then proceeded to wait 45 MINUTES for two omelettes and toast. Once we had our food, she never came back once to ask how it was. We had to get up and go to the front by the cash to get our bill and SURPRISE SURPRISE - waited and waited to be acknowledged. Food was great, terrible terrible service. Will not be back."}
{"text":"I was excited to try Kane's Harley Diner today but the experience was less then great.  The diner was steady and had a few large tables of 6 guests and then a few small tables of 2 and 3 guests.  The place is not clean, it looks like the floors have not been mopped in months!  We were disappointed when we arrived to learn that they were no longer serving breakfast but our fault we went in at noon.  We decided to order burgers based on the reviews on 4 square.  It took approximately 45 minutes to receive our food and while waiting for our food we had to keep asking the server to top up our beverages.  Our lunch finally arrived and the presentation looked great!  Nice buns and fresh toppings on the burgers, I can not wait to start eating. That is the start of the disappointment  My husbands burger was prepared incorrectly and had to be sent back as he requested no mayo and it came with mayo. We never received an I'm sorry.  As we started  to eat our burgers they were dry and burnt. My husband was able to finally flag down our server and showed her the burger. She took the plate from my husband and said that she would tell the kitchen and then threw the burger in the bus pan with other dirty dishes and continued on serving guests - again no sorry, let me have another one prepared or let me take the burger off the bill.  He barely ate half the burger.  I also ate a quarter of my burger and then we left. As we are leaving I look into the kitchen and see the kitchen staff as they are preparing  other peoples meals  stuffing french fries into their mouths. After that sight I will never be back!."}
{"text":"Great Diner!

The food is typical diner food, nothing too great. But the decor is awesome! Anyone, weather a biker or not, will love this place. Great atmosphere, cool decor, great location! (inglewood) Just fantastic"}
{"text":"Best mac n cheese ever. Pure cheesy goodness. Half order was huge. Great poutine too. Yummy beef gravy. And reasonable prices. If you have a craving for comfort food come here."}
{"text":"Waited for 40 minutes then discovered my order was never placed....got a free coffee to placate me as I left hungry"}
{"text":"I will give a two star rating for ambiance and my server was new, but she was quite lovely. No issues with the service. I visited Kane's Harley Diner On February 19th at approximately 12:15pm. I sent an email to this diner several weeks ago inquiring about any possible gluten free options and never received a reply. I was in the area,so I took my niece and nephew for lunch. They both ordered a Poutine. Now I'm wondering why this diner calls it Poutine on the menu when it it just mozza and cheddar and gravy and fries. A REAL Poutine is made with authentic cheese curds. This is deceptive actually. Root Beer is not on tap, rather in a can. Fountain beverages they will refill or top-up, but not root beer because it's in a can. Tell that to a 12 year old. I ordered a burger only ( no sides) with GF bread. Nice to know Kane's carries GF bread. This burger, a small homemade patty, one tomato, two pieces of romaine lettuce a cut of onion cost me $12.00. $10.00 for the burger and $2.00 for the GF bread. I wanted to give my niece and nephew a new dining experience, but really not worth the price, deception or the ambiance for that matter. Also, next to no Gluten Free options. If I had a Harley, I would ride off into the sunset and leave this diner behind...."}
{"text":"Love this place it's got super cool vibes and is definitely great for groups. The food is nothing special but tasty non the less!"}
{"text":"I can't believe I am the first person to review this diner on 9th avenue se.  This diner is attached to the Harley Davidson bike shop next door and claims to be Canada's only original Harley Davidson Diner; the huge neon light outside plus the glistening hog in the front window says so much about the ambiance you can expect once you enter its doors.

We are talking classic diner motif but in Harley D's colors of orange and black, there is a memorabilia station, an area for the jukebox, the ordering bar stool area, a back room equipped with a pool table that is free and the classic 50-Esque diner booths that line each walls.  This joint is cased out in chrome and LPs line the upper walls of the restaurant.

The menu is a hoot and a holler as well, some really great biker staples. 

Hog Tail Burgers:  The Elvis, The Broke Biker, Route 66. 

Soft Tail Burger: includes handmade 8 oz Alberta meat patties.  

Primers: Cheese Toast, Garlic Toast, Peppers and Quesadillas

In The Weeds: Coleslaws, Chef Salad and Cesar Salad

Low Riders: Screaming Eagle Chicken, Easy Chicken Rider.

This restaurant doesn't only attract bikers; it is a perfect family restaurant as well, Saturdays and Sundays always sees a full house. The waitress even stated that one Saturday afternoon she spotted the mayor in here right next to a table of Hell's Angels.

Kane's Diner, the Original because it attracts the originals."}
{"text":"Kane's has been in Calgary far longer than I have. And I had never before been in to visit. But brunch on the weekend changed that! 

The diner fits with what you'd expect. Located right in from of Kane's Harley Davidson dealership, it's full of memorabilia, checkered floor tiles, booths and a jukebox. There are entrances at both ends of the restaurant, so if shopping for your new bike made you hungry, there's no need to walk all the way around to the front of the building!

It wasn't terribly busy for a Saturday morning. The first sunny day after nearly 10 days of rain though, I bet everyone was out enjoying the sunshine. The menu is stocked full of big-appetite kind of options. Waffles and pancakes and sandwiches and burgers that I could see many a hungry man devouring. I wasn't so much on the devouring that day, so I ordered the Night Train. Think fruit and yoghurt in a parfait glass. The parfait glass made it quite pretty! And it had 3 French toast \"fingers\" on the side... ie a healthy slice of bread cut into 3 more slender pieces. Just the right amount to get my fill of brunch yumminess without feeling like I'd be waddling out the front door.

The diner itself could use a bit of a makeover. But gals are friendly and relaxed, the food is tasty, my coffee kept being refilled and the prices are reasonable. I'd go back for more of that yoghurt parfait!"}
{"text":"A friend and I were in Inglewood trying to think of a place for breakfast/brunch, most of the places that we could think of would require a wait time and we wanted food ASAP.  We were wandering along 9th avenue when my gf remembered the diner in the Harley Davidson shop. 

We took a short walk over and when we arrived it was pretty neat and decorated with orange and black colors. Ok. I'll admit it...I felt pretty bad ass when I entered. Inside, is a 50's style diner which resides in a former location of a Harley Dealership which feels like a total throw back.

To my surprise, it wasn't busy and we were able to seat ourselves right away, shortly after, we were greeted with menus. The menu is cool, it has items under a category named after motorcycle relations - first gear, second gear, third gear, fourth gear, lubricant... Ohhh, they serve FLOATS and milkshakes in the classic metal cups!  My gf got the feature milkshake which was peppermint candy cane and they sprinkled it with black skulls!!!  How bad ass....and I just went with water.  They have classic breakfast items which range from small bites such as muffins, cinnamon buns, oatmeal to mid-size meals such as French toast, pancakes, sandwiches, burritos to larger meals such as customized omelets to steak.  

We both decided to go with the biker bowl. While waiting we were able to chat and look around.  It was during Christmas month so they had a bunch of cute gingerbread houses and décor that fit the theme of the season.  Our food arrived and boy were we excited.  That cheeeeeeeeeeeeeeese!!! Mmm!! The biker bowl consists of hash browns, topped with scrambled eggs with ham, tomato and green onions, all covered in cheddar cheese and hollandaise.  It also came with your choice of toast. Yum yum yum, it was really good, it was almost like their take on a breakfast poutine.  The hash browns were crispy and the cheese was stringy - everything went well together for one bite.

Overall, service was good and the food was great.  Nothing out of this world but definitely a great spot to hit up for classic inexpensive breakfasts, a cool scenery AND if you don't want to wait in line!  Next time I want to add a small bite!  

Kane, I will be back!"}
{"text":"Oh my goodness, I love this diner.  The atmosphere brings me back to my roots.  I grew up with a trucker/farmer/biker dad and everything about Kane's reminds me of my travels with him as well as his peeps.  I quite like that the diner is clean but by no means looks new or perfect.  It's bright and appropriately decorated, of course.  The servers are exactly who I'd expect them to be - experienced women who are tough, loud and who you may not want to cross in a dark alley.  No one messes with these ladies.  

The menu uses great names and language to categorize and label the food.  I had a half order of the the Pro-Gas Chili and nearly fell out of the booth when it came to the table.  The serving was massive and I only managed to eat the garlic bread and half of the order.  My lunch partner ordered the Hogtails, which was some sort of meat in a toasted sandwich.  She had onion rings on the side.  I just realized I didn't ask her how her food was, but she ate most of it so I'm assuming it was fine.  The bill was under $21.  What a deal.  There was nothing that stood out about my chili, but it certainly was hearty and tasted like an average home-made pot of chili would.  The garlic bread was fresh.

As we were eating, many locals came in to purchase take-out food.  There was much friendly conversation and a few hugs were exchanged.  How nice.  It felt like I was in a small town.   

I'd definitely go back again and can't wait to take my dad here."}
{"text":"I love the atmosphere of this place.  Celebrating the 50's, the wild ones, Harley Davison and the whole bike culture, it's a legendary diner at the heart of Inglewood.  They even deliberately serve a 50s road diner menu of grilled cheese, hamburgers, fries and milkshakes.

I wanted to give this a better review, honestly, but I just couldn't.  I took my partner to lunch here, and found the place unusually quiet at the time.  Then we made our order, and service was also pretty slow considering we were literally the only table at the time.

Worse, when we did get the food, while mine was fairly decent, my partner's food was stone cold, and we had to get it reheated.  I'm not quite sure if this was an off day maybe, but if this is how the food could be in an empty resto, I wasn't quite sure what it would be like when it's hopping.

Still, previous visits for breakfast was enjoyable though nothing especially outstanding.  About the same quality and level as a Denny's or so, but not too pricey and did I mention the atmosphere?  :)  That matters a heckofalot."}
{"text":"Rob introduced me to this retro diner on our 4th date, and I thought it was breath-taking. It's creatively done, right down to the menu (having motorcycyle terms for the food & drink) and even the way the staff dresses. The meals area always filling, and sometimes it's nice just to go there for a milkshake too.

Generally, the staff is verry friendly, recognizes regular customers by name and even sits at the table with us to chat sometimes.

However, my husband & I have found the last few times we've gone there, service is harder & harder to get to our table. The very last time we went a few months ago, we tried & tried to get the waitress' attention but she didn't acknowledge us, so we thought maybe we did something offensive, but weren't sure so we just got up & left, since we didn't even get to order drinks.

I figured I'd give it a year or so before going back to let things blow over. Some good things are: this is a seat-yourself restaurant and it has some really nice retro decor :)"}
