{"text":"Excellent vegan choices;  although they offer meat choices, they do not know how to cook meat!! We order a vegan plate and a meat plate ... Couldn't finish half the meat plate it was so bad.... Otherwise , counter service is funny and amusing."}
{"text":"Friendliest place ever! Karine calls you \"baby\" and \"gorgeous\" all the time, which is nice haha. Great value for the food you get, especially their $5 breakfast menu. Their salad is great"}
{"text":"Amazingly cheap place to grab all day breakfast, $5 for:  2 eggs, 2 toast, fries, bacon or sausage, fruit, and coffee or tea. Everything else on the menu that I've tried is absolutely delicious too! I am drooling just thinking about those garlic fries. But the service is what keeps me coming back. Still remember my name after many years of not living in the area anymore."}
{"text":"I think the actual taste of the food here, is just okay, it's on the bland side if you ask me.  They do have daily breakfast specials for $5.00, so for that price, and the fact your getting a good portion and more healthier fare than say going to McDonalds or Tim Hortons is worth it.   However, they do not make substitions, so if you are gluten or dairy free, you will have to order one of the 10 dollar plus breakfast item, which is a let down.  The rest of the menu is $10 plus, again although its good portion, I don't think its worth it for the taste.  I've been to far superior breakfast places, that you can get much tastier meals for this price.  Once I factor in the gluten-free substitions I need, I am looking at a $14 ish breakfast with no drink, for me, personally that is not worth it.  The restaurant is located in a food court, and I feel that is what you are getting food court tasting quality food."}
{"text":"Fantastic & filling breakfast for $5. And the service was better than anywhere I've been in a long time. Love this place!"}
{"text":"I read about Karine's long time ago.  Recently I have reasons to be in that neighbourhood few times a week.  Karine's becomes the only place I buy my healthy and nutritious breakfast or dinner.  I followed the owner Maggie's recommendations whenever I get overwhelmed with too many choices from their menu.  I love this place!"}
{"text":"Had really high expectations from friends who would not stop singing praises.  Food was average, and I really wasn't expecting the stark food court atmosphere that prevails here. Ordered french toast which turned out slightly raw and eggy, coffee was marginal."}
{"text":"If you arrive early enough,  there are a few tables with table clothes and fresh flowers for Karine's diners.   Karine herself is charming. She refers to you by first name when you place an order and is always smiling.   They have a wonderful selection of veggie,  vegan and gluten free brunch items. Most of the plates are quite generous in portions and side salad has a variety of fruits"}
{"text":"Amazing. Makes you wanna go vegan. Super fresh n organic n just mouth watering tasty."}
{"text":"Cool little hidden gem in the Village by the Grange food court across from OCAD and the AGO. Tons of healthy vegetarian breakfast and lunch items. Tofu with pesto, fava bean salad, egg white omelets, plus your standard delicious french toasts, waffles, wraps and salads. Inexpensive. Fresh. Tasty.  Healthy is hard to find in the restaurant world. We wanted to do it this morning after a weekend of partying! Aside from the HEAVILY buttered toast (which I didn't quite have the heart to send back), Karine's did not disappoint today.  Last time I ordered this vegan platter at the owner's suggestion which was beyond awesome and I couldn't wait to go back. Would highly recommend the Lebanese options like the 'Lebanese delight' (a fava bean salad) and the vegan burgers.   You'll walk out of there feeling like you did your heart a favor."}
{"text":"Karine's is like a hidden gem and once discovered you can't resist going back over and over again.   I'll start by saying that Maggie, the wonderfully sweet, friendly and enthusiastic owner will brighten your day instantly with her warm smile, genuine interest in helping you order whatever will make you happiest and her fondness for calling everyone \"Baby!\"  I love that everything I order comes with a pile of fresh fruit, that I can have vegan French toast and pancakes with a wide array of toppings and that much of what's on the menu is vegetarian and vegan friendly.   If you're not in the mood for breakfast try the lentil soup. Their \"Bomba\" spread is delicious!!  If you're trying to stay away from gluten they have options for you too!   This is a great place to go if you're trying to accommodate a variety of tastes and dietary preferences!   It's located in a food court but that just makes the table clothes on the tables in the immediate vicinity that much more charming."}
{"text":"\"Jess honey, your breakfast is ready!\"  The call of Karine's hot, freshly-made $5 breakfast is always answered with a resounding yes. I've been back at here several times and they never disappoint.   There are also some fantastic omelet options for about $10, but I enjoy my standard two eggs, salad, fruit, and toast. The French Toast is yummy and I would highly recommend their Peanut Butter and Chocolate Shake. It is very peanutty and with just the right amount of chocolate drizzled on the inside of the glass. Also free coffee and tea refills?? Yes x a milion. I am a big fan if you can't tell ;)  Karine's is super budget friendly -- my friends and I used to come here all the time when we were broke university students. The service is great, run by a lovely matriarch who is full of personality. It is located in a convenient area - just across from OCAD and the AGO. The only thing that keeps me from giving this a 5/5 is that that the seating areas could be slightly nicer in the food court, but hey the food is so reasonable the rest doesn't matter!"}
{"text":"This is my first thought when it comes to breakfast away from home! Healthy and affordable breakfast on the go is scarce so Karine's is my go to.  The service is super hero standard! See my breakfast...$5 worth! Awesome!"}
{"text":"I'm not a vegetarian but I have to say that I had a delicious breakfast here!  We were visiting Toronto with friends who are vegan so this was a great choice.  The staff were friendly, the plate of food was big, fresh looking and tasty, and the price was great.  I would highly recommend this place."}
{"text":"Love this place with a passion. I always stop by when I'm in the area for great portion sizes and affordable prices. Garlic Fries and Salad sides are amazingly delicious and the Bacon is perfectly cooked for my liking! The staff is some of the sweetest people in the city, and always a joy to see their smiling faces."}
{"text":"Awesome vegan brunch options including a tofu beni. The portions are huge but because it's healthy it's not too filling. Also great juice options. The best part is that they are such positive people. Made my day."}
{"text":"The best ladies and their food is absolutely delicious!!!!! Enjoyed the vegan goodness and their pancakes are to die for! The vibe you get from the owners puts you in a happy place! Very satisfied!"}
{"text":"Very fresh and delicious breakfast options including eggs, fruits tofu, salads...too many to list. Early bird specials are also available during the week.   Ladies working behind the counter are super enthusiastic! Makes it a pleasure to visit."}
{"text":"In search of a healthy alternative, I found Karine's. Not only was the food fresh, hot, and delicious, the service was EXCELLENT!! When I dine, I want great food and great service. Karine's doesn't disappoint on either. Price...ON POINT!"}
{"text":"I really dont understand the hype. Long lines everytime i visited the area... Finally we gave it a try last week. We ordered the 2x $5 specials (breakfast special and the wrap) + the $1 coffee.  The breakfast special came with 2 overcooked eggs, 3 slices of sausage (wanted bacon, but was told that bacon is no longer a selection on the $5 menu), 2 slices of bread and some fruits... Nothing special... The wrap wasnt good as well, it was dry and hard, worse than Macdonald's wrap...  Portion was small, but for $5, we didnt expect to be full to begin with.. but with quality like this... and being so close to chinatown for cheap food... Dont think i'll give it a 2nd try ..  Note: The items on the regular menu are close to $10."}
{"text":"You wouldn't expect to find such good brunch in a food court. The staff is incredibly nice, the food is healthy, different and reasonably priced. Portions are pretty big and often contain a variety of fruits."}
{"text":"Well, I went to see King Tut during it's last weekend here in Toronto. Since I came early, I was hungry as hell and wanted to eat something that would last me hours of walking inside the AGO. I remembered reading about Karine's via Yelp (naturally) and so I decided to try it out. I was not disappointed.  She took her time explaining all the different dishes to us and what vegan/vegetarian meant (sorry, but I am a carnivore). We ended up getting 2 different types of benny to share:  a) Florentine (with Spinach): ingredients were super fresh! Salad was delish and had dragonfruit (?) in it - holy crap, I haven't had that in ages and I loved it. I would have preferred to put a different kind of dressing in it but I am just being picky here. The benny itself was perfect comfort food. But, I have to admit that I liked the next one better.  b) Oceanic (with Smoked Salmon): yum yum yum yum! I needed the protein and it came in a package of delicious fresh salmon. Just the right combination of eggs / toast / fish. I would eat this for breakfast everyday if I could. The salad is the same as a).  Overall, the food was delicious and the service was excellent. They also serve real plates (yay for the environment) and the price is hard to beat. The tea / coffee was ok - I tend to prefer my own snobby versions but really, I am just nitpicking again."}
{"text":"Delicious roasted vegetable omelette! I loved the fruit and the dairy free butter on the toast! The citrus water was great too. I'd go here everyday if I could."}
{"text":"Best food court food - hands down! Love the five dollar specials and they have lots of vegan options. The fries are super garlicky if that's your thing. The fruits taste fresh.. My personal favourite are the smoothies"}
{"text":"this place is delightful.  The owner Karine knows everyone by name, and if you're new, she'll ask you what you're in the mood for and she'll make you a meal that suits your fancy.   the food is fresh, creative, delicious, and cheap! the $5 lunch combos are to best."}
{"text":"We were in Toronto for a long-weekend vacation and decided to try this on our next-to-last day for breakfast. We went back the very next morning, too.  I can only speak for the vegan breakfast options, but everything we had was delicious.  The woman at the register (I'm assuming the owner) was incredibly nice - she made recommendations, remembered us on our return trip, and even gave us extra when we complimented particular parts of the meal.  The meals are plated beautifully and contain LOTS of food.  Over two meals (for two of us), we had the Vegan Goodness plate, the vegan version of the supreme breakfast plate (sorry, I can't remember the exact name), the pancakes, and the French toast.  It was all so, so good.   Oh, and get the green lemonade. It was wonderful!"}
{"text":"This place has everything going for it: Prime Location, Very inexpensive and Great Food. I love finding vegan and/or vegetarian exclusive places in toronto, and this one has become one of my new favourites. I usually grab breakfast here from time to time, and it's easy for me since its inside the food court. Great stuff"}
{"text":"I decided to try out Karine's with a friend after reading up on all the good reviews. Very disappointed. I had the Supreme breakfast with the pan cakes. All of the meats tasted pre-cooked, greasy (tasted the grease) and only lukewarm as if they were warmed up just before serving. The pancakes were a bit soggy The only decent items are the eggs. For $11+tax, the quality did not reflect the price.  I don't think I will return."}
{"text":"Where to begin. The owner exuded positive energy and made sure we got what we wanted. The menu has a great selection for both vegans and their friends who want a wider selection in their foods. Karine's special for breakfast was literally everything I want in a breakfast and it was all super good. Fresh fruit, check; good pancakes, check; good meats and eggs, check; and it came with garlic fries and a salad! HIGHLY recommend this to anyone looking for a budget friendly high quality food!"}
{"text":"I had the pleasure of checkin this place out after a recent hockey trip at MLG, and of all the places I ate at, I was most impressed by this one.   Feelin brunchy, i made the walk over to here from my hotel, and decided to try the Karine Supreme i think it was called, Vegan Style.   The lady at the register was very nice, so I let her pick all my options, and I wasnt dissapointed.   This thing was a lot of food. I got two very delicious and fluffy pancakes which i topped with maple syrup of course, a pile of fresh fruits sliced, including a dragonfruit slice which was the star of the show, A nice cabbage salad with a light but delicious dressing, a piece of toast with some sort of butter alternative, a couple of pieces of tofu which were topped with some sort of tomato/walnut/almond mixture that was out of this world flavorwise, and i dont usually dig tofu much, and a nice sized bowl of lentil soup that I was skeptical of at first, but was a squirt of lemon away from being perfect.   Service was nice the whole time, and i got a pineapple juice to drink, which was super thick and delishous, freshly juiced. I think i got called baby 10 times at first count.  Overall great place, glad i made the trek, and glad i saved my last subway token for the ride back afterwards since i was as full as can be.   If only i didnt live 4 hours away id try their french toast and other offerings. Scared me at first being among generic asian and fast food court options but delighted in the end for sure!"}
{"text":"I fucking LOVE this place! A safe haven for vegans, vegetarians, and gluten-free types in the heart of downtown. The best university food court I've yet found (No Ryerson, the Eaton Centre doesn't count as yours), mainly because of this place!  All the bread they use is, to my knowledge, gluten-free. They know how to make a badass smoothie (I'd recommend Pink Lady), their vegan burgers and fritatta blew my mind and opened my brain as to what a 'burger' was (they're potatoish, full of veg - not plastic fake meat) - and I got it in a wrap with their amazing 'bomba' spread. I have no idea what bomba means but I think it is another language for WOAH. I believe the owner(s) are Armenian, so there's a bit of an Armenian flair to the cooking, which I really really love.  They also have vegan desserts, such as cookies and delish raspberry twirl things (I have no idea what they're called, but they are great), and an amazing all-day breakfast. My fav all-day breakfast items are the pancakes and the french toast, if I'm feeling really decadent! It's because of Karine's I know how to make vegan french toast at home, because they told me how! ;)  Can't go wrong with the soup either, and I love how they give you a huge helping of fruit with everything you order. Amazing. And it's not typical boring fruit either (and I love fruit) - they usually will have something slightly unusual in there. I've had dragonfruit, persimmons, and kumquat there, in addition to the usual grapes, strawberries, blueberries, and pineapple.   As a soon-to-be former OCADU student who went vegan during my time there, nothing made the transition easier, and my body more healthy, than Karine's.   Some may be put off that they do serve eggs and bacon should someone want it. That doesn't really bother me, because I can eat here with my non-veg friends and fetch no complaints. ;)"}
{"text":"Went to visit this charming fast food restaurant yesterday. Karine, who has her two daughters working there was so warm and friendly!   A friend and I ordered egg and cheese wraps with garlic fries and a side spinach salad. The food arrived on China and we were given cutlery to use (homey, nice touch). The presentation was wonderful, so colorful! We also helped ourselves to some complimentary grape and strawberry infused water. The bonus was each meal was only 5 bucks taxes in.   The food tasted amazing!! Homemade salad dressing was so delicious! High quality ingredients were used.   Would definitely visit again! Next time I might indulge in a crepe. Highly recommend checking Karine's out!"}
{"text":"Ok this place is the best brunch I have ever had! I had the eggs Benedict with all the types of bacon ( normal and Canadian) in a unique sour cream enhanced  sauce! And crispy home fries and half Salad.  I also had one of the best pineapple & ok fresh juice which was fantastic for 4$. The atmosphere is a food court which is kind of amazing as there is always places to sit And great people watching! Make no mistake this is a must try!"}
{"text":"Just had a lovely breakfast here. The hostess (Karine?) was a bundle of wisdom and joy and recommended us delicious combinations of tastiness and healthiness.   Fruit was fresh and exotic, the eggs were cooked with care, the vegan gypsy sauce was perfect. Make sure you get a mini cookie when you're done."}
{"text":"As good as it gets downtown. I've gotten the #1 and 6 meal here with salad/garlic fries and fresh orange juice. All were cooked fresh by the hard working folks at Karine's. On the side there's free fruity water (water soaked in strawberries, orange slices, or melons... it changes from day to day).  If you're a food critic don't go here. This is not fine dining, yuck.  If you want a healthy downtown lunch that's not over $10, Karine's is perfect for you. Get the salad if you want healthy, get the garlic fries if you're hungry. Though I would skip the fresh orange juice b/c it's $4 (their fruity water is fine). And their salad dressing could use more flavor."}
{"text":"Absolutely delicious!!! A bit hard to find the place, but once we got there, there was no doubt we had chosen the best place for a healthy, fortifying, delicious brunch before spending the rest of the day exploring Toronto. The service is super friendly and the food heavenly!"}
{"text":"On my first visit I was oblivious that this place is cash only, so when I reached the first position of the queue, I was ready to turn back and fetch some cash. The owner, whom I assumed is Karine herself, stopped me from walking away and insisted that I tell her what I wanted. I ordered a Supreme Breakfast, which she followed by asking me to empty from my wallet as much change as possible. She swept the sad pile of coins into her cash register, waiving the remaining amount owed, and asked me to pour myself a cold glass of fruit-infused water and find a seat at a nearby table. While I stood there, stunned, a genuine smile lit her face, \"it's Mother's Day, go, enjoy!\" Such Incredibly kind owner!  The breakfast itself was tasty. the cinnamon french toast was crispy on the edge and soft in the centre, and the fresh fruit salad added a nice balance to the plate. The only thing I thought they could improve on were the fries, as they weren't fried long enough making them a little crunchy in texture.   I will come back soon to try other items on their menu. Karine the owner reminded me a motherly overseer of the community, which is aptly young in demographic!"}
{"text":"I went there for lunch and the place is as described in other reviews inside the food court. I had soup meal. It was delivered quickly. The lentil soup was served in a large bowl with bread, a tasty carrot salad, some roasted broccoli, a piece of bread ( I forget what kind) and some fresh fruits slices - 2 pieces of orange, a triangle shaped pineapple and watermelon slice, a strawberry. It was filling and tasty. The only thing I would have changed is the spoon served with the soup. It was regular one not the ideal to eat soup. I just ended up sipping the soup from the cup directly."}
{"text":"I love this place. I don't even feel like writing anything else, I feel like I could simply leave it at that and be satisfied, alas, I'll indulge you a little bit.  They have wonderfully presented vegan and vegetarian options (yay!) affordable and healthy!!!! It's so hard to find food (to-go or not) that's healthy, though it has been getting easier thankfully. I got the brunch with eggs and shared it with a friend. Everything tasted good and seeing all the different colours on my plate was not only pleasing to my tummy but my eyes as well (after all you eat with your eyes first!).  Go try them out!"}
{"text":"Love Love Love this place, best brunch/post drinking place. Their bomba is a great vegan option, tons of flavour and pretty much is an awesome chutney to go with the pita or bread that they serve for breakfast.   Their vegetarian wrap for 5 dollars is a steal, with a ton of spices and flavour.  Will keep on coming here!  Maggie (lady calling everyone bebeh =D), Karine, and Momma are an awesome team!"}
{"text":"Karine's is often compared to Cora's which I don't think is very fair for two reasons;  1. They're not really the same kind of place - Karine's is in a food court and is a place to get a quick, delicious breakfast and go. Cora's is a pretty nice sit down place where you'd go if you had some time. 2. Cora's can't hold a candle to Karine's in terms of quality of food. Not even close and I'm a bit of a fan.  The reason they're compared is because, like Cora's, breakfast at Karine's is served with a mound of fresh cut fruit. It's plentiful and delicious and like everything Karine's does, is a bit better than Cora's.   The rest of the extensive menu is a combination of omelettes, benedicts, sandwiches and various other breakfast and lunch options. I've only experienced the breakfast here but everything I've had has been just delicious. It's healthy, fresh food cooked with some sort of love.   MENU RECOMMENDATIONS Eggs Florentine Yogurt and granola  SERVICE NOTES Fresh over fast service from the sweetest, most tattooed old lady you'll ever see serving breakfast in a food court.  LOCATION NOTES In the OCAD food court. Yes, it sucks to be in a food court and it would be better if Karine's wasn't in one. Get over it."}
{"text":"Delicious and pretty cheap! It was in a food court so I actually missed it the first time we walked past it. A lot of good vegan (and non-vegan) stuff. I just got the pick 2 special for $8 (I got the burger and pesto tofu), which came with bread, a salad, and fruit. The fruit was actually really good, it was all really fresh and ripe. (and there was dragonfruit!) Very filling. Highly recommend."}
{"text":"Really cool place. Located in an odd food court location. Awesome friendly counter service. Granola/yogurt/fruit parfait was out of this world. Karine's supreme was a great pile of food. Everything fair prices and delicious. Lots of good fruit. Only complaint was I would say the waffle was average - would probably try pancake or french toast next time."}
{"text":"Where else can you get such a healthy well balanced breakfast for 5 dollars? No where. Not to mention a big ego boost from the owner , who will always make you feel warm and fuzzy with all her kind compliments. The only shame is she's stuck in a food court, this place needs another location with a patio and lots of natural light."}
{"text":"Best part of this place is the woman taking orders, so friendly! So many veggie options. The breakfast is great. Had florentine benedict, it was really good. Fast service."}
{"text":"I went off the reviews on Yelp and I have to say they're absolutely accurate. The manager of Karine's is such a sweetheart and right from taking my friend and I's order there was a positive vibe. She's amazing. The food is extraordinary. I love how fruits are always included in your meal. Very healthy and filling. I had the Karine's Supreme Breakfast which includes your choice or meat, eggs, salad, fruits, your choice of potatoes and french toast or pancakes and the papaya, orange and pineapple juice drink and I loved it! I loved the whole entire meal.  Everything is made fresh. We got our food really quick and it was all sooo gooddddd. I'm still full the meal and I had it four hours ago at 2 pm for brunch. Definitely go here if you're looking for something healthy, filling and tasty!"}
{"text":"Horrible!  Tastes gross! Got the eggs Benedict. Hollandaise sauce is VERY SOUR. I can't finish the rest of this. Leaving at least half. Potato wedges are burnt and don't taste good."}
{"text":"Don't eat here unless you're ready to FALL IN LOVE.   We ate here 3 times on our 4 day stay in TO. Then, on our way back through (we were road tripping) we stopped again.   Maggie is a wonderful, beautiful, talented human being. The food was perfect, looked amazing and kept us little ole vegans coming back for more.   Karine's is perfect, simply perfect."}
{"text":"Amazing food.  My friend (vegan) and I (vegetarian) enjoyed brunch here while visiting Toronto.  We loved everything we ordered, particularly the pesto tofu and homemade lemonade. Only giving 4 stars instead of 5 for the food court atmosphere. Nothing wrong with the food court itself, just a little weird."}
{"text":"Karine's make me feel good. Just knowing that within the grange there's a vegan, gluten free, place to get food makes me very happy. I recently got a smoothie and it was great! Perfect amount of sweetness, super fresh tasting, and it was super convenient on the go.  The lady who's always there has sick tats and calls me sweetheart (^:  Sad thing is they close at 4 so if I'm at school late I won't get to get anything at Karine's"}
{"text":"During my short weekend stay in Toronto, i was in dire need for nourishment after a very heavy night of drinking. I hopped on yelp to find something quick. Karines popped up and that's where I went.   The woman that works there is so loving and inviting, I felt like I was eating  at home. A very motherly appeal to her! There needs to be more people like her, everyone would be happy and full! I can honestly say I've never walked out of a place more happy. A big smile on my face coming here. My day was 1000% better after coming here!  On to the food!  I ordered the Karine supreme. Wow. Pancakes, eggs, toast, peameal, salad and some garlic fries. Breakfast of champions! Love this place. I will keep going back!!!!"}
{"text":"Struggling to know what star to give this place. People who run it are extremely nice and welcoming. The budget dishes are great value for breakfast. However off this the dishes aren't great for the price ( like the extremely bland tuna melt). I think my problem is that there is a certain 'sameness' to everything, and while il happily pay 5 dollars for the all day breakfast, it feels like the other dishes should be priced similarly.  Also as stated before, raw garlic doesn't belong in any dish, let alone fries."}
{"text":"Super delicious, hearty food, and I just enjoyed the very friendly outgoing personality of the family run place. We got the \"I'll eat everything\" option which came with sausage, ham, pancakes, two sunny side up eggs, fruit including figs, strawberries, melon.   The service was stupendous and they have a great selection of vegan and vegetarian options too."}
{"text":"Went there on a Sunday for brunch. The place is located inside a cafeteria with other independent restaurants and some chains (McDonald's, Popeyes etc). You sit in the cafeteria to eat but they have decorated the tables around them with table cloths and small cups with flowers.  As for the food, the quality was not good. You can't expect too much when the prices are cheap and portion sizes are huge. My boyfriend and I both got the Supreme. I could taste the burnt, old oil through my fries. The fries were overcooked (almost bitter), while the pancake was slightly undercooked and stuck to my teeth. Their bacon is super salty and again overcooked. My boyfriend on the other hand, replaced pancakes with salad (which he said was good), and got home fries instead of regular (which also turned out to be better).  We both got a bunch of fruits with our meals which in my opinion was the best part of my meal. Their 3-fruit juice was okay (freshly squeezed but it was 90% orange juice)  Tldr: I did not like it that much, but my boyfriend said the food is ok. Mind you, he loves food in general, whether it is good or bad.  If you want to give this place a try: Do not get the regular fries or pancakes. The bacon is very salty. Get the salad and if you really want fries get the home fries."}
{"text":"French toast and pancake are both really dry. I really think this place is overrated and the price of supreme breakfast raised."}
{"text":"This eggy French toast was not worth $15. I had heard a lot of hype about how this is a hidden gem but I was thoroughly disappointed all around. I got my order to go and didn't end up eating this mess."}
{"text":"Nicest. People. EVER. EVERRRRRR.  That aside, the food was excellent, lots of fruit and veggies plus all of the substantial stuff to fill your tummy. The prices are very reasonable for what you get, particularly the lunch deals.    Who works there?  Karine, her mother, her grandmother, and her sister.  Her mother is amazingly exuberant, calls everyone baby (but not in a creepy way), and just the most positive experience one could ask for.    I'm so glad  I found this place, would never have expected to see something so healthy and friendly in a random food court.   Did I mention nicest people ever???"}
{"text":"DO NOT have the waffles there.  I ordered it this morning and it was rock hard and inedible.  I had a hard time cutting through it with a knife.  The servers were very friendly and the atmosphere was good. But I will not be coming back.  My wife's breakfast was french toast which was better than the waffles, but nothing great.  Just as an FYI, it's a food court location.  But waffles should be edible."}
{"text":"This place was my JAM when I was at OCAD. I remember the first time I got the 6$ to-go combo and I didn't look back. You get the biggest portions and it's always so tasty. Everything also comes with a heaping pile of fruits so yay for healthy eats!   You must try their lentil soup. It is so good to have in the colder months or when you're sick, or just in general, it's that good.   On weekends when most places aren't open in the Grange they are and they even put cute little tablecloths on the ugly old food court tables around them. How cute is that?   Also the staff is probably my favourite part. Super sweet ladies. Who doesn't love being called baby and getting 10000 compliments while ordering food? So much love for this place!"}
{"text":"Great food, low prices (they should raise them!) and super friendly. Never left a Yelp review before but I just love this place!"}
{"text":"I'm a little put out to this day by Karine's purporting to be a \"vegan, vegetarian and all-day breakfast\" eatery, when really it's just an all-day breakfast eatery with some vegan options along with everything else.  I tried the \"vegan goodness\" platter which was overwhelmingly oily, and I ended up not being able to finish my plate of food. Perhaps if i'd gone for one of the other couple of more 'regular' breakfast items like french toast or the tofu beni I might have had more luck. That one meal was enough to put me off going back, especially seeing as I can get a flawless brunch every time I go to Calico, Fresh or Sadie's!  Perhaps next time, Karine's. But for now i'll stick with the places I actually know are vegetarian/vegan!"}
{"text":"It all looks good and delicious, but it doesn't taste as fresh. Pancakes are good, bacon and sausages not much. Extra point for having gf options."}
{"text":"Really small thing, but it was my first time being here, came to ogle their vegan desserts since I'm now trying to slowly become one - although they didn't have much left since it was a little late in the day, I was still looking at their muffins. I asked if they had any cupcakes left, to which the owner - I think Karine herself - told me she only had them in the morning, but she would make a makeshift one for me out of the muffins they still had! =D DING DING DINGGG!* So she took one, put some icing on it and a strawberry, wrapped it in a box with a fork and handed it to me for $3. AND she did this entire ordeal with a genuine smile on her face and had the best positive energy/vibe and heart, because let's be real - customer service is lacking in many establishments, and most places would've just left it at \"we only had it in the morning\" without even trying to cater to the customer. Even though it was only $3, she sold it as if it was the most expensive one lol, she seriously rocks!"}
{"text":"Tucked back in a food court Karine's is great for wholesome, healthy, and delicious food. I split the supreme breakfast with my little brother and he didn't let the veggies scare him! Scrambled eggs, extra crispy bacon, a small salad, fresh fruit, and GF pancakes. Yum!   The pancakes were no fluffy buttermilk, but for GF they were pretty good. My brother even said they were alright and he doesn't typically go within 10 feet of GF foods.  I went back for a cup of coffee and a GF/vegan cake ball. A solid decision. The cake ball was absolutely delicious and combined with fresh brewed coffee and GREAT service, this was a solid decision!   The options can be a little overwhelming, but Karine is willing to answer any and all questions and she provides great direction!"}
{"text":"really huge portions for your money! presentation of the food was also lovely. so many colors! but the food itself was just okay. the fruit were not ripe, the juices were not cold, and the menu was awfully overwhelming. i almost had a panic attack trying to read it. i wish there were menus to read closer, because all of the tacky ceiling decorations kept blocking my view. but for a food court vendor, it was surprising."}
{"text":"A friend suggested we brunch here, and although I was surprised when I arrived (I was expecting a restaurant, not a food court) in the end I was pleasantly surprised.  They had lots of vegetarian and vegan options, but also meat and eggs. I ordered two eggs with peameal bacon and toast with a fresh grapefruit juice and it came to just under $14. Good price. I liked how friendly the woman at the cash was, and how each plate was served with salad and fruit.  I would most certainly go back for the food, though the atmosphere was a little lacking.  One tip, the address is 109 McCaul, but you actaully ahve to walk a little south of that to find the entrance. It looks like you're walking into a apartment building, but keep going! :)"}
{"text":"beautiful!!! amazing huge hearty meals, tons of vegans options.  the colors and the presentation of the food, it's like a food rainbow heaven! the gals running the show here are amazing, smiles, accommodating so pleasant."}
{"text":"This is arguably the best vegan brunch place in the city, although they do have many non-vegan options.  The first thing to note is that they are located in a ho-hum food court across from OCAD and the AGO (the entrance can be difficult to find) but make their space their own, with using bright burgundy tablecloths on tables nearby and real plates and silverware.  I always get the Vegan Goodness dish with garlic fries, which are really amazing. A huge portion of fresh fruit, a delicious mixture of tofu and vegetables, and toast (with an awesome gluten free option). My fiancée loves many dishes here, but especially the cottage cheese, fruit and toast plate.  Prices are very reasonable, the portions do not leave you hungry, and the staff are exceptionally warm and friendly.  They sometimes shut down on long weekends and reading week, so make sure to call ahead or check their Facebook page. A great stop before the AGO."}
{"text":"Enjoyed the supreme breakfast with meat. Had a nice variety of fruit, salad, French toast, toast, bacon, sausage, peameal. Everything was tasty, just found my eggs very dry and the salad dressing much too overwhelming (it's a thick mustard dressing) so next time I will simply ask for no dressing or on the side. Also would've like some syrup for my French toast but I didn't try asking so maybe I could have got some if I asked.  Everything tasted fresh and \"homemade\". Also friendly kind service. Everything looked clean and well organized. Very well priced and affordable.  I will definitely return to try other stuff on the menu. The supreme breakfast was a lot of food.   Great places for vegetarians- lots of delicious looking veggie options."}
{"text":"My brother and I stopped by here after hoping to head to Manpuku just next door (closed on Sundays! Should've checked Yelp first, ergh). While we stood infront of the CLOSED sign, I looked to my right there were a TON of happy people dining in front of this little food court place. Intriguing!  So I dragged him over to stare down the menu, and I simply couldn't resist! I mean, they set out tablecloths on the food court tables, they play awesome music, and they collect back their dishes and cutlery to be rewashed! How awesome!  The food there is pretty good as well - they have great $5 meals for those who aren't looking to spend a lot (though I don't think anything on their menu is more than $10). The meals all come with a good amount of fruit, and a lot of their menu items can cater to vegetarian and vegans. The coffee wasn't very strong, but the waffles with cream cheese and cherries made up for it and then some!  I'm definitely recommending this to friends in the area - it's a great hidden gem in the city!"}
{"text":"This place is amazing!! Karines supreme is delicious and you get 5 items. I got it with the pesto tofu and it was amazing. The pancakes and waffles are super fluffy for being vegan. This place is in the food court but the food is fresh an delicious! I definitely recommend this place."}
{"text":"MAGICAL.  Every bit of it.  Order the Supreme and keep saying YES to her.  All of it fresh, beautiful, colorful, delicious.  You have to seek this place out, it's not somewhere that you just happen upon.  When she yells your name to come get your food, you feel like you've won the lottery.  And you have.  Don't keep this secret.  Tell all of your friends and their friends and their friends.  It's GRATITUDE on a plate."}
{"text":"In a cool food court that's connected to OCAD. Great people and great breakfast food. Totally recommend."}
{"text":"Woke up in Toronto for the first day of a business trip and googled \"vegan breakfast.\" Found a place called Karine's a few blocks from my hotel. I wandered down the street and found them inside a food court, in which two-thirds of the restaurants weren't open yet. But Karine's was, and I found a warm reception there.  Tofu Benedict can be a gamble, but I gave it a shot and was blown away by what Karine's did with it. It was unlike any Tofu Benedict I've ever had. Instead of a Hollandaise sauce, Karine's used a tomato base lathered over grilled tofu and a very flavorful, chewy bread. She covered it in roasted vegetables and vegan cheese - it was almost like a parmagiana more than a benedict. On the side was a salad covered in berries and a lemon vinegaigrette.   It was an unusual, amazing breakfast made better by the friendly, professional attitude of the woman behind the counter, who I presume is the owner. She made my breakfast quickly and with care, and when I left, she said, \"Goodbye, my American darling.\" Next time I'm in Toronto, I'll make a point of coming back to Karine's."}
{"text":"Based in the food court of the grange i discovered Karine's while searching for a healthy vegan option.  I could not resist the temptation of this amazing 5 dollar adb (all day breakfast) but have noticed they are limiting it to until 11 and the coffee is no longer included.... but just look at this beauty for 5$"}
{"text":"This is what all food court establishments wish they had going.  Personality.  Located in a dilapidated mall-ish place that no one has ever heard of, people should take the 5 minute walk from Queen St. to check it out!  - a big line up of people chatting happily, waiting for goodness they know will come - good brunch-y food that is the standard quality anywhere for under $10--but there is a lot of it, great variety on one plate, totally share-able - meat choices available  Lively women behind the counters working hard and fast to get you what you want.  Table cloths on the food court tables for cheap and cheerful \"atmosphere\".  It was as if somebody cared.  Or at least knows how to run a successful business."}
{"text":"Food was amazing! Portions were very generous! Server was also great! what more do you need. What makes Karine's different from other brunch places i've been to is they load up your plate with everything you may crave, unlike classic brunch places where your plate might feel underwhelming and not worth the price your paying.. Not at Karine's! Definitely a place i will be coming back to when i'm feeling brunch :)"}
{"text":"Karine's is a great place to stop by in the morning and grab a big breakfast and a hot cup of coffee.  The place is set in a food court, so you take your food back to your cafeteria style seat.  The person taking my order was very sweet and attentive.  She took care of everything.  The food was definitely fresh as other people have mentioned.  The french toast was a little tough to cut through, but I didn't have any syrup on mine.  Not a huge deal to me.  Everything was memorable, the garlic fries, the eggs over easy, the toast, the pea meal bacon, the sausage.  It was worth it."}
{"text":"It took us a little while to find this place tucked inside a food court. I like how every dish came with plenty of freshly cut fruit. I have to say that this is the healthiest french toast I've ever had, and no I don't mean the vegan/dairy-free modifications that are readily available (which is really awesome). It's just that the bread was nutty and coarse - not the kind of texture I expect from french toast. Still tasty, just different."}
{"text":"Got myself a \"king tut supreme\" 2 fried eggs, 2 pancakes or French toast, bacon, sausage, garlic or regular fries and peameal for 8.99 Coffee $1 - unlimited refills.  I didn't care that it was in a food court.  I LOVED eating from real clay plates and drinking coffee from a real cup. I'm so tired of paper cups and plastic plates!"}
{"text":"I never would have thought that I would be writing a review about a restaurant in a food court, but Karine's is a first for me - a food court find! Located in the Village by the Grange Food Court, Karine's is a fantastic little place to grab some really good and really well priced food. The menu is colour coded for gluten free, vegetarian and vegan options so everybody can easily find something delicious. They even put tablecloths on the nearest tables, which is an indication of just how much they separate themselves from the rest of the food court denizens. I had the supreme breakfast, gluten free version, and I was thoroughly impressed by my feast. It comes with eggs, peameal, bacon, ham and real sausage, plus possibly the best gluten free pancakes I have ever had. Add on a soup (I had the lentil, yum!) and a salad, and you have enough food to satisfy everybody short of Paul Bunyan. I still can't get over how just good this place is and just how poor a location it is in. But if you happen to be nearby, you have to check it out."}
{"text":"As one of the other reviewers mentioned -- just go here!  This place is cash only.  I went to this place because of the fairly consistent Yelp reviews.  A lot of other vegetarian places had bipolar reviews -- lots of 1 star and 5 star reviews.  This place had more consistent reviews.  I went here for lunch with a friend that is not vegan/vegetarian.  First off, this place is in a mall food court.  I was expecting a restaurant off the street, but that wasn't the case.   The place is run by a family.  The mother is super energetic and is at the counter.  Th daughter makes the flavored breads and muffins.  They are all VERY friendly.  What really makes this place different is that they are super knowledgable about everything in the food, they are very flexible with what they will put together and offering suggestions to meet your diet requirements.  You can really tell that they are passionate about what they do.  They have a huge menu so it can take some time deciding what to get.  The food is super fresh.  The taste is very good too, but there are some things that taste a little bland.  The blandness doesn't bother me personally -- I take it as a sign that the food isn't full of sugar, salt, and fat.  A lot of places that claim to be healthy actually use a bunch of processed foods for flavoring (e.g. veganaise or other sauces), not this place...any seasoning they use are made at the restaurant, a rarity in this day and age.  My experience was so good that I went back the next day and had my brunch there and also picked up a bunch of stuff for my flight back home."}
{"text":"Very delicious. Friendly staff. Coffee was a tad cold meh and eggs too.. but I like the real plates and cutlery,  unique sausage, thick slices of whole wheat bread and especially the GARLIC FRIES. Holy crap,  my girlfriend certainly won't like me on the plane ride back tonight! Delicious though! Recommend!  .. waffle wasn't worth 11 dollars.. but it was worth the try! (Could easily make them at home lol)"}
{"text":"Originally wanted to go to Manpuku but forgot it was closed on Sundays so I came here instead. Despite being in a food court, they lined a few of the tables with red tablecloths and placed mini vases of flowers as the centerpiece. The atmosphere was very cute and the lady behind the cashier was kind and friendly.  I ordered the special Chicken Cesar Wrap and a side of garlic fries ($5.50) which was ready to eat within 5 minutes. The wrap itself was just mediocre with chunks of relatively tough chicken meat and lots of romaine lettuce. The fries were soft, starchy, and quite moist from the garlic oil as opposed to being crispy (which personally isn't my preference). There were also the occasional minced pieces of garlic which were tangy and spicy and left an unpleasant aftertaste.  Overall, I'd give the food a 3, the atmosphere a 4, and the pricing a 4. I wouldn't order the wrap again but I would like to come back on a weekday to try the $5 all day breakfast."}
{"text":"Karine's is a great spot for awesome breakfast food. Lots of options and choices and they are flexible in terms of substitutions. Highly recommend.!"}
{"text":"Looking to kill time after work today before rehearsal, I found myself at Karine's. I had read about this place and was so happy to find another vegan/ vegetarian place to dine at in the downtown core. Unlike most vegetarian places, this place opens early and closes late: 8AM-8PM, Monday-Friday, they're also opened for brunch on weekends, which of course is great for me and 90% of the working public.   Unfortunately, I wasn't too hungry this afternoon and I didn't get to try any of their vegan specialties, such as their vegan french toast, burger, and soy fruit smoothies. But I did try their vegan double chocolate cookie ($1.50) and it was delicious! The owner was awesome, she told me she was baking a new batch of vegan cookies cos she had none left. A fresh, modest sized cookie, straight from the oven, with DOUBLE the chocolate, and VEGAN, it was the perfect afternoon snack before rehearsal and the perfect end to a long work week.   The owner was such a fabulous lady, so high-spirited, kind and friendly as she told me about the vegan items available on her menu and said I must go back for brunch on the weekend. Since my awesome cookie probably didn't do the place much justice, I'll definitely be going back to this place -probably for bunch on the weekend!  One unappealing factor about Karine's is that it's in a food court across from OCAD. So it doesn't have its own dining room, thus, no pretty backdrop for me to enjoy while enjoying a nutritious and delicious vegan meal. Karine's \"booth\" is kind of tacky looking too, for example: there's a random chandelier sitting/ hanging in the front, a pink and green patterned wallpaper in the back, and a red velvet sofa with white edges sitting behind the counter. However, the charismatic owner and the vegan friendly menu make up for where they lack in looks."}
{"text":"I was feeling for a healthy brunch so I came here with a friend a while back. The lady (Karine, I'm assuming) was very friendly and took care with my order. The food I ordered (pancakes with fruits on the side) was nicely prepared and tasted great. One of my vegan favourites in The Grange food court."}
{"text":"This was one of the best meals I've ever had. I was legitimately walking on sunshine afterwards. I hade the Breakfast Supreme: gf pancakes, fried eggs, French fries, and subbed meat for extra fruit along with a spinach lemonade. It was incredible! The woman taking orders (Karine maybe? I'm only making poor assumptions here) was kind and brought a smile to my face. Do your body a favor and eat here!"}
{"text":"Karine's is like Cora's but much much better. It's locally owned and has a lot of heart and pizzaz put into it by the owner Maggie (of the famous local Maggie's breakfast chain) and her daughters. Yes, they serve all day breakfast with added fruits and fixin's on the side. Yes they do waffles, french toast. But the prices are healthier, everything is under $10 and there are plenty of vegetarian/vegan options on the menu. Portions are ample, I've tried a few of their salads now and am only able to make finish half most of the time. Most of their main dishes also come with bread and their bomba sauce which is like a garlicky tomato spread-nice if you plan on warding off vampires.  All in all, it's refreshing to see another cheap and healthy option downtown."}
{"text":"Good price and a lot of food I ordered the Karine Supreme and you had for your money,?Karine and her staff are super friendly and I think it was a cleaver idea to cover those food court tables to make them more cozy."}
{"text":"These people just couldn't seem to get it together this weekend on a Saturday morning.  While the person at the register hand writes the order, and try's to build parts of the order. (plating muffins, etc.)   It was an exercise in frustrating waiting. Before the order was delivered to the chef at the stove, we still weren't waited on.  Leaving me thinking..   \"How long will it take my order, after it's finally been placed?\"  Had to walk out.  They need a better process for taking and processing orders."}
{"text":"I didn't expect such good food from a food court! Pancakes are great. scrambled tofu is delicious. Everything pink on the menu is vegan. Served with proper plates and cutlery, portions are huge, prices are reasonable. Karine and her staff are friendly and amazing. Overall this is a great place for vegan breakfast and I'm surely coming back."}
{"text":"Karine's is located inside the Village by the Grange foodcourt which made it slightly hard to find. Food was mediocre and overpriced for this setting. My meal (crepe and a fruit juice) cost me around $17 - I've had better bang for the buck at other breakfast joints."}
{"text":"After hearing lots of good reviews about this place I decided to give it a try, and it didn't disappoint at all! Karine was extremely friendly and patient. The menu is quite extensive and it has more than enough options for vegan/vegetarian people and meat lovers as well.  Being pescetarian myself I have tried enough tuna melt sandwiches but no others have been like this one. The tomato spread was beautifully paired with the lemon marinated tuna and the melted cheddar cheese. It was truly delightful. Not only the food was good, but the prices were also amazing and affordable. I also tried the pink lemonade which was exquisite and refreshing! At Karine's you get more than what you pay for, it wont dissapoint I promise!"}
{"text":"PROS: -Delicious food, fresh coffee and juices, get your bang for your buck.   -One of my favorite breakfast places despite the dodgy location. I love how Karine personalizes the tables with tablecloths making it a warmer environment to have breakfast.  -The cash lady is super duper friendly.   CONS: -Food is quite oily.   OVERALL: - Great place for breakfast downtown. I prefer having Karines in Toronto and Cora's in Montreal."}
{"text":"This place is consistently awesome for vegan brunch. For $5 I can get more food than I can eat! If I feel like indulging in something a bit fancier I can drop $11 on the vegan supreme and have leftovers for days. This has remained my favourite brunch place for several years. My go-to option is the breakfast special!"}
{"text":"The quantity and price are really worth of it! The food is tasty and the lady behind the cashier is always helpful and so energetic lol"}
{"text":"Karine's was a find on Yelp while visiting Toronto. It's hidden in a good court type of location but it is PURE GOLD! I was a little scared about everything saying vegan and vegetarian on the menu but there is plenty for us meat lovers to choose from. I had a fried egg breakfast with garlic fries and sausage (the bacon is thick and delicious too), and topped it off with some delicious fruit on the side. If ever visiting again, definitely stopping by!"}
{"text":"We came here on a Saturday morning for brunch. Full warning: it's food court style which shares seating with other places. The service was pretty on point and the person taking my order was pretty friendly. I ended up getting what I order from pretty much every breakfast place (a deluxe breakfast). I ended up getting garlic fries and salad as well. The eggs and bacon were okay. The fries weren't what I expected (I.e. it was just chunks of garlic on fries). The sausage wasn't great (hard and chewy). This probably isn't the best place to go if you are looking for a more traditional breakfast. I was still hungry afterwards. This place might be better if you are health conscious, vegetarian or vegan. They have great variety of vegetarian options and do fruit with your breakfast. I'm more of a traditional diner kind of guy so probably wouldn't return."}
{"text":"Stopped here for some yummy vegan breakfast during a long layover in Toronto. Everything was so yummy and the lady who helped us (I'm guessing it was Karine) was the absolute sweetest!! She recommended a few meals, gave us some extra sides so we could have a little of everything and made us a really yummy fresh fruit juice! I'd honestly come back to Toronto just to eat here again! I had the tofu beni & my husband had the vegan platter, both came with potatoes, salads and fresh fruit and were both so good and soooo filling!! A definite must try and if we ever find ourselves in Toronto again, we will most certainly be back!!!"}
{"text":"I'm coming out of temporary Yelp retirement to review this gem of a spot in the super shady OCAD food court.  I've never been someone who'd penalize a restaurant for it's decor, location, or health/safety standards so of course it's location doesn't bother me one bit.  I even celebrate it's glorious existence.   1. I adore how the lady calls me baby.  Not creepy at all.  Enduring even.  2. $5 all day breakfast that comes with all five major food groups: bacon, eggs, garlic fries (so damned good), fruit, and unlimited coffee/tea.  It's a mountain of food.  You can even get salad instead of fries for a reasonably healthy meal but you're going to want to get the garlic fries.  Best deal in the city for breakfast as far as I am concerned.  3. The owner/operator really cares and you can see how they value their customers.  While I was there she gave some dessert to a regular and was like \"no problem, we'll see you next time\".  I love this give and take relationship with store owners!  It isn't nearly common enough in this city.  4. Clearly I enjoyed this place enough that it forced me to come out of Yelp retirement.  Now to re-retire from Yelp again.  See you when I see you."}
{"text":"So charming and sunshiny even on a gray day in the food court. Karine's is the kind of place that I really need on the days I want a hot breakfast with heaps of salad and fruit and a side of affectionately being called \"gorgeous darling babygirl\" by a sassy matriarch figure running the cash.    Come hungry because the plates of simple, fresh, homey food are piled high with satisfying all day breakfast. Add in the funny nicknames she rolls out for each person in line and you have the perfect combination for homesick overstressed not-eating-the-healthiest students like me."}
{"text":"In a food court! Which stands as such a contrast to the cute, legit brunch foods being served here -- I feel like Karine's deserves a proper, independent store, but I guess the location here being near OCAD and the universities is probably crucial for business.  Friend and I came at 8AM... Yes, they open that early and yes, we get up that early for brunch because we are students for life XD  The owner is super warm and will accommodate almost any of the menu options to your preferences (i.e. vegan). Friend ordered a vegetarian supreme, which came with fresh fruit (no exotic fruits today i.e. no dragonfruit, mango, etc), eggs however you want them, pancakes that looked more like french toast, a giant hash brown, cold roasted veggies, and salad. I ordered the vegan version, which comes with tofu + pesto and I asked to replace the carbs (pancake or french toast) with a vegetable tofu scramble and fries for extra fruit. Both dishes were $11.  My only complaint about the food is that most of it was cold, even the roasted veggies and tofu. It was a bit chilly this morning, so I was hoping for some warmer sides.   There are also quite a few meat and fish (smoked salmon) options here too - not just vegetarian and vegan! At Karine's I find that the more you ask to make substitutions the smaller the portion size becomes, i.e. if you ask for extra veggies instead of fries I'm not so sure you receive that \"extra\" component. Therefore, some customers may find that they can barely finish their portion while others like myself was a bit surprised by how small the supreme platter was.  Overall, there are many different menu options, so make sure you know what you want, and don't be afraid to try the many vegan options here! Will be back :)  PS. bring cash!"}
{"text":"I cannot say enough wonderful things about Karine's.  We used their breakfast services for a catering event, and the quality of their customer service and food was top notch.  They are wonderful ladies, tons of personality and very very independent when setting up.  The food was delicious, everyone was extremely happy with the quality of the cooked to order breakfast omelettes and sides.  They also had one of the best vegan breakfast dishes I've ever had.  We will continue to use Karine's in the future, they are really just as fabulous as the reviews show!"}
{"text":"Cheap, fast, gluten-free, meat options, what more can I ask for! Coffee is half decent, free refills. Gluten feee pancakes are sweet and soft regardless of how they look. Fruit is sweet and fresh, they know how to pick em. Don't arrive expecting to be blown away by an experience but don't shy away from the opportunity to walk out with a smile on your face and your belly nice and round. Enjoy!"}
{"text":"I was super excited to try out this place as I'm a vegetarian. I tried the vegan goodness plate. The plating was amazing, service was superb however the food itself was horrible.  The tofu was cold and there were huge pieces of romaine lettuce that could barely be eaten. I had to add ketchup on top of tofu to give it flavour. The fruit was good, the salad was meh and the juices we ordered were warm.  I would opt out for another place. For a nice tofu scramble, I would try Lola's. The tofu there is sautéed with spinach and spices."}
{"text":"Looking for a place for a good breakfast, we made the trek from our HQ to Karines. It is in a food court. The staff is super happy and energetic. The menu is large and, once you figure it out, pretty easy to read.  We had a classic and a Benedict. My wife was a little put off by the vinegar that flavored her eggs, but the sauce was good. The raw garlic on the garlic fries was a little much for us both. My food, with the meats, was tasty. Both meals came with a generous portion of fruit, which was good. I also had the watermelon juice, which I quite enjoyed. I can see why the place is well-liked.  It's definitely worth stopping in, especially if you are vegetarian or vegan, as the selection caters to almost any taste, and parties with mixed dining needs are bound to find something they like."}
{"text":"Saturday Brunch!  Totally a fan, would come back fo'sho. Quality healthy food served by some real cool folks for a great price.  AMBIANCE/SERVICE +Tucked away in the OCAD food court, Karine's is full of vibrancy in an otherwise bare landscape. It is at once homely and kitschy. The counter is crowded with fresh fruit for smoothies, baked goods, multi-coloured cups stacked atop of one another against the backdrop of appealing stock photos. The restaurant's sign hangs from the ceiling and to the left of it is a chandelier which illuminates a spotlight review on this place.  +The women here are spirited, lively and just down-right awesome! Their smiles are infectious and welcoming. Gives you the type of impression that you are well taken care of :)   FOOD ($12) +Egg-white omelette with avocado, fresh fruit, salad, 2 pieces of rye bread and freshly-squeezed grapefruit juice: healthy, delicious, and super affordable"}
{"text":"They were so nice, fast, AND they use real dishes. I got the vegan pancakes (which was only $5!). They had chocolate and cinnamon on them, and there was a nice side of fresh fruit. Did I mention it was only $5?  Heads up: it's inside of a food court and the 109 McCaul address has many different businesses inside, so keep walking around the side and explore, don't turn around disappointed when you see the 109 McCaul Street is also a market!"}
{"text":"Come here for under $10 breakfast with a heaping side of motherly love. Maggie the owner will greet you by name if you come less often than you'd feel for her to rmbr ur name. Her memory is amazing.   Aside from the warm atmosphere the food is good, lots of options: vegan, pancakes, soup, juices.   Many come for the All Day Breakfast option: 2 eggs, salad/garlic fries, 1 meat, toast and fruits. $5 (weekdays) $7.99 (weekends).   Neighbourhood gem."}
{"text":"This place is like a gem you wished you found about a long time ago. You have to try this place. Seriously.  Situated in a somewhat busy foodcourt, you cant miss this place because they have such a \"vibe\" going on.   The portions for their dishes are adequate to large and everything is fresh tasting..and the menu is fairly cheap so you really cant go wrong with anything you order and would enjoy the simplicity of the food prepared.  And the service though... WOW. Such nice people who work there... especially the older cashier lady who was so nice to us and every end of a sentence she would say \"darling\" or \"baby\" to you as an endearment..you'll know when you see her. lol She's awesome.   And they ONLY take cash unfortunately.   I do recommend this place for sure!"}
{"text":"Had been their customer for 5 years already. Staff are very friendly, everything is very good there! Garlic fries are unforgettable. Fruits are very fresh."}
{"text":"Ordered Vegan Tofu Benedict. Came out very cold & did not have hollandaise (had a tomato sauce that was also cold and not very good). Also got garlic fries (They were OK, but I didn't really taste the garlic).   All tables were super dirty and nasty... couldn't find a clean place to sit. I know it's a food court (so not their fault, per se), but it's definitely another negative. I wouldn't go back."}
{"text":"So it's not really vegan. The have vegan food. But they make the vegan food in the same area they prepare bacon, eggs and salmon etc. I asked and observed the small cooking area. This may not bother some people, but I can't eat there. I could see the tiny space they make the food in and there is just no way to keep the bacon from the non vegan food. It's too busy and too small. I don't know if the food is good. But this place comes up as a vegan restaurant and it's not. It has vegan options but no way to assure the food is kept separate from what I observed. I wasted my tiny lunch hour to walk all the way here and not be able to eat."}
{"text":"Pros: Friendly staff Amazing cx service  Timely Healthy  Price  Food Vegetarian friendly  Cons: Organization   Summary: This is an amazing place to grab breakfast or a late lunch. The food is always fresh and they always insist you get your vitamin c. The organization and set up of their food venue is a bit off putting to someone who likes predictability. However, the food is amazing and always looks good. You tell them what you're craving and they will make it for you!   Also the staff are so lovely, don't be put off by their very friendly demeanour. That's the charm of Karine's; think of it like your grandmas cooking where they want you to eat healthy and good portions. And without breaking the budget too much!   I was just going to get a quick peameal egg and cheese English breakfast sandwich to go today....  Then the main woman I forget the name of (is it Karine? Lol), insisted to add fruit for a couple bucks more. It doesn't look filling but then after eating I'm so happy and feel healthy even though it tastes so good!!!!! Definitely worth a try"}
{"text":"Just come here.  Just kidding, but in all seriousness, this place is a hidden gem. It really is. Located inside The Grange, right by Manpuku.  I can't say much about the decor but the atmosphere of Karine's little counter space is up beat and lively. The customer service here is impeccable. Every restaurant should learn from them, this is how you keep your customers coming back, son!   Now onto the food, let me take the time to say that everything on their menu looks and sounds delicious. It was hard for my friend and I to choose but she ended up ordering the waffles and I got the Karine's Supreme. Both dishes were a little well under $12, which was a great thing for the both of our wallets.  After waiting for a bit, our food emerges! The lovely lady behind the counter calls for me, \"Amy Darling, Amy Darling, your food is ready!\"and I dash towards the counter to get my food. I was amazed at how much food I got, it was enormous! If you were wondering, the Karine's Supreme came with a choice of sausage or smoked salmon, eggs of your choice, garlic fries, toast and french toast! That's a lot of food at such a great price.  Overall, if you're around the area hit this place up and you won't regret it and all of you lucky OCAD students, I'm very jealous right now! This place has definitely become one of my favourite brunch spots to hit up in the downtown T."}
{"text":"We decided to try Karine's on a recommendation from a friend.   We arrived on a Sunday morning and had some difficulty finding the place.  Tucked away inside an unassuming little shopping mall Karine's does seem easy to miss.    When we did finally find it, I immediately knew it would be worth the hype.  On a Sunday when every single establishment inside the mall is closed, Karine's has a lineup of regulars.    Karine's does a great job minimizing the depressing sterile environment of a typical food court.  The counter space  is all but consumed by fresh fruit and colorful menu options.  The food court tables are covered in red table cloths while a stereo is pumping out Latin American tunes.  A very friendly lady at the registrar asks what we have in mind and makes some recommendation.  They have a ton of vegan options and fresh squeezed juice.  We get a couple of vegan dishes and fresh watermelon juice.  The portions are impressive and everything is fresh and flavorful.    My dish was called \"Vegan Goodness\".  It contained fresh vegetables nuts and tofu smothered in a rich, flavorful sauce. For a quick and healthy meal, it exceeded my expectations.  At Karine's you will not pay typical food court prices.  We spent over $50 for two people.  However it does not feel like a typical food court experience either.  Definitely coming back."}
{"text":"I really enjoy Karine's it's the best find in food court to actually find something healthy and fresh. I had a cheese and fruit plate, and it was delicious and the service is amazing."}
{"text":"It's hard to say what's better, the food or Karine... probably Karine. She's one of the coolest humans. There are so many options you have to take a few minutes to decide what you want, or Karine will just suggest something awesome for you! I got the supreme which is so big it's like 2 meals and I also got the watermelon, pineapple and orange juice. It's priced really well so I don't feel like I can only eat here as a treat once in a while.  I love eating here, I go out of my way to grab lunch here - it's so delicious and Karine just brightens up my day :)"}
{"text":"Karine's is probably the most efficient brunch place I've been too! There was a line during the weekend, but we were able to get our food shortly after giving our order!  It's located in a food court, but there's a courtyard where you can sit in the sun.   The menu has a large selection of items, and you have options such as toast or French toast, fries or salad, vegetarian, vegan or meat. There're enough options to satisfy your pickiest friends. There's also fresh juice to choose from.   I got Karine's supreme with meat (bacon and sausage). It's pretty much the \"want to eat everything\" option. The food is pretty good and the portion is definitely large enough!"}
{"text":"Little cheap treasure hidden in unsuspecting food court! Makes a great quick breakfast or alternative to expensive snacks at the AGO cafe (when you've finally had your fill of flourless chocolate cake). They are open some nights until 6.  Karine's is a cute and lively little counter with some great personalities working there. The food is good for the price point, satisfying but not memorable hours later. The sausage is better  than average- not processed links but slices of real sausage. The garlic fries are great if you love your garlic. I really liked the sides of fruit and endless coffee. You can take your plate to the sunnier side of the food court and it feels more like a little market.  CASH ONLY"}
{"text":"4/5 stars. Why? Because it's OK food and great prices.  I come here at least once a month and usually get the $5 breakfast cheese/egg wrap that comes with salad and fruits and also get the $1 coffee. The coffee is great and unlimited. The $5 breakfast is a great way to get the day started.  I've also ordered the $5 2 eggs/toast option, but often find the eggs are overcooked. Garlic fries are awesome though.  Great place to grab a quick bite. The table clothes make it feel less like a food court."}
{"text":"Somehow this food court gem manages to exceed it's environment, and has earned a well deserved prize from me of being the only food court restaurant I would ever consider eating at, going to again, and tell my friends about.  If the woman who calls me sweety and whips through the mass of customers with amusing energy is Karine, then Karine is a pretty special lady. It's always a pleasure to be a customer at this place, and I always feel personally attended to.   This is a magnificent feat considering, as I said, that this is a food court restaurant.  Plates are big, with lots of fresh fruit, and really healthy conscious. Good food, well priced."}
{"text":"Nice little vegetarian/vegan place tucked away in a hidden food court that service OCAD. I've never been or heard of this little gem am I glad I did.   9$ gets you two eggs any way. A healthy portion of salad. A tofu treat and some toast. Good value for great food. My only disappointment was the toast. It was sliced too thinly and when butter was added by the girls it became quite moist and floppy.   The ladies who run this place are marvellous and are super helpful and friendly to say the least. Will definitely be back to try something else.   Two thumbs up! Well done."}
{"text":"I love this place. I go there for brunch on Sunday's. It's a little quirky being in a food court but the food is great, and they are very quick and friendly. Lots of healthy vegetarian options as well as meat for those who want it."}
{"text":"The greatest attraction to this food court option is the high energy and friendly owner manning the front. She greats everyone with a smile and peppers every sentence with endearments. It was my first time there, but she makes you feel welcomed even in an open food court setting. They take orders fast and you can watch them whip around the tiny space to throw together a healthy fresh lunch for you.  I had the special that was available that day, which consisted of hummus, roasted veggies, fresh salad, carrot slaw, fruit medley and a slice of warm bread. It seemed like a mix of a bit of everything from around the kitchen but together it made a satisfying and healthy lunch. A great option for lunch when you want something to keep you energised for the rest of the day."}
{"text":"Went during lunchhour but for light eat/soup/finger food. Being a vegan, I needed sometime to find out what options I have. I was rushed and almost forced into a place of cold salad  + cold pita bread for $5. The staff were very impatient and hurried."}
{"text":"Fresh, cheap, and vibrant.   Hidden gem tucked away in the food court at Village by the Grange. Came here for breakfast which is what they're known for, but they have lunch and dinner menu as well with plenty of vegetarian and vegan options. The first thing you'll notice is how vibrant all the colours are - retro decor, rows of pineapples, colored bowls and plates.  The menu is massive. Breakfast items start at $5 and you get a ton of food. The place really has a colorful personality too. The owner lady was so lovely and so full of energy. Everything was made fresh with the freshest ingredients. The plates are just so beautiful to look at and so delicious at the same time. Highly recommend the garlic fries. Just make sure you have some gum to chew on afterwards."}
{"text":"I paid nearly  $14 for breakfast that was very underwhelming, sure I had orange juice as well but 14 bucks? It came with 2 eggs, a small portion of home fries, some not so appealing looking sausages, toast and fruit. In my opinion the portions are small and the price not justified."}
{"text":"After finally getting fed up with the ever decreasing quality of the breakfasts at the Cora's on Blue Jays Way (see my profile for that review!), my wife and I took to Yelp on the hunt for an alternative. Karine's it was. Thus, this review is from the perspective of comparison, which should be fine as it seems a lot of people come here looking for a Cora's alternative.  1) Price: Your standard breakfast combo is $5. Two Fried Eggs, Bacon, Sausage, Salad or Tomatoes, Toast, Fruits, Regular or Garlic Fries and Free Unlimited Coffee or Tea. The same thing at Cora's is about $10.  2) Quality: Fresh, delicious, and good portions. My wife and I had the breakfast combo while our friend had waffles with berries, which looked absolutely amazing (and she assured us it tasted amazing too)  3) Atmosphere: Our main concern in the reviews was the food court location of course, but you will be surprised at how little this matters once you get there. Although they are in a food court, they went all out cutely decorating their booth, and the fact that their staff are so friendly helps too. We were here on a quiet Sunday morning, and it was a really serene setting with the sun shining in as we ate at the tables. Food court is no problem at all.  We'll definitely be coming back here soon as our new go-to breakfast place!"}
{"text":"So i could only pay with debit that day and I was told my order had to exceed 10$ to be debited, I preferred that than no food at all so I ordered the 8 dollar breakfast and had some tea.   The lady at the counter was incredibly nice, and I'm giving Karine's 3 stars instead of 2 simply because of her. Like not just waitress nice, like mother nice. In fact, I wish my mother was as nice as her.   It came with sausage, an assortment of fruit some toast, eggs and garlic fries. The garlic fries are definitely overhyped, the fries themselves aren't very good, thin, not greasy but also not filling or crisp, the garlic part of it is literally tiny pieces of diced garlic that are placed haphazardly in the fries, biting into them is not pleasant, I thought they'd be like when you bake garlic in the oven for a long time, soft, sweet and with a nice garlic flavor,instead they were just lightly fried or something, they were bitter and my breath smelled like garlic for hours.   The sausage was good, nice flavor though there's a disappointing amount of it, I think i got like 4 slices. The eggs which I asked for scrambled weren't the soft fluffy scrambled eggs I'm used to but rather a thin pancake like piece of egg with whites and yolks clearly seperate. It was crisp and that was good, though I would've liked to get fluffy \"scrambled\" eggs cause that's what I ordered.  The toast wasn't actually toasted, it wasn't even really warm, but it had butter melted into it so that was satisfying.   The fruit was delicious fresh and sweet.  Overall kind of average for what you pay, I would like to try the 5 dollar breakfast though as I'm sure that it's definitely worth the money.   Tl;dr not worth it at 10 dollars maybe worth it at 5, will update and edit, Love the lady at the front she's a darling"}
{"text":"Delicious breakfasts, lunches and treats are always served with a smile. Packed with a side of greens, my weekly BLT indulgence is the stuff of dreams, and served on gluten-free bread, makes it even better. The staff is friendly, the food is delicious. This is the best place in Village by the Grange."}
{"text":"Karine's is one of the few eateries on hospital row where you can get an authentic gluten free meal. The customer service by Karine's Mom is exceptional. In these days when customer service is usually lacking, Karine's Mom seems genuinely happy for your business. Karine's can manage to be everything to everyone, which I find is lacking among gluten free restaurants. What I mean is : if you want a delicious healthy meal, Karine's can make it. If you want gluten free, Karine's can make it. If you want a yummy, gluten free and calorie heavy meal, Karine's can make that too. There are now also sinfully good deserts on display. I usually get the gluten free grilled cheese and it is amazingly good and fresh. Please give Karine's a try. You won't be disappointed."}
{"text":"I love this place!   They have a HUGEEEE menu, it'll take some time to go through it and choose what you want. But don't worry, the owner here is adorable and insanely nice!   Came here twice and got: - Hummus and roasted veg special (take out): It came with roasted broccoli, hummus, carrot spread, crispy pita chips, side salad, and fruit. Everything was so fresh! The owner made the hummus fresh because they ran out - it was perfect. That minced carrot-garlic spread is SO GOOD. And with the pita chips... YAS pls. The salad dressing they have is also amazing - light mustardy vinegarette. Great value for the freshness that you're getting! - Breakfast parfait: It was good but I would probably skip this next time; it's not really worth the price. It's just granola, a few berries, and some banana on top of yogurt. Something you could definitely make at home easily yourself for much less. Again, everything is fresh! - Mixed juice: I think it was pineapple, orange, and something juice mixed together! This was da bombbbb. Freshly squeezed juices topped with MORE FRUIT. Worth it.   I love how fresh fruit is added to every dish that they offer. Perfect little dessert to your meal!   Definitely coming back for the amazing owner and fresh food!"}
{"text":"Let me tell you all about this AMAZING place called Karine's. The Supreme Breakfast and Parfait Bowl CHANGED my life. I've never been to breakfast place where the people were very warm and friendly and the food was great as well. This was one of the highlights of my visit to Toronto! I will be back."}
{"text":"I rarely eat in food courts, but I make an exception for Karine's. The location is great, across the street from the AGO, close to Queen West, close to the University Ave. hospitals (if you work there).   I have been here a couple times now, around brunch/lunch time. The first time I had a vegetarian omelette that was alright, but nothing earth-shattering. More recently, I had their $5 breakfast special (available every day of the week) and was really impressed. I got: scrambled eggs, whole grain toast, side salad (you can sub bacon/sausage if you feel meat-y), garlic fries, and fresh fruit + tea. Oh, and the $5 includes tax. That kind of value can't really be beat! At most cafes, just a latte and a cookie would cost more than that! The food was simple and good, although nothing I couldn't whip up myself at home. But the garlic fries bump this place up to 4 stars for me. So delicious. There are actual tiny, chopped pieces of garlic (just be sure to bring mints).   Other pros: - Even on a busy weekend, the owner is cheerful and unfrazzled. And yes, she calls you \"baby\".  - They use real dishes, mugs and cutlery so that even though you're eating in a food court, there isn't a ton of needless waste.  - You can help yourself to ice water (it's in a big jug on the counter, with some berries for some fruity flavour)."}
{"text":"I stumbled upon Karine's when I was seeking something fast & fabulous before the Picasso exhibit at the AGO and it was exactly what I needed: fresh, healthy and friendly. Who knew food court food could be this good?"}
{"text":"Service and food were both spectacular.  Not sure if the lady who took my order was Karine. She was upbeat and patiently helped me out with my choices, despite the line up behind me.  Food was absoluetly delicious; I ordered the vehan tofu plate with crushed pesto and was utterly surprised at the generous portion. My plate and fresh orange juice cost $16.95 including tax! This is located in the food court so tip is optional  (they totally deserve it!) ."}
{"text":"Nothing has changed from the day they opened. A+ service and the food is great. The fries are a little toasty...as in almost burnt but somehow they work! Lol. Love it."}
{"text":"Huge plate of delicious tofu scramble, salad and fruit! Just what I was looking for my first morning in Toronto! Good coffee too! Only drawback is the food court seating environment!"}
{"text":"Let's be clear, Karine's does serve meat.  Therefore, this is not a vegan kitchen by any means. Aside from that blemish, their menu is decently priced and has lots of healthy options to choose from.  Karine's is located in a small food court within the Grange Gallery, just opposite the Art Gallery of Ontario (AGO) off Dundas.   I dropped in here for a Nuit Blanche special - fresh vegetable wraps, bits of fruit and fries (regular or garlic) for only $5.  The wraps were well-made, with a fibre spread akin to a bruschetta mixture.  The fries were freshly sliced and fried, with the added bonus of chopped sauteed garlic.  The two slices of pineapple and the handful raspberries were a great finish to the meal. My sister had to help me with the food and thought that what I got was a steal! Too bad the prices aren't normally this good!  Will definitely come back for more, as Karine's a great place to get a good meal for under $10 where your food will not be compromised by heavy grease and reused ingredients."}
{"text":"Tucked away in a food court across from OCAD, Karine's is truly a magical find.   The items on the menu were priced at a relatively fair price point given the amount of food that they serve. I paid $11.70(w. Tax) for the vegan burger plate, which came with choice of two salad/fries/soup. I got the salad and soup, which were both incredible and full of flavour! The salad had a mustard vinaigrette, and came with side of some fresh fruit, and the soup was a hearty and healthy lentil stew. The vegan burger itself seemed like a fried potato patty, and came with a side of carrot slaw, both of which were delicious. Portions were plentiful and I finished my plate without feeling weighted down afterward. The ladies behind the counter, as I'm sure many others have experienced, were amazing!  Super friendly and warm smiles all around. Would definitely come back again to try some of their other items! Big fan of Karine's!"}
{"text":"Excellent food. Perfect for brunch. I came here because I heard good things, and was looking to get a few vegan platters for an event I was hosting. The brunch was amazingly delicious. Come even if you're not vegan. They have options for vegetarians and non-vegetarians as well.  The platters were excellent. My vegan, vegetarian, and non-vegetarian friends loved every last bit. And it all disappeared very quickly.  I will definitely be returning :)"}
{"text":"Now that I've been around the block a few times, I have to say that Karine's truly is a gem! You won't find this quality of food or style of presentation in any other food court, that's for sure. Exceptional customer service and great value for what's on offer. You won't regret it!"}
{"text":"High expectations really do set you up for a fall.  Even worse, I decided to wait until my birthday to visit here.  I spent ages reading through the extensive menu online, plotting and planning.  I went to the gym to earn my waffle(well, maybe 1/4 of it) and went in excited.  I suppose it couldn't really live up to the hype.  I wanted a waffle with ice-cream but they had none.  I settled on mixed berries instead.   Eat in or out?  I wanted in.  It's cheaper and you get plates.  I also ordered coffee which is self serve with the bonus of free refills.  Total came to $10 which was more than I expected.  I got plenty of time to ponder the arithmetic as I waited and waited.  The menu said my waffle was $8 and coffee was $1 (tax included).  I'm no mathlympian but that's $9 the way I see it.  Eventually the cause was revealed when I was handed a to-go polystyrene container.  She'd messed up the order and forgotten I wanted it there.   And charged me extra.  The girl cooking (her daughter) scooped my waffle and fruit back out and onto a plate.  The food?  It looked good, despite the extra travel between containers.  Couple of slices of pineapple and melon.  Few fresh strawberries.  Sadly the rest of the fruit was mushy and preserved in syrup.  The waffle was OK but quite soggy and not especially tasty.  It was lukewarm.  The coffee was hot but weak.   The worst thing was the feeling afterwards-knowing that what I'd just eaten really wasn't worth the calories.  A waste of a treat to myself.  The owner herself was quite friendly and works very hard-no wonder she's so slim.  But, average and lukewarm food, mixed up instructions and then overcharged?  I think my diet will survive the temptation of Karine's."}
{"text":"Sunday is my Fran's breakfast day of the week, one I look very much forward to. So when I woke up hungover to monsoon-like proportions of rain this past sunday, I opted to go the shorter route and grab breakfast at Karines in the Grange.  This was my second breakfast here and I was hoping I just got a bad batch the first time around. Boy was I wrong. For over $10, the King Tut breakfast gets you bacon, sausauge, \"pancakes\", fruit and \"eggs\". I say \"pancakes\" because that is what they are called on the menu, and that is what they resemble from afar. In reality they are not the light and fluffy, delicious treat you're used to - they're flat, solid things that taste like cardboard and appear to be uncooked and doughy on the inside. The \"eggs\" which I had \"scrambled\" were simply fried and stuck together in a flattened patty by a thick layer of grease. Everything on my plate, including the fresh fruit, was covered in it. The only decent thing was the home fries, but after a few mouthfuls of each I was so turned off by the grease and general lack of taste, that I threw out over half of the dish.  *Disclaimer - I gave myself a day to write this review as yesterday, still hungover with $10 dollars less in my pocket, it would have been much more scathing. I also found out that missing my sunday breakfast makes sunday a miserable day. Oh Fran's, how I will love you all the more next week!"}
{"text":"I love Karine's! I wish I would have found out about this place sooner! $5 breakfast specials and $1 extra for unlimited coffee is perfect! The food is made VERY quickly and is satisfying. I would have liked the vegan option of fresh toast to be on the $5 menu, but the vegan pancakes were pretty tasty. I got a vegan sticky bun for later and it was fantastic! The only downside of Karine's is that it's in a large cafeteria. If you know that ahead of time, you won't be disappointed. I can't wait for my next trip to Toronto so I can come here again!"}
{"text":"Excellent fresh food and amazing customer service! Karine really treats you like family!"}
{"text":"Oh my god.  What a discovery.  Can you imagine finding a place to eat in a food court that transports you out of that food court into the delicious world of great food, amazing service and dare I say cheap prices?    First off -- if you are going to the AGO to check things out -- plan to have breakfast/brunch or lunch here before or after.   You will not be disappointed.    We were visiting, happended upon it thanks to yelp and it was so good for Friday breakfast we were back on Sunday.  (A nice addition is that Karine and her mom who is to die for friendly put out table cloths on the Sunday for brunch.  You feel like you are in their space with their intimate service, the great music and the emptiless cup of coffee or tea.  And the food is sublime:  I had french toast on first day -- delcious and hit the spot.  My vegetarian partner had the tofu scramble which was perfect.    The raspberry muffins were perfect.   We went back on the Sunday and I had the $10 vegetarian breakfast which was plentiful -- tons of food, all home made including the delicious jam to go with the organic bread toast.  And the sausages are real...from a butcher and have taste, spice and perfect accompanaiement.  Very vegan friendly.  And the vegan chocolate cookies were ideal for our train ride home.  And when we returned on the Sunday -- Karine's mom even remembered our names from 2 days before.  We kissed when we left! We will be back. Again and again."}
{"text":"Amazing service and good food! Great prices and if you are vegan or vegetarian you don't have to worry about what's on your plate, especially if you are allergic!"}
{"text":"About three weeks ago on a short trip to Toronto my partner and I stopped by Karine's to enjoy a veggie breakfast. We picked it because of the positive reviews and its downtown location, as it was from a walkable distance from our hotel. We got vegan waffles; mine strawberries, his peanut butter (we weren't sure which flavours to take and they suggested those, so we said okay). I must say it was quite good, though the peanut butter waffles had a bit too much peanut butter. But overall we were pleased. The girl at the counter was very nice and dynamic. It's a place I'd recommend and go back to."}
{"text":"$14.5o did this worthless beans and lettuce and she didn't return me my 0.50cent ....))) You can judge yourself does it worth it or not?! She is tricky, the price was $11 and i asked her egg benedicts and she added but in my order already had eggs and i asked her cheese but changed mine to delete but she didn't ... )"}
{"text":"I've been coming for years and it's always been fresh amazing vegetarian food.  The $5 breakfast can't be beat! A side of fresh fruit really sets this place apart. Watermelon, blueberries, fackfruit, pineapple - each time I visit it's always a nice surprise. The smoothies are also simple and delicious."}
{"text":"The workers here are always super pleasant! I love when the woman owner calls me babe lol it's just a nice vibe there. They have $5 breakfast which is super worth it. I usually get the garlic fries (smell amazing and are strangely addictive) scrambled eggs, sausage (THE BEST) and fruit. As long as you don't get a take out box, the total is exactly $5. Such a good deal. This place is actually in a food court, but don't let that turn you off. They have their own tables and it isn't too packed either. It's right at my school -- so students are always around. I haven't branched out much with other item choices but I definitely want to keep eating at Karine's after I graduate. Cheap breakfast that has very good presentation and is more than filling. There are a lot of healthy and vegan choices as well."}
{"text":"The service was impeccable! The food was delicious ! The place is just a little hard to find, it's in a mini shopping mall !"}
{"text":"What a place! As many reviewers mentioned, Karine's is located in a food court near OCAD. However it doesn't feel like a food court at all. The three tables in front have table cloths, and it is so uniquely decorated that it just seems like it's own little space. The food wasn't crazy expensive, and the portions were a good size (not excessive but filling for sure). The main dish that most ppl order is called Karine's special (or something similar) and it comes with two eggs, bacon, sausage, toast, 2 pancakes, the option of fruit, garlic fries or home fries, and a couple slices of fruit. I ordered mine with a waffle substitute (gfree of course), and fruit on the side. I tried my husbands garlic fries and they were amazing! Who knew some garlic sprinkled over fries could make such awesomeness!  The gfree waffle was so so good, especially with the berries on top. It was basically a berry compote and was delish. The sausage that comes with the breakfast isn't your typical breakfast sausage - it was thick slices that were super crispy and flavourful. Really enjoyed that part!  Overall a great meal. There was an upcharge of about $5 for gluten free which seemed excessive given the fact that I didn't get toast, and I was only given half a waffle, but it was a really good breakfast and an enjoyable experience."}
{"text":"Great menu, value and vibe, even if it's in a food court.  Amazing GF and vegan options amongst the standard hangover breakfast/brunch stuff.  Check out the desserts you can buy by the coffee stand that aren't listed on overhead menu, some amazing small treats in that englassed area."}
{"text":"Very nice people but it isn't cheap. Nice presentation but the breakfast does not include coffee. The horrible drip coffee was 2 dollars. So in the end I spent 15 dollars plus tip eating in a food court. Nope."}
{"text":"Reasonably priced. Large portions. Beautiful customer service!   The lady who served me is super sweet, calls you \"bébé\" and they have a TON of options - gluten free, vegan, dairy-free and also meat options! Literally everything you can think of. Will definitely be coming back here :)"}
{"text":"The boy and I were looking for a place close to the Art Gallery that we could get a cheap, quick and filling breakfast, and I had read a lot of great reviews about Karine's so we decided to try and track it down. We weren't sure if we were in the right place (it's in a food court inside a building, not right on the street), until we turned the corner and saw a pink, bright place bustling with people and cooking smells (it was the only place open at the time - around 10am -  so pretty hard to miss)  There are A LOT OF choices - there is a main menu with \"fancier\" choices (I was really tempted by the smoked salmon eggs benedict, although I didn't end up ordering it) but there is a list of 10 basic 'specials' to choose from and for ease we decided to go with one of those. The boy and I ordered the 1st option, which is a basic breakfast plate with a variety of choices - toast, meat (choice of sausage, bacon or ham), one egg, garlic fries and a pile of sliced fruit.   The portions were quite generous, and the grand total (including coffee for me) was $11. Seriously. And it's made right in front of you - you can see grandma cooking stuff up right behind the counter. Honestly I wasn't a fan of the garlic fries, mainly because there was just too much garlic for me. The fries are basically just regular fries with a pile of chopped garlic on top and I was expecting more. If the garlic were more finely chopped and spread throughout I probably would have enjoyed the flavour more. And honestly, there was nothing AMAZING about the whole meal - it was your basic breakfast plate you can get at lots of mom-and-pop places - but the amount of food for the price is awesome and you really feel like it's made with love (that being said, the sausage was a highlight for me though).   You get this feeling of love throughout the whole experience. your food comes on actual plates with real cutlery (no plastic or styrofoam), and the tables immediately in front are covered with tablecloths and vases of flowers - nice, unique touches that elevate the experience from your average food court.  What a great hidden gem - a small business with a lot of heart (and great prices) in the middle of a big city."}
{"text":"Holy cow. Delectable.  $11 for the supreme. Pancakes/french toast, eggs, bacon, sausage, fries/toast, fruit.  You will probably not finish all of it. So bring your appetite. I am beyond impressed.  $4 fresh fruit drinks. Worth it. Freshly squeezed orange.   Unlimited coffee and tea.  The turnover here is quick. They legit have your food done 3 minutes after you ordered. I can't get over how good it was.  I'm still stuffed."}
{"text":"I'm always a big fan of local businesses and this one in particular shines through from a value standpoint as well as the experience.  I came here based on other reviews and I would have to agree that it's a great choice if you are looking for a reasonably priced vegetarian/vegan option.  I ordered the burger plate for $10 bucks with a side order of garlic fries and loved it.  It was filling and the plate had a good mix of different fruits.  I would definitely go back to try their other options.  But putting the food aside, what I am drawn to is the wonderful service I received from a fast food stall.  I was greeted by the mother (not the grandma or the young daughter) with such a heartfelt \"baby\" that you feel like you are at home.  It's definitely a nice touch and tugged at my heartstrings."}
{"text":"A positively delightful, delicious use of $5. Fresh,  cheap food and extremely service.  I'll back often."}
{"text":"Many many years ago, the Village on the Grange was home to a most unusual restaurant. It was called Ginsberg and Wong; a family spot that offered Jewish-style deli and Jewish-style Chinese food on different sides of the same menu. The concept was unique, and I imagine if it had been located in Thornhill it would have done tremendous business, especially on Christmas eve. Sadly, it was not to be.   Some might say that the spirit of Ginsberg and Wong lives on through the eclectic offerings in the food court that now dominates the VoG. If your tastes, like Carmen Sandiego, run across the globe, chances are you'll find something here you haven't tried before. Most places are indy outposts; a few mini-chains, and of course, the odd multi-national corporation (McFlurries rock, don't judge).   One of the best options is Karines, whiich may or may not have more than one location, and for $5 serves one of the best breakfasts in the city. They also serve a fine selection of vegan items, fresh salads and hearty soups...but I can make salad or soup when I get home. I rarely have time for a full breakfast spread.   And what a spread it is. Start with coffee. Seriously. Because it's good, and unlike the aforementioned multinational corporation, they offer free refills. I'm sure it's awesome for the local OCAD kids, but also helps the grizzled adults. It's regularly hot and fresh, if a lighter roast than I'd brew myself.   The plate itself is a thing of beauty.   Eggs any way you like, but generally a bit overcooked unless you specify (I like my scrambled eggs on the runny side).   Bacon is brunt to hell as requested, or opt for sausage grilled to crispy-skinned perfection and sliced on the bias.   Did you order a side of fruit or a glass of OJ? No? Good. You get a trip through the produce section with your order, anyway. We're talking full on fruit salad, all ripe and bursting with healthy goodness-less a garnish than a dessert in and of itself, occasionally featuring exotics like star fruit or dragon fruit. It's the best thing this side of Cora's, for less than half the price of their breakfast place.   To balance all those anti-oxidants, one needs some deep-fried free radicals, and Karine's is happy to oblige. Enter properly francais skinny, amber frites in mass quantities, perfect for spearing into over-easy egg yolk, or dousing in one of their selection of hot sauces (this alone is worth a star), or, if you must, in ketchup.   If you're feeling dangerous, you can order them tossed with raw garlic and chopped parsley, which makes them fierce enough to forgo the hot sauce (and probably means you'll be Netflix-and-chilling alone for the evening).   If you're a breakfast fiend, you should go to Karine's. If not, find some other excuse and go anyway. Vive la difference."}
{"text":"I came in here with high expectations, but I should have known better since it's located in a ghetto-ass food court. Christ, even the mall has a ghetto name... ''Village By the Grange''.   Anyway, I ordered the Eggs Florentine.  My egg didn't look regular poached eggs. Most of the egg whites were lost in the boiling process. On top of that, it was DROWNED in this nasty ass hollandaise sauce. Too much vinegar in it. SO gross. I can honestly say it was -the worst- hollandaise sauce I have ever tried. The spinach wasn't the usual spinach you'd get. It was some gross shit that was not fresh as you can see it was wilted and browning. And to continue this tragic plate of failure, it wasn't even on english muffins. it was on buttered toast. Wtf kinda eggs benedict dish is this? Clearly a monstrous clone that got drugged up in the process. Overall, the 2 piece of pineapple and mango saved it. If it weren't for those sweet yellow guys, this plate would be a fail. What am I saying.. a dish that had to be saved from two pieces of fruit is already a fail. Next time I'll try their salads. I don't think eggs is their specialty."}
{"text":"Great place!  I would give it 4 stars if it were not located inside of a food court. Food court dining is ghetto.   Food court aside, the food was awesome. The menu is about 80% breakfast food. I love that I can get salad with fruit salad as my side items, instead of the usual beige-food-maximum sides. (But note, you can definitely get fries/pototoes/bread on the side too)  I tried the Eggs Benny with peameal bacon served on an English muffin. They have a tasty vegan tomato garlic sauce that can be substituted for Hollondaise, which was pretty damn good. Side salad and fruit salad comes with. Fresh pineapple, watermelon and strawberries!  Food was cooked up and prepared right before my eyes and ready in 5 minutes or so.  They should open up a location somewhere outside of the Grange!"}
{"text":"Such a lovely eating experience! The family owned and run vegan/vegetarian/gluten free restaurant is the best breakfast I've had in a while. They make you feel like part of the family - so warm and welcoming! The food is to die for!! Fresh ingredients, not greasy, super nutritious, and filling! I've fallen in love."}
{"text":"If you are visiting and want something amazing and uniquely Toronto, this is the plane. I absolutely adore this place! The food is exquisite and the staff are so friendly... I can't recommend this vegan, vegetarian, and gluten free (if you want it) option enough. We came for breakfast, but you can do lunch too! One thing though is finding parking, be sure to take that into account."}
{"text":"This place offers great food at great prices, with tons of vegetarian, vegan & gluten free options. The service is what makes the place so special - the women working there are always so kind and cheerful, and the way they decorate and make their little corner of The Grange food court their own adds charm and character. I love coming on Sunday's for breakfast/brunch!"}
{"text":"Don't let the odd food court location in the Grange fool you - this place is awesome. It serves an all day breakfast and some wonderful tasty vegan dishes. My wife and I ordered the Vegan Goodness and the Mix and Match plate. When we picked the food, we were blown away by the size and quality - it is also served on real glass plates with metal cutlery. Food itself was great - my Mix and Match plate had a lentil potatoes patty, mushroom salad, sliced tofu with a onion topping, grilled veggies and a garlic and carrot slaw plus a bowl of lentil soup. Lots of flavour and very filling. We were stuffed and we will definitely be coming back to try the rest."}
{"text":"CASH ONLY people! I don't usually cary cash, and luckily I had 10 bucks and a subway token, yes a subway token, which the cashier voluntarily took to cover my 12.43$ supreme breakfast so that I wouldn't have to go to an ATM. The service here is good and the food was ready shockingly fast given that it doesn't have the fast food taste or presentation.   The portions are not very big so if you're super hungry for a hearty breakfast maybe order two things. The prices are reasonable, and I'd say that the cost/portion size value is better than most vegan/veg breakfast joints.   It's close to U of T campus,  and certainly beats the campus' \"vegan/veg\" options (if you can call a boring overpriced salad a good vegan/veg option....).   Note that this place is in the Grange foodcourt across from the art gallery!   Definitely worth a try!"}
{"text":"A must hidden gem to visit. After trying many brunch places around the downtown core. Karine's does not fail to satisfy you without the need of lining up to be seated. This brunch spot has many options catering toward vegeterians, pescatarians, and/or vegans. I opt'ed for the eggs benedict and was not dissappointed. The dish was served hot and fresh. With an A+ hollandaise sauce, and crispy garlic fries... This brunch spot is no joke. (If momma upsells you a fresh juice... take it.)"}
{"text":"I wasn't expecting this place to be in a food court. It was delicious and the people were so awesome! The lady (owner?) calls everyone 'baby love' and things of the sort, and once she gets your name she doesn't forget it. It's such a welcoming place.   I got the full vegan breakfast and it was great, but I don't usually enjoy mixing my breakfast foods with salad and lunchtime stuffs. Next time I'll just get the 5 dollar vegan breakfast instead. Portions are huge! I've never seen a plate that big!"}
{"text":"For over a year I've been walking past this place wondering if I should grab a bite.  I'm so glad I finally sat down to enjoy their creation. It's so good. And the lady who served me treated me very well. She basically turns into your grandmother, which would explain the huge portion and all the fruit.  My meal was ready pretty fast too, and as I mentioned, it was huge. I wish I brought someone with me to share it (the banana nut crepes $11). The flavour is rich and the fruit is fresh, I could tell because they just got a shipment in of produce. I just can't get over the busting flavours and how they are all so good together. If you're considering this place, consider no more; just go there. They will treat you right."}
{"text":"This is the cutest little place! It is also the perfect example of a good experience heavily depending on great service. The food was very normal and pretty cheap. The overall atmosphere and theming was really nice. However, the staff was super friendly, nice and very very welcoming. No complaints!  Be mindful that they take cash only!"}
{"text":"Love this gem, best place to grab some some delicious vegan food at a low fare. Everything on the menu's amazing, there's a ton of options. Try their banana bread! The best part is the service, they're so friendly and helpful. Will definitely be coming back here all the time."}
{"text":"I love this place! Delicious vegan options and Karine herself is always really friendly."}
{"text":"Absolutely amazing food. Vegan and non vegan extensive menu. The owner is passionate about food, quality, and freshness."}
{"text":"Delicious and healthy! No flavor was harmed in the process! Consistently good!   Eggs of all kinds are great. Try the omelettes with the good buttered toast for a treat. Pay extra for more egg whites to make it that much healthier.  Most dishes come with a small side salad and a nice helping of various fruits. The overall plate composition is healthy and refreshing.  This is a little no frills breakfast place tucked away in the Grange Food court. Seating can be hard to come by at lunch. (Art school crowd plus local business people.) This is not a table service place. Order and pick up at the counter when they yell your dish is up, scrape your own plate when done.   Usually no need to wait long after ordering. The chefs are quick and the prep done expertly.   Try the raspberry muffins, especially when they're fresh out of the oven. They're a little on the heavy side (butter! eggs!) but very, very good.  Careful of the pre-cooked stuff sitting in trays. The flavor is usually great, but it's not always as warm as you might want it to be! (There's no microwave there so no reheating if you ask.)  This place is NOT vegan and NOT vegetarian but it is vegetarian friendly. If you're not sure if there's meat involved, ask. Yes, their bacon is meat."}
{"text":"Everything is great here, so nourishing and filling. I just wish they would have a better set up online so I could see everything they have to offer as well as the prices. I see there are two main resources but both seem incomplete and lack pricing. A pdf of their board menus would be great. It's a bit far off from work and during lunch it would really help with my lunch choice."}
{"text":"We had a wonderful breakfast here this morning.   I had the vegan version of the Ultimate breakfast with vegan pancakes, pesto tofu, garlic fries, toast, salad and fruit.  Everything was delicious, especially the tofu with the sundried tomato pesto, it was pressed and cooked perfectly.  The dressing on the salad was really yummy; creamy, lightly sweet with a hint of mustard.  My son had the vegetarian version of the Big breakfast with eggs, toast, garlic fries (he loved all the garlic on these, don't get unless you really love garlic), tofu w/mushrooms, salad and fruit.  He couldn't even finish it all.  He got a vegan chocolate chip cupcake to go which was a big hit. Apparently the frosting was yummy, I wouldn't know since he didn't share:(  This is located in a food court which was fine for us (I wish we had food courts like this at home).  Not a place to really linger for brunch or to take the in-laws though.  I would come here all the time if we lived here, their lunch menu looked amazing too!"}
{"text":"I enjoyed a decidedly non-vegan breakfast here late one afternoon.  The owner, Maggie, called me \"baby\" no less than six times as we reviewed the specifications of my bacon, eggs and toast.  I was charmed.  It's too bad a place like this with such an eclectic menu (and atmosphere) is relegated to a tiny food court.  But it's _my_ tiny food court, so I am not complaining.  Breakfast for $6 including coffee is a pretty sweet deal in this city.  They also offer homewade waffles, salads, and vegan, vegetarian and celiac friendly foods.  The menu is huge!  Obligatory Title Pun:  You can get KAR-ried away at Karines.  Menu Readability:  Various signage is scattered all over the place.  It helps if you have ADHD.  Need to mention:  Taxes are included.  I wish every place was like this.  What this place teaches me about myself: I love garlic fries."}
{"text":"This is a quirky little place hidden in a foodcourt beside OCAD. Not what you would find in a typical foodcourt. The owner is super friendly... plus there's fruit infused water to sip on while you wait for your food. My boyfriend and I shared a karines supreme and were both really full afterwards. Food was pretty good but not spectacular...definitely a super good value though and still worth checking out... around $12 after tax for a huuuge plate of food. They have both vegan/vegetarian and meat options. Would go back and try other stuff on the menu."}
{"text":"Great little spot tucked away in a weird food court. The staff here is fantastic and make eating in a food court feel like you're visiting an old friend. For their $5 breakfast you really can't go wrong"}
{"text":"Cute little place in a food court opposite to the Ontario's College of Art and Design. The menu has something for every taste.   I got the Ocean Benedict, 2 good portions of smoked salmon with veggies and the traditional poached eggs and the hollandaise sauce. It was served fresh fruits. A delight for 12$!  My freind had the crèpes filled with chocolate and chocolat chips on top. He liked it but found it too chocolaty sweet...  So sweet-tooth-chocolate-lovers just might found their match with this one ; ) Personally I would have had banana chocolate crèpe in stead of just chocolate.  Food is very good and the fast served and friendly staff.  And the prices are more than reasonable.  All to start on a good day! : )"}
{"text":"Food was ok,  too bad it is in a food court. The lady (I assume is Karine) runing things is super friendly and really knows how to upsell."}
{"text":"AMMMMMMAAAAAAZING!  food: cheap! $5 but excellent quality   service: it's a counter, but they call you all sorts of adorable pet names.   ambience: it's a mall, but surprisingly decent seating with plenty of sunlight."}
{"text":"I love this place! I visited while I was in town and I was delighted with the array of gluten free goodies available. I had a sampler platter with pancakes and everything was to-die-for. The platter contained garlic fries, an egg, smoked salmon, the aforementioned gf pancakes and fruit. Everything was incredible and the portion size was huge but nothing that I couldn't handle. Prices were reasonable and they also offer free water flavored with fresh fruit (watermelon when I visited). The woman behind the counter, who turned out to be Karine's mom, was very helpful and charming. It is basically located in a food court so it's not the atmosphere for a date or anything fancy but the food is great for a casual drop-in."}
{"text":"Kumquat. In my fruit salad. KUMQUAT!! Such a weird word (and an odd-looking fruit), yet there it was, staring me in the face perched atop a bunch of other tropical fruits in my badass side salad. Karine's does not screw around when it comes to sides, let me tell you.  If you weren't looking for Karine's (which from now on, you will be, right?) you'd almost certainly never find it. It's in the OCAD food court but it deserves much more prominence and a proper storefront. Even though it's sandwiched between a gyros shop, a roti stand and McDonald's (ew), make no mistake: your food is made fresh to order and is served on actual plates with real cutlery. The portions are heaping and every person that walks away from the counter has a drool-worthy spread on their hands.   I haven't even gotten to the menu yet, sheesh. ALL DAY BREAKFAST. Meaty, vegetarian or vegan - and all done right. Omelettes (starting at $5.99), Eggs Benedict (including an \"Oceanic Benny\", Vegan Tofu Benny and a Florentine Benny - which I ordered for $7.99), Vegan Burgers and other salad-y things.  Oh, and then there's a buttload of sweet breakfast options like homemade waffles, pancakes or frrench toast in flavours like chocolate chip, apple cinnamon, peanut butter & banana, cream cheese & jam, mixed berries. All can be veganized and are bathed in cinnamon and fresh fruit.  Now, finally (I'm breathless) to my actual food. The owner, Maggie, greeted me like a family member and got to work on my breakfast moments after I had ordered it. The presentation was smashing - two perfectly poached eggs on blanched spinach with creamy, tangy hollandaise on top. Instead of English muffins, the eggs were spread on top of a yummy pita, which I appreciated for its thinness. And then there was the exotic fruit salad with kumquat, pineapple and kiwi, plus a side salad of red lettuce, tomatoes and cucumber in a zesty dressingl Oh, and lest I forget the potatoes. They were baked and smashed, and DEADLY. I was craving a baked potato in the most fierce way and Karine's delivered - the potatoes were baked and then fry-finished. Essentially the perfect texture for a potato.  I could hardly finish my meal there was so much food, and even though I'm epically stuffed right now I'm already thinking about when I'll go back!"}
{"text":"This place was nice for breakfast and brunch but now they have significantly raised the costs. I loved their breakfast wrap of sausage, egg and cheese that came with garlic fries for only $5 but now it is a veggie wrap with fries for $5 and there are time restrictions and not available on the weekends. The owner is very charming and is always trying to up sell you for the pricey options. They are okay compared to what was offered. Another popular dish is their lentils soup but I'm not a fan of lentils!   I would not recommend the French toast, it was awful. Though it did say gluten free, that could be why."}
{"text":"Cheap brunch for the amount you get. I got their veggie omelette & tuna melt. Tasted good and it came in a large portion with a lot of fruits on the side.  Very friendly & efficient staff. Tons of family-run cute vibes. Nothing fancy since it's located in the grange cafeteria."}
{"text":"Very reasonable spot in a hard to find food court.  What it completely lacks in ambiance it makes up for in high quality, diverse and generous options.    If you are looking for a quick, cheap brunch on the go; you'd be hard pressed to do better.  If you are looking to linger over coffee in a warm atmosphere, bad choice."}
{"text":"Incredible food and people.  Vegetarian and non veg options.  Recommend the all day breakfast choices.  Will be back - a great find."}
{"text":"Summary: very nice and cheap brunch place inside a FOOD COURT Price: $12 for a plate, enough for 2 girls. $4 for juice (yes, it is freshly made) CASH ONLY  I went to this place with my friend to have a brunch on Sunday. It is interesting to find a brunch place inside food court. The owner nice and friendly, and a little dramatic. You probably never to expect a brunch place inside food court, but here it is. The food quality is pretty food. And the price is good. I had waffles and special on the menu before, they both taste fresh. The juice is fresh made, so it is not too sweet, which I like. This place is cash only, and it took us a while to gather enough cash."}
{"text":"Ordered florentine Benedict and pink lemonade, super delicious. Large portion too. The only complain is I waited in line for quite a long time. Price range is close to other Brunch places."}
{"text":"Really cute place! They really managed to personalize it and make it feel homey despite being in a food court. They have a great selection and range of foods. As a vegan I was not disappointed since they had a lot of options for me that all looked amazing. For those that are gluten free they  also have plenty of options. I ended up with a vegan Beni that was an unusual take but an absolutely amazing one. The green juice was fresh and not too sweet, and the salad was refreshing. The woman at the till was very sweet and the food was prepared very quickly despite how busy they were. Great place that I absolutely recommend!"}
{"text":"Matriarch owner Maggie is exactly the kind of person I want to see first thing in the morning.  I love how she calls me (and everyone else) baby, honey, sweetiepie, booboo, etc. (Who knew I'd enjoy basking in the affection of a woman so much?) This eatery is as vibrant, fun, and full of personality as she is!    The basic breakfast platter is an amazing deal.  It comes with eggs, bacon or sausage (one of the few items on their menu that's not vegetarian), toast, fresh fruit, and your choice of fries (or garlic fries) or salad - all for $5!  The Special is largely the same but you can choose smoked salmon instead of meat, and it comes with either vegan pancakes or vegan French toast ($12, I think).  Teas and coffees are $1, and they always have an amazing fruit-infused water available.  I have to be honest - vegan pancakes and French toast are not my jam.  I tried it once and couldn't get past the strong flavour of soy, and how dense the pancakes were.  But everything else is delicious!  I love how they lay tablecloths on the seats around them and put flowers on the table to make the space more welcoming.  I like that they don't use styrofoam - everything comes in dishes and is served with real cutlery that you're supposed to clear after you eat.  The fruit juices are delicious (even if they're pricey at about $4/cup).  Their produce is always super fresh and I don't know how they do it, but the fruit they serve is always super sweet!    I like to go back just to see Maggie! :D"}
