{"text":"Been here countless times, limited options during the lunch hrs, the store looks fairly brand new, service sometimes is really fast, sometimes uber slow. The ipad ordering is cool. The food is pretty mediocre though, ive definitely had better but this place is better than the one down the street called Kagonei's! Be sure to taste the cheese wontons, its the best thing on that menu!"}
{"text":"Not a Big deal! I went for the AYCE lunch menu. They got some orders wrong. The menu has nothing special. I had to put a lot of wasabi in my soy sauce because I didn't feel the usual kick! The place is nice, and there is space to move between tables. Service was ok, but I didn't like that treat me as a fool when I said that they got the order wrong TWICE!"}
{"text":"Restaurant is very nice inside - new and modern. It is also  big and can accomodate large groups. I went for a lunch with a group of 10 people. We all had the all you can eat lunch special for $13.99/person. Food and service was great."}
{"text":"salmon sashimi quality excellent. service fast. but otherwise standard AYCE stuff.   mediocre variety in menu. cooked menu items just ok.  $16 for weekend lunch, is affordable."}
{"text":"The food is good. The service sometimes is not so good because they have too few people serving. If you go, go off busy hours. We went there multiple times and one time the floor was really dirty."}
{"text":"I've come back here about 3 times now, I love love love sushi and the cheese wonton here! First time we went a little crazy and couldn't fit all the food on our table lol!   The service was fantastic the first time I came here but the last two times not so much. During my last visit my mother and I came for lunch and we were pretty much the only people there, already placed our order then the lunch rush came in and somehow received their orders before us. So that was a let down especially for a  hungry 7 month pregnant woman.   So the food I would rate a 4 but the service probably a 2 or 3."}
{"text":"Real mixed bag with this place. Mostly brown bag. Decided to grab some take out for lunch. Many good reviews mixed with some bad ones on here but I took a chance anyhow.  Friendly service at the front desk. A nice cup of tea while I waited. I ordered the 'premium sushi', 7 or 8 sushi pieces with a dynamite roll. For $20 I figured it couldn't be too low end. Half right, half wrong.  The salmon, tuna and butterfish were decent. Tender and fresh, not overly flavourful but not fishy. Shrimp and eel were chewy - complete turn off. I didn't attempt the last 2 pieces, they didn't look very fresh. I've had way better dynamite rolls. Avocado and cucumber outweighed the shrimp tempura 3 to 1. No radish sprouts or anything interesting. Clearly not made to order, as the nori was chewy. That doesn't happen unless it sits a while and soaks up moisture. The tempura was cold and there was no crunch to it.   Typical sides of iceberg lettuce salad with carrot ginger dressing and miso soup were completely unremarkable.   Contrary to other reviews here, the wasabi had a great heat and bite to it.  Unfortunately there are far too many good sushi joints in the GTA to warrant my return."}
{"text":"Service was okay. The two rolls I got were stale, no much flavour to them. I've been to much better sushi places. Most likely my last time at this place."}
{"text":"Went at lunchtime during the week for the \"all you can eat\" special. HUGE MISTAKE! Party of 2. Food was okay, but service was appalling. We were seated in a corner right beside a wall, where we seemed to be forgotten. Three other parties arrived after us and were seated in our area... we watched them all get served before us. The girl beside us actually came, ate a full meal, payed her bill, and left before we even got our first few items. We didn't see any food until at least 30min after we ordered. My bf was frustrated to the point of making a scene, but their policy clearly is \"deny, deny, deny\". They made up some stupid excuse about being very busy (okay... you're a restaurant. Be prepared.) and essentially told us we were wrong. By the end of it all, we had such a bad taste in our mouths that we left half the food, paid the bill (they think compensation is a $3 discount - thanks guys!), and promptly left. Needless to say, we will NOT be returning. Ever."}
{"text":"My friend has been raving about this restaurant for weeks, so we finally went today. I am mad at my friend, and will never listen to his opinion again. The service was terrible. And albeit the food was good, it was no better than any other AYCE. My friend kept apologizing for the terrible service, but it was too late, my mind was made up. I will never be returning to Makimono.   Tables around us continuously got food, and were never with empty plates. On the other hand, our table had to wait 20 minutes each time we submitted our paper. The service was slow, and mediocre. The staff would look away and would never give us attention as we were trying to order more, or ask for a refill.  The food was okay. The service was terrible. I will never return, and my friend is dead to me."}
{"text":"Typical sushi place. Better variety of options than other sushi places. Service is okay, food items come very spread out from one another but the waiters are typically pretty understanding if you don't finish something that came late"}
{"text":"Great quality for an all you eat place.  Reasonably priced for sushi!  Great selection within the all you can eat menu.  Ensure that you track what you ordered though otherwise you might miss out.  Makimono can not be beat for those evenings where you have the craving to consume a massive amount of sushi."}
{"text":"It was a last minute decision for decision and we decided to pick the closest AYCE. We had about an hour before they closed and we were practically the last customers there. There's is an extreme list of food that you can order off of the ipad with desserts.   The sushi was great, sashimi was fresh and the fried food was on point and flavoured. Very cozy and well designed. Nothing to complain considering we were the only ones there!"}
{"text":"I visited this place for a quick business lunch at 1 p.m. I thought it was 3.8 but the scoring is even numbers. Compared to all-you-can-eat sushi places that I know around GTA, this probably deserves the 4 anyway. I generally don't buy the all-you-can-eat concept but my guest thought otherwise. As such, he kept eating while I admired his appetite.  SERVICE: the service was prompt except for arrival and seating that kept us waiting for a few minutes. The reception and the host were the same person. Not a big a deal. Once we had the high-tech tablet menu, everything arrived promptly and fairly in the order we wanted. The waitress switched our drinks on delivery and it took us a sip to discover that. Again, they corrected that. They don't have the professional waiting staff that know how to schmooze and make recommendation, but again, that is not big on my list for an all-you-can-eat place. Overall they were friendly, attentive, and pleasant. That is a 4 for me.  Food: It was pretty good for an all-you-can-feed-your-face place. The Salmon hand roll had the right amount of Salmon and rice and the rice was warm rather than from the fridge which I like. The Salmon-Avocado maki had a thin layer of rice around and that was great. Most places try to thicken the rice and fill you up. They even had a few Sashimi items for lunch including Salmon which again was a great choice to have. The chicken and Salmon teriyaki were cooked to the point and not overly saucy. Everything we tried was pretty good. Now, I don't usually order cooked stuff in a sushi place but my guest differs and I nibbled a bit.  The place: the place had a modern décor with lots of windows and it was clean. That is why, I am comfortable with a 4 star for this place for lunch. At $15 per person, I say it was a great deal so don't be cheap and leave a good tip if they are prompt and pleasant, and that they were."}
{"text":"This is a solid restaurant in all aspects. Service, food, selection, parking, interior, and its AYCE to boot. I'd rate it a 4 if not for one tiny aspect that I actually took for granted. There was something wrong with the wasabi. It had no kick. Not sure what the heck they put in it or if it was stale, but I dumped the entire lump on my plate finished it and didn't really taste anything. Typically, if I dip my sushi into this stuff and I get more than usual, tears roll down my eyes. In this case, I could have eaten it off a spoon like peanut butter and I'd still be wondering what was in my mouth. I can't believe it actually ruined my AYCE experience but it did.  lemme note that the beef teriyaki was substandard. Man was it tough."}
{"text":"All you can eat options are boring and plain.  Rolls are mainly rice and cucumber with a tiny slice of fish. I don't recommend it specially when you can find fantastic restaurants in GTA."}
{"text":"My wife and I ordered take-out. It was my first time coming here and was impressed with what I saw, and did not expect to see a nice clean decor with professional staff. It was very busy on a Friday evening. The manager offered us tea while we waited for our order, which was a nice gesture.   The food is pretty good, fresh tasting salmon sashimi and sushi, rolls were good, nice selection, wasabi was strong (good!). We did not try any other cooked items. Next time.  Plenty of free parking since it's at the shopping centre. Near the highway."}
{"text":"I don't know how this place is only rated 3 stars , this place is one of the best sushi joints I've been to and believe I've been to a lot ! The rolls are fantastic ( size and quality ) , there is an exceptional variety of food both hot and cold. The restaurant is visually appealing and the iPad ordering system is amazing. Overall a sushi experience to remember"}
{"text":"Their take out menu is fantastic, you can get sushi rolls such as california, spicy salmon, butter fish, and much more for just $2.95; their hand rolls are $1.95. Their sushi is pretty good and fresh would definitely recommend."}
{"text":"I went to Makimono last Sunday since it was the closest AYCE sushi to where I was at the time. The inside decor is pretty and it looks new. That's pretty much the only positive comment I have about this restaurant. The sushi was mediocre, the chicken karaage wasn't crunchy... even the wasabi wasn't even spicy. Even with the iPad ordering system, they messed up my order. I'm still waiting for them to deliver my miso soup..."}
{"text":"I've been here several times, mostly because it's a convenient location. Each time I'm hoping it'll be better than I remembered but I'm done doing that again and expecting a different result. The food is only so-so, some items like the few salad selections are the pitifully anemic vegetables topped with 1 000 Island dressing, the rolls are a little better as the decent AYCE standard, most of the appetizers and sides are very heavily Americanized (even for chain sushi places) fast food. The decor is nice but all of the times I was there the service was lukewarm and slow, regardless of the time of day or week and level of busyness. It's no worse than your average AYCE value in a nice setting but not the place to go for anyone who wants anything remotely closer to authentic Japanese."}
{"text":"Had been ordering delivery from this place a lot for all those late nights at the office. Decent pricing, and the food is alrite. Not your gourmet sushi, but for the price you're paying, it's good value.   Had the change to go in for AYCE yesterday. $15 for their lunch, and comes with drinks and dessert."}
{"text":"Went here for a late night sushi craving. My friend warned me ahead of time that the waitresses almost always mix up your order and since it's an AYCE, I thought I'd just order more. Well there is a fine line when rating a bad service: I mix up your order or I ignore your request to fill up your tea, give you more ginger or pretend to not see you. We were rushed and rushed to leave the restaurant even though there was still another 30 min before their closing time.    The fish was fresh, but the sushi kept falling apart. Great decor though."}
{"text":"Came here on a Monday night. Freshness was an issue. They pre played everything for single portion, which is fine, except you could tell it had been sitting there a while. Even the ginger was starting to dry out from being plated a while ago. Would not come back."}
{"text":"Went for New Years day lunch AYCE went early so wasn't crowded. Not typical buffet cook to order so everything hot or sushi fresh made Ipad ordering great service was good Tempura hot and fresh Great value for money but never been at peak times so service always good"}
{"text":"The food at Makimono is fantastic and the price for \"all-u-can-eat\" SUSHI is amaziing...the only thing that got me was:1. The service comes short.2. They don't share vital information to customers who are NEW to sushi.I went with my entire family and friends to try this amazing thing called SUSHI for the very first time....little did we know that we would not get any advice from the sushi-experts..and more importantly...WHATEVER YOU DON'T EAT, YOU WILL GET CHARGED FOR BY PIECE!!!!***it's in fine print at the bottom of the menu!I felt like it was sooo sneaky of them to make that note sooo small.I don't think I will ever go back because of PRINCIPLE!!!But you all must know the food is AMAZING."}
{"text":"I have visited many sushi places over the years and this by far falls very close to the bottom.  Besides the fact that we had a reservation and still had to wait 20 minutes is not cool but I can respect that and live with it.  What I cant live with is when you order chicken teriyaki and it was served under cooked.  Yes that's right the chicken was not cooked fully through.  It was corrected and remade and was cooked properly the second time but this left me very concerned with ordering any other chicken dishes.  Please check all your chicken before eating it.  On top of that being disgusting its DANGEROUS.  I already had a piece in my mouth when someone told me not to swallow it. Caught it just in time.  On top of that all the rolls that I ordered all had avocado in them.  Every single one.  The avocado was so over powering that it was all I tasted in all the sushi.  Up until the next day I had an awful taste in my mouth from the sushi the night before.  I have heard from many other people that this place is amazing so I'm not sure if I came on an off day but this was enough to convince me never to visit again."}
{"text":"My favourite AYCE sushi joint.   Been coming here couple of times a year for the past two.  Food is excellent quality given the type of restaurant and easily wins over a lot of supposedly higher end a la carte joints I've visited in the downtown core. They've also added some Chinese dishes recently which are quite decent in fact.  Atmosphere is great with beautiful, clean and modern lines abound. The bathrooms are also always very clean and no-hand contact friendly.  Service is excellent. There is the occasional mix up of orders and sometimes you have to try to grab the attention of the servers but overall the place is managed well.  Lastly the price is pretty good given the very wide variety of food they offer and unlike many other places that rip you off on the drinks, it includes tea or soft drinks.  Weekends can get busy so either book ahead or visit earlier in the evening if you don't want to wait.  Overall excellent restaurant and hope it stays so!"}
{"text":"As some of you might not know but this restaurant is under new owners and new name called \"Kayamono\". I went here two nights ago with about 10 friends for the ayce, you order from tablet and they bring to you. The food was exceptional and delicious! Every sushi/sashimi, hot and cold items were on point, fresh sushi, the tempura was not greasy. The other food was light and not over salted the teriyaki items. In general we were all pleased with the flavour, and service was great!  Buffet price was around $25 per person.  Good value for all the items offered. Definitely would go back."}
{"text":"LUNCH SPECIAL!  We stepped into an absolutely BEAUTIFUL restaurant which is rare for an AYCE Japanese restaurant in this part of town.  There is an architectural feel to it as most of the place is in a wooden pattern from the floors to the walls that have a shade of brown.  We looked at the website before we came, so we decided on the Lunch Menu to save some time rather than the AYCE Lunch Menu however when we sat down we saw the AYCE Menu until we requested for the Lunch SPECIAL Menu.  The Menu had a GREAT variety(Rolls, Sashimi, Bento, Sushi, Tempura, Teriyaki, Katsu, Don, and Soba/Udon) and reasonable prices for lunch portions.  It comes with the standard Miso Soup and the Salad I actually commented POSITIVELY about rather than simply overlooking.  I had the Sushi Lunch #2($8.95) that came with various Sushi and Maki and one thing I noticed was there were toasted SESAME seeds in the Rolled Sushis that make it more flavourful and savoury.  My friend had the Sushi Roll - 3 Choices($9.95) where I tasted the Yam Tempura Roll which had a nice CRUNCH.  Bento Box 1($8.95) was a GREAT value as it came with choice of Teriyaki Chicken/Beef/Salmon, 3 Fried Gyoza, Vegetable Tempura(Yam, Broccoli, etc...) and Orange segments to end the meal.  All these come with the same Miso Soup and Salad TOO.  The service was nice and feel free to speak MANDARIN to them if you like as I over-heard their communicates.  I will RETURN to try the AYCE menu outside at the PATIO next time."}
{"text":"Came here recently for AYCE dinner on a Friday night and was presently surprised.  Quality of food and sushi were of good quality and well prepared.   The short rib and beef teriyaki were nice and tender.  Lots and lots of sushi rolls to choose from, and some torched sushi as well.   Ordering on iPad requires server to come and confirm on the system, and we found that at busy time, you might need to flag down a server for that.  Overall had a good experience here, definitely a contender for future AYCE sushi in the Woodbridge area."}
{"text":"My initial impression was that there is so much parking and the restaurant is really nice inside. This is a huge plus.  The staff are helpful and pleasant.  We have tried many of the dishes on the menu and they are all good. The sushi is fresh and their hot dishes are really tasty.   This could easily become my regular go-to Japanese restaurant.  Rip Off We went there for lunch on Mother's Day. They charged dinner prices for lunch. What a rip off. I've been going there a lot recently, but I won't go back."}
{"text":"Makimono is my spot for cheap sushi take out. I've never dined in. I've probably been to this location over 10 times and have never been disappointed, but also keeping in mind that I'm not looking for an enlightening sushi experience. I would also recommend this place if you have a big group that you need to feed who aren't overly snobby about sushi.   The last time I was here, I got: 2 California rolls, 1 spicy scallop roll, 1 Alaska roll, 1 dynamite roll, and 1 spider roll, all for the low price of $26.50! They give you 50% off the rolls when you order take out. Despite being on the lower price range, they don't overload their roll with too much rice and are rather generous with the fillings. The rolls are also always nicely arranged as well - definitely doesn't look cheap! Soya sauce is provided in abundance along with your standard wasabi and (pink) pickled ginger. I also got a sweet teriyaki sauce for the dynamite/spider rolls as well.   Service is friendly and quick. You can either call in to order or order at the restaurant. It usually takes about 15 minutes for them to prepare you order and it's always securely/nicely packaged. There's a small couch you can wait on. Parking is free at the lot outside."}
{"text":"Worst experience ever... Waited 45 mins with a reservation to get seated. When we finally ordered didn't get anything we ordered but dessert and the bill when I spoke up the waitress became extremely rude and basically flat out told me that we had to go because we'd been there for over two hours. To make a long story short I left a couple bucks for drinks and walked out. Will never return"}
{"text":"It's nice to stumble upon an AYCE sushi place that does it right. I had lunch at Makimono's as I passed through the neighbourhood. I was just going to have a standard lunch, but I noticed they had a bit of sashimi on the AYCE menu.   Ordering off of an iPad is easier, since you can see the photos of each item. The variety between Chinese, Thai, Japanese, and sushi was good. I especially liked the hand rolls, made with impossibly snappy, crisp nori, and fish going all the way to the bottom. I tried a few different ones, and the were all great.   The sushi in general was also very good, with a nice balance of protein to rice. I also tried the Seafood Pad Thai, which was largely inedible due to a strong antiseptic taste. Also, \"seafood\" does not mean a few cut up chunks of artificial crab stick. A real turn-off.   Overall, a good value, and I would probably order anything off the menu except the Pad Thai. No loss..."}
{"text":"Makimono is a mixed bag and sort of tough to review.  Like many of the All You Can Eat Sushi/Asian places in the Vaughan area, there are a lot of really good offerings on the menu (which uses the usual iPad AYCE app that is so popular lately, with good reason) but I think these places all benefit from multiple visits as the first impression was a bit mixed.  But that's not always a bad thing, what you really want to do when you go to a place like this is try as much of the menu as you can and take note of what they do well and what isn't your bag.  Once you have that established, the subsequent visits will most likely be much more enjoyable and rock solid.  So why the 3 star review?  Because nearby places like Spoon & Fork and Shitake both, upon that first visit and experimentation with a wide scope of the menu, set a certain expectation of quality that just wasn't there with Makimono.  That being said, Makimono had a lot of things going for it and a lot of the dishes were really fresh, really tasty, and expertly prepared.  I just know in my heart of hearts if I was in that exact area and wanted AYCE asian food, I would always choose Spoon & Fork or Shitake over Makimono. And I would recommend others do as well.  If it were the only one in the area, you could do a lot worse, but it is what it is."}
{"text":"Once again I find myself reviewing a place at the end of a long day with a good friend. For all-you-can-eat it was great. We gorged ourselves and had quite a few Sapporo's and Asahi's and the bill was only $85. The shrimp tempura was very good as were the Gyoza. Everything came very fast and our servers were polite and attentive.  I would definitely return."}
{"text":"Every AYCE sushi is the exact same, some worse than others. Overall, it was less than average food. Too much sauce, funny tasting meats (i couldn't handle swallowing the beef), and too oily. They also don't accept debit which forced me to use the ATM and get charged again. Overall, i wouldn't come back."}
{"text":"I've been coming here for years and it's great to see they now make it much easier to order by having an iPad, which also lets you see what the rolls look like rather than wondering or asking for each roll.  Service has always been great here, I find they clear your table pretty quickly, but as some have mentioned after your first order the ones after seem to take a bit of time.  I personally find their lunch much more *bang for the buck* as it's one of the very few places if any that offers sashimi for lunch. Their dinner menu doesn't have much more in my opinion over lunch unless you like the special rolls.  For the lunch alone I'd give it 5 stars, for dinner it's pricier especially during the weekend.  One tip I will say is to avoid the pop, or carbonated drinks.  Aside from when they first opened I find it has always been flat. I'll periodically order diet coke and find it's been flat after all these years."}
{"text":"The sashimi and sushi were good, but the beef was so chewy I had to spit it out which I haven't done since I was a kid :/ kinda ruined the experience. There are better alternatives close by."}
{"text":"I went to Makimono because I had been referred by a family member of mine. First off, the Woodbridge location is pretty busy so waiting for seating takes a while. On my visit there my friend and I were sat down at a table larger than for just two people so we sat down and got comfortable. A couple of minutes later we were asked to move to a smaller table due to reservations of larger parties so we moved. We wouldn't have minded this however the \"larger party\" turned out also to be only two people and we couldn't understand why we were moved into the stuffy corner for also a party of two people.  But hold on, there's more.  Although lunch may be all you can eat, the serving sizes you get are similar to that of portion sizes of samples at Costco. On top of that Cosco offers better customer service than the waitresses at Makimono. Waitresses politely seat you and get you drinks then forget about you like you fell of the face of the earth or something. You usually have to flag down different ladies each time to ask for help. When you've finally ordered things, dishes arrive out of order and with really big gaps of time in between each dish. It took my friend and I almost two hours to finish dining at this restaurant and it was not because we were just there having a good time, we were waiting for our dishes and starving!  The food at this restaurant is VERY SUB PAR despite what people are saying. When cooking tempura you're supposed to just fry it for a minimal amount of time so the product is crispy and not doused in oil. BUT, the tempura at this restaurant will relentlessly squirt oil at your face when you bite into it. As for the sushi, I ordered the California roll and I noticed the cucumber was not even a chunk of cucumber. It was finely sliced pieces of the skin of a cucumber. No wonder waiting for the food takes so damn long. Their fried rice dishes smell great but taste like nothing but oil. I swear they doused the whole dish in vegetable oil or something... They also get their portions wrong, on their menu it says you receive a certain amount of items but they were always either one or two less than what they had described on the menu.  Lastly, when going to pay for our dining experience, we received the bill and left our payment but the waitress said to us \"oh, you know this doesn't include a tip! Only the HST, there has to be a tip too!\" Excuse me? Tip you for your non-existent serice? No thanks Makimono, no thanks."}
{"text":"A strange sushi story.   It start with sever lady. I say we want vegetable dragon roll and she keep saying \"green dragon roll thank you\"...and I say NO veggie dragon please. She get wrong 6 time! Why so hard to understand?   There 4 of us at table. We all order tempura, she bring only 1. We need 4!   Then after get food, server come back and spill tea all over table and rolls! This so much HOT WATER everyone!    She look scared. She lucky, by boyfriend nice he say no problem (He is lawyer though and make joke about McDonalds hot coffee money).  Sushi taste good (so what lots of sushi do) roll so big I almost choke!"}
{"text":"Sushi is subpar, its just decent. The service lags and you rarely get all the food you order when you go all you can eat and by the time they do bring everything out you've been there for so long that you just want to leave. Definitely a pass."}
{"text":"Many have told me they love this place so I decided to venture away from our usual AYCE sushi place to check it out.   The place was not too busy and we got a table right away which was nice. It began to fill up while we ate but didn't have high turnover. Not an issue.  Service:  The service is very good. I can't complain. They don't come and ask if you need anything but did refill without asking.  Food came out at a good speed.   Decor: The place is nice. I liked watching them always cleaning. The floors. The tables. Etc. They have a lady that seems to do nothing but clean it seems.   Tableware: First time I am including this in a review. Because it needs to be mentioned. The chopsticks are terrible. Ultra smooth plastic. I am a veteran chopstick user and I struggled a lot with these things. No texture at all. I was going to ask for the cheap wooden ones as they are way easier to use. They do include a fork in every plating, rightfully so as these things are too frustrating. The plates are nice but plastic. All else is normal restaurant grade   Food: The food is just okay. The Fire and Ice roll was amazing. We tried the dumplings, and they were okay at best. The sushi was middle grade. I liked the fish to rice ratio which is very redeeming for the lower quality fish.   The roll portions are half that of other AYCE places. The iPad says 6 prices but some came out at 4. The sashimi slices were small as well. Half of that on of the sushi.   The chicken teriyaki was very good. Delish. Salmon teriyaki was tough but good as well.   The Wonton soup was not that great. The broth was decent but the filling in the noodles was so so.   Overall the place is nice and the food is okay. Definitely a decent mid-grade AYCE establishment. A bit pricy to be honest. At $30 for an adult dinner on a Sunday night, I found it disproportionate to the quality but I will say I am satisfied and feel content.   I do appreciate the fact that I don't feel greasy or bloated. I do feel good after all we ate. That does say a lot.   Will try again at a lower priced window to have some different menu items."}
{"text":"Came here for lunch. Unimpressed with the overall experience.   Food = nothing special. Mediocre sushi, not much of a selection. Also, the wait for food to come out took really really really long.   Service = poor. I asked to move seats, and heard a girl(maybe supervisor? Or manager) say \"NO OF COURSE NOT\" and then our server came a little shortly saying no because they're saving it. I understand that they are saving it, but to say it in such a rude way turned me off. No server checked on us throughout our meal either.  First and definitely my last time coming here."}
{"text":"I came here with a big group of people and we were promptly seated upstairs. The interior is very nice and the price is reasonable.  We had a full range of different menu items that came quickly enough. I felt fine the next day but two of the people in our party did not. Hard to say if it was the food but I saw other reviews for this place that mention the same thing.  Anyways I would probably not go back, just because there a couple other places that I find that has fresher items, such as New Generation Sushi in Vaughan."}
{"text":"This place was absolutely great!! Their sushi pizza is hella good as is everything they make. We visited from America and were very impressed with the price, but we also wanted to apologize for ordering so much, but being unable to finish which was terrible of us. The food here is great and the service was exceptional. Wish we had this place in New York."}
{"text":"One word: SLOW. Came in very thirsty and was looking for a server to come by to get us some water first and felt like it took ages as I was drying out like a browning cut apple. Once we were finally served, food also took forever to come, mostly the sushi and sashimi. Felt like they wanted to stuff us with all the less expensive stuff so we won't have any room left for the more costly stuff. Well guess what, it worked! Food took so long that we were starving, so we munched on all the side dishes first and didn't really have an appetite anymore when the sushi and sashimi finally came... a decade later. Taste wise, wasn't bad or fantastic. The udon was actually pretty tasty. But the service won't make me a returning customer."}
{"text":"The sushi itself was okay (hot food was terrible), but the service was absolutely horrendous. Rude waitresses, being rushed out even when there was plenty of time before the place closed etc etc.  Go to Spoon and Fork if you're in the area and you're really craving Japanese food . You couldn't pay me to eat here again."}
{"text":"I like it.. its one of my favorite Sushi restaurant.. Price is not bad.. You can request a VIP card that gives you a 10% off the whole year..  ITs nice to bring someone in a date.. place is really  cool"}
{"text":"If you come here on boxing day you pay $70 for all you can eat for 2 during lunch. Thats fucking insane.  Very very very disappointed. Never again will I be going here."}
{"text":"The place looks somewhat funky. There is a wooden structure that arches through the middle section of the store resembling of either the skeleton of a giant fish. The lights are dimmed and the place feels cozy.   The food was okay but nothing to write home about. The rolls were a bit dry to my taste. The service was friendly. Would I go there again? Possibly, if I was in the area. These guys are a safe middle-of-the-road choice."}
{"text":"Makimono was pretty decent!  I enjoyed my three rolls. I tried the ocean roll, the bbq eel roll and the rainbow roll. I wish the ocean roll had something crunchy in it - maybe some cucumber or tempura flakes. The flavour was great, just lacking the crunch as it was just all fish and mayo. Sort of mushy.   The service was prompt and the menu is through iPad which is a cool feature. I loved that there was salmon sashimi on the lunch menu. I do with their ATM was working since they don't accept debit.   The restaurant is big! Considering the number of lunch patrons, my meal came out fast and all together. I was very impressed with this.  Over all, I'd return."}
{"text":"I love going to this place.  The food is great and staff very friendly.  The iPad ordering system is brilliant for the all you can eat sushi. Just be careful not to get carried away and order too much due to the delicious pictures."}
{"text":"I went to Makimono yesterday during dinner hours with two other people. When we were deciding whether or not we should get a la carte or the buffet menu, the waiter said under her breath, \"Just leave\" and walked away. This isn't the first time service was terrible. For the price of Makimono, service should be their top priority. Not recommended!!!!!!!!"}
{"text":"The all you can eat buffet is where it's at if you're looking for a lunch destination. You order food off an ipad which comes your way as it's made. The sushi is fresh and the menu is very extensive. You get plenty of ordering options for decent value. Go put a dent in this buffet - it's well worth it."}
{"text":"We got referred to Makimono in Woodbridge by friends, who raved about the selection and taste. After trying it ourselves, we were left less than impressed. Wait time: considerable, plus you might be asked to change tables under the pretense of \"larger party has reserved it\". They have longer tables for large parties. Should not bother other patrons.  Food: mediocre at best. What else do you expect from an AYCE sushi in Woodbridge? The selection is better than most places, but everything taste the same, blend and falling apart. Dip-fried stuff (tempuras etc.) drips with oil.  Service: this is where it gets really ugly. Wait staff is either ignoring you or are rude to you. Their attitude is alarming. Things get thrown on the table, one waitress whose attention we were trying to get turned to us with \"WHAT?\", etc. Plus, it is not Ok to make patrons wait for 30 min. for an order, without ever appologizing for the wait. It is not OK to ignore customers. Its funny when you finally manage to flag one of them down, try to ask her something and she just walks away. Seriously, turns around and walks away without answering.   Atmosphere: student cafeteria.  Return: no, there are tons of sushi place in GTA, this one is not worth it."}
{"text":"The sushi here was great.  Check out their take out menu and special sushi rolls menu... CHEAP PRICES!!! We got there late and they were closing in 15mins so we could not dine in.  We opted for take out and was surprised at their prices... ranging from $2.95 to $12.  The sushi was very tasty and portions were good.  They presented the sushi nice... some places whe taking out... it looks like a mess.  I will definitely go back and try the all you can eat.  The service was great too.  After we paid... we waited outside.  The lady brought out our order for us."}
{"text":"I guess management did listen to earlier reviews since on  my visit I found the service to be splendid! Upon entering I was quickly escorted to my table, hot tea was served in a minute and my order was taken as soon as I put the pencil on the table. The waitresses were smiling and very attentive refilling my tea and cleaning away the table very swiftly.  As for the food, it was decent AUCE food. Nice tempura, light and crisp without too much batter. The sashimi were fresh  and abundant. The rolls were OK, although the rice is somewhat overcooked, it would also be nice to include explanations of what's in them on the menu, as I saw several people ask. I myself was surprised that Hott's roll wasn't spicy, it just had fried salmon...what was I thinking?  Decor is interesting, but not overwhelming. Keep in mind that they only take cash or credit, and although there is ATM on site, during my visit it was out of service, so manager did a debit transaction without hesitation, perhaps he was stunned by my beauty so don't bet on that option.  Overall if I was a 16 year old on a date, I'd be impressed! If I was 45 year old on a date I'd prefer real sushi place, so truth is somewhere in the middle."}
{"text":"the food was delicious and I feel like it was worth my 30bucks. Only thing was it kinda took longer than I thought, I guess it's because I came during peak hours"}
{"text":"They recently changed their name of this location... So it's no longer called Makimono. I imagined it would be under new management and that it would be better than before, and to be honest it is even worse. SERVICE WAS SLOW AND TERRIBLE. I will not be returning as there are plenty other all you can eat sushi spots with much better food, service and pricing."}
{"text":"Okay so this was probably my fourth visit. We came for lunch during the work week. I feel like a lot of other reviewers now, this place is hit or miss.   This time was the worst of the past experiences. The sashimi and scallops were good like usual but the gyoza were strange. I was pretty sure they had pork before but now they're vegetable and the filling is green. I was under the impression that gyoza are supposed to be pork. Not to mention there's not a lot of filling, they just tasted weird, not very appealing. The cheese and crab wonton were basically all cheese, I wasn't a fan of that either.  The rolls were pretty standard like every time before. I will mention that the knife work on the fish was pretty inconsistent this time. We had a huge piece of salmon on one roll (not that I'd ever complain about that) but on the other roll the snapper was basically transparent it was so thin. Also an order of yam rolls my coworker ordered never ended up coming. My other coworker ordered beef teriyaki which was greasy and not very enjoyable.    I would give this visit a 2 but taking into account all the other visits I'll update Makimono's rating to a total of 3. Just be prepared, I guess depending on who's working it'll be good or just okay. And be prepared for no pork in the gyoza."}
{"text":"I get take out from here a few times a month and I have no complaints. It's very well priced. Always fresh and ready when I get there. The staff always take my order accurately and it's always correct.  And if you pay cash you get 10% off your order! No complaints thus far!!"}
{"text":"I like the new iPad ordering system. However I do find that this causes a lack of service. Our waiter only checked on our table once when my glass of water had been empty for 15 minutes. We came for AYCE lunch and I was slightly disappointed as our options were limited. I had a \"sushi virgin\" with me so I wish I could've had them try easier options such as the tempura items or a green dragon roll.  The actual restaurant is very nice however but food is just okay, nothing spectacular.  Head over to S&F if you're looking for more options and better quality."}
{"text":"All you can eat Japanese. You can order through the ipad, which makes our lives easier, you can see pictures, etc.. very tasty food, and high variety. Price is fair. The best mushroom tempura ever tried."}
{"text":"3.5 stars.  I came back here for dinner AYCE sushi recently ($24). Their ordering system has been updated, since every table comes with an iPad where you submit your orders directly to the kitchen. Very convenient, and every item has a picture regardless of whether the picture is accurate or not.  We ordered a lot of items and ate everything. However, the waitress kept coming over and asked us whether we still wanted the items that we ordered. I can understand the reasoning behind it, but after the first time it gets annoying. The food itself was decent. The sashimi comes in thin slices. I was disappointed with the edamame. It didn't really taste fresh. I had some week-old leftover edamame from Yang's Teppanyaki and that tasted fresher than what I had at Makimono.  Probably a decent choice for lunch, but they're competing with Spoon and Fork in this area. For dinner, I would prefer to pay an additional $4 for better quality at S&F."}
{"text":"Not very good for a lunch choice, surprised that there is sashimi offered but our order didn't even come until the end only after reminding the server twice we are missing orders. For the price it was not worth it for lunch. The new technology for ordering was a fail."}
{"text":"Loved this place, me and my two best friends came here since we were 7 and 10 with one of our moms. Loved the iPad idea fun for kids to order and see the pictures along with the small portions but it goes with the all you can eat. Shrimp tempura, Minso soup and the udon was one of my favourites and most recommended. Great service and very kid friends since me and my friends were loud since we were kids."}
{"text":"I used to like their food but not anymore. Nice place but food, not so good. I have had better sushi. Everything tastes bland. I don't taste the freshness of the food and it's just ok. I would give it more stars if the price was better...but $23 for dinner is so not worth it. Food is as good as food court sushi...meh...not coming back.."}
