{"text":"Customer service was great. Staff were polite. Food was BLAND for the price that you have to pay. Portions are also very tiny. Not really worth it."}
{"text":"Why did I come here? Simple: My friend saw a Korean flag as was like \"HEY LETS GO IN ITS KOREAN\".   1st Impressions: Is this Japanese or Korean? I see sushi but at the same time I see Bibimbap dishes left and right. At this point, I did not give a shit since my stomach needed to be satisfied.   On a side note, that random rocket ship made me \"LOL\".   The Service: I swear on my great grandmothers grave, it took 20 minutes before they even approached us. Hey, at least they were polite and served us some hot tea.   On a side note, if you order sushi...shouldn't you automatically get Wasabi, Ginger & Soy Sauce? My cousins ordered a crap load of sushi and they did not get any of those things.  Also, my friend forgot her ID which meant they denied us alcohol. We were pissed and I really wanted that Sapporo.   The Menu/Food: A lot to choose from. I decided to go with the Bulgogi Beef with Rice. I was pretty content since the dish was full of flavor. You can never go wrong with this Bulgogi Beef Dish.   The sushi that my cousins ordered was pretty decent. The sashimi was on point as well.   Atmosphere/Ambiance: Typical Asian restaurant vibe - The smell of hot tea and foreign dialect. Some random Korean show was playing over the TV that I could not comprehend.   Overall: If you want some late night Korean and/or Japanese food, this is a safe bet. If you want JUST Korean food, eat at Owl of Minerva."}
{"text":"I really did not enjoy the food at this restaurant, with so much competition around the Yonge and Finch area, they definitely need to make better food. I found the pricing way too high in relation to the quality of their dishes"}
{"text":"Nicely decorated, good food, good service.  For appetizer, we ordered sushi pizza.  it was my first time to eat it and now I am hooked.  We had the Kalbi and tempura shrimps/vetables in a bento box for lunch.  Lots of food for the price.  Will definitely go back to try more things from a very large menu."}
{"text":"I heard about a 24/7 place to have sushi and korean food, so I had to try it out. We went at around 10:30pm on a Sunday and there were still a lot of people. My rating is according to service, atmosphere and food.   Service 3/5: service wasn't bad, but it wasn't good either. So it was mediocre. Not much to say about this.  Atmosphere 3.5/5: the atmosphere was pretty nice. It wasn't too loud or too quite. The decoration was okay. Kind of wierd having a space ship up in the ceiling. Hahaha. Other than that the ambience was good.  Food 3/5: we got the pork bone soup and also a sushi and sashimi dinner set. First the pork bone soup for me was lacking a little bit of flavour and it wasn't spicy at all. My friend liked the pork bone soup because she can't takw much spice so it was definitely good for her. The potato was tender and also there was ALOT of meat in the pork bone soup which is a bonus! On to the sushi. The sushi was okay. I usually don't like red tuna all that much but this one was alright. the california roll was made really well. The fish wasn't super fresh, but it was okay.   So over all i would give this place a 3 close to a 3.5. I would definitely go back for midnight sushi if i crave it, but this restraunt will not be my go to. It is super convinent that it is open 24/7."}
{"text":"Visited with a group of 8 for a friend's birthday lunch. Had a bento box #22 (Japanese). Menu was huge, lots of selection, almost fusion in nature as many different types of Asian cuisine. Really enjoyed the freshness, cost, quality and quantity of the food in the bento box, in addition to the extras (appetizers) on the table. Service was good. My colleagues all seemed to enjoy their food as well. Big place, lots of tables! I'll go again!"}
{"text":"Went here for the first time last night and I was very impressed.  Its 24 hours which is always good to know.  We had a sushi platter, katsudon, and a couple other things which I don't know the name of.  It was quite delicious and the staff was very nice.  I would recommend this place and go back again myself. The menu was like 13 pages so there is a lot more things I'd like to try."}
{"text":"I had beef bone soup, which is among the most popular dishes in Korea. It was a cold day so I was craving a hearty warming food. But what a disappointment it was! It was so salty, and the soup didn't even have signature milky colour. There was a taste I was looking for that I've come to love in beef bone soups but it was nowhere to be found in this one.   Service was the highlight of the restaurant. Food came out really quick and server was always smiling. I didn't like the smell of the restaurant as many others were eating grilled foods. But food was cheap, which was enough for me to rate this place 3 stars"}
{"text":"This review is based on the don katsu that came highly recommended from a good friend. She told me the sauce is a bit different from the sauce that katsu usually comes with (which I was quite hesitant about). I ended up getting take-out which came with a side salad, Korean appetizers, orange slices and of course the perfctly fried pork. The sauce is amazing and really makes the meal, which seemed like a mix of a blue cheese/thousand island sauce. I liked it so much I ordered it again the next day.  Did I mention this place is 24-hours?"}
{"text":"Things to know (as of March 26, 2012):  *Korean food. For some reason, this place is listed as Canadian. I guess they're Canadian in the sense that they're in Canada, but the food is Korean (rest assured; and hopefully that will be fixed by the time you read this).  *24 hour service. If you live in the area and crave some Korean food, this place is open at all hours. Pretty sweet for the lazy cooks out there like me.  *Affordable prices. They don't overcharge for the food. Everything is reasonable for what it is.   *Nice decor. Considering the price range for some of their food, it's kind of surprising. They have tubes of water with colored light near the front. The chairs/benches had fuzzy backs. There was an owl placed in one of the corners of the restaurant that would be easy to miss if you weren't just mindlessly zoning out waiting for your friends to order.  *Good food. Not great, but good.  *No Alcohol. They don't have their liquor licence yet (as of this review), so they couldn't serve us any alcoholic drinks. The place clears out quite quickly because of that (half the restaurant emptied out a little past 8pm). I guess the banner outside saying \"Grand Opening\" should have hinted at that being a possibility with this place, but others have been saying that banner has been outside for a while now.  Good place to try if you're in the area. You won't have to worry about them being closed by the time you get there either (unless, maybe, on a holiday)."}
{"text":"Tried the jajangmyeon and it was delicious. We also tried the donkatsu and bibimpap.   Donkastsu was just okay, bibimpap was just as good as the jajangmyeon"}
{"text":"The most noticeable is the fan got switched on and oscillating around.  We have a seat that has the air flow directly to our heads.  So we request to change to another seat at least having mild air flow.   The food is not outstanding but on average.  I like the side dishes.  The dish portion is pretty large.  We have Bolgogi and fried rice cake.  For the Bolgogi, lots of beef.  You can be very full if finishing only this dish with 2 bowls of rice."}
{"text":"I've been eating and drinking at Kayageum on and off since the summer but hadn't been in a while when we stopped in late on a Saturday night, post-drinking. It wasn't as busy as I'm used to but it could've been the weather. It's still fairly new-ish. The place is a decent size with parking in the back AND it's open 24-hours.  I have tried most items on their menu (bibimbap, soups & stews, sizzling meat dishes, etc) and everything was always good but this last time was a let-down. Having said that, I will assume that the last time was just a one-off, because if I had to base it on that, I'd rate it only 2*. An overall rating based on all the other times fares much better at 4* but I'm just going to average it out to 3* in case this place is going downhill.  The decor is nothing special. When you first walk in, you'll notice a rocket has gone through the roof and below that, there is some fishnet thing going on with some neon something or other happening, and behind that is a tree--I can't remember if it's the persimmon tree or what. It sounds trippy, but it's not. It's just weird, and I don't get the carpeting on the backs of the booth seats, but whatever, I go for the food.  This last time, there were much fewer banchan (three became four when I complained) and presentation was dismal. The two of us ordered seafood ddukbboggi ($16?), the naemgmyun+kalbi ($17) and tangsooyuk ($17?). The dddukboggi showed up looking like it just came out of the microwave or maybe it was ready before the rest of the food, but it looked like it had cooled down. I'm guessing it was microwaved because after giving it a stir, steam began to rise from it. There wasn't much in the way of seafood, just two large shrimp, one mussel, and a few odaeng. Definitely not worth the price. The kalbi was served on a sizzling plate but wasn't sizzling at all. There were a few pieces of fatty short ribs and some bones had no meat attached to them. The meat was lukewarm. I have no idea where they buy their meat but they really need to find a new supplier. It was the worst kalbi I've ever had in a Korean resto! The tangsooyuk looked small but most places charge $20 so maybe they were using the relativity scale, but that too looked like it came out of the microwave! Still, it tasted pretty good and was dotted with the usual chunks of fruit and pork pieces. I think they were battered in rice flour because the coating was chewier than at other places, yet still crispy. The sauce on this thing had no steam coming off it, so it made me wonder how long our food was sitting there. It's not like it was busy that night--there was a large group of obnoxious drunks in the back end of the resto but they didn't seem like they showed up to eat, so no idea.  Service was OK but a tad slow. I felt sorry for the waiter so I didn't complain much but I was disappointed for sure. It's sad when any of your go-to places starts to go downhill but hopefully this was just a one-off situation."}
{"text":"Great location if you are in the North York (Willowdale area). Very attentive staff :)   We ordered the shrimp fried rice which was delicious and it came with complimentary miso soup and kbbq sides which was a nice surprise!   We also ordered the dynamite roll, it didn't have enough sauce but the tempura was good.   Would come back again, just wouldn't have the sushi."}
{"text":"This 24-hour Korean Restaurant has only been open a few months, and it's already attracted many of us residing around Yonge/Finch. It was relatively packed when we arrived, but we were seated promptly.   The waitress' spoke in broken English, but the service was friendly and courteous. Like many other Korean restaurants, they also have the service bells at your table. This ensures no annoying waitress' constantly checking on your meal, since you can just press the button when you require service.   We were served with cold barley tea, which tasted mostly like water. I'm not a tea enthusiast, so I wouldn't know. I ordered spicy rice cakes (around $14) which was a bit pricy and my friend ordered the Beef Bimbimbop (around $8). He enjoyed his dish, but my rice cakes were not as chewy as I'd like them to be. There was no more than ten pieces of rice cakes and the rest was onions and squid. I wish I took a picture of it..   I like their variety of small, complimentary dishes before your meal. It's a little different than what I'm used to (loved the potato salad!)   Though the food was mediocre, I would come back for a late night snack."}
{"text":"I've been here a handful of times before. This place is one of my go to restaurants for late night eats.   My favourite dish would have to be the chicken or pork katsu. There's something about the sauce they put on it. Also, the sushi they have is pretty fresh and tasty.   The prices are reasonable and the service is great.   SC."}
{"text":"One of the best Korean food and BBQ places I have visited so far.   Great taste and so many menu option they have and surprisingly price was very reasonable.  Great location and inside is spacious. Inside the restaurant is korean traditional style atmosphere.  Good service as well.   I am looking forward to try other food next time."}
{"text":"It was 'oooh kay'...  Food is slightly above average, would give a 3.5* but I rounded it up as the decor was nice/confusing (Alice in wonderland theme?) and the washroom was super clean with infared  hand sanitizer...  They had a live Jazz band whom I thought was pretty good and a good addition, but the 3 who went with me thought otherwise.  I guess that's subjective.  Will def. repeat if in the area, but not the first choice."}
{"text":"Pork bone soup base was not strong enough!    Waitress n waiters are nice but the management level need to be well  trained!!! There was a \"lady\" who Is obviously not the worker in there, she must be the one who related to the boss like daughter or whoever....serve us without smile with rude attitude n not even say thank you for the bill!!!   Absolutely not worth to give good tips!!!!  Management also need to be well trained for the services skill.  This really pissed us off!"}
{"text":"Good service, free side dishes. No wifi. Lots of seating available, 24-7.  The side dishes comprises of eggplant, kimchi, green beans, corn. All are great  I ordered the bulgogi dulsot- great if you like sweetness. It comes with 1 bowl of white rice. It was quite filing and full of taste. My hubby ordered the usual pork bone soup, it was average, a bit spicy if you like that."}
{"text":"Was here on a slow Wednesday night and our server girl seemed to have had a bad day or didn't want to work late idk so we tried to give her the benefit of the doubt and not make it a problem but her attitude was kind of annoying.  There was so much to choose from! Not just Korean food but some Japanese and Chinese food too.  The food came really fast and it was all pretty good. *see photo of what we got* So if you don't mind a moody server who leaves you alone most of the time, the food is worth it I think. ^^"}
{"text":"So upset with this place. Me and my friends were regulars here and always came here because it was open late night however upon my most recent visit we asked to order sushi and were turned down because \"they were not serving anymore.\" We waited 40 minutes for our food and we noticed three other tables who received sushi but they came well after and order after us. When we asked the server he said they ran out of rice but prepared it afterwards. How does this make any sense? We saw him talk to the sushi chef and he told him no for our table. I just don't understand. I am extremely upset."}
{"text":"Bad service...we asked for additional side dishes several times; they never brought them over. Quality is below average."}
{"text":"Went here around 11:30pm it was pretty nice. Even though it was late at night the waitress was still happy to greet us.  I had a donkatsu which I REALLY liked because of the sauce which was served with it.  One of the small side dishes caught our attention. We asked what it was but I guess she couldnt understand? And all she replied to us that it was seaweed. (the side dish was clear noodle like but had a crunch when eaten served with a cream sauce)  I'll definately be coming back if I have late night munchies!!"}
{"text":"Kayagum has good service (they have a button on your table that you press if you wish to be served) and really cute decor. I came here for dinner with my Mom and ordered the assorted tempura which was ok - not anything special, although the beef bibimbap and sushi were both really lovely."}
{"text":"Definitely not the best Korean food in the area, but like all 24/7 spots they offer the quick and easy fan favourites at a decent price, and when you're stopping by after a night of drinking it tastes great lol. I've stopped by late at night for fried chicken and pork and the service was quick and friendly."}
{"text":"Kayagum is my go to 24 hour restaurant. I rarely come here anytime before 10pm. Partially because before 9pm you have to pay for parking on the street :D SO THUS, we only come after 9pm, but as a general rule, food tastes better late at night!   My thing about Kayagum is that I think there main dishes are good. Their bigger plates that are meant for sharing, those our go-to's and I'm usually never disappointed. HOWEVER, their regular dishes, like their rolls & jajangmyun, i TRULY don't care for. I actually am not a fan of them at all. So typically when I come with family & friends, we order the larger dishes and share and I'm not disappointed at all.  My favourite dish here is the yukhwae (raw beef - $19.95); on my most recent return, the dish was different and it tasted slightly different - like they changed the recipe, which I wasn't a huge fan of, but typically, on the other thousands of times I've gotten it previously, I loved it. It's flavoured very well, both sweet from the sesame oil but savoury at the same time. It's delicious and it's so refreshing. Our other go to is bossam (steamed pork belly - $16.95 for the set w/ rice and soup; $16.95 for the main dish (goonjung bossam - with more meat, but no soup)). The steamed pork belly is a far healthier version than the table cooking version of it as a lot of the fat is taken away and in the bossam, it's easy to remove the fat. It's delicious with the wrap that they give you and vegetables on the side.   GO (after 9pm AND BEFORE IF YOU MUST!) and enjoy their meats."}
{"text":"Came after a nice day and scene was poppin - lots of people. Decided to opt for the kbbq bulgogi dish which came with small dishes of cold items, soup and rice. Service was a bit slow tonight and I could see one of the waiters constantly running back and forth. Aside from that, seating was kind of weird in that my guest and I were seated at a booth, but one side could only fit one person lol - so I had to sit next to my friend which was kind of awkward that way. Food was alright, nothing too special. There's button service at your table & it's 24 hours."}
{"text":"I like how the restaurant is 24-7. Their pork cutlet is so good. Love their sauce!  Their sushi bar sometimes has uni which is a nice treat.  Really enjoy their ddukboggi as well.   There's free parking available in the condo visitor parking but you have to go into restaurant and get the pass. It's a bit annoying to get to but it's better than paying for parking, right? I can't justify paying for parking in North York just for Korean food."}
{"text":"Pretty standard Korean place. Didn't find the food much better or worse than average.   The service here is a little better/ quicker than the place I usually go (Nak Won). Also they bring out the banchan much sooner after you sit down. But I felt that it's a little bit more pricey, especially after you factor in the slightly smaller dish size. That being said, the kimchi jjigae dish that I ordered had a generous amount of pork.   Not sure if I'll go back during regular hours, but I wouldn't hesitate to return if I was craving Korean in the early hours of the morning."}
{"text":"As is customary in many korean restaurants, if you want service you're expected to push a button on your table - otherwise, servers will leave you alone.   That being said, the food here was simply \"okay\" at best, even during normal dinner hours. With so many other Korean places in the area, you can probably do better.   I was also a bit disappointed - we had a group of 8 and asked if cheques could be separated and they said they couldn't do more than three cheques for our whole group. I get that it's tough to draw separate cheques but if we ask in advance, doesn't that make it better?"}
{"text":"My friends come here last weekend and I was not impressed at all!!! I ordered the donkatsu (which was average) and a tangsuyuk to split between my friends and I. While my friends and I were eating the tangsuyuk, we found steele wool physically fried into one of the pork pieces. They offered us a new one but by the time it came out we were all done eating so we did not even have a chance to enjoy it. When we complained about the taking it off the bill one of the servers argued with us, however the manager ended up taking it off our bill. In addition, we had to call the waitors 2-3 times just to get cold water and chopsticks. I dont know if I'll go back here tbh."}
{"text":"New restaurant on the street. Surprisingly it was very good. Late night and it was still pretty busy, maybe because there's not many choices near by and Koreans like to eat late?  The place was spacious and over food was pretty good compare to other Korean restaurants. I would check out again when I'm in the area."}
{"text":"With their new renovation, Kayagum stepped up their game. The food taste better and service is much better than the last visit. They finally got an English speaking server who is quick, efficient and super friendly! The food had also improved and they added a few new items to the menu. I highly recommend their lion king spicy salmon roll :)  Will definitely return."}
{"text":"I guess all 24 hours place are somehow funky or \"special\" (??)  The seating area are regular Korean restaurant booths, but the decor around is something you have to see to believe. ;)  it's great that you can park at the back of the restaurant for free, or after 9pm you can just park right on Yonge St.  my first time here, I tried the Daeji Bulgogi, it's great, came sizzling hot. second time I had the deep-fried chicken with green onions, it came in a dish much like a deep dish pizza pan, with a ton of green onions totally covering the deep-fried chicken pieces.  the nicest touch is that once you place your order, they will bring you a small bowl of warm hearty thick soup or a congee to whet your appetite. Then they will bring you the side dishes, so when your focus is on the side dishes, you won't notice how time flies.   your bill comes with a small bottle of frozen yogurt drink for each person, so you can enjoy something on your way back to your car.  it's good to have a 24 hours restaurant that is really good (in food and service).  (the missing star is for the fact that they have CP24 on all of their TVs...)"}
{"text":"The food was ok. I ordered the galbitang(beef rib soup) and the Philadelphia roll. I thought it ambitious of them to also have sushi on the menu, the roll was ok, not the greatest also the galbitang was ok. My friend liked her dish though. My only qualm about this place was the service, it seems like the waitresses only favoured the asian customers. They even kept going to the table next to us when we called(you push a button to call them) they didnt even need anything -we did, and then they would walk away not asking if we needed anything, I mean we called for assistance!  They kept giving us cold complimentary tea when its supposed to be hot. Very disappointed, as Ive been wanting to try this place since it opened. Glad I did, probably wont be going there again."}
{"text":"First time being here and ordered chicken bibimbap. Stomach-ache big time. Not sure if I'm just unlucky or what. My friend ordered beef bibimbap and she was okay."}
{"text":"Probably one of the worst Korean restaurants I've been too next to song cooks. The restaurant itself is nice and they have tons of menu options, but that's about it. Ordered the bul nak jungol and tangsooyuk with sauce on the side. The tangsooyuk flavours were totally off, but there was so much left over I decided to take it home. When I went to reheat the sauce the next day there was a dead fly in it. The restaurant is obviously too dark to see that. The bul nak jungol wasn't bad, but way too sweet and not enough octopus. I had been craving Korean food for months and after moving away from the area, I don't have access to great Korean food in my new neighbourhood. I should have remembered I wasn't a fan of this place, but I let my hunger get the best of me. Will not be back."}
{"text":"24-Hour Treat!  I can't complain...it's a great place for 24-hour food when your out late late at night and is craving for more of a hearty meal rather than a burger and fries situation. I have been here couple times I was never like amazingly impressed or have any horrible experiences. It is a good Korean spot for big parties craving for various Korean dishes from Kbbq to staple korean bibimbap.  Last time I went I got the pork and marinated lettuce dish which I absolutely wanted to try ever since I saw it on Korean dramas. The tender pork and the sweet and sour of the lettuce was great and very refreshing. You were supposed to wrap various spices between it. It is not your usuall bbq pork but the kind which has been marinated before hand and then wrapped between and vinegary lettuce for a kick."}
{"text":"I came here with two friends on a Friday night. Usually Korean restaurants are super polite and would provide us with tea and water right away.  However, this place did not give us the or water for the next half an hour even though we asked serveraly times.  The waiter had horrible attitude.  The food was very average.  I would recommend song Cooks or even galleria if I had to.  (24h)."}
{"text":"Great food and the selection is quite extensive. Great to experience authentic Korean dishes and still be able to dable in Chinese or Japanese cuisine as well. Good service and prices are quite reasonable. They give you lots of side dishes too so great if you are hungry."}
{"text":"New 24 hours Korean Restaurant North York.  I was impressed by their pumpkin congee. I haven't seen it for a while in Korean restaurants in Toronto. However, next time i came over, that congee was served cold...... I love the sea food cheese rice cake and the cold noodle. Totally see it would become one of my new usual spot."}
{"text":"Chicken Katsu never fails to satisfy my cravings. I've had it like a dozen times there. Prices are good too.   Gotta press the doorbell button on the table to get a servers' attention which is nice, but many times they won't notice the first time that you press it."}
{"text":"My go-to for a late snack/food. I'm a regular here and I can say that their sushi are A1. Shout out to Daniel for making it happen."}
{"text":"This place is nothing special, their food and service are both mediocre. My last visit, I was in a rush so I came here for naengmyun and I found it a bit bland. I've definitely had better. My recent visit, I had the dwaejangjigae and I found it to be a bit too salty for my liking and the portion was so small.   I would say, this place would be good if you're looking for some comfort food late at night. But if you want a delicious meal..go elsewhere!"}
{"text":"I ate the kalbi bento box. It was delicious and the presentation was good. Comes with salad, deep fried tempera including shrimp, sweet potato, broccoli, zucchini and onion. The only thing that bothered me was the mushy part of the rice (didn't seem fresh) and the miso soup had a weird smell. My sister ate the vegetable dolsotbibimbap which she liked and she also drank all of the weird smelling miso soup xD.  The workers are friendly and the atmosphere is good."}
{"text":"We came around 7:30pm on a Friday night.  Service is a bit slow but friendly (they forgot or water but no biggie).  The tables are quite wide and big so I can't play footsie with my wife.  We had the chicken and beef bipbimbop.  Flavor-wise it's average.  Quantity-wise it's below average for the price.  They're actually quite busy for some reason.  Perhaps we weren't ordering the good stuff.  You'll be hearing a lot of 'ding dongs' from the bells that go off to call for service.  Would I come back?  Probably when it's late when there's not much options (they are open 24 hours).  Service - 3/5 Food - 2.5/5 Ambience - 3/5"}
{"text":"Came by here for casual lunch with friends. I was surprised they didn't have more people in the restaurant. A bit odd for a Sunday lunch time. Though I gathered cause it was quite late. One thing I did notice: the venue had a really dark decor. As I sat down, I felt some awkwardness in the air. Anyhow we all ordered food, the menu had the usual Korean fare. But I decided to play it safe and ordered a bento box. The server gave us a head's up the sushi will take a bit longer. The food did take some time to arrive, but kind of glad it did. It did look appetizing, and the food is just \"okay\". There's nothing wow-ing about it. Likely won't come back."}
{"text":"The \"grand opening\" banner is still out :o I'm not sure exactly how long it's been open. But there was a 10% family day discount.   The decor is really pretty, can probably use the word \"classy\" to describe it...but classy in an Asian way. The restaurant is nicely lit, very spacious, and they even put a real rose in a vase at each table. They only have booth seats :D I love booth seats. But in addition to the booth seats, they also have an area where you sit on the floor and eat on this \"low\" table, and a party room that is sectioned out. This Korean restaurant also serves some Japanese dishes, namely sushi rolls, which explains the combination of Japanese style decor inside and outside of the restaurant.  The service isn't top-notched, but that's probably because they are still new and the servers are still raw. But they are very friendly. We weren't given an additional place mat until requested, and tea were not promptly served. But I am sure this aspect of their service will improve once they get used to it.   The beef bone soup is alright, but the stone pot rice is really good. The food costs around the same as most places, although some dishes may be a dollar more than usual. The side dishes were also decent, although they do not provide too many varieties. When you pay the bill, they provide you with a bottle of those yogurt milks and a piece of chocolate. :D  But da*n, I love how they decorated it."}
{"text":"Been here many times before because of the convenient location, but every single visit I made had bad service and sub par Korean food. The problem with 24/7 places is the sanitation of the restaurant and the freshness of the food. I just came back from there because friends wanted to eat there and waited 30+ minutes for my pork, katsu and still didn't come out because they forgot the order and it wasn't even busy."}
{"text":"This is a long time restaurant in the area and was always a 24 hours korean/japanese restaurant.   we had went for the lunch time specials, this restaurant is average priced when it comes to lunch time specials. and is not overpriced. it is only dinner time where it becomes more pricey for dishes.   The food was pretty okay, as the bento box had quite a few pieces of kalbi short ribs which were cooked pretty well. and was decent for the most parts. The pork bone soup was not bad and was decently priced for the lunch specials.   The side dishes were not as diverse as some other places. however overall. it was a decent experience. This is one of those places that because it is 24 hours, there is a feeling that they are always understaffed. and for that reason, the service suffers in terms of response times.   I would definitely consider this a date restaurant for couples, since the decor is generally warm and inviting and has a more intimate setting.   i would recommend others to go for a good lunch time, or if for some reason they are up really late and just want to get some food. this is a good option since it is afterall 24 hours."}
{"text":"- service was ok, kinda had to keep calling the waiter rather than him checking up on us - apps werent plentiful as most korean restaurants offer AND not refillable  - food was good though"}
{"text":"Great service. So conveniently located at yonge and finch.   24 hours  Nom nom nom all day"}
{"text":"I was here for a casual dinner with a few girlfriends on a weeknight. I have to say, I am not a fan of this place. The seating was big and awkward, the service was definately lacking, the food portion compared to other Korean restaurants were small, and the food quality was just satisfactory. I have definately been to better Kirean restaurants.  I don't think I would come back."}
{"text":"The food is ok, but the service is really slow. The prices are not overpriced which is the only saving grace."}
{"text":"Extremely impolite staff and sub par quality food. Our waitress did not utter a word and served us as if we were animals. She would throw the dishes and slam the tea pot. Never going back here again. There are much better Korean options in the area."}
{"text":"This place is pretty shit, from what I can recall.  One of the biggest places at the yonge and finch area and it's just ugh. I've read other reviews that boast about the service but how come I never get it? Maybe it's because I always come here late at night around 1-3am. We sometimes wander here because of the 24/7 attraction and many other stores are already closed. Every time we come in, the old man at the front kind of glances at us but doesn't really make any effort to get up from his perch to seat us. We are never seated quickly and when we order, no matter how many times we hammer down on the bitch bell, they never come.   The food is pretty bad and inconsistent. Sometimes I am able to order rolls after 12am and other times, I'm told that they're never served past midnight. What?! Get your shit together. The portions are small and the food is nothing memorable. Don't get me wrong, it's not horribly disgusting but why am I paying for an overpriced portion of undercooked and tasteless gamjatang? Also made the mistake of trying the bi bim naeng myun here, which was $12ish and the portion was the size of my fist. The taste was no comparison to the usual korean spice that other places offer. When I finished, my stomach was uneasy and I was unsatisfied.   I really dislike coming here but I hope I don't find it in my heart again to give it another chance."}
{"text":"It's open 24-hours, which is always a plus. I went here for the 2nd time at 4am and it was practically empty. In fact, the two staff members looked quite unhappy to see us there.   Service was relatively quick. We were given a set of appetizers before receiving our dishes - tofu, kimchi, cucumbers. These were quite good.   I ordered a beef soup, #6 on the menu I believe. To my surprise, there were only three very thin slices of beef in the soup, and the rest of the bowl was quite flavourless. My dish was quite a disappointment, but the rest of the group I was with enjoyed their gam ja tang and fried chicken.   The second occurrence of bad service was when we asked for the bill, which we specifically asked for to be separate. He mixed up our bills three times, and kissing his teeth and looking frustrated even though each time we told him exactly how to split it up.   Next time I'm in the area late at night, I think i'll just go to Owl."}
{"text":"Good place to eat out with friends, the food was delicious especially jjampong and jjajagyun. Great place to split prices on the BBQ portion"}
{"text":"A friend suggested this restaurant for lunch the other day and since they've only been open for 5 months (opening date was February 2012), we figured we'd give them a shot!  This place is so quirky it made me laugh... and I'm still not sure of story behind the spaceship! Perhaps somethings are better left to the imagination. There is plenty of seating here and plenty to look at.  As soon as we were seated, we were presented with, what I thought was a cup of green or jasmine tea... not the case!... it was a refreshing cup of cold Barley tea! What a pleasant surprise!  Our waitress then brought us six little dishes which contained vegetable pancake (my favourite!), bean sprouts, spicy eggplant, kimchi, deodeok and seaweed.  We both ordered the Beef DolSotBiBimBap ($8.95):  Shiitake mushrooms, bean sprouts, zucchini, carrots and Asian style spinach all served over rice with a beautiful bright yellow egg yolk sitting on top.  Within minutes of placing our order, our waitress was back with our 'appetizer' (which I thought were the little six dishes but apparently not)... a beautiful bowl of warm delicious squash soup! So creamy and sweet - it was the perfect start to, what turned out to be, a wonderful meal.  Our main arrived accompanied with a bowl of Miso soup (a little too salty for my liking but because everything else was so absolutely brilliant, I didn't care).  I found the BiBimBap to be quite similar to a beef donburi that I get a Japanese restaurants; although the seasoning is slightly different and the vegetables were cooked al denté so their colours remained vibrant and their texture fresh and crisp.  I thoroughly enjoyed this dish!! Unfortunately, I was so excited about digging into my BiBimBap, I forgot to snap a picture before I stirred in the egg... the presentation was quite beautiful. Oh well, it gives me an excuse to go back again!  Our waitress was extremely attentive and walked us through every dish placed before us which was appreciated because I'd never had Korean food before.  When our bill arrived, instead of receiving candies or mints on the cheque tray, we received two little bottles of a yogurt drink that was absolutely to die for! To us, it tasted like it might be strawberry lychee but I'm not sure. It was really good though and a perfect end to our adventure."}
{"text":"I wouldn't say this is my favourite Korean restaurant. Went here for a quick bite for lunch. Had the chicken katsu, and I have to say it wasn't the best. There was a lot of sauce that overpowered the taste of the chicken.   Aside from the food, the environment was good, the booths were cozy, and the service was good. A nice quiet place to eat"}
{"text":"I came here for lunch during peak lunch hours on a weekday. The restaurant was really empty which was a sign to me that it's not that popular.   Service: service was minimum and you press a button to call for them. This is a typical korean restaurant with buttons to call for service instead of servers walking around to serve you.   Food: my group ordered a variety of dishes to share.   Spicy volcano roll- this did NOT look like the picture at all. In the picture, they showed a bunch of rolls stacked up and there was a lot of scallops on top. But when they served it, it was not stacked up. Instead it was lined up with less toppings on it compared to the picture. We were misled to think that this roll had a lot of seafood given the price of $15.   Roll combo B- this contained a California, spicy salmon and spicy tuna roll. This set was decent.   Chicken- probably the worst dish out of everything we ordered. It was supposed to be \"\" which is a deep fried spicy chicken. This chicken dish is supposed to be really crispy which it wasn't. Also it was supposed to be spicy which it wasn't. It was more sweet than spicy. I felt like I was eating sweet and sour chicken.   I gave this restaurant a try and it did not impress. It is a huge establishment and they are open 24hours. It is great if you want food late night. But if you looking for a restaurant in the area during daytime, there are endless restaurants in this strip serving much better korean food."}
{"text":"The food was good but the service was really bad. The guy who talked with us when paying the bill was really rude and impatience."}
{"text":"Ordered chicken katsu and vegetable tempura. I was seated near the sushi bar and noticed fruit flies buzzing about. The chicken was completely inedible. After trying the first piece it was clear the meat was spoiled. Unfortunately I later learned that the morsel of tainted chicken I ate was enough to contract food poisoning. Since I was very hungry I tried the tempura to sate my hunger. It was greasy and tasted like they don't change the oil very often. The server was completely was utterly unapologetic and used a tone suggestive that I was the one at fault. To top it all off they insisted on being payed in cash but made no mention of this until afterwards.   Later I looked up this restaurant on Dinesafe where you can see they have a history of food safety violation. There are plenty of Korean restaurants in the area so do yourself a favour and skip Kayagum."}
{"text":"Toronto foodies beware!   If u want to go to a place to eat good food with any sort of service, please find another restaurant.   Never in my life have I ever been treated so badly as a paying customer.   I don't know where to even start.   I came to eat here with a group of over 20 people. They only gave us 2 menus and one small jug of water that filled 4 cups. Major attitude was given to us when we asked the waitress for more water and menu.   Their menu is very misleading and unclear. I wanted to order BBQ pork belly and beef short ribs. I was very excited to eat the pork belly. But unfortunately, the menu requires me to order at least two portions of the same thing! Which means if I wanted pork belly and beef short ribs, I had to get 4 orders! (Each order was $18-$30) I tried to explain to the waitress that i was the only person in the group that wanted to have BBQ and I cannot eat 4 orders myself. I was basically told \"Too bad, find something else to eat.\" Not only were they unhelpful, they were extremely rude. I am disgusted with the level service I have received.   I brought them a group of over 20 people to their empty restaurant, and all we received was shitty attitude.   If you want to eat Korean food, literally any restaurant on Yonge and finch is better than this one."}
{"text":"A bit disappointed. Service was good but utensils didnt seem too clean. Food was subpar nothing memorable. Don't think I'll be back"}
{"text":"We always come here for soup/other korean dishes. This place is close to my hair dresser, so we usually come here for a quick meal. I would give a 4 star to this place for my previous experience.   Here is why 1 star for today's visit. Clearly we are not satisfied with today's dinner. Me and my husband ordered 2 beef BBQ(Beef + beef ribs). Its almost $40 buck per person. It is definitely on the pricy side, but we still decided to try it because it looks too good on the menu/pictures.   When they place a plate of meat in front of us. It was a huge disappointment. First thing we noticed was the portion. It was so small, i wish i took a picture to show everyone what you get for 90 bucks bbq meat. There was less than 10 piece of meat, and each one is about your finger size. Okay. i was thinking, maybe it might taste good. Nope! The beef rib was so chewy to the point I can't swallow it. And the quality of the meat is really bad, it was tasteless. All you can eat bbq beef taste better than this, at least i can chew the beef.   We ended up paying 90 bucks for a dinner we are not full, we just ate some side dishes and some small pieces of low quality beef and a soup. I think this is just ridiculous.   They are definitely under-staffed on a friday night, but people there are at least friendly. The 1 star is for their service.   I will never go back to this restaurant due to this poor experience.  If you are reading this review and already in this restaurant, do NOT order their BBQ. You get better quality of food at all you can eat BBQ and cheaper."}
{"text":"This was a Korean grocery store a few years ago. Now it's a kind of generic Korean restaurant. All your old favorites. It's bright, modern, white, clean. Playful accents like a rocketship busting through the roof.   Service is a bit slow. We had to ring the bell four times before resorting to the old \"wave your sever down\" technique. No odeng for your banchan. I'm always liking that stuff. No plain simple dukboki or jjajangmyun on the menu. The 24 hours service makes it a compelling addition to the Korean dining scene."}
{"text":"Food was good but the service was really bad, did not feel welcomed when I walked through the door and after the food came, no one asked how I'm doing. When I asked for the bill I rang the bell 2 times and no one showed up. I waited 10 mins before I rang a second time and no one came until the third ring. When the server came it wasn't even the same server serving me this whole time and was apparently our actual server and when I paid he started to give me a really hard time about the tip I gave him which was a little less then 10% but I feel that he shouldn't deserve 10% because he didn't bring our food or even show his face to our table. I would've paid 10% or more if it was the other server. Wouldn't recommend dining here terrible service you can find somewhere else with same quality food and better service."}
{"text":"We stopped by Kayagum out of convenience and everything about our experience here was subpar. The restaurant was quite empty yet it still took us a while to get seated and flag down a waiter to take our order. The restaurant staff didn't seem able to handle just a few tables.  The food here is only okay. I had the Salmon Bibimbap and the salmon was decent, but the rest tasted really plain.   I guess this is a good spot to get something late at night since it's open 24/7, but don't expect great food."}
{"text":"Went with a few friends after language exchange. This place is big. The provided 4 side dishes - Kimchi, pickled cucumber, potato salad and seaweed. They were all delicious specially the seaweed - I would say the best side dishes I've had in a Korean restaurant. I ordered the bulgogi soup and asked for extra spicy. The waitress said the can't do spicy for the dish but then complied. The soup was delicious however portion kinda small."}
{"text":"Came here for lunch on a weekday bc a friend suggested it. It wasnt the greatest or the worst, fairly priced. I had a bulgogi bento box.. It was okay. We ordered a side portion of Kalbi as well...over cooked. Burnt. But the sashimi salad was good. My friends ordered the bimbimbap.. Which was a smaller portion.. It came in the stone soup bowls instead of the larger bimbimbap stone bowls.. And was not hot enough because the outer rice wasn't crispy. Would only come back if everything else was closed... And I had no other choice."}
{"text":"This place is great - we come here often as it is 24hrs. The decor is so strange, in the best way. There are lots of tv's around playing music videos/korean dramas. The food is your standard korean-japanese fare. The banchan are standard, I've gotten more at other places but they are tasty. The sashimi/sushi is good, nothing spectacular but hits the spot nicely and helps cut the heat of the korean food! The korean food is the same, very tasty. Our favourite dish is the cheesy seafood ddeok - SO GOOD. All in all a great place to go at any hour for a good time and good food."}
{"text":"Ordered the jajangmyun for take out. Service was great but the jajangmyun is bad. Watery. Weird noodles. Bland taste. Oh well."}
{"text":"Kayagum is a little pricey compared to other Korean restaurants in the area but it offers variety of options and the quality is pretty good. It is usually packed on friday and saturday dinner time but the wait is never too terrible. Getting the bill is a bit of an hassle because you have to ring the bell a couple times but now I learned and go straight to the cashier at the front. Overall, satisfied every time and the convenient location is a bonus."}
{"text":"There was a dead fly on our salmon sashimi. You can clearly see the leg, but they said it was leaf-.-\". Never ordering sashimi from here again."}
{"text":"Been coming here since summer 2017! Great korean food, I noticed today they raised their prices. Good for late night comfort food (soup, sushi and bimbimbap)."}
{"text":"Had dinner here on a Saturday.  Ordered: Caterpillar Poke sushi Spicy tuna/salmon Grilled squid House ramen Beef ribs came with rice Free ban chan as appetizers.  Ambiance was dark but clean. Customer service was ok. Food was ok. Prices were reasonable. Washroom was clean."}
{"text":"It was my first time here with my sister, she lived in the area and I decided this is what I was craving.. I have always eaten Korean food growing up so I know what I like.. It wasn't busy when we walked in, maybe 3 tables..  It took them 5 minutes for them to even notice us, even seat us and give us water another 15 minutes. At this point I'm really annoyed but I decided to give them another chance to redeem themselves.   We sit down and order salmon sashimi, japchae and Hwe Dup Bap.. They give us our banchan which was mashed potatoes, kimchi and fried anchovy with peanuts.. It was a nightmare to get any servers attention to get more water.. So when we did get water she dropped down the glass of water hard, spilling it all over the table, walked away didn't care, didn't bother to apologize or come clean it up..   Honest to god in all the years have I eaten out or spend time in a restaurant (I've been a chef in the culinary business for 15 years, so I know how all parts of the house works with restaurant, I wasn't born yesterday).. I have never been so offended ever in my life..  NO matter how good food is or how EXPENSIVE it is (money is never a issue when it comes to good food), but if the SERVICE is horrible I will NEVER EVER step foot back in that restaurant and I will tell everyone I know about my experiences..  Thus the 2 star rating.."}
{"text":"24hr restaurant which provides reasonably priced Korean and Japanese choices for the undecided group. Service is very prompt and friendly and if ever you need to get a waiters attention quickly there's a little ringer on the table as well. Typically I order the Bi Bim Bap, Gam Ja Tang or sushi bento boxes from here. Being a restaurant that doesn't specialize in a specific cuisine, you can find better options in the neighborhood for Korean or Japanese.  Tip: debit only under 20$"}
{"text":"Came on a Tuesday evening with a couple of friends. This ended up being our convenient back-up plan since Lim Ga Ne was entirely packed.   Overall the experience was underwhelming.   The Food:  I had the Gam Ja Tang (Pork Bone Soup) and found myself looking for more pork. I guess having been to other korean restaurants before, The pork was tender and the broth was good, but the ratio of pork bone to soup was limited.  I can't recall the two dishes my friends had, but they looked tasty.   We also shared a Red Dragon Roll (I was surprised to see their extensive sushi menu here. The role again was underwhelming - not a lot of flavour coming from the fish.   As part of the overall experience - my tea was accidently spilt on me as our server collected our menus. No scalding pain or anything, but a slight annoyance.  I probably wouldn't come back to this restaurant if the chance were to arise."}
{"text":"My favorite Korean restaurant in the Y&F area. Best kalbi soup.. so tasty and beef is so tender! Also love their kalbi. it's $18 or so and kinda pricey but it comes in a big hot plate and it's sooooo tasty! Their rice cake with cheese and seafood is also very good and tender. The restaurant is spacious enough for you to come as a group and it's 24 hours! I came with 13 people once and we were seated in a semi private area at the back. I have had many things from their menu and haven't ever had anything bad. I did once find a not so nice particle in my food here but when I pointed it out, they re-made a new one for me which I appreciate. I mean, hey, accidents happen. It's okay once but just don't let there a second time."}
{"text":"Kayagum is generally a hit or miss in my opinion. I've been here about 3 or 4 times already and the food and service vary. Prices here are good with a wide selection of Chinese/Japanese/Korean food. The place is also open 24/7 which is convenient.   This time, I came as a group of 3 and got the bulgogi deopbap ($9.99). We were seated and served extremely quickly, our side dishes were refilled and the food was decent! We had really friendly and attentive servers. The dish I ordered came with a generous amount of meat (no vegetables), rice and a miso soup. The soup was too salty for me and had nothing in it besides scallions, same with the bulgogi. However, the meat was very tender and well-marinated. What I found interesting was the side dishes. One of them was broccoli with red bell peppers and tofu which was really good and new to me! The potatoes here are also delicious.   lt is a rather large space so great for big groups. However, it is more dimly lit here so it depends on what type of environment u prefer.  I would come back again but this place is not particularly special (3.5/5)."}
{"text":"This restaurant isn't deserving of a single star... we came in trying to get a party of tray that they offer i think its like 40 rolls for 45$ something along the lines of that. My order was a little specific because my boyfriend and i are vegetarian and he has an allergy to fish eggs. The guy taking our takeout order was ON HIS PHONE while taking our order and i made sure i was specific on what i wanted. They were not accommodating whatsoever and would not remove the two orders of spicy salmon rolls for us and make then California rolls. (Cheaper options) They ended up saying yes then made us wait 40 MINUTES for the rolls, we were called in to pay and majority of the rolls had fish eggs on them and they made 3 orders of spicy salmon!!!!!! After asking them to remake them BECAUSE OF AN ALLERGY they refused and KICKED US OUT OF THE RESTAURANT! I have never in my life been treated so disgustingly. I will NEVER be back at this restaurant, and I recommend nobody else does either."}
{"text":"I like their menu and the side dishes. Menu had a lot of choices and the side dishes aren't the most common ones served at other korean restaurants except for the kimchi of course.   When it comes to portions, I find it somewhat small. I ordered gamjatang and it had like 2 or 2.5 bones in it. Usually minimum is 3 at other places. I mean broth was good. Good but small.   Might come back here to try other items but not anytime soon."}
{"text":"First time there Feb 14th and would say this place is pretty good, I really like how they also have the Japanese options there too. Overall, food was great.. no complaints.. they had a wide variety."}
{"text":"Been a few years and thought we would give them a chance again. But again it was a bit disappointing and this time the food was a bit crap. The wait time wasn't long. In fact, if you ordered things from the korean menu it came much faster. I had a craving for rolls (as I usually do) and ordered their dynamic roll 8pcs) The pieces were cut smaller than what I'm used to. So in reality it was really 4 pcs. It came after all the main entrees my friends ordered and you would think rolls are easier to make.   Tried a bit of the bibimbop but IMHO the meat was very dry.   Service in general was fast. But the lady who sat us was a bit rude. We wanted to sit by the window and when we asked she sounded annoyed and said \"it's reserved!!\" then scoffed and went off after dumping our menus at another table. Eye roller. The other servers (when it came time to ordering) were much nicer. Although the one who cleared our table was odd. We had just finished paying and were about to leave but he decided to clear everything right there and then with the cart in the way, blocking some of us in. Can't wait another minute ?  Food is fine if you need something in a hurry.   Probably won't be coming back again!"}
{"text":"Best of the best. It's not fancy but it just feel right.  I always go there to eat since I live close by and the people there are pretty nice. Good service, good food and good environment. This restaurant deserves a 5star"}
{"text":"-Open 24 hrs  -Staff were attentive and friendly -Pork bone soup was tasty -Side dishes were tasty -Will return! -CASH ONLY is the only downside"}
{"text":"Great food but the server signal one of my friends out asking her why she didn't give a tip. We had paid seperately and I had already paid my share along with the tip for my entire group. Very unprofessional server that needs to learn that a tip is not mandatory."}
{"text":"3 stars minus 1 star for their nasty washrooms. I haven't been to this restaurant in more than a year, so I was excited to be back! Who doesn't like 24/7 service.  Their menu is pretty extensive ranging from Kbbq, Korean main dishes, Korean Chinese dishes and sushi. We got samsun jjajjangmyun (seafood black bean noodles). It was pretty good.  I don't think I'd come back here though after seeing their dirty washrooms. Lucky me someone just finished cleaning it before I entered but I didn't think it was clean enough, because it seemed like he only took out the garbage."}
{"text":"When you simply need to eat at 4 or 5 in the morning, and you're in the Yonge and Finch area, this is the spot.  I've been here twice, once at 3:30 and once at 4:30 and had great service from the same guy (don't know his name). On top of the great service, the food ordered was also amazing. We even got complimentary soup during our last visit. You can order anything you'd expect at a typical Korean restaurant.   Seriously though, late night hunger pains - go here!  Side note: after hours, Blake is your man!"}
{"text":"Food here is eh...  I came here for a lunch special with my friend and ordered the pork bulgogi dolsot and my friend ordered chicken katsu. Their banchan selection is less than what I usually get in other Korean restaurants and they served miso soup (I dont know how to split that with two people lol) and white rice than the traditional purple rice. The pork bulgogi soup was spicy!! But other than that, nothing really extraordinary. My tummy didnt take the food too well after though.. Food gets pushed around a cart. They also served sushi and chinese food.   We were seated immediately. The box was missing chopsticks so we had to notify the waitress by pressing the button. Service is kind of slow as we had to remind her twice and ringing the bell gets pretty annoying.  It's a 24h joint but there are others around the area far better."}
{"text":"Service was super bad. We found hair in one of the side dishes. We sent the dish back but the server never brought another dish to us. The yakitori was cold. I think they took the yakitori out of the freezer then not  heated it properly.  One of the server was bad as he put everything on our table in an angry manner and we had a feeling that the food could be spilled out of the dish. When we asked for the boxes, the server just gave us a sign (later he claimed he actually told us - with his voice - to wait for him for a minute).   When we got the bill, we asked to see the manager, and things started getting worse. We talked about the issues to the \"manager\", and he accused us for \"trying to pay less\" and asked \"what do you want\".And was just plain rude and denied all allegations.  We were tired of arguing with the \"manager\" so we asked for the machine to pay the bill. The rude server came and asked us what was wrong with him because he felt he did not do anything wrong. He only came to us because the \"manager\" asked him to \"fix the problem\". After talking to the manager, the server was not even a problem to us anymore.   I was a regular customer and I have never experienced such bad services like this. I was disappointed and I will never come here again"}
{"text":"Went here a little past midnight with my boyfriend. We weren't even greeted and were immediately ushered to a seat where the waiter threw the menus on the table. My boyfriend got a sushi bento and I got kimchi fried rice. The food was pretty decent and the side dishes were good. However, I had to ask multiple times for water.   Overall, not a bad place. Don't think I'll come back here though, especially after reading the reviews."}
{"text":"Been here twice the first was three days ago, and then again last night! Great service, and food. I highly recommend. However, I found on Yelp that there was a private parking lot for Kayagum? I couldn't find it.   One of the better 24h Korean restaurant.  I'll be here often"}
{"text":"Food was alright. Service was terrible. We had a table of 9 people and we asked to split the bill. They said no and asked us to put it onto 3 bills. Almost all of us had cash, so they reluctantly split it individually for us. I'm pretty sure they don't split it because they don't want to pay the charges for renting the card machines.  My friend paid for a $13 bill with a $20 and I paid with a larger bill. The server only came back with my change and expected my friend to pay $7 in tip. When they asked for change back from the server, she only came back with a $5 bill and forced him to tip the rest.  One of the only people who paid with card was told after he paid that the server forgot to add a 50 cent charge for using the machine onto his bill. When he said to take it out of the tip which was well over 15%, the server refused and told him to pay the 50 cents. I won't be coming back here again because the service is ridiculously terrible."}
{"text":"Food quality is poor. They dont even give miso soup for pork cultet anymore. What restaurant doesnt serve a basic miso soup for pork cutlet?"}
{"text":"Decided to go to the Finch area just to eat but we wanted to go somewhere we haven't gone to before. I've walked past this place many times and yesterday was the day to try it. The environment was cozy, the lights dimly lit but still friendly. I got the bulgogi dolsot because I was craving bulgogi. The meat itself was a lot thicker than other places I've been to but the soup is heavenly! I enjoyed the side dishes, especially the one with fish cake."}
{"text":"I'm always here for their Korean food but, finally... I had a chance to try out their Japanese food.   Came here for lunch with a couple of friends last week and we ordered a big platter of sushi (I believe it was the Dinner Set that was around $25) and the Bulgogi Bento Box (about $9). Their lunch special ends at 4pm. I'd have to admit the sashimi sushi from the platter was not as fresh as I expected however, the hands rolls were really tasty. It came with assorted sashimi sushi (salmon, tuna & bbq eel) and 3 different rolls (california, spicy salmon and dynamite I believe). For $9, the bento box was pretty satisfying. It came with miso soup, salad, tempura, rice, bean sprouts and of course, bulgogi.   Unfortunately, they do not serve bento boxes during dinner time. The only Japanese stuff that was open for dinner was the dinner sets, some appetizers and dishes. I wish they had more variety and would include the bento boxes for dinner because they were pretty darn good!"}
{"text":"Kayagum is amazing! I honestly don't know how I've been living without coming here! When I wake up at 3 in the morning craving Korean food, my boyfriend and I will just drive here (it's a 15 minute drive from our place). The servers are always very friendly. The ambiance is also amazing (I have sensitive ears so a place that's not too loud is a huge bonus for me). The food is also very delicious but personally I wouldn't get the sushi very late at night. Best place ever!"}
{"text":"Came here a while ago, but I remember they had poor communication and the food was mediocre. Pretty sure not much has changed since then."}
{"text":"When you're hungry and drunk at 2am, it's tough to find a good spot that will satisfy both your tummy and taste buds (Mcdonalds doesn't count). Conveniently located right at Yonge and Finch, next to countless karaoke and bars in the area, you can now go grab some late night korean food! YUM!  Food itself is pretty standard. Side dishes, soups, kbbq... Nothing out of the spectacular that will blow you away. But brownie points for opening 24 hours since your choices at 4am is next to nothing other than Mcdonalds."}
{"text":"Ring the bell if you want service! Seriously, if not you will be sitting here the whole evening watching PSY and wondering what's happen!  I dare you to order Korean Spicy... Yes they will do it for you.. and I had the spiciest fried chicken ($15.95) I ever had, lucky I have a beer to wash that down!! Sadly, white meat was used though a healthy option but just a tad dry. The chicken also lack the crispiness....  Grilled Squid in Hot Sauce ($8.95) though served on a heated iron pan but not sizzling... sauce is hot.. but taste a little one dimensional... But still OK to eat as a beer snack for late night!  My friend's Soon Tofu Stew ($7.95) though ordered regular spicy (mild) but he was just covered in sweat while eating that? He finished the whole soup with the help of some cold OJ ($2.50). Maybe he just weak?  Kayagum is awesome as a 24 hour restaurant as might want some spicy Soon Tofu as breakfast?!"}
{"text":"I have nothing but great things to say about this restaurant. Since my fiancee is Korean, we are always trying out new restaurants in the Yonge/Finch and Koreatown areas.   I was extremely impressed with the overall service of this restaurant and the food itself. It has become my favorite place of the \"Korean\" restaurants. The management and servers are very nice. I don't want to set a precedent but we had a special request and they were keen to help - bottom line - excellent service. Some of the servers are younger Korean's and they typically are quite busy. I saw one of the other comments about waiting a bit, but that is also why they have the small ringer buttons to get the attention of the staff (common in Asia). Don't be afraid to use them!  In terms of the food itself, the banchans are very good, although Buk Chang Dong Soon Tofu across the street probably has slightly better ones. The thing I love about this restaurant as well is the ability to get sushi rolls when I am tired of eating Korean food, but my fiancee wants to go. It is an excellent plus and the food has been very good everything.   In terms of hours and pricing, how can you beat 24 hours open and $20 to $25 dollars for two people to eat? You can't!!!!  Highly Recommended....."}
{"text":"This place is a joke. Its extremely dirty, like the never ever bother to clean the interior or floors covered with mud and dust. Food portions are small with tiny amounts of fish/meat, but prices are above average. (Eg. Small avocado salad $7, bento with few pieces of tiny sashimi $19). They bring you those cheap spicy appetizers for free, but they also include them in your bentos and other combos to fill up the space. Seriously? Why do i have to pay for them as part of my combo? Servers rarely come to your table even if you press the button. Oh, and many of them barely speak any English and are pretty rude. Didn't leave a tip last time since I was't satisfied with both food and service and guess what? The server asked me exactly: \"why there is no tip?\" Are you freaking kidding me???  Learn some basic manners! Never ever in my life I heard that somebody was asked on a spot by a server why they left no tip. Avoid this place! Its dirty, overpriced and has shitty quality food and staff."}
{"text":"We ordered the jajangmyeon and jokbal. The jajangmyeon was alright. Not the best I've had (too sweet) but it was pretty filling. The complimentary side dishes were pretty good and they give you generous amounts. The jokbal made me nauseous after one bite, but I think that probably holds true for jokbal from any restaurant. One big negative about this place are the nasty washrooms. They're very filthy, which makes you wonder what the kitchen looks like."}
{"text":"Food was good and possibly without MSG.  Service was very poor and would not return given the competition in that area.  No napkins were provided and nobody came to take our order until we discovered that the plastic bubble on the table was a service bell.  Had better service at a Pho restaurant serving $10 meals and here I am paying $25.  Lastly, a dish stated that it came with multi-grain rice, but was actually served with cheaper steamed white rice."}
{"text":"Apparently I was told this is one of the few Korean restaurants to take reservation, which is good because we were a large party.  I was one of the first few to arrive, and was seated immediately.  A pot of tea followed.   There were about 10 people, and orders were taken quickly.  Food also came to us pretty fast.  I ordered the bbq beef ribs bento, and that was really tasty.  The portion was decent as well.  No one complained about the food.  The only protest was that we were all squished together at the table where we could have changed to one of the bigger tables that was empty nearby.  Another thing is that they take debit cards, not credit cards. I would go back for sure."}
{"text":"Came here with my friend because we were cold and hungry.  Food was good. I ordered the pork bone and potato soup. I was pretty much what i expected. warm, spicy, savoury with just the right amount of salt. Also pretty cheap which is good since we're broke.  My friend ordered sushi and said it was very good and presentation was great.   Wait staff were very attentive and the call button at every table made it easier to get something you need (this was kinda cool).  Atmosphere is pretty good too but seems kinda confused at times since there are random decorations that don't match with the theme.  Overall I'd come back sometime."}
{"text":"Neither the food nor the service were good. After we were seated and ordered our food, I asked for some tea. after 10 minutes of waiting, I asked for tea again, after which the waitress brought it immediately. The tea was COLD, not even warm. When we opened the kettle, there was less than half in it, so I assume it was picked from another table, and was just brought over to us. Other than that, the servers were invisible; they came if you called them, and wouldn't utter a word, and looked displeased all the time.  Other than the miso soup that felt completely watered down, the food was fairly average. My biggest concern however was the portions. I ordered a sushi and sashimi dinner. The sashimi were tiny. I have never had sashimi as small before, not even in all you can eat places. The sushi and rolls were alright. I won't be coming back again."}
