{"text":"Fun time here.

It all depends too the right chef you get, that will make the difference.
I guess we've been lucky. Great food, slightly overpriced because of the show/entertainment of the chefs cooking in front of  you in the teppanyaki section of the restaurant.

*upgrade to fried rice while at the teppanyaki, worth the extra $1.80

lates"}
{"text":"good value for your dollar.  you get a lot of food. it's tasty but they use a lot of salt.  They put on a good show.  I'd go back."}
{"text":"Best Korean food I have had outside of Korea! We ordered a lot of food between the two of us, the dolsot bibimbap was excellent, perfect combination of flavours. 

The side dishes were also very delicious and I made a point to tell the waitress about how good their kimchi is, and she told me an interesting story about how much cabbage they go through in a week making kimchi, and that it is made right there on the property!

My only small complaint would be the price, but the food, service and decor were perfect for a date, so it didn't really bother me."}
{"text":"Mmm... some good ol' Korean soul food. 

Let me first start off by saying I've only tried the BBQ side so I can't comment on the teppanaki-side of things. But oh damn, the BBQ was good. 

G's parents were in town so we went on a nice family excursion with my mom to have some Korean BBQ for dinner on a Friday night. It actually wasn't as busy as I thought it would be even though we arrived around 8pm.

The decor? Not a huge fan. Seriously, the red and black waves and lines are better suited for Devil's Martini than a frickin' Korean BBQ resto but maybe that's just me. 

The food was most definitely the highlight: Kalbi (marinated short ribs), spicy pork bulgogi and that came out with all the fixings... dwaenjang chigae (tofu/miso stew), kimchi chigae (kimchi stew) and all sorts of lettuce leaves, kimchis, banchans (side dishes). All the good stuff. 

We thought about ordering the bibimbap but good thing we didn't because we were rolling out of there stuffed by the end of the night. Had to undo the top button of my jeans to ease the discomfort from the beef/pork/veg/rice meal I just stuffed down. 

Definitely a little pricier than the cheap (and gross) Korean BBQ's that you get downtown but you'll get a quality meal that your body will continue to digest upon until the next day."}
{"text":"Went there for lunch for Table Teppanyaki and tried the combo for $21.95 whcih includes a 5oz steak, 2oz shrimp, 2oz calamarai, and 2oz chicken.

The owner kept hovering and eyeballing us since it was pretty quiet, didn't feel too comfortable or at ease.  The chef that came out to cook looked and acted like he had partied too much the night before.  I think he also does the dishes or cooks in the kitchen when he's not needed.. no joke.   

The table next to use had a Teppanyaki chef that looked and acted the part.  We got the backup chef for when even the backup chef is sick..haha.  Anyways, the food was okay.. tasty due to the amount of salt used.   
The place is nicely decorated, and its worth a visit if you're in the area."}
{"text":"This is the 2nd time I visited this restaurant.  It's 9:20p.m. and we call in for teppanyaki.  They are nice to serve us if we can arrive by 9:30p.m.  We make it and as we sit down, all the customers are starting to leave.  I can see the waitress preparing all the ingredients and then comes the chef.   As there is a couple having their anniversary, the chef is nice to fry rice with a heart shape.  The cutlery play is very good and the chef does enlighten the atmosphere.  The couple enjoys it.  The NY Strip Loin and salmon are both delicious.  The texture of the Mignon is better than the NY Strip Loin.  

After the meal, we are the only customers left in the restaurant.  Though late at night, there is no sense of pushing us to order, finish the meal or to foot our bill.  The waitress comes frequent enough to add more tea to us.  The feel is so good.  When we are ready, we ask for the bill.  Everyone smile and greet us as we leave.  We all have a great time.

5/3/2011 
I have passed by this location for quite many times but never notice this restaurant until we bought the Groupon.  Once entered, it has a different atmosphere than most of the traditional Japanese or Korean restaurant.  The feel is more modern and spacious.  There are lot of separation by glass.  On the south side is the Teppanyaki, the north side is for Hot Pot and dinner.  We choose to go for the Teppanyaki.  There are not that many people there.  The waitress tries to find a table with no people for us.  It actually surprises me as most of the Teppanyaki restaurant will group all the people in the round table in order for one chef to serve us all.  Although finally we have to share a table with another family, I am totally fine with it.  The ceiling is decorated with all the red plastics to block the cooking smell to spread to the other part of the restaurant.  The ventilation is pretty good.

We order a Lobster & Fillet Mignon & Scallop and an 8 oz Yakiniku (Thin slice Black Angus striploin with teriyaki sauce).  Since there are 2 kids in our table, the chef makes a lot of fun and demonstration of the cooking skill with his fork and knife.  It is very entertaining.  He has trick to surprise us with a retractable ketchup sauce.  He throws an egg to a kid but found out to be hollow.  What comes interesting is rice is the first item to be served.  We have a lobster tail probably 6 oz, a few scallops and 4 inches in diameter of Fillet Mignon.  For the price of $45, I found it a bit expensive.  The texture of the Fillet Mignon is very tender.  On the contrary, the Yakiniku is not very good and is a bit tough.  We then order our dessert. The night only has ice cream.  On the menu, ice cream can only be Vanilla or Mango.  There is no Green tea ice cream in a Japanese restaurant, very surprise.

The waitress service is very good.  I also look at their Teppanyaki lunch menu and am much more reasonable but I am not sure about the portion.  Maybe some one can try it and let us know."}
{"text":"I have been to this place only once, it was a date night, and my date and I were both very impressed, we sat at the Teppanyaki table ( Flat hot plate ) the cook did a lot of fancy flipping of bowls and the food was perfect and service was awesome as well 

if you would like to impress your date I would her/him here 

Thanks for reading"}
{"text":"My goodness this restaurant is a-may-zing. I don't know where to start. 

Still don't know where to start. 

OK, let's start with walking in. Chic décor and spacious, well laid out booths to the left  and teppanyaki grills to the right. My party and I opted for the KBBQ to see what it was all about. We had the choice of 4 ppl or 6 ppl booths, I was with a party of 4 and we took the booth for 6 cause we often eat for 6 LOL. When we were given the menus I immediately knew this would be one for the books (pun intended). I've never seen a prettier or held a heavier menu, it was absolute boss. 

A large selection of traditional and standard Korean dishes, BBQ a la carte and BBQ combos awaited us. Luckily I used to live with and go to school with roughly a dozen Koreans, so I am well educated on the majority of food offered at Kazan and ordered based on my experiences with Korean food. 

As for drinks we order multiple rounds of Sapporo cans and Hakutsuru Sake. I know for sure they also have Sapporo in the bottle, as well as Asahi and Heineken. 

All the appetizers they brought to the table were delicious and I noticed a serious jump in quality from what I was normally used to in the past. In addition I ordered \"manni manni kimchi\" which loosely translates to \"lots and lots of kimchi\", and I specifically asked for Gochujang a fermented hot pepper paste I am in love with. 

First dish we ordered is one of my favourites, Kimchi Jigae. This dish is a stew made of mostly kimchi, tofu and pork or seafood. It is very spicy and rich because it is made with so much friggin kimchi. If you haven't already taken note, I'm a kimchi whore. After finishing this dish I felt so empowered and charged up I felt like building a house, it was one of the best renditions I had ever yammed. 

Next dish we ordered was Dolsot Bibimbap, a mixed rice dish cooked in a stone bowl. This dish is super clutch because the bottom of the pot is coated with sesame oil so some of the rice \"catches\" (burns/sticks). When you get the bowl you scrape up the bottom and mix the rice so that you experience this texturegasm in your mouth of sticky/crispy/crunchy rice, meat and vegetables. Again, one of the if not THE best  rendition I have ever had.  This dish comes with an egg on top and I highly recommend chopping it up to bits and mixing it all up with the rice instead of divying it up amongst your party. I also recommend not touching the stone bowl at all unless you would like to sustain lasting burns to your hands. 

Onto the phenomenal KBBQ. I've never not had all you can eat KBBQ and I swear by Chakos | http://is.gd/1Kq3B | so I was well looking forward to seeing a jump in quality of meat and prep work. We ordered a variation of Bulgogi which was made from Beef Sirloin and came seasoned in a kimchi like rub. When it arrived at the table I was immediately fixated on the marbling in the meat. I had never seen so much marbling like that in any meat at any KBBQ I've ever been too. The second item we ordered was the Daeji Bulgogi, a spicy marinated pork which arrived coated in a red sauce screaming kimchi, much more then the beef sirloin. All the cuts of meat roughly resembled the shape and size of a std zippo.

Major change with this this KBBQ is that you don't have to cook, so classy. The only time you touch the grill is to take your meat off after it has already been cooked for you. Your waitress or waiter will put down the meat on the grill, return in approximately 2 minutes to flip it, then will return again in approximately 2 more minutes to shut the grill off. Truly a flawless procedure as they pop out of nowhere just in time to flip the meat when it needs to be flipped and it is by no means over or undercooked.  

When we asked for the bill we were all greeted with a drink which was heavily infused with cinnamon and flakes of ice. It almost tastes as though it had like a melon dew juice base but I could not say for sure. It was the perfect closer to a hot spicy meal and if I had to rate the icy beverage I would give it a 4.9/5 as I don't give perfect scores.

This whole experience was truly revolutionary for me as I experienced such quality Korean food like never before. This resto is also located down the road from my house and right beside Tomo Sushi my favourite sushi venue!!! | http://is.gd/1KtZa | 

I highly highly recommend this spot to anyone who enjoys quality asian grub and does not mind shelling out a few extra bucks to eat it. I would definitely not take anyone here whom I feel would not appreciate the experience as I don't believe it is for everyone. As for me and my party we were all rendered speechless."}
{"text":"Took the wifey there the Monday after Easter weekend.  I thought I was going to use my Groupon deal there but they wouldn't allow it stating that it is still a holiday.  I was somewhat upset because the place was only half filled and we could have walked if it wasn't for the wifey who was really hungry.  So we tried the buffet which apparently is new there.  I think for a buffet it was just ok...we wanted more soup and rice and they wanted more money...erm...I thought the signed said all you can eat, in this case the rice costs more to the company than the meat we ordered...we didn't understand that at all.  For the price you pay for the buffet should not limit rice or soup.  Oh well...the place is ok...nothing too spectacular.  Our server was funny that was about it.  We have to go again because of our Groupon deal so hopefully they can redeem themselves. =o)"}
{"text":"My husband and I purchased a Groupon certificate for Kazan Teppanyaki, but hesitated for several months before using it as we have had some poor experiences with restaurants that offer this type of coupon. We should not have worried! 

It was fantastic! Extremely clean. Excellent service. (It was empty when we arrived, but more people arrived as the evening progressed.) Our Teppanyaki chef was a hoot. We laughed through the entire experience. Most of the food was superb. My husband said that it was the best restaurant food he'd had in months. The calamari, scallops, vegetables, soup, salad, lemon cheesecake, Chilean wine - all wonderful. I do not give 5 stars because I thought the sukiyaki was a little blah and the cheesecake serving was tiny, half the portion size shown on the menu's picture. Also the teppanyaki chef at the next table was nowhere as good as ours - he did not do the knife tricks etc.

But, we're dying to go back and take the extended family for teppanyaki. We'll also eager to try the Korean side because we are Korean food hounds.

Would love to find more groupons for this place!"}
{"text":"Have to give a STAR for the decor and setting. Very modern and somewhat stylish. And very clean looking.

Other than the furnishing, everything else was under average for the price your paying.

SERVICE:
For such a so called high end Korean Grill, service and response to customer need was very poor. My family did not do the typanyaki. We had regular lunch to just to try out the food since. Is our first time there. We had to repeated calling to different. Waiter and waitress fo additional kimchi and tea=.=\".

FOOD QUALITY
Its just any average food served in bento box. I had seafood habachi, but the seafood and the rice was barely warm. And for $11.99 its not worth it! 

If your looking to chill its ok but not for food quality nor service."}
{"text":"Trendy interior!

I placed my order & started off with miso soup & house salad both of which were good. Our teppanyaki chef came & greeted each of us personally.

He commenced with a warm up demonstrating his prowess at  knife & spatula flipping. 

While cooking he would demonstrate some neat flair such as a flaming onion volcano which transitioned into a choo-choo train as he pushed the onion stack along making sounds effects while it puffed out white smoke. It was most entertaining!

The food was cooked well, steak was medium rare as I asked for, shrimps were moist & flavorful, & the fried rice was interesting in flavor as it incorporated coca cola into it's preparation!

My experience at Kazan was enjoyable! Spectacle & meal in one.

The service was attentive & our chef was skilled & charming."}
{"text":"Let me start by saying - points lost ONLY for price. $24.95 (same price for lunch and dinner) for AYCE. Moving on.

I am a hard-core Korean BBQ lover, I could do it all day erry day. I've been to Chako, Korean grill house, Grill Time downtown - THIS PLACE IS THE BEST QUALITY OUT OF THEM ALL. 

It's located in Richmond Hill, Yonge and Weldrick - in the plaza directly across from Petro Canada. It wasn't busy any of the times I went, usually around late afternoon so don't worry about making reservations.

Décor is beautiful. They have teppanyaki tables in one section of the restaurant - i.e. a huge table where a handy man throws around knives, flames and beef in order to generate applause/delicious food. It looks like a very upscale, classy restaurant inside but there's no dress code or anything so not to worry. If you wanna bring a date, do it. Impress him/her with your AYCE skills. That's my mate-seeking strategy ;)

The menu is limited  - there are beef options, two types of chicken (spicy and non-spicy), pork belly, beef brisket, squid, shrimps, octopus and veggies. You can order 4 'things' at a time. Unlike at most of the places I have been to, the meat doesn't come in small stackable white containers. It's laid out on top of lettuce, on a big plate. The pieces are large - you are given scissors if you want to cut it up into smaller pieces. The beef IS NOT sliced so thin you can see through it, which is something I LOVE.  THERE IS NO SUSHI, if you've been to Grill Time or Chako, there are sushi on the AYCE menu. Not here. Pure meat/chicken/seafood. 

My FAVOWIT is that they give you lettuce, so you can make lettuce wraps! How cute is that? It comes with this thick sauce, spicy with oats in it. Sounds weird, taste amazing. 

The service is AMAZING. They're sweet, knowledgeable and super nice - I want to take them all home and force them to play tea party. They move fast and change the grill for you at the first sign of it getting stained, which makes for some delicious, burn-free meat. 

Squid comes in HUGE pieces, I swear its gotta be half a squid. Cut 'er up and nom nom nom!!!!!!!!!! (I heart squid)

You're also given unlimited appetizers - sprouts, kim chi, bok choy, tofu, fish, etc. All very yummy and you don't have to feel greedy because they usually come and with a genuine face ask if you want some more :D.

For all those of you who don't like Korean table BBQ because you think the quality of meat is poor - come here. You will be amazed and addicted like I am. Just prepare to open up that wallet, it is not cheap! 

xoxo."}
{"text":"As many other users have commented, the décor isn't half bad. It has a nice modern look to it; black table tops while the rest of the restaurant is accented with red. The place was rather dead, but we did go at 4 PM on a Tuesday.

The price range should probably be $$$, given the main dishes are usually a minimum of $20 dollars while the rest are $30-$40. While the portions are large, I certainly don't think it's worth the money. I got some chap chae with beef for about $20 dollars, the portion was huge -- big enough for multiple people if need be. The only problem was that the majority of the dish was vegetables, there was a reasonable amount of noodles, but not enough, while there was barely any beef. The little bits of beef that were there did taste pretty good, so I was fairly disappointed there wasn't more.

My friend ordered some bibimbap that he said was pretty dry. I didn't try it myself but I can say it didn't look too good. They gave him a sort of sauce to eat with it but it tasted more like chilli sauce than anything else, so he didn't bother. I also ordered some dumpling soup as an appetiser (which didn't come early; it came with the rest of our food), not knowing that my chap chae would be so large; the dumplings were essentially tasteless and in a giant bowl of something similar to miso soup. 

As for service, I found the waitresses didn't really listen to us. They'd kind of space out after asking questions. When we first sat down, a woman came to ask us if we'd like drinks to start. We asked for water. Two minutes later, a second waitress came to ask the same thing, and when we tried to explain to her that someone had already came for us, she said \"okay\" and then just stood there waiting for us to order drinks. 

To be honest, I feel like this place would be a lot better if you went as a group and only if you were going for teppanyaki. We didn't have the teppanyaki ourselves but that side of the restaurant certainly looked more interesting. But honestly, my experience was bad enough for me to be far too reluctant to go back and try the teppanyaki. 

I would recommend trying somewhere else if you're looking for good Korean."}
{"text":"STAY AWAY!!  worst place I've been to in many many years!  be prepared to be ripped off;  serving sizes small, prices very high, quality of food extremely low!  there was a party of 7, so good cross section of items ordered, including appetizers, I'v enever seen such bad food, consistently!  

example:  paid $8 for calamari appetizer, got 7 rings, that's it, and poor quality too!  main dish was meat on \"hot rock\"...sounds cool, right?  well, not really, basically thin shredded bits of beef served on oval plate made of stone/ceramic, big deal! think of a philly cheesesteak that was dropped on the floor and picked up on a plate, but without taste...the chinese food in the mall food courte is far superior, and that stuff is lousy, think about it!

my nephew got some rice and beef dish, not kidding, we had to literally \"HUNT\" for the minute fragments of dry tasteless pieces of ground beef, there was nothing there, including taste...$15 for 2 pieces of lobster tempura that had more oil than the BP spill, and of course, let's stay consistent here, no taste!  the ladies in our table, who love lobster, took one bite and passed on it...

I can go on and on, don't be fooled by the tempting decor, mark my words, they will be out of business in a year, there are so many other places within a 1 mile radius that ar enot only much cheaper but have food choices and quality far superior to this disaster...only fools should dine here ( I was one for that 2 hr period, I feel ashamed....)

I never write reviews, but felt I had to in this case..."}
{"text":"I have been here to Kazan quite a few times since it opened a few years ago.  They do Korean BBQ, Hot Pot table cooking, Teppanyaki, and A La Carte.  When you walk in you will notice the wonderful decor, and friendly staff.

Tonight I ordered K01. Galbi Tang $11.95

It was delicious as usual.  Tasty soup, soft and edible beef, large dish.  Also recommended is the Sam Gae Tang (Korean Ginseng Chicken Soup) $19.95 .... on special for $14.95 during lunch.  Best korean ginseng soup ever.

Today they gave me a cup of cold water with lemon instead of the excellent brown rice green tea.  I suppose I could have asked for the tea instead, but only realized after I saw them bringing it to another table.

I have also tried their teppanyaki twice.  A bit pricey, but nice and makes you very full afterwards.  I found the show a bit better at other teppanyaki places however, as these chefs don't do as much fun things like cracking eggs on their hats.  My second teppanyaki experience here wasn't as good as they put too much teriyaki sauce on the rice, making it too sweet.

Last time I was here a few months ago, the owner gave me a flyer for their grand opening BiBi-Go Korean Food Express which is located at the back of the restaurant in the party room during the non-peak weekday hours.  They had a few dishes incl Pork Bone Soup for $7.  Unfortunately they no longer have this when I asked the owner today.

Overall, a great place to go for amazing Korean soup.  Especially if you're not able to travel to downtown or K-town (yonge/finch area) for authentic Korean food."}
{"text":"We went for the teppanyaki supper (family of 5) and ordered chicken, steak, salmon and sukiyaki. The steak and fried rice was really tasty. The sukiyaki didn't taste like \"sukiyaki\", more like not very flavourful bulgoki. The decor was modern and the chef liked to (practice) juggling his spatula and fork (the fork landed on the floor, good thing it was a knife). 
I went with a Groupon voucher ($35 for $70 worth) and when it was time to pay the waiter informed me with this deal, he will add 15% gratuity on the bill. I would gladly do it if I had good service from them (2 waiters taking an order from my daughter who asked for a glass of water and they forgot to bring it). They did not inform me the fried rice is an extra $2.95 each (most wait staff will inform customers of that). I reread the voucher and it didn't. Mention about the mandatory 15% tip. I brought him the print out and he read it over and over for a long time and said he always adds the tip on. Then he points to the section that says gratuity and taxes not included. I said that doesn't mention the 15%. He had to add, \"oh, I won't add it this time\". I replied yes because if you did you would be dishonest.
I don't believe I will be going there again for teppanyaki as I thought it was a bit pricey. After the $70 credit I paid an additional $57 (including tips)."}
{"text":"Annoyed! was charged gratuity at 15% when there was only two of us. Also pricier then other places with food just avg. atmosphere is nice though. Went for a la carte. got seafood noodle, sweet and sour chicken, lemon deep fried pork, kam ja tang.  kam ja tang was not spicy at all, mild flavours. was OK, but would not order again. only thing good was the seafood noodle, which really was avg and would not come back here. Didn't try ayce Korean BBQ. Looks gd though and crowd were Korean so can't be that bad"}
{"text":"Have been there twice - once for the Japanese and once for the Korean side.

The restaurant is Korean owned and uniquely split in two. The left side is Korean food, and 90% Korean customers, and the right side is Japanese teppanyaki (95% non-Korean or Japanese), with completely different menus and options. Although the restaurant is quite large, from my experience you should make a reservation if you plan on going for dinner after 7.

The service varies - the first time I went I waited over 10 minutes and 3 different servers to get a refill of water. However, in typical Korean style most of them are quite friendly. The Korean side even has one of the server calling buttons that one would see all over Korea.

The second time I was there I asked one of the young men and he basically speed-walked to get that water for me within 30 seconds! After that, I don't think he let my glass get half empty until the end of the night!

The teppanyaki chef could have had a little more enthusiasm but the food was well done and the portions sizable.

The Korean food is served in typical Korean style with various included Banchan (side dishes). One thing I HIGHLY recommend is their Doenjang jjigae. It is a little bit modernized (made with bits of beef, potatoes, and other vegetables), but you will NOT regret getting it... in fact, I'm craving it right now!

Overall, it is a little on the pricey side, lacking a bit in service at times, but the food is great and I will definitely be back as long as it sticks around!"}
{"text":"Kazan Koren Restaurant is a nicely decorated place. This is so chic and modern and has comfortable booth seatings. 

We went there on a Saturday night around 7:30 PM. The place was not too busy and we got sat right away in one of the booth. 

We opted not to have the Teppanyaki which is in a different area of the restaurants with the chef cooking in front on you on the iron plate. 

We ordered the BBQ ribs (2 bones) $21.95, Stir Fried Seafood with Rice $12.95 and Spicy seafood udon soup $9.95. I tried to order brown rice instead of regular white rice, the waiter told me it was sold out since lunch... hmmmm... can they just make more if they know they don't have any since lunch?? 

First thing that comes was the appetizers which is a pancake with green and red pepper. It tasted a little oily but it is OK. Our waiter did not even realized that we don't have chopsticks or any utensils to eat. 

The other complimentary appetizers is quite tasty: kimchi, mushroom with beef, green beans, egg plant. We were accommodated when we requested for a refill. 

The ribs are quite tasty. The cut is really good, no tendons or chewy part. The stired fried seafood with rice was a little disappointed, the sauce is kind of bland and but the 2 shrimps were nice and fresh squids were cooked perfectly! The seafood udon, I requested extra spicy.. that only come out as mild..with the same seafood..I do like the noodle soup better and it was huge.. they served that in a XL metal bowel! 

The service was a little slow and impersonal. Maybe our waiter is a trainee, he does not really know what he is doing sometimes. He left the dirty serving cart right next to our booth and I have to push it away more than twice. 

I prefer going to smaller restaurant that is family runned compared to huge restaurant that is so impersonal. I found the smaller ones do give me a feel how Korean really eats at home and are more authentic. 

Kazan is great if you have a big group and for sure you will have so much fun watching the chef cooking right in front of you and doing all the tricks! 

VISA, MC, Interac, NO Amex 

PS You do smell after eating here even no one around you are eating BBQ! I have to wash everything including myself when I get home. However, my dog has so much fun smelling me..."}
{"text":"Upon entering this fiery place my husband and I were telling each other \"Wow..!\" trying to hush our excitement. Like a great feast awaits us! The sweet and sizzling aroma of grilled and bbq'd meat made every step to our table a heavenly path.  Interior design sure makes a huge statement - burning reds never looked this gorgeous.  Awesome! Perfect as we celebrated my birthday that night.

Ambiance:  Elegantly metro.  Great for group dining. 

Seating accommodation:  A little tight at the tables but comfy.

Service:  A little slow perhaps with the busy weekend night we went.  Friendly and very pro-active.  They knew I needed more tea before I did.

Average price for dinner:  The Teppanyaki Dinner course meal for 3 we had was $59.95 that included New York Steak, Scallops, Chicken and Calamari + Sides: miso soup, vegetable salad, steamed rice and hot tea.  $20 increments for 4 and 5 persons.  Other combos started at $69.95 (for 3 pax) and $79.95 with options for Fillet Mignon and Lobsters.  But the menu can be flexible to bring you ala carte which meat and fish can range from $22 - 32.

This could be any one of our usual teppanyaki experience with the chef cooking in front of us and entertaining with a few circus tricks and punchlines including the signature onion volcano which froze my kids to their seats, funny actually.  The food - its not so there yet.  Smells great but practically bland, and the beef was chewy.  I thought it could be at par with the other good teppanyaki places but, yeah, we've had better in terms of taste and flavor.

Overall:  The teppanyaki need some improvement but was sufficed with the dining experience and excellent service.  I would come back and bring my friends!  Their Korean Bbq section will have to be tried out, definitely.  So watch out for my next review on Kazan.  Sizzle!"}
{"text":"For lunch I decided to go with the New York Steak with an additional chicken breast on the side. My girlfriend went with a beef and veggy combo called, yakaniku (spelling?) with salmon on the side. We both opted for fried rice and maybe it's just us, but I liked it quite a bit. So definitely worth the additional $1.95, I totally recommend it.

Lunch started off with miso soup which was surprisingly good and the house salad. Our teppanyaki chef came and greeted us personally as we were the only two that he was serving. He showed us some of his \"warm-up\" routines which were essentially showing off his flipping and knife skills. He asked if we were a couple and we said yes. This was nice as throughout the cooking duration, he would make some things a little special just for us. I mean even when he was warming up the stove, he would squirt oil into a heart shape or on another occasion, a heart with a happy face inside. So it was a nice little touch and put a smile on both our faces.

While cooking he would demonstrate some things like a flaming volcano and then turn it into a smoking choo-choo train with sound effects. The food was cooked well and I liked my girlfriend's yakaniku which had a nice flavour and sauce on it. My New York steak was cooked well, but I feel it lacked a little flavour, but by no means was it bad. The salmon was done well and the girlfriend liked it. But the chicken wasn't great. It was kinda dry and it had to be saved by some sauce. So as a heads up, maybe skip this choice. At the end the chef sincerely wished us as a couple all the best which was really nice of him.

Overall, both my girlfriend and I liked our experience at Kazan. It essentially was a little show and lunch all in one. And if you go for lunch, it's much more reasonably priced than dinner. What was also nice, they would cook the food for you once you have ordered rather than waiting for more customers like some other teppanyaki places I've been to. The service was attentive and the staff was really nice. Overall, I have to say kazan was definitely a nice choice for lunch."}
