{"text":"Excellent neighborhood bar great atmosphere friendly people, love Sunday's with Alex behind the bar...what a sweetheart."}
{"text":"I love this place, my friend and I have been coming here for a few years now. Fun atmosphere and they have the best tacos on Tuesdays! Highly recommended."}
{"text":"Kelleys rules. Golden Tee. Mozz sticks. Cheap booze. Shhooo buddyyy. Great place to hang out and crush bad tequila."}
{"text":"First time here and it's pretty awesome! Great specials and it's right up the street from my house, so super convenient! Lots of craft beers and everything is pretty cheap. Me and my boyfriend will definitely be back!"}
{"text":"I WANT to like this place...I live 10 houses away. Been there many times and hope it becomes a great neighborhood bar, however my experience tonight was embarrassing. I asked for a menu I was told there was none available xcept a chalkboard which I could not read clearly. The chalkboard was taken off the wall & put in front of me on the bar... (lots of laughter ffom current patrons...uncomfortable)...please Kelly's get it together...the business could be the best in my neighborhood in 20 yrs."}
{"text":"Since my original review the charm has worn off, and it is sliding back to the shithole it used to be. I've seen the manager involved with quasi illegal gambling from the video poker machine, patrons being over served to the point of pissing their pants, and being made to generally not feel welcome because I wasn't part of the 'in crowd\". 

No big deal. There are many other and better bars in Lakewood."}
{"text":"Awesome time at Kelley's  tonight to watch the Indians game.  Great service, food and game time discounts. This place is a hidden treasure!!  Go Tribe!!"}
{"text":"Kelley's Pub is a great, local pub for cheap drinks. Period. And if you live close by, it's even better. Because I mentioned the cheap drinks already, right? 

Its interior isn't fancy, but it's pretty clean. There's usually live music of some sort and lots of grumpy old men. If you're a lady, you might get hassled by a few, but it's harmless. 

The bartenders are sweethearts, but I have seen them over-pour for some people who clearly should have been done. 

There is also a small parking lot and they seem to have daily specials based on what sporting event is on and the time of year. 

I've never had food from here, but I'm told it comes from the deli next door. However, I did look at the menu, which featured a lot of American comfort foods and fried apps. This makes me question whether all the food is actually from next door or if they have their own, small kitchen now."}
{"text":"We came here for the band \"Dirty Franks\" and we got some food. The food is excellent. Try the Perogis you will not be disappointed."}
{"text":"I'm not much of a bar type of girl but I seriously don't mind going to this one. My boyfriend absolutely loves coming here. It's a low key bar. Not much on looks interior wise but it doesn't bother me. The drinks are very inexpensive. They also serve your typical bar food fare. The food is very good though! We ordered the loaded fries & the flatbread pizza. Both were very delicious. For 2 beers, 2 pops, & two food items, it only cost $15. You can't beat that!"}
{"text":"Tried the shrooms & tacos! The bartender was very nice & served us immediately! We will come back again for more food & beers!"}
{"text":"My friend Z-Rob moved directly across the street from Kelley's. I have watched a couple of Cavs and Clowns games here. The crowd is great. A lot of old men who are ball breakers. Enshallah I will become an old man drinking at a bar one day. Kelley's would be the type of place I would go."}
