{"text":"The food was amazing. Good size serving, fresh ingredients, well made. Had the Mexican and Californian with garlic parm fries and garden poutine. Would def recommend this place."}
{"text":"We decided to give this place a try, and in a nut shell - its over priced and the sides are VERY small. I ordered the Prime burger (which was ok but really greasy from the fried onions) and paid an extra $2 to add onion rings. I literally got 6 small onion rings! they were also super greasy (dripping with grease), so i was only able to eat 4 of the 6. My hubby got the Kenzie and paid an extra $2 for the garlic parm fries, which got him maybe 5 bites worth of fries? The burgers were tasty, but you would like to think that after paying $35 for two burgers and sides, they could afford to give us a fair amount of fries and rings, considering how cheap onions and potatoes are. I will not be ordering from this place again, not enough bang for your buck."}
{"text":"Good burgers, cool place (live bands on weekend). Pretty average overall experience, not the greatest burger but not bad. Pretty straight forward menu options- burgers (either build your own or pick from a small list of feature burgers), sides, and apps- and drinks."}
{"text":"This place is always packed , great atmosphere and decor , friendly staff . Overpriced food that isn't that great . Burgers need more flavour and juice ."}
{"text":"I had the PB&J burger and garlic cheese fries with a craft beer to wash it down. Besides the music being a bit loud, there was nothing that sets this apart from other gourmet burger places. You get what you pay for, and sometimes that's enough. Interesting menu choices for the more adventurous diners. Would come again."}
{"text":"Horrible service and cold food..  For a place that claims to be a burger bar it's far from the truth.. buns not toasted.. meat cold.. fries cold.. waitress never even came to the table to ask how the food was.. not even a drink refill..   Wow it's unfortunate to give a 1 star but that's all it deserves.."}
{"text":"My friend from the city and I went for dinner there tn. We waited over and hour for our food. To make matters worst, they screwed up his entire order and there was a hair in my salad. Very disappointed. We were turned off by the food that we didn't even end up eating after. Disgusting  We had to approach the manager ourselves rather than them approaching us to validate the poor experience. Unfortunately, poorly death with, overrated spot in Bradford, never going back"}
{"text":"Amazing burger made this stop memorable. Simple Bacon Cheeseburger with a pint of Batch:1904 Cider from Brickworks. Totally worth the detour!"}
{"text":"Burgers are really good.  You must be a big meat eater to finish this homemade hamburger.  Very expensive.  I went with the husband we both had hamburgers and fries no drinks it cost $40.00 before tip.  It's very pricey."}
{"text":"I wasn't expecting much but was I surprised . The restaurant is modern and clean and the servers were welcoming .We orders our food and and it was served hot and promptly .The food is so much better than I thought and the server is awesome !!!The burger is a lot better than we thought considering its out of the city core  I would definitely  come again and our servers name was shonagh and she was fantastic"}
{"text":"Went to the Barrie location.   Here we go with the bodacious burger antics again; this time we're at The Kenzington Burger Bar in Barrie where I'm stomaching a burger that that has me on probation.    Summer demands burgers, and burgers are always enjoyed better with friends. 14 of us squad up for a yearly camping trip and on the way we traditionally find a food joint on route with lots of buzz. This year was The Kenzington Burger Bar. About an hour on the road and we build up quite the appetite. A Tim Hortons coffee and and an over stock of timbits doesn't get the convoy far.   We strut into the burger bar as a group with concourse cravings; however me and my buddy have next level appetites. Initially we planned on ordering their Kitchen Sink Burger Challenge, but we we're unfortunately informed that we needed to provide 24 hours notice before ordering. An unfortunate turn to our stomachs, but we ordered the next best thing on the menu size wise. Their second biggest burger called \"The In-Training\".   This burger must have been modeled after a sky-scraper. It had to be nearly a foot high, and that kind of aesthetic architecture elevated our excitement for our feast at hand. Stacked with a thick, juicy burger patty, cheddar, bacon peameal bacon, Jalapeno popper, fried egg, poutine and an Olympic sized onion ring....there was damage to be made on this burger, and ourselves. I got this collage of ingredients loosely fitted between a potato roll (Fancy term for regular bun), but you have the option to get your burger with a Pretzel bun, Flour wrap, Gluten-Free bun or even Grilled Cheese. Now to take a pause on the burger for a second and talk about more about their burger ordering process.   You start by choosing 1 of their 18 innovated burger options and than get to select your choice of bun. From there you can choose between house blended beef patty, grilled chicken, fried chicken (YAH...FRIED F**KIN CHICKEN), ground turkey or a black bean quinoa burger for the hippies. Than you select your side. Where fries are the usual suspect,  but you can also upgrade that to garlic parm fries, onion rings, sweet potato or even poutine for the hungrier hearts.   Back to the actual burger.... The thing could not be eaten as whole. The jaw simply can not hinge wide enough to accommodate the number of layers stacked between those balancing buns. Unless you are my friend... He was raised by Anacondas in the amazon rain forest, clearly. I had to deconstruct it and eat it in 3rds (\"Like a bitch\"). The jalapeno popper was something new to me in a burger, but played so well contributing creamy and hot elements to the burger. The Onion rings were the size of a car tire. Even with all the other layers going on you could taste the thick cut onion in the burger, and had great crunch (Texture bonus*). The egg and peameal got lost in the burger with everything else going on. The absence of yolk running down my arm tells me that it was probably a well done egg, which I feel defeats the premise of an egg on a burger. You'll barely taste the egg, but at least you'll have that yolk porn dripping down. Now I won't lie; I did not realize they put poutine in the burger until after reading the breakdown for the purpose of this review. I don't know if they forgot or if I had just totally missed the poutine column of the burger. But when you are eating a burger like that, i can understand things are bound to get lost in the flavors.   Now The Kenzington Burger Bar also cooks their patties leaving a little pink in the middle. (BROWNIE POINTS*) If you know me, i'm a stickler for over cooked patties. The burger patty on mine wasn't pink in the center, but I'm aware that when you order burgers intended to be more of a challenge , the extra ingredients will continue to cook that patty even when its on the plate. And thus, some quality is compromised in the process.    The feedback from the rest of the gang was very positive. Everyone was very happy with their burgers. Great tasting and fair in size. A little bigger i'd say than most burger centered restaurants (I.e The Works). I tried one at the table with the grilled chicken breast and grilled cheese buns. THe chicken was cooked perfectly! So moist and tender and the grilled cheese buns was the shiz. Their restaurant has a great setting, having outdoor patios in both the front and the back. Easy to accommodate our large party just dropping in.   The food was great! Even more things to come back to like their Deep Fried Cheese Curdz and to actually tackle their Kitchen Sink Challenge! One day....     Pros: Burger selection Variety when building your burger (bun and meat options) Quality of burger toppings (Bacon, onion rings, jalapeno poppers) Great atmosphere, plus front and back patio's! (great for large parties)    Cons: Didn't get to do the challenge...next time though!    Rating: Budget Experiance Aesthetics Size Taste   5 star's performance to Kenzington Burger Bar!"}
{"text":"I had the beef burger on a brioche bun, w sautéed onions, melted Brie, and house BBQ sauce lettuce and tomato It was amazing Fries are great too."}
{"text":"Been to many burger joints and this place is up there. Excellent beef patties, excellent bun, does not get too messy, tasty combinations. If you are looking for a burger joint, you must try this place and you won't be disappointed  Cheers"}
{"text":"Took us about 40min to get seated as a walk-in but that's not outlandish for the day and time.  The jalapeno poppers were bland, but the burgers were fantastic. I have to say that it was by far the best turkey burger I ever had. Topping were well-crafted and balanced.  Drinks were very fresh and the selection was tight and well-chosen.  Big props go to the extremely kind and attentive staff even when packed.  I'd certainly go back."}
{"text":"AMAZING. I hate beef burgers, and I am a major fan of the beef served here. I tried the Dundas burger and I am officially hooked. Goat cheese, roasted red peppers and spinach- so delicious. The garlic parm fries are fantastic as well! Amazing service, the place was packed and they managed to find us a table (even if it was a tight fit it was better than waiting). I've been craving this place since I left! Bradford is certainly lucky to get such a great establishment right in the heart of its town."}
{"text":"The service was amazing. Waitress was very friendly and attentive. The burgers were very good and tasty. The poutines were better than the most places I've been to. I will defenitly be going back"}
{"text":"Great location. Great food.  Love the kids menu.  Did I mention the great burgers.   The service is good and this location is bright   Best location by far."}
{"text":"One of Bradford's best burgers... We went on a Saturday at around 6pm.  It was 60% full and we got a table immediately without reservations.  Atmosphere and service were good.  I ordered a Prime style beef burger with grilled cheese buns and a house salad.  The Prime style had grain mustard, brie, horseradish mayo and onion strings.  This was in addition to the lettuce, tomato, onion and pickle that every burger comes with. Wasn't sure how all these flavours would go together, but they worked well with a little bit of sweet, salty and spicy just how I like my food!  The grilled cheese buns were delicious, but it made the burger approximately 7\" high (as it had 2 grilled cheese sandwiches - 1 representing the top bun and 1 representing the bottom bun!) and I had to really squish it down to fit in my mouth so it was a big hot mess! For $16.60 for a burger with so many ingredients, it was a good price especially compared to other specialty burger restaurants.  The only big con I had was the post-meal experience.  I knew I would feel disgusting after my greasy burger, but I felt way worse than expected.  I had a major food coma and went to sleep within the hour - that ended my Saturday night!  I will be back as I want to try the other interesting burger styles, just maybe not for a couple of months when I've worked off this burger..."}
{"text":"This place is sooo good! Went twice in one day. If you are hungry order the In Training burger."}
{"text":"Enjoyed our dinner there along with my family. The variety of burgers are fantastic especially the one with avocado. Fries are better at Five guys. The  beer variety is vast.  Enjoyed the sample beer order. Quick service and friendly."}
{"text":"This is officially my newest favourite burger place! A modern experience in an upscale-decorated bar... Great flavours, will be coming back many many more a time!"}
{"text":"\"I ordered a Prime style ground turkey burger with whole wheat wrap and a house salad. good service as well"}
{"text":"I'll give it a 4 only because I agree with another poster that the side dishes are quite small... The food however is HUGE on taste.  The best burgers in town easily, cooked the way a burger should be, not black like most restaurants.  The sides are absolutely delish, I just wish there was more... Throw me a few more fries if I'm dropping $18 on a burger... Otherwise this is my favourite place to get a burger and one of my fave joints in a town full of good restaurants..."}
