{"text":"If I could, I would actually give this location negative 5 stars....horrible, terrible no good service!  I eat there maybe once a year; give them a chance to do better, but I really don't know why. One can count on them for us to mess up your order no matter what!"}
{"text":"Just left there the prices they charge for a meal is insane. I got my son and 6 piece tender meal with a side 9.99 . No drink included but the very nice guy behind the counter said he would just giveeach one and did. Thank you for his kindness which made my visit just a little bit pleasant.  But I will not return anytime soon due to high prices. I should have just gone to Pei Wei what he was Ted to begin with. I went to kfc to save money not spend more. I also got some cookies 3 for 1.69 large side of potato wedges and side of gravy. Spent a total of 17.70. I even told the cashier to do the 5.00 meal instead of the 9.99 to save some money.  Only to find out if would save only 2.00 wow. So I went back to my original plan."}
{"text":"Disappointed.  The place was dirty. The fountain had two of the drinks not working. No punch and no root beer. The entire counter was sticky. The fountain overflow was literally overflowing.  The counter with condiments And straws was filthy and most of the holders were used as trash deposits.  There was only one other couple eating. The whole kfc experience was disgusting and disappointing."}
{"text":"If you want to be treated like sh*t.. Guess what? This is the perfect place to go. Employees are always distracted and mess up with your order, even after they repeated your whole order you won't get what you ordered and not even charge you. Employees are kind of slow from their mind, they make you feel like you are talking with a 7 year old kid. But at the end they are still nice to you. However, the manager who is a young guy between his 21-25's, he is really rude and very disrepectful with his customers. You can feel his attitude right away even if you are asking him for a simple question. I even witness how he treated an upset customer who came back to the store after he got the wrong order from the drive thru. He was just asking to get his order right and instead the manager said that he won't give him the food and he just opened the register and gave him the money back, even after the customer told him that he just want his food since that's what his sick wife at home asked him for dinner. So this place is not the type of store that will get your order messed up and offer you to get a free drink or cookie hahaha, if you are lucky enough you might get a I AM SORRY FOR THE INCONVENIENCE, and don't even try to come up upset because you will get a surprise from this manager, supervisor or whatever he is. This manager is incredibly rude with no customer service skills at all. Go eat somewhere else if you really want to enjoy your meal, otherwise you will have a miserable time there."}
{"text":"This is one of those combo KFC and A & W Rootbeer operations. I went for the chicken. When waiting in line don't look around too much as it is filthy and you might be smart enough to leave before you order. I ordered because I was told to bring some chicken and I was not going to drive any farther to get it. So filth be damned. There was an older couple in front of me who was ordering when I came in. It took an additional 11 minutes for that order to be placed; Buddha only knows how long it actually took. When it came time to take the old folks money the young man closed the register and handed them the change. It is at that time the old lady said I gave you a twenty. It was obvious this was this kids first day on the job. So he tried to get the register open again but could not, so he called the manager over to open it and all he said was he needed to get the change because he closed the register too soon. So the manager opened it up and walked away. The kid then gave her an extra ten back. She actually gave him ten but I was not about to say anything.  It came time for me to order, I had to walk him through it since he really had no idea what he was supposed to be asking.  He did give me the wrong end of the charge slip, well actually both copies so if I had not given him this back it would have been another lost sale. The guy packing the food was in no hurry, he would pick up one item and then turn around and talk to his friends, then another item and talk a bit more. I finally got my order and left.  I never have any luck at KFC's and if left to my own design would never go back. But it seems I am always the one who gets stuck picking it up for the group. Oh well a hard life I lead hahhahhahhah."}
{"text":"I was in need of a quick snack and a soda and ultimately decided to try KFC again because the McDonald's in the same parking lot had a ridiculous line. KFC had none. Those should have been my clues right there. I had one of their little chicken tender sandwiches, some potato wedges and their smallest drink. I believe my total was about $7.00. That was my first annoyance. The next was that the chicken tender was nearly unidentifiable because it had been drowned in mayo. Once I found it, however, it was an old, dry tender that had missed its peak by several hours. The only slightly redeeming quality was that my soda was fizzy and tasty. Unfortunately, the man at the window had to dump his first try because I could see that he filled the cup with the wrong selection. I know better than to eat here - I was in a hurry. Lesson learned again: either wait at McDonald's or just go home."}
{"text":"You know what? It's just fast food. Sooo, I'm not going to comment on that. You get what you get. However, I have to comment on the employees. I've been there, probably ten times over the past six years and have ALWAYS received wonderful service from the workers behind the counter. I don't know how the manager does it, but she or he hires young people who are friendly, respectful, and helpful."}
{"text":"This place is consistently crappy in the management department.  It is normal for them to not have items like grilled chicken and zero plan to make more.  More than once I have ordered spicy wings, 20 count and have been made to wait while they made the order only to be shorted two wings.  Serioulsy?  You can't count to 20?  Go to the KFC near food city.  They actually want your return business"}
