{"text":"This is another gem of a restaurant located near Longbranch go-station. All the dishes that we tried ranged from good to great. 

We found the prices to be on the higher side, the prices were comparable to Pai or Khao San Road however, this is a hole-in-the-wall 10-seater eatery serving great food. However, Pai or Khao San Road offer a dining experience along with great tasting food for the same price.

My quest for great Thai food closer to home continues until I find some worthy successors. This restaurant showed some promise, but I may not return due to the price point. The curries are 13$, you have to pay 2.00-3.00$ extra to add proteins (Chicken/beef) and then you have to pay 2.50-3.00$ extra for rice. So, a curry dish with rice ranges from 17.50-19.00$+tax."}
{"text":"In love with their food! I tried Tom Yam in different places in Toronto and has never been fully satisfied with the taste or colour. In Khao Gaeng I finally got one up to my taste. It was spicy with huge shrimps, mushrooms and chopped tomatoes and onions. I also had fried shrimps with lemongrass souse, which was perfectly made and beautifully performed. My boyfriend had Pad Gra Prao Kai Dao, it was rice with the fried egg on the top and fried meat with vegetables, all went with the special spicy souse on the side. 
What I like about newly opened places like these one is that all the cutlery is new with no scratches and cracks on it. It makes the entire meal experience even better. 
The staff was very friendly and welcoming. The complementary ice tea for the check in was a very kind jester. 
Will definitely come back here again!"}
{"text":"We ordered from a delivery service. The food was packed well with generous portions. We got the pad Thai, red curry, pad gra prao and garlic shrimp. The dishes could have used more spice (but that may have been because the delivery app didn't ask me to customize so I left it as is, next time I'll add it in the instructions). The balance of Thai flavours in everything was spot on and we enjoyed everything."}
{"text":"This spot has been on my radar for a bit since it opened on Lakeshore a short while ago. A smallish restaurant with maybe less than seating for 10 and an emphasis put on pick up and third party delivery services. So don't expect any sort of grand design. It's a simple place where the focus is on the food. 

I'm typically a Pad Thai, Khao Soi or cashew nut chicken kinda guy and I don't stray. Sure I'll try various appetizers and sides but I stick to my big three. However when recently researching the most popular dishes in the world I stumbled across a thai dish I had never heard of - Massaman Curry. I was dismayed to discover that such a popular dish in the rest of the thai food world isn't widely found in Toronto and the GTA. 

So imagine my surprise when I wasn't really in the mood for the big 3 and saw massaman on the menu! The quest for the holiest of holy curry grails was found. Ordered that with a side of steamed rice. 

What came was a perfectly balanced curry dish a little sweet, a little sour/savoury and a creamy almost peanut butter in colour (and slightly in flavour) sauce. Filled with chicken or beef, veggies and potatoes, was a hearty satisfying dish perfect for a cold day. I had a great time spooning the curry on the rice a little at a time and enjoying as I went. Loved it. 

A little secret x-factor is their check-in offer on Yelp. Check-in and you get a thai iced tea (thai tea, sugar and sweet and condensed milk) for free! A nice perk for being a loyal dine in customer!  

Looking forward to seeing how they fare with my regular dishes. 

Eatcrest Out"}
{"text":"Was craving some Thai food as this was close by so decided to pop into the restaurant after doing some grocery shopping nearby. First time coming to the restaurant to dine in as I've had the their takeout once in the past. 

We ordered the Pad Thai and Penang Curry and both were delicious - especially the pad thai! It was exactly how I like it - a little spicy, noodles cooked to perfection and the sauce was similar to pad thai I had in Thailand.

I love having great food having authentic thai food where the people working behind the counter and in the kitchen speak perfect Thai already notches the rating for review up by a point; you don't see it too often nowadays - especially in Japanese restaurants. 

I would definitely go back in the future and the only thing I would change is to have the Thai Iced Tea not as sweet as it came out from the fridge and the ice barely melted to balance the sweetness out."}
{"text":"Dropped in for lunch on a Monday and it wasn't too busy! The restaurant was a lot smaller than I thought it would be- sits around 12 people. It has also more of a casual pick-up/fast food vibe. That being said, the food was quite good! I had the curry pad Thai and was able to request for it to be made spicy. My friends had the pad Thai and the green curry- the pad Thai tasted a little ketchup-y so it wasn't my favourite. But the green curry was delicious! Prices are a little high considering the whole fast food vibe but I would probably return if I'm craving Thai food!"}
{"text":"Massaman chicken curry was a bowl of sickening sweet gravy, tasteless chicken pieces thrown into the curry together with uncooked potatoes and tons of onion.  The chicken didn't get time to develop curry taste, potatoes had no time to get cooked, crowded onion didn't have business to be there...  At $16, it doesn't come with rice.  It's just not worth it.  
Glass noodles with tofu was a better choice.  A little too heavy handed with soy sauce, but much better than the massaman curry."}
{"text":"A small hole in the wall Thai takeaway with a few tables to eat in. Dont be turned off by the lack of ambiance - the food here was some of the best Thai food I've had in Toronto! We got our food to stay and checked in for the complimentary Thai Tea. I had the Guay Tiew Gaeng with beef and it was on par with the same dish at some of the best rated Thai places in TO."}
{"text":"I'm not the biggest fan of Thai food in Canada aside from the awesome khao san and nana downtown. Having had the privilege of trying dishes in Thailand as well as in the USA (where I believe the food is generally better than here) I Tend to stay away, however this little place stands out. The Thai place that was in here before was typical crap I describe above so when I came here I was skeptical. 
I ordered pad see ew and green curry. To me those are good gauge dishes. 
They were tasty and fresh. Only complaint I have is with the ingredients used in the pad see ew. There were carrots and other veggies, it should be made with gai lan only in my opinion.
But taste was great! Recommend!"}
{"text":"We're always on the lookout for a new Thai restaurant in the neighbourhood.  This new restaurant may not have the pizzaz of a high end Thai restaurant, but what they're doing is focusing on the regular customer in the area (family with younger kids who need to be fed ASAP).

Food - Amazing.  Its my new Thai restaurant.
Seating arrangement - only 1-2 tables
Decor - does it really matter??  Its primarily a take out restaurant

5 stars for the food."}
{"text":"I found this one on Yelp when I was looking for some place to have lunch. The overall atmosphere of this place is more of a take out restaurant with a few tables to eat in. As I for the most part only care about the quality of food, I was incredibly satisfied with my meal - pad khee mao. I've had some really fancy thai food like Pai but this place in its quality definitely give them run for their money. Will come back 10/10"}
{"text":"Where is the 3.5 stars when you need it...
The tom yum soup was good (had better), small bowl, the usual 'gotta' add a couple bucks for chicken, etc.  So when it ends up about 10 bucks, it's not that great a deal for an appetizer size.
Curry chicken pad thai very good.  Almost 30 bucks though for 2 items, those kind of prices don't create much of a 'frequent' return type of experience.  They do have lunch specials till 3, best bet.
Interior is not attractive, very cold day outside; zero heat inside, so wear a winter jacket if you are eating inside (i.e. turn on the heat)."}
{"text":"Amazing! So so very autenthic and delicious. Definitely one of the best Thai foods that I've had in Toronto hands down! A bit of a hidden gem in this city and it's no wonder they've manage to become so busy every night!"}
{"text":"Note:  Curry & Stir-Fry dishes DO NOT include rice.  So keep that in mind when ordering!  OR you can order from the Signatures Dishes section (rice included), Noodles, Fried Rice, Apps, &/or Salads.

Restaurant is small, only about 5 small tables.  You order food at the counter and they bring it to your table.  I believe everything is made-to-order as you can indicate spice-level.

The free Thai Ice Tea with Yelp Check-in was a nice addition.  It was on the sweeter side and evaporated milk-y tasting.  Free Thai Ice Tea cannot be customised as I believe it's pre-made.

I ordered the Khao Mun Gai Tod (Fried Chicken, $13.95) dish that came with soup + delicious ginger fried rice!  Chicken was more like katsu, as opposed to KFC.  Price for my dish was ok, considering there was at least 2 portions there - I had leftovers.  Dish was good (tasted like chicken katsu), ginger fried rice in particular stood out.  Free garlicky soup was also good.  I tasted the Penang Curry and it was rich, sweet, and on the spicy side.  You can tell that peanuts were crushed into the curry to add that more complex taste!

If you order a Curry or Stir-Fry and have to add rice, at least $2.50, prices are same if not even more than some Thai places downtown!  So for better value, stick to Fried Rice or Noodle dishes.

I wouldn't be opposed to going back to try their other dishes - probably Pad Thai!"}
{"text":"A small cozy place near Long-branch subway station. A family owned Thai restaurant. A little expensive but then when you have the first bite, you don't fond it expensive anymore. 

This place is good for take out as there are just 10 seating spots. The service 5 star, food 4ish. 
I ordered pineapple fries rice and every bite was full  of flavour and aroma. The Thai Iced Tea, was very sugary to my taste, but on yelp check-in you get it complementary along with one main dish.

Their spring rolls portion is huge- they serve 4 large rolls, really crisp and you wont find oil soaked-in.  The mango salad portion was pretty decent too. 

I liked this place."}
{"text":"TIP: Check-in to get a free Thai Iced Tea! It is on the sweet side but I am not sure if you could adjust the sugar level since it is usually pre-made.

I probably wouldn't have known about this place if a friend hadn't told me about it. It is a very small restaurant located near the Longbranch Go Station. There's limited street parking, and it is quite limited and hard to find a free spot. Free parking after 6pm though. 

I went in on a Monday evening and when I walked in, there were 2 other customers there waiting for takeout. There are about 5 small tables inside and I guess this restaurant is more for takeout. The staff there was very accommodating and she was very nice when I asked her questions about the dishes. Washroom is in the basement and it felt like a dungeon, but then again, this place isn't supposed to be a fancy shmancy kind of place. It is the food that counts.  

I ordered the Panang Curry ($13.95) with Tofu (free of charge). You can certainly substitute for chicken (+$2), beef (+$2) or shrimp (+$3). I haven't had Panang curry in awhile, but this place made it not the way I remembered it to be. There was A LOT of peanuts (crushed - which I loved) but there wasn't enough of the coconut-y flavour. Even though there was 1 red chili pepper on the menu to indicate the spice level, it was already way too spicy for me, albeit flavourful! I am sure you can adjust the spice level if you ask them. 
Note: Rice is NOT included and since my friend and I dined-in, I needed rice to go with my curry. I paired my curry with steam Jasmine Rice for $2.50 which I thought was quite expensive. Next time, I would only order curry for takeout. 

I also tried one of their signature dishes - Khao Mun Gai Tod (Fried Chicken - $13.95). It was basically a deep fried marinated chicken over ginger Thai Jasmine rice served with complimentary soup and their housemade sweet and sour plum sauce. It was delicious - not too oily and very flavourful. It tasted to me like a Japanese Katsu. The ginger thai rice was probably the best part of the dish. So perhaps I would order that with my curry next time. 

I would definitely come back again to try their lunch specials (M-F 11:30-3pm) or perhaps even their mango sticky rice dessert!"}
{"text":"First time trying this place with my bf and ordered online via skip the dishes. Kuay Tiew Gaeng with chicken was quite delicious. Mild curry with the right amount of spice. Bf ordered braised chicken with rice. We both found the portions to be very generous and filling haha. Would go back in the future to try the pad Thai, pad see ew, masaman beef curry and their specials."}
{"text":"Nice little Thai place that I went to for my birthday celebration.

So, I have been to Thailand before and this place brought back some memories. Although it was cold outside, the decor made it feel like I was there. 

I got the chicken pad thai (khao gaeng special) and it was pretty good. Threw some peanuts and the flavour popped. Honestly, I love these little places and just enjoy myself a lot when I go and eat; would definitely say I am a fan since I like my thai foods."}
{"text":"Food was decent, mind you the restaurant is still fairly new and is starting out..thus the more lenient review. I'd really  give it 3.75/5 if I could; keep reading if you want to find out why.

My boyfriend and I felt like the food held back a little on the spice and authenticity to cater towards its clientele. Like I said the food was still good, but we wanted authenticity!

We started with the chicken satay which was nothing special, but presentation was pretty. He had the curry pad Thai and I had the signature fried chicken. Both were good, however my boyfriend and I preferred my Khao Mun Gai Tod over his Curry Pad Thai. We got two Thai iced tea, as well, which were both yummy, but were definitely made sweeter than most places (if your palette preference is less sugary/sweet definitely let them know when you place the drink order).

I had to take away one star for the frigid environment. We did go in the middle of winter where it snowed 15cm the day of and the small dining room that has 3 tables of four had no vents in the front = no heat. Even our server wore a thick turtleneck under her uniform. They had one heater running right beside us, but we were both pretty cold, mind you I was in a sweater and had a scarf laid over and my boyfriend was just in a tshirt. There was also one heater that was unused which they really should have plugged in but didn't (maybe a fuse thing?) 

There were many takeout orders while we were dining in since everyone was taking advantage of the 15% Off take out cash only deal. One of the customers who placed an order and sat at a table 3 feet away from us was freezing in his WINTER jacket... He even tucked in his arms towards his chest to keep himself warm and he was still cold... Yeah, that cold. Oh... And our food that came FRESH out of the kitchen was practically room temperature after 2 bites because.... That's. How. COLD. the restaurant was
 So... Unless the restaurant works out some design solution, I'd recommend take-out until the weather gets a little warmer.  

Overall we weren't completely obsessed over the food like we wanted to be and  the interior is underfinished affecting the food quality, but we're definitely going to come back and give this spot one more try to make a final conclusion. They are pretty generous with their portions which is a plus. Again, this sounds like more of a bad review than good, but every restaurant that is starting out will always have pros and cons and there's always something that can be fine tuned. HOPE TO COME BACK AND SEE. AN IMPROVEMENT!"}
{"text":"Had family over and decided to take a chance on this Thai restaurant and we were thrilled with our orders. Everything was fresh and very tasty. Will definitely be putting Khao Gaeng at the top of our \"go to\" for Thai food."}
