{"text":"We looked for a good, authentic Korean place forever, and finally got to this in Chinatown. It's in an Asian food court with a dim and somewhat scuzzy ambiance.  BUT the food was definitely legit. You don't cook you're own bbq, but the bbq kalbi and the tofu soup are great. The staff is very nice. And the barley tea is a huge plus, very tasty. Soups are served in either stainless steal or stone pots, so its authentic. It's not generally frequented by foreigners, so I guess that was our sign that the food would be good. As far as getting good Korean food outside of Korea/Japan/Koreatown LA is considered, this place was legit."}
{"text":"This was a very different experience. It is almost like a fast- food -restaurant combination. You order and pay at the cashier area. Then you choose a seat in a food court area, then they bring the food to your table. The menu is limited but the food is pretty good. Their gyoza or dumplings are very crisp and good. Also, their special lunch combo comes at a decent price. I also love their hot plates that are shaped like cows, very cute. However, some of their dishes are very expensive, it is like about $7 for a smallish dish of potatoes marinated in a garlic sauce. Overall, nice service and good food."}
{"text":"My fave for quick, yummy Korean when I don't have time to cook at home. Food is consistent and delicious and I can't complain about the price! I always get a stone bowl (beef cheese is soooooo good... Especially when cheese crusts onto the hot bowl and then you can pick it off later with your spoon... *drool*). I also always get a soup. Jjampong or yukgaejang are my go to's. So good!"}
{"text":"The manager was very rude. His customers dirtied the table in front of the restaurant then 5 minutes later yelled at a woman with poor English skills about the location of the bathroom. I will never eat there."}
{"text":"The bi bim bap is to die for. Service is fast, polite, and efficient. And you definitely get a good sized meal for your money. A true gem of a place, tucked away in a little food court in China town."}
{"text":"One of my friends showed me this place 2 years ago and I've been a regular ever since. Kim Chi House is located in inside a mini-mall. I think if you never heard about this place from someone, wasn't curious to know what was behind Thai Thi in Chinatown or read a review on it online, I think anyone wouldnt discover this gem. Kim Chi House is a hidden gem that serves up really good Korean food at fast food prices! The Yuk Gae Jang or spicy beef soup with clear thin noodles is my favourite and they serve up the largest bowl of it in town and at the lowest price! So if you're looking for a Korean food fix in downtown, walk down to this place for lunch and you'll leave happy!  Happy Yelping"}
{"text":"Had some higher expectations coming here, having read they serve really good tofu soup and was in the mood for some in the cold weather. Ordered the spicy tofu soup, which was bland and a little disappointing. I probably wouldn't have given them a higher rating if my expectations were lower though."}
{"text":"My favorite lunch place when I'm at work. The stone bowl bibimbap is great. It comes with a few yummy sides of kimchi and pickles. The only major down side is that it's cash only."}
{"text":"Kimchi house is located in food court of  city plaza stripmall in Chinatown. You have to come early as it gets busy and the tables fill up. They have great Korean stone bowls that comes with miso soup and side dish of bean sprouts and spicy pickled radish. They also provide complimentary barley tea and water. A very good deal!"}
{"text":"This is a great lunch place for people working on the east side of downtown.  You sit in a casual food court but get restaurant quality food.    I highly recommend the stone bowl bibimbap.  It's so delicious that I just keep getting it over and over."}
{"text":"Having grown up around the San Francisco area, I am very picky and it has been hard to find authentic asian cuisine.  This is it!  First the cons:  * It's super busy so it might take about 20 minutes before you get your food.  * The owner may not be the most gracious only because he is super busy and is running around serving everyone.  He always seems to remember what everyone orders and brings it to you with out writing it down or a number. * It is in a food court and CASH Only  BUT!  two words describes this place and out weighs all of the cons....  AUTHENTIC & YUMMY!  I order the bul go ki. Comes with rice, kim chee and bean sprouts all for under $9.00.  Top it off, it is served with complimentary \"BARLEY TEA\" which is truely authentic to Korean restaurants. I have not been here for dinner but go early and don't be in a rush during lunch.    Lastly, all of the asians seem to know about this hidden gem as it is PACKED!"}
{"text":"Great choice for a stone bowl bibimbap in Chinatown easily accessible within downtown Calgary.  For $9.95 you can get a hot, sizzling beef, chicken or veggie bibimbap with the usual fixings (carrot, radish, sprouts) topped with a fried egg with a perfectly runny yolk. The highlight of the dish is the rice which crisps up on contact with the searing hot stone bowl. These dishes come served with a bowl of miso soup and side dishes of radish kimchi and sesame sprouts."}
{"text":"Always an awesome deal. Order quickly and pay with cash. The owner is abrupt but the food is yummy and quick. Teriyaki lunch special is a great deal, haven't had a lot of the soups. Heard good things about the soft tofu one. My favorite no frills Korean in the city."}
{"text":"Cash only!  I got the Bibimbap traditional beef and I didn't really like it too much. It was cheap for $9.95 which already includes taxes. The rice was really dry. But I had bibimbap else where but I don't recall it being that dry. Also there is only one kind of sauce that goes with it and its the spicy sauce. I did go up and ask for a different sauce and the response was what sauce. I told the owner something non spicy and he repeated what sauce. Not sure if he just didn't understand what I was saying.   This place is located in a run down food court. I probably won't go back again."}
{"text":"I haven't been back to eat at Kim Chi House for so long and decided to come and visit with my brothers and fiance. I remembered how cheap the food was and how the food was pretty decent for the price ($8-9 per meal). I was in for a suprise.  The prices are way higher now, ($10-20 per meal) which is not too bad if the food quality is good as well. I'm up for a bargain, but I tend to like food that is more worth the price.   We ordered an orginal bibimbap, chicken bibimbap, and tonkatsu. The bibimbap dishes were good, but it wasn't worth it. The bibimbap dishes also came with miso soup, which was very plain and 2 side dishes. Again, it's nothing special and there weren't enough side dishes that came with them. The tonkatsu was very disappointing. They gave you rice, cabbage salad(some of the cabbage was turning black) and heated up frozen veggies that you could buy in any grocery store.  Okay, I wouldn't have complained a long time ago, because the prices were so cheap and the food was decent. But now I was suprised at how the quality of the dishes deteriorated!   And trust me I have frequented this establishment since 2011 until 2014. So I guess for the 3 years I didn't visit them, all these changes happened. The only thing that didn't change was that they still only take cash, which is a total inconvenience.  I give them 2 stars for their good service, okay food, and for the free tea and water. Makes me sad that I will not be returning to Kim Chi House again probably for longer than 3 years."}
{"text":"Not a bad dish on the menu. Stone bowl bibimbap is the best I've had in Calgary. Nice variations on that dish, as well. Food court atmosphere but amazing food at excellent price point. No lies, I eat here twice a week."}
