{"text":"Lots of different cultures represented at this stand; Cambodian, Thai and Indian being a few. I've had: -Spring rolls (I've had shrimp and tofu.. vermicelli noodles and julienned vegetables) -Chicken wings (lemongrass stuffed reigns supreme) -Sushi (only on Saturdays!) -Coconut sticky rice (wrapped in banana leaves.. very tasty when reheated at home) -Pad thai (Chicken and shrimp)  The owners are very nice and prices are cheap. Would definitely recommend."}
{"text":"Great Pad Thai, friendly service, and a great selection. I didn't really know what to order since it all looked so good. We also got sticky rice, a strawberry bubble tea, a Blueberry Ramune Soda, and some sort of ginseng drink that had a ginseng root inside the bottle. We will be back to sample the rest of what this lovely stall has to offer."}
{"text":"I have always window shopped at this stand at WSM, but never tried anything.  I usually don't purchase prepared foods at WSM, mainly I purchase regular groceries there.  We decided to get a few different prepared items from Kim's yesterday and re-heat them for dinner.  We purchased a pint of chicken pad thai for $3.50, it had a lot of flavor depth and they even gave you a side of sauce to add to it to counteract the drying out factor of re-heating food.  The pad thai is also available in shrimp and vegetarian versions.  The dish was delicious and a great value.  I look forward to trying some of her other noodle and rice dishes.  We also got a couple chicken satay skewers and the meat was tender and flavorful.  We got a tray of pork dumplings which were obviously hand made and just as delicious as the other dishes.  We tried a pint of her wonton soup  and it was unlike any other wonton soup that I have ever had.  The broth was full of chicken flavor and the wontons were soft, delicate, and fluffy.  They almost melted in your mouth.  I look forward to returning and trying some of her other dishes (spring rolls, samosas, etc)  The service was friendly and the prices were spot on (all of the food that we got totaled $13).  I wish they had a full service restaurant."}
{"text":"I know what I saw on the Kim K sex tape, but what did Kim See? I came here to try and find out. Unfortunately, all I found was Ray J trying to sell me a knock off Rolex. I told him I didn't have the time, and tried some Cambodian food instead.  Kim Se is a lovely little Cambodian place that sells more Thai food than it does Cambodian. Their Pad Thai is really popular and she gave me a very generous person right before closing - even though she had packed up most of her stuff already.   Also, while you're at the WSM make sure you try a Lemon and Sugar Crepe from Crepes Du Luxe, as well as some spicy Jerky from Czuchraj, and a Brat from Frank's.  So, really friendly and the food was really tasty. It was somewhere between a 4 and a 5, but with the excellent service and the very competitive and surprisingly excellent price, there is no choice but for me to give this excellent little stand a 5-star rating. How many times can I say excellent in one review. Excellent.  Not bogus, anyway."}
{"text":"Best and most authentic homemade Cambodian and Thai food in Cleveland. The pad thai and stuffed chicken is to die for. Besides the food, the service is amazing. Sophie, the owner, is the sweetest person. Also- you can't beat the cheap eats. Try is all!"}
{"text":"I have been going to this stand in the West Side Market for years. They sell Cambodian, Thai, Chinese, and Indian cuisine. The prices are very reasonable for a container of Pad Thai, wonton soup, samosas, sticky rice or the delicious pork dumplings.  My favorite is the buckwheat noodle salad with spiced firm tofu. The stand owners julienne the vegetables and tofu into thin strips by hand. It's a delicious light refreshing meal by itself or as a side dish.  Another delicious offering are their spring rolls. They sell these in packs of six or by the piece.  One of the standouts are the stuffed fried chicken wings.  These are prepared with lemongrass and other spices and served with a sweet chili dipping sauce. They're absolutely amazing. They also do catering by request. If you like Asian food, this stand has a great selection of authentic food from all over Southeast Asia."}
{"text":"If you're looking for Asian food at the Market, this is the place to stop. The mochi is wonderful and if you're not in the mood to cook they've got all sorts of pre-made dishes (Pad Thai, please!) for you to take home and re-heat."}
{"text":"Kim Se happiness  buckwheat noodle and pad thai  Cambodian yums.   I work in the evenings, and when I come home, I am  1. To beat to cook.  2. Hungry.  3. Can't sleep too well after a pastrami sandwich.  4. Hungry.   I love to grab a few things on a Friday morning Westside market trip from Kim Se. Chicken Satay, shrimp/tofu/chicken fried rice, pad thai, green curry soup, dumplings, are all fresh, homemade, and delicious. Just a hint of cilantro in the spring rolls, a full assortment of condiments too. Also, you have the option of them heating food up for immediate consumption. Kim Se adds to the growing diversity of WSM's foods. I like that more stands offer freshly prepared, not mass produced industrial food. Also, the spring rolls are a perfect food for bachelorette party snacks. Healthy, lo-cal, and ....umm.. phallic.  Carry on."}
{"text":"All I ordered from Kim Se was an order of chili chicken wings, and they were very good. 5 wings for a $2 price tag, and they had a good mix of sweet and spice in the chili sauce. The wings were cooked well and had just the right amount of sauce too."}
{"text":"Some of the best Chicken Pad Thai I've ever had! The peanut flavor in it was delicious, and the duck sauce really tops it off!   I love this little place inside West Side! There are plenty of food choices, along with Japanese sodas, boba tea, and lots more. The woman who runs this place is so sweet and friendly!"}
{"text":"We came on such a cold and rainy day and their warm sticky rice just totally hit the spot. It had great flavor and the texture was perfect, sticky but didn't make your mouth feel like glue. Loved it."}
{"text":"Great Mochi, friendly service, unique and healthy looking lunch options, and a nice selection of Oriental groceries."}
{"text":"Kim Se is one of my favorite stands at the market. I like to pick up summer rolls, fried rice and pad thai to stash in my fridge. The fried rice is an excellent value for $2. It is hard to make your own meal for that cheap. I do enjoy eating out but sometimes it is just a lot easier and economical to pick up a few prepared items and heat them up at home. The customer service is excellent as well."}
{"text":"fantastic and authentic Khmer and Thai food. The stuffed chiken wings are the bomb."}
