{"text":"This use to be a great spot for large sushi trays at reasonable prices. The quality has always been only ok but the quantity and presentation always made up for it.  Appears to be under new management now and unfortunately the quality hasn't gotten any better but the quantity and presentation has really gone down hill.  I would say the trays no longer look like the pictures that they advertise. That's too bad cause now I need to find a new sushi spot.  Farewell \"Kim's Ichiban\" it was good while it lasted."}
{"text":"I used to love this place a few years back but i hadn't been in a while.  I came here craving a decent chirashi and I'm sad to say I'm a bit disappointed.  The chirashi was about 70% salmon...I guess some people would like that but I'm not much of a salmon fan.  And while the quality of the fish wasnt bad, it wasn't outstanding either. The salmon was too thinly sliced as well.  While it's still an ok place to eat, with the number of jpn ewstauranrs in the area I probably won't be coming back."}
{"text":"Ordered the large platter to go for a recent party and the price seemed fair but as others have noted the selection isn't that great.  Lots of salmon, tuna and rolls but I was hoping with the large platter they'd be more variety.  Quality was fine but nothing out of the ordinary so rather average.  

I would try somewhere else next time I want to order a platter."}
{"text":"Their sushi r fresh n sweet. Price is also very decent which u can't find anywhere in city compare to quality n $. 
The owner is very nice too. 
I visit this shop very time I go Timesquare."}
{"text":"They do mainly take-out, although there are a few small tables if you wish to dine-in.

This is my #1 place for ordering sushi party trays.  They have good quality sushi for the price range.  I have ordered many times, quality is very consistent.

For eat-in, definitely not the most elegant sushi place.  For a quick meal though, not bad.  My only complaint is that the place smells a little fishy.. so it can only be a \"quick\" meal =P"}
{"text":"This is mainly a take-out restaurant.  It is better to order first before you come.

The sushi and sashimi platter has many different sizes.  It includes tuna, salmon, white fish, mackerel sashimi.  The same types of fish are on sushi plus eel, shrimp and octopus.  You can see bigger portion is on salmon.  Octopus has only 2 pieces. Roll only of tuna. 

The fish is fresh but the cut is slightly to the thin side and the width is half to ¾ inches - not a big piece.  If you are looking for many different combinations and thick big slices of sashimi, then it is not the place.  But for average consumption, it is cheap.  I think it only accepts cash and whatever the menu price is what you going to pay.

Before you leave, a free hand roll makes you happy"}
{"text":"I was recommended to come here by my friends friend, she told me this is the best sushi house she has been too. Now, I'm pretty much going here every week, their ingredients are super fresh and good quality, prices are fair and the people there are very nice. Everytime you go there, no matter how much you order, they'll always offer you a free hand roll. I seriously live this place and would totally give them a 5/5 if only their seating aren't that unfortable."}
{"text":"Are the seats comfortable? No.
Can you squish more than four people per party? No.
Is it all worth it? YES!

It is family-owned and the people there are honestly so great. They greet you with a smile and try to help you with your order, all the while giving you space. I've been going here since I was a young child and nothing's changed. Nothing needs to change.

The menu is simple and speaks for itself. It focuses on the fish and how fresh it is, not mayo or anything like that. Order a party tray and split it with whoever you're with. They'll point out what was shipped in that very day, or a unique fish they happened to find. I've always gotten a free hand roll per person with my order, which is so sweet of them. Tea is DIY, in a styrofoam cup and very hot, so watch out. The bulk of their business comes from take-out orders, dozens of people walk in and out of the tiny restaurant for pick up.

With a no-frills decor, this place doesn't need fancy decor or culinary bells and whistles to prove how tasty everything is."}
{"text":"I'm not sure if Kim's Ichiban changed owners or something. I've been going there for years and the previous portions were very generous and worth the money up until today. 

The portions are now tiny. It didn't even come with half the amount or quality it used to be. It was pretty shocking to see the difference.

The place has also now renovated with a new menu so beware that it may not be the same business."}
{"text":"I think this place just recently received a face lift due to the fact that the pictures don't necessarily match what I've seen from this place - GOD I'm hoping I'm actually reviewing the right place, so here goes..

My friend and I came here when it was dead and we were the only ones here a little after lunch. A young server came out to greet us and took our orders. 

The entire time the server and chef left us alone and didn't really interrupt us other than to take our food and refill our teas, at which point he just let us have the entire pot to ourselves.

The quality of the fish and sashimi were not the freshest I've ever tasted, and nothing special really popped out from what we ordered. It was pretty mediocre."}
{"text":"solid 3.5. It's very average sushi and very fair prices. I usually order a la carte sushi and sashimi instead of the trays so that I can have the uni, ikura, tuna, scallop, yellow tail and ika which are some of my favourites. 
Prices are very fair, don't think the prices have changed in years. Except the uni which has gone up a dollar or two. The menu hasn't been updated to reflect that change. 
I enjoy the free hand roll that they give you while you wait. Doesn't always happen but most times, you can expect one. 
Definitely don't sit down there. This is clearly a restaurant that is based on take out. 
I've had dinner at the restaurant and its very small so better to take it out and eat at home.
Very nice sweet hard working Koreans running this place. Not bad for cheap takeout."}
{"text":"Cheap option for sushi and sashimi, but the fish is not the freshest. The uni there gave me a stomachache"}
{"text":"I give this place about 4 stars.
6.5/10 stars for the quality
9/10 stars for the value.
8.5/10 for services
7.5/10 overall (not an average)

This place was one of my favorites (until hwy 7 started doing constructions, my workplace being too far from this place, etc). Still, I find time to come here from time to time.

While the quality is not the top of the line here (like Aoyama, Jabistro, etc), but the quality is still great while keeping the prices really low. I think their prices haven't changed for at least 10 years (and I've been going there for at least that long).

I typically order the chirashi for 10 dollars after tax for some quick sushi fix. Sometimes I order the ichiban sushi for 13 dollars. Excellent value for the amount of pieces you get, but the variety can be lacking sometimes (like 5 out of 10 pieces may be salmon). Some people are okay with that, and I'm certainly okay with that if I'm just going for some quick sushi fix.

If I recall, the order only includes soup if you dine-in.

They typically give out free hand rolls as you are waiting for your take out.

Once in a while, when the mood strikes (and if they have stock), I order the sea urchin sushi or sashimi. Typically, they have fresh, tasty sea urchin sashimi, which you may not expect from a small restaurant like this. Some people expect bigger restaurants to have better sea urchins because they order more often because they high turnover of products. I believe it's not necessarily true. I've had some bad tasting sea urchin from seemingly good restaurants. Ideally, inspect the sea urchin to see the color before you order it, which you can do when you're ordering, as you have full view of their sushi bar items.

Anyway, sea urchin sushi ($5.50 for 2 pieces) and sashimi ($5.00 for a glob, for lack of a better term) here is excellent value.

I've also ordered big party trays for catering. Again, excellent value for the amount of pieces you get, but typically it lacks variety (usually lots of salmon, california rolls).

If I were to compare this to some of the other places in the area..

Akasaka is much pricier and somewhat better (some people might disagree).
Miyabi is also much pricier (expect 30-40 a person) and much better in quality.
Wasabi is all you can eat but the quality is poorer, and I would much prefer Kim's Ichiban over wasabi.

This place is cash only, I believe.

The restaurant doesn't have a lot of place for sit in, so don't bring big groups.

Bottom line: If you're looking for some quick, cheap sushi fix of good quality, this is your place. And I come back time and time again because they have good quality Uni much more often than other places."}
{"text":"The price was right and the sushi was fine. The seating is pretty uncomfortable. This seems like more of a takeout place."}
{"text":"All been coming here for years now. Great customer service and Very welcoming staff. Yes is not the most comfortable place to eat in, but if you factor in the taste and valve I don't think there is a place that can even come close."}
{"text":"Great platter for reasonable price.   We were looking for take out on our way home & found this on Yelp.   

Small location looks a bit old - but the platter selection, taste and freshness of the sashimi was great.  For $60 was a generous portion of delicious fish.   Definitely recommend!"}
{"text":"I would consider this place a hidden gem as we come to this plaza quite often yet we have never tried it under the impression that they only do large takeout orders.

Located in one of the oldest Asian Plazas, Kim's Ichiban is a very small take out sushi restaurant that specializes in sushi and sashimi platter. Kim's has been around for years, we're aware of it yet we've never tried it. Surely we don't regret visiting as this has become a new favorite!

There are around 6 small tables in the cozy restaurant space that provide customers a dine-in option. They also have a self serve hot tea station. 

For the 3 of us, we ordered a 40 pieces sushi and sashimi platter. This particular tray consists of salmon, tuna, surf clam, butter fish, snapper, BC tuna, octopus, inari, flying fish roe sushi, california roll, bulgogi roll etc. The friendly staff also served us miso soup with our platter. It was a good portion and we were very satisfied with our meal. 

Mmmmm Look at how fresh the sashimi looks! Of course they taste as fresh as they look.  Although we only ordered 40 pieces, they gave us more than that. 

This is the Kimchi Salmon Handroll with avocado and cucumber. This was probably the favorite part of our meal! The rice was flavored just right, the kimchi gives it a good amount of spiciness and texture. Together with the creaminess of the avocado and salmon, all the ingredients compliment each other extremely well and leaves you craving for more.   
All in all we enjoyed the experience at Kim's. Food was great and service was excellent. We are aware that they are a take out restaurant but it would be great if they provide more comfortable  seating giving customers a dine-in option. Nonetheless, we would definitely return again!"}
{"text":"I wish I could live right next door to this restaurant because even though we have it two to three times a month, it is NOT enough. 

I love their sushi! I usually order the Kame Sushi ($8.95) for takeout and it includes and assortment of fresh and yummy fish. The restaurant itself is a bit small with around four tables so I would recommend take-out. The staff there are so nice, they always greet you with a big smile, and if you're lucky, they might even throw in a delicious handroll for free as you're waiting for your takeout or after you're done eating your meal at the restaurant.

Try it once and I guarantee you'll be planning to go back again :)"}
{"text":"Id like to give a 5 stars; however their location is not ideal at all as a sit down. They are; however, great for take out. They are also super nice and gave me spicy salmon hand rolls and are fairly quick. Prices are very fair and the sushi is fresh. I ordered a large sushi platter for 50$. It seems like platters are their mainstay as they had quite a few customers walk in while i was waiting to pick up."}
{"text":"I'm in this area a lot and when i found this ichiban, I was really excited because it could be one of my 'go-to' sushi places in the area. I ordered a small sashimi tray to go. When i opened up the box, the fish looked like it was cut with a dull knife - fine, no biggie. In my first bite, I got fish scales in my mouth, again, no big deal, then another piece of salmon - this one was accompanied with tendon or something elastic like holding it together. Then I turned to the tuna, thinking it was just the salmon that was bad quality. The tuna had a very strange smell but I tried to eat it anyway (thinking it was the packaging of the radish it came on top of), but two chews in, it was just not tasting right. The whole piece tasted sour and hairy. I threw up immediately. And that was my first and last time eating from Kim's. The prices aren't particularly low, and the quality is terrible."}
{"text":"Ichiban market is a no-frills stop for a quick sushi fix, the service is one step up from at eating a food court but the sushi is fresh and the fish quality is at the level of a good restaurant. You serve yourself tea from the large tea canister on the side and you can bring your order up to the counter if the waitress doesn't come by on her own. 

We ordered an Ichiban Sushi (15 pc) for $12.99 and a Unagi Roll (6 pcs) for $4.99 between two people. It came with miso soup for each person but no salad (but who really misses the salad?). The Ichiban Sushi set has 10 pieces of sushi (6 salmon, 1 white, 1 red, 1 shrimp and 1 soy wrap) and 6pcs of california rolls. Both the rice and fish is noticeably, with no weird aftertaste or tendons. A great place for restaurant level sushi but don't need the full frill service of a restaurant."}
{"text":"Affordable sushi close to home! Many people take out but my sister and I decided to have a sit down meal there. We ordered the small sashimi to share which is 20 pieces of sashimi for $20, a better deal than other local Japanese restaurants. Variety in the sashimi is lacking (as seen in my photos) since it was mainly salmon. However, as a salmon lover, I have no complaints! Quality was also there. So you definitely get your money's worth (and more)! 

I also ordered a California roll (6piece for $4). It was typical, exactly what you expected. They gave us miso soup as service. 

All in all, would I return? 
If you're feeling for sushi at home and at an affordable place, this place is a try!"}
{"text":"I like going here for their party tray. The service is good, the location is convenient and they let you change your sushi free of charge. However, the salmon grade is only decent. I would recommended this place to friends and family. Also, free handrolls! Hope this helps."}
{"text":"The seating are tight and uncomfortable, but the fish are really fresh. The family who runs it is always friendly. Now, selection it's not what you would call \"extensive\", so, be aware, and free drink only includes hot tea or tap water.
I probably won't come back for dinner-in, but I know where I'll go to get the best party tray for the next party."}
{"text":"Super fresh and tasty but also comes with more $$...not the traditional restaurant type setting as its more like a fish market with sushi bar type seating and grocery store type isles for other products. 

They have fridges as well that store fish for take home.  

Overall great place to get fresh fish!"}
{"text":"Kim's Ichiban Market is not bad if you want to have some cheap quick sushi fix. 

My Ichiban Sushi ($13 tax in) was good as I was full after eating that. Fish is acceptable but I would not use the word \"fresh\". Some of the fish cut was really awkward like it was some ends of the piece.

If I ever come back, I would ask what fresh and order a la carte by the piece.

And of course good for a party platter to entertain and feed a big group."}
{"text":"Always past by this place at Times Square and finally tried it for a late lunch. This place is definitely more for take out than a sit down although there are some seating available; it is small and tight. Decided to sit down just to get lunch over with since it was late already. Ordered the Chirashi since it didn't make sense to order their big platters (another reason why it was probably better for take out). The price was ok but the quality seems to be a little small. The food itself seemed fresh but my salmon seemed to be smeared with a lot of lemon. Their wasabi was pretty spicy.  Service wise, since it seemed like it was more of a take out place, their soya sauce was not on the table, needed to asked them for it and the took it out of the fridge. No drinks were served (water or tea), but I guess it was shelf served? There was a kettle behind me."}
