{"text":"I attempted to use my living social voucher this afternoon at Kimberly Ann's Tea Room. Had the pleasure of dealing directly with the manager/owner, Kimberly. Unfortunately, she would not honor my voucher stating that it required 24 hour advance reservation. I asked her to show me where in the fine print this stipulation was listed and when she was unable to find it she stated that it was Living Social's fault for not including it. Really? Aren't you in charge of final ad copy as the merchant?? I requested that she apply my voucher to purchase price of anything else on the menu and she refused. I didn't think that was too much to ask. Now she will have to deal with the negative feedback about her establishment/management practices on the internet. Definitely NOT a smart management decision on her part.   Below is an exact copy of fine print on my voucher:  the fine print  Limit 2 per customer, 2 additional as gifts Limit 1 per table per visit Valid Monday through Thursday Excludes holidays including Valentine's Day, Easter, and Mothers Day weekend Entire value must be used in a single visit"}
{"text":"I did not visit Kimberly Ann's.  This review is based on poor customer service and the difficulties trying to make a reservation.  I bought a Groupon for high tea.  Every time that I called to make reservations, there was no availability at any time on weekends -- even 2 months in advance!!  Can they really be that busy??  Even the good folks at Groupon were unable to secure a reservation during the 6 month window, and they refunded my money."}
{"text":"Quaint is the word that comes to mind when I think of Kimberly Ann's Tea Room. Locate in a house on 59th Avenue, each room has a different theme and color scheme. Advanced reservations are required for High Tea. We had \"Tea for Two\" which is very reasonably priced. A pot of tea, two scones, house made Devonshire Cream and house made Strawberry Jam for $10.95. Lovely way to spend time talking with friends."}
{"text":"Most people don't really understand what \"High Tea\" is.  Since we had one of these 3 years ago in Victoria, British Columbia we couldn't help but compare it.  Kimberly Anns was much more elegant and tasty than the one in BC.  For example the scone in BC was plain and here is is flavored and comes with a lemon curd and Devonshire cream. We would highly recommend it.  Well worth the money and the experience.  My wife is planning on taking our granddaughters to the \"Princess Room Tea\" in the future."}
{"text":"today a friend and I went to Kimberly's Tea Room. We had a reservation and was greeted with an already prepared table on our arrival.  We were greeted at the door. We ordered the vanilla tea. It was amazing.   My friend and I tend to talk for hours and luckily they did not need our table. It was a very delightful experience.  The scones were warm and right out of the oven. The mini sandwiches were so delicious. Just be sure you park on Myrtle and 59th ave not next to the building."}
{"text":"Took my Mother to High Tea today thankfully the owner extended my Living social voucher for one more day.  Boy what a mistake it was buying this deal!! I bought two vouchers but was told I could only use one even if we say at separate tables. Ok so I should read the fine print better.  Our waiter was the only one working today bad sign, we saw him a total of 4 times , had to go find someone for a box and then we were leaving out the back since my mom is disabled . Waiter comes out joking I thought that we were dining and ditching!!! I told him tip is on the table he said it wasn't correct!! Well I am not leaving 12.50$ for his tip !! Talked to the owner who called me cheap and said everyone else left that much ! Not me!! As I was leaving heard waiter say \" yah and they tried to leave without paying!! Oh ya me and my disabled mom making a run for it!! Ha ha would not recommend this place to anyone!!!"}
{"text":"Pros: - Pleasant room atmosphere - Place is using AC - Great service Cons: - The platter items/high teas - are not available - until you pre order (no one mentioned on the phone before coming out).  Will try http://carefreetea.com as per other reviewer's recommendations.  Update: (carefreetea.com) much better (need to make an reservation!)"}
{"text":"I took my grandmother and great aunt here last Tuesday for lunch.  My great aunt was visiting from South Dakota and I asked some coworkers where I should take her out to lunch in Phoenix.  Kimberly Ann's was suggested.  I called and asked if I needed a reservation around 11 am, and was told that was not necessary.  It made me kind of nervous, I was worried we would get there and not get a table.  But we did.  Upon arrival, the girl who greeted us asked if I had called and said she already had a table set aside for us!! It was nice.  She was also our server.  I do not remember her name, but she deserves kudos and hope management can determine who she was by the time and date we were there (March 24, 2015 @ 1:15pm).  She went over the menu thoroughly from drinks to lunch selections.  We were all pleased with our choices.  I had the stuffed tomato.  The restaurant itself was cute and the ladies enjoyed it.  Great all around experience and perfect place to take an out of town visitor."}
{"text":"Avoid this place!  Rude, overpriced and nasty service, especially the manager/owner.  Sandwiches were dried out.  They insisted that all parents order at my daughter's birthday party which cost $25 for each girl.  Then, they embarrased a parent by pointing out that she was late to the party. They also commented that we were taking up too much room in their playroom, although it's tiny and could not have accommodated another party.  I'll NEVER return to this place again."}
{"text":"I wish I could review this place, but after walking past we found it closed...on a Saturday...despite it being 10:30 and the posted business hours said 10-4...  I am in favor of helping local business and I enjoy spending money at mom and pop's rather than chains, but it is hard to do when a business doesn't even adhere to their posted hours."}
{"text":"Ditto on what others have posted! I have no idea why this place offers groupons b/c they obviously are convinced you are trying to put something past them--from the reservation phone call where we were grilled about the groupon, to the demand for a 20% gratuity in cash-only, to the surly description of exactly what we'd be served (I didn't even ask). They clearly resented us and our use of their groupon offer as evidenced by the all around bad attitude.  The food was tasty, but nothing special, and as another poster commented, for the price ($25 plus $10 required tip) you could go to a really nice restaurant and get a great meal, especially if you are even thinking of paying full price.  All in all, it left a bad taste in our mouth!"}
{"text":"First off, I really like this place.  It was my favorite tea spot in the valley...until today.  I have taken my mom for high tea at Kimberly Ann's several times and we have always enjoyed it.  We used to go to the English Rose, the Phoenician, or one of the other resorts for Mother's Day tea, but this year I was excited to treat some of the ladies in my family to Kimberly Ann's.  I made reservations several weeks ago - there were to be 5 of us.  This (Mother's Day) morning I found out that my aunt is very ill and could not join us, so we called to reduce the reservation to 4.  At that time we were told the food was already made and we would have to pay for 5.  The food was yummy and the atmosphere adorable, but I could not enjoy the experience knowing that it is a standard business practice to penalize patrons.  Unfortunately, this customer service decision makes it so - out of principal - I will not go back.  I'm sad too - for my family and the family of the owners - because it could have become our Mother's Day tea tradition.  I do not want to deter you from trying this place.  Give it a shot.  But be warned that altering your reservations may result in a penalty.  And I don't know if this applies all year, or only on their busiest days."}
{"text":"We've all done it: bought a Groupon on impulse, before fully investigating reviews. Having read through other reviews, especially regarding the redemption of Groupons, I was fully prepared for a bit of disappointment with Kimberly Ann's. Since I needed a summer activity for my daughter, I decided to give it a shot.  When I called for my reservation a week earlier, I was told of the cancellation policy and the cash-only (and apparently mandatory) gratuity. I was not asked for a credit card. I requested all vegetarian sandwiches, thinking that might be met with resistance, but the woman I spoke to didn't hesitate to say that would be fine.   We parked on a side street and walked over. I'm not clear where the actual recommended parking area is. Regardless, it wasn't far to walk. We also went on a Thursday at 11:00 and it wasn't busy at all. There is a sign on the front door saying that they don't accept Groupons on weekends.  The tea itself was very good and there is a list of about 20 choices, plus iced teas. We had the green peach mango tea, which comes as loose-leaf tea in a pot and requires use of a strainer. When the tray of food arrived, the server told us what each item was and yes, they had included only cucumber and egg salad sandwiches. I hadn't reminded our server of the vegetarian substitution (I honestly forgot.) so it was nice not to have to ask for replacement sandwiches after they were served. The white chocolate chip scones were soft, not at all dry or crumbly, and easily the highlight of the tray. The sandwiches were good, but kind of boring. It would be nice to have a few other non-meat choices -- pimento cheese, cream cheese and jam, or even adding a cheese scone instead of the meat sandwiches would all be interesting inclusions. We were not at all rushed and our server was attentive, but didn't hover. We had leftovers that we were encouraged to take with us.  My daughter really enjoyed all of it and I am glad we decided to go. Since we had no trouble using a Groupon, I'll keep an eye out for others."}
{"text":"My sister and I knew we were in for a challenge at our tea today after trying unsuccessfully to use two Groupons toward a reservation for six a month ago. We gave up and went elsewhere for that event when they told us what the total price would be! But we had to use up at least one of the Groupons, and today was the day. We got the same dire warnings and rudeness while making the reservation that most everyone has already mentioned rather than anything like warmth or hospitality. Someone who I told that we had purchased two Groupons said, hurry and use them fast as they'll surely be out of business soon!  Aside from the hokey decor, and unprofessional service, the food was quite good. I'm guessing \"grandma\" is a great baker and lots of folks told her she should open a restaurant. Playing nicely with her guests however is not her strong suit.  In addition, our (one)pot of tea was at best, tepid. The \"grandson\" tried to argue about it, but finally agreed to a fresh pot, but not fresh cups. So silly!  Bottom line, for the price, you could go to the Phoenician or Carefree and be treated with class. Sorry grandma."}
{"text":"I was SO excited to go here... One of my clients wanted to thank me for the work we accomplished together and so she treated me to High Tea. I dressed up for the occasion and when we walked up I noticed the sign next to the door announcing the soup and scone and salad (I think?) of the day. It was listed as a walnut scone and since I am HIGHLY allergic I told our server as soon as we were seated that I would need whatever the alternative was due to my allergy.  There was no nut free alternative. And on top of that she scolded me like a child for not saying something at the time of the reservation. My client had no clue of my allergy and could not have known. THEN our tray of goodies were brought out and she pointed out everything on the trays that had nuts in it. (Probably close to 75% of the tray was nutty). She half heartedly apologized that there was nothing they could do and that I would have to pick around my allergens. In today's day I am stunned that they are so callous towards such a common issue, and that they couldn't have been bothered to even make me some sandwiches on a different bread so I could enjoy a little more than half a sandwich and some fruit.  The tea wad lovely, and the decor was perfect for a tea house, but their total lack of regard was awful. If I had gone on my own I would have demanded a refund and made a but of a scene. As it stands I think I'm going to be letting the health department know about this place...."}
{"text":"This was a first for us... a co-worker mentioned it to me because she knew we were gonna have our precious granddaughter here for spring break and I love doing girly things with her. They sat us in the Princess Room!!! The tea was yum, the food was excellent, and the server was beyond sweet. My granddaughter LOVED the homemade chicken veggie soup, it had noodles stuffed with chicken and she was even excited that she loved the peas in the soup, LOL. She also had the half ham & cheese that she devoured.  My hubby had the egg salad sammy with a side garden salad that was huge and I had the chef salad with a cheddar scone that was to die for!!! I am going to pre-order a dozen of those in the future... then the princess wanted the hot fudge sundae brownie that was also tasty! Overall, great food at a great price... sure there is need for a total cleaning of the place but nothing that a 6 yr old Princess having a tea party would ever notice!"}
{"text":"I came here with my husband to try the tea for two. We had a pot of the Fresh Peach Black tea and a couple of Apricot Almond scones. Everything was absolutely delicious. Our server, Tiffany, was very pleasant and provided excellent service. The entire experience was relaxing and comfortable. Based on this trip, we will definitely be back."}
{"text":"I took my mother here for her birthday and used my groupon.  As mentioned by other reviews, follow the rules or you may be shot. I'm glad I had a groupon because I would never spend $50 for two for High Tea here.  The decor is very outdated & tacky, not vintage, and the china is \"made in China\" not even real tea cups!!! One pot of tea is given, even when I only drink decaf & my mom likes regular.  The sandwiches were soggy, the scones a little stale, and the brownies were definitely Betty Crocker from a box. I did like the bite size carrot cake cupcake, but it was just a bite! Like I said, not worth the regular price of $50. There are a lot of other great restaurants to eat lunch at for a lot less! And you won't get in trouble if you forget a rule!!!! If you want High Tea, try the English Rose Tea Room in Carefree, or spend a little more and really live it up at the Biltmore or The Phoenician."}
{"text":"I have had the pleasure of having high tea at least 20 times at Kimberly Ann's and have nothing but good things to say about them. The food has always been absolutely phenomenal. My favorite are their yummy homemade scones. I often ask if they have extras and take some home to enjoy later. They even include lemon curd and devonshire cream in my to-go box. I also love the cucumber sandwiches!!  The service has always been absolutely fabulous. They are very accomodating as well. I often use groupons and have had no problems. As long as you make reservations in advance and notify them you have a groupon there should be no problem. I don't eat tuna and have always requested no tuna and double cucumber instead and have never had a problem. The key is to ask in advance. As a family run, small business they have to plan out the food. I have taken many different people with me for tea from friends, to nieces, to grandparents and we have always had an amazing experience."}
{"text":"Went there today looking forward to Tea Time with my little girl. I was given a Living Social coupon from a friend of mine, who lives in North Carolina. When I got there, they told me my coupon had already been redeemed by my friend - the one who lives in North Carolina. When I told them this was not possible, and as evidence I had the physical copy of the coupon (which they take whenever it is redeemed, so the fact that I still had it is evidence that it had not been redeemed), they said there was nothing they could do. I had my daughter with me, and I just wanted to have a nice time, so I said I would order from the menu and pay full price. They sat in me a very cute princess decor room - only one of the table was not bussed and still had chewed up food on it. By this time, it was 25 minutes passed my reservation time. 20 more minutes passed and no one ever came to get our order. By this time it was 45 minutes passed my reservation time. So we just left and ended up having lunch at Subway. This place has a history of bad service. Stay away."}
{"text":"A tea shoppe serving tea in bags...that can be bought at the local grocery store...tsk, tsk.  Some of the food was from Costco (confirmed by our waitress).  My sister and daughter thought the chicken salad made them a little sick."}
{"text":"I had purchased a Groupon, and then I had read some of the yelp reviews. So we were not caught off guard when we called to make reservations, and they were very clear that the tip is not included. Of course the tip was not included, this NOT in Europe lol  The highlight was that the tea  was absolutely amazing, the service was good. The girl that was our server was very sweet. The scones were good although it was very small compared to the Groupon picture. We thought it would be served with fresh fruit but it was not. All in all it's a very charming place, and a good experience."}
{"text":"Went there yesterday with my mom. We were seated immediately and received excellent and prompt service!   We had English Breakfast which was very good. The server kept refilling our pot even though we were there for an extended period of time.  The sandwiches, fruit and desserts were delightful, but the real reason I am giving this place five stars was the peppermint almond scones. I normally hate scones, but these were unbelievably good. I will definitely be going back for them.  The house was also adorable! Such a wonderful experience, and downtown Glendale is the perfect location to soak up the Christmas season after tea!"}
{"text":"Tried this place out for high tea today with a groupon. All in all, great experience and lovely selection of finger sandwiches. I would describe this place as traditional, including both the decor and the spread of finger foods that came with the high tea package. The scones were amazing, as well as the homemade Devonshire cream and lemon curd. The only downfall is that the decor is almost too childish, but some may find this charming. Definitely a nice change from your traditional more luxurious (and sometimes snooty) high tea venues. The regular price is a little steep but I would definitely recommend this place on a groupon. My boyfriend wants me to include that this place is excellent for kids because they cut the crust off of the sandwiches (lol). I'm sure we will be back."}
{"text":"This is the very first time, that I have ever been to a High Tea! I was really impressed. My friend had made reservations for us, so we went on a Friday. When we were both off work. High Tea is served at 11 till 2;00. I think you must make a rez for High Tea, but you also just go in for lunch . I believe that lunch service starts at 11:30. There were Quite a few people outside waiting for the house to open up for service. When they did open, the girls working there were very busy.  They had a lot of patrons for High Tea.  The house has been decorated very nicely. We got to look around when we were through with lunch and it was lovely. Each room had a theme, including a room for the young girls (children) called The Princess Room.  You are given a menu with about 20 different teas on it and you choose the type you would like. The Tea was loose Tea and fantastic.  The food was served in the traditional way. 4 different types of sandwiches , as well as fruit and dessert. It was far more than we could eat, so we got the rest to go. We are looking forward to going back as it was a lovely afternoon.  Parking can be a little dodgy. You just have to look around a little in the neighborhood. Plus, there is a free public parking across the street which is really nice as well."}
{"text":"First I would like to say that the girl who was the hostess/waitress was very sweet and polite.  However, the reason I'm giving such a poor rating is because the food was stale. The salad had browned and stale lettuce and spinach. The fruit in the salad was old and the dressing tasted like it had been sitting in the fridge in an open container for a while as it also had staleness taste.  I'm sad to write this because I love supporting local mom and pop establishments. I'm hoping they will read all the reviews and try to accept as constructive feedback. I hope to visit back someday and try them again."}
{"text":"Worst customer service!!!!! I will never come back and advise someone to spend the extra cash and go to a hotel(the Phoenician and Ritz are really nice and reasonable price) , where you will have quality and quantity.  I NEVER WRITE REVIEWS, but felt very compelled to share my experience. I love to support local, so my friends birthday I wanted it to be really special. 6 of us girls went, I originally made reservations for 8. Called back and rescheduled the date and time, the lady I spoke to asked me to call back the next day because she was leaving and had locked everything up. The next day I called back to cancel my original reservation and number count. Day of, I called to reconfirm they had the time and reservation ready. The lady I spoke to was super rude!! She said she thought it was odd I was calling to confirm and that they had the original head count of 8. I asked to speak to the owner and she said no \"My grandma would never mess up and she is busy prepping your food\". They said if you decide to come or not you will still be charged for 8 people. RUDE!  During our High Tea, a lady came out and said, should I serve the extra two servings or box it up to go. That was uncomfortable because the girls were wondering what was going on. I asked her to box it, then after the meal the waitress brought out the check and asked who would pay for the extra two.  The restaurant was packed and had many other tables, so I do not understand why the \"prepped\" food would not be given to another table, there was nothing special or made to order.  The table was charged an extra 100 + tip. I will not return and hope you take this into consideration.  I work in customer service and spread everything I love word of mouth to family and friends, I do not support this place or what It stands for."}
{"text":"I used to live in England as a student and sometimes get a craving for English afternoon teas (scones especially!). As such I was excited to find out there was a closer place than the Carefree English tea room that I could try out. After taking my sister to Kimberly's, I guess I'll still be making the drive to Carefree.  Nothing about our experience was bad. The decorations inside the house are cute and quaint, not over the top. The servers were friendly and efficient. I didn't like that the front room has a direct view into the kitchen--something about eating while a crowd of servers and cooks are in your direct line of sight was off-putting, like I didn't really feel peaceful or secluded. I liked that there were little teacups and trinkets on the shelves for sale (my sister got a tiny teacup and matching plate for 5$). I noticed a lot of people coming in, asking for tea, but you have to make reservations for tea AND it's only served at two times, 11 AM and 2 PM. I find this a little unaccomodating, but whatever.   The food was just meh. We got the Garden Tea for 2. Homemade chicken soup was just okay, nothing special, and we ordered two cheddar scones on the side. These were not really scones, but dense Red Lobster-biscuits that were very small and didn't taste that good. When the three-tier tea plates came out, the presentation was nice but again, the food was just meh. The scones were very small and did not taste like authentic scones. (The devon cream, however, was awesome!) The sandwiches were bland and just didn't taste great. The fruit was just some large-cut watermelon and grapes, nothing fancy about it. There were slices of quiche that were very cold, dry, and unappealing. All in all, I wouldn't call the food a disappointment, I just wasn't impressed by it. The tea was great, but not served with sugar cubes or cream the way that other places do it.)  If you want quality and atmosphere, go to the English Tea Room in Carefree. If you don't feel like making the drive, Kimberley Ann's Tea Room is acceptable and adequate, but not spectacular."}
{"text":"Service was very slow and not attentive at all.  I asked for creamer three times, even standing up and walking into the kitchen to finally get some.  Food is pre bought and not worth the money.  Tea for 2 adults and 1 child was $100.  I have been to many tea houses all over the US and have never been more disappointed.  The decor is cheap and little kid pleasing.  The final straw was food let on the tables from previous customers for over an hour, lazy staff!  Don't waste your money!"}
{"text":"It really makes me sad that I even write a review like this for a place that started out so nice. A few years ago I took my adult niece to this tea house and I would be shocked if the same Kimberly Ann is still the owner.  To start with my daughter took me for my birthday and we were seated in the children's room because my 4 year old granddaughter was with us. She has taken tea with us several times at places like the Taj in Boston and The Drake in Chicago but I get it although I'm 58 year old woman and I don't think I need to have tea on plastic princess placemats. We were not there to play with toys or pretend tea. We could have asked to move but it was fine....whatever.  The service was slow and when I needed anything I had to leave the room and find the overworked server. I felt bad because she was clearly there with little help. Poor management. We had to ask for cream for the tea and she brought Half&Half. No Devonshire cream that they claim to have on the menu. Pumpkin scones were tasty but why the lemon curd? Weird     I asked what the soup was and she told me chicken.....chicken? Like rice or veggie or noodle???  When pressed further she said chicken tortilla. With tea?? Glad I clarified. My daughter had a Groupon which I believe she paid $25. We ordered a salad and extra pot of tea ( why a tea for two does not mean a pot each I don't know) we were charged an extra $13 dollars for tax and gratuity on the Groupon plus $15 for a small pot of tea ( kid size) and a salad.  Then I was told I would have to pay an extra $1 to use a credit card like its 1987. So $30 add on to a $25 Groupon and I'd say we were taken for a ride. I try to support the local business community but Kimberly should not be in business to offer high tea.  Maybe lunch"}
{"text":"We went to Kimberly Ann's a few weeks ago on a Groupon coupon and were treated  very nice.  We don;t even drink tea but my daughter and I at high tea at 2:00 ordered the apricot Black Tea and LOVED IT.  The three tier assortment was delicious. In fact, we are going back with friends tomorrow.....LOVED IT"}
{"text":"Dear friends invited me to tea...I tried to talk them out of Kimberly Ann's because of the negative reviews, but they wouldn't listen.   Sadly, I'm here to report that not much has changed at Kimberly Ann's and the low rating is still well deserved.     Sandwich fillings were tasty, but the dried out bread ruined the experience (honestly, it was as if they made all the sandwiches before they opened and just left them sit on the counter, ewww).  The treats were beautiful, but tiny, and for my personal taste way too sweet (though I'll acknowledge that I prefer to taste the cake not sugar, but I believe I'm in the minority).    Staff was indifferent, owner was there and snippy to employees and condescending to guests.    Biggest change...and rather ironic.....apparently they're looking to sell the place!    So...IF someone is foolish enough to buy somewhere with such a poor reputation, at least there is a chance that vast improvements would come.   As for me.....until I see a lot of positive reviews for a new owner....I'll not be coming back even if friends insist they want to go there.  I'll bow out rather than endure it again."}
{"text":"Great food, everything was wonderful and good service as well. Came for tea, loved it, will definitely be back!"}
{"text":"My daughter and I had reservations and were seated promptly (middle of the afternoon).  This place was delightful.  The tea was delicious and so was their food spread!  Kiddo especially liked the brownie and I liked the scone.  I've never had a warm scone before but by god was it delectable.  Nicely decorated with a very quaint feel, perfect for tea time.  A couple of reasons for 4 instead of 5 stars:  1.  We came for their Mother's Day special.  Didn't really know what to expect (my fault for forgetting to ask when they called me to confirm the reservation) but we were seated, picked the tea we wanted and then they started serving us a salad.  I was totally lost as to what to expect.  A sheet with a list of what will be served would have been nice.    2. Options would have been nice.  $30 per person and one of us being a child who is a picky eater and only ate the sweets was a little steep.  I loved the sandwiches but we had a late brunch so neither of us were very hungry.  We would've been happy on having just the fruits and desserts.  (I know I know, the tiny sandwiches is part of the experience!)  They included a 20% tip which was fine but our total came out to $72 for one adult and 1 child.  Ouch.  All in all though, we had a lovely time.  Most importantly food was good.  We took the sandwiches home and my husband wants to go back just the two of us next time so he can have more of their sandwiches!    I don't know if I'd do it again at the $72 price point but we did enjoy our experience.  Friendly staff and yummy food and tea."}
{"text":"Despite most of the reviews, this place was absolutely lovely. My boyfriend and I weren't really sure what to expect but the Groupon sounded like a fun idea so we took the risk. The food was delicious, the decor was a little much but just adorable anyways, and the loose leaf tea was amazing. We chose the Vanilla Black with half and half, and a cube of sugar. I'm not sure how long the food took because I was so busy looking at all the decorations and admiring our tea set. Our server was knowledgeable, really nice, and was at our table before we even knew we needed assistance. No fuss about getting us more milk or adding more water to our tea pot. I liked everything about this place and the required tip ($12.36 cash) was well deserved. I will definitely be going back for more."}
{"text":"I had a groupon. The owner said I MUST pay a 20% tip or I couldn't make a reservation. I reported this business to the BBB. The owner wrote the BBB a letter in which she completely lied, saying I harassed her and her granddaughter by repeatedly calling back, etc.   According to the BBB the owner did not adequately dispute the problem and the matter will show on the BBB for this business as unresolved.   The owner is a nut case. There are far too many horror stories to waste your money here. If everyone who is treated badly by this woman would file a BBB complaint, which is easy to do, maybe others would be spared the ill treatment and the lies.   Dear  :  The follow-up comments you submitted to BBB were sent to Kimberly Ann's Tea Room for a reply; BBB has not received further communication from the company.  Having reviewed this matter carefully, BBB has determined that the company has not adequately addressed the issues you presented or made a reasonable effort to resolve the dispute. BBB has closed its file on this case which will now reflect in the company's reliability report as unresolved.  We appreciate you taking the time to contact BBB to include us in your efforts to resolve this dispute. If you wish to pursue this matter further, you may consider seeking legal advice.  Sincerely,  Your Better Business Bureau"}
{"text":"Came here for lunch with the the girlfriends couple days ago. It is rather hidden since it is literally a house in the middle of neighborhood so it was slightly hard to find. It is very cutely decorated as the reviews suggest. I was a little upset that they did not allow us to use the living social deal with out calling a deal in advance. It did not even say we needed 24 hours in advance reservation when I bought the certificate (-1 star). But the food is good. Great sandwiches and teas - good priced items. And the food was served rather slow. I understand since everything was made to order. The  dessert on the other hand was the best - blueberry bread pudding. Now, that is a must. We devoured that and definitely liked it better than the raisin bread pudding."}
{"text":"Tea party time with my niece and sister! We get dressed up and go for lunch usually. The ice tea and put of teas are delicious!"}
{"text":"Loved this place! My friend and I went here today for tea at 2, and had a great time. We had the elegant tea and used a groupon; we are the only people there but that isn't too surprising for any place in the middle of the week. Service was great, food was delicious, loved the tea, and we had a wonderful time!"}
{"text":"People are RUDE on the phone and in person!!!!!  This was by far the WORST place to go!!! A few of my girl friends and I made reservations at this place and had a request to sit together in one of the rooms and they put us in 3 different rooms. The lady there was a complete 'W'itch!!!! She just DID NOT want to accommodate us! There were other customers who also felt that she was being rude and not accommodating especially when there were several empty tables in the room. A few customers even offered to move to a different room to help all of us girls sit together in one room and the lady/owner/brother of the place just did not want to help us out. Before sitting us down she told us in a very rude tone that this is the last time we are all allowed on her premises...who says that even before sitting is assigned? We were extremely offended and upset so we walked out of this joint.  Do yourself a favor and SKIP this place!"}
{"text":"What a wonderful place! Darling lavender house with tea rooms all decorated a little differently. Also, a great place to bring well behaved children. They set up a little kitchenette for my little girls and they got their own princess tower and tea. As we were leaving, the owner handed me a goodie bag for each girl which was completely unexpected and very generous.   The tower for three adults was more than enough food and everything was delicious! Starting with the cranberry scones, they had a warmth and sense of Fall about them. The Devonshire sweet cream and lemon curd was a perfect accompaniment. On the second tier, we had an assortment of perfectly ripe fruit and dessert. On the last tier was scrumptious finger sandwiches which included: egg salad, cucumber, tuna salad, roast beef and chicken salad. Of course, there were a few more mini sweet treats as well.  The reason for 4/5 stars is because the wait was a little long for food, to-go boxes and the check, but 100% worth it. This has just become our new tea house!"}
{"text":"We visited on a weekday using a Groupon for 2 for the regular high tea menu. We were informed over the phone when making a reservation there would be a $12.63 charge that would count towards tax and gratuity, I read on other reviews people were unhappy with this and I agree because including the gratuity before hand is poor customer service because I don't believe it was worth the amount of tip. The house is cute it's set up with pretty Decour we sat in the front room there were four other people in our dining room and a couple in the back in the princess room.The waitress created us promptly and sat us down, gave us the tea menu.Teas was weak, was not as strong as we liked and we sat for a good 25 minutes before she returned and I asked her if she had strainers she had forgot to place those when providing the tea or setting the table. Waited another 30 minutes at least before our food arrived it was presented well very cute on three tiers. the desserts tasted like they were not homemade, I'm not a fan of egg salad but it is on the menu, tuna was dark definitely not albacore or white and the cucumber sandwich was very tasty I ate all of those. The scones are definitely not your traditional scone it was more like a lump giant cookie they were pumpkin raisin this day not a fan. The scones are served usually with Devonshire cream and lemon curd and according to the menu that's what you're supposed to get. this day they were served with an apple butter and a lemon curd. My 11-year-old daughter who has accompanied me to high tea's all over the valley and loves Devonshire cream was disappointed. I did hear the waitress offer it to the table next to us who is just having a regular lunch off their lunch menu but when I asked her about it she politely told me they don't have any and then when I mentioned it was for the child because she loves that she said \"I'll see if I can find any \" and then a small container appeared on our table. I thought for the cost and the service we received it was not worth the trip to Glendale. We have been to high tea at the Phoenician the English tea room in Cavecreek and the spicery in Glendale and this was definitely our least favorite!!!"}
{"text":"I went with my mom because she had a Groupon, no where on the Groupon did it say can't be used on Saturdays. However, when we showed it to the waitress she said the only way we could use is if we bought lunch as well. So, we bought lunch.... tea was not that great, hardly any flavor... food was ok, salad could have been fresher, but the wait was the worst!!! We were seated right away because we had a reservation but it took forever to get cream for the tea and literally like 20 minutes waiting for the check so we could leave. The waitress hardly came to check on us and every time we asked the waitress for something, she acted like we were bothering her. Because of the looonggg time we had to wait for everything and the bad service we'll never go back.... drive a little further and go to the English Tea Room in Carefree, way better experience!"}
{"text":"I LOVE THIS PLACE! Convinced my husband to come with me (FINALLY) and despite the girlishness of the decoration (admittedly it's extremely girly), he had to admit he had a wonderful time :-) They were super busy when we came so the service was a wee bit slow but the food as usual was tasty yummy and the tea was divine! I went back again the next weekend w/ my mom and again it was like heaven in a teacup! I've found that the best time to come is right when they open at 11am as the big crowd seems to come around 1pm. The place is family owned and operated which I LOVE. I drive almost an hour one way to go to this place because it's that much fun! A must for all mothers and daughters (and the occasional reluctant husbands :p  )"}
{"text":"Went to Kimberly Ann's this past Tuesday with a friend.  Whenever I visit her side of town we go to the delightful cafe for a relaxing lunch or tea.  May the owner and chief cook is assisted by her family to provide an enjoyable meal and relaxing atmosphere away from the hustle and bustle of your typical restaurant.  This is not a fast food grab and go place.  Food made to order and served competently..  Fun tea and related accessories are for sale and May makes the most wonderful hand-made cards to purchase for birthdays etc.  Go, relax and enjoy."}
{"text":"I used a Living Social coupon for 2 people for high tea at Kimberly Ann's. Sounds like it should be a fun and enjoyable experience, right? Well, it turned out to be a lot of \"work\". We wanted to go to high tea in December, but they were completely booked. Ok - we were disappointed but we scheduled it for early January. Well, a week or so before the date we were to have high tea, they called and said they would be closed due to plumbing problems. Another disappointment but we rescheduled for later in the month. What made this difficult were all the \"rules\":  1. You need to call at least 24 hours in advance to make the reservation. 2. They require a Visa or Mastercard number to hold the reservation. No-show's who do not give 24 hours notice will be charged $25.00 plus tax. (Is this a doctor's office???) 3. You must mention any coupon over the phone or you will be charged the full price on the day of your reservation. 4. The coupon price does not include tax and gratuity. They suggest a gratuity of 18% - 25% of the original price of $25.00 per person. 5. CASH ONLY for the $10.00 \"required\" gratuity for the coupon plus tax of $2.63 per 2 people. If you do not bring cash, you will both be charged the full price of the high teas.  WOW! That's all I can say. While the food was terrific and the service was good, they also had an additional \"rule\" stating only one type of tea per table. What if one person wants decaf and the other wants caffeinated tea? Too bad!   As previously mentioned, there is a \"funny\" sign on one of the bathroom doors saying: \"If you have to go #2, please do not use this restroom.\" They then direct you to another restroom away from diners. Weird but true! I wish I had taken a picture of the sign.  I'm a huge fan of high tea, but I won't go back to Kimberly Ann's. I would recommend the English Rose Tea Room in Carefree for an exceptional high tea experience. Check out their website: www.carefreetea.com Also, the Biltmore and the Phoenician Resorts have fantastic high tea as well, for a higher price than the English Rose."}
{"text":"I have very mixed feelings about this place.   I very much enjoyed my tea time with my grandmother.  She enjoyed it immensely.  It was pretty, quiet, and our server (a guy who I thought was the handyman or something) was super nice.  The food was good, the tea was delicious.    As a livingsocial deal, it is ROTTEN.  Getting a reservation was impossible.  I was told I could only make one for Monday thru Friday at 11 or at 2.  And to include gratuity was offensive because on their menu gratuity and tax are included in the $25 per person cost of tea.    And now I gave my extra voucher to a friend to use, because my original reservation in December got canceled due to a flood in their kitchen and I didn't have time to use two vouchers.  My friend was told that the voucher had already been redeemed, which was impossible (the voucher I used didn't even use the name on her voucher).  I don't really understand how this happened.  Or why it wouldn't have been brought to her attention when she made the reservation.  Then, my friend decided to just order off the menu and still hadn't been served after 40 minutes of waiting with her 3 year old daughter.    Overall I wish that they would just stop running the livingsocial deal because it seems like it is only making people mad.  Its a cute place and was a good time but not worth the headache.  I also don't think that it would be worth it at full price."}
{"text":"This was an adorable place! I was hesitant at first since we, too, had to wait a minute to be seated (but where don't you?). The service was pleasant and quite attentive. They checked back several times to make sure we had enough tea- which was fab! The food was delicious and more than enough (we had the tea for two groupon). I loved the little sandwiches- they weren't foodie, they were good classics- egg salad, cucumber, tuna salad. What a perfect afternoon tea time. I recommend for something fun and different to do!"}
{"text":"Tea was a little disappointing. The sandwich selection was good, but the bread dried. Sugar sprinkled on the fruit was gilding the lily. I've been to many teas and never been told only one pot of tea for everyone at the table. To top it off, the woman who took the reservation on the phone was quite rude."}
{"text":"I found a coupon for Kimberly Ann's which was good because I never knew it was there.  The place was charming with good service.  We had the full service which started with the chicken salad stuffed tomato over field greens.  This was a wonderful start.  It was attractively served and the chicken salad was delicious.  When our service came out, the scones were piping hot from the oven.   Although the food was very good and fresh tasting, we both would like to have seen less \"salady\" fillings.  Instead of egg salad, how about some nice roasted veggies?  Roast beef with horseradish sauce?  It would be a nice change of pace instead of having all mayo based fillings. There was only one server for the entire place.  She was a sweetheart, though."}
{"text":"3 stars may be to much maybe a 2.5.  The tea and sandwiches were enjoyable.  However we were using Groupons and they only allow one Groupon per table.  Upon making reservations we requested to at least sit at adjacent tables.  They said they would try to accommodate.  When we arrived my girlfriend and I were seated in the front room.  We asked where our other 2 parties were seated and they were in 2 different rooms.  We asked if we could be moved to sit together as requested.  They explained they were completely booked and couldn't move us.  We had also informed them when the reservation was made that 2 of the party were vegetarian and they said they would note it.   They hadn't noted our vegetarian request and when we ordered we had to remind them of the change.  Then as all the guests were seated we find that they could have easily accommodated all 3 of our parties in one room that had 2 empty tables in the room where one of our parties was seated.  It was a fun girls tea party but could have been more fun if we had been able to at least sit in the same room.  And had the requests made at reservation been addressed."}
{"text":"Had the garden tea for two.  Not very impressed at all, the food was stale.   The soup came out and it was very nasty.  I had no expectation when I got here but I'm telling you this place is one to avoid no matter what.   There customer service is worse than there food...  ******* avoid at all cost ******"}
{"text":"I had the misfortune of holding a group function there today.  I had been in touch with the owner for two days before the event to give her the numbers, which ended up bring 16.  I walked in an hour early to set up.  The set up wasn't quite what I asked for so I asked her to adjust it (take three off of one table and put that at an empty four top.   She seemed very put out but did it.  Her two young granddaughters were the only staff there and the place was empty when I arrived.  My function was called for 1:00 but several guests arrive late and 3 did not show up.  Still we had 13 for lunch.  I saw that there were two other rooms in the back, each having 4 tables of 4.  When I arrived she told me we had to leave by 3:00 (those were her exact words)!  That was never mentioned before.  At about 2:00 another party of 4 arrived and were seated in the back room.  I figured since there were coming in so late they couldn't possibly be closing by 3.  Everything was fine, except for the unbelievably slow service.  At the end, everyone paid their bill and left, except for 2 that stayed behind to talk.  I kept asking for my bill and finally got it - The item I ordered was $8.95.  There was also a $50 charge for room rental.  I told the owner that there was never mention of a room charge and had I known there was, I wouldn't have booked my event there.  She said that since she had to hold a whole room for me and was limited to the reservations she could take, I was being charge.  She began to argue with me and I finally stopped and said - \"so you don't mind losing the business of 14 new customers?\"  And she replied \"No, I don't!\".  I tried to reason with her but she kept arguing and was very nasty.  She even insulted my two remaining guests by telling them how messy they were.  I was going to charge the amount and then dispute it with my credit card but I was afraid to give her my credit card.  I ended up leaving $20 on the table and left ($10 more than I owed).  A few minutes later she had left a message on my voice mail telling me I could either come back and pay her or she was going to call the police.    I have never encountered such a nasty women in my life.  I'm glad she feels she doesn't need the business because it looks like she's not getting it anyway.  I had 3 less people than I told her, but she had 7 empty tables in the back so I guess she was trying to make up for her own lost income since no one made reservations."}
{"text":"I went here for their Mother's Day Brunch last year May 2009 and it was great. There scones were the best I've ever had. With them, they brought lemon curd, an apple spread, and devonshire cream. The lemon curd was to die for. They were white chocolate and fabulous. They brought us out a 3 tiered platter that had little sandwiches, scones, and desserts on it. We also had a salad appetizer that had strawberries in it, I was skeptical, as I do not eat fruit in regular salad. It was very good. The tea was delicious peach, not from a tea bag. The china we ate off of and drank from was beautiful and delicate. The place is a tea room after all, so it has cottage, country style decor with lots of trinkets, most of which are for sale. I loved it. We had great, personal service and a memorable experience."}
{"text":"The tea selection was diverse and the food selection was incredibly delicious!!!The staff was very accomodating and the atmosphere was very pleasant. I will be going back very soon!"}
{"text":"Good place to get together with ladies. We booked for a garden tea and promptly showed up at 2pm. Decor inside is so cute, we were glad we dressed up for afternoon tea. Each with a hat or hair accessories. Dress up is not required here but about a half of customers were dressed up on the day I visited.  For three people, we had a choice of two different teas with unlimited refills. My favorite earl grey was pretty good, I enjoyed it as a milk tea. Peach mango green had good sweet smell to it, I liked both. They fill up water to the top and was a bit difficult trying to pour tea without spilling it.  Garden tea comes with a choice of salad or soup followed by 3 tiered tray. Come hungry as portion size was very big. I really liked salad dressing, strawberries were sweet too. The best part was their scones. Nice and warm, went well with lemon sauce. Strawberry dipped in white chocolate was good too. I liked cucumber sandwich. Mustered they used added a nice spice to the sandwich. Only disappointment was sandwich bread. A bit too dry, I felt like it was left out too long.  Service was good, she kept up with tea and water refills. Overall, we were there for almost two hours, enjoyed our conversation and had a lovely afternoon."}
{"text":"This place is amazing. We had a private bridal shower party on a Sunday booked for 30 people. They allowed us to come early to set up, we used their yard for bridal shower activities and the tea was perfect. So many choices on the tea menu. The food came out in three tiered trays and it was amazing. Everyone had a different favorite sandwich. The scones with cream and lemon curd were by far the favorite!!! Desserts were amazing too. The presentation was perfect, the decor was perfect. It made for a unique and memorable bridal shower! The staff was very accommodating for our group and we had a really great time."}
{"text":"My wife and I came here for our anniversary this past weekend and it was fantastic. The tea selection was quite large, and very good. The lunch was delicious and the scones were amazing. The scone dipping sauces really made it perfect. Reasonably priced. Good service. Very nice and quaint place. It was great!"}
{"text":"We purchased a Groupon for a Christmas tea and had. Very nice experience. The child was on her best behavior so that helped a lot. It was a bit slower paced than I would have liked but there was one server and it's a tea not a drive they McDonald's. Keep in mind that they make everything daily so they take reservations and make food for who is coming so if you cancel last minute, they're still gonna hold you responsible."}
{"text":"If you are thinking about purchasing a Groupon or Living Social deal for this place, skip it like I wish I had. I bought a Groupon for Kimberley Ann's Tea Room. I brought my mom to an afternoon Saturday tea that we were both looking forward to. I'm embarrassed I took her to this place and felt compelled to write this review so you don't make the same mistake I did. I read reviews that were good. I don't know who the people are who wrote these reviews because this place should be skipped. I assume they are the same people who go for a fancy dinner at Applebees and would rate that favorably as well.   Dcor- The location of this place is a house located in historic downtown Glendale. The best way I can describe this place is to compare it to a funeral come that was updated in the 1980's. The floor is bad wood laminate. The wall paper is equally tacky. White picket fences outline the walls. Antique hutches painted distressed white hold vases of dead roses. Faded pink roses and other fake flowers that look like they came out of a Goodwill donation basket line corners of the popcorn ceiling. Windows were few and far between so it was dark inside. I felt like we were visiting the twilight zone.   Food- Tortilla soup was served first. It was not fresh and tasted like a Campbell's can of soup. We were served a platter with 3 kinds of finger sandwiches: egg salad, tuna salad, and cucumber. The egg salad and tuna salad each had so much mayo and relish they would make a thud sound if you dropped them. The cucumber sandwich had slices of cucumber paired with a herbed butter. It was gross. The sandwiches looked so unappealing my mom wouldn't eat any. Seasonal fruit was served which included some orange slices, some honey dew slices, a chocolate covered strawberry and two watermelon slices. The desserts were all grocery store bought mini cupcakes. All bad. I was surprised at how bad.   Tea- We were allowed 1 choice from a tea menu. Nothing special about the flavors, menu or service. We were served loose tea in a white tea pot. This was intended to be a tea experience- what a let down.   Cost- I paid $25 for my groupon and $12.63 for tip. We could have gone somewhere FAR nicer in terms of the quality of food, decor, location and service. Simply not worth it.   Service-  This appears to be a family owned business owned by \"grandma\". I had spoken to a lady on the phone who I assume was Grandma when trying to book a reservation. She was not very nice or professional on the phone. We were seated next to the kitchen which was loud. I kept hearing the servers call someone Grandma. The owner I had spoke to I presume. Our service was superficially nice. Our server spoke in a mono tone voice and kept saying \"ok dear. yes dear\" for everything over and over. Another thing I did not like was that it took us MONTHS to get a weekend reservation. My mom and I each work during the M-F week like most people I know. It took an extremely long time to get a weekend reservation.   The Verdict- we will never return. This was one of those Groupon mistakes that you make and wish to forget. Except maybe on Halloween because this place gave me the creeps"}
{"text":"Back in December I bought a living social deal for Kimberly Ann's Tea Room for a garden tea for 2, I asked my friend if she wanted to join me in this adventure and she said yes! I had until April to use it so when I got it I wasn't worried about making the reservations, just wanted to get the holidays by us 1st.  So Feb came and I called to see when we can get in, we were given Sat the 23rd in March, we took it!  So it's Sat morning and we are very excited to go have some tea and check this place out! We got their a little before 11 and were waiting outside with others, then they opened the door, asked for our reservation and asked if we had a copy of our living social voucher, I did but it was on my phone, which the voucher states that to bring either a paper copy or digital copy on smart phone as way to redeem it,  and our hostess said oh, I don't know if that's going to work, but then sat us down at our at table, and then she walked into the kitchen area, which was right behind us so we could hear everything said & she told a lady who she called her grandmom that we only had a copy of the voucher on the phone and the lady was said why they bring that, they know they are supposed to bring the voucher with them,  so at this point I am thinking that yea even though I bought the voucher, they have the voucher info of me buying it, that I am not going to be able to use it and will be told to go home... but no that wasn't the case, on my phone I went to livingsocial.com and pulled up the voucher and marked it used from there.  Really didn't think it was that big a deal to bring a copy of it on my smartphone, and if that's not a way they want it redeemed they need to state that.   Anyways we arrived our 11am reservation and I thought since it was made weeks in advance it would be something that would go smoothly. After being seated at our table we were asked what type of tea we would like, and we picked a black vanilla, and it was brought to us and our hostess, who was a sweet girl explained that it needs to set for 5 mins or longer, and we just continued  talked , the tea was great, I loved it, I think we drank 4 pots of it,  30 mins went by and it's not that I wasn't enjoying my girl time with my friend, I just thought food was involved in this too,  42 mins after being seated our soup showed up, it was a tomato based type of soup, it was good but little too sweet for me, I would have preferred a more savory soup.   Another 15 mins went by and our Garden Tray of sandwiches and goodies showed up, the delay in our food arriving was because they had to cater to a lil girls party in the other room 1st, that was what our server told us.    The tray of sandwiches and goodies looked very pretty, the cucumber sandwiches I have to say were my favorite, reminded me of when my grandma and I would have tea parties, the tuna, chicken, and egg salad sandwiches were just as delish too, quite surprised, I normally am not a tune or egg salad kind of person, but the sandwiches are mini sandwiches that you can tell someone took time making & cutting perfectly for you, the  fruit on the plate, from the grapes to the watermelon were very mouthwatering good, the chocolate covered strawberry was yummy too, and the cranberry scones with Devonshire cream was the perfect way to end this great tea time goodies!   I could tell time and care was taken when creating our Garden Tea Party package for us, I just now know if I come back on a living social deal that I need to print it out 1st. Kimberly Ann's Tea house is cute a lil tea house and it was a fun time with my friend."}
{"text":"Yum! Great food and service. Came 10+ years ago and has only gotten better! Menu is a great size for a tea room. Scones were warm and tasty. Great tea selection. They had homemade sodas which were DELICIOUS. I got an iced Milky Way and it was absolutely fabulous. Loved it. Tea was great, and what wasn't finished, was brought home."}
{"text":"The service was excellent from the young man who brought our tea, salads, and lunch items.  No complaints there.  The tea was great, the salads, too.  However, the cucumber sandwiches were bitter, and so was the tunafish.  When we told the woman server of this, we were told \"Well, sometimes you get a bitter cucumber.\"  When we asked her to substitute those with the ones we DID like (cranberry chicken salad or egg salad) we were told, \"No, the chef already made all she's going to make for the day, and we won't make you more.\"  I about fell off my chair, so did my mom. For a 70th birthday present, I couldn't believe we had to endure 'no substitutions' for SOUR food.! What a joke. We will NOT be returning, and will take our business to better establishments for high tea, like the Ritz.  We also did not care for the fact that gratuity and tax were automatically added and would NOT have tipped that much on a $70 bill for such POOR customer service. I'm surprised this place still sticks around, what a disgrace."}
{"text":"We had a pot of apricot tea that was awesome. I had the house salad and my granddaughter had the famous stuffed tomato. The waitress told me they don't have macaroni salad any more but the menus haven't been changed in a while. The salads were crisp and fresh and quite large, but my granddaughter didn't like the chicken salad because it was sweet. Scones were basically biscuits with stuff in them. $36 for tea and salad seems a bit much. Service was excellent and the atmosphere is awesome. Like eating in a Victorian home. The only vegan thing is the house salad if you tell them to leave off the cheese."}
{"text":"I was so super excited to take my little one and some friends on a girls date.  We booked 3 princess teas and 3 lunches.    I was a little shocked that they required my credit card to hold the reservation, but I figured they were a small business so I complied.  I really really wanted to enjoy this experience.  When we arrived there was a line as several others had reservations for high tea.  The wait wasn't too bad just the staff trying to get people settled as they had just opened.  We sat for about a good 30 minutes before they finally came over to take our order.  The 1 waitress seemed incredibly rushed and stressed out.   Thank God they had a little playhouse for our children to keep busy.  When the food for the princess teas finally came out I was incredibly underwhelmed.  The website had described so much more.   The grown up food was kind of decent, I had the egg salad and the scones were not horrible. The potato salad was horrible I think they tried too hard to add something that just didn't belong.  The girls enjoyed 2 types of the finger sandwiches, and the fruit.  The cupcakes came in weird paper and they were very very soggy (not typical for a cupcake).  The kids really struggled to eat them which made for a disappointing finale for them.  My daughter bit into the chocolate strawberry and gave a weird face so I tried it.  The chocolate didn't taste very good so I understood her reaction.    Overall the presentation was great, the food was very underwhelming, and the experience was insanely over priced!   Totally forgot when we went to pay, the cashiers got our checks wrong 3 times then came back demanding cash as their debit machine was on dial up and it would take to long to run 3 cards.  Overall I won't be back, very disappointing experience."}
{"text":"This visit was one for the books, and definitely not a quali-tea experience.   Initially the luncheon started well (we did not prebook a fancy tea party, just came for lunch) and we were seated quickly. There was an issue immediately with one of the staff who had some sort of allergic reaction or something similar, but the staff all remained calm, and was attentive to the customers. They handled the situation quietly and professionally. Once our food came I had mixed emotions, the food itself lacked presentation... and came across very bland looking. It was surprisingly tastier than it looked which made me happy. I would recommend the cheddar scone and 15 bean soup.  The latter half of the meal is when it all fell apart, and the service became increasingly slow (although no additional customers). We were seated next door to the kitchen, and it became very awkward as two of the employees began to argue about a situation with another customer and cash register issues. They were heated, loud, and we couldn't really escape the situation.. c'mon guys can't we just get oolong?  Once we finally were able to ask for our bill (split in two), it took about another 30 minutes just for both of us to pay. I had higher hopes for this place, as the little girl in me was dying to come back for an authentic tea party but the whole stay turned me sour. I will not be coming back to this cafe.  Most definitely NOT my cup of tea."}
{"text":"I called ahead and made reservations.  I asked for the princess room since I would be bringing my two granddaughters under two.  I also specified a nut allergy and said that I needed no nuts!  Arrived 4 minutes before 11.  The doors were locked and they made us stand outside in the cold with the two babies til they were ready for us.  They brought us into the Princess room and then said we could not stay there because there was a party of 12 coming.  It turned out the party of 12 was not coming until 2pm.  3 hrs after we were there.  But they would not budge.  They sat us at a table at the front door so every time it opened the baby got cold.  They told me that they did not have anything down about my request for no nuts.  And also informed me the only thing with nuts was the scones.  However, not only did the scones have nuts but the chicken salad sandwiches and the baklava.  There was not attempt to make any substitutions.  They did not seem to care at all about our comfort of safety. with regards to food allergies.   If you are coming here and have no special request you  should be fine.  But do not even bother to attempt this place if you need anything special.  They make no attempt to help their customers.  Will not be returning, nor recommending to anyone.  I am not sure how they stay in business, besides the groupons they sell.   I would recommend going to The Spicery right next door.  Nicer people, service and food."}
{"text":"My husband and I enjoyed our \"high tea\" vary much. The food was great and the tea was tasty!"}
{"text":"I was so excited to take my mom here for her birthday last year. I bought a groupon months in advance. Problems first started when I tried to make a reservation. The lady did not seem to know exactly what a good time to come and was not very professional. We finally found a time in the early afternoon.  When I got there it was very busy and it took a while to get acknowledged. There were a few open tables that still had food sitting on them. We were told to wait outside and someone would show us to our table.  We waited and waited outside. I was pregnant at the time and started to feel sick from being hungry and waiting outside. I went in to check. I had to wait about 5 minutes before anyone even came by. The tables were still dirty and the same people were waiting for food. We were told to wait outside some more. We waited for about 50 mins past our reservation before we were even seated.  Then we continued to wait some more. By this time I was feeling really sick and needed something in my stomach. Our waitress finally came. She was a young girl and it was her second day. She told us how 3 waitresses did not come but the owner kept sitting walkins so that is why we waited so long. She took our order for tea and what menu we were getting. We sat for another 30 mins without any service, not even tea. Our groupon came with soup so I flagged the waitress asking for our soup while we were waiting for our sandwiches and tea so I wouldn't throw up. She said she would get it right away. It never came. Finally the sandwiches and tea arrived and I didn't throw up, so it was a miracle.  This place would have gotten 1 star but the sandwiches and food was really good. The service and management is just terrible. The owner has no business sense  You would be better off to go to your niece or daughters tea room and have a pretend tea than go here."}
{"text":"Buyer beware! The tea house will begrudgingly accept your groupon - that is your 1st tip kids .. Now comes your 2nd ; You will be charged an ungodly amount for gratuity!  Total bill $50 - total added to the $50 bill for gratuity and sales tax $27 WTH???? Is this even legal ?"}
{"text":"Trying to find something new for a girls luncheon and came across Kimberly Ann's. I read some Yelp reviews and was a little cautious because of some of the negative feedback but decided this would be a fun idea. Omg it was the best idea ever!   We were set up in the garden room. It was so cute. The meal was delicious. I had quiche, a salad and a warm cheese scone. I also had strawberry peach tea. For dessert I had the blueberry bread pudding with vanilla ice cream. Again it was warm and tasty. I loved everything.   The service was excellent. We had 13 people in our party and we were very well taken care of. There was no problems with separating the checks and no issues with tipping like others complained of. They even took pictures for us. I highly recommend coming here for a fun dress up luncheon or even a small tea and scone date."}
{"text":"Had high tea with my mother-in-law; it was fantastic! Everything was delicious, they have a great variety of teas and the service was excellent. The decor is exactly what you would expect of a tea house: eclectic. Very fun, I'd definitely come back."}
{"text":"My good friend treate dme to Tea at Kimberly Ann's. We had a great time. I believe you have to have a reservation- is that such a problem??? No.  Help a small biz out. I'm not positive but it seems like a family run place. The tea is good, the place is cute! The small sandwiches and finger foods were delish, as was the soup. I want to take my mom here next:)"}
{"text":"My five year old and I really enjoy this tea room. The scones, lemon sauce, and Devonshire cream are heavenly! Hot out of the oven?! Yes, please. My daughter loves the chocolate covered strawberries. The sandwiches, especially the cucumber are really good, too. We've been here a couple times and the food was fresh and delicious both times. The selection of tea is nice, too.  The second time we were in the Princess Room, which has dress up clothes and a play kitchen. Awesome for me because I could enjoy my tea while my little one enjoyed playtime. Both times we've come here we have been in a room by ourselves. It feels very comfortable and secluded. Great quiet time for mom's.  The decor is cute and some of it is for sale at very reasonable prices, too! They also sell the loose leaf tea. I recommend Apple cinnnamon. I can't wait to come back for fall offerings! I'm hoping for pumpkin scones!"}
{"text":"They are Nazis when it comes to using the groupon,  I went with some friend and they had groupons, they was very excited and they wouldn't honor it because we were too early, we asked if we could wait and they said they were booked, place was empty.    Finally I asked one of the woman who used a groupon there the next day, and she said they FORCED a gratuity on to her bill.    Forced tipping gets a major thumbs down from me, the audacity to even do that is very disrespectful to customers.    You wouldn't sit in olive garden and when they bring the bill say to the waiter \"mmmm no thanks I think I'll pay only $10 for $16 pasta\"  unbelievable"}
{"text":"I enjoyed my High tea from groupon very much. I took a friend out to celebrate our birthdays together. The food, tea, and service was great. Loved the scones (served fresh and warm), brownie bites, and chocolate dipped strawberries.  We had the place to ourselves, the lady came by often enough our teapot never ran out (which is unusual as I am a heavy tea drinker), but not so often as to be hovering the way some do or make us feel rushed.   Yes, you do have to make reservations, the place is booked up on the weekends and getting a spot is difficult for the high teas as your table is dedicated to you for 2 hours. Saturdays are booked, everyone with Groupons waited till the last minute to redeem and everyone wanted it on the weekend. Take a long lunch during a weekday and it shouldn't be a problem.  Yes, they do add gratuity onto the bill for the high teas, but that should be expected since the service is for two costs $50 if you paid full price. Shouldn't be an issue unless someone is being cheap (20% of 50 is 10, unless the service or food ir poor and considering that your not being rushed and are waited on for a solid 2 hours it shouldn't be an issue for most people), and as many people are using the groupon this makes sure people tip based on the actual cost.   The cost is an additional $13 which includes tax and tip. When I made a reservation they made sure it was clear and mentioned cash.  HOWEVER, if you forget (as I did) to bring cash, they do not charge you for the entire thing. They do charge $3 fee it costs them to run it as credit.  FYI, Most small mom and pop places get charged by their banks and the credit card company they accept. All they are doing is asking you to pay the charge. Though if you pay full price for the service they eat the $3 charge. It's these fees many places don't accept American Express is because American Express charges the retailer more than Visa and Mastercard does."}
{"text":"My mom and I went here today for the elegant high tea, using a Deal Chicken deal. The deal clearly stated that we had to make a reservation, so we did (though when we first called, we found out they were closed for two weeks and had to call again later), and the woman I spoke with was very friendly and informed me about the tax and gratuity and asked us to bring cash. (There's a note on the door saying you can pay with a card, but there's a $3 fee to do so.) The service was great! Our waitresses were incredibly informative, attentive, and friendly. The food was delicious, though it would have been nice to have more than one tea to choose from (I've done afternoon tea for two before and we were allowed two teas with refills; here they only allowed one tea with refills). It wasn't an issue for us, but I could see it being problematic for others. The decor is exactly what you'd imagine for a tea house -- very pink, flowery, girly. I would definitely go back with or without a deal. And as a bonus, it's located in Catlin Court in Glendale. It was our first time there, and it's very cute, so I'd love to go back. The local businesses support each other, so some of them offer discounts if you patronize more than one. I'd definitely recommend this for anyone interested in having high tea!"}
{"text":"Called to inquire about High Tea service as a gift for my wife and her sister as sort of a Sister's Date since she was coming from overseas. The people on the phone were so RUDE that I know now why they have such a poor rating. If you don't like customers and they are such a bother to you, why are you in business?"}
{"text":"I bought their Groupon for 2 to enjoy afternoon tea and it was very sweet. I brought my mom there and she loved it. The scones were delicious, the sandwiches were yummy, and the service was great! I definitely would recommend checking this place out. It's an old house and it's decorated in a very cute way!"}
{"text":"This place is a disaster as a tea house.  Don't go here.  We had to wait to be seated, even thought we had a reservation.  The owner and waitstaff were extremely rude and put out to seat us and take our order, even though the place was almost empty.  I love tea, and have frequented may tea houses before.  I made a reservation to have tea here,  Apparently, I did not specify that I would want tea and tea sandwiches  when I made the reservation, so we could not have high tea or any type of tea that you would normally get in a tea house.   We had to order off a bistro menu and I had a salad and my friend had a sandwich.    We thought it was a fluke and came back a second time making sure to emphasize we wanted to have tea at the tea house when we made our reservation.  We got there.  More rudeness, more waiting, mediocre food.  Skip this place."}
{"text":"My girlfriend bought a groupon on their high tea for me for my birthday it was for 2pm we got there and we were asked to wait while they cleaned up from the last people maybe waited five min. We had prompt friendly service the house was decorated or the period of the home I grew up in Glendale so just seeing this home was a blast. We had good service and food. Now we both agreed the groupon price wasn't bad for what we got but agreed not worth the full price. I just bought the living social to take my mom for her birthday. The only reason I didn't give it five stars is for the price."}
{"text":"I read some of the postings and was a bit apprehensive about going to this cafe, especially since we are a large group. The staff could not have been more helpful, cheerful, accommodating, etc. The food was excellent and the service was great! If you want a different kind of lunch place, give them a try. We had a great time looking at all the vintage articles for sale and enjoying a place where you could actually have a conversation without shouting to be heard. We are a group of older ladies and they made us feel welcome and valued. We will definitely be back!"}
{"text":"Firstly, let me start by saying that the food here is quite good, mostly homemade and the service is quite pleasant, tho completely amateur.  Sufficient for a quaint, family run teashop in an old house however.    Now, the negatives.    1) for the high tea, you have to make a reservation in advance 2) reservations are only accepted at 11am or 2pm, not when you want it 3) you must cancel 24 hours prior or you will be fully charged (it's worse than the airlines) 4) if you use an online deal coupon, you are given a serious set of rules:  a. they charge you tax and gratuity on the full amount (gratuity is fine, not sure about the tax tho) and they only accept that in CASH - wonder what drawer that goes into b. they automatically add on a 20% gratuity, whether that's what you want to give or not (this was a small party of 3, not a large group) c. if you don't have the cash to pay the tax and tip, (since it's not mentioned on the coupon anywhere), they threaten to charge you FULL price 5) there are a few different rooms, front room, back room, blue room, pink room, etc., but you have no choice where you sit.  they bring you to your table that THEY have assigned for you, whether you like it or not.  Not sure why they don't fill up the front of the house first, but we were brought to the small, claustrophobic blue room completely in the back of the house and stuck in a corner facing a wall.  I asked to be moved and was frowned upon.  she said that the tables for 3 are here, g-d forbid they would put you in a 4 top.  it's not like anyone else was in the restaurant yet. 8) they first bring you the tea menu and then inform you that we have to agree on which tea we would be drinking, as they only ALLOW one pot per table.  imagine!  i don't know if these are the RULES for the coupon guests or for everyone, but either way, they are despicable.  this really blew it for me.  while i like the place well enough, i would never go back now as i don't expect to have so many RULES when i go out to eat and spend my money, half price or not.  They definitely make you feel like a second-class citizen using a coupon 9) speaking of rules, they also tell you what bathroom to \"poop\" in.  literally.  there are 2 bathrooms.  the house is very small and cramped, so one bathroom is in the back blue room where we sat, and the sign on the door says \"please don't make a number 2 or poop in here, cause the smell comes into this room where people are eating.\"  that was enough to make me poop, or was that puke?  my words are not exact, don't quote me, but the words \"number 2\" and \"poop\" are definitely on that sign.  appetizing isn't it?  then you look at the other bathroom and that sign too has RULES.  it tells you that if the door is closed, someone must be in here so there's another bathroom in the back, but if you have to \"poop\", please wait here.  again, don't quote my exact words, but the word \"poop\" and \"number 2\", once again, appeared on the sign.  Did you ever????? 10) and last, but not least, the poop-able bathroom was filthy.  it is cute at first glance, there are knick-knacks everywhere, but then you see that it has not been dusted since the house was built, probably in 1950 or so.  the bottom of the toilet, the clumps on the drapes, the ledges, the knick-knacks, etc., were covered.    2 stars is being generous, but the food was quite good, so they ranked higher than they should.  Kimberly Ann, wake up!"}
{"text":"I made reservations for the Princess room and went for Afternoon Tea with my friend and her two daughters. What a lovely place, perfect for children. They serve an assortment of finger sandwiches, some designed for adults and some for kids, homemade scones with Devonshire cream and lemon curd, and assorted fruit and pastries. The girls had fun playing dress up with the hats and accessories. I highly recommend this place!"}
{"text":"Let me start by saying I am a big supporter of mom and pop/family owned businesses but I have to say DO NOT GO HERE. I've never experience such awful customer service. My friend and I each drove 50 minutes to this tea place. I called one week prior to schedule my appointment. We come in Thursday, we were told we were not in the appointment book. I showed proof I called a week prior they go searching for my information and state I scheduled Tuesday and I was \"a no show\". I only have Mondays and Thursdays off. I know I did not book Tuesday with one hundred percent certainty. With that being said they did not admit their mistake. Instead they said we could stay and pay for our lunch that they would not honor the Groupon would be worth nothing. I chose to leave and never come back. I hope this kind of establishment makes no business with how they treat people."}
{"text":"Ok so me and my girlfriend went here to enjoy some tea and even to get some lunch and it looked nice, but that's where it stopped when we got there with the groupon that we had they roles us that they would only take it if we bought something elves full price. When we asked if we would be able to use it as a credit towed something the woman who I can only assume was the owner started to talk about the business' prophet margin in the end we left with nothing and contacted groupon to see if we can get a credit."}
{"text":"Wow...Just wow!! The setting is so intimate and lovely. And the food is nothing short of fantastic!   We were in for the \"Classic Tea for 2.\" We had the Apricot Black Tea...simply amazing! And a three teared dish with finger sandwiches, fruit and pastries.  There was way too much food for 2 people, in my opinion, but they do have to-go boxes and bags available. Everything was great and we will definitely be back!   I highly recommend this place for a nice quiet afternoon tea! :)"}
{"text":"This place is absolutely precious! If you're looking for an extravagant high tea this isn't the place, if you're looking for a Victorian cottage like feel, you've found the place!   I went to their high tea at 11AM and it was great, service was excellent (grandmother and grand daughter), the tea and sandwiches were also wonderful.   The only downfall is its a tad crowded, but it's definitely worth a try!"}
{"text":"We took my Mom out for an early Mother's Day last weekend. We had a great time. The food was great and the service was wonderful.  We did not notice the 20% gratuity that was already on our check. I tipped on top of it. They obviously knew my error and only ran through the amount without the additional tip. That is a very honest and caring business to do something like that. I will always recommend them and come back often."}
{"text":"** See if you can find my earlier reviews -- All details there! **  I do not recommend this place, due to the abhorrent customer service.   I took my mom here for her birthday. It was not a pleasant experience. I am speaking in this review matter of fact, so the Yelp computer won't throw out my honest review as being \"not recommended\" - as it did before. (Look for my earlier reviews of this place- you'll get all the details there.)  To find out what people really think, go to the bottom of the page for this vendor and click on the reviews that are \"not recommended.\" It's eye opening, to say the least. And yes, these comments are consistent with what I experienced. And no, it is not an exaggeration.  Surely, there are other tea places in or near Glendale, AZ, where the owners believe in customer service."}
{"text":"And I have experienced better Like at the Ritz or the Phoenician. There you do get what you pay for. Here it was ok. But just ok.  We had the buy one get one free deal so for $25 it was worth it but I would definitely not pay $50 for what we got."}
{"text":"This is a cute, quaint old house but don't go for the tea. They bring you a pot of tea with tea leaves in the bottom so only the first few cups tasted good. Tea should only be steeped for 3 min not an hour. Also, there's no substitutions of food. It's made up in advance & you can't change anything about it."}
{"text":"We tried this place because we loved The Spicery down the street but we will never go back to Kimberly Anns's.  First, after being seated there was salad strung across the floor and I almost slipped on it so I asked the waitress to clean it and she said \"I will\" not very nicely like I offended her.  Guess what she never cleaned it at all.   There were 3 tables which included us being served therefore not busy at all,  she did not tell us that there were loose leaf in the pot so we had a bunch of tea leaves in our cups. I heard her tell another table after the fact not to do that and that we need to let it set for another 3-5 min,  as I thought that had already been done, so we drank water basically.  Again we only heard it from another table and had to figure everything out on our own and too late all while sitting directly next to a bunch of salad on the floor I already slipped in once.  It was so hot inside that I wanted to leave before anything came out but we stayed because we felt it was rude since they had to prepare it ahead of time.  I had a groupon that was not expired but they had trouble honoring it because of groupon (not their fault), though they they assured me on the phone they would match the price I paid on groupon so I had a print out of it,  the exp date ect.  I gave it to them ahead of time.  If there was any discrepency they should have told me before we were served anything.  She came out afterwards and informed me that my bill was not going to be matched to what I had on my slip but the regular discounted price plus a gratuity of 12.50, which I said was hogwash considering we had no service. The entire time I kept looking for her because we needed honey or the salad still cleaned up, we needed more water because it was scorching in there and that was all that was keeping me from passing out and still, she never showed up.  Are you serious?  They lied to me over the phone, they gave terrible service and I have not even started on the food.  The Davenshire cream in which is delicious everywhere else for this place was cream cheese frosting, quite literally.  I did not want to be confrontational so I just wanted to pay the rediculoius amount for food I didn't even eat because it was terrible.  Again missing, I had to get up and go in the back and find her to ask her to run my card so we can get out.  She did but then confronted me.  My mother says she was wathcing me from the corner like omg becuase I was backing up toward the door as she kept approaching me.  I just kept saying i just want to go, we had bad service and its ridiculous to still come at me and she then proceeded to excuse the actions of everyone.  They are short staffed, one girl was out sick, ect.  I said Im sorry for your circumstances but excusing the actions and then over charging me was not the way to go.  Please go elswhere as the terrible service and bad food is inexcusable.  Plus while drinking hot tea in arizona you do not want to be in an extremely hot room.    Side note:  I hate leaving circumstances left in a bad way and I am the first to understand that bad days happen and people should absolutely have a second chance as I want all my clients happy and everyone who knows me, knows I go above and beyond for my clients.  I called her to apologize as to how we left it even though I felt attacked and we were informed all we wanted was something for free. (Um no, other wise I would not have paid my bill at all so I really hate that I was accused of that). She excused every single complaint, things like her waitress has a tumor and just got out of the hospital where is my heart?  Um Im not heartless I personally would not have my staff work under such conditions and I would be gofunding that girls recovery.  IDK but literallty the worst place I have ever been.  Kimberly if your reading this You know my phone my number and you absolutely can make it up to me but I require no more excuses this time.  I have pictures of the salad on the floor but cannot figure out how to post a picture with this review."}
{"text":"I really enjoyed my experience here. I went in a group of 7 people and we ordered the Garden Tea off their high tea menu. The servings were incredibly generous and everything was very tasty. They had a small, but decent list of loose leaf teas (a variety of flavored black and herbal teas) and each of us got an individual tea strainer to use. There was only I think one or two people working the day I went and our waitress was incredibly attentive and welcoming of our group."}
{"text":"Went there today with my gal pal and had the Garden Tea. The service was very attentive without being intrusive, and the food and tea were very good. In fact, the scones were absolutely delicious! It is located in a quaint little house and all the food is freshly prepared. I have paid more money for tea in \"fancier\" places but must say I found this more enjoyable overall. I will definitely be going back."}
{"text":"It was amazing, seated right away and had an amazing clean scent. We had the elegant high tea for two and it was amazing. The homemade raspberry vinaigrette was AMAZING with the stuffed tomatoes. All the sandwiches were amazing (nothing much to expect for sandwiches) my favorite was the chicken salad sandwich, which was amazingly sweet and savory. The desserts were delectable and sweet and the peace black tea was the best loose leaf tea I've ever had . 10/10 would go again"}
{"text":"I'm not sure what to say. When I called to make a reservation, you would have thought I was reserving a ballroom for New Year's Eve. Credit card required? In this day and age? Hmmm. The decor was...cute. The tea was okay. The food was pretty bad. Mediocre to yuck. Here's all the turn offs.   So MANY rules! There are signs in the bathroom, signs in the Princess room, rules about exactly how many and what sandwiches you get, you can only have one kind of tea... And then. They ADD a 20% gratuity to your bill. Not again. Not ever. Not even for free."}
{"text":"I was excited for this, I had never been to a tea restaurant. I went there for garden tea for two (groupon)and I had to bring my daughter. It seemed not to be too big of a problem at first although the waitress looked annoyed. When I asked about paying for a meal for her I was told \" I have to check with the chef to see if she can make her food\" then later I was told it would be about the same amount for her to eat as it would be for both me and my spouse. So I said then I will not be ordering her food, and we will just take our food then. Next the waitress said \" then you will not be being served today.\" I asked so I can't eat a meal I already paid for (through groupon) she then replied clearly with a \" I can not do that because you might share your food.\" WHAT?! My daughter wasn't even going to eat at that point, then she says that I can't share MY FOOD THAT I PAYED FOR?!  In what world is that right? Come on! I immediately got a refund (from groupon) and will NEVER recommend this establishment to ANYONE! I traveled a hour and half for this and was disappointed beyond belief. So beware of this uncivilized tea restaurant!"}
{"text":"Whenever I come to Phoenix to visit my family, my Mom and I take each other to Kimberly Ann's...its quaint and cool and has WONDERFUL TEA...COLD OR HOT...and the broccoli cheese quice is excellent! The service is impeccable and the same nice, sweet voiced young lady is there to tend to us each time we've gone in...whether shopping throughout for a new teacup and saucer for my Mom or a great ceramic cheeseboard and matching cheese knife to fly back here to Ohio with me! We like Kimberly Ann's ...Oh...btw...the prices are very fair and in line with others I visit out and about..."}
{"text":"I will not give this place my business now.  I bought a Groupon set to expire tomorrow 10/2/15.  Due to my baby having emergency OPEN HEART SURGERY, I was unable to go in June when I bought it.  My 2 older children-who I planned to take to this, started school in July, but are on fall break this week.  I called to make a reservation.  They stated they are booked today and tomorrow and refused to honor it at a later date.  They will only subtract the amount I already payed for the groupon from the total bill, so it will be as if I did not have a Groupon at all-no discount.  Other businesses are always much more accommodating if THEY are the ones that cannot honor a groupon due to over booking.  My groupon is NOT expired and it is not my fault they are so limited on space. A good business practice would have been to allow me to schedule it at a later time, past the expiration since it was their scheduling conflict, not mine, especially since I called to make a reservation prior to it expiring.   Per the groupon, they are required to honor it if it is their overbooking issue, by the way, which they did not do per contract."}
{"text":"While strolling around Downtown Glendale, the girls and I decided we were hungry.  Upon walking around the many cafe/restaurants, we decided to give Kimberly Ann's a try.  When entering, we were overwhelmed by the theme of this cozy little place.  It was pretty cute --- not TOO overkill-y.  There was tons of stuff to look at.  You can say this place borderlines cluttered.  I felt like I was on that TLC show, \"Hoarders: Buried Alive!\"  So anyways, two of the ladies got the quiche with chicken gumbo soup, I had the BLT, and we had some scones afterward.  The quiche just melts in your mouth, the BLT was cooked to perfection, and the Mae's scones were truly the best.  We shared a strawberry scone, a blueberry scone, and a cranberry scone with devonshire cream and lemon curd.  Yummy!  Although the chips were a weird non-Victorian touch, I think this place is okay."}
{"text":"My husband and I \"do\" afternoon tea in every city we visit.  Kimberly Ann's was a lovely little tea room with a generous and excellent afternoon tea.  We had the \"classic tea\" with 6 different tea sandwiches each, plus a beautiful fresh fruit plate, and delicious tiny pastries (4 each).  The only weak point was the scones...the flavor was wonderful (a seasonal pumpkin spice) but the texture a little heavy for my liking.  The scones were served with lemon curd and Devon cream.  The tea selection covered all the flavor bases and our waitress was attentive to refilling with hot water.  We were seated in one of the tiny rooms, so it was a lovely private experience.  Had the other tables been filled, I suspect it would have been noisy and very little private conversation.  I did find it odd that a 20% gratuity was automatically added to the bill, though I would have added it myself.  Finally, they accommodated us with only a few hours notice...and we appreciated that."}
