{"text":"This is our go-to Korean place now. We live nearby and have tried most of the Korean restaurants. The stewed chicken soup is a rare delicacy for a healthful hearty meal. The beef blood spicy soup is amazing for those who are adventurous. The spicy seafood and rice soup is totally rich and delicious. The panchan (the free side dishes) as the freshest we've had on this street. Love Kimchi House"}
{"text":"I can already say that we will be back!   We came here as a group of three on a Monday evening so the restaurant was by no means busy, and though I came in late my seat had already been prepared. I was by no means extremely hungry at the time, so initially I had only ordered an appetizer (the beef steamed dumplings) which I can say were extremely delicious!   Side dishes were pretty good, although I felt some items could have been prepared more thoroughly. A friend had ordered the hot stone bibimbap which she said was very filling & appetizing.   Overall this experience was worth it, in terms of customer service the waitress was quick to deliver plates, water, as well as refill tea and side dishes. Prices were also reasonable, though some dishes were not worth their full dollar, we were happy to be able to take out after not finishing some dishes.  The place itself is very cozy, but seating arrangements make it difficult if it were to be busy. I did not use the Washroom here, but my friends claim it was extremity sanitized.    We left satisfied and full so 4/5."}
{"text":"Went here with a few friends and got their spicy seafood hot pot. WAS DELICIOUS! The seafood melts in your mouth and just easily breaks apart. The best part were the noodles in the hot pot, they tasted as if they were freshly made! They only thing I wish they had were more vegetarian/seafood options. They couldn't make the Kimchi stew without the pork which is one of my favourite Korean dishes. Docked a star since they had limited veggie options.  Their side dishes are great, their japchae is one of the best I've tried. Also wish they sold their kimchi separately because it was VERY good! Definitely not from the grocery store!  It was incredibly yummy and the side dishes were more than others in the area. Everything tasted homemade and authentic. Very clean and our server was a wonderful lady.  If you're a meat eater, you'll have lots of options that will definitely be one of the better dishes you've tried. Might be a dollar or two more than what you're used to but it's worth it! My new favourite spot!"}
{"text":"We've had some amazing hot pots, but the beef slices hot pot wasn't one of them. There just wasn't the punch of flavour we were hoping for.   On food alone I would have given three stars, but the service was great, lots of options on the menu and the establishment was clean and inviting. Your mileage and preference may vary!"}
{"text":"Not only reasonable price but the food is really homemade awesome! The fish is fresh. The flavour is complex. I have been to many Korean restaurant but I really enjoyed this one."}
{"text":"The Best Korean restaurant in downtown. They take credit card too. Lunch menu is cheap and great. I like kalbi and spicy pork ribs."}
{"text":"Wow!! Soooo tasty and reasonable price!! Located annex area on bloor st. right beside of arisu restaurant!!  The pork bone soup is only 8.95 and taste so deep and good!! Also the banchan was so tasty!!  Price was so good comparing their quality of food!!  Def. recommend this place to try Korean food."}
{"text":"First time here and unlikely going back.    One server spilled my friend's beer all over the table and onto my purse (and I'm talking everywhere) when bringing dishes over.  I totally understand accidents happen.  Although she was extremely apologetic, I can't believe we were still charged full menu prices for everything.  The beer was replaced with a fresh bottle, but really?  My purse was dripping wet.  Not even a comped beer?  As for the food, it was nothing special.  I had chicken soup but it had no ginseng flavour at all.  That was disappointing.    Not impressed with customer service."}
{"text":"Really great food--and you don't have to shell out much for it! With any meal you get a nice variety of appetizer dishes (kimchi, white radish, fried tofu, mashed potato, bean sprouts etc) which our waitress happily refilled for us (for free!) when they were almost finished. Their pork bone soup is both cheap ($8.95, comes with rice) and tasty--the broth was flavourful, just the right level of spicy, and not too thick. The bones had a surprisingly generous amount of meat on it, and the meat was super tender (think \"fall off the bone\" style). Will definitely be coming back here for more."}
{"text":"I had their grilled mackerel with miso stew and it was awesome!! Flaky, tender, well seasoned fish and yummy stew.   Service is quick, friendly and welcoming.   I have to come back for more fish."}
{"text":"Some is really good  Some is .....bad...  It's true. But food feeling is very close korean culture ."}
{"text":"I was searching for some new places to eat at Koreatown and Kimchi House was suggested by my friend who said it was a good option. I got the gamjatang - the pork bone soup. It came with a side of white rice. I found that the soup was lacking in flavour which made me not enjoy it as much. There was an abundance of pork bone however and the meat was juicy and fell right off the bone. In addition, Kimchi House's lunch menu are the prices you expect for an all day menu at a Korean restaurant. Their menu after lunch is more expensive. Usually pork bone soup is ~$8.95 at most places but this one was $10.95. Service was good and washrooms are clean."}
{"text":"Came here on the recommendations here on Yelp and I wasn't disappointed. Very friendly and quick service. I had the hot stone pot bibimbap which was served with no less than 6 banchan sides - very generous, and the kimchi was topped up as soon as I finished the first bowl! Worth splashing out a little for the delicious Chung Ha sake too. Will come back next time I'm in the Annex!"}
{"text":"I come here for lunch once in a while and it's always really great food and service. The restaurant is relatively new and I suspect renovated. There's usually not many people during the day when I go but I imagine it to be quite popular during dinner. It's always the same nice lady serving me so my experience is quite positive and consistent.   As for the food, I usually order the pork bone soup for the lunch special or a cold noodle on a hot day and they're always done wonderfully. The pork bone soup is beautifully presented and garnished and you can tell it is slow cooked well as the meat tends to fall easily off the bone. The cold noodles come with ice and pears in it and it's sweet and they offer to cut the noodles for you. You can add in white vinegar yourself. The side dishes and kimichi are also very good and comes with rice.  Overall, the place is very high quality with reasonable prices and great service. I highly recommend it."}
{"text":"I came here with a friend and I ordered the hot stone bimibap with tofu.  As with most Korean places, they gave a bunch of banchan.  I believe there was 6 or 7 side dishes and they all were beautifully executed and tasty.  I would say some of the stuff is slightly spicy but I was still able to eat most of it.    In terms of the bimibap, it was definitely made with lots of fresh vegetables and tofu, and lots of mushrooms and came out piping hot.  It was very good.    Service: There was only waitress, who served the entire restaurant and she was very courteous and friendly.  It had a small restaurant service feel (treated like family) yet in a very sophisticated. In addition,when I ordered the bimibap with tofu, she asked if egg was okay because she wanted to know if I was vegan or vegetarian.  That's rare to find in Asian restaurants these days.    Verdict: Great place to hang out with friends with quality food and good service."}
{"text":"Aweful. We waited for an hour only to be given a cold bibimbap. Had to walk out cause we didn't want to eat other people's leftovers."}
{"text":"Definitely always down for Korean food. It was a cold night and we wanted korean food so we saw Kimchi house and decided to give it a try. I ordered the Beef Bi Bim Bop on a hotpot and my friend ordered the Pork Bone Soup. They give a good amount of appetizers and are happy to refill them as requested. Both main dishes were great choices of a meal and they both came out relatively quickly. I think having the Bi Bim Bop on a hot plate is so much better in my opinion. Friendly staff and quick service made our dining experience more enjoyable. The bill came up to around $25 for both of us which is a good price for a relatively cheap dinner option. Would definitely go back and recommend to others."}
{"text":"I went here for lunch on Friday with a friend. They did not screw up my order but my friends so I am going to add that in as a cumulative review.  The place is clean and typical korean restaurant with banchan. The kimchi was good and I was glad they had the potato mayo mash. Mhmm, because some places don't offer it.  I ordered their spicy pork with rice and my friend ordered spicy beef soup and requested to have it without egg because she's slightly allergic. Unfortunately, they missed a bit of the egg white so she noticed it and told them. For mine, the spicy pork was not gochujang-ed enough so it was mild for my taste. I couldn't order my regular gamjatang because it was nice weather outside and i'll sweat if i order soup. Next time, I will order gamjatang and give this place another try."}
{"text":"I asked my korean friend where to get good authentic korean food in K-town and he told me Kimchi house. So I had high expectations when I came here.   It was very quiet on a Sunday evening with maybe two tables busy. My boyfriend and I ordered their army stew (everything unhealthy but oh so yummy in a spicy broth). Everything we ate, from the stew to the side dishes tasted very authentic and had another depth of flavour. The stew wasn't just spicy but rather you could taste that there was a broth that was beneath it giving it richness. The kimchi was tangy just like others but slightly different.  All in all, one of the better quality korean restaurants (they also have a lot more options) but its slightly pricier than the other places surrounding it (I would totally pay the extra dollar or two)."}
{"text":"The Jjampong (spicy seafood noodle soup) and jjajangmun (black bean noodles) are my go to favs at this place! The spicy seafood noodle soup is sooooo delicious!! Lots of seafood such as clams, mussels, shrimp and squid. Broth is really good with lots of seafood flavour and not oily at all!! The noodles are always fresh and handmade to order! :D Definitely check out this place! Great spicy soup for when its cold outside!"}
{"text":"We had just come Back from A Naples vacation and were missing Korean food. Decided to try this place out and were pleasantly surprised to find out the food was awesome! Had the yuk gae Jang and the Ja bong.  Probably the best I've had in Toronto. Will be going back frequently for sure. You need to go here, this is proper homestyle Korean food. No short cuts. But, i really think they should put DRAFT BEER on the menu!"}
{"text":"Real good authentic Korean food.  I order the chicken with ginseng soup (Samgyetang) for lunch.  Inside the chicken cavity it is stuffed with rice, garlic, dates & ginseng.  The broth is very light and has green onions on top. It comes with salt in a small dish for dipping.  A small whole chicken in a  small pot.  Other Korean restaurants usually don't have this on their menu.  So when I come here I order this special dish.  This place also has really good side dishes."}
{"text":"So I'm basing this review on the experience I had and based on the meal I had.   Came here with a buddy - we had very different experiences.   Ordered the pork bone soup. I was introduced to this dish at Owl of Minerva and I came to appreciate a certain performance level.   The soup from the get go was scattered with bone fragments. I know it's a bone type soup but there is no bloody reason why you should almost ingest a mouthful of bone fragments upon first bite. Without warning.   Let's break it down:  - the meat. Honestly it was like -5 points from Owl of Minerva where I fell in love with Pork Bone soup. The broth hadn't matured enough and the meat was less in quantity. What irked me the most was the bits and pieces of unexpected and unnecessary bone pieces. I had to be careful I'm almost every bite not to ingest the bone.   Owl is definitely more whole when it comes to the bone - which I think is the right way to go.   That on top having to wait forever for our kimchi and other goods - the best this place should receive in my books is a solid 3*. Listen this place is not terrible. But there are definitely better places. So trust your gut, eat well and do what you gotta do."}
{"text":"So this is my favourite spot for lunch (Mon-Fri) because of their great lunch specials. Generally around $8, they include the great side dishes (Kim chi, sprouts, Daikon Radish etc.) and the main dish, as well as what I believe is the traditional barley tea (in cold weather).   This place is clean, service is always great and friendly, and the food is always good. I have come here before (not during weekday lunch specials) and the food is still great, but quite expensive, which is why I only do the lunch special days (11a.m.-3 p.m. which is great).  Lately my weekday go-to place. Love!"}
{"text":"I was craving for porkbone soup and got take out.  I ordered extra spicy porkbone soup. The soup base was very flavourful and it was actually spicy-spicy (some places are sweet-spicy).  The pork bone  was moist, easily comes off the bone but it was fatty.  They packed it so cute with plastic wrapping over it.  They were very generous with the appetizers too - usually restaurants only give a small side of kimchi for appetizers. My take-out experience was a lot better than my dine in."}
{"text":"I've had way better. We walked in on a Friday night and right away the place smelled like bleach. Even after we left, I couldn't get the smell out of my nose. I ordered the chicken cutlet and it was overcooked and tough to eat.  My friend ordered the soondubu and it was ok, a bit too spicy if you ask me. I know it's supposed to be a spicy dish, but I think they put way too much chili powder. Another con was that they only gave three side dishes, at other Korean spots, I'm used to getting at least 5-6 side dishes."}
{"text":"Since the mass migration of Koreans from Bloor-Christie to North York, the food in Koreatown has gone downhill.   Either that, or the influx of Koreans to Toronto has increased the quality of food uptown, which acts as the new-school contrast to the older Bloor-Christie.   Whichever the reason, a lot of food in the area ends up being cheap and mediocre.   Kimchi House is probably my favourite of the bunch, and you can order a good variety of Korean food here.  Not everything here is great, but some of the dishes are quite solid."}
{"text":"Service was great, bibimbap was decent, good side dishes, and they give out cute candies with the bill :33"}
{"text":"Ordered the oxtail soup for lunch. It was terrible. The oxtail was tough because it hasn't been cooked long enough. The broth had no flavor and was completely bland. There wasn't enough noodle. A bland mess.  The restaurant was very busy. The waitress was very nice, but she couldn't speak English.  Will I return? I doubt it since there are many better restaurants in the area."}
{"text":"Had the cold noodles and LA Kalbi and both were amazing!!! I also loved the selection of side dishes there. It was very clean and welcoming and service was very attentive. I would definitely return next time I'm in Toronto!! Would give 4  1/2 stars if possible."}
{"text":"upon my first visiting with friends for a school project, we were very lucky to meet a famous korean singer/director named jk kim dong uk :) ! definitely a great experience. Food and service was at the top. would most definitely go back again."}
{"text":"Their pork bone soup is better than owl of Minerva. In which owl of Minerva are known for its famous pork bone soup but this one is much better in terms of taste and flavor."}
{"text":"Service 4/5. Our server was very attentive and quite lovely. Food 3/5. We started with beef steamed dumplings which were average. I had the chicken hot stone bibimbap which I think was a little flavourless though the portion size was reasonable for $12.95. The Japchae was also a bit on the bland side. Not a bad meal, but also not very memorable."}
{"text":"As always, I am down for a gamjatang on a cold winter evening. This place is new in the area so we decided to give it a go. Their pork bone soup's amazing. I just wish they put it in a bigger bowl because it's all meat and not much of the broth which I really like. The server was really nice though because they gave us extra soup without charging us so that's a plus point for them! Their sides are fresh and good and you can always ask for more. They have this somewhat mashed potato and egg side that I really like and some brocolli with hot sauce. I will come back for sure and will try the rest of the menu."}
{"text":"I was going to go to another Korean restaurant when I saw their clean unique logo and name. Yes, I wanted to check out Kimchi House even though we were early for dinner. The place recently opened as good wish orchids were near the entrance. The floor is a two toned colour wood which matches the walls. They spend some money on decor and new furniture.   Happy:  The menu had a lot of dishes to pick from and it's still brand new. I went with bulgogi beef soup and told them to make it spicy which they accommodated. There were six small appetizers, including one of my favourite which is spicy sour turnip. My soup came with an egg which I made sure to cook it in the steaming soup. It came with white steam rice which I prefer the traditional purple rice. More chewy and distinct. My friend had the pork bone soup and she said it was pretty good and it had the right spice.   The waiter even asked as how was the food and if we wanted more appetizers which is a nice change from typical service at Asian restaurants.   Even though the washroom is in the basement with a very low ceiling, it was renovated and clean.   Not happy:  Some of the dishes on the menu were a bit pricey from other Korean restaurants that I've been to.   Verdict:  I would definitely go back to try other dishes. It's clean and modernized which I appreciate more than an old looking place."}
