{"text":"I've never had much Korean-food, or even realized that there was a Korean noodle place in the Eaton's centre before, so I went in with no expectations.
 
In fact, I really only chose to eat from here on a whim after realizing I spend way too much time at the relatively \"safe bet\" for stir fry that is Thai Express.

I ordered the vegetarian Japchae and asked for spicy. As far as I'm concerned, it was cooked to perfection in a way that few food court places seem capable of. 

The noodles had texture, the veggies had some crunch, and remarkably it wasn't greasy. The helping was enormous and but not very heavy. I didn't leave regretting what I ate, as is often the case from quick noodle places.

Bonus points: they didn't go shy with the spice - I was sweating while I ate and enjoying every moment of it."}
{"text":"I was skeptical about this place.  It's in the food court and I don't usually have good experience from any chain restaurants. But, I decided to try...
I asked the person who took my order which one I should get. The person in front of me ordered #7a - Kimchi rice and it looked fine and it sounded like he always orders it.  The person recommended me to order noodle instead.
So, I ordered the #7b - Kimchi Noodle with chicken.
It was amazingly good!  I love Korean food, so I know how it should be. My spicy level was #2 and it was just right. I am glad I tried it."}
{"text":"Went here last night to see if there is any improvements. The BBQ beef is burnt and charcoaled. Their vegetables tasted stale and my friend threw up a couple of times last night after eating their fried rice.

Will never return and you should avoid it too."}
{"text":"Kimchi is in the food court at eaton centre. I had the kimchi fried rice with chicken. The food is decent, given that it is from a food court at eaton centre."}
{"text":"In a perfect world I would give it a 2.5 rating. I like my food spicy and Korean food is fun and spicy but as a fast food its nice but not amazing, they give big portion which is cool but its not always that fresh so a true ying-yang situation (similar to their logo). A nice bonus is that they give free drink to students but I would prefer 10% off. Bottom line Ok food, nice spices dont expect anything and you wont be disappointed"}
