{"text":"Great happy hour group today. It's July and the A/C is kickin. Come out and join the fun. Misters on the patio plus comedy."}
{"text":"Great bar if going during the day.  The night bartender tends to like drama......which a bar can have enough of!!!  Great hamburgers, but eat them at lunch.  I hate to be negative about a place for one person......but \"if the shoe fits!!\""}
{"text":"This bar is an excellent place to hang out. It has a feel good environment with friendly staff and awesome food!! Kimmy always puts the customer first and makes that known to every customer she comes in contact with. Please stop in and give this place a try, it will definitely be worth your time and money!"}
{"text":"Enjoyed our first meal in Arizona here!  Great sports bar with enough TVs to watch the games. Thank you Kristina for your wonderful service. The drinks were delicious. Pool table and dart board for fun."}
{"text":"We went for Friday fish, it was over cooked.  We were dissappointed.  It's usually perfectly fried.  Hope they fix this or we will discontinue coming in and ordering.  Also, we ordered the grilled chicken salad, nothing special.  : ("}
{"text":"First time here.  We WILL be back!!! Especially if Bailey is working!! What a breath of fresh air!! Awesome service!! Excellent food...the chef even made an exception for our order! everything was cooked to perfection!!   Keep up the good work!!!"}
{"text":"Katie the bartender is the best. I go out of my way to go there for her and the regular crowd."}
{"text":"I have been more than once during the week and the day time bartender seems to be the same girl who rocks it. The prices are lower than any sports bar in the area. They offer happy hour open - 6 during the week which is something I love. Also, they offer GRILLED wings. Many restaurants and bars won't do this for you. The owner and head chef really want you to enjoy your experience. Live music is offered several nights a week or at least on the weekend. It's spread out with a large bar, pool tables, and a front patio for smoking/hanging out. A lot of regulars, but everyone is very friendly to a new face. Katie is the bartender during the weekdays and always interacting and having fun with customers. I would definitely suggest for a lunch break or even a fun bar night to check out live music."}
{"text":"Good neighborhood bar with tasty food. Friday Bartenders (Alexis and Katie) are both great. Super attentive, friendly, professional and best of all, fun. Have to give a call out to the kitchen MGR, Zach. Dude is top notch. I try and make it every Friday for happy hour. Never disappointed. Try their burgers or fish and chips and Zach's famous chili.  Big cold domestics beers (25oz) for $3!!?  Then they go all the way up to $4 (sarcasm on) after happy hour!!  It does get loud in there with bands, but I am old..."}
{"text":"Great food and great service by the bartender Katie. The American Burger with Fries was just amazing. I'm glad Mark at Discount Tires recommended this place while I was waiting for my tire to get fixed. So I did and I was glad I did and I'll definitely be back for the burger and other items on the menu."}
{"text":"Went there Saturday afternoon with some friends around 2 o'clock. Place was a little slow but picked up by four.Customer service was excellent. Lauren was the bartender and very sociable. Was quite a few regulars there but they were very social with  everyone. Saw review about bad smell. Did not  Detect anything in that. I think when most people reviewing the post on here need to look at the most frequent review. A lot of times problems are solved. I am definitely going back had a fun time there and they do have live music at nights. Have to mention I did not eat any food but most of my friends spoke highly of it. Will have to try some next visit. Prices of beer were excellent compare to other bars I have been to in the area."}
{"text":"Love going to happy hour here! Mostly because it's walking distance home. Lol... Basic neighborhood bar with the usual bar food. Seems like a dive bar but it's actually nice inside."}
{"text":"Just like the bars before this one, it is still the neighborhood hang. No families? The bartender, Alexis, was great. Attentive and warm.  Just don't think that this is the family kinda place. Tables only, no booths. Food was good though... So if you wanna grab a good bite, watch a game and have a cocktail... Cmon by!"}
{"text":"Didn't even get as far as trying the food. Came in with a coupon for a BOGO sandwich. This was our first visit & decided to give it a try. Picked out a couple of sandwiches & were told that the coupon was only good for burgers. Huh??? Not what the coupon said. Anyway, we left... if they are looking for new customers... not the way to do it!"}
{"text":"This is my favorite dive bar for Sunday Funday!  It's got great drink specials (think 25oz Lagunitas for only $7) and the wings are my absolute favorite in town!! (Honey hot, ask for grilled for a great crispness) They play all the games and have an inviting feel.  Went today and had great service from the time we walked in to the moment we left; it was my hotspot last year for football and I can confirm it will be where I spend my Sundays this season!! And seriously, the wings!!"}
{"text":"Went here on a Saturday afternoon.  It was a nice place to hang out and have a drink and watch sports.  Waitress was friendly and they had bottled Michelob Ultra, which my Hubby likes, so we chilled here for a while.  I ordered the chili which was below average, but surprisingly those little garlic bread slices that came with it were super good!?  I also had chicken fingers and fries, which were actually pretty good.  This place is right down the street from our house, so I could see us returning for a quick drink or easy going dinner."}
{"text":"We went to Kimmyz tonight.  The bartender Tatum was very friendly, and took the time to get it our names.  Maybe we found our new Cheers."}
{"text":"the place is a dive.  It has the stink that only Phoenix dive bars have.  Something like sewage and cleaner mixed together, like a port-o-potty.  I should have just turned around and left.  The iced tea and beer both tasted liked cleaner.  The tap selection is pretty limited, I would go for a bottle if I had to come back.   The beef quesadilla was bland and watery ground beef with what seemed like salsa out of a jar.  My friend said he enjoyed his burger and the fries were decent."}
{"text":"Wednesday nights for burger special and live music always great - especially if Casey Killian or Kristen Plambeck are performing!! Great wings too.  Prefer better service without waiting so long-especially when only a couple tables are filled and not busy at all.  Great local spot for music during the week."}
{"text":"Great place, lots of space and TV's, great menu, prices, and drinks.  More people need to find this hidden gem, plus Kimmy and Kurt are great people.  Two locations to choose from you should not be disappointed especially if you have large group. My friends and I hit this place close to once a month and its always a great time with fantastic service and nice outdoor patio.  Stop by and give them try!!"}
{"text":"We had a great time. We enjoyed some live music and local beers. Clean place and good service. Alexis was fun and helpful. She kept the lively energy flowing."}
{"text":"Best bar food in the area around fun joint good  people abound. If I had to describe, I'd tell Cheers Southwest."}
{"text":"Ok for bar food.  Nothing inventive on the menu.  Husband had the philly cheese sandwich - it was fine.  I had basket of battered shrimp - no flavor and the side of coleslaw was terrible.  Plenty of tvs for the sports fan, but the patio was built so no one can walk around it without going into the parking area.  I know that there are only a few stores there, but you need to have sidewalk space"}
{"text":"Had the fish fry all you can eat on Friday and must say the best fish I and my wife have had in many years. Their menu looks great !   We will be back again and again!!!  Grayl"}
{"text":"This place is fun. Great music. I would come again. Great food! Live band! I can't wait to come again"}
{"text":"Happy hour prices of draft Guinness can be better. $6 a pint, doesn't make sense. I have no idea what other specials that have but will think twice before recommending this place."}
{"text":"Kick ass bar. Kick ass staff (and very easy on the eyes). Great drink specials, delicious food, sick bands and so many events! Check it out for yourself!"}
{"text":"Cool bar....Midwest owner.  Gave me a coaster with my beer without asking.  Having lunch. Good food. Live entertainment tue, wed, sat.  Good bartender.  I like it.  I'm coming back."}
{"text":"At first was nice band was good staff was nice than you had this guy sitting next to us claiming he was the owner  Omg he insulted not only me my 6 other friends was sitting at the bar  By the back. Saying we not spending money  Excuse us I spend $40 00 my friends per person spend $40 +  he started to threaten us and calling us all kinds of names almost laid a hand on me I am Woman  No security there at all that's dangerous . First and last time here never come back. Sad because this Kimmyz is nice. But was not safe at all there. They need security there."}
{"text":"Surprisingly fresh food, fast service, bartenders who learn your name and order. Katie and Nicole are fabulous!"}
{"text":"We had the best lunch here! Loved the lunch special that came with a beer! What a great concept! Truly refreshing to go in have a great sandwich and a cold beer! Loved it!!! We will be back soon!"}
{"text":"I enjoyed my time at Kimmyz. The bartender was awesome; Lauren I think her name was. They were just getting set up for live entertainment. With my background in the industry, I pay attention to the details. I ordered a bourbon and diet. No call, so I could taste what was in the Well. It was a good bourbon. Many places cheap it out and give you the lowest form of alcohol at this point.   The food menu was your typical bar fare and the crowd seemed very friendly with a mix of hard working blue collars and the Tommy Bahama white collars floating around the tables. There are a plethora of TV's for the games and it is located in a pretty unique strip-mall that houses:  Five Guys, Starbucks, Pet'smart, Walmart and many more. Basically, you could get lit up here and still get all of your tasks done. You know, when you tell your significant other that you have two more stops and you'll be home in an hour or so, then you order another drink and BS with your friends.  I found it to be inviting and the bartender told me to roll in on Thursdays because she is in the house. I'll be back with my favorite girl next time. I'm looking forward to seeing what comes from the kitchen... see you soon Kimmyz!  #Vino2 #vino2ultimate #Vinosquared"}
{"text":"Stopped in for a fast bite and a beer. The Philly Cheese steak sandwich is awesome!  Bartender is on her A game. Service was great. Plenty of sports playing on the TVs."}
{"text":"Ya gotta love this place! Great food, with FLAVOR, fair pricing, good vibe with a slight buzz of chatter.  I've had their extremely flavorful burgers and fish. You just can't go wrong with their flavorful beef cooked to perfection and fresh fried fish.  The food is great, beer is cold and service is fantastic,!"}
{"text":"Local Dive Bar smells like years of use when you walk in. They do have good bands occasionally. I would not eat food there. if you want to tie one on this is your place."}
{"text":"I love this place! The people who work here are all very friendly and the food I've tried is really good. So far, I've tried their fried zucchini, mozzarella sticks, and nachos and each of them go great with beer."}
{"text":"Just left kimmyz they seem to think electronics smoking is ok at the bar the guy one seat down was smoking sitting his gear on the bar thinking it was not a problem while I ate my dinner. I really liked this place but I'm done"}
{"text":"I've gone into Kimmy'z a few times over the last year and Alexis has been the bartender working every time. Her service is top shelf with a great personality to match. She made every experience I've had there a lot of fun!"}
{"text":"Cold beer and daytime bartender is awesome! Great place for music and food as well. Nighttime bartender is moody and you will be removed from Kimmy's if you don't kiss Alsxis' ass. Pretty sad considering it was a good watering hole. I recommend Brennan's at 34th and Bell. Much friendlier and they appreciate the business."}
{"text":"This place is great! Large mugs, great food, friendly and attentive staff! Many places along Bell don't come close to adding up."}
{"text":"Friendly atmosphere. Plenty of TVs to watch the games. Decent neighborhood sports bar. Will definitely be back."}
{"text":"Kimmyz has a modest, local feel to it, and friendly service. I really enjoyed the grilled cheese. I recommend it to anyone who is looking for a chill atmosphere."}
{"text":"Met a friend there on a Friday afternoon about 1 p.m. I didn't think they had patio service because no one came out. Until what I believe we're regulars came out. The waitress came out and asked them if they were okay if they needed anything and totally ignored me and my friend she came out about 4. I had to go to the bar and get our own drinks. I don't have a comment about the food because we did not eat there which I will never have a comment because I'm never going back."}
{"text":"This place is great! I've been to the one on the west side many times, but today was my first visit at the Tatum location. Got a perfect seat to watch my football team, our waitress was the best (Kristen) very attentive & friendly. The food was good, came out fast, the drinks are strong, and the prices are reasonable. Will definitely be back for the rest of the season. There are plenty of TV's, so no worries on finding your game. So glad we stopped in!"}
{"text":"On Friday afternoons, my associate and I gather for a meet up. We go over biz for the week, catch up on politics and plan next week's work stuff. I heard about it from a friend that jams there on music night.  We needed a place where we can grab a late lunch, have enough privacy, a decent drink and not be besieged with waitstaff rushing us out and trying to sell us steak and expensive wine.  We usually go the same time every week, and Cady the bartender starts making our favorite drinks when we walk in the door.  The food is generally ok. The chili cup is a bit overpriced at $5 and some of the appetizers are less of a value but, the burgers are good, the all-you-can-eat fish is a deal and the long islands are.... well, more than decent for the price and well made.  We don't watch the 8 or 10 screens but this has to be a great place for sports when the time is right. A pool table and darts add to the distractions when you're up for a game.  It's a basic place with decent food, good drinks, terrific service from Cady, and at some point we'll sneak over on Tuesdays for some music.  Check it out when you're in the area and enjoy!"}
{"text":"My favorite neighborhood sports bar! Great live music, and large TVs for sporting events. The staff is friendly and professional, and the food is very good and reasonable. They seem to have the \"regular\" and the after work crowd for the area."}
{"text":"Great time for the TPC Golf week. Our server Nichols was the best. Very attentive and friendly."}
{"text":"Bartender Kristin is amazing.  Get in here and enjoy her company! Had the wings tonight and Kristin served me with extra smiles and a winning personalpersonality"}
{"text":"Stopped by for a quick glass of wine while I was waiting for a tire install at Discount Tire. Great drink prices at Happy Hour. Friendly atmosphere with a packed bar of regular patrons."}
{"text":"I gotta come up a star for Kimmyz. I have ALWAYS had good service. The food is consistently very good and way above typical sports bar standards. Their wings and sliders are awesome. When you ask for crispy wings, you get crispy. The bread they use for burgers and sliders is so tasty. We have found our bar to watch games and grab a great meal. I just wish they had some more exotic beer selections."}
{"text":"Great neighborhood Bar, food is good, lots of TVs to watch sports on.all the people working there are very friendly. The Bartender Alexis is fun and very efficient. I enjoy hanging out there."}
