{"text":"Tried the duck soup - never had before - and almost swooned, it was so delicious. Great ambience, good wine, and lovely presentation of dishes. You can share your selections with your dinner partners, if you choose, which is fun, as some of the dishes are unique. The restaurant is just lovely; very relaxed atmosphere, and friendly waitstaff. Had a great time, and will be back. On my top five list of favs! (Do suggest making a reservation. This place is going to be too popular to expect a walk- in!)"}
{"text":"My first time in Davidson and what a quaint town. Kindred is a forward thinking restaurant where service and food excellence meets nicely. I was in town for the night and so happy that my colleague took us there! Although I live in NYC, I'm the first to say that great food can also be found elsewhere ... Clearly Kindred proves this theory! Frankly we had so much food from the menu which was all memorable, but for sake of fellow interested diners, the crispy oysters, bucatini and Brussels sprouts tartine were my favorite. When I'm back in the Charlotte area, I will be sure to revisit!! Ps. The gracious hospitality and kind note at at the end of the night, was the proverbial icing on the cake!!!!"}
{"text":"We had a most delightful lunch at Kindred yesterday. Welcomed by an excellent hostess who told us to be sure to take home a piece of triple layer chocolate cake. Great advice!!! Our sandwiches were delicious - the best was the avocado and fried egg. Who new it could be so full of flavor! Our waiter suggested it and it was another piece of great advice.  We sat outside in the lovely courtyard filled with lovely planters and both sunny and shady tables to choose from.  Worth the trip to this charming town to experience the artfully prepared food. Can't wait to try dinner there next time!"}
{"text":"My wife and I had dinner at the bar. The mixologist was a magical drink creator as well as very friendly and informative. The food service was spot on and the crispy oysters were terrific. Crunchy exterior soft perfectly cooked oyster over a creamy (yogurt based?) Sauce with a bit of spiced oil. The salumi was typical but served with a smear of amazing mustard. The pork chop was beautifully seasoned and perfectly cooked, served over a cassoulet of beans with some wilted greens. The chicken over polenta was cooked just right and a relatively full meal. Overall, a great experience."}
{"text":"While traveling, my wife and I stopped in at Kindred on a Tuesday night in early May for dinner. We were quite overwhelmed: the food was  delicious, the menu innovative and locally sourced, and the staff knowledgeable, friendly, and incredibly attentive. All of our dishes had fascinating flavors, and we'll have to go back to Davidson just for the pleasure of eating there again."}
{"text":"One visit and I am a fan.  The food is exquisite, the service is flawless, and the ambiance is as charming as Davidson.  Complimentary milk bread heralded the excellence to come.  The waitress bragged on the house-made pasta for good reason.  The ravioli looked and tasted sublime with watermelon radish.  The pork arista cassoulet was hearty and flavor-full.  Even something as minor as \"grandfather's pickels\" was extraordinary.  With an \"ever-changing menu,\" what we were offered included items not on the website menu and omitted some that were, so there is good reason to return, which I certainly will.  I wish the craft cocktails were on the website so I could try to re-create mine (maybe that is why they were not!)."}
{"text":"I feel I must start by saying in regards to any negative reviews this restaurant receives, I have noticed a trend that many of these reviewers do not seem to understand the concept of small plate dining. The dinner menu is tapas style. If you think you are ordering an \"entree\" you will be disappointed. These are small plates and you are meant to order a variety to share. Ok now that I got that out of the way....Kindred is simply divine. I have eaten here numerous times but not yet written a review. The location is wonderful, the decor is on point, the waitstaff/bartenders are friendly,  and the food is perfection. The menu is seasonal and changes frequently and everything I have tried has been fantastic. There are a few stand outs that are always on the menu which include the crispy fried oysters and the duck fat potatoes. There are usually 3-4 different pastas and some of them change frequently but all have been delicious. The milk bread is of course amazing. They have a well thought out wine list and excellent cocktails. Its always a great night out and easily one of the best restaurants in the whole Charlotte region."}
{"text":"Some of the best food we have EVER eaten!  The hamachi crudo was phenomenal, the bread, oh my!  Duck fat potatoes were off the hook!  Crispy oysters and the pork sugo pasta were both fantastic.  Everything was seasoned to perfection and the wait staff and employees were so nice and welcoming.  LOVED this place from start to finish!"}
{"text":"Lovely restaurant and very good service. The dishes are on the smaller side, like others mentioned, but everything we tried was delicious. The complimentary milkbread was soo good. The scallops (3 of them) were also very well cooked and tender. The duck fat potatoes were well fried and tasty. The chicken was good too but a little on the bland side. Our cocktails were pretty strong but enjoyable. I'd definitely recommend this place and hope to come back!"}
{"text":"I wanted to like this place but I just couldn't. I read all these reviews and write-ups of the place so my expectations were high. We were a party of 4 and sat upstairs. The downstairs is a bar and tables of 2 that are totally crammed too close together. This is not NYC; this is the suburbs of Charlotte! So let's have some breathing room between you and the other diners as I don't want to be sitting so close to them that I can eat off their table!   The milk bread- supposedly all the rave. It's not milk, bread, or milky bread. It's this gluey mess that looks looks like a poor cousin to a popover. After I ate it I felt sick.   Dinner- the menu is very small, limited, and tries too hard. They were pairing things that simply don't belong together. My friend got the miso soup and said 'this tastes weird'. How can you screw up a broth soup? If you are going to have some 'adventurous' items, you need to have some tried and true standard items that you know will sell. I had the duck fat fries- just not that good so don't even bother. At least the food has fresh ingredients.   Other- the bathroom on the second floor. It is one room that has its door open into the restaurant. The door knob is old with an even older tiny lock. I was terrified that someone would fling open the door and most the diners would see me peeing. Owners, if you are reading this- please install a proper bathroom lock that slides across the door!!!"}
{"text":"It's great to have a new restaurant in the Lake Norman area. This restaurant feels like you've stepped back in time. Good vibe, good service , good food. They made accommodations for us even with the place being packed which was great. :-) We ordered the Tile Fish, Chicken, and fries. All 3 were good.  I gave 4 stars because of the smaller portion sizes for the price. Also I had a glass of wine and the pour was way less than half a glass.  I went home a bit hungry. I will say that the bread is really good too. We will go back and try other items on the menu and may update this post."}
{"text":"The Bottom Line: Service. Flavor. Care and attention. It doesn't get much better.  Wow! What a gem! I'm kicking myself for having taken so long to eat here. Every plate has been thought through, created and then presented with beautiful attention to detail. The service is also wonderful and one never feels rushed. Please go and treat yourself."}
{"text":"I had the privilege of sitting downstairs at the \"chef's table\" and enjoyed a steady supply of varied tapas dishes all night. All of the dishes were fantastic, from beef and tuna tartar to fried littleneck oysters to duck-fat potatoes. I've never had a better meal. Highly recommended."}
{"text":"I had high expectations for Kindred, and they exceeded them! I went here for a weekday lunch, which seemed to be the perfect time because it wasn't too busy. We got crispy oysters as an appetizer, which was super tasty and I was very pleased with. The dill yogurt on the side was absolutely delicious. For my lunch, I ordered the burger and frites on the waiter's recommendation, and it was excellent. The price was very reasonable as well. Overall, very great! Definitely recommend Kindred for a weekday lunch."}
{"text":"So we ended up going two days in a row since we were so smitten with our first experience!  Day 1 We were both starving so we ended up tearing through the milk bread which was nice and warm. I ordered the crispy oysters and he the wagyu beef tartare. I've always had oysters plain up until now but crispy works so well. Who would have thought. The dill yogurt was a nice contrast with the texture of the oysters and the spiciness of the chile oil. Next we both decided to order pasta dishes so I ordered the squid ink conchiglie since it was highly recommended. My goodness was it tart! But I love tart so I enjoyed every mouthful of pasta and shrimp. We ended dinner splitting a frosé which was super refreshing. Dinner for two price ~$130 four plates, dessert, 2 glasses of wine and two cocktails.  Day 2  We ordered the salumi plate and duck fat potatoes to start. The potatoes are out if this world. So crisp on the outside and flavorful. We both ordered the same pasta the ravioli. One word SALTY. I couldn't even finish my ravioli because I couldn't bear the amount of salt. Ended with the ice cream and cookies which was meh nothing special. But I almost forgot to mention that we got a complimentary plate of grandfathers pickles which which my s/o LOVED.   Decor- super chic  Service- great but almost errs on the side of obsessive (refilling water with every sip) Food- Impressive  Day 1 blew me away day 2 not as much but still splendid but I would end up giving Kindred a 4.5"}
{"text":"Go right for the cocktails. Great bartenders who concoct delicious drinks.  The milk bread is a can't miss - fluffy, warm with a warm crust.  If you can't get a reservation, show up early and sit at the bar. The bar design is beautiful and the bartenders are attentive and friendly.   The crispy oysters are battered in buttermilk and are light - not heavy breading at all. It comes with a dill, chili oil sauce that is surprising and easy to eat. You just pop them right in your mouth.   The pork arista was a generous portion of pork and the bean cassoulet that comes with it is the perfect mix of toothy and tender."}
{"text":"I went with very high expectations and came away disappointed. The individual dishes were good, some very good, but nothing that I woke up the next morning thinking about. The desserts were mediocre (we tried 3). The experience was fun--family share style--but it was also expensive. We ordered fewer courses than our waitress recommended (9 instead of 12) and found it plenty. We spent $175 for 4 including tip and 3 glasses wine."}
{"text":"We were considering Kindred for a dinner with friends who would be visiting from Boston/France even before the mention in a he WSJ or the write up in the Observer, so we took a 9:00 p.m. reservation. Our party of 4 began with 4 plates to share--mushroom tartine, scallops, crispy oysters and duck fat fries. The tartine was only slightly warm and not as loaded with mushrooms as the photo in the Observer that morning. The scallops were well cooked, but not unusual. The fries were declared worthy of a Parisian restaurant. The oysters were the clear standout dish at our table. Next we each had a dish as our \"main\". The pork Arista was excellent. The flounder was well prepared, but surprising small. The squid ink pasta with shrimp was delicious. Unfortunately, when the tagliatelle was delivered, it was seriously undercooked (hard, not al dente), so it was returned to the kitchen. The replacement was very good. We ordered two desserts, the birthday cake and ice cream and cookies. The had run out of the latter, and the server recommended the apple dessert. Both were outstanding. Some reviews have raved about the service. Our experience was the need to ask for more water several time, but the server was very knowledgable. I was impressed that when the reservation was made over the phone that we were asked about allergies and dietary restrictions. The menu presented to my wife identified dishes she should not consider. The wine list was well designed to accompany the dishes. All in all, it was an excellent evening and I hope to return soon."}
{"text":"3rd time we've been here since Valentine's Day and it never disappoints. We were celebrating a birthday and an upcoming wedding in my party of 6. We were given complimentary prosecco upon seating and a piece of birthday cake after dinner.  What a nice gesture! The food and service are always top notch! Morgan was a very informed and gracious server. We will keep coming back again and again even though it's a 35 minute drive.  And the milk bread is amazing!"}
{"text":"Birthday dinner for me! Immediately felt at home with a warm welcome, cozy decor, well worth the drive from Charlotte Our waiter was knowledgeable and helpful. We started with cocktails, I had the spritzer which was exactly what I wanted, and the boy had the whiskey rye drink that was boozy and just what he wanted.  We switched then to wine he brought. For starters we had the beef tartar which did not disappoint, salty rich and on a bed of avocado! The waiter convinced us to try the oysters, which to me were only ok. And we couldn't keep our hands off the milk bread. The squid ink pasta was rich and flavorful with a broth we couldn't get enough of! Finished with chocolate birthday cake. If this is what it is like to get older, sign me up!"}
{"text":"My sister, mom, cousins and I, tried this restaurant last night....we had the worst experience.  First off we sat upstairs and it was absolutely freezing- we all kept our jackets on thru most of the meal...it was also one of the loudest restaurants we have ever been to, which made it difficult to converse with one another.  On a side note, the hostess made us walk past a tree in the corner upstairs that literally smacked my cousin and I, in the face...we were confused as to why we had to squeeze past a table and that annoying large tree...ridiculous! We all made a comment about that stupid tree!  Find a better spot, or don't walk your customers thru that tight spot!  I mean, I'm a skinny girl and it was tight!  Next, the waitress, with ZERO personality, took our drink order...she was unfriendly and just plain old miserable...wrong profession for someone with a terrible personality.  It took her forever to serve us our drinks. Ok, the drinks---I ordered a dirty martini, excited to try it, but as soon as it was brought to the table, I was very annoyed.  The martini was warm, and not properly made.  The glass, if you can call it that, was barely larger than a shot glass...when it was placed on the table, my family members all commented on the tiny, absurd size of the glass it was poured into.  The olives on the toothpick took up half the glass, and when I pulled the olives out, the martini was even less filled n the glass!!!! They charged full price for the smallest martini I ever laid my eyes on, in my entire life.  My mom ordered a Cosmo and it was served in the same size glass as well...we joked all night that we were not going to order another \"3sip cocktail\" and pay as much as we were charged!  My mom spilled her Cosmo all over the table, after a sip...the waitress didn't offer to make her another one, which was to be expected, since she was the worst server ever!  Also, My cousin ordered champagne and they poured it at the table, into a RED WINE glass- why would they do that?  It's meant to be served in a champagne flute for a reason, to preserve the bubbliness of the champagne. Not ok for the crappy glassware choices this place made on every single level!   The menu- trying too hard to be cool and trendy...expensive prices for horrible small plates of food...my family ordered a bunch of different dishes as appetizers along with the main course...there was literally nothing at this restaurant that I would even want to try.  As I drank my pathetic tiny cocktail, they all tried the food. They ordered the duck fat French fries (disgusting) why would they cook in duck fat? makes me sick.  My family said that it was not too bad, but just extremely salty and strange tasting....they also ordered the fried chicken, yet after they all bit into it, they said it had a weird taste...my mom looked at my sister and my cousins plate and said, that's because it's dark meat... That is so gross, greasy and unhealthy and who wants the gross dark meat of the chicken in the year 2016??? That menu was nasty!  I'm all about trying new things, but that chef was unaccommodating  and not willing to leave stuff off of our plates. Has he ever heard the saying, THE CUSTOMER COMES FIRST?  Obviously not...look, this is Davidson, NC, not NYC...get real!  The menu is annoyingly complicated, I prefer simple flavors and not junking up a dish.  They were too worried about plating the food and not worrying about flavors that go well together. (They must have watched Too much Food Network!) My sister and cousins got the pasta dishes, and said they were disgusting....my mom knew I would not eat squid ink or their jacked up pastas, so she ordered the beets which were not bad after I got past the salad dressing it was drenched in, and also the pickles with onions...umm, nothing special about those- more like cucumbers soaked in vinegar for the day. The manager or own we never came to our table either. My cousin and sister complained as we were leaving this place and the manager asked if he could by them a shot at the bar!  Haha. What a joke, really, we are not in college and a shot is not the answer to fix this. (They declined the shot) He then gave my cousin a gift card.  None of us wanted to take the gc, because we will never return, but my cousin took it- she should give it to someone she dislikes and let them experience the crap we had to deal with...We all left hungry and dying for good cocktails, so we headed to Red Rocks for martinis and I got my salad!   From now on, I will stick with Mickey and Mooch and the local LKN standards which I love...hell, I would rather have gone to Macs in Cornelius or Duckworths or La Unica. This place is the worst, ever!"}
{"text":"I can't say enough about this place.  Food, cocktails and service are superb.  Completely worth the drive from Charlotte/wherever you are.  All of the staff are on point, friendly and completely accommodating.  Davidson is lucky to have them!"}
{"text":"I could not be more disappointed about this place. After all the hype it leaves me wondering how they ever got such pretentious media coverage.   The physical place is cute, but nothing new and nothing you haven't already seen 1000 times over on any given hgtv makeover show. It's trendy but in time will be dated. The tables are entirely too close together. Okay for NYC but we're in Davidson. I'm tiny and could barely squeeze by my new neighbors who by the way, would NOT stop talking to us the entire time because they were so awkwardly close. So annoying. The waitress also kept bumping everyone each time she went to any table.   The hostess didn't even speak to us. She just stared giving an awkward look until we broke the silence saying we had a reservation. Classy.   I do want to exclude the pastry chef from this underwhelming experience because the bread and dessert was great, it was just everything else I was so unsatisfied with.    I called and asked for a vegetarian option prior to arriving because I didn't see anything that would be okay for me to eat on the menu online before we got there. I'm used to having to sacrifice a sad side of rice and veggies so hubby can be the foodie he is. However I was so shocked by the lack of accommodation I was given. They handed me the regular menu with everything I couldn't eat crossed out with pen. So there was beets, broccoli rabe and beets. And then the gnocchi with the crab crossed out.   So I ordered the broccoli rabe and gnocchi. The broccoli rabe was SO tough. I couldn't cut it with my knife let alone chew it. The remoulade tasted like puréed red peppers and cream. Hubby loved his fried chicken but said it was a bit over-seasoned.  So onto the gnocchi. I'm sure maybe if I could have eaten seafood the crab in this would have been great. But since all they did was remove it, it was just weird. The gnocchi themselves were cooked well and perfect texture, but in an orangey lemony sauce with a crap ton of parsley was just weird and not appetizing.   Hubs duck fat potatoes were nothing to write home about but also, there isn't duck on the menu anywhere. So they're obviously just outsourcing the fat and not rendering it on site.   Lastly, it's a tapas place!  Doesn't really disclose that anywhere. Every plate is super small and not shareable. So sad about the whole experience."}
{"text":"We went here for our anniversary dinner and our experience couldn't have been better!  All the staff were just so genuinely happy and you could tell they loved working there. Our server Morgan was very sweet and often asked us how was the food and such. She even recognized it was our anniversary and it was so thoughtful of her.  The restaurant itself was just lovely. It was bright and airy, even though in those tighter spaces. It wasn't flashy or stuffy or felt like you were in a posh restaurant.  Ok the food! I was actually kind of sad because I couldn't try everything in one night (and that I got so full!) But each dish we got was amazing. Everything was so fresh and flavorful without being too much. My favorite dish was the guinea hen wings, which were smoked and then crisped up, it was such a unique flavor. My husband loved the wagyu beef, even though we were surprised that is was raw (but wow, man, wow!) I appreciate a menu that's as diverse as theirs.  It shows to me that the chef loves his work and has fun with it.  So thank you Kindred!"}
{"text":"Such a welcome addition to the neighborhood! The decor is on trend, the food was awesome and the service excellent. We ordered the yellowtail crudo, which was refreshing with interesting flavors, the taglioni, which was my favorite dish, and the bucatini, which was good but a tad too fishy for me (my husband enjoyed it though!). All dishes were the perfect portions for sharing (like a tasting menu) between two people.  The wine was great, the house old fashioned was strong but good, and their freshly baked bread was light and salty. All in all, it was the best dinner we've had in awhile, and I'm so glad to see main street in Davidson finally get some worthwhile restaurants (pickled peach and kindred are in a different league than the way overrated toast or even Brickhouse, thank goodness). Go to Kindred and share a few small dishes - enjoy!"}
{"text":"If you are hungry be prepare to shell-out some big cash! Portion sizes are very small with a high price tag. I had the pasta with tomatoes without meat and I was left very hungry.  I don't mind paying more for food if it leaves me wowed, but there was nothing special about this dish. Husband had the flounder. He said it was good but again, nothing special.  Portion was small and not worth the price. If you're going to offer small portions then make them tapas and charge less.  Spent $50 in food and we ended up stopping at the local Mexican restaurant on our way home.  On the plus side... they did a great job with decor and service was very good."}
{"text":"After hearing all the hype and reviews, we finally had a chance to dine at Kindred. We came away trying to figure out what the hype was about.First, I will admit the the restaurant space is nice and comfortable and that the service was great, however at the end of the day its the food that you come for. Seems that the menu is all over the board with no continuity. I can't quite figure out what it's trying to be. Food quality was good but nothing stood out and said \"I can't wait to get back here and try that again\". I like the Tapa's concept, but dropping $150 for  four people I want a little more bang for my dollars."}
{"text":"This is a tough one. I'll start with what I liked:  - The decor  - the wait staff is friendly   - cocktails (tiki manaj was delish but more like a margarita which was unexpected) and wine  - we loved the fried oysters, the little salad, milk bread is incredible, apple galette  - the pace the food was served was nicely timed! We weren't rushed but had a steady flow of small plates arrive just in time for our readiness  Now to what I did not like :-(  - we were seated right next to the kitchen even though other tables were available.  - we asked to move in one table over which was fine with them but then the waitress put my water glass down too hard and it practically exploded broken glass everywhere including my face and a tiny shard was stuck in my hand. I spent the dinner paranoid glass had gotten in my eye. And so we moved back to out original bad table so they could clean up. They started to move our bread and drinks over to that table until I asked for new ones because you know..... The broken glass?? Duh  - I expected an apology from the manager, a drink on the house? Anything? Nope, nothing   - the waitress recommended the scallops, her favorite. We hated them. Neither of us could eat them. Super weird flavor I can't identify. And it was on the sauce, and the scallops so it couldn't be avoided by skipping the sauce. I recommend they remove it from the menu   - the gnocchi was just tasteless gummy grossness, we both agreed it was gross   - the bolognese pasta, this I thought was gross while my friend enjoyed it so maybe I just don't like that dish in general? I expected some tomato flavor where it was just all salty meat flavor  - the music did not offer any ambiance. When it could be heard it was just blah and then it was so loud you could t hear any music once the bar area filled up.  So unfortunately it was kinda 50/50.  Half the dishes we ordered I liked, the others o didn't. Same in the service. And that's why I gave it a 3 star.   I would consider returning to try more dishes."}
{"text":"Hands down best restaurant in the area.  Top notch service.  Quality selection of craft beer and cocktails.  Food is always on point whether you go for lunch or dinner.  Great experience everytime I'm there."}
{"text":"Two words. MILK BREAD. I always take guests here for dinner and it is always an excellent experience. Service is top notch and all entrees are delicious! I always opt for the barkeeps choice. Every cocktail they whip up for me is spot on for what I was craving. I come here often and looking forward to their new restaurant to open this summer!"}
{"text":"I went to Kindred on New Year's Eve with high expectation based on the exceptional reviews it received on Yelp. However, I felt the food was good, but certainly not as remarkable as most reviews mentioned here. The dishes I tried were Little Gems Salad, Duck Fat Potatoes, Beef Tartare, and Fried Oysters. The salad dressing was a bit flat/tasteless. Fried oysters were pleasantly crispy. Beef tartare contained too much dill and parsley which overpowered the beef. I ordered a cocktail, and for $12, the cocktail contained way too much ice and was not very satisfying. To be fair, I would say the quality of food here was consistent, but It's just not good enough to warrant repeated future visits considering there are other tapas joints in nearby Charlotte areas."}
{"text":"Was very excited to try this place given the high accolades. I didn't expect it to be a tapas place but it is...so our expectations going in were already off kilter. We are easily adjustable tho and tried four plates - the melon salad, duck fat posters, scallops, and hangar steak. The prices were quite high relative to our dishes with the exception of the potatoes - there were so many we had a doggie bag. All the dishes were good - a bit heavy handed on the salt but flavorful. The warm milk bread is yeasty and addicting.   The waitress was super cool and friendly. She had to try everything in the menu so was quick to give us her favorites. It was hopping inside which resulted in a very loud atmosphere. We weren't looking for quiet romantic but this place is better suited for groups of drinking partying folk.   One of the menu items was a round of beer for the kitchen. Love that idea!!! so we ordered one for six dollars. After no one came out to say thanks or even acknowledge the round I got a feeling we just paid a stupid tax. Again absolutely love that idea which would be validated  with even one member of the kitchen coming to the table.   Glad we tried it once."}
{"text":"We had a really nice time at Kindred.  The service was awesome.  The food was good- small plates at fairly high prices.  The food was NOT excellent, though, and that is what I expected based on the price per tasting portion.  We had the wagyu tartare- very good; the fried oysters- mushy but good flavor; the tagliatelle with morels- there was a big chuck of pasta that had cooked into a solid lump, however, the sauce and morels were outstanding.  Cocktails were fine, but again, expensive at $15 a piece.    I would not go there again.  Actually, I will not go there again.  But the service was awesome and the food was good.  I'm a value kind of girl unless something is outstanding, and this was not outstanding."}
{"text":"Amazing restaurant! Great ambiance, service and food. Chef utilizes local farms to create delicious cuisine based on the season."}
{"text":"Outstanding food! Lots of attention to detail on the interior decor as well as the food. Delicious meal! The service was so friendly and the staff was very knowledgable about the menu offerings as well as the completely remodeled building. A must go !! Take a friend. You will be glad you did. Great atmosphere and incredibly good food!"}
{"text":"Must stop... let's start with the fresh bread as starters (free). Local fresh ingredients with amazing service. Located right downtown Davidson, you can't beat it!"}
{"text":"Been wanting to check this place out forever! Came for our anniversary. We split the tapas style  squash, curry sweet potato soup, triggerfish, scallops. All 4 were 5 stars. The triggerfish was my favorite. After reading the reviews we had to get the milk bread cinnamon roll. I'm usually not one for dessert but this is a must! We both had drinks and bill was under $100."}
{"text":"Love Kindred! We go during the week and sit at the bar to share and enjoy small plates"}
{"text":"Food is amazing. Server was a little pretentious, but I think that's part of the experience.  Highly recommend the cheese plate.  Only reason I didn't give 5 stars is because of limited beer selection."}
{"text":"Finally made it. To kindred and it was worth the drive. The food was hot, curry was strong like I like it, the bread/rolls tasted exactly like my grandmothers!  The scallops were delicious but not enough for me. The service was excellent and didn't have to wait on any requests Highly recommend"}
{"text":"Good selection of options, but not huge.  Waiter was really nice and they made sure you were fine the entire time.  Food presentation was good and the food tasted great.  Would come back many times."}
{"text":"Nicest restaurant in town - tapas (small portions), farm to table vibe. Pricey, but a great date night option."}
{"text":"The food definitely lives up to the accolades. I can't speak for the entire nation, but it definitely is a local standout.  My only objection is that it is so damn LOUD!  The acoustics plus background music made it difficult for our 60ish group to carry on a conversation. I think you can create an ambience of happy, bustling energy without a background noise level of  over 85 decibels.  Just because every other restaurant is doing it doesn't mean you have to. We chose indoors instead of quieter patio because of threat of rain, but we should have taken the chance, as you should if you go.  Squash soup + pumpkin seeds was delicious. Lamb loin was perfectly grilled and flavored. Eggplant pasta dish was a great complement. Bread was deliciously doughy.  Service was very attentive. They forgot to bring my glass of wine but I am not a big stickler for having wine with meal and just declined to ask for it. No matter. We will definitely go back."}
{"text":"Food was delicious and the staff was all so friendly and accommodating! Great place to bring friends or a date. The serving sizes are on the smaller side but that just means you can order a few different plates to share. The prices were also very reasonable. Only problem I did have was the noise level, once the place fills up you can barely hear your own conversation."}
{"text":"Was excited to try this place but had a terrible experience. We were seated but our waitress didn't help us for 30 minutes. When she came to the table all she said was \"what do you want to eat\". We decided to leave and eat somewhere else."}
{"text":"My experience is was just out of this world. The cocktails were incredibly delicious (the rambler is a must), the food is just crazy how complex the tastes were.   And, most importantly, the staff was just above and beyond. This place is a must when you visit Davidson."}
{"text":"So-so. I was not overly impressed. Menu seemed lacking, perhaps they've been busy or holidays have led to incomplete deliveries. Manager was not very friendly and not initially willing to be accommodating (We were sat at a table at the top of the stairs in a traffic pressure point when the dining room was mostly empty. When we  asked to move we were told they were full with reservations, of which our seating was also a reservation so what was the problem with just switching us? After a second request, we were moved).  Our second server was great and highly knowledgeable. The oysters and cheese were the highlights of the meal. Overall I highly doubt we'll make the return trip from Charlotte to dine here.  This is a great option for those in Davidson but we'll stick with all of the great restaurants closer to us in the future."}
{"text":"We went there on a client lunch.  The food was all very good.  I had the falafel on wheat naan with yogurt and cucumber with a side salad. I enjoyed it and others enjoyed the pulled pork BBQ and other food. The menu was not overly intriguing but I would give it another try."}
{"text":"Pretty expensive for small portions. Went there on my birthday with six others. They sang happy birthday and charged me for a slice of cake! What restaurant does that to someone one their birthday? I don't see what the fuss is about and won't be returning."}
{"text":"I can't say enough about how wonderful the food, presentation, and service were.   This is one of the best meals we've enjoyed in our lives.  The seating could absolutely be more comfortable and better suited to the cozy environment; however, that is literally the only thing I would potentially change.  Loved being able To have such a high end meal in such a casual environment.    We had the hamachi, cheese plate, pork, hanger Steak, and mushroom ravioli.  Also brought home cinnamon rolls for ourselves and some friends.  The hangar steak was a bit tough, which we attributed to being served in the iron skillet, perhaps had a little additional cook time.  The blueberry mustard accompaniment was amazing."}
{"text":"Our second time here, this time for lunch.  As good as it was for dinner, last month.the cucumber salad, shrimp roll, skillet burger and the friies-- over the top delicious.  Very attentive service, good selections of small plates, and entrees.  High price--??-- matter of where you come from.we are from NYC and CT and the prices are reasonable. The trick is, the food is worth the trip and Katy and Joe really get it!!!!! We will keep coming back."}
{"text":"Went to Kindred for lunch with my son and a couple of work colleagues.  Very nice place - cool modern decor, friendly vibe, it just felt like I was going to have a good meal here.  The lunch menu is pretty straight forward.  The basics like sandwiches, salads, and light entrees.  It has a farm to table vibe.  I had the BLT, which was good, but hard to eat due to the thickness of the tomatoes.  It was nice getting big slices of heirloom tomatoes, but they kept falling out of the sandwich.  It made things a bit messy.  One other thing - I think they refrigerated the tomatoes, which made the texture kinda mealy.  It was a flavorful sandwich though.  I'd definitely be back, and for sure I'd like to tryout dinner next time."}
{"text":"We tried out this new Davidson restaurant last Saturday night.  It is a beautiful venue in a renovated pharmacy building with exposed brick, comfortable seating and a gorgeous white marble bar. Kudos to whomever planned and executed the renovation!    The scene was very lively with lots of great energy - total strangers were talking to each other at the bar and everyone was very pumped up. The drinks menu is really creative and was expertly executed by a knowledgeable and friendly bartender.   The menu is eclectic but had something for everyone.  We had some of the most delicious pork we have ever tasted, served with grits and a tasty sauce. The venison pasta was also delicious. My husband was delighted with the roast duck soup and I liked the mandarin salad very much. Do not order the duck fat fries unless you want to kiss your diet goodbye. They are the stuff that dreams are made of. The milk bread was also to die for and they served a very nice tray of cheeses with a surprisingly wide variety.   We ordered wine from what appeared to be a thoughtfully constructed wine list. We weren't familiar with too many of the listings but our waiter was and recommended a very good one for us. We thought the wines were fairly priced with selections in most price ranges.   The service was prompt, friendly and knowledgeable -  surprising, especially since they have only been open for a couple of weeks. All in all, it was a wonderful experience. We can't wait to return!"}
{"text":"Hands down the best restaurant I've been to in the Charlotte area. Everything we had was fantastic. Our server was friendly & helpful. He went over the menu, and made his recommendations. He came back with our drinks, & the milk bread. The milk bread was fantastic. Soft, warm, and salty. I am a fan, think this place is worthy of all the praise"}
{"text":"Best spot for a great lunch or fantastic dinner. A hidden treasure in Davidson. Every time we have gone the staff has been unbelievable. Thanks"}
{"text":"Kindred did not disappoint. The whole experience was a 5 Star. The staff and service was great. Extremely knowledgeable about the menu and passionate about menu favorites. I had the Tajarin, amazing venison. It was hands down one of the best meals I have ever had. The depth of flavors was spot on. The is one of those dishes you'll long for and dream about. Id post a picture, but I dove in before I took one. I can't wait to come in again."}
{"text":"The bad: Heard all the hype . Home for holidays. Made a point to dine there. Un impressed. Tables and chairs packed in too tightly...yeehaw! Chairs were the worst. Too small. I' am. 6-2 210lb. I couldn't get comfortable.  Menu is a jeopardy quiz for dining. Irritating.  I am a pescatarian .  They did not offer. a fish entree that wasn't  either fried or swimming in mayonnaise based goo. Yawn-Boring.  Everything was over salted. Over cheffed.   The good: restroom was very clean and well kept"}
{"text":"Easiest of reviews.  This place is excellent. I've been here 30+ times and I've never had bad food."}
{"text":"I went to this restaurant expecting tiny plates of food and to go home hungry (thanks to a Google review). However, that was not the case at all. They are definitely not super-sized portions, but after bread, a side of spinach, and their baked egg entree, I was too full for dessert.   The food was artistically put together. Though, instead of just visual appeal (which it had) the flavors were complex and complemented each other.   The only things that seemed a bit off were the very casual nature of the servers, the music (young indie rock), and the fact that they had run out of many things that we ordered and were later told we couldn't have. We're luckily laid back enough for none of that to have bothered us.  All in all, a wonderful experience with great food in a nice environment."}
{"text":"So amazing! The food is excellent, the wait staff is great with both small and large parties!"}
{"text":"Finally able to get a dinner reservation for me and the wife, but first sitting at 5 was the only choice. We arrived 10 minutes early to witness a crowd of assorted families and couples waiting on the sidewalk for their 5 seating as well. What a sight for small town Davidson. Promptly at 5 the door was opened and fortunately my Open Table request for an upstairs window placement was honored and we settled in.  Our female service person (Jewel) was promptly on our drink order and in bringing us their famous bread loaf. While warm and nicely tectured, we thought the crust was too heavily salted, so that part went uneaten. The inside is delicious.  For dinner, which are small plates meant to be shared, the wife ordered the Fried chicken, and the tagliatelle , while i had the gumbo and the smoked trout. The chicken dish was very good, moist white meat with a nice crispy coating. Her pasta was prefectly cooked and the pork based broth/sauce was very nicely flavored. My gumbo was tasty but perhaps too much influnced by the andouille sausage and duck, yet  i ate it all and mopped the bowl with a big chuck of bread. The trout was least favored as the smokiness was just too much for that fish. Service was great throughout the 90 minutes or so, and while the desserts  sounded great, we were \"just right\" and took a pass. It's nice to have an upscale dining experience in town and I'm sure we will return.  HINT... ask for upstairs seating unless you love the \"buzz\" of crowds and noise that defines the downstairs seating."}
{"text":"My husband and I finally made it out to Davidson to check out Kindred, after hearing such good things. It definitely did not disappoint.   We had made a reservation a few weeks in advance. I highly recommend this. I would like the note that the restaurant is extremely loud. The downstairs is just so full of people. Once noticing this, we requested a table outside, which was absolutely fantastic. Cute lighting, ambiance and we were not packed in like sardines. While waiting for our table, we grabbed two drinks from the bar. I got the bartenders choice (he made this apple pie concoction out of bourbon that was fantastic) and my hubby got a different mixed drink (don't remember the name but it was delish and reminded me of an Old Fashion).   Once we sat down, we were immediately presented with the absolutely addicting Sweet Bread. Pretty much demolished that thing. We also selected a bottle of wine for dinner. We got a Super Tuscan that was fantastic.   For dinner, we selected 5 things. In retrospect, we should have gone with 4 cause 5 (with the bread was a bit much). 1. Sweet potato curry soup- This soup fell flat to me. It was just not that flavorful and lacked any taste of curry. I would not recommend getting this soup.  2. Sauteed Squash- Fabulous dish. The sauce with the squash was perfection.  3. Duck fat potatoes- These were a bit addicting. I did not love the aioli with it but loooooved dipping them in the squash sauce! 4. Scallops a la Plancha- 3 decent sized scallops over a bed of corn and other veggies. The scallops were perfectly seasoned. 5. Squid Ink Conchiglie- This was my favorite. The sauce was a sea urchin butter and there was a good amount of shrimp mixed in. The flavor was just delish!  Overall, the service was great and it was a fantastic slow moving (and much needed) date night!"}
{"text":"Unlike so many of the relatively new restaurant raves and reviews, Kindred most certainly lives up to its \"reputation\"! We had wondered for some time if the drive from Charlotte would be worth fighting the I-77 traffic to try a new place that might be like so many of the other high profile places that do not live up to their hype. Our reluctance was quickly put to ease; the milk bread arrived and disappeared in a hurry! We all stated if the rest of the meal was as good as the bread, we were in for a treat! We ordered; we ate. We ordered again; we ate again. This kept on until we all vowed we could not possibly hold another bite! Wanting to bypass dessert, the waiter stated if we liked the milk bread so much, we should at least split a milk bread cinnamon roll. Thank goodness we did! Perfect ending to a perfect meal. The drive is worth it and we will be back!"}
{"text":"Tasty combinations, but also very disgusting at the same time. Meals are overly complex sounding but actually very basic.  I got scallops that were cooked well but served over a mound of mashed potatoes and cabbage fried in butter. My husband got radishes that were raw served over a mountain of pure butter and drizzled with beet purée.  The environment was very loud and we had to wait an hour for a table. We tried cheese and bread at the bar while we waited.  Then they charged $5 to have \"free\"  bread when we finally sat down at a table. Super tacky! I wouldn't recommend this place"}
{"text":"Mixed on Kindred.  I've been 6 or 7 times and initially loved it, but feel the service quality and ambiance have decreased along with the increase in hype.    Came with my parents to show off this place and of course had the slowest, most inattentive service I've had in NC and was a little embarrassed to keep telling my parents that this wasn't normal.  One of the prior times I'd come the wait staff gave us a card congratulating us on a house purchase, for example.    Menu options were the most limited in recent memory (no fish entree? Isn't there usually one?), cocktails are still fabulous and there are many dishes I still loved, but those have been on the menu (or similar) for the year I've been coming.  Anyway, I know I'm in the minority here but I'll stick with hello, sailor until the hype for Kindred dies down a little."}
{"text":"I want to thank the staff at Kindred for a great dining experience! It was our anniversary and I wanted to surprise my wife with a new (to us) restaurant that seemed to match our favorite style (food and interior design) and I have to say this restaurant was a perfect match. I called and talked to Kyle (and later another young woman at the front desk working that night) and they were a HUGE help-Kyle and I talked about what tables would be good for a special occasion and he told me about the restaurant since I had never been and wanted a great place for the big occasion. My wife and I were both impressed when we walked in-great vintage/modern design. Abby, our server, was also fantastic! Very friendly and explained the menu to us with enthusiasm. She was very attentive to our table but gave us time to enjoy our experience too. She was very accommodating to us and the perfect person for an anniversary dinner. The food was AMAZING-very nicely done small plates. Thanks so much Kindred (especially Kyle and Abby :)"}
{"text":"As a frequent diner, I was quite disappointed in the service my party received Friday evening. A  waitress (not ours) interrupted our meal to advise us of their dining policy that each table is roughly given 1 hr - 1hr 30min for each reservation slot & that we were quickly approaching that. Then 3 different servers/bussers came to the table & actually started removing plates & silverware while we were still eating! I explained it all to our waiter & asked for the manager 2x. No one ever came by but we did continue to get dirty looks from the other server, bussers & whom I guess to be a hostess. Regardless of the amount we spent ($300) no one should be so rudely treated at such an establishment."}
{"text":"This new little spot is perfect for Davidson! Owner operated so you know the service is spot on. The bread is amazing! Both of our small plates were very good. Pricy but worth it!"}
{"text":"This restaurant is so cute! We sat outside a couple of weeks ago and it was just a perfect night! Although we weren't a big fan of the raved about milk bread that they give you, everything we ordered from the menu was delicious!!  The dessert was great too! Wish you guys were closer to Charlotte so we can dine here regularly!"}
{"text":"The food and service was Excellent. My husband and I ordered multiple dishes to share and everything was delicious. If you're looking for a smaller restaurant with a nice atmosphere and great food Kindred is your spot. Not to mention we weren't sure what we wanted from the bar so we gave our waitress 3 ingredients that we liked and the bartender created \"special\" cocktails  for us. Do yourself a favor and check this place out!"}
{"text":"As my girlfriend would describe this place perfectly to a T: this restaurant is cool enough and the food is decent enough for me not to have to drive to Charlotte. But it is no New York or Chicago gastro pub. Their cocktails are awesome. I recommend the drink with the mescal in it. Can't remember the name but it is the perfect combination of smoky and sweet and flavor depth. Their beer selection is full of local and craft brews. I was very surprised to see Westbrook Gose on the list. Very nice! We ordered small plates all night and I don't really have any complaints except for the portion serving of scallops for the price. I will definitely come back. My only warning for new visitors on a weekend night is that it is very loud with a bustling amount of people."}
{"text":"Kindred is gorgeous, with fabulous food, and good service. What more can you ask for?  I won't waste your time trying to put it into words.  Go there, order anything on the menu.  You'll love it."}
{"text":"Food is great:  I thought the milk bread was slightly above average, not a crazy delicious bread.  The dishes are great, but small for the price. Look to spend about 80-90 dollars for 2 moderately hungry adults and 1 drink each."}
{"text":"Interesting food, great atmosphere, and great service. I like this place because there really isn't anything like this around the Charlotte area. I will definitely be coming back!  Oh, and MILK BREAD."}
{"text":"Lunch today with family before heading back to Dallas.  The  appetizers of warm olives and oysters did not disappoint!  The main course of buttermilk fried chicken salad was superb.  Dessert consisted of chocolate birthday cake.  The service was impeccable with Jaymin as our server.  We will be back !!!"}
{"text":"Hands down the best restaurant I've been to in NC. Everything was so good. It's hard to pick my favorite thing! They print their menu daily too.   The milkbread (thankfully, they took it off the menu and is now complimentary) came out when we sat down, and we were immediately blown away. Despite the generous portion, we easily devoured the croissant-like bread within a few minutes.   We ordered the squid ink cochiglie, the trout, the crispy oysters, and the potato and green garlic soup.  The crispy oysters were seasoned to perfection, not too greasy and just the right amount of crisp. The potato and green garlic had a nice peppered spice. The pasta was flavorful; the sea urchin butter gave it a nice seafood fragrance. The NC shrimp was so good and added to the flavor. Four dishes were plenty for 2.   No complaints here, they did everything perfectly, and I will definitely be coming back!"}
{"text":"My wife and I have eaten here several times before and were not disappointed this time. We had made a reservation, but a traffic accident caused us to be 45 minutes late. I telephoned and was assured seating would not be a problem.  The food and staff were fantastic. The only disappointment was the dark chocolate ice cream and benne butter cookies we had for dessert.  The taste and texture of both components were lacking. Even so, we would heartily recommend Kindred to anyone wishing to experience fine dining that is out of the ordinary."}
{"text":"Visited 8/29/15  My wife and I had the distinct pleasure of dining at Kindred this past weekend, and absolutely enjoyed every moment of it. Having been let down by several new restaurants of late, this is a dining experience that delivers.  It was a pleasant evening so we decided to sit outside and wouldn't have had it any other way. Though the inside looked fine (with most seating upstairs), dining alfresco was the right move.  It's been said before and I'm sure it will be said again - the milk bread is unbelievable. The best free-bread-delivered-piping-hot-to-your-table that you are apt to have. So soft and chewy, with a salt crust that is perfect. It was so good, we begged for a second loaf.  We decided to have a number of small plates. My wife started with the Heirloom Tomato and I had the Salumi - these were delicious starts to the meal. We augmented it with fresh Grandfather's Pickles and a bottle of chardonnay. We took our time and were never rushed. Attentive service for sure.  For our secondi, I had the Gnocchi with basil and garlic and my wife had the Squid Ink  Conchiglie with shrimp - both delicious. We ordered that second loaf of milk bread to sop up the delicious sauces with each.  To finish, I had the lamb loin with grits that was fantastic, and my wife had a tasty black grouper dish. They were both elevated dishes that demonstrated a mastery of flavor profile.  We will be back. Often."}
{"text":"You must try the cheese plate. It lists as a dessert, have it for an appetizer. Huge selection as they bring the entire cheese board to your table."}
{"text":"My wife and I came to Kindred for dinner for my Birthday Last week and it was probably the most memoriable meal I can remember in a very long time. We made a reservation for a Tuesday night not really knowing if we would need one but better safe then sorry. We arrived and were promptly greeted and asked if we wanted to sit inside or outside. We chose to inside because it was warm and honestly i wanted to enjoy every aspect of this meal. Our server came over quickly and introduced herself and asked for our preference on what kind of water we wanted. She came back with our water and then began to explain the menu and how to best approach it. Well we took her advice and ordered three appetizers which were amazing, the Crispy oysters were excellent and as the salami plate the country pate was excellent the mustard was so spicy which is exactly how i like it. we then both had a pasta course I had the squid Ink with Blue crab and Sea Urchin butter. The pasta was excellent the squid ink gives it a rich depth of flavor and then the broth of crab, butter and sea urchin just tasted of the salty sea. I reminded me of being home when we lived in Connecticut it was like tasting the ocean. My wife has the green onion Gnocchi and they were perfect light and fluffy and perfectly seasoned. Soo soo good after we stuffed our selves silly we decided to get one of the main dishes, we were both going to order larger dishes but decided we had eaten so much already that i was only going to get the baked egg. This was a wonderfully simple and well executed dish. it was simply an egg over white rice with onion sausage and cilantro and when it all mixed together with the egg yolk it created a nice sauce.  I almost forgot to mention the cocktails we both had a specialty cocktail they were well balanced and classic nice touch was that ice was a solid block chipped from a larger one, not just ice cubes from an ice machine. I would recommend this place for a special occasion or a date night, go through the menu and enjoy it all. the Menu is based on the seasons so some of the items i described may not be there but they are you should try them"}
{"text":"I have been on a quest to dine at Kindred for at least a year. The food was manna from heaven and lived up to all the praise I had heard!! We shared a variety of dishes:  Squid ink pasta with shrimp--my favorite dish! Scallops--mouth watering and tender Gnocchi with blue crab--savory seafood and homemade pasta Salami --savory charcuterie  Beef tartare--another favorite of the table Hamachi yellow tail and tangerines Duck fat fries--mm-good Milk bread---addictively delicious & worth ordering an extra for the table, like yeast rolls from grandma's Cocktail (like a negroni) -- they called it a s'one west or something aka \"yummy in a glass\", bourbon and campari and orange bitters. I loved the atmosphere and the quality of the service. I cannot wait to return and try more dishes. Truly one of the best dinners in NC!"}
{"text":"I've tried giving this restaurant two chances. Apparently the dinner is great and the chef is fantastic, but I haven't had luck with lunch.  Most recently, my husband and I went for lunch last week. It was busy, but not outrageously so considering the amount of staff they had working. We were seated immediately and offered water (we heard the people next to us being offered sparkling or still a few minutes later, but oh well). I ordered the burger and my husband ordered the shrimp po' boy.  I was really hungry, and the burger said it came with Grandfather's pickles, onion, cheddar cheese, and aioli. I picked the kale salad as my side. When the burger arrived I first noticed how small it was. Also, how the 2 square patties were identical to the hamburger patties at Wendy's. Still, I kept an open mind and ate a few bites. It was just bland. I opened it up and realized there was no pickles or onion. I asked the server for ketchup and my missing ingredients. She looked at my plate and exclaimed \"oh, they gypped you!\". She came back about 5 minutes later with a tiny container of pickles and said \"apologies, from the chef.\" I reminded her about the ketchup and someone else brought that a few minutes later.   The burger was boring, the kale salad was bland, and the server tried to take my husband's plate right out from under him when he still had good left, and I wasn't nearly finished! He said the po' boy was just fine, nothing special.  For such a pretentious, pricey restaurant, this was a bummer. Fool me once, shame on you, fool me twice, shame on me."}
{"text":"Seriously as good as it gets. Tried a number of dishes and ALL of them were epic.  Did you know food could be epic?  THIS food can!  Cocktails- beautifully balanced, flavorful, and unique! A friend I went with only likes tequila and and went with Bartender's choice.  Seriously excellent.    The bread.  My God. The bread!!! That bread is what DREAMS are made of.   Main dishes were superb.  I made a fool out of myself trying the duck fat potatoes.   The BIRTHDAY CAKE. I wish I had ever gotten a birthday cake like this. Incredible.  Go here; order everything you can; enjoy every bite."}
{"text":"ALOT OF HYPE. Ok, so I have heard and heard about this place and I think that that was the kiss of death for me. I heard many, many great things about this restaurant, \"Local\", \"Good Food\", \"Amazing\" are all things I have heard about Kindred. I have also been told by Charlotte natives that there are better places than Kindred. Well I finally got my chance to try the place for my self.   First off, I went to make reservations on Open Table at 10am, to only find out that there are no \"available seats\" till 9:30 at night. This was a little concerning, thinking that the place was all booked and I may not even get a seat. Well when we got there, there were PLENTY of tables and we only waited 30 seconds for the hostess to gather the menus and walk us to the table.   When we walked around, the place is super nice and cool. Very European feeling with an American sized building. The staff was friendly and they greeted us as we walked pass them. We sat upstairs in the window, which I loved. I like window watching all the hustle and bustle outside. Davison is quite busy.   Well I looked at the menu, which was smaller than I thought it should be. I started reading though it and overheard the people behind me talking to the waitress. They were explaining to her that they were leaving, because they did not see anything on the menu that they liked. This was a little surprising and concerning to me. I immediately thought, \"Is something up with the food they serve?\" After reading and reading and deciding, I decided to start with the $12 Crispy Oysters and the Burger. Now I like burgers, but I did not necessarily want a burger from a \"Farm to Table\" kinda place like this. Now I know they may not be Farm to Table, but thats the vibe that I got from the menu and ambiance. Nothing else on the menu really wetted my whistle. The oysters were good and the dill sauce was GREAT, really made the dish. The burger was OK, nothing too special, but good. Better than most places but not burger joint good. I personally have a problem with ordering burgers and the waitress not asking how I would like it cooked. Now this either means that it patty is frozen and they have to overcook it or they overcook it to cover their butts incase of e-coli.  The burger was good for 10$. Any more and I would have a real problem with the cost. The Oysters I thought were a little expensive but, then I don't know if they are fresh and have to be specially delivered or are frozen. Being from Charleston, I was not use to spending that much on oysters.   In conclusion, come here, get some food and if you like it come back. It just wasn't my cup of tea for all the hype I have heard about it."}
{"text":"I love Kindred! We were staying in Mooresville for the weekend and wanted to have a nice dinner so we ventured to Davidson for the night. I am glad we did! The atmosphere was great, the food was incredible and the service was so attentive. We had the milk bread (melts in your mouth), the Hamachi crudo, beets and the squid ink pasta. All were delicious!"}
{"text":"Milk bread. We would come back a million times if only to continue having the opportunity to enjoy the heavenly, goodness that is first brought to your table with a side of what we have deemed the best butter we have ever tasted.   My guy made reservations for us to have an evening together in Davidson this past weekend, and we made the 45-ish minute drive from the Ballantyne area... no regrets! The town was absolutely charming to drive into, and I was so excited when we approached the store front, because it reminded me of a gorgeous spot in CHS.   Our experience was fabulous from beginning to end- everyone who came by our table was so kind, and answered all of our questions for recommendations. A Tribe Called Quest came on, and we knew that it was going to be a good evening. I really loved the presentation, and how well they did to space out our various items ordered.   We LOVED the small cauliflower plate, and in general the sauces on all the dishes were just the right amount of flavorful! I wasn't blown away by the Trout.  We will definitely be returning to check out the lunch menu, and we would also love to come back and just try all the small plates, as we were too full after main dishes to try any desserts.   I was pretty sad that the sorbetto was all gone, and hope to come back to try some desserts :)  All-in-all we loved it, and we are also the type that really appreciate a good atmosphere. (Seriously, even the details in the restroom were gorgeous)   Was I blown away by all the dishes? No.  For us there are just other factors that played into us having such a great experience."}
{"text":"I'll start by saying, I am unfortunately writing this several months after we visited.  I still remember it was great though, so wanted to write a review while I could still remember some of what I ate :)  We had heard so much about Kindred, so made the short drive from Charlotte for our Anniversary in August.  I mentioned in our reservation it was our Anniversary so had hoped for maybe a 'Happy Anniversary' treat of some sort you often get at nice restaurants, but did not receive anything.  Slightly disappointing, but not a huge deal (although I still remember this months later).  Let me get to the important stuff.  Service was good, not outstanding but a solid B+.  Food was excellent.  My husband and I shared:  1-duck fat fries-they are fries so of course they are delicious.  I think I would skip it next time though to try something else.  Not something so unique I'd have to try again  2-crispy oysters w/ dill-now this was AWESOME!  My husband who does not really like oysters even loved these.  Definitely would get these on a return visit  3-one of the homemade pasta dishes.  I wish I could remember which it was but I remember really enjoying it.  So sad I can't remember the other dishes we tried.  I am sure we had a fish or scallop dish.  Guess this means I just have to go back to try what is in season now.  We also really liked the free milk bread :)  Everyone seems to absolutely rave about it and it was good, but I don't think I liked it quite as much as everyone else here did.  Although...I'm sure when I go back I will have no problem polishing it all off!"}
{"text":"Great for a special occasion. The highlights for me were the gnocchi, lamb rigatoni, octopus, squid ink pasta, squid lettuce wraps, and the table bread. I wasn't as crazy about everything else (we tried the majority of the menu), but that's more a matter of preference. It's really good food and service"}
{"text":"Took my husband here for his birthday after getting a recommendation from someone. The bread did not disappoint-it was amazing and we ate it all. Our reservation was for 9pm, and they were out of a few of their dishes. We ended up getting the buttermilk fried chicken, both were awesome. We then ordered 2 more plates, a tagliatelle ragu and squid ink pasta with shrimp. Both were just okay. We chalked it up to it being the end of the evening. The pasta itself however, was homemade delicious. Thought the atmosphere was great, our server was wonderful and the restaurant overall was really nice. My only complaint (and it has nothing to do with the food or service)-there was an extremely obnoxious table upstairs, and they were obviously affecting the meals of all the other patrons up there. Wish a manager went over and politely tried to tell them, as it went on for well over an hour.  Can't wait to go back and try the  dishes we missed!"}
{"text":"They now serve lunch!  I am stoked to hear there's a great option for lunch in the area now.  They were pretty busy when I came in but I was still greeted and seated promptly.  Since I went solo, I just sat at the bar.  I drooled at the ridiculous bourbon selection, but I'm not really that much of a day drinker.  They have a pretty diverse lunch menu, but not overwhelming by any means.  I was told that the shrimp roll was a favorite, so I ordered that along with the frito misto and a little cucumber salad.  My bartender was great company as I waited for my food, which I didn't have to wait long for.  The frito misto was fried up perfectly.  Not too greasy, not too much batter.  I scarfed it down pretty quick and my shrimp roll came soon after.  This was some high quality shrimp.  Great texture.  Not too much mayo on the roll.  Up there with some of my favorite lobster rolls.  I washed it all down with the house ginger ale on tap.  Really a great meal.  This place is by far my favorite restaurant in the Lake Norman area, and I highly recommend it."}
{"text":"Excellent service and really great food. Small plates give great variety. The Salumi was amazing, great spicy mustard. Buttermilk fried chicken, gumbo, and Brussels sprouts were all good. Tile fish over harvest vegetables was the best dish of the evening. Santiago cocktail was truly top notch. Ambiance quaint and modern. All three pastas were excellent, the bolognese tagliatelle was by far my favorite."}
{"text":"I was a bit nervous to try Kindred. I have read/seen so much hype on the internet, I wasn't sure it was going to hold up. Let me tell you, Kindred delivers. From the moment we walked in, until we left, everything was fantastic.   We were lucky enough to get a cosy table on the second floor by the window. The meal starts with fresh, hot, milk bread showing up as you peruse the menu. The bread is so good.   We opted to have the bartender whip us up some off menu cocktails. We   both picked bourbon as our spirit. Each drink was unique and fit what we'd shared we enjoy.   As far as food - we ordered a bit on the light side, only 4 dishes, but we were both plenty satisfied and full. Everything we ordered was amazing! The flavors were simple, but spot on. By far, the best things we had were the cauliflower with pecorino and the squid ink pasta with uni butter. Amazing. We finished with a slice of birthday cake. I feel cake can be hit or miss, this was perfectly sweet and very moist.   I also worth noting that the wait staff is top notch, very kind and attentive.   In conclusion, trust what you've heard, this place is wonderful."}
{"text":"I liked it a lot, very chill environment, bartenders are up on their game with the mixology of drinks served. Also 2 thumbs up for serving only local craft beers. I look forward to coming back again.  Nice job on  the renovation, the new interior design reminds me of a small PHILADELPHIA Northern Liberties area themed restaurant."}
{"text":"Delicious. Had dinner here on a Friday night with my husband and 14 year old son. We shared charred green beans, crispy squid lettuce wraps, oysters, salumi, plum salad and several pastas. Really good food and a relaxed atmosphere. Service was attentive and cocktails yummy. Finished with plum tart and a cinnamon roll   Sooooo good"}
{"text":"Outstanding! Great customer service. Beautiful decor. Upscale yet casual. Interesting food and beverage. Knowledgable and attentive staff. Bravo!"}
{"text":"Let me start by saying none of my pictures do these dishes justice. It's so hard to get good food pictures in restaurants with dim/quiet lighting. The atmosphere was lively, the people around us were happy and engaged, and the service was exceptional. All in all, I have a very high opinion of Kindred, and would recommend it to anyone.  This restaurant is a must if you are ever in the north Charlotte/Davidson area. It's adorable and cozy, yet trendy, located right off of Main Street in an old pharmacy building (photo borrowed from Bon Appetit). Go early for a cocktail - Their bar is absolutely beautiful.  When I asked the waitress about what's the most popular, she had a great answer, listing what is the most ordered on the current menu but reinforcing that because they operate off of local and seasonal ingredients, their menu is ever-changing. My favorite kind of place.  I love how they treat their guests with complimentary milkbread. I was prepared for this having done my research, and they're even so kind as to share their recipe in Bon Appetit.  Oh, by the way, did I mention they were listed among America's top restaurants of 2015?  The milkbread is a fine fusion of light and flaky crust, similar to a croissant, yet the honey, sweet finish on top with sea salt gives it a pretzel taste. You can't compare it to anything really; it's one of a kind.We then ordered the vanilla scallops with blood orange. These may have been one of my favorite dishes of the night. The vanilla creme was thick and an awesome accompaniment.  We also had the fried oysters, on account of recommendation. There's a pretty generous serving size for this dish, and while they weren't my favorite, they were definitely good. I would prefer more oyster:fried batter ratio, personally. Next up was the Wagyu Beef Tartare, which is one of the more popular dishes. The mushroom and katsuobushi flakes were amazing and provided a light crunch to the umami taste of the tartare meat. I wouldn't have normally ordered this dish, but I'm glad I was given the recommendation because it turned out to be incredible. Great twist, Kindred.   For dessert, we wanted the cinnamon ice cream and butterscotch cookies, but unfortunately, they were out, which was a bummer. Instead though, we got to try the infamous chocolate birthday cake (baked fresh daily). I love this dish just for the authenticity of it. How many restaurants bake fresh chocolate cakes daily and have pieces always available? THIS ONE. This is a standard on their menu so I would recommend ordering it if you have that sweet tooth after dinner.   Overall, hope to be back to Kindred sooner rather than later."}
{"text":"We went here for my husbands birthday. It is a great place, ambience is lovely. We had one of the Pimms cocktail, it was really really good. We also had the Golden Beets, Cauliflower, NC Flounder amd the Ravioli. They were all soo delicious! The food was a bit much for the two of us. Since the plates were small, we thought we would need two each but unfortunately we didn't get through everything. Definitely recommend this place for an occasion, you will love it!"}
{"text":"Wonderful!  Came after seeing The Best of the Best Southern Living Magazine rating it #1 restaurant in NC and #4 in the South.  Our server was awesome!  Food came out quick and wow was it awesome!  We had a large party at lunch!   Sampled the Caesar, fried oysters were to die for!  The shrimp roll was good.  The buttermilk fried chicken salad was good but wish the chicken was white meat!  Or better yet wish we'd have gotten the fried oysters on the salad instead!  The pickles were a bit too vinegar-y but the warm olives and the cheese tray with the bread were great!  Wish we didn't live so far so we could frequent it more!"}
{"text":"Came here by recommendation during our visit to Charlotte and it did not disappoint. We tried the pork shoulder and the shrimp roll along with frites and grits. Everything was fresh and tasted fantastic. The interior decor felt a little mid century and the service was great as well."}
{"text":"Kindred was a disappointment.  In spite of making reservations  several weeks in advance, we were seated at a table across the bathroom and next to the bussing station. We ordered 6 plates to sample the menu. The food was good but not deserving of the local hype or a James Beard award. Three out of the six dishes were too salty. The birthday cake was served beautifully but tasted like a grocery store cake. It was odd that sliced bread was served at the end of the meal with the check and not with the 2 pasta dishes.  I would be hard-pressed to visit again."}
{"text":"Amazing restaurant! The atmosphere is a mix of urban and southern! Davidson really needed a restaurant like this. My favorite items were the crispy oysters and the baked egg! Also can't forget to mention their \"milk bread\" made in house by their very own pastry chef. For dessert there was \"birthday cake\" on the menu... complete with sprinkles. Highly recommend this place. It's a great way to try new tastes and it's right in Downtown Davidson."}
{"text":"The inside of the restaurant looks great, the staff is friendly, but the main reason I came here today was to try the food everyone seemed to love. For starters we ordered fried oysters and a small Caesar salad. The oysters had a crazy amount of pepper on them, and the sauce they came with was extremely overpowering, so there was no oyster taste, whatsoever. Caesar salad was ok, but was cut up too small, so it tasted soggy and overdressed. The entrees were avocado sandwich and fries. Super tiny portions, which I don't even mind, if the flavor is there, but they tasted super generic. We also had two sides of fries, which came with a ton of inadable burnt pieces and once again a ton of pepper. Buttermilk ice-cream was semi-melted, and had more of a semifredo texture. Snickerdoodle cookies were also only ok. The coffe I ordered was decent. Overall, I don't feel like you'll be getting food that's worth those prices, and the price you'll be paying is mainly for a gorgeous location."}
{"text":"This is a great restaurant from start to finish. Excellent service and everyone is very friendly. The food is outstanding. They were very accommodating to my dairy and gluten sensitivities. We will definitely be back."}
{"text":"Kindred has been sitting in my bookmarks for over a year now because I live in closer to SC. I finally made the trip and I am happy to say it was worth it. I doubt I'd go back unless I'm in the area because there a a few comparable places that are much closer. I do enjoy farm to fork restaurants that always have new dishes to try.  I reserved a table of four Thursday night. We got there 30mins early to check out the bar and they actually had our table ready ahead of time. Infact I saw plenty of empty tables that filled up within the hour. I appreciate good scheduling vs over booking to cram as many guests in and out. There was definitely no pressure on how long we dined either.  We did end up grabbing a drink at the bar while waiting on our friends. Very simple design and inviting ambiance. Good conversation with the master mixologist. We ordered off the cocktail list and really enjoyed the rambler. Our table was upstairs which had the same simple and clean design. One of my only complaints is the chairs. PLEASE INVEST IN SEAT CUSHIONS. All of us had numb behinds lol. It does get noisy but I'm sure it's due to the buildings layout.  I finally got my hands on some milk bread! Super soft delicious bread with a salty top similar to a pretzel roll. Top marks for pretty much everything we ate. Their cheese board has really good selections too. Our server also got us and off menu butternut squash that ended up being one of my favorites. I was surprised to learn they are actually a tapas style resturant. We had two of a few things so the four of us could share. For instance the scallop plate only has three scallops. It was hands down the tables favorite. The waygu tartare was the only dish that left us puzzled. You really couldn't taste the tartare over the strong pico de gallo like topping. It tasted good but the Mexican style dish didn't suit any of us. It didn't pair well with the rest of the winter based menu.  Several cocktails later we ended the evening with birthday cake and pumpkin cheesecake. Both were good but the birthday cake won with its sugary frosting. It definitely reminds you of a tradional birthday cake you would have as a kid. Overall the service was exceptional. I can't say that any menu item really blew my socks off though. Great dining option for north Charlotte."}
{"text":"Visited Charlotte for the weekend for a quick getaway for our anniversary and found Kindred highly recommended from several sources. We ordered the little gem lettuces, the fried oysters, the squid ink pasta and the fennel sausage rigtoni pasta, and a white Austrian wine. The milk bread was some of the best bread we've ever had and wish we could've ordered some to go. The salad and pastas were definitely salty, especially the rigatoni. However, the flavors of all the dishes were excellent--especially the squid ink pasta. Although we waited about half an hour for a table even with a reservation for 8:30pm, the actual table service was impeccable. We appreciated their kind nod for our anniversary as well. Overall we loved the vibe: a friendly, warm environment that offered a level of unpretentiousness service that rivals some of the best I've experienced. For their kindness and bread alone we would return."}
{"text":"I've been here many times and have never had a bad meal. Not even close. The food is beyond delicious, The service top notch and cocktails are crafted to perfection. I don't even have to season my food which is really saying something bc I am particular to the flavors that I love. Great for lunch or dinner, but make a reservation if you're going in the evening. This place is always busy for good reason. It is worth every bit of the hype."}
{"text":"Service is outstanding.  I just wish the food was better.  They seem to use fresh ingredients but almost everything is lacking in flavor.    The bread is the only thing that made me say WOW. This is one of the most overrated places I've ever been."}
{"text":"The food, atmosphere and just all around experience at Kindred is top notch! I have only come for work dinners, but it has given me the chance to try just about everything. The cheese platter is perfection with a wide variety of cheeses, the pasta's are done just right, the milk bread is so good you could easily fill up on it before dinner and the desserts (chocolate cake and milk bread cinnamon roll) are to die for! I can't wait to take my husband here and see what he thinks!"}
{"text":"Bon Appetit don't lie, y'all. This place is the bomb diggity. Amazing food. Good drinks. Friendly service. Classic cute downtown Davidson location. Perfection.   The milk bread is amazing. The scallops have been wonderful every time we've gone. The squid ink conchiglie is good, but I'd prefer it with a different sauce (we got blue crab and sea urchin) to cut the taste of the squid ink a bit. The gnocchi is always amazing -- perfect texture, melt in your mouth good. If you haven't had their duck fat potatoes with garlic aioli, you haven't lived. The chocolate cake is solid, but next time I want to try their cinnamon milk bread dessert. The best part of all of this is that their menu is constantly changing, so from day to day you won't have the same thing twice ... but you won't be sad about it!  This is exactly the kind of food, drink, and service I've been hunting for since moving away from DC, and I'm thrilled to have found it in Davidson! Kudos to the owners for stepping up what it means to be a great restaurant in the Queen City, and I'll cross my fingers that more fantastic restaurants set up shop nearby to keep up with the Joneses (or, as the case may be, the Kindreds).  P.S. If you get seated upstairs, it's REALLY cold, so bring a sweater or afghan or snuggie."}
{"text":"A small journey required for Charlotteans who dare to venture along this path... to Davidson! I tend to get stuck in my Charlotte bubble, but have heard infinite praises about Kindred and had to make my way. We had a group of 4 friends, bountiful appetites and high expectations after waiting nearly a MONTH for a reservation. If you've never ventured to Davidson, I'd recommend you make a day out of it. Grab a beer at a local brewery, eat at kindred and grab some treats as you walk down this adorable little town. SO. WORTH. IT.  As we sat down, we noticed the menu in front of us is ever changing and timestamped. To any foodie, this means the menu changes depending on the creativity of the chef and the local produce he or she is able to attain... aka yay! We ordered about half of the items on the menu to share and naturally, finished every last bite! We ordered: Grandfather's Pickles, Creamed Greens, Broccoli a la Plancha, Duck Fat Potatoes, Salumi, Hamachi Crudo, Wagyu Beef Tartare, Crispy Oysters, Sheepshead, Ravioli and Squid Ink Conchigle. Make sure to stir the Squid Ink dish before you eat! One of the table favorites is definitely the complementary, fresh baked bread brought to the table. FYI, if you'd like another one (which of course, we did), it costs $5 (and is oh so worth it). For dessert, we had the sorbet to (lemon) and the Chocolate Birthday Cake. While I wouldn't recommend the sorbet and am not much of a chocolate cake fan, I highly recommend the meal. The dishes are tapas and pricey, but experience well worth the wait.  Every dish is unique in flavor and ingredients, but my favorites were: 1. Duck Fat Potatoes 2. Broccoli a la Plancha 3. Wagyu Beef Tartare 4. Squid Ink Conchigle  Would not recommend: 1. Sheepshead (overpriced and not worth it for me) 2. Ravioli (stuffed with cured meat and was too salty for my liking)  3. Sorbet (looked a bit sad when it came to our table and nothing out of the ordinary)"}
{"text":"Had lunch at Kindred Saturday. Everything was excellent. Service excellent. Ginger beer excellent. Bourbon options good. Fried oyster app was incredible as were the olives."}
{"text":"The wife and I along with another couple made it up to the Davidson area to check out Kindred. The menu looked appealing and I had read the reviews, so I needed to check it out for myself. I had never been to Davidson before so it was nice to see what the area had to offer. I will say that it was a little bit of a haul up there from Charlotte, but ultimately worth it.  Our waiter promptly figured out the temperature issue as the wife was freezing as we sat down and we were off for a great meal. Soon the milk bread arrived, and we got to see what all the raving was about. We're fussy about our bread and this one was great. Our friends showed up a little late due to traffic, but we all got together and decided what we were going to share for appetizers. We chose the charcuterie, scallops, duck soup and crispy oysters. The house made charcuterie was great, especially the soppressata and the nduja. Scallops and soup were also packed with flavor, while the oysters were just alright, but I do prefer my oysters raw. Still it was a great start.  The next course involved 3 awesome pasta/noodle dishes. We shared the mushroom ramen bowl, ravioli and raviolo. Now the difference between ravioli and raviolo is that the former is several small pasta pockets with filling material, while the latter is a single large pasta filled, in this case with an egg and labneh. Labneh is a Greek yogurt/cheese and it's commonly flavored with lemon and this version was intensely lemony for me. That was the only drawback for me as the lemon was too strong, but the raviolo was popular at the table along with the ramen and nettle ravioli.  I almost forgot to mention that we got a free little sample of the hamachi crudo as a gift to the table as well as an order of duck fat potatoes. Maybe we were still looking hungry. Our server mentioned that it was because of the wait, but we didn't really notice any lag in the good delivery. Either way, we still split 3 entrees to include flounder, the baked egg and pork arista. The baked egg was like a fried rice dish in a small cast iron and it was a table favorite. The soft cooked egg was mixed with the rice, mushrooms and other ingredients. The pork arista is basically a thick cut pork chop from a larger roast that was seared to perfection. The flounder had a nice presentation as well.   Of course we had to round off the meal with a little dessert. We split the apple galette and some sorbet, tangerine and lemon flavors. Again, the lemon was a little too powerful for me, but the tangerine was perfect and they had me at apple galette.   So overall it was a great dining experience with great service. The beer list is nice with some variety and the bourbon list was decent with some nice options for 3 serious bourbon drinkers being at the table. The only thing that was maybe lacking was the quality of my mixed drink, but others at the table enjoyed their mixed drink. I will admit that I'm either fussy about my mixed drink or  I might not just be a mixed drink kind of guy. The bottom line is that I see myself returning often, making the drive up to Davidson worth it. Kindred is easily the most exciting restaurant and restaurant menu that I can recall in recent memory in the greater Charlotte area."}
{"text":"I flew out to visit my family for the holidays and as soon as I saw the offerings of this delightful little restaurant I knew I had to visit.   The way that the menu was structured reminded me very much of my home base in the Bay Area and lo and behold, the owners worked in San Francisco for a time.    I was eager to see how they were showcasing local traditions and seasonal ingredients and I was not disappointed.    Our party ordered the following:  House cured ham and gruyere sandwich with arugula, pickled onion and  mustard.  NC shrimp roll with meyer lemon and tarragon Buttermilk fried chicken salad with heirloom carrot, bacon, cucumber radish Kale and green curry spiced cashew salad with cilantro buttermilk dressing. (as a side) Frites with aioli (side)   Everything was absolutely delicious.  I had the house cured ham sandwich and kale salad side.  The ham was shaved at a medium thickness, a bit sweet, not too salty, super flavorful and warmed through before it was added to the sandwich.   It was a decadent sandwich but the pickled onion and arugula brightened everything up and serving size was such that it was just enough.   They also bake their own breads and the baguette was wonderful.    With it's light dressing and crunchy, slightly spiced cashews, the kale salad was the perfect accompaniment to the ham, as well as my mom's shrimp roll.     While I didn't get to try it, and unfortunately didn't get a picture, the fried chicken salad looked amazing as well and my Uncle was quite happy with it.    I did take advantage of the bartenders choice cocktail, however, which is always a lot of fun.  It's like a choose your adventure game for grown ups.   I asked for a spirit forward, gin based drink and received a light, refreshing lime-scented concoction that was perfect for lunchtime.    My uncle tried the Pen and Paper, a rum cocktail with a frothy layer on top that was flawless.  Service was knowledgeable, friendly and prompt without being rushed and the ambiance of both the restaurant and the surrounding area of Davidson is absolutely charming.   Plenty of parking in the lot right behind, as well.  Kindred really strikes a lovely balance of casual and refined and I'm quite sure if I lived in the area I would be stopping in regularly.  Next time I'm out for a visit, I'm definitely going back for dinner.     Two thumbs up!"}
{"text":"Finally got to try this place after months of hearing the husband rave about it and driving me crazy with tasty looking meals! After eating here, it's hard to say what's best, the food, service or atmosphere.  We didn't have reservations so started at the bar for a quick cocktail. I didn't mind, as it gave me a hot minute to check out the bartender's skillz. Both of our cocktails were absolutely stunning and carefully crafted. You really get the feeling that these bartenders take spirits seriously!  We were shortly shown to our table and embarked on our fabulous meal. Of course, we started with the milk bread and, of course, it was absolutely amazing. The husband did not want to stop after the first loaf, but I eventually convinced him to leave room for all the tasty plates we ordered! We started with the hamachi crudo and beet ravs. The crudo was a super interesting combo of flavors and was super tasty. The ravs had a sweet potato filling and were topped with a rich creamy sauce. The pasta was beautiful and delicious.  We also ordered the bucatini w/clams and gnocchi, which we could not pass up after our waiter described it as \"offensively good.\" I agree, I was quite offended that I have not experienced such light, pillowy gnocchi before! And the flavor of the blue crab in the dish was incredible - pungent and divine.   Ya ya, everything was beyond tasty, but what also stuck with us was the amazing, gracious hospitality. Everyone we came across was so nice and actually seemed happy we were there, despite the fact that they were super busy and we lacked reservations!   But, there was also something else. My husband throughout the meal kept on commenting about that bread, I don't think he could stop himself! As we were wrapping up a waitress presented us a bag tagged with his name. I immediately peeked inside and discovered a loaf of the fabulous bread. I was so touched, but it got even better. In the car, I opened the card, it was personal and contained details unique to our experience. Such an amazing, special, and heartwarming gesture!  I am a fan, think this place is worthy of all the praise and am already dying to go back!"}
{"text":"It's been almost a year since my first visit and I have made it a point to come back multiple times to give this restaurant a fair shake. I have to say my opinion has changed. They have clearly listened and while this is still an expensive place to eat, the portions are now at least fairly sized. My previous rating was based not on the fact that it was expensive, but because I thought it was a bit obnoxious what they were trying to charge for the portion sizes. It's better now. Still I'm not totally blown away by the food overall, but it is very good. On the positive side, the cheese platter is incredible. Also I have been for lunch multiple times and have really enjoyed that. Very fair prices at lunch and the burger and the ham sandwich are fantastic. I have found the pasta dishes at dinner to be good but not great. Same on the other dishes - good but I haven't been blown away. Atmosphere is excellent and the bar always seems to be happening. Overall it's a great place to have in Davidson."}
{"text":"Very nice indeed... the bread is great and the enemy as one can eat too much of it..  very interesting and enjoyably brief menu....   Service is second to none ....  all in all a gem ...  go..   SC"}
{"text":"I went into the restaurant to buy a gift card for someone but changed my mind because the music was WAY TOO LOUD!    I knew that my friends wouldn't be able to have a relaxing dining experience (or a conversation) so I will buy them a gift card elsewhere."}
{"text":"When you learn of a restaurant's acclaim in something like Bon Appetit or Food52, with extremely kind mention of an infamous bread program, my interest is piqued beyond the norm. I remember the first time I read the article in BA magazine about Stephanie Detweiler's milk bread -- I immediately set out to gather all needed mise en place to bake it in my own oven. Upon seeing the photos of her craft, trying to recreate it myself, and yearning after more and more perfect loaves of the aforementioned, I couldn't wait to visit Kindred.   Fast forward seven months or so and we're sitting on the second floor overlooking main street for our 4th anniversary. Kiddo in the highchair, champagne in our glasses, and a loaf of milk bread at my fingertips. Tearing into that melon-sized loaf was like fireworks. I wanted to strike up the band. I needed an old priest and a young priest. I wanted to thank the academy. With very depression of the crumb between my fingers I studied and studied. Almost in shock of how bafflingly soft it was. Paired with the rich flavor and flake salt, the awe didn't cease throughout the course of our meal. My hat is off to you, Kindred and Chef Detweiler. My goodness.   Pertaining to the rest of our visit, it was spectacular. Abby was the most hospitable server in taking care of us on such an occasion whilst being so kind to our little boy. The food was delightfully presented with gusto, complex with bold flavors, and portioned with the careful precision of a tweezer-wielding Chef de Cuisine. The Buttermilk Fried Chicken lacked nothing -- a salted, Southerner's dream amalgamated to just a mouthful. It was all that was needed.   As for booze, I'm not one to do as much as sip at a small, potent concoction for the entirety of a meal. The Bartender's Choice was staring at me plainly from the face of the menu. The dapper gents at the bar whipped up a mighty fine option replete with citrus and enough astringency for yours truly.   Finishing with dessert was a must! Buttermilk Panna Cotta and an Apple Galette. We only needed a few small spoonfuls to savor the complexity of the galette. Every small bite produced a new bouquet of herbs and spices. The candied thyme atop the ice cream set everything off. The Panna Cotta only produced smiles. Happy to report that you have a mighty fond 10-month-old, Kindred.   We left with satiated appetites, a very happy memory, and two loaves of milk bread under our arms with thoughts of \"I can't wait to return.\"  Pro Tip: Take a look at the bar menu and pay close attention to the \"Round for the Kitchen.\" This group of guys and gals deserves a cold one. I'd love to have a beer with this group in person, but this is the next best option. HEARD!"}
{"text":"Simply put, I love food. And the food at Kindred is amazing. It's thoughtfully prepared and the quality is outstanding. We had reservations for a Tuesday night and I think it was good that we did as it was busy. We were seated by a large party which was unfortunate, but our server (we loved Jack) and the rest of the staff and the food totally made up for any disappointment over the noise. Their milkbread which comes out first and is shown in the pic is so darn good it was hard not to eat it all. We then got the duck fat potatoes (shouldn't everything be cooked in duck fat?!?) and the beef tartare. Just absolutely scrumptious and they crisp up mushrooms with the beef for texture - brilliant! We also had the pork saltimbocca and the gnocchi with crabmeat and there was not a morsel left on our plates. It was my sons birthday and the chef gave us our Apple dessert on the house - again how wonderful! - and it was like an apple pie on crack with the most amazing caramel sauce. Go here for dinner as soon as you can. You will not regret it!!"}
{"text":"Terrible terrible terrible. Ordered chicken Caesar salad.  Oh my god.... Anchovy came with my chicken.  Chicken was very dry.  The anchovy just made everything even worse.  Nasty.  Service was okay. Not going back there."}
{"text":"A restaurant that is out of place but not at the same time. Who would of thought a small town would have held a gem like this.. Then again, Davidson does have a charm of its own.   Decor- Stylish  Food- Brave and simple  Milk Bread(gets its own category)- Amazing  Drinks- On par with the best mixologists in Charlotte. Try the Pimm's cup.  From all the things I have eaten here, the ham tartine is my favorite for lunch and for dinner their ravioli(changes seasonally) is the tastiest.   When you walk in you get a smile and a greeting. Throughout the dinner service we were treated very well and have been back a bunch of times.   Try it."}
{"text":"Best cinnamon roll game around.... I am not ashamed to say I ordered the cinnamon roll, the whole roll,  and some wine for dinner and was soooooo happy!!!"}
{"text":"Wow. Just Wow. Kindred has been on our wish list for some time, and after finally picking a weekend and making reservations (about 2 weeks out I might add) we made the 40 minute drive to Davidson and were glad we did. Definitely a top 10 dining experience for us.   First off, be bold and explore the drink menu. My wife was braver than I was and went with the bartender's choice. You essentially tell the bartender (super friendly guys) what you like and they make something up for you on the spot. They did a great job with her pre-dinner drink and mine, which was essentially their take on an old fashioned. If you are real fancy, go for the champagne of beers. I highly enjoyed watching miscellaneous men order these 7 oz glass bottles of miller high life for $1. Then again, for the price maybe I made the poor choice.   Pro tip - sit outside if it is a nice day and you can. The inside is all hardwood and tile and tight spacing between tables. The end result is a very loud dinner. The hostess was very accommodating and we ended up waiting an additional 10 minutes to sit outside, but the ambiance, noise, and space was totally worth it.   For the meal, think small plates, but bigger than tapas. We ended up choosing 5 plates, which was more than we really needed with the bread. Yes - the bread is amazing. Other highlights for me included the sauteed squash, duck fat potatoes, and scallops a la Plancha. We ended up splitting a bottle of wine with dinner (a super tuscan) and found the bottles to be reasonably priced.   Overall, a great date night experience for us. For a special occasion, I definitely see us coming back!"}
{"text":"Cool atmoaphere, great looking food (I only had drinks),  and great drunk selection. Directly across from the University. Had a great time! The waiter seemed to have a little attitude when I told him I would just be having drinks, but other than that I had a blast with my date : )"}
{"text":"The poor over coffee is too expensive for what you get. I LOVE the Caesar Salad.....probably my favorite. Its the Real deal( with no anchovy). I would say its my favorite dish and i go there for lunch regularly just for the Ceasar. They make the best croutons, the Castelano Olives pair well with the dressing although i think they need to add more lettuce and make it a little bigger as i like a big salad and nothing else most times. Ive been in with a friend for dinner twice. I absolutely LOVED the superstar dish....the squid ink pasta dish. it sounds like it would taste fishy but NO, its truly perfect. The pasta is \"El Dente\" perfecto in bite/texture and the sauce is 'cant get enough\" good. Also appreciated, was their shrimp salad on Brioche bun with side Caesar of course. The other things I've tried there weren't quite as good..(like the pickles. They are too astringent with white vinegar which i think should stay out of the kitchen and into the cleaning closet....as i prefer the more rounded wholesome flavor of Apple cider vinegar for dressings)....but i like the fact that they pay attention to quality and support local farms are always coming up with new exciting recipes. Having traveled extensively, i can say that overtime I've looked at the menu, there is always some new term or flavor combo that intrigues me. The Hamachi crudite with mandarin orange slices will be next on my list of possible choices. I rarely eat animal products and wish that they would extend their options for vegan food options that are just as complex and interesting. I've noticed that most restaurants in North Carolina seem to have all kinds of meat and cheese loaded onto their \"salads' and menus pay little attention to vegan choices. (vegan doesn't mean tofu people FYI) Larger Organic Salads !!!!!!!! i should have to pay twenty bucks for two salads just to get full. The decor is nice around the bar with the white tiles and Merkaba lights. Located right across from Davidson College, you can go for a stroll along the town before or after. Although I'm not much of a drinker at all....i do appreciate the fact that they have a good wheat beer on draft from time to time."}
{"text":"This place is such a great addition to Davidson. Great drinks and very fun and creative food. It's The bomb!! Go here ASAP!"}
{"text":"Been swingin in this place every once in awhile and they are always booked so make a reservation! I was super excited to come here and have heard amazing things about the food. And the food is PRETTY FREAKING AMAZING!!!   Get the Grandfather's Pickles, its a great way to balance everything else you order. We also got the Crispy Oysters which were not fishy at all and very crisp. The Brassicas were PHENOMENAL and I can eat bowls of that stuff. The Annatto Bucatini is delicious as well and so was the Smoked Trout Milanese. What makes all these dishes so great is their sauce. They really know what sauces to pair with their dishes and it ends up tasting perfect.   Food is great but what wasn't great is having to wait 20+ minutes in between dishes for the next dish to come out. I wonder how long it would've taken if we told them it was okay to have all the dishes to be brought out at once. My next issue is the prices. Okay like tell me why the Bucatini portion size was so small when it was $19?! It was like a snack size to me. I understand the idea of quality, but it is crazy to charge $19 for a small bowl of pasta. I could get like a surf and turf somewhere with that! It's just so good that I wish it felt like I paid that much money for something that I should be getting. I will be back though because the food is just that good."}
{"text":"I'm a snob from San Francisco and I thought it was incredible.   Super friendly staff and amazing interesting food.   I had the fried chicken which was boneless dark meat. Super tasty and crunchy.   Also had the blue crab gnocchi which was rich with great texture and lots of crab   The bread they put on the table with the salted butter almost ruined my apatite it was so hard to stop eating.   Decor in this place is so awesome. Looks like a design within reach catalog turned restaurant / bar.   Bar has true mixologist who loves the craft.   Sad this place can't exist in San Francisco because the  servers and bartenders could never be as nice and the prices would double.   Glad Davidson is getting more awesome."}
{"text":"I've only eaten here at lunch so I can't attest to their dinner menu - with that being said, I wish I could give this 3.5 stars because it's higher than \"a-ok\" but I wouldn't consider myself a fan.   The restaurant itself is absolutely beautiful - whoever designed this place is a genius.  The food was pretty good. Not the best I've ever had, but definitely pretty tasty. This most recent visit I had the falafel, and before that I want to say it was an open-faced ham sandwich.. can't quite remember. This place is definitely not for the simpletons - there will be things on the menu you have never heard of and probably need to Google. Also, it's pricey, even at lunch.   All in all, definitely give this place a try because they honestly do cool stuff and anything farm to table is legit. But, if you're like me and value the money in your bank account, you can find delicious food at many other restaurants nearby for a lot less cash."}
{"text":"What's the point of making a reservation if you're not seated for half an hour?    Reservation for six, squeezed into a four top.   Opening milk bread was tasty. Too bad they had run out by the time our small (and they do mean small) plates had arrived.   Interesting restaurant aesthetic although the acoustics prevent conversation beyond the person next to you.   Everyone at my table felt the same way, so this technically counts as six one-star reviews."}
{"text":"Must admit this restaurant does everything right.  The take two slushie drink is to die for.  Crispy oysters, gem salad, wow!  Ssems that chef invented new, great tastes.  Simply outstanding food, atmosphere, and service.  Period.  Reservation suggested."}
{"text":"Likely the best place I've been in the greater charlotte area, particularly for farm to table cuisine. We went with a larger group of 13 that they nicely accommodated - in fact I'm impressed in retrospect at the ability to have good timing and pacing through courses. Our server was very enthusiastic about the Kindred concept and experience which of course added to our fun. The cocktails were good, but it was the \"surprise me\" option that I actually liked best where the bartender would mix something up based on what you like. Much easier for someone that can't tell one liquor much from another let alone understand half the ingredients on a typical cocktail list. We tried nearly everything on the menu, with favorites being the NC fish, the tagliatelle with peas and cream (while others strongly preferred the squid ink pasta) and a number of the starters. For dessert, the cinnamon roll was very rich and well received along with the birthday cake. For those that like something fresh the strawberry rhubarb sorbet was excellent."}
{"text":"We dined last night at Kindred and had a marvelous experience. The potatoes are simply the best I have had. Bread is on the table within a minute of being seated and piping hot. We split the tagliatelle dish with mushrooms and it was perfect amount. GO GO to this restaurant!"}
{"text":"Whoa.  Recently took a day trip with my travel companion, as he was conducting some business in the area.  Since this is listed as one of the very elite \"Top 10 New Restaurants\", according to Bon Appetit, of course we made a stop to give it a try.  We were here for lunch.  Started with the fried oysters.  Lightly fried to perfection.  Stimulated my palate for more.  I had the house-cured ham tartine with the giant potato wedges.    They use a lot of dill in their sauces, which I love.  Adds a good flavor.    My drink was just okay- it just wasn't that memorable.  Tart, but not super strong.  But we'll give 'em a break.  It was lunch, after all.    We want to return for dinner!"}
{"text":"Caught a last minute late reservation at 9pm on a Friday night. Score!!! This place has been bookmarked on my Yelp app for a while, so I was excited to catch a last minute reservation and go with friends. The service was great. The staff are very attentive down to the small details. I love how on their cocktail menu, you can purchase a round of beers for the kitchen staff for $6. I also love how they have an option on the cocktail menu for the bar tender to make you a special drink based off of the flavors you like.  The first star of the show was the milk bread. Oh my it was quite delicious with the butter slathered on it. It had a tad too much sea salt, which at times would over power the deliciousness of the bread. Unfortunately having a late reservation can come at a cost, they were out of a few dishes and desserts by the time we got there. So sad because I really wanted the hanger steak. It was hard to pair the other items on the menu together. The menu seemed to be a bit disjointed and not a variety of meat options. I settled for the duck fat potatoes and the fried soft shell crab because I could pair those together. The duck fat potatoes were delicious and I love the dill that was sprinkled on them. The crab had good flavor and seasoning but unfortunately my crab was not cooked all the way through. My friends ordered the scallops, squid ink pasta with shrimp and salad. They all said their dishes were good but not the best they've ever had. Overall it was a good dining  experience with great service and good atmosphere. Since their menu changes daily, I may have to come back and try a few other things. For now, they're getting a 3 for my under cooked crab, salty milk bread and lack of a cohesive menu."}
{"text":"One of my favorite places for dinner. Bartenders are always on point and can craft a perfect \"made-for-you\" drink with ease. Their cocktail menu is always good too! Creative menus give Kindred the flair of a foodie restaurant with the laid back atmosphere of your neighborhood hangout. Definitely a must after a long day in the office or a long day on the lake!!"}
{"text":"Enjoying a day off from work, I decided to take the short drive to Davidson since I have a few places on my list to try in the area.  I ended up visiting Kindred for lunch because of a pasta dish I saw on the online menu, but since they had recently updated the menu the pasta dish was no longer available.  I was disappointed to say the least, but my waitress was so helpful and recommended the burger, which she stated was fresh, hand packed and served on a milk bread bun(how could I turn that down).  It was a very tasty burger with frites, looking forward to checking out the dinner menu."}
{"text":"My fourth visit to Kindred this time with a large group so we were able to score the Chefs Tasting Menu. Started with Grandfathers pickles, tart house made pickles good but would not order on my own, the following dishes came quickly thereafter, Hamachi Crudo, Charcoal Broccoli, Cauliflower with Harrissa Yogurt, Duck Fat Potatoes, Crispy Oysters,  Salumi, Scallops & Wagyu  Beef Tartare, WHEW!    My short list of faves include the Hamachi Crudo with tender bites of Hamachi in a sweet and spicy dressing, Duck Fat Potatoes are always great served with ailoi, Wagyu Beef was a surprise hit at the table as well while the Crispy Oysters which are a must try. Just when we all were sitting back and sipping a nice bottle of Cabernet, the pasta dishes started rolling out.  Ravioli stuffed with country ham, Tagliatelle, Bucatini with venison, and Squid Ink Conchiglie. Honestly at this point I was done. All of the pasta dishes were great but I would lean towards the Tagliatelle as my favorite.    Following the pasta dishes we closed with Chocolate Birthday Cake, Ice Cream & Cookies and Milk Bread Cinnamon rolls.  Go with the Cinnamon roll here but all were great.  Menu rotates frequently so don't be surprised if your favorite is missing just know that something as good or better will be available!  Food: 5 Sporks Service:  5 Sporks Atmosphere: 4 Sporks Local Beer: 3 Sporks Value: 3 Sporks"}
{"text":"Dined here for lunch during a rain storm which was an advantage for me because there was no wait. We were escorted upstairs and had the whole 2nd floor to ourselves. David, our waiter, had blue eyes and an innocent smile and was accommodating and sweet and I could have boxed him up and taken him home.....wait, this is about the food. My friend and I started with the gnocchi, the cheese plate, the shrimp roll and a side of kale salad. It didn't take long for us to get through that so we ended up ordering the falafel and the avocado and fried egg sandwich with french fries. Much to our surprise, these two dishes were much bigger than the buffet we had just had! The avocado sandwich was my favorite. The bread was devine; same one they used for the shrimp roll. Overall, the ambiance of this place is very nice. The food is ok. I would come back for the avocado sandwich and French fries but I would definitely drive back up to Davidson just to be served with David's sweet smile again :)"}
{"text":"I cannot wait to go back!  We got there at about 11:30am for lunch and did not have to wait.  I got the burger which was AWESOME, my husband got the gnocchi which was sooooo good, we split the falafel as an appetizer (loved it!!) and our 3 year old got the kids PB&J.  The PB&J was not on soft bread but was prepared like a grilled cheese and she wouldn't eat it.  A manager (I think) came over and wanted genuine feedback on what was wrong to perhaps improve it for the future, which is super rare.  They brought her a grilled cheese instead which she liked and I later tried that PB&J and it was amazing....like...I would go back to Davidson and order that as my lunch off the kids menu.  I wish they were in South Charlotte!!!!!  I do not like paper straws.  They brought me a plastic one."}
{"text":"Ehh.  Felt like the Abercrombie & Fitch of restaurants.  An elegant setting with music that plays WAY to loud.  You know it's loud when you feel the bass in your feet through the floorboards.    Also we were seated in the front facing the window. Very very akward as the hostess stand is literally 1 foot from your table.  So the whole time the hostess essentially stood 1 foot from me.  Felt we couldn't have a private conversation or discuss the restaurant if we wanted.  On top of it, she looked miserable.  Never smiled, ever.  As a former manager of a business, you should ALWAYS make sure the first person any customer sees is the happiest in the store or restaurant since they set the tone and leave a first AND last impression.    The food was pretty good. Our waiter did a great job, asked if it was our first time (and listed off 4 of the most popular dishes).   We tried the sunflower soup, and it just taste like sunflower seeds in a cream broth. Nothing special.   I had the burger which is two patties but still was small.  The bun it was on ( made right there) was great.  Either way, just a funky vibe in this place.  It's almost like they want to look fancy, but aren't there just yet.    The demographic was wide, saw young college students and all the way up to retired aged people.  Either way, loose the grouchy hostess, and turn down the dang music."}
{"text":"I can't say enough good things about Kindred. The food was awesome. The outdoor seating is so quaint. It is worth the drive! I could live on the Milk bread."}
{"text":"When we were walking home last night, I had intentions on giving a 3 or 4 star review. Most of the food was pretty good - not mind blowing, but good. I was planning on knocking off a few stars because the server pretty much did not pay one bit of attention to us unless we stared at her and waved her down. We were there for about 20 minutes before ordering drinks and then another 10-15 before ordering food. It was also very, very loud.  Then about 15 minutes after getting home, we had a conversation \"I really don't feel good. Yeah.. me neither. I think I'm going to be sick. Yeah.. me too.\" Speed the night up 6 hours of laying on the bathroom floor and sleeping next to a trash can, I think something that we ate was bad.   We may come back, but not for a while."}
{"text":"I went in January and have been asking my husband when we can go back almost nightly. This place is absolutely wonderful. Exceeded my expectations. It is just fantastic and the bread  if only it wasn't a hike to get to Davidson. Highly recommend"}
{"text":"Good food.   Milk bread is delish.   Also like the roasted chicken cooked perfectly.   Love the converted bank atmosphere."}
{"text":"I have only been for lunch so far but both times the food has been great, and service was quick and friendly.  Everything looks and tastes like it actually came from a local farm.  Although this place could fit in to Brooklyn, Charleston, Bay Area, etc, it totally works here.  Prices are on the higher end and servings are smaller than what we are used to in the area, but very much in line with my favorite Charlotte restaurants.  So glad that our area is \"growing up\" and the support is here for the local food movement.  Can't wait to try dinner."}
{"text":"Who would have thought that an asparagus dish would be mouthwatering good! We came with great expectations after hearing reviews from friends and were not disappointed. The pasta dish with morel mushrooms is only in season for a few weeks I hear so I'd come soon. I will definitely be back."}
{"text":"A true jewel. The food, service and atmosphere were all wonderful. I had the buttermilk fried chicken salad and it was out of this world. You will not be disappointed."}
{"text":"Beautiful location in Davidson with an exquisite outdoor area. The food here is amazing!  From the milkbread to the vegetables I could not get enough. Order the squid ink pasta with crab. Velvety black small shells with pulled crab meat and a luscious suave. The gnocchi were divine. But the best part was the vegetables. The pole beans were so good I wanted to pack them up and have them for breakfast.  The spinach was perfect - just a hint of cream and garlic. One drawback was the strawberry shortcake. The biscuit was a little dry yet chewy. The one dull moment in this shining meal. Excellent service and the music was unexpected and fun. We will be back and often!"}
{"text":"Everything is amazing!! The food, drinks, dessert are the best around. I could eat here everyday. The milkbread is soooo good."}
{"text":"My first experience here, I was seated upstairs by a window overlooking the adorable downtown Davidson. I'm not sure if the hostess could tell I was there on a budding relationship style date, or if it was just by chance. My, now boyfriend, had been following Kindred on Instagram for some time and was very interested in the unique menu, especially the fun drinks. So, as a thank you to him (he had toted my horse back and forth to NC State through a very trying time on my horses' health) I made the reservation and surprised him.  The menu is slightly intimidating if you're not a budding foodie. Undoubted, there will be questions for your server or the company you're with. However, if you're willing to try something you can't say, it's worth the curiosity. Everything is fresh, it tastes fresh, it smells delicious, it's cooked to perfection...Nothing is over done or underdone. You get exactly what you ask for, every time. I don't care what kind of diet you're on, if you aren't going to die from eating bread, you HAVE to try the milk bread. It's a labor of love and a love that you'll not regret. Nothing like that one time in high school when you thought love blossomed from a kiss under a park bridge. No, this is a warm, sweet but salty, dense and fluffy style love. A love that fills your belly with greatness. Just try it. You'll understand.  Since your already on a wave of \"Sure, why not\", let the bartender mix up something special. Doesn't matter what crazy flavors you like, they come up with a cocktail of delight. You can suggest different sweet or sour tastes or just tell them to surprise you, they won't disappoint.  The entrees are ever changing so I don't want to sway anyone there. However, if you make it through the main meal and still have room for dessert, the milk bread cinnamon roll is the perfect shareable. Their birthday cake looks divine too but I'll have to go on another date to catch that one. I've visited twice so far but it's quite a drive from home. Great for a special treat though."}
{"text":"A server from another restaurant recommended Kindred to me and my S.O. Three months later, we finally got a chance to try it, and it did not disappoint!  Came in for a late dinner on a Friday. Called ahead and was informed that the earliest dinner reservation available was 9:30. However, we were seated before. Street parking available, but we decided to take an Uber.   The restaurant is absolutely gorgeous! The decor is well thought of and executed. Very modern and elegant. I could not stop admiring. Space is tight and there's little to no room to wait. Some people decided to wait outside. There's second floor seating, but I didn't get a chance to see the upstairs. There's only one bathroom, but it's big and also beautiful. Adorable family pictures adorn the wall. The mints, toothpick floss, hair pins, and hairspray were a nice touch.  Our server was pleasant and attentive. She introduced herself then took our drink orders. The S.O. ordered either the Drama 101 or the Soigne West. I don't recall. I ordered the Barkeep's Choice (bartender's choice). I don't drink much, but when I do I like my drinks on the sweet side. I told our server what I like and dislike, and she relayed it to the bartender. She came back with a tiki drink and a card with the ingredients: vodka, lemon, lime, OJ, grenadine, and St. Germain. It was perfect! It was strong, but plenty sweet. The S.O. enjoyed his drink so much he ordered another one. Each cocktail was $12.  I wanted to give Kindred 5 stars, but they were out of several seafood dishes which was the main reason we chose to dine there that night. We were hoping to try the sheepshead and scallops. We got there late, so I get it. In addition, the portions were small especially for the price.   We tried: Complimentary milk bread and soft butter  Crispy oysters $15 Hamachi Crudo $15 Trout $21 Buccatini $17 Milk bread cinnamon roll $9  WOW. Everything was DELICIOUS! The milk bread was soft on the inside and salty on the outside. I am a little sensitive to salt, so I had to scrape off some of the salt crystals. The oysters were crispy on the outside and melt-in-your-mouth on the inside. The hamachi crudo had a variety of ingredients that added great texture and flavor. The trout was flaky and flavorful. My buccatini was a bit salty (again, I'm sensitive), but was creamy with a slight crunch. I enjoyed it and wanted more. I practically licked the small bowl clean. The milk bread cinnamon roll was amazing! It was nice and warm and rich. It more than satisfied our sweet tooth and was the perfect ending to a fantastic meal.   Overall, we had a wonderful experience. The food was excellent. I need more of that milk bread in my life! Hopefully, we will get to try the scallops next time."}
{"text":"After reading some of the reviews, we realized that the entrees may be on the smaller side. Our waiter, however prepped us ahead of time and explained that their portions were indeed smaller and that if we were really hungry, we should share an extra entree. While I think we could've foregone the additional order, we were not disappointed at all. Everything was top notch.  The milkbread was delightful (and was a good belly filler beforehand). The scallops, duck fat potatoes, yellowtail crudo, and pork arista were all delicious. Clean plates all around and we were pleasantly full."}
{"text":"My hubster and I came during lunch hours on a busy back to college day. We waited a good few minutes before the hostess came back to her post to seat us. We were ushered upstairs to the second floor to be seated. Atmosphere is current with a touch of rustic vibes. Good use of space, decor, including plants :) For a second you think you warped up north to Brooklyn NY. Staff is friendly and the menu offered enough to satisfy any carnivore, herbivore and omnivore. My husband and I ordered the avocado green goddess which was an avocado and fried egg sandwich. SO GOOD. It was topped with micro greens/sprouts with frites and pickles as our side. I hear the menu changes depending on what is available locally during the season. We definitely plan on going back. Glad to finally get some good eats in this area."}
{"text":"We (2 of us) tried it because it got the #5 position in a \"50 Best Restaurants in Charlotte\" list.  It's an excellent restaurant...  Plenty of stuff most foodies will not have had before.   A bit noisy, but no noisier than your average noisy restaurant.   We were able to hear each other across a 2-top table, hear the server, etc.  The menu was divided into thirds.  The first third was devoted to more veggie-based dishes, and is meant to be either an hors d'oeuvres selection and/or a first course...   We ordered 3 of these:  the Brussels Sprout Tartine, the Tuna Crudo and the Crispy Oysters.  I'm going to be critical here, because of the great rating and the pretentious (I don't mean that in a negative way) menu.  But please remember, I give this meal a 4-star rating...  I look forward to returning.  The Tartine was advertised as \"Stracciatella, Pomegranate, Bottarga.  Being a tartine it was served on a bready base, about the same diameter and thickness as a half-English Muffin. It could have been an English Muffin half, for all I could tell.   This was perhaps the most disappointing dish... The \"Brussel Sprout\" part consisted of the outer leaves of 1 or 2 brussels sprouts, flash fried/sauteed...  The pomegranate was visible, but not very tastable.  The bottarga I didn't see at all..  The dish's flavor was dominated by the cheese and the bread.  It tasted great, but fell well short of my expectations.  The Crispy Oysters were battered and fried, served on a dill yogurt with Calabrian chile oil.   This was a fine dish.  The oysters were perfectly prepared:  the batter nice and crispy, not too heavy, and the oysters still basically raw.  The sauce was plated as a base, so one could eat the oysters naked if one wished.    My only critique of them is that it's not all that special..  A marvelous dish, but not unique.  Our Tuna Crudo was the star of the evening.   Listed as \"Celery buttermilk, nasturtium, pistachio,\"  it was perfect:  tasty, original, mesmerizing mix of flavors and textures.  The  \"nasturtium\" consisted of one leaf, about the size of a nickel or a quarter, topping the disk of tuna.  Given that we were sharing everything, I would have liked to have at least 2 leaves ;-)  For entrees, we ordered Pappardelle (with braised turkey, peas, and Parmiagiano Reggiano) and Strozzapreti (with venison, chiles in adobo, parsley).  Both were good/very good.    The Pappardelle was perfectly cooked (it can be hard to get this al dente), and the dish tasted like a nice comfortable Thanksgiving dinner.  The Strozzapreti was not as tasty, surprisingly.  The venison had been stewed, perhaps to death.  A nice dish, perhaps I'll give it another try later.  For dessert we stuck to the simple Sorbetto of Meyer lemon.  I'm no expert on Meyer lemons vs. those I buy in my grocery store...  but this was a pleasant finish.  It had a hint of the bitter note one gets with zest, was nice and smooth, zesty but not overly sour.    THe wine list was moderate in length...  We had a bottle of a Spanish rose and a few glasses of Pinot grigio...  The rose was mild and perhaps a tiny bit sparkly, perfect for the milder tastes of our dishes... I didn't drink the pinot, but it got good reports.  I would quarrel with the price point listed for this place... I spent roughly $75 a head, including a decent tip.  A very nice value, considering the fun, range, and adventure of the menu.  ============ a d d e n d u m ============ I just read a review from a few days ago, complaining of slow service...  I must disagree.   Perhaps the gentleman's review was read and reacted to ;-)   But our service was superior.  Our server knew the menu, and was able to make several great suggestions.   Our plates and flatware were quickly removed, our water and wine never flagged.   There is a constant motion of wait staff delivering food and removing plates.  I never saw a single employee stand in the same spot for more than a second or two."}
{"text":"Everyone that's I know who's been here has been raving about it so we Trekker out to LKN. First off, for a Saturday night- and not having a reservation we were seated super fast! It was about a 15 minute wait and in that time my boyfriend and I both grabbed a drink from the bar. The bar tenders were nice quick and helpful and our Denis were awesome. When we got to our table is when things got a little shaky. Our server was simply Ok. I don't even know her name since she didn't tell us and only checked up on us twice throughout our meal. Everything we ordered was amazing  especially the pasta with squid ink, but our service was lacking and we were upstairs next to the window causing it to be freezing and it made it hard to enjoy our food. Overall I would try it again... I thought it was a little pricey for what we got but it was yummy and I loved the bread!"}
{"text":"Meh is about right on this one. I was expecting more out of my visit. The atmosphere is fairly bland and loud (when people are at the bar) there isn't anything to soften the noise inside. The setting is nice but a little better attention to detail could help some. The food was OK. Risotto was nicely prepared, al dente, a little cool more tepid than warm. The lamb was NOT very good. I understand the technique used for preparation, but if not done correctly the end result will be tough, and gamey. That is what I received. The pricing structure seemed a little high. But It's Davidson.. The service was adequate but not outstanding (its becoming rare to find outstanding service anymore). The server did prep me letting me know the portions where small and everything was ala carte. I will say the Milkbread was a very nicely done. Wine selection was pretty good, I ordered wine by the glass and first glass was fairly flat and lost most of its character, it was the last of that bottle. The second glass was more indicative of a nice Pinot Noir. When asked how the meal was, I explained the lamb was not prepared well, the server immediately got the manager and first the manager tried to explain the technique used to prepare the lamb and I explained that I had a culinary background and completely understood. The manager did remove the lamb entree from the bill. That was appreciated. Overall the experience was just average in which I would have expected more. Will I go back? Umm. I'm not sure. I may give them one more try."}
{"text":"Why 2 stars? Service: 1 hour and 20 min wait for a table I made reservations for, weeks in advance is unacceptable.  They comped us several tapas to apologize (which was appreciated bc we were starving), but only after I said we would not be waiting any longer. When finally seated and ordered, we were told that several of the dishes we tried to order were no longer available - such a bummer after the long wait.  My favorites are the milk bread, cheese plate and charcuterie plate."}
{"text":"Truly amazing food. I was very pleasantly surprised. I had the crispy oysters. Their pasta is also fantastic, as is their wine and desserts. Beware if you're hungry, though. The portions are very small!"}
{"text":"Had a great first experience! The staff was very friendly and helpful about the menu. It was easy to tell that each dish we tried had quality ingredients. From the interior design to the cocktail that changed my mind about gin--it's all about the details here. Next time I will have to save room for that milk bread cinnamon roll..."}
{"text":"Love the area of where this is located and atmosphere so thought we would give it a try.  The waitress was very helpful on which dishes did not contain seafood upon my request and explained the menu and style of this restaurant.  Unfortunately, this is about as far as my satisfaction went.  We spent over 30 mins waiting on our salad to arrive and set with empty glasses for several minutes.  No one really came back to our table after we received our food, just did the bare minimum.  The table next to us constantly received service.  The complementary milk bread was the only desirable item we received. We were very disappointed in the ratio of food  for the price, and the taste of the food was just ordinary.  We expected for the price that the food would be amazing, but this wasn't the case either.  None of the plates we received were a good size to share, even though our waitress indicated most people get a lot of plates and share.  I would only recommend this restaurant if you aren't very hungry or are wanting to spend $$$ on a lot of very small plates."}
{"text":"The hardest thing about this review is deciding where to start first. This place is amazing, that is really the only thing you need to know.  I started hearing seeing some buzz about it on Instagram and finally decided to make a reservation and check it out for myself.  My husband and I went in on a Friday night and the place was just starting to fill up, we made our reservations for about 7 and there were already people waiting for a table when we arrived.  The building is phenomenal, the exposed brick and bar area are gorgeous. I loved the feel and look of the entire restaurant. You could tell they tried to use as much of the original fixtures as possible.  We were seated upstairs which is a nice wide open area with lots of natural light. Our waitress was super sweet and helpful through the entire evening. We had 6 of the small plates shared between the two of us. My favorites by far were the scallops, corn soup and the calamarata pasta with heirloom tomatoes. I could also write a love song dedicated to the milk bread, people were saying it was good but it was HEAVENLY. I am still thinking about it.  For dessert we had the chocolate sorbet and the cinnamon bun. You must must get the cinnamon bun, they use the same dough as the milk bread and layer on the warm, gooey icing. It's amazing!  All in all I can't wait to come back, the atmosphere, food and staff are all top notch. You must go!"}
{"text":"Today is my 30th birthday and wanted to try out a new place to eat. I saw the reviews and pictures of Kindred and also through word of mouth about how wonderful this place is, so it became my go to lunch choice. The restaurant is beautiful, the brick wall, quaint and hip. The hostess was very welcoming and friendly, wish I asked for her name. I was showing the food pictures to my friend so we can figure out what we wanted to order and we kept looking back at the burger and fries and decided that's what we want. Our server, Meredith, came over and greeted us and also informing us that they have run out of burgers. She said they didn't order enough burgers for the day/week something like that? That was strike 1 for me, ok fine. There seems to be plenty of other juicy meals on the menu to choose from. We did order the Crispy oysters and I will say they were very delicious! However, I think it was a bus boy, came to our table asking if we were done with our appetizer when we had oysters still on the plate and stood there until we finished eating them, weird and awkward and I don't like you are rushing me. I will say we walked into the restaurant at 1:30 and they don't close until 2:30, so it's not like we walked in to eat last minute to this restaurant. That was strike 2 for me. My friend ordered the Falafel and I ordered the Ham Tartine. The sandwiches were good, but the fries were even better. Now comes the dessert. We were deciding between the birthday cake or the cookies with ice cream. We chose the cookies and ice cream. I asked our server if we could get an additional scoop of ice cream for our dessert she said of course no problem. I also asked her if it would be possible to warm up the cookies? It wasn't that big of a deal if she couldn't but her answer and reasoning is what made me wonder, how did you get hired? She said \"no we can't, because it would melt the ice cream\" I said \"Oh its a chocolate chip ice cream sandwich? She said \"no its just on the same plate as the ice cream\".....if I could insert an are you kidding me face here I would...so you're telling me that these cookies are glued to the ice cream on the plate and you wouldn't be able to put the cookies on a separate plate just to warm up the cookies and put it back on the plate that has the ice cream on it? Anyways, I said ok that's fine, so we received our dessert and it was a plate with 3 chocolate chip cookies and once scoop of half melted ice cream... apparently you didn't have to microwave anything and the ice cream is still melting. Was it sitting out for awhile? The cookies were delicious though. The dessert was $6 total. When we received the bill, the additional scoop of ice cream was $4. So you're telling me that the $4 out of $6 is just for a scoop of ice cream and the 3 chocolate chip cookies are only $2? Strike 3, 4 and 5. Sad that the service was bad, but the food is delicious."}
{"text":"We recently moved to the area and were Kindred first timers. I was amazed by how wonderful everything was, from service to food.  We had reservations for Saturday dinner and were seated right away in the upstairs area.  We had a great table right next to the window.  Kindred has a wonderful \"refined casual\" atmosphere IMO.  Within 30 seconds of sitting we were treated to the famous Milk Bread.  WOW.  Fluffy deliciousness.  They have a great wine and beverage list.  Our awesome server recommended the Mark Herald Flux and it was one of the best wines I've had in a long time.  The menu has sharing style plates, and changes daily.  We ordered way too much stuff, as we tend to do as first timers to a restaurant.  First we had the duck fat potatoes and carrots.  Why would we order carrots?  The server said they were the best he had ever had and he was right.  Duck fat potatoes were equally delectable.  Next up was beef tartare... it hit all the tastes buds.  I hate mushrooms usually, and ignored it to try this beef tartare.  The mushrooms in it paired beautifully with the beef I have to admit.  Crispy oysters are a must here, because I feel they are very easy to eff up.  Kindred executes them wonderfully.  Crispy, light breading with a creamy oyster.  Really went well with the cool yogurt sauce and spicy chili oil.  Then we got 3 pasta dishes ( I blame the husband for being in charge of ordering).  They make ALL pastas in house.  The only one that was very good but not amazing was the Smoked Duck Rigatoni.  The squid ink conghilie and the bucatini were knock-you-socks-off awesome.  The bucatini... which I guess I would describe as an asian twist on carbonara(?)...was the best pasta I have EVER had in my life!  After that huge meal we left full and happy.  I have thought about that meal every day since.  We will be back again and again and again."}
{"text":"Food was excellent but is expensive for the small portions and left hungry. They make good cocktails"}
{"text":"This was a very good restaurant.  Maybe not as good as touted, but different strokes for different folks.  The service was very good as was the food.  All in all I found the prices out of reach of my purse on a regular basis, but occasionally it is nice."}
{"text":"I'm still giving Kindred's 5 stars and this is my 5th time here. I just love the atmosphere, food and wine. We are telling everyone we know to come see this great restaurant in downtown Davidson. I know everyone comments on the milk bread being delicious and it is but the cheese tray is always changing and it prepares you for a great dining experience. If you get the opportunity order the baked egg appetizer, it has a great flavor serve over rice in a cast iron skillet. The mixture of savory sausage with a fried over easy egg. They serve it over easy. I prefer over medium because their  over easy is really runny. The wine selection is really above average and the beer selection offers local craft beer selections. On this visit I had the basil flavored pale ale and it was tasty.  I have noticed for some reason we have had better service downstairs instead of upstairs, that might be coincidence but it was a little slow. I find the whole dining experience at Kindred's an enjoyable experience, I highly recommend it."}
{"text":"I've been here once. Felt uncomfortable being seated right behind host stand asked to be moved waiter was rude. Did not realize between shifts.  Got up and left."}
{"text":"Yelp 100 Challenge 2018: 33/100  Came to Mooresville on a business trip, and I was glad to have found Kindred on Yelp! Located right next to Davidson College, I am quite surprised to find a relatively older crowd here (middle age group). The ambiance here also didn't give off a college restaurant feel; the overall white theme with their marbled bar top and the lights gave a very warm but upscale feeling to the restaurant.   I came in and sat at the bar area, and I was immediately greeted by the bartender. Coming here by myself and not intending to drink, I ordered the squid ink conchiglie. A bowl of their signature milk bread was then brought to me. The milk bread was so rich and so soft! It was still hot when brought to me too! I wish they sprinkled less salt on the top of the bread, but it didn't stop me from eating half of it before realizing I'm going to get full before my meal even comes out.   The squid ink conchiglie was brought out to me about after 15 minutes. It's topped with small shrimps with a savory, slightly creamy peppery sauce. The sauce and the shrimp were very good, but some of the pasta were stuck together, thus making it seem like it wasn't cooked all the way through as compared to the other ones that were loose. Other than that, the meal itself was very tasty and I liked their smaller portions so that I could finish the whole dish.   Although overall the meal was slightly on the pricier side, I was still very satisfied with my overall experience with the food and the restaurant. They definitely put a lot of effort in the fine details in terms of the decor of the restaurant, and their food measures up to the restaurant's appearance. Will be coming back to try their other items on the menu!  PS - their restroom is amazing!"}
{"text":"The food is incredible and the atmosphere is very unique. All the food is delicious- especially the bread. The pasta dishes are my favorite, the pasta is hand made. Service is wonderful. Only downside is how expensive the food is for the amount of food given. Small portion sizes with a high price tag. The bolognese at lunch is to die for along with the pickles."}
{"text":"This was a definite on my list to try  on this visit to NC. Sooo glad we got to try them out. They deserve their place as one of Bon Appetit's restaurants of the year. Local fresh ingredients, house cured meats, great staff, really great food, nice dining areas and a comfortable atmosphere, we sat outside as it was a lovely early fall day, good prices, nice portions. Everything!!! Started with a margarita, very refreshing. Had the shrimp roll with frittes. OMG so so so good! Even the roll was fantastic, rich buttery dough....oh I want one right now!!! Frittes were very crispy and not at all greasy. Loved it all!!!!! And BRAVO on your well deserved recognition!!!!"}
{"text":"The food is wonderful! We went for lunch and will be back for dinner soon!   The way they renovated the building was surprising, very simple and full of light. The server we had was perfect, not too much but welcoming and friendly. We asked her for her recommendations and she asked a few questions about our likes and then gave us excellent suggestions.   We shared two appetizers, the cheese plate and the fried oysters. The cheese was excellent and served with thin good crostini. The oysters were amazing, perfectly cooked and sitting on a yogurt based sauce with a fiery oil drizzle. We were halfway through the 8 oysters when our server brought another entire order out, saying that the chef wasn't happy with the size of the originals. Such a lovely lagniappe and nice to see that level of care with the food.  We shared the shrimp roll and the ham sandwich. Both were fantastic. The shrimp were delicately dressed and served on a fresh house made roll. The ham is also house made and was amazing with the perfect combo of pickled onions, tiny green pea shoots and some fantastic light spread on the bread.  The French fries with aioli are just perfect.  I expected this place to be over priced and twee, it was fresh, amazing, and very worth the reasonable cost. I understand that they locally source their goods too which means I can't wait for summer and to try their tomato dishes!"}
{"text":"Just left and have to say I have a love hate relationship with them. Went for the Salumi and cheese plate and was persuaded to do the pickle plate. In short, pickle plate is a misnomer. All cucumber, some white onion and heavy vinegar methinks! Pass next time. Salumi has great house pate, salami and ham are just ok. Cheese plate uninspiring and presented by its equal server. Gouda worked, as did the local soft cheese. The blue and soft French offering were off the mark. The sweet menu was a none starter. As a type 2 diabetic you would think that would be ok? No, my 2 guests had a sweet tooth with nothing to satisfy them....... Is management pretentious and arrogant enough not to listen, not sure. Will I return, again not sure. I really like the location, mood and ambiance. That alone is not enough, need to step their game up on food! Will they miss me, someone who eats out 3-4 times a week, buys 2 bottles a wine at a sitting, you would think so. If they don't, that's ok too. All they need to remember is that you normally share experiences with at least 7 others that do likewise. Just wanted to share that it has great potential, just needs food to match"}
{"text":"Oysters, flounder crudo, lamb tartare, gnocchi, tagliatelle were all awesome!  Cinnamon ice cream and butterscotch cookies were delicious!  Service was great!  No complaints.  The people that are complaining about this place have zero clue what good food is!  Excellent!  Thrilled to finally have some great restaurants that \"get it\" in Charlotte."}
{"text":"I ate at this restaurant with my parents and this was not a pleasant experience at all, despite all the hype we've heard about it. Both my mom and I have multiple allergies. First of all, the allergy menus were depressing even to look at, and the food options were extremely limited. It was over priced when you have to take out big ingredients to make it work, but pay for everything anyway. We were given the wrong menus (dinner instead of lunch) and ordered from that, then had to go through the whole process again with a different menu. It was extremely disheartening and took a lot more time since its so difficult to find something we can eat and actually want to eat. After that, we were given an incorrect drink order. Our server didn't apologize for either mistake and had an unpleasant attitude throughout the entire meal. The server asked what kind of medical condition we had that caused our allergies, or if it was a lifestyle choice. My medical condition is personal, and I find it rude that the server asked. By asking if it was a lifestyle choice, it felt like the server doubted our authenticity and felt we were being an unnecessary nuisance for needing help with the menu. Overall, everything was handled poorly and I see no reason to ever come back."}
{"text":"Wow!  Great food and service. homemade soft drink - an experience.   melon salad - unique milk bread - great.  I had the crispy oysters - excellent My college aged granddaughter had the gnocchi and ate it all, finishing off the sauce with the remaining milk bread."}
{"text":"Very eloquent and quaint in the inside however the acoustics are horrible so the environment is loud. The menu (both food and beverage) is well thought out so expectations level set you to that of a higher end restaurant. The milkbread was a standout however the salads were a fail. Our entrees were good but nothing memorable like other fine dining establishments in the area. The only thing you will have to accept is you are paying full price for half portions. May try them again at some point in the future."}
{"text":"This place is AH mazing!!!! The food was delicious, the staff was super friendly the service was fast! I suggest the burger and frites! Trendy decor makes this a great place for a little afternoon drink and snack! Stop it you will be so glad you did!!!!"}
{"text":"Fabulous. Lived up to the hype. House Milk Bread starts you off well. Can't miss on the pastas. Get the Crispy Oysters."}
{"text":"Please believe the hype. The pompano was amazing but pricey for how much you get and what it is. Fries...amazing. The complimentary bread and butter, amazing. The cultured butter is the start. Cocktails are awe inspiring. I was stuffed but took my pregnant friend out for her last girls night pre baby so we decided to gamble with desert. We've seen all the pics of the birthday cake and figured that was the way to go however our waiter recommended the cinnamon roll. Best recommendation ever! I don't even care for cinnamon rolls but I devoured it and got one to take to my beau as well. He was literally angry at how good it was.   I will be returning for the fish, a cocktail, and that cinnamon roll! But mostly that cinnamon roll.   Sorry. There are no pics. My phone died"}
{"text":"I have worked in the hospitality industry for over 24 years. I have eaten at restaurants all over the world, and I have to say that Kindred is by far my new favorite restaurant. The food is top notch and served in a very relaxed and unpretentious setting. I  have eaten meals that were twice as expensive and weren't nearly as good. We sat outside on the open patio which was beautiful, there was comfortable tables and sparkly lights overhead. We were greeted immediately by the server with some delicious house made milk bread and cultured butter. I had a delicious Aperol Spritz cocktail, and my girlfriend had a nice Pinot Grigio. We chose to start with the fried oysters and salumi plate, both of which were a great start to an amazing meal. The server Daniel recommended the pickles to pair with the appetizers, what a great idea. Our entree course of the pork chop and scallops took a while to arrive. The server told us that the kitchen lost our ticket.  The food and service up until then had been impeccable, so it wasn't even a bother that it took a while. Our server Daniel brought out a complimentary glass of Pinot Noir and our duck fat fries while we were waiting for the entrees. Once the pork chop and scallops arrived we were very impressed with how flavorful and beautifully plated these dishes were. The service was great the setting romantic and the food was amazing. I will gladly recommend Kindred to anyone that will listen. We will definitely be coming back to Kindred on a regular basis. Kudos to the staff, keep up the good work."}
{"text":"Didn't know what to expect walking in, except that the place is loved by food critics, and we had to take an early reservation for a Tuesday to even get a table for 2.  The restaurant is small and quaint.  We were seated upstairs, in a fairly loud, busy dining room.  We started with the milk bread, which was great, and found a wine and a beer to our liking.  The waitress explained the small plates and ever-changing menu, and then we considered our options.  Nothing stood out to my wife.  The menu was very vegetable heavy, with some italian flair and a lot of asian spices.  we actually considered just getting an appetizer and going elsewhere, but we decided to really try a few things.  We were glad we did.  If you like cheese - get the cheeseboard!  Get the cheeseboard!  The cheesemonger brought up a board with the night's six selections; as part of the tasting menu you could order taste sizes of 3-6 of them.  She was very knowledgeable about the origin, style and flavor of each cheese.  The crackers with the cheese were not nearly as tasty as the milk bread, so make sure to save some (or get another loaf!)  Get the cheeseboard!  The crispy oysters were simply delightful - I don't normally get oysters in summer, except these were fresh sourced in VA; being from there I knew the exact part of the river these came from.  We ordered and I'm glad I did!  We also had a squid-ink orechiette with fresh NC shrimp, and a light summer gnocchi in an heirloom tomato sauce.  The seashells were so good, and the sauce was delightful, but it was heavy.  The gnocchi was amazing though - gnocchi is so easy to make and so common, but it is rare to find it made just perfectly - which it was here.  So light and pillowy, yet with a great flavor that paired so well with the sauce.  We didn't get dessert as we were full, but they looked tasty.  We won't go back frequently, but will surely be back on an occasional basis.  One other note:  this restaurant must be the most hipster-centric place I've seen in all of North Carolina.  I don't have a beard, no tattoos or piercings, and I have kids the age of the staff.  I was one of the few fitting that description.  At least in a couple years I can say I used to go to Kindred before it was mainstream."}
{"text":"By far my favorite restaurant in the CLT area. Can't go wrong. Excited to see what Hello Sailer has to offer in the premium location."}
{"text":"Absolutely OBSESSED! Highly recommended for everyone, and my husband and I are already planning when to visit again!  The atmosphere is so fun and they did a great job with the decor/vibe of the place! It's very chill, and the staff is very nice and helpful.   The food is certainly the best part though :) my husband and I tried the duck fat potatoes first and these were delicious! We then tried the scallops and they may have been the most savory scallops I've ever had. We also had the trout and a pasta dish (I can't remember the official name) but both were absolutely delicious!   Overall the set up of the menu is meant to be that you order a few small plates and share, which I think is so much fun! Our waiter was so helpful in recommendations on how to pair things and whatnot, which was much appreciated.   Also a high recommendation on our lists is their cocktails! SO good and worth the uber drive home afterwards :)   At the end of the night they even treated my husband to a piece of cake for this birthday - it was so sweet and fun!   We will be returning soon :)"}
{"text":"After one meal, I could tell that Kindred is a kind, gorgeous, hardworking restaurant worthy of its accolades. But I was promised some superlatives, particularly the best shrimp roll ever, and I wish my very earnest server had gauged her audience, because what I got was a mayonnaise and tarragon shrimp roll, when I've made it at home with homemade aioli, fresh tarragon, orange rind, frisee, bacon, and red onion--based on one from a restaurant up the road in Louisville--and I rather like theirs, and mine, with our silly (but delicious!) flourishes. And if you promise the best shrimp roll, with all of its fresh tarragon, perhaps the potato salad with all of its fresh tarragon might not be the right complement to push. But this is a huge treat nonetheless, a needed uplift from the big boxes all around. Worth whatever drive, easily--and worthy of those accolades."}
{"text":"I will say my expectations were high and I was a little disappointed with my experience after it was all said and done.  Not with the quality, atmosphere, or service but with the menu and prices.  By no means is this a negative dining experience but their isn't a lot of value in what you get for the price you pay compared to other tapas style places I've been.  Also I know the menu is seasonal and changes a lot so this I guess could have also affected my personal experience but seemed heavily focused on seafood dishes and none of the choices last night seemed to compliment or flow together.  I don't want to harp on one experience because this is just one opinion but I don't think I'll be going out of my way to come back when Good Food on Montfort is less than 2 miles from my place.  Food Quality:  9/10 Service:  9/10 Atmosphere:  7/10 Menu: 5/10 Price: 4/10  Bottom line is that I left hungry and that should never happen when I spend $100+ for 2 people."}
{"text":"This restaurant was such a treat! Everything was unique and flavorful. We had the blue crab gnocchi and the scallops - delicious!!"}
{"text":"Delicious! The milk bread is complimentary and it's hard not to want to eat the whole loaf. My boyfriend and I had reservations on a Friday night and were seated promptly upon our arrival. The atmosphere of this restaurant is intimate and lovely.   We ordered the wagyu beef tartare. Amazing. The cauliflower. Delish. A small salad. Hit the spot. My favorite two dishes were the crispy oysters (lightly fried but juicy as hell) and the dish with muscadine grapes and ham (can't remember the name). The grape dish was a roller coaster of awesome flavors. It had a sort of melted buffalo mozzarella cream deal with olive oil and plum jam along with the grapes and ham. Salty and sweet. We decided that it sufficed as our dessert. I can't wait to come back to Kindred to try more!"}
{"text":"Fantastic meal!  A wide range of food, all of which was on point.  We had the poke, fried oysters, Korean fried chicken, duck fat potatoes, roasted chicken, squid ink conchiglia and cinnamon milk bread bun. All were delicious and perfectly cooked.  Neither of us could pick a favorite dish.  We made reservations to return on the way out."}
{"text":"Food very good. Service varies from good to poor. Cool atmosphere. Great mixologist"}
{"text":"Only giving four stars because I haven't been for dinner yet, but their burger is amazing! I should preface that I am an incredibly picky eater (think 12-year-old palate) and everything I had was delicious. I got the burger plain, with cheese only, and ate every bite.  We started with the cheese plates which were devoured in minutes. I liked that you could choose between regular or sparkling water. Staff was very attentive. I was upset though that they only have the cinnamon buns at dinner - I've heard great things!  Cute dining area, too, but gets busy around lunch and doesn't take lunch reservations."}
{"text":"I had been excited about dining at Kindred prior to their opening.  My interest is always piqued when talented culinary, bar and design projects are built in small markets.  From all indications, Kindred is crushing it.  I visited recently, and had some of the best service I've experienced in the state.  Attentive, on point, generous, a true treat.  And the food, well, it is also stand alone.  The best hand-made pasta I've experienced in a very long time.  The milk bread, too, absolutely excellent.    I can't wait to visit again."}
{"text":"Be aware! Low quality ingredients! Tasted 7 dishes. Below are comments for those 7 dishes. 1. Beef tartare: raw beef with over grown veggie. It is hard to chew. Parsley leaves are watery and rotten black. It is nasty. 2. Scallop: the scallop must be socked in the extremely salty water for more than 7 days to prevent from going bad. It is completely unacceptable. 3. Fried oysters: the oysters were already stinky. I just had one bite and had to spit out. It could cause food poisoning. 4. Flounder Crudo: Flounder is the garbage cleaner at the bottom of the water. Why chef created this raw dish? The restaurant did not tell where the flounder come from. Could the flounder come from China? I am very concerned. 5. Fried squid: this is the only appetizer you could eat. But the vegetables in the dish are overgrown and hard to chew. 6. Gnocchi with pork sugo: Because of the word \"sugo\", when I read menu, my understanding was the gnocchi coming with ground pork meat slowly cooked with tomato sauce. What I had was BBQ pork meat pulled with thumb thick size and mixed with gnocchi. The dish is black color. There was no taste at all. The gnocchi is totally watery. That dish should be called the gnocchi soup. The portion is very small. No taste, no presentation, no gnocchi cooking skill. 7. Pasta with sausage: sausages were not cut from the sausage links but it was some one fourth of palm size irregular shape ground meat. When you see those big chunks of black color meat socked in black color water together with the socked pasta, It's really hard to have any appetite.  The dish has no presentation look, no basic pasta cooking skill involved. I really don't understand how this restaurant could compare with other Charlotte restaurants such as Upstream or Lumiere, Barrington's, or even Good Food on Montford. At Upstream or Lumiere, those restaurants use fresh diver's scallop, Blue Point oysters and heritage poultry. For the final presentation, they use baby veges.  I did not see a single piece of baby veges in all 7 dishes at Kindred.  If I give 5 stars to Upstream, I can only give 0 star to Kindred."}
{"text":"Hands down the milk bead is to die for. The food and service is great! The duck fat potatoes are amazing. I just wish the potatoes are smaller cuts size and not the steak size fries."}
{"text":"Kindred was really good. I kept trying to let all the hype die down, and when I realized it wasn't going to, I made reservations for 6 p.m. on a Sunday night. The fella and I got there at 5:30 and had a drink at the bar. Our bartender didn't have much personality, so it's good thing the restaurant did. I love an old house feel with cozy lighting! I was surprised the bar wasn't more crowded (it was just us and one other couple), and the restaurant wasn't more full. I decided to tell the bartender I was in the mood for a cocktail, and my only requirements were no tequila and something that was a little warm and more sweet than sour. He whipped up a delicious bourbon cocktail, and I appreciated his ability to think on the fly, if not his personality.  We were seated upstairs, and our waiter was great - wonderful suggestions, perfect amount of checking in and leaving us alone. The milk bread alone might be worth one star. YUM. We started with the fried oysters at the waiter's recommendation. Now, I'm not a raw oyster fan AT ALL, but I decided anything's okay fried, right? Yep. The texture was perfect, and the taste was amazing. After that, I got the gnocchi, and the fella got the squid ink pasta (both recommendations from the waiter). They were both tasty, but we both agreed mine was better. We might've also gotten a side of duck fat fries because we hadn't yet had enough carbs. Ahem.  Thankfully for my scale, we skipped dessert, and thankfully for our wallet, the prices weren't nearly as astronomical as I was expecting. I can't say that I completely understand all the national praise, but Kindred is a solid place with tasty food and great service."}
{"text":"We are not foodies and we had a group of 8 of us spanning 60 years.  Even our youngest was pleased with Kindred.  This restaurant just opened and has helped to revitalize a part of the Davidson NC downtown which featured several shut down buildings in the aftermath of the Great Recession.  Having been to Davidson many times, but first time visitors to Kindred, we were surprised how spacious the restaurant was.  The decor and the vibe were great.  This would be a great date restaurant.   Our group tried a lot of different items. The milk bread was a favorite for all.  The baked egg was a great, unusual dish. Fried oysters were awesome.  Gnocchi with ragu - bolognese was terrific.  Desserts were great."}
{"text":"I'm far from a food expert, but I've eaten in enough mid- to high-end restaurants in Charlotte and around the country that I feel like I have a decently well-informed opinion. The short version is \"Great Food, Great Atmosphere, Very Expensive\".  We sat outside on a beautiful night and the ambience on the patio was pretty close to perfect. Not too loud to have good conversation, but not too quiet where you feel like you are intruding on those around you. Bottom line, sit outside if available and the weather permits. Our particular server was solid, no complaints, but nothing special to call out either. Very friendly, but not memorable.  I love the tapas concept and unlike some of the other reviews I've read, I thought the portion size was appropriate and the two plates per person was just the right amount of food. I've forgotten our entire selection, but we tried to hit most of the highlights that day. Duck fat potatoes, Grouper, Gnocchi, Scallops, Peas. It was delicious. We also got a selection of the cheeses between courses, and they were fantastic.   So the only reason this is a 4-star review rather than 5, is that I just can't get past the cost. I'm all about the market determining the price and if they are rammed every night and people are happily paying, then I'll applaud them, shut up, and go on my way. But in my opinion, everything feels about 30-40% too expensive. There were four of us. We had about 8 dishes (again, small plates), and two bottles of the least expensive wine ($40) on the menu and our total bill with tip was almost $300. Removing the wine and tip, that's about $160 for 8ish small plates. As I mentioned earlier, the portion size felt fine, and the food was delicious, but that's a pretty stout bill for 4 people no matter how you slice it, and certainly on the high end of any restaurants in the surrounding area that offer comparable quality food.   I will go back again, but at those prices, I can't make it a regular destination."}
{"text":"My husband and I dined at Kindred on Friday evening. We've been wanting to try kindred for awhile now and thought that with all the waiting we may be disappointed. Kindred did not disappoint. We've been to many nice restaurants but I can honestly say this was one of our top 3...ever. Everything from the service, the wine and the food was just amazing. We were already planning our next night out before we ordered dessert. The crispy oysters, squid ink pasta, beef tartar...it was all incredible and presented so perfectly. A truly memorable experience."}
{"text":"So I've waited to go to Kindred because of mixed reviews from friends and I wanted to wait until the hype had settled. I took my daughter for lunch and we had the shrimp roll and the falafel.  I'm not a falafel fan but my daughter enjoyed it and it was accompanied by a good sized salad.  My shrimp roll was tasty but I must say the roll itself was better than the shrimp salad it held.  The shrimp salad tasted fresh but was a little bland the roll on the other hand was delicious as were the fries.  The atmosphere is very pleasant and the price was reasonable for lunch.  Will probably try it for dinner and see if it becomes one of my favorites....still holding out hope."}
{"text":"Wonderful experience. Incredible service only matched by the wonderful food. Enjoy a surprise cocktail on the bar!"}
{"text":"I went here expecting a lot; one of my clients said it was his favorite restaurant around (he has since changed his mind).  The place is clean, the food seems fresh, but you get a TINY amount of food for a large price.  The best part of the meal?  The milk bread.  It was awesome!  But it went downhill from there.  The service was extremely slow.  I ordered a dirty martini, and literally 20 minutes later I received it.  It was in a small wine goblet (tiny cup with a wine stem), and it was maybe 3 ounces.  Martinis come in martini glasses!  There was a nice garnish - a very tasty green olive on a metal pick - but the drink was a disappointment and overpriced.  The meals are just too small for the price.  I got the mussels - the sauce with them was very tasty - but not a lot of food.  The ahi / sashimi tuna was tiny with no flavor.  I get what they're trying to do, but I'm in Davidson, I'm not at an art gallery, and I've been to incredibly \"artsy\" fine-dining restaurants... this one isn't cutting it.  We got the check ($80 for two TINY appetizers and two TINY drinks and slow service) and went to eat at another restaurant."}
{"text":"Went for lunch for the 1st time the other day. A really great spot. A little noisy downstairs, so sit upstairs if you want some quiet. The food and the service was terrific. We enjoyed the olive app and the falafel. Best falafel I have ever had!!"}
{"text":"I had a cocktail at the bar, great environment. Had a date and got dinner; the scallops were hands down the best I've had in CLT, the sauce for the scallops just puts them a notch above. The ravioli was excellent, the only reason I'm giving this three stars is because when I went it was storming so I took my nice (over 20 dollar) umbrella. When we left dinner the umbrella had been taken. Probably not managements fault but just a little salty about that"}
{"text":"Pimms cup!!!! I loved this restaurant!! We came for date night a few weeks back and loved it. The salad was so simple but so delicious! I can't praise the milk bread enough. I can eat that alone for a meal. It's heavenly. Super soft and warm fluffy bread.  We got a couple pasta dishes and a few cheeses for dinner. I loved how the pasta dishes were unique .(I got the squid ink pasta) Service was a little slow but I think it is the norm for a fine dining restaurant. I was just hungry and really wanted my food asap. Staff was super helpful and attentive. Expect a fantastic dining experience here.   I can't wait for the weather to cool down so I can sit outside and enjoy a couple more of those Pimms cups and milk bread!"}
{"text":"Quite expensive for small plates.  I went with a group of friends. For one of my dishes I ordered the beet salad with candied cashews and goat cheese.  Plate came with lettuce and a few pieces of beet, no cashews or goat cheese.  Server said \"we are out of those items\".  I asked if the price was reduced and was told she would have to ask. Manager came over and said he would \"buy\" my salad for me.  I thought that was a little pretentious.  Small plates are fine, but the price reflects a much larger serving.  Very loud inside.  The bread however was delicious."}
{"text":"Had lunch today everything was excellent  our waitress really knew the menu and it's a good thing because some items needed a clearer explanation  That being said service and food was extraordinary and very interesting and very delicious Sad that they only serve the milk bread at dinner Would liked to have tried Wish this restaurant was closer Traffic on 77 North was real bad But would go back because every thing was great"}
{"text":"Left a lot to be desired. We ordered the Beef Tartare, NC Tuna and Smoked Duck Breast pasta. The tartare was very good but the other two were over-salted to make up for a lack of real flavor. The duck breast pasta tasted like it was covered in brown thanksgiving gravy from a can."}
{"text":"Driving through Davidson on our way to Charlotte for a concert, we decided to make a reservation. Had heard a lot about the place (including Hot Ten 2015 from Bon Appetit Mag), and had been wanting to try it out. It did not disappoint!  We were celebrating our anniversary, said so when making the online reservation, and so were greeted with a champagne toast. Soon after that the complimentary milk bread came out, and Lord have mercy. Think of a brioche, but better. With butter.  We ordered the spiced turnips, pork arista, creamed greens, scallops, and artichoke ravioli. My favorite were the greens. Parmesan cream sauce with a nice kick. Everything else was delicious, as well.  They remembered our anniversary again and brought out a complimentary dessert. We ordered a dark roast coffee to go with.  Perfect meal and service."}
{"text":"Didn't actually get to eat here but it has an excellent reputation so they get 3 stars for that. Staying at the Davidson Inn with my 91 year old mother. Word to the wise make a reservation no matter what night of the week. We walked over in a driving rain (no reservation) and found there was no availability. The hostess was kind of accommodating but felt she could have gone the extra mile to squeeze us in at least at the bar. Ended up at Toast cafe and was pleasantly surprised!"}
{"text":"I can't say enough great things about this place - one of the best meals I've ever had. Everything we tried we LOVED. The complimentary milk bread was delicious (the butter was even better)! We started with the Wagyu Beef Tartare and the Salumi plate. The tartare was by far the best tartare I've ever had - crème fraiche, fried shallots, parsley, and egg yolk - rich and delicious. The Salumi plate was equally delicious. We also tried the squid ink and sea urchin butter pasta... all I can say is WOW. Phenomenal stuff. If I could afford to eat there daily, I would without questions. Go try this place!! I believe the menu changes daily, so everything is super fresh!"}
{"text":"Great meal at Kindreds restaurant tonight Daniel our waiter did a great job.  Joe Kindred came out and met us, felt really special.  Food and service was wonderful. Will be going back.  Thanks to the Kindred team."}
{"text":"Waking around town on a rainy day we decided to try this restaurant since we heard good things about the food.  We were greeted by a hostess that did not smile and appeared to have an attitude, not a good first impression. She gave the place an unwelcoming feel, which is why only 3 stars. Environment plays a huge role in a rating.  My friend and I got the sunchoke--spelling? Soup which was made from sunflower root, very creamy and delicious.  My husband and friend got the burgers and I got the shrimp roll. For sides we had the cucumber salad, potato salad and kale salad. Kale salad was too salty, the potato was delicious!  Our server was very informative. He asked if we have been there before and since we did not he explained how the ingredients were local and described a couple of his favorite dishes, which we all enjoyed hearing about!  I would go back for dinner and get a nice cocktail. They look good!   The decor has a fancy feel, would be a good date night place ( hint hint ) :)"}
{"text":"Phenomenal food and amazing service!  The complimentary milk bread is to die for and the wonderful variety of culinary treats is great.  I was a tad surprised by the tapas/small-plate style of the menu, but the server was nice enough to let us know about that before ordering.  I'm glad I had a sandwich a few hours beforehand because otherwise dinner could have been quite pricey.  I ended up with two plates and a cocktail ('twas delicious btw) and left feeling on the better side of content.  The inside (for the short time I walked through it was adorable and gave off a modern rustic vibe, very fitting to the downtown Davidson area.  Wound up sitting outside for dinner, which was fine because it was such a beautiful evening.  Well worth a trip up from Charlotte.  I WILL be dining here again."}
{"text":"The food here was really good. I had the skillet burger (includes pickles, onion, cheddar cheese and aioli) for lunch and it was juicy and delicious. The fries were nice and crispy and came with an aioli sauce. The portions were generous but not overwhelming. The service was wonderful both inside and outside (you can sit in front of the restaurant). Truly a great staff."}
{"text":"Honestly I love the lunch way more than the dinner. Working at Lowe's Corporate I probably stop by 4-5 times a month. The Skillet Burger is absolutely one of the best in Charlotte and the fried oysters will blow you away.  The Caesar salad is a very authentic caesar salad, so the anchovy might be a little overwhelming. Not really a fan of the crostini they serve with the cheese plate.  Their cocktails are excellent.  It definitely gets crowded and loud, and later into the evening even if there is a reservation there is no way you'll actually be seated on time. It's a madhouse by 8pm most times I've been that late.   The chairs are very light/hard and the tables are small. It's intimate but not cozy.  The staff knows me well and I always get excellent service."}
{"text":"Great atmosphere ( although a bit dark) Bread wonderful.  Fried oysters first ones I have ever loved.  The squid endured pasta was one of the best dishes ever!  Would go again!"}
{"text":"I'm not a fan of the drive up I-77 if you're from Charlotte, but it's well worth it! The James Beard Foundation noticed this gem for a reason. It.is.good.  The atmosphere is upscale casual, the room is bright and cheerful. We had a party of five and sat by the window, which was a perfect location to scout the dishes coming out. Farm to table, the food is tapas style (order two or three per person). Drinks were solid. All of them had a good twist to their traditional counterparts. You also can't go wrong with the bartender making you something special based on your preference.   Started off with the oysters, they were great! Well seasoned and crispy. The big dissapointment of the night came in the steak tartare, I have to say it was too jazzed up, too many flavors covered the actual taste of the steak. All that was forgiven when the skirt steak came out: perfectly seasoned and a sauce to die for. I feel it was the best dish of the night. The milk bread (perfect by itself) was a great tool to slop all the extra sauce. The squid was good, but nothing outside of the ordinary... very well executed. Another interesting dish was the squid ink pasta with sea urchin sauce topped off with local shrimp - a close second favorite.   I'm not a sweet toothed person, but I would almost run over someone for a piece of their birthday cake. It is one of the best I've had."}
{"text":"Kindred is way, way, way overrated. I've eaten at several James Beard Award winning restaurants and the have all been exceptional. Kindred is not close to any of them. The menu lacked continuity and not nearly enough protein dishes. The cauliflower, Hamachi and crispy oysters were all OK but the trout dish was very salty, almost to salty to eat. The salt overwhelmed the dish and I couldn't taste the other flavors. Nothing stood out as great.   The wine list was not good and our waiter had no knowledge of the wine list. I ask about a couple bottles of Syrah and he didn't know anything about them so he ask a \"guy\" who he thought could help but didn't offer much good information. I chose a $95 bottle of Syrah assuming it would be good. I described the style of wine I liked and this was not what I described and not very good.   Overall, Kindred was more about food fashion than flavor and quality. I won't go back."}
{"text":"Food: unique and delicious. Wine and cocktails: great flavors. Service: very friendly and personable. Atmosphere: so cool! Basically loved everything about this place. The squid ink pasta is a must try."}
{"text":"After SO MANY friends recommended Kindred to me, I finally went to give it a shot tonight. Going in I was expecting a trendy atmosphere for small sharing plates. IT DID NOT DISAPPOINT.   The milk bread served to start the meal is incredible. If you don't eat gluten, consider changing your ways if only to taste this bread. It's perfect.  Our server, Kate, was awesome. She asked us to tell her a story, got to know us on a personal level, shared info about herself, and then recommended a bunch of options with pairings. We ran down what we wanted and she divided up what would come out in waves 1 and 2 of our meal.  Wave 1: pickles (INCREDIBLE), beets (FANTASTIC), fried oyester (AMAZING), gem salad (LOVELY), beef taretare  (I'M RUNNING OUT OF ADJECTIVES HERE...), duck fat potatoes (OMG). Everything was paired with sauces and seasonings that were PERFECT.  Unfortunately a very bad storm blew through Davidson and the entire street lost power. The staff at Kindred couldn't have been more complimentary. They served sparkling wine free of charge for the inconveinence (like it was their fault!). Once they determined that the kitchen could not be turned on they politely checked us out and sadly we were on our way.  I will absolutely be back to try the dishes and dessert items that we weren't able to sample tonight. Although brief, thank you to Kindred and your exceptional staff for making this a fun treat!"}
{"text":"The bread is reason enough to go to Kindred.  I'm serious.  After a nice long drive up to Davidson on a Saturday night, I sat down for dinner at Kindred.  It was a special occasion (birthday) so a special place to eat was certainly in order.  As you walk in, this place is nice and light with a slightly rustic feel.  The hostess was there greeting all of the guests with a smile.  The downstairs seemed pretty lively (great for going out with friends) while the upstairs was more tables of 2 and couples.  Both had the same, cozy feel.  We arrived 15 minutes early, expecting to wait and have a drink at the bar.  Instead, our table was already ready and we were seated early.  Within 10 minutes of being seated, two things happened.  First, our waiter came to introduce himself and second, a skillet of bread landed on our table.  The bread was fantastic.  So warm and fluffy with some salt sprinkled on top.  It was devoured before the drinks even arrived.  Despite the quick bread service, we were not rushed out and were able to have a long, leisurely meal.  I do wish the waiter was walking around a bit more, but it was also nice to sit there with drinks/food with a date and not be disturbed too much.  We started with the pickles.  My grandma used to call me a pickle puss when I was little because I ate so many pickles, so I had to try.  They were pretty good.  We also ordered the the beef tartar (it was ok...could have used a bit more flavor), a veggie side (delicious times ten) and a pasta (YUM...worth the calories).  To finish off the night, we had the Cinnamon ice cream and cookies (they were really good, but I do wish we had ordered the Cinnamon Roll like the waiter recommended).  In the end, we left happy, full and glad we made the drive to this great restaurant.  I'm sure that if Kindred was located in Charlotte, it would be a hot spot, for sure.  It's kind of nice that it's not, because it gives you a great reason to take a nice drive up north."}
{"text":"There's a lot of hype around a lot of restaurants in Charlotte and surrounding areas. Most of these restaurants are just that, hype with very little substance to back it.  Kindred is different because the hype and expectations are not only met but exceeded.  The space is perfection, from the floor to the ceiling. The service is top notch. But the food, oh the food!!  My first visit to the restaurant was with a group of foodie friends and we literary ordered the whole menu. Not one disappointing dish.   On a more recent visit, I dined at Kindred with my husband as part of our wedding anniversary celebration. Here's a breakdown of what we ate:  Milk Bread - if you love carbs, if you love bread as much as Oprah loves bread, this is your bread. Grandfather's Pickles - I love pickles and pickled vegetables and these hit the spot so hard that I came home and tried to recreate them.  Duck Fat Fries - large, hand cut pieces of potatoes served with homemade lemon aioli. Get them.  Strozzapreti - the unusual combination of spicy chilies and vanilla bean will make your taste buds wonder why you never thought of this flavor combination before. Rigatoni with lamb - hearty without being heavy.  But wait, there's more!  The cocktails!  You have two options: order from the cocktail menu or get a bar keeper's choice. Do both, you won't be disappointed.  Pro-tip: make a reservation...weeks in advance, especially if you would like to dine there on a Saturday."}
{"text":"This is my absolute favorite restaurant.  The ingredients are so fresh and unique.  Their cocktails are phenomenal.  I like to do bar keeper choice to see what they come up with."}
{"text":"My husband and I loved the food and the atmosphere! It didn't disappoint and we are even considering making it \"our favorite spot\" in Davidson. Highly recommend the ravioli!"}
{"text":"This really is a fantastic dining establishment.  The presentation and service was classy but did not feel overly stuffy and pretentious.  The cocktails were excellent, the wine selection is solid and they bring out free milk bread and house culture butter before you even order anything.  The milk bread is ridiculous.  I could eat an entire bread \"muffin\" and be happy.  The menu changes based on the seasons, I assume so they can always use the freshest ingredients.  We went on a double date and each one of us ordered two plates off the menu which were then brought out in the order of light to heavy, excellent idea and it allowed everyone to try it all.  Everything was delicious (the beef tartar... wow).    Great place to take a date but also with a group of friends, especially if you sit at one of the outdoor tables in the alley.    The only downside is the drive.  It's a trek to drive up to Davidson from South End but it was well worth it."}
{"text":"Charming and very well thought out design. Bright, clean and inviting. Adorable touches like mints and floss in the ladies room added to the cozy environment. Perfect mix of classic touch, the family silver and modern plates. Three of us dropped in for lunch. We got there just in time, as every seat was filled within 30 minutes. We still recieved prompt, friendly service throughout. A delicious menu, we had trouble picking out just 3 items! The warm castelvatrano olives were delicious, the avocado sandwich and seitan salad were impressive. We ate every bite. Plenty of options for every diet. We were given a small desert of house made chocolate chip cookies and cinnamon ice cream. The pour over coffee provided a perfect finish to our afternoon. I have nothing negative to say. I can't wait to go back. Worth the drive from Greensboro!"}
{"text":"Met some friends here for dinner last night and had a wonderful experience!  The milk break came right away and was way better than I imagined - super rich and fluffy.  We had a few cocktails to start and brought a bottle of wine to enjoy with the main meal (their corkage fee is $20 for bringing wine).  My pimm's cup was delicious and came with sliced cucumber and mint.   We ordered some appetizers to share. The fried oysters, hamachi crudo and duck fat fries were all fantastic!  The hamachi was similar to a ceviche type dish - very good.  I ordered the squid ink pasta with shrimp as my main course and was very pleased.  The pasta is served a little al dente. The flavors are amazing.  Our server was very friendly and attentive throughout the meal - great customer service where many servers greeted us on our way in and wished us a great night on our way out. We didn't leave room for dessert, but will definitely come back for a nice dinner.  I didn't take pictures since there were already so many on here - photos are accurate!  That birthday cake looks delicious..."}
{"text":"What can be said about Kindred that hasn't already been said?  Excellent service with unique and amazing food."}
{"text":"Went ahead and started with the fried oysters to start with and they did not disappoint and were paired nicely with a dill dipping sauce and chile oil, at which point this is where things peaked. The burger was two patties with typical options and served with fries, which werenot bad by any means, and basing this on a sole visit will say it did not live up to the reputation :/"}
{"text":"The best restaurant in town! Incredible space and food is divine. Fried oysters are the best I've ever had. If you go for lunch, it's even more affordable."}
{"text":"The menu at Kindred is so vast and vibrant it makes it difficult to choose what to order to eat. The multiple times I've been there the wait team is amazing and respond to my questions with knowledge and have excellent suggestions. Crispy oysters are my favorite thing at Kindred but I have tried several sandwiches as well  and they are equally as delicious. I could eat my entire meal off of their appetizer menu alone. Food is great, staff is great and the restaurant itself is simply gorgeous. The quality of the ingredients is excellent and if you keep an eye out you might see Mr. Kindred himself buying from the farmers market in Davidson. Highly recommend Kindred!"}
{"text":"This was my second time here and WOW!   There are no words to describe the service, let alone the magnificent food!  You HAVE to go!"}
{"text":"We drove up to Davidson for lunch, stopped into Kindred based on Yelp reviews and a friend's recommendation.  Wife and I both had the shrimp roll which was great,  perfectly seasoned with just the right amount of dressing and some of the best bread I've had in a while.  Just well prepared great ingredients.  Washed it down with a Belgian white craft beer they had in the can.  Would definitely like to try dinner here. Ambiance is a classy, eclectic mixture of classic and modern decor.  Can confidently recommend."}
{"text":"Great place! Unique menu which that change often. It's a small plate kind of place where you share different apps. Which I prefer over ordering one main meal anyway. They give you this baked mik bread that is so delish. It comes in a ceramic pot with butter on side. We ordered the steak tar tar, duck fat fries, fried oysters and rhe trout with root veggies. One wasn't better than the other. They were all so different and amazing. The service is top notch as well. Since it was my mom's birthday, they brought the decadent chocolate cake. Yum! Served with vanilla icing and vanilla ice cream. 5 star's all the way! Highly recommended and will be back."}
{"text":"Kindred is phenomenal. It's hands down my favorite restaurant in LKN. The decor is rustic modern...think Fixer Upper mets West Elm. The staff is warm and attentive but not to the point where you can't eat your meal. In short, it's a comfy and relaxed atmosphere.   Now on to the food. Kindred is a farm to table restaurant. Their menu changes frequently based on what is in season. Their features range from innovative to familiar. The structure of their dinner menu is that of tapas, you order a series of small plates and share them. Of course you don't have to share but if you're like me and want to try a taste of everything it's ideal. If you stop by for lunch, you won't be disappointed either. The lunch menu is fixed and features dishes like kale cesar salad, skillet burger, and shrimp roll. Something about the food is cozy. Check it out!"}
{"text":"One of the cutest restaurant I have ever seen. The staff was great and very accommodating. The food was great and I highly recommend ordering a cinnamon roll for dessert."}
{"text":"Everything was very good. The milk bread was warm and fresh. Scallops were perfectly browned. Mussels melt in your mouth in great sauce. Gnocchi with lamb and tagliatelle with hen ragout were perfect. We finished with the best cheese ever! Food was small plates and we shared. Only bad thing was very noisy. No need for music could barely hear it. I will go back."}
{"text":"I have been craving duck fat potatoes and milk bread since eating here a month ago!    I had heard plenty of buzz about Kindred so I was little skeptical at first.  We went on a Saturday night and it was packed full!  Downstairs was crazy busy with people 2 deep at the bar.  The bartenders took great care of us though as we had to wait 45 minutes for our reservation (not the restaurant's fault, the people at our table would not leave even after paying their bill).  We were finally seated upstairs.  To make up for the wait, we were immediately served a couple of appetizers and milk bread.  Not expected, but appreciated!    We ordered a number of things off of the menu.  I specifically ordered the pork belly ravioli and duck fat potatoes and I did not go wrong!  The pasta is freshly made and there was just the right amount of pork belly.  I have had duck fat potatoes before and was looking forward to trying Kindred's version - they did not disappoint!    The service at Kindred was top notch and fun.  The bill wasn't as pricey as you might think.  I'll definitely be back!"}
{"text":"Came here for dinner and it was amazing! We had a reservation (very recommended) and they were running a bit behind. When we got to the table the brought us a complimentary charcuterie plate which was delicious. We started with the duck fat potatoes and Wagu beef tartar. Both were amazing! My date got one of their pasta dishes (house made) and I got steak. Once again it fantastic! We didn't get dessert, but it all looked delicious! I will be back and recommend that you go too!"}
{"text":"Across the street from Davidson College, this gem of farm-to-table awesomeness is further proof that the New South is a hot bed of culinary delight. Outdoor seating under strings of charming white lights, twinkling like near stars adds pixie dust to an already magical experience. The corn soup I started my meal with was so good I wanted the recipe. While the pasta was unmemorable, the waiter warned me so I can't say I didn't know. The fresh, hot bread, the baked-from-scratch \"birthday cake\" dessert (it's on the menu-- no birthday required), the lovely wine pairings... Truly memorable meal."}
{"text":"Finally made it up to Davidson to try kindred and it was well worth the trip. The intimate atmosphere and sophisticated decor sets the mood as you are waiting to be seated. The service was fantastic and as everyone says, the milk bread is delicious, addicting even.   We ordered tapas style and started with the brassicas, hamachi crudo, wagyu beef tartare, and crispy oysters. Everything was great but the hamachi crudo was my personal favorite. We then ordered the emmer wheat rigatoni and annatto seed bucatini - both were amazing! I had never eaten venison before and it was life changing in the ragu over the rigatoni.   We finished with a milk bread cinnamon roll (you have to order them when you sit down with your drinks as they sell out quickly). Despite the amount of milk bread we ate prior to dessert it was still sinfully good. Will be back again!"}
{"text":"Love this restaurant and its farm to table fare. I tried pork belly, duck fat fries, milk bread, fresh pasta with a egg yolk inside of it and their roasted chicken. All of it was delicious. The charcuterie board with house cured meats was a highlight.  The apple galette w/ homemade walnut ice cream was delicious as well."}
{"text":"It was nice, the food was good. Service average. My only complaint, we had to wait for tables, but there was alot open."}
{"text":"My husband and I drove almost and hour for our anniversary date and it was worth the drive!! Such amazing staff and an incredibly delicious and creative menu."}
{"text":"Don't let the drive scare you. Although, I will admit I-77 is scary! A visit to Kindred is a must and worth the drive from Charlotte up to Davidson. We actually made a weekend of it, eating there Saturday night and staying over in the nearby Homewood Suites. Smart choice since my favorite part about the place turned out to be the Bar Keep drinks. I might have had 3. Don't judge me. You tell the man what you like in a drink (\"rum, fruity or citrusy, herbs\" is what I think I threw out there) and he concocts a special brew just for you. It makes me feel pretty darn special and each drink was just what I always wanted but never realized...   The restaurant itself is gorgeous. Take time to look around as you walk in, especially if they seat you upstairs. The bar downstairs is breathtaking. Every little detail is so well thought out, from the little containers the milk bread is served in to the \"employees must moon walk out of the bathroom and also wash their hands\" sign. You can tell the design of the place was a true labor of love.   As you can likely see from my photos, we ordered almost everything on the menu. Or, so it seemed anyhow. In our defense, we were there with a group and shared everything among the table. 18 courses divided by 6 people doesn't sound so bad, right? Right?!   So, my favorites of the evening -- besides the drinks, of course -- in this order were the milk bread, duck fat potatoes, wagyu beef tartare, rigatoni with sausage and chocolate birthday cake. I feel like they missed the mark a bit on the seafood dishes we tried. The ceviche was really under seasoned and bland. The scallops were served with beets. And while I should have known better as I really hate beets, think the beautiful scallops were totally over powered by the earthy (or, as I described them, dirty tasting) beets.   Service was a B-. The restaurant was packed when we visited at 7pm on a Saturday and while our waiter was friendly and attentive, there was a little personality lacking. I wanted to talk to him more about the food, his recommendations and favorites, etc. but seemed like I was being a bother or keeping him from other tables. We also had a few long lulls where we needed something, wanted to order more plates, another drink, etc. and couldn't catch anyone's attention.   Kindred changes their menu up regularly. So, I'm excited to visit often to experience their offerings in the Fall, Winter and Spring!"}
{"text":"what a surprisingly delicious find.  a friend recommended this place to me and I'm totally hooked.  the salad was great, the mushroom ravioli very tasty, and the sweet bread cinnamon roll was absolutely to die for.  i would go to this place just for the cinnamon roll."}
{"text":"Kindred is located in the charming downtown of Davidson. We came for our 7:00 reservation for 11 people which turned out to be 7:30. No biggie, they still sat us within about 15 minutes. Our server was very enthusiastic and really knew how to sell us on the menu. It's small tapas, so between 4 of us on one end of the table, we got 7 plates which wasn't really enough in my opinion. I would recommend two to three plates per person. They change up the menu frequently based on what they have on their family farm with a few staple items. My favorite that I tried was the Carolina gold rice with pork. Completely different than what I imagined when I read the description but in a good way. It was very light yet full of flavor and textures. Note that they do not split the checks, but they will evenly split the bill between various cards. Also double check your bill to see if gratuity was added. Believe it was in our case but we didn't know and ended up double tipping which I guess was deserved based on the service."}
{"text":"This place lives up to the hype. Had been waiting for months to eat here after Bon Appetit awarded Kindred the best new restaurant in America in 2015 when my boyfriend surprised me with birthday reservations! We weren't super hungry so only ordered three dishes - the fried oysters, hamachi poke, and the bolognese. All were to die for! The thing about Kindred that makes it stand out is its attention to detail - from the unique place settings to the delicious milk read, and even their fabulous bathrooms, I would definitely recommend it!"}
{"text":"This place is amazing, not only for the food, but I have to really point out that the staff here is above and beyond (very very pleasant and friendly!). My mom found this place and from the minute I walked in, I was in love! Such an airy crisp atmosphere! We sat in the upstairs area, which was more spacious and you had nice views of Main Street from there!  Okay, I know this may sound silly, but they had a brand of Ginger Ale called Fever Tree (see pic), wow was that so refreshing! It was not super sweet. I can't even explain how good it was! Then I order the Buttermilk Chicken Salad... pause...WOW!!! Okay, so the Chicken were whole pieces that were separate, but laid on the sides of the salad. I like that they did incorporate it in the salad and drench it with salad dressing. I actually was able to bring some chicken home, because they give you so much. They don't have ranch, which I was originally sad about, but then I tried their buttermilk dressing, OMG, I wish they had it there to buy. The salad wasn't too salty, it was the perfect amount of rich rich flavors!! Now fyi, they change their menu daily. I think that's pretty cool. My mom had the shrimp roll and daddy had a pulled pork that was great! The Cole Slaw was extremely rich in flavor and had a beautiful color to it. It was vinegar based, I think!! Soooooo yummy!! I can't wait to come back here!! Well done!!"}
{"text":"Love this place, food seems more salty than normal. Maybe a new way of things but could not finish our meal. Sad"}
{"text":"The atmosphere, service, wine selection, and food are all OUTSTANDING!!! We will definitely be back many many times!"}
{"text":"Amazing food. Great service. Everything we got Was delicious. The fried chicken was out of this world, we're from NY and have done a good amount of traveling and its hands down the best fried chicken we ever tried, melts in your mouth.the seitan salad also phenomenal. Felafel was delicious too. Must try."}
{"text":"We had a lovely experience at Kindred last Friday evening.  When we arrived for a reservation our table was a bit late so we had a drink with the bartender and closed out.  At our table I ordered a bottle of the Barbera which was fabulous, definitely one of the highlights of the meal.  I started off with the salumi which was quite excellent and featured this really spicy mustard which made my eyes water but was so delicious that I wish I could have it everyday.  I did not really love my pasta dish main but that is because I don't like pasta.  In hindsight I wish that I had ordered another starter or two.  There were some excellent looking choices.  I also wish that I had gone for the fish dishes."}
{"text":"A great small unique restaurant worth every effort to visit in Davidson NC.  Unique food in a small town setting.  Make sure you have a reservation- the bread alone is worth the trip!"}
{"text":"Initially heard mixed reviews about this place and I live in Davidson.  Finally had dinner here and IMHO it's the best restaurant in the Charlotte area.  Great menu, food is excellent, portions are normal but worth every penny and the service and ambiance is something out of the best Las Vegas hotel and casino.   So grateful I don't have to travel far at all to have an excellent dining experience and cuisine!   Try eating a bit of everything \"tapas\" style and for sure order all the cheeses they offer you.  You will not regret it and understand why I believe Kindred is the Best in Charlotte!!   Toast for Breakfast, Kindred for Dinner.  That's where you eat when in town."}
{"text":"Fantastic meal, small plates but the salad fed us all and was delicious, the squid pasta was unusual and really took the biscuit - it was great. Will definitely go again and again. Even our two girls loved it!!"}
{"text":"Great food. Ate outside on a beautiful evening. Really enjoyed how quiet downtown Davidson really is. Kindred has great service. Just don't assume small plates mean small price tag."}
{"text":"This was such a great local place for a special dinner.  We went for our anniversary and loved our experience.  The waiter was very knowledgable on all of the food and wine selections!  I would DEFINITELY suggest it to anyone looking for a fun / intimate night out!"}
{"text":"I was very excited to try this restaurant. I found it on Yelp with great reviews so maybe my expectations were too high.  We got to the restaurant at 6 and were told that they were booked for the night but the bar is first come first serve. Which was fine, good for them for booking up.   The bread they give you is amazing! Could not stop eating it.  The food is served more tapas style. Very expensive and very small portions. Everything we ordered tasted good but you only get a few bites.   Nothing I will be craving in the future which is what I want when spending that kind of money on food.   Friendly service and cute atmosphere but I left hungry."}
{"text":"Jesus, how have I never reviewed Kindred before? Every meal I've had here has been spectacular, from the milk bread (Good Lord, that milk bread...the milk bread that launched a thousand ships, I tell you) to cocktails to dessert. This place has the fire to back up all the smoke you've been seeing in the last couple years. Expect a lot of variance in the menu depending on what's in season. In spite of being a bit of a BFD since they landed on the Bon Appetit list, Kindred still feels like it's trying to stay humble and not get too carried away by the surely near-overwhelming temptation to fall down the hipster rabbit hole (OK, maybe it grazes that line, but their passion for top-notch food more than makes up for it). It's a bit of a drive from Charlotte, so visits aren't as frequent as I might like. But it's always a treat and I love going here. Expect it to be busy pretty much always. Do yourself a favor and make a reservation!"}
{"text":"Cocktails were delicious.  Unfortunately my tagliatelle and mushrooms dish was definitely over salted (but otherwise tasty). I'm inclined to give them another shot."}
{"text":"Nice location , crafty , cute place inside . Food was just ok. Gnocchi was very salty . I didn't feel the poke was good quality meat. Fried oysters were very good. Scallops were undercooked but did have a good taste. We got chocolate cake since it was my birthday. Cake was dry. Service and bartenders were great but I probably won't go back."}
{"text":"Ok, ok.  I rarely give five stars, but after going there again, this time for lunch, they earned my love even more.  The new sandwiches on the milk bread were fantastic.  Loved the kale salad, loved the fries, loved sitting downstairs this time!    So to recap... Go for lunch or dinner.  Sit on the main level.  Order one of their signature cocktails.  Love your food.  Go back for more."}
{"text":"That bread they deliver at the beginning of the meal, even to the sad single sitting solitarily at the bar, is mighty fine. Soooo sumptuous. I need a recipe asap (let's be honest, I would never make it at home).   The menu changes based on seasonality of ingredients so what you get one time, might not be around the next. That said the hamachi crudo I had was on point. Lots of different textures and flavors playing nicely off each other. The squid ink conchiglie was tasty, but the portion was pretty small and the flavor was a bit dull, not nearly a savory as I would have liked.  No dessert, but I did have a fantastic beer by Mikkeller...rasberry blush berliner weissbier. Slightly sour with some cool coffee notes at the end of the taste."}
{"text":"Was anxious to give this one a try after all the local write ups.  I also saw the recipe for their milk bread and tried it at home, and we loved it!  The bread at the restaurant was even better!  The food is tapa style, and French leaning in flavor and preparation.  Service is excellent, but the tables are small and a bit cramped to serve multiple plates.  Another tiny wine list w/ only 1 Chardonnay option, but did have a limited bar focused on specialty cocktails with unique flavor profiles.  I personally prefer unique food and more subtle cocktails so they don't overwhelm the flavors of the meal, but that's my personal preference.  I suggest you give this one a try if you are a foodie - check out the menu attached!  If not, this may not be a good choice.   We really liked it an plan to go again."}
{"text":"Outrageously good restaurant. From start to finish the meal was outstanding, service was friendly and well-informed and the space was cheerful and comfortable. Family of 4, daughter on Davidson college visit. In particular, the creative beef tartare was devoured by all of us, the crispy oysters with heavenly sauce delicious, addictive duck fat potatoes with aioli sauce, and milk bread, but the squid ink pasta with sea urchin butter was seriously one of the best dishes I've ever had in my life. We wanted to come back the next day but sadly they were completely booked. A different server heard our daughter was visiting Davidson and came over to welcome her and tell her a little about his (very positive) experience at the school, which was incredibly nice. If only all restaurants could be this good! So sad we live so far away in NYC!"}
{"text":"This place is tremendous. We got the name from a local popped in Saturday lucky to get a seat. So glad we did.  It is all small plates for sharing. Everything made in house fresh. Finally a place where my daughter who has a peanut tree nut could eat the bread.  Food was great and so was the service. I had gazpacho, beef tartare, some beets, very attentive wait staff.  Will run you about $40-$50 per person if you drink."}
{"text":"Kindred is one of the best restaurants in Charlotte if not the best. It's only real downfall to me is the 30 minute drive from downtown to Davidson. Everything we tasted was delicious and i left so over stuffed because i couldn't stop myself from finishing each plate. Reservations are definitely a must.  The milk bread that is served right when you sit down is now and forever my favorite bread. The fluffiness combined with the salty crust is amazing. It was the perfect palette cleanser between courses.   My mom and I started our meal with the first of the summer squash. Neither of us are huge squash people but we devoured it quickly. The buttery flavor was so rich but with a small portion size it wasn't overwhelming. Next we got the Scallops. They were served on top of corn and were seared perfectly. We then got the squid lettuce wraps. These were essentially Asian inspired calamari. They were light and a great in between course. Lastly we got a pasta that i cannot for the life of me remember the name of. It had a homemade tomato sauce that i wish i could recreate. I truly believe that this is a restaurant to step outside of your comfort zone because everything is going to be delicious.   We finished off with the Chocolate birthday cake for dessert. I wish that all of my birthday cakes tasted like this. It was fluffy and absolutely delicious. The sweet cream ice cream on the side was the perfect compliment as well."}
{"text":"Maybe I'm just spoiled by the Charleston restaurant scene, but Kindred is nothing to write home about. It wasn't terrible, but the food was so overly salted that I began dreading each subsequent salty dish that was delivered to the table. The bread was great, but it wasn't special. I wanted so badly to love this place, but it's just another over-hyped bummer."}
{"text":"If someone paid me to say something negative about my experience at Kindred I wouldn't be able to do it. Seriously. Made reservations for my boyfriend's birthday dinner since it's pretty out of the way for us. Wanted to do something special and different. I have to say I did a pretty great job choosing this place.   First of all, its beautiful. The decorations are a mix of classic and trendy and its fancy without being stuffy at all. The attention to detail is phenomenal. Honestly, I just hung out in the bathroom for a while because it was so nice.  We had to wait for our table for a little bit so ordered drinks at the bar. They have a great craft cocktail menu and nice wine list too. I wanted the much instagrammed frose but they didn't have that evening, so I tried another wine slushie type drink. Bartender was friendly.   We sat upstairs in front of the window. Our server was awesome. She went through the entire menu with us and made recommendations. The menu changes daily.   The milk bread and butter is amazing. Its a little crunchy on the outside, perfectly soft on the inside, and salty! Wanted more but didn't want to spoil my dinner.   We started with the fried oysters and grandfather's pickles. That is a great combo right there! I don't know if I would be able to come back without getting those two things.   Next we split the squid ink conchiglie and pancetta ravioli. Both were great, and very different!   We were undecided on the glass of wine we wanted to order, so our server suggested we try all three whites we were deciding between. Who does that?? She was awesome and I wish I remembered her name.   Finally, they brought out a surprise piece of chocolate cake for dessert. It was not your average slice of cake. Rich chocolate with some type of whipped cream cheese icing.   I was shocked when I received the bill, and saw how affordable this place is for the quality. $100 before tip for 4 small plates, 2 cocktails, and two glasses of wine.  If you have a special occasion to celebrate, I highly recommend coming here!"}
{"text":"It is not often we found our way up to the north side of town (though strangely, that is happening more often these days). Whatever the case, we recently found that we were trying to decide what to eat one afternoon, and since Kindred was one we hadn't been to for lunch, we popped in to see what was on the menu. Luckily we were there a bit early, as even before the crowd had settled in, they were pretty well packed.  Good thing we had our climbing shoes on, as we were escorted to the upper deck (if this changes into a sports bar, you can send me royalties on the name), but that did not prevent the waterboy (sorry, that seemed to be all this guy did), our server, and everyone else from keeping things moving back and forth to our table. Menus, plates, napkins, flatware, it was nearly a blur, and I for one am glad I don't have to pay the water bill to keep everything clean - I'd just let you people deal with one set of silverware for the whole meal.  When it came to the food, everything was excellent, from the oysters to the buns (heh) on the sandwich and the burger. That burger. I know, they are a fancy place, but I could have eaten one about seven times as big. And I do wish that the avocado would have stayed put on the sandwich, as it kept ending up in my lap. But other than that, and the fact that the cinnamon rolls are only served at dinner? Everything was aces."}
{"text":"Trekked 45 minutes from Matthews to try after reading a few very good reviews. This is not a good restaurant, it's a great one. Don't be too influenced by the recent poor review. My experience , and my wife agrees, was fantastic. We were seated upstairs, it was a bit loud and the staff was very busy but attentive to the customers. They serve small plates and the very friendly waiter recommended we get 4-5 and share them. They brought milk bread to us, delicious. We ordered buttermilk fried chicken, speckled trout, pork saltimbocca, mussel tartine, and gnocchi. All outstanding, particularly the gnocchi, the best I've had. They brought us complimentary duck fat potatoes, yum. My wife had two bartenders selection drinks made from the house made soda, which were excellent. We took the roasted apple galette to go and that too was wonderful. We couldn't believe the price. 4 drinks, 5 entrees, and a dessert came to $ 106.00. I now understand why this place has received a lot of media attention lately.  Like I said earlier, it's not a good restaurant, it's a great restaurant!"}
{"text":"Went here for lunch with coworkers yesterday. Thank God this place was amazing, because after taking them to Pickled Peach, this was my last suggestion they were going to go by.  Service was great and quick. There was no wait for lunch and we were seated quickly. The restaurants is clean and lively. Food is a little on the pricey side and the serving sizes aren't as big as other places, but the quality of food is top notch. I had the shrimp roll and my friends got the burger and someone else got the bbq ham (or something to that effect) which tasted like bacon. And who doesn't like bacon? My roll was good and the burger was amazing! I had the grandfather's pickles for my side and the others had the frites, potato salad and coleslaw. All of the sides were amazing too. Will definitely come back here, but probably for dinner. I hear they have charcuterie and I'd like to have some. Yum!"}
{"text":"Beautiful restaurant, lovely service and delicious food. I came in for lunch; had their burger and fries. I couldn't get enough of this place. Everything is picturesque. This is the restaurant you see in a magazine and hope it's as good as it looks because you're traveling to Davidson. When you get there at your reservation time, you're thrilled you didn't let your cynicism stop you from making it.   The burger: two patties, cheese, mayo. The fries: soft and fluffy insides with crispy outsides. I sat at the bar and talked to the bartender. What a pleasure. We talked about Texas and liquor stores around the states.  She told me all about the dinner menu and I can't wait to come back. A little bird let me know the patio opens soon!"}
{"text":"I wish I could give more stars. Kindred is big time in a small town. We have an unforgettable experience every time we dine here. Staff is on point. Food is amazing. But the drinks are my fav :)"}
{"text":"The space itself is beautiful. It's located in a historic building in beautiful Davidson, NC. The restaurant has three levels, has gorgeous light fixtures, beautiful wood, marble tabletops, exposed brick walls, gleaming white subway tile, and lots of large windows.  We were seated at a table upstairs, and started scanning the menu. The cocktail list was intimidating, so I ended up just having a glass of wine. I loved that the menu included an option to buy a round of beer for the guys in the kitchen.  Our server was friendly & helpful. He went over the menu, and made his recommendations. He came back with our drinks, & the milk bread.  The milk bread was fantastic. Soft, warm, and salty. It tasted like a warm, super soft pretzel, and I would have preferred not to have had to share this with Graham.  For our dinner, we went with four items from their menu: the duck fat potatoes & aioli, the NC mountain trout with herbs, radish, and sauce gribiche, the fried oysters with dill yogurt and Calabrian chile oil, and gnocchi with blue crab, citrus, crème fraîche, & chives.  Everything we had was fantastic. The oysters were perfect. They were crispy. and substantial. The trout was amazing, and the sauce it was served with was the perfect accompaniment. The potatoes were crispy, & delicious, with lots of extra flavor from being cooked in duck fat. But the star of this dinner was the gnocchi.  The dish was beautiful, and so, so delicious. The gnocchi were perfect, fluffy pillows of deliciousness, and all of the flavors tied together so well. There was a hint of citrus, nothing overwhelming (thankfully, since G isn't a huge fan of lemon). The crab was perfect. The crème fraîche was perfect. I was expecting it to be heavier, but this dish was light, incredibly flavorful, and delicious.  We were full after dinner, but I was adamant that we order dessert.   We went with the roasted apple galette, buttermilk ice cream, milk jam, and thyme. We DEVOURED this. It was so, so good. If we had been eating this at home, I probably would have licked the plate.  The service was excellent, and the food was perfect. It was a wonderful meal, and I can't wait for the next opportunity to visit again."}
{"text":"This is the first time I've ever written a review and wished that I could give more than 5 stars. The hype is real. One of the best meals I've had in Charlotte, maybe even the best. And I'm just going to say it, give Joe Kindred that James Beard award.   Everything was top notch, the staff, service, food, drinks, ambiance... all of it. You start with milk bread, which may as well be called manna from heaven. Pro tip: order some to take home with you. You'll want it. You'll crave it. You'll dream of it. You'll need it.   Our server fully walked us through the menu and explained everything. It's a small plate type menu here that changes regularly. First of all, you can't order wrong here. If you don't like this place, maybe blame yourself. We started with a couple amazing cocktails, the Santiago and the Soigne West. For food, we ordered the hamachi crudo, wagyu beef tartare, scallops, gnocchi with blue crab, beet ravioli and the citrus panna cotta for dessert. Everything was amazing. The pastas are made fresh daily in house. Overall, my favorite dish was the beet ravioli. The big winner was the vanilla puree on the scallop dish. Holy. I'm not ashamed to say I was using my finger to scoop up the rest of it on the plate.  Story time, my good friend Aaron Rivera was sitting at the table next to us. He raved like I raved about his meal. I think it's a true testament of how good a place is when another fantastic chef pays the highest of compliments.   Joe and Katy, bravo. You deserve all the buzz and accolades. Thank you for setting the bar very high in the Charlotte area restaurant scene. And I learned my lesson: next time, order milk bread to go."}
{"text":"After all of the reviews and hype, I finally got to eat at the famed Kindred for my mom's birthday. Kindred provides tasty small plates with excellent service in a lively atmosphere.  On Friday evening, we were among many others enjoying the small plates-style restaurant on Main St. This was one of the best small plates experience I've had because the waitress controls the flow of the food. Our party of 6 let her know all the dishes we wanted, and they appeared at regular intervals as we enjoyed our evening.  The food was tasty and innovative. I had a yummy red curry sweet potato soup and also enjoyed the artichoke wraps. Some of the other dishes weren't standouts, but overall a good range of flavors. We also shared a few desserts - you must order the cinnamon roll!! Thankfully our waitress recommended it or we may have passed over this traditional breakfast food. But seriously, get it. Also, the cinnamon ice cream was quite good.  It was a nice visit for a special occasion and would recommend a fun night out there. Just don't forget to make your reservation!"}
{"text":"After much fan-fare, the husband and I finally went for his birthday. Snagged a late reservation on a Saturday on OpenTable for 9PM at the last minute and off we went.  We arrived promptly at the appointed time and were asked to wait for a few minutes. The downstairs seating/bar area was PACKED (maybe due to the rain that night) and LOUD. We were hoping that we would be seated upstairs so that we could avoid the shenanigans of the well served patrons, but unfortunately our table was right in front of the bar. We weren't thrilled about this, but decided to make the best of it.  Thankfully, our waitress was absolutely delightful and made the experience. Gave us a heads up on dishes that they were running out of, so we could snag them (Wagyu Beef Tartare and the Cinnamon Roll) before they were out. She chatted with us and made us feel right at ease, even though she had to nearly shout over the bar activity.  The milk bread was AMAZING. I don't indulge in a lot of carbs and this was totally worth it.  The cheese plate was a production in and of itself, and they were generous with the crostini's but it could have used an accoutrement like honey or something as a nice \"finish\".  We then indulged in the salumi plate and they had housemade pate...nom, nom, nom.  By the time we got to the milk bread cinnamon roll, we were stuffed. Probably due to the late hour of the dinner, but we found the portions more than sufficient given the small plate style and didn't find the need to get more than four for two of us.  Wouldn't recommend for a romantic date night...a fun night with friends would be better suited.  Excellent staff, excellent food execution."}
{"text":"Outstanding doesn't begin to describe the food. Just wish the chairs were more comfortable ( hard wooden seats and difficult to sit in for any length of time) but service, food and location are great!"}
{"text":"SO SO worth the hype. I'm really into trying great food and get a lot of it in the SF Bay Area and this was by any standards--a fabulous meal. The milk bread is so fresh and lovely and warm. I loved the butter they serve with it as well. It's free for the first basket and then $5 for a refill (I suppose the small charge saved me from myself and filling up on that!).   We tried a lot of small plates: a salad of endive, plum, trout roe and buttermilk which as unique and delicious. The duck fat fries were super crisp and yummy (though the aioli was underwhelming and needed some garlic or lemon or salt or something more flavorful!). The crispy oysters were nice and I loved the spicy oil and dill yogurt combination. The wagyu beef tartare with uni mayo was super fabulous but would be even better served with butter grilled crostini. Finally, the star was the quail sausage and escargot toast with was smothered in the most incredible and complex savory and spiced sauce. That was the consensus as the favorite!   Moving onto dessert, were order the buttermilk plum cake which was nice but not as unique. We also got a scoop of the tahini, cardamom and pistachio sorbet which was so interesting and like a lighter halva ice cream. If you're anywhere near Davidson, you must try this place. Our server Val was so nice and helpful and really made our experience that much better!"}
{"text":"What an amazing meal. Milk bread was a great way to begin! Then it kept getting better... Bucatini pasta had to be my favorite... But everything else was a super close second... Flounder crudo, beef tartare all amazing...and don't forget the oysters!! Great experience!!! So happy to have this dining experience available in the Charlotte area. Chef and owner should be very proud!"}
{"text":"I wanted to love this place and I'm sure the hype is not wrong (this many people and Bon Apetit can't be wrong). However I didn't love it. I didn't even like it to be honest. We went for our anniversary and they seated us right away (reservation) and brought us free champagne which was really lovely. Milk bread was on point. But then things went downhill. We came for the food and I think we either hit an off night or we ordered the wrong things. We ordered 5 different things and I would say only 1 was better than average. I'm absolutely going to give it another shot as I live locally and the vibe and atmosphere is really cool, but we joked that we needed a redo of our anniversary dinner. Also not super romantic either. Will go back wth girlfriends who are more adventurous eaters and pray for better food. I know it's there somewhere, I just didn't get it."}
{"text":"I'm torn here. The place is absolutely beautiful. Service was good. The food was definitely eclectic which we usually enjoy, but the menu was limited. They are trying to go for tapas feel. It didn't work. Each dish is about $18-$24. Each person is persuaded to get at least 2 plates each. With that said, my wife and I \"shared\" 4 dishes. Food was good, but we left hungry. I had two beers (local) and my wife had two mixed drinks, which were delicious, but extremely weak. We paid around $140 (that's with tip). Ultimately we won't go back. I don't see many people willing to dish out a buck and a half for mediocrity."}
{"text":"This is the best restaurant I've ever been to, hands down. Delicious food, as the other reviews show, and amazing service. Melanie is an absolute angel and we love coming in here for a great meal and the chance to see her! Standout dishes: Beef Tartare, all the pastas, fried oysters, and the cinnamon roll, obviously. We come here every 2-3 weeks and while it is more expensive than a typical dinner out, it is definitely worth forgoing two or three so-so meals out in favor of one worthwhile night at Kindred. Their cocktails are also amazing! Haven't been for lunch yet, but that is on our to-do list!"}
{"text":"I can not say enough good things about this restaurant.  I honestly would eat here every day if I could and I would never run out of new things to try. Chef driven restaurant in a quaint setting just totally loved the atmosphere, the food and the drinks were just amazing ..the wine also top notch.   Our waitress was perfect and really recommended some great things we would not have normally tried.  We shared every dish we ordered so we could get the most of everything and everything was delish!!! Try this place out you will not be sorry and you just might find you want to move in and eat there forever!!!"}
{"text":"Very creative menu with awesome flavors. They have mastered the idea of contrast in flavors. The bar is also fantastic - they were able to add new twists to old classics. An awesome time out with my wife for our anniversary."}
{"text":"Revisited Kindred for lunch on March 28 and really enjoyed my selection as well as the selections of the others In my party.  I tried the falafel which wa every well prepared with crispy outside and smooth spicy inside served with cucumber salad as well as lovely greens with a bright, light olive oil dressing. The whole wheat naan was very good also. Others in our group had the shrimp salad on milk bread roll which was outstanding and the skillet burger which was well seasoned and perfectly cooked. I am so glad to see this restaurant open for Saturday lunch and think the menu is perfect for a sunny weekend lunch!"}
{"text":"We visited Kindred shortly after their opening in late February, and had a fabulous meal.  It's a high end, special occasion kind of place, but one that we'll likely visit often because we loved it so much.  The restaurant is beautiful inside, with two levels to accommodate diners.  We sat upstairs, and loved the airy feeling and view through the large exterior windows.  Every table gets a milk bread, free of charge.  It's served in a bucket with four pull-apart pieces and a salty top.  Wow - it was good, especially with their hand-churned butter!  Additional orders are $5, and I had to hold myself back from ordering another.  We love meat and cheese trays, and were excited to see that Kindred offers both house-made meats (four for $14), and cheeses that you can select individually (at $4 each).  AND, they have our absolute favorite cheese, sottocenere.  Yes, our $30 meat and cheese tray was pricey, but we loved it.  For our entrees, I had the venison tagliolini.  It was a small portion at a very reasonable $16.  The venison was very tender, and the creamy sauce was delicious, and not too heavy.  My husband had the pork arista at $24.  It was a huge and very tender chop, served over grits (or, was it polenta?).  He added the duck fat fries, which we both enjoyed.  I can't say enough good things about the service; everyone was pleasant and prompt.  It's especially nice having someone come to your table to explain the cheeses, and slice them upon request.   We left comfortably full.  And I still salivate thinking of their milk bread.  I'm already planning our next visit!"}
{"text":"Good.  Not really my style though.  Need more beers on tap and not enough plain grub on menu.  Great at what they do though."}
{"text":"Wow, just wow. You know you've had an amazing meal when you are still thinking about it months later. It's not often that I make my way over to Davidson, but my mister treated me to dinner at Kindred for my birthday. Kindred is perfect for a special meal but still casual. We dined upstairs which made for fun people watching of the street below.   We ended up ordering a total of 7 dishes plus dessert and drinks which was more than ample for two people.  I'm with the other reviewers who have sang the praises of the milk bread. Absolute carby perfection right there. Other memorable highlights included the crab salad which tasted as good as it looked. The citrus in it paired really nicely. I also had the trout, which how often do you get excited about a fish dish, but the use of harissa and other spices was again perfection. My drink of choice was a pisco sour that was served in a sweet dainty cup. We ended our meal with the birthday cake, which was kindly comped for my birthday. The frosting on the cake was killer good."}
{"text":"One of the best restaurants I've been to. My wife and I have been there twice, and both times the food was quite special. the cheese plate is a great value, and the bread is amazing!"}
{"text":"We went to see if all the hype was true and were extremely happy we did. Our dinner last night at Kindred was delicious, our server was warm, knowledgable and attentive. The restaurant has a great vibe and interesting decor, situated right on Main Street in idyllic Davidson. What a great evening.  We shared the Salumi charcuterie and the each had two small plates. We enjoyed the crispy oysters, Korean fried chicken, seared scallops and ink squid shrimp pasta. All were tasty and well prepared. The only miss was desert (which they comped). I ordered the cinnamon bun thinking it would be like bread pudding. It was ok, not great like everything else.  Oh and the milk bread is pretty delicious too. We will be back, even though it's a 50+ mile round trip! It's that good."}
{"text":"Was hoping I'd love this place with all of the hype. I'm a foodie, so the concept and ideas of different flavors was exciting for me- the price and menu however ? Totally not worth the once in a while change of scenery from the other Davidson restaurants. I'm willing to go back and try lunch because, like I said, I WANT to love this place!! Bottom line, for two apps (may have been meals but 5 tortellini doesn't constitute dinner for me even WITH a cauliflower purée) and two drinks came to 68 with tip! OH!! PS- drinks are fabulous!"}
{"text":"I have never written a review before, however, this was hands down one of best meals I have had in Charlotte. Service was great. Every dish was amazing! Well worth the trip."}
{"text":"Where to begin...great atmosphere, great service, wide selection of drinks, and the food was off the charts. I was here for a birthday dinner for my wife and they did not disappoint. We had the salad which was full of a mix of goodies with a nice light dressing. Oyster were a must! Lightly fried but still juicy with a light tartare oil and dill sauce. Didn't mention the starter bread which is a mix between a croissant and a pretzel mmm mmm good. Can't forget the delish scallops. And we tested the pastas also both the gnocchi and the clams linguini were great. Only critique is that the clam linguini was heavy on the salt.   These dishes are share dishes however we ordered too much. Had to take both the linguini and gnocchi home which I will be eating shortly.   Best of al price will not break the bank.   Go here!"}
{"text":"Our very favorite spot in Davidson for a special occasion! Delicious food and beautiful atmosphere. Love the attention to detail and craft cocktails!"}
{"text":"Great service!! Enjoyed the burger and the Kale salad. Thank you for being so nice an personable!!! Can't wait to come again!!!"}
{"text":"Okay, yum! The hubs and I just returned from an early dinner and , WOW! Service was great, atmosphere fantastic, and the food to die for. We enjoyed everything, but the oysters and the fried wood chicken mushrooms are by far something I would suggest to anyone! Must try, worth every penny."}
{"text":"Top of my list for restaurants in the Charlotte area - and certainly in Davidson.  Listen to your server and go with what the recommend, they know what they are talking about.  My go tos are the Hamachi Crudo , fried oysters (the dill sauce!!), THE PICKLES, duck fat potatoes, any of the cocktails, and any of the pasta dishes.  During my most recent visit my server noticed we were licking our forks while eating the Hamachi Crudo so she brought us out a spoon - no judgment.  That is service!! (we cleaned the bowl as if it was soup...)."}
{"text":"I regretfully still have to go back at night because they don't do the milk bread at lunch, but this place is adorable (as is the whole town) and everything was great. Kind of a bummer that they don't offer their claim to fame all day though!"}
{"text":"This will become  a destination in Davidson. I got the opportunity to attend their soft opening and came away thoroughly impressed. Joe and Katie Kindred have clearly brought their experience from Chicago and San Francisco's top restaurants to their new restaurant in Davidson.  The menu is Northern Italian style with small plates, which is great because you get the opportunity to try more from the menu! This place has done it right with not only a focus on fresh and local ingredients but turning them into creative menu options.   The place has been beautifully restored from an old Davidson Drugstore and has mixed the historic with the modern very well.   Kindred is a bit pricier than most restaurants in the area, but the food, decor, and service make it worth every dollar! I highly recommend this place and look forward to dining here for many years to come!"}
{"text":"Believe the hype.  Everything we had was awesome - our favorite dish was the Hamachi Crudo (the pops of citrus were an amazing surprise) or the Scallops with Vanilla Sauce - I loved the mustard served with the Salumi.  The bartender's choice cocktail was spot on - highly recommended.  And service was awesome.  The only slightly disappointing thing was that we made our reservation over a month ago for our anniversary, which was noted on the reservation, yet no mention about the anniversary or a special table - this is really, really not a big deal and the food and amazing service made us quickly forget about it.  Some minor other details that made the night amazing were the bathrooms, oddly enough, were really unique.  Also, you can tell a ton of thought went into the design, as the sound was perfect, not too many echoes, even in an open concept with hard flooring.  And I have to mention the prices - I was blown away to be able to sit down to a James Beard nominated dinner, complete with craft drinks and 5 courses, and be able to leave with a bill of around $100.  I highly recommend Kindred and make sure you get reservations well in advance - put it on your calendar today."}
{"text":"It started with us putting our name in for a table outside that was supposed to be 15 minutes after 20 minutes checking our name wasn't even on the list and they claim they didn't remember even talking to us.  After getting situated outside service was extremely slow even a take our first-order.  Wasn't even that crowded what a bottle wine and three small plates which took nearly an hour.  Then they forgot to bring our second order of milk bread.  On the upside the Food was good, not exceptional.   I may try again but probably not for a while not sure what all the buzz is about.  Hopefully this was just a bad Night."}
{"text":"Crazy awesome.  Kindred would be a top restraint in any big city. NYC San Fran or Vegas.  The menu, which changes daily is as unique as it is impressive.   The squid ink pasta with uni butter was on the top of my \"things I could everyday for the rest of my life\" list.   Well done Kindred!"}
{"text":"Best part of my visit to Davidson was coming here for dinner. Would come back in a heartbeat. Great service, awesome atmosphere, and the food was spectacular. Got seated immediately at 9:30 pm and dinner was on the table by 9:45. Can't go here without trying the mussel tartine and Oaxaca on the drink menu."}
{"text":"Loved the decor. Wait staff was very attentive. Favorites were the brussel sprouts and potatoes."}
{"text":"I want the milk bread shipped fresh to my home every Saturday morning for French toast. Don't miss the duck fat potatoes and if you have never had steak tartar, try it now. How can you not order the pumpkin risotto in the fall? Delicious. Can't wait for the chocolate birthday cake for dessert."}
{"text":"This place is awesome. The milk bread that you start with is insanely good. I could have just eaten that with some cocktails and been happy. The cocktails, yes those are also very good, the waitress recommended one to me that was no longer on the menu. And then the food, all of it excellent, and all of the portions perfect. We started with tartar, yummy; for the main courses my brother and I both got a flank steak dish which was the best of the mains, and my wife had a squid ink pasta which was also very good."}
{"text":"Great ambience, great food. I'm so glad Downtown Davidson has added so many quality restaurants.  Whenever you are in the area, be sure to make a reservation so you can grab a meal."}
{"text":"Okkkkkkkkkkkkkk. We recently tried this place out with some friends of ours. No one can deny the hype around this place. Everyone I know raves about it. We were all excited to try it. We did a reservation and the table was ready at the reserved time. Here is the run down:  Ambiance: it is beautiful inside. My fiance and friend raved about how nice the bathrooms are (I didn't see them). The exposed brick was beautiful, along with the staircase. It is small but cozy with relaxed lighting. It really is a beautiful building.  Service: Just okay. Nothing amazing. Nothing terrible.   Food taste: The Milk Bread is delicious. We ordered the Little Gem Salad, Fried Oysters, Duck Fat Potatoes, Squid Ink Pasta, and some Rigatoni and Pork dish. Our friends ordered the Little Gem Salad, Pickles, Duck Fat Potatoes, Scallops and Rigatoni and Pork dish. We all had similar thoughts on the items - the Little Gem Salad was NOT good. It had a bitter, earthy, dirt like taste to it. I don't think any of us finished it and our server didn't make note of it or ask why so much of our salads were left. Fried Oysters were enjoyed by those who like oysters (this was my first time trying them and I am not a fan, but my fiance and a friend loved them). We all liked the duck fat potatoes (although about 1/4 of ours were the burnt ends/crumbs of the fries). The Squid Ink Pasta was good - my fiance loved it, I thought the lemon in the sauce was a bit strong. We loved the pickles. The scallops were good. All of us agreed that our favorite dish was the Rigatoni and Pork. We said we wished we would've just gotten a large serving of that.   Price/value: This is where this place underwhelmed me. It's tapas style. I get that. But it's crazy that most items are $15-$20, which causes patrons to spend a lot of money to get a decent amount of food. To put it in perspective - the scallops were $20 and it came with three (yes, as in one more than two and one less than four) scallops. There are no scallops in the world worth that price.   In general, we all agreed that this place is a super cool concept - rotating menu, great vibe, blah blah blah. But none of us felt like it was worth the hefty price."}
{"text":"Having lunch at the bar is like being transported to Charleston, SC for an hour. The Pimm's cup is a refreshing (and large) cocktail that I'd really recommend. The house cured ham sandwich, grandfathers pickles and the burger are all amazing. The dinner menu is a little more extravagant but the atmosphere and staff are beyond helpful. They even have hairspray for you to use in the restroom. Gold accents paired with clean, white, modern finishes make the space feel timeless yet current. It's an absolute favorite!"}
{"text":"Just had lunch there and it was amazing. Val gave us the best service and was spot on with her recommendations. After lunch we had a cocktail at the bar and Tanner served up a couple of great drinks. Everything was excellent. We will definitely be back."}
{"text":"Excellent restaurant, very friendly staff and reasonably priced. One bite of Grandpa's pickles and you won't forget Grandpa's pickles. Milk bread is delicious and melts in your mouth. Dishes are crafted and flavored so as to augment rather than overpower the natural taste of the food. I could taste the earthiness of my mushroom ravioli ."}
{"text":"Stopped in for lunch at 12:20pm on a Tuesday.  No wait.  The downstairs was completely full and they'd just started seating upstairs.  We had a small table overlooking Main St.  Service was prompt and friendly throughout the meal from our server and the person who refilled our water glasses.  I spied another table's order of crispy oysters as an appetizer and promised myself I'd come back for dinner soon as they looked amazing.  I ordered a shrimp roll (Meyer lemon, mayo, tarragon) on (I assume) a milk bread bun. $12.  The serving was exactly enough for lunch, not enough to make you too full or to have leftovers (bummer, lol).  The frites were huge and thick, slightly crispy on the outside and meaty yet soft on the inside.  I have a weakness for French fries and although these were close to perfect they are a little too thick (not because they weren't cooked right because they were) but too thick meaning the crispy outside ratio to meaty fluffy inside was off, it needed more crispy and less meaty inside. They were dusted with dill, salted and served with a side of aioli.  I'm particularly fond of aioli and I learned something that day, it's GARLIC aioli I'm particularly fond of, not regular aioli.  It tasted like a big cup of mayo and I decided I far preferred the fries with the catsup our server also offered to bring us.     My husband ordered the house cured ham tartine which was served open-faced with gruyere, housemade mustard (I overheard a server tell that to another table), seasonal greens and onions.  He absolutely loved it and said this was the best restaurant we'd been to in a number of months and we both agreed to come back for dinner soon.    I'm a little bit picky about restaurants and I left here excited to come back for my next visit. I'll update when we do."}
{"text":"Avocado sandwich, ham tartine, and burger were all delicious. The service was great. I've heard great things about the restaurant and was not disappointed."}
{"text":"My boyfriend and I moved to the Davidson area in January and although it had taken 4 months to get here we finally made it !! Try getting a reservation less than a week in advance ... Good luck! But let me tell you... go get a reservation and it will be well worth the wait. The ambience inside and out of kindred is rustic chic, from the quaint inside bar to the tree shaded patio area. Starting our dining experience we had to take a look at their drink menu; looking around the dining room their craft cocktails look amazing - I'll be back to try one ... Or three , however tonight we decided on a nice Nebbiolo. The wine list is broad and provides many by the glass options as well as bottles for the table.  And wait ... I almost forgot! When we first sat down we were served \"Milk bread\" the hostess who delivered it said they baked it all day just for us ... After tasting this amazing bread, I believed her. Tangy, warm and melt in your mouth delicious I'm now determined to recreate this bread . Overcome with my milk bread amazement I left my BF in charge of all the decisions ( this may scare some of you). Luckily, my guy knows me and has a pretty awesome palate; he shared with me his choices but also asked the waitress Jessica what she recommended. Jessica was extremely knowledgable, she articulated the menu extremely well and was able to answer all of our questions. I was quite surprised when she mentioned she'd only be working there a month !! After all decisions were made we decided on: Duck Fat fries with aoili, Mussels Tartine, Squid Ink Conchiglie, Wagyu Beef Tartare, and Carrot Gnocchi. Everything was amazing !! The first dish we tasted was the Squid Ink Conchiglie this featured NC Shrimp and a sea urchin butter sauce; the sauce was delicate and full of flavor leaving us want more- this ended up being or 2nd favorite. Our ultimate best bite was the Mussels Tartine; this was mussels without all the work! A piece of sourdough bread was the base topped with a delicious broth, mussels were shelled and laid on top,finished with chorizo, aoili verde and a soft herb salad. This dish packed a myriad of flavors that excited our tastebuds. Finishing our over indulgent menu of choices we did not leave any room for dessert.  We will definitely be back to feast on the farm house cheese offerings and dessert. We learned from Jessica there are a few \"standby\" dishes on the menu but generally everything changes each week; this being said I can imagine becoming a regular as I'm overly excited to check out what the Chef has up his sleeves next! All in all - Kindred lives up to the hype, go there."}
{"text":"Came here for my birthday dinner and it was still a solid meal, but it wasn't as good as I remembered.   Milk bread as usual was to die for. We also had the crispy fried oysters and butternut squash soup with pumpkin seeds for our appetizers. Both of these were fantastic.  Entrees we had squid ink pasta and gnocchi. Both were overly salty and luke warm.   I, of course, had the birthday cake for dessert and it may have been the best thing we had the whole night, haha.   Bartenders are very skilled and made me a custom drink, which I thoroughly enjoyed."}
{"text":"Farm to table restaurant is my kind of restaurant!! Love it!!! A little pricey but the food selection is rather eclectic and delicious. They cured their own meat which is amazing. The speciality drink menu is also eclectic and tasty. The owners are friendly. The food and drink selection is electric! The desert selection lacks intrigue but hopefully once they find a good baker, that portion of the menu will be as eclectic as the rest of the menu. Til then, it's an enjoyable place every time. The outdoor seating and their dog friendly style is an additional plus."}
{"text":"I have eaten at some of the best restaurants in the country and even around the world, but the meal I had tonight at Kindred was right up there with the top meals of all time. Our server, Jules, was truly terrific, but the flavors and quality of the dishes were unforgettable. Trust the server to guide you to a fabulous dining experience, we did and we are so happy. Thank you Team Kindred!"}
{"text":"Loved coming here. I took The Lady here for a birthday dinner over the weekend, and had reservations about a week in advance (thanks Open Table!). We were seated within about 4 minutes of us showing up, and as we sat down, you can't help but notice all of the little things that makes this place so special. The subway tile, the piles of books, the brass pipes and faucets, the studded leather bench, the employee requirement for moonwalking out of the bathroom... We started out with drinks. The lady ordered a Pimm's Cup (complete with super awesome twisty english cucumber slice) and I got the Oaxaca Flocka (pronounced like the rapper) which features Mezcal (a tequila-like liquor but smokey) and chili oil to complement the mezcal (and a few other things). Both were well crafted, well thought through, and beautifully presented.  Also, the milk bread that everybody is talking about? Yea, it's that good. Really glad that it's complementary now. Want more.  Food time: 4 dishes. Gnocchi. Served with tomatoes in a tomato-y broth. On point, y'all. Light and fluffy and not super dense. Littleneck Clams. Served in this killer green sauce that had I-don't-care-it-was-amazing in it.  Scallops. Every time I order scallops out I keep on thinking \"okay, this is as good as it gets, other restaurants can't top this\" and then Kindred comes along and wrecks that. Crispy Squid Lettuce Wraps. Devoured in less time than it took to bring them from the kitchen to our table.  Our server was super nice and helpful the entire time. I had put on my reservation that it was The Lady's birthday, so to be sneaky, they gave us dessert menus. We had picked out which dessert we were going to try, when she surprised us by bringing out their incredible chocolate cake with a candle and the words \"Happy Birthday\" written in chocolate. Kindred is like that sneaky friend that plans surprise parties for you.  Their menu is seasonal, so we'll be sure to have another Davidson date soon and let Kindred be our culinary provider."}
{"text":"This place has great food at a wonderful price point! We got a bottle of wine, cocktail, plenty of apps and small plates and dessert for just under $200! The quality of the food and service was second to none, with the waitress providing knowledgeable recommendations on everything from wine and places to see in the area. Kindred is a must visit!"}
{"text":"Great, fresh food in a homey storefront with an upscale twist. Service was good and while I sat at the bar, I managed to engage in conversation with my fellow diners.   I was greeted with complimentary milk bread, which tastes like sourdough bread. It's nice and soft and great with butter. The first thing I ordered were the creamed greens- a mixture of fresh, sauteed greens, namely spinach, collards, calabrian chile and bread crumbs. They were yummy, but just a bit on the salty side. Next up, was the SUPER delicious tagliatele with morel mushrooms, fava beans and thyme - hands down best dish. Very flavorful. Lastly, to round out my meal I savored the strawberry tart with saffron anglaise, buttermilk ice cream with distinct pink peppercorn.   Nice experience, on the pricey side. Very cool restroom, large, inviting and homey. I like the locally made hand soap, which was a nice touch. If you enjoy Kindred, I recommend Heirloom to you!"}
{"text":"This is a great spot in Davidson (and Charlotte area in general). I feel like North Charlotte/Lake Norman area is really lacking in upscale restaurants and Kindred is a pretty cool spot. I miss my Curate in Asheville and I was glad to find a decent tapas place to reminisce the food creativity.   Our server was new and he was fantastic...very chill and friendly. He helped me understand plenty of items on the menu.   The milk bread was damn good. It was probably my favorite part of the meal. Also my favorite since my friend is gluten free, so I got that bad boy all to myself. After reading other reviewers (aka Nikki's) I thought I needed to order a truckload to take home. But I was satisfied having one to myself.   I ordered 3 different cheeses to start - even though the guy who cut the cheese (sorry I couldn't resist) was kind of a smart-ass. The cheeses, especially the gouda, were excellent. I wish they had some kind of chutney to accompany my trio, however my red wine was a perfect match.   Next I had the chilled asparagus with the parmesan encrusted poached egg. How they make the egg so perfect - is a miracle in itself! My friend proceeded to squash her egg with her fork and sprayed herself with the yolk. We were definitely the entertainment for the evening and I wanted to yell in my best southern twang:  \"we don't get out much!\"   Next I had the tagliatelle with mushrooms... it was tasty but salty and oily. I love salt (let's be real, I am a savory girl) but good lord I had to take half of it with me and drain the oil out when I reheated it.  Last but not least I got the birthday cake for dessert. After our server raved about it-  I was thinking it was going to be some awesome chocolate abstract \"birthday cake\" but no, it was literally LOOKED like a birthday cake from the grocery store. I hate to say that... it hurts my yelpin' soul to say that..but it was very moist and icing was good. Nothing fancy like you'd expect after all of those other interesting plates.   For $63 plus tip (only 1 glass of wine) just for me...was a bit pricey, but worth a try! May come in here next time for a cocktail and some more milk bread! :)"}
{"text":"This was our first time at Kindred. We found great reviews online so figured we'd try it. Unfortunately it was a bit disappointing. Food and service was just okay and wasn't anything special or memorable.  They get 1 star for okay food and 1 star for nice decor/vibe. I took off stars for the following reasons:  Our water glasses still had left over lipstick as they weren't thoroughly cleaned. It took over 15 minutes to fix this because our server was no where to be found. The menu is very limited and some menu items shown by past yelpers is no longer available. Our server had the opportunity to make an impression to offer some good things for us to try but only passed by our table 3 times during our whole meal and everyone at the restaurant just seemed uninterested and unfriendly.   In regards to the food, the shrimp sandwich is good and fiancé said burger was decent. Their ham sandwich is really salty and tastes more like prosciutto so I wouldn't suggest it. Overall you could get the same meal elsewhere for less money and probably better service. Hopefully they'll be better in the future as we really wanted to like the restaurant but will probably try many others before returning again."}
{"text":"Solid food. Friendly staff. A plethora of cocktails, wine, and beer to choose from. Great looking space. Helpful bar tenders. Hip looking clientele who are friendly as well. Loved the bread served in a pot. The fried oysters in spicy sauce was awesome. The yellow beets were tender and tasty. We really enjoyed both pastas which are homemade. Ordered the rigatoni w sausage and Bucatini w peas, egg yolk, and crispy ham. Could have used a bit less salt. Will definitely try again."}
{"text":"Lovely atmosphere & attentive staff, but the food was lacking in both flavor & value.  I had friends with me from four states.  I had picked the restaurant & felt so guilty about their lousy experiences that I paid for the entire table.  The food was salty; however, by far the greatest disappointment was the complete lack of protein on meat dishes that were $14-20 each.  Each meat dish contained no more than ~2 ounces of meat."}
{"text":"Ok, we went back for a second time trying to be open minded since the first time was not a good experience. The drink at the bar, excellent. Best I have had in a while. The waitress this time was beyond sweet. My issue is the food. I had 4 scallops for 18.00 which were ok, no com plants there, but was it the best I ever had? hummmm not sure. The bread was good.  then for my entree I had squid ink pasta and I think it was grilled shrimp. OK, no kidding, it was  one piece or a half a piece of shrimp cut into 3 portions for 20.00 and I might be off on the price somewhat. I thought it was so so. I would have loved to see some shrimp in the dish. I just don't get people waiting in line to dine here. I am thinking really really good advertising. We were right on time waited for 40/50 minutes to sit. Had to wait 10 deep for the toilet. Is ti a nice place, sure, but from the reviews you woudl think it would amazing. Sorry guys , I don't see it. I get it the IT place to go, but you money could be better spent around the corner"}
{"text":"I have heard about this place from SO many people and various resources so I was excited to check it out.  I think with all the hype my expectations were through the roof but I was left a little disappointed.  It was like everything was really really good or it was just ok.  I've heard the summer menu is better than fall/winter so that could be one thing but I honestly wasn't drooling over any if the menu options or flavor combinations.  There was a ton of gamey meat on the menu which really is not my thing but overall I just found it to be overpriced and underwhelming.  Here is the breakdown:  The warm bread served at the beginning: delicious! Could make a meal of it no doubt.  **the crispy oysters with dill yogurt sauce: good..just tasted like fried fat with some expensive sauce to dip it in.  **the duck fat fingerling potatoes:  very flavorful! Seasoned well! But, come on..its fries at the end of the day. Adding the word duck doesn't make it any more special   **cauliflower: very good, crowd favorite! They were seasoned with cumin and what the waitress described as other African flavors. They were on top of a yogurt sauce as well which was tasty.   **the scallops: chewy, small, expensive, not the best quality.  **the birthday cake: it was cold and honestly not very good. It wasn't very sweet and it was literally something you could have purchased at Harris Teeter.  It should have been room temp in my opinion.   The service was just ok. Our waitress was a little condescending and snippy with us but she was decent. It was crowded and loud and warm upstairs. If I moved my seat back to much I would hit the person behind me.  I just don't enjoy that type of atmosphere, especially when it is so expensive! The wine I had was decent but not very unique.  Just overall, it was good, not amazing.  I wouldn't go back unless I was invited by others."}
{"text":"Very crowded. Cocktails were great but service Was slow.  Asked for gluten free options and there were too few.  Pickles, beets, and a fish. Everything else was fried or pasta. My dinner companions loved the pasta and the fried potatoes. The example menu online had more options. I had read a review that said that the chef accommodated gluten-free request but that courtesy was not made available to me.  If you like bread and pasta this may be the place for you."}
{"text":"Great tapas restaurant in the Charlotte area! I definitely recommend only two, maybe three, dishes as they are pretty sizeable for small plates. We tried grandfather's pickles, the creamed greens, the duck fat potatoes, the rock crab salad, the scallops, the hanger steak, the bucatini, and the strozzapreti as our appetizers and our main dishes. I really liked all of the items, but the highlights for me were the milk bread, the strozzapreti, and the duck fat potatoes.   For dessert we tried the cookies with ice cream and the birthday cake. I like the cookies more, but a lot of people love the birthday cake!   I would definitely return! I highly recommend!"}
{"text":"My wife and I was out and about all day in Huntersville and Lake Norman, and decided to have dinner at Kindred in Davidson based on a recommendation from my cousin. We were not disappointed the service is fabulous the food is fantastic we will definitely keep coming back."}
{"text":"Moderately disappointed with this usually well reviewed restaurant. The house was quite full on a Tuesday evening, which resulted in a sound level that made conversation with old friends quite difficult. Service was charming and friendly, but painfully slow. It took about 15 minutes after we were seated (and three visits from staff members inquiring about the quality of our day) before someone finally asked for a drink order. The four of us then ordered 2 small plates each, and we were asked if we wanted them in two flights, or all at once. The answer to take them in two waves turned out to be a critical error. The second round of small plates did not arrive until more than 90 minutes after we had been seated. I have experienced extended waits in restaurants in Paris - where you are at the mercy of often arrogant waiters - but nothing as bad as this. I would like to say that the quality of the food made up for the noise and timing annoyances, but this would not quite be true. My wife's scallops were very salty. All of the food served to the four of us was more or less warm, and none of it was hot. That said, the Golden Beets and Gnocchi dishes that were my choices were creative and flavorful - but these qualities struggled to make up for the evening's shortcomings. Any dining experience is about the totality of its elements - food, ambience and service - and Kindred left me unsatisfied on several fronts. I want to say that I will give them another try because anyone can have an off night...but I'm just not sure."}
{"text":"We visited again last week, and, on all fronts (food, service, ambiance), the experience was as outstanding as our earlier visits (reviewed on Yelp).  It is hard to hit on all cylinders time and again, but Kindred has done so in our experience. Squid ink conchiglie w North Carolina shrimp was amazing!"}
{"text":"We had dinner and drinks at Kindred last night and I was very impressed! It's located in a cute area in downtown Davidson.The place was hopping! We ate inside and it can get a bit loud in there but they have patio seating that I think I will try next time.  Their drinks were great, albeit a bit pricey. The pours were generous. Be sure to try to bread they bring out to every table. It was delicious! The menu is \"tapas style\" and the staff was friendly and helpful as we made our choices. The fried oysters were fabulous!   Overall, it was a great experience and I look forward to going again."}
{"text":"Kindred is a one of a kind dining experience. Our server (I believe her name is Tia) takes customer service to another level. Her descriptions of the dishes are a new kind of art form. She made me want one of everything! In reality we tried the scallops (I think I licked the plate clean), duck fat potatoes (Amazing!) and gnocchi bolognese. I don't remember what my husband had and the menu has changed (which only make me want to go back) so I can't comment but it was delicious. After talking to Tia about my husband's prior service, she brought us dessert on her - an amazing Apple galette! An unexpected but totally sweet end to our meal. Possibly the best thing we ate was the milk bread. I could eat one each day! Also dining outside under the lights is magical."}
{"text":"Went to Kindred for lunch and it was everything I dreamed of and more!  When you walk in, you are immediately greeted by fresh, crisp lines and modern decor. I imagine you'll also be greeted by someone wonderful who will get your seated.  Their menu is simple, which I appreciate. They don't offer an overwhelming selection, but what they do have they do very well. I ordered a fried chicken salad with homemade dressing that was all scrumptious. I want to go back for dinner or for lunch on a non work-day so I can order a craft cocktail!  OH, and our service was fabulous."}
{"text":"This is in my top 10 restaurants ever..  which also includes Alinea in Chicago, IL.  There is something unique about this place.  The flavors are homey, but something new.  I eat here every chance I get.  I've tried to recreate their milk bread on many occasions and can get fairly close.  However, it doesn't compare to the experience of going to Kindred and eating the real deal.  I always get the squid ink pasta which has an amazing sauce!  The last time we visited I was blown away by a sheepshead bucatini.  The crispy oysters are always a great choice.  We also had a smoked butternut squash, which I loved!  The gem salad changes seasonally, but we've gotten that before and loved the flavors.  I was gifted a chocolate birthday cake slice by the Kindred staff for my birthday the evening of our last visit.  The cake was thoroughly enjoyed!"}
{"text":"Delicious! Everyone has said it, but I'll say it again - the milk bread! The. FREE. Milk. Bread. Eat away, my Yelp friends.  So I didn't realize this at first, but it's a tapas-type place. We got grandpas pickles (or someone's pickles). They were sour but in the good way. We ordered the fried oysters. They were chewy but hot and crispy and amazing.  Then, suddenly our service became incredibly slow. We waited nearly 30 mins for our last plate, and our waitress didn't come over and say anything? The gentleman who was filling the waters/clearing plates felt more like our server most of the night.  We mentioned our missing plate and he checked on it for us.  We also ordered the eggplant spicy pasta (I'm terrible with names). It was surprisingly spicy, almost too spicy, and I do enjoy some heat. That plate wasn't my favorite, but it was still good.  Overall, this visit was a solid 4. Not a 5, but I think it has potential to be one."}
{"text":"This was a fantastic girl's night! We had the crudo, crispy oysters, broccoli rabe, braised pork pachetti and mushroom ravioli. Both pastas were extremely rich and everything was delicious. Service was excellent too. Only downside was that the space was super warm and loud, but once we started the meal none of that mattered. We felt that the portions were generous for small plates. Get a reservation and bring your appetite!"}
{"text":"Kindred was an excellent place to dine! The location is great. Davidson is has such an older style feel to it. As for the food, the rest of the ratings were correct in describing the flavor. Everyone talked about the milk bread which was great, i was happy to see that it came to the table when your seated. KEEP IN MIND the serving sizes are small here. We ordered pasta dishes and the duck fat potatoes to make sure we were full. The apps were very small which made me contemplate taking a star off but the flavors were so unique 5 star was the only way to go.  Above the food the service was possibly the best Ive had. Our server was Tia and I believe she could have went into the kitchen and taught the chef about the plates he was making! she was very informed and full of suggestions. Very passionate about what she does! We will be back soon!"}
{"text":"I love this place. Every single one of the menu items is so delicious, but definitely expect to drop some cash here. This kind of perfection doesn't come cheap.   The first time I went here with my boyfriend for his birthday dinner; just the two of us dropped $100 between drinks, dinner, and splitting a dessert. But it was so worth it. The milk bread cinnamon roll is life changing, and they know how to make some killer pasta. The second time I ate here was for lunch with some friends on a Saturday after hitting the Farmer's market just down the street. It's much more affordable at lunch time but still a bit more on the pricey side of the local options.   The interior is also gorgeous and provides a lovely ambiance, and/or a great atmosphere for Instagram pictures if that's your jam.   You should try this place out at least once in your lifetime. Treat yourself."}
{"text":"What a treat to have such a gem of a place right in my backyard.  Unique flavors with creative menu items that will change on a regular basis. Beyond farm to table, the dishes are fun, exciting and great to share.  No run of the mill \"oh I've had this at such and such place before\".   I'm already looking forward to my next visit.    Started with a raw tuna dish drizzled with green olive oil pressed from unripe olives which add a unique citrusy flavor that was just right.    Followed that with an Uvo Raviolo made with fresh pasta that is a Chef Joe trademark.    Finally, finished up with a baked egg and crispy rice dish which sounds simple, however had so many different flavors going on that each bite was an experience.     The portions may appear small for the price, but the truth is I walked out of there stuffed.    Service is top notch.  Wine list is spectacular.  I'm really struggling to even think of anything to possibly complain about.    Definitely worth the drive up to try this place out.  You will be glad you did.   Oh!  Forgot about the complimentary milk bread they bring to the table to start your meal - crazy good."}
{"text":"Great date night restaurant. Small plates to try a bit of everything. Go with another couple and enjoy a conversation and multiple flavor profiles in one meal. My wife loves the pickles and the cinnamon role!"}
{"text":"3.5 stars.   After seeing this on the must try new restaurants by Bon Appetit I put it on my list never thinking I would get a chance to go here.  Then, I got the opportunity to come to NC for a business trip and put this on my list.  The city of Davidson is very cute, it's like an east coast college town with a lot of local flavor.  The restaurant had parking right out front.  The inside is very small so make a reservation if you can.  I would say this is similar to a lot of hipster restaurants in LA, but maybe the fact that it's in NC makes it more legit? Everything is shareable or \"small plates\" so I would suggest getting 3-4 dishes for 2 people and even then it was plenty.  FOOD:  MILK BREAD - we ordered this as an appetizer/starter and it was really good.  It reminded me of asian sweet bread or \"bao\" that you get at asian bakeries.  For someone who has never had such a thing, this will be very good.  It's soft like a roll but slightly sweet.  APPLE SALAD - this was a lovely salad and my first time having \"country ham!\"  It's basically like prosciutto but more sturdy.  Very good and very fresh.  RAVIOLI - very light white/butter/cream sauce and delicate ravioli.  Definitely enough for 2 people.  Again, very fresh tasting.  PASTURED RAISED CHICKEN - good rotisserie chicken.  Not oversaturated with salt, tender and juicy.  Overall good.  DUCK FAT POTATOES - they were basically thick cut french fries, honestly nothing too mind blowing and slightly salted.  I prefer thinner fries so I'd probably pass on this next time.  Overall, I'd say that this place was pretty good but I'm not sure I would call it the top place to try in the US.  I feel like you could get food just as good in LA."}
{"text":"First of all, you need a down coat to sit in here comfortably. There is no reason to run the air conditioning that cold. Second, they say they have \"gluten free options\" so we sit in an hour of traffic to find almost everything crossed off the menu but some lettuce items, a ham appetizer, and the trout. Their \"gluten free pasta\" is made in the same pasta maker as their regular pasta - like what is the point in that?? Come here for delicious gluten free lettuce in your winter best. We were interested because they made me a delicious custom dish at a food and wine event by just not adding the pasta, but don't expect that kind of service in the actual restaurant."}
{"text":"They got rid of their only vegan option, even though it is still listed on their website. Went there and had to settle for olives and fries as my entire meal. That being said, the food was good. Just wish the website was up to date."}
{"text":"This place was so good! We tried a few things, burgers, pork shoulder, oysters, salads, frites and every single one of them was delicious. The bartender is amazing and makes a killer Oaxaca, if you like spicy  you need to have this. Can't wait to come back  Their prices are very reasonable for the quality of the food your getting. Cocktails are less than $15 and worth every penny."}
{"text":"Go. Words won't do it justice.   Yelp says I have to write more. Please ignore this filler."}
