{"text":"Fabulous service and great place.  So refreshing to find a place with such a positive vibe.    Love it ....will definitely be back."}
{"text":"This is the best new place and it's right in my neighborhood! Besides the usual coffees, they do their own vegan baked goods in house. I enjoyed the best cinnamon swirl. Next time I stop by I want to try their Savory Toasts. The husband and wife that own and operate are really nice. Support local!"}
{"text":"Friendly staff, good iced caramel latte, and delicious cinnamon roll! I will definitely be back for another visit."}
{"text":"I was looking forward to stopping here, and I'm glad I did!! The atmosphere, service, and food/drinks are amazing. I gave them a rough description of what I like for coffee and sweets and they made me a masterpiece. I'm  recommending Kind Bean to family, friends, coworkers, you name it. If you're on a lunch break, and feeling a little meh, or just not into it that day, the atmosphere alone lifts your spirits; and the items they have to offer are quality."}
{"text":"I stopped off today for cinnamon rolls for a special occasion. They took the time to make the presentation extra special for me. This will be a regular stop for me for sure!  The service is awesome and the food is fresh and very tasty!"}
{"text":"Loved it! Got a blended mocha and a German chocolate scone! Delicious and the cherry on top? Vegan!!! Great place!"}
{"text":"Fluffy spirals of perfection. That's what you'll find at The Kind Bean! The cinnamon rolls perfectly combine soft and sweet to form a melt-in-your mouth breakfast pastry that leaves you wanting more. The avocado and caprese toasts provided a zesty, savory contrast resulting in the breakfast that dreams are made of! 

The best part: it's all vegan! Do yourself a favor and forgo your heart attack promoting McDonald's run and hit up this place instead. You won't be sorry!"}
{"text":"Simply the best!  The coffee is amazing. The fresh home made pastries are to die for (pecan cranberry scone). The toasts are unbelievably good (southwestern is my favorite). The owners Jen and Clay are just awesome people and they exemplify kindness.  Give this cute coffee shop a try and you won't be disappointed!"}
{"text":"Great job, Kind Bean!! Coffee and scones were terrific! You were helpful and we enjoyed the friendly faces. Love to support Local."}
{"text":"Randomly tried this place and was not disappointed! 

Had a scone, muffin, mocha cooler (blended drink), and iced americano. The baked goodies were AMAZING. Super yummy, moist, and very flavorful! Great quick breakfast! Americano was robust and just what I needed in the morning. My sister loved the cooler!

Sat outside on the covered patio and it was very nice! They brought our drinks out to us and checked in on us. Service was great, clean and cute decor, and being able to sit outside comfortably was a definite plus!"}
{"text":"Absolutely great atmosphere, surrounded by great employees and patrons. The owners, Clay and Jen, are among the most personable business owners I've met. The coffee and the food is excellent, everything is so fresh! I would much rather go here than any Starbucks!"}
{"text":"Cute place, sort of hard to find as you have to head North on Cooper to locate it in the shopping center. I stopped on my way to work after seeing a instagram post from a friend.  I love trying new places and providing support to small businesses.  Friendly and personable and I got the Mint mocha with almond milk. Pretty dang good, I didn't try any food but they indicated they make all in house and fresh. Love it and will definitely be back."}
{"text":"I LOVE Kind Bean. My wife and I are Vegan and Kind Bean is our new favorite place to splurge. It's about 40 minutes away from our house but it's always worth the drive. The staff is always incredibly friendly. We placed a big to-go order today and they gave us a free chia pudding to enjoy while we waited. The chia pudding was extraordinary! I felt like I could have eaten that stuff all day. The bruschetta is AMAZING. 

The first time we went we didn't order enough but this time we got 12! Enough for lunch, and dinner. Their baked goods are EPIC. If you go, and they have cinnamon rolls available, get one! They also have some tasty sweet treats! Today we got chocolate dipped marshmallows on a stick (which I ate on my way home! Guilty) and my wife and son split a chocolate dipped red vine. 

They also have smoothies, tea and coffee that are all delicious and EVERYTHING is Vegan!! 

If you are in the area, check it out. You will not be disappointed."}
{"text":"Food is delicious and the people are so \"kind\". Highly recommended this place to anyone. Plenty of seating outside in the mornings. Serving sizes are great. Coffee is on point. And I could keep going!  My husband and I will definitely be replacing our Starbucks coffee dates with The Kind Bean."}
{"text":"Stopped by for the first time today as we noticed this place close to our house and we decided to try it out. I'm an avid Starbucks drinker and their Dirty Chai puts Starbucks to shame. They have so many good coffee options, baked goods, and other food and I can't wait to try the rest out. The inside is really nice and finished well. A nice place to sit with my wife and enjoy some coffee or lunch. We will be regulars for sure, and will gladly rather come here than Starbucks."}
{"text":"This is my new go to coffee spot!  They've got great coffee and amazing vegan goodies!  Their prices are good and way better than Starbucks!  The owners, Clay and Jenn are super nice, inviting, and love to get to know their customers.  I love that they have fresh baked goods daily and I've been there almost every day since I discovered this great place.  Everyone should go check it out.  I would just say to bring your own takeout dishes because they use plastic here which isn't great for the environment.  I would bring my own Pyrex container or something."}
{"text":"I had an awesome experience this afternoon at KB with Patrick, Jenn, and Clay. They recommended a nitro cold brew. I got a small with a little almond milk. Fantastic taste and buzz. See you folks soon."}
{"text":"Welcome to the newest member of our neighborhood. This coffee shop has great scones and interesting botanicals and they serve it to you with as the name suggests a good dose of kindness ."}
{"text":"This is a great family owned coffee shop and so much more. They have absolutely delicious homemade pastries like brownies, cookies, muffins and scones. Normally I don't even like scones as they are so dry but these defy the normal scone and are delicious. Then add bruschetta, salads teas, gelato, chocolate......wow.
Numerous coffee options abound. Go & see for yourself!  
HOURS are

Mon-Fri 6am-4pm
Saturday 8am-4pm"}
{"text":"Amazing neighborhood coffee shop and...it's vegan! Coffee was delish and the vegan scones are perfection! You would never know they are vegan. Staff was so welcoming and made you feel like they wanted to know you. Great hours and easy to get to. Nice outside patio for those beautiful Arizona days! Look forward to my next visit!"}
{"text":"Wow. This place is amazing. I've eaten there a lot since they've opened and never been disappointed. The roasts are spectacular. The pastries are even better- best scones I've ever had in my life. I am addicted- I also love how there are soooo many new flavors daily for scones and muffins. Also one of the best cinnamon rolls I've ever eaten. Just wow. Can't compliment this place enough! The staff is also just the greatest people, super friendly and super caring  and attentive."}
{"text":"A wonderful and happy place to get a morning coffee with homemade fresh pastries. Lemon lavender scones, almond butter and strawberry jam toasted bruschetta wee scrumptious. The latte was so fresh and flavorful. I'm a picky coffee person and they won me over! They have lunches and cool salad options. Love it!"}
{"text":"Saw this new place show up on Yelp and then a friend went and mentioned how nice it was on FaceBook. Hubby and I decided to give it a try. I love the atmosphere and the inspirational touches. Had the almond cranberry scone which was delish! Their coffee was very good and the service was awesome. Really got a sense of community and caring. Can't wait to try more of theor yummy homemade goodies."}
{"text":"The pineapple upside down cupcakes are delicious! Great vegan spot and the staff is helpful with allergy requests. Will definitely be back."}
{"text":"It is dangerous for me to know how good their baked goods are! They are vegan and so delicious! Their black and white cookie is phenomenal. I am extremely picky when it comes to black and whites, and these ones definitely hit the mark. They also have savory food, salads, overnight oats, all sorts of incredible looking food! I will be trying some of those next time. 

The staff and the owners were so helpful and kind. They all made sure to talk to me, answer questions, tell me about the shop and to check in with me while I was eating to make sure everything was good. I am so impressed and I can't wait to come back! I would highly recommend that you do the same! 

ETA: The lemon blueberry pie scone just blew my mind. So moist and delicious!"}
{"text":"Delish coffee, friendly atmosphere and top notch service! So excited to be adding this coffee place to our neighborhood in Chandler. You have to stop by and grab a nice, iced cold coffee.. my office just happens to be right next door so I get to enjoy Kind Bean very often :) Owners Jen & Clay are super sweet and always going out of their way to make sure you're happy with your order!"}
{"text":"This is the best Vegan Coffee shop that I have been to. They have a ton of different options for sweet and savory, plus the staff is exceptionally friendly and speedy quick!!"}
{"text":"Super friendly service and yummy food! My favorite thing I tried was the banana fosters bruschetta, but the others were great as well. The cinnamon roll was delicious and the owner even warmed it up for us which made it that much better. I will definitely be back!"}
{"text":"Oh my goodness!  If your name is Kind Bean you have to live up to your name and they did!  We were treated so well from the moment we walked in the door until we left.  Everyone working there was happy to be there and made sure our experience and food was amazing.  The avocado toast is so yummy and several different kinds to choose from.  They have cold brew on tap and make everything in house.   Well done Kind Bean!  We will be back"}
{"text":"I like this place.  My wife and I live up the road and stopped in one day.  We're hooked.  Good coffee, vegetarian food, and chocolates.  The owners are warm and welcoming.  Good fast service without the corporate feel.  It'd be worth your time to check them out."}
{"text":"This place is fantastic! I had a dirty chai, and a couple of their \"toasts\" one was sweet, the other savory. Service was fast and friendly. Food and drink delicious. Location is convenient, prices are reasonable. I'll be back! Can't wait to try more."}
{"text":"Yes I like the chocolate cupcakes.
You were busy and I could not tell you this today morning.
But, I will come back to enjoy one of the best customer services I experienced here in az
I will come back to taste the amazing food, that you can easily feel that it was made with love
I will come back to see your smile 
I will come back to support an amazing family business.

I know that this business is quite new. So, Please keep the amazing work. Wish you all the best.

I recommend this for people who want amazing service, amazing food, support family business"}
{"text":"Not only can I grab my favorite coffee drinks but breakfast and lunch too (amazing healthy options )!  The cappuccino, mocha and scone were all fantastic. The coffee was very, very smooth with amazing flavor. 

This coffee shop is very warm, friendly and great customer service !  I love this place !!

Perfect addition for this complex and neighborhood! The best part is they are open early enough M-F so I can pop by on my way to work ."}
{"text":"Just stopped in for the first time and we love it! It's always great to support local and to find little gems such as this place. Their coffee blows Starbucks out of the water, and I can't wait to try their pastries and bruschetta! Our new neighborhood go-to!"}
{"text":"Stopped by for brunch. The workers were very nice and helpful. We had a dirty chai and a mezzanotte nitro to drink. For food we decided to have The Mediterranean mix, southwest black bean, bananas foster, and sweet danish bruschetta. We also decided to try the cinnamon spiral right before we left and it was the best decision we could have made. Everything tasted amazing, the environment was inviting, and we will definitely be visiting again."}
{"text":"So glad to see a place with vegan options in Chandler!! The staff is super awesome and the food and desserts were delicious!!"}
{"text":"What a nice find. We had a light lunch and the owners and staff are friendly and outgoing. They made sure we were happy with our selection.  They have specialty coffees, good music and free WiFi."}
{"text":"Finaly a Vegan Cafe worth every penny.
Great atmosphere, the pastries are amazing, the coffe is full of flavor , the owners of the place are nice,helpful and knowledgeable. 

Definitely i will tell all my vegan friends about this place ."}
{"text":"Today my first visit this morning and man, am I impressed! The shop is really clean and nicely decorated which I can appreciate. Not every local coffee shop is as collected as this one is. Everything looked professional from their menu signs to their logo. Their dirty chai is fairly priced and it's always a plus when they offer a variety of alternative milk (I love chai with soy but they also have almond and coconut milk). My drink was creamy and delicious! When the cashier rang me up he mentioned their treats were all vegan. I didn't want one because they were but I'm down to try new things and I'm glad I did! The scone was light and chewy, just the right amount of sweetness and was in love with first bite! I'm a sucker for scones so I chose the lemon lavender which was so good I did my little happy dance :p 

I'm assuming the man was Clay, the owner and he was super friendly and informative after asking if this was our first time here. My boyfriend is not a big coffee drinker but still had questions about the menu where Clay was ever so kind to answer them. I'm looking forward to trying an affogato sometime and excited about taking a growler of nitro brew home later on. It's lucky that they're right around the corner from us and a huge plus that they're by our favorite pizza shop! I'll be coming back and I wish them huge success!"}
{"text":"This place was amazing! I had the avocado toast and the toast with roasted red peppers on top. The avocado toast was amazing.  The roasted red pepper toast was also quite good, although I would try another one next time.  Some guy in the shop was raving about their scones and I wish I tried one.  

We were just in Chandler visiting for a couple days and we only came here on our last day - I wish we had gone here earlier because I would have come back the next day!  Highly recommend!"}
{"text":"As I was leaving the guy told me they have the best scones in the world. I looked at the vegan sign and in my head I thought: yeah right. I ended up getting one scone and after the first bite I was sold. Went back in to buy the rest of their scones. I'm not even a scone person but THIS is a whole new level of deliciousness. And to top it off they have amazing coffee as well! If you are ever in this area you MUST stop by and pick up an iced coffee and a scone 12/10"}
{"text":"OMG! 
Listen up Everyone! 
May 29, 2018, the great temporary Starbucks Shutdown date is less than one week away. WHAT ARE YOU GONNA DO? 
I'll tell ya what ya gonna do.... 
You're gonna make the date memorable, actually you'll make that date HISTORICAL because on that day, you'll find your NEW Favorite Little Coffee Shop of all time. And if you call AZ home, you'll be even luckier because there will be no reason what so ever that Starbucks should ever be on your daily coffee stop ever again. 
Listen up people. 
I'm not a foodie kind of guy at all. I'm just not. Couldn't care less about food. I eat cause I have too. Kinda goes along with breathing. In, out, in, out.... I mean really? Why? Cause we have to to L I V E..... 
SOOOO, while we are all Living, why not make those mundane moments throughout one's life kinda special? 
You want \"special?\" 
Then head on over to The Kind Bean 
Everything I've had there is truly AWESOME. 
I'm not sure what Clay and Jen are putting into all their goodies, besides all that Kindness, but whatever it is, I hope it's legal cause I'm freakin HOOKED. 
So mark the Great American Starbucks Shutdown (GASS) on your calenders and I'll meet you all at The Kind Bean. 
And don't forget to ask for their MOAS. 
You won't be disappointed....."}
{"text":"What a gem!! So many unique drinks and delicious eats. The owners Clay and Jen are super friendly. This was my first time here so I took Clay's recommendation of the Hummus bruschetta and bananas foster. Yum!!! The spicy mocha is spot on too."}
{"text":"Amazing place! Everyone is very friendly! Specially Jen and Clay. Sconces are out of this world! If you are thinking about trying it, you definitely should."}
