{"text":"The place has great Chinese food. I mainly get noodles, rice and shrimp but the service is awful! The girl at the checkout register is rude and apparently hates her job...which is why we don't go as often as I would like because the food is delicious."}
{"text":"Best. Chinese. Food. In. Avon. Whatever we choose from the menu, food's great. The owner is very nice too. Our favorites: steamed dumplings, general tso's chicken, shrimp in lobster sauce, and the lo mein. I'm getting hungry just having wrote these down..."}
{"text":"A fairly typical \"bed-sheet\" menu take-out Chinese place.  Maybe a bit cleaner than most... with an acceptable few tables for \"dining\" in.  I was pleasantly surprised by the tastiness of the lunch I took home recently.  I'd certainly try it again."}
{"text":"Alright... it doesn't look like much... just a nondescript joint in an Avon strip center.  But, the wife and I tried it for takeout again last night and... wow!  The food is surprisingly good... hot, fresh and, reasonably priced.  I hope you'll try it and keep this place in business!"}
{"text":"As far as quick takeout Chinese goes, this place is delicious. They have a few tables set up, but I've never seen anyone eating there.  It's very clean, and the employees are always really friendly."}
{"text":"The egg rolls were made of strictly mushy cabbage that tasted sour.  Two baby shrimp were included. In the rolls.  Really terrible tasting.  The broccoli and beef had mushy broccoli and tactless meat.  Even after adding soy sauce to the dish it still needed salt.  The won ton soup tasted like watered down green tea with soggy chewy won ton.  Even the fried noodles were stale.  I'd pass on this one.  Never again for me!"}
{"text":"Food was void of flavor except for the spring rolls.  No seasoning.  Vegetables didn't taste like vegetables, even.  Extremely bland."}
{"text":"The service here is exceptionally friendly, but when one orders take out, you may want to allow a little bit of extra time to go pick it up, because I have arrived twice and had to wait in between 15 and 20 extra minutes. This seems to be a normal occurrence here, as I have seen other people sitting around waiting for their food as well. 

The kitchen and dining room are very clean regardless of when one arrives. Clearly, they do take a lot of pride in the cleanliness of their establishment. That is refreshing in this day and age.

As far as the food goes, I would say tha it is of average, or slightly above average quality as it relates to most items.  The vegetables used always taste fresh, and most of the sauces are pretty tasty. However, I wouldn't consider anything \"gourmet\".

The prices here are very reasonable, and if you're looking for just a quick place to pick up some takeout, I think it is worth checking out. This is by no means a fancy restaurant, but I feel that they offer a reasonable level of quality and value for the dollar that they charge."}
{"text":"Lunch is always fantastic and the chicken is perfect, but if we order out for dinner, the chicken is small and hard. Don't know why it's going downhill"}
{"text":"Very clean, very friendly, and very good. Always nice to get a meal there. Never had delivery but pickup is always great. Highly recommend."}
{"text":"Love this place because the food is very fresh. Their service has always been good. Good soups. It's refreshing to have non reheated/ recooked food from a take out place. 
Convenient parking. Clean ambience. The kitchen looks clean as well. They are particular about having your order ready on time."}
{"text":"Great Chinese food around my favorite place. Highly recommended to try.price and foods"}
{"text":"Oh King Yuan, how I desperately wanted to like you. You had such potential...you are within walking distance from my house...you have a very large menu..your owners are oh so friendly and have a really cute kid that runs around the kitchen. But your food. Sigh. Its just not good. 
I placed a large takeout order for my family Saturday night. We ordered a good variety of food so its not like we had just one random bad dish. Everything was just blah. I ordered the pan fried pot stickers and my go-to dish, Sesame chicken. The pot stickers looked pretty and the dipping sauce was good and garlicky, but once I bit into them I was instantly turned off. The filling was just plain gross. It almost tasted a little gamey. I couldn't even finish the first one. The sesame chicken was horrible. All dark meat and tiny pieces. Sesame batter would have been a better name for the dish because that was all I tasted. My boyfriend of course ordered the Mongolian beef and was not happy with it at all. The beef was slimy and rubbery, and the sauce was too spicy.   The crab rangoon were nothing but cream cheese in flat wontons and the egg rolls were very bland. I didn't try the other dishes we ordered, but everyone agreed that they have had better Chinese food at the mall food court. Halfway through the meal we all kind of put down our forks and started to rummage through the refrigerator for any kind of leftovers we could find. Anything would have been better than what he had. 
Sadly, I would not recommend King Yuans to anyone."}
{"text":"Best Chinese takeout in the area. Very quick, never more than a 15 min wait on walk-in service or call ahead takeout.  

The sweet and sour chicken is fried perfection and the General Tso is wonderfully prepared. 

We visit this location about once a week and have never been disappointed."}
{"text":"Cleanest Chinese eatery in the Avon/Avon Lake, Ohio. Friendly staff, great food. Food is always hot n temperature and spicy. I enjoy spicy food. It is the run of mill \"cheap Chinese\" food.

Down side, the bathroom is not as clean as the lobby."}
{"text":"Hands-down best Chinese food in the Avon/Avon Lake/West Lake area!

f you have a taste for Chinese food, this is the place you can't miss.
Owner Amy is super nice, and Chef Sun is awesome. They use no MSG in the cooking and their pot-sticker that made from scratch is absolutely delicious.
Another great dish I would recommend is the fat rice noodle (Ho-fun). You can have it with Chicken, Beef, Pork, BBQ Pork or Shrimp. Give it a try, I bet you won't regret. :)"}
{"text":"How does this place not have 5 stars? The best Chinese in the area! Wonderful family that runs the place."}
{"text":"Other than the rude delivery driver and marginal food this place is average at best. Not only did they forget my drink I ordered with my food, but they also charged me for it after telling me they wouldn't. No way to do business."}
{"text":"As far as these types of \"standardized menu\" Chinese places go (and it seems that's about all we've got in the Avon/Avon Lake area), King Yuan is a cut above the rest. Here are the plusses, in comparison to local competition:
1. Clean, clean, clean. It is spotless in there.
2. Staff who make an attempt to be personable.
3. More fresh veggies than the others. (Some are still of the canned variety.)
4. Beef and chicken that look, feel, and taste like beef and chicken!
5. Homemade pot stickers."}
{"text":"I'm giving them four stars on a scale for Chinese takeout. Let's be honest, Chinese takeout isn't what you get if you want food that blows your mind (if you do, I'd recommend  choosing a Japanese steakhouse or really good Thai place.) But my food was satisfying and very enjoyable. I've definitely had the worst case scenario Chinese takeout, where it's simply inedible, and I was relieved that didn't happen here. I think $7.75 for a bourbon chicken combination plate was a good price. I had never had bourbon chicken before, and expected there to be sauce, which there was not. However, it had a good marinade, and the texture of the chicken was good. It was a nice alternative to sesame chicken since it was still lightly sweet but I wasn't in the mood for breading or super sweet sauce. The fried rice was very nice once I added a packet of soy sauce. Good egg roll. One drawback is the $18 delivery minimum, but my order not qualifying saved me $ on a delivery fee and tip. The food was ready when I got there, and I was able to pay and get back out the door surprisingly quickly. I will order from this place again next time I want some solid Chinese takeout."}
{"text":"Grabbed some take-out for dinner on a Monday night.  Ordered the General Tso's with white meat (special request), extra spicy, with an egg roll.  The General remained hot and did not get soggy during my drive home.  It was plenty spicy...I love the pain, and they brought it.  The egg roll was standard, if not a bit small...but good.

I may have found our Chinese spot in Avon.  Maybe."}
{"text":"I was very pleased with the food here this time. I tried before when I think was under different management and this is a great improvement. The boneless spare rib is great, sweet and sour chicken great, General Tso is decent, fried rice good and the egg roles are decent. I will come again and hope the quality stays as good as this time. I am trying to avoid the Mandarin restaurant down the street which used to be my favorite but went down hill year after year until I just had to stop going."}
{"text":"Quality has taken a dive since the new owners took over. Before I would rate them a 4 or maybe even 5 considering they're just a regular Chinese place with the standard menu available anywhere. Seafood isn't as fresh and extras are left out when I have a delivery order. Still not bad, but not exceptional like it was before."}
{"text":"One of the THE best Chinese restaurants in the area.  I have tried many of the other Chinese restaurants around and this one typically has the freshest ingredients."}
{"text":"Had there gen so worst chicken ever , it was hard as a rock , was disgusting . I would not recommend eating there .almost broke my fork try to grab one . Gross gross gross , and what about child labor laws"}
{"text":"I went to this restaurant on two occasions. Both times I saw chicken sitting out first I thought maybe they were working to pre-cut it and put it away. The second time I went in the chicken was out again. This time I went and got sick from food poisoning. I thought I was going to die. Trust me save yourself a night of puking and diarrhea. DO NOT EAT THERE"}
{"text":"Had the Pork Lomein lunch special with egg roll and coke.  It was very tasty and I would eat it again.  Fast service and it was clean.  Will be going back here."}
{"text":"Had takeout from here last night. I had general Tso  chicken and it was delicious! There was a ton of food and it was reasonably priced. The chicken wasn't over breaded, so I liked that I didn't feel like I had to eat tons of breading to get a tiny piece of chicken. It was reasonably spicy, but didn't kill me. The wonton soup was good and of course my 5 year old ate all the egg rolls! Love the service and it only takes 10 minutes!"}
{"text":"Great food. I love how kind they are too!  They barely speak English but are so great here ;)"}
{"text":"Mixed results with my first visit.  The fried rice and egg roll were good, which should be standard for a Chinese place.  The vegetables in my Hunan beef were perfectly cooked and tasty.  However the quality of the beef was not consistent.  One bite would be tender and tasty, the next would be chewy or gristley.  The heat/spice of the food ended up being too much and I could not finish my meal (and I can handle moderate heat).  The hot and sour soup was also so hot it overwhelmed the flavor.  I don't think this is the Chinese place for me, and will probably not return."}
