{"text":"contacting the health inspector about this place!!!! I went in an hour before they closed hoping to just get a box of California rolls (sushi) to go... I seen what was already made and the avocado was brown. This didn't look too healthy so I figured it had been sitting out for a while. I kindly asked the man behind the counter to please make me a new roll as the ones that were there didn't look very good. He agreed but when I watched him open the container the avocado was in, the whole container was bad. That is a food safety violation. You cannot serve someone completely brown avocado, It means its been sitting out for too long and the air exposure has caused it to soil making it have a sour taste and smell. I told him that avocado didn't look too well either, he continued to put it in the sushi roll cutting eyes at me. I then asked if there anyway that he could cut a new one, He rudely said no this all we have. So i told him no thank you! I asked the lady at the front desk to speak to a manager, she pointed over to the rude guy attempting to serve me soiled food and said he is the manager. Well thank you but you will no longer receive any business from me or my associates. It makes me sick that he is so cheap he will be willing to serve people bad food just to get his moneys worth. Compromising peoples health is no way of conducting business. And I will make sure that he feels the wrath of this angry customer."}
{"text":"They do have a wide variety and it is fairly well priced but that doesn't excuse the bad food. The chicken and brocolli was good, but besides that I didn't even enjoy their fried rice, and that is the staple I primarily judge my Chinese food experiences on, it was yellow rice with unappealing looking pork and a bag of frozen peas and carrots mixed in.  So disappointing since my main reason for picking this spot when we had a hankering for a Chinese Buffet last week was the 4 star yelp review."}
{"text":"Probably  the worst food i have ever eaten...The guys in tent city eat better than this. Went to this restaurant on Tuesday  vomiting and diarrhea stopped on Thursday. Great place to go if you want to lose weight. Restaurant was filthy ,restrooms worse than filthy. I intentionally ate things that were not likely to give me food poisoning, salad, freshly cooked Mongolian BBQ. still ended up sick as dog. Quality of food and freshness were horrible  only ate a small amount because it was a family function 1 hr from home and I was starving. I hope those of you who gave this place a good review were getting paid to do so. DO NOT EAT HERE UNDER ANY CIRCUMSTANCES."}
{"text":"We came here on New Years Day for a late lunch.  There were six of us.  The atmosphere was dark but clean if kind of out dated.  The service was indifferent but polite.  However, the food was terrible.  Nothing was hot enough and the quality was poor.  I'm sure the food temperature was well below safe limits.  I ate some of the food and am now feeling sick.  None of us will ever be back.  My recommendation?  Never eat here."}
{"text":"This use to be my favorite buffet but they dropped the price and dropped the quality of the food apparently. Rice was way undercooked. Sesame chicken was kind of sloppy looking and sushi had a sour taste. Not to even mention that the place is super unsanitary. Bathrooms are beyond gross."}
{"text":"This place now Have Escargo, (think big snail). deeee ...liciouse... no other Chinese buffet offer that.!!! yum,,,yum. perfect!!!!"}
{"text":"Me & the wife get a seafood craving so I check Yelp and like what I see on this restaurant so off we go. As Chinese dinner buffet prices go its affordable but doesn't take long to realize why the bargain.   The food was average for the most part. The saving graces were the Mongolian BBQ & the coconut shrimp (way good!). The service was fine.   The turn offs were the decor & lack of cleanliness (sticky floors, cruddy restrooms).   If you're on a budget & want to fill the family go for it. If you're wanting to take your honey - naw..."}
{"text":"This restaurant is absolutely disgusting! It is difficult to believe the health department has not shut it down. It is dirty, rundown and uncared for. The food is subpar and looks unappetizing. My husband likes the unlimited crab legs, so I sit with him for part of the meal, go someplace else to eat, then join him later. I refuse to eat there after my first experience."}
{"text":"First time here with my family. We got there before dinner and a few of the dishes were not warm, scary. Everything else tasted pretty great, the selection was adequate. The sushi had too much vinegar on the rice which overpowered everything else on the rolls. The dishes seemed to have a film on them that I scraped off with my fingernail, EWW. The crab legs were a little stringy and flavorless. If you decide to go, do it around 5pm when they put out the new hot steaming trays of food! The lighting and decor were both a little dark.  I may or may not return here."}
{"text":"This place used to be decent, I tried it today at lunch for the first time in a while.  The food was terrible, tasted very old.  The quality has tanked.  The bathrooms were the dirtiest I have ever seen, plus no TP in either stall.  I should have drove back to Franklin Square for the NY Hibachi.  At least the Pepsi was good."}
{"text":"Had the grandparents over from out of town and I was looking for somewhere not too pricey but decent eats. This place was not it for sure. They sat us way in the back near the kitchen and bathrooms when the entire place was empty. Their food selection was poor, almost everything was fried. The place looked run down and lightning was horrible. We will never return to King Buffet."}
{"text":"King buffet has a wide variety of Chinese food. They have great service, the servers come around very oftentimes to check on everyone. Next King buffet offers a dessert and salad bar. I definitely recommend this place to everyone"}
{"text":"The husband and I stopped in for lunch - felt like Chinese today and looked up a buffet that was close to where we were. We were hesitant because of the reviews but decided to gamble. We were immediately greeted by a nice gentleman as we entered the door, he showed us to a booth and took our drink orders. They came by to refill our drink orders often- the service we received was good. The food was decent - not the best I've had but not the worst. My husband liked the food more than I did actually. The building definitely needs some work/updating. It is outdated but I didn't necessary consider it overly \"dirty\". The floors weren't sticky but the ceiling fans had a considerable amount of dirt built up. Overall, average experience here."}
{"text":"DIRTY!!!!! The food Meh but the establishment was not clean at all.  The floors were very dirty and the the booth we sat on was disgusting.  It felt as if the place had been closed for years and never cleaned before it re-opened. The carpet flooring was also very dirty and it our waitress never came back after she seated us. There seemed to only be two people working on the floor the cashier who did pretty much everything and one waitress.  I'm definitely not going back."}
{"text":"Well not one of my top Chinese buffets in the valley but a really good place. The food was very good and had over 100 selections.Some of the items that stood out were the hot and sour soup ;chicken balls on a stick, BBQ pork spareribs and the deep fried breaded shrimp was awesome ,it tasted like they breaded there own fresh shrimp ,I have never had them taste as good as here.The chinese donuts were a little crunchy on the bottom and only get a three star rating but a good place to eat with a lot of good choices. Oh ya and are little Chinese girl server was real cute."}
{"text":"Nice place for the money, good selection, food was good, service acceptable and interior fairly nice. If you're looking for a swanky place to impress your date, this ain't it. If you're taking your family out to have a meal that won't kill your budget, than this place is great! I definitely will go back again."}
{"text":"This place has been around for years and, as I understand, has changed ownership. It's a bit difficult to find as it's tucked in the corner of a plaza and can't be easily seen from the road.   The food was good; what I'd consider typical buffet fare. Really enjoyed the egg foo young, but after I gobbled up the last piece, it was not replenished.   The cost for dinner was reasonable.   There was only one other couple in the restaurant and this was during dinner time on a Wednesday.   Contrary to other reviews, it was clean and the service efficient, if not unremarkable.   It seems to me that they need some good business advice:   1) The location is too large for the business they are doing. The Yogi Berrism, \"No wonder nobody goes there; it's always to crowded\" does not apply here - the place is cavernous rather than cozy.   2) A few inexpensive decorations here and there are in order. For example, one of the first things you see upon entering is a small, built-in fish tank made of ceramic tile. However, there is nothing in it - not even water. Why not fill it with some plants?  3) If you're looking for a good salad bar, keep on looking. Like a sumo wrestler attempting the pole vault, my advice would be \"why not just shut er' down and put your effort somewhere else?\"  4) The music - good grief - the music! This was bad enough to drive a starving mouse out into busy traffic! The entire time we were there one lonely song played on an endless loop. Even worse, it sounded like the intro tune for the pilot to a failed 1950s TV western. Seriously, this monotonous \"song\" blasted on a couple of loudspeakers would be a more effective tool against terrorists than waterboarding.  All in all, I would revisit this establishment (I might check to see what's playing on the Muzak first). I have a heart for small business owners and hate to see a place like this languish.   Give it a try. If you're the type who's tempted to overindulge when confronted with unrestrained dining, the music may just keep you from overeating."}
{"text":"Thought it was ok. Went there again today and it is now closed for business. Oh well, not a big loss. I guess it's on to another buffet!"}
{"text":"You get what you pay for basically but OMG is this place dirty! The floor in the entire buffet is sticky. It's like they've never mopped here before. Felt like I was walking on 5 years worth of spilled soda. The bathroom was even nastier, I'll leave out the specifics since I'm sure others have done that by now. 8 bucks for a lunch buffet from 11:30am to 3:00pm. My visit didn't start out good. The first thing I tasted was the incorrectly named mac and cheese which had no taste at all and tasted like just pasta and water with nothing else in it, which was improperly labeled as crab legs. Things got worse from there as I found out I didn't like their spring rolls and completely hated the sweet and sour sauce. I asked a waitress if she could make me pizza without pepperoni and she just simply shook her head no. I went to the hostess and asked her the same and she had it made for me in just 5 minutes. I guess the waitress didn't know english. I'm glad I asked for the pizza cause it was the best thing here. The onion rings were cold and there was no barbacue sauce to go with it. The fried plantains were good, really sweet and tasted almost like a Dominican made it, which is a good thing. The fried rice was alright. There wasn't much for me to eat as a vegeterian other than salad and the couple of items I mentioned. I'm not the salad type so I was left with under 4 things I liked in the entire restaurant. That's not what you want when you go to a buffet. I'll give them 2 stars for the pizza, fried rice and fried plaintans but honestly I'm being a little too generous right now. This place deserves to be shut down."}
{"text":"Why do I keep giving Chinese buffets a second(thousanth) chance?  I really don't know, it's like Ikea, where you keep going there every 6 mo. hoping for that old 'novelty effect' you remember from your first time, but all you get is a hot, crowded store with no customer service filled with hot sweaty people and ugly couches.  Yes, they have nice meatballs if you can stomach sitting in their disgusting eating area where open dirty plates are everywhere and food covers ALL SURFACES.  It's like a bad addiction that you keep trying every now and then, thinking it might end up differently!  Back to King Buffet...Stuffed between massage parlors and thrift stores I might have known better, but I thought I remembered a first time visit that wasn't too bad.  Walking in I noticed 9.99 buffet...Pricey for a place that's empty, but what's another $40 for the family to try something new, right??  A BIG MISTAKE, I found out.    The place only had 6 other people in it.  The floor reminded me of the upstairs floor of my parents' old barn (the barn was built in the early 1900s and hasn't been used in 30 years).  I expected grumpy, suspicious asians to meet me at the front and they did not disappoint...Old signs painted in a crayon crossed out the \"12\" in the \"Children Under\" definition and hand-wrote \"11\" (their idea of increasing revenue, I guess) - mushy chicken and balls of unidentifiable stuff on sticks filled the pans--at least those pans which contained food, which was about 25% of their overall food area.  The rest looked abandoned.  The food was really pretty bad - I mean terrible.  The place was dirty, the bathrooms were full of gaping wall holes and broken tiles, it was a large area but ridiculously old and unkept, reminded me of a haunted house attraction I went through somewhere once.  Funny, I used to think Hometown or Harvest buffets were below me, but...No not really, that would have been twice as good as this place and probably cheaper.  It's weird how Chinese buffets don't seem to have a solid grasp of the correlation between price and value, that's why they are empty.  I've never been one of those people who think \"chain restaurants\" are beneath them - on the contrary, most chain restaurants do a far better job of accountability and consistency than the \"local\" places and I generally prefer them but Chinese buffets need to be in a category all by themselves.  You just never know.  I should have gone to Rubios and paid 2/3 that much for a far better family meal!  I believe that a reasonable analysis of restaurants (or any product/service) should be about value vs. price.  Not just value.  So I'm not one to think that low-value places are beneath me - i.e. I McDonalds serves a heck of a product and achieves an amazing level of service FOR THE PRICE.  Whereas, I've been to local haunts around Chandler that the locals try to patronize that did a terrible job of price vs. value matching (Arriba and Brunchies come to mind).  But if you're really into the 'experimental' type of eating out, try King Buffet.  Who knows, the General Chicken may actually contain poultry when you go!"}
{"text":"HORRIBLE!!! Gelatinous goo with heavy film. Kids running wild through the restaurant and when we found a long black hair in the crab puff that was enough. $19 for crap! Stay away!!"}
{"text":"Caveat: I didn't eat here.   Get out of this place fast. You have entered the foul zone. This should not be considered edible food under any circumstance. The smell and look of this place should dissuade you from sitting down and further more eating. If you have better luck than me...you're truly special."}
{"text":"I went on a Sunday afternoon. The food was below expectations as compared to the other Chinese food in the area. For some reason the heating trays were set to high and I burned my hand on the steam rising between the entree platters. The selection is poor, bland, and did not seem to be changed out after getting old. The basics (orange chicken, beef and broccoli) were okay. Sushi bar looked weird. The interior is old and worn. Wait staff wore dirty clothes. Children were playing in the dining area and seemed to be the employees children."}
{"text":"Was just there this past Monday, and here's the scoop -- you have to be realistic about these kind of places.  Food is mediocre at best, but there is a lot of it and its cheap.  I definitely have had worse, but for the price (under $7 for a senior citizen including the drink), you cannot go wrong.  Some positives -- they have a basic Mongolian stir-fry BBQ, but on it, there is fresh shrimp that you can make your own stir-fry combination with.  You cannot compare this place to buffets like Zen Buffet or Pacific Seafood Buffet, but for the price, you cannot go wrong."}
{"text":"I like this Buffet a lot. The price is wonderful and the service is good. This is a buffet, so I do not expect any \"interruption\" during my eating. The food variety has been fabulous, considering how much I pay."}
{"text":"Finally found a buffet worse than City Buffet. How do these places stay in business? I couldn't finish anything I tried. Finally got so disgusted I walked out went to the Chinese Gourmet 3/4 mile south."}
{"text":"After a while of being here fresh food finally came out. Not worth the money you pay. Bathrooms are so disgusting I was scared to us it. Definitely won't be back here ever"}
{"text":"Food was fresh and well cooked but it just didn't taste very good. It was a hole in the wall place and the service was good but it seemed like no one wanted to be at work. I tried almost every Chinese dish on the buffet line and didn't like any of it."}
{"text":"GROSS. I had one bite of each item of food I brought back to my table. Not one dish was edible. Even the rice was overcooked. The salt and pepper shakers were sticky, i had to ask for new silverware TWICE. My fiancée and I refused to pay but offered to pay for our soda. Luckily they agreed. Will not be returning to this establishment. DO NOT EAT HERE!"}
{"text":"I used to go here a lot when I was younger but then we got more buffets here. You might not get the best quality food here, especially the sushi (I don't recommend you eat the sushi here), but it's cheap here so I don't expect much. I'd still probably go here every now and then if I'm having a bad day and want to binge but don't want to pay extra $$"}
{"text":"Well this place is close to my job so I thought I would go in after working a late shift. When I walked in it look like any other buffet place, OK. I asked for a dinner to go and the lady in the front gave me a white Styrofoam to go container, OK. As I go around and get the food I wanted the lady followed me around as I was going to stuff shrimp in my pocket, I was the only one there but it was still embarrassing, not OK. I hate being racially profiled especially when i'm giving that person my money. Also the food wasn't even that good, it tasted bland but was edible."}
{"text":"My husband and I have eaten at King Buffet about 7 times in the past month. Don't let the outside fool you. The food is delicious!   Their sushi is fresh, and they have about everything you can think of. Teriyaki chicken, sweet and sour, lo mein, rice, crab wontons... you name it!   Their sanitation rating isn't the highest, but it's an older building. You have to take that into consideration. Nowadays, you aren't allowed to build any restaurant building with carpet inside. It's \"unsanitary.\" But this place was built when business's could have carpet. So, just keep that in mind when you go.   The people who work there are polite and treat you with as much respect as you treat them.   If you go to King Buffet, you will definitely see us there!"}
{"text":"Shitty food and environment. Spend your money at a better Buffet. They don't take very good care of the place and the food has pink goo inside it..."}
{"text":"I love their food i have been coming here for years. It's a dive place but their food is always good. This is a great value for the money. I have brought many people here and they always lube the food. Keep up the good work!!"}
{"text":"Used to be okay.   Last time I went there was mold on the wall where people sit.  Went to tell a manager and she argued with me about whether it was mold or not."}
{"text":"When it comes to Buffet, I only eat the protein and steamed veggies and salads. My trainer wants me to consume more egg whites, but I'm too busy to prepare and peel hard boiled eggs at home. Solution? Buffets! I come here, so I can eat the recommended amount for body building. What do I think of this place?  Just Okay! I wish they'd offer more healthy options like steamed veggies. But judging by the kind of clientele they attract, most like fry food and sugary dishes. LOL  The service was fabulous, though, but I'm not a fan of buffets. I only come here for the egg whites."}
{"text":"Went there for lunch yesterday completely out of the blue.  Had business to do in the same plaza, and just ended up parking and going in. I doubt I'll be back because of where it is and the many preferred buffets closer to me, so I'm going to write this one-visit review.  The lunch price w/drink was just under $8. I'm not good at counting dishes, but they had enough for a decent variety on your plate even after your second go-round. The food was hit and miss.  The only thing I had that was nasty was some chicken that was supposed to be buffalo style.  Other than that, nothing blew my socks off but for $8 its better than most budget buffets I've been to. I want to mention their fried fish fillets and their fried chicken wings.  These both were the best out of all the buffets I've been to ever.  The batter on the fish was ridiculously good and the chicken had the perfect 'Chinese' taste without the aftertaste.  I wish I had gotten more of each, but I tried them at the end of my visit when there was no more room in the ol' silo. The place itself isn't much to look at.  No ambiance.  Sticky floors made me feel funny-haha as I walked to my seat.  There was a group of small children running around the place making all kinds of noise...but that's something I'm used to so it didn't bother me.  Pretty empty and a bit dark.  They could use an interior update.  Didn't venture into the bathrooms.  The serving areas were lacking in organization and presentation.  I dunno why, but sometimes I feel bad when owners don't spend time on presentation...like its my fault for not helping them with it.  Whatever.  Nothing was nasty or dirty on or around any of the islands, so that was good. Someone who seemed like management walked up and down each aisle constantly checking what needed to be replenished, and that was cool.  I lingered in front of an empty fried shrimp tray with a pathetic look on my face and he gestured that more would be coming out shortly.  The lone server took pride in what she was doing and was super-friendly.  Only the cashier seemed to be elsewhere in her mind.  All in all, a good experience and a nice lunch of eating too much.  Good price, decent food, and sticky floors.  A budget buffet; I'm learning that there IS such a thing.  A-Ok, is accurate."}
{"text":"Where to go on years where your ex gets the kids for Christmas day lol Food is good too! :)"}
{"text":"Looking for some Chinese buffet, came across this place. Wandering in it was not busy and the buffet was depleted of everything. Finally the kitchen staff started bringing out items and filled up the buffet, only good thing about this place. Pretty bland, not worth visiting!!!"}
{"text":"I loved this place! Reminds me of childhood memories, the food. The waiter and waitress are humble, and seem to work really hard. I wish I could donate some money to them, if I could."}
{"text":"Such a great selection to choose from along with nice employees! I love coming here on a weeknight with the family all the time. Food is just great as well. I've been coming here for about a year already and I have yet to run into any problems here."}
