{"text":"I work near King Dragon, and so I get the lunch specials every once in awhile.  I basically always get the L9 - shrimp with mixed vegetables and it never disappoints.    It's the Chinese food that you would expect at the prices you would expect."}
{"text":"Best Chinese in Stow, if they say 25 minute's sometimes it's an hour. Friday nights are always busy!"}
{"text":"Crab Rangoon in my opinion was too sweet. Beef teriyaki was very tough and chewy. Not really able to enjoy it. They were incredibly busy though so good for them!"}
{"text":"This is phenomenal Chinese food.  We order from this place fairly regularly.  We are vegetarians and the proprietors are more than happy to adapt any dish to feature tofu instead of meat.  The sauces are excellent and the veggies are always crisp and fresh.  Now, what separates this place from the rest for me is the tofu itself.  Many restaurants ruin tofu dishes, but not this place.  The tofu is always golden, firm, and fried to perfection.  It is the best tofu I have had anywhere.  Even if you are a meat eater, I recommend ordering the tofu because it is really that good.  The owners are always extremely friendly and personable.  I cannot recommend this restaurant enough, if you're in the area you owe it to yourself to eat here.  So good.  Also, it should be noted that entrees are not served in styrofoam, but in reusable plastic take-out containers with snap-on lids.  This always keeps the leftovers fresh.  Now I'm getting hungry.  Best Chinese restaurant I've ever been to.  (note: Only a couple eat-in tables.  I recommend take-out)"}
{"text":"only good Chinese take out in stow. I WISH THEY delivered!!! anytime i tried another place was only due to laziness not wanting to move and i've regretted it EVERYTIME! good servie, great food!"}
{"text":"Perfect place for a take-out, work day lunch.  They have a basic Chinese take-out menu and their service is EXTREMELY quick.  You can walk in, place an order, and it will be ready quicker than some sandwich places!  Not a sit-down restaurant though.  If you're looking for that in Strongsville try Sakura or Shinto."}
{"text":"Other Yelpers below got this one right...good, fast, cheap Chinese take-out (or eat in, but small area).  I tried their General Tso's chicken and an egg roll on the side.  Portion was huge and quite tasty.  Their fried rice was different than others I've had...sort of \"lighter\" in taste but still good.  Egg roll was nothing special, and actually the meal was so large that i really did not need the extra food (may just get an entree and rice next time).  Close to my work spot, so easy to get to and super fast.  I will be back!"}
{"text":"I have to agree with John. This is no frills, nothing foo-foo, just consistently good Chinese food really, really fast. Also it's hard to Wor Shu Gai at most Chinese places around the Strongsville area."}
{"text":"I've been to King Dragon a lot. I'd give them five stars if they still delivered. Everything I've have had has been good. They are very consistent and friendly."}
{"text":"I've eaten at Chinese restaurants all over the United States driving truck for two years... Been all over Canada... I had chicken and broccoli today February 7 ,2018 in the afternoon whoever was cooking did an outstanding job!... . The egg drop soup was kind of bland... Could use a little spice.... Best chicken and broccoli I've ever had!... Great job Chef!!!"}
{"text":"FAVORITE Chinese takeout in the Strongsville area. They are always fast, friendly, and the food is always great. I've never had a problem and my food is always ready when I arrive. The little boy who waves to me every time I go in, is my favorite part."}
{"text":"My wife and I recently moved to the area and decided to try this place out.  I ordered the beef and broccoli which was really good. My wife had the sweet and sour chicken which she really liked.  We went back a few weeks later.  I had ordered the same and my wife ordered the szechuan chicken.  I thought the beef was a little tougher this time trough but my wife like the szechuan chicken.  I would still go back."}
{"text":"Haven't been here in years so we figured we would give it a try. Everything was OK. The veggie chow mein was a little bland but some soy sauce fixed it right up. The egg foo yung was hot, fresh, a little greasy, and the gravy was good. We also ordered egg rolls which were standard run of the mill Chinese take out egg rolls...not bad but not something to write home about...they were satisfying. This place isn't the best in the area but in a pinch I would definitely order again.   Update   I would like to rescind my previous review and say...King Dragon...you suck. For $26 I got fried rice that wasn't even cooked, sweet and sour chicken that contained mostly bits of batter from the deep fryer, Mongolian beef that was really Mongolian onions, and egg rolls that were barely cooked. You weren't even busy. Never again...garbage product."}
{"text":"Fast, friendly service and large portions. I ordered Moo goo gai pan, pork fried rice and Szechuan beef. Traditional take out and flavor was really good. Best chinese take out in Strongsville area."}
{"text":"Over the past couple years, we've gotten their food almost twice a month. Its been consistently good to great. Its easily the best in the area. Great egg rolls. The kids love the Sweet and sour and the General Tso's. I love the 8 Jewel and the Szechuan. The Egg Foo Young is literally 3 meals worth of food for $8 and its delicious. 4 stars for sure, but I give them the 5th star for being consistent and reasonably priced. I'm thankful this family is running this business in my neighborhood. They care."}
{"text":"Pleasantly surprised! I love American Chinese food. It's a guilty pleasure. I'm always in to trying new places. This popped up on Yelp and I decided to give it a go.  We got there, and it is a typical Chinese restaurant. Limited seating, an older Chinese lady in the corner watching YouTube...ya know, the usual. We placed our order (which seemed expensive, but I figured why not.). We were never given a time to come back, and we went to sit at the unoccupied table... dead fly on it. Not cool. So we retreated to our car. The lady who took our order actually came out to tell us it was ready!   Got home and Holy food!! The portion sizes were beyond generous. My husbands fried rice container was literally bursting at the seams. I was so surprised that everything was delicious!!! Not one thing we ordered was just okay. Everything was perfect. Even our 8 year old and 10 month old devoured it!!   We will be going back. End of story.  ** I took away one star because of the dead flies, the older YouTube lady, and we weren't offered any additional sauces (soy). Very minor things. **"}
{"text":"decent food. Average menu and prices. Not good, not bad but ok."}
{"text":"This place gets worse and worse , Ordered  5 large shrimp fried rice , in each one container I had only 5 shrimp they told me it's 20 ??? I always order from here I called them to tell them they messed up Order they didn't care or offer anything I didn't want nothing but to tell them but I will tell everybody now about there customer service"}
{"text":"Pretty ordinary storefront Chinese food. Popular for take out but too noisy and dirty for eat in. The food is ok by American standards and is cheap."}
{"text":"Very good food , pleased with the large portions and eggrolls are the best in the area ! Glad to have found a great Chinese place in the area. Disappointed that they do not deliver."}
{"text":"My go-to chinese take out! Everything here is super good! I love the fried wontons in garlic sauce, steamed dumplings, egg drop soup, and boneless spare ribs! Best in the area!"}
{"text":"I've gotten food here four times already and love it! Always quick and good service. The only problem I ever had was the fortune cookie was stale the last time I went, but I was so full from all the great food I didn't care!"}
{"text":"Excellent Kung Pao chicken! A good deal for the price."}
{"text":"Should have ordered here tonight. Regretfully went with Deans House.  King Dragons not the greatest, but it's decent and probably the best Strongsville has for Chinese delivery.  My expectations were tapered initially anyways, but at least did not disappoint. Would order again."}
{"text":"Maybe it's what I get here but I really love this place. We had steamed dumplings, fried wontons (we asked for both the garlic and szechuan sauce which they were very accommodating amount), and the mixed vegetable with white rice. The garlic sauce with the fried wontons I could eat off of my shoe. It was fantastic and I may ask for it on everything.   The steamed dumplings are one if the best Chinese dishes I have ever had. I have ordered them alone for dinner. The mixed vegetables were great too, and I could order that alone and not miss meat at all.   All I really have to say is keep up the good work and I will continue to crave the food here."}
{"text":"Only giving one star because you have to pick one.  What kind of Chinese place doesn't deliver?  We did takeout and the teriyaki beef was very tough, and almost impossible to enjoy.  I'll stick to Phoenix express they state they don't deliver on all their advertisement unlike this dump.  Plus Phoenix is pretty good.  I think tong tongs is probably the best in stow but it's on the other side of stow."}
{"text":"I wish you could give negative stars!  We switched from our normal Chinese restaurant because someone suggested it.  It was overpriced for what we received.  Our order was wrong.  Ingredients that were supposed to be in dishes weren't there and there was lots of \"fillers\"--like broccoli, peppers, etc.  Additionally, the pot stickers were raw.  Will not return!"}
{"text":"I believe that restaurants are supposed to note on their menu they use meat substitutes. What I got was not beef or chicken. Will not be back."}
{"text":"We arrived mid afternoon on a weekday looking to quell our Chinese withdraw before heading to Panera. Before I begin my review, I must issue a small ode to Panera. We walked in, took a table, drank their water, played board games, used their bathroom, and ate takeout from another restaurant while buying nothing from their's, and they STILL didn't kick us out!   I ordered my usual quart of Beef Lo Mien. During the wait, expect to be unwaveringly challenged to a sword match by one employees child until your food is ready. 5-10 minutes later, we receive our food. The gustatory experience was little removed from ones typical Chinese takeout cuisine, and overall, was very satisfying.  The service was avid, however the employees seemed to be a little unhappy. This did not influence my review however, as everyone has bad days once in a while.  All in all, if your looking for a quick Asian bite, and exercise via sword swinging to help burn off them future calories, look no further than King Dragon. They'll give you all the Chinese food you want relatively quickly at a reasonable price. Give it a try."}
{"text":"Not the greatest Chinese food you'll ever have, but better than the rest in the area.  They're very consistent here.  Prices are right.  Try the steak and cheese eggroll!"}
{"text":"Chinese food was fast and good. Impressed by the speed of delivery and the portion size. I ordered the chicken and broccoli platter with the beef lo mein. The food was exactly what I expected."}
{"text":"E-yuck. When you can turn me or my girl off from your Chinese food, that's really showing how low you are shooting."}
{"text":"Take out restaurant. Parking is not convenient. Not a good restaurant for eating in, the  ambience is poor. Menu is on the wall, and I felt like I was at Arby's. I was looking for a nice spot to sit and talk. This is not the spot."}
{"text":"Not a bad bang for your buck, but not the best take out I've had either. Its not a place I would brag about but compared to the other Chinese food locations in Stow, this was the best so far out of all of them.   I have an obsession with fried wontons, theirs look more appealing than most- just wish their orange dipping sauce had some flavor. It's very bland and usually cold when I get it. Their won ton soup isn't bad either, again just kind of lacking in taste a little. But you do get large portions and the prices cant be beat."}
{"text":"Food is great and priced well. The crab Rangoon is perfect and the pineapple is unique and has just the right amount of sweetness."}
{"text":"We had been faithful to dean house for several years but the food kept getting worse. So we finally tried king dragon. The food was great. And fast. You can adjust your spicy level on dishes with a pepper next to it on the menu. Make life easier and use the beyond menu app to order online"}
