{"text":"I'm in a foodie book club (that rocks) and our \"leader\" is a food writer for Metro. As such, I assume that, when we meet each month to talk about our book, we'll be meeting at places that are exceptional. King Street Social Kitchen may not warrant the adjective \"exceptional\", but it definitely warrants the moniker \"darn good\"!

Food: I had the Tom Yum Kung soup and the Dark Chocolate tart for dessert. The soup arrived in a giant cassoulet-like dish, complete with top, and was piping hot. The broth was good and not overly salty. The poor shrimp, however, had either been severely overcooked prior to their arrival or severely suffered from having to wait for all 12 of us to be served, because they were seriously tough. I would have liked it to have been a little chunkier (considering it was $8 for a bowl of soup) with fewer (what I think were) mushrooms, but it was decent. My friend ordered the halibut and said it was way overcooked and served with very dry rice. 

The dessert, however, was probably one of the best things I've ever put in my mouth! It was a divine dark chocolate tart with caramel inside and dusted with sea salt! Delish! The crust was perfect, the gooey part of the tart was caramel-y and chocolate-y, and the sea salt and cinnamon gave it a perfect yang to the yin of the sweet. It was, naturally, served with berries (which drives me bonkers -- a little creativity, please), but just push those aside and revel in the deliciousness of the tart. I would go back just for that tart. In fact, I'm drooling on myself just thinking about it. :-)

Decor: KSSK is sufficiently modern, as you would expect a new resto in a newly renovated Hyatt hotel. It's downstairs from the lobby, is large, open, and comfortable while maintaining its hip vibe. 

Service: the service was okay, but there were 13 of us, so hard to tell. I was so parched from lack of water refilling (another typical Toronto thing) that I almost choked to death. Then, as per usual in Toronto restos, it took *forever* for them to bring our bills. THIS I DO NOT UNDERSTAND!! (/rant)

Overall, KSSK was good and I'd probably go again with a smaller group. It was comfortable and I have high hopes that the mains might be better the second time around. Worth a shot, for sure."}
{"text":"Just wasted my time and money(on parking) for brunch(still being advertised as a buffet) only to be told they stopped the brunch buffet long ago.Thank you for telling me after I get there and not before. And so turned off by the rude front desk staff."}
{"text":"I went in February 2014 during the Winterlicious event. There were 8 of us. 

I was lucky to have had the opportunity to be invited by the Hyatt Regency on King St (formally the Holiday Inn) to organize a bloggers lunch and to sample BOTH the lunch and dinner Winterlicious menu. There was soo much food. 

The hotel is in a sweet spot, right in the middle of the entertainment district. Inside the restaurant, the decor was modern and simple. We were seated in a private room with skylights, providing lots of beautiful sunshine and brightness to the room.

Some of the highlights at lunch included a lobster poutine and a savoury lentil soup. The lobster meat really shined in the poutine since there was not a lot of gravy to overpower the dish.

The dinner items were my favourite. I loved the sable fish since the cod was moist and meaty.  My last recommendation would be the 6 hour braised lamb shank since it was \"fall off the bone\" goodness and the plating was simple, yet beautiful.  The dessert was good but did not really stand out for me, compared to their mains.

The portions were generous, the food was delicious, and at a price of $20 for lunch and $35 for dinner, that is an amazing deal for the quality of food.

Having met Chef Wesley and the kitchen staff, I can tell you the food is cooked with love and passion."}
{"text":"Food was good service was less then par. 
Really changes the mood ! It's unfortunate because the atmosphere and food was actually good."}
{"text":"Went here for Summerlicious. The food was a bit better than I thought but nothing that would make me want to return. The menu did have some clearly marked off vegan options (for those who prefer it). The \"homemade\" ice-cream sandwich was mostly just ordinary ice-cream with ordinary cookies frozen together. The steak was fine too and I liked the polenta. The calamari appetizer was surprisingly tender. Not bad but not great, not terrible either."}
{"text":"Stayed at the Hyatt on business so i wanted to try it out, the chicken was delicious. The halibut on the other hand wasn't great. The service left  me wanting better service."}
{"text":"I just ordered the most amazing dish during the Winterlicious event. Wow!! Poached Haddock and Wasabi Emulsion. It is poached in green tea, and served with Red Jasmine and toasted almonds and pan fried kale. I highly recommend that you make a point of getting here for Winterlicious and order this dish!"}
{"text":"Went here for summerlicious, and my inner foodie was really impressed with their menu options! Crab cakes, fried chicken and waffles, steak, berry pie?? How indulgent! :D. Since I did not want to feel like a total fattie, I got the quinoa salad to start, and it was light and tasty. I had the chicken and waffles as my main and it was certainly an elevated dish.... Breaded chicken breasts, plum gastrique... Not your average diner's chicken and waffles! But I found the waffles themselves to be disappointing. The beauty of chicken and waffles (to me at least) is the savory chicken gets a hit of sweetness from the waffles, but these waffles had zero sweetness, so it was not as good as it could have been. The berry pie with vanilla ice cream for dessert was delicious. Overall it was a great meal, and the waiters were very pleasant, but a little on the pricey side. Nice for a treat though, or if you can afford the price tag!"}
{"text":"Dropped by for breakfast during TIFF and had one of my favorite breakfasts - sunny side up eggs, sausage and roasted baby potatoes. Very satisfying but a bit on the pricey side but that's the Hyatt for you."}
{"text":"Terrible from start to finish. Went for the winterlicious menu. Saw the mixed reviews but decided to try it anyways. Ordered a bottle of wine to start, our apps took about 15 minutes which was fine. The entrees then took 40 min. To give you some perspective we were Sat at 715pm and weren't eating our entrees till 840pm. Food and service was so slow we had to pack our desserts to go. The server comped our wine as I complained about the wait time considering the tables around us seemed to be getting their food but who knows they may have been waiting too. 
Either way the food was barely warm and the most annoying part was that no one bothered to update us on the situation with our food. However the manager was talking to the table beside us so it's not that he wasn't present. I'm just not sure why he wasn't aware of the situation. Wouldn't go back ever."}
{"text":"Went here with a Groupon because it was around the corner from my office.  I understand that group \"deals\" are not super profitable for most businesses, but I thought the point was that they bring in a lot of new clientele who would otherwise not visit. So, I expected to be at least minimally impressed. Nope. 

I will say that the service was excellent and all the staff were very attentive and polite. The restaurant also is nicely decorated and clean, but it definitely has a corporate feel that you'd expect in a hotel. 

Unfortunately the food was mediocre at best. We both started with the beet, pineapple and feta salad. It was bland, a bit soggy, the cheese tasted like plastic. Not good. I had the streak and shrimp main which was pretty good, but not particularly special. My friend had the pasta, which was fine but again not special and easy to make at home. We both had the truffle cake for desert, which was not awful but was kind of cold and dry and tasted as if it were bought at the grocery store.  

All in all, not impressed. Even if you were staying at the Hyatt hotel, I wouldn't recommend eating here.. There are a thousand much better restaurants within a few blocks of here."}
{"text":"Went there for Summerlicious 2013. Terrible service. Waited 45 minutes between appetizers and entrees. We eventually have to skip dessert because we have a show to catch. The manager was very apologetic and invited us to come back after the show for the desserts. We decided against it. Will probably come back sometime but at this point there are better restaurants in King West."}
{"text":"We tried out the King Street Social Kitchen for brunch today.

They had a buffet which included juice, coffee/tea and the food.  it was $27 each including tip, which I thought was a little pricey.  Still it is near the TIFF Lightbox and the Entertainment district so that accounts for the hgher price tag.

I wish they did offer .5 options on Yelp, as I probably would have rated it as 2.5.  

There was fresh fruit, pastries, pancakes, toast, potatoes, scrambled eggs and the usual bacon and sausage, but it is not like they offered smoked salmon or anything like that, although you could order eggs anyway you liked it from your server.

Anyways, it was fine if you can't find anything else, but be prepared for the higher price tag."}
{"text":"The food was great and it seemed a little fresh and there was a lot of variety but it would've been nice to have more cuisines because of that area having a lot of cultures around
The pastry felt a little stale as if it wasn't fresh hut the live egg station made up for that as this was through a coupon and any expectation should be a good result or a bad result.
The staff was really nice and the dress code was smart casual"}
{"text":"Space is well decorated with hospitable staff. I was here for winterlicious 2018 and food was \"typical\" hotel food. Didn't like the main course, appetizer was ok, dessert was one of the best carrot cakes I've ever had! The restaurant would not be at top of my mind to recommend friends or family."}
{"text":"Visited on Valentine's Day and had a great meal here!

We ordered their Valentine's set menu and was pleasantly surprised by the quality of food. Service was good and not overbearing. Ambiance was good for a quiet sit-down dinner in an uncrowded place. They even let us take the rose on the table (which was great because 1800flowers did not deliver my order)."}
{"text":"Went there for summerlicious with a group of 6 as they were one of the few places with vegan options.  The decor is kind of fancy as it's inside the Hyatt Regional, but there were a lot of people dressed casually.  Their summerlicious deal was $25 for a 3 course dinner, and for the money i thought they gave very generous portions.  Service was very attentive and quick, and our waiter even answered all our questions when we tried to figure out exactly what parts of the \"house made ice-cream sandwich\" were house made (turns out they just put the pieces together in house).

I started with the grilled calamari salad, which had good flavour, but the salad part was a little plain.  The main course was a grilled flatiron steak with polenta and roasted asparagus, which i definitely enjoyed.  The steak was a touch chewy but for the price it was a large portion.  The polenta and asparagus was also good!  Dessert i had the chocolate truffle cake, which just tasted like any other chocolate cake you would buy in a store (again a generous portion).  My friends ordered the ice cream sandwich and seemed disappointed."}
{"text":"Server overcharged my bill along with other coworkers bill by $10. He was also very stern and emotionless. Tip was already included in bill and was never mentioned. 

Summerlicious was less than mediocre. I ordered the angus and honestly... It was definitely not worth $38. Appetizer was corn soup which tasted like cheesy canned corn soup , not bad ! But nothing special. Not to mention the soup had the dry layer of skin on top of it.. YUM! 

Dessert was probably the best part. I had the apple crumble which was cold and would be great with ice cream. Everything was just so mediocre.. I can't believe it costed me 48$ and I some how generously tipped another $10 on top of that!"}
{"text":"We had a fantastic dinner - had the groupon and the food was fabulous and the staff was attentive and courteous- highly recommend"}
{"text":"I was invited to The King Street Social Kitchen at the Hyatt Regency (@HyattOnKing) for their Winterlicious and Valentine menu preview and what an amazing time with the good food and even better company.

This is my first time dinning here and I was excited to see what they have to offer. Love the private room we got with all the full side dishes on the side for us to take pictures which is great since we can dig in right away when dinner is served (we got sample sizes to taste but the pictures below are all actual portion size).

Executive Chef Wesley Boodhram inspired by Asian streetfood, created an Asian themed Winterlicious menu.
. 
Tofu and Vegetable Steamed Wonton Soup
~ served w/ a Lemongrass and Tamarind gremolata and Soy miso
Definitely had a twist with the lemongrass and tamarind flavor in the broth which is rather refreshing and great way to start the meal.
. 
Red Oak and Aged Ontario's Goat Cheese
~ with Roasted Pecans, Grape Tomatoes, Soft Herbs, Sweet Mirin Vinaigrette

Grilled Chicken Satay
~ w/ a Fresh Pineapple and Apple Slaw, a Bambu Kacang Sauce
~ This felt like a summer dish with the light and refreshing slaw and the grilled skewers which was a nice change from the usually heavier winter dishes.
~ The chicken was very tender, only wish the sauce had a little bit more flavor and texture to it.

Homemade Tofu & Black Bean
~ Stir Fried Tofu and black bean w/ ginger, Crisp Veg, Snow Peas, Shitake, Udon Noodles
~ If the menu didn't say black bean, I wouldn't have known, it was kind of sweet instead.
.   .

King Street Beef Lo Mein
~ Yakisoba Noodles, Local Tenderloin Beef, Snow Peas, Lotus Root, Soft Herbs, Fungi, Mango, Jicima Relish
 

Grilled Beef Tenderloin & Buttered Poached Jumbo Pawn
~ w/ cauliflower mash, heirloom carrots, horseradish reduction
~ This was served medium well which was a bit too cooked for me since it felt dry and tough, so make sure to mention to your server for rare or medium rare when ordering this.
~ I especially enjoyed the cauliflower mash here which was sweet, soft and not too smooth.
.  

Passion Fruit Crème Brulee

Above dishes are what they decided to serve us from their Winterlicious & Valentine Menu and the ones to follow, we didn't get to get a taste:
 
Poached Haddock and Wasabi Emulsion
~ served w/ red jasmine, toasted almonds & pan fried kale
. 
Brick Oven Baked Sweet Corn & Local Soft Goat's Cheese Soup
~ w/ toasted panettone croutons
. 
Pan Roasted Ricotta and Baby Spinach stuffed Chicken Breast
~ w/ root vegetable gratin, pot jus, acorn squash

Portabella Mushroom En Croute
~ served w/ fragrant Champagne sauce and grilled heirloom tomatoes
. 
Pan Seared King Crab Cakes
~ w/ red pepper remoulade, micro cress salad aged 10 year old Balsamic

40 Day Aged Rib Eye Steak & Teriyaki Prawns
~ Fire Charred Five Spice marinated beef, ginger scented glass noodles and lotus chips tempura

 Warm Bread Pudding
 ~ w/ a Lychee Creme

Lemon & Raspberry Tart

Frozen Grapes
~ w/ Grand Marnier Crème Fraiche

Dinner was served with Trius Winery (@TriusWines)

Verdict:
~ The dishes was nothing spectacular or out of the ordinary but there's flavors and twist here and there that kept surprising me.
~ With the convenient location, I would definitely recommend dropping for some of their Asian Fusion.
~ Thanks Mary (@themary_tang) for the invite, it was such amazing company.

For their Winterlicious Lunch $23 and Dinner $35 Menu"}
{"text":"Had a super breakfast while staying at the Hyatt Regency Toronto.  I was debating between the crab cake Benedict and the eggs Benedict ... She suggested she could bring one of each.  It was perfect!  Very good service early on a Saturday morning.  I will definitely have breakfast here again!"}
{"text":"I was staying at the Hyatt for a business trip and chose to eat at King Street Social Kitchen because it was located in the building. The service was slow but friendly and the food was tasty."}
{"text":"Came here for a girls night, entered the restaurant at King and John and felt lost, as if we had walked into the back of house. After wandering around a bit and no one offering to help direct us, we asked the bartender who rather abruptly pointed us towards the hostess desk which was in an odd slightly hidden location.

The service was.... okay... but also a bit odd. Our waiter made a few strange comments when my pregnant friend ordered a virgin Mai Thai and when I asked for the remainder (more than half) of my entrée to be wrapped up, we felt a bit patronized... And couldn't tell if he was joking or not.
Food was okay. There was arugula on everything (not specified on the menu) which is fine if you like it..... But a tomato and calamari starter shouldn't have more arugula than tomatoes, should it? Our gnocchi was also covered in it, and overall it was dry and the total opposite of their menu's description of \"creamy\". Dessert was okay, my sorbet was yummy but way too sweet. The ice cream sandwiches were almost completely melted by the time they got to us.... And the cookies were stale and hard!
It was fine as a place for us to sit and chat, but I won't be coming back for the food."}
