{"text":"I just love this little place.  Food is great and the drinks are cold.  The servers are AWESOME!  Great sense of humor and very attentive to the patrons.  I highly recommend this place and plan to make it my local when in Markham."}
{"text":"This is my go to place for good wings and beer. The service is amazing here with very friendly staff. I love going for their Monday wing nights, especially when their wings are large and very crispy. Their fresh cut fries are also very tasty. The menu here is perfect, some might say their selection is small but it is great considering the restaurant is not big. If you are looking for something different other than wings and burgers, you can also try their shepherds pie or chicken pot pie. I am a big fan of their chicken pot pie which is served with mashed potato and veggies."}
{"text":"This is one of the best pubs I have ever been to. Many of the dishes are made in house, and the service is excellent. The staff is friendly and willing to recommend something to eat. I highly recommend the Fish and Chips for an excellent pub meal."}
{"text":"It's one of those cozy bars where there's a fair share of regular customers and everyone knows everyone. It's a lot smaller than I thought it would be the first time I went, but it's never too busy or crowded. 

The shepherds pie is a must there. It's soo yummy and the portions are huge there. I've done dine in and take out and the food is consistent. I loved how I ordered take out from there one time, my first time doing take out from this place (Shepherd's Pie, skip the beans, extra side of gravy) and the next time I called in for take out, I had my boyfriend pick it up for me but the bartender/waiter knows it was my order. He actually told my boyfriend to tell me that he says hi. His name was Deep (pronounced that way but not sure the spelling). 

Very impressed with this place; will definitely return."}
{"text":"This is a small little pub that is clean, welcoming and have what you look for in a basic pub. I think it is very comfy to have a drink and a chat here with your friend.

We came here on a Wednesday 7pm night - parking was easy.

The environment is not too loud and it has enough TVs to play sports that you wouldn't miss anywhere you sit. The server was very friendly and welcoming. I think her name was Winny/Winnie and she would come back and ask you how the drinks/food are. Very easy going.

We had sheppard's pie and I think it is up to par.

I would come back whenever I am near that area."}
{"text":"Way to expensive for what you get. 
This is a $15 per person pub (plus $2.95 for a watered down coke) in an area wth tons other eating options.
\"But surely at that price point they must have good food?\" You exclaim. 
First of all, don't start your sentences with a conjunction. As for the food it is total hit or miss. Shepard's pie looks and more importantly smelled amazing, though the bland microwaved frozen veggies on the side were pretty dull. 
However, the two beef sandwiches we ordered were gross. Clearly boil in a bag beef. It was tough, flavourless, cut way to thick to be called \"shaved\", and slimy (I guess it's own \"juices\" from the boiling process). The Au jus was essentially brown water with no flavour. 
The Philly cheesesteak had virtually no meat on it, which I would say ironically was a good thing since it was more of that boil in a bag meat. A smattering of peppers and onions and the cheese only covered half the bun. 
$15 plus tax, tips and drinks???? What a joke. You can do so much better."}
{"text":"Nice pub with very friendly bar and wait staff. Good draft choices and traditional pub food done right."}
{"text":"This is a decent enough pub in a plaza near Highway 7 and Warden. There's nothing exciting about the decor, the beer selection or the menu, but it's a real pub in Markham outside of the two Main Streets, so it gets bonus points for filling a local need. I had the philly cheese steak, which was greasy and went down easy. 

The service was pretty friendly."}
{"text":"Good place for a beer in Markham during a snowstorm. Service was good and beer was fine."}
{"text":"From outside the place looks deceivingly big! It is quite a small cute English Pub.

Went on a workday to grab lunch and it seemed to have some regulars day drinking. Or maybe blue collared guys taking a break. The man behind the bar greeted us and we went to the higher level which seemed like the dining area. The waitress approached us and she looked a bit sketchy or hungover (maybe both). She also smelt like she put out a cigarette  and still had it in her pocket. Usually- that is a sign to go. However lunch time at work, we were strapped for time. We proceeded to order.


Ordered the philly cheese steak sandwich which was accompanied by some delicious home style fries (big pieces) which tasted fresh. I was very pleased. However the highlight of this trip was the WINGS. Nice juicy big sized wings fried perfectly. They had a special hot sauce called the Zinger or something. It was amazing. Probably some of the best wings I have had in Markham. I even got over my impression of the waitress- who turned out to be pretty cool even tho she forgot to bring me my vinegar (which she suggested for the fries). 

I am definitely going to be back for the wings. Keep in mind this is a $$ type of establishment and don't be surprised spending $20 for a meal.

I want those wings again !! so good."}
{"text":"Not a bad place to grab a beer (or in my case, a caesar). Not too many bar options in this area! 
Half price appetizers on certain late afternoons (I happen to be there on a Wed at 4:30 and I took advantage of it). Calamari was decent. 
There's a patio to enjoy and service was good."}
{"text":"I've been here two times for their half priced wings on Monday nights. The second time I came here, I couldn't remember why it took me so long to return. Then the wings came and i remembered - they weren't that great. The portion was reasonable, but i felt like the wings lacked flavour and didn't have enough sauce. Even the dipping sauce for the carrot/celery side had a weird texture - like watery elmer's glue. The half price wings is actually not a very good deal either because you're forced to buy a drink. I can't speak for the other dishes, but I know i won't be returning again for their wings."}
{"text":"Food is great, they have specials throughout the week.  Cold beer, great selection.  This is not a big chain place, its a little local joint.  I enjoy stopping in there every time I am in town.  The staff is very welcoming and always a fun time."}
{"text":"In a fairly modern day plaza with the likes of Milestones and Cora's, King Edwards Arms is a bit of an anomaly.  Upon entering its clear how old the place is.  Old can be good, it can be charming and in the case of a pub, can mimic UK pubs.  Problem is this place needs a good deep clean and some maintenance.

As a pub should, they have a wide selection of draft beers, but again they need to keep better watch on the kegs because the beers tend to be flat.

Food is basic pub fare, but not much love put into them.  My shepherd's pie included some overdone vegetables, under seasoned beef and a side of canned beans.  Not all bad, but nothing to come back for."}
{"text":"With St. Paddy's here, I thought it fitting to visit a authentic style pub, I sure did well in finding King Edwards Arms. 

Located in a corner strip mall, the place, as mentioned in other reviews, is deceiving from the outside. It's an intimate space with a small bar, and limited but cozy seating. A couple of TV's, a lot of beer options, and a pretty decent menu, it's worth a visit. There are deals throughout the week but the most popular must be the half-price wings on Monday's. 

Having ordered a pint, I opted for the 1lb wings and basket of fries. The wings were great and the hot was pretty mild for my taste. The fries were the fresh cut wedge type and not bad. I would definitely recommend the wings. 

The service while only handled by one person, was amazing and she was on the ball. Friendly, quick, and accommodating.

While the space can be crowded, it's friendly and pretty reminiscent of a traditional english pub. One suggestion....all good pubs offer at least one curry dish! 

See you again soon, cheers!"}
{"text":"This is the second time I walked in and left. This time they told me they close at 11pm when I walked in at 10pm. Sad to hear a bar closes that early. Besides that we didn't like the way the female bartender ways of speak to customer. Little rude when she told us they will close at 11pm. We felt like you guys should go. Then when we said we were leaving for next time she still said s rude. I think they need a better bartender and server. No wonder they aren't any people in that bar every time we walked in."}
{"text":"Sweet little pub across the street from the Hilton on Highway 7.  I saw this place one morning while grabbing a coffee across the parking lot at McDonalds.  At first, I didn't know if it was just opening up or just going out of business.  It sort of looked like it was being swallowed up by The Second Cup place next door.  It turns out they've been in business for several years.  The bar staff seemed very friendly.  I didn't try any of the food they prepare but I must say the stuff coming from the kitchen looked pretty tasty!  What I did sample was the good selection of English beers they have on tap.  Yeah.... they have the major US and Canadian lagers as well but that's not exactly my bag of tea.  Three flat screens (all playing soccer of course) to enjoy while putting back a cold one.  Solid place!"}
{"text":"Pretty good food for such a small pub.  nothing bad to say really the service was good, the food was good.  good experience."}
{"text":"Yum! Was up in Canada for my husband's job and we found this place thanks to the hotel recommendation, but now I see that the Yelp reviews are good too! 

Found the staff to be polite and on point.  The wraps and sandwiches we had were fresh, tasty and came with a side salad.  Our plates were left clean.  We also ordered the medium wings appetizer.  It came with 7 large wings covered in a crispy and yummy sauce.  

It was a great meal.  One star deducted because it was a heat wave and the air conditioning was broken.  The Windows were open and the fan was on, making the dining room somewhat comfortable."}
{"text":"Environment:
King Edward's Arms is a UK style pub located in a rather Asian neighbourhood. Located around the Hwy7/Warden, it is kinda hard to locate this place if you didn't check GPS beforehand. There are plenty of free parking at the plaza, especially directly in front of the pub.
The pub in itself is rather small, but it has a lot of character that resembles British pubs. There are lots of TVs on the wall, which is great for people wanting to grab a drink while watching the games. But since the space is limited, it is ideal to go in a smaller group of 4 of less, though I did see families coming here for dinner as well. 

Food:
I ordered a king size wings with honey garlic sauce and fries on the side, and it was better than many places I've tried. First of all, the portion was huge, which I had to pack some home. The flavour was pretty good as well. Usually I don't like too much sauce because it becomes too overpowering, and this place has the right amount of sauce drizzled on the wings. There were a lot of sauce at the bottom of the basket if you like a fuller flavour. The wings were fried to perfect crispiness. Be careful when you take a bite as they make it fresh and it's still very hot when they serve it to you.   

Service:
Service was meh and food was kind of slow. From what I see, there was only one waitress serving all the tables and the bar. Don't expect the waitress to come check up on how you're doing, as it was already difficult to track her down because she has to serve everyone there. There was probably only one chef at the back as well, considering it took around 20mins for our wings to come."}
{"text":"Nice and friendly little pub. Good sandwich choices. Great wings. Their nachos are our favourite."}
{"text":"This pub was a pleasant surprise. Was cravin some wings so decided to stop by St. Louis but it was super packed since it was half priced wings night on Tuesday. There was even a line up so I gave up hope. Yelp to the rescue! An average 4 star review for King Edward's Arms. Must be a decent place.

At first glance the place looks small and uninviting but the uninviting part changed right when we were greeted by our waitress. She was very friendly and upbeat. She was all smiles and checked up on us often. Fantasic service.

The menu is small and I really think this is a good thing. There were a lot of items that I wanted to try but I was hungry for meat. Started off with some wings.

1lb wings $13 - we got honey garlic. The wings were large and the skin was extra crispy like they had fried the wing twice or something. Inside was still juicy. Just the perfect wings.

Ribs $25 - comes with fries. The fries were cut large and the portions were also very generous. I don't know how they did it but the fries were so nice and crispy for thick cut fries. The ribs were tender and tasted good but not to the quality which you can find at ribfest. Still it fullfilled my meaty appetite. 

Chicken pot pie $14 - comes with mash potato and veggies. The crust was so buttery and flaky and tasted great. Huge chucks of chicken inside but sadly the chicken was dry. 

Next time I am cravin wings then I will definately come back here."}
{"text":"Came here to check out their fish and chips as I was in the mood for some english style night out. Their halibut fillet and chips was extraordinary delicious as i haven't tasted this type of british food since i came back from the United Kingdom. 
Great atmosphere for a night out with friends, but make sure to get reservations as the place is not that big."}
{"text":"This place has the absolute best wings! Decent sized wings that are dressed perfectly but still have a crisp bite of freshly deep fried goodness. Half price wing night is Monday - although they do half priced apps 4-6 Monday to Thursday's all week long (wings are included). My favourite is honey sizzler- just the right touch of sweet and spicy. 

Service is quick and attentive. Small and cozy restaurant with lots of regulars at the bar and enough tvs for you to catch any game. 

You probably won't find fresher Guinness anywhere else!"}
{"text":"Not bad.  It's a pub.  
I was there on a day where they had a deal for half price apps.  They were all very good.   The staff was friendly.

I'd go back.  It was pretty busy too, which I liked."}
{"text":"I come here often after work with my coworkers to enjoy their weekday Happy Hour special. Monday - Thursday, 4-6pm half priced appetizers! We always go for the wings here - regular price for a pound of wings is $13, half off so its $6.50 for a pound! And their wings are big, not tiny ones at other wing places. Deeply fried so the skin is nice and crispy, and the chicken meat is juicy and tender. Not a lot of flavors to choose from but I'm not going to complain at that price. 
All their apps are decent, the onion rings are good - regular price is $7, so $3.50 for a full basket of them!
 
They don't have prices on the menu for their beers, but it's cheap I'll tell you that! Last time I went, 3 pint beers and 2 pounds of wings costed us only $26 after tax. Where are you going to find that kind of deal? Definitely the best place for happy hour beer & wings!

They now have Somersby on tap for the summer. I love Somersby, my favorite cider. They serve it with ice to get the perfect crisp it says."}
{"text":"I went to this place because it was right across the street from my hotel and the reviews albeit sparse were good. I have to say solid 4 stars. The place was pretty empty so the nice barkeep and I got to chat and she suggested some things. I had a big greek salad and some great wings. It wasn't cheap, but I guess when I do the translation from Canadian dollars to US it will not be that bad. The wings were good, the medium head was plenty spicy enough for me.

If your in the area, at the Hilton across the street or at the conference center it is an awkward walk across the street but worth it. The restaurant in the hotel is a lot more expensive and it is always boring to eat at the hotel anyways."}
{"text":"3,5 Star

King Edward's Arms is surprisingly small but cozy. 

Came by during a NHL Leaf Playoff games and the place was not too busy but still have this friendly neighbourhood vibe. One of those everyone knows everyone.

Beer Selection though not too exciting but has a few English beers on draft.

The King Cheese Fries ($6.95) was surprisingly good for a pub. Fresh out fries not those cold and frozen ones that I have experienced as other pubs I have been to. (+0.5 star)

Wish there are more intimate neighbourhood pubs similar to King Edward's Arms. 

Happy Hour Special (1/2 price Appetizer Mon-Thu 4pm-6pm) anyone??"}
{"text":"Enjoyed this \"British\" pub while visiting Toronto for work. Very good selection of British beers on draft with some Canadian and US brands as well.

I had the fish and chips. The fish was pretty good. I thought the chips could use some more flavor, but I guess that's what makes them British. 

The staff was friendly.

Overall, I would eat there again next time I'm in the area."}
{"text":"Cozy joint with quality beer and good food. I always go for the ribs with Keith's Red or a Guinness. It's not exactly a night pub, so don't expect there to be food or much service past 10 PM. The owner and staff are always friendly. 

Overall they have a great quality and selection for a small tucked away bar in Markham. Will definitely be going again!"}
