{"text":"Went out for All You Can Eat sushi - great selection on the All You Can Eat Menu and everything we ordered was nothing short of amazingly delicious!! The service was also great - servers were eager to share their favourites and recommendations of items on the menu. We will definitely be back! :)"}
{"text":"I ordered from here for delivery the other day.  My friend and I each paid quite a bit for a sushi roll and sashimi combo. The rolls were satisfactory, but nothing special.  The sashimi was the worst I have ever tasted, to the point where I couldn't even finish it.  This is very unusual for me, as I love sashimi, and was looking forward to this part of the meal. I would not advise this restaurant if you like even mediocre sashimi."}
{"text":"We absolutely will not be back  Awful, awful experience and not great food.  Sure,  they have decent prices but if the food,  service and experience are awful,  what's the point?   Went in just before 4 for a quick family meal.  Ordered two bento boxes a Shanghai noodle and a couple of orders of sushi.    The shrimp on the Shanghai was absolutely disgusting which turned our daughter off her entire meal and of course a hungry toddler who doesn't like their food isn't going to be happy.  We had just settled her down when the waitress comes and tries to hand her a bag of chips (she's 1). When I say no thanks she still gives the chips...  Not impressed at all.   My fish was also terrible and the salad was all core.  My two sips of miso were salty and not very miso tasting.    When I had enough I got my husband to have everything packed.  Not only did coming to check on him take forever but she missed getting half of my food! When I went to ask for my soup she was rather annoyed.  We got home and I went to finish my meal and found the hot food to be missing.    Thanks for making a bad family meal far far worse!"}
{"text":"My husband and I love Sushi and whilst visiting family decided to try out a local Sushi restaurant. From the lovely pictures of all the choices, the food we received looked like the photos and did not disappoint in flavour. We have never seen such an extensive menu with rolls we had never encountered before.The granite tables were beautiful! A visit to the bathroom proved that they had continued with the lovely granite and tile work in there as well. I have never been in such a clean bathroom in a Japanese restaurant and was very impressed! Overall our experience was lovely and we will return next time we come to Airdrie from Prince George!"}
{"text":"My Wife and I thought we would try this place which opened several months ago. We love sushi and while have our favorite locations to revisit we thought tonight we would give this new place a shot. OMG, the waitress's lingered around us throughout the whole meal, nearly after each bite asked us how the meal was. The topper was when my wife asked if the soup base for her soup was veggie based or chicken, to which they proclaimed on more than one query... vegetable yet as you can clearly see from the photo alone it looks like chicken and tastes like chicken... therefore it is chicken... the key is that my wife and I are vegetarian so we ask these questions and expect the wait staff to answer truthfully. Not only did it taste like chicken, it tasted like weak chicken water and was not worth an attempt to eat. The sushi rolls had good flavor but the sushi chef clearly does not know how to make a roll, loose rolls and a strange spicy mayo resembling miracle whip was less desirable. The wasabi was a chunk on a small plate with dried yellow ginger. The Veggie udon soup i attempted to eat began to taste like dishwater after a few mouthfuls The wait staff took over the table behind us and continued to giggle at something on an ipad.  We declined dessert but the waitress brought out an old dried orange cut into 4 segments with two toothpicks, compliments of the house.  Facts which will result in us not going back -Lying about the soup base -Improper conduct of wait staff, lingering like a bad fart -Improper conduct of wait staff, reach across our plates to grab water glasses to refill and topping up our tea cups -Menu was unprofessional, could not tell what the items looked like, seeing that sushi is an art the photos left us questioning what the end result would be."}
{"text":"I don't usually write a review but I have to let people know how bad of an experience I had with this restaurant. It was the worse experience of my life. We had all you can eat. It was such a waste of money. The food wasn't great at all and staff was horrible. They didn't smile or asked how the food is. Seems like they were trying to get rid of us. They even said we had to eat the garnish or we would get charged for it. We only ordered one time because I was just appalled with the staff attitude towards us. To make it worse I left cash on the table but they thought I was running away without paying. It was very embarrassing. I will never ever go here again. I would rather drive 30 mins to Calgary to eat good food and be treated like a person."}
{"text":"Great all you can eat sushi. Enjoyed it with my wife and a friend. Sashimi and sushi was very fresh and tasty. Ginger beef was spicy and chewable, some other places it is hard and chewy. The Lobster Roll and the Mango Paradise Roll were really good. The Banana Tempura was to die for."}
{"text":"The other day I stopped in at D's work to give him a card he needed to get gas, only instead of leaving to go home I ended up chatting with two of his coworkers about various restaurants to try in the area.  One of the ones that came up was this place.  D and I agreed it was definitely a sushi night, and since he trusted her opinion on food we thought we'd give it a try.  It was a quiet night there, which was good for us, only a couple of tables were filled, and honestly the first thing I noticed was the crazy colours of the labradorite flecks in the table surface.  The tabletops are beautiful!  At the right angle there were crazy hits of blue, green and gold that were unmistakably labradorite.  Beautiful.  Anyway we shared a pot of tea, which was delicious and very hot.  D had a miso soup and 2 pcs of Unagi to start.  I tried a sip of the soup and it was very fresh, nice flavour, not overly salty like some miso soups, and looked like it had just the right amount of tofu.  I didn't try the unagi, it's good but doesn't always sit well with me afterwards (I've been afraid to have it since an incident in Vancouver - long story involving a long drive).  My starter was a plate of beef tataki.  I haven't had that in a long time, since it's normally quite expensive, but the portion size more than made up for it here and it was delicious.  The beef had had just a touch of heat around the outside so it was deliciously rare throughout, the spicy sauce was amazing, and I had to restrain myself from licking the plate.  We shared a Crispy California Roll that was almost as good as our favourite place in Vancouver so I'll be ordering those every time for sure - it's all in the unagi sauce they drizzle on top.  It seriously makes all the difference in the flavour!  It was so good I ordered a second one at the end.  The other dish we shared was a Delicate Roll which is a really nice variation on a Philadelphia Roll but with a few additions.  It was fresh, the salmon was delicious, and the avocado was just right.  I'm not sure about the mayo drizzle on top but I didn't mind it.  Next time I plan on trying the tempura, and honestly I think the only thing they're missing is a Las Vegas Roll...I'd eat there every week if they had that too!  Our server was great, very chatty and totally familiar with the sushi we're used to since she was from the same area.  All in all it was a pleasant experience in a clean, friendly setting and we left stuffed.  I can't wait to go back for more."}
{"text":"Amazing fast service. Food is excellent. Love their sushi, tempura prawns and the ginger beef!!! A must try if you haven't gone."}
{"text":"Terrible service. We have been there a few times and it normally was \"ok\" but tonight the service was non existent and slow. We only received the fried portion of our order and kept waiting for sushi. When we asked if we could just pay for what we had eaten, we were told by our server that we should say when we need to leave so she could focus on just our table (and ignore the others I am assuming); Oddly enough that notion never occurred to us. We ended up leaving, while not receiving one piece of sushi. We ended up paying for what we ate but we will never be back. Horrible experience at this place."}
{"text":"Went with a few friends that were in town, as we have been before and had a decent experience. I ordered the veggie roll, after reading the menu to find it did not list yam/sweet potato in the ingredients. I am severely allergic. After eating two rolls, I was concerned so we asked the server if the roll had yam in the centre and she said yes. I said I was very allergic and they need to list their ingredients in the menu. She argued that the menu did include yam in the description. She went and grabbed a menu to confirm, and when she saw it in fact did not list yam, she showed me the picture, saying it's right there in the photo. Because apparently I am supposed to discern all ingredients from a picture. I ordered another dish - a yakisoba noodle which was terrible and just ichiban noodles. At the end of the meal, she asked if we wanted the veggie roll packed up, which obviously I didn't. And on top of all that,  she still charged us for the veggie rolls. Another member of our party also had an allergic reaction as they put all the rolls on one dish, so there was cross contamination. Needless to say we won't be returning."}
{"text":"Came back while I was in the area visiting family. Honestly, it got better. The variety of food makes me feel like I have endless choices and it's the food is top notch. I wish I lived closer because I could come all the time. Definitely recommend!"}
