{"text":"They have one of the best Koobideh Kebab in the town. The price is reasonable and they are very friendly."}
{"text":"amazing food, kind staff but a little on the pricey end if you want simple take out."}
{"text":"An Iranian friend recommended this place to me.  OMG!  This place seems to have the best Persian food in Toronto!  I ordered the chicken kabobs, and they were the juiciest, tastiest chicken kabobs I have ever had.  It had just the right amount of lemon and smoky grill flavour and it is served with rice and a grilled tomato (love those grilled tomatoes!).  The only down side is that the place is small, and I don't think they have air conditioning."}
{"text":"Been here plenty of times. The koobideh with rice is the dish to try. Sometimes the music is good and other times its funny bad. Anyways get the salad with Italian dressing mmm yummy. Drinks are pretty standard; it wouldn't hurt to have a larger variety.  The place is well decorated and the service is friendly. Again try #5 koobideh with rice; the koobideh is soft comes with a grilled tomato with onions and rice. Try putting the butter with the rice as the rice does not have much flavor to it. Also try putting the red packaged stuff on top of the meat to make it more delicious. Mmm my mouth is watering as I write this review."}
{"text":"To start with, I don't consider myself to be an expert on Iranian food at all. I was in the area and needed a quick lunch, and the unassuming exterior made me curious about whether there would be some real authentic stuff in there. The interior is clean and neatly ordered, with the menu items above the counter on large boards. I chose the Khobideh, which is a beef kebab. It took about 10 minutes to make, and I eagerly bit into the well cooked and juicy looking kebab in my takeout box on top of a good quantity of rice. I was expecting a little more spice so I was dissapointed. Like I say I am not an expert but this was pretty bland. Nothing extra in the box besides the tomatoes. Maybe this how it's supposed to be, but I was craving a little bit more of a taste experience. Everything was fresh and edible, but not stimulating in any way."}
{"text":"I used to come to this place a lot but i tried here last two times and unfortunately the quality of their went down. I ordered their kebob and it wasnt cooked properly and it didn't taste fresh at all."}
{"text":"Best kabobs in the gta! I always get beef kabob combos.. Huge portions come with a lot of rice and a grilled tomatoe. If you want half rice half salad it's $1 more. Still worth it!"}
{"text":"Was looking forward to a meal here, ordered the chicken breast sandwich/wrap and it was a TOTOAL disappointment. It was beyond bland. I tried adding a sumac they gave us but there was no hiding the truth. The lettuce was soggy, the wrap was oily and leaked through the foil wrap, and even thought they said they had a ranch sauce I'm pretty positive there was no trace of the sauce on my wrap. The chicken was also very bland, no seasoning, not even salt. Only $8.99, but not worth it."}
{"text":"There really is nothing worse than being short on time and having to make an impromptu lunch decision on the go that you haven't really had the chance to think about. I'll admit, much like rolling the dice, every once and awhile you hit the jackpot and land a great meal. The jury is still out on my recent visit to Kish.  Had it not been right next door to my hair stylists place I likely never would have entered. From outside it looks slightly run down and not exactly inviting. However, my superior sense of smell picked up a sent as I was walking by that made my literally walk backwards in my foot steps to check out WTF was that???  Inside was not much better than outside, it was empty, had bad Persian music videos playing far too loudly. I have many Persian buddies and even they remarked that having the music up that loud would annoy even them...and its their culture.   But still that smell.....WHAT THE HELL WAS IT!!!???!?!?!  After speaking to the shop keep I learned that the mean of the day making me drool was traditional Iranian Kubideh. For those not DOWN with the Persian (middle Eastern) food scene...lemme holla atcha. Have you had Lebanese food (kafta)? No? Ok well then you're really lost, essentially (for all my white folks in the audience), Kubideh or Kafta is hamburger meat done with onions and spices and pressed around a wide wooden skewer and barbequed like a shish kebab/hamburger hybrid.  I ordered this dish right away and it took about 8-10 minutes to come out. I hungrily grabbed my box and paid, running to my car around back where I could eat (away from the music that was driving me loco).  The kubideh lay atop a pita and under another with a pile of parsley tossed sliced onions and a BBQ'd whole tomato. No toppings, No hummus....nothing. Not having any extra time I began wrapping the meat in pita and loading it with the dry onion mix. The meat was cooked beautifully, very juicy, so much juice that my box was filed and it spilled out in my lap at one point.  If it hadnt been for the meat juice the meal would have been very very dry (it still was) and at one point out of desperation I picked up the BBQ'd tomato and bit into it like an apple - just so I could get liquid in my throat and so I could stop hiccuping.  Smell and meat alone get this meal a 2.5 star, venue needs a serious over hall and some sides or toppings (at least offer next time guys) would have put it over the top  I'm in a good mood right now so I'm going to round up.......Kris will be back Kish... Kris will be back Kish"}
{"text":"We ordered stews. The lady forgot to serve us. When we finally got our stews, it was testing so suspicious that we were not able to have a conversation, just thinking something was strange. Eventually, in the afternoon, we got an upset stomach. Food poisoning....  I do not recommend this place, there are better Persian restaurant around."}
{"text":"Having tried Persian food at various places, I find that the quality of most places are similar. Kish distinguishes itself by having a few menu selections that are not available at other places. Other than that, I think their portion sizes are good. As an example, Super Tehran's kebobs are slightly smaller but also a little cheaper. Kish is about $1 higher but the meat portion is better so it's worth it.   I've had Vaziri, Kebob Torsh (not available in most Persian places), Kebob Maksoos (also not available in most places) and lamb shank.   -The Vaziri (koobideh + chicken leg) is good. They grilled it really well.  -Torsh is an experience by itself. They've really tenderized the meat and the pomegranate marinate they use is very delicious.  -Maksoos is basically koobideh but they stick a few pieces of chicken on it. Not bad but not significantly different from a regular koobideh -Lamb shank was a little disappointing. We got a piece with a big bone. Taste wise it was ok.   Like I said, I find most persian places are very similar to me. The seasoning they use seems to be standard so it's all about grilling it right and not skimming on portion. Kish stands out for me because they have tables, reasonable prices, and a few dishes you can't find elsewhere. I'd come again if I want another Kebob Torsh or Maksoos."}
{"text":"Probably one of the best Persian places you will find. Great prices, great portion sizes and great food.   The restaurant is quite central and easily accessible from Yonge street. Parking is usually available (spots in the front and back).  Inside is a bit small so sometimes the place can become crowded but the food is definitely worth it. The waiting time for food is usually short.   There are many different choices of traditional Persian dishes available. I have tried the Kabob Koobideh (ground beef kabob), Chicken Kabob (Breast), two of their soups, and egg plant dish. All of them have been great.   Only complaint I would really have would be the bathrooms. They're in the basement and they are quite outdated and can use some updating. Other than that, I would definitely recommend!"}
{"text":"This 2 star review isn't because the food was bad - it was freshly prepared, but on the flavour scale was just lacking - it was more because the service lacked the common courtesies one has grown accustomed to.   The food was cooked well it felt like it needed something more which is a shame.   All in all I don't regret the visit but won't be back."}
{"text":"This place has made me a lover of Persian food. It's cheap and the portions are huge and delicioa"}
{"text":"Another bad decision in choosing take out place without checking Yelp. I drove to a few places between Yonge Street and Steeles and Hwy 7 and they're all packed! Took a turn to this Kish restaurant saying, what can go wrong if I try a quiet place?  Walked in and noticed a bad smell and run down arrangement of tables and chairs. Empty freezer, fridge for drinks at the front. My mother patiently waiting in the car wanted a taste of Persian. Ordered lamb, koobideh, chicken total $37. All does not include bread or salad but they give you butter lol. Anyway, I find the lamb is plain and missing the strong flavour and spices. The dill basmati is good. The chicken and koobideh tasted like they've been regrilled but not dry. The grilled tomatoes tasted like they have been sitting around for awhile.  Overall, I will not go back. There are so many places in this neighbourhood that are worth going back even when they are packed. Just have to be patient to have a great meal and not rushed."}
