{"text":"Food was great. Service was wonderful.  Since it was our 1st time there they gave us a sample taco."}
{"text":"I'm gonna sound crazy here but I enjoyed chronic Taco more than this.  I feel like the food was better and the service was much better."}
{"text":"The tacos were amazing, wonderful service, and not expensive at all! This is the perfect mom and pop place to hit up in downtown Phoenix!"}
{"text":"Love them Tacos!! This place definitely has the best tacos near Downtown Phoenix. The Tacos are delicioso, and the Salsa bar is on point!! We will be coming back again, and again for sure."}
{"text":"I came here for lunch after seeing the other reviews.  I had the chicken taco and vampiros.  I really liked them both and the fresh salsa bar.  I wish they had chips, but I left full and will be back."}
{"text":"I live in California but I make sure to stop at KISS Pollo when I come to AZ. The food tastes amazing and the customer service is great. Very friendly and the restaurant is clean. Make sure to stop by and try their food. You'll be glad you did"}
{"text":"This IS Mexican food!! Delicious, clean, fast service, and cheap. You can't ask for anything else, you can't pay for better tacos, period!"}
{"text":"Ohhhh sweet nectar! This place is a sanctuary! Don't let the neighborhood scare you away.  The Kiss tacos will give you a new perspective of life. AMEN 6lb 7 oz Baby Jesus"}
{"text":"Great food with just the right pricing first time here from reviews on yelp will def be back"}
{"text":"Excellent place to eat authentic Mexican food. Will definitely keep coming back."}
{"text":"Nice and very generous people! Great Mexican food. Clean. Cheap. What more could you ask for?"}
{"text":"My favorite taco place to go!!!!  Their tacos are not even greasy for my taste! They serve chicken everything! Awesome customer service!  Price is worth the taste!"}
{"text":"Ate there today.  The food was awesome. I had the burrito and the kiss taco.  They are very friendly there as well.  I will definitely be back."}
{"text":"Yelp led me to this delicious little gem. The kiss salad was sooooo good and fulfilling. Had so many flavors!! Yum.  It definitely hit the spot.  Will be back for more."}
{"text":"The best food I have had in a long time! The rice and beans so authentic. The service was awesome and the salad bar... One word amazing! I really dig this place!"}
{"text":"It is in the middle of a neighborhood. Building outside might make you think twice. However their food is very delicious,  the gentleman their is very nice and customer focus. This place is a little hidden gem."}
{"text":"Very tasty food.  Free signature taco for first time visitors!"}
{"text":"My coworker was googling for restaurants near work and we stumbled upon this gem the other day! I love the chicken salad and my new goal in life is to work my way through the menu. :)"}
{"text":"This place has the best street tacos I've ever had. The employees were nice and it had great salsa bar. Papa and kiss tacos are a must."}
{"text":"The owner at Kiss Pollos and other staff were so hospitable! I went for their Kiss tacos & they were THE best I've had in Phoenix to date. I went back for seconds. They were so flavorful and I didn't even want to add the toppings, because the tacos were so flavorful as they came. Already craving them. I'm no fortune teller, but I see my next visit in the near future."}
{"text":"Best Taco Shop in Arizona  everything is made from scratch everything is so fresh from there veggies to there salsas to there chicken everything is full of flavor super authentic tacos!! And on top of that they're very cheap it's a bang for your buck!!! I REALLY RECOMMEND THEM great costumer service also!"}
{"text":"5 star salad , I have dined 3 times and all 3 the greens were fresh ! I eat one and take one home for my kids after school they love it !"}
{"text":"We were told about this place and had to check it out. We were not disappointed!  The tacos were amazing, my favorite is the Pappa tacos. Service was great too. They were very friendly. We don't live close by but it's definitely worth coming here for great food."}
{"text":"I have found my new favorite spot, it's been open about a month or two. Everything is made from scratch. Tasty chicken tacos, delicious burritos, quesadillas, etc. Grilled wings with homemade hot sauce, a generous salad with lots of fresh toppings and yummy cilantro ranch dressing. Fresh salsa bar with the best pico de gallo, can't get enough!  Prices are great too! I can easily afford to feed my family of six. Been coming here every week since they opened. Nice little family run business with great service. The owners, brothers Jose and Elio, are always happy to see me every time I walk in the door. Can't wait to bring my mom here for some authentic food next time she comes to visit."}
{"text":"KISS IS FOR KEEPING IT SIMPLE!  This is my favorite taco shop in Phoenix, and that's a big statement considering I freeze burritos from SD every time I visit my mom there.  I grew up in San Diego and miss my quality (non cheese, beans, and rice on top of everything places).  Their everything is legit.  Meat, salsa bar, salsa heat, tortillas, everything.  The owners are really cool too and will give you a little sample your first time in.  Less than $2 is a steal.  Don't be afraid of the neighborhood.  My wife was questioning it in her head when we took are bikes so far away from the main downtown area, but she loved everything about it.  Hopefully you'll love this place as much as we did!  We'll be back regularly!"}
{"text":"I tried this place based off of their 5 star rating and the fact that I could order Delivery thru GrubHub.    I was Not disappointed, I tried the Flip Taco and a Kiss Taco and both were So Tasty.  I sometimes hesitate when ordering meat from a new place but no worries here. The meats were well seasoned and perfectly cooked and the tortillas were stuffed. Using a tostada on the bottom and a soft corn tortilla on top made the Flip Taco my Favorite.  I ordered the Quesadilla as well but am saving that for later.   I Highly Recommend this place-Excellent!"}
{"text":"Just ate here and I gotta say it's a must, will return when I'm back in Pheonix! The vampiro taco adjunto the quesadilla was among my favorites but everything g I had was delicious"}
{"text":"I loved this place! Better check this place out quick before they get too popular! The tacos and burritos are amazing! I can't wait to go back again. Kuddos to this business for supporting Isaac Middle School as well."}
{"text":"Great place, I can see why it has 5 stars. Great service, really good salsa! Will definitely come back."}
{"text":"Possibly the best quesadilla i have ever had. The place was very crowded and under staffed but the girl working the register had it all under control. Not only was she ringing people but she was cleaning tables and serving food too!! Definitely coming back my next visit to Phoenix"}
{"text":"Love this hidden gem!  The food is excellent, well-presented and affordable. I have tried the Kiss Taco, Kiss Papa Taco and Kiss Salad...all delicious!!"}
{"text":"Really excellent tacos and the salsa is flavorful and perfectly spicy.  The people who run the place are really kind and gave my aunt and uncle a taco sample on the house while the waited for us.  Really good food made by good people, what more could you ask for?"}
{"text":"Just tried Kiss Pollo. They're new to the area and offered us 2 free tacos to introduce us to their style of cuisine. We were instantly hooked!! It was sooooo delicious.  We had kiss tacos, papa tacos, the burrito, quesadilla and it was all good. My wife had the kiss salad and she enjoyed it just as much. We will definitely come back. This is our new favorite place!!"}
{"text":"Delicious chicken tacos. Not sure what type of adobo seasoning or marinade they use but every morsel of food is coated with it. It gives such an amazing flavor to each taco."}
{"text":"My favorite place for tacos right now. Everything here is awesome! Fresh salsa, fresh made tortillas, awesome food! You can't get better"}
{"text":"Man!!! This place is right down the street from my job, food is fresh and on point. Make sure you grab some salsas to go so bomb!!"}
{"text":"By far these are some of the best street-type tacos I've had in the Phoenix area. Coming from LA I know my tacos. This is a must try when a taco craving hits!"}
{"text":"This place is truly a hole in the wall.  We almost didn't find it but we did and we will soon be back. The service was excellent Jose the owner greeted us and was very friendly.  But the real gem here is the food .It speaks for itself and was delicious.  The salsa bar was great everything was fresh and I recommend the green salsa hot and off the charts delicious.  Highly recommend this one people and I don't do reviews often but this place is going to soar."}
{"text":"Best place ever!! The tacos are amazing and super delicious!! The staff is super nice and the salsa bar is super fresh and clean! The outside looks a little standoff-ish but defiantly worth the stop!"}
{"text":"This is my favorite chicken tacos.! Hands down the best chicken and salsas in any Mexican restaurant. Don't be fooled by the location, the FOOD is incredible. Can't go wrong with anything"}
{"text":"Been wanting to try this place for awhile, finally today I stopped by for a salad. All I can say is WOW, it was amazing. Fresh, healthy and had a great taste. A little pricey, but it's big enough for two meals."}
{"text":"Delicious food! The best chicken tacos in pheonix and only $1! Great service and friendly staff overall an awesome restaurant I'm definitely going to be coming back to"}
{"text":"Obsess with the Kiss Salad, I would have it every day and I guess I absolutely did it for a week, tacos are delicious too!!"}
{"text":"If you have not stopped by this little gem for some yummy tacos, you are missing out.  Tacos are great, but the hot salsa is the BEST that I have tasted ever.  Very nice people that work there.  Never busy when I go, but I usually just pick up to take home anyway.  If you haven't tried it, try it!!!  You will not be disappointed."}
{"text":"I don't normally write reviews but this place deserves it's 5 star rating. Easily the best place I ate at all trip. The food was great, the prices were good, and the service was spot on. Get one of everything and you won't be disappointed."}
{"text":"A simple, tiny shop tucked along a side street in a working class neighborhood. One would normally drive right past and not even think about stopping. Thanks to the stellar reviews on Yelp, I discovered this gem.   They only served one type of meat - chicken, very very very delicious chicken. They offer several variation of tacos, and burritos, quesadillas, and salad. I tried the Kiss Taco, Papa Taco, and salad. It's the best chicken tacos I ever had. The meat is tender, juicy, and packed with flavor. The salad is great too.....because it is topped with the same chicken.   It's a must try if you haven't been here."}
{"text":"Wouldn't you be curious if you read about a small restaurant serving only a limited variety of chicken preparations but was still averaging 5 stars after more than 100 reviews? I certainly was, so off I went to give it a try. Indeed, it deserves all the praise it was getting. The people a super friendly, the place is clean, and the Kiss salad I ordered was phenomenal: a very generous serving of flavorful chicken and really fresh greens, cucumbers, pico de gallo, sliced-up hard-boiled egg, and a creamy green dressing. Definitely a place to return to for a filling, very tasty and inexpensive meal."}
{"text":"This place was an incredible Yelp find. Might look sketch when you first pull up to the place, but I promise the food is worth it! Don't let the location and look detour you. Plus, you can find them on Uber Eats at times. The owner is from SoCal and serve up some delicious tacos and burritos. Try them out. You won't regret it!"}
{"text":"What a find!  Needed a bite after traveling to PHX. Just a hop, skip and a jump from the airport.  Great service, yummy food, easy on the wallet."}
{"text":"If you haven't been to this restaurant you must eat here.  Small menu but really good food and the prices are great!"}
{"text":"Good prices, Great food, better customer service. From CA, and this place blows most places out of the water. Chicken tacos and burritos on point."}
{"text":"This place is great. Small and authentic, looks like someplace you would find in Mexico. The kiss taco and papa taco are fantastic, and their salsa bar gives you lots of options for increasing the heat to your liking. Not a lot of options of the menu, this is a no-frills joint but the food is amazing. Definitely recommend for a hole in the wall place, but don't come looking for fancy here."}
{"text":"The name is somewhat deceiving as I thought they would have charbroiled chicken. Despite their small menu options the food is delicious! A coworker suggested this place and I was impressed. Unique flavors, little hole in the wall and  excellent customer service you can not go wrong!"}
{"text":"Great people , incredibly delicious chicken !! Go try Kiss Pollo and you will know why everyone gives them 5 stars. Thank you Kiss Pollo for your delicious Food !!  Thank you, Jeffrey William Hurst"}
{"text":"Unbelievable fresh Mexican. Flavorful and great guys running the place. It's a must go place!"}
{"text":"Glad to have finally checked out KISS POLLOS. Came in a little after 11am and it was already quite busy on a Friday. There was only one cashier who also had to run the orders, bag/box them, and clean tables. She did the best she could considering they really need another person at the register. We ordered the KISS PAPA and the burrito. Unfortunately, they were already out of rice for the burrito (Yeah...I know ¿Qué onda?). Besides that hiccup, the food was tasty! My companion enjoyed his burrito. The Kiss papa has very finely chopped pieces of chicken which made it a bit dry. I think I'll go with the burrito next time. I highly recommend their spicy sauce.   Sidenote: you won't find any aguas frescas here like most Mexican restaurants just bottled/canned soft drinks and water."}
{"text":"Best tacos ever! Unsuspecting little hole in the wall that churns out the most flavorful tacos I've found. Menu is very limited but they do what they know & that is their specialty taco which has cheese, chicken and pieces of pork. The tortilla was so fresh & the meat was unbelievably flavorful. We also ordered a side of beans which were the perfect accompaniment. We even ended up going back up & ordering more tacos because they were so good (& crazy affordable)! They post some daily specials on their FB page such as nachos, sandwiches etc. Don't pass this place up!"}
{"text":"Small house converted into restaurant in neighborhood. Quaint interior. Limited menu good salsa bar. Basically just chicken taco-tostado overpriced for street taco size. It wasn't bad wasn't good."}
{"text":"Met the owner and his wife and they are lovely people.  He talked to me for over 10 minutes and was very kind and respectful.  I had the chicken bowl and it was a huge generous portion of food and everything tasted fresh and delicious.  Their red hot sauce is amazing, tasted like LOS ANGELES salsa.  I find that a lot of the Arizona salsas lack in flavor but Kiss POLLOS is amazing.  It's located in a nice quiet location and there is plenty of seating or space to spread out.   I love this place and will be back on my next trip to PHX.  I look forward to another conversation with the owner and his wife.   Please try this place, it's worth it."}
{"text":"The only reason for losing the star is the location. It is awesome food , made by happy people and always been good so far. The chicken tacos are my favorite, especially when dressed up with their salsa bar fixings. It's quick, inexpensive and healthy.   It is a great Goto place.   Well recommended!!"}
{"text":"Usually when I'm on this side of town its mandatory that I stop at Carolinas. But I had a friend that suggested I try the best street tacos he's had in a long time at this taco shop that his local friends raved about. He was spot on. These street style tacos were nothing short of fantastic. I'm pretty sure we had one or two of everything on the menu between our group and everything was awesome!  Owner was super friendly and food was delicious and priced right. It's hard to beat Carolinas when you're in this neighborhood but Kiss offers different flavors and I know it's going to be a tough call next time I'm downtown."}
{"text":"Yelp led me and my lunch date here and I'm so glad.  It really is 5 stars; it is a hidden gem in a poor urban neighborhood.  We sampled 3 different tacos and quesadilla.   The tacos look small, but they are piled up with tasty insides.  My favorite is the flip taco because it's unique to me, and I love the crunch!  The menu is small and simple, but all the items are tasty, and I'm sure that leads to faster service (which was indeed fast).  If you are looking for a great \"hole-in-the-wall\" taco place, this is the best.  Neighborhood doesn't look like the greatest and the location is a bit hidden from a major street, but it's by a school and it's worth a visit.  I'm definitely coming back and taking more friends here."}
{"text":"Price = 10/10 Food quality=8/10  Speed = 10/10 Location 4/10 Definitely a great place to grab a quick bite! We tried 1 of everything and it was amazing!"}
{"text":"Sometimes I have the rare pleasure of being in town for business. On the road, sometimes I need my Mexican hot sauce. These sauces are hot and flavorful, the tortilla chips are always fresh. They have some kind of Mexican Cole slaw that's just epic, especially topped with their red salsa ... Kiss Papa now, seriously Kiss Papa ...  Price = 11/10 Food quality=10/10  Cleanliness is next to Godliness = 10/10"}
{"text":"The best chicken tacos! Also, its rare when you find a taqueria that has amazing salsas! Their salad dressing is so delicious! I love it all!!!"}
{"text":"This is probably one of my favorite taco places. They are the best in town no doubt! Speedy service, clean and delicious! I highly recommend trying Kiss Pollo if you haven't already."}
{"text":"Salad kept up with the rest of the high ratings, looking forward to the tacos when I come back!"}
{"text":"Sooooo beyond good and crazy location in a very residential area. It is worth going off the beaten path. No booze or chips--but the tacos are unreal!"}
{"text":"They know that they make one thing amazingly, so they just stick to that! A girlfriend and I stopped in not knowing what we wanted, so they went back to the kitchen to make us some sample tacos. Yes please! The customer service here is out of this world! They care about customers happiness, how amazing! I ate dinner and I was full for about six bucks."}
{"text":"If you want authentic mexican street tacos, you need to come eat here. Yes, it's on the out skirts of downtown, but it's worth the trip. We will be back!"}
{"text":"My wife heard about this place, so we went to check it out. This place right off the back. Delicious!!!! She had the salad and I had the quesadilla.   The chicken and the cheese was amazing with red hot sauce. The cup of beans   The salad had a unique dressing, one so good, you have to try it for yourself. This place, I give it two thumbs up!   keep doing what your doing guys."}
{"text":"Just come in check it out! I know I'll be back again. I opresores 2 Kiss papa chicken and papas! Tacos come out plain and then you just add your fav toppings from the salsa bar. There was no guacamole but the green salsa was great! They have me a free sample of the Kiss Taco and that was pretty good too! I wanted to try the whole menu but I just couldn't eat more! I had a light conversation with one of the girls that works there and she was super nice.  I wish the place had more windows or natural light but if you are looking for a quick taco please stop by here and check them out it's pretty good!"}
{"text":"OMG!!! BEST TACOS IN TOWN!!!  Located in the barrio, where all good Mexican food is made, this place knows how to make tacos!!!  Everything is made fresh and so delicious. Joytaco and America Tacos don't know tacos like Kiss Pollos.  Prices are right, food is made fresh and I'm sure glad I found this place. Will be here a lot more and can't wait to bring the family."}
{"text":"This place is a hidden gem. The food is AMAZING, it comes out super fast and the service is great. I would also like to add that it's super inexpensive.  So if you are on a budget, this is the place for you."}
{"text":"Great tacos, but everything else on their menus is just as amazing as the tacos. My favorite is the kiss pizza!"}
{"text":"great little family dinning place that could use some cleaning and remodling."}
{"text":"Nice hidden gem! This place has a pretty small dining area so you may not get a table if you don't beat the lunch rush. Great employees and even better food. Take the trip it's totally worth it!"}
{"text":"One of my fellow yelpers (Tim) led me to this little gem. I had it booked for some time and wish I would have tried it sooner. The location could be difficult for some to locate, so plan accordingly. For lunch today I tried out the Kiss salad and taco. The salad was full of goodness, that included cucumbers, tomatoes, egg, superb chicken, and tasty dressing. The Kiss taco was made with some awesome pork. The tacos themselves are a little small but priced right so just order two, or three, or hell, just make it a solid five. The staff was very friendly and the dining area was cool and comfortable. Will definitely be back."}
{"text":"One of my favorite spots to have authentic Mexican meal! They recently added their kiss wings permanently to their menu- which has become my go to meal when I eat here. One of the best wings in the valley I have had! The owners/employees are so kind and friendly. Highly recommend to give this spot a try- plus prices are aaaamazing!"}
{"text":"Absolutely delicious! We had the kiss taco, the kiss papa taco, the quesadilla and rice and beans! Everything had that delicious homemade taste! We loved everything! And all the fresh salsas were fabulous too! Can't wait to eat here again! The friendly atmosphere made it even better! We drove all the way from Surprise, it's totally worth the drive!!!"}
{"text":"Visiting the Phoenix area for Dodgers Spring Training. We knew we wanted to eat Mexican while here so I Yelped Mexican food and chose Kiss Pollo for the 5 star ratings. We weren't disappointed. I ordered the Kiss Taco and Papa Taco. My daughter ordered Kiss Papas. Both delicious!! Nothing left on our plates. We thoroughly enjoyed the unique combination of both chicken and pork. We don't have that in California. We might come back before we leave. Highly recommend this place. The owner was very friendly too, a plus!"}
{"text":"Unbelievably good. The red hot salsa is the best salsa I have ever had. Great food and great prices.  The burrito is phenomenal. So much flavor This place is going to explode with popularity. Get here before it gets crazy"}
{"text":"I was recommended this place from the girls at the medical office I was rotating at so I decided to give it a try. The location is on a small side street next to an elementary school. If it's busy out, it may possibly be hard to park. They have one table out front for seating otherwise there is plenty of seating inside. I came here already knowing that I wanted the salad. Checking in, you get a free kiss taco. This is the least I have ever paid for the largest salad with all the the fixings.   The salad was so large I actually had to transfer it to a mixing bowl so I could eat it. The salad had tons of different toppings (pico de gallo, shredded cheese, cucumber, crispy tortilla, and slices of boiled egg) and came with a ton of chopped chicken. The meat was a little on the salty side but it was really flavorful and delicious. There was so much meat in the salad that I still had a ton leftover after eating all the lettuce and other toppings. The salad came with a cilantro dressing. The dressing tasted whatever by itself but mixed in with the salad, it was perfect and really helped blend all the flavors together in perfect harmony. Overall, a pretty solid salad. It's not the best salad I have ever had, but it was really good.   The kiss taco was delicious and it too was super cheap! The taco comes with meat (chicken and pork) and cheese, but they have a salsa bar where you can get onion, cilantro, green onion, cabbage, lime, etc to add on top of the taco. The taco is street taco sized, so you will need multiples to make a meal. The meat in the street taco wasn't salty at all. It was perfectly seasoned.  The hot salsa they make there has a nice smokey hint to it. I ate my taco in the car while I was driving and really regret not putting the salsa on it. Next time, I will and I will also try a burrito."}
{"text":"The place is definitely a hole in a wall, but the food there is great!!  I've hade the chicken salad--great flavor, large portion and great price!!"}
{"text":"As the previous reviews have said, if you blink you might miss it. Great little spot."}
{"text":"Terrific tacos and salad.  The chicken was moist and well seasoned.  Very inexpensive.  Great customer service.  My coworker and I were first timers to this place and we got sample tacos prior to ordering.  Great local place in the neighborhood."}
{"text":"This place is really good and is located in a pretty unique location south of downtown.    I had their salad and it definitely hit the spot.    Their kiss tacos were also really good.  Salsa bar had several different selections.  I'll definitely come back if I'm in the area."}
{"text":"I honestly didn't think I would like Kiss Pollo because they chop their meat, and I prefer shredded. This meat is not dry at all. I loved everything we ordered. You can't beat the prices. The salsa bar is nice and clean. The dark greenish salsa is my favorite-not too spicy and full of flavor."}
{"text":"Unfortunately this place was closed therefore unable to try there tacos. Sign says open from 1030-8pm on Friday's though apparently decided to close when I paid for a visit. What a shame as I was looking forward to try there tacos. Yelper tip of the day don't always believe in the hours of operations and call ahead. Super disappointed!"}
{"text":"Excellent flavor.  Get some thing that says papas. And the red sauce has such a delicious unique flavor although both green and red salsas are amazing."}
{"text":"A chicken lovers haven! Don't let the area deter you from experiencing this delicious food! We were immediately greeted with a smile and a warm welcome. The lovely woman asked if it was our first time (it was) and then took the time to come around the counter to explain each item on the menu. We opted to share the salad, which was fantastic! It was fresh, large and delicious! We then each got a taco or two. Each one was better than the next. They were a great portion size, full of flavor and  done just right. The fresh condiments were incredibly tasty and a nice addition to the taco. Kiss Pollos is definitely worth the trip!"}
{"text":"Affordable price and large portions if delicious food!  Salad is amazing!  Quick service too.  Was a little warm in the dining area, but we were in shorts/tshirts/sundress so we were good.  Delicious 1L Mexican Coke and Fanta."}
{"text":"Wow. Came here because of the glowing reviews and I was not dissapointed. The food was amazing. The quesadilla was maybe the best I've ever had. The beans it came with were authentic and awesome. I also tried the tacos which were good plain but with their pico and salsa were wonderful. Definitely will come back. The restaurant  is not much to look at and in a challenged area but definitely worth a tasty visit."}
{"text":"Very pleasantly surprised. Everything is pure b nice. Dishes in the ratio of price and quality are ideal. The waitress quickly oriented and gave advice."}
{"text":"Being from SoCal and use to great Mexican food, we were pleasantly surprised to find this great place!  Family owned and operated AND from SoCal, as well. Between the four of us, we had the salad(huge meal,) chicken quesadilla, tacos, and burrito.    We were on our way to another part of AZ but we all agreed we needed to return! Sorry, we ate everything before remembering to take pictures!"}
{"text":"Don't be deterred by the location. This place has REALLY good food!! My favorite salad ever. The homemade cilantro ranch dressing is delicious and they don't skimp on the meat and eggs!! If you're more in the mood for tacos, the Papas tacos are a must!! My dad really likes the burrito because they pack a lot of meat into it. And if you're lucky enough to stop in when they've made cookies, GET SOME. You won't be sorry!  Ps. They don't have avocados so we've taken our own. Lol!! They cut them up for us. The owners are amazing!"}
{"text":"The food is great. I love the kiss tacos. So glad I work in the area so I can come for lunch!"}
{"text":"My work partner and I are always on the prowl for new amazing food locations near downtown Phoenix and Kiss Pollos knocked it out of the park! We gathered our condiments while they prepared our order. The Kiss Tacos were amazing. They placed cheese on the bottom and piled the warm chicken on top so it was melt-in-your-mouth perfection. The chicken quesadilla was also outstanding, they prepared a perfectly grilled tortilla, filled it with chicken and cheesy goodness. It came with a small side of beans and cheese. I also purchased two brown butter sugar cookies and they were incredible! They came with a sugar and cinnamon glaze drizzled on top and were the top-quality kind of cookie that you'd expect from a stand-alone bakery. They were a delightful addition to a wonderful meal. Try Kiss Pollos - you won't be disappointed!"}
{"text":"The tacos were delicious and the sauces were amazing! Great service. If it had beer and chips & salsa I would have given it a 5!"}
{"text":"Jose is very welcoming and the food is GREAT. The tacos are not your traditional tacos. Off the beaten path. A hidden gem."}
{"text":"Consistency is the key ! Food is always fresh and delicious... kiss tacos and quesadillas well recommended all tho everything on the menu is pretty good.. the salsa bar has multiple options to dress up your food to your liking.. love this place.. try it out!"}
{"text":"The guys are always friendly and willing to whip up some goodness. Awesome daily pop up menu items. I like the salsa bar which is always clean and fresh. I like the hot green one.   I love the Kiss Taco awesome charred chicken with heavenly white cheese and a tasty corn tortilla. Don't forget the potatoes tacos as well with same combo with little dices of chicken. I like how they wrap them up in a wax paper and foil. I've tried a flip taco crunchy on one side with beans and chicken taco on the other side combined! Kiss Papa plate is awesome chicken cheese and potatoes with some round crunchy chips. If you like quesadillas there's is so good and made with a homemade tortilla.   Everything is freshly made and made with so much enthusiasm for cooking. I will support this place even if the prices went up!     A must place to grab some bomb tacos! (Chicken and potatoes only though)"}
{"text":"The menu here is limited but when someone orders 3 tacos get 4 as a thank you gesture followed by two more bought just because it was so good show how amazing this place is. The prices are perfect."}
{"text":"The food here is scrumptilicious! Yum! Do yourself a favor and enjoy the flavor of Kiss Pollos. You have to come here and partake of the delicious food the people here are creating. This place is a treasure and a taste bud pleasure. We came here during a trip from San Diego. The menu is short and we weren't sure what to get so we ordered one of everything except for the salad (which I'm sure is fabulous). \"We\" is mom and four kids ranging in ages 12 to 15. We ordered the following:  Kiss Taco, Papas Taco, Vampiro, Kiss Papa, Quesadilla, Burrito, Taco, and, because we had a vegetarian in our midst, an order of plain potatoes. OMG! The potatoes are amazing! There is nothing plain about them. They are the best potatoes I've ever had. I would go back just for their potatoes. They were superbly seasoned, perfectly roasted - crispy on the outside, fluffy on the inside, and full of tantalizing taste bud ticklers. We topped them off with pico de gallo, and it was a potato platter of perfection. Kiss Papa is the potatoes with all the yummy toppings and this too was fabulous. The quesadilla was fat and stuffed with chicken and cheese, and the light and crispy tortilla held it all together and wow it was the best quesadilla we ever ate. It came with a side of refried beans that were oh so creamy and flavorful. All the taco variations we had were the bomb -- healthy servings of chicken on each with hot, soft corn tortillas hugging it all together. The burrito, with a perfect ratio of chicken, rice, and beans, was a warm comfort packet of flavor explosion. The Taco proved to be so delicious in its simplicity - corn tortillas, chicken - that my son ordered three more and my daughter two more. The salsa bar had a good variety of salsas from mild to hot to chunky to saucy to green to red. The pickled onion is not overpowering and perfectly compliments any of the food items. I spoke to the owner so I could rave about his food and to get a little history of how they came to open Kiss Pollos. A really nice guy. It's a family-owned business, the recipes and creations are their own, and he said they didn't stop creating till they reached perfection. I agree; they reached perfection. Being the wonderful host he is, he brought over a sampling of their horchata custard (homemade) and brown butter cookies (homemade). The horchata custard is like the drink but in the form of custard. The flavors of rice, vanilla and cinnamon were perfectly balanced and it was not overly sweet. A cool, just-sweet-enough end to our meal. The brown butter cookies are a good sugar cookie, again without being overly sweet. We all loved the food here and all look forward to going back to Phoenix just so we can eat at Kiss Pollos."}
{"text":"Incredible food! We started with tacos and couldn't stop till we tried most of the items on the menu it seemed.  Without the least bit of hyperbole everything we tried was to die for.  If you're in the vicinity you absolutely *have* to give this place a try."}
{"text":"Simple fare: charbroiled chicken (pollo asado) corn tacos with cheese and shredded pork. One can add more flavor with a salsa bar that carries mild and spicy salsa as well as pickled onions, cilantro and onions, and cucumbers.   It's good to eat tacos that aren't drowned in a variety of flavors, but keep it simple.  Less is more.  Recommended."}
{"text":"Great food, chicken in every dish, Papa Taco is the best!! Quick service too, Place is a bit hidden across from Lowell elementary school."}
{"text":"Stopped in after a recommendation from a friend to grab some amazing tacos. The venue is simple and straight to the point. No nonsense, thrills, or frills here, because you're about to have a some bomb tacos. Some of the best tacos I've had in quite a while. Recommend the papa taco."}
{"text":"Was at an event at the Harmon Library and had Kiss Pollos Estilo Sinaloa on Phoenix area restaurant bucket list so I had to give it a try.  I had a quick taco to hold me until dinner, the one with chicken and potato was recommended.  It was awesome!  Salsa's are really good, meat and potatoes seasoned well.  Because it was so good I came back after Library event and ordered a salad to go for dinner with the chicken in a separate container.  The salad dressing was outstanding but the chicken was minced which didn't quite do it for me on a salad, I will stick to traditional taco/burrito/quesadilla items when I return, and I will return for my cookie which they did not have because their oven was broken, grrr, don't tempt me to only burst my bubble ha ha ha."}
{"text":"The food was delicious! They only do chicken and the do it well. The chicken was moist and flavorful. Jose, one of the owners, was super nice. You gotta check this place out!"}
{"text":"Top 5 tacos in the valley. Very unique tacos to boot. Handmade tortillas and their hot red and green salsas put this place over the top. Sooooooo tasty"}
{"text":"Read reviews on yelp and decided to check out for myself, the food was great! Perfectly seasoned not salty, the restaurant itself was super clean and the staff was also friendly! Food was fresh and hot. I will mos def be back"}
{"text":"Tried the kiss taco and it was really good and cheap! Shady area but it's worth it. Restaurant is clean and the guy at the counter is friendly and passionate about their food. Great local place and way better than most taco shops near downtown."}
{"text":"Honestly the best tacos that I have had in Phoenix. Kind of in a dicey area but that's part of the experience. I would recommend the Papa Taco."}
{"text":"Best non-vegetarian tacos and papas I've had! I'm getting disappointed by all the other tacos I've had since I tried theirs. This is my default lunch in the office if I forget to bring my own lunch from home."}
{"text":"Super impressed with this restaurant.  I work nearby and this is one of the few restaurants that is close enough to go to.  I was offered a free taco, as this was my first visit, and the entire menu was explained to me.  I had the salad and it was superb - one of the best I've had in awhile.  Will definitely be back."}
{"text":"Hole in the wall with a very limited menu but the chicken is delicious and the salad was awesome! Will definitely go back!"}
{"text":"Great place for a quick bite. Located next to a school and in a residential neighbourhood, you might think your GPS pointed you to the wrong location. Great selection of tacos and all of them are very tasty. They are also willing to let you try one for free. The girl working behind the counter is very friendly and gave us some great suggestions.   If you ever in the area, give this place a try. It is only about 2 miles from the rental car return. We will be back again for sure!"}
{"text":"First time being there today and I've got to say it was the best customer service and the best food I've ever had. It's located on a little corner next to a small shop and honestly this screams Mexico, it reminded me so much of the little cenadurias they have in Mexico and the shops all around. The young lady that helped my boyfriend and I out and was incredibly friendly and patient and told us about how it's only her family and her running the restaurant which is pretty impressive! I ordered four tacos and they were all delicious I definitely recommend the red salsa if you're not afraid of fire. They also gave us complimentary chicken fries which definitely exceed carne asada fries. Over all our experience was great and satisfying. The customer service is genuine and perfect. I recommend this place to everyone and anyone looking for that authentic Mexican taste."}
{"text":"I was looking for a new spot to grab lunch while at work and Yelp led me to Kiss Pollos! The Kiss salad was every much as great as described by previous reviews.   The charbroiled chicken is delightful and the lettuce, cucumbers and pico were fresh and delicious. I grabbed some spicy salsa from the bar and mixed it with the jalapeno/avocado ranch that came with the salad. For under $9 it is a great break from the norm for lunch.   I can't wait to go back and try the tacos!"}
{"text":"This gem just opened (to very little fanfare) just down the street from my house. Tucked back in a neighborhood- between an elementary school and a public library- it would be easy to skip over this restaurant. Don't.   The focus of the limited menu is chicken. They have succeeded in being able to come up with some tasty combinations. My husband and I each wanted to try their taco selection. Street tacos, in all their variety of forms are some of my favorite foods. We each had one of their signature tacos, one of their chicken and potato tacos, and one of their \"special \" tacos - it was a chicken salad taco. It would be hard to pick a favorite!  Next time we come back, my husband and I both plan to try out other things on menu. Hopefully, I'll be able to come amend this review and give them 5 stars after they've settled in. I see good things in their future!"}
{"text":"This is a small menu, hole-in-the-wall type restaurant, that has great food and a really friendly staff. Don't go here expecting sit down service and a fine dining experience, then leaving a bad review when your expectations aren't met. Go here expecting great authentic food in a little neighborhood take out place with a few tables. Their chicken is amazing!"}
{"text":"Really great service! Fast and delicious! Definitely stop by or order on grub hub. Well worth the money."}
{"text":"Worth the drive from N Scottsdale! Fantastic food and flavors. It is an amazing deal for authentic food and great place to share with friends and family."}
{"text":"Wonderful restaurant. We got off the plane and were Hungry   The place was highly rated and deserved the high rating. We had the salad that was featured. It was very tasty and dressing was homemade and seasoned well."}
{"text":"I'm from Houston, Tx and I've had some problems finding places that have good Mexican food, but this place OHHH MYYY GOOODDD!!! It had to be so far the best one I've had. My first best one just made second to this place. Damn good prices and amazing customer service."}
{"text":"Amazing kiss tacos!   Best street tacos I have ever had.  The flavor is unique and delicious!   Service was exceptional also.  They gave us each a sample taco while we waited.   Will definitely be back!"}
{"text":"Tried the kiss wet burrito, very delicious! Service was friendly and fast. Location was small and tucked away but the food made it very much worth the trip."}
{"text":"This is a family owned business and they are super friendly and the tacos are the best tacos I've ever had !!! The marinated chicken they use it finger licking good, and the tortillas were definitely homemade. Lastly, the sauce bar was to die for. If I could leave more than 5 stars I would!!!!!!! (And their daughter is the cutest card returner ever!)"}
{"text":"We stumbled on to this little gem in south Phoenix. You would never know that this little restaurant was tucked away between a school and people's homes. This small quaint place doesn't have a large menu but I tried the first 4 things on the menu, got myself some of their homemade red salsa (omg) so good actually the best I have ever had. No fountain sodas but sodas in bottles and various other drinks too. The street tacos came out and I have to say where has this been all my life. I am a native Phoenician and this has to be the best little taco shop I have ever had. Can't wait to bring my best friend and his family."}
{"text":"We were looking for great Mexican food before we left Phoenix so found Kiss Pollos on yelp. Wow!  Great fresh delicious food and super fast friendly service. Highly recommend. Don't let the humble facade scare you away - go inside. You'll be so happy you did!"}
{"text":"Prices are good, food is great, service is quality.  The size of the tacos are street size, so get multiple if you get any!"}
{"text":"Food was excellent. Love the customization you can add to your meal with the salsa bar. Gotta try the kiss tacos with the crushed cabbage, lime and the green salsa. It is deliciousness. Would have gotten 5 stars but they forgot to include the tostadas with the kiss papas. Next time."}
{"text":"First time visiting Arizona and I'm very happy I found this place. I'm a very picky eater so finding new places I love can always be a challenge but this was amazing! I got 3 of the 4 tacos and they were all AMAZING. The taco that has potato on it is killer.. I would have never thought to do that. I honestly would come all the way back to Arizona just to get some more food from here!"}
{"text":"first time to kiss pollo estilo sinaloa, and it was great, great favor, simple menu only chicken, definitely coming back. salad was so good, tacos were great too like, my girls love the papa with chicken."}
{"text":"If you are in Phoenix, you have to try these tacos! Kiss and Papa tacos are epic. Try the hot sauce, you won't be disappointed. Great conversation with the guys who opened this spot."}
{"text":"This tiny little out-of-the-way restaurant is amazing. The service is very friendly and fast, the food is fresh and wonderful. The menu basically only has chicken tacos, burritos and a salad. Chicken only, no beef or pork.  They probably have vegetarian items, but it didn't appear on the menu."}
{"text":"Not sure what makes their food Sinaloa style (maybe the unique set of spices for the chicken), the menu appeared to be border-style street food with a wholesome and contemporary twist. Everything I ordered at Kiss Pollos was very flavorful and the ingredients were remarkably fresh.  This is not a typical dollar taco shop, they specialize in chicken and potatoes prepared in unorthodox ways. For example, there are eclectic items on the menu such the salad taco, mini pizza made with tortillas, nacho-infused chicken tacos.  I came to try a salad taco and their famous kiss chicken taco, both of which cost a little more than $1. The salad taco consisted of a potato salad ball and some leafy greens wrapped in a supple flour tortilla. The cold potato salad was savory and surprisingly not too heavy. It did have a slightly acquired taste initially, so it was very different but in a positive and creative way. I preferred the chicken taco a little more, because the chicken was thoroughly roasted over charcoal and had profound chargrilled flavor. I'm a fan of the bitter-smoky flavors (not overdone) in the chicken, I thought that it was expertly prepared.  For both tacos, flour tortillas were used rather than corn tortillas. Kiss Pollo's flour tortillas tasted like they were homemade with greater thickness, durability, and elastic texture compared to the fragile store-bought tortillas commonly served at dollar taco stands.  The most attractive feature at Kiss Pollo was their salsa bar. Every single item there was fresh and neatly presented. The salsas and vegetables looked like they were prepared just an hour ago. There were more condiments to dress up the tacos compared to most salsa bars I've seen in California. For example, I found pickled red onions, Mexican cheese, and cucumbers.  I don't mind coming back for some grilled chicken tacos when I visit Phoenix again!"}
{"text":"This place is sooo good! The food was delicious and the customer service was amazing! Great job!"}
{"text":"It's an all chicken spot, kept it simple and got the quesadilla it was bomb! Very generous with the portion of chicken they put on the tacos/burritos/quesadillas. Definitely be coming back since it's so close to home. Come check them out if you're in the mood for good chicken tacos."}
{"text":"Writing this review after my 5th time coming here. This place is amazing. I've had the kiss tacos and the Chicken nachos and both hit the spot! The employees there are super nice and provide great service."}
{"text":"I'm always down with some grilled chicken.  A quick Yelp search of \"pollo\" pulled this place up.  I browsed through the pictures and saw that they had an awesome looking pollo salad. As most of you know, I am pretty much allergic to vegetables.  I never buy them, rarely eat them, and generally, we aren't the best of friends.  BUT....when you throw them together with some meat in a salad, I am no longer allergic to them and actually enjoy a good salad every now and then.  I was near this area today, and decided to stop by.    I walked inside and was greeted by a man (super family run joint) who took my order.  I went with the \"KISS Salad\".  Paid the man my money (just over $7.00), grabbed some salsas from the salsa bar (great selection btw...pickled onions, green onions, cucumber, radish, 3 kinds of salsas etc) and took a seat in their dining room.  A few minutes later, my salad was placed in front of me.  Here is how it was................  KISS Salad-  This thing looked awesome!  I don't know if I have seen a prettier salad.  It was presented extremely well.  This salad came with a ton of cucumbers, chicken, shredded cheese and pico de gallo.  This is laid on top of a mixed field greens blend salad and comes with a little cup of avocado/ranch type dressing on the side.  The salad usually comes with a hard boiled egg, but they were out of eggs today (no biggie...probably my least favorite item of the bunch, even if it was included...didn't miss it one bit).  The guy who bought out my salad apologized and said that they stuffed it a little bit fatter with the other ingredients.  Fine by me!  The salad comes with 2 fried corn tortillas, too.  I had one bite of it and it was great.  Didn't eat them though (low carb issues ;-) lol).  I got some of my cups of salsas dumped them on the salad along with the dressing, mixed it up a bit and went to town!  Everything was delicious! The dressing and salsas coated everything perfectly.  They added some coolness and creaminess (avocado ranch) as well as some heat (salsas) to the salad. The cucumbers and tomatoes were incredibly fresh and tasty.  The mound of chicken they top this with was grilled to perfection and then hacked up into small pieces.  It made it so that every single bite of salad had some chicken in it.  Kind of reminded me of bacon bits almost.  It was great!  I woofed down that salad in record time.  Flavors were perfect and I can't remember the last time I had a better salad.  Yeah, it was that good!  I was definitely impressed and will make my way back here possibly next week.  Once my low carb diet restrictions are done with, I hope to try out their tacos and other offerings.  This place is a small, family run joint, that is pumping out great food.  Can't wait to try out the rest of their menu!"}
{"text":"Absolutely great hole-in-the-wall taco experience. It's plainly evident upon walking in how traditionally the food is prepared. The staff was extraordinarily friendly, and the tacos were downright delicious. Kiss and Papa Tacos were big hits. Word to the wise: the salsa is great but very hot, and for picky eaters their variety is not huge. Thanks Kiss for some fond Phoenix memories!"}
{"text":"Salad is amazing and kiss papa looks amazing. I dont recommend the burrito as other items on menu are much more flavorful"}
{"text":"This is the only place where I'm a regular. The tacos are amazing, the staff is always nice and friendly, and it's ridiculously cheap for the quality of food you're getting.  Would absolutely recommend to anyone who is looking for good tacos. I have brought over 10 people here and will continue to bring more. 10/10"}
{"text":"My hubby and I went out of our way to eat the Kiss Tacos at this hidden spot.  They did not disappoint!  We ordered two a piece-next time we will double that-as they were tasty!  Clean and inviting."}
{"text":"Best Mexican food in Phoenix in my opinion. This place is beyond authentic, Sinaloa food. Try the burrito! It has an unusually different taste but it's amazing. It is in the projects, but it's pretty calm and you don't have anything to worry about! Parallel parking skills are needed!"}
{"text":"I'm back with yet another edition of taco Tuesday review. Similar to some of the other fantastic taco joints, this one is also fairly humble looking. However, the same is not true about the flavor their food packs! The menu is short, crisp and to the point. I decided to order the Papa taco and Vampiro (kiss tostada). While we waited for our food, I decided to raid the salsa bar. It's only the best part of taco Tuesday, hello? Their salsas seemed to be fairly high on the heat scale, but delicious nonetheless. Both the tacos were phenomenal and tasted absolutely fantastic! The crunch from the tostada in Vampiro was delightful. Just the right amount of meat and cheese too. Overall, pretty solid in terms of the overall flavor profile and quality of tacos. I'll absolutely return!"}
{"text":"Hidden gem! Budget friendly, full of flavor and made fresh daily...CHECK, CHECK & CHECK!!! I had the 'Kiss' (house taco) taco and it was delicious. They are served street taco size so if you're really hungry one might not be enough. The restaurant is a little hidden off in a neighborhood but worth a visit. I'm sure I will be back."}
{"text":"The interior is cozy, the staff is courteous and attentive, the menu is huge, the prices are acceptable, and the food is delicious and original in the presentation! I advise!"}
{"text":"The staccato of the butcher knives keep perfect time with the Sinaloan music playing in the kitchen. That is the essence of K.I.S.S. Yes , this is the \"keep it simple stupid\" chicken restaurant you have always wanted to visit. Talking to the guys working in the kitchen,  you would think they have read and religiously adopted any number of management books. \"We only do one thing,  but we do it better than anyone else.\" (They know their hedgehog.)   They serve the food completely plain so that you can put whatever you want on top. And they have a large selection of vegetables and sauces for you to choose from. You are going to get amazingly good chicken and corn tortillas here. You might also get potatoes and a little bit of pork. There are three kinds of tacos but only one kind of tostada one type of Papa dish one type of burrito and one quesadilla.  By the way, the vampire Taco has nothing to do with blood or bats. It is the way that tacos are called in Sinaloa if you serve them on crispy corn tortillas. The sort of knowledge is part of the fun of coming to this restaurant because the staff is very interested in educating you.  The veggies that are available include green onion, white onion, pickled red onion, cabbage, radish, cucumber, lime, and pico de gallo. The pico de gallo is a little bit sweet from the pickled onions, which make it a real tasty treat. There are also 3 Salsas mild green, green, and red hot salsa.   What are you waiting for? Get your butt over here and try this now! ¡Ahora!"}
{"text":"Amazing!! Very authentic, the owners were very nice! They fixed a Kiss taco on the house because it was our first visit. I live across the country but will be planning a trip back especially to eat at Kiss Pollos!!!!!"}
