{"text":"Finally got around to trying this place and it was definitely worth the wait :)

It was affordably priced and tasty. Only downside is the lack of parking. 

I'd come back to satisfy my cravings!"}
{"text":"I was in the area craving food when i saw this new place. The jerk chicken with rice/peas was fantastic, and was less than 10 bucks including a bottle of water. I used to be a delivery guy and have eaten in every caribbean place in the gta and can honestly say this jerk chicken was as good as any. Will definitely go back!"}
{"text":"Checked this place out with a coworkers and Lets say we were all satisfied. 

The place a small but has few tables. The service is quite fast at lunch time, the food comes out quick once ordered. 

I asked for fish as they had listed 2 types of fish meal but that day they didn't have any. Than again this is a mom/pop shop. I went with there vegetarian option, that being rice with bean and vegetable stew on top. The food was very good and the portions were very generous, as I was not able to finish the medium portion size.

Parking here is a problem and is very limited. Overall a decent place to eat!"}
{"text":"If local Jamaicans frequents this place then you know it will be good. 

I got Jerk Chicken lunch special for $4 and its a steal! 

. Chicken is dry rubbed and tender and very flavorful. Portions is something that you will get for $7.
. Rice and beans is also a perfect compliment to the main. Atsara is a bit of a downer though. 

Overall I will happily recommend this place. You will not get any really delicious almost perfect good portion food for that price point other than this."}
{"text":"I'm from Buffalo NY ... & I love my Jamaican food!!! But at our restaurants they are super rude and the oxtails are always too fatty. Kitchen King Jerk had DELICIOUS OXTAILS and great customer service!!! I will deff be back. It's super clean and has fast service as well."}
{"text":"Great spot for food in Weston area. Service is decent and the food is great!  

A couple of reviews:
Fall off the bone jerk chicken here.  Not too spicy but you can always ask for more jerk sauce.
Coleslaw is great.
Rice and peas are just right 9/10 times.
Stew is amazing. (Also falls off).

Only complaint is that sometimes they aren't consistent with handing out gravy on the rice / coleslaw so you have to ask.  Not really a big issue at all."}
{"text":"Going to all the west-end jerk joints til I try 'em all. Kitchen King is a little out of the way, has an obscene parking situation, and makes some seriously satisfying jerk. $4 gets you a small box full of rice n peas, coleslaw and a generous portion of chicken. The jerk is moist, smoky and flavourful. A little less spicy, and more smoky from others I've had. The fried chicken shines too - moist, crispy and delicious. Next time I'll pass on the red sauce, but there will definitely be a next time."}
