{"text":"Pork chops were tough. After asking if we wanted them seasoned or unseasoned - I'm not sure if they added much seasoning. The green beans were bland. Cream potatoes with no gravy were bland and had gravy. Please....do NOT order the cornbread .  Wasn't horrible. Wasn't great. Don't know if I would classify it as good. Just meh."}
{"text":"The first time my granddaughter and I was here was about a month ago for dinner. The food was great and our waitress Stephanie was super wonderful. She took real good care of us. We've been back now 2 more times and everything is still same. 2 thumps up to this place!"}
{"text":"I went there to pickup breakfast this morning and the manager and employees were extremely nice. The food was really good to say the least. I will def recommend this place for sure."}
{"text":"I was super excited to eat here because there's limited breakfast restaurants in the area. I used to frequent the previous restaurant (which looks like it's moving further down Albemarle by Zaxbys). Honestly I was disappointed. The grits weren't seasoned, the eggs were rubbery, and the livermush had a weird flavor and consistency. I wasn't able to eat it because it gave me heartburn. When I told the server she kinda shrugged and said \"sorry.\" I left it on the table and when I went to pay for it the manager asked ME why the server didn't tell him? Hell idk. Anyway he didn't make me pay for it but I'm unsure if I'll return."}
{"text":"No, this not a fancy restaurant. What it is , is good non fancy food. Everything tasted well in my three visits. Service is very good or very poor depending on the server. I ecperienced both.   This is close to home cooking in a casual friendly atmosphere. Owner genuinely cares."}
{"text":"When it comes to diners, I know your looking at the number of stars and wondering. It got 4 stars,  as I was a regular @ Previous place that was here. It is a Diner and what they do is very good at what they have a serve, Place is clean, Service was good and everyone was very cordial. Only their 2nd day here and it went perfectly.
Breakfast all Day
Typical Diner Menu
Close to Work and Brandy was a good server.
I Will go back"}
{"text":"Went for lunch, very diverse lunch menu and very reasonably priced. Great place for families. Meal was hot, flavorful and plentyful; came with a complimentary soup. Breakfast stops at 11am, but would definitely go again."}
{"text":"Good Folks
Good Food
Great Place to Eat and Meet Friends

Breakfast is Great.
Try their Steak & Eggs. Steak is very tender and flavorful."}
{"text":"If you are looking for a simple place to eat breakfast with your basic breakfast food with no frills and good price, this is it. 

I like the Greek omelet with Hashbrowns and toast for around eight dollars.

My husband gets two eggs sunny side up, hashbrown, grits, and sausage links for around the same price.

Fast service and staff are nice. 

Their oatmeal is instant."}
{"text":"I enjoy eating out quite a bit, and I usually don't have negative reviews. My mom told me not to say anything if you can't say anything nice. 
In this case, I will make an exception. 
I ordered chicken cordon bleu, mashed potatoes with gravy, and green beans.
The chicken was dry, had a thin slice of cheap ham and some cheese that was not Swiss on top. 
The chicken was dry and I think some au juice on the bottom. My green beans tasted straight out of a can, and the only seasoning was some onions. They were bland.  No butter, no meat, no red pepper. Nothing. My mashed potatoes were ok, and the gravy also ok.
Our server was attentive.
When the cashier, balding skinny guy, asked how everything was, my response was 'Eh.' 
His response was 'you can't please everyone.' 
WOW! So, the staff seemed to be used to complaints, as I expected him to actually care enough to ask why I wasn't satisfied.
My finance 's meal was also uneventful. 
The cashier saw my surprised facial expression and threw in an invitation to come back and give them another try. 
WHY? I could have provided them this feedback, but instead I got 'you can't please everyone.'
I eat out enough to jumpstart a minor economy on my own. I always tip well, and I am a great customer. No crazy requests, no attitude, and overall rather pleasant. will not go back, and suggest others do the same. I don't make a habit of giving bad reviews, but this experience deserved one. 

L"}
{"text":"Went in to continue my search fora NY Diner kinda vib.  Nice people, inexpense,  dining area was freezing and everyone complained.  By the time I was ready to leave it started to warm up a bit.

The service was good and the food was ok."}
{"text":"We had a nice breakfast at the Knife and Fork. The prices are really good, and they have a full spread of breakfast items. I had a Western omelette with hashbrowns. All for under $8. This is not a fancy place-diner like, but it's a great option for an inexpensive, tasty breakfast. The whole wheat toast was not very good, but I shouldn't have expected that at these prices. The server was very nice, and attentive. I would definitely return when in the area!"}
{"text":"Unfortunately,  not the best meal. The pork chops were thin and bland tasting. My wife had the baked spaghetti which was soupy."}
{"text":"Just opened up this past Wednesday. Host was congenial and welcoming. Server was nice enough. Food was good-had pancakes and livermush. My dad had eggs, bacon, grits and toast. Very good. Prices are comparable to similar restaurants. Good to have a solid restaurant in that space. Well be back!"}
{"text":"Not Sunrise.... but good news is that Sunrise is re-opening in their new location after being forced out of this one! It's just down Albemarle across from Target.  Opening soon! :)"}
