{"text":"Terrible.  I came here for lunch and there was a lineup. thought it was going to be a decent place with decent food. This is my second time here and first time was average; Seeing it was a wednesday, Ho Ho BBQ beside them were closed, so i ended up here.

Issues:
1) no roast pork today; 
2) roast duck was extremely salty
3) portions were unbelievably small; However, given that the cost was $5 for the container of food plus drink, not bad value. Just that other bbq stores provide more food, at $8 for a container of food.

after this visit, i won't be going back again."}
{"text":"They have the best BBQ meat I've ever had, probably the best in Toronto and they are always sold out by the end of the day. There are always long lines as well. Definitely recommend and I always try to buy from them unless they're sold out."}
{"text":"Owners used to be super nice and friendly when they first opened.  Now they're rude and show no manners to their customer at all.  They offer $5 for 2 choices of bbq with rice and a drink.  When i asked for my soft drink they told me there was non gave me a bottle of water when they clearly had a whole case of nestea and pop in front of them."}
{"text":"Very decently well priced take out boxes! I had their BBQ Pork and roasted duck combo with rice and a drink, which came out to $5 after taxes. Their portions were pretty generous and considering the fact that nearby places charge closer to $7-8 for a take out box.

Their meat was marinated quite well and not too salty. Kong Kee is one of the best places I've had Chinese BBQ meats!"}
{"text":"First time buying BBQ here, service was good and price was not expensive. I waited 15mins for their fresh and hot whole roasted duck ($21.99) out from the oven but honestly the roasted duck was tasteless, may be they didn't marinated well."}
{"text":"As a person who is non-Chinese I definitely have to give it up to my friends who are, for bringing me here. I came here earlier in the year and forgot how good it is until recently, when I went to randomly grab a quick bite from this place. It's located in small plaza at mcnicol and midland, small shop (take out kind of place) 

I got the roast pork and bbq pork on rice with veggie and soup (you can also opt for soy milk) for $5. AGAIN best bang for your buck, it's amazing ! Honestly nowhere in there is it written in english the prices (unless I've missed it each time I've been) so just know you can get a solid $5 meal."}
{"text":"I have been to many bbq shops. This is one of the best place for roast ducks. Even better, not expensive at all."}
{"text":"There's a reason the line goes out the door a lot of the time, other than that there's no room inside for people to line up. The prices here are very good, and the food is quite tasty. I have other Chinese BBQ stores I prefer to get my roasted pig, my char siu, and my roasted duck from, but this is a very decent substitute when I can't make it to those stores. 

Why Kong Kee gets the 5 star is because they have a Chiu Chow style duck that is the same price as their roasted duck ($10.50/half or $21/whole) and it's about as close to a legit Chiu Chow style duck as I've ever found in a Chinese BBQ store. Most of them say they have it, but it tastes like soy sauce duck. They even have the vinegar on the side! Whenever I'm craving that duck (basically whenever I think about it), I'm going to come get some.

Fun story. In Chinese, the name of this store is Bald-headed man BBQ. The owner, the guy butchering the meat, is bald."}
{"text":"There are 3 Chinese BBQ joints at this sketchy plaza. The bald guy in the picture doing the chopping I think used to run the Vans BBQ place at FMP.  Since they are new, I am going to say that opening a BBQ joint when there are already 2 existing ones in the same mall and is either extremely stupid or very ballsy. 

I am still scratching my head as to why the lineups and why the glowing reviews, sometimes I think people just do not have any taste.  I had the roast pork and duck for $5 deal and was very disappointed.  The duck was limp and flavourless, and pork was dry and bland.  It tasted like the meat you get at a Foody Mart or Bestco.  The only reason there is a lineup at this place is the ridiculously low prices. But low prices means low quality meat as you get what you pay for.  They must be sourcing their meat from sketchy suppliers because there is no way you can make a profit on a $5 meal deal.

I tried them out of curiosity, but from now on I am sticking with Ho Ho BBQ next door as they are way tastier and worth the extra $2.  Ho Ho BBQ and Lung Tung BBQ are still my go-to places for Chinese roast pork and duck."}
{"text":"One of the better bbq places in Scarborough.  Cheap eats better than fast food. $5 taxes included take out box w two kinds of bbq on rice. Can't go wrong with that."}
{"text":"I was in the neighbourhood past weekend and wanted to buy some Chinese BBQ.

Was planning to go to Ho Ho which in the same plaza.  But I saw lineup outside Kong Kee, I decided to give it a try!

For $5 you can have 1 kind of BBQ and rice, plus soy milk/soup/soft drink.  It is really good deal! I had char siu with rice. The meat is very tasty, not too much fat. Portion is huge for the money you paid.

I also get half roasted duck ($10.5) , they are delicious too. Skin is crispy and meat is fatty (I prefer fatty duck).

Owners are very nice people too. 

Highly recommend this place! I will come back and try roast pork!"}
{"text":"This place and the one right next to it (Ho Ho BBQ) are my family's go-tos for Chinese BBQ. Going to confirm what Joanne says and indeed we call it literally \"Shiny Head Dude\" aka bald-headed man because the butcher is indeed totally bald. 

I've never been in the area for lunch but I hear it's very popular because of how good the price is for what you get - a takeout box is about $5. I've eaten one before and can confirm that it is quite a good value for quantity and quality and even variety. You get two meats in one box with veggies as well. The BBQ pork is quite tender (Ho Ho's tends to be a bit drier) and the roast duck and pig is quite good as well. 

Not much to say. It's nice to just listen to them talk to their regulars. Come here if you want a cheap, delicious lunch."}
{"text":"This plaza is probably one of most concentrated plaza of Chinese BBQ places in the GTA with 3 stores all in the same area but of the three, Kong Kee always seems to be the busiest and the main reason is their $5 boxed lunches.  

For $5 flat you get 2 choices of BBQ meat, veggies, rice and a choice of drink or soup with your meal.   Seriously?  No wonder why they are always busy!  I can feed my entire family and still have money left over for a movie!!

The skin of the roast pork is really crispy and the meat tender.  The BBQ pork is also very good and not too fatty which I like.   It's not as good as my beloved Kum Hong in Richmond Hill but for the price, the value is excellent for what you get.

Very good place for Chinese BBQ in the area.

4/5!"}
{"text":"$5.00 including tax for roast pork on rice, choice of soup or soy drink. There's lower quantity of roast pork and rice than expected and soy drink is in a circular container, instead of the traditional cup form, which made it hard to drink out of. 

In comparison to Ho Ho Barbeque, which is next door, they provide more roast pork and rice and soy drink is in a traditional cup form for $7.35 including tax.

Service is rushed as it is extremely busy during lunch hours and a long lineup can be seen. The interior is squishy so you may have to wait outside, which may not be ideal when weather is bad.

In comparison to Ho Ho Barbeque, which is usually not busy when Kong Kee Barbeque is busy, they would ask you if that's enough rice and if you want fatty or lean roast pork. And you have the option of veggie or tofu.

Given that I received some fatty portion of roast pork at Kong Kee Barbeque and the veggie had less taste than Ho Ho Barbeque, I would say that I enjoyed the overall experience at Ho Ho Barbeque much better.

I would go back if I just had $5.00 in my pocket, but if I'm looking for better service and more food, I would go to Ho Ho Barbeque."}
{"text":"I've been to many Chinese BBQ places, and Kong Kee is now my favourite. Hands down, the best in all of the GTA."}
{"text":"This place is one of 2 other Chinese BBQ takeout in the same plaza.  This place however constantly has a line up outside the door.  For starters, they have chinese BBQ rice takeout lunch set for $5!! That prices includes a soy milk or soup, tax included!   I ordered a roast pig for a special occasion and the meat was crispy, not overly salty nor greasy.  

My only complaint of this place is the owner's wife service!! She is extremely rude even when asking common inquiries regarding orders.  Her husband, the one that does the chopping is a way nicer guy."}
{"text":"Crispy roasted pork n savory juicy Bbq pork.  Expect lines, when both their competitor's stalls are empty, so be patient. Food is very affordable and served take out style.  Ask for extra gravy for the rice.  Enjoy."}
