{"text":"Best kabob wrap I've ever had.  I've been to Atlas (their sister restaurant) many times and similarly have always had a delicious kabob.  The price was very reasonable considering the size of the meal.  Next time I am in Calgary, I am visiting as often as I can."}
{"text":"The Koob wraps are fine, I suppose, but I'd rather have a real shawarma or a souvlaki.  Koob has flat skewers of meat that they roast fresh as they make your wrap. All the sauces and salsas are house-made. Sounds like it should be good, but to me, the flavour isn't there. The meat is thin and a bit bland, and the toppings (except the fresh veggies of course) all seem to taste mostly like red wine vinegar."}
{"text":"Really tasty. Can't speak for the processed meat as I only ever get the veggie, but the toppings are fresh and staff are great. The veggie kebab has a ton of flavor-something gingery and delicious in there. At any rate give them a try. Solid people making great fast food. They even offer a student discount!"}
{"text":"Simply Addictive. Great food. Try their signature sauces! Platters and lamb Kabobs are the best"}
{"text":"I've had lunch here regularly for the last month or so (since it opened) and it's always delicious. I love that it's something a bit healthier than my normal greasy burger, everything is made fresh and they are generous with the toppings! Yay for more than two measly bits of green pepper!   I'm a bit boring, I always get the same thing, but it's so good I can't help myself. The chicken is flavorful and doesn't get dried out. The veggies are fresh, and the sauces, oh my. I wasn't sure which sauce to try, and the gentleman behind the counter suggested combining two.   It was what dreams are made of. Thank you, kind sir.   The fries are very tasty, and not greasy at all. I like that they start them when you order. nicely salted, and a good compliment to the kabobs.  Now let's get to the dessert.   They have a selection of cream rolls that are your average \"Twinkie\" type creation. I've tried the chocolate and cappuccino flavors, and they are divine. Fluffy cake with layers of light cream, they are so so good. I feel like I can't even do them justice with words.   The staff is also amazing. Very friendly and super helpful on what flavors go together, which is nice because when I'm hungry I need help. ;)"}
{"text":"We had a lunch catered by Koob today. I have to say I am impressed. The koobwiches were super tasty -  both the chicken and the beef I tried. Lots of great flavorful and interesting ingredients. Loved the corn salsa that was on the chicken one - added a nice bit of sweet and tart at the same time  They also had their little dessert rolls too...four flavours of heavenly fluffy spongy light goodness. I had the cappuccino one and it had just the right amount of coffee kick to make me happy. My colleague had the pistachio. He said it was mild and quite tasty too. The guys serving up our meal were very accommodating and friendly too -  always a bonus. The explained what was in the wraps they had made us and clearly were proud of the product they serve.  I look forward to checking them out again."}
{"text":"While the food here is good and has me going back time and time again, the training could be better for the staff. I may just be a unlucky case and was the first customer for one employee (I can see that the manager was giving her instructions like it was her first wrap). Basically, the amount of toppings was very small. To give you an example, when I said yes to spinach, she put about four leaves on. I had to ask for additional toppings and in the end, the Koobwich is about 60% of what I would regularly get. It was kind of sad to see the end with just the meat and basically nothing. I don't blame the maker as she was not given much to go on. I do hope the quality improves as I go here almost weekly."}
{"text":"Fresh but there something with that meat? Processed and we felt sick after MSG maybe? No parking No private place to eat more of a take out or quick lunch but I will never do either much better Kabob's in Calgary"}
{"text":"Wow, I am disappointed in myself for not trying this place sooner. The food is great and the staff is super friendly. Stop by anytime and get yourself a koob, you'll be glad you did."}
{"text":"Reasonable price for delicious food! I love Koobideh and I loved their food... Will recommend it to my friends who come to Calgary!"}
{"text":"KOOB, thanks for warning me about your hot sauce, the one named \"secret weapon\", because it taught me a valuable lesson on LISTENING. Seriously when I asked more of it on my wrap I didn't realize I would be consuming the formula that would turn me into THE HUMAN TORCH (copyright Marvel)  I stumbled here after a day of wandering around for a snack on a summer night. I didn't quite know what I wanted that night and I passed by 2 falafel places, a tubby dog, 3 pizza places, and a burger joint, which were all great places. Seriously, that's 100 Yelp stars combined.  Until curiousity led me into KOOB. Their signs had charming names for their kabob combinations, but I decided on their classic Koob w/ chicken. The fixins were fresh and had the right proportion. But don't make the mistake of assuming a Koob as a snack wrap, no I had myself a broadsword of a meal in my hands!  Despite dousing it in evil, the Persian style kabob wrap was delicious, the chicken was juicy and well spiced and the wrap was crispy but held on it's own. Another aspect I often overlooked in my past wrap reviews was the way it's packaged. My Koob wrap was convinient and I don't know what NASA-level wizardry they deployed, but it was consistently juicy even to the last piece, where most wraps tend to fail because you end up with a soggy tissue doused in sweet/garlic/hummus...gross  Anyways to continue my story. By the time I finished my wrap and was sweating like a madman, I was 10 blocks away from the restaurant so I spent most of the ride home cursing the sky. But I'm glad I'm writing this review now because I definitely eyed another bottle of sauce labelled \"pomegranate\", also I really want to get their lamb.  Yelp's 30 Day Challenge 2012 - 12/30"}
{"text":"beef kabob was good.  Very awesome traditional persian way of making it, at a reasonable price, and very clean storefront when i was there in august."}
{"text":"Fresh food in a clean and friendly environment. Every sandwich is an original created by you.  The pleasant staff are happy to offer samples or suggestions.   It is the perfect \"fast food\" for the health conscious.  You will be planning your next visit before you are done."}
{"text":"Amazing kebabs, fresh homemade sauces and fresh ingredients..... Love this place and recommend it to all my friends."}
{"text":"Delicious and Fast, i have had all the different kabobs, and loved all. The toppings and sauces are all so flavourful and tasty, i try a different combination every time i go. Nice to change it up. I always combo it up, so i get a drink and fries, one thing i personally am very happy about is that they serve Gingerale in the fountain sodas, that makes my day everytime, love Canada Dry Ginger Ale. and I LOVE KOOB The Kabob Factory."}
{"text":"All of the prevous reviewers were spot on in raving about this place. I went by today at about 11AM and had the lamb sandwich with the pomegranate sauce, which went great with the lamb.  They have to many sauces for me to mention in this review . Their toppings are fresh and delicious, and they will let you try them before you place your order. They then pile the toppings on so much that you wonder if you will be able to have the thing rolled up so you can eat it. They simply do not cut any corners in making a great stuffed pita sandwich. My friend had the Stampeder with the extra skewer of meat. We both thought the meat was perfectly cooked, seasoned and so very tender. I have to mention that they finish it off; using a panini press to heat up the pita and to give the sandwich its final finishing touch. I think it is always nice to be served by people that enjoy making their product the best they can for you, and these people do that in spades!"}
{"text":"I have been going here since nearly day one.  I live very close and frequent it at least once every 2-3 weeks.  I have maybe had only one wrap that wasn't REALLY amazing... but with the amount of times I have been there... that is to be expected.  I am a picky eater, and I never get tomatoes on ANYTHING, but for some reason... the ingredients always look SO fresh and delicious that I get them on my Koob when I go there.  I would definitely suggest checking it out :)"}
{"text":"When I lived in Australia I'd go out for a big ol' night on the town and then hit up the local kebab place (they pronounce it ke-bab not ke-bob, crazy Aussies right?) for some hangover prevention action.  I must have had millions of kebab's during my time in Australia.  Sadly, upon returning to my home and native land I was unable to find a suitable kebab place to prevent those pesky hangovers.  UNTIL NOW.  Ok ok, I visited at lunch and was admittedly sober at the time...but one bite into the grilled meltiness transported me back to Brisbane at 2.30am when I was 25.    But, maybe you're not looking for a magical teleporting experience to Australia.  Maybe you're just looking for a solid lunch option at a reasonable price.  Maybe you want to go to a place and receive a modicum of cheerful service along with your food.    Well friends, if any of the above apply to you, then you'd be well advised to mosey into Koob and try out the food.  I had exactly zero idea what to order so I asked the guy for his advice.  He knew I was a Koob Noob, so he made me the most amazing combo of their veggies, sauces, and meat.  The combo also came with fries which were a little too tasty...I definitely over-indulged!  Bottom line: Incredible value and awesome service from great guys.  Go!"}
{"text":"This place is amazing.  Where do I begin?  I'll start from when we first arrived.  We were greeted to an inviting front counter, clean, bright and being a grill it didn't smell like it (great for people with asthma).  Another thing, the people that work there are super friendly.  It was our first time there and we didn't know what to get and we were given many helpful suggestions.  I ordered the special, the Stampeder with extra beef.  Two beef skewers, grilled onions, green peppers, special sauce, cheese, etc.  You can get your kabob in either a wrap or with salad.  I opted for the wrap and fries.  The beef was so tender, juicy and spiced to perfection.  I recommend the beef on your first visit.  They do have limited tables where you can enjoy your food there but no chairs.  That's fine though as most people that go here take stuff to go or are in a rush.  It's rare to see a place that hits perfect 10's in all aspects from the food, the atmosphere and the service.  Another plus, you can get an average meal for under $10.  Where else can you find quality at that price these days?  This was my first visit but it won't be my last.  I'm planning on being a regular."}
{"text":"Delicious shawarmas!! I loved the raspberry spicy sauce and all ingredients they put on the wrap!!.. Also, the beef was great!.. Very tasty!!.. The service was friendly and very fast. In addition I think it was inexpensive. The location is convenient as well.. In the 4th street!!... I do not recommend the place to eat there as is very small.. But if I want to order to go I would definitely go back there!!"}
