{"text":"Priced reasonably and super fast take-out service.  I've orderd the bulgoki... kamja-tang and kal-bi all were reasonable. Portions sizes are relatively good. The lack of seating area means you may have to either wait or go not at rush hours times, etc. Good customer service, but typically koreans restarants are good with customer service.   I agree with Carmen, but not Jessica since the pork bone soup tasted pretty good for takeout. However I havent had it in too many restaurants."}
{"text":"They have recently changed the name to \"our\" but it's the same restaurant. The place is cozy with around 10 tables.   We came as a group of 3 and each ordered a rice dish. From personal observation, we were probably the only table that didn't order the infamous pork bone soup.   Their chicken bibimbap was rather tasteless. Would not recommend. We also ordered the sizzling chicken plate & squid rice pot. The chicken plate was incredibly greasy, with only a few pieces of chicken. Only the squid rice pot tasted decent."}
{"text":"Food here is good, not as salty as the other franchise that used to be in Scarborough. Service is always friendly and quick as well. Although the place doesn't look very appealing from the outside, the restaurant is clean and well taken care of."}
{"text":"It's my first time at an owl place. I went with my family. Mom and I got the pork bone soup. I think my sister liked that one, too. It's actually quite good. But the banchan is definitely lacking since it was 3 plates of banchan. I also got the tangsuyuk. BIG MISTAKE. I still can't believe that I got that dish, and wondered if it was my fault or not, cuz I thought it'd actually be good. But the meat was so chewy that it was uneatable, and most of it was just dough. Not the good kind of dough, since it was chewy and uneatable and didn't do any justice. It doesn't have flavours and was only covered by sweet sauce. I think it came with apple pieces. This abomination should be quarantined away from the menu selection. Dad got the kalguksu. It doesn't taste anything special at all. Pajeon was not good and I ate two small pieces and gave it to dad. The servers are hostile and seemed like they were expecting spies from North Korea. They were humming to that one T-ara song that was playing. I don't think it was the ones I liked, but that doesn't contribute to the 1 star, of course. Dad talked to one of the servers. He asked for a slip of paper and the server was like \"why\". Mind you, I came here with my whole family, not with 1 or 2 friends. Bich was like \"why\" lol. He still bothered to give tips before we left. He always tips. I might come back for a bowl of kamjatang, but definitely not with my family."}
{"text":"I've been to The Owl of Minerva before, but the First Markham Place location. I wasn't very pleased. Terrible service and the food pretty much sucked.  This one as a bit more impressive. The food was pretty great and tasty, a lotttt better than the First Markham location. But the service still sucked. Everytime I come into Owl of Minerva, I always feel like I'm bothering the servers in some way. Not very welcoming.  It wasn't too packed when I went, but there were a few people.   It's a clean, cute space with a tv playing Kpop. Everything is reasonably priced, no complaints.   In comparison to a lot of other Korean restaurants in the area, the lack of banchan is laughable. 3 dishes, that's it. And the kimchi isn't even that great!  All in all, unless I was super desperate for Korean food and was stuck in the Midland/Finch area, I'd go here. But if given the choice, there's better options."}
{"text":"The ingredient ratio here is quite interesting. 3:7 chicken to onion, 2:7 squid to onion and zucchini.  Tasted bland and the sauce were very watered down. However I like that they have option for getting the pancakes and rice cake in smaller portion rather than the whole serving.  I've been here a couple times before since it is the closest Korean restaurant to me. Today i called to order take out meal. For some reason the person who picked up the call had no idea what sir fried chicken was, kept telling me they don't have it, only the yonge location has fried chicken. Stir fried chicken not deep fried chicken, the one that comes on a sizzling plate with rice! She still had no clue what I was talking about, when I was about to hung up she asked if I was looking for the spicy chicken=_= Jesus help me... Aren't most of their dishes spicy? I read the name off the menu on their site... After I got there, I looked for the menu and pointed the dish out to show her, and she told me people usually order by number. Seriously, why is there a name on the menu, might as well name everything with number. I... forget about it. I would come back, but only if I am desperately wanting some Korean food and am too lazy to go to yonge/finch."}
{"text":"This is one of my favourite spots for pork bone soup outside of yonge finch area. It's also the only item I get here since the time I tried their fried rice which was really small/tasteless/not fresh. The pork bone soup has a lot of meat that falls off the bone, a piece of well cooked potato, all in a rich savoury broth thats not spicy and its hot until you reach the bottom. It also comes with a lot of sides such as kimchi, radish, vinegar cucumber, and an unique tofu. The waitresses even offer to refill them without asking."}
{"text":"This is my second time coming, it's pretty decent when you're craving for Korean Food.   I ordered the Spicy DdeokBogGi. It was a bit too salty for me, so I had to scrap most of the sauce off. The spice level was good.   The side dishes were average. I wouldn't expect too much.  The service that day was pretty good and fast (mind you, there were only about three other tables. I went during the slow hours). The lady was pretty nice and has a very warm smile.   I'll probably come back here again, I just need to remember to tell them to put less salt."}
{"text":"Did not enjoy it here. Prices were a bit higher than other Korean places and food was below par. Service was also not really there. Would not recommend this place especially since there are so many other Korean restaurants to choose from."}
{"text":"I have only tried the Kimbap, which was delicious. It was not very busy when I went during the evening. You can also call ahead and order to skip the wait."}
{"text":"I've heard not-so-great about this restaurant but I actually thought it was a decent place. I don't like pork bone soup so I will not rate my experience on that - even though that is what it's known for. My dad did get the pork bone soup - he thought it was decent with a mild spicy taste. Not bad. But not as amazing as a place he used to go to.   I went with the kalbitang which is the pork ribs soup. I actually really enjoyed it and thought the meat was tender and sweet. Other places I've been to usually overlook it and it gets all tough.   Only three side dishes. But they weren't bad. Not sure if we can get free refills on them but I probably would want to know if I go again.   It's a small restaurant - I would suggest going out a little earlier to eat. We got there at 6:30 and the crowd started coming in after 7."}
{"text":"I came here with my boyfriend and a friend on a quiet Wednesday afternoon. Every single table had a dirty plate on it. Every single one. There was only one other small group in the restaurant at the time we went, but we stood at the doorway for 10 minutes and no one came to greet us, or even clean the tables. We decided not to leave and instead waited and finally got seated. I got a chicken stirfry type dish (I forget the name) and there was hardly any chicken at all, the same could be said about their pork version of the same dish. The only thing I liked was the ddeokbokki that we ordered to share.  Will not be returning."}
{"text":"I decided to drop by for a quick meal since I live in the area and to see if it was any different from the other Owl of Minervas I have tried around the city.  I ordered the Bulgogi DupBap ($7.99) which is essentially bulgogi with vegetables on rice with a fried egg. The dish was pretty good, the bulgogi was nicely marinated and sweet but not too sweet and it was a decent quality of meat that wasn't dry. The portion size was also decent.  The one thing I don't like much about the Owl of Minerva chain is the minimal amount of banchan you get. I only received 3 banchan dishes which is normal for this chain and they were not bad but a little bit on the salty side.  All in all, it's definitely a welcome addition to the area since there are no real Korean restaurants in that surrounding area from what I know. I'll definitely go back to try the other dishes on their menu."}
{"text":"Evening of emptiness in thy Tummy growls concerns to the Cerebral Cortex. Near Brainlessness, w e a k signals were transferred in code...  P B     s  P     b S      p      B        s     p         b s  I blank out to leave my own vehicle on Hunger auto-pilot. I woke to a Black bubbling cauldron of Red soup. ... Owl of Minerva's Pork Bone Soup[$7.99].  I sat alone at the lone table left and it so happens Three empty seats come with. A solo Female strides in and I instantly sense a request of sorts from staff.  Diagonally across a -=Stranger=- with common Korean Food needs.  The understanding of -=Leverages=- will lead to Bone cleanliness. Long spoons act as effective shucking silverware but beware. Your range of arm motion becomes much more widen.  In my short time there of Gamjatang ravaging. Bang. Bang. -=Cartpushing=- lady bangs. All Table corners in her path of sight. Possibly a couple elbows as well. Keep arms inside at all times."}
{"text":"Quite disappointed with the porkbone soup here. It's lacking ingredients and flavour. The pork meat itself has no taste absorbed into it. The lady working here was nice but the food is bleh. Will find a better korean place to eat at."}
{"text":"I am never coming back here again!  I am very disappointed with my dinning experience here. I came here on a Thursday night with a group of friends for a late dinner after badminton. For one thing, walking in to this place there were messy unclean tables everywhere.  This place is a small place. The menu is a standard Owl menu,  and I've been to a few different locations. I ordered a Pork Bowl soup and my boyfriend ordered the beef bogoui. My dish was satisfactory,  I have to say I definitely had better pork bowl soup elsewhere. The dish my boyfriend got was a an item that almost all korean restaurant would have.  But his dish was just bad! The beef was super tough and the sauce...  I don't think there were any. We told the korean lady working there that the dish was not good and he wasn't able to eat it.  Her response was rude (benefit of the doubt maybe her English wasn't that good) ... and basically said to us, \"so what\" ...  most servers anywhere would of offered to take the dish away and either provide a fresh one or get you to pick another item on the menu. In the end,  they did give my boyfriend another dish,  but I am not comimg back here fpr sure.  Not good experience at all!very disappointed."}
{"text":"Had the Kim Chi fried rice, pretty good. The sides given were also decent in comparison to other Korean restos in the area. Server even asked if we would like more sides. Decent food for a decent price!"}
{"text":"Well the first time I went it was ok, nothing amazing but nothing too awful.   This time we went back we didn't get a chance to eat the food and we left.  So, long story short, my mother and I were in the restaurant, we sat by the window. My mother accidentally brushed her jacket against the window blinds and it bounced back up. The waitress came over and asked us if we did that, which we replied that it was an accident and sorry.  In a very short temper manner she grabbed a chair, climbed on it and draw the blinds back down and than very RUDELY SLAMMED her chair down, as if to protest! I guess that's a new way to serve her new customer...cuz we left immediately and won't be returning."}
{"text":"This was my second time going to this location. Their pork bone soup was good, generous amount of meat but felt like too much msg. Overall good quality is good. Their customer service is not the best ."}
{"text":"I really like Korean food and this owl is one closest to me. I've noticed their quality went down, and prices been going up ever since their renovation. I've been here quite a few times before, and once after. Their pork bone soup used to be solid, but now it is mediocre and side dishes are not as good."}
{"text":"The Owl of Minerva is my favorite Korean Restaurant in Toronto.  I would definitely recommend the Kamja Tang, but everything I've tried is good.  It's just what you expect from a Korean place:  good food, plenty of side dishes, decent service, and constant K-pop TV.  Prices are fair and service is quick.  Park in back!"}
{"text":"Decent Korean restaurant. This isn't the best korean restaurant you'll ever eat at, but if you're hungry and in the area give this place a try.   My friends and I usually eat here since it's conveniently located down the street from our favourite bubble tea spot. The menu is on the smaller side, as this restaurant sticks to selling staple items (bibimbap, kimchi fried rice, kimchi pancake, etc.)  I'd recommend the kimchi fried rice with extra cheese (yes it's worth the extra $1-2) or the chicken cutlet. Of course if you want to be safe you can always just stick to bibimbap -- but imo the best item they have on the menu is the kimchi fried rice.  The staff is very friendly and thankfully this place takes debit card without charging extra. My only complaint is that they only give 3-4 sidedishes (compared to most restaurants that give 6 sidedishes)"}
{"text":"Used to be the Owl of Minerva - average food for average prices. Probably hovering around $10 - $15 depending on what you get though I hear the prices have gone up.   The pork bone soup is probably the best thing on the menu and tastes pretty standard. The meat is quite tender and easy to eat off the bone. The soup isn't spicy. Expect to have a really dry mouth afterwards though, no matter what you get - but especially the soup with the mushrooms and japchae! Looks can be deceiving and it looks like one of the lightest things on the menu but it is one of the saltiest dishes I've ever tasted.   Not too much seating inside and you might have to wait a little bit on weekends. Also, the takeout boxes for their soup-based dishes are really flimsy and poorly designed. It ends up being top heavy when they put all the bones inside the container because the mouth of the container is wider than the base. The bones also don't actually fit in the base because they're so large so they end up at the top. The lids also come off very easily. Other places like Nak Won are smart and put your pork bone soup in a plastic bag, tie it off, and then put it in the container.  I'm going into a lot of detail here because a take out order of pork bone soup from here was a key factor in my first and only car accident to date. Made a turn, container falls over spilling soup all over the passenger seat and I ended up crashing into a sign. Be careful and don't be me!  But back to the food - if you're really craving Korean and this place is nearby you can come here, but don't expect anything amazing."}
{"text":"There are not too many good Korean restaurants in the area where I live so I'm glad that this one is here. I had another craving for pork bone soup. I seem to get these cravings at least once a month. $8.99 for pork bone soup is pretty standard price all around. The soup was not overly salty but I thought it needed a bit more heat in terms of spiciness. There was a good serving of fall off the bone meat. Also got a small dokboki for $6.99. It was pretty decent but nothing special to point out.   One thing I don't like about The Owl of Minerva is the side dishes. Although they do taste good I just wish there were more options. The side dishes you get here are radish, kimchii and pickled cucumber. When compared to other places like Nak won who serve 8 side dishes this place just falls short."}
{"text":"Came here twice, both times didn't give me an impressive feeling, the food are just standard, and my friend didn't really like it too... not coming back"}
{"text":"Iirc they changed their name to save on franchising fees, and they have the worst service out of all the owls I have ever been to! Stay away, food quality going down as the prices increase. They use a load of MSG and you'll be super thirsty afterwards. I would not recommend this location to anyone"}
{"text":"Decided to give this place a try as it is conveniently located at the hub of Asian food in Scarborough. I'm a pretty big fan of authentic Korean food so Owl was a must try for me as I've seen many locations throughout the GTA. We came a little before closing and there were still quite a few tables occupied. We ordered 2 dishes, pork bulgogi and pork bone soup. This place to our surprise doesn't give many side dishes with the orders, just the typical kimchi and cucumbers so that was meh as I've been to places where they give 6-7 different kinds of side dishes to try. Both the pork bone soup and bulgogi were super flavourful and authentic. However, the bulgogi was a tad bit on the oily side. The prices are average - about $10 per dish. However, I feel like I overpaid about $1-2 for their franchise more so than the food quality, service or value."}
{"text":"Came here a while ago and I dislike their service. It took them a while to even get to pour my tea and before I even left the waitress even ask me to give her more tips."}
{"text":"The Owl of Minerva is really popping up everywhere! I have been to most of the time and this Scarborough location is definitely one of the better ones!!  Food I found all of them are quite similar in quality, with an identical menu and same pricing. The reason this Owl stands out to be the best because of the super friendly waitresses.   My Kimchi JJigae (8.99) which I request extra spicy came out boiling hot! Plenty of fatty pork inside and with tofu, glass noodles and of course kimchi!!  Now they have a Grand Opening Special till end of August $5.99 for Pork Bone Soup. Definitely take advantage of this special if you are in the area."}
{"text":"Best part side dish radish and cucumbers. Big bambap and pork bone soup is meh. The service is acceptable... Not really a good flavour compare to other places I've tried. Disappointed. The prices were a bit pricey too. The reputation is way to hyped, the food is about mediocre."}
