{"text":"I want to like Krave more than I do.  The space is great for someone like me who sometimes likes to work in shared space, and I find the communal table has a quiet and considerate spirit.  People are there to work.  And there's a patio that gets afternoon sun; unfortunately, it looks over a parking lot, but at least there's a mural at the far end to break up all that beautiful concrete.  

The staff is friendly.  No knock on them for their customer interaction.  But... But...

Two stars - because The Coffee.  Somehow every type of coffee I've had there - I'm partial to espressos, cortados, and americanos - has only ever been adequate, and some of them were a lukewarm mess - not to mention the most expensive I've experienced on this strip of St Clair West.  All the friendliness in the world can't make up for the incompetence of the person pulling your coffee.  The coffee beans there are top-notch so I assume the staff is where it's gone wrong.  When I can't finish a cortado - too milky, muddy, more like Tim Horton's coffee than a delicious espresso-based drink - then it's time to move on."}
{"text":"Thank god Krave arrived on the St. Clair scene! The neighbourhood was sorely missing a beautiful, chic, hipster-but-not-obnoxious coffee shop with killer coffee and great service. Their patio is super sunny with a nice roof for some shade, and the wifi is fast. The friendly owner will learn your name ASAP and your order. A must visit!"}
{"text":"really needed a proper coffee house on the street, so glad this place opened
great coffee. caps, americano etc
great patio for street watching and free wifi
maybe a little bit higher priced, but very much worth it. 
good for a saturday morning walk to the farmers market"}
{"text":"I have only been to krave coffee 4 times. It is right around the corner from me and it is a cute quaint little spot. 
The costumer service is what is lacking most. I have worked 7 years in the hospitality industry and have noticed that what you put out comes back. If you offer smiles, you will receive them 9 times out of 10. I have thanked the barista and said how delicious the chai latte made was only to get dirty looks and attitude back. 
It is also frustrating when ordering to have the person taking your order completely avoid eye contact. 
This avoiding looking at the customer has lead to them hearing the wrong order and lack of paying attention. It also leaves no room to smile or be friendly. You are after all in costumer service and dealing with humans on a regular basis. 
I hope it has just been fluke and I will try again, but I have to say feeling like your annoying someone when they take your order does not make you want to go back."}
{"text":"Really nice space if you are in the neighborhood and want to chill. With a useable Internet and enough tables, it's also a good place to work. I'm not a big coffee drinker but I'd say the quality is okay, a little overpriced. The place can be a little bit busy and noisy at times. They have a cool little side patio in the summer."}
{"text":"Coffee and tea are excellent, service is quick and friendly but the baked goods are totally stale and not worth buying. I got an almond croissant today and not one bite was even remotely soft or fresh."}
{"text":"There cortado is more expensive then there cappuccino... wish this place new what was up cuz the area could use a solid coffee joint. Pass on this one"}
{"text":"Good staff, and very nice teas and the chai latté is satisfying. Not too sweet, and not just a tea bag plus frothy milk. There is a really affable barista with a beard who is warm and pleasant. Frankly, I've experienced no attitude from anyone who works there, which is refreshing.

Sadly, there are some customers who have no complex about making the community table their office. However, I don't hold the staff responsible for that. Just, if you're one of those people, stop doing it? The vibe is super-relaxed and friendly, but I really don't need to know about your mergers/wedding planning business, or whatever. Manners!

The place is developing nicely, and I noticed that they are putting art up on the walls -- it warms the place up."}
{"text":"From outside, I had not been aware of Krave Coffee was a coffee shop. The entrance did not look like a coffee shop entrance. Inside was pretty large and they had nice outdoor seats. It was comfortable and many people were using the shop for their work space. Some people enjoyed chatting and had good time. There were many artists or writer type customers. The place was trendy. They served good quality coffee and baked goods. They served varieties of trendy latte or ice drinks. It was a relaxing place even though personally I did not feel relaxed."}
{"text":"The barista knows the struggle of soy lattes, and did his best to make it as nice as regular dairy lattes. The cookies and pasties here are TO DIE FOR. Not made in-house but source from local bake shops that are killing it. Lots of great space and they openly offer free Wi-Fi with a big sign with their password. You don't have to feel bad about asking for the password here."}
{"text":"I was really pleased to see Krave make their mark in the neighbourhood  Taking over from the ol Vietnamese Soup place would be a challenge as it was a landmark in the hood. Coffee is stellar (ordered in the past: cappuccino /Lattes )and liking the way the back part of the shop is set up for adhoc co-working. Had a few of the baked goods and no complaints on that side of the business. 

Its part of the up and coming scene here on St. Clair West. No issues with service other than to say I think it takes a couple of times for them to warm up to you - regulars are regulars for a reason. Warm and inviting place and see lot of folks right across the 512."}
{"text":"The St Clair West neighbourhood is flush with places to get a good coffee, but Krave sticks out at top from the bunch. 

Their Americano is excellent, and the best on the strip. 

Also, excellent patio on the side."}
{"text":"Really cute coffee shop on the eastern end of St.Clair West! Went there after a nice walk and enjoyed my experiences friendly service, delicious mocha. I need to go back."}
{"text":"St Clair has needed a place like this for a long time, it's amazing to me that it's taken so long. Aside from an annoying number of laptops owned by people who spend $4 on coffee to take up a table for an hour or two, otherwise it is low key and the staff have a good vibe with a focus on well made coffee.

My only complaint; there are at least two places on the same strip offering some seriously top notch baked goods that they make themselves, some of the best of their kind in the city in each case. Admittedly their focus is the baked goods, the coffee not so much, but these places still manage to almost satisfy entirely on both fronts.

Krave on the other hand seems to be offering baked goods from the same bakery that half a dozen places I have been to do. These places offer boring (and barely edible) muffins, unappealing scones, and very average croissants, all for extortionate prices (mind you, the price is not necessarily the fault of the proprietors). Correct me if I am wrong but go to Dark Horse, Walllace, or the Common, and you seem to get the exact same baked product, no? It isn't BAD necessarily (I am being generous here, some IS very bad), but it is expensive and definitely underwhelming. 

I GET IT, Krave sells Coffee (and for the price of a coffee rents table space to people who can't/won't do their work at home), as do all the others I lump into the same category. Not everyone can make their own product, yet I wish these places could appreciate they are cheapening their own brand by going this route. I guess my high water mark is Capitol, who although primarily a coffee place at least try by baking something fresh and tasty in-house.

In Hillcrest this juxtaposition is highlighted by a couple of outstandingly good outliers on the foodie front. As someone who lives nearby I find myself confused every time I go out; do I go for a good coffee, or do I go out for a snack? I wish that I could get both in the same cafe. 

So, for now I offer 3 stars for what they do offer, here's hoping Krave finds a tastier groove and offers something worth another star (or two). I wish them the best and will continue to support the business in the meantime, though admittedly on a rotation basis."}
{"text":"Good coffee, friendly attentive staff and great seating. An example for some of the other coffee/food places in the area should aspire to reach."}
{"text":"Great location. Loved the decor inside. Not too crowded, mostly people working on their laptops. They also have a deck outside which overlooks a parking lot. Coffee was good - got a latte. I'm looking to going back."}
{"text":"A beautiful, bright and open concept space, complete with a patio overlooking St Clair West.

The espresso was fine, but tasted slightly burnt for my taste. Krave did just open so let's give them some time to perfect their brew. The venue itself is worth visiting - its breathtakingly modern and refreshing compared to the otherwise regular-looking cafes on this strip.

Free WIFI!"}
{"text":"Great local coffee shop, friendly service and very good coffee - in my opinion the best in the area."}
{"text":"Krave is by far my favorite coffee shop in the area. Great coffee, super cute decor, friendly staff, free wifi, and a ton of tables to work at. A great place to go chill!"}
{"text":"There is plenty of good...but there is plenty of better...but I feel bad for saying that.

I just moved into a beautiful, new apartment and wanted to check out the local coffee shops. I live near Bathurst and St. Clair for all you stalkers out there. More importantly so you get an idea of how many coffee chains are in the area and how it is rare to find a more local coffee shop. Don't get me wrong, I love Starbucks and Second Cup. But I love supporting local as well.

My roommate suggested I try Krave out. I'd suggest you check it out too so don't take my 3/5 as a complete, \"don't do it,' warning.

Atmosphere/Environment - Smart. It's the first time I've seen, or noticed that a coffee shop has a section with music and one without. Genius! That way if you need to study, you have a somewhat quicker place. You still hear Michael Jackson, which isn't a bad thing may the King of Pop rest in peace. But it is quieter. I can't tell you how often I've walked into a coffee shop where the employees don't care how loud the music is for the customers. Also, the place has a nice, wood feel to it. It's cozy but still with plenty of tables to work.

WiFi - Dodgy. And this is why I'm not writing my review of this place in there right now, but at a Starbucks down the street. I'm a multimedia expert so I did try all eleven things I could do to see if it was my computer...which is top of the line. So I knew it was theirs and the Barista told me people have said they had problems from time to time. They were worried about turning it off and cutting everyone else off of internet access temporarily. 

Notice to all coffee shops - If you don't have reliable wifi, you lose customers. That's it. And if you think it's me and not you...read above. But also, if Starbucks can get a secure connection, so can you. Please don't go cheap on your wifi. These days it is a make or break for a coffee shop.

Drinks - I only ordered one, which was a badly created London Fog. BUT my roommate loves their coffee. So try it when you stop by. For the London Fog, they didn't keep the bags in the cup. More or less just poured hot water over the bags and took them out. Needless-to-say I am drinking more of it at Starbucks right now to get my caffeine boost.

Food - N/A Didn't try it but they had some great, unique options I haven't seen before. If I'm dragged here in the future, I will try their special Oreo cookies.

Washrooms - I was taught a long time ago that if you want to know how clean the staff is with handling your food and drinks, check out the cleanliness of the washrooms. These are very, very clean. So big props.

Customer Service - Depending who you get, it could be very friendly or a bit stereotypical, blank-faced hipster. No offense to my hipster..no wait, some offense. Why is everything ironic? lol. jk.

Conclusion:

Try this place once like I did, but don't trust the internet. The place doesn't have the room for lounge and socialize with sit down and work. It's more a sit down and work place. There are seats and chairs, but it feels a bit 'workforce' atmosphere. Check it out and you'll see what I mean. But it still somehow manages to be cozy."}
{"text":"Love this place. Make the best Americano ever. Service is always amazing!!!"}
{"text":"Lovely coffee bar. Reliably good with a great west facing patio. Great lattes and have never been disappointed with the coffee or the service."}
{"text":"A great coffee shop with a decent selection of loose leaf teas. They even have roobios if you are pregnant and looking to avoid caffeine. This is a cute neighbourhood place where lots of people go to camp out at the tables and work. Staff is very friendly and make you feel very welcome."}
{"text":"I really hate to do this to a new small business, but in a day and age of more and more competition in the coffee shop industry...you need to up your game....Krave has not done this. 

I really really wanted to like this place. It's literally 10 seconds from where I live. It looks cute. Amazing patio. A new business to the Hillcrest community...what's not to like?!? 

My partner and I went in maybe a week after they opened looking for an iced coffee because it was sweltering outside. We thought the space was really cute, great decor, not busy but a couple people sitting enjoying their coffee. There was 1 girl working the counter and was making a drink. There was no client standing around so I'm not sure who it was even for..as all other clients had drinks. We stood and mulled over the menu...looking at the cookies and pastries..this went on for about a minute. She never said hi or even made eye contact. Then another client came in and went right up to her and said hi..they knew each other it seemed and started to chat. This went in for a minute or 2. Finally I said \"excuse me can we order a drink\"? She ignored us!!! Fucking ignored us!!! Appalled we just left. Again, she never even looked at us. Once out side , in all seriousness, I asked my partner if we died and hadn't noticed?!? 

As angry as I was I chalked it up to being its first week and perhaps the girl didn't have client service experience. I gave it another shot about 3 weeks later. This time it was busy, I stood in line for about 5-8 mins while the same girl chatted away with the couple ordering in front of me. Again, never made eye contact, no one said \"we will be right with you\", just chatted away like they were the only ones there. Even the guy making the drinks never acknowledged  me. FINALLY I got to order a drink, and as I was ordering, in a very standard voice tone and volume she  interrupted with a \"what? What do you want\"?? with total attitude. I placed my order again and she didn't even tell me a price just asked how I was paying. I answered with debit. \"Cash only, debits out\". At not one time before I placed the order was this message relayed. There was no signage. And I have now wasted 15 minutes for a freakin latte?!? I said nothing and left. She never apologized. 

Today, a beautiful Fall day, perfect for a walk with my dog and a nice cup of coffee...I thought why the hell..it's close..I need coffee..what are the chances it will be that bad. My mistake here was thinking that thought. It's like I willed this experience to happen. 

I walk in..one guy is behind the counter making a drink chatting with a client and there is one girl in front of me waiting at cash. We stand there for seriously 3-5 mins again not being acknowledged. Like how frigging hard is it to say \"be right with you\"? I can respect you're working alone if you respect your paying clients. Finally the same rude girl that works there saunters through the door and asked the client in front of me if she needs help. The lady had drink already but said it was too sweet..\"so what? You want another one\" the girl says to her. No , \"I'm sorry can we get you something else\"?  Just complete attitude and full on rudeness. She tells her she will bring it out to her. Now, before I can even open my mouth..and again this girl STILL hasn't made eye contact...looks at the guy past me that was waiting for his drink and asks if he liked the chia he tried yesterday...he says yes and that's what he is getting...then proceeds to order some cookies and she fucking starts getting them for him!!!! Seriously?!? You are seriously going to help the guy that has already made an order but now wants to add on?!? The right thing to do here is say \"I will get those for you once I help this client\". Why should I be surprised. I then here the guy that works there tell her debit is down! WTF! I made a loud enough \"are you kidding me\"?!? Statement that the other client looked at me..but the employees just kept on working. Needless to say, I walked out and took my business to the incredibly delicious and friendly and helpful Mabel's across the street. 

Now, I may just seen like a grumpy person with super high expectations. I'm really not. I just want decent client service and to be treated like I exist. You're selling coffee...this should not be hard. I have been treated better at 7/11. Really. I have. You are trying to start a new business. Gain clientele. This is not a great start Krave. 

I hope for their sake they get their shit together because there are MANY options on this street for people to take their business to. Hell, the Starbucks down the road is better. Its sad to say I would rather support Starbucks then a local new business."}
{"text":"Currently my favorite coffee shop in Toronto.  Service is always friendly and prompt.  They have tons of seating, mostly outside on their cute wood patio.  I usually get an unflavored latte and they're always delicious.  Great espresso.  Their baked goods look sinfully delicious but I have not yet indulged.  It's certainly on my to-do list!"}
{"text":"Best coffee on St Clair. Super friendly staff, great coffee supplied by Sam James. Cookie and scone selection are really tasty. Also the soup from Krave juice is vegan and delicious, they ad a dollop of cashew butter to it! So good! Go here!"}
{"text":"The coffee is not great. They serve a very light roast. This paired with unexperienced baristas results in an overly acidic tasting coffee. However if you like the light roast trend that's taking over the toronto coffee scene, you might not mind it. Big selection of baked goods - I've only had the croissants and unfortunately they have never been fresh (even when I got them early in the morning). When compared to the other independent coffee shops on that strip, Krave is definitely the most expensive and far from the best."}
{"text":"This is my favourite cafe in the area especially since they have a nice puppy-friendly patio."}
{"text":"Was there recently for a meeting and it was wonderful.  The patio rocked nice quite could have a good conversation without having to talk over everyone.  at that point of the day I was already highly over caffeinated and there for was graciously supplied a glass of water.  If i was local to this place it would be my go to for sure!"}
{"text":"Crazy crazy slow service. Takes over 10 minutes to make a latte. No sense of urgency or customer service here. Meh.

Lovely atmosphere and asthetic though."}
{"text":"A solid 3.5 stars ... definitely better than the average Toronto coffee place.

Along St. Clair, Krave coffee is a nice place to grab a cup of coffee.  It has a cute little patio and able clean space inside where you can find a table quite easily.  The spot is really well maintained and you don't feel any pretentious service here.  The service is friendly and quite affordable.  

We arrived on a Saturday afternoon and dying for a good hit of caffeine, Krave coffee looked like the best option.  When we walked in, we were immediately greeted with a smile and I noticed they had Sam James and Sloane tea right behind the barista... that's a very good sign.  

We quickly ordered a dirty chai latte and a simple drip black coffee.  Quick note... they only take cash or debit!!  Both drinks easily came up to $7 and wasn't so bad compared to downtown core Toronto.  The place had a lot of clean tables and if we werent heading to dinner shortly, it would have been great place to sit and relax.

My latte came quickly and hot ... the only reason I can't give this place a 4 star is the flavour.  Though the dirty chai wasn't bad... it wasn't great either.  It was a generic sweet flavour with no spice ... I was at least expecting a subtle hit of cinnamon.  I ended up getting my spice later at Pukka but was still hoping more than a generic sweet vanilla-ish latte here.

Overall, cute spot and possibly best spot to sit in on St.Clair but in terms of flavour, other Toronto spots definitely have the 4 star quality."}
{"text":"Krave Coffee has fast became my favorite little indie coffee shop in the neighborhood. Krave Coffee, how much do I adore thee, let me count the ways:

1. You serve kick-ass coffee from known, quality roasters such as Rufino, Sam James and Propeller. 
2. You have great sitting area, especially the communal \"office\" space.
3. You have consistent internet.
4. You have an amazing ambiance, with cool grooves playing.
5. Last, and most importantly, your entire staff (from management to all the baristas) are awesome!"}
{"text":"Comfy local coffee shop - Krave serves some great coffee and baked goods. Inside is a brightly lit seating area with lots of natural light with a wonderful smell of coffee and vibe from others. I had a single latte which was quite big and paired it with a blueberry scone. Latte was excellent - strong but not overly roasted with piping hot milk. Scone had a nice crust on outside while soft and butter on inside. I saw others order breakfast sandwiches as well. The place is quite busy on a Sunday morning but had great seats inside and outside. If I lived in the area, I could easily see this as a place you can grab a coffee and sit by the window reading a good book or doing work. 

Overall - awesome spot!"}
{"text":"Great spot to relax and enjoy a qualifier cup of coffee. I also dropped in on the new juice bar and was very impressed with the quality of fresh pressed juice. All in all a great spot for what ever your afternoon calls for."}
{"text":"When Krave opened up, the neighbourhood was understandable skeptical, we have many coffee chains and little independent cafes. But Krave does something different by adding a minimalistic yet still rustic and cottage-y vibe to the decor that makes it a prime place to study, write and get together. Coffee wise, amazing, I can never drink Starbucks again. The bacon and cheddar scone is a fav. Service has always been more than exceptional. St.Clair West loves you Krave!"}
