{"text":"Great little spot for some Greek food. Servers were great with catering to our needs and suggesting based on your tastes. Highly recommend the greek poutine!"}
{"text":"I was craving some Greek cuisine and having recently moved into Mimico, there wasn't many local choices. Krazzy Gyro had many good reviews on yelp and is a 12min drive away, so I thought I would grab some takeout and satisfy my craving.  *Disclaimer - I did not eat there, so my review may have increased a start or two if I did*  I ordered the chicken souvlaki dinner with an additional skewer of chicken. It came with a Greek salad, rice and 1 small slice of lemon potato. I also ordered an additional Greek Fries.  The gentleman working there (Antonio Banderas' doppleganger - that's a compliment) was extremely friendly and passionate about his work. That was a big positive. The restaurant has very modern decor and looks to have been freshly renovated and is clean!  Ok... when I brought my dinner home I kept thinking and hoping that my chicken was not over cooked. I was waiting there for at least 15 minutes for my dinner and saw that they kept flipping my chicken skewers over and over every few minutes, until they were quite charred. I didn't want to say anything while I was there (like hey guys, I think my chicken is pretty black) as I'm no cook (hence the Krazzy Gyro) and was confident that my food was in good hands.  My chicken was totally dried out. Even the watery tzatziki sauce could not save the charred taste. My slice of lemon potato was quite tender and salad was as expected. The Greek fries were another disappointment as up until recently, I've lived downtown by the waterfront, so Alexandros (one of the best fast food joints in Toronto) and Krazzy Gyro's Greek Fries does not even rank on the same scale. The fries were soggy (albeit, it was a 12 minute drive home) and they were a little frugal on the feta cheese.  Overall, my experience was not terrific. Perhaps it's a one off - based on the good reviews I've read. I'm giving it a 1/5 star based on the dried out chicken, frugality on the feta cheese on my Greek fries and potato."}
{"text":"Go there for lunch from time to time.  They only used to have the chicken and pork Gyro selection, now they have the Beef and Lamb!  All very good!  And they load the pita with meat!!! I find them much bigger than Alexandra's.  I usually order either gyro, krazy rice with choice of meat or greek salad with choice of meat!  Owner is super nice!  Never had a bad lunch!"}
{"text":"We ordered the chicken shawarma meal and the pork dish. Both meals were delicious. After the first few bites, my hubby commented that he would crave his pork dish. Apparently, it's a formulation unique to this restaurant (as per the very helpful and friendly woman who worked that day)."}
{"text":"This gem of a place is near my work and I go often. Much better than your average gyros place and prices are comparable. Portions are good and the food is fresh. The Greek Poutine will blow your mind."}
{"text":"Super Delicious, better than in Greece ! Thank you. Will definitely be back with my friends"}
{"text":"Stumbled upon this place, after seeing their specials sign from the road.  My friend and I ordered the chicken gyro combo as well as the hummus combo with chicken. Both were amazing. The chicken was moist and well seasoned and the pita bread was soft, and served warm. Probably one of the best gyros I've had. The hot sauce was amazing as well.  The dining area is a large and clean. I would definitely come back if I'm in the area again."}
{"text":"Sweet late night place for tasty food with wonderful service. I'd come here again any time!"}
{"text":"This used to be good - but now avoid it all costs. The quality of the food has declined greatly! Meat is tasteless and greasy!- everything very greasy!! Overcharged for everything! Prices expensive for terrible quality!"}
{"text":"Great food, great service, great people.  The food is great even when delivered; I got  a chicken gyro salad and the chicken was hot and veggies still crisp when it arrived. Really good."}
{"text":"Pretty small portions. Might be enough for a lightweight eater.   Greek fries was fries with feta on top....yawn"}
{"text":"Located on Dundas off the 427 and barely visible behind a gas station and auto station.  This  little gem has the best gyros in the West end.  When I entered I was surprised to see a fairly modern environment  and seating area.  I ordered the gyro combo which included a side of your choice and a drink for less than $10 taxes included.  I had the mix of pork and chicken with all the normal toppings and greek fries.  The meat was cut fresh from the spit and pita was grilled warm.  A generous amount of meat!  Greek fries were also nice and crispy with some feta and herbs.  The only thing they don't have is lamb.  I really like Louis meats and Messini's in Greek town...but in the West I give it to Krazzy Gyro."}
{"text":"Last night , was looking for a good Gyro dinner , so on the recommendation from a friend I tried this out for take out. WOW was I suprised! I had the Mixed Gyro dinner , when I got home and tasted it , I was amazed to see how much meat was in the pita bread!  So fresh and moist and spiced just right had a nice mild hot flavor.   Could not have asked for a better Greek Salad definitely not stingy with the feta and the freshness of the salad in general.   This place is worth a try if in the area. I know personally I will be returning. Gave it a 5 star rating even thought I did not eat in , but a really good dining experience ."}
{"text":"Great gyro and priced fair. Not as big as the messini gyros but definitely nice to have this place in the west end. Good service and good food. Give it a try.  I highly recommend."}
{"text":"I drive by this little place every day and always wondered what the food was like.  Today i was working late and just wanted to eat something and its tucked in behind the gas station so i filled up the car and decided to grab some takeout.  I love greek food so why not.  Its a small and simple place and it smells good right from the moment i walked in.  I was greeted by a very friendly person whom i chatted with while he prepared my meal.  So i ordered the chicken souvlaki dinner.  It comes with rice, potatoes, a pita and salad along with the chicken.  Fantastic, i was pleasantly surprised at how tasty this was.  Then he offered me a sample of their chicken Gyro.  Oh my, now that was flavor overload, it was soooooo good.  I have to get that next time.  A sample was not enough.  They have a few tables there so next time instead of takeout i need to sit down and enjoy it hot off the grill.  All the food was good, but that Chicken Gyro was spectacular."}
{"text":"I've come here a couple of times and had their gyro sandwich and gyro platter.  I can't really say anything outstanding about them or anything really bad about them.  I like their food but it's not exceptional.  I think it's a great place for a quick lunch or dinner if you are in the area since everything is fresh.  That's all I can really say."}
{"text":"i came here a few months ago because I was looking for a place to get an authentic gyro close to work.  The place is a little hard to find, tucked away behind a gas station, but those kinds of places are usually the best, right?  The guy working there, I think the owner, was very friendly.  I ordered a pork gryo to go.  It's nothing like Alexandro's on the Queens Quay, but I was pleasantly surprised that is was pretty good.  I took half the Gyro home to my Greek friend and he said he actually thought it was delicious.  It wasn't too greasy.  I also took home some baklava, but it was just average.  Nothing special really.  Obviously, nothing like what they have in Greece.  Today, my coworkers was in the area and decided to bring me back some Greek fries.  When I opened the box, the amount of fries and feta were pretty pinch.  They looked pretty average to me.  Again, nothing like Alexandros, but when you start to get to the end, they do get better.  Probably because you're soaking up all the oil and feta (the best part).  The fries were pretty soggy, but I like soggy fries, so that's me.  Krazzy Gyro is a pretty good option if you are craving a gyro.  I don't think there's other Greek places like it in the area, besides the typical chains."}
{"text":"This place is tucked behind a gas station.  I actually came here based on the yelp's review for this place.  Good experience.  Basically you go to the counter and order your food.  When your food is done, you go back to the counter to get your plate of food and get your own metal utensils/napkins.  Somewhat fast food like but no paper plates.  Food portions was great.  The meat itself was prepared/cooked well.  Very moist and not dried out like other places.  The salad could use some olives. But otherwise, it's a good place.  The person at the counter was really nice. He offered us to try out his home made sauces (one mild, one garlic/spicy and one spicy).  We were able to take the bottles to our table to use.  Which was nice.  There's a couple of chairs outside on the sidewalk which I'm guessing would be ok to have a dog there. There is a bit of grass to the side too.  Clean place.  If I'm in the area again, I'd go back!"}
{"text":"Ordered through skip the dishes and when I arrived was told \"the order has not been started because the app didn't remind me\" . Killing me, what a pain in the rear, this is why I pre-order.   Ordered chicken schwarma wrap, pork schwarma,  fries and hummus.    Fries were excellent, most fries in Toronto are just rubbish but these were crisp on outside and soft inside. All the food was quite good but the portions are very small. I'd prefer to pay $2 or so more per wrap but have it bigger.  So overall ok but small portions and careful if ordering through apps."}
{"text":"Wow! Great food, customer service is excellent, I highly recommended eating here. Very friendly staff!"}
{"text":"Affordable and tasty food! Best gyro place I've eaten so far and walking distance from my work. I rather go here than Astoria. I can get the same quality food with a fraction of a price. Highly recommend this place"}
{"text":"Was in the area and went on Yelp to find a place for gyros.   Reviews were good so I went it for a take out order.   No regrets.  Very good! Beef and lamb was the gyro default which I ordered.  Chicken and pork was also available.   Fries were great.  Frozen but crispy and flavourful.  Only comment is that the meat and fries should be separate from the salad when being packaged up for take out.  Salad was warm when I got home... but still good."}
{"text":"Delicious. Got the pork gyro. Fresh fries and made fresh in front of me off the rod. Yummy , will be back again before my shifts - I'm a cook at a nearby restaurant"}
{"text":"Good gyro. Got the lamb gyro wrap. Service pretty good too. Hot sauce isn't very spicy per se, but definitely tasty. Would recommend you add it onto your dish"}
{"text":"I have passed by this place a thousand times at least and have missed it! Located behind a gas station on Dundas St E, a little further away from Muddy Duck (across the street). We ordered a chicken and a mixed gyro sandwich and two platters - chicken and mix that came with a side and a pop. Everything was amazing from their pita to the generous amount of meat, even their lentil soup was soooo good! Truly a hidden gem - fresh ingredients, great taste, good value for money and absolutely wonderful customer service :)"}
{"text":"This place was awesome. Amazing value for the price, really fresh ingredients, and the service was awesome. I ordered the chicken gyro dinner for 10.95 and couldn't even finish half my plate, everything was done to perfection. The gentlemen at the counter was super nice and attentive. A hidden gem, will be coming again soon!"}
{"text":"Very friendly reception from the young lady behind the counter. Had the lamb and beef gyro with all the trimmings and a little hot sauce (which really made it taste great!). Was only $6, great price for a great gyro!"}
