{"text":"They have a small kiosk next to Buffalo Wild Wings. Friendly customer service. 

Small pies, single served cupcakes, cake pops, water, 4 pack of cupcakes which had strawberry, lemon, chocolate and red velet. All ranging from $2 to $20. They accept c/c. 

Had the strawberry cupcake I thought was really good even the frosting tasted like it had real strawberries in it. Can't wait to try the rest."}
{"text":"We stopped by the bakery over in 701 E Western Ave, Avondale, AZ 85323. Cute bakery with some delicious cupcakes! Make sure you try the coconut and red velvet cupcakes. Those are my favorite picks. The cupcakes range from $3 to $4 a piece depending if the cupcakes are filled or not. A nice treat and a great local place. The staff was very friendly and even offered their favorites when we couldn't decide what to try."}
{"text":"Being a loyal fan of their original Avondale location, I definitely was excited to find out they were opening a kiosk at Westgate on May 1!  I finally went on Sunday, a couple days after they opened, to see how they put it all together.  Not only do they have single container cupcakes, but they also sell different assortments of chocolate covered bacon, their cheesecakes and pies, as well as some cakepops, 4-pack assortments of cupcakes, and drinks.  It is a simple little space that is a lovely extension of the original.  I was sad to see they didn't have my favorite of all time, Peanut Butter Sugar Cookie...on the other hand, this might be a good thing, since I only live 5 minutes away.  They are missing some of my other favorites though, so I see myself continuing to go to the Avondale location way more.  I'm hoping they will switch it up here and there and change the assortment they stock in the kiosk.  

I'm so happy for the Cartwright's and their expansion.  Now so many more people will get to taste the wonderfulness I've so enjoyed these last couple years!"}
{"text":"Omg!!!!  Everything about this little shop is amazing!!!  1st...cupcakes are just as amazing as the ones at the shop In Avondale.  2nd...best cheesecakes ever!!!  My favorite is the banana cream cheesecake!!!  3rd....chocolate covered bacon...do I need to say anything else!!!!  Great customer service too!!!!  You must visit this place when you are at Westgate!!!"}
{"text":"Delicious cupcakes! It's a small shop but their cupcakes are so tasty and fresh! Their prices aren't high and you get what you pay for. There's so many choices of cupcakes! The parking area isn't the best but definitely worth it if you're craving a cupcake."}
{"text":"Wow.  Just had a somoa cupcake and the cake was so moist and rich tasting, I was blown away.  The icing was perfect.  I was a little disappointed there wasn't more but it really didn't need more than it had.  Delicious.  Worth the drive and I will be back."}
{"text":"Boy did I find the cure for a sweet tooth! In old town Avondale there's a place called Kreative Kupcakes. My boss lady (BL) took my son for a stroll in the hood one afternoon. Upon their return they brought back one of the most tastiest cupcakes I've had in a long time. The amount of love they poured into this one cupcake made me want to try basically everything in the bakery. The cupcake I tried was named Death by Chocolate which was right up my alley because my blood type is actually chocolate! 
I'm one of those people who like to lick the frosting off first and based off the taste and consistency it's an overall summary of how the experience will pan out. This cupcake had me at hello. I took one lick and felt like the tootsie pop owl. The frosting was reminiscent of my momma's goodness bringing me back to when I was a kid barely able to see over the kitchen island just waiting for her to hand me a beater from the mixer. Which actually still happens in present day every time my SBL (sexy bearded lover) bakes cookies. 
I took a fork and dug deeper into this sexy cupcake and found there was a chocolate mousse filling inside which was like, um welcome to an edible fluffy cloud of more tastiness. It wasn't as sweet as the frosting thank goodness, but a perfect pairing for your mouth. The third layer was the chocolatey cake itself and as suspected it was even less decadent that the rest, which again is a good thing  because one can only handle so many sugar shivers. Over all It was a fabulous cupcake married with all the right flavors. It was sexy, sinful, and stupid it was so good. I told BL I was having a Ratatouille moment with the frosting alone, and we shared a moment of silence."}
{"text":"My daughter loves Hamilton so of naturally of course I waited 3 days before her birthday to find a cake! And I called kreative and kathy was more then happy to help! My daughter loved the design and color! And even better she loved the cake! Really moist and the filling was great! Thanks for everything!!"}
{"text":"This place is just awful now, and I'm pretty bummed about it. 

My kids and I used to come often but this year we didn't get to go until October, for a birthday. The cupcakes weren't quite the same but I just chalked it up to an off day. Fast forward to yesterday, we went in and bought 6 cupcakes and left. As soon as I tried the first one, Twinkie, I noticed it just was quite as good as I remembered and as I got to the center the filled cupcake, which you pay extra for, wasn't filled at all. My kids both sampled theirs and neither finished their whole cupcake. Taking a bite of one it tasted overwhelmingly stale, then tonight, less than 24 hours after purchase, all three eaten were stale and gross. I'm sad at what a turn for the worse this place has taken!"}
{"text":"Highly overpriced for being tasteless cupcakes. They were so dry, and did not taste good at all! I would expect better for thinking they could charge so much. It's almost funny, but then again, it's not. Gross!"}
{"text":"Cute little kiosk in west gate. Nice cupcakes. Was hot inside kiosk and the cooler seemed to have a leak as there was water in several places on the floor! My favorite is the chocolate covered Bacon strips and guinness beer and bacon cupcake. 
Service was friendly I just felt bad for the poor girl in the hot kiosk."}
{"text":"Delicious!  My daughter wanted fancy cupcakes so we stopped in and picked up chocolate peanut butter and a german chocolate cupcake for each of us!  Yum!  The lady in front of us got a giant cupcake from the looks of it and was happy with her service saying she's be back.  They were kind of limited on offerings but we were kind of late in their shift so maybe more earlier on in the day. We will be back to try again I'm sure"}
{"text":"I've only tried the Sea Salt cupcake so far (twice!), but it is SO good!  I love it!"}
{"text":"Came here a couple evenings ago and picked up a lemon and a red velvet cupcake. I normally love red velvet but I noticed the red velvets were smaller than the other cupcakes. Anywhoo it tastes ok and the lemon was pretty good. If I come back most likely I'll just get a lemon. Price was kinda high too."}
{"text":"Really disappointed in this place. When I can make it during their hours (for us working folk it's a bit difficult) it WAS always exciting to see the open sign still on. My bf and I usually eat at the restaurant across the street and when we want dessert we hop on over for several cupcakes to take home. When we came there last an older woman (looked like the manager maybe) was on the phone and that was fine, we were still looking at the flavors anyways. I overheard her say \"probation\" so it definitely sounded serious and when she said \"I'll be with you in a minute\" we told her that was fine. But then a minute turned into several more minutes, it was awkward standing there and overhearing a personal phone call, but then after waiting 5more minutes (or more it felt like forever) you could hear it turned more into a casual conversation, she was just standing there looking out the window gabbing away...and that's when we got frustrated. She didn't make an attempt at that point to just handle her business and get off quickly or tell the person she had customers or that she'd call them back. We were just standing there waiting and waiting, at one point she walked up to the counter and we thought she was going to finally help us but she just stayed looking down talking on the phone, we really couldn't wait any longer, we just wanted to grab some dessert and get home so we ended up walking out. The rudeness completely turned off my boyfriend and he refuses to come back. I agree, it doesn't matter if the food is good..if you get treated like crap and there is no care for the customer, why would we even want to be there."}
{"text":"CLOSED at this location - went by Westgate on April 10, 2016. 
They have great cupcakes. Try their brick & mortar location on Western in Avondale."}
