{"text":"This place makes the best octopus I've ever had by a mile.  It was perfectly cooked, super moist and seasoned perfectly.  We also had fried zucchini patties which, again, were probably the best I've ever had.  The fish is incredibly fresh and they allow you to choose which one you like.  My only complaint is how disorganized they were and our waitress had a bit of attitude.  For some reason they cooked my friends steak too early and had it tented for way too long.  By the time he got it a medium rare was well done.  Food wise it's some of the freshest, tastiest, and most authentic mezes on the Danforth, if they can work out those kinks it would be perfect."}
{"text":"Not too bad overall. Got the 4 course menu which included a whole fish (grilled or seared) an appetizer and desert. The fish was wonderful. The pita appetizer was ok but one of the dips was not very good. I can't comment on dessert as I didn't try it. The others at my table seemed to think it was ok. The service was pretty good. Nothing special. We did think it was odd that the waiter spoke to people at the front door while he was taking our order. Not too bad overall. Would go back but won't be sprinting."}
{"text":"Just left this restaurant and I am eating my cornflakes as I write this review.  I made a reservation for tonight and when we got there they said we were booked for he following night. No big deal they sat us anyways. We ordered our food and drinks and received our appetizers fairly quickly. We had two dips and an order of the fried zucchini dish. Both were very good. That is where the food ended in my opinion.   When ordering we were asked if we wanted the fish de-boned. We said yes given that we have small kids. The mains were not arriving an hour after we finished our appetizers. After having asked about the mains they finally arrived.   We ordered three fish and an order of lamb chops.  We were very excited when they brought the fish to show us before they cooked them. When the fish arrived it was sooo  over cooked my poor kids could not separate the fish from the skin. It was super dry, burnt and bland. No offence but for a seafood grill there is no bigger sin than over cooking the fish!!!!  The lamb was requested medium and it arrived a touch under well done. Very disappointing I really feel bad for the fish, it is like the fish died twice!  One of the girls that served us was very very nice (the brunette with the limp) and that is the only reason I gave a star."}
{"text":"Kritamos is located on the south side of the street and tucked into a narrow space that runs south from the street. The windows at the front were thrown open to the street where we were greeted by a waitress who was eager to show us the menu and what was offered. Right beside the front window was an iced box displaying the fish options featuring a range of fresh fish. The place was decorated with dark wood accents that gave it the precious, hushed feel of a bar/nightclub. There were a couple of banquettes along one wall, while along the other a long line of smaller tables with bench seating on the other side. Set into the walls were niches that were backlit in a rich blue that featured statues of gods of the sea.   The menu featured a good selection of spreads/starters, appetizers, fish and shellfish mains and a few sides. The prices reflected the decor and what one would expect for fresh fish on the Danforth. Unlike some other Greek places that we have tried in the past, everything was cooked in olive oil and not butter making easier for those with problems with dairy. We ordered some starters and they arrived plated beautifully in small square ramekins that showed thought to design and presentation. Tasting them it was a pleasure to discover they were as delicious as they looked. A friend ordered an appetizer that came out even more beautiful with a selection of cheese stuffed figs and peppers drizzled with a balsamic glaze and a yogurt sauce. He declared it one of the best appetizers he had in a long time. For mains we tried a selection of fish and seafood dishes accompanied by some sides. Everything arrived plated individually, again with an attention to presentation, making for a lot of plates on the table and the food was delicious. I had the scallops which were served in their shells and a side of sweet potatoes and beets that were delicious. Also a jumbo prawn dish, sardines baked in a tomato sauce and a whole Greek fish that was declared delicious. Sides consisted of heaping plates of fries (that were delicious) and swiss chard that could have been replaced with a more delicate horitaki or spinach salad.  The experience was made all the more pleasurable by a waitress who had knowledge about the menu and a good sense of humour about service. She was pleasant and helpful. The place is only five weeks old, still trying to work out the kinks as a new restaurant with a Grand Opening planned in the next couple of weeks. It is a much needed addition to the Danforth offering fish and seafood and is not to be missed."}
