{"text":"I would save your money and head into the mall for a taste of Greek food. Portion size is great but no real flavour. Everything is just salty with a hint of familar Greek spicies. One important advice, the girl at the take-out counter might crush your take-out food. The poor thing is miserable there."}
{"text":"I am struggling to give it two stars instead of one, and only being generous because it's Christmas and our waiter was nice, although totally untrained. We dined on an evening with only a few guests in the restaurant, a couple of days before Christmas.  Our food was quickly served and our orders promptly taken. But then we go downhill. The taramasalata was awful, like whipped mayo with none of the fish flavour required. The calamari I didn't try but my husband and son said it was very greasy and devoid of flavour. I had the chicken souvlaki salad which was actually very good, until I got to the bottom quarter and found a large hair under a lettuce leaf. I'm choosing to believe it was mine, although I would have no idea how it got under a lettuce leaf at the bottom of the bowl... My husband had the lamb souvlaki dinner and said the meat was dry and tasted old. The bathrooms were very dirty. We will not  return."}
{"text":"This place is ABSOLUTELY GARBAGE !!! Save your money and don't waste your time. Since the change from Mr. Greek to this new place Krystos...this place has gone down the toilet...which is exactly what your experience will be here, crap!  Besides the food being overcooked, terrible ingredients and awful...The waiter was new, so I don't fault him. But the \"manager\" is a complete @ss. He is actually also the guy cooking your meal. Seriously! We had a party of 8, they brought out 6 meals...and the other 2 when the first 6 ppl were done. Lol When I went to ask for the manager, some young short Indian dude behind the grill came around the corner and said \"what\"...I explained to him the situation...and he game complete attitude and at the end he reluctantly said \"fine I'll take %10 off\"...I wasn't satisfied with that but went back to the table...only to find that the seafood platter they had FINALLY brought out was missing the shrimp that was supposed to be on there. I went back to tell the manager I went to the manager to tell him I wouldn't be paying for the late, incomplete meal, and he turned to the waiter and said \"OK fine go and take the plate off the table\"... instead of making the situation right. I wouldn't go back here if they were giving the food away for free."}
{"text":"I was excited for another Greek restaurant to open up in that location, since Mr Greek was a big fail and went downhill very quickly over the years. I ordered the chicken Greek. The chicken came raw three times. Yes. I sent it back thee times. The cook couldn't seem to cook it thoroughly. Never ended up eating the chicken. The salad was disgusting. The dressing was not your traditional Greek dressing. It was sweet like something you would pour on a dessert. The waiter was unable to comp the chicken. Even though it never came back to me eatable. Definitely do not waste your time or hard earned money."}
{"text":"Would not accommodate Greek fries with the meal I wanted. No upgrade or anything, cool I guess.   Chicken souvlaki was undercooked with a pink middle. Not cool.   Fries, nothing to brag about. McCain fries out of the bag.   Will not come back"}
{"text":"My wife and I decided to bring my parents out for dinner. We were excited about trying a new Greek restaurant.   Unfortunately, the service was slow and unfriendly. Not sure if our waiter was pulling a double or something. Food took a while to come out. Drinks came out for half our table while we were waiting for the food. The remaining drinks eventually came out shortly after our meals. I guess they don't care to up-sell their beer.   Food tastes ok. It satisfied my hunger. I ordered the pork souvlaki. I think they use store bought skewers. The seasoning didn't seem authentic.   I doubt I'd come back. It's unfortunate that more pride isn't taken at this establishment. In this business pride from your staff and owner is a must."}
{"text":"This review is based on my first experience back in 2015 and my most recent yesterday.  We came here back in 2015 by accident. It used to be a Mr. Greek something or other and changed over to the Krystos that it is now.  From what I remember, the food wasn't really all that bad at all; but the service was meh and the food wasn't worth the price. After that visit, we decided to never go back.  Until yesterday when we tried to go to a restaurant that wasn't yet opened, we resolved to going back to Krytos - not really remembering why we didn't want to go back.  We walked in. The lights were off. The waiter was at the drink station bar thing making drinks. He looked at us but gave us no acknowledgement (no wave, no nod, no I'll-be-with-you-in-a-minute). I don't actually think he said a word to us at all; he just got our menus, seated us, and looked at us questioningly - to which we answered, \"um, two waters?\".  Looking at the menu after trying to communicate with a waiter who doesn't talk, we remembered why we hadn't returned after that first visit. So, we left; and now I have this review to remind me never again."}
{"text":"I am very surprised why this place has only two stars.. The place was nice , clean.. good customer service.. delicious , cheap and huge portion of food. What else do we need to have a pleasant time? This is going to be my go to Greek Restaurant. I usually check reviews before i go somewhere but this time did exception and thankfully didn't regret."}
{"text":"I went there with my wife because I was craving a Greek salad for days.    Unfortunately my experience was not as good as I would have hoped.  I ordered a large Greek salad, a gyros wrap combo, and a double breast chicken dinner.  The Greek salad was very disappointing; the price was so high and the ingredients were lacking. They gave very little cheese and the tomatoes were not even fully ripened.    The gyros wrap was acceptable and the rice was decent even though the chicken seems fairly dry.  I most likely will not be returning to that restaurant.  As a trained chef, my expectations are fairly high and even though I wasn't born anywhere near Greece, I know I could have prepared a much better Greek salad."}
{"text":"I definitely would not recommend or come back. They wouldn't accommodate anything if you wanted to change something in your meal. The meat wasn't all the way cooked. The service was very awkward as well."}
{"text":"I dropped in for lunch at Krystos on Yonge Street near 16th Avenue. It's a very sharp place and big restaurant. We had the chicken souvlaki and the chicken was plumb and juicy big pieces of white meat. Zak was there and introduced himself as an owner and was very nice to us.   This used to be a Greek restaurant before Krystos took over but they improved the decor quite abit. Love the new place. The price for the dinner was 15$ but it was massive. Matt finished his dinner I had to take it home for leftovers.   I liked Krystos and recommend it to all my Yelp friends. Cheers."}
{"text":"The Good, the Bad and the Ugly.   The Good: they serve a mean Diet Coke. Excellent Diet Coke. Good straw too.   The Bad: Once the food was ordered, the server activated her Predator cloaking device and she disappeared. The food took 45 minutes to be served! To be fair there was another 4 people in the restaurant though. I'm sure that put a strain on the \"cook\". When it was time to pay for the bill, the Predator reemerged.   The Ugly: everything was burnt. Even the saganaki \"opah\" cheese was made to sit on the table opposite ours. I had a few minutes to just sit there and watch it burn in flames. At least 3 minutes before it occurred to her to use the lemon wedge to put out the fire. The souvlakia were all burnt to a dry crisp. The rice tasted like it was cooked in dishwater and even the potatoes smelled and tasted like the secret ingredient in the lemon sauce was rat poison.   Folks,  I'm not exaggerating. This is what happens when a restaurant doesn't taste their own food. If they did,  I'm sure they would have truly burned it until it was just charred remains. This was truly the most abysmal restaurant experience in I have ever had. GARBAGE!"}
{"text":"We got takeout in the late evening. Wasn't a busy evening.   We asked if they have shwarma since we didn't see it being cooked. The waitress said yes. But when we got home - we have received gyro instead of shwarma. He gyro was really dry and not very good. However I have ordered chicken souvlaki dinner on previous occasions, and it was good. The price for their food is a little overpriced.  All in all, best to go into the mall to get better + cheaper Greek food."}
{"text":"Big improvement from the previous Mr. Greek. The food is more authentic to Greece. The service is excellent with mature waiters who have been in the business for years. All your Greek favorites are available and the atmosphere is great."}
{"text":"Been here several times with different people.  Can honestly say that the service, including catering to dietary restrictions (e.g. gluten-free, lactose-free), is inconsistent. It seems that there are no systems in place for the staff. They serve which tables they want, and usually forget even the little things such as water refills or even asking how everyone is doing, and customers are waiting for up to 45 minutes for their appetizers and/or meals. One time, the staff got the sides we wanted completely wrong.  I agree with other people who say that the floors are sticky and the bathrooms could use better maintenance.   However, the food is okay, and that is the only saving grace."}
{"text":"I dined-in at Krystos for the first time today.  The food was decent, but the service was below average. There was only 1 other table in the restaurant but we waited a while for the server to come ask us what we wanted to drink. By the time she came to our table, we were ready to order as well. We got a few Corona's, waited for 15 minutes (and ate our salads during that period of time) before we were told that they didn't have any Corona's left. Food came out pretty quickly. No quality check after we got the food - luckily the food was good! Probably won't be dining in again, but I recommend getting take-out from this place if you're craving Greek food! Their lamb souvlaki is delicious."}
{"text":"The food was pretty good. I was surprised by the sweet flavour of the salad dressing. It wasn't the usual oregano and basil, salty vinegar taste that I normally identify as Greek but it tasted good. I think the salad would've been nicer if chef tossed it with the dressing and then maybe served it on a plate instead of in a bowl with dressing poured over the top. The chicken souvlaki was very good. Everything else had a bit of a lemon taste except the rice tasted a little fishy. The value was excellent. Very generous portions. The service was also very good although the waitress never offered us drink refills. I felt sorry for this restaurant because we were the only patrons wednesday night at 6:30 PM- first week of school though. It was a little weird being the only ones there as it's quite big. I used to get takeout here often when it was Mr. Greek -this is only the second time I've ever sat in to eat. I have to say the waitress was way friendlier than the old waiters at Mr. Greek. The decor needs a bit of a refresh but the bathroom is pretty clean. The food tastes different than it did when this was a Mr. Greek but over all I would rate it as pretty good. I wish the new owners good luck I hope they can make a go of it."}
{"text":"We tried the Dufferin location and were really turned off at the lack of flavour and authenticity. We decided to try the Richmond Hill location and were equally as disappointed. $15.80 for a village salad, that didn't taste particularly fresh (and didn't come with any bread) was such a waste of money. Sad to say, but this is not authentic Greek food. I miss Mr. Greek!"}
{"text":"Nothing really special about this place. Even though there was no one here, floor is sticky as if you had gum stuck to the bottom of your shoe. Service was very brief."}
{"text":"I have ordered food from Krystos COUNTLESS times and while I can't speak for the sit-down part of the restaurant, I can speak for the take-out portion: awful. Not only do they forget things to add necessities like napkins and cutlery, but they also forget to add the things that we actually ordered: like lemon or particular sides. The business before them wasn't doing well and either is Krystos. My best guess is that it's soiled ground. Whatever the reason, save yourself the headache and go to Swiss Chalet across the street."}
{"text":"Came to eat at Krystos for the first time today during lunch. I felt like eating Greek and didnt want to eat at the typical Mr.Greek.  On the contrary of what other reviews have been for this restaurant, my friend and I actually really enjoyed our meals and we had great service . keep in mind, we were one of the only people in the restaurant at the time, but the server was quick and followed up on us promptly.  I ordered the Gyros Dinner and she ordered the Pork Soulvaki Dinner. We also had a appetizer of the Grilled Calimari. Both of our dishes were very flavorful and hot.  The portion size was also massive -especially my Gyros Dinner. My Gyros was Not dry- the only thing was it's a bit too salty, but I normally do not put a lot of salt on my food anyway so I am being bias by saying it was salty. My friend thought it tasted great. I had a side of rice and fries- because my intention was to take half of my meal home. Actually, I had it for left over dinner  as well and I still have food left over - I can usually eat a lot.. So I am surprised at how full I kept getting. My fries were fresh, crispy and no salt on them which was perfect. The rice was standard and expected, but not dry.  My friend's pork dinner , she had rice and vegetables; she got a lot of veggies and she also had taken half of her meal home.  The Grilled Calimari was really good as well. Lots of flavour- does have a quite a bit of butter on it but it was good. It wasn't chewy or dry like a lot of calimari .. And I order calimari quite often from a lot of restaurants. It also did not have a frozen taste to it, which we both were extremely impressed with that. The only minor issue  we had was the calimari came out after we received our entrée. It was suppose to be an appetizer, but that was ok after. The portion was also great- 4 full calimari pieces which is usually uncalled for when ordering this.   Overall, we both were content with the food and service today. We would visit again if I am in the area again. We also don't feel the price is unreasonable.   I work in the food industry and sometimes people need to understand the food cost which is associated when running a restaurant. For my $16 dish, I felt my meal was well worth it. I have had much worse service and food at other well-known restaurants which cost me $20-$30 for essentially the same dish.  I hope this restaurant sticks around, but understand the competition they have around them."}
{"text":"Place used to be mr.greek, they just change the name and increased the prices otherwise the food is not that great and its smaller portion. I think they should close down all together. I dont recomend to anyone unless you want to thru away your money. However the wait staff are good."}
{"text":"Great service, food delicious, ambiance lovely,  recommend this restaurant. Potatoes a little sweet with souvlaki dinner. All else just fine."}
{"text":"Krystos is the new rendition of Mr.Greek. The old Mr Greek in that location closed down and opened up a new Greek restaurant, Krystos. The food and prices are very very similar to Mr.Greek. The inside has a pretty authentic Greek feel to it, feels cultural. Very spacious restaurant with plenty of tables. Today we decided to sit out on the patio because it was so beautiful out. The service was a little slow and kinda poor. Food was pretty good but i found the portions to be smaller than the take out portions. All around average dining experience and to me getting Greek food to go is a much better option.   CL"}
{"text":"There's nothing special about the Greek food here. The food was very dry and didn't taste fresh at all. Try another Greek restaurant instead."}
{"text":"Unfortunately, most people only take the time to leave bad reviews.  People who enjoyed their meal are not as enthusiastic in reviewing.  We had dinner there tonight with another couple and we all enjoyed our meals.  The service was very attentive and food came hot and plentiful.  My husband and I shared a chicken souvlaki and ordered Greek salads on the side and an order of pita which was yummy.  Our friends ordered the lamb souvlaki and were mistakenly brought the chicken.  The waiter told us to go ahead and share the chicken and they would make up the lamb which was done quickly.  I thought this was good customer service.  We will definitely return and will get takeout from time to time.  People can be very picky and mean when leaving reviews.  I felt that I ate at a different restaurant than the one reviewed poorly by so many here.  We need these businesses to succeed in our neighborhoods and we should be offering as much support as we can when we have an enjoyable dinner.  I recommend this restaurant."}
{"text":"I really wanted to love this place.  We came here to sample some authentic Greek food, and what we received was cold, rubbery skewers where the best tasting item was the crisp French fries. Reading the reviews about the emptiness of the cavernous space, the surgery sweet of the Greek dressing, I scoffed. Unfortunately, not only was that true, but our party was Hijacked by fruit and other assortments of fly. Flies everywhere, enjoying the Mccain style chocolate cake, enjoying the pita triangles and the sweltering heat under Food Court style lighting.  The service is what gets the second star. Very friendly, aiming to please.  To the owners, please strive to serve fresh food, better breads and authentic cuisine and I promise you will fill those seats. I am willing to come back and redo the review based on the service."}
{"text":"Walked in sat down carpet was sticky asked to move no one came to see to us. Waited 5 min got up and walked out. Very dirty place looks like a new restaurant on the outside but inside they need serious cleaning and more staff"}
{"text":"i ordered from here and it was delicious. potatoes were juicy, the chicken was well cooked, the rice was yummy. delivery wasnt too bad in terms of waiting. i reccomend it."}
{"text":"First impression was not positive. Everything looked dirty: windows covered in slime, debris on floors, decaying plaster at entrance... thankfully I went to bathroom before ordering. Disgusting! If the entrance, dining room and bathrooms are so filthy, I can't imagine the state of the kitchen. Prices are expensive. We walked out."}
{"text":"Classic Greek place.  Another type of Friendly Greek, Mr. Greek style food.  The potato's and some of the seasoning was better than those other places but the Veg Moussaka was not great and was so hot like it was heated from a Microwave. The village salad was fresh and very large, but I didn't like the presentation.  The chicken was well cooked and clean with good seasoning.  The lemon potato's were actually a great surprise.  Very reasonable for someone on a budget, but Im not rushing back.   The other thing I didn't like the place is so big, that even if you have 20 tables the place feels empty."}
{"text":"We decided to order Greek food to work on Saturday. I called there, very nice girl answered my call and asked to hold for a second. She came back to me after 5 minutes, asked the address, apologized and asked to hold again. Overall waiting time just to make an order was 15 minutes, which is ridiculous!!! The service experience was totally disappointing. Now about the food: we ordered chicken souvlaki with rice and greek salad: there were four small pieces of dry chicken. The worst souvlaki I have ever tried. Greek salad isn't even close to real Greek salad, lots of lettuce, a piece of tomato and two pieces of cucumber. So if you want Greek food, better drive to Mr. Greek and pick up your order. Delivery from this place isn't worth it."}
{"text":"This location used to be a Mr.Greek. So it is only natural that the following establishment to be a Greek restaurant as well. I'll make the statement quick...I miss the Mr. Greek and I HATED that restaurant when it was here.  I'll break this down in several ways. The Service and the Food.  1) Service - Suffice to say...I've had better. The group I ordered with had a few adjustments to their items and it seemed to throw the kitchen in a frenzy (G-d forbid we ask our salads to NOT come with Tomatoes). We knew it upset the kitchen because we heard them from mid way in the restaurant. When our salads came with the more tomatoes than none (like we requested) our server suggested \"just pick then off\". It also didn't help that it was difficult to flag down our server when we needed refills of water. I'm sorry, but my pregnant wife needed water and it was hard to get at times. The manager came over eventually and was gracious enough to smooth things over and get our feedback. Its rare to see and it was comforting to see and owner learning from his customer base. That was the only reason I awarded the second star.  2) The Food - I'll focus on my food now. I got the Lentil Soup. It would have been good if it wasn't heavy on the olive. I found it way too salty and off putting. I also got the Vegetarian Souvlaki plate and in the back of my head, I just can't justify $13 for a skewer of vegetables, rice and potatoes. Each element was great, I just felt it was priced too high for what I got in return. The Greek salads had a sweet taste to them that was unexpected. The manager justified it by claiming it was a more authentic take on Greek Salads. I'm not an expert on Greek cuisine by any means but I'm skeptical about it. But once again, I'm no expert on this. I will say that the QUALITY of the food is good in terms of the ingredients used but i feel how they are used is poor.  I really wasn't pleased here. I get that they are still working out the kinks so I'm willing to give then another try. I think I proved that with Hummus Hummus before they closed. But there is a lot remains to be seen before I adjust this rating.  Also, one of the locks are broken in the men's room and there are only two stalls. Use them wisely!"}
{"text":"Ordered take out for the first time from here.  I am impressed with the value and quality of the food.  We ordered one small chicken souvlaki dinner and one gyro.  The portion sizes were also very generous.  An upgrade from Mr. Greek.   The only reason why the rating is four stars instead of five is because my food was not ready when I arrived for pick up.  I will definitely be ordering food from here again."}
{"text":"Went here for chicken souvalki on a pita with a coworker during the week - take out. For the price, there could have been bigger pieces of chicken. It wasn't the best Greek food I've had or the worst - I guess mediocre would describe it best. In a pinch it will satisfy your Greek food craving but I wouldn't make a special trip."}
{"text":"Distgusting.  From the decor to the bathrooms.  The food was the worst greek food i have ever tasted in my life.  I walked in at 9:30 and I was the only one here.  Should have seen the red flag.  Do yourself a favour and just turned around."}
{"text":"Old Mr Greek same faces good food quick delivery most of the time but food is always worth the wait live music done nights of you like that"}
{"text":"This is the worst restaurant to go to!! We ate there a few weeks prior to this visit and one menu had a list of Persian dishes. We came back here tonight for my mom's birthday and asked the waitress what happened to the Persian menu in the back of the menu and she looked at us like we were nuts! She was also very rude and mean and was very abrasive. She didn't come to our table prior to ordering to ask if we wanted drinks. It's not like the place was busy. It was on a Wednesday during a snow storm. There was hardly any patrons at the place. It took 25 minutes just to get our water. This was the last time I or my family would set foot in this place. Waste of time!! Go somewhere else if you want a decent meal. For a $16 dish, I would expect better service than what I would get at a fast food place at the mall!"}
{"text":"We were craving Greek food so we decided to try this restaurant out for the first time. We went around noon for brunch with the family.  I was surprised to see people in there since there wasn't many cars in the parking lot. We were greeted upon arrival and taken to our table which was near the kitchen. The server did ask us where we wanted to be seated, which was nice.   I ordered the chicken souvlaki dinner, husband ordered the gyro dinner and we ordered a chicken souvlaki and fries combo from the kids menu.  We got a basket of bread which was lifted grilled but had no flavour what so ever. My husband said it seemed kind of stale.  The salads came out first, the dressing was a little sweet. Alright Greek salad but the dressing seemed like it came from the bottle not so home made.  Our meals came out shortly after, didn't take too long to come out. Although it wasn't pipping hot like I expected. I got a side order of rice and \"mixed\" vege. And my husband got a side order of \"mixed\" vege with lemon potatoes which was supposedly their most popular side.  I enjoyed the rice but the vege was all carrots! My husband had all carrots too with two pieces of zucchini. The lemon potato was alright. The gyro was a little dry but okay to eat. Chicken souvlaki was okay, could of had more flavour but enjoyable. The taziki  sauce was good. Our daughters meal was not worth $7- had a couple prices of chicken and some fries. But the fries were really good! I would probably just go back for the fries lol  Overall my experience at this restaurant was okay. The service was great!  But I wish the food was more flavourful."}
{"text":"A restaurant really needs to disappoint for such a review... and sadly this restaurant most definitely won't last more than 6 months with the service and food.  Ordered takeout from this location online yesterday... I had called in soon after placing my order just to confirm payment methods; the lady who had answered the phone had mentioned the internet was not working on her end so she can't receive my order... not a problem; I repeated my order STRAIGHT off the internet... This girl who supposedly works at this restaurant claimed they didn't have 2 of the dishes I had ordered online. Then after rereading the details of the dish; she claimed I can only get that as a dine in option. I asked her as to why it would be on the pick up menu online then... her answer.. I don't know.. how lovely... I asked that it be made and she said fine... But only if the turmoil ended there... I also ordered the shrimp and salmon linguine which according to the site was in a wine reduction sauce. When I asked for the linguine she asked me tomatoe or rose sauce. So when I proceeded to ask what the wine sauce was it was cooked in as per the site.. Her answer... \"i don't know\".. I asked her what does she mean I don't know... its whats on the menu... Her answer whilst giggling... yet again \"i don't know.\" As its new years eve and there was only a limited amount of places open I just went with it....  As if the ordering process wasn't annoying in itself.. the meals were quite pricey. When we got the food and came home... disappointment is an understatement. Lets just say the food is sitting in my fridge only because explaining to myself spending so much on food without putting it to use is just shameful.   The shrimp platter which apparently wasnt available for takeout.. had good reason not to be offered. IT was horrendous. All the dishes we had ordered had feta; I couldnt tell there was feta in anything. The shrimp platter at 22 dollars came with 5 shrimp in tomatoe sauce on rice with veggies on the side. i would pay maximum 12 dollars for the meal presented. I also ordered the linguine with salmon and shrimp. There was calamari in my linguine... and no salmon... at all. No feta whatsoever.... Nothing tasted fresh and it was as if everything went straight to the fryer from the freezer.. there is nothing fresh tasting about this place. And the babaganoush from this place is hands down the worst I've ever tasted in my life.   Hands down one of the worst food experiences I have had to date. This place either needs to wake up for their 2016 year or just realize this joint isn't anything more than a cheap dinner selling fake \"greek\" staples. Call me harsh; but the truth is the truth. Save yourself from such misery."}
{"text":"The food was way better then Mr. Greek. Our Soulvaki was cooked perfectly and seasoned well. The kids meals are properly sized and priced. The only issue we had was with the server. He was an older gentleman and he didn't seem to want to be there."}
{"text":"I ordered fried calamari appetizer and it was a very small portion for $12.00 and soaking in oil.  No dip included.  Or maybe it is extra charge. Order was quick alright but hey I was willing to wait to have the food prepared fresh but don't feed me re-fried calamari. If they can't do it right on take out, Dining in must be even worse."}
