{"text":"A hotel lobby coffee shop that actually takes its coffee seriously? What a concept! I'm attending a conference at the Fairmont Reine Elizabeth, which necessarily requires significant caffeine loading. However, this place makes it much more than a utilitarian venture in caffeine delivery. They know their beans, they know their milk-to-foam ratios for different drinks, they have a nice variety of snacks and baked goods for those who want that with their coffee, and they're quick. What's not to like?"}
{"text":"What a cute cafe inside Fairmont hotel lobby! I was so surprised when I saw the price tags. Things are cheaper than Starbucks and taste a lot better too.

We got the croissant and chocolate croissant and both are buttery and flaky. I also tried out their soy latte and it was strong and fragrant.

I would absolutely come back another morning before I do my sightseeing."}
{"text":"Une belle et bonne idée! Le café \"Toi & Moi\" (local) y est servi. Bien exécuté!

C'est joli et spacieux. Très achalandé. Bien situé au centre-ville."}
{"text":"New little jewel right at the entrance of Queen Elizabeth.  Staff is very friendly.  Like atmosphere to sit and relax."}
{"text":"It's a coffee shop inside the Fairmount Hotel next to Bonaventure, in the heart of downtown. It is really crowded in early morning and I waited for an hour before the crazy lineup stops. I tried their latte and it was REALLY good, and one of the ladies in business attire commented on the superior quality of their coffee, saying that Krema got a reputation of being one of the top cafes of Montreal. I don't know if that is true, but for sure from my experience, I found their coffee great, but I was expecting them to show me their outstanding latte art, since they did a great number of unique designs for clients who took latte, but mine was a bit plain. This café is more designed for the people who stay at the hotel or passers by, not really a good spot to study. The interior decor is really lovely, I love it!"}
