{"text":"I've been here twice before and I've always enjoyed their food. I came again on a Friday night with a friend and the service was a bit slow, but they were quite packed and busy, which is always a good sign :)  I ordered the golden dragon roll(?) and it took quite a while for it to come out, but aside from waiting, it was well worth the wait because it was amazingly delicious.  I'm a sucker for anything with salmon sashimi. The rolls were slightly warm, but you could tell it was freshly made on the spot. I would definitely go again to try out their other rolls :)  When I immediately smile and have a huge grin on my face, you know it's good haha"}
{"text":"Yes this place is a bit on a the pricey side ($9-13 for 6-8 huge rolls) but it is worth it. Quality of sushi is amazing, they have unique and tasty rolls, good service, and you can sit back and relax for as long as you like. The only reason it gets 4 stars is because decor isn't awesome (not bad either) and the price is a bit high. I have been coming here for 6 years now. Definitely recommend it."}
{"text":"Glad to have seen the sign from the road. This place was awesome. Japanese and Korean BBQ with a massive menu.  They had the grill on the tables for the Korean BBQ and had a great selection of other Korean dishes that would not need to be cooked table side.   It was a very hard decision to decide what to try. I opted for Japanese for today. The veggie dishes they started with were amazing. The cold potato cubes with honey were wonderful. With the assistance from the waiter, I opted for the chicken box. Salad with a wonderful dressing. The Tempura veggies were not greasy at all and didn't have that oily taste that some places have. The chicken was perfectly cooked with a nice thick sauce that had a wonderful flavor. I didn't opt to try the dumplings or the miso soup but I didn't leave hungry. You really got a lot of food for a very reasonable price.   If I lived in Toronto I would eat here at least once a week. I would suggest everyone try Kum Kang San BBQ."}
{"text":"Decided to try this place based on the great reviews. There were 13 in our party and we were not disappointed. Ordered the Jumbo sushi platter which included more than 100 pieces of Sushi & Sashimi. Everything was very fresh and well presented.  Tempura shrimp & vegetables were perfectly crunchy and light. Chicken Katsu was very crunchy as well and was accompanied by a refreshing salad(Japanese cole slaw?). Very good portions.  We also ordered one of the Family sized Korean BBQ dinners. Because we had such a large group we were not seated by the BBQs. The waiter suggested they cooked the BBQ for us. We were fine with this but having it cooked for us did take some of the fun out of it. Korean BBQ was average to good.  The Chap Chae noodles was a very big portion and was also tasty.  Overall a very good experience. We took a big chance with this place with none of us ever eating there before. Waiter was very helpful and accomodating.  Would definitely return to try some of the other items in their extensive menu."}
{"text":"Although I don't consider myself a Sushi foodie, I found the food at this restaurant to be extremely tasty and delicious. It is the best Sushi restaurant that I have ever dined in the GTA. My wife and daughter felt the same way. We picked it based on previous Yelp reviews since we didn't know any of the restaurants in this part of town.   My wife had a salad with a nicely cooked salmon filet that was she said was fresh and delicious. The price was $10 which is a good deal when compared to most restaurants for a salad of this high caliber.  My adult daughter and I ordered three different rolls and all were excellently prepared, fresh and very delicious. Each one was unique to the others and were a real treat.  We found the waitress to be friendly, personable, helpful and attentive; a real rarity when compared to most Asian restaurants that I have visited. Even though we live a far distance away, we will be back."}
{"text":"Kum Kang San is nearly hidden behind the trees on Dufferin St.  However, the interior is quite large and the menu is HUGE!  You should take at least 10 minutes to look through the selection before ordering. I came here with a large group so it was the perfect opportunity to try a few different items. I ordered the 12-piece Sashimi lunch special for an incredible $10.99; it came with a side of rice, noodles, two dumplings and the usual miso soup and salad. They even gave us complimentary kimchi before our meals arrived. The lunch specials are a real bargain, but the dinner menu prices are quite reasonable as well.   Overall, the food quality was great. Everyone enjoyed their food - it tasted fresh and the presentation was on par with most good Sushi places I've been too. Unfortunately they don't have a website yet, but take my word for it - the menu is awesome!  Service was friendly and accommodating, albeit somewhat leisurely than the downtown Sushi joints. Looking forward to ordering from the Korean menu selection next time!"}
{"text":"Whenever I travel to Toronto for work, I wind up having lunch here. The staff is always accommodating and their lunch specials are priced well. I'm vegan and the staff always makes sure everything is made without animal products for me. The service is quick and the food tastes really good. I've had all of the vegetarian rolls (yasai is my favorite!) and I really enjoy the vegetarian bibimbop.   They sometimes get busy during prime lunch hours, but they always have a table available. Even when we showed up with 8 people. Give Kum Kang San a try!"}
{"text":"This is really unusual for me to visit Kum Kang San BBQ twice before I write a review. However, I could not write a review based on their Korean BBQ, as I have tried their sushi and Korean Cold Noodles.  Sushi bento box was A-OK! I have better sushi before but for the banchans and salad and dumplings that came with it was good value!!  I saw the Cold Noodles on specials for $6.99 while I leaving the restaurant so I decided to come back to try it out!! Specials and Cold Noodles are 2 things I would not have miss or resist!!  Korean waitress was excited when I ordered the Cold Noodles.. I could not read Korean characters but I know a photo of Cold Noodles when I see one!! The noodles was really good, refreshing and chewy at the same time!  I love Summer and I love eating my Cold Noodles with ice slashes floating in my broth.................... wish summer never ends!"}
