{"text":"If I could give negative stars I would... Lousy service, we sat down for 20mins before we got our tea, lousy food, Singapore noodle was wet and the vermicelli was in bits. The curry had no taste and they used pita bread as roti... The BBQ was meh... Please do yourself a favour, Richlane is only a minute away if you take the back road. This place is subpar even at Scarborough's standards."}
{"text":"This place is no good.
They just opened last week, and has ad on newspaper that with $20 spenfing plus $1 to buy BBQ Pork, and 20% discount on weekend.
They told me their roast duck after 20% discount the price is $19 and change.  After I ordered and when I pay, they said it should be before tax price, with just 1 block away, the T&T sold for $18 and change plus tax without duscount.  They then told me that they cannot honor the special of $1 BBQ Pork for purchased discounted product.
The staff there are new, and un-professional.  Lousy service and not keep up with promise.
To be honest, the other shop in Richlane is much better and friendly. This new place has a lot of room to improve."}
{"text":"Just found out this is a BBQ????,though it was a KungFu school. :)..  ??????? BBQ pork and rosted duck..  It must the best BBQ??  in Richmond hill I have ever tried. Highly recommended."}
{"text":"Had a late lunch on a Saturday afternoon. We were the only customers. Order the BBQ on rice. Food quality is deplorable. Food temperature is lukewarm at best. I had to request the waitress to reheat the rice. Avoid this place!"}
{"text":"Trying this new place for dinner. Ordered the Beef noodles in soup ($6.99) and general tao chicken ($9.99). Noodles are too soft and a bit too bland. Chicken is just okay. 
Small restaurant with decent service. Will come back to try their BBQ pork."}
{"text":"Loved it! Went on a Friday afternoon for lunch and not too many tables seated. As we ate, more people came in. I would totally recommend!

The staff were prepared to take orders, were not too pushy and also gave us the right amount of attention (asking for more napkins, catering us by filling our soup bowls, letting us know their specials, refilling tea kettle, etc). It came with their house special soup and oranges as fruit at the end. Their bathrooms were spacious and clean too.

We got the:
1. ROAST PORK - super crunchy skin, abundance of sauce on the side, quite a thick layer of fat which you could bite off or separate, enough to share for 3 people

2. 753 CANTONESE STYLE FRIED NOODLE WITH SEAFOOD - super delicious! the noodles were not too soggy or greasy, there were tons of veggies, seafood and chicken strips. The portion was more than enough to share since the dish was pretty big. Would totally get this again.

3. 785 SHREDDED DUCK & SPICY PICKLED CABBAGE VERMICELLI - this was my favourite dish of the three. It comes in a deep bowl with a giant spoon. It wasn't messy to eat and the pairing of the duck and cabbage was super refreshing.

Then when you spend $20 or more, you can add any of these dishes for just $1: deep fried tofu/spring rolls x2/deep fried chicken wings x5 - we got the chicken wings and they were so good! Not too salty not oily - the classic asian diner-style wings. 

Planning to go again for dinner on Tuesday :) Way to go Kung fu chop chop"}
{"text":"This place makes for a good neighborhood quick dinner spot. I can't say this place is great but I can't say it's bad either. I have mixed feelings. 
They offer up mix of typical Cantonese stir fry, Northern China dishes and BBQ pork, ducks,etc.
The restaurant is small and fills up at a decent pace so its not over crowded. 
BBQ duck is probably the recommended dish here. BBQ roast pork and cha siu are meh. 
I like the beef stir fry Chinese brocolli and deep fried tofu. 
We ordered other dishes but we're not that memorable: thousand island pork chop, eggplant with ground meat, ma po tofu, fried oyster with honey sauce. 
Interesting note, their free soup is actually not that bad. It taste like they put real effort into it. Not the typical water + msg stuff."}
{"text":"Got a groupon deal on a china app. $1 for appetizer size bbq duck. Ordered peaking duck set dinner for 4 people. I prefer the taste of the roasted duck from peaking duck over BBQ duck mainly BBQ duck is more savory. 

Called ahead to make a reservation for 7:30pm dinner. Lots of people waiting for seats. The air conditioning was down that day, it was super humid. No fan available. 

Limited staff, I assume it is a family business. But after we sat down, no one has time to give us menu even we asked twice. It is better to look at menu during time waiting for seat and order immediately or shortly after you sit down to avoid waiting time."}
{"text":"Newly open so does not feel very organized. I came on a Friday night. There was a lineup for 8pm but it was just 15 minutes. We got sat down but the servers seemed to either not care or not able to care.

We ordered soon after we sat down. Combo B. The food took forever to come and they completely forgot to punch in a fried rice we ordered. We had beijing duck. It was slicked really thin and slightly cold. It seemed like there was only half a duck on the plate. They gave us 11 wrappers for the duck. The duck was very tasty. I would go back for the duck.. but the service really needs to improve.It was quite difficult to get anyones attention. Let alone, waiting 30 minutes for the first dish of our combo to arrive.

The portions in general are really small. We ordered a combo that supposedly would fill 6 people. We had 5 and were JUST full. No more, no less."}
{"text":"My mom suggested coming here to check it out, and I was surprised this restaurant was even here. I always thought it was a martial arts school or something with a name like Kung Fu Chop Chop!

I heard the bbq here was pretty good, but the service left something to be desired. This definitely held true in every aspect. 

First off, the food was okay, with the Bbq definitely the highlight. We got BBQ Pork and it was pretty good. Not the best I've had though. We order a fried rice as well, but they gave us the wrong one and had to redo it. The free soup that came with was a nice addition though. 

Unfortunately, the food could not make up for the lack of service. Apparently it was already to be expected, but it was still a surprise. Servers basically ignored you when you raised your hand for anything, food came out pretty slow, and one server in particular seemed to have resting bitch face, but made no effort to remedy it. 

Considering their service is already known for not being all that great, the food should have been spectacular. Since I wasn't blown away, I will most likely stay away."}
{"text":"The food at this restaurant is actual authentic Asian cuisine!! FINALLY! other so called authentic Chinese restaurants don't compare. I travel a lot, especially Asia and I'm a pretty picky foodie when it comes to REAL Chinese food with REAL quality. Most people that are just settling with \"authentic\" Chinese food from other places and want to know what the real taste is should definitely try this place out.  This restaurant is pretty new so menu selections are still in the keeping or dismissing period, however, I'm pretty impressed with the bubble tea menu as well. Definitely beat 168 and ten ren. Also!! GREAT price and GREAT value for your buck!"}
{"text":"Oh man... This place is no good.
They are suppose to be known for their Roast Duck... Roast Pork and BBQ Pork... All sub-par

We ordered the beef fried noodles / $1 BBQ pork / pork and duck wrap / pork and duck burger.

All cold... Dry... Bland... But the $1 BBQ pork was hot after they nuked it.

Nothing special... Didn't see any Kung Fu.... Other than the fact the server/owner/cooks look like they can beat you up!"}
{"text":"WORST FOOD EVER. Please CHANGE THE BUSINESS NAME. DISGRACEFUL. 

Decided to try this place out since it sells itself for being known for their bbq duck, chicken and pork. This is the WORST BBQ pork and duck Ive ever tasted. To add the meaty chicken leg is an extra 2 dollars. When you don't pay the extra 2 dollars they give you CRUMBS of the BBQ pork and duck that they dig up from the bottom of the left overs that they have. 

I ordered the bbq pork and duck rice. There was obviously no meat attached to the duck, only skin. The guy decided to use 4 pieces of vegetables to cover up the crumbs of bbq pork he decided to give me. 

The milk tea that came with the food was SOOO SWEET I thought I was going to get diabetes. when I asked the waitress if she could make us a new one she did not make us a new one but came back with the SAMEEEE DAMN THING!!!! She just walked back in with it and PRETENDED TO MAKE A NEW ONE BUT IT WAS THE SAMEEEEEEEE. I GOT DIABETES AGAIN FOR THE SECOND TIME. 

Please let this be a warning. two dishes was 22 dollars. Ridiculous."}
{"text":"Decent place in Richmond Hill.   Both service and food is decent.  And seating environment is good.  Good value for a quick bite.  Obviously, you cannot compare this place to some of the higher end places in Markham and Richmond Hill but comes to other \"like\" places, this ranks pretty good.  This is our second time here in the last two weeks and will not be our last."}
{"text":"Hidden spot with great food. Before I walked into this place,I thought it would be one of those ordinary fast food joints,but I was wrong! This place has amazing roasted duck,bbq pork and even amazing stir fry dishes. They also do delivery & catering."}
{"text":"Came here on a Friday night for dinner after it has newly opened. The ad in the newspaper advertises Chinese dishes and Chinese BBQ as their specialty. Deciding to bring the family to try it (5 of us).

It wasn't super busy when we arrived to wait for a table but all the bigger tables had groups of 3 or 4 people taking up the whole day, which made the wait super long, around 30mins to get a seat and we were the ONLY ones waiting for a seat.

We didn't get tea or the menu once we sat down, service was super slow or they just didn't care enough.  When we placed our order, the waitress didn't seem like she understood what we wanted to order until we pointed at the menu to tell her exactly. Seemed like a language barrier to me. I had to go to the counter where another employee was punching the order in to verify that this was what I wanted to order. We ordered a combo which comes with Peking duck. The Peking duck was more of what we were looking forward in trying from this new place.  The food took a long time to come and they came out one after another SLOWLY.  

The taste of the duck was average but there was barely any meat on it. It wa cut thinner than other restaurants and it seemed like they only gave us HALF a duck, literally everyone got 2-3 pieces and that was it. The rest of the dishes were just average, nothing that you can eat here but not elsewhere. Price wasn't cheap for the quantity and quality of food served.

Wasn't as great of an experience as I hoped for and after we after everything on our table, we also had a fried rice which never came and it was at least and hour since we ordered. Most likely they forgot to punch it in and we definitely didn't have the patience to wait another 15-20 mins for it. Portions of each dish was also really small, not too reasonable for the price charged.

DEFINITELY A DISAPPOINTMENT AND NOT COMING BACK!"}
{"text":"Terrible service. We went twice but will never go again. 

What a pity, as their bbq pork and fried rice is not entirely bad. 

Just stay away from their so called burgers and wraps...you can do a better job at home. Very unprofessionally put together (wax paper wrapped, looks like cheap takeout on a plate), had extremely stingy amount of filling, and lacks visual interest. Bun and tortilla were stale, and you can tell even after they toasted it. 

Service was lacking on our first weekend visit, but the bubble tea was good. So we went back for a weekday lunch, as I was craving bubble tea. No one was available to take our order for the longest time, especially when the lunch takeout customers came in. We should have got up and left, like some other people did who were fed up waiting. 

Lunch special includes tea. But they had no bubble tea yet! So we ordered Hong Kong style tea. But they didn't have that either!!! What's the point of this lunch special then, that costs $1.50 more than their a la carte menu? Their excuse was their tea person was not in yet. They gave us simple seaweed soup instead. $9.99 for chicken fried rice and a small bowl of crappy soup in this kind of setting is not worth it. 

It was dead quiet when everyone left, but us. For the entire time at both our visits, there wasn't even background music to fill the void."}
{"text":"Came here on a Saturday for lunch over the long weekend... decided to give this place a try after seeing all the flyers and lawn flags they had in my neighborhood over the past few months.

This place seems to have a little bit of everything from bubble tea to bbq items (duck, pork, tofu) to fried rice and noodles to oysters/fish/lobster; a rather odd mix.

We ordered 3 dishes between 4 adults (fried vermicelli, fried rice and a noodle with meat sauce). They have a introductory promotion where you can add a dish of bbq of your choice for $1.. they give you a small plate as a sampler, not bad.

The food here is decent, one of my complaints would be the portions for the price. The fried rice/noodle dishes average to be about ~$10 each and the portions are really quite small, enough for each person to have 1-1.5 bowls.. something similar at Congee Queen you would get 1.5x more! Additionally, they do not have breakfast/lunch combos like most other places...as I would have expected. They have afternoon tea but the menu is quite limited.

We were one of two tables there on a Saturday lunch hour..which is a little concerning. The service was great, very friendly and helpful staff."}
{"text":"I am surprised this place is still in business. 
The restaurant is mostly operated by people whom you can tell have never worked in the food and restaurant industry before. Staff was unresponsive, slow, clumsy and inefficient.
Prices are high, yet portions are small and quality is subpar. 
I ordered a BBQ duck burger at 5.99$+, and literally, got in it merely 3 thin sticks of cucumber and 2 of carrots, approx. 6mm x 70mm in dimension each, plus 3 small pieces of duck *skin*. I repeat: they were 3 pcs of duck *skins*, with absolutely no meat attached. The filling was so epically stingy that I made sure to show it to everyone at the table (5 of us in total).
The BBQ items were only so-so, in rather small portions. Stir-fry noodle was a fail, as it was all broken up in wet bits.
Walking out of the restaurant, I swore I would have to treat and feed myself better."}
{"text":"2.5 Star 

Kung Fu Chop Chop is not a martial Art School but a place for Chinese food. Their specialty seems to be in BBQ and Taiwanese Style Bento box which is good for a quick lunch.

Just opened a few days ago and staff all still in training, there are definitely rooms for improvement. I like how management was presented and able to address concern directly from customers.

We were here for a late lunch early afternoon tea. Quite a few of the items were not available and trying to order can be a little challenging. 

We ended up sharing: 

Lunch Bento with 3 items ($7.99): BBQ Pork, Beans with Minced Meat and Salt Pepper Chicken - I do not like food that has been under heat lamp for a long time. Beans was soggy and the chicken was not crispy. Stay with BBQ items might be a better choice.

Noodle in Spicy and Sour Soup ($5.99) -  Made to Order but worth the wait. Better than the pre  prepared food under the heat lamp. Portion is big, great for sharing! 

Since Kung Fu Chop Chop is so new and still working on numerous issue, I would give it another try. Especially they are offering 20% off Grand Opening Special till at least August."}
