{"text":"I've had better.  
Daing was overcooked.  
Tapa was not the best.  
Garlic rice was ok; again, I've had better.
Tocino was a little dry.
Pancit was subpar.

The only thing I did like was the longanisa; not too fatty yet very tasty.  Was not brave enough to try the other stuff like kare kare, adobo, nilaga, miswa, etc. because they might use MSG.  Although this place is AYCE, I was not interested in going back to the buffet for more."}
{"text":"Phil-USA Bikers held a breakfast officers meeting last July 24, 2010 at Kusina ni Lorraine.  Kusina ni Lorraine customer service is the lowest of the lowest.  Before two hours of our meeting, we were told by the owner, I believe her name is Aida, that we need to move our motorcycles to the uptairs parking area or leave because there are  only few parking spaces for other customers.  They do not have the right to make us or any paying customer moved their vehicle from the front parking area.  One, there is sign that limits our time to park.  Two, there is no sign that says \"Kusina ni Lorraine\" parking space so, it is a public spaces.  Their food is close to poison.  I had \"Bopes\" that morning and I have to missed my lunch and dinner because of gas built-up on my stomach.  That will be the last of me Kusina ni Lorraine visit."}
{"text":"I went to this restaurant since it was recommended by the locals.  I must say: ' THIS IS THE WORST FILIPINO RESTAURANT you can ever go. The food is awful no taste at all. The noodles was dry and everything was so GREASY the worst part the SERVICE SUCKS!!!. The daughter of the owner was so rude, no manners at all commonly called as the palenkera attitude.  I REFUSE TO EAT HERE AGAIN. Department of Health should be notified."}
{"text":"Dishes are pretty good,although,they tend to have more fat on their meat dishes,but still decent..My main complaint is most of servers have big time ATTITUDE,especially the son of the owner(young guy),there is absolutely ZERO CUSTOMER SERVICE in this restaurant,being nice and friendly,are something that they can NOT provide to all their customers,they are probably not being treated well,or maybe,they are arrogant about the fact,that they are the only decent Filipino restaurant,in the NW part of the Valley.."}
{"text":"Best Filipino Buffet in Vegas, all the other ones either don't have enough selection or isn't that good. Never had a bad experience here, whenever I go here on the weekends it's always packed full of people especially during lunch time. All the food has the authentic taste that most Filipinos grew up with. For $8.99 that's a steal. If you happen to be in town, you have to check KNL out.  KnL has definitely created a buzz within the Filipino community since it opened."}
{"text":"I've eaten here several times & the food gets horrible each visit. This is my last! They leave the food trays on top of the others bc they don't have room for it to be in the controlled & proper temperature. They recycle the meat or use spoiled meat. Some reviews say it's quality food, but it's not. It's rotten, spoiled food. 

I recommend the original location off Maryland pkwy. They're much cleaner & food tastes better."}
{"text":"From my experience I wouldn't recommend eating here they mostly give more sauce than actual meat pieces or vegetables to make it seem like you have a lot . Also they store RTE food under shelves of boxes which to me is very unsanitary . I've also seen customers touch food that is on top the food warmers serving themselves and putting them back if they don't like them which is gross . Also most of their meat is really fatty which isn't much of a good flavor. The customer service here isn't really friendly."}
{"text":"The staff are very friendly and helpful. They will always stop to talk to you, or assist you when asked. The restaurant is clean and has plenty of seating, and the attached Asian grocery store has the stuff you need if you're already there and don't want to drive down to Seafood City (a few blocks down on Maryland). The prices are inexpensive--$8.99 for the buffet, and $1.49 for a fountain drink. Then there's the actual food: it's a buffet under two buffet warmer lines. It's hot, ready, and about average. It's not the best in town. But I go there a lot because I know exactly what to expect and the owners are so cool. After half a dozen visits, I've never had any complaints about my meals. The rice is never too dry or wet, and everything is pretty salty. But that's what you're there for--inexpensive, Filipino comfort food in an all-you-can-eat serving size. The only real hassle is the parking--the lot has an awkward entrance depending on which direction you're driving on Maryland Parkway, and it's on a sketchy stretch of road. There have been a couple of times that friends and I left around closing and could not continue our conversations in the parking lot--too many unsavory types leering at us and lurking about. But the food is decent, cheap, and always ready, and the staff are kind and helpful."}
{"text":"HEALTH INSPECTOR NEEDED ASAP. This place is fucking dirty like I mean the poor side of the Philippines dirty. They had food sitting out of the heaters starting to curd. It was as if every dish they sold was to resemble cottage cheese. Not only that, there was a rude fat short cashier. She looked very similar to the trolls you hear about as a kid with drawn on eyebrows. She was rushing me when there was no one else here, I understand if it was busy but I could hear crickets along with her annoying mouth, asking if I was ready for the millionth time. I took awhile to choose my items due to feeling as if I was playing Russian roulette with food poisoning being the bullet. The only time the workers decided to move and actually re-pan the items was when they were told. I thought they were adults but obviously need to be told to take responsibility to run a business. It was a waste of time, money, and gas. Steer clear and drive the distance to somewhere actually worth eating, unless you want to visit the troll with her food that she obviously cooks under the bridge next to her eyebrow makeup stand, while rushing you out the door."}
{"text":"Since moving to Summerlin Las Vegas, I yearn for typical Filipino food at reasonable price. After 2 months since my moving into Vegas, I stumbled upon a nice young Filipino guy on the Bus Stop one Sunday morning. We talked and I did mentioned that I am looking for Filipino breakfast with fried garlic rice, eggs over easy, and longanisa. The young man who told me that his name is \"Tan\" said please go to \"Kusina ni Lorraine\" where I am currently working. So, we headed to the restaurant. It was 10:00 a.m.. The place is large, clean and workers are very polite. I easily feel at home. It is true! The Buffet Station was filled with authentic freshly cooked Filipino delicacy. I hardly can't decide which food to try. So, I decided to take a little of each. I loved Kare-Kare filled with vegetables, love the \"chicharon bulaklak\". There is chicken soup in tamarind and lemongrass. So gooood!

Anyhow, it was an excellent find. The resto is infront of The Boulevard Mall Old Navy and Sears on Maryland Parkway Blvd. From the Strip take Bus no. 203 going East. Going back to the Strip take the same Bus heading West to Las Vegas Blvd. 

If visiting Vegas, eat here at \"Kusina ni Lorraine\", just US $8.99 plus Tax Total = $9.72. Soft drinks extra. 

Take my word. You will come out well fed without busting your vacation budget.

Henry Sy Jr."}
{"text":"Best filipino  buffet in Vegas. They have the authentic filipino dishes and it's delicious! There's many selection."}
{"text":"Pretty good Filipino food - buffet style! They also serve for breakfast, lunch and dinner. The staff is nice and friendly. The restaurant is kept clean and room temperature is fair. I come here when I don't feel like cooking."}
{"text":"The selection was good and worth the price tag of $8.99 + $1.00 service fee to use a charge card. Some potatoes in the menudo was cold? Not quite sure why that was. Some dishes were too soupy for my taste. The veggies were half cooked in the pinakbet. The ginatang mongo was good. They could've had more Filipino deserts other than grapes, watermelon and cantaloupe. Parking was some what of a hit or miss, not a lot. Otherwise the food and customer service was good."}
{"text":"The food is bland and tasteless. Maybe I'm spoiled by good filipino food. The tocino is flavorless, how can this happen? The karekare had no flavor as wells as the adobo. Really? How can you botch those up? 

At least the food was warm and fresh. But I would eat anything cold with more flavor. The food here isn't made with care. This is a big let down."}
{"text":"I was going to order for Christmas dinner but i decided not to. A lot of their food are just on the side no heat whatsoever, it just didn't look clean. A lot food spills. This place is not forme."}
{"text":"Nothing to rave about, three or more of the entrees tasted like it had been couple of days old and reheated, you know how it looks when meat starts to break apart and starts getting hard and chewy? I kinda tthink they are cutting down on cost. That was part of my expierience. I'm trying not to discourage anyone from going and expierience filipino food,  but  if you don't like it, theres lots of filipino restaurant to choose from. And $10.80  is not what its worth."}
{"text":"First time to have  Filipino cuisine and it was great!

There were lots to pick from and they were always rotating to keep it fresh. And for 7.99 it was well worth it.


The restaurant was VERY CLEAN and the staff was overly friendly ready to answer any question the newbie questions I had.

Only downside was nothing had names so there was no way to know what you were eating. It was a surprise with every bite. 

Will suggest it to anyone"}
{"text":"Me: you guys have lechon?
Her: no. We only have lechon kawali
Me: ...ok. Gimme an order then
Her: of what? 
Me: ....lechon kawali 
Her: we don't have that. 
Me: ....you just said.... nvm

Imbeciles."}
{"text":"II went there to have dinner..place is always  empty anyways...the owner LORRAINE is a snob..no personality at all I don't have any idea why I spend my money there..and got sick after..I won't be coming back at all...food is salty and greasy ...not a good place to have dinner and be treated that way."}
{"text":"Kusina Ni Lorraine is our favorite go-to comfort food when we're in Vegas.  When you're tired of all those pricey American buffets, this one hits home.  And the price is very decent, heck it's actually very cheap at under $10!!, for all the food and variety that you get.  If you're looking for gourmet, this is not for you.  If you're looking for clean (esp the bathroom) and cozy, nope it ain't the one either.  If you come around 1pm, most of the dishes are getting replenished with freshly made ones (or at least we hope they are, lol).  It's not as bad as other people think, though.  It's comfort food.   And we like it.  If there's one dish that you don't like the looks of over there, chill - there's 30+ more.  Can't complain for $10!  It's loose change for the amount we spend overall in Vegas anyways. And if you think about it, you really don't want to pay a lot for Filipino food.  We all know how cheap it is to cook our dishes."}
{"text":"Came in today to check this place out. Food wasn't very good, dirty and the location is in somewhat sketchy. Will not go back."}
{"text":"No Improvement.  Very Rude workers.   If the manager is not there, beware.  I would avoid this place until they have consistent, good management that is actually on site.  They let the employees do whatever they want and treat customers badly or however , because there is NO Management on site most of the time.  BEWARE!!!!!"}
{"text":"Cheap and super flavorful food, this place has the most selection out of all the Filipino restaurant I've ever been to! Less than $10 for all you can eat is pretty awesome."}
{"text":"These cheap, greedy ppl. I spent $40 here (3 things) and after I paid, I asked for a bag to hold it all. The man told me \"Oh.. just hold it on the bottom\".. gesturing me to hold my 3 items with both hands. Really?! He would NOT and DID NOT give me a bag!  I bought 2 Ubes (and 1 leche flan) and if you know Ube - it is thick and heavy! The foil tray they use to store the Ube in is cheap and thin! (Meaning - you can easily drop the ube! Which I almost did cuz the tray they put it in is NOT sturdy enough for Ube!) I'm not going to argue with a greedy person so I'm just happy to write this review instead and hopefully they will change their attitude! If I didn't have another person with me today to help me open their front door, help me open the car door since the greedy man didn't want to give me a bag to have one free hand, etc... then what? What if I accidentally dropped something bc the greedy worker didn't want to make it easier for me to open their front door when I left? Would they be considerate and replace what I bought? They rather be greedy! I just spent $40 and you didn't want to give me 1 plastic bag that cost you pennies?! You rather save pennies than keep a customer who will spend $40 every other week on your business?! You rather be greedy and cheap instead of smart and successful? Have it your way. Never going to these cheap, greedy, inconsiderate, unappreciative business owners again! Just because they are the only \"buffet\" type Filipino restaurant in the area, they probably think they will not lose customers so they think it's okay to be greedy and think it's okay to treat their customers horribly. I'm not spending my hard earned money on selfish, greedy ppl like this!"}
{"text":"Everything is perfect food delicious and the best for me is the stuff working here and the manager of this place thumbs up.. I will definitely visit here everything I visit Vegas..."}
{"text":"I hate that this is the closest Filipino restaurant near my home. About a month ago my girlfriend and I came here to eat breakfast. We had tocino, eggs, and rice. During our meal we found strands of hair in both of our plates. We decided not to eat there again. Today we planned on eating at another Filipino restaurant, but they we're closed. Foolishly, we decided to give this place another shot. We took the food to eat at home. The diniguan had zero pieces of meat, literally only fat and intestines. The squash and bitter melon  in the pinakbet was very undercooked, rock hard. My gf had to cook it again on our own stove top. Smh. They got us good twice. Never again. I would drive an extra 30 min to another location if I had to, to get my Filipino fix."}
{"text":"Great selection of Filipino food. Their diniguan was the best out of all the dishes in my opinion. Overall, Good price of you're cracking that Filipino food."}
{"text":"People were friendly, food was good.... Definitely was enjoying my Sisig and Beef Steak.... Until we found THREE bugs in our Sinigang! I couldn't even finish the rest of the food we ordered."}
{"text":"We decided to try this buffet again, we were in vegas last year and wasn't impressed with this establishment for the main reason: FOOD IS ALWAYS COLD!!!! For goodness sake, turn up the heat underneath where the food sits and no need to make a mound of food, the dilis was piled  mountain high but tasted stale and cold. I will guarantee you from getting your plate of food to sitting down, your food will be cold. Food is bland, it's seems like they are more concerned with the quantity of food they put out instead of the quality. I won't go there again."}
{"text":"I love coming here when I miss food from home. It's super inexpensive and everyone that works there is friendly and I love supporting small businesses. Always leave here satisfied and full! You won't regret trying this place(:"}
{"text":"Saw a worker drop a couple of plates on the ground and put it back on the trays for serving. Hmmmmm E-coli yummy. Sub par food gives this place one whole star!"}
{"text":"Awful!!! I came to this location on Trop & Ft Apache with expectations of good, delucious food comparable to the Maryland Pkwy location food. I ordered a simple, traditional bangsilog, which on the menu says comes with coffee, 2 eggs, garlic fried rice tomatoes and onions for $5.99  My order came with cold & soggy fried bangus., cold fried rice w/ cubed carrots & peas & no garlic!!!! , overcooked eggs, no tomatoe or oronions & instant coffee with warm (not hot) water ( from a dispenser).  When I asked about the  garlic ftied rice, I was told 'that's how we make our fried rice!\" It's fried rice alright but NOT farlic fried rice! ! If you have cravibg for traditional Filipino farmer's breakfast, don't come here. I suggest you trek to the east side location instead. It's worth the drive if you wantt good, fresh Filipino food. The other locations simply do not live up to the orinal location. Very disappointing."}
{"text":"First time that I have tried this place and I'm not disappointed at all.  I ordered the BBQ grilled pork and giniling with garlic fried rice and all very tasty.   A variety of selections from their menu and reasonably priced. Next time, I'll try their breakfast."}
{"text":"The food is okey . The portions are very small , esp , with mostly bony meat. All you get are bones and vegetables in a small or medium to go cups ."}
{"text":"This places was good. Greatest chicken kabob. Good pancit. Pretty good lumpia. Service was good"}
{"text":"I'm all about customer service but it took a back seat to the really good food kusina had to offer. They really made it more visually appealing adding a mini grocery. With all the comfort foods that fillipinos like. The service was and still needs to worked on but the price and the quality of food was really good. I had the two item combo only $5.99 plus another side $2.50. Pork singiang was delicious, bungous fish was crsipy and not oily. The forbidden dinuguan ( an acquired taste) was salty, luscious and gratifying. So overall. I thoroughly enjoyed everything. It will get one more star but like all filipino fast food customer service is least to be desired here. I'm also a Filipino myself so I know ;)."}
{"text":"Good tasty food and $10. for buffet (Fort Apache) location in Las Vegas was good.  Miswa soup was awesome.  Go there, you'll love it too."}
{"text":"If you need a taste of Filipino food while here in Las Vegas, there is no better place then Kusina Ni Lorraine All You Can Eat Buffet for $10 (Drinks are additional) I have eaten at several Filipino Restaurant and no one can match there cuisine. It's located on the west side strip mall on Maryland Parkway across from the Sears Store. Parking in front is limited unless you use the rooftop parking. The best time is go weekdays is an early lunch around 11:00 am. Dinner about 5:00 is okay, weekends a lot of filipinos come here not only to eat but to catch up with family and friends. The staff may greet you in Tagalog first (which I don't speak, born here). They will seat you to your table myself I just point to the buffet and they understand and that I will find and open table. If you are looking to stretch your $ then this is place to go. Avoid the over price, long lines casino buffets and go here instead especially if you visiting or a local you can't beat it."}
{"text":"I found this place by accident. My wife and kids were at a discount shoe store (extra ghetto) and I took a little walk down through the shopping center and there it was.

The GOOD: AYCE Filipino food and it's GOOD. This beats all the other Filipino restaurants/buffets/cafeterias I've ever been to and I've been to about 6 of them both here in Las Vegas AND in Hollywood, CA. The selection is much bigger and the food tastes better in some cases. Also, it's pretty cheap for what it is ($10.03 gets you the buffet and a drink if you're paying by cash)

The BAD: 3 things didn't sit well with me about this place: (1) They are either (A) trying to save a buck by keeping the A/C off and running big fans or (B) trying to make the residents feel at home in the humid heat by keeping the restaurant hot. You choose. Either way I think it's ridiculous to NOT have the A/C on and to have all your customers sweating while they eat. Keep in mind that this is VEGAS in the summer! One of the fans wasn't even pointed at us it was pointed at the ceiling. Go fig.. (2) They charged me an extra $1 because I was paying by debit card, which is illegal by Visa/Mastercard policies. (3) It's in a really SEEDY part of town in Central East Las Vegas. There were bums and drug dealers walking all over the place. Most of the other shops were CLOSED around it. Funny sidenote: The shoe store we were in (about 200 feet away from this Filipino restaurant) was sooo GHETTO. They had all these pictures of black women (kids and adults) stealing shoes. These were people they caught on camera stealing shoes... from a DISCOUNT shoe store,,, like I said, it was a SEEDY neighborhood filled with SEEDY people.

FINAL VERDICT: I'd still go here because that much good food at that price can't be beat. I'd give this place 5 stars if it weren't for (1) the A/C being off (2) charging me an extra $1 to use a debit card (3) being in a seedy neighborhood"}
{"text":"Love love LOVE this place! The night staff is so nice. They treat me with the upmost respect and have so much patience for me explaining all the food items. I can't say the same for the day staff though.  The food is so good and well priced. They just opened a buffet and it's pretty good price also! I like this place better than fiesta and Gloria's."}
{"text":"Food was okay.  But the lady in the counter who is wearing a yellow shirt (I'm not sure if she's the owner) was really rude.  Sadly your own countrymen who just came from my own homeland acts differently and that is very very far from a true Filipino who is very friendly and hospitable.  :-("}
{"text":"I agree with a lot of the reviews here on yelp, the food selection was at least 15 items, the price is $8.99, maybe I came at the wrong time but some of the items had no flavor & some was pretty good like the BBQ chicken.

I would try this place again maybe not on a Friday.

Staff was nice"}
{"text":"This little place is a combination of a small grocery shop and fast food. If you're craving for lutong bahay, mom's or grandma's cooking, this is the place. They have a variety of filipino food and the servings are humungous. They also offer party trays for lumpia or anything - meat, noodles, vegetables for your party needs. This is my go to place for lumpia party tray. Simply the best! 
Also try their halo-halo. Simply amazing!"}
{"text":"I need to convince the parents to take us here more often instead of our usual spot at Pinoy Pinay. It was hard to come across something that wasn't good. From the adobo, to the pancit, to the bistek (beef steak), to the tinola. It was flat out scrumptious. You're guaranteed to make at least two trips. Forgot to mention it's buffet style, which is a plus in my book. No doubt I'll head back here the next time I want Filipino food in Vegas."}
{"text":"Disclaimer: This review will be based on the catering option.

This chain's location is on the corner of Trop and Ft Apache in a little strip down the ways from the Hobby Lobby shopping center. The food is presented buffet style, and it's also a little market inside offering fresh native veggies, to frozen novelties, and even a mini health and beauty section. There are also booths for seating if you'd like to have your food inside.

They have several catering options ranging from different prices. I decided upon option A (not exactly sure what they're called) which is 5 trays that feed 20-25 people which is $120 plus tax, one of the better deals for catering in the area for a decent amount of people. They don't require a down payment, you'll pay in full when you pick up. 

The day of the party I was having, my order was prepared right on pick up time and they also threw in a free dessert! An employee brought out a cart and helped bring them to the car and we were on our way. I noticed the trays were a little smaller than the average 9 x 13in trays, and a little shallow. But not to worry, the contents were great!

Here's the breakdown:

Beef Steak Filipino (4.5/5) - Flavors were great, the meat was pull apart tender, and the soup/sauce was excellently marinated. Only reason it's not a full 5.. it was SO OILY and there were a couple pieces of straight, wiggly, fat.

Chicken Adobo (4/5) - From the looks of it, it did not look like chicken adobo. I'm used to a deeper, soy sauce based dish, this looked like it lacked that dark soy sauce look. But nonetheless, everyone said the flavors were good!

Pancit Palabok (5/5) - The sauce the flavorful, the dish was elegantly dressed, and the noodles were thick. Very good flavor!

Pork Sisig (5/5) - WHATEVER YOU DO, GET THE PORK SISIG! Kusina Ni Lorraine has probably the BEST pork sisig I've ever tried at any Filipino establishment by far! Can't go wrong with this dish, good texture and lots of fatty flavor.

Dinuguan (5/5) - Otherwise known as \"chocolate meat.\" Very selective dish, not for the faint of heart. The sauce was rich, thick, and hearty. It was also filled with bits of chunky, fatty pork and a little bit of spice.

Maja Blanca (3/5) - It's pretty much a sweet pudding/jello mixture with corn in it. The least touched item. The texture is interesting, but just not my preference since my mom makes her own that's very delicious!

I called the week of my party, and Ate Joyce (the woman I spoke to on the phone) said she's phone me confirming the order. She did so within less than 30 minutes, which was very timely and awesome. 

I definitely recommend this place if you're having a large gathering and don't feel like cooking or if you're too lazy to make dinner. They have great deals and the servings are great since Filipino food tends to be very flavorful and on the fatty side. Even for a quick bite or lunch or even a snack, they have it all!"}
{"text":"Ordered Lechon for a birthday party. Delivery time is 1pm. They delivered it almost time but the Lechon look like been cooked for days already. The skin was wrinkly and not crunchy at all. It looks very skinny for a 20 to 25lbs! Waste of money!"}
{"text":"I felt like I was eating at at Filipino family party at this place, for only $7.95 per person.  CASH ONLY (leave the credit cards in your wallet).   You can eat as healthy (or unhealthy) you want here.   Non-Filipinos were eating here when I visited, so perhaps they think the food is good here, too ??   

Looking forward to coming back here.  Worth it, especially if you are from out of town, AND have a car rental.  Not sure it's worth it if you have a take cab from the strip, since it's a lil bit of drive.

Food isn't really greasy for Filipino food.  Didn't taste any MSG, either =).  

Limited dessert selection (i.e. fresh fruit), but you don't eat here for the dessert.

Enjoy your favorite ABS-CBN or GMA shows, depending on what channel is on !  Great service."}
{"text":"I feel like i'm back home! Cooking is great, staff is great, this really just takes me back to Philippines. Where everything was of equal taste for the buds."}
{"text":"Good food. Love the Kare Kare. Ordered an extra large to-go but they didn't have enough. We agreed to wait 30mins  for a new batch to be cooked. They gave us more meat due to the wait. Great accommodation. Clean and well organized."}
{"text":"The food is okay, last time I went the chicken was served cold and overcooked. It was so dry I couldn't even finish it. The place also isn't very clean. It has been on dirty dining and was one point from closing."}
{"text":"While visiting Vegas with family, our family friend who lives in the area took us here. Where my mom currently lives does not have filipino food available, so she was excited to go to a buffet that was exclusively filipino food.

The price is reasonable... I think it was a little below $8 a person (not including drinks). The food was really good and the variety was great! Whenever one dish would run-out, they would bring out a totally different dish in its place. So I knew what we were eating was fresh (for a buffet haha). I guess that's also a downer though. When your favorite dish is gone, it's gone (well until the kitchen decides to make another batch). Loved the bilo-bilo that came out right when we finished, so I had to go make a quick run to grab some before it ran out.

The manang (who I assume is the owner or family of the owner) was very kind and great to talk to. She kept apologizing that they didn't make a certain dish that a person in our group wanted to eat. She also gave me the heads up that the bilo-bilo was out. I wouldn't go out of my way to eat at this place, but I wouldn't not go back here."}
{"text":"I visited this place while visiting from Chicago this past weekend. Food was great, and got there before the lunch rush so got a lot of fresh food. It was $9.99, drink not included, which is a great value especially since I don't have a lot of Filipino restaurants where I live. If I'm ever in Vegas in the future, I will make sure to visit this place again. Only reason I'm knocking off 1 star is because for as much entrees they serve, I wish they had more desserts. Other than that, food was amazing!"}
{"text":"Buffet food looks old at times...Been eating the food many times (wife filipino)...At our most recent visit the food was all taken away @ 7:30pm...Not good! Floors very slippery upon entrance...Tables tight in dining area..A lot of clutter! Parking is tight and annoying! Bathroom surprisingly not to bad!"}
{"text":"Food is great.  plenty to choose from.  

I like their adobo squid.  I had them as a kid and it's been a good 20 years since.  however, for some reason, they don't remove the cuttlebone.  so be careful on your first bite.  either lack of time or lack of knowledge on cleaning them up or they think cuttlebones will add more flavor to the dish or that's how they're cooked from 19-kopong-kopong

one big turn off is their rice.  either low grade or they don't have a rice cooker.  or maybe they want you to focus on the 'ulam' and skip those carbs."}
{"text":"I love this spot. $8.95 for all you can eat (sodas are extra) so you can't really beat it. The food does usually taste like it was cooked really quick, instead of for hours like you would to get super tender meat. I grabbed a piece of tocino on my second visit there and it was too chewy, I didn't eat it. BUT service is great, it's a total family operation and all the people there are nice. So it's not 100% A grade filipino food, but if you're looking for a quick and cheap spot to satisfy a craving, this place is the one. They also have a store connected to the restaurant with decent prices on things such as corned beef, that are usually pretty pricey everywhere else. We will be back again and again. Salamat!!"}
{"text":"Ok I just moved into the area and came into Kusina Ni Lorraine to get some take-out.  This place was extremely busy at the buffet so that usually is a good sign.  My dad bought some entrees and I purchased some dessert items.   I bought 2 karioka sticks, 1 banana que, and 1 halo-halo.  I gave them a $20 bill and received $7 back.  Of course, there is no pricing on any of the items except the halo-halo, which was listed on the board for $4.  At first I thought this was really expensive and after consulting with my wife and dad in the car, my instincts were right.  Being Filipino-American and only being able to speak in English, I felt they definitely decided to pull one over on me and overcharge.  As I was leaving, they were talking about me in Tagalog and I'm not sure exactly what they said but I laughed and they knew I understood.  So when I got home, I anonymously called and asked how much the karioka and banana que are.  They told me $1.99 for the banana que and $1.75 each for the karioka.  So the total should have been $9.50 instead of the $13 I was charged.  I immediately confronted them about the price discrepancy and the lady obviously remembered me coming in and came up with an excuse saying she charged me for a \"large\" halo-halo that cost $6 instead of $4.  Anyways, you get the point.  The halo-halo and banana q weren't good and the karioka was decent.   My dad ordered sisig and it was soggy.  The other entrees he got weren't that good either.

We won't be coming back and I'll be sure to tell others not to waste their time here.  It's too bad because they lost potentially long-term customers.  I'm sure there are much better Filipino places in the area that I'll be giving my money to in the future."}
{"text":"This place is awesome. Food is fresh and affordable with all you get with the combo plates. The employees are so friendly. I'm glad it's near my job so that if I need ingredients to make Filipino, I can pick it up there. Check it out!"}
{"text":"Clean, reasonably priced, great variety of food selection. We even got to meet Lorraine :) 

Came here for brunch on a Saturday, and they had tocino, beefsteak, sinigang, karekare, daeng bangus, adobo, fried rice, eggs, longonisa, and a bunch of other stuff. Not sure if the choices change for lunch and dinner. Wish they had more dessert options like turon or ube stuff, but otherwise a pretty good Filipino buffet for $8.99. Also, drinks are not included. But I would come back"}
{"text":"If I could give no star I would... 

This place sucks!!!!! 
1. Everyone comes in for buffet price. $8.99/person. Sure that's not too bad. But young kids are charged almost just the same at $6.99/child. My kid hardly ate anything. Why the neck would I pay for rice and soup and 2 pieces of meat for a kid!???!! 

2. Lemme start by saying that the food totally sucks. Eggrolls were ice cold. As if it was cooked yesterday and served today!? How gross??!! 

3. The rice... C'mon, even a kid can cook rice better than them. It's very dry and almost hilaw. 

4. As we were about to complain, we spoke to one of the ladies that worked there who never bothered to pay attention to our complaints. 

5. The sinigang... Hardly had any meat in it and it took forvever for it to come out. 

6. Bathroom, uncleaned, unsanitary, disgusting, stinky. Worse than a portable-potty! 

Altogether, our experience here is beyond horrible! Would never come back!!!"}
{"text":"My second time and still a thrilling experience to try various Fil dishes in one place.  It is buffet but not your typical \"bleh\" taste common in eat-all-you-can places.  Masarap!  But... this is just my say.  Give it a try when in Las Vegas."}
{"text":"One of my favorite Filippino buffets in Las Vegas. Its not their fault they lost a star. Its just the area. Lock your car. It is a comfortable, and clean restaurant. When I dine here, I get memories of the Philippines."}
{"text":"I came here for lunch. Located in a sketchy area with little parking. We walked in and the nice lady seated the four of us. We decided to get the buffet which they are known for. I didn't get a chance to take very many photos cause I was hungry and craving Filipino food. 

For the first plate, I got pancit, rice, menudo and beef with carrots. So good. I saw my favorite dish kare kare and topped it on steamed sticky rice. It was delicious and cooked well. There was tripe in it which was soft and tender! I even went for seconds for the kare kare which has a peanut butter sauce with meat, tripe and bok choy. 
Everything was good that I tasted. 

There's a Coke refill machine in the back which was clean. The ladies working here were so polite and cleared our table off. I got a Diet Coke. I would definitely come back to eat here. Reminds me of mom's cooking. 

Salamat po!"}
{"text":"If you're looking for Filipino products without having to go all the way down to Maryland Pkwy AND don't mind paying 3-4x more then this is your place. I only give it two stars because they do have a pretty good selection. Aisles are narrow. No one greets you as you come in even if they literally look at you when you walk in. This place has a \"grocery\" side and a \"restaurant\" or as Filipinos like to call it, \"turo, turo\" meaning point, point. The grocery side has a counter that has a register and always has someone there but guess what, they won't ring up your stuff there, they tell you to go the restaurant side. It kinda defeats the purpose of the register and the person standing there if they won't even bother helping you. And beware, most of their products have no prices so as someone also reviewed, they might just mark up a price. I fell for it once. The last time I was here I actually had to put stuff back after I saw the price she inputted into the register. She seemed annoyed after the 5th item I told her to take off and changed my mind on but I don't care. I get that you're paying the price for convenience but this place is a bit unreasonable. And I have tried the food here as well. It's ok but it's nothing to rave about."}
{"text":"I went here for lunch today with a group of co-workers. $8.99 per person for a buffet isn't bad. The food was okay. Didn't have any of the selections that I was looking for (like the lechon or bbq sticks). I probably wont be back. I can eat better food at my sister in-law' s house."}
{"text":"After living 2 minutes away from this food place (it's not a \"restaurant\")/\"Asian mart\" hybrid - I was finally desperate to go inside for the first time yesterday to get strawberry-filled Sunflower crackers. 

Ha! NEVER again. Let's begin our tale: 

The young buck @ the register named \"God's gift\" (\"GG\") believes that the customer isn't worth an explanation as to why he suddenly decides he can be a complete piece of garbage to them. 

My offense?  35¢, friends. My total came to $9.65.  Their \"debit/credit card minimum transaction is $10.00\".  YOU MUST look down at the torn/faded/handwritten sign taped to the divider in front of the register.  All I was worth was 

GG:  \"You don't have cash?\" 
Me: \"Uh no?\" *looks around at the messy, overly crowded, ridiculous food-area checkout in confusion*
GG:  *insert eye roll here* \"it's ok.\" 
Me:  *after noticing the faded handwritten minimum purchase declaration*. \"Oh! I'm sorry - go ahead and add something to my transaction to put it over $10. I don't care what it is.\"
GG: *side eye while ringing transaction thru* \"No, no - it's ok.\"
Me:  \"Um ok.\" 
GG:  *figurative hair flip here with slight huff and puff*

That's right, friends. I fell from the grace of GG for thirty-five-effing-cents.  If only they had prices on their grocery goods - I would've spent more. TIP:  pretend it's The Price Is Right and match the handwritten taped/sticky label/hanging pieces of paper on the shelves to the products while trying to navigate the cramped, claustrophobic space that smells like the restaurant.  If there's 2 other people there with you, good luck not walking into each other. TIP #2:  The dry noodles are in the hidden area next to the vegetables - it's display only though unless you're Gumby and can get in there to reach it. 

Don't forget to get your total over $10 or be shunned.  (They should probably just step into the current century and use Square or some such for a merchant account if they need to pinch their pennies for credit/debit transactions.) 

TIP #3:  Go to Little Divisoria on Simmons and Centennial for your Asian market needs. Fantastic customer service, my kids love the owner who is always polite and ready with conversation and they carry a great selection of Asian (& Hawaiian!) grocery & cooking products & fresh baked items - minus the restaurant smell & poor attitudes.  The best part is everything is priced and the store is easy to navigate!"}
{"text":"Pleasantly surprised with today's visit here at Kusina Ni Lorraine. 

Food:  My mom and I had the lunch buffet. It was $8.99 per person and there were about 15-20 choices! I tried the sisig, kare kare, pinakbet, pancit, fried fish, soup, and white rice (just to name a few).. All were delicious! Def get the bang for your buck!

Restaurant:  roomy, fairly clean, and you get TFC on tv. Typical Filipino restaurant setup. 

Staff:  They didn't hover (a plus in my book..!) but they weren't overly friendly either (again typical). No complaints here though. 

Area:  Parking is not that great (limited spaces) and this side of town is a bit sketchy.

I will definitely come back. This may be our new go-to Filipino buffet restaurant. This first visit sure beat all the visits at Nanay Gloria!"}
{"text":"My wife is Filipina and said it was good and authentic. I found things to eat although I wish they had lumpia or chicken bbq sticks.
The place looked clean and the layout wasn't cramped. Definitely liked it more than other local Filipino buffets."}
{"text":"First time at this place today after church for lunch.  My coworker wanted me to try it since it's his favorite Filipino restaurant. I have to say that it's pretty damn authentic! Everything was fresh and delicious, the set up is a buffet, small family owned restaurant, and you can tell there's a lot of love in the food. It's quite affordable also, $8 for all you can eat? Count me in. I was very pleased to have a little taste of the Philippines, it's been so long for me. The bussers were also very attentive, so our table was always clean when we came back from getting more food, and it seemed like a very friendly environment. Now when I'm craving some real good Filipino food, I know where to go!"}
{"text":"The problem with Filipino establishments/restaurants which I have come to realize, is that \"consistency\" seems to be lackluster.  Take for example, the newly opened  Island Pacific, you don't know if you are being served food from yesterday's cooking or the cook decided to call in sick and had someone else make your favorite dinuguan.  Its either a hit or miss and I don't have time to be rolling the dice.  

In my last few visits in this restaurant/store, the food have been excellent.  Very consistent in their flavor and the home made taste is palatable.  This is it!  So far.. I hope they continue what they are doing because my stomach is happy.  However, it's a shame that when you search for Filipino food or Asian food, it does not pop up on the maps or yelp.  You have to type in the name for it to populate.  This is a marketing issue and should be addressed by the owners if they want to stay alive in this competitive market."}
{"text":"Kusina Ni Lorraine could easily become my new favorite Filipino Restaurant in Las Vegas. We recently had their food for Christmas dinner - delicious! Portions are big but the tastes are bigger! I recommend the pancit, lechon kiwali and turon - the trifecta of great filipino food."}
{"text":"Do not come here this is the worst restaurant i ever been. Food quality and customer service are both below average."}
{"text":"Ordered Longanisa (SPECIFICALLY asked for short fat real Longanisa). NOT The hotdog like Longanisa or what so called hamonado Longanisa,  and what I got!!!! The wrong Longanisa.  This is supposed to be my comfort food and now its ruined."}
{"text":"I really like this place for two main reasons: 

1) It is VERY close to my house, literally right around the corner

2) the food and portion sizes are hard to beat. 

You can get a two item combo with white rice for $5.99, which is a deal. Better than Carls Jr next door lol. 

The only qualm I have is about the food. Some of the food is very greasy and the beef in their caldereta was very fatty. 

Besides that, we for a lot of decent quality food for only $24.00 today. Which makes me feel better that we aren't eating nasty fast food"}
{"text":"Who doesn't love Filipino food? 
Kusina Ni Lorraine is a cute little restaurant/shop that sells all kinds of Filipino goodies.
I frequently come here to grab some Filipino food to go when I'm too lazy to make my own or just need that comfort of a \"home cooked meal\". 
Food is always great, I like this fast food style Filipino restaurant a lot more than others around town. The food is pre-made and on a warmer so you basically just point at what you want. 
Prices are fair for the portion size and the taste reminds me almost of my mother's cooking."}
{"text":"Just ordered some pancit from this place. Cashier and other staff behind counter was super rude. They will not get my business again. Will try other places for pancit"}
{"text":"Delicious home cooked Kapampangan cooking! Everyone is friendly and makes you feel like family!"}
{"text":"My family always stop by this restaurant when we come to Las Vegas. Pork Sisig is my favorite and paksiw na Lechon!!! Always friendly and lots and lots of good Filipino food to try! And reasonable priced! Yum!!"}
{"text":"If you're DESPERATE for Asian snacks and don't mind paying 3 times the price for a packet of cookies this is your spot. Also if they ring you up and the price doesn't register, be warned, they'll take the opportunity to make up a price for you.
TL;DR: Rip off joint for those who can't be bothered to drive to Chinatown."}
{"text":"Their food is not bad, but far from the best Filipino food I've had.  That honor goes to my mom, and many Filipino guys will say the same thing about their mom's cooking. But I love that they are here serving a sizable North Vegas Filipino community. Then why just a 3.0 rating? Well, call me unfair, but they automatically lose one star because nothing is made to order.  This is one of those places like Panda Express, with food heated, and sometimes it's too wilted and tired. Filipinos call this \"turo-turo\" or point-point....because you point what you want.  I call it fast food.  There are not enough sit down, cooked to order Filipino restaurants around.

Today, my mom and I just wanted something light, and I opted for a large \"laga\" to go.  This is a pork broth based soup, a little too lemony for me, and there was a lot of fat in the pork.  But broth is good for you, it helps cushion the joints and helps with digestive issues as well as your  immune system. And surprisingly, the longer the bones and cartilage cook, the more of the cartilage is available to help. So this was actually a dish I didn't mind was pre cooked. About the health benefits, here is a link to an article by Dr. Josh Axe, a good friend of Dr. Oz. https://draxe.com/the-healing-power-of-bone-broth-for-digestion-arthritis-and-cellulite/  Cost was $7 for a large. A large container of white rice was $3. I got them to go, and were packed very nicely. 

I also got turon, fried bananas with a piece of langka, or jackfruit at 3/$2. Jackfruit is one of the most aromatic of all fruits. They are wrapped in a rice flour shell and deep fried.  Like most people, they use the burro banana, which is IMO nowhere are sweet or juicy as the plantain when fully ripe.  Still they cooked it perfectly., I also got a pack of some coconut milk and rice flour desserts ($7.00).  It was really fresh , sweet, and delicious.  Their icee/evaported milk and preserved fruit dish, halo-halo, is yummy as well.

My sister, who is a very busy woman, hosted my mom's birthday party last weekend.  She said that for $125, there was enough food for 12 people with food left over.  She got BBQ pork, pancit (noodles), whole fish, and several vegetable and meat dishes.  She'd rate them all between 3.5 to 4.  They completed the order by the date and time promised.  It was nicely wrapped and easy to unwrap and placed on nice plates.

I like that his restaurant has expanded into a mini mart.  This is the third such place in North Vegas.  One thing you might think about is that there are only 3 tables, and parking might be a problem.  Otherwise, hope it's around for a long time."}
{"text":"I had a craving for Filipino food and decided to go here so I could have a little bit of everything. Came in around 11 and it was open. Note that you feast first, pay later. I didn't have to wait to be seated cause there were plenty seats open but when it gets busier they will lead you to a table. I went straight to the buffet.

The inside was clean since it was barely opening. Among many of the choices, I had garlic rice, diniguan, papaitan,  kare kare, egg, longanisa, tocino, shrimp mongo and pusit. Everything was okay except the kare kare.. I put a bite in my mouth and spat it out cause it tasted spoiled and even smelled spoiled after inspection.. 

Note: the bagoong is placed where the fruits are, idk why so I didn't notice it till I headed there.

Fountain drinks are $1.69 I believe. Their fridge has a variety of Filipino drinks, even King Car! I appreciated the nice woman busser who made sure to pick up trays and dirty dishes from tables the whole time so she got a tip.

Overall again, it was okay quality, good for the price of many choices. I still see myself coming if my craving is strong again (:"}
{"text":"For the price of $9.99/person (excluding the drink), it isn't bad at all. We came here brunch time. So, the breakfast was kinda the leftovers already, like the eggs were not fresh anymore. The sinigang could've been better, lots of pork fat floating in the soup. I love kare-kare, and it didn't disappoint. The Pinoy barbecue was great. The dessert was limited only to fruits, it would've been nice if there was at least one Pinoy dessert. The only thing that did disappoint me ( and the family) was the rice; I would rate the rice 1/5 Star. The rice was so dry and hard. Even my kids noticed it. My son who has a very good appetite didn't eat much because of the rice. And, I told my youngest to put lotsa sinigang soup just make the rice soft."}
{"text":"I am so happy to find that this place opens at 7am. So perfect for breakfast. Food was fresh, portions are large for the combo and it was definitely fulfilling. We ordered longanisa and bangus with garlic fried rice. It fed both myself and the fiancée. I will be abusing this place alot when I'm in the area"}
{"text":"Seen a lot of people eating there. The food is so so. Not as good as our socal Filipino food. We ordered food here for New Years eve. We ordered kare kare & it's full of tripe. So my friend complained if we can get more meat instead of tripe. The guy on the cashier/ registry was pissed. He gave us attitude like we owe him money. We are customers we have the right to say something if we didn't like the food we paid for.  The pancit is not as tasty either. I guess there's not much Filipino restaurant in las vegas that's why a lot of people come here."}
{"text":"We live in Arizona and Filipino restaurants are few and so we try to get our fill when we go to Las Vegas where there is a large Filipino community. Kusina ni Lorraine is a buffet style restaurant and is one of our go-to places. Food is hearty and tasty Filipino fare and we get a little bit of everything. The place is clean, but could be better, and the restrooms are also clean. The dining area may be cluttered at times because they may place some fruits or goods to sell in some of the tables. The place is often crowded and I even see non-Filipinos eating, which is a testament on how good the food is. Overall, one cant go wrong if you choose this restaurant to go to when you have a craving for Filipino food."}
{"text":"Food is nothing special. I can actually cook better than their dishes. Lots of pinoy chicheria for snacks or however you say it, lol. I lived in the bay area so I expect something better."}
{"text":"I'm saddened to see negative reviews on here. Fortunately every time I'm here the food is good. 

The Bikol express is pretty good. Not too spicy. Their sisig is good as well and has lots of pork. Many places I've been the sisig has too many peppers and onions so this one was really good. 

They also give me large proportions. I've been to a lot of Filipino places where the combo platters only give you enough to fit in the to-go box that is offered. At Lorraine, they give you tons of rice and put your food in a separate container and they really fill it up. 

Their dessert however is different. The carioka is pretty good, however its not as dense as I wanted it to be. Their turon is pretty good and well sugared, but there's more wrapping than there is banana and jackfruit.

To conclude, the food has been pretty good when I'm there. I've never encountered a fly in my food, nor has it been undercooked/overcooked. It is reasonably priced. I bought a combo and three turon for about eight bucks. 

I'm closer to another Filipino place, but I prefer this place and its worth driving here."}
{"text":"Real authentic Pinoy food. Tasted just like nanays cooking. Really wish there was one of these in LA. Ridiculously affordable too."}
{"text":"My favorite filipino food in Vegas. There is always a varieties of delicious food and it includes desserts: Fruits, coconut milk rice porridge so good. The price is right $10 ayce."}
{"text":"This place is convenient for those of us that live up north, but I'd still rather drive to town. This place sells Filipino products that are $1 or more than the cost at other Asian markets here in Las Vegas, and the store/restaurant is INCREDIBLY SMALL. There's no space to walk through the aisles to browse their \"store area,\" and there's only 1 cashier to take payment for both customers buying hot food, AND store items. You can't tell where the line starts and the cashier doesn't keep track of who is next to be helped. Th entire place is disorganized and overpriced."}
{"text":"I'm not fond of this place when it comes to checking out... The more you buy, the more you will end up with tooooooooo many TAXES charged that has no explanation why in one receipt ends up with too many taxes??????"}
{"text":"You have to go and get their pancit, lumpia and garlic peanuts! Totally to die for! And, the prices can't be beat. It also has a little grocery area off to the side. Check this place out. Very unassuming..."}
{"text":"Little bit small and crowded but nice to not have to drive all the way across town for some of our favorite Filipino snacks. Friendly service. 

Recommend if just looking for a few things. Not a huge store but a cute small one with some good food on the side to order from."}
{"text":"*** 3 1/2 stars***

Kain na!

As a Filipina American, I know a little something about Filipino Food. Kusina Ni Lorraine is a go to place for my family when we go to Las Vegas. Located just a few minutes from the Strip, you can get a very extensive Filipino buffet for $7.99 per person. Pretty great deal for Vegas. 

The restaurant is very clean and the staff is very friendly. Good ol' Filipino hospitality. They have a wide variety of food options and rotate the options regularly so everything is fresh. Everything from pancit, to kare kare, lumpia, and a variety of other dishes. The one thing though is there aren't any labels on the food. So you may not always know what you are eating, especially if you are new to Filipino food. Still definitely worth the visit!"}
{"text":"Located off Maryland Parkway just south of Desert Inn is Kusina ni Lorraine (kitchen of Lorraine) or KNL as we call it...is a big restaurant buffet style that caters to The Filipino palette. They have a few locations around town...but this original location seems to be its flagship. Though the area is a little ghetto in terms of old Las Vegas, and their parking area is rather mediyoker to small...if you can get past that idea and into the restaurant, it's not so bad. The owner encourages to eat first before you pay.  Their dishes are simple but hits the spot. Breakfast is just as good serving the typical Tocino, tuyo, eggs, longanisa and so much more. They even have a small section and acts as a makeshift oriental store. A little pricey for what it is, but it adds to a nice touch for those on the go who are there already. Just caution on prices on those items incase you would rather save a few dollars...but to each their own who wants and needs it right now. They also do party trays, I've ordered here a few times and they seem to always get it right. For about 6 trays (depending on dish) it's about $220.00 with a free dessert tray included. Whether ur ordering for a special occasion or just stopping by for a quick ayce home cooked Filipino style delicacy...there should be something you will enjoy."}
{"text":"Great Selections!  So much comfort food dishes to eat .. You will truly have that Pinoy atmosphere that you are missing in this joint!  Lutong Bahay!  Price is super reasonable!  $9.99 soda not included!"}
{"text":"Visiting the Vegas area and we decided to eat Filipino food. This restaurant had so much selections to choose from. They had every Filipino dish that I grew up eating, everything was delicious with lots of flavor. Give this place a try you won't be disappointed."}
{"text":"This place is seriously the bomb!  Delicious food, excellent service and not too far from the strip.  Everyone must try this place.  I will definitely come back here when in Vegas!!! I was upset with my family from Vegas for not letting me know about this place sooner."}
{"text":"Came in today with the intent of only buying sinigang (either beef or pork) and ended up leaving with a medium sized ginisang monggo, large pork sinigang, a stick of karioka and 2 fresh melon juices. I got everything to go, as I planned to share the entrees with family. The melon drinks were too sweet for the likings of both the sis and I. It did look really bright and deep orange, which leaves me to wonder if they added some food coloring for aesthetics. Haven't seen melon juice that bright before, nonetheless it was pleasing to the eyes. The karioka came with 3 servings and it was delish! You could totally tell it was freshly made. The mochi had a good taste and texture. The sugar around the karioka was nice and crunchy without the overly gross burnt flavor. Getting to my grandmas and trying the entrees, I thought the sinigang was alright. The gal at the counter gave a good amount of protein, which was good. I hate when people skimp out on meat! The monggo was flavorful, but the pork belly pieces had way too much fat on it. The two ladies at the counter were friendly, that goes a long way for me. Overall, this spot is soo close to my home that I'd most likely be back for some quick grub to go. They have a small store within the restaurant and a decent sized seating area."}
{"text":"It was my first time going there with my friends from l.a. d food was ok typical filipno dish bt had kare-kare but u have to pay for the bagoong for .50 d food was ok."}
{"text":"Decent food quality with ok \"for here\" portions but price is not so crazy outrageous but a tad...with an \"a la carte\" grocery tax. Styrofoamed to go sizes are pretty small for what it's worth. Not so comfy dining experience being the dining area a bit too small but still doable. Takes the comfort out of eating though with peace without having that feeling of Manong & Manang staring @ your greasy lips while your busy stuffing your face inhaling your food.

Try purchasing miscellaneous grocery items & double check after receipt ring up & check individual grocery tax & most likely will dampen further visit. They seem to have their own version of the Value Added Tax if that even still exist! I Really miss Baba's Tsibugan but Lorraine will have to \"suppice\" when I get my \"Pilipino Pix\"!"}
{"text":"My \"go to\" restaurant/buffet for filipino grindz. 

Food: They have a good variety of dishes (kare kare, oxtail soup, chicken adobo, dinuguan, pancit, fried fish, pinakbet, bittermelon with egg) to choose from so its pretty much what kind of cholesterol...i mean flavor you want to taste (hehe). I enjoy the food here bc its the \"comfort food\" that I grew up on. My favorites are the chicken papaya soup and vegetable lumpia (their choices may change on the fly btw).  At $8.99 for the buffet, you are getting you're money's worth. 

Restaurant: Like others have said, its pretty roomy with a lot of tables. On a Sunday afternoon, it can be pretty busy. Its clean and TFC is always on. They have filipino snack items scattered around the cashier area for sale just in case you're still not full.

Parking: Its a little tight but then again what do u expect from a small plaza area. 

Staff: No complaints. Very attentive in cleaning up. Salamat Ate Lorraine.

\"Filipino food is 90% heavy. The other 10% is not eaten.\""}
{"text":"So much for my \"First to Review\"

I'm 2nd to review


Family trip to Vegas means a few things.
- Be prepared to eat. Buffets all day everyday!
- Practice that smile, because you will be taking lots of pics!! (Oo the Eiffel tower!, ooh the lights!, Ooh the water show!, Ooh the giant billboard of the half naked ladies!)
- Be prepared to take turns watching the kids (rugrats not allowed on the casino floors)
- Be prepared to eat.
Yes I know I said that twice, but its the honest truth. When you go to Vegas with the fams I swear they just want to eat everything.
On this particular trip, buffets were on top of the list. A full buffet of Filipino food is what made this trip different than all my other trips to Vegas!
Kusina ni Lorraine(Lorraine's Kitchen?) used to be called Lolas. It is located off the strip in a Filipino plaza. (Filipinos taking over!? First Manny, now the buffet industry??)
Good:
- the grub. Besides the typical Pancit, lumpia, adobo, they had other favorites of mine such as beef steak, kare kare(dish made with peanut butter) and other items I cannot pronounce nor spell..(sad, I know)
- Family owned. Lorraine herself took care of us!
Bad:
- if only there were more variety. (Like at the typical buffets, you have food from around the world. Here you have food from the Philippines...exciting, I know)
Ugly:
- My belly! I don't live at home anymore so eating Filipino food is rare. I made sure I packed my stomach with as much as I could!
Vegas, yes we know what happens here stays here. Filipino Buffets, please stay there!!"}
{"text":"I ordered party size food for Thanksgiving and they don't get   it right (this is not the first time it happened).  First I ordered Sisig and they didn't even include it on my order. Then, the puto I ordered arrived 30 mins late! Lastly, I didn't get the puto I ordered because they gave it to another customer who also ordered the same thing. I was waiting for my puto first and the other customer was waiting 2nd. I don't know why the cook gave the puto to the other customer. Smh! They are not organized. I saw the puto and it doesn't even have the name of the customer. 
Another thing too, we ordered Kare Kare and the meat wasn't even soft and it was cold when we picked it up."}
{"text":"this buffet is only $7.99 with soda being extra. they have a pretty clean and spacey dinning area with flat screen tvs playing TFC.  mirrors on walls opposite from the tvs so everyone can watch. considering the beat up location around the restaurant i give them props. most of the food is pretty good like their lechon dish. they could've added a chicken dish like chicken adobo or bbq or fried chicken cause there was only meat or seafood dishes. they also have some Filipino snacks and desserts that are sold separately from the buffet.

they are friendly and have good customer service. the llittle girl always does funny things cause she doesn't know any better. she took the open/close sign from the window and started waving it around while they were cleaning up and already closed. she also kept pushing away the moping bucket when they were moping."}
{"text":"Found this location by accident... quite pleased.. have been to other locations in the past.. this one is much nicer.
It is convenient that that have a store there.. no longer have to drive to seafood city or 168 to pick up items the wife likes.
And the buffet is great!!  We can now drive around the corner for good food !
Hope the keep the quality up!"}
{"text":"went here about an hour before closing and disappointed that a lot of the food was already gone & they don't make anymore. my friend and i missed out on several food items so we were bummed cuz we really wanted to try some of them. we especially love turon, fried bananas, and they ran out. the food we ate was pretty good but i wouldve liked more choices. maybe next time we will go earlier in the day so we can try everything."}
{"text":"I am always super excited about trying new Filipino restaurants in the Las Vegas area.  My family has lived here for over 20 years, so we have been very fortunate to watch the Filipino population as well as Filipino-owned businesses increase tenfold.  

My mom recently hipped me to this new place that she frequents to pick up some \"ulam\" for her \"baon\" so she doesnt have to cook.  I was in town over the weekend and my sister had a craving for some \"kawali\", so we headed on over to this new quaint place off of W. Ann.  

Just like Manila, the location of the store is logistically backwards and can be a nightmare for the constant traffic that  flows in over the weekends.  There is only one way in and one way out.  Now I dont know if its just me, but why do Filipino restaurants and stores always have awkward layouts?!  Sometimes I feel like they do it on purpose to annoy me.  The food ordering line is about 2 feet next to 3 tables that are tightly squeezed together, yet they have 8-10ft tall shelves of filipino items that most of our people cant even reach because genetically we do not grow more than  5' 7\"! LOL.  If it were up to me, I would pare down the amount of inventory on the floor and add more tables ... It is so suffocating in there!

Long story short, food was pretty ok, needed to be kept hot, kawali was room temperature and they cheated us with more pieces of tofu that looked like kawali. They did have a wide selection of fresh food offerings and filpino products, which is their saving grace, but ... Next time though, I think I will go back to Nanay Glorias, then to Gold Ribbon afterwords.  You can actually walk around in there!"}
{"text":"We stopped at Kusuna No Lorraine before heading home to California. This was our first experience here. I will say that the food was plenty, & flavorful! The atmosphere felt homely, and the staff was extremely friendly! I will be heading back here the next time I am in town!"}
{"text":"\"Pinay ako!\" That's the Filipino/Tagalog phrase for \"I'm a Filipina.\" When I saw this place had Hello Kitty stickers with \"Pinay ako\" on their wall, I had a feeling this was a good place. (Hehe, I tend to like places with Hello Kitty...who would have thought ;). 

Anyways my first instinct was right because Kusina ni Loraine is great! They have a buffet filled with lots of Filipino food! If you've never ever had Filipino food ever, this would be the place to try it out! They have traditional favorites like Filipino pork bbq, beef steak, kare kare (Filipino peanut butter stew), sisig (sour fried pork) and pancit (noodles). . They also have items you don't see often at a Filipino buffet like fried chicken skin, chicken curry, picadillo (ground beef with potatoes) and molo soup (dumpling soup with noodles).  It's a great selection of savory eats and tasty treats! I really liked that I got a little taste of all of my favorite Filipino food here! There's nothing like eating a fulfilling meal of white rice topped with kare kare sauce and pairing it with pork bbq sticks! Yum!

Aside from the savory offerings, Kusina ni Lorraine also has some desserts. They have a fruit bar with grapes, cantaloupes and honey dew. The day I went they also offered a yummy Filipino dessert via ginataang totong (coconut dessert with mung beans). The ginataang totong was sweet and very good. It is like eating rice pudding.

The buffet here is $7.99. You can pay another $1.50 for the soda.
They also offer other treats here for an extra price like turon (banana eggroll), 3 for $2 and Filipino ice cream popsicles and ice cream drumsticks, $1.50-$1.99 each. They also sell a variety of different chichirya or Filipino snacks via chips, crackers and other goodies! (Oh and  they sell non food items like the  cool Filipino stickers with the Hello Kitty I mentioned earlier ;) and Filipino clothing)

Kusina ni Lorraine is a great place to try different Filipino food! Whether you are looking to eat a traditional meal or a light snack, you can find it here! I have found my new place for Filipino food in Vegas! Pinay ako and I love good Filipino food!"}
{"text":"Not bad for a little joint off the strip. Go there around 1-3 and food will be as fresh as you can get. The BBQ is the bomb and staff is friendly. 
You come late, your too late, it's left over city from there. They open fairly early around 7 or 8."}
{"text":"Best way to go is with the2 item combo! Small kine crowded around lunch time but well worth the standing in line and waiting. Now I just need Filipino girlfriend so no have to spend money lol"}
{"text":"Coming from LA and hungry, we make our stop at Kusina ni Lorraine. When in Vegas we make a trip here, the chicharong bulaklak white vinegar! Yummm...Reasonably priced, can get a bit busy...but when your craving some Filipino food and can't decide which ulam to get, come here..."}
{"text":"Never tried Filipino food, so I couldn't wait to try this out.  The buffet is quite large and has an extensive selection.  But buffet food is buffet food.  Seems to me that the taste or the quality of food was at best average.  Nothing blew me away.  Nothing was terrible either.  I really wasn't impressed.  The fresh fruit was the best part of it."}
{"text":"Food is alright. Just dont waste ur food so u dont get charged xtra."}
{"text":"Why are the Filipino buffets not good? Have we just settled and accepted that this is the best we will get? I want to give every Filipino establishment an amazing rating but I know I wouldn't eat this at home so why am I paying for it? 

The entire buffet either was swimming in oil, fried items that were drier than the desert, or they are not keeping up with the buffet that the items dry out.

It's really disappointing because Filipino food is so good and I wish someone would just care enough to show that."}
{"text":"This place is located in a little strip mall across from a real mall and it's absolutely perfect.  The food is great. The staff is friendly and helpful. The only reason it's missing the fifth star is because they didn't have a few of my other favorite dishes. But the dishes they did offer were delicious. It was busy but not too busy to where you aren't getting a table. But the right amount of people to let you know the food is great and always fresh! Authentic Filipino dishes"}
{"text":"If you love food that's floating with oil, then go A head be my guest."}
{"text":"Good variety of Filipino food. Nice clean and huge space. The staff is very nice. I like the two Filipinas that help in the front. Very respectful and pleasant. Most of the times their Sisig is on point but there's been occasions where it was too oily. Just a tip they need to drain the excess oil."}
{"text":"Came here for brunch with the family. The food was good. Not so busy. It was clean and the people working there were friendly. 
The tocino tasted a little funny, but everything else was good."}
{"text":"Great food! Many choices, and they had Sisig and Bopis, which are a steal. They only had few vegetables though, and most of their foods are greasy, but I would definitely go back here again since the price is cheap for a Filipino buffet, and only if you're really hungry go here, otherwise, watch your calories soar above the sky. The location is not a good one, as it's in the ghetto area of Las Vegas, with bums asking for money roaming around the area. Overall, it's a fantastic place!"}
{"text":"The food was OK.  Price is good.  Service is not great. One of my pet peeves is when you walk in to a restaurant and whoever is working stares at you... like you walked waltzed in to their damn house uninvited."}
{"text":"Worked up an appetite after walking around the outlet and was craving for Filipino food. Thank goodness for Yelp, we chose to eat at Kusina Ni Lorraine. I was pleasantly surprised at the variety of foods they had at the buffet. Definitely hit the spot and will be making trips to eat here whenever Filipino food is the choice of the day"}
{"text":"Home away from home. Lots of choices at a reasonable price. Very laid back atmosphere. The staff is friendly and efficient too! Definitely coming back."}
{"text":"The food is always good. I love their pancit and menudo with extra potatoes and carrots. Prices are decent. The only negative thing is that the seating area is very cramped."}
{"text":"The food is ridiculously delicious! This is my go-to place for filipino food. I just wish it was bigger and better menu list."}
{"text":"Their cooking at this restaurant is excellent and there are so many dishes to choose from. They have their menu posted with pictures. 
Their Soups are the Best! Eat in or to go.
They also have a Market!"}
{"text":"This location was dirty. Sticky floors. The pancit was underwhelming, kinda bland compared to other locations."}
{"text":"I can't pimp this place out enough. This locations pancit is superior to the one on Rancho FYI. But oh man. The pancit is divine, huge portions. Lumpia on point as well as their BBQ skewers. My mouth is watering."}
{"text":"I've had this place bookmarked since I saw the sign go up! I haven't been to the other Kusina Ni Lorraine locations, so I don't have those to compare to, but I really like what i see of this place so far. I'm eager to write a review to spread the word to the Westside Filipino community and lovers of Filipino food - come here, enjoy, and keep this place opened! Far too many businesses have been shuttering lately!

First off, it's a turo-turo, which means \"point-point\" in Tagalog. Food is normally displayed on heat trays behind glass and constantly refilled throughout the day. You \"point\" to what you want to order. I grew up eating at Filipino establishments like this, since there weren't too many sit-down Filipino places 20 years ago. My mom would always get a two or three item plate, and we'd split between her, me, and my sister since our appetites were never really that big. Kusina Ni Lorraine (Lorraine's Kitchen) had a wide variety of dishes to choose from and everything looked very fresh and replenished. I ended up getting a two item combo with rice and soup, which was a steal for $7! They gave a large amount of rice, the menudo I ordered filled up both entree containers in the to go box, and my 2nd entree of fried fish was wrapped separately. The menudo was tasty and they didn't try to cut corners on the quality of the meat, veggies, or hot dogs (yes, hot dogs, they are delicious in Filipino cuisine). The fish was a substantial portion that I had a few bites of - saving it for later to enjoy with lemon and patis (aka fish sauce). The sinigang soup was just the right amount of sour too! I ordered some pork BBQ sticks for my husband, but enjoyed the few flavorful bites I did have. The meat quality was good without being too tough or fatty. They open at 7am the whole week, so I'm sure they have some interesting breakfast options that I'll have to come back for.

Aside from being a restaurant, this place also is part-grocery store for all your Filipino-focused needs. I saw a wide array of Filipino snacks, key ingredients such as spices and frozen meats, and desserts, including a well-stocked freezer selection of ice cream. The servers were very sweet and generous with their portions. There is seating inside if you'd like to dine in and the site of lolos and lolas enjoying their merienda made me feel very at home. If you're like me and previously from a Filipino-concentrated area (Daly City), I think you'll find a lot to love here."}
{"text":"Treated myself this is homestyle Filipino buffet yesterday before meeting a friend at the New Hispanic Museum of Nevada location at the Boulevard mall across the street and before attending RAWVegas last night.  I came hungry as was not disappointed. 
Eating here transports back to the barangays and the fish head soup was particularly memorable for me.  This is basic Filipino fare but always satisfying.
As the other reviewers point out,  this restaurant is basic Filipino cafeteria style, but very clean and the staff invariably pleasant.  There is a wide selection of dishes, although a Vegan would find the offerings rather meager."}
{"text":"Hands down, the best Filipino buffet I have had in Vegas!

The place is located on a strip mall across the street from Boulevard mall. When you walk in, you will notice how big, and clean it is. How the their marble top tables and chairs are all nice and even quite comfy. 

They let you eat first before you pay. The cost per person is $7.50 for the AYCE Filipino buffet.  

They have a HUGE selection of Filipino foods  including but not limited to: sotanghon, ginatan bilo bilo, sisig, adobong kangkong, lumpia (meat and veggies kind you dip in vinegar \"suka\"). They must have had 100 different entrees to choose from , without exaggeration. 

Soda is unlimited , just pour your own from the soda fountain section in the back of the buffet.

When it was time to pay my bill, I find out they only accept CASH!!
I had to run to the bank right next door to Wellsfargo (which was not a big deal) but a bit embarassing, I had to leave my daughter there, so they wouldn't think I was going to run out without paying. I was thinking to myself, \"what business nowadays don't accept credit card or debit cards?\".. not a big deal, i needed the walk anyway after all that pig out session i just did ha!!

Definitely will come back next time i crave filipino food after church on Sunday.

PS, they play TFC like any other filipino joint. =P"}
{"text":"Whenever I am in town, I always include stopping by here in my itinerary. Lots of Filipino food options to choose from! I love their bistek, their adobo, pancit, dinuguan, sinigang, etc. Everything was sooo frickin good!! The staff were so friendly too. They always refill the buffet/catering-style food trays with hot, fresh food. For about 10bucks a pop, this is a steal! I deducted 1 star coz of location. There were many homeless-looking, leary people roaming outside the area, asking for some change. Also, parking is super tight and sometimes hard to find specially around dinnertime on the weekends. Despite all these, I will still keep coming back whenever I'm in town and craving some good Filipino food in me. :)"}
{"text":"I found this place on yelp when I was searching for places to eat while in Vegas. We almost didn't get to try this place but decided to eat here on our last day in Vegas as it was close to seafood city and we had to be at the airport soon. 
I'm so glad we decided to eat here because all the food was delicious! I've been to Filipino buffets and turo-turo places where so many of the items are so oily or not that much meat. The quality and the flavors of the food here are really good. They had adobo, kare-kare, tocino, tuyo, dinuguan, afritada, sinigang, bopis, chicharon bulaklak, fried galungong, pancit and many other popular Filipino dishes. They were all delish! To top it off, the cost of the buffet was only $8.99!! We had 2 kids with us and they were also charged $8.99 but we didnt mind since the food was great and the cost of our meal was way less than the restaurant we were originally going to go to before deciding to eat here. This place will definitely on our list of places to go eat when we come back to Vegas."}
{"text":"Hubby and I ate here on Sat night, 12/18/10.  Parking is one-way at this little strip mall, so watch where you enter from Maryland Ave.  Kusina Ni Lorraine is a Filipino buffet for $7.99 for AYCE.  Drinks are extra -- don't know if they serve alcohol, as we don't drink alcohol.  But they have a choice of sodas and they also serve ice tea.  

The variety of meats (ulam) are mixed and varied.  But unfortunately most of it was pretty greasy.  I had the kare kare  -- which was not the best in the world as it was pretty bland, even after adding the bagoong.  I also sampled the paksiw, bistek, pusit (squid), and pinakbet.  The bistek and pusit were good of the meats I sampled.  Hubby had the sweet & sour meatballs, bistek, pancit, and beef caldereta.  Hubby enjoyed the bistek and caldereta.    

The steamed rice is on the buffet in a regular steam pan and not in a large rice cooker (as most Filipino restaurants serve their steamed rice from a large rice cooker).  Prefer the steamed rice to be in a rice cooker so that it doesn't dry out.  Oh well  ...  There is also a choice of fried rice.  Not too many desserts on the buffet  --  I did see a rice bibingka, but since we do not really eat dessert, we did not go looking for any others.  

This is a cash only establishment, so be forewarned.  There are TV's on each wall with TFC on.  The restaurant is relatively clean and although not \"Johnny on the Spot\" with clearing your dirty plate, they do eventually come to your table to pick up your dirty plates.  They do insist that when you go for 2nd or 3rd helpings that you pick up a new plate.  (I believe this is a Nevada state law regarding buffets).  

This is only the 2nd Filipino restaurant we've tried in Vegas.   We've been to Pinoy/Pinay and it is still our favorite in Vegas.  Although for $7.99 a person, Kusina Ni Lorraine is still a bargain.  You are bound to find an \"ulam/meat\" that you like, as they do have a large and varied selection.  Next time we are in Vegas, we will have to try them during breakfast/lunch hours to see if their breakfast foods are better."}
{"text":"The food was just okay. I can get these dishes at any Filipino household. Not really anything to write home about. Some selections were better than others. Not all the food was freshly cooked. None of the food is labeled so I'd imagine non-Filipinos would have a tough time selecting food. The seating area wasn't very clean. It is not a place I would want to take my friends to."}
{"text":"FOR a LOW budget buffet its good. Not for a restaurant. People giving this place a bad review need to distinguish between the two. It was my first time at this place and had no clue what the hell to do. I thought I was going to be sat down, but we waited for the next couple to walk in and pretended to be looking at the items so we wouldn't look stupid. They went straight to the buffet and as we were going ran into the cashier who said that we eat first then pay. I have ate some Filipino food before so I had an idea how things were. The food was okay, for me because I'm not Filipino, I'm Mexican so some of the dishes were similar. I like to eat with chilly, which there weren't.

  The food itself was cooked good. The fish was amazing! But everything else needed more flavor. The rice was not so good.

  I just wish the food had descriptions on top, and more dessert items. The fruits fine because I imagine people get super full. As far as the vibe in the place it was crowded and it made it feel like a community type buffet. We were the only non Filipinos. Felt weird lol."}
{"text":"Not my favorite place to go, but definitely an ok place to eat when you're hungry for Filipino buffet. They serve all types of Filipino dishes & it even has a mini market. My mom went to this place two consecutive days in a row & they served the exact same dishes. A bit of a disappointment but it is what it is."}
{"text":"Filipino AYCE?!?!  I'm DOWN with that!!!  In The City of Excess, WHY NOT have that here, tool?!?!  Located east of The Vegas Strip, in a strip mall just across The Boulevard Mall from Sears.  It's named after the granddaughter of the owner and you'll see that cutie patootie runnin' 'round causin' havoc usually.  Now, JUST because it's in Vegas, don't be thinking it's a fancy shmancy, glitz & glamor kinda thang here.  Simple and affordable at $8.99 per person (kids $6.99), drink not included, that is a really great deal, cuz the grub here is plentiful and DELISH!!!  Is it because the cooks are Batangueño like mine and my wife's family so we have similar tastes?  Maybe.   

We came for brunch one Saturday morning.  Breakfast is served all day. BBQ pork and chicken is served sometime in the afternoon, not during the a.m. hours.  Bistek, sweet longanisa (jamonado sweet style), sweet pork tocino, Adobong pusit, kare kare, Piccadillo/ tinadtad (slightly salty today), mongo, lechon paksiw, humba, dinuguan (tasty, with a nice bit of kick), garlic fried rice, over medium eggs, and fried tilapia were the stuff we dropped on our plates, and there was still, a whole lot more we didn't sample.  Food choices were ALWAYS replenished, so none of this impatient hateful lingering.  We enjoyed ALL of it!  The staff is friendly and attentive and quick to clear all the dirties from the table.  Never had to stack a thing.  Inside is spacious and perfectly air-conditioned to ESCAPE the scorched earth outside!  For the road, we took a few deliciously crunchy turon back to the hotel, at 3 for $2... YUM!!!  Too bad there's no copycats in SoCal, cuz Lorraine's is worth a trip if ya got a hankering for tasty Filipino food in Vegas ;)
Kumain tayo!!!

Opens sometime between 9:30 and 10am.  Closes at 8:30pm every day.  Turon is 3 for $2."}
{"text":"This is without a doubt my favorite filipino place in vegas. The food is prepared with care like you were to eat at someone's home fo a special occasion. Every dish is cooked and seasoned very well and all of the ingredients are notisibley fresh. The service is fast yet still very welcoming and warm. If you love filipino food or are curious to try a taste, I can say kusina ni lorraine is a sure shot win and an incredible experience, every time."}
{"text":"I've lived close to this restaurant/market now for about 2 years. The first year I wasn't impressed, food was a hit or miss and the people who worked there seemed super stressed. So far in the last 6 months I noticed that their food taste a lot better and customer service has improved tremendously. I personally witnessed on a couple of occasions that the employees went out of their way to help their customers out. I honestly think they are trying and I commend them for that."}
{"text":"This place is in a shady part of Las Vegas. The place is not very clean. The food is bland and tasteless. Well what do you expect with paying $9.99 for a buffet. The customers don't bus their tables so there are so many food on the floor and paper napkins everywhere. Not my kind of place."}
{"text":"This place was great. The staff was super friendly and the food was great. Large airy space, plenty of room to get comfortable. The buffet was top notch. All my favorite dishes. Got full super fast."}
{"text":"First, I would give this 3.5 stars if YELP allowed it..  My Filipina wife agrees with this rating.

Unlike many Filipino buffets this one has a large selection.  Unfortunately there are no labels, which was annoying.  Even as someone familiar with Filipino food I was unsure about some dishes.  My wife also couldn't tell until she tasted some of them.   At least two looked like kaldereta.  Even after trying both I was only about 70% sure which was kaldereta. 

The food was good, and at $9 the price wasn't bad.  Another good sign is that the place was packed with Filipinos.  One disappointment was no desserts like puto or halo halo.  Just ginataang mongo. I prefer some kind of pastry or ice cream, but it didn't seem to bother my wife (so maybe it's just an American thing).

They have one large TV showing the Filipino Channel (TFC), and they sell a few gifts also (like T-shirts).

They will take a credit card, but they charge $1 to do it.  If your bill is around $30 that's what VISA would charge them, so it's not unreasonable (our bill was $40 since there were four of us).

I'm not a huge fan of buffets (strangers who may or may not have washed their hands recently handling the serving utensils!!), but if you get beyond that the food was good and there was a nice variety."}
{"text":"When I don't feel like cooking, I know I can come here and be satisfied fast. I like that it also serves as a grocer as well so I can pick up any last minute items that I might need in the kitchen."}
{"text":"Just had to try this place when I got to Vegas after seeing Jo Koy's video and wasn't disappointed. It's the best Filipino buffet I've ever been to! Large selection and everything was fresh. Price was good too! I was so full. Of the food I can't get in Texas. My only disappointment was that lumpia and lechon weren't in the buffet. You have to order them separately. This will.be a regular stop when we're in Vegas from now on."}
{"text":"Look for their health grade if u still decide to buy any of their hot food they have been on DIRTY DINNING!! More than once, gross.

On top of that the prices are extremely over priced, I understand it's convenience but still ridiculous! Rip off I would not recommend. I will no longer eat or purchase from this business."}
{"text":"First time eating here last Sunday. Food was exceptional! There were lots of different choices. More and more food to choose from. I've been in Vegas so many times but this is the first Filipino food I really liked. For such a decent price you get to choose a variety of foods from appetizers, main course and deserts. I would really come back to this back when I get a chance to visit Vegas again.. #thumbsup"}
{"text":"Just give 3 star because it did not meet my expectation, but i guess what can you get for under $10 bucks. I think they need to hire a new cook to make the food more appealing and also add new food from other cultures"}
{"text":"They have a more casual set up for dining.  Thank goodness no awkward stares at us in this restaurant.  And they're SUPER FRIENDLY.  That's totally what I wanna experience... cuz of the Philippine Airlines commercial you know... some of you maybe.

Well lemme just get on about the drooling food and dish selections.  They had everything I remember my grandma cooking when I was little.  Maybe prepared a little differently, but so many choices.  This is why it's dangerous for me to always have Filipino food.  But they have it down right with flavor and customer satisfaction.

On a day we had no idea what to eat while waiting for car repairs, we brought our noses here.  I was glad to find they had more veggie options than just pinakbet.  We tried the banana heart and jackfruit in gata.  Loved it!  Especially their gata had a spicy kick.  I didn't try their bopiz but they had it.  The beef wasn't cut in tiny squares like my grandma used to labor in making it (takes forever).  But next time I wanna try the bopiz except maybe with pan de sal, and I hope the bopiz is a little spicy.

Desserts like kutsinta and suman are also sold here.  Ube halaya mmmm so yummy when it's hot.  The cantaloupe juice!!! Don't miss out on that!  It has real fruit :D   What makes this place extra special is they have groceries.  Made me spend more :P  Yeah though; bound to come back."}
{"text":"When u walk in and there are only Filipinos eating says a lot!!! I said where do I pay...the gal at the buffet said, Eat first...OMG!!! I ate almost everything!!! Little soup cups I filled with squid adobo, paksiw, lechon, diniguan, chayote, mungo, beef caldereta, chicharron bulok-lok, Kare-kare with bagoong, some kind of ginaton....I was in heaven...oh and of course a plate full of rice!!! I took taron and sumon to go. I told my husband if I was gonna die this would be my last meal....as my cuzzins and I say I am so PULL!!!!! The gal at the cash register said see u on your next vacation...lol...yes I will be back with my mom and dad!!"}
{"text":"Very nice and open and very clean, the food is great with selections. I have ordered my lunch with multiple items and everyone that have have selected are awsome with great taste not to salty just right. Sorry I can't spell that I have ordered but I will be back for more."}
{"text":"great price for a filipino buffet. great selection including kare-kare, tuyo during breakfast and ginataan munggo for dessert. i have to say best i have had so far for a filipino food buffet."}
{"text":"About twenty two or more entrees they all have their own distinct flavor and they bring out new ones as ones deplenished. Not too big on vegetables good selection of seafood. The desert just consisted of a couple different cut fresh fruit. $8.99 really good price .right across from JC Penneys and Sears on Maryland Parkway"}
{"text":"I'm from L.A. visiting Vegas.  I heard of this place through my Mom and was raving about it.  Went there and tried their food and dessert.   Great place to go eat your Filipino comfort food. I've tried 4 different dishes and they were all good."}
{"text":"After a long night of partying out in vegas our stomachs were super hungry craving for that bomb home cooked pinoy hangover food (i.e. silogs.) Although we came at lunch we were more than happy with the food that was cooked on our last visit @ kusina ni lorriane. I think a lot of Filipino restaurants go through atleast some type of stigma because lets beat it, its hard to get passed mom or dads home cooking. However, Kusina Ni Lorraine definitely felt close to home in our minds and our stomachs. Being from San Diego, I'm used to seeing turo turo pinoy spots but never have I ever been to a pinoy style buffet. 

It located in a pretty shady looking shopping plaza, but all hole in a walls are hidden gems. You walk in, grab a table, and head to get your food. 8.99$ you cant beat to try practically all your favorites with unlimited amounts of rice, soda, and ulam. 

I love how they provide small bowl portions to minimize waste of foods and it allows you to try everything that you wanted to try. My favorites were definitely the KARE KARE (8/10) Dinuguan (9/10) BBQ Chicken (8/10) Pancit (8/10) Chicken Tinola (7/10). 

Thanks Kusina na Lorraine for feeding our stomachs with your amazing food and hope to come back asap on our next trip to vegas!"}
{"text":"Highly recommend this place; authentic Filipino cuisine at a very affordable price!!! Being an AYCE Buffet you will not be disappointed. Their Kare-Kare was my favorite, absolutely excellent, dining area was clean and the staff very polite!!!"}
{"text":"LOVE IT!  I wish there was a Filipino restaurant just like this out here in California, even more so out here in Garden Grove!"}
{"text":"First time trying this out, the choices of food were great, but was definitely oily.  I could taste other foods in just the one food I was eating. For example, I ate the dinuguan and instead of the meat there was a fish that I ate that tasted spoiled. The kare-kare also tasted like old pork."}
{"text":"A lot of times I'm too lazy to cook my own food so run to the nearest restaurant and this place filled my tummy quick ....that's good enough for me."}
{"text":"Well worth the money! There are different choices and are all decent taste. I like their pansit and dinuguan."}
{"text":"I truly honestly like Kusina Ni Lorraine.  The workers are friendly and very quick service.  

I've been here a couple of times to pick up food while heading out to a friends home around the area.  I've had the following dishes: 
Pancit
Sisig
Cascaron (I know tagalog is different) 
Chicken Skin
and some other dishes that I don't know what it's called.  

Overall, a nice place to get your point point on and pick up some small Filipino/Asian items."}
{"text":"really quick and affordable. they give a lot of food. Love their sisig."}
{"text":"Been here twice... the selection seemed about the same... but not so sure. 
It's like walking into an aunt's house. The workers there are friendly, speak Tagalog to you right off the bat, even if you don't speak it (good or bad? Hmmm) and make sure you're ok for the most part.
I like the pork gisantes they have, and the pancit is pretty tasty! At $7.99/ person there's not much to complain about. They also sell other goodies and snacks at the register.
Probably will be back with the fam soon.

Honorable mentions:
Pusit
Diniguan (dinardaraan)

Ohh, parking is somewhat odd. One way only, so make sure you take the correct entrance! Although the lot is small, I usually find parking right away!"}
{"text":"I visited Kusina Ni Lorraine the Thursday before the Xmas weekend.  My last minute Xmas shopping started very early so that I could beat the Xmas rush.  By the time I was done, It was 10:15. Most restaurants are open at 11. My mission was to have lunch at Kusina Ni Lorraine, so I was surprised that they open at 7am!  

When I got to the restaurant, the parking lot was empty other than the employees for the restaurants.  As I walked in, the ambious is mediocre. It was nice to see that there was a small grocery store to the back left of the establishment.

As I made my way to the lunch counter, all the dishes were fresh and untouched. The few times that I'm so happy that I get to be the first to a buffet line...giddy giddy.  Because there was no one else in the restaurant just yet, I took my time to look over the items they had. One of the dishes I thought that my father would love was the breadfruit in coconut. But because I'm not all that ambitious when it comes to dishes, I stuck with mongo beans, beef calderetta, half rice/half pancit.  The food was really good.

Another reason why I have been meaning to try out Kusina Ni Lorraine is because I had a copy of their catering menu. They have an option of 5-small platters that feed up to 20 for $110. I think that's a fabulous deal, so even more so I needed to try this place out to ensure it would be worth it for me to cater through them in the future.

At the end of my visit, since the beef calderetta is somewhat similar to chicken afritada, I ordered a small platter for Xmas day at $30.  I scheduled to pick up the dish at 2pm as they would open at 1 pm for other catered orders as that is all that they would be open for on Xmas day.  I received a call on Xmas day at about 10am asking if I could pick up at 1pm as they didn't have that many catered orders for the day. And I agreed to do so.

My small platter of chicken afritada was packed. It also included hot dogs. I've never seen that before. But the one thing that I was unsure about was how oily it looked. When I got home, my husband agreed. So to make sure it didn't taste oily, we did sample the soup, and it was so delicious. In any case, to help soak up what looked like a film of oil, at the suggestion of my husband, I added rice noodles to it.

So the next time I have a nice little shinding at my home that will include between 15 to 20 visitors, I will be catering from Kusina Ni Lorraine, to include the beef calderetta instead of the chicken afritada."}
{"text":"Very friendly, the menu is awesome sarap talaga."}
{"text":"I was in the mood for Filipino food so decided to check out another buffet. This parking for this restaurant is limited, but the interior is actually quite spacious with lots of seats. It was also fairly popular for lunch when I went on a Sunday. Service was friendly and they were good about clearing your used plates.

The buffet spread was not bad, and they often came out with new dishes. Food was decent overall, and at a very competitive price ($8.99 + tax for buffet, not including drinks). They had dinuguan (one of my favorites), but no bangus.

I also bought three turon for $2 when I paid for my meal at the register. I asked whether they ever have lechon on the buffet, and the employee said no, that would prohibit them from just charging $8.99 for the buffet. I guess I will need to lower my standards for Vegas Filipino buffets (back in California, there was a great buffet in Anaheim which included lechon AND turon for about $10 per person).

Solid Filipino buffet overall at an affordable price, but a bit farther from home from me since this place is on the east side of town."}
{"text":"When I went In it smelled discusting...the food looked Worse than the place smelled. I ordered the noodles and asked if there was meat I'm them when I found out chicken I didn't have the heart to tell them nevermind so I walked out and threw them away. So In all fairness I didn't taste the food after reading the other reviews I'm glad I didn't."}
{"text":"I was disappointed. Being related to Nanay Gloria, and being listed under BUFFETS, being close by, we go with excitement. Walk in, it's a to go counter with a few selections. And like 3 small tables and 5 chairs. There was no where to eat. Food wasn't tempting. Sigh. Oh well. Back to Nanay Gloria's."}
{"text":"Bad customer service. I came here to buy pancit to go. After this lady that served me instead of ringing up my order so that I can go. She decides to help 3 other people that just walked in. There for killing my time to wait on them! As for the food it was mediocre."}
{"text":"Came here because we were tired of the Vegas strip food. It was such a great deal. The food was delicious. The staff were friendly and treated us like family."}
{"text":"I like this place. Clean and polite staff specially the pinay that have longhair, she have a charming face. I love all the food also the puto ni bibs"}
{"text":"We ate here last Friday for lunch and I would say it is yummy Filipino buffet. Would definitely recommend this place."}
{"text":"I stopped by here today to get food to go but after looking at the variety of food I decided to stay and eat multiple plates! I got amazing service everything I got up to try more and promise to return here soon. I highly recommend the goat, it's amazing!"}
{"text":"Whenever i'm in Vegas, i make sure to stop by this place. For 8.99 you can definitely get your money's worth. The best one is the kare-kare, bopis and ginataan."}
{"text":"Reminds me of my grandma's cooking.  Buffet style.  The drink is not include in $9.99 buffet price, except of course water. They moved from Their old location.  It also has a market within it."}
{"text":"I've never been to an all you can eat filipino restaurant but omg..I have to loosen my belt buckle. It was like we were eating at a family party with endless trays of amazing food. Sinigang was on point and the ginataan is so good. Bring your appetite and stretchy pants when you come here!"}
{"text":"I've been here several times & my experience every time is pretty much the same.

Pros:
* A lot of selection & variety
* Inexpensive buffet
* Spacious dining area
* Similar to my Mommy's cooking

Cons:
* Some items are a little too oily for me
* Location & area is a little scary

Overall, I'm pretty satisfied (and usually overstuffed) every time I eat here. 
Although I eat Filipino food everyday at home, this would be the next option. It's good, cheap, and a quick & easy place to get a good home cooked Filipino meal when you're craving it."}
{"text":"Order food for a party and once again, everyone loved the food. It helps when there's friendly people on the other side of the counter and a plus when their food is delish. This location always makes good food that taste like home cooked meals. Everyone loves their dilis and and we're glad they usually have it available."}
{"text":"Awesome experience.. Every time i go here they have a wide array of dishes and food is fresh... The owners are awesome and helpful. Prices are super affordable for both the AYCE buffet and to go boxes. I would recommend this place to anyone. Great meat dishes as well as veggie dishes... I go here regularly and also bring my out of state family when they come visit!"}
{"text":"My favorite place to eat filipino food close to home. It's an all you can eat buffet  many different dishes taste delicious! I recommended eating little by little. The area is sketchy but the food is great."}
{"text":"There's a lot of bad reviews for this place because of dirtiness before but they've cleaned up and they have an A health rating now. Food is delicious!"}
{"text":"Ordered sinigang for lunch today and the sinigang has bug . Ewww!!! I will never order here. I will post the picture of my order."}
{"text":"The food here was alright, I came here a bit closer to closing time so they never put out new food once the old ones were finished so I will give them the benefit of the doubt and say there food is usually better than what I tried (thus the 4 stars and not 3). Out of the 5-6 diff kinds of foods I tried while I was eating only 1-2 were actually good. The rest of them were either a bit too salty or a bit too watery for my taste. All in all I would say this place is perfect for a quick Filipino food fix (especially since the buffet is just 7.99)"}
{"text":"Kusina ni Lorraine is a cafeteria-style Filipino restaurant, where you get authentic Filipino food for cheap.  This location in Ann Road is much smaller compared to the other locations.  

My faves at Kusina ni Lorraine: Chicken BBQ, Sisig, and Kare-kare

They also sell Filipino snacks like chips, candies, drinks, and many more."}
{"text":"I saw this place on Yelp and just so happen to drive by it. Stopped in an bought the 2 item plate, C-2. I got the Chicken Adobo and Lechon Kawali. Wasn't a fan at all. Chicken adobo taste was off, and lechon wasn't crunchy at all. Honestly the Sinigang soup tasted like dirty dish water...Definitely not my GO-TO-SPOT."}
{"text":"$8.99 for a filipino buffet?  Yes, please.  The quality and menu is an excellent deal.  Fried chicken skin - check
Chicharon bulaklak - check
Plus a plethora of the classic filipino dishes. 
PS
Skip the coffee, unless you like the nescafe instant coffee."}
{"text":"Close to home and food was pretty good. Not big tubs of food but adequate. Most go here if u close by"}
{"text":"Visiting from San Francisco. So we tried to eat here and ofcourse its buffet eh. Everything went well with the food. Walang complain normal filipino cuisine for a cheap price of $9.99. Masasabi ko lng dun sa owner nung restaurant n naka orange apron sabi nung ko worker cya daw may ari. Kaya pala kung pagsalitahan nya ng masama ung mga tao nya sa restaurant kala mo kung sino. At pinapagalitan pa nya sa harap pa ng customer. Sana man lang madam kung may concern ka lang pls. Nakakaawa yang mga workers mo dyan kung ganyan ugali mo. You can always talk to them close door. Huwag nmn sa harapan ng mga customer mo. Nakakawalng gana. Kung ganyan lang din ang trato mo sa mga taong nagwowork sau. Sana maclose ang business mo. Grabe nya sigawan ung matanda nakakaawa. Isipin mo nalng nanay mo kung ganun gawin sa kanyan. KARMA!"}
{"text":"Love this place! I take my Lola here at least once a week! My daughter loves that she can get her Sarsi for the week."}
{"text":"I love filipino food... And this buffet was such a great deal for only $8.99!! I was so excited to see the big selection of food choices. However all the food really let me down... Everything was way too salty, esp the soup and karekare. The customer service wasn't as bad as everyone stated. However instead of being too bland, I thought the food was too salty. :( will not be going back even if the price is amazing"}
{"text":"Not bad for a little joint off the strip. Go there around 1-3 and food will be as fresh as you can get. The BBQ is the bomb and staff is friendly. 
You come late, your too late, it's left over city from there. They open fairly early around 7 or 8. 
I really have to say, they fix all their issues and made significant improvements. Thank you!"}
{"text":"If you live near this location, your lucky, if not, drive here! Best tasting, and best quality Filipino Cuisine on the ready! Try their other locations at Maryland Pkwy and Hendertucky and you will not be disappointed! Mabuhay! 

ps. Goat Kaldereta is gonna blow your taste buds!"}
{"text":"I  having a rough time giving a neighborhood business such a low rating, but I have to be honest. It seems as though this location opened too quickly and isn't quite ready for business. The first time I came in, nothing was labeled so I did not know if I had enough money to make my purchase. They were only accepting cash at the time because they weren't set up for electronic purchases. The next time I came in, the cashier did not have enough change in the register, so he had to ask another employee (maybe the owner) for money from their pocket. The very last time I went in (hoping for an improvement) they did not have certain food items available to order even though they were listed on the menu.  I think I may want to wait at least a few months before I go back. I'm hoping they can work on getting things together."}
{"text":"I always come here to get some food to-go, and the staff are always so friendly and helpful. You can get a plate of rice and two types of food for $5--what a deal!

The food is best around lunchtime and right before dinner--that is when it is the freshest because of the turnover from the number of people eating there.

On Sundays, the dining room can be packed full of hungry Filipino families chowing down for the buffet, and they keep the food coming pretty regularly. For only around $8 a person for quality Filipino food, this place is great for a group of people to eat.

The only thing I don't like is the area where the restaurant is located. Directly across Maryland Parkway from Sears/the Boulevard Mall, this place makes me want to get out of my car and into the restaurant quickly, and vice versa when I'm done. The parking lot can be also be pretty full, so you may have to go around again and park on the roof. It is also not the most pleasant area to be around in the evening. I have no qualms about the restaurant itself, however!

When you come, try their sisig or the bopis. They're both usually pretty fresh and delicious. The kare-kare is also excellent, with extra bagoong. Try it out!"}
{"text":"I really enjoyed this Filipino buffet. It's a lot cheaper than the ones in Hawaii and also has so much variety. I love how you could also get your own fountain drink and refills. It's not anything fancy, but the food is pretty good. The rice was kind of mushy and that was my only problem.

They also sell snacks and I was super happy they had watermelon seeds available for purchase!!

Remember to bring cash because that's all they accept."}
{"text":"What a difference 11months make. Came in today to give Kusina ni Lorraine a second chance and  I'm impressed. The lady that was manning the place was super nice, helpful, friendly and patient. There was a dish I wasn't familiar with and she even let me taste it.

Ordered a large pancit, a medium sisig  tainga, a medium guinataang bilo-bilo and 2 fried fishes for take-out. All that for less than $25...not bad. Everything was pretty good. This was definitely a much better experience than my first visit. I'll be back."}
{"text":"Ended 2015 with a Filipino BANG of a review, let's start of 2016 with another Filipino review!  Although, hate to say this one is a bit more of a whimper.

Oi, Kusina Ni Lorraine I really wanted to like you.  I mean, it was packed on a weekend, my peeps everywhere.  We even had to wait 20 minutes for seating.  That's how busy you were!  But the most important stuff *the food* was kinda lacking.  Looking at many other reviews I see Kusina Ni Lorraine is coming out average at best.

I mean the place has a lot going for it.  Large interior, nice long buffet line, even a Filipino market connected to it right next door.  Some downers - kinda in a questionable part of town (yes, I lived near Maryland Pkwy. for over 6 years while I was attending UNLV), very little parking (unless you like that squeezed in upper floor parking), and some marks on cleanliness.

I can get over the downers.  But man, the food itself?  It's gotta be good or I'm gonna take ya' down a notch.  Sorry Lorraine, but I've had some better Filipino food at other eateries across Las Vegas.  For your all-you-can-eat buffet at $8.99 a person, it was really just OK.  It might have been just me, but a lot of the items were similar in tones of BEIGE.  I like me some color in my food!  Even though admittedly I don't often eat the more 'exotic' stuff when it comes to my culture's choice of vittles.  Fried head of tilapia?  Eh, leave it for my tatay.  Bulaklak (crispy fried pork intestines aka chitlins)?  Unless it's hot out of the fryer I'll save my Lipitor for another meal.  Dinuguan (pork simmered in pork blood)?  Sometimes, but I really gotta be in the mood, and it's gotta be with a lot of rice.

The food at Kusina Ni Lorraine just didn't whet my appetite that day I guess.  I had some rice (duh).  I had some pancit too, which was on the bland side (where were the flavorful tiny dried shrimp?).  A lot of the other main dishes just weren't appealing to me that day.  Maybe it was a burn out from having too much rich food over the holidays.  Maybe it was because I was reminded of my own Grandma's Filipino dishes (no one made it better than her).  Maybe I just wasn't hungry?  Nah, I was hungry.

Maybe it was the fact a lot of the food that day way pork-based?  Well, really can't complain too much there.  We love our pork.  I think there was just an overall blandness to everything I tried.  The bistek (beef cooked with onions) was not bad, but really not as good as my father-in-law's.  It lacked some flavor, missing something.  The adobo wasn't on point that day, but how do we as Filipinos mess up adobo?  I mean, come on!  It's like our national dish!  But really, it was low on vinegar so it didn't have that acidic kick.  The vegetables were, well, just vegetables.  For me, even the sinigang was lacking in taste.  How can that be from a soup made with bones??  Ugh, I was let down.

Surprising?  Their 'dessert' bar (which is all cheap fruit) had some wicked decent pineapple!  Yes!  It was actually sweet and a treat to eat!  But wow, so weird on my part.

It was a quandary to me, so much so I even forgot to take pics of all my food.  Me, the foodie!  I really must have been tired after that drive back to Las Vegas from San Diego after the Christmas holiday.  Kusina Ni Lorraine just didn't impress!

I'll have to be back again to give Kusina Ni Lorraine another try sooner than later.  I just hope it was me and not the food!  But for $8.99 AYCE it definitely is a decent value.

HOI HOI!  PSSSTTTT!"}
{"text":"I found this little gem on yelp because I was craving some Filipino food and it was right down the street. The food is served buffet style and taste just like mom's cooking!! I come here often after work to grab a combo plate to go. This place is highly recommended!"}
{"text":"I was having a lumpia craving and found this spot. I thought maybe I could get a 1 item combo and the lumpia as my item. At first the girl at the kitchen did her best to make that happen since I didn't want the full order of 25 minimum. I went ahead and let her take care of me. The lumpia that we thought was vegetables as told by the guy working, ended up being filled with fish and quite greasy! I was not happy about that. I took it back in and asked if we could fix it and get vegetable ones since they said pork is 25 minimum order. The guy thought I wanted classic pork lumpia and said it's a minimum of 25. I asked for vegetable he insisted that vegetable wasn't available as a side order but only the fish that was out. So I proposed he take my order back and trash it and refund me. Of course he tried to rectify it and threw an offer to make the lumpia but it has to be 25 count and I pay and extra $5 for them. Me being tored and just wanting my lumpia I let him  have them fried for me and gave him $5 by that time I was just ready to go but I still wanted to satisfy my craving. $12 later and all I got was a couple scoops of pancit that I only really took with my order to get the first \"lumpia\" made with fish that were not very satisfying and an order of 25 lumpia that were miniature compared to traditional sized lumpia and clearly cut in half as you can see one end. There was a very straight edge from a knife. They're so tiny! Next time I want lumpia I guess I'll be making it myself. Granted, It was full of pork but there was no minced carrots or any sort of vegetable to give it that complete flavor. My stomach is actually upset after eating there. I can't go back there based on this experience."}
{"text":"Lumpia #1 hands down the best !!! Every time I have a party to go to I show up with a minimum 100 and they fly !!!!!!!!!!! Matter a fact I just called and ordered a hundo for tonight's baseball team Xmas party !!!!!!"}
{"text":"Ayce for 9 bucks. Food is just ok.  Staff was ok. Many of the meats in the dishes were  tough. Spaghetti was ok, mussles were  to salty. Pancit was wierd. Karekare was ok. Bisek meats where cut to thick and too salty.  Mungo was to watery. Jello was good. Bittermelon and eggs was good.  Sinigan was good."}
{"text":"Great selection of popular Filipino dishes. Good deal for $8.99 per person. Come early to avoid crowds."}
{"text":"So I was craving Filipino food and my co-worker suggested kusina ni Lorraine. Finally got to check it out and I got my favorite thing which is chicharon bulaklak and it was the best chicharon bulaklak I have ever had. I had to buy 1 pound of it so I could have left over. If you want authentic Filipino food you should go here and it won't burn a hole in your wallet either."}
{"text":"So glad they opened another branch close to our friend's house. This location though only offers combination-meals, unlike the other location on Maryland Pkwy which offers buffet-style dining. 

It was a little challenging to find this place- so a quick tip, they are sort of in the same shopping area as Hobby Lobby but located in a different building. They are right beside Curry Leaf restaurant.

Food, not so much (at least for TODAY). The food we ordered (nilaga & monggo) seemed to lack taste (saltiness). The lengua had a funny smell to it. But all the other food was good."}
{"text":"Sunday morning and my family craved Filipino food before leaving back to California. My aunt who's a local here recommended this place. 

They opened at 9am and we came around 9:30am with 1 family present. We were welcomed instantly upon arrival and a lady told us in Tagalog to just get our food and eat then pay once we were done. It was all you can Filipino food with many delicious dishes, \"comfort food,\" to choose from. For $10.00 per person, it was def worth the money. 

The atmosphere was super home-y and comfortable. Many customers came in after us and we're told the same, to eat first then pay after. SOOOO TRUSTING and SOO HUMBLE!! 

I'll definitely recommend this hole in the wall place for you to satisfy your Filipino food cravings!

*Heads up, the area might be sketchy as but the FOOD will be worth it! (I hope to your liking)"}
{"text":"Best food in town.  Very fresh and very tasty.  There is a young lady in the restaurant that seems like she doesn't want to be there. But the older couple is so sweet and reminds me of a auntie that is happy to see you.  THE ADOBO is awesome!"}
{"text":"This Filipino food is buffet you'll ever had in LV. My friends and I are visiting here from SF and man this restaurant has the best selection of food and the taste of there cuisine are very tasty and I highly recommend it for all you guys to try it :-) This will be my favorite restaurant whenever I come here to visit."}
{"text":"Very good food in the kitchen. The chicken adobo and pancit were very good. Staff was friendly and attentive."}
{"text":"My family, hubby and I did a weekend trip to Vegas in celebration for my brother's birthday. To be honest, whenever I go to Vegas, I generally stay on the strip and never really make it to the outskirts. This time, things were different since my mom was determined to have some Filipino food for Sunday brunch before our long drive home.

She had heard from one of her friends that this place was great.. and of course like any other parent-pleasing child (more like trying-to-avoid-confrontation child), we ended up here.

At 10am, I was shocked to see that this place was up and running. There was a long buffet of at least 15 different dishes ready to be eaten and for a price of $8.99, that was pretty unbeatable. 

The staff was very attentive, very sweet and while I loved all the options, I felt like the food was a bit on the saltier/heavier side. Then again, that is what Filipino food is all about. To put it into perspective, none of us were close to being hungry even after a 5 hour drive! 

The ambiance on the inside did give that authentic Filipino vibe and was very roomy! Unfortunately, the outside was littered with homeless people asking for change.. so it did feel a bit sketchy. 

All in all, it was a good experience!"}
{"text":"This Filipino buffet smashes on all the Filipino buffets I've been to in Cali. There is a big selection and they had all the favorites I grew up to. They had chicharon bulaklak, dinuguan, beef steak, sisig, and more. Plenty of food for an unbelievable price.

Like my parents when I was growing up, they wasn't any air conditioning but plenty of fans. The food and the atmosphere made me feel like I was back at home. I ordered a halo halo for dessert and it topped off an already sensational meal. Definitely going back again when I come visit Las Vegas."}
{"text":"came here for the first time with hubby and cuzzen...it was alright...not too much selections for a filipino buffet type."}
{"text":"Today was my first time trying this place, and the food was great! ordered a combo with 2 selections and rice. I've tried squid at several Filipino restaurants in town, and this was the best I've had! It was very flavorful, and the serving size was decent. I also got fried chicken skin, which was just ok. There isn't a lot of room to sit, so I'd recommend getting your food to go. Otherwise, I was glad I gave them a shot. I'll definitely be back!"}
{"text":"Great spot for Filipino dining. Classic buffet style set up with everyday Filipino staples. Great price, great food, great customer service. I felt like I was at home with my parents haha"}
{"text":"Hands down, the worst Filipino buffet I've ever been to. I really didn't like the food selection (not varied enough, too bland) and the restaurant could be a little cleaner.

My major gripe was when I found a long piece of hair in my fish. I pointed it out to the wait staff and the lady just took away my plate without offering any apology. On top of it, I was still charged full price for the buffet. I realize that restaurants have different policies when handling these types of situations, but the least the staff could have done was acknowledge my complaint instead of sweeping it under the rug. I will never go here again."}
{"text":"Absolute gem to get the Pinoy food fix while in Vegas. 

Food selection is aplenty and definitely has something to everyone . 

Service is friendly and may not be as fast but hey you are after all savoring what may be the next best thing of the items since you been to the motherland.

The best part: 
Small bowls to hold all those good food , akin to yet another winning  Vegas buffet , Wicked Spoon of the Cosmopolitan!
Genius!!"}
{"text":"I have no complain about this place very affordable Filipino food Buffett in Las Vegas $8.99 with drinks can't beat it anywhere. The only thing I can suggest, add Filipino dessert and take all paninda on restaurant area and put it on the right place where it belongs. Other than that 5 stars"}
{"text":"This is a to go eatery in Vegas. So many selection of buffet items. I have not seen anything like it in California for $9.99/p including weekends. They do not repeat menu--for example, when the tray of pinakbet is done, it is replaced by another veggie item. So, if there is a left over binakbet in the tray, it was not scooped back to the newly cooked dish. Every item is freshly made. Staff are friendly. You'll feel right at home. The sinigang was so sour--just the way it was cooked at home. Miswa was good for this cold weather. We have tasted so many items; dinuguan, kare-Kate, bbq, monggo, lechon paksiw, binagoongan, and many others. We will definitely come back and will spread the word."}
{"text":"If you are craving some good Filipino Style Home Cooked foods and too lazy to cook that day....GO HERE!
Whenever someone asks -\"Where is there a good Filipino Restaurant?\" - I always say KNL!  
It's not a fancy place,  so don't expect VIP treatment or someone waiting on your beckon call.  What you can expect is plain ole good cooking like home.  If you get there early enough...you can have \"SILOG\" BFASTS.  
- and all the times we have gone there- they always have fresh CHICHARON CHICKEN SKIN.  (Which my gf Yvette loves)
Lots of choices also.  ( I have been to other Flip Buffets and the choices were not as much as KNL)
$$$$ the price?  So minimal for a buffet! But carry cash only.
Location?  If you are visiting and staying on the strip- it is not too far for a quick cab ride.
If you are into TFC...they have it on for your pleasure.  
Dessert- not really much, GINATAAN and some cut up fruits.  But really.... after hella eating- who needs fruits.  
At the counter where you pay there are some CHICHIRIA (snacks) you can check out and buy.  

I highly recommend this place.  Go enjoy....your tummy will be happy.

DON'T FORGET TO TIP YOUR BUSBOY!  BE NICE."}
{"text":"It is very hard for me to give 5 star to Filipino restaurants because they are not good at making their restaurant look good, organized and/or descent. This place is no different, the setup is like most filipino store where they display every conceivable item they can sell out all around the store. But here is for the real review, the food is good, the choices lots, the value great, seating down with great Filipinos excellent, the smell only a filipino restaurant can offer (for non-filipino that might sound bad or red flag) perfection!"}
{"text":"Food was a super greasy. The employees were super rude. Never going back there. Dead flies on the ground. There's a dollar charge when you pay with your card.  Then the employee gives you attitude when you say \"I'll pay in cash.\"  So if you enjoy greasy food with rude employee and like to see dead flies on the ground this is your place!"}
{"text":"This cafeteria is across from the BLVD Mall in a strip mall that is very sketchy.  Ive never had Filipino food before and there was no labels on the different dishes, so I had no idea what I was eating.  The lady at the buffet was super nice and went out of her way to help me find the chicken Adobo.  I sure wished they would have had some Lumpia on the buffet, but they didn't."}
{"text":"If you want to grab a quick bite of Filipino food, then this would be a place to go to on the north side of Las Vegas.  It's a really small place with just a couple tables to seat at.  All meals have already been prepare and all you do is choose what entree you like.  Somewhat like a Panda Express line.  The people that work there are fairly friendly.  The owner's sons are the cashiers.  Food is okay.  Their pork BBQ is really delish. This place also has a mini Filipino grocery store to buy authentic Filipino products. Price is very reasonable.  I frequent this place to buy dinner whenever I feel like eating Filipino food"}
{"text":"Great value for Filipino food buffet style. Friendly staff. Parking can be a challenge. They need more desserts--other than just fruit."}
{"text":"Truly a must for Filipino cuisine when we are in Vegas. We have been coming here for years now as we were surprised to come across a Filipino buffet style dining restaurant. 

Some of my favorites are their garlic rice, boiled eggs, longanisa, kare-kare, sinigang, monggo beans, and chicken curry (unfortunately did not have the chicken curry out today, and this is my favorite)! You MUST finish your meal off with the dessert that I look forward to every time (the name is escaping me at the moment) which is a tapioca, coconut milk pudding that is served warm. It is so delicious and the PERFECT palette cleanser after indulging in the all the rich cuisine. 

The location itself is located off the strip across The Boulevard mall, and I'll admit the parking is kinda terrible.  There is a parking available in the rear, but we would prefer to park in front of the restaurant. The interior and exterior is by no means luxurious, but that's what makes this place truly a hidden gem! The inside is clean, very casual, and also has a Filipino market inside with tons of goodies.

The customer service is also wonderful, they are always friendly and accommodating, we are always instructed to have a seat, dig in, and pay after. You may be thinking that at $10 per head, the experience would just be decent but the food here is truly that delicious, homestyle cooking that you crave when you're in the mood for Filipino food. 

Removing one star because often times the food is either swimming in oil, or the oil has separated and created its own layer above the food. I grew up eating Filipino food so I do expect grease, but here it is in excess amounts in almost every dish which can turn your stomach a little if you're not familiar with Filipino food. 

Regardless, I would recommend this establishment to anyone-Filipinos and those interested in Filipino food, Kusina Ni Lorraine truly gives you a little taste of all the classic, staple Filipino dishes!"}
{"text":"I had lunch here on Saturday and it was very good. I have had filipino food but am far from an expert. Very tasty and extremely well priced. This is a stickly casual place with limited seating but they do a good carry out business and the turn over is very good. I had the goat and chicken entrees with rice. Also potatoes on a skewer coated in brown sugar and several other items including squid. If you are in the area I do recommend you stop in.."}
{"text":"Filipino food is my comfort food. But it needs to be cooked for a family to be tasty and delicious!  That's why I love Kusina ni Lorraine. I go to Vegas to work trade shows and after a long day of hub-nobbing with the public, I can enjoy my comfort food even if I go it alone. \"Me\" time + good comfort food + big screen TV!  What can anyone ask for more?"}
{"text":"I was glad that we got to try out this Filipino restaurant when we visited LV last week. I'm not familiar with any Filipino buffets in Socal so this was a treat. 

First off, the selection is quite a lot when considering that most turo turo only have between 6-8 dishes available. When I went they had at least 20. For sure they had everything from Dinuguan, Tocino, Daing, Munggo and even Sisig (which was my favorite dish of all).

The place itself was clean. The area where the food was held was clean as well. The only thing I thought was different was the use of the trays. I know that probably served to keep the area clean and all, but I felt it just used up more room on the tables than needed to be. That part wasn't really much of a deterrent. I will come back again.

My only gripe would be the parking. There is a one way parking and above building parking if you don't see it right away you'll miss it and have to make a u turn or two. hehe. If it wasn't for that I may have given 5 stars. Especially being the only filipino buffet around (not to mention the taste of the food was good!"}
{"text":"I was here June 14 during lunch time. Their sinigang here is awesome. It had a hint of tamarind. The sweet and sour blend of the sinigang was on point and they loaded it with vegetables which I liked. All the other food were mediocre. I really liked that sweet rice dish though. My only complaints were that the rice was hard and burnt and there weren't really any desserts. Not sure if I'm coming back to this location. Oh yeah, I wasn't a fan of their bistek and bistek is one of my favourite Filipino food. Their bistek was bland."}
{"text":"Being from the east, we don't usually have filipino restaurants that serve buffets for only $9, so that pulled us in pretty quick. Kusina ni Lorraine wasn't a bad place, I loved the food. It tasted like homecoming. The only thing I didn't really like was the fact that my boyfriend and I are young filipinos and I guess they didn't think we understood the language, but we do and they often spoke in filipino in regards to the food we were getting and the amounts, which I thought was a bit rude even if it wasn't anything negative.
It was a store and a restaurant together, the store had your common filipino foods, even frozen ones. The snacks and drinks were what really got us because we don't usually get it here and if we do, it's pricey. Would go again!"}
{"text":"We have been patrons of this restaurant for the most part of living here in Vegas. Its food is great, especially the lumpia, but I don't see myself going back there ever again because they have this regular who sees it appropriate to berate other customers for the most illogical reason. My husband went in to get food, while my kids, our dog and I waited in the hot car -- it was probably 100F at around noon. We planned on eating quickly in the car before heading to the park because we had a dog with us. After getting food to go, my husband came back and told me that the staff said it was fine to have the dog inside the restaurant. So we decided to grab a table. One that was nearest the exit so our dog was even barely a few feet inside. The entire lunch was pretty much uneventful, because we have an obedient and well-trained dog, save for a lady who asked us a few questions about the dog's breed and the cook coming out from the kitchen to say we had a good-looking dog. When we finished eating, I decided to grab a few things in the grocery area but heard a woman condescendingly speak to my husband about not knowing some \"city code\" that states that bringing dogs in restaurants was not allowed and threatened to call the police. My husband told her that if she had an issue with the dog she should bring it up with the staff as they told us to bring him in. When I told her that she should stop making a stink about it since it was pretty common for restaurants to allow dogs in, she pressed that we give her examples of restaurants that did and told us to take our business there. Good! We will. What puzzled me is that not anyone at the restaurant stepped in to tell this person that they said it was okay for us to have the dog there. If someone did, they did not do a good job at making sure that a paying customer felt safe in the establishment. If you plan on going to Kusina ni Lorainne and have a service dog, be prepared to have this person harass you about not bringing your dog into the restaurant no matter what reasons you have. She seems to think she's right because she thinks she can call the shots over there. According to her, my efforts at convincing her that the dog should be allowed in any restaurant is moot because I did not know who I was talking to. I think I know who -- Cruella de Vil!"}
{"text":"This place is fantastic. A gem of a find for Filipino cuisine in the middle of Vegas. It's predictably located out of the strip since they price their buffet at 10$ a head (seriously who does 10$ buffets anymore?) 

Felt like home cooked Filipino comfort food. However the decor is passable (don't expect to impress on a date here). 
 
Eat all you want, have your fill of nice food and come out satisfied and 10$ poorer. A fantastic deal overall. 

Will definitely return on my next visit"}
{"text":"Found the best Filipino spot in Las Vegas. And, it's a buffet spot. There Is so much different type of dishes. Probably the most entrees at any filipino buffet anywhere. Food is decent. Kapangpangan too!  

But I know there's nothing like my family cooking but this flavor taste like friends or neighbors house. 

Downfall is all the fat sitting on top of the dishes. The Lumpia is sweet. Added sugar? But this is better than the N Las Vegas spot."}
{"text":"Was very disappointed upon entering the restaurant. We didn't know whether to seat ourselves or to wait to get seated by a host. Instead, a woman all the way to the back signaled and shouted \"come here!\" My family & I went to the back & found it was a buffet. We came in 3 hours before their closing so the food looked as if it was sitting there for a long time. It didn't look too bad. We got our plates and sat down. The food was alright at best. Unlike the other Filipino restaurants I've been to where the food was made fresh, this really sucked. It wasn't hot and just tasted bland. Many choices but they all looked and tasted like they've been out for too long. 

The worst part is after our meal we decided to buy some traditional Filipino desserts. We took it home. We got the sweet rice wrapped in banana leaf. I opened it and immediately smelled rotten rice! It was green! I threw it in the trash right away !

I say the best part that place is the store within the restaurant. It was filled with Filipino snacks and goods. Overall, it was a terrible experience and I hope they step it up. I love Filipino food and love to see many more filipino businesses popping up everywhere."}
{"text":"This is a favorable local restaurant/grocery store for all your Filipino/Asian needs. When you walk in to your left is a grocery market and on the left is an al a cart restaurant. We came here during lunch time. 

Food here looks delicious. Wide variety of Filipino dishes to choose from. There are also different combo plates for whatever your appetite desires. I chose the 2 dish. I ordered the sigsig and the pork bbq stick. It also comes with rice. 

They have a fridge on the wall filled with drinks and I chose the pineapple juice. Prices were decent and the staff was friendly.

Very wonderful local restaurant to go to if you are ever craving some Filipino food."}
{"text":"Great place that my friend recommended.  Was able to cater in the last minute and the food was awesome.  Delicious and great service.  Must try place if you like good food."}
{"text":"It's never as good as when Mom makes it, but this buffet comes close. I like the fried bangoose and the mung beans with greens."}
{"text":"First time here with my friend when I come and visit these place. We ordered, sisig, adobong pusit, fried fish and pakbet. Everything was delicious and taste good. I definitely come back here."}
{"text":"My second time here because i was craving some pinoy food. Its good, affordable and has a big selection. How can you go wrong. I judge by the dinuguan, and it is always right on. A must place to eat... Downside is the parking and sketchy area"}
{"text":"Even though I heard about Kusina Ni Lorraine awhile back ago, I haven't paid them a visit until recently and I'm glad I did. One of the reasons for the delay was that I tried so many Filipino places around here and none of them were any good.

Anyway, my co-workers and I decided to try their AYCE buffet lunch and we were blown away by the variety and quality. The customer service from the lady working there was awesome. She came by our tables and showed us how to eat Filipino food and explained the ingredients in food we didn't know much about. My favorite was the dried salted fish, which reminded me of my childhood growing up in Southeast Asia. For $8.99, I think it's a pretty good deal and it's something different from the normal burger and casino buffet.

One thing I wanted to point out is Filipino food is not for everyone and it can be hard to adapt if you don't have a diverse taste bud. One of my co-worker wasn't impressed by the food but I think it's because it strayed so far away from the American cuisine or Chinese food that is often associated with all Asian food. 

If you have an opened mind and opened taste bud, you will like this place. Remember to go early because it seems parking spaces are very limited, but I heard there's a garage somewhere nearby."}
{"text":"Hi guys this place is real pilipino food and all staff and the owner is very friendly . And boss Lorna n Paul is very wonderful boss"}
{"text":"Very poor customer service... Also not impressed with the food...but for 8.99 it is good enough... However the cashier is rude... Which you're not supposed to be especially in a restaurant business...plus they need to replace their utensils coz they are already worn out..."}
{"text":"We had lunch here yesterday, and it was so delicious. We enjoyed every dish, and Maribec is a food critic especially of her own cuisine. So that says a lot. Staff was very friendly. \"Bangus\" was deep-fried with crispy skin.... fabulous. I enjoyed everything! Plus, it was all extremely reasonable. $7.99 per person, not counting beverages."}
{"text":"My first filipino buffet here in vegas, selection, food and the inside was good. The only thing that bothered me was the location, as we were coming out there was a guy pushing a cart rummaging through the garbage wearing a Britney spear torn out costume, my 2 year old was like what's that mommy? Other than that I would come back on daytime."}
{"text":"Came here with my family from L.A. There was 12 in our party and there was no wait to get a table. They were very accommodating and friendly. They have a Grade A rating and the food was actually really good. I'm pretty picky with Filipino food being a 2nd generation Filipina, but I liked it. The food was tasty and it was only $8.99! Recommend this place if you're craving Filipino food and are on a budget while in Vegas. They also sell little Filipino goods and magnolia milk bars (Thai tea, halo halo, red bean, etc.)! The soda is not included in the $8.99 but it's only $1.29 and they also have an assortment of Filipino drinks (mango juice, buko juice, royal, etc.)."}
{"text":"I'm from Texas & visiting Vegas once again but with my family this time so i had to behave. Let me start by saying i checked out the yelp comments first before coming to the restaurant. That's usually the smart thing to do, right? The negative feedback or 1 star were a little harsh but i'm pretty persistent & instinctively still wanna try to experience the buffet (erthing is bigger in Texas, but a Filipino buffet is unheard of). So lemme tell u my overall experience - it was a total bliss! I swear, as soon as i swung open the door, i almost heard angles singing. To all the haters saying no taste, too greasy, too soggy, too cold, hair in my food, dirty place, smell like clorox, over charged me this/that, soda is extra...what's next, \"this place made me fat!\" This place is obviously not getting enough props but cmon bros, sis, uncles, unties, lolos, lolas - businesses like this need your support. We're suppose to help each other out instead y'all are posting petty complaints here. If you dont like this place perhaps you've been domesticated far way too long, you know who you are.  Until we meet again Lorraine, mad love all the way from the heart of Texas."}
{"text":"I like the food choices that they have and reasonable buffet price. It is driving distance from the strip but well worth it. The taste is really good and you will feel a mother's love on each and every bite. Definitely worth a second visit."}
{"text":"I'm so glad we found this place via my Brother in law. 
Ever since we had lunch with him here, 
This is our \"must go to\" when we visit our 9th island. 
I've been here numerous times & we enjoy every visit!
At times, we try make it twice during our stay, 
at the beginning of our trip and towards the end. 
Where can you get a buffet of Filipino foods for under 10.00!! 
Not in Hawaii of course!! (LOL)
Items varies daily & there are many many choices to chose from!!
My favs are always the bihon, sari sari soup, lechon, & bbq sticks!!
This is the only time my husband eats up, on his Filipino foods. 

2 reasons, I don't like about this place, the parking & that it is located in a very shady area!! but It doesn't bother me!! 
I'm just happy that I get my Filipino fix!! ( me & the hubby & the family)

They also accept credit cards now. 
*always check your receipt, since the last visit, 
my credit card statement and my receipt was off by 2.00. 
I didn't bother with it, since I was already back home. 

After our lunch, we head across the street to the Boulevard Mall for shopping. 
The perfect combo!! 

This is a must go for me when I'm in Sin City!!

I try to avoid buffets but this one is an exception!!"}
{"text":"Came here for lunch with my family friends about 17 of us.  Great value for the price.  A variety of Filipino dishes and all tasted excellent.  Had the dinuguan, Kare Kare, sinagang,  beef steak, tocino, beef mechado, pork adobo, and a few others.  Definitely will be going here next time I'm in Vegas again."}
{"text":"Great food and customer service. Will come back! Nice and helpful people. I love the chicken curry, monggo,  kare-kare, and squid adobo!"}
{"text":"Want the most bang for your buck when it comes to Filipino buffets. You've come to the right place. For 9.99 this place has the most selection. You'll find all your favorites and on a good day they'll have lumpia. I say on a good day because lumpia is my favorite but they rarely have it. They have everything else I love though including tinola, pork BBQ, pancit, beefsteak and lots of others. We've been coming here for years and the food is always fresh and the establishment always clean. Just don't mind the neighborhood or pan handlers and you'll be just fine."}
{"text":"I got the pinakbet. Its very close to grandmas cooking. I will come back for a tray of pinakbet!! I didn't try everything but I'm sure its all good."}
{"text":"Nice location, polite staff...but the food is okay. Had sisig with rice and pancit. Everything was bland...and really, I'm pretty easy to please."}
{"text":"The lumpia was delicious!  Unfortunately, they just ran out of pansit so we were unable to order any.  We will come back & hopefully they will have some!"}
{"text":"After a night of partying, we totally deserve a good breakfast to compensate our hunger caused by exhaustion and liquor. LOL! A friend of ours suggested to eat here instead. It was a filipino buffet heaven! They have sinigang, pork and chicken adobo, kare-kare (FTW), munggo, menudo, pork binagoongan, beef nilaga, fried rice, tuyo, tapa, pinakbet, tocino, and a whole lot more. What made me love this place even more is they have crispy fried chicharong bulaklak!!! Omg! They are freshly fried! Divine!!! 

The server is really nice too. She is so sweet and very accommodating. All the good food and service - around $10 ONLY. Really worth it!  I would totally eat here again every time I visit Las Vegas."}
{"text":"Pros:
- Authentic Filipino food.

Cons:
- Dirty restrooms.
- Not a good variety of food."}
{"text":"It's cheap and it's a filipino buffet!!!! Place is kind of scary though as hobos walk around."}
{"text":"Decided to push back the traditional Thanksgiving meal to avoid the crowds and long lines at the casinos along the strip.  We found this place open and decided to give it a try. We were surprised. Food was plentiful. Many types of Filipino dishes were represented.  Gotta try the chicharon dipped in vinegar.  Great price and convenient shopping in their Filipino store inside the restaurant. Staff is very friendly. Made us feel at home."}
{"text":"If you are looking for a great filipino food with friendly staff and a warm ambience I highly recommend this place! We keep coming back to this place whenever we are here in Vegas and the service is always the same awesome!"}
{"text":"I've been to the other locations before for breakfast, but yesterday we went to this location to buy food to go. 

This venue is in a small corner behind the car repair shop. One half of the store had a mini mart and the other had the restaurant. They had a variety of options for lunch laid out. It laid out as any other Filipino restaurant. The food looked pretty fresh when we went on Saturday afternoon. I had ordered two large plates of pancit, one large plate of palabok, and ten empanadas. The total ended up being about $30. 

The pancit was good and not dry. The palabok was tasty but seemed like something was missing. They filled the large container until it was full. We brought it to a party and the orders were more than enough to feed the small party. We weren't big fans of the empanada though. They were dry and lacked taste. 

Overall the food servings are worth the price. I'd come back to taste the other food they have to offer."}
{"text":"I was treated like I asked them to help me hide a body. Literally had 2 people walk away from me while I asked for service; I don't care how good the food is. Extra charge if you use your debit or credit card. I just wanted to bring a combo home to surprise my boyfriend (he's Filipino).Bet if I would have had him with me I would have been treated better, but good grief. Never Again!!!"}
{"text":"My friends from high school & other class graduates of other years decided to have a combined reunion in ......where else....Las Vegas..& was looking forward to see old friends. I was looking forward to go back to have a good meal at the Kusina ni Lorraine....Found out that they had opened their 2nd branch, good for them.    

Had to drag my group to have breakfast there instead of having an all American breakfast at the hotel. The price of the buffet was still the same from 2 years ago..eat all you can for $7.99 and the food as usual was excellent...The dishes they have were all authentically Filipino...where can you get \"Sinampalukang Manok\" nowadays..Certainly not in New York. We were lucky to have it when we were there.I was told that they don't have it all the time & my favorite \"Dinuguan\" They have probably like 20 or more selections, its crazy...The place was packed...Well the food was damn good, you can see why they opened up a second place.

Will I go back? Definitely!!! If I go back to Las Vegas for another reunion....probably next year, who knows!!!"}
{"text":"I wanted Filipino food so bad but didn't feel like cooking. This place offer AYCE for $8.99/person. The food was okay, I didn't expect the dishes to be as fresh knowing that it's buffet style. They offer a good amount of variety dishes that can suffice your cravings. They also offer fruits and some dessert that were pretty delicious. They even offer to warm up the dessert! The customer service was meh...they were only being nice after we tipped them. The place was super hot, doesn't help when you're slurping on Sinigang soup. I think I'd come back again...but only if I'm really lazy to cook."}
{"text":"So good !especially the kare kare is so yummy a lot of choices and really cheap will diffidently come back here when i visit vegas"}
{"text":"Large selection of Filipino famous dishes. Wish they opened before 9am for breakfast would love to try that as well.

The place has been around for a while and coming to Vegas every few months I have never seen it or heard about a Filipino buffet. Now there are 2, this being the better of the 2.

Nice staff, friendly service, great tasting food. My only complaint is that they need a better selection for dessert, they had only 2 types of fruit that weren't even ripe. Would love to try some traditional style of desserts.

Will for sure come back when in town."}
{"text":"3 stars for the following reason
1. Location - easy access with lots of space to park 
2. Staff - friendly staff members
3. Food - okay (not good and bad)
4. Price - expensive 
5. Experience- okay, bought a marshmallow cookie on the grocery section when I got home, it was hard as a rock and taste awful."}
{"text":"Great food choices, and friendly staff, nice environment. Only thing they could use is labels over the buffet to let people know what they are selecting from. They have lots of meat/veggie choices as well."}
{"text":"I probably wasn't hungry that day. I must say!

It was greasy and didn't look appealing - more like mash meat and gravy. But hey! It tasted good but not of a certain distinction  from original dish. Hmm.....it could be that it wasn't cook fresh when ordered. It is a buffet so what else can I say :( 

So, if you're planning for a fresh and sizzling on a skillet dish this is not It!"}
{"text":"I'm Filipino and I'm used to all the \"interesting\" habits of my culture. So when the owner's  cute 2 year old daughter climbed up to the table and starting eating my food that didn't bother me. And it didn't bother me that even tho she took a liking to my 9 month old son and kept playing with him and us and the owners didn't even try to stop her or get her. lol. What can I say? We must all look like relatives to her! 

Anyways, but for $7.99 and all the choices of food you get, it's a steal. Oh yeah and the flat screen TVs showing TFC on heavy rotation is a plus for the hardcore. It's clean and spacious inside and the owners/staff were constantly wiping up and changing out food. That's probably why they weren't watching their girl. lol.

Everything I had was good (fried bangus, pinakbet, bistek, curry) except a small amount of pancit palabok they had out, it tasted spoiled. My MIL, let them know and they immediately removed it, but they didn't offer us a discount. What can I say they're pinoy right? And I personally like my sisig more on the crunchy side. It looked crunchy but wasn't. =( 

I'd come here again as its so close to the strip and a nice change from all the American buffets etc you'd normally eat in LV. My recap:

Pros:
-Large selection of tasty food
-Clean & spacious facility, so go ahead and bring everyone and their lola
-Close to the strip
-Attentive and friendly staff
-Hella Pinoy

Cons:
-Hella Pinoy (lol...kidding).
-The spoiled palabok, looked like it was the last bits from lunch or something. 
-They could have more desserts available in the buffet. All they had was honeydew, pineapple (can), cantaloupe and cheapy ginataan."}
{"text":"Kusina Ni Lorraine is translated as \"Lorraine's kitchen.\" I don't know who Lorraine is, but she can cook up some decent authentic Filipino dishes.

I understand that this isn't a fine dining establishment, but there were a couple things about this place that bothered me. I guess I really can't complain much because for the price point (under $10), you gain access to AYCE Filipino food.

The place is located on the Eastside, in a strip mall right across from the Boulevard Mall. It doesn't have the best parking situation & there may be people outside begging you for money. Kinda sketchy.

For it being a buffet, I expected a lot more variety in what they had available. A majority of the food was very similar to each other. Just to name a few:
Chicken Afritada, Chicken Menudo.
Adobong Manok (chicken adobo), Adobong Pusit (squid adobo).
Pork BBQ, Chicken BBQ.

The list of similar dishes could go on... I guess whoever planned what was going out on the buffet line wasn't being very creative.

Here's what caught my eye:

Kare-Kare (oxtail stew): Tons of tripe, moderate on beef, barely any greens. It would've been nice to see more green beans & bok choy (Chinese cabbage) because that would've cut down on the richness of the dish. It did have the traditional peanut flavor, and the meat was very tender.

Chicken Adobo: Too much chicken neck & bone fragments swimming in excess oil. Not enough pieces of chicken that had meat to it. At least this had a great balance of vinegar & soy sauce. They missed the mark on this common traditional dish.

Chicken Afritada: Tender chicken simmered in tomato sauce. I liked how they made it here -- the chicken wasn't dry, had a lot of veggies (especially carrots and bell peppers), and the sauce was delicious.

Feeling a little hungry, I went ahead and grabbed myself a second plate. Halfway through eating it, I found a hair. Total appetite killer.

For a buffet that you pay less than $10 for, you don't get much variety. At least what they serve is pretty much as close to traditional as you can get. With the abundance of Filipino establishments to get food from in Vegas, I think I'm going to pass on this place."}
{"text":"Clean with tasty food and helpful staff.  The palabok was really good but the sisig needed more pig ears!  It's not crunchy without the cartilage."}
{"text":"OMG! Looking for Filipino food!  This is the place! They have everything from Karekare, Dinuguan, Mongo, sinigang, tosi, longsi tuyo tapsilog, adobo, lecheon.  Desserts and Fruits and so much more I cant name it all!! It was so good and worth it!!"}
{"text":"This is a good buffet for a good price. $8.99, you can fill your plate and bowls with a large variety of dishes. I cannot begin to name them, but I found most of them very tasty and satisfying. 

My husband is a big fan and has been after me to try it, since even he cannot name every ingrediate, I hesitate to try something that neither of us recognize. 

Overall, it was tasty, if I tried something, it was usually good, however, I did separate out a few things I could not bring myself to eat (meat with a large blood vessel running through it and large chunks of fat turn me off) if you like most Asian food, you'll probably enjoy this. 

Service is excellent, the ladies are very attentive, there is limited and small parking area, good price, general store for most staples also connected so you can pick up a few Filipino delicacies."}
{"text":"My gf and I were looking for a place to eat for lunch and decided on Filipino food. Since we were doing errands in North Las Vegas we went to this place. First off, there are only three tables that sits six however there were already people siting on each table even if there were only two people on each so we had our food to go. The lady who helped us was nice but greedy with the amount of food given for our two combos. One of the combos, we got left overs of squid and pinakbet but they weren't under the warmer. They both were just sitting on the side which the food was still cold. The other combo we got was the last serving of tocino and instead of just giving us the container it was already in, she took some out and gave us half of what was left in the small container. Since there was no where to sit at the place, we decided to go to a park and have our meals there. When we found a spot, we got comfortable and started taking our food out to just realize they didn't give us utensils. So we packed up and went home. So, now that we're home digging into our food finally, I found an entire label from a container in my pancit. I was so so disgusted that I'm never going to this location ever again!!!! I hope the health/food inspectors comes here to do their thing cuz I saw so much health violation and I think they should keep up to code with this place!!!!"}
{"text":"Hesitant to order Filipino food from new places, but their pancit, lumpia, and empanadas were delish!
Going here from now on!"}
{"text":"Let me start by saying my dad likes this place. I grew up in the philippines with traditional homecooked food. Yes this is traditional food but it lacks in quality. I don't expect anything high from a $10 meal BUT I want some cleanliness in a food establishment. The water tastes like tap water and I had to change glasses several times, utensils still have soap suds and THE BIGGEST THING I HAD AN ISSUE WITH, so one of the tables was a bit wobbly one sunday lunch I put some paper napkins on it so it won't wobble anymore. FLASH FORWARD a few weeks later my family from CA wants to eat there, THE NAPKINS WERE STILL THERE! I dont know if no one noticed or they don't clean but that was the last straw. I politely excused myself and did not eat there with them. I'm sorry but I don't expect 5 stars but at least have the decency to clean. I should also comment on the food, i could take the oil out of some of them and deep fry a batch of fries with it because it was too much."}
{"text":"KUSINA NI LORRAINE is a 'MUST' if you're:

1. Visiting Las Vegas and in dire need to have filipino food...
2. On a budget... Buffet for $7.99...

Gotta admit... I've tasted better on some dishes, but overall, the variety is awesome, ingredients taste fresh and there are so many dishes... guaranteed something for everyone!

If this review meets your criteria... What you waiting on??? GO!"}
{"text":"Okay, so let's make it clear...this is a fast food restaurant as stated outside and run by Asians....so expecting warm smiling people may be asking too much.  However, $5.99 for a 2 item combo is a pretty good deal.  The pork adobo is flavorful and tender, the BBQ pork is tasty but perhaps even too fatty for me.  I'll be back because there are no other Filipino options near by...they win by default.  They also have a small amount of groceries as well."}
{"text":"The have a grocery and a restaurant. Get it to go or eat there. I had the pancit and chicken adobo with this other dish that is called dinuguan I believe. If you don't want to make it at home stop on by. Not a ton of seating but that's ok.  Lumpia was good as well."}
{"text":"This location is proof that the one on my end of town is a tad lousy. The food here is delicious and it helps that the workers are friendly in service. What I most like is there are ample amount of tables unlike the one near me. It accommodates our party of 6 easy. I can use a high chair without being in someone's way. 

There is also a mini grocery store for all or most of your basic Filipino fare necessities and then some. I'm glad we tried it out or else my Kusina Ni Lorainne opinion would be forever tainted. Hopefully, they stay consistent and don't change. I loathe when that happens.

 Definitely recommend if you are on that side of town looking for authentic 'pilipino poods'. =D
You could get a way with bringing a stroller in. When we were there it wasn't busy at all...but if it is and you end up on the side of the restaurant where the walkway is slimmer than the other side...your stroller might be in the way. But you can decipher it out for yourself while there. You know us stroller folks know how to make.it work.  =)

Enjoy!"}
{"text":"I'm only giving this place one star because I can buy papaya for chicken soup without having to go into town.

Restaurant wise....I didn't like the experience at all. The first time my husband went into order, forgot the name, but the lady said to not get it because it's old. Uh, then why not take it out of the food line? Their turon has been good ONCE! All the other times I went to go buy, all in hopes of it being mushy the way I like it..it wasnt. In fact, the banana was sooooo dry in there. Almost as if they used frozen banana or.something. I have no idea. Then the final straw as to why we will never eat here again, we ordered a medium bistek ala carte...I swear on a bible it looked like a small, there were like 4 pcs of meat, and the container was frickin drowning in oil!!! How the hell does a medium container only offer 4 pcs of meat, 4 chewy pcs of meat, 4 chewy pcs of meat soaking in oil, 4 chewy pcs of meat soaking in oil with alot of fat so really you weren't getting much mear. Aweful. I don't care if it's filipino food nearby, I'd make the drive rather than come here. More so, customer service can be iffy sometimes. 

Oh, and their halo halo...don't even. It's an embarrassing item to eat from a filipino establishment. Even my 8 year old was the first to say, mom...this halohalo isn't good at all. It wasnt. Waste of money. 

If you haven't tried halohalo at all...please don't make this place your first time.

Definitely not stroller friendly."}
{"text":"Let's see...writing this review is gonna be a bit of a challenge because I really don't know what most of the foods are called.  I will, however, say that Kusina Ni Lorraine is a fantastic buffet.  Having spent 3 nights in Vegas at this point and nursing a hang over, my friend Mon and I headed over to this little buffet on the recommendation of her mother.  Being Filipino, we figured that if her mother approved, Kusina Ni Lorraine must at least be decent.

Some of the highlights of this buffet definitely has to be the crab omelets, those delicious little Filipino sausages, and the blood stew.  Everything else there was pretty good too."}
{"text":"Darn it, I really wanted this place to be awesome. We arrived there after work around 7:40p...they closed at 8p! So we had to deal with the leftovers from the day. So of course, as all endings to Filipino parties go the food was luke warm, there were no garlic rice, no lumpia, and very limited choices. Well, $8 for dinner ain't nada I guess. Soda is extra btw. 

At least the ladies were nice about us being there. There were even a couple people coming in for dinner, so I didn't feel too bad. TFC (The Filipino Channel) was on, of course which made me feel like I was at my mom's house. Gave me a warm feeling...unlike the food. HA!

I had heard very good things about this place in it's primetime (lunchtime is the best I heard) but I definitely won't be coming back that late. I'll try it again when I'm back in town."}
{"text":"I had to give this place a second chance.

I still have issues with this place, but this time my visit here was met with much warmer and friendlier service.  The service was enough to make this place worth visiting.

Here's the deal.  It is a fast food panda express like Filipino food restaurant.  A 3 item combo was only 5.99 or you could buy just a serving of something.  I only know 2 dishes in Filipino food; pancit and adobo.  For some reason I didn't get any of that, I didn't see any in the steam trays.  

I asked the ladies to just put 2 of the best dishes with some rice.  I had chicken curry and something else.  The chicken curry was decent, the other dish was like little beans like lentils.  It was ok.  They did have some fish dishes.  

With the friendliness and the fact that it is super cheap I would say it is worth 3 stars. The food was not impressive, it was okay."}
{"text":"I really like the selection they have here--Mangoes with bagoong, pan de sal, polverone, etc etc. However, the cooked food leaves something to be desired. I ordered Diniguan and Kare Kare. The Kare Kare was not very flavorful. The Diniguan has a good taste but it was so fatty! I think 95% of the meat in it was fat. Yikes. That being said I do like this place, I just hope they improve on quality of the cooked food a little more. Where else in N Las Vegas can I get my Diniguan fix?"}
{"text":"8.99 +tax for the buffet - soda is extra

not entirely sure why this place only has 3.5 stars...

food: 4 stars
atmosphere: 4 stars
service:4 stars

came in cause the hubs was craving some dinuguan and pork adobo and got so much more....

food is on point, nothing fancy, no fancy fusion type dishes. just straight up good food like you would get at your lola's kitchen. which was great for me since my lola is 96yrs old and lives 300+ miles away......

the selection is limited but not horribly so - there was at least 14 different hot selections as well as the rice and pancit. 

they do not shortcut and stretch the food here people! the dinuguan was thick and flavorful, sinigang had just the right amount of sour, bistek was outrageously tender and flavorful, pork asado was sweet and sticky, chicken afritada was saucy with plenty of carrots, tocino was tender, and binagoongan was strong.  but no pork adobo.... sad sad day

(there was a Filipino buffet my family loved and was our go to place (on spring mountain) the last few visits left us underwhelmed and the very last one was where I drew the line -  watery and soupy dinuguan, bland kare-kare, tough bistek and the longanisa tasted suspiciously like polish sausage. eww quit stretching the food)

atmosphere - place is big and airy with a little Filipino market attached to the side. the dining area had plenty of tables but was still crowded when we got there. only complaint I had was the bathroom - there was only one! this place gets pretty busy and I wish they had at least 3 stalls. there's always a wait for the CR.

service - friendly service, quick to pick up our dirty dishes. definitely not horrible like some other Filipino places. I don't get it, why are some of my people so rude and short with customers???? help me understand......

would we return? absolutely yes says the hubs (and he's a hard one to please, a non-pinoy who was initiated into our food culture in los angeles where they have the best Filipino food)"}
{"text":"This place use to be good last year, now they got stingy and the food gotten bad! Got some pancit and fried rice yesterday to go,the pancit is salty as hell the fried rice is spoiled. Then the kare-kare was all bones that filled up the cup . Im done going to this place."}
{"text":"This place was great! Filipino buffet for less than $10? I'm there! The food was flavorful and it had a very \"homey\" vibe. I felt like my grandmother was behind the kitchen making my favorite dishes such as bisteck, adobo, pancit and chicharon bulaklak. Will I be back? You bet I will."}
{"text":"LOVE ALL THE WAAAAAAY FROM LOS ANGELES!!!

We drove and stayed in Las Vegas for my birthday. I've heard good things about this place from my friends and fiancé so I made sure to drop by this place. And boy, it was beyond amazing.

They have a wide variety of Filipino foods that are absolutely amazing. I just wanna let you know that it is not like your regular Las Vegas buffets - long and super plenty of option. The place is small (probably 40 people max) and about 30 kinds of filipino food.

But believe me when I say, it is freaking WORTH IT. It is cheap but absolutely good.

Please give it a try whenever you're around Vegas. Wohooo!!!"}
{"text":"This restaurant provides Filipino dish buffet. The price is cheap and the quality of the food is great. They also sell filipino groceries. The reason why I rate this place a 3 star because the service was not good. The plate where just piling up. And another reason was there were bugs in the pancit. Overall it was okay. The BBQ port was excellent."}
{"text":"Food was definitely really good and there was a lot of choices. Staff were friendly & welcoming when we came in. They even sell a bunch of filipino goodies, from chips to chocolates to polvoron to filipino desserts. Highly recommend this place!"}
{"text":"Very authentic 'at home' Filipino type of restaurant. I've been here 4x already & I have never been disappointed. I've tried their other location on Serene & this location offers better food options.

They always serve popular Filipino dishes. A few that I always see would be pancit, Kare kare, sinigang, bistek, adobo, etc....  my go to is always the bistek w/ extra onions please. For $8.99 + tax you can never go wrong!

My overall experience has always been great. Great comfort food at an affordable price."}
{"text":"Enjoyed their food. I'm not Filipino but my girlfriend is so she knows which dishes I like. Soups were on point as well as portion size. They love to dump rice on your plate. Can't complain! Full and happy every time. Super authentic in my opinion. They also have a little grocery store that is comparable to seafood city. So you don't have to drive all the way to Maryland/Chinatown. Store like theses are hidden treasure in our town. Check it out if you're northwest."}
{"text":"Came here for the first time last weekend.  Funny how I found out about this place from out of town friends.  

Food is varied.  I took three trips to the buffet and every time, there is new dish being served.   Most dishes are good, reminds you of your mom's or aunt's cooking.  Pancit malabon and kare-kare are my favorites.  Some are just ok.

Wish they served leche flan for dessert.  But for about $10, soda included, this buffet was worth it."}
{"text":"I came upon this hidden gem by accident. I was going to pick up some Indian Food in the same plaza and noticed it.
Initially it looked just like an ethnic market from the outside, but upon entering, I saw a delicious looking, huge selection of Filipino food.

I had the goat stew and beef stew with peanut sauce. Both dishes were packed with intense flavors! Really tasty!

I'll definitely be back to try more of their selection."}
{"text":"My sister and I ate here for lunch on a Saturday afternoon. The place wasn't busy. The employees weren't friendly. The tables were FILTHY!!  I had to wash them off with my hand sanitizer and a napkin!!  It wasn't because they were short staffed. Nothing posted as far as menu or prices, just a hot table with different entrees.   Had to ask for drinks. They were in a cooler that was behind us and off to the side. I guess that was our fault because we were so confused as to how things worked we hadn't seen them. They had containers for small, medium, and large taped or nailed to the wall but when we ordered a large they gave it to us in a large square to go container and not the large container on the wall. They place was dirty!!  No way to sugar coat it. But they did have some delicious pancit!!  That is only reason why I'm giving them 2 stars. I probably will never go there again though."}
{"text":"Finally got to try some food here last week! Unfortunately, we were too hungry to take any pics. We got 2 plates of the lechon sigsig, which came with sinigang. An order of Lumpia Shanghai and 2 bbq sticks. We decided to eat in. The servings were awesome! The Mr ate 1 plate all by himself and the kids and I shared one. I ended up taking home my sigsig cause it was a lot. The kids loved the lumpia and bbq sticks. I thought the lumpia was just alright. I miss my mother in laws! Decent prices, servings, food and service. Got a thing of buko pandan after. I should've checked the date before getting, it expired the next day. It was good though. We'll be back again"}
{"text":"Best filipino food deal in vegas. Bar none!!"}
{"text":"Awesome food for a very reasonable price! Great service! Very friendly and smiling crew!"}
{"text":"Maybe I came at the wrong time, the food appeared to have sat on the buffet a long time. The chicken was dry, the food was luke warm at best. The variety was ok but all tasted similar. If you want good Filipino food go to Max!"}
{"text":"Really good food considering the low price, surely a must go to for Filipino food when visiting Vegas."}
{"text":"First time here, good option for your filipino food fix! We went on a sunday, brunch time, best $8.99 buffet spent outside of strip. They have a good selection of all sorts of entrees, very tasty, will come back with my family"}
{"text":"Seriously, $9 for buffet? Really can't complain about that. I'm not a big filipino food eater but I still enjoyed the selection that was given. It was a good spread but some a little too oily for a taste. It definitely will give you a food coma with all that msg that's probably in there. This is one of the few buffets you actually eat first then pay. Service was friendly but still felt like we had to hunt them down to get their attention. Great place to get your filipino cravings fix for a low budget buffet."}
{"text":"if you are lookin for a filipinofoodbomb.com this is the place..and its a BUFFET n theyre cheap..i love eatin here errytime we go to vegas..:)"}
{"text":"Staff are super friendly and helpful.. they offered for us to eat first before we pay.. and the quantity of the food on my tray was plentiful and amazing! This is my to go to Filipino restaurant on the NORTH SIDE OF LAS VEGAS! Lunch with babe..."}
{"text":"Great food, good portions! They even opened up a full grocery store in there.

I have two complaints. First is it's always hot in there. Second is it's too small and crowded when you're trying to eat in."}
{"text":"Kain na tayo!!!

Holy cow are there a ton of choices at this buffet. For only $7.99, you have about 20 items to choose from. My plate was full and I had about 5 tiny bowls on my tray with various stew type dishes: Kare-Kare, monggo, adobo and a few more that I don't know how to pronounce or spell. On this particular visit, there were about 6 different eggplant dishes and I love me some eggplant! 

Although there are a ton of choices, like any buffet- you have your hits and you have your misses. It was about 50:50. The Kare Kare and the Dinuguan were huge misses, but the lechon kawali and the BBQ pork were huge hits. The fried chicken skin was quite salty but also oh so tasty.  When in Vegas- go big or go home. 

I came with my family (and when I say \"family\", we were about 50 people deep). Thank God we made reservations and reserved an entire section for our little get together. The service was quite accommodating and friendly, considering how large and hungry our group was. I was even touched when I saw a homeless man walk in, and one of the servers gave him a cup of something (food? drink? I don't know) but it was a very nice gesture. Way to go, my peeps! 

*Yelp 100 Challenge: Review 72/100*"}
