{"text":"This place is old school! Without a doubt my go to place for Chinese in the East Valley. I usually get the Cantonese house chow mein and an egg roll. Egg rolls are awesome, and their hot mustard is some of the hottest I've ever had! The chow mein is over pan fried crispy noodles and has awesome flavor! Also tried their sweet and sour pork and chicken, both excellent, and every flavor of fried rice is great as well. Almost forgot to mention, they have decent prices on beer too."}
{"text":"Very disappointed with the 1 hour delivery on a Wednesday evening when we live across the street and we only ordered 2 things.  The food for tge price is not worth it.. I will never order from this place again!"}
{"text":"I have been going to Kwan's for 25 years and still go at least twice a month.  Fantastic House-Fried Rice and Wor Won Ton Soup.  Sweet and Sour Triple is as good as it gets!"}
{"text":"I can't speak for the dine in service but we have taken out a few times and it's always been good. Nothing special, but Chinese food can be pretty scary."}
{"text":"Ordered the bo-bo platter for an appetizer  The beef was grey and smelled funny, the bbq was vinegar with ketchup and the egg rolls were rock hard. All of it was like leftovers from other plates.  Definitely will not go back and will never recommend this dive. Wish there was a negative star."}
{"text":"BEST. CHINESE. FOOD. EVER!!!!!! I have been going here since I was 5 years old. It was one of my grandmother's favorite restaurants and has always been one of mind. Everyone is so nice and polite here. The food is fantastic, authentic and delicious. It does seem dated and empty at times but I guarantee you, if you stop to eat here, you'll love it. They serve hot tea and it is so yummy. Try the beef and broccoli. Super delicious!!! Customer for life!!!"}
{"text":"I have been coming here for 30 years. Aside from the tacky chinese decor and country music, the food is good. My daughter is a sweet and sour fan. They have good lunch specials. There were a couple of composite photos of cutomers that were removed. No more Gabe, Randy, Jimbo,  Leslie. RIP Chief"}
{"text":"I don't know why they don't have a better review.. The food is good, fast, and affordable! They serve a large portion as well. My fave is the general tso's chicken. YUM!"}
{"text":"This place is sooo good. I stop by once a week for the shrimp rice and egg flower soup! Love it! Plus, they have a great lunch special!"}
{"text":"Horrible experience. The restaurant offers the delivery option.I placed an online order just to learn it cannot be delivered and that I will get my money back within 1-5 business days."}
{"text":"Cheap and consistent. Nearly everything is friend-so no healthy eating here. But it tastes pretty good and they are super fast."}
{"text":"food is good place is dirty. If they clean the place up it would be pretty good. I usually go with the takeout. Chinese takeout mmmmmm sounds good :)  People are friendly and service is good."}
{"text":"This place is just around the corner. The food and the prices are good. It could use a facelift though it's 70's decor could use some freshening"}
{"text":"We no longer go to the Sampan. We had guests for dinner and ordered take out from the Sampan. The lady that took the order said NO MSG in their food. When we arrived to pick up the take out order the cashier told us that MSG was in three of the dishes we had ordered. It may have been understandable, but she was not polite about it either. She says \"NO MSG FOR YOU, HA\" - I said we prefer no MSG in our food. We decided, they had given us bad information then the young cashier was somewhat smart mouth about it.  Who needs bad information and  poor customer service, we decided no more."}
{"text":"I can only speak to the delivery services from Kwan's as I have not physically stepped into the restaurant..  My thoughts are, \"meh.\" Maybe would taste better if I was a few beers in. I ordered lemon chicken and it was deep fried. The breading was too thick for the piece of chicken. The lemon sauce came separate in a huge plastic tub. I also ordered some other things but they were not memorable. Delivery was quick."}
{"text":"Great old fashioned Chinese restaurant.  It is like stepping back in time.  The place could use an update but the service, menu, and food are spot on.  The place is slow so no sitting outside for an hour waiting for your turn at a table.  And my meal was piping hot... Actually cooked for me instead of scooped out of a Luke warm steamer tray.    I'm glad I gave them a chance.  I won't be waiting in line for cafeteria style Chinese any time soon.  Oh, I almost forgot.  I ate till I was uncomfortable and am taking a healthy box of leftovers home."}
{"text":"Not a bad place, yes its dated, but the staff is super friendly and on top of the table I could hardly finish a half glass of water before they refilled it.   I had the number 11 which was good, but Im not a fan of the rice, maybe the pan was a bit burnt, but it was not to my liking. The main dish was very good and good value foe the money.  its probably worth a stop if your in the area."}
{"text":"Decent Chinese food. My in-laws love this place and its their go to Chinese food. I have had this on multiple occasions. The food is good and seems authentic. It's your typical Chinese food and it's always ready for pick up. The staff is very friendly and helpful. It also helps they are on Eat24 so liked the online ordering capability. We had the 4 happiness, house fries rice, beef and broccoli, egg rolls, and potstickers. All were very good. Only complaint is that the pieces are cut quite large. It would be easier to eat if the pieces were smaller."}
{"text":"Kwans is literally right down the street from my house and we eat there regularly for dine in and take out.  The fried rice is delicious, orange chicken and sesame shrimp are among our favorites. The egg drop soup and wonton soup is fantastic, I would not hesitate to eat here."}
{"text":"We've gotten their food a few times now and it's not bad. My review is based more on the fact that it's basically just \"American Chinese\" - Cantonese style Americanised Chinese food. I expected something better from such a big restaurant with an enticing name. this is nothing more that overpriced takeout.  I do like that the people who own it are actually Chinese instead of a bunch of Mexicans making \"Chinese\" food.  If you like run of the mill American-style Asian food then this is a great place, the food IS good. If you want real Chinese food, go to California because the only place in Arizona closed last year until I find another hidden somewhere."}
{"text":"Went here for lunch and was happy with the food and service.  The wait staff was pleasant and prompt, and the food came in a timely manner.  Their lunch prices are great; starting at $5.95 and you get a soup, eggroll, and crab puff along with your meal and rice.  The portions were just what I would want for a lunch portion.  Not huge (in other words, I didn't need a to-go box) but enough food that you leave with a full belly.  I was impressed with the quality of the fried foods (eggroll, cream puff, orange chicken) - everything was golden brown and crispy without being too heavy.  I also got the potstickers, and while they were not what I would call \"amazing\" they are so far the best potstickers I have found in NE Mesa.  Like the other reviewers say, the decor is not modern, but the place feels clean and they have a nice open dining area with plenty of seating."}
{"text":"Food is mediocre, but it's open on Christmas and the beer is cheap. Also pretty sure the Jukebox is free so definitely worth a stop."}
{"text":"Drove by the place for 11 years,  I wish we would have stopped sooner.  It was very clean.  Excellent and quick service.   Tasty food (you have to try the BBQ pork appetizer) Great value for a family.   AND they have a perfect kids meal for younger picky children.  You must try this place!"}
{"text":"Really Kwan's to me is somewhere between a 4 (on a good day) and a 2 (on a not so good day).  The trouble is consistency... you are never quite sure what day it'll be until you have ordered your food.  At times the food is very good and fresh tasting, but at other times (like last night), it tastes a bit \"old\" and reheated.  This is especially true with their chicken and pork dishes.  Nothing like the distinct flavor of microwave tasting reheated chicken in breading.  I'm not saying that is what they do, but that is how it tastes to me from time to time.  The people are nice and it seems to be a nice family run business, but I can't say it wouldn't be a regular stop for our family if it were any further away.  If they could simply figure out how to keep the food (chicken and pork) tasting fresh and not reheated on a day to day basis, I know we would go more often."}
{"text":"On Thursday, November 16, 2017 at approximately 430 in the afternoon, I took my 17 year old daughter Victoria to Kwans for a traditonal Chinese meal. I ordered the \"B\" meal and my daughter, being a vegetarian, ordered a soybean meal with vegetables. They brought us hot tea and egg flower soup. When our meal came, I gave a prayer, then began eating. My daughter, however, just sat there staring at her food. I asked her what was wrong and she pointed at the top of her meal and said, \"look!\" When I leaned forward to get a better look at where she was pointing, I could see a medium length, rust-brown colored strand of hair, stiking up out of her food!!! I was immediately disgusted and called over the waitress and showed it to her. She said, \"So sorry, I will bring you another one.\" We got our bill for $39.00(three meals total). They didn't give us a discount, offer to pay for the meal or anything. We were totally grossed out and we will never go back again!!!"}
{"text":"I really enjoyed this place as a take out for an easy dinner with my family until today. I was given the wrong change, when I called back the guy rudely stated they would \"check their cameras, because they had 2 cameras\". Instead of accepting they were in the wrong for having me drive all the way back and apologize for giving the wrong change, it was now that I was lying. The difference was about $10 and some change. I wouldn't not lie about 10 dollars, that is just plain stupid. So as much as we used to enjoy this place, my family and I will not eat here anymore knowing they could careless about customers.  Tip for the two people who helped me, maybe apologize next time for YOUR mistake? Would love to hear back from you when you check both those cameras and they prove to you you were given two twenties, like I had stated."}
{"text":"I don't even want to give it a single star. Worse place and food ever. Bad lighting. Cups smelled of old dirty dish water. Forks smelled the same and so did the plates. The food was not even remotely close to fresh. Gross."}
{"text":"Very Americanized Chinese food. Nothing amazing. The spicy hot and sour and egg drop soups were good. They didn't have that's syrupy texture which sometimes creeps me out. The prices are reasonable. Atmosphere was dated, ala 1980s place."}
{"text":"We were so sad this place wasn't good. We live nearby but honestly the food was so so bad. The people were very nice but we paid a lot and almost couldn't eat it. The sesame chicken had very thick breading and was soggy, the Mongolian beef had bad flavor and the walnut shrimp was just mayo-y and no flav"}
{"text":"Defiantly more than your pay for, and its cheap.  This place offers cheap prices and really decent meals. Its best for lunch but OK for dinner too. Yes the decor is lacking but the food has been good every time Ive been there. Its not top notch but service is prompt friendly and overly polite. If your looking for a place to eat that provides good food and value its hard to be Kwans. If your looking for something special or going out for an occasion with friends you might do better elsewhere."}
{"text":"Great classic dishes. Love the service. Great place, highly recommend. We go several times a month."}
{"text":"I have had take it from here several times and each time the food has been really good.  I keep meaning to stop in to check out the bar but just have not had the time. I would have to say this is one of my favorite Chinese food places and its convenient.    ** call ahead for take out."}
{"text":"Hard to find good Asian restaurants in north Mesa. I have to recommend this place. Recently moved to the area and wanted to find a local weekly dinning place. Found it! I always get shrimp and scallops in garlic sauce."}
{"text":"We were here about 6 months ago.  The first impression when you walk in is a funny smell.  Then you proceed to walk in and you feel like you are in a third world country Chinese place, this place shows it's age.  The lady server, was not that nice, and to top it off, my wife and the one other party on a Saturday night saw a cockroach crawling on the wall that is towards the kitchen, we were probably not 5 minutes into our meal, and asked for the check.  The chef or cook, came out with a broom and reach out to it and started smacking it. The waiter came to apologize and gave us a 20% discount on our meal for experiencing that.  They gave the other party a 30% discount, which I presume is because they were closer to the cockroach.  And there you have it, the closer you are to the critters the bigger discount you get.  They should promote that!"}
{"text":"Food was terrible. Really wanted authentic Chinese food and everything was fried and mushy."}
{"text":"This place brings me back to my childhood when going out to a fancy dinner meant the local Chinese place. It's got the no frills classic Chinese style, as it should be. I am happy they are keeping it old school and not giving into the peer pressures to be fancy. Good classic Chinese food that is pretty good to be honest. Bring the whole family and create fond memories for your kids too!"}
{"text":"As we walked in the only other couple (on a Sat night) was leaving and their plates were practically still full, they declined to go boxes,-- not a good sign. Tea came in a rusty pot, egg rolls were filled with ??, lemon chicken was so fatty and tasted of old fishy oil. Wife couldn't eat her prawns (Sm. shrimp). $28 gone."}
{"text":"Yes we do have a takeout/delivery place that isn't pizza!    We have eaten here a couple times and it is true that the decor is a bit old.  However, the thing I love the most is ordering takeout.  When I am tired and I want a meal and I don't want fast food this is our go to place.  We usually order the pot stickers, egg rolls, and lemon chicken with fried rice and beef chow mein.  The potions are HUGE and the first time I was shocked at the quality and size of the meats.   My husband and I could split one of the meals if we wanted.  Much of the food is fried but done the right way.  Sure I will admit, it is no P.F. Changs but then P.F doesn't deliver."}
{"text":"Do not let the 60s decor fool you.  This is an excellent Chinese food restaurant. It specializes in Cantonese, which isn't as trendy Sichuan and Hunan, but the dishes are quality and have generous portions. The Hot and Sour soup and General Tzu's chicken are standout items."}
{"text":"This was our first time here. Saw good Google reviews. The egg rolls, egg drop soup, crab puffs were good. So was the the fried shrimp and sweet and sour chicken. The main course was chicken sub gum. It had a weird flavor to it and was grey like they boiled it. We couldn't finish it. The service was good, they are very nice, but we probably wouldn't be back. At least not for anything other than maybe egg rolls or crab puffs"}
{"text":"Best chinese food in the area. I have to admit I have not actually ate inside but I get carry out regularly. I order and pay online before i leave work. I tell them what time I want it. I run in and pick it up on way home. Very easy and I have never had a bad experience. The orange chicken is so good!"}
{"text":"I agree with the other review about the decor.  He said it well.   Have you ever walked into a Chinese restaurant and it had that smell to it?  I mean, not a good kinda smell like oh, smell that food!  It's more like ewww, what's that odor?  According to my nose, anyway.  This is not the kind of Chinese food that I'm used to.  The fried rice tasted like smoke from burnt oil.  Some people might like that smoky flavor, I don't know.  First couple of bites of the main dish, I couldn't really identify what I was eating... it was not a good taste.  It was blah, oily, too much thickening agent, not enough soy sauce.  Is this chicken or what?  Their food is different.  The waiter explained that it was east coast Chinese food.  For example the chicken chow mien is with bean sprouts and not noodles.  They call the one with noodles something else.  Which is fine and they were more than willing to give me the other dish.  The price was good with the coupon, but I would not eat there again."}
{"text":"Dined in for lunch today and was plesently pleased. Food was delicious and reasonably priced and it had a nice quiet atmosphere. I am very happy with my visit and I will return."}
{"text":"Eww. Just eww. Based on the previous Yelp reviews I was expecting mediocre, at best. However the food at this place was just gross. Add that to the horrible service- we wont be back.   There was 4 of us in our party, we were seated right away. I ordered iced tea to drink and it was so gross- clearly old and had gone bad. It was all downhill from there. Our four orders were taken correctly but 3/4 orders came out after about 45 mins. The 4th order took almost an entire hour to come to the table. Now, to be fair- if the restaurant was busy or the food was amazingly good- Im okay with the wait. However, the restaurant was not busy at all- and yes, the other reviews are correct- it looks like heaven's waiting room in there. Apparently the elderly like gross food. The servers brought out items and placed each plate, without any communication, at the center of the table. So, we were left guessing what items belonged to which order. There was never a refill on drinks, never a check back to the table to see if we liked the food, nothing. The only time we saw our server again was when she tossed the check on the table and walked away."}
{"text":"yes, teh decor is a massive throw back and the bar is a cave, but we found many dishes to be quite good.  the pork chow mein and pork fried rice are really good, the bbq pork slices (char siu) on the appetizers is very good too.  have not tried many of the mroe eccentric dishes, but we have tried many of the normal staples and found them quite tasty.  this is not PF CH#$%'s, just a neighborhood joint.  once you get used to it, the very very very dated decor kind of grows on you."}
{"text":"I have been dining at Kwans for over a year now it is my go to place for Chinese food. They have all the classic dishes that anyone would expect. They do have delivery which is always nice after a long day at work. They arrive very quickly and are always extremely nice. The food always arrives hot and fresh. I would suggest ordering the sauces on the side if you are ordering for delivery. For example if you order orange chicken order the sauce on the side so that the chicken stays crispy. The chicken chow mien is my favorite! I would say probably the best I've ever had. The place is clean inside but a little outdated but hey I'm there for the food! Stop in and give it a try. I would recommend to my friends.   Also, the restaurant has a separate side that is a bar with pool tables, not a bad place to have a beer and shoot some pool locally here in Mesa. The bar area is on the calm side which is nice if you are looking to relax and hang out for bit. There are a few tables and booths in the bar area as well so you can order your meal there too. Prices are fair, food is great and the employees are very kind. I will continue to dine and order with Kwans."}
{"text":"Other reviews seem to be all over the place.  My daughter and I went to Kwan's last week, on a Thursday night.  They weren't busy, but the people who were there seemed to be enjoying their dinners.  We ordered the house special lo mien, house special fried rice, mu shu pork, and shrimp with snow peas.  Daughter also ordered won ton soup and fried won ton, and I ordered hot and sour soup, and of course we got the usual white rice.  We didn't touch the white rice at all.  The won ton soup went down quickly, the hot and sour was quite sour and quite hot and had the surprise of some rather large pieces of chicken in it - a first for me.  The dishes came out one at a time but close enough together that we didn't finish one before the next one.  The lo mien and fried rice were good; the shrimp with snow peas was excellent, and the mu shu pork came already wrapped in the pancakes - four fat pancakes full of excellent mu shu pork and lots of plum sauce.  We ate until we were satisfied and brought home enough food for one more meal each and one more round of rice and lo mien.  It was pretty yummy.  I agree that the decor is straight out of the 60s, and this is the kind of Chinese food that I learned to like when I was 20--that's a lot of years ago.  Good stuff.  I'll go back whenever I'm in Mesa,  Hubby doesn't like Oriental food so I have to get my fill whenever and wherever I can---Kwan's did its job this time.  Prices are moderate, parking is at the door, the wait staff is friendly and not intrusive.  I like this place,"}
{"text":"Didn't get to try the food as I went in and asked if my boyfriend and I could get smaller portions or a half order as I like orange and teriyaki chicken with some fried rice. Their prices are $9.95 for each chicken plate. That's over $20 for one person, it's just too much food, especially if I don't even know if I will like it it not. Talked to a lady who said she was the only manager on duty and said they have lunch for $6.95 a plate but it ends at 3. We asked if they could do a half order for us at the lunch price as we would both be ordering two as well as rice and drinks but she refused and said lunch is lunch dinner is dinner.  I could understand if it was a special for $6.95 you get the same amount of food but it would be a half portion for not even half the price. Ridiculous."}
{"text":"Picking up some food on my way home, I ordered a orange chicken and few egg rolls. Everything were tasty, and food come out fast and hot. I will for sure come back in next time."}
{"text":"They did a birthday dinner for us. 12 people. Food was good, hot and tons of it! Good service and great prices. Thanks!"}
{"text":"Fun fact: American Chinese restaurants have started to open in China. Products and ingredients needed to recreate these adapted dishes are imported, including Philadelphia cream cheese, Skippy peanut butter, cornflakes and English mustard powder. Also, General Tso (Zuo) never had that chicken.  Kwan's is American Chinese cuisine. And it is go-oo-ood. You can now order online, which for me, is tops!   The restaurant is located on the southwest side of a retail complex. It is easily seen from the street. The entry has a bench and service counter. There is no bell or anything, so you may wait there for a few minutes before being greeted. There is nice decor and a large carved statue that has been there forever. There is some new weird octopus lamp that was interesting. The dining room is quite large, and is comfortable. There is also a northwest separate bar. The bar is dark and divey. I never see many people in there, and I have never been, so I can't say why. The food is always hot and tasty. Our favorites, and let's face it, the things we order every single time, are: Shrimp egg foo yong. Large and dense patties with a thick, salty brown gravy. There are 3 patties in an order. Bay shrimp are plentiful in the patties. House fried rice. Soy marinated rice (brown colored fried rice, not white or yellow), with peas, egg, chicken, beef, pork and bay shrimp.  Crab Rangoon. Not star-shaped, but little pouches. There are 10 per order. I feel like there isn't any crab, but I still love these little fried gems anyway. BBQ pork ribs. J loves these. Lots of sweet and salty sauce. He says they're great, o think they're a bit fatty. Beef skewers. A good serving of marinated beef skirt. Some farrier than others. But I like no fat, and J likes the fat. So we're usually both happy. The egg foo yong is always served with steamed white rice as well. You also receive ample fortune cookies, soy sauce, hot mustard and duck sauce.  This is a great place to be bad. Try anything on the menu, and you will likely be pleased. Good service, good menu selections,  good quality."}
{"text":"First time eating here. Friday at 5:45 pm and we are the only 2 in restaurant. The dinning side is very well lit and bright.  First course - won ton soup is very tasty. Egg roll is not greasy and has a lot stuff in it.  Dinner - fried rice with chicken is huge.  So is general tsu chicken. Both very good. Chicken is tender and juicy. Veggies are crisp and flavorful.  6:30 and place is filling up. Highly recommend this place. Great food and great value."}
{"text":"My daughter and I went here for take out tonight and this is by far the best chinese food I've had in years! We got a ton of food for under $40. The food was so fresh and delicious and the customer service was superb. This place was a bit father from the chinese restaurants (more like \"hole in the walls\") near me but after reading reviews I wanted to try it out... I'm sure to be a regular now! The crab puffs, sweet and sour chicken and lo mein were amazing! Thank you for this great experience and keep doing what your'e doing... see you again soon!"}
{"text":"It would be a one star review if the waitress wasn't trying exceptionally hard to be friendly.  We came to this restaraunt with about 10 people for a birthday party (which seems to be a trend these days... birthdays. Cut it out already, people! Every year!?) and we were quickly seated to a large table. We came here on a recommendation from a couple of friends that are vegetarian, as defined by eating cheese and rice dishes. Not your \"tofu\" or \"tempeh\" kind of vegetarian. We were going out on a limb already.  We got our orderd quickly taken away, and the tea was incredibly hot, but tasty and served in tiny little cups. The water took a lot longer than I had expected to be refilled, but it was a large table.   Then came the food. Bleh. I saw a review saying that \"this is your grandfather's chinese place\" and that couldn't be more right. It was like buffet style food in a restaraunt setting. Everything was overcooked and slimy, the bamboo shoots were clear and weird, the sprouts smelled a little strange. The crab puffs had NO crab in them, weren't really all that puffy, and contained the sick moist  nothing-but-cream-cheese filling I've learned to hate over the years. You can't really eat them without the cakey dough like texture getting all in your mouth and tainting your next bite.  Boyfriend got a Bao Po platter (something like Pu Pu, I'm assuming?) and I couldn't really eat any of it. The \"Egg roll\" had chicken and pork, so that was out of the question. I ate some sticky rice just to get by.  The sweet and sour sauce ended up being gelatenous -- as in, we poked a fork or a wonton in it multiple times and NOTHING came out. Jello sauce. The deep fried shrimp looked like a deep fried seahorse. It was HUGE and in the shape of a horseshoe. We affectionately called it the shoe-horse all night.   I had a really good time here because I have friends with a good sense of humour, but this place tried very very hard to get me to have a bad time. Wouldn't go back unless I had already eaten."}
{"text":"Food is delicious. I am happy to have found sweet and sour pork. The last chinese restaurant that I loved closed. It is very difficult to find an awesome asain restaurant & i have finally found it!"}
{"text":"The food is really good. Large portions. My wife and i will share next time. They have a seperate bar ,lounge area. Staff is pretty good(despite some language barrier)."}
{"text":"So far, everything I have tried on the menu has been delicious.  Their Pepper Steak is good and they have great fried shrimp.  I also like their lunch combos.  A great place to eat and it is nice on the inside."}
{"text":"I will never, I repeat NEVER visit this establishment again. After receiving a gift card for discounted dining offers, I confirmed on the internet that this place would honor the card.  I decided to take my son there to eat. They advised me that they would NOT honor the card AFTER they served us soup and our drinks. The total for that nonsense was 3.62. I was told that I needed cash and they wouldn't run my credit card for under 5.00. I promptly advised the woman that if she wanted to get paid for the bill, she would run my card for the 3.62 they were charging me, I would NOT be purchasing anything else from them to make up the difference. RUDE! I also contacted the Entertainment card customer service department as to find out why the discount wasn't accepted and to let them know that I am hesitant to try to use the card again. I will go to Panda Express next time. At least I can understand the people who work there while they are trying to screw me."}
{"text":"Ordered the Moo Goo Gai Pan .. horrible ! Did they get a new chef, are they cutting corners to keep prices low? What ever they are doing they need to correct it fast. Been dining here for years.. Last time we did dine in a few weeks ago..  We ordered a House Special Chow Mien plus soup and egg roll.. Husband and I couldnt eat the BEEF or the Chicken it was horrible, slimy texture, beef was chewy un edible .. They corrected the order by making us Shrimp Chow Mien.   Tonight I ordered take out, Moo Goo Gai Pan. I had to toss it in the trash, used to be it was made with fresh sliced chicken breast, today it was slimy processed chicken of some sort, over loaded with vegetables and over abundance of canned mushroom, hardly any sauce, laced any flavor. Usually it is seasoned with garlic flavor, there was no taste to this dish. HORRIBLE !   Won Ton Soup on the other hand was overly salty. Tonight they failed me !   I suggest you serve quality food, I would be willing to pay the price instead I am out  $20 dollar bill and no dinner.     Do not order Moo Goo Gai Pan, or Chicken, Beef Chow Mien.  Egg Rolls are Good when they are cooked fresh to order."}
{"text":"Their General Tso's chicken was edible yet lackluster. Severely deficient in sauce and borderline dehydrated. Each bite had to be swallowed with a swig of bourbon. Note: if you are parched in the desert, don't eat this. You'll die."}
{"text":"This was the first time for us to try this place, it was 5:45 pm on a Saturday night and we were literally the only customers in the restaurant.  My husband almost wanted to leave but I said no let's give it a try.  I ordered the dinner combo A. The egg drop soup was really good. The plate came out and it was huge. Plenty of food for less than $10.  The egg foo young was delicious! Some of the best I've had. The fried shrimp was really good. The sweet and sour pork was really good as well. The chicken chow mein was average but not bad.  I thought everything was wonderful so I don't know why it wasn't packed.  I will definitely be back. I work right down the street so I will have to try their lunch someday."}
{"text":"The worst ever so disappointed ordered Mongolian Beef, sweet sour chicken,pork with shrimp and a side of lo mein the worst ever so bland I was ripped off! Needless to say 25 bucks down the drain lesson learned stay with what I know, Panda is so much better"}
{"text":"Always good food!They need to do something with the smell  of the restaurant though.The best Chinese food in town !"}
{"text":"Yes. Four stars for this Chinese restaurant that time forgot! Actually 5. yes, FIVE STARS. Why 5 stars? Kwan's serves old school Chinese cuisine that I haven't encountered in years. This isn't the place I'd suggest going for some kind of seafood delight, but if you want Chicken Chow Mein with big huge red ribs, and everything else golden fried in classic deliciousness, THIS is the place to go! When I was just a pup back in Cleveland, this was the type of Chinese food that made every Friday night the best night of the week. Keep in mind that some of the names here are a little different.. For Chow Mein is bean sprouts, water chestnuts, celery, sauce and Chicken over crunchy noodles. My dad has been on the lookout for such Chow Mein since the 90's or something. I'm a big fan of their fried stuff. Their egg foo young has that amazing gravy that inspired me to try my hand at cooking in the first place, way back when I was 9.  Finally, the prices GET STUFFED for less than $10 a person.. more like $7 if you're there for the lunch special. The service is fantastic too. It may look dated, it may smell like your grandma's friend's house but whatever, this is classic Chinese American food at prices that Panda Express can't touch."}
{"text":"We tried this restaurant out for the first time this past week. We ordered three different entrees and egg rolls. The shrimp fried rice was good, the shrimp egg foo yung was good, the orange chicken was so so and the egg rolls were good but were VERY small! The best thing about this restaurant for me is the price of the food (except the egg rolls). The Chinese restaurant I've been going to would have charged me $45 for what Kwan's charged $33.  Their food is good enough that I will probably go back but I will still be searching for my \"go to\" Chinese restaurant in he Valley."}
{"text":"Decor aside.. this place is a staple in north mesa. Yes the interior is dated, well so is my grandmothers home but I sure love her dinners as well. :)  The portions are huge! Despite my 160lb walking carcass I eat like a hungry hippo and can hang with the best of them.    Appetite aside I have something to take home each and every time and it makes for a nice snack when reheated.  The service is a little slower, however they are polite and accommodating. By slower I am not implying you are waiting for ever, just that this is no panda express nor would I ever want them to try to emulate such a thing.    It is a place where you can take you time, settle back with some conversation, your laptop or friends and just take your time. The place is large, but that also left me feeling I was not at all rushed or taking a table like other places.  If you are wanting to try this place maybe stop in for lunch, the price and portion cant be beat. I also hope to come down and check out their bar sometime.   Having this place in north mesa is another nice dinner option and they deliver too!"}
{"text":"Great dishes, bitter melon beef is my favorite! Spicy and sour soup is so authentic that my wife loves it so much. Nice food and friendly service keep me going back again and again. I should have done the review sooner."}
{"text":"This is your grandpa's Chinese restaurant.  Don't take that the wrong way.  It's just that the decor feels to me like it is out of the 60's or 70's.  Like maybe the restaurant could have been used as a set in the movie Dirty Dancing.  You know, when Baby and her Beau sneak off to town for some chow mien.  The food varied, overall it was decent, not great.  The prices were reasonable and the service was kind of slow.  We had crab puffs and an egg roll for starters.  They fall at about 2.00 stars.  The entrees we had:  lobster with black bean sauce, emperor's beef, Chinese fried chicken and pork fried rice.  The lobster meat was tender.  I didn't care for the sauce.   It looked and tasted like egg drop soup with some black beans stirred in.  1.5 stars.  The beef was in a mild brown sauce over assorted vegetables.  It was tasty but needed heat to set it off.  2.5 stars.  I did not like the Chinese fried chicken as it was overdone and tasted strongly of the frying oil.  2 stars.  You should know that my wife did like it despite pointing out that it was a little chewy.  The pork fried rice was very good, with BBQ pork in good quantity.  3.75 stars.  Take the 5 ratings listed above, total them up, divide by five and you have the true rating: 2.35 stars.    Just below average."}
{"text":"I have to say that this is my favorite chinese restaurant and probably a very underappreciated one.  This place is definitely a bit of a hole in the wall- outdated on the inside, not so great decor.  The staff, however is very friendly and I have always enjoyed everything I order here.  The restaurant is quiet and relaxing and they have some fun drinks to order from the bar.  I especially appreciate the Scorpian Bowl for Two...which comes out flaming.  The prices are good too and they deliver."}
{"text":"I have lived in the valley for 35 yrs.  I have been ordering from Kwan's for 32 yrs.  I love supporting busniness's in our neighborhood.  They have always been very pleasant when picking up orders or dinning in.  Thru the years this restaurant has always had great food and great service, always served with a smile.  It's so nice to see they are still here in our neighborhood.  I like the authenticy this restaurant has always shown, and what a great staple for our neighborhood to be here over 50 yrs!"}
{"text":"We love Kwans! It's our local traditional American Chinese restaurant. The food is consistently delicious, the portions are large enough to feed our army, and the person at the front desk is always pleasant."}
{"text":"I don't know what happened here??? New ownership? We have been coming here for years and we decided to go for lunch today and didn't see any of the regular staff.  Not only that, but the food is NOT the same.  The family favorite, Wor Won Ton Soup had NO flavor and served us half the amount they usually do!  The vegetable lunch plate wasn't  the same sauce and they changed the vegetables.  It tasted like they took it  out of a can and didn't bother to cook it !  They typically have a brown sauce at lunch but changed it to some kind of white sauce.   My daughter didn't even eat her meal and normally she can put away some food here!  She didn't even take it to go because she didn't like it.  I also tried it and didn't want it either.  The rice has also changed.  Flavorless!!!  I would never go back here again if this is what they are now serving up.  Panda Express is upscale compared to this now!  What a disappointment.!  The server denied that anything changed, however, we have been going here long enough to know that it has all changed.  My husband has a cold so he said he couldn't taste his food thinking it was his cold but my daughter informed him that it wasn't his cold, it was the food.  On the positive side, the server was very attentive and provided excellent service."}
{"text":"I truly believe this place is underestimated. The staff is friendly and accommodating. It's a great local place to have a Saki Bomber(s) and happy hour. If you like Sushi, they have just added a great Sushi menu! Support local business! The bar side is nice but low key. The dining side is quaint and serves its purpose."}
{"text":"Have eaten here twice, once in the bar and once as takeout. I was unimpressed both times. The restaurant and bar are old and poorly kept. Stacks of paper at the hostess desk, no hostess for at least 4-5 minutes. The orange chicken was good but the curry chicken was watery and bland. The fried rice had no vegetables or egg or anything else in it. Presumably they just threw in some browned oil and called it done. The second time, we called 30 minutes ahead and I still had to wait another 20 minutes for it to be ready. They were so understaffed that several phone calls were ignored completely at the hostess stand. Service was harried at the front although the server in the restaurant was nice and greeted us...but had her hands full. Again the rice was blah, the Kung Pao may have made our son ill and I couldn't even eat it, it was so bland. Looking elsewhere for Chinese food. Keep hearing its good food, but I definitely don't agree."}
{"text":"Panda Express is fine cuisine compared to Kwan's Sampan.  Their Kung Pao chicken was soggy.  Every dish was flavorless.  We tried it twice to be sure we weren't mistaken or ordered on a bad day because a couple of locals recommended it.  It was just as awful the second time we ordered."}
{"text":"I have not dined in yet but the online takeout feature is amazing. Every time i go to pick up my carry out I am reminded of just how much food comes with a small price. I try something new every time i go and i have yet to be disappointed."}
{"text":"This place is reasonable, and food is excellent.  It appears to be family run, and has become a staple for me since moving to the area."}
{"text":"I knew I was in trouble when I ordered online and there was a box to add a tip for food to go.  I worked for tips for 20 years and know you work for them.  Ordering food online and picking it up never gets a tip from me.  Like a tip jar on the counter of Dunkin Donuts.  For why?    Pass on this place.  I asked for extra green onions in my Mongolian Beef. Didn't see it. However, beef was very tender, but not impressed.  Next dish was Moo Goo Gai Pan to which the sauce is the secret.  The vegetables were ok, chicken was overcooked according to person eating it.  Again, sauce too mild."}
{"text":"The best place that makes Chicken Chop Suey!! I always return for that!!"}
{"text":"Food was better than the atmosphere which was dated like the 1970's. I would go back"}
