{"text":"Was passing through this little town and stopped at this new Italian Restauant called L'Antica and what a suprise. The food was authentic Italian and tasted home cooked. The pasta was fresh and al dente. My boyfriend had the veal parmesan and he said it was the best he ever had. We visit this place again every time we are in town.  I highly recommend this place.  ps. The pricing was half of what we pay in Toronto!"}
{"text":"Unfortunately I was very disappointed with my experience at this restaurant. I wanted Italian food so decided to give it a try. I found the pasta to be very bland and had to add a large amount of hot peppers as well as a lotttt of cheese in order to have any flavour (I generally dislike spicy food.)   Potatoes were not only undercooked but also had a strange spice on them that was just not palatable. Salad wasn't bad, but a bit salty for my liking.  Not at all worth the money- of you're looking for delicious Italian food, you're better off going to grab a slice of pizza at lemars down  the street."}
{"text":"We recently had our son's baptism reception (50 adult guests and 7 children on a Sunday afternoon) at l'Antica Ristorante and were terribly disappointed.  The food was mediocre at best. Veal chops were served VERY rare and when the staff were approached regarding this, my guests were told that nothing could be done (surely the veal could have been put back on the grill?)  Our original agreement regarding alcohol consumption was not upheld, and the staff were extremely pushy when it came to filling up glasses of wine to the brim (even to guests who clearly indicated that they did not want any more.)  There were numerous glasses of wine left filled to the brim when we left, and we, the paying customer, were never once asked if they were to open another bottle (as per our agreement). In fact, wine was served even before any food was served, and my grandfather, who asked for water to take his medication with, was only served water after he was poured a large glass of wine. While regular coffee and espresso were included in our original invoice, the staff pushed lattes and cappuccinos (bringing out cappuccinos asking who they belonged to, when my guests said that they were not theirs, the staff asked if they wanted them anyway and left them on the table.) (The added drinks resulted in an $800 additional charge to us.) Those who did order coffee and espresso had to wait until the cappuccinos and lattes were served (the staff saying that their \"regular coffee machine was in the back and so it would take a while\"). Many of our guests got their coffee long after dessert was done.  My guests were told that there was no cream for their coffees. (When I called to give my feedback a couple of days later, the manager insisted he had cream.(?))  My nieces and nephews were drinking from juice boxes that their parents brought as they were never served juice. (Again, the manager insists he has juice (?). Two tables asked for more bread with their pasta... I suppose the staff was so busy pushing drinks that one table (ours) didn't get bread until after the veal was done, and the other table (my parents') didn't get it at all.   My husband and I phoned a few days later to give our feedback (not wanting a thing) and spoke to the manager, Massimo, to let him know what our disappointed guests had to say. Rather than hearing us out, he was very argumentative, defensive, and told us that we \"should go and tell our 'people' not to ask for drinks\". When I told him, that as a business owner, he should hear out what his customers have to say, he responded by shouting that \"he owns 5 businesses...do you think I care about your stupid little party?\" and asked us \"honestly, how much do you think I made off 'you people\" after I pay my chef $35 and hour?\" just before hanging up the phone on me. This is not the first time we hosted an event at a restaurant, in fact we generally do, but this is the first time we have ever left feeling so cheated and all around disappointed, and the first time we have ever felt the need to phone to give negative feedback.  More shocking than the overall experience of the day was the manager's reaction to our comments. We have never been to l'Antica for dinner, and so I can't comment on that, but in terms of hosting an event there, I would stay far away."}
