{"text":"I lived in Montreal for 3 years and once I found it this became my favourite restaurant.   Great food, and a pretty nice menu (lots of good options done in interesting ways). Sounds weird, but this has the best Caesar Salad I've ever had. Just beautiful.   Also very comfortable there. White table cloth, 3 dining areas (street level, downstairs, and upstairs, but still very open feeling. Great servers too. They know their stuff, are all french first, but are either fluent in english, or make a great effort to speak english (which is even better in my opinion) .  I typically eat for free for work, and I'll take L'Aromate over Montreal's high end steak houses any day."}
{"text":"C'est vraiment un beau restaurant, ya une belle ambiance, le service est bon mais le rapport qualité prix n'est simplement pas là.   C'est plate quand tu fini ton assiste en te disant tu aurais pu avoir mieux pour beaucoup moins cher.   Vraiment déçu."}
{"text":"Was here with 5 girlfriends on a last minute dinner reservation.  We had heard good things, but our experience was better than expected.  Hostess (both on the phone and in person) very pleasant and kind with our call at 6pm on a Sat night wondering if any cancellations came up.  Restaurant itself is quite modern, well decorated, classy.  Crowd mostly 40s and 50s, groups of 2-6.  Prices of entrees were in $20-30+ but they had a prix-fixe 2 course (appetizer and main) with options between $21-37.  Great value.    Favorites of the table included: duck confit, lobster bisque (appys), lobster risotto, steak frites (mains).  Portions are fairly substantial.    Service excellent with the right amount of attention to details and following-up our meals.   Would definitely come again."}
{"text":"C est completement deguelasse cet edroit! On a attendu une heure pour avoir notre commande, et la moitie de la table a ete malade apres avoir mange la! Trop cher! Pas de qualite! N allez surtout pas la!!!!!"}
{"text":"Went here on a Monday night during a recent trip to Montreal. We were wandering around looking for somewhere to eat at around 8:30pm and had trouble finding anywhere appealing and open. So, we ended up here.  I ordered a burger and my husband got a club sandwich. The waitress warned me that the burger would take about 25 minutes to cook and suggested an appetizer. Since I'd gotten the same suggestion at another restaurant the night before, and the appetizer also took 20 minutes, I opted out.  When the burger came half an hour later, it was understandable why it would take so long to cook. It had to be at least two inches thick. It was more like a huge slab of meatloaf than a burger. It was completely impossible to take a bite through the entire burger. Partway through eating it, I ended up slicing the patty in half horizontally and discarding half of it, just so I could eat the thing. Some of the toppings on the burger were tasty, but the burger itself was dry. The fries were also rather cold.  My husband got a club sandwich, which was also dry, but he enjoyed the fries.  The total bill for a burger and a sandwich and a couple of non-alcoholic drinks came to over $60. Definitely not worth the price, and I wouldn't want to eat here again even if it were cheaper."}
{"text":"I arrived with my group of 4 at your location downtown on Saturday  Feb. 11th. I was very dissapointed with the outcome of your hostess  service. 2 of my group first came in and waited to be seated.  As there was no hostess, they sat themselves. I then came with my partner and waited 10 minutes at the entrance area and there was no  one to confirm our reservation and seat us. This is considered a  high end resto, you would think that a hostess would be present to  welcome us and confirm our reservation?  Ate the end of our meal service, I had to go see the hostess who was chatting in the back to ask her if she can confirm me in the system  as I had reserved through OPEN TABLE and her response was \"Oh well  that's going to take me forever to find you in the system?\"  Excuse me????? I am a customer that spent 260$ at your restuarant to have your hostess comment me this? I don't think so, her response  should of been \"Of course, what is your name i will take care of  this right away and ensure you receive your Open table points\".  I constantly eat out and I have never received such poor service  like this, I am so insulted."}
{"text":"We were visiting Montreal. We walked into the place without checking reviews. The staff is very friendly and  accommodating. Food is somewhat expensive, but delicious. I had salmon dish which was really great with very tasty side. My wife had fish of the day that was equally good. I would definitely recommend the place"}
{"text":"This restaurant is amazing. Starting with the decor and the ambiance! The service was great and the food was incrdible. I went there three times and can't wait to go back. I recommand the sugar pie for desert. It's not a traditionnal pie but it's awesome."}
{"text":"Bon repas gastronomique, super table d'hôte! Si vous recherchez un hotel avec un bon resto et de l'ambiance, c'est la place! Prenez la tate au sucre réinventée!!"}
{"text":"Food is discusting. Too expensive for nothing!! No hostess,(in a supposed to be high-end restaurant?) The manager looks very stressed and disorganised. Lack of communication between the staff for sure. He seems very arrogant and rude to his staff, a lot of tention there! I dont reccomend that place to anybody."}
{"text":"This is a very nice little bistro on Peel street.  I couldn't really decide between the lamb and one of the fish dishes so I decided to go light and ordered the Red tuna sashimi on an angel hair noodle roll, roasted in olive oil, teriyaki sauce and capers.  The angel hair noodle roll sounded intriguing.  This is just as it sounds.  Angel hair pasta rolled up.  There are some thin crispy noodles and I think some onion strings to add a cruchy texture to the dish."}
{"text":"I came to this restaurant several times for their good food. However, what always stands out is the terribly bad service. The waitresses are unfriendly and very slow. The food is over priced given poor service."}
{"text":"we had the not so brilliant idea of booking our valentine day dinner there... the food was overpriced, unimaginative, and the place was overall quite noisy. The staff was yet attentive and helpful. However, based on the food served to us then, I will not go back."}
{"text":"Mediocre at best. Service is terrible. Food is OK presentation is good. For the price you can do much much better in montreal."}
{"text":"So for our first dinner while visiting Montreal, we ended up at L'aromate. We originally had reservations at L'express because of some yelp reviews, but L'aromate was closer and recommended by our concierge.   It was awesome. We were starving, so the table side olives and bread were a good start. We had the herb crusted calamari for an appetizer after the waitress was a less than enthusiastic about our other choices. It was good. Not a bad start.  For our entrees, I had the steak frites. Steak was a little over cooked, I ordered it medium rare. The fries were ok, but the au jus that came with made the dish. Tasty.   Now, my wife's duck confit linguine was awesome. Best dish of our trip. Duck confit, mushroom fricasse and linguine..So good. We almost ordered two.   We finished it off with a sugar pie, which was a bit much. Should have probably gotten something else. We also had a few glasses of wine and had a great dinner. Everything was reasonably priced and we would definitely go back if we return."}
{"text":"We came in only for a drink well knowing that you can't really find a decent lounge or place to have a nice glass of wine downtown. Good wine selection. Excellent mousse de foie de volaille. But fix the door and remove the condoms from the liquor bottles. Overall, go there."}
{"text":"This year, we picked Montreal to have our family reunion and Thanksgiving celebration.  I flew  from Vancouver, my sister drove from Maryland, and my brother from Toronto. Our friends, celebrating their 30th wedding anniversary from Chicago also came.  On our first evening night (October 6), we booked Bistro L'Aromate for a party of 8 to have our dinner since it is closer from where we were staying at  Hotel Sofitel. The food was okay, though the presentations were quite impressive, but the waitress was very rude and rough. If ever you want to eat there, never pick that speckled girl with dark brunette hair to serve. She is horrible. I would never never go back to this restaurant because of her.  Cathy TL"}
{"text":"Had a very high-end meal at Bistro L'aromate in their new location on Maisonneuve Ouest.   The restaurant is beautifully designed, its new, cool, lots of young wealthy people hanging around, and a bunch of babes that work there.  Upstairs it's a little quieter and private- we were coming in with a group of 12 and placed upstairs by the bathrooms (not great) but were moved to another table over looking the downstairs of the restaurant.  For the most part people were ordering surf+turf which was presented as you'd expect (it had better be @ 80$ a plate) and came with a little bit of lobster, a filet with mashed potato, and some scallops.   I think our waiter had the feeling this was going to be one of those \"expense your business\" dinners and was a little pushy with the wine suggestions. One person wanted a glass of Port but instead he brought out a bottle of desert wine insisting we have that instead- of course the majority of the table jumped on that bandwagon  and he pops it quickly (oh look...it was 375$). The type of stuff that would really drive me nuts if I was paying with my own dough. That doesn't make it OK, though.  We had also called ahead and left a CC number for the meal to be charged to - but the restaurant didn't know how to place the charge without having the physical card there. They said they couldn't do it- but obviously they could....so it just took them apprx. 30 minutes to figure out how.  The meal itself was delicious in every regard - diners just need to be diligent and make sure things don't get too out of hand with those drinks!"}
{"text":"We decided to have dinner here one night, since it was convenient (we were staying at the Hotel Le St-Martin), and also because the menu LOOKED really good. I had my sights set on the risotto with shrimp.  I hate to say that we were both extremely disappointed in our dinners. My risotto was dry, the shrimp were a very nice size, but dry and overcooked. Overall, my entire plate was bland. The only saving grace were the bits of chorizo -- the only part with any real flavor. My husband ended up getting a shrimp dish as well, which was also overcooked and dry. I couldn't even tell you what we had for dessert -- it was that unmemorable and generic.  The only thing we really enjoyed was sitting outside on the patio and being able to people watch and enjoy a couple of drinks."}
{"text":"La première vu que j'ai du restaurant c'est des vitres très très sale, bizarre pour un restaurant de la sorte, finalement la cuisine était pas mieux, très cher pour la qualité des plates, de la poudre au yeux ce restaurant. Très déçu !!"}
{"text":"Superbe endroit, bien situé, petit bijou du chef Jean-François Plante. La déco est moderne, la salle a manger sur 2 étages, salle de bain aux 2e en passant par l'escalier en colimaçon. Vraiment joli.   Ce qui nous a déplu se situe plutôt au niveau du rapport qualité/prix. Et on parle d'un ' major désagrément '.  Lorsqu'on paie 35$ pour un steak d'entrecôte avec la mention AAA, on ne s'attend pas a un morceau plus ou moins bon, dur, et sans sauce. en effet, cette pièce est goûteuse, mais pas tout a fait assez pour se passer d'un petit plus. Les a cotés n'ont pas déplu par contre, le gratin de pommes de terres fumées et les croquettes a la crème étaient meilleures que la viande.  Nous avons aussi pris les fonds d'artichaud au canard. C'était joli, bien présenté et bon. Mais 3 boulettes un peu méconnaissables pour 17$ encore une fois, je m'attendais a vraiment plus.   Sans compter que nous nous sommes fait offrir du champagne en entrée, pourquoi pas...Sans nous mentionner le prix. Et nous avons vraiment fait le saut lorsque l'addition est arrivée.  Pour ce prix-la, on a mangé au meilleur restaurant de Montréal en matière de gastronomie, et nous sommes ressortis repus et satisfaits et ' flabbergastés'. Ici, Rien de Wow dans notre assiette, rien de magique dans l'ambiance. L'aromate ne fait tout simplement pas le poids pour le rapport qualité/prix, il y a trop de concurrence plus abordable."}
{"text":"They have an all you can eat tartar night which is great because it allows you to try on their tartars. I rwally liked the salmon and the tuna. The rest were lacking taste which was disappointing since they advertise so much their tartar and it is a really chic place to go."}
{"text":"Simply delicious! Came here at the recommendation of the concierge at our hotel.  Before you continue to read my review please be forewarned that I am an American city girl who knows nothing about French food.   The decor was modern, clean, upscale, and inviting.   We started off with a few cocktails. Not very strong and quite tasty.  The bread that was brought to us was pretty tasty, and the olive oil on the side (with olives in it) was a nice touch.   For appetizers I got the soup du juor, which was a delicious tomato basil. My friend got the special of the day, which was a tuna tartar. Hers was a little underwhelming.   For entrees I got the salmon tartar and she got the steak. Both entrees were absolutely DELICIOUS! And the French fries that come with were a perfect match. Our entrees were sooooooo good. We ate every last bite! We were nice and stuffed by the time we were done. Wish we would've left room for dessert!  Our server was very kind, but the service was a bit slow. Again I may be biases b/c I come from a land of people who rush.   All in all we had a great experience. I would definitely return."}
{"text":"I took a groupon coupon for their brunch for two on Sunday .   The service was very friendly but unprofessional ( piling up the plates in front of your face) . The food is ok : the uf bénédictine were very greasy / the porc belly was delicious but so salty !  They serve an \"entrée \" , or what they consider an entrée, composed of half an egg ...  For the price , I don't think the coupon was worth it . I payed 30$ ( on groupon)  for the brunch, not including the taxes and  not including the tips that you have to base on the real value of the brunch ( 67$) . Ended up paying 45$ total .... I wouldn't have payed the 67$  real value for the brunch .   Overall a good presentation with friendly service :)"}
{"text":"I find it very disrespectful to potential clients that this restaurant do not even bother to update their opening hours info. The information displayed on their own doors (not to mention the internet) is misleading and incorrect. They are never open when supposed to. Tried to go there twice already, won't try a third."}
{"text":"Came here for all you can eat tartare for 27$. You can choose between beef, smoked salmon, tuna and shrimp. It also comes with all you can eat fries. The tartare were ok, nothing special and not particularly delicious. The fries are burnt and dry.   We ordered desserts later and it's very expensive. 13$ for a brownie and ice cream. The brownie felt dry and wasn't chewy.   The service is good. The waitress was friendly and helpful. The place itself is clean and located in the center of downtown.   Overall, I was a bit disappointed by the food. Don't think I would come back."}
{"text":"This is an incredible bistro in Centre-ville in Montreal. It is located in a good location just off of Rue Sainte-Catherine. It was so good I went their twice during my recent visit.  The service was wonderful and the staff quite pleasant.  The food was delicious. The first night I had the lamb shank and the second night I had the beef tenderloin. Both had plenty of taste and melted in my mouth.    The house green salad had good taste with a variety of flavors that made for a sweet salad.  Now I don't usually like olives, but the olives that are brought out with the bread were just delicious. They were in some balsamic vinaigrette that was quite tasty and sweet also.  A great place to have a wonderful dinner with Montreal flavor."}
{"text":"I just ordered the. Assiette de Cochonielles and it's delicious, great quality of food with great presentation..,"}
{"text":"Do not take their tartares  left hungry  Everything is socked in marinade even the salad and vegetables  If you want to know how it tasted imaging taking a shot of vinegar"}
{"text":"We went on Friday night around 8:30 and the restaurant wasn't that crowded. After we were seated, it took about 15 minutes before someone came over to offer us water and then another 15 minutes to actually get the water we ordered.   Upon ordering, I requested that my burger come with onions on the side. When our food came our 40 minutes later the onions were on top of my burger, so I sent it back. My husband finished his entire meal and thought about ordering dessert before they brought out my recooked burger.   Service was absolutely terrible; food was OK."}
{"text":"Another one of those restaurants I always see on my way to the gym downtown. I've planned a sister date here for brunch (we were excited to try somewhere new!), and we got a spot on the terrace.   Good : Brunch had a limited selection, but it looked pretty. The decor is clean, the design is inviting and really gorgeous. I ordered the fish balls for an appetizer and it was really delicious. The grilled cheese (with duck confit) was amazing. That was probably my top 3 favorite grilled cheese.   Bad : I'll start off with the service. We've waited a really long time for our appetizers to arrive. My sister ordered a yogurt, which had the consistency of porridge, and we were weirded out by how watery it was. Then after our appetizers, we waited about 35 mins to get our main plate. Seriously...I've watched other patrons that were seated after us get their meals before us. We also had a side salad, to which I've notice the greens aren't even fresh...um this is a high end restaurant, I'd expect better. I had to flag our waitress to ask about our main plates because we've been waiting for awhile and she asked if we already finished our appetizers? Yeah lady, like half an hour ago, give me my food. After a bit of prompting, we got our food within 5 minutes. Was the grill cheese good? Yes. Was it worth waiting 35 minutes? No.   Bottom line : Not blown away by their cuisine, but if you want expensive (but delicious) grilled cheese with a nice terrace, then this is your spot. I'll keep biking pass this place next time."}
{"text":"We went with friends for the all you can eat tartar (beef, tuna, shrimp and seviche). The tartars were decent but not incredible. Service was friendly but nothing spectacular. Nice decor  - we sat inside but there is an outside patio on de Maisonneuve."}
{"text":"Un bel endroit, l'effort a été mis sur Le design, qui reste confortable. On gagnerait à baisser le niveau sonore de la musique, qui finit par géner les conversations.  Le service doit être amélioré, il n'est pas à la hauteur des prétentions du lieu. Le personnel est gentil, mais la formation semble inégale. Deux convives à notre table n'ont pas eu leurs couverts changés entre deux plats, on ne vous ressert pas l'eau si facilement, et pour le vin, débrouillez vous. Les assiettes sont lourdes, difficiles à déposer, le personnel de salle a du mal à faire évoluer les plats naturellement.  Une très belle carte, mais qui ne tient pas toutes ses promesses.  Les réussis testés ce soir: la figure fraîche  et son chèvre, une mousse de volaille délicieuse, des desserts au rendez-vous en particulier la poutine. Là je n'en dis pas plus, il faut goûter. Des plats à améliorer: un risotto trop salé, le tartare aux trois saumons trop épicé, le ris de veau trop confit. La cuisine doit regoûter ses plats, avec humilité, et donner plus de place aux ingrédients et à leurs saveurs. C'est tout à fait possible car on voit bien qu'il y a du travail réalisé et un désir d'offrir une belle expérience au client.  Au total, un trois étoiles car le lieu ambitionne une exigence supérieure, en accord avec ses prix et sa carte. L'équipe en est capable."}
{"text":"I was pretty disappointed with this restaurant. My group decided to meet there for a nice dinner after a long day of work. It was Formula 1 weekend so we reserved a table ahead of time. The restaurant was busy and loud (dance/club music was playing which I found strange), it didn't seem to fit with the atmosphere of the restaurant.   I found service to be very poor. The server was slow in greeting our table, taking our drink order and drinks took around 15 minutes to come to or table. We would have ordered more drinks during our visit if the service wasn't so slow. We finally had to get up and ask for service after waiting a very long time to place our order. The server came over and stated she didn't realize we were ready to order, despite our menus being closed and our body language indicating we were ready. Food was delicious though (we ordered the linguine, beef tartar, and salmon), however my drink sat empty for a while, and another person in our party never received the wine she had ordered for her meal. The server blamed another server for not bringing the drink but did nothing else to satisfy us. For a restaurant with meals listed around $35 a plate, and drinks at $12 per cocktail, I expected a much higher level of service."}
{"text":"I visited a handful of times during my short business trip to Montreal -- twice for drinks and once for breakfast.  The bar was pretty comfortable, and the bartender was happy to show off her mixing skills by coming up with something unique whenever I asked her to \"surprise me\".   The drinks are pretty expensive though, which is unfortunate.  For breakfast on my way back home, I stopped in for the eggs benedict.  It was beautiful. The eggs were PERFECTLY poached, the herb potatoes were delicious, and the meal was rounded out with amazing baguette toast. The entire meal was masterfully executed.  The wait staff was attentive, polite, and friendly.  Honestly, nothing but good things to say about my last visit here."}
{"text":"Oh gods where do I start!!  Service: The lady who was our server had no smile or even courtesy to explain the dishes. Especially when you have a customer who is ready to spend 400$ to 500$.  Food:  Appetizer: Mediocre, nothing says WOW.  Entree: Coworker and I ordered sole fillet, just a heads up don't order it. I took one bite it gave me gag reflex, fish was smelling bad. We both had to return it back and the hostess responded that the chef is going to taste it and let us know.   Just heads up there are other places around which are a lot better!!!"}
{"text":"We went there during our stay at the hotel that is attached. The place was very quiet & not busy and it was a Saturday evening. We ordered drinks, they came out on time. We ordered apps and they came out on time as well. The waitress was very kind and was very knowledgeable about the menu. The service during my visit was great. The food wasn't mind blowing, didn't truly match the price of the food. I am never one to complain and always tip in excess of 20 percent as a former service industry employee myself, although i didn't feel as if the quality of the food was reflected in the pricing for the food. I had left my jacket on one of the hooks, and when i returned there was a guest sitting at the table where my jacket was located. So rather then going over to them and reaching over there shoulder i asked another person who was not my waitress if she would ask if its okay to grab it. Rather then just doing it, she told me to wait and brought me my waitress. To do something she could've done, with a little bit of snark. Otherwise the experience overall was good. Just higher quality food or lower prices and a full staff mentality of customer service."}
{"text":"So we are visiting from NYC and staying in the beautiful establishment connected to the restaurant. We decided to sleep in and try the brunch offered down below in the Bistro L'Aromate.  After viewing the menu which displays exorbitant prices for EGGS....etc..we decide to just spend the money because, after all, if they are charging prices like this then it must be at least pretty good. Sadly, NO. I don't even know how one messes up eggs. EGGS. Scrambled no less. But this restaurant did twice. I received the Mishmash...which is scrambled eggs accompanied with sausage and peppers. They arrived and had so much oil that they were inedible. Then I kindly ask if they wouldn't mind just giving me plain scrambled eggs. I didn't want to complicate things. They are then returned again to me completely runny and just mushy and gross. Potatoes on my fiances plate were undercooked. This is basic cooking mistakes. We are not discussing flavor profiles here. Just make a decent egg. Check is then received and for a couple eggs scrambled and a petite and I mean PETITE salad, I was charged for the dish alone 17 dollars. Are you kidding me????? Please, I am telling you....go anywhere else for at least breakfast. Do not spend this kind of money. I am upset and disappointed that we did. But lesson learned. I hope I can help you BEFORE making the mistake we did. Overpriced and not good. Go somewhere else."}
{"text":"Excellent service, delicious food and great wine.  We had a large group on a Wednesday night. They were very attentive and took excellent care of us.  I enjoyed the vichyssoise and a beef with squash dish. I would like to eat that soup again and again. The vegetables on the beef dish were a bit sweeter than I would have liked, but I still enjoyed them."}
{"text":"I can't comment on the food and only on the service and drinks. We stopped by here late for dessert and cocktail since we had already ate dinner somewhere else. The restaurant is attached to Le St-Martin Hotel Particulier. They weren't busy and we were seated right away outside. We ordered Pink Sangria and some sort of dessert. The sangria was super sweet and tasted more like pink lemonade with not much alcohol, should have returned it for a glass of wine instead since it wasn't a cheap cocktail. The dessert was very good though and our server was very nice. The saying stands true, if a place with indoor/outdoor seating isn't busy on a Friday night well it must not be very good."}
{"text":"worst meal ever. burger small and well done.waitress says oh i told them rare. that's all she said. over $150 us. small salad as,an app is all they had tough duck ,tasted like overcooked turkey. dessert tasted like nothing of the descriptions amaretto cake? not really tiramitso maybe. sugar pie? no little tiny fried balls. it's in a hotel. should have known but the concierge recommended it from another hotel.save your money!  no reservation required, it had lots of empty tables and an annoying disco beat."}
{"text":"Was staying at the adjoining hotel and had a drink here on two separate occasions, so this review only addresses drinks & service.  I'd highly recommend staying away from this place.  The first time we went, service was cold, but not terribly slow.  The second time, service was downright rude.  We sat at a high top in the bar (confirmed with the hostess this was OK) and sat for 20 minutes while servers continually passed us by (after making eye contact) without checking to see if we'd like anything.  We decided to move to the bar as we had a dinner reservation to get to, and waited roughly 10 minutes there while the bartender flirted with two bar patrons and completely ignored us.  When I flagged down a server and asked if we could order a drink he told us he couldn't help us.  All told it took us about 30 minutes to place an order for an overpriced glass of wine and a beer.    Needless to say, not a place I'd return to!"}
{"text":"Went there for lunch on a week day.  It cost 65$ for two, no drinks.  The salad was good, I have to admit, but there were like 5 tiny slices of beet ... :) The salmon tartar was very ordinary. My roommate made one better than that, and I was very disappointed.  The beed was good, but too salty.  Overpriced. Though i enjoyed seating outside. Service was so so... it took them 15 minutes to bring the bill (on lunch time.. !)"}
{"text":"This is a very fancy restaurant located in a downtown hotel. The decor is modern and romantic. The menu is very pricey with a good selection of items. We went as a group in town for business. We were seated promptly, and that was about as good as the service got. The waitress was so well-meaning, but just so terrible at her job. She told us several times how it was her first day and apologized multiple times, but it was just so terrible for a restaurant this expensive. It took over 30 minutes to get our first cocktails to the table. I had to ask repeatedly for water refills. The food itself was excellent, once it finally got to the table. I had the salmon, which was outstanding in flavor and presentation. My husband had the beef tartare which was also very good. It seems the restaurant is known for the tartare. My friend had the salmon tartare and also thought it was good. For dessert we had the \"opera cake\" which was good but nothing outstanding. I'm torn between if I would return to this restaurant or not. On one hand, the food is great and the ambiance is nice. On the other hand the service was really subpar. I think if I was staying at the hotel I would return and maybe just sit at the bar. Otherwise I wouldn't go out of my way to return here."}
{"text":"Just pass on this one.   There are bunch of other great restaurant around.   Service:  BAD Food:  Nothing extraordinary Price:  High for the food and service quality  We had great experience in Montreal except this one for dinner."}
{"text":"Stayed at the hotel in this building. My filet mignon was cooked perfectly and the salmon tartar was also amazing!   Recommended and the wait staff was also friendly and courteous."}
{"text":"The reviews on here for this bistro are pretty bad. I went with low expectations on a Tuesday night and left pleasantly surprised.  I went for their all-you-can eat tartare special for $27. They give you little portions of four different kinds of tartare and you can keep reordering any tartare you like. The plate also comes with bread, fries and a tiny bit of salad. So we started off with four kinds of tartare and then ordered three of the four tartares twice. My favorites were the beef, tuna and shrimp.   The beef tartare had goat cheese, sundried tomatoes and smoked mustard. The goat cheese was very overpowering. My friend removed the cheese and preferred it that way but I like goat cheese so it didn't bother me. It tasted almost like a burger to me. Like a Big Mac with goat cheese inside. Also I don't usually like mustard but this smoked mustard made this tartare taste like a burger .   The tuna was very good. It had an Asian flavour to it. It tasted of sesame and had seaweed salad on top. Wasn't fishy at all.   The third kind was a cooked shrimp tartare with mango, papaya salad and coriander and mayo. It was refreshing.   The fourth tartare was a smoked salmon tartare. It was good but after awhile I got sick of it. I would have preferred if it was just regular salmon and not smoked salmon. This one was very mayo based. It had dill in it which I love and diced cucumber and Asian pear. If I hadn't looked at the menu I would not have known that their was pear in it.   We also got the drink special which was two glasses of vin mousseux, red or white wine for $15. We started with the bubbly which was fruity and they really filled the glass which we appreciated. Then we got a glass of Sauvignon blanc which was also nice and fruity.  My friend and I were so stuffed! We really got our money's worth! Also the service was good! Our tartares came so fast! I would come back again. They seem to change the tartares that they serve on a regular basis."}
{"text":"This is easily one of the best restaurants we visited in Montreal.  The interior design is very artsy and warm.  The Lobster Salad is an excellent choice and highly recommended.  It comes with a whole lobster tail on the side, with the salad and generous helpings of lobster on the top.  The lobster sauce, which resembled a creamy mayo/hollandaise, was just the right finishing touch.  The salmon salad is also very good.  Try a duck entrée, you'll see that the duck is prepared very moist and succulent.  Best of all, no fat like Chinese restaurants!  This restaurant is a must-visit!"}
{"text":"Bel endroit tendance, belle carte, terrasse urbaine en plein sur le trottoir. Portions généreuses mais mon linguini au canard était somme toute ordinaire, le canard un peu trop sec. Les prix sont correct pour la qualité. Hélàs, j'ai trouvé le service putôt lent, ce qui est est ennuyeux pour le midi, mais attentionné."}
{"text":"Bon dejeuner oeuf benedictin... le prix un peu élevé , le service ok mais on sent qu'ils sont inquiets quand on arrive avec le coupon groupon, j'ai trouvé les chaises pas confo.. pas si beau que ca le decor à mon gout.. mais juste l'oeuf benedictin était vraiment proche de la perfection, bravo."}
{"text":"It's a decent place for business lunch as it's in the middle of downtown and close to offices. The food is pretty good, but not amazing. Service is good. The beef tartare is one of the better ones for downtown Mtl."}
