{"text":"So far my favorite AYCE sushi reastaurant in downtown montreal. Love the environment, very enjoyable for dinning. Ingredients are fresh and tasty. The price is not \"cheap\", but it is not higher than other AYCE sushi, especially considering the quality of the food."}
{"text":"J'aime bien, pour 30$ vous en avez pour votre argent, il y a beaucoup de choix. J'y suis aller 2 fois. Le service est quand même bon."}
{"text":"The idea is brilliant yet the food is outrageously pricy compared to its taste...even their special dish is horrible...absolutely not recommended!"}
{"text":"This place is over priced.  I ordered a $12 salad.  When it arrived, I surprised that it came in a martini glass.  I thought that it was a mistake.  Nope :("}
{"text":"- Decor/ambiance: ground floor looks modern and chic, similar to Brasserie T, but downstairs is downscale of that. It may have sth to do with the lighting being too bright.

- Food: seafood boil is their specialty and tastes really good. You can select from a few sauce options and the spicy level. We chose L'asie flavor with spicy as recommended by the waitress. 
(However, it's such a surprise when it came in plastic bags and we just need to grab from it. Totally conflicting with the ambiance they try to create through the decor..)

Their fried chicken popcorn is also very very good.

We didn't order from their sushi menu but the options are all similar to other all-you-can-eat places.

- Drinks: soho sangria is nice, light though. There are also four other flavors. Other than that, didn't see too many cocktail options but there are beer, wine, sake options too. A bit of everything without any particular focus/specialty.

- Service: waitress is nice but food came in so slow. We were a group of 14 and it took over an hour before our food was served.

- Price: menu price seems high. We finished for about $40 each with their promotions (15%off seafood boil+$1 oyster) so regular price will be probably another $10-20. 

From the decor and price it seems that they try to position themselves among other 'new canadian' places that have been extremely popular these days. Unfortunately it lacks the crowd and misses on a few details (e.g. signature cocktails). I'm giving 3 stars but do see potential and hope they improve as the food tastes great!"}
{"text":"After reviewing local comments my girlfriend and I decided to eat at this establishment and we were NOT disappointed. The server was new, but extremely nice as he took our order and explained that there was an all you can eat option where the bring the food directly to you. We decided to start off with edamame, garlic shrimp (which came on a skewer), scallops, and Cajun Rice. All of these items came in small portions, but were packed with flavor! 
We the. Order the seafood boil each which included corn, potatoes, and shrimp. Again, if you're from the US. The boil portion was a bit small, but also package with tons of flavor and great taste! 
If you're in the downtown Montreal area I'd highly suggest eating here! You won't regret it!"}
{"text":"This has become my regular AYCE sushi restaurant in Montreal: service is swift and courteous, and food is reasonably fresh given the price. Lunch offers the most value: at 17$, you can order unlimited sushi (such as salmon sashimi and tuna nigiri) and enjoy the nice summer breeze on their terrace. 

Every time I've frequented this establishment, the staff has been gracious and attentive. You can choose to be seated either indoors (which is minimalist and modern) or outdoors on their terrace. There is also a lower lever with more tables where you can actually see the sushi chefs at work. 

During my last visit, the appetizers that I ordered (miso soup and seaweed salad) came within minutes. The rest of my meal also came at an astronomical speed. I was definitely impressed. The sashimi portions were generous, not just paper thin like other AYCE places. The nigiri and hosomaki were not stuffed with rice. 

They also serve some hot items such has tempura. At the end of the meal, they also offer you a choice of ice cream, but I usually eschew sweets so I can't comment on that. 

Overall, great value and great food. I would definitely come again and I recommend others to try at least once."}
{"text":"Not great; surely there is something better nearby for a sushi dinner. Had the upper level with view of the street, which was interesting. Thankfully the heat was on, or I would have frozen next to the big glass window. Service was extraordinarily slow, from start to finish. The sashimi was beautiful, and tasted just okay considering the cost. I would have loved to see tuna belly, yellowtail and unagi on the menu (no such luck), but did find a beautiful boeuf tartar rosette and \"sushi pizza\", which was memorable. Would not go back or recommend."}
{"text":"1. The decor didn't really match the rough, eat from a bag concept. 
2. Seafood wasn't so fresh nor high in quality. E.g. The oysters. 
3. We ordered a bunch of different flavours, but all tasted the same. And they were not well seasoned and under salted. 
4. The portion size was small, the salmon tartar was 12$ but with only a layer of salmon. 
5. Shrimps and crab were good, but not good enough for me to return. 
6. The corn served was sour, and cold. Be careful"}
{"text":"Went there for all you can eat lunch sushi buffet! There are some good surprise elements.  Decent sushi and sashimi, the breakout stars in my opinion were actually the meal dishes such as sesame beef or general Tao chicken...perfect sampling portion for buffet style food.  Food presentation was nice. Overall a good experience.  I would suggest to avoid won ton soup (big won ton but barely any meat, just the paste). Shrimp tempura was too simple and basic. The portion of edamame was very generous, but lacks flavour, it's too basic and simple too.  Those are areas need improving.  One odd note, the men's bathroom seem totally out of place compare with the rest of the restaurant decor."}
{"text":"We were  group of 10 people,  5 people wanted all you can eat sushi but
We were informed that all 10 of us would have to have it.
 There was a long argument and we 
Finally persuaded the manager to agree to the all you can eat if the 
Other five sat at another table (close by). The food was good but wasn't
Worth the aggravation. One of us left. I quess make sure all your friends
Want what the restaurant tells you to want.  Sorry wouldn't go back. It was a real disappointment especially after losing one of our diners."}
{"text":"A very nice experience. 
Love the food and the service. The specialty is seafood boil. They also have sushi and other Asian dishes. We had two seafood boils, which sold by pound. Both are crawfish with their special sauce l'asie, one mild and one spicy. I also added lotus root in the spicy one, and corn and potato in mild one. It was a smart choice because the spicy one was so hot and the carbohydrates in the mild may help to ease the hot.  If you don't like spicy there are other five sauces to choose from the O'bay is also recommended by the staff. To my understanding, they serve the dish in a plastic bag is a genuine way that how this dish served in the states and China. It's not cheap but traditional. Grabbing the food from bag is fun when you are provided with rubber gloves. 
We also had a dozen oysters. It was heaven and I ordered another half dozen. 
The staff was very attentive. She explained the menu and the promotion. The promotion we had is disconnected crawfish 10$ per pound and oyster for one dollar if you order a drink. 
Can't wait to go back. Just be warned the spicy one is really spicy. You will enjoy the pain when (and after) you eat them. I sure did."}
{"text":"Great food specially the seafood boil. Perfect services , waiter always come and ask us if everything's ok. Definitely go back!!"}
{"text":"Their spicy garlic sauce is the best company for the sea food. It's even better when u add vegetables like potatoes and lotus roots! And u can use the most original way to eat your food----by hands! It's really fun and actually better than using utensils, it makes your meal more enjoyable ! They have great cocktails too. The ambiance is a typical bar style, lighted with blue lights, and very loud. The waitress was so nice that explained to us how this works, and gave us a lot of recommendations.
All in all, it was a great experience.
But because we're having the seafood, the restaurant is kinda on the pricy side"}
