{"text":"There are 3 types of tacos that I have had here in Toronto: Taco Bell, Mexican tacos and fusion tacos. This is a Mexican taco place. 

They have a variety items on their menu but we only tried the tacos - beef tongue, fish and carne asada. All were excellent, full of flavor, and spicy. I like my tacos very spicy, and often times, its not quite spicy enough, but here, the hot sauce really packed some punch. 

The beef tongue was tender and flavorful. The fish taco was fried, the batter was good, not falling off of the fish like many places. The carne asada taco was not as good as the first two, but still enjoyable. All 3 tacos had pico de gallo , carne asada had pickled cabbage. 

My favorite was the beef tongue. I was very apprehensive about it at first, because I've seen raw beef tongue before... its not pretty, but now, I look for restaurants that serve it. I have yet to find one as good. 

Unfortunately, I drove by a few times and the windows are blacked out, so I assume that they have since closed."}
{"text":"I really want to give this place a four stars because they are trying really hard to do a good job and do something different in the area, so I say 3.5 stars!

First off, everyone is saying that this Mexican is not as good as Tacos El Asador, but Tacos El Asador is El Salvador cooking, not Mexican and the food here definitely is different.  

The guacamole and chips are amazing and everything is pretty authentic.  You can always get a seat and I am happy this place is here."}
{"text":"Really amazing tacos and really sweet people.

We had:
Mexican hot chocolate - really comforting and $1
Carne asada tacos - Delicious! Moist, well seasoned beef.
Shrimp tacos - With battered shrimp, pico de gallo and avocado. Amazing.
Tinga (pulled pork and chipotle) - flavorful and spicy!

So excited to have this in the neighborhood."}
{"text":"Soggy take out tacos.. Fell apart a few minutes after picking them up. They should use double tortillas. Also the cashier was inexperienced. 

Nothing amazing about the tacos.. Pretty boring."}
{"text":"Great flavor and very well good size servings. I am mexican and its been a disappointment altogether to live here in Toronto without enough good places to eat real mexican favors and not to be confused with TeXmex which is what you would eat in the US. Try it with a beer and enjoy it for a low cost. I recommend this place folks!"}
{"text":"Revolting!"}
{"text":"As other reviewers have mentioned, El Asador up the street is epically tasty and had it been open late tonight I would never have gone in. But, it was, so we did and I'm glad!

All tacos are 2.99, and I had the fish, shrimp, and two types of pulled pork. That's right, four tacos, you heard me. All were totally delicious and came out hyper fast. The staff are really sweet and there was more than enough tables (which is always nice.)

Can't really comment on anything else, but for the price, the pace - totally a good option for a late night snack while in the Christie Pitts area!"}
{"text":"Very friendly staff but I found the food incredibly salty. To the point where I couldn't finish my meal.

If salt doesn't bother you then this is a 3-star joint."}
{"text":"Definitely not the best mexican place in the neighbourhood, but relatively fast (unless there's a long line) and definitely convenient. 

Usually I go to taco el esadar just down the block when I'm having a mexican craving, but my partner and I decided to test this place out shortly after they moved into our 'hood. 

The food is okay, and really, just okay. I always get the same thing (everywhere) a vegetarian burrito. (Okay, Burrita). The \"burritas\" at this place are okay, and DEFINITELY a big portion (you will NOT be hungry afterward). However, they are not the most.. authentic... or delicious you will taste. Something about the rice makes me think it's Uncle Bens, or if not, something from a box/bag combo. However, the portions are huge, and they'll \"customize\" your burrita if you're willing to stand there and direct. 

My partner gets the chicken quessidilla and he definitely approves. We can both agree that, overall, taco el asador is better and more authentic, but the chicken quesadilla at La Burrita is MASSIVE and (according to my dining companion) really delicious. 

9.99 for a burrita and 7.99 for a quesadilla makes a 20 dollar dinner. Cheap, cheerful and close to Christie Pits for your mexican picnic needs."}
{"text":"Burrito in my mouth!!

That is what I was saying to myself as I chomped down. But I'm getting ahead of myself.

These guys just opened on Wednesday and are doing a soft opening. There is a lit open sign in the window, but the banner on the outside says opening soon. When I walked in I wasn't sure that they were actually open. They were still working on things, but I was invited in warmly. They don't have a menu yet and I was told they were working on it. I went with a burrito and the owner showed me the different types of meat they had to offer. I went with carne asada and the owner said to take a seat while he made my burrito.

Now I was a little worried at this point. First, I wasn't sure what I was going to get in my burrito. I'm not allergic to anything but I REALLY don't like cilantro, this would have been a deal breaker. The second is that I had no clue what it was going to cost. 

All worries washed away when I bit in. There was no cilantro. The meat was delicious, perfectly well done. I normally go with a pork option when trying a burrito place for the first time, but there aren't many places that put carne asada on the menu. The burrito was a good size and the portions of ingredients were well balanced. I really enjoyed the fresh chunks of avocado planted inside. My only complaint was that there was maybe a little too much onion.

The burrito came to $8.99. This is a good value as its about the same price that you'll pay at other hum drum burrito places but the ingredients here are much better.

While I'm sad that these guys replaced a good Ethiopian place, I am glad that I can grab a great burrito within walking distance of my house."}
{"text":"Very tasty pork-based taco (carnitas and chilorio), pretty good fish taco, decent prices, nice (albeit disorganized) service. But, as other reviewers have mentioned, everything here is wet, wet, wet. We ate in, and the beef cheek taco fell apart by the time we got to the table. They need to either double up on the tortillas (like at most Mexican-aimed places I've been to), or drain the meat better. Orange-tinted lard was literally dripping off my girlfriend's elbow. 
If they fixed that, I would happily order those tacos again. Or maybe the platter, where you get your choice of meat over beans and rice."}
{"text":"I am a HUGE Tacos El Asador fan... and really wanted to try this new nearby spot. 

I went for the breakfast burrita with egg and ground churizo.... it was SO delicious. Served with guac, sour cream, beans, salsa verde, a little cheese... it totally hit the spot. 

I took it to go back home (about 10 mins away) it was not soggy at all... really excited that this place is in the hood. 

New regular breakfast spot.... going back forsure."}
