{"text":"Out on a cold winter's week night, some friends and I thought we'd head to Terroni on Adelaide for a casual bite. Not having a reservation, on what appeared to be a very busy night, the hostess recommended that we try their new venture, La Bettola di Terroni, which was close by.

Once we arrived, we were all immediately impressed by the glass-walled pantry in the entranceway. It is always comforting to find a restaurant that flaunts its freshness. To me, it screams, 'Come in! We know what we are doing!'

We took the advice, and waited for a table in a very cramped entrance way. With three other patrons in front of us, the hostess desk seemed very busy, but soon we were greeted and seated having had a table reserved at the suggestion of the hostess at Terroni.

The first thing we noticed, sitting at the end of a very long shared table, was how loud the music was. A mixture of 60s R&B and 70s Disco; it was far too loud. We actually couldn't even hear each other. Being a trio, I had to use my friend to the left to convey what I was saying to the friend sitting opposite me. At one point, while trying to explain my thoughts on my salad to the person across from me, they smiled, nodded, and asked 'so what salad are you having'? I'll admit the restaurant was packed, bustling, and full of all the noises that come with that, but despite that, the music was the biggest contributor to the noise.

Our server soon appeared and did a great job answering all the questions we threw at him about red and white wines. He spoke well and seemed to truly care about recommending something we'd enjoy. Unfortunately, upon his return he gave the white to the red drinker and vice versa. To his credit, he noticed his own mistake and did not make it again with any of the refills.

Looking at the menu, anyone familiar with Terroni will find a lot to like here. It is, as their website describes, a sort 'best of' all the food at Terroni, with something for everyone.

Bread arrived with olive oil to dip. The oil had a nice earthy bitterness and was quite enjoyable. Our salads arrived soon after: a Giuggiolosa with mixed greens with Cambozola cheese, grilled peppers, pine nuts, black olives, honey and a Barbabietole e Caprino with roasted beets, goat's cheese, lamb's lettuce, pistachios, candied lemon zest, and anchovy balsamic dressing. The Giuggiolosa was slightly too sweet and could have used a few more of Bettola's exceptional olives to add some more saltiness, but the Barbabietole e Caprino was near flawless. The beets were well roasted, and the flavours all stood out, as they should have. 

Looking at the menu, one of my guests fondly remembered having eaten Arancini di Modica on a ferry ride once from Italy to Sicily, so out of nostalgia, we ordered them. Arancini are breaded and deep-fried balls of rice, cheese and other fillings. At La Bettola di Terroni, they're filled with mozzarella and a pork ragout. They were a step above their peasant food origins, but all of us agreed that they weren't spectacular, didn't live up to the nostalgia, and we wouldn't be compelled to order them again.

Our pizzas arrived soon after. Having been to other Terronis before, I knew what to expect, and so we decided to split two pizzas between the three of us. Although thin crusted, they're not small.

We ordered a Smendozzata, with sausage, red onion and gorgonzola on a tomato base, and a C't Mang with prosciutto, pear, walnuts and honey with gorgonzola and mozzarella on an olive oil base. The Smendozzata was classic Terroni style, and just as expected. The Gorgonzola was sharp and salty, and the sausage had a hint of fennel. Tasty. The C't Mang was also excellent, with the perfect combination of salty and sweet, and a nice sharpness from the Gorgonzola.

Overall, it was a good meal. With La Bettola di Terroni, the Terroni family has added another feather in its cap. La Bettola di Terroni serves classic, Italian comfort food and serves it well. Besides the noise level, it's be a great place to take a date, bring the family, or bring friends."}
{"text":"Best authentic pasta since Italy!  If you're ever in Toronto and looking for Italian, look no further."}
{"text":"My husband and I had dinner here last night and left very pleased with the food and service.  We started with a fresh and delicious arugula salad with smoked salmon. My husband had pasta with bolognese sauce and I ordered a 4 ounce fillet mignon with mushrooms and asparagus.   The pasta dish was great and so was my steak - medium rare to perfection.  (I wouldn't recommend the steak for a big eater as it was small, as expected it being only 4 ounces , but the portion was perfect for me).   Overall the food quality did not disappoint which is most important to me.   Our server was very attentive, timely and friendly.  We could not have asked for more.  We noticed that the menu had changed since we last visited, they used to have a delicious gnocchi dish in a tomato sauce that I hope they reintroduce one day."}
{"text":"Their customer service is the worst I have ever experienced in my life. The waitress gave us attitude and refused to accommodate to our dietary needs. Never in my life has a waitress refused a request in such an arrogant way. She could have at least have been kind about it. I will never come back to this restaurant again."}
{"text":"If a restaurant is going to act like it's doing its customers a favour by bothering to serve them, then the food had better be out of this world. Sorry, La Bettola, your food isn't anything special. Here's the rundown of our unpleasant Friday lunch experience:

1. Our server was impatient and unfriendly. She took my food order and then half-turned away to leave and I had to catch her attention again to tell her what I wanted to drink.

2. They serve pizzas whole. You'd think they could do customers the courtesy of cutting the pizza into manageable portions, or even offering to do so after it's been brought out, but no. When my colleague asked if she could have her pizza cut, the server responded \"you can do it yourself; that's why we provide steak knives.\" Steak knives. Would it kill them to have a pizza cutter on hand? Apparently so.

3. They don't split bills. The best they'll do is let everyone at the table pay their portion separately after we've done our own calculations.

We were getting ready to leave the infamous 1-cent tip in protest of exceptionally poor customer service (well, 5-cent tip now that pennies are obselete), but...

4. Gratuities are included on the bill! Which explains the rudeness I suppose. Why try when you're automatically guaranteed a tip just for showing up.

Inexplicably, the place was packed. I guess there are a lot of clueless yuppies out there who think poor customer service and inflated prices are a sign of culinary genius. I won't be going back - there are plenty of other places to eat downtown."}
{"text":"Very good Italian food - makes my mouth water thinking about it right now as I write this review.  - Richard Trus review"}
{"text":"TERRIBLE customer service! We were placing a large take out order and tried to request some changes due to a food allergy. The manager was completely unwilling to accommodate any of our requests, and said that they don't need our business because they are always busy. They won't be busy for long if they continue to treat customers this way. Don't go here if you want to be respected!"}
{"text":"Thoroughly enjoyed my dinner. 

I really like Terroni's on Adelaide so I finally made it to La Bettola with a friend. 
The restaurant space is intimate with its dim lighting, small-ish tables.  
I had their Antipasto della Casa which came with a variety of cured meats, a small amount of grilled vegetables (like zucchini), foccaccina bread and herbed ricotta.  I loved cured meats so I enjoyed it.  I also had their roasted duck with mushrooms which was one of their daily specials.  It was delicious.  The duck was juicy, skin was crispy as was the mushrooms.  

Portions are a bit small as it is meant to be shared."}
{"text":"Went there with some friends and we had their amazing pizza (buffalo mozzarella - YUM!) The price was ok, 18 dollars per pizza, and another 33 dollars for a jug of red wine. We didn't specify which kind of wine we wanted I got the feeling we were served the cheapest stuff in the house, so not so great, but enjoyable none the less.

The ambiance was nice, a little loud though!! Cred to them for give us a table at 9 pm on a friday night, even though we didn't have a reservation, and we didn't have to even wait for a table to be ready for us. Good service even considering the place was packed with people."}
{"text":"This place needs to be shut down. Service is barely medicore with the wait and management staff ignoring you.

The prices are very high while the food is better from frozen, I've literally had better food from a microwave dinner. They're using location and budget baller diners who think the food is good because the price is high.

1. Mandatory tips
2. Barely any service
3. Will not split bill
4. Extremely poor quality service and food
5. Will not make substitutes for allergies
6. Entire establishment is a failure

Just don't come here."}
{"text":"We went on a Saturday night and the place was full.  We actually intended to go to Osteria next door, but went here as we had not tried it since it opened.

There was nothing wrong with the dishes, but they didn't stand out.  The Antipasto was quite good.  The deep fried Parmesan was bland, what a waste of good cheese.  Duck ragu tagliatelle special was okay, but I wouldn't know it was duck unless I read the menu.  Agnolotti with braised meat inside was tasty, but the butter sauce was overpowering and already starting to congeal by the time the dish got to our table.

We might excuse the food as a being bad night, but the service from our waitress was just so poor.  It really ruined the whole meal experience.  We waited for 15-20 minutes with our menus closed and ready to order, no bread.  Trying to get her attention or make eye contact was near impossible.  It's like she would look down just to avoid having to service you until she was ready.  It did feel like she was working too many tables to be able to provide good service.

Didn't stay for dessert or cheese as we weren't sure it would be good and we were worried that it would take too long.

Probably won't be going back until things change.  Highly suggest going next door to Osteria instead."}
{"text":"I love this restaurant.
I had Polpo alla Griglia was very good.
Funghi mushroom was also good.
Today special's Ragu was excellent."}
{"text":"We walked by and it smelled delicious out of the open windows so we decided to give it a try. 
We had an insalata caprese and pastas. The children went for pizzas. We all agree the food and drinks were delicious and very much the italian style. 
The ambiente was warm and mediteranian and it was nice to watch the cook make fresh pasta. The waitress was very helpful and friendly.
The reason for not giving 5 stars are: we would have appreciated some more dishes on the menu and the insalata caprese was quite small for the price."}
{"text":"While the clouds poured buckets of rain outside, La Bettola di Terroni's rustic-yet-modern interior made me feel warm and cozy inside. Trendy yet unpretentious, La Bettola's menu offers  a unique selection of wines and Italian comfort food at its best.  Service was very attentive and informative, as our waiter offered great advice when asked about the various dishes. My friend and I shared the following plates:

*Grilled octopus: tender and grilled to perfection, well complemented by the roasted eggplant, olives, peppers and celery.

*Involtini di Melanzane (Slices of eggplant stuffed with buffalo mozzarella): flavourful, but could have been served warmer; the cheese should have been a little softer and melted.

*Parmigiano in Crosta con Salvia Fritta (fried parmesan cheese): absolutely delicious, served with a sweet balsamic reduction. Reminded me of my childhood when my sister and I would roast hard cheese over the fire (it's a Greek thing I guess - and way better than marshmallows).

*Gnocchetti alla Norma (potato gnocchi with eggplant and ricotta in tomato sauce): melt-in-your-mouth bundles of joy! Very filling, so definitely share if you plan on sampling a lot from the menu.

*Frittelle di Nutella con Gelato (Nutella-filled fritters:) I had read an article in the Toronto Star devoted to these, and they did not disappoint. Move over Cafe Crepe, because together with the homemade hazelnut gelato, these fritters are easily the best nutella-based desserts in the city."}
{"text":"Tables are crammed in to maximize their customers, and extremely loud and Un-enjoyable.  I don't expect to have to almost shout to have a conversation at dinner.  

Service mediocre, food mediocre.  

Wouldn't recommend, have been at better places in same area, so keep looking."}
{"text":"I really want to love La Bettola. It has great ambience, great staff and great pedigree. Unfortunately the food doesn't share the same calibre of greatness. It's good, the pasta especially. But honestly, not spectacular. On my last visit, I had the whole sea bass, which was one of the daily specials. I'm not sure if it was the quality of the fish or that it was slightly overcooked, either way it wasn't the best that I've had. It's unfortunate because everything else there is great.. So much so that I'm determined to keep going back until I've gone through the entire menu. Everyone deserves a second chance, right? ;)"}
{"text":"We made reservations for lunchtime, I'm happy we did, the place was packed. I had the Chitarra Norcina (black truffle and sausage pasta), based on others' recommendations, and it was absolutely delicious. Unfortunately I left the restaurant still hungry as the portion was small, but I couldn't justify ordering more after spending $30 on a few mouthfuls of pasta."}
{"text":"I ordered the gnocchi and found it to be average at best. Did not taste homemade, at least not like my grandma made (texture tasted store bought) and not sure what was going on with the cheese in the middle of it. As well, no one came and offered me any Parmesan Romano. Not impressed at all. Portion size was small but expected from this type of a restaurant... So no real complaints about that. Atmosphere was nice, although I found it too loud for my liking."}
{"text":"Visiting from Melbourne, Aus and just experienced one of the best pasta dishes ever. The home made pork sausage and shaved truffle pasta cooked to al dente perfection. Thumbs up to mummy Terroni who I believe makes those sausages."}
{"text":"We were in Toronto for one night and wanted a great meal.  It was a Wednesday night and didn't think we needed a reservation.  We walked to Richmond Station and couldn't get in; graciously they recommended La Bettola di Terroni.  We got the last two seats at the bar.  Oh my gosh---it was WONDERFUL!!!!!  Great wine selection, the food was amazing, and the service impeccable.  Hope we can get back there some day!!!"}
{"text":"??????????????????????????????Cacio e pepe?????????????????????Panelle???????????????????????????????"}
{"text":"One of the most aesthetically-pleasing restaurants I've been in in Toronto. The interior is beautiful. Dimly-lit, minimalist, romantic, yet buzzing. Gorgeous!

The prices on the menu were a little steep, but the food was well worth it. I had the 'Orecchiette di Farro alla Norma' which in layman's terms was pasta with ricotta, eggplant and tomatoes. While the pasta was a bit overcooked and not 'al dente' enough for my liking, everything else was perfect. The ingredients were in good proportion with each other so the pasta and cheese didn't leave me feeling bloated and stodgy which can so often happen when these two ingredients are combined! I really liked how the eggplant came spread across the dish in small bites - I've had eggplant pasta dishes before with the entire vegetable plonked in one giant piece right on top of the plate and it's really unappetising! The texture of the overall dish was really good - no excess juice from the tomatoes or sogginess from the eggplant.

My bf had the duck special with fresh veg and couldn't get enough of it. The meat was crispy and like all well-cooked duck, devastatingly aromatic! People were looking at our table with envy! 

There was something about the service that I just really liked. Our waitress was friendly and informative but not overbearing or excessively trying to get on our good side for a huge tip. She did what she had to do and did it well, in a relaxed, casual but thoroughly efficient way. I feared the service would be pretentious, with the location, high-end décor and high prices, but it was anything but. This was really appreciated. 

The dessert we ordered, the bomboloni con gelato, was hands down the best dessert we ever had. We have been tempted to go back for the dessert alone!

I am really looking forward to returning."}
{"text":"MM MMM DELIZIOSO!

My friends, there's this thing that happens to some people when they are preggers, and to others even without a bun in the oven, called Cravings. And when that craving hits, it consumes all of you that you have two options: 1. go to all measures to fulfill it (i.e. yelp up what's open and text up my entire phone list for a buddy), or sometimes, the agonizing option 2. try to rock yourself asleep or do everything on your chores list to keep yourself from thinking about it.... (--- yea right, who's ever so productive?!)

So I, without being preggers, succumb to cravings on the regular and last week, the stars aligned for me to fulfill my craving for a margherita pizza at Bettola! My friend and I were initially going for Terroni but there was still a 30-minute wait at way past dinner time, so we went to Bettola just up the street.

It was still very full and happening at past-9PM on a Saturday night but we were able to be seated right away. Very cool paper place settings with a different geometric design on each one. The server was authentic Italian and spoke English with a wonderful Italian accent, which definitely added to the atmospheric enjoyment. She informed us that the papperdelle was not with veal that night, but with duck - excellent news because my friend, who does not eat pork or beef, ended up ordering it.

My craving was satisfied by the PIZZE DI BUFALINA and his papperdelle was DE*LICIOUS. The portion of the pasta was fair, and the pizza, a standard individual pizza size was more than enough for me. The pizza wasn't anything mind-blowingly exceptional but it was nice to have a craving for something specific satisfied by a well-made dish. The pasta was cooked perfectly and the duck so tender, and excellent flavour on the sauce.

All the desserts sounded so tasty but I regretfully declined. The service was so prompt and excellent. I would definitely go back again. And lucky me, it's right in my hood :)

Atmosphere - 5/5
Service - 5/5
Food - 4/5
Price - 3.5/5"}
{"text":"Excellent Meal...the Sausage, Truffles & Pasta were exceptional...the servers were efficient & went overboard to ensure everything was perfect....

Not impressed with the hostess, we were a little late for the reservation due to traffic. It felt like we were being chastised.....NOT GOOD S Hostess is supposed to make you feel welcome."}
{"text":"The interior is magnificent. A very cozy place for such a rainy day.
Besides, you can learn some Italian while using the washroom :)"}
{"text":"Cons: Expensive food (entrees $18-$26) for meagre portions and not tasty. The $22 Agnolotti dish came with only 10 agnolottis, and it wasn't flavourful, memorable, or tasty. The $18 Tonnarelli Cacio e Pepe literally tasted like mac n' cheese in spaghetti form. The food is not worth what you pay for. I strongly emphasize that. I couldn't believe there were so many people there that night...are they not noticing this? Sometimes the more expensive looking things aren't necessarily the best things. I'm never coming back here. 

Pros: Beautiful space, very friendly waitress with excellent customer service, lively atmosphere, classy and trendy decor."}
{"text":"Well I guess we should have had the pizza.  Disappointing.  Service was not great.  Atmosphere was not great.  Felt like i was in the burbs and not downtown.  Had the antipasto for the app and it was a joke.  Two pastas and I could make better.  Creme Brulee was great.  
Not like the Queen St. location."}
{"text":"Not Going Back- Ridiculous Purist Owner Policies

Very interested to try given location on the way to the Canon Theatre.

Ordered the Lobster Pasta and was warned, unprompted, in a nice way, that I could not be allowed to have the \"standard grated cheese\" on my pasta, as it is a rule they wont do that with Fish Pasta....ok, I can roll with that, whatever.

The bread came, a 2 out of 5 bread, being cynical and all, and the olive oil was delivered alongside. We asked for the Balsamic pairing for the Olive Oil. Well, apparently this Olive Oil is so fantastic that they refuse to provide Balsamic. 

Given that I have taste buds of a goat, I went for something a little livelier and asked for butter for my bread.

Well, seems Pasta Nazi Owner strikes again- NO BUTTER FOR YOU!

Ate the Pasta, wishing it was Soup Nazi good, but it was Kelsey's good only, I've had way better for half the price and half the hassle.

Yo Owner-NO BUSINESS FOR YOU!"}
{"text":"Love the food, service is quick and friendly

Arrive early if you are here for lunch as the business crowd packs it every day"}
{"text":"Quite nice place, not too expensive. The interior is hip, and the names of dishes are all in Italian, which is a nice touch but can be confusing when deciding what to get. Fortunately the staff is helpful in this situation. I ordered a pizza 'san giorgio' and was surprised that it was quite spicy, which was not written in the menu. That is my only negative comment. Overall, a very nice place with a hip feel to it"}
{"text":"Went here for a weekday lunch.  Liked the building, high ceilings.  Loved the agnolotti - you can taste the freshness and I'm a sucker for fresh stuffed pasta with braised meat inside :)  The breaded sword fish and the spaghetti that my colleagues ordered also seemed delicious.  The waiters didn't give us the time of day though skipping over questions about the special and not refilling my water when it was empty - hence the nothing special 3 star rating.  Perhaps if I were to eat here again, I'd order the agnolotti to go."}
{"text":"Had a quick pre-concert dinner at La Betolla before headed to Massey Hall on Saturday night. Was able to make a last minute reservation for 2, fuss free.

Service was decent, not great. The service was a little slow though it was attentive for the most part. Food timing was excellent.

We started with the cous cous salad and the octopus. Octopus was excellent with a really nice tapenade type of warm veggies that when spread on the complementary bread was delicious! Cous cous was good - a little over salted.

For a main we split the Smendozzata pizza - delicious!"}
{"text":"Before you even walk in you can smell wonderful aromas wafting down the street. A display of fresh pasta being dried greets you as you walk into the door. A cozy little restaurant great for a get together, a first date or for bringing a small party together. In true Italian fashion they have a list of apperitivos and digestivos. I could drink the olive oil hey serve with the bread - so good! I highly recommend the house pasta - you can never go wrong with that! Great dessert menu as well! Buon appetito!"}
{"text":"Went here for lunch a few days ago with two friends. I am vegan, which is usually fairly easy to accommodate at Italian restaurants that serve pizza - I just order a vegetarian pizza with no cheese. This is exactly what I did when I attended at this restaurant the other day. I asked for a vegetarian pizza without the cheese, full stop. No request to add extra toppings, no substitutions, just leave off the cheese. After I communicated my order to our server, he looked at me blankly like I was completely crazy and said \"I don't know if our kitchen will do that. They don't do substitutions.\" Huh? At first my friends and I thought he was joking. But when the awkward look on his face didn't go away, I advised the server that the reason I was asking for the pizza without cheese is because I was vegan, and there was virtually nothing else on the menu I could eat without substitutions. I'm not sure if he expected me to sit there while my friends had lunch and eat nothing, but that was essentially the alternative. He advised that he would ask the kitchen but there were no guarantees. 

A few minutes later, he came back to advise that the kitchen hadn't said anything so it seemed like the order was good to go. What a relief to know that I wasn't inconveniencing them excessively by asking to leave off the cheese! The whole experience was totally awkward and pretty ridiculous. I've never encountered any issue at any other Italian restaurants where I have ordered a pizza. The food itself was fine, but nothing worth going back for, and I certainly would not return based on how harshly and unprofessionally my (extremely reasonable) dietary accommodation was handled. I have worked in the restaurant industry with some pretty unreasonable chefs, and I get that they hate substitutions, especially during peak hours. But asking to leave off - not substitute or add, but leave off - a single ingredient due to a dietary restriction does not inconvenience the kitchen in any way. For obvious reasons I won't be back."}
{"text":"Having visited Rome in the summer, I needed to experience Cacio e Pepe in Toronto. This restaurant is one of the few places in the city that happens to have it on the menu. With that said it unfortunately didn't deliver what I was expecting. Could've used a lot more flavour with the pepper and cheese. However, the calamari and shrimp that we ordered as an appetizer was excellent.  Would recommend more as a place for drinks and apps."}
{"text":"Restaurant: La Bettola of Terroni
Cuisine: Italian
Location: 
Address: 
Price Range: 

1: Poor 2: OK 3: Good 4: Very Good 5: Excellent

Food: 2 
Service: 4 
Ambiance: 3
Overall: 3

Extra information:

* Limited Seating
* Limited Menu options
* Sister restaurant of Terroni



Why did I decide to check out La Berttola instead of going to Terroni? I have no idea, maybe I wanted to try something new. Boy, was that a mistake. Walking in, I didn't know seats were so limited in there I would have to sit at a bar.  When you go to a restaurant with more than 2 people and you sit at a bar....that's already going downhill, how am I suppose to talk to the 3rd person thats sitting a seat away from me? Anyways, I didn't do my research- I guess that's my fault. Walking in, I was pleasantly surprised to see such a small space decorated with so much attention to detail. 

Ordered: Crostino Piemonte 1/5

* Beef tartar on crostino with duck zabaglione and black truffle shavings for $16.00
* This comes with 2 large pieces of crostino which is also served with a side salad
* I love beef tartar but this was the worst one I had ever in my life
* This was so sour and tangy in every way possible it was so unplesant
* I am sure it's suppose to taste like how it does but I just did not like it at all
* Because it was so sour I felt like I was eating something that was rancid and gone bad
* I would never order this again

Ordered: C'T Mang 2/5

* White pizza with Mozzarella, Gorgonzola, Pears, Walnuts, Smoked Prosciutto and Honey for $16.00
* This was something I wanted to try for the longest time
* Personally I don't like fruits in my food, so this was somewhat of an adventure for me
* I also forgot the fact that I really can not do blue cheese (gorgonzola) when I ordered this
* This pizza is very peculiar in terms of taste
* Everything does go very well together in terms of flavor but I just did not enjoy it
* There was just too much going on with the crunchy pear, salty prosciutto, stinky gorgonzola and sweet honey
* I really wanted to like this but it just didn't work out for me

Ordered: Tonnarelli Cacio e Pepe 4/5

* With Pecorino Romano and Black Pepper served with al dente Chitarra Spaghetti for $17.00
* On the menu, they say 'very' al dente and they are right
* Pasta was the most al dente pasta I've ever tasted
* Simple sauce for the pasta was very plesant and mild
* This was my favorite dish out of the entire meal

Ordered: Agnolotti di Manzo con Burro e Salvia 3/5

* Handmade Agnolotti stuffed with braised beef in butter, sage and parmigiano for $17.00
* 8 pieces of Agnolotti (Ravioli) was very soft throughout
* Sauce was clear but very rich with the butter and parmigiano sprinkled on top
* Everything was a little too soft for my likings (don't like raviolis to begin with)

This meal was pretty disappointing because I always enjoy my food at Terronis. I know that I did not enjoy my meal here because I obviously went out of my comfort zone and ordered things I normally wouldn't order.

It's unfortunate because the service was so much better than what I normally get dining at Terroni. Although my food experience here is mostly based on what I ordered- that is big part of dining experience- so I can't help it but to choose Terroni over La Bertolla Terroni if I was craving some pasta.

Summary: La Bertolla Terroni is similar to Terroni but with smaller seating area and limited menu items. I would recommend this place for lunch if you were in the area but personally, I prefer to go to Terroni."}
{"text":"Food was good.  My wife seafood pasta was excellent.  My spaghetti, sausage $ truffles was a tad salty.  Pretty good price for food.

Very good old world wine selection.

Nice DJ for pleasant background music that was of right volume.

Service was excellent.  Friendly & unpretentious.  Would come back next time we're in town."}
{"text":"A branch of the Terroni, La Bettola has a lot to offer. It has slowly become a go to place for group/birthday dinners in my circle of friends. The service is great and servers are very friendly and courteous!

As usual I review any based on the categories mentioned below:

1. Ambiance - Very warm and inviting! Perfect for date nights or a nice conversational dinner. The restaurant is divided in two halves so its very spacious. Hence, the ability to host large group dinners. They do have a DJ and while good tunes play, its not loud enough to drown out your conversation, which is always a plus.

2. Food - The food here is great. During the times I have visited here, I have tried the Caprese salad and the Funghi/Arugula salad, which were both fresh and delicious. For appetizers, I have had their pork belly app., which i think is a special of the day coz its not listed in the menu...im not a big fan of pork, but this was so damn good I had to order two of them! Their swordfish carpaccio is delish and it teams up well with the slices of orange and arugula salad it comes with! 
I however didnt enjoy the Arancini(rice balls) as much! The taste was overwhelmed by parmesan cheese ...so much so that you couldnt taste the veal inside it! 

The key to a good time at La Bettola is ordering a few appetizers and splitting it with someone! I ordered a salad for myself and split 2 appetizers with a friend and it was very filling! 

Price: The food here is reasonably priced. My friend and I ordered 2 app., 1 salad each and shared a bottle of White wine from Fruili, Italy with 6 people(which came upto $7.5 per person,$45 for the bottle) We ended up paying $44 ( including tax an 18% gratuity) 

Service: Our server was great. He was well traveled and had tattoos to celebrate them. We discussed his stay in Nepal at a Tibetan Buddhist monastery. He also helped me remember a Pinoy dessert. Good with suggestions, showed that he knew the menu well. The white wine from Fruili that we enjoyed was actually his suggestion. 

On a scale of 1-10, this restaurant is a good solid 8 in my books :)"}
{"text":"Food: 7.5/10
Atmosphere: 8.5/10 
Service: 7.5/10
Overall experience: 7.5/10

The Terroni restaurants are definitely hit or miss in Toronto. My favourite has got to be the Rosedale location and my least favourite being the Queen East one. 

I tried this particular one for a friend's birthday party. The decor is great - it's warm, all the decor is very \"rustic chic\" as are all the other Terronis I've been to. 

Because we were a large group, the waiter wasn't able to accommodate separate bills. No problem. Would have been nicer if he hadn't made the snide remark that we should have let them know when we made the reservation. My friend said that she had, and his response was silence. 

The kitchen also was not catering to any substitutions that night since they were really busy. Again, that's fine to have a policy of no substitutions, but you are not the first restaurant ever to be really full or busy...

But the biggest let down was the food. It's not that the food tastes like poison or has to be sent back, it's just that what you get is never worth what you paid for it. 

THE BOTTOM LINE: typical Terroni interior and sub-par service with (guaranteed) disappointing food."}
{"text":"This was my second visit to this restaurant, this time we came for lunch. When you walk in you can choose between the two restaurants, one more causal and the other a little more old school Italian. The atmosphere is modern Italian and very inviting. My friend and I shared the tasting portions which came as six little appetizers and everyone was fresh and delicious from the beef stuffed, fried olives to the ricotta salata with honey and fresh figs OMG. We then split the pizza with Gorgonzola, sausage and red onion which was to die for. This is the place to get fresh, authentic Italian cuisine. The food is always on par, the service so, so. But you don't come to restaurant for that right?"}
{"text":"I'm kind of shocked by the reviews for this place. We should set expectations upfront. 

Takeaways:
- if you like to customize your food, don't go here.
- if you like wine to cost under $12 a glass, don't go here.
- if you want wine from California, don't go here.
- if you don't want to give your business to a restaurant with a bunch of rules, don't go here.
- if you want 15 separate bills, don't go here.
- if you can't eat bread without balsamic vinegar, don't go here.
- if you can't eat \"Italian food\" without a good smattering of powdery Parmesan cheese, don't go here. 

Phew.  I hope that helps a bunch of people who might otherwise write more angry reviews because they fall into the above categories. 

Go here if:
- you want to eat an interpretation of Southern Italian food the way they eat it in Italy
- if you want to explore Italian wine
- if you like a chic and bustling ambiance and beautiful decor
- if you and your friend can settle up later or pay your one bill on a bunch of different cards
- if you're not a self-entitled dick who wandered by from the Eaton Centre and who thinks \"providing good customer service\" means a restaurant does what you want though you have no qualifications in either running a restaurant nor Southern Italian food

It's cozy & romantic & rarely disappoints.

I vastly prefer this location to the noisy Adelaide space.  The new(-ish) Rosedale location (Bar Centrale & the upstairs) is also quite nice."}
{"text":"This place is right around the corner from my work, so I tried it with a few coworkers over lunch. We all ordered the same thing- some fettuccine with a pulled pork ragu. The pasta tasted very fresh and quite light for what it was, so I was satisfied with the food. Nothing SUPER memorable though...so 4 stars for food alone. 

Our server was really curt and rude to us for no reason, though. My worker had asked her if the dish was particularly salty and she just said \"yes\", even though it wasn't and she really didn't give a comparative example. She didn't seem too swamped either, as we had a 1pm reservation and the lunch crowds were waning. She seemed like she was just being rude to be rude. 2 stars for service. 

3 overall."}
{"text":"I was in the area last night after a meeting and my colleague wanted to eat to kill some time before getting back on the highway. He suggested this place because it was close to where we parked, so I agreed even though I'm not particularly fond of Italian food. 

It was quite crowded for a Monday evening. We were seated at the bar, but we got cute little corner seats with seat-backs so it was fine. Service was very nice, but the bartender took forever to take our order. Maybe he's used to people really taking their time over the menu. Once our orders were taken, the food arrived pretty quickly.

I ordered the carbonara. The pasta (noodle) itself was exceptional. Al dente with a pleasantly toothsome bite. I could have eaten a plateful of plain noodles. They were that good. The dish, overall though, was one-note. That note is salty. Yes, carbonara can be salty. Duh, bacon. But add some other flavours to elevate the salty profile. Find some balance.

This! This is why I'm not particularly a fan of Italian cuisine. The Italians don't seem to have a deft hand with balancing flavours the way that other cuisines do. There's no attention paid to the balance of salty/sweet/sour/bitter the way that Thai does, for example. 

What would have elevated and balanced this dish? Some lemon perhaps (acid is great for brightening a bland, fatty dish). Or some freshness from a chiffonade of basil or some lightly sauted scallions or peas.  Or some heat from crushed red pepper flakes. Fine, you guys will say, \"Then it wouldn't be carbonara!\" Well take your one-note boring pasta dishes while I liven up and balance the flavours of my own pasta dishes at home. Hmph.

Pasta (noodle) - 5 stars: Overall flavour: 1.5 stars; Service: 3 stars"}
{"text":"The owner's policy of no dishes can be modified, no matter personal preference, food allergy or anything, will make me never go here again.  I will recommend another restaurant to any I overhear want to go to Terroni's places."}
{"text":"I love Terroni's, although I find it's usually pretty loud in there due to the amount of people.  Their popularity is definitely a good sign of good food.  We decided to try La Bettola di Terroni for a weekday lunch.

Before I get into it, it should be noted that the other half of t

he restaurant is tapas style.  Apparently you get a tiny, TINY little dish for $20 or more.  My friend went there and left starving.  They went to The Keg afterwards for a real meal.

We were a little skeptical, but the hostess assured us La Bettola di Terroni serves proper-sized meals.  We were seated and shortly thereafter there was a mini-reunion of lawyers.  Just to give you an idea of the crowd here...

I ordered the Barbabietole e Caprino salad to start (Roasted Beets, Goat's Cheese, Lamb's Lettuce, Pistachios, Candied Lemon Zest and Anchovy Balsamic Dressing).  My date ordered the Nizzarda salad (Arugula, Italian Tuna, Potatoes, Egg, Red Onion, Tomatoes, Black Olives,Green Beans and Anchovies) but asked for no anchovies.  The waitress originally told him that wouldn't be a problem.  But a few minutes later, told him it couldn't be done.  When his salad arrived, the anchovies were merely placed on top...  how difficult would it be to remove?  Oh well.

I decided on the Gnocchetti alla Norma for my main (Handmade Potato Gnocchi with Tomato Sauce, Fried Eggplant, Ricotta Salata and Basil) because of my love for eggplant.  It was delicious.  The portion was fair, but not overly big.  (I complete forget what my date ordered...)

A co-worker was dining on the other side of the restaurant and came by to chat with us after his meal.  He's Italian and was not impressed at all.  He said he would never come back!  He tried to order some simple pasta with a tomato sauce.  Based on the items on the menu, he knew what types of pasta were available and what types of sauce were available, but the kitchen was not willing to deviate from the menu.  Very similar to the anchovy incident.  Perhaps the chef has control issues.

All in all, very nice atmosphere for a work lunch.  Definitely on the pricey side.  Not sure if I'd come back again, now that I've already tried it and was told by an Italian that he would never come back."}
{"text":"Good bar scene and overall atmosphere, a lot of wine options including a very nice Amarone by the bottle. I enjoy their appetizers like bocconcini with cured duck and their Fritto di Paranza which is lightly fried calamari, shrimp, baby octopus and cuttlefish - solid apps! 
The pastas are good, I got the Spaghetti allo Scoglio (seafood pasta) and the clams and mussels had some sandy/grainy bits, a little disappointing.

I'd recommend Bettola for an after work drink and apps with friends for it's lively atmosphere."}
{"text":"Best pasta I've ever had! Service was amazing. My boyfriend and I were visiting Toronto and decided to make a reservation, I wish I could go back just for this meal!"}
{"text":"After arriving to a locked door at Terroni on Adelaide*, we strolled over to La Bettola.  If you like Terroni, you'll like this place.  It's basically the same food with a smaller menu.

Pros;  
-Good quality ingredients, well prepared.  The pizza you've come to expect.
-Excellent hot peppers as a condiment (by request).
-They sell these peppers in a glass jar.  (See cons.)

Cons;

-Bread served in a \"cute\" little paper bag that gets thrown out after each meal.  Seems wasteful.  Ever hear of a basket or plate, Terroni-people?
-We were excited to see that the excellent peppers (Peperoncini Piccanti) were for sale behind the counter.  We bought a jar, got it home, then discovered that it expires next month (was prepared in Feb, 2009).  We took it back, but all their stock had the same expiry date.  Also, the waiter told us that they were made \"in house\", but the jar would indicate otherwise.  (This really should have lost them a star, but hey, the food was good.)

*This was after making a phone call and being told that Terroni would be open on Monday Jan 2."}
{"text":"I had low expectations of this place, despite some reviews being great, and others not so. I tend to be a pessimist and wasn't really expecting outstanding service or food. But I am happy to say, I had a great time here.

The restaurant shares a space with another restaurant (also by Terroni) and to the left is La Bettola. The seating is tight and the tables for two are small and pretty close to each other. Other than that, service was en pointe. I was allowed to sit and take a breather before ordering a glass of Montepulciano. My friend soon arrived and we were both hungry. She ordered a soup and the Angliotti and I had the Caprese Salad and the most tender-est Beef Medallion ever. I didn't even need to say I wanted it Medium Rare - it was cooked like that for me anyways. A HUGE STAR FOR THIS! As with other reviews, portions are small, but that is just fine with me. That enabled me to try different dishes and I didn't get that overly-full discomfort feeling.

My friend and I were continually checked on and I soon ordered another glass of vino, and a dessert wine.

The place does get busy and for a Tuesday night, it was no exception. Reservations required. I think this is a great spot and if I lived closer to the area, I could imagine myself coming here often. The only thing is on the weekends, La Bettola does look very busy and because seating is so close, I'm not sure I would enjoy myself as much. So perhaps, I'll come back on a weekday."}
{"text":"Very lovely and authentic place downtown for some Italian food and wine. 

Modern but Italian design, clean and simple. Service was decent. Bathrooms are one stall per gender. 

Food is unique and delicious. I had the sword fish pasta and the black truffle pasta. Delicious. Pasta done al dente perfectly. The aroma of the spices and all is done to perfection. Quite filling i must warn you. 

Their wine selection isn't the biggest but not bad what they carry. Their wines do start at a highe price $12. Their cups are smaller than outside restaurants (random i know). Their coke comes in a bottle. 

Their pizza is relatively good size and is delicious. It's really a hit or miss when  it comes to the food here because I ordered the sword fish pasta but that was completely not what I thought it would look or taste like. I ended up switching it with my friend for their black truffle pasta which i then loved.

I'd recommend it for a nice evening out."}
{"text":"My friends ordered the spaghetti allo scoglio which is suppose to come with clam mussels calamari and shrimp, they didn't get any clams and one of my friend only got one shrimp where as the other got 3. I ordered the chitarra norcina which consist of hand made sausage, shaved truffles and meat sauce and it basically just tastes like a glorified Mac n cheese in spaghetti form."}
{"text":"Came with a group of 15 and we all had a terrible experience here. I pretty much have the same opinion as the other reviewers that had a bad experience with a large group: 

1. They don't split the bill.
2. Our waitress was just a stressed out mess with a \"whateverrrr\" attitude.
3. They will not allow minor tweaks to their dishes, even if you have a dietary restriction.
4. We found a bug in our cocktail after we took a sip out of it and didn't get a sorry. Yet, our friend had a dish come in a bit late so she didn't have to pay for her meal and got a free dessert. The inconsistency was infuriating.
5. The food isn't even that spectacular...

I doubt that they are going to tank because they have developed some credibility from all of their previous reviews, however, their laziness and stuck-up attitude really shows. It's hard to find a really great and unique restaurant near the Eaton Centre so I get why they get all the business, but please, DON'T GO TO THIS RESTAURANT!

Instead, fellow Yelpers, go to Richmond Station! Service is a million times better and food is a billion times better! They're around the same area and their staff don't talk to you like they hate their lives and you."}
{"text":"I had appetizers and pizza. While appetizers were ok, the Bufalina pizza was terrible. Flavorless, very light crust, barely traces of actual mozzarella di Bufala. Service was slow. As an talian foodie, I can't go for more than two stars. Won't be back"}
{"text":"A cute little option for a holiday team lunch with coworkers, close to the financial district. Service was attentive and noise level wasn't too loud. We had called ahead of time to order a few appetizers so they would appear asap after we arrived -- I like that they were able to accomodate this; super smart and recommended if you're tight for time.

- the FRIED MUSHROOM SALAD was great, though could have used a bit more seasoning 
- the FRITTO MISTO was nicely fried but completely flavourless. If they consciously opted against the typical marinara-type sauce, the lemon wedge served on the side would have sufficed if it were otherwise well-seasoned..but it was not
- the BUFALINA PIZZA was a simple margherita-style, but good. nice balance of sauce to cheese and a good crust.
- ORCHIETTE WITH 'NDUJA -- the rapini (i think) was cooked soft but blended nicely with the rest of the pasta, but i was really disappointed that none of 'nduja flavour stood out for me. Noticeably under-seasoned as the bites that did have some of the chili oil i added, or some of the salty cheese were significantly brighter in flavour
- I've gotten used to the price of cocktails in Toronto, though the build-your-own GIN & TONICS i thought was overpriced at around $14 or so. they serve you your gin of choice on the rocks with your garnish, and you add your mixer at the table yourself -- no frills, no need to charge what they're charging
- i'm always a sucker for TIRAMISU and CANNOLI -- they were just shy of being too-rich, and did not disappointed. it definitely helped that we had shared both amongst 3-4 people

Overall, not terrible by any means but glad someone else was footing the bill"}
{"text":"i had the best plate of pasta that i ever ate. my wifes pizza was good and the service was very good. we'll be back there when in toronto"}
{"text":"Unbelievable Restaurant \"Policies \" :

1. No separate bills (even if you ask as soon as you sit down as a group of 7) but they allow you to split the bill YOURSELF and pay by different method = DO YOUR OWN MATH! 

2. Sorry, No Balsamic Vinegar with their Precious Olive Oil!!!!! Even if you ask for some, they won't give it to you, that's their Policy!!!! Don't even bother asking or Bring Your Own Balsamic!

3.  This is not as important but remember, everything is \"As Is\".  They won't customize for you if you ask them to Take some ingredient away. Wonder what if I am allergic...... Hm......

4.  They don't have a comment card or website area for customer to leave feedback..... I guess they must have thought they are perfect as they don't care what their customer thinks.....

For me, doesn't matter how good the taste is, customer service is still a very important  element."}
{"text":"When going out for an Italian meal in Toronto, one would be wise to seek council from one of the cities own Italians. Our friend Peter Cardineli, a proment record producer and our tour guide for the evening, suggested this place as he said it was outstanding. 

He wasn't kidding

The ambience is so cozy and inviting it screams Italian. So we order a charcuterie plate to start. Simply awesome, fresh cured meats, sundries tomatoes, olives and cheeses with deep fried pizza dough. My lord just divine!

We all had a pasta course as while on vacation I don't follow the gluten free life to the strictness sense. I had orchietta with fresh local sausage and a rapini kind of pesto. Super high recommend on that baby. The orchietta's were like little pillows of gorgeous. Just melt in your mouth! I was so enamoured with my dish I totally forgot to even look at what anyone else had but everybody was looking satisfied and full. 

Good thing we had a long walk to Rogers Center cause as per usual while out of town I eat entirely too much. This place is so worth checking out. Great wines, great food, great service from a lovely Italian lady who knew her shit when it came to food from that part of the world. Check this place out for sure if you find yourself downtown in the 6

Cheers 

Andy"}
{"text":"Classic Terroni - it's either their way or the highway.

Had the cheese/meat platter to share - which was nice. The fried mushroom salad was absolutely fantastic - wow.

My main was their special - crusted tenderloin steak. It was good - the steak and accompanying sauce was delicious, but the actual meat just did not have the texture I was looking for.

I should note that the pizza looked amazing - and I'd rather the Queen West Terroni as superior."}
{"text":"Sat at the dining friendly bar.  Eclectic Italian wine list.  High energy crowd there for the film festival, modern, bright decor with a great atmosphere.  Carpaccio with paper thin oyster mushrooms was spot on.  Two pastas - one a braised beef special and the other with black truffle, went perfectly with the Puglia region Susumaniello red wine (never had that Italian grape before - southern Italy meets Amarone).  What a treat!"}
{"text":"I had a really great salad, and so did the two friends I went to this restaurant with. Very well lit. A bit cramped. Great waitress. A very long and detailed wine list...almost a little too much so. First establishment we visited on our vacation here and it was worth remembering!"}
{"text":"Meh. Save your money and go somewhere else. It's nice, but it's not worth the money. Food was just ok, you can get better for cheaper."}
{"text":"I think we looked like lost tourists.  I take this to heart and am pretty embarrassed.  My husband was BORN in Toronto.

There were are, on a street corner, baby in tow, and trying to decide where to eat.  I had done previous research but had left my sticky note with the restaurant names at home and did not want to use my phone out of the country.

A nice gentleman approached us and suggested Terroni after hearing what we were in the mood for and giving us a look up and down.

Thank you kind sir.

I loved the ambiance, man Torontonians know how to dress!  Glancing around the room was like witnessing a runway crew of models taking a break from posing.

The restaurant itself is quite sexy as well, love the large windows to the street, bread in bags, and visible kitchen.  The service was fabulous from start to finish.  Our waitress was polite, helpful, funny, intuative - everything we could as for. 

We started with the Fried Parmigiano Reggiano and Sage appetizer.  This was delicate and delicious!  The balsamic paired particularly well.  
Hubby had the Bufalina pizza which includes Tomato, Bufalo Mozzarella and Basil.  This was quite good.  As I am sure you have heard - the pizzas arrive to the table uncut or sliced.

I had the Fettuccine alla Genovese which is house made Fettuccine with Basil Pesto Sauce, Pecorino, Green Beans, and Potatoes.  Amazing.  Perhaps one of the best pasta dishes I have had the pleasure of eating - a must try for any pesto and fresh pasta lover.

We split the Nutella and with Homemade Gelato and a Tiramisu.  We literally split dessert.  As in, I took the fussy baby outside while he ate half and then he took the fussy baby outside while I ate the rest.

Well, she was good 'till dessert."}
{"text":"We went there for a special occasion with 15 people,  and I have to say it was one of the worst dinning experiences I have had in a while. Our server was rude and did not want to split the entire cheque for 15 people even though they confirmed they could when we made the reservation and when we arrived. When asked why,  the sever said she could but didn't have time (even though the restaurant was empty) . Oh ya,  the food?  Nothing special. If you are a table of one,  do visit. Any more,  pass."}
{"text":"My wife took me here for dinner; it was superb! Excellent service! And the food - focus on Southern Italian fare - was fabulous! We split appetizers - a beet & buffalo mozza salad, & a duck prosciutto with fresh fig & feta creme- and had our tastebuds satisfied...but pasta called & we stepped up! My wife enjoyed a thick spaghetti-like pasta al dente with black truffle & ground sausage, while I dug into pappardelle with fresh lamb ragu & Parmesan. Yum! A hidden gem!"}
{"text":"Loved the calamari app and the smoked salmon. The Gnocci's were fresh and the dessert (tiramisu) was pretty good. Atmosphere is upscale and it was pretty packed here on a Tuesday evening. The staff took a bit longer to take our orders and couldn't split our bills for us."}
{"text":"Ok, 5 stars for the exceptional pasta I had, the Chitarra Norcina (black truffle and sausage pasta) which I chose from the first tip that showed up on yelp, thanks Bjorn! Great tip, it's still tasting awesome 2 years after you wrote that tip! The pasta was perfectly al dente, I was in complete shock at how good it was because I usually don't like pasta or go to Italian restaurants, but this dish was so flavorful and delicious.

Service I would give only one star. It took over an hour before they took our order. I found the front desk staff a little stressed out and unpleasant. But the long wait and the staff did not ruin everything for me, taste is king and it was awesome. Maybe they were having an off day, I'll definitely give this place another chance."}
{"text":"I could be sitting down to the best meal on the planet but if the service is arrogant and pretentious it makes it taste like dog poo. But the meal was underwhelming. Pasta was less than el dente (IT crackled). We were told that the chef didn't believe in the following - balsamic, butter, salt, cream or even allowing us to have our steak cooked to OUR liking. The meals were tepid and under seasoned. The olive oil tasted close to rancid. And the waitress whispered through the specials and took over 30mins to take our dessert order then promptly pressured us out of our seats for the next victims. Will never go back. Change your attitude. PRETENTIOUS came to mind regularly."}
{"text":"Came here on a Saturday before a Massey Hall show with my parents for the first time. Service was great! Very fast. The food was good, although not over the top. My mom ordered a caprese salad and it seemed to be all tomatoes and little basil. My dad ordered pasta and loved his dish! Overall, was a nice dining experience. I'm not sure I'll be rushing back as I much preferred the other Terroni locations menu options."}
{"text":"It's not bad but just ok. Prob not worth the price. Had pasta and market fish only. No pizza. Pasta was cooked well and had expected textures and flavor. Portions are larger than average. 2 stars is good. However, I wouldn't come here again. Not worth your first try if you wanted Italian for the night."}
{"text":"Very overpriced for mediocre food.
Pizza and pasta were both bland and underwhelming. 
Only saving grace were the cannolis- those are delicious 
Service is friendly but very slow and disorganized. 

If you're looking for good Italian food downtown, save your money and have much better pizza and pasta at gusto101, pizza libretto etc."}
{"text":"Went there for lunch today. Pasta was good but the appetizer was better \"Tavoliere del Giorno Selection of Regional Italian Meat, Cheeses, House Specialties\""}
{"text":"Whenever I walk past La Bettola di Terroni I am always enticed by the wafts of garlic and butter aromas.  Unfortunately, it is usually during my lunch hour that I take a leisurely stroll and by then I've already eaten.  

Don't let the name (La Bettola) fool you - this is no \"hole-in-the-wall.\"  The interiors are very inviting as you walk through the glass doors and are greeted by Mr. Pig (read hanging legs of parma prosciutto) and Mrs. Pasta (racks of pasta).  Talk about being a tease!

The interior is very modern with leather banquettes and exposed brick.  I like that there's an exposed brick alcove (which reminds me of a wood-fired oven), but the pizzas don't come out of there - it's just filled with all sorts of booze!

A rolled down, brown paper bag serves as the bread \"basket.\"  I've always had the mantra that the measure of a quality restaurant starts from the bread.  If their bread basket is crap, don't expect much.  The one at La Bet was neither here nor there.  It wasn't terrible, but it wasn't fresh either.  The crust was a bit chewy.  :(

In addition to the regular menu, you will find an insert with the daily specials inside the menu.  Today we opted for the Giuggiolosa Salad with Cambazola, roasted red peppers, toasted pine nuts, olives and honey on a bed of mixed greens as well as the Funghi Assoluti - baked oyster mushrooms dusted in Parmesan atop a bed of arugula.  Both salads, though having very simple ingredients tasted amazing.  I always say - start with the right ingredients and they will do all the work!

We ordered the Chitarra alla Norcina with a sausage ragù and shaved black truffles.  The pasta was cooked to a perfect al dente but the sauce was like taking a salt shaker and slapping me in the face with it.  I think I read somewhere in the newspaper today that there's pressure on the government to get restaurants to display sodium content and calories on menus - I don't know that I'd want to see the sodium count on this one!  The shaved black truffles were nutty but not particularly heavy on the truffle flavour.  Not sure if it's because they're not in season, or from where it's sourced but my truffle craving was not satisfied.  And it wasn't as if there weren't a generous amount of truffle shavings either.

For dessert I opted for the Cannoli Siciliani served with pistachios.  While I've read that one should skip the cannoli and go for the Nutella fritters - I was not disappointed.  These cannolis may have been a tad over-fried or re-fried, but they were nice and thin and the ricotta filling was absolutely scrumptious!

The cappucino here is pretty good - first off it's hot enough and there was a healthy layer of milky froth on top.

Service here is friendly and we ended up getting our dessert and coffees comped because the kitchen had actually forgotten about our main and we ended up waiting a bit longer than normal.

While most of the menu items at La Bet can be found at their other Terroni locations - I quite enjoy coming here even if it's just to nab a window seat to people-watch.  It is definitely a place to go if you want to have a relaxing lunch.  Though at $70 with tax and tip is probably not an everyday indulgence!"}
{"text":"My wife and I actually ended up here by accident. We were fortunate enough to stumble across it after getting lost looking for another restaurant. We stopped in around 9pm on a Saturday night and were seated right away. Both my wife and I ordered dinner and antipasto from the specials and it was fantastic. The ingredients tasted super fresh and honestly it was the best risotto I've ever had in my life. For dessert we shared a vanilla gelato with a Nutella and Pastry Creme Puff and it did not disappoint. My wife and I are from The States and that dinner was single handily worth the trip across the border."}
{"text":"The salads, pizzas, and pastas here are really good. I enjoy coming here, and have yet to experience any type of bad food as yet! The server we had was super nice and very helpful with splitting bills and separate cheques, which they ordinarily don't do."}
{"text":"I enjoy Italian food but I'm not a huge proponent...

To say that I enjoyed this place would be a ridiculous understatement. Aside from the fact that I could actually spread out and enjoy the meal I would say that this reminded me of authentic, rustic Italy! 

Recommended...

Pasta: Chitarra? Hand made - thicker noodle with lobster. A..mazing.

Pizza: Ct Mang...YEAH MANG! - Excellent - I won't spoil the surprise of what's inside, but it is soooo lovely.

Wine: Red Marmorelle - Negro Malvasia Nera

Atmosphere is really cool, the service is great, and the location can't be beat. 

ENJOY."}
{"text":"Visited La Bettola for lunch.  True to it's meaning La Bettola is very rustic with good food.  The caprese salad was fresh and flavourful.  The funghi assoluti was very tasty but for the price they should do better than mortadella on the tavoliere del giorno.  The pastas we tried were also quite good.  Overall, good food but on the high end of price for a lunch.  What really was extra special was the service!  It started with a friendly greeting when we walked in and an A+ server.  We will return."}
{"text":"Went here for a quick dinner while visiting Toronto. Service was not particularly friendly. Food was just okay...the beet salad was good but the San Giorgio pizza was not. I wouldn't recommend and wouldn't go back."}
{"text":"Enjoyed the fettuccine with veal ragu and the wine recommended by our server.  She took the time to help us choose both our meals and a good wine pairing.  I would recommend this restaurant for dinner. Probably because of the ambiance and lighting."}
{"text":"This is my first experience dining at a strict Italian restaurant.  The décor is modern and classy, yet casual.  As a group of 7, they seated us at the tall table with metal chairs.  Not the most comfortable, but ok.

-Bread is served with olive oil and chili sauce.  Someone asked for balsamic vinegar, but the request was declined by the waiter.  I assume parmesan cheese was also out of the question.  *sniff* 
-Only Italian wines are offered.  I'm okay with that, it's cool to try something new.  Glasses range from $7-14.  They also offer half bottle and full bottle portions and have a large selection.
-When dinner came out, someone asked for parmesan, but the waiter informed us that the chef doesn't allow this.  She also asked for pepper, which I was surprised WAS allowed.

For my \"Primi\", I was deciding between the ravioli on the specials menu and the agnolotti.  I was curious to what agnolottis are, so I went with that.  They are like ravioli's, but shaped differently.

Agnolotti di Manzo con Burro e Salvia $ 17 - Handmade Agnolotti stuffed with braised beef in a butter, sage, and parmigiano Sauce.  This was quite delicious!  The pasta was light and fresh.  It wasn't saucy but nicely flavored.

I tried a bite of gnocchi but wasn't impressed.  The texture of the gnocchi was grainy.  I did like the crispy bits of vegetables in it.

The waiter was nice and attentive."}
{"text":"I'm not very fond of this location. I've been to another one, and thought the food was with the price. This location seems pretty sub-par. I came with 4 other friends and they all ranked their food 3/5 and found the place too expensive. 

The service was ok. Nothing really special. I had a seafood appetizer which was done very well and I enjoyed it. But nothing else on the menu looked like it was worth ordering (and a per my friends, I was right).

Check out the other locations, maybe?"}
{"text":"Would have considered this a four star a few years ago but it definitely has dropped in quality. 

We ordered the Ct mang pizza and puttanesca pasta.  The pizza which was one of my favourites on previous visits was nowhere near what I expected. The crust in particular used to be a beautiful Neapolitan thin style with a cracker crispiness and a soft chewy interior.  It is now much thicker and has lost all its crisp. 

The pasta was just okay. Where before the servings were slightly smaller (which generated many complaints here) the ingredients and presentation were far more refined. This time it was just a big plate of spaghetti and tomato sauce with a handful of olives.  I guess they are just looking to appeal to the masses now with bigger portions. 

Perhaps I just caught them on an off night. I have to say the place was jam packed so they are not hurting for business. 

Maybe I'll give them a chance on a quieter night and see if they can live up to what I used to love about this place."}
{"text":"Hidden Gen - more low-key then the other Terroni locations with a limited menu, but usually has a great vibe and tasty menu"}
{"text":"I am starting to develop a downward bias for Italian food in Toronto. I went to La Bettola with for a mid-week get together with friends.  We shared one apptizer (shrimp and calamari) amongst 3 people and I ordered a pizza.  Ended up spending $30 after taxes and tips.   

The food was a-ok.  The shrimp and calamari was tasty, but nothing special.  Same thing for the pizza.  The restaurant was pretty nice and pretty busy.  Service was good and attentive.  Unfortunately I just feel like I am paying too much for an ok experience.  

I can go get ramen or pho for half the price and still get this ok experience, which makes La Bettola worse than average.

Based on the reviews, I went to the restaurant planning to order the truffles pasta, but was turned away by the price.

Price      1.0/5.0
Decor     3.0/5.0
Food      3.0/5.0
Service  4.0/5.0

Overall  2.7 / 5.0"}
{"text":"Have been here many times and always enjoyed the food. They've changed their menu in the last year and I don't like it as much. And the prices have been raised. Not as good value wise any more. Pizza is always good as is the service but as with the other Terroni locations it is far too loud to enjoy your meal. And it's not music just far too \"live\" a room. Not sure if it's a recent change in decor or what but some absorbent material on the ceiling and walls would at least have allowed our table of 4 to hear each other! We might have stayed for desert too but at that volume we just needed to leave!"}
{"text":"I was recommended this restaurant by a friend. I believe that there are 2 of them maybe even 3? Anyhow, I made a reservation on Open Table and later realized I chose the wrong one. The one on Queen West is the one to go to apparently...I went to the one on Victoria Street. Anyhow, the service was wonderful as was the food. The reason for the poor rating was as follows: the tables are really tight together. You can hear everyone's conversation and this evening was a bit too much for everyone. There was a group of about 8 ladies that were very very loud. To be honest...they were obnoxious! They were logging and screaming at each other and everyone around was in disbelief. Our server was even embarrassed about it. Nothing was done. I expected the manager to chat with them and this never happened. I struggled with the fact that I wanted to order a certain pizza and was told it had a certain type of vegetable on it. I asked if the vegetable could be left off and was told no. So I ordered a different pizza and was told that the chef might put on Spivey sausage...this never happened. Again, the service was good and the meals were descent but I wouldn't go back to this location. We left disappointed especially after spending $150.00. Is recommend not dining at this location."}
{"text":"This place was one of my favorite spots in Toronto. Perfect date spot. Restaurant design, food presentation, taste, and service all tops. Dont miss this place if looking for Italian in Toronto. (Get the Italian sausage pasta!!!)"}
{"text":"Nice place to spend a Friday night but nothing special really.
The service was good, our server was very fast and friendly. The food was mediocre, and I honestly didn't like it. I also felt like there were too many tables for that kind of space, therefore the room seemed a little crowded. The bill came out to be a 60 bucks which is a little bit pricey for a place like that. 
Service 5stars
Food 2stars
Atmosphere 2stars"}
{"text":"I made a quick pop-in for lunch with some coworkers. I had the Papardelle with Braised Duck ($21), and it was perfect. Can't really comment on anything else aside from the espresso, and bread which were all fine. I will definitely be back again."}
{"text":"Came here for lunch with some colleagues.  Service was decent but pretty slow at times.  Fortunately we had an extended lunch, otherwise I wouldn't suggest coming here if you only had an hour door to door.

This place has a nice ambiance, as do all of the sister restaurants of Terroni.  This restaurant in particular has fairly tight quarters though, so don't bring a ton of stuff with you!  lol  

The food was tasty, and decent portions.  I have been dying to try the pizzas here for awhile and got one with prosciutto and goat cheese.  Tasty times!  For people who haven't been here though - be forewarned, you're not allowed substitutions or even removing items from the meal if you're allergic or just don't like something.  The rule goes a bit overboard in my opinion, but if you're like me, and like most things, you won't have a problem finding something on the menu.  

Even though we had a long lunch, I had to leave before the rest of my party.  They don't split bills, but will let you pay separately if you have to leave.  Dumb thing is, though, they won't let you just pay for what you ordered - at least this waitress didn't - I had to pay for a quarter of the bill, so I ended up putting in more money than I should have.   

This place is not deserving of 5 stars, but as long as you're okay with the rules here, the food is worth it."}
{"text":"It was a Monday night around 7:30 pm.  My friend and I somehow got a seat at La Bettola di Terroni.  This was nice considering that they 1) don't take reservations; and 2) my experiences with Terroni: it's always busy.

The service was great.  Our waitress came by to check on us every once in a while.  Decor was great too - had a very rustic Italian feel.  Not only that, they served us bread in a rolled down paper bag.

My friend and I ordered the folllowing:
1) BIS DI CARPACCIO DI PESCE:  This is a definite recommend for an appetizer.  I've never had sword fish before, but it was absolutely delicious considering that it was marinated with lemon and extra virgin olive oil.
2) STROZZAPRETI CON N'DUJA: hand-rolled pasta with Italian sausage and tomato sauce.  It was a tad too spicy for my liking, but I really enjoyed it.
3) GNOCCHETTI ALLA NORMA: my friend ordered this and she had no complaints - it looked absolutely delicious.
4) FRITTELLE DI NUTELLA CON GELATO: Okay - this is something that one MUST get when they head to La Bettola.  It was basically a fritter with granulated sugar and Nutella inside.  I'm a total sucker for hazelnut.  Not only that, they also had hazelnut gelato (which was to die for).

Overall, an amazing experience at La Bettola.  Would defintiely recommend this restaurant for a nice evening out with a friend."}
{"text":"Absolutely delightful and delicious!

I miss the good old days when I used to live across the street from this place. It became my absolute favorite, great for romantic occasions and friend hangouts.

My personal favorites are:

- Pan seared scallops (I am a big fan, and they really know how to sear a scallop here!)
- White sauce pizza with pear and prosciutto
- Pistachio coated pan-seared Tuna
- Carpaccio
- Gelato for desert or delicious Cannoli Siciliani

mmmm

Paired with my favorite Aglianico wine :)

Enjoy!

PS I also find it extremely affordable for being such a delightful place, calm atmosphere, good music, also very quiet even on the weekends."}
{"text":"A good friend of mine took me here for dinner on a first night in Toronto of a short business trip.  We opted for the Terroni side of the restaurant for the choices available on the menu and the smaller portions of the dishes.

The menu offers antipasti, primi, seocondi and dessert dishes.  In addition to ordering the menu items individual, you can order combination such as antipasti only, antipast + 1 primi, antipasti + 1 second, etc.  The antipasti order comes with single servings of 5 different dishes.  Therefore, although the primi and secondi dishes are small, if you order antipasti, you don't want your next course to be any bigger anyway.

Since I was not hungry, I only had orechiette di mare under the primi section.  I chose my dish because the pasta is hand made and its consistency was perfect.  The mussels and clams were plump and juicy.  The tomato sauce was thick but the flavour was not overpowering.  My friend had the antipasti dishes in addition to his braised short ribs.  They looked very inviting, too.  They will be on my list for my next visit.

Service was prompt and friendly and prices are very reasonable."}
{"text":"You know, it's funny. I had really high expectations for this restaurant when I saw the funky but laid-back Italian interior and especially after I read the mind-blowing selection on the menu; rich ingredients promised in perfect harmony from pastas to pizzas to paninis. Combined with extremely professional servers who made us feel as if we were in a ultra fine dining establishment, well, the bar was high.

The food? Well, it was only okay. The eggplant rolled around gorgeous fresh mozzarella was a phenomenal starter and a complete stand-out, the gnocchi (again with eggplant) was nice but nothing fancy, and the special pizza of the day with buretta cheese, mushrooms and shaved black truffle fell completely flat. I was prepared to be blown away by flavour but really, it could have been any old flatbread with cheese and mushrooms.

Luckily they have a delicious bottle of Prosecco on the menu for a nice $40 price point that washed away any major concerns and eased the fact that everyone was pretty much sitting on top of each other in the crowded loft-sized space. I wouldn't rush back but I am still tempted by some of the other dishes I read about on the menu."}
{"text":"Disappointed! Our first night in Toronto, a Wednesday, and we stumbled upon La Bettola.  We ordered the lobster pasta and was surprised it was noted on the menu \"served without cheese\". Odd but whatever. I would have appreciated a strong suggestion not to use it as my friend was offended at being told what she cannot have. We also ordered the beet salad and since I am lactose intolerant we asked for the cheese on the side. The waitress looked concerned then said she would have to ask the chef. When the waitress left I noted to my friend the scenario was reminiscent of the Soup Natzi. The waitress returned with good news that they would accommodate the request. My friend and I decided to share our dishes and told the waitress as much expecting thy might accommodate with separate plates but no.

We were given two slices of bread with olive oil. No refills. We were unsure if we should ask for pepper. The plates arrived and they didn't split it for us nor did they give us extra plates to split. The food was okay, very small portions.  Not impressed at all!The bus boy was more attentive than the waitress. I do not recommend it."}
{"text":"The food is really, really delicious. The only problem is their refusal to make any changes whatsoever to the menu. Because I'm vegan, there was nothing on the menu suitable for me, but there were plenty of options that looked delicious and would fit my diet if only one ingredient were omitted. They did make me really delicious spaghetti pomodoro, and charged a reasonable price (less than any of their pasta dishes on the menu), but it would have been nice to be able to try something a bit more...special. It was incredibly delicious though."}
{"text":"Great service, good food. Went with a large group and was served family style, was perfect and enjoyed by all"}
{"text":"We went there on a Friday night around 9pm and were greeted warmly by the hostess. The atmosphere is good and the music was not too loud (unlike Terroni on Adelaide). I had a feature cocktail which was basically a shanty, but it tasted much better, as it had grapefruit juice and limoncello. 

I ordered the seafood tagliatelle and my better half, the pizza burrata. The fresh pasta was extremely good, had the greatest elasticity and tasted great. The sauce was great too, not too salty and just enough to cover the pasta and the ingredients. 

The pizza was fantastic. It was an arugula pizza with cherry tomatoes and a big lump of burrata cheese in the middle that you have to spread it out so that you get some on every slice. THE CRUST WAS GREAT, BETTER THAN LIBRETTO! The cheese gave the pizza a salty-ness that highlighted the taste of the veggies on the pizza.

Warm chocolate cake and crème caramel to finish, both were fantastic.

Oh the olive oil served with the bread was so good that we ended up buying a bottle."}
{"text":"No matter where, Terroni has the best pizza! But we didn't come here just for that, the hub and I tried many of their wonderful dishes, and as usual with Terroni, we were very impressed by La Bettola.

We ordered:
a dozen oysters, yum!
cappesante e guanciale, amazing wrapped scallops!
funghi assoluti salad, a little too much balsamic but still good
olive ascolane (I hate olives but fried and stuffed like this it's pure heaven)
a pizza buffalina, best pizza ever!
agnolotti di manzo con burro e salvia, oh the butter ...
and frittelle di nutella con gelato, fried pastries filled with nutella OMG!!!

The portions are smallish which is good considering you want to try everything.
I loved the modern rustic decor, the ambiance is lively with a great music selection, and the service was great. The wine and coffee were also excellent. Only good things to say about La Bettola, and of course we will return!

BTW, I am grateful for their \"PURIST  policies\" as someone called them, because this is what makes Terroni great, they do not compromise on their taste. If you normally request substitutions, then this is not the place for you. Not to worry though, Terroni will continue to have lots of business. Make reservations, very busy!!"}
{"text":"Great service, better wine and even better food!  You will not be disappointed. The scratch made pasta and black truffles were on point. I'll be back."}
{"text":"Just came out of a business lunch at La Bettola di Terroni and I have to say that I'm a little confused! If we start with the food: As a starter we had an assortment of Italian cheese and ham. Being from the Mediterranean myself I'm used to high quality ham, salami and cheese and this was perfectly up to my standard. I can definitely recommend! As a main I ordered the Orecchiette con Burrata. The handmade pasta was perfectly al dente cooked. Presentation was beautiful; at the bottom of the plate was green pea puree, pasta topped with handmade sausage, and finally delicious Burrata and Pecorino cheese on top. 
When it comes to the service i unfortunately don't have much good to say. Initially the service was decent; the waitress presented the specials of the day and took our orders. Once we had finished our main dishes it took a while until she took away the plates but when she did she never asked if we wanted the dessert menu. By now the lunch rush had cleared and the restaurant was not that packed as at the start of our lunch. So we were all sitting there waiting for someone to offer the dessert menu but no one ever showed. In fact after a while we realised that we had to finish the lunch and go back to work. Foodwise I'm giving La Bettola di Terroni 4 stars. The service however is only worth 2 stars. This gives a total score of 3 stars. It's really a pity that a restaurant that serves this good Italian food does not have better service. It really brings down the while experience."}
{"text":"Honestly did not LOVE this place but I thought the venue was very nice. It's supposed to give an authentic Italian experience which I liked. It was definitely different from other pizza places so it was a pleasant experience overall. The server was also extremely attentive.

I came around 3pm so the lunch rush had just died down. I got a pizza (I forgot which one, I think it was pepperoni or salami). It did not taste like regular pepperoni that I'm used to and it was cut differently so I'm not entirely sure what it was as I didn't order. The pizza was the thinnest I've ever had. I usually prefer thin crust but this thin crust was hard to cut and I just didn't really like it...

The cannolis were wonderful and I was OT expecting the fancy presentation. It was very crispy. The cream inside was delightful as well as the pistachios on the ends. Very pretty dessert. Best cannolis I've had but I've only had them from Costco so I don't have much to compare with :-)"}
{"text":"Food is amazing, quick and authentic Italian. Service is great and wine list is diverse (but 100% Italian). We frequent this place because of the consistency and service."}
{"text":"You should always listen to your gut.  And my gut told me that after eating at Terroni on Queen, I had been warned.  I did my due diligence and read the reviews of La Bettola--a mixed bag it seems.  Let me begin by saying that Madeline, the hostess that booked my reservation was obviously doing me a favour by taking the call.  She was irritated that I asked if she was on the subway line.  I thought she'd slit her wrists when I asked how to get to the restaurant from the subway station.  There was a lot of sighing, with a tone that most clearly said, \"you are a nuisance\".  There were no \"pleases or thank you's\" here.   That should have been my first clue about the attitude of the staff.  After that, I phoned to  ask for a wine list to be emailed to me before my reservation as the wine list online has no prices.  This is one of my biggest pet peeves, btw.  I received nothing, until I called two hours before my reservation, again, and then did receive one.  

When I arrived, the hostess was pleasant and accommodating--the only nice thing I have to say about La Bettola.  We were shown to a table that was dropped into a corner.  A corner of what?  A corner where a party of 17 was sitting.  What does that mean?  The length of one wall was sat with half the guests, and the length of the adjoining wall was sat with the other half.  And our table was right in the nexus.  The table should have never been sat.  We literally had rear ends brushing by our heads.  Servers were whizzing by clipping parts of our body each and every time.  Their rear ends so close to my face that they were closer to me than my actual guests.  The guests from one half of the 17 top were surrounding our table, talking over us, between, around us to the other half of their table.  We couldn't hear one another at all.  We asked to be moved to another table.  Our choices were, sit at a bar table on a bar stool, or sit directly beside a party of 5 and share the table with them.  As in, my chair is directly beside a stranger, as we share a meal at a common table.  Neither of these options were suitable and so we waited for a real table to come available.  We waited 30 mins, without any server coming to our table.  At that point, I went to speak with a manager.  Remo.  Remo the manager was dressed in jeans and a flannel tee.  Very professional.  He never once apologized to me about our table until I pointed out that he never apologized.  His attitude was, we're busy, get over it, other people don't have a problem with this.  His actual response, \"You caught us with our pants down, what do you want me to say?\"  After still feeling like our complaints had fallen on deaf ears, I spoke with one of the partners.  His attitude was that he was trying to accommodate everyone--us and the large party.  My point was that our table should never have been sat in the first place.  That they should have left that table open and unsat because it was so close to the other table--almost touching!!  He maintained that he must fill his restaurant and others have no problem sitting there.  This may be true.  But I did.  And I'm not picky.  In fact, I'm a former server of 15 years, and know when something is reasonable, and when something isn't.  All I wanted was someone to say, \"You know what, you're right, this is a crappy seating plan.  We shouldn't have sat that table in the first place.  It's unfortunate that you and your guests are having a disjointed and unpleasant meal\".  Instead I got indifference and aloofness.  I will never go to any Terroni family restaurant again.  Okay, we had a crappy table, but management, do something about it.  Make your guests feel welcome, wanted, and appreciated.  We left after drinks and appetizers and went to another restaurant for dinner.   Embarrassing."}
{"text":"Last minute reservation. A table for two was meant for us. Five minute walk from the subway close to the theatre. Place was humming as people were coming and going.  We shared a plate of Pasta   Puttinesca and pizza. Portion for the pasta was more of appetiser size. It was delicious nonetheless. Staff were pleasant. They lost a star point with the washrooms. They had two toilets and long line ups, and not gender specific. Washrooms were not very clean.  Surprising as the resturant itself was very nice."}
{"text":"Place/decor is pretty nice. Im a big fan of Terroni in general. Came here for a work lunch and had the carbonara. It was only okay. I didn't think it was anything special and a bit too much pepper for a carbonara for me."}
{"text":"Had lunch here today for the first time.  Really loved the atmosphere as a cross between casual and professional.  For my meal I had the Italian sausage, with peppers as the anti pasta.   I followed that with the seared tuna course.  Everything was very good with the exception of the peppers, which I found a little oily.  I will return to try other items including the pizza which I have heard positive things on."}
{"text":"I love my college girlfriends and I make it a point to get together with them whenever I'm in town. We meet up to catch-up on the latest gossip that is our lives. This time 'round, the girls chose new restaurant, La Bettola di Terroni -- of the Terroni empire. Described on their website as hole-in-the-wall-esque; I prefer rustic, casual, cozy, communal, and relaxed for this \"market-centric\" alternative. Besides the familial ambiance, I'm loving the decor -- verses from Dante's Divine Comedy on the windows, a wall of magnetic letters for a simple but noticeable change, and another wall of just corks. I love corks and collect many of them myself. One day, I want a cork wall to match that of La Bettola's.

Their wine list is.. unique. Unique in the sense that no one at our table recognized any of the vino being offered. Wine snobs we clearly are not, but even still, many of the names seemed quite obscure. We were all intrigued. Thankfully our server was super sweet and extremely helpful. She matched our wine preferences -- a little sweet, not too dry, and Sancerre-crisp, and recommended the 2008 Insolia 'Suliccenti' from Sicily. It was light, refreshing and fit each person's palate nicely. 

My starter, the smoked tuna and sword fish carpaccio, was fantastic. The lamb's lettuce and shaved fennel tasted amazing with the orange and lemon citrus flavours. Light enough to start with on your own but also great for sharing with others, it's a must-try. For my main, I chose the evening's special, taglioni with sea urchin. I'm not really sure how to describe each flavour that makes up this fabulous pasta special because at some point I decided to stop thinking and instead, I chose my very pleased tummy over my head. BUT! If you enjoy sea urchin, this dish is for you. Not fishy, just creamy deliciousness and plate-scrape worthy. Last but not least, dessert. There's always room for dessert. We chose the Nutella doughnuts with hazelnut gelato after reading the Toronto Star resto review. My stomach, honestly and truly, couldn't have been happier. I love Nutella and I love doughnuts and even though this combination is nothing new, none of us could get enough. Three and a half hours later of college reminiscing, life gossip of boys, future travels, current jobs, et al, our evening ended with single espressos and very sad goodbyes.

I'm not sure if I'll be returning with these girls, but will gladly bring others on my next visit to Toronto. It's also a great date spot, for all you romantic darlings."}
{"text":"My first time to a Terroni's restaurant and I was not disappointed. Me and my friend wanted to try out Osteria Ciceri e Tria for dinner but tables were all reserved, so we decided to eat at La Bettola since both restaurants are connected.  The restaurant host was very informative about the wait time and options.

I like their interior design and I find it very unique from the other Italian restaurants in town. I ordered the duck breast with mushroom from their daily special menu and it was delicious. The waitress also recommended us with some good white wine to go with the food that we had. I will definitely go back to try out other dishes from the menu."}
{"text":"An interesting view of this place. On the one hand, they execute pretty simple Italian food well, the service is good and they've got something for everyone. On the other hand, I feel like I'm paying quite a bit for what I'm getting. It's easy to see the consistency and quality equation that I've experienced at the other locations. Makes a convenient lunch spot and it's very conveniently located if you're in the core, but you're probably not going to impress the discerned Yelper."}
{"text":"Hmmm this was my first time at a Terroni restaurant and it was certainly an experience I mean how can you go wrong with pasta??  Can you go wrong with pasta is the question!

Here's a run down of the good, and the bad:

Good:
- delicious fresh tasting pasta noodles
- servers are extremely  accommodating and kind
- servers were great with recommending items off the menu
- you'll get in on a Friday night, virtually no line and seated right away.

Bad :
- the lamb on risotto was $40 pretty pricing for the tiny portions! If quality is what the pricing relates to...its lackin!
- sauce on my spaghetti could have had more \"oomph\" as you see i ended up covering it in chillies to kick up the flavour. For $23 for a cup of pasta I definitely expect more!
- I get we are downtown but the dishes are pretty scanty with sides...i think a fresh salad and chunk of baguette wouldn't kill anyone, I was definitely not full!


Overall, won't be back nothing special to bring me back and I've had much better Italian at chain restaurants!"}
{"text":"I work nearby and I absolutely love this place.
My friends, who are regular customers at this restaurant recommended \" Burrata\" and \"C'T Mang\" to me .
 C'T Mang which is mozzarella, gorgonzola, walnuts, pears, honey, speck(smoked prosciutto) is the best pizza I have ever had!! I have never eaten such a pizza with pears!
Burrata, which is like creamy mozzarella , is served with cherry tomatoes and crostini (like toast) .
Staff members are also friendly.
I'd definitely return here."}
{"text":"I think the 3 stars review on Yelp is a pretty accurate reflection of the resto in terms of atmosphere, service and taste of the food. 

We weren't acknowledge by our server for the first 15 mins, no water, no \"I'll be with you in a min\", nothing.  On top of that, our dessert took longer than 25mins!  Waiting for more than 20mins for the best part of the meal (dessert) is just torture. 

As for the food, I didn't like the pasta or the pizza we ordered.  The clams pasta was too al dente for my liking plus the purée of chickpeas just didn't jive well with the flavour of the pasta imo. As for the pizza, I find the Salami to be too spicy for my liking and the cheese to be a bit lacking on the pizza.  The roasted Brussels sprouts and cauliflower salad was probably my favourite dish of the night. The Nutella fried pastry is just simply a fried dough with filling inside. Nothing special. 

This was not a satisfying meal plus the price is on the higher side so I'll make my rounds at other Italian resto in the city before I come back here again."}
{"text":"While in Toronto last year for TIFF, we went to La Bettolas sister restaurant for supper, which is conveniently located next door.  On our last visit we agreed, that the next time we were in the neighbouhood, we would give the other one a try.  This is a great restaurant to visit if you are seeing a play or musical, which we were.  Normally the quality of restaurants in the theater district are sub par, but we were quite pleased at La Bettola.  Their bar menu is very limited, if the Italians dont drink it then neither do you.  One girl that i was dining with wanted a caesar, they were unable to make it because they do not stock Clamato.  Also chardonnay lovers, you are out of luck, they dont serve that either.  We started with the Sword Fish Carpaccio: Cured and Smoked by Luca Topped with Orange, Shaved Fennel, and Pistachio with Lemon and Extra Virgin Olive Oil for $17.  Carpaccio is a tricky dish and you really only want to order it at a reputable restaurant because so many things can go wrong.  I loved the delicate smoke of the fish, i was so happy that it did not overpower the swordfish.  The fish had a wonderful uniform texture, and i loved the contrast with the crunchy pistachios.  The addition of citrus was perfect, it was one of the best raw preparations i have ever had.  It would be a sin to come to La Bettola and not order a pasta because all are made in house.  I ordered the Traditional Roman Dish with Pecorino Romano and Black Pepper, Served Very \"al Dente\" Chitarra Spaghetti for $17.  The \"al dente\" scared because  even though i am Italian, i do not like my pasta with a chew.  The waitress was very accommodating and asked the kitchen to cook it a bit longer.  If you love white pasta just with butter and cheese, this is the dish for you.  It was similar to a carbonara, minus the bacon, and with the addition of peppercorns.  This dish was fabulous, my only complaint was the heavy amount and size of the peppercorns.  For dessert we had the Fritters with Nutella and Homemade Gelato.  The gelato was creamy and perfectly smooth.  The waitress compared the fritters to an upscale crueler from Tim Hortons, she wasn't far off.  As good as they were, i wish there was a more inventive way of incorporating the star ingredient which was nutella.  The fritters were simply cut in half and spread with the Nutella, they were alright.  In total there were 5 of us dining, and we were shocked when they told us that they could not accommodate us by providing separate checks.  I find it amusing that i can go to my local pub, and get separate checks, and i cannot get that same service in an established big city restaurant.
Overall, i was pleased and surprised at how much i liked the food, but i simply cant forgive the fact that they do not separate checks."}
{"text":"TURN AROUND AND NEVER LOOK BACK!

You know a place is bad when you ask for chili peppers and dump it all over your pasta or fill yourself up with the complimentary bread. I remember telling my coworker- \"Might as well get the full experience and go all out.\" Based on the great reviews, I ordered the Chitarra Norcina - \"Truffles & Pasta with Sausage\" - for $26 before tax. 

When the pasta came, the portion was tiny; however, I still gave it the benefit of the doubt thinking it might be some fancy stuff.  After I took a bite, an episode of Hells Kitchen came to mind with Gordon Ramsay yelling at the chefs \"THIS IS BLAND - FOR GODS SAKE - YOU DONKEYS!\" I instantly regretted my decision and ate as slowly as possible since I knew a hefty bill was awaiting after this meal. Lets just say my coworker who chose this restaurant.... will never choose another one ever again."}
{"text":"Hip, yet authentic.  Had the funghi salad and seafood pasta, and ended with cannoli and cappuccino.  All outstanding!   I'll go back for sure!"}
{"text":"Very nice cozy restaurant, staff are so friendly and food is good,I ordered the pumpkin ravioli, it tasted good but a bit sweet for me. The beets salad is highly recommended.
Their wine is super nice Tasto di seta white wine.
It is pricy especially for the portions served."}
{"text":"This is a popular go to for \"higher end\" Italian food in the area. Plot twist: given the cost - the food is really not that amazing. Especially compared to the other Terroni just down the street on Richmond. 

We got a variety of pasta and pizza and if it was cheaper I would give it a 4 star but for $20... I definitely expected more. 

One thing that's worth getting here though is the dessert, the Tiramisu is very rich and very generous portion too!"}
{"text":"WHAT TO TRY?!

The pizzas and the pastas. This restaurant is a sister restaurant of the Terroni family. 

Specializes in house made sauces, pastas and pizza doughs, we tried the San Giorgio pizza and spaghetti allo scoglio. For the appetizer we had funghi assoluti. 

The pizza had many pieces of hot calabrese salami on top. Fresh mushrooms were the regular white button mushrooms. I thought they would use some other kind of varietal mushroom that you can't find readily at other restaurants so the pizza tasted alright. I didn't find the pizza interesting. In fact, I added some arugula from the funghi assoluti salad and it made the pizza taste so much better. 

The funghi assoluti was on the pricier side for what the dish consisted of. It had baked oyster mushroom which tasted amazing with the mixture of breadcrumbs, EVOO, balsamic vinegar and parmigiana but the dish itself wasnt worth the $16 to pay. 

The Spaghetti allo scoglio had abundance of seafood in the dish. But be prepared for the dish to be on the somewhat smaller side for $24. The sauce was light and flavourful though, and the spaghetti was al denté. 

LAST TIP?!

If you ever think of Terroni for dinner, this location is the least busiest and often can find seats on a Friday or Saturday for dinner. Perhaps because not a lot of people know this restaurant is also in the Terroni family."}
{"text":"I'm not sure I understand why there are so many negative reviews of this place.  Terroni does such a great job on their food - and I would never want to change it or dilute it!  The waiter we had also was super friendly.  

La Bettola seems to be a more compact version of Terroni in terms of its menus, maybe for the business crowd?  The food came out in record time, and was delicious.  

I ordered the papparadelle with lamb, which was super good!  I love their wine list too - some really obscure wines from Italy that you would never find anywhere else.  

The salted caramel budino was fantastic - a little bit of crunch, and very creamy.  I will return!"}
{"text":"We went to this place mid-week for lunch. Place was packed. I like the decor - modern with lots of rustic design elements.

I ordered the fried calamari and the seafood pasta and finished off with the tiramisu. The calamari was excellent. The pasta dish was OK. The tiramisu was good. And oh, they have this tiny, little bottle of peach nectar. Don't think I've seen it anywhere else. It's really good - but it's literally only a shot of peach nectar! Lol

The Good
- fried calamari appetizer was my favourite part of the meal
- tiramisu is good
- peach nectar is really good (Why don't all restaurants find unique non-alcoholic drinks like this??)
- service is friendly and efficient

The Bad
- pasta dish was OK at best (wouldn't order it again)

I would go back just for the calamari and the peach juice!"}
{"text":"The worse customer service I ever had in my life!!
Food was ok, missing flavor but I can tell was homemade, also food came really fast (thank you for that!) But hour waitress made hour night really uncomfortable, we have to eat with Water because our drinks never came even though we kept asking for it, I had to cancel mine because I was done with my food, my husband and friends got it late and the second and third round was the biggest challenge of the night, I have to stand up to find more sugar, etc.
She said sorry by the end of our dinner and she said that will make it up next time we go back.... how can she think that we will ever go back????? No way!!!
We will never go back to that place, I like to spend money to have a good time not a bad time."}
