{"text":"I must admit that we did go often to this place mostly for the atmosphere because their food never was anything special. So, we pay for the atmosphere at the Habs games.

This past Saturday was different! And that it not at all positive in this case. My friends ordered 2 blitz hamburgers! We ended up at the hospital from 12 pm to 10 am  in the emergency room for which appeared to be food poisoning.

They are some lucky people because we had left the bills on the table and consequently did not have any proof that we were there to file a report...

Advice: If you want to be healthy for the night, just find another place to watch the game!

Sincerely, survivors of 2015"}
{"text":"I enjoy coming here for a drink, and eat out with some of my friends! I usually order a dos equis beer glass(rarely I usually order 2) and I love ordering the buffalo wings. The management probably changed, the decor that I used to see for the last few years, are gone and service has slightly slowed down for me the last time I was there, but the wait was worth it tho"}
{"text":"Cages' menu has completely changed since the last time I ate there. I had the beef tacos and they were real good. Not quite what I expected from a franchise such as Cage. I recently learnt that they carry Murphy's which is better than Guinness  (my opinion) which is also hard to find if you don't live in downtown or Saint-Henri."}
{"text":"Good spot to get out of the hotel. Food is better the earlier you get there. Many different selections than what you get in the states. Good variety of beer and drinks. Friendly staff."}
{"text":"They have moved to a new location on St.Paul street. Very nice place, too bad the food and service is terrible."}
{"text":"Just went to watch a game that is being broadcast on local television and the waitress said there was no way change the channels.  A couple televisions were not being viewed by any other patrons so this would not have conflicted with any previous requests. The manager refused to speak with us when we asked to talk to him/her.  The hostess was polite but we ended up leaving perplexed."}
{"text":"Does lean on the restaurant side of the sports based restaurant/sports bar scale. Food is not cheap but pretty damn good. Just a colossal amount of screens, most tuned to RDS. They are a little reluctant to kick the sound over to a game unless the Habs are playing, and when they do there is a very annoying delay between the video and the audio signal. 

Still, I went there about three months ago to watch the Barca/Gunners CL match and the game was on with the audio, and it was fairly pleasant. There were only about 8 people around the bar watching the game, which indicated I probably picked the wrong place to watch football, but the bartender was nice and closed the blinds which glared the screen a little bit.

Walked past it as the Habs game was starting. Good god. I imagine it is harder to fit into than the actual Bell Centre. That was the night of Pacioretty hit; I feared for the few Boston fans that actually decided to watch the game there."}
{"text":"This was my first time at this location and I'm not happy that I decided to come here again. The service at this restaurant was great, but the food lacked. The spinach dip was good, but my club sandwich was very dry. The side of poutine was luke warm and the cheese was not melted at all. I am not sure if I will come out to this location again."}
{"text":"Belle terrasse dans le Vieux Montréal. La bouffe est ordinaire comme dans toutes les Cages aux Sports. Les amateurs de fritures, gros hamburger et gros steak vont aimer."}
{"text":"2 stars just for the roof top. Great place to sit and relax on a nice day. Drinks are pretty bad. We tried the red sangria and it was the worst sangria that I had ever. You may drink a bottled beer and enjoy your life without worrying about the taste."}
{"text":"good place to grab a few beers and a meal before the game, atmosphere is excellent, very good service, meals are kind of plain, frozen fries and such, but what I expected - you can't really have a huge menu in a restaurant connected to the Bell Center on game nights - the kitchen staff would never be able to keep up.  Prices are a little higher than most of the other pubs in town, but it's a good place to go before a game."}
{"text":"The only good thing about the Cage Aux Sports is it's atmosphere, terrasse and most of the time service. But, as a restaurant (and that's what I'm rating it as) it's pretty bad. Everything is tasteless and plastic. The burgers, meh. The chicken brochettes and a weird yellow and ... plastic... even the complimentary popcorn tastes bad. 

If you're going for sports and a few beers with the food being a side issue ... CAS is a nice place to be. But, if you're going to CAS for food... don't."}
{"text":"Endroit à essayer les soirs où le CANADIEN joue, super ambiance hockey -  GO HABS GO - en ce qui concerne la nourriture c'est normal sans plus .... Pizzas ou Burgers .... Bière et hockey un trio gagnant ..."}
{"text":"2 stars is being generous. 1 star is for a great location in Old Montreal and the other star is because my wife likes their salt and pepper chicken wings.
It fails at being a sports bar. Sure they show a few games but they simultaneously pipe in Whitney Houston and Celine Dion greatest hits over the sound system.
Food has no imagination, variety or taste.
Service and management are very weak.
Have had several issues over the 5 times that I have been there with no satisfactory resolutions.
Waste of a great location in Le Vieux Port!"}
{"text":"We were in Montreal to attend the Women's World Cup, and being an American, needed a place to watch the USA play one night. We had a negative experience at a different sports bar, so when we asked Cage Aux Sports about the game, they said they would definitely have it on and asked us if we wanted to make a reservation, then showed us where they would seat us the night of the game. That night, some of the other games were getting poor reception on their satellites due to rain, so one of the managers (I assume) came over and told us that she'd specifically put the USA game on cable for us instead of satellite so we wouldn't lose service during the game. 

The actual dining experience was great - our server was attentive (and quite busy that night due to the multiple groups of Americans in attendance) and had no problem doing separate checks for everyone. The food was good, the drinks were good (the sangria in particular was great!), the free popcorn was plentiful...

All in all, we were quite happy with our experience there and highly recommend it to anyone from out of town wanting to watch a game."}
{"text":"Its a sport bars.  Great venue with a bunch of TVs so you always have a view.  

It is pub food and well priced."}
{"text":"Ordered some drinks! Service was miserable as well as the drinks! I paid a lot for a water with some mint leaves ? disappointment on every level"}
{"text":"Great place to watch the hockey game.  Plenty of TV's with great staff.  

I recommend the Poutine and any of the burgers.  This is pun food so I would try to get fancy."}
{"text":"Mediocre food, but great service. Lots of comfy seating with great views of different TVs and games."}
{"text":"For a sports bar the food here was pretty good. Like many restaurants in Montreal the service is slower, very much a European style. I had a meal deal which came with soup, entree and dessert. Everything was good. The vegetable soup was pureed which was unique and tasty. For the entree was chicken kabobs with rice and mango sauce and for dessert was cheesecake, both very good and filling. Prices are pretty reasonable too and the location can't be beat; right in the center of Old Montreal."}
{"text":"I give this 5 stars because it met all our needs: a place to watch the NBA finals and the USA V Ecuador Copa America match, drinks, and great atmosphere for our first night in Montreal. I got a 9 oz and then 5 oz Kim Crawford and he got 2 Heinekens. With tip, it came out to $55 CAD. La Cage offered such great atmosphere that I would recommend it to anyone looking for an upscale sports bad in Montreal."}
{"text":"Because zero stars aren't an option this restaurant gets 1 star! Horrible service and cold food! Begged for popcorn and more drinks but ended up leaving. It wasn't crowded at all. Flagged down the waitress several times but it wasn't worth the effort. Worst food in Montreal!"}
{"text":"We'd like to preface this review that we did not eat dinner here.  We ordered drinks and dessert. The dessert (a baked cookie with ice cream) had an overly processed and 'teeth hurt' sweetness. 

However! We had such an incredible waitress who was so friendly and genuine that we had to add stars. She helped us with great suggestions for our weekend in Montreal and was such a joy to meet. The extra 'unique' flavored shots she gave us on the house was a special treat, too!

Lastly, the ambiance was lovely for an outdoor night cap. Very enjoyable experience!"}
{"text":"Eh! Nothing fancy! Good for kids with popcorn and a good kids menu. Ordered the ribs and chicken combo. Got 3 ribs and a chicken leg! Fries were nothing special. Nothing jumped out as being great but I would go here again!"}
{"text":"Would not come here again unless I wanted to watch live sports. Food is subpar (who doesn't roast jalapenos on nachos?!). The service leaves something to be desired. 

On the plus side, it wasn't too crowded when we went in. Con, it still took very long for us to get the one appetizer we ordered."}
{"text":"So I've been there just do join some people and we shared a pitcher, nothing more. The waiter was quick and really friendly, the burger and the poutine of our fellows looked gread and they said it's amazing, and the beer was not bad at all, we took the lager. Good atmosphere, maybe I'll try the food someday myself. The other references are pretty bad which makes me think about not going again. Nothing special tho, but not bad at all"}
{"text":"The only positive thing I can say about this place is that it has a decent selection of beers. The service ed okay, the layout is very congested I couldn't even get into my seat without bumping into other diners. The food was mediocre at best. Very bland without even a hint of seasoning, seems to cater to American tourists."}
{"text":"Great wings especially now that they are bigger. 1/2 price wings on Thursday is worth it. All other food is mediocre at best."}
{"text":"Service was excellent. Food is good, but only one hang up. The Ceasar salade came in full leafs of lettuce, this is my first time not getting my lettuce chopped. I appreciate that this might be a way of being unique from the next restaurant but a pain in the neck trying to keep the lettuce from flying off my plate as I was trying to cut it. I joked with my daughter the cook was just to busy to chop the lettuce. 
But in all its a good place with an excellent atmosphere"}
{"text":"Your average sports bar. Good for watching games and hanging out. Have a full bar and limited beer selection. Not bad for the occasional stop in to watch a game but wouldn't go back for any other reason"}
{"text":"un restaurant tout à fait sympathique situé au Centre Bell.
le service est agréable, la nourriture est de qualité, les prix raisonnables.

une ambiance sport avec retransmission de matchs sur écran géant (hockey, soccer, etc...)"}
{"text":"This is actually a very nice restaurant inside and has a great location. It's a pity a good restaurant doesn't take over this location as the food is mediocre and the service is awful."}
{"text":"The new york steak was good and it is a really nice place to hang out and there's a free popcorn"}
{"text":"We really enjoyed sitting on the patio for lunch, the view from atop is quite something. I had the salmon ciabatta and, even though they got the order wrong at first, it was an enjoyable meal. The fries were somewhat of a disappointment unfortunately."}
{"text":"We are from California visiting Montreal. We like this place because they have lots of TVs, beer is priced better then most places for what you get and it's clean. I would compare this to a Fridays or some other chain in the US. Food is consistent but not great. Your typical cheeseburger or ribs kinda place. I wouldn't eat dinner here. Just a good stomping ground when you are new to the area trying to get a hang of things. Service isn't great upstairs. Much better service in the bar."}
{"text":"For a sports bar this place was very nice inside and I like that they had an upstairs level that was outdoors but covered by giant inverted umbrellas. Also from the upstairs, the middle was all open to the floor below. Good selection of food too. We had the melted Brie cheese with sweet pepper jelly"}
{"text":"Busy place on Sunday night... there menu looked different so we decided to try it...
very friendly staff..
They have bar food with a bit of Asian twist that I thought was pretty cool.
We ordered 2 sets of finger food platters: tacos with cabbage, mini burgers, Asian fried chicken nuggets and shrimp. It was weird combination but it worked... everything was balanced perfectly...very fresh..
the only problem it was small... enough for me but not for my bf.
well...more space to try different foods.."}
{"text":"I only have ONE word to sum up my experience from La Cage aux Sports: 

Diarrhea.

Yep."}
{"text":"It is a sports bar that hopes to get the tourist rolling through old Montreal. It is not bad, so don't look at the 3 stars as to say to avoid.  They have a great selection of pouten, or however they are spelled.  They were actually the star of the show.  The rest was just over priced bar food that was noting to write home about.

The shop itself is very cool and the sorted screens through out make it easy to catch something of interest."}
{"text":"VERY VERY FRIENDLY WAITRESSES AND WAITERS. I never got a \"bitchy\" staff member serve me and we always end up laughing together and having a great time (yes, with the staff). I was told it's because most clients are rather cold to them and I'm one of the friendly ones but that's to be expected in a bigger franchise of bars.

Free Popcorn and 4$ infinite refill iceteas are amazing. Decently priced food, not spectacular but nothing big.
The TV set ups don't cover all the seats in the bar and that's honestly quite frustrating. My friend practically got a neck cramp trying to watch UFC 168.

I was sadly told from a VERY RELIABLE source on staff that they recycle cole slaw... Now THAT is fucking disgusting. I do not know nor will I ever reveal if the staff member is still working there or not. I do not know how they recycle the cole slaw but I'm never touching that part of my meal ever again."}
{"text":"Enjoyed the lunch and beer.  Would recommend if staying at the Nouvel Hotel.  It is walking distance."}
{"text":"Always been and always will be The Cage Aux Sports! You expect good service, good atmosphere, vibe and overall experience. It does not have the best food in town, but it has something for everyone! It has value and expect to get a nice, fun, and good time. 
A family friendly place, and a nice place to hang out with friends after work !  
Have a drink and free popcorn! Note: if it's a hockey night then you would expect a crowded place."}
{"text":"How can the Cage au Sports food be better coming from the frozen foods section from the supermarket than directly from the restaurant kitchen? Ordered chicken was not estable bland and super dry, lousy fries and a decent cole slaw. Up side free refills on soft drinks. Expensive too."}
{"text":"We stayed near the airport, so this was a convenient place to visit.  Interesting to see the local, fancier version of the American sports bar.  Friendly service, and a nice variety of poutine, burgers, and beer."}
{"text":"Cool si vous êtes un amateur de sport. Personnellement, ce n'est pas mon genre d'endroit, mais quand j'y suis allé, j'ai pris les nachos et c'était délicieux ! Je n'ai pas aimé le fait que la serveuse se plaigne du fait que je ne lui avait pas donné 15% du pourboire en me faisant une scène (pas très pro), car il ne me restait vraiment plus de change (sorry) !"}
{"text":"Food was excellent bacon and fig sandwich and a hot chicken sandwich for lunch
2 different stout beers for desert

Staff was very friendly and helpful"}
{"text":"Bar de sport, plus adapté a un 5 a 7 qu'a un repas gourmet.
Le lieu fait partie d'une chaîne de resto/bars sur le même concept. Des grands écrans partout avec du sport et de la bouffe réconfort de type américain avec des burgers. Il y a aussi des tartares mais c'est pour de plus petites faims.
Nous y avons pris quelques cocktails, certaines copines ont commandé des plats et j'ai commandé juste une entrée. Je ne suis pas fan de bouffe américaine.
Le staff était sympa et comme nous étions en basse saison le lieu n'était pas bondé donc pas excessivement bruyant."}
{"text":"Un restaurant de la chaîne très connue.
L'endroit est très grand, comme la plupart des succursales et la plupart du temps assez propre (si on oublie le plancher recouvert de pop corn durant les soirées les plus achalandées). L'ambiance festive lors des diffusions de matchs de différents sport rend le restaurant affreusement bruyant, mais lorsqu'on y met les pieds, on s'y attend bien évidemment. 

Le plus gros problème de cet endroit est le service inégal. D'une fois à l'autre, on sera accueilli par des serveuses à l'air plus que bête et parfois par des employées beaucoup trop amicales (du genre qui se mêlent des conversations des clients), ce qui rend l'expérience un peu désagréable. Parfois, les plats prennent l'éternité à arriver... Pas très commode pour les affamés! Côté prix, je trouve la nourriture assez chère pour la qualité et la quantité.

Si vous êtes un mordu de sport et aimez les restaurants animés, la Cage aux sports est définitivement pour vous!"}
{"text":"Pros: Great sports bar. Tons of TV's. Cute waitresses. Attached to Holiday Inn. 
Cons: The wings are the smallest i've ever seen."}
{"text":"Can't say I enjoy the place, but it was the only sports bar/pub open on January 1.

Terrible glare on TV's meant we could barely watch the game.

Horrible sound system at the booths/tables (a bit better at the bar).

The food is decent after a recent corporate overhaul and the service is pretty awesome.

The Montreal Canadiens scored 5 goals at that game, so we got coupons for 8 wings at the next visit.

This time, I sat at the bar, better system, wings were awesome, they had many food and drink specials and I was much happier."}
{"text":"After wandering around the famous St Paul street we saw that La cage had a rooftop lounge so we stopped in .We ordered 3 different appetizers,  flatbread , 3 fish tacos and potato skins,  all were excellent and the service was excellent as well. A nice addition was plenty of Tv's for watching sports if you are into that. 
All in all a first rate restaurant with some nice people watching on the rooftop lounge onto the famous St Paul street."}
{"text":"La Cage aux Sports is a very typical sports bar (on the good end of that spectrum) with a Quebec twist.  There were TV monitors with sports on it all over the place.  Of course, there was hockey on everywhere, as I visited in November!  Go BRUINS!  Ha!  They had some very cool lights made of hockey sticks and other ones made out of kegs.  Kudos on the decor guys. 
 There were a lot of good beers on tap ...and they had more than a few locals.  An A grade for this.  I had an exceptional server with a really good attitude.  I would give a shout out to my server if I remembered her name.  This location is close to the airport and near an office park I was visiting for business.  I would do La Cage aux Sports again if ever in the area."}
{"text":"Came here twice to watch sporting events during our visit to Montreal. The first time, it was actually quite good. The burger was perfectly cooked, and service was excellent. The second time, the burger was hockey puck overcooked with a bun so overtoasted that it was stiff, and service was mediocre. Seems hit or miss."}
{"text":"Let me start by saying that if I wasn't staying at a hotel within walking distance I would have never been back. The ONLY thing that did bring me back was the Rickard's Dark beer on tap.
Food......2 stars
Blonde girl on Thursday that paid more attention to her boyfriend sitting at the end of the bar than the paying customers...............1 star
Anna......5 stars

Save your money and your time and go somewhere else!"}
{"text":"Going in fully aware that it's a franchised sports bar \"brewing\" commercial beer aimed at the suburban crowd, I was pleasantly surprised that the Blitz burger was not only decent in all aspects but quite tasty. The patty is thick, made on-site with non-frozen ground beef and grilled to about medium-well. Great chewy texture without being hard and lightly seasoned. The shredded iceburg looks sloppy but it's not a mess to eat. Everything else in the burger (American cheese, bacon, onion, tomato) paired really well together, so was the sauce that didn't overwhelm the whole thing. I have so far had three of these with promotion vouchers. I got to say, making a classic unpretentious burger, consistent in quality, is quite a rare find. This certain beats the burgers you'll find in some BBQ joints in Montreal.

Service is as expected.

Beer choice: not a brewery despite the restaurant naming itself as such, so expect the usual commercial stuff on tap.

There is also a large outdoor terassse."}
{"text":"Not sure why the rating is so bad. We live nearby and come here as regulars. They did a recent renovation and the place is now more industrial and futuristic (because of the screens) than before which was more family/country feel. 

They have great & large beer selections. Menu is also regularly updated so you get to try something new from time to time. This past winter we came here more frequently thanks to the Habs awesome performance and free wings. The 911 chicken wings have been my all time favorite."}
{"text":"Les soirs de match réservé absolument une table !!
L'ambiance sera aux rendez vous \"Go Habs Go\"
La bière est loin d'être mauvaises. Manque de bol nous n'avons pas pu avoir de girafe car toutes utilisés. On s'est même demandé si il ne fallait pas aussi la réservé !
Et lorsque que vous voyez les plateaux de nachos passez devant vous vous n'avez plus qu'une envie vous jetez sur la carte. Nous c'était Blitz pour toutes la table et c'était divin. 
Popcorn en libre service et ça c'est franchement sympa. Bon avec tous ce beurre ils risquent de prendre de la place !
Le service super sympathique.
Que demander de plus ?"}
{"text":"My wife and I stopped in here for a few drinks when we were wandering around Vieux Montreal. It was one of the few bars in Montreal that has lemonade as a mixer. Service was fast and courteous."}
{"text":"In town from Portland, OR USA. Stopped in for a quick beer with my business colleague after attending a conference at the Palais de Congres. The next day, my colleague realizes she no longer has the credit card she used to pay for our beers the day before. Checked her bank account online and discovered that it was being used at La Cage where we had been 24 hours earlier. Raced over and contacted the manager, Louis, who immediately tracked down the receipt of those who had used the card, found what table they had been sitting at (20 minutes earlier) and who had waited on them. As it turns out it was two 20-something French - Canadian women - Shame on you two thieves!!

The manager and the waiter who assisted were outstanding. So....although we did not have food at this establishment I want to recommend La Cage solely on the \"service\" provided by Louis and his waitstaff. Exceptional! Thank you Louis!!!!"}
{"text":"Well here we go again with the steak craving. My wife and I had headed down to get my fix, and when the restaurant we wanted to eat at was full (just got in town, no reservations made) I knew we had to move fast. Here in lies the cage, there was a line up, nothing crazy, just enough to indicate a positive vibe, menu was posted outside, again a plus, liked what I saw. Once greeted at the door, NOT enthusiastically I might add,  we opted to sit inside due to the fact it was +40c and extremely humid. Once seated, it took some time to get menus,  again by someone else looking like they did not want to be there.  Also the inside was almost as hot as outside, and I had overheard others saying the same.  Now contrary to other reviews, the food was actually good, and served pretty fast, I had a steak with fries, and my wife had the ribs with baked potato. One thing is the portions could have been a little bigger,  they weren't terribly small, but for the price they could have added another side. 

So over all it was good, flavor good, quick service and free popcorn. But I hate eating at a place where almost all the staff looked like they would have rathared been elswhere, and you sweat just as bad inside as you would on the patio."}
{"text":"Walking around St-Sauveur and it was cold and time for lunch so I suggested La Cage Aux Sports for a Hot chicken dish.  This Cage is located in Les Galleries des Monts, across from the SAQ.

  There's an old red Telephone booth out front, in working order.
  There are cages on the railings that give this place a more masculine feel to it.
  There are TVs around for all the precious sport matches, there's even a schedule and Club Cage Membership VIP to stay current on events and win prizes ( check out the website for info)
  
  The Midi Sprint is offered at lunch 11:30-2 PM . You get a soup of the day and a soft drink (bottomless) or a coffee. And 1$ off any dessert \"à la carte\".

  My man had the chicken noodle soup and ordered the BBQ Half Chicken, it comes with a side he ordered the Baked Potato, they offered toppings to dress it too.  There's a little pot of Gravy to dip the Chicken in, I think it's a gravy mix pre-made, typical gravy. The chicken was good and tender, this was a good dish here, just nothing out of ordinary. A coffee later on as the beverage.

  I ordered the Caesar Chicken salad, I have no idea why, it was for romaine, Parmesan cheese, croutons, and garlic cheese bread for 14$ so not worth it.
 
 There was one waitress running the show, but it's more than enough it was just us , and two other couples max so the waitress did a good job filling waters and menu questions, and check.
 
 I think there are better local spots for BBQ chicken, but I'de come here to watch Sports they have the Pay Per View Events on the TV."}
{"text":"Best burger of my entire life. No joke. So juicy. Get the Brie and mushroom angus burger!"}
{"text":"Un peu cher pour ce que c'est ... Le cadre est agréable sur la terrasse.

Les burgers sont un peu petit mais pas mauvais."}
{"text":"We went a few times while staying in a nearby hotel. We had great service and good food each time. The restaurant itself is beautiful and open."}
{"text":"Toujours plaisant comme endroit ! Le staff est vraiment souriant et une grande sélection de bières ! La terrasse est déjà ouverte, faaaaa beau donc c est un choix gagnant, surtout depuis qu ils ont changé leur menu.
La cage, steak poulet côtes levées !"}
{"text":"Great place to meet up with friends for a sporting event. Free Wi-Fi and popcorn, and friendly staff keep us coming back. The food  is generally good, but not always consistent. If I order the same plate twice in a row, it will be presented two different ways. Out of all the La Cage locations in the Montreal area, this one is the best. There are private rooms for parties, and two large outdoor patio seating areas. When it's hockey night, it's time for La Cage!"}
{"text":"Late Sunday night two hungry guys after a full travel day. All the venues near our hotel are either closed or closing. Off in the distance Cage aux Sports beckons. Yes they are open and the kitchen is open! Big screen TVs all around to watch the Pens Rangers game. We sat at the bar and received excellent service.

Food was better than average (good) and the diverse draft beer selection was well appreciated. Our bartender was more than helpful with our menu questions and made sure we were never thirsty!
Great sports bar!"}
{"text":"We wanted a bar to watch the West Coast hockey games and found this place open late. It worked. We saw a period of the Kings and had some cold beers on tap.

Selection was limited but sufficed. I opted for a Molson over a Coors Light.

Staff was friendly enough.

Their TV screens were great and they have many, including a huge one up high. We were able to watch the game easily.

What was unfortunate is they closed a bit on the early side because we wanted a break in ordering. Next time, we'd just keep ordering.

If you're staying in the area and want a sports bar, this works."}
{"text":"Underwhelming to say the least.... food was fine, but you could definitely tell that it is a chain restaurant. Service was good, but the policy of sitting only parties of 3+ in a booth seems a little ridiculous, considering after we were seated at a table for 2 (asked to be switched to a booth, and told no) that they continually filled 3 more booths with only parties of 2. If you're going to make a policy, make it uniform. 

Overall: would not recommend"}
{"text":"I was very underwhelmed by this restaurant.

On a recent trip to Montreal, we were very hungry around mid-afternoon, so decided to check this place out for lunch as it was nearby. 

Our server came over fairly quickly to take our drink orders, but it took over 20 minutes before she returned after dropping off our drinks to take our food orders. Considering how hungry we were, this was not a great start to our experience here.

We started out with an order of the homemade chips to tide us over, which were actually good.

For my meal I ordered the chicken caesar salad. My family ordered a variety of sandwiches, salads and chicken tenders. The menu was pretty typical for a sports bar.

I am going to be honest, the caesar salad was one of the worst caesar salads I have ever eaten. It had bacon on it, which sounded good, however the bacon was chewy and undercooked with a strange flavor. I did not like the flavor of the dressing. The only good thing I can say about my meal was that I liked the cheese bread that came with it. I could barely eat the salad, though. 

My family felt the food was average to below average as well. I think a lot of the food had been frozen. The one thing that they liked was the poutine.

There are lots of good places to eat in Montreal, I would not recommend choosing this one."}
{"text":"What more can you say about Chicken and Ribs?   I usually go to watch the UFC events or any Boxing Pay for View event.  They are one of the few places in Montreal you can get Creemor on Tap, add the wings, and a great event.  What more can you ask for?  oh, ya, dont forget the free popcorn."}
{"text":"Wow! I can't believe this place only has 2.5 stars! I would consider it a solid 3.5 star place.

Gorgeous inside with tall ceilings and cool works of art with hockey sticks and beer keg lights. Huge tv's everywhere showing many channels. Would be a great place to watch sports, DUH!

Came in alone as I am traveling for work. Sat at the bar. The bar was pretty empty and my server was not that attentive but if I stared at her long enough she eventually came over. 

I ordered one of the local beers and a blitz burger. Fries were \"artisan\" but lacked seasoning and server was slow to bring salt and pepper once asked. The burger was a \"three star\" burger. It had a nice aioli type sauce. They didn't ask me how I wanted it cooked and it came out well done. Not sure if that's a Canadian thing but I would have preferred medium. 

With a different server, definitely 4 stars. All in all-  fair prices and an enjoyable experience."}
{"text":"Went there a couple times, the food is good, as are the prices. Losts of screens to watch sports events, great atmosphere."}
{"text":"It's a sports bar, but that doesn't mean the staff have to be half-a**ed and not give a s**t.

Our server was rude right up to the point where my girlfriend spoke French. It's Montreal, don't pretend like this is the first time you've had people speaking English. This is located in a touristy area (Bell Centre, Train Station nearby...).

The nachos are supposed to have bacon on them. Ours didn't seem to have any, so we asked. We shouldn't have bothered asking - we were treated like idiots for asking. We eventually found a few crumbs of bacon. Don't describe the dish on the menu with bacon then have brush us off because we couldn't find any.

Scratch that - we found two chips with hints of bacon.

Thanks for the free popcorn...that was the highlight. 

Again, this is just a sports bar and not a good one. Go elsewhere. This place gets business because it is a chain and has a notable name. 

I guess the beer was cold...they got that right."}
{"text":"Waited for 100 minutes and still could not get seated. Granted there  was 11 of us and 6 kids but we were told 20 mins, then another 20 and then another .By the time 100 minutes came along, it was time to go. Real waste of time and it is just poor that had I known, I would just have returned another time. It was a Saturday but I was really put off and although I have been before, the food is not worth the 100 minutes wait and pretty much any restaurant isn't unless it a 4 * Michelin establishment. Very disappointing"}
{"text":"Always trust your fellow Yelper, I didn't. 

Reading trough a lot of review for places to eat I wasn't really sure what I wanted to eat but my company wanted to have some \"barish\" food, if that's a category. So we settled for this place because of the upstairs balcony, getting us away from the mass of people on the streets. 
This was a good idea and also the reason why I give this place 3 stars instead of 2, the only reason. 

So a nice place to sit and you could barely hear the clubmusic that was blaring at the place. 
Ordering in a drink each to start of our meal, all of them wear waaaay to sweet for any of our liking, especially the white sangria and the raspberry Collins. But they were cheap, so hey, you get what you pay for? 

Ordering in food I went for the salmon, apparently new on the menu. Asking if I could switch the mashed potatoes to some sallad of sorts, that'll be extra she said. Sure I'll go for that. But I like my fish on the raw side, for me it gives it a bit more flavor so I ask our waitress to barely cook the fish, like just flip it to both sides and we're good. I want it to scream when I put my fork to it. She didn't seem to care at all, simply giving me a nod and strolling of. The rest of my company ordered in tacos and a burger. 

Waiting time, not to long at all, considering the place was full it was actually good! 
At first sight it looks good, it actually seems like the fish isn't overcooked and I got a small sallad on the side. and all the other food looks great as well! 
You know how, if you don't have enough time, you just kind of defrost some fish in the microwave or in a hot bath, well, that's what it felt like they had done with this fish and then not fried it at all... So that resulted in the dryest piece of fish I've ever had, and mind you, there is no sauce of any sort served to this. Not a pleasant experience. 

Apparently the burgers were good but the tacos unsatisfying. Like previous reviews, if you go here ask for a burger."}
{"text":"You know a burger is bad when you take a bite and think to yourself, \"Wow. I've had hospital food better than this. In fact, I've had vending machine hamburgers better than this.\" I'm not exaggerating. 

We wanted a quick, simple pub grub meal for our last dinner in Montreal since we have to be up early in the AM. Since La Cage Aux Sports is right across from our apartment rental, it seemed to fit the bill. 

We should have known when we walked in on a Friday night at and the place was COMPLETELY empty, save for two middle aged guys holding up the bar. Husband and I chose a seat at the other end of the bar, and upon sitting down noticed that most of the bar was dirty with crumbs and wrappers. I'm not sure why the bar would be so filthy considering there was nobody in it, but... okay. 

I ordered the Prime Rib burger. The burger had many flaws, but the most grievous sin was that it was burnt. Seriously burnt black. It tasted just like the kind of burger you'd get in a vending machine: the bun was your typical super-soft wonderbread kind, and the meat was standard factory-issue. I don't know why they would call it a Prime Rib burger when the beef had none of the juiciness or flavor of prime rib. It tasted more like the burgers you get in the frozen food section in a bag of 10 patties. I'm not above digging a Costco backyard burger, but burning it into a lump of charcoal is unforgiveable. I ate three bites, which is amazing for a girl who can eat practically anything. 

My husband ordered the Hot Chicken Sandwich, which were two pieces of thickly sliced white bread (also of the spongy wonderbread variety) with chunks of chicken in between. The sandwich was then covered in gravy and then topped with peas. The bread-chicken-gravy monstrosity itself was barely warm, but even worse, the peas were cold and mushy. So. Very. Gross.

Despite these huge shortcomings, the bartender/waitress was really nice (though mostly absent). Being tourists, we didn't have the guts to send the food back, so we just left our entrees mostly uneaten and hightailed it outta there after finishing our drinks. 

Dinner ended up being cookies and chips from the Couche-Tard a couple of blocks away. Sad to end our great Montreal culinary tour on a bad note, but all the other awesome meals we've had here made up for this giant dud."}
{"text":"This chain delivers when it comes to TVs screens to watch sporting events. Otherwise, the food and drinks are nothing to get excited about. If there's not a major sporting event and you happen to find yourself in this bar, you've made a terrible mistake because there are sooo many other great places in montreal (and even old montreal) to grab a bite to eat. The marketing here is based about large cold Budweisers, chicken wings and beer. The food is okay. The atmosphere can be amazing when it's packed. The place is huge and boasts a two levels with an outdoor terrace."}
{"text":"Went for lunch. Good portions and lunch specials include a drink. 1/2 off bottles of wine on Wednesday's-- highly recommend. The fish and chips were crunchy and the homemade tartar sauce perfectly complemented the dish. Great atmosphere and would be perfect to return for dinner and drinks on their second floor terrace."}
{"text":"Wow...RUDE staff.  A waiter walked by and spilled a dirty plate of something all over my white coat.  When I said something, he just blankly stared at me and asked me what I wanted to do?!?"}
{"text":"They got us right in at this half-empty restaurant. With our waitress at the table next to us, we sat and listened as she wrote down a list of bars and strip clubs for men planning a bachelor party. The older guy offered her \"candy\" from his pocket and she teased back until he said he would have to unzip for her to get at it. She got off at one A.M. she told him. He planned to get off after they met up. It took her a full 20 minutes to address our table another ten to take our order. 
We made it simple, ordering the barbecue pulled pork nachos and a beer. When the food finally arrived we still had no flat wear or napkins. With no waitress in twenty minutes since ordering and getting our food, we resorted to asking the bartender for the necessary items to consume the meal. 
I'm not certain if sweet meats and bland food is a theme in Montreal, nor if the heavy use of coriander is a requirement. The nachos were a recipe of all that. I wouldn't order this a second time, let alone come back, even if It was the only food source on a desert isle. 
When it came time for the check again we waited. I finally hailed the waitress as she stood talking at another table. When the bill finally came, we had our card ready. She told us they had only one credit card machine. When it was free she planned to come back. She disappeared and never did come back. In frustration, we scrounged up cash for the bill and a less than acceptable tip. Ninety minutes is a long time to sit and wait for nachos and a beer. Had I offered \"candy\" to this floosy, maybe things would have gone better."}
{"text":"Somehow I ended up in a time machine and was transported to La Cage Aux Sports 1992. Evidently nothing has changed since then. 

The food was blah, the tv signals were poop, the decor was super outdated. The best part of the place was the super friendly bartender/waitress who was running the whole bad."}
{"text":"Well what can I say... another tourist trap... another crappy place. Came here since Old Montreal was dead at 10pm... ordered some food... trash... got some beers.... alright... got some mixed drinks... juice... waitress had her disgust face the whole night... trash again. 

Skip."}
{"text":"Sports bar in Old Montreal? Yes! and has lots of TV's.  Roll up doors give you that in/out feeling while being in the restaurant and watching/listening to the game. 

Watched the last gave of NBA finals here and it was great.  Wait staff was very attentive and even the manager swung by to say hello and make sure things were good.  Tried a shrimp appetizer and they were large and tasty (forget the name now).  The beer selection is not huge but that was OK with me, my view of the game was awesome since during commercial I could easily see outside and what was happening on the street. 

Perfect spot for the sports fan to bring non-interested friends and catch up with a game as well as be in a very cool part of the city. From here there are so many choices it is hard to go wrong."}
{"text":"Should have believed the reviews.  Food is not their forte. 

Dry chicken. Dry ribs and over done steak.  Fries were blah.  Overall way bellow par in a town with so many choices.  But we were really tired and thought this would be a good option. I was wrong.

The sports crowd is the only thing that would keep this place afloat.  

Service was slow and the server hid inside when she heard we had an issue with a meal (my wife returned the steak), when I asked her where she was she lied and told me that there were many people checking out that needed her attention. 

La cage had it's \"hay days\" in the 1990's and I should have left it at that. (Much like a pro athlete coming out of retirement after a brilliant career only to disappoint ant tarnish fans' memories)

For a beer and some sports on the tube, sure. Otherwise find a better place to eat."}
{"text":"It used to be popular place, not one of my favorites. There are screens to watch sports games. And, the menu is a classic one. They have two terrasses, that attracts tourists.
We shared two nachos, and cheese was lacking, same for the other ingredients, I won't order it next time."}
{"text":"This is a popular sports bar chain on Quebec - but you might not notice that in this Old Montreal location.  The sports aspect is very low key.

They have a *fabulous* two story patio, with lots of shade.  

For food, suggest sticking to the burgers.  My salad was uninspired and I was jealous of my husbands very tasty burger.    

The waitress was sweet and prompt.  Overall we enjoyed our time on the patio.

Would I return:  Yes
Would I recommend:  Yes, but avoid the salads.  Patio is beautiful"}
{"text":"We stopped by on a nice day, attracted by the outdoor seating on the roof deck. We were shown to our seats, sat there waiting for a server for about 10 minutes, and then left. The place was busy but not packed, and there were plenty of servers, so there was no reason for them to forget about us other than incompetence."}
{"text":"Endroit super agréable beignet dans une ambiance sport , et le service et à la hauteur sportive, speed tout en étant pro..... Restauration convivial et de bonne qualité.... A faire si vous êtes dans le coin du vieux Montréal.... ;-)"}
{"text":"A consistently highly mediocre experience. Never great but never horrible. The beer however is on par but at a price, $10  for 24oz!!! On the plus side, if you're there to watch a game, you will get a good view of a TV, they are everywhere. Plus, it not being a brasserie or bar, you can bring the kids along."}
{"text":"I went here my second night and Montreal and was extremely underwhelmed.  We went here because they had an indoor section,  a half outdoor section and then an upstairs region... Alot of space in this space.  They have affordable drink prices which attract alot of local kids and American tourists that are 18. The menu was a what you'd expect from a typical sports bar,  and the atmosphere was surprisingly really nice.... I wish we had more affordable central town baes like this where I live. 

Here's where things get bad.  The outside section has like a million spiders... Which I'm not knocking Cage for this because this is just a Montreal problem. Just something to know if you freak out easily.. Actually don't even walk around Montreal if you are because they are everywhere.. Hence why I'm not docking points. It's not a cage problem. 
The wings were grossly small and lacked flavor... It tasted like nothing... Nothing at all. 
The sliders tasted frozen that were just baked. It was not consistent with texture or tastes.. It was weird. 
The poutine was overly salted and I couldn't even finish it because it was gross. 
I really just left this place because I couldn't stand the food anymore. 

We just had exceptional service,  hence why it got a 2stars and not a zero... The waiters were extremely nice and accommodating."}
{"text":"Great 2nd storey patio, and they do pub food really well. We went at lunch on a sunny Saturday and found a spot easily. Server for some reason told us we couldn't sit street-side and had to sit port-side, so we had to stand our ground a bit. Otherwise, the burger was fantastic, fries were really good as well. My friend ate a delicious-looking club sandwich (they're HUGE) and the side salad is really large. There is a lunch menu special wherein you get a free fountain drink w certain orders (7 days a week). People watching is wonderful here! And our server was super friendly and prompt. This wasn't my first visit, I'm sure it won't be my last."}
{"text":"First time in as I am not from the area. Awesome burger and dining experience last night. I found the last available seat at the bar and got to work! Two gentlemen to my left and right were all \"visiting the area\" as well. The bartender Hannah was great- offered suggestions and sold me on the beer pitcher special. Highly recommend and will visit again!"}
{"text":"The Cage aux Sports is to Quebec - what Hooters is to the Southern US. They are everywhere, the menu is the same and they are boring.

I had gone for lunch and wanted to order the hot-chicken sandwich. Was politely told by the waitress that they didn't have any bread to make the sandwich. HUH? I'm no chef, but when I suggested that they substitute it for a hamburger bun and that I would be happy with that - she said the cook won't want to switch.

So I ordered a burger because they had a new menu with some \"specialty\" burgers. The patty was not fresh - it was the variety that you take from the freezer. Probably with grill marks already produced on them. It was not an enjoyable meal. 

A friend of mine had the grilled chicken wrap - commented that it was alright also.

Another friend of mine had the roasted chicken breast - said it was great, nice and moist chicken.

Just goes to prove to you - stick with the old."}
{"text":"Hopped in after a Yelp Event to catch the end of the hockey match. Made some friends at the bar within minutes who spoke very highly of the staff. There was nothing all that \"special\" between the menu offerings and the prices but the barmaid was personable and efficient. It's the small things that make service for me, like being stuck between fish tacos and chicken wings and her helping me out by offering the off-menu 1/2 portion of wings to help indulge in both my cravings."}
{"text":"Most of the Yelp reviews are for this location pre-renovations. If you look at the reviews post-renos you'll see a much higher average score. I had visited just after their reopen and had been discouraged by the quality and the service but my last visit was a great example of a top notch experience in a regularly bland brand such as Cage aux Sports.

We were in for a quick burger before a movie across the street and sat ourselves at the bar. We had the wonderful luck of being served by the beyond lovely Dela (Delaneige). Her service had me making sure to note her name because she was a total gem. From offering me a taster of the beer when I showed hesitation between my choices, to her menu knowledge, flow of service and actual aptitudes for the industry, I was very impressed. When I asked for a menu back to show my +1 what I had ordered while he was parking, she even went to the point of opening the menu to the related page. While that might seem small, please contemplate that if she made such effort towards such minimal aspects, then you can imagine how much care she puts into the other points of service. Five stars for her alone. She is the kind of staff that will build a regular clientele without issue.

The food itself was great. We split 2 burgers, the Veal & Cheese and the Brie & Mushroom. The burgers were very tasteful but were prepared more for Instagram than for eating. The patties were too \"balled up\" rather than in a more flat shape. Meaning they look great when delivered but a breaking mess when you try and eat them. Regardless, they were delicious. Their emails let me know that since it was boxing day there was 50% off on their burgers, so between that and the Tuesday $10 special ($10 burger, pitcher, wrap, tartar) our pitcher of beer and 2 burgers came up to a whole $35 after tax.

If I knew that all of their staff were like Dela, this would be a certain 5 star review, and my watering hole for every cheapy Tuesday.

**Update April 2018: I don't want to \"update\" my review as a whole as I think as written it is perfectly reflective of my ongoing experiences, however I'd like to give a shout out to the manager Stephane (or possible Steven). He was an absolute pleasure on my most recent visit. Served as the hostess and the waiter while staff were occupied, a hands on manager with a great attitude!"}
{"text":"Fun place to eat during a soccer game! There are tv's everywhere you look, even outside. Food was good. Ordered the BBQ Pulled Pork Nachos, they were ok but the portion is gigantic. It has BBQ sauce instead of salsa which tasted good at first bite but got old after a few bites. It can easily feed 2-3 people. Our table also had the macaroni n cheese which was absolutely amazing, definitely order that. Burgers where good and I've attached the kids menu as sometimes that's hard to find. 

Popcorn is downstairs and free, however our server didn't tell us about it. 

Service is pretty slow. Our waiter was chatty with the other servers, so we rarely got a refill on our drinks and took forever to get our check. 

Overall it's a great place to eat if you're looking to watch a sporting event on tv."}
{"text":"A great place to just stop by and drink on a rooftop.  They have snacks , beers, free wi-fi and cute waitresses.  Also great that it's located in the heart of Old Montreal.

Bring some cards and play drinking games if you want.  They allow smoking upstairs just ask for an ashtray.   Friendly service! I'm just going to assume all Canadians are friendly but it was a little difficult to find our waitress at times.  Overall nice place to just grab some drinks and snacks while we hung out in Old Montreal"}
{"text":"Wandered in here on a Sunday night with two Tweens to watch the World Cup Finals. The place was practically empty. We told the hostess we were there to see the game and she positioned our table so we could see the biggest screen they had. Perfect!  Knowing we would be taking up a table for awhile, we ordered appetizers of poutine and nachos. She told us that their poutine was tasty, but that we should try more authentic poutine before leaving town. We appreciated her advice, but the poutine we were served tasted just fine. Nachos were tasty too, but different than we were expecting. Real cheese was melted on making many chips dry... But there was a sour cream sauce we poured on ourselves that helped. We were happy to see the game and drink bottomless sodas.. So it was great. Ordered dinner at half time....buffalo chicken sandwich for me, burger for hubby, and kids meals for the kids. I thought my sandwich was fresh and well seasoned and the burger was good too. 

All in all.. A very pleasant evening that ended in victory for our team! Prices were a bit in the high side, but about what we expected at a chain in the city. A fun evening!"}
{"text":"I didn't have a horrible experience here but it's a sports bar and honestly, I wouldn't have picked it. But I was out with family and this was a good place to go to for a pint after visiting some sights near by. 

The service was good and the beer selection was OK. What I did like was the patio, which was airy and open. Despite being inclined to avoid all sports bars, I'm glad I came here in the middle of the afternoon instead of the evening. I have no idea about the food but I would assume that it's your typical sports bar fare."}
{"text":"Came here to meet some work colleagues for lunch.  First thing I noticed when I arrived, the have a very nice terrace (Patio in other provinces) to eat on outside.  Entering inside you get a wafting smell of fresh popcorn.  Not really the smell I cared for at lunch but oh well!  

Met up with my work colleagues and we sat in a big booth.  The place is decorated in sports bar paraphenalia with TV's on in the background.  

I ordered the chicken quesidillas with a house salad.  The chicken quesos came out as a generous serving with the shell crispy brown on the edges.  Taste was okay, the texture of the chicken however tasted like it was hacked by a blind woodsmen with a very dull knife.  On a scale of 1 - 5 I'd rate it a 2.5/5.  

Service was okay, the server mentioned to us our meals were the full serving and didn't come with the coffee.  Oh well.  One in my party did have the table d'hôte so he gave her a bit of a hard time asking for a coffee to go.  She obliged and brought one out.  I really do believe restaurants in Canada can learn a lot about customer service from American restaurants.  All you need is a smile, a thank you and trying to work to please the guests.  It's not freaking rocket science!  

On the whole I'm really not a fan of the Cage.  I'm actually surprised how little there is in terms of chain sports bar competition in Quebec.  Time for some Wild Wing restos or St Louis Rib places to open up provide better service and force this chain to rethink their food and customer service or close!  Probably not as people flock to these sub mediocre places in hordes!  Oh well, if my choice I will go elsewhere!"}
{"text":"This place is right inside old city of Montreal. It was very good. I loved it because we could sit outside. Oh, their poutine was very good! Handsome waiters !!"}
{"text":"Great place to meet up and grab a beer and a snack before a game. Not cheap but ok prices considering the location and excellent service. Extremely crowded on event nights."}
{"text":"Evening visit for a after-trade show wind down. Place has a limited menu..very little that's healthy (not that I'd go to a sports bar for healthy food). I ordered the chicken breast with a side house salad. The chicken breast tasted like it was spinning on the George Forman Grill since last Sunday, very dry & with the \"I've been reheated\" taste. It came with a St Hubert knock-off sauce that tasted like warmed over anti-freeze! The good news for this is it was only $13.95 for the meal, bout $10.00 too much. 

The worse part of the evening is we were served by a DUDE!! What self respecting sports bar doesn't have hot women serving the food!! One good thing...giant TV but that's negated by the no sound sports. NOT a do over."}
{"text":"OK place to see the end of the hockey game and have a pint or few with friends. The service was average, they didn't want to substitute my rice with sweet potato fries, something that can be easily done in every Irish pub for a small surcharge and I had to remind about my second pint. The place is more attractive during the summer, when you can sit outside on the terrace. Free popcorn helps the 3 stars rating!"}
{"text":"I was quite dissatisfied with the overall service at this place. For starters, as we walked in, you could hear the bartender tell us from across the restaurant, \"Yea, just sit anywhere, I'll come see you\". However, right at the front, there is a sign saying \"Give us the pleasure of letting us seat you\". We sat. No utensils, napkins on the table. After 15min, we ended up ordering, it took some time for us to get the menus. We had a hamburger and salmon ciabatta platter. The fish seems as if it was fried for 1min and added to the sandwich. It did not seem well cooked. The hamburger was ok, however the bread looked as if it was frozen and defrosted before serving. There are hits and misses, this was definitely not a hit."}
{"text":"After bending over for Habs concessions, this is a good place to get a beer. Try the Rickards \"Cage Box\" (or something Frenchie like that)...$10 for a HUGE 32oz jug. The meals are good for a bar grill, and staff is nice...but why must it be a SWELTERING JUNGLE every time I go there? Turn the temp down!"}
{"text":"If you've been to one Cage aux Sports, you've been to them all, really.  However, I haven't had a good dining experience when it came to the food at a Cage very often.  Whenever I went to the one in the West Island, my food would be cold by the time we got it.  This experience was different.  The food was delicious.  We started with the cheese sticks which were really good.  My go to meal is usually Quesadillas so I was happily surprised when I really enjoyed these ones.  The \"salsa\" is more like a spicy mayo but I really enjoyed it! I had the side of Garden Salad and they put quite a lot balsamic vinegar dressing on it, so I had to eat it in small portions. The kiddo got the Meli-Melo which was pretty much a few pigs in a blanket, chicken wings and we got the side of veggies.  The wings were bland- there was no seasoning on them but they give you a huge portion of vegetables which was great.  The SO got the Beef and Sausage Burger with Onion Rings and he really enjoyed the goat cheese in the burger.  The service was quite fast and our waitress was very pleasant.  So while you shouldn't go to any Cage if you're expecting a five star meal, this location was one of the best Cage experiences I've had so far."}
{"text":"This place reminds me a lot of Red Robins without the bottomless fries. I didn't realize this was a franchise. From the outside, it looks like the restaurant is small. However once you go in, you can see their interior dining rooms are extensive. We climbed a steep narrow set of stairs to eat in the spacious upstairs dining room. 

Our server was great. Very friendly. I had the salmon burger. Salmon was a bit fishy smelling. I think they should season it with pepper and lemon juice. The kids menu came with drink entree and ice cream. Super deal! Fish and chips came with one strip of fish and a lot of fries."}
{"text":"Touriste Trap!

Stay away from this place! The food is horrible the service was bad. How this place stays open is a mystery to me,I guess the steady flow of tourists who don't know any beter keeps them a float. Do yourself a favour and keep walking and you'll find something beter. This is Montreal after all, we have so much beter and all within walking distance."}
{"text":"We went there on a cold evening.
The place was pretty empty, two floors. We didn't get any popcorn. Probably it was self-served, but we didn't get informed. There is only one waitress working for the entire floor.
We had a full rack rib plate and chicken wings. The food was really tasty. I had thought the food was overpriced but the portion was generous. 
The draft beer was also refreshing. The glass was shining."}
{"text":"I have been here a couple of times now, and it's...okay. The first time I went, I had a burger and fries and they were so-so. Nothing special, but good enough. The second time I went, just this past week, I only had a couple of beers. I will say that their beer selection is...bad. Rickards, Molson, and a few others. Very uninspired and mediocre. Also, the service has always been friendly enough, but very slow. Whether it's busy or empty, I have experienced painfully slow service on both fronts. And the interesting  part - the bathrooms are all upstairs, so it can be a bit of a hike. And I imagine it's really a pain for anyone with mobility issues, seeing as they would have to take an elevator I assume (where it is, I have no idea)."}
{"text":"If you have kids get number 3 on the kids menu which includes two wings two hot dogs fries and two chicken nuggets! Service was good!! God knows how packed this place is during hockey season this place is all about the Canadiens but just really a hockey bar. Free popcorn! Would walk 20 minutes for this place!!! Loved it!!! Located inside the belle center where the Montreal Canadiens Play! Located in Downtown Montreal Close to the Montreal Cheateau Champlain!"}
{"text":"Service super slow (ok if your there 4 a 3 hour  game) ...  Food is ok to bad.. 
My chicken & rib: chicken was 1 up from raw, needed a magnifying glass to see ribs(tasty though), fries were limp/soggy ,all crammed on to a small plate with little containers of coleslaw & sauce , which makes it look like you are getting a lot.. & its Lot of $ for so so food!!"}
{"text":"Great place to drink some ale and watch Les Habitants!  Wings looked good too... I didn't try them because we were full from one of the delicious french bistro's in town."}
{"text":"Which company had the slogan, \"taste it again for the first time!\" - can't recall, but that it surely must apply to the new menu at \"La Cage\". Finally something remotely worth the prices they charge. I'll have to fish out my notes on what I tried, but boy was is better than the many other occasions of truly forgettable meals, but not forgettable tabs. From memory the braised bacon, fig, arugula and havarti flatbread sandwich was rich and filling (with only a few chewy fatty bits), and the spicy steak tartar with capers, chopped baby pickles, whipping cream (and tabasco sauce for the heat component) was a surprise standout. The nachos were a bit cold when I arrived, so I can't comment much on them other than the fact that they must have been a mountain before, as there was still a hill left on the half eaten platter. I wanted to see if the ribs were above average, but was too full, so perhaps on another night. Thankfully you can get a side salad instead of fries at no charge, to avoid a major calorie overload all in one night.

Big shout out to our server who was tending bar and serving the whole first floor from what I could gather - during a playoff football game nonetheless. Take note that they play the sporting events sound when it is the featured game of the night, which is a nice touch (except when they put on music while the team is accepting their trophies and thanking the coaches/owners etc. - guess we can't ask for too much). Go Patriots! Yes, I know they've won a lot, but let us have our moment as nothing lasts forever, but hopefully long enough for a little more hardware."}
{"text":"Bah it's...ok I guess. It's just a very safe location for people afraid to go out and discover the beautiful world of food in Montreal. Or simply to booze during a sport event. It's a large chain with some decent service and clean place too. I was outside on the Patio in the middle, the view suck, but close to the St-Laurent River of Saint-Paul st, it's kind of cool and relax during hot day. Otherwise, GET OUT OF THIS PLACE, RUN RUNN *Schwarzy's voice* there's so many other nice spot to discover than this tourist trap that's half cheap, half reasonable."}
{"text":"Staff was very friendly but the food, I was not all that impressed with. We ordered 2 variety appetizers and only 2 out of the 6 items were okay. They other 4 you should just pass on which makes the variety a pass overall. 

Lots of TVs to watch the game on made this place acceptable."}
{"text":"I did not enjoy my experience here. My boyfriend and I were kind of excited to see that their nachos come topped with bacon. When the waitress (finally) came by to ask how everything was, I asked her if there was supposed to be bacon and she simply said \"yes it's small\".. it was just lackluster service and food quality.

It's a get-what-you-pay-for experience, I guess. It's close to the Bell Centre, but so are other places that will have better food and service. The only thing I really liked was that you can have free popcorn... that's pretty fun :)"}
{"text":"Wow, tough crowd! Good wings, fast service, not nearly as bad as reviewed here! Go for a MAN MUG!"}
{"text":"Terrible food, even worse service. Took us over 30 minutes to get our check and all we wanted to do was leave! Better off going to McDonalds."}
{"text":"Perfect location to stop for drinks when strolling through old Montreal. Beautiful inner patio area with plants, tvs and music. Drinks were good, food was great, but, service was lousy! Maybe they don't like Americans too much? Brought our one round of drinks, then appetizers and entrees (together)and that was it. Still a nice spot though!"}
{"text":"Was in Montreal MayDay weekend and came through to watch the Mayweather and Guerrero fight. La Cage is a Great looking sports bar. It's TV galore with a huge center serving bar. Wide open space with two huge projector screens along with smaller flat screens at every turn of the head. The place was awfully empty though considering it was fight nite. I guess Canadians aren't that big into boxing? The kitchen was shut down, so there's no food review.  It was around 11pm when we got there plus there was a small number of patrons so it's understandable.  The fam and I knocked back two pitchers of beer as we watched Mayweather dismantle Guerrero then called it a night. The waitress was nice but insisted on speaking French, so my cousin that lives there had to place the orders.  I hear its a big thing in Montreal now...  that French preservation has turned into French force feeding. Even with out-of-towners and tourist.  Shrug, watchu gona do?

Maybe the place is livelier when hockey is on, Who knows!? 
The other Yelpers do, silly!  

I'd go again to watch a fight and drink a beer. 
La Cage Aux Sports. alright stuff."}
{"text":"Every 6 months I come back here to check if it's gotten any better since's its location is so bloody convenient. Unfortunately, I'm disappointed each time.
- Overpriced ($24 for a sandwich and beer)
- No value (my sandwich was sprinkled with chicken shavings. Fries were in a bowl on my plate so they can give me even less)
- Dirty and hot glasses were brought to the table (my beer turned into piss within seconds! Alchemy!)

I'm unsure if Cage merits another try. I'd really like to see something better take the spot. Like Denny's!"}
{"text":"The 1 star is just for the TV screens showing Football games. 
The service being horrible is an understatement. You experience a level of apathy that is akin to someone doing you a favour by serving you. The person at the counter was downright rude. We were not served for about an hour after we came in, despite speaking to multiple waitresses to take the order. The food (20 wings) took another hour to come in. And it didn't seem like they were understaffed. 
The only reason we stayed was to watch the football game. Do yourself a favour and visit the numerous other restaurants around."}
{"text":"This was a great find here in Montreal. The atmosphere was very relaxed and the wait staff was super friendly and accommodating. The food was plentiful and very delicious. The restaurant has varied seating options to suit your preference (indoor, courtyard or outdoor). Highly recommend this place if you are in Old Town Montreal."}
{"text":"Ordered salmon tartar and it was great! 

The salmon is marinated and dressed with purple onion, capers and some herbs and some olive oil I believe. 4 thin slices of croutons are served with the tartar. 
It also comes with fries and salad. 
The portion is huge, as an female I can only finish half of it. 
Would be great to share this with another female friend! 
P.s. popcorn is free!!"}
{"text":"Great location, old Montreal.
We ate here one night, ONLY because the restaurant that was originally there was no longer, and well we didn't want to go searching for another!! 

The service was a bit slow to start...well actually the service was pretty crap the whole time.

The food was great. Had the Fish tacos for an appy then the southwest salad. Fantastic. My boyfriend had the burger, he wasn't overly impressed."}
{"text":"We were in town for a long weekend and needed to find a place to watch Sunday Night Football.  They have a large six panel TV which dominates the bar, and if you can get your game on there you get a great view.  Otherwise, smaller TVs throughout will do.

Maybe we were sweating it that we wouldn't get our game on, so over the course of 45 minutes negotiated with the bartenders to 1) put our game on, 2) watch them struggle to figure out how to operate the Direct TV system 3) point out on the channel guide the game we wanted 4) negotiate our game for the big TV, and 5) secure actual sound for the game.  Sports bars should be more on point on how to handle getting the games, on when it is the only game in town (no other football, no hockey, no baseball, Canadian or US, to compete with).

The burgers were a little overdone.  They had a decent choice of beers on tap, I was able to actually locate an IPA.  They were out of Molson Canadian. 

Free popcorn to snack on."}
{"text":"Bien situé avec une terrasse agréable, les serveurs et serveuses étaient aimables et souriants. Par contre, niveau assiette, ce n'est pas terrible, burgers, fritures... n'y allez pas pour ça, vous seriez déçus.
 Pour les enfants, il y a beaucoup de choix en menu (plat +boisson) mais c'est un peu cher pour ce que c'est: fritures, spaghettis sauce tomate, deux mini burgers,...
Bref, endroit sans grand intérêt pour la nourriture mais bien situé"}
{"text":"Wish I had looked at yelp reviews. The second floor terrace looked so enticing but don't let it fool you because unless you get a seat next to the street it's not nearly as cool. Service was slow and food was extremely bleh good think we just got an appetizer. Bruchetta was soggy, mozzarella sticks were what you get frozen at grocery store but the potato chips were not too shabby and they were homemade. Drinks were ok but nothing special nor strong. Two stars just for the upstairs and making the chips homemade but that's about it"}
{"text":"Because i enjoy the terrasse In the summer! they have also a wonderful terrasse in the middle of the bar for winters, the food was good and you can see bigs screens everywhere for hockey .... always busy place for beer and the toillets can tell ..."}
