{"text":"I've been a regular here for the last two years (twice a week). With a plentiful bounty of authentic Mexican food restaurants in this area, this is the spot I keep going back too.

Carne asada dishes highly recommended! Just stay away from the seafood. Some reviewers forget we live in a desert and ALL frozen seafood tastes bland no matter how you spice it (yes, even Papadeux)."}
{"text":"Very delicious and I believe the food is made fresh with each order. The Al Pastor and Chicken are seasoned perfectly (not too salty). If you eat there, they will give you a free side of chips (additional chips are $1)."}
{"text":"Great selection of baja style Mexican food plus all the traditional fare. Ceviche made the way it supposed to be, take note Macayo's. Great lunch spot, very reasonable prices."}
{"text":"I have been eating here for seven years and the food here is the best mexican food outside El  Paso.
I live 25 miles from this place and have not found another mexican restaurant in Phoenix that compares. The people who gave this place a poor rating must have been high on drugs."}
{"text":"Super satisfied  . Didn't expect them to bring me salsa and chips but they did and then brought out our food as well. Simple stuff but made me happy to eat here."}
{"text":"Anytime I'm in the area I stop to eat here. The Tortas are incredibly well made and they cook their chips up fresh with special seasoning sprinkled on top...I've also enjoyed the carne asada. Great place."}
{"text":"ok, I will not go this place ever again, reason #1 The beans are very very very greasy, you can see all the oil they use on top of the beans it looks disgusting #2 very expensive, the chile relleno plate is $9.XX almost $10 really?? #3 my order was by phone and they told me ten minutes and when I got there I waited 15 more minutes. #4 the chile relleno was ok and again it was very greasy. I don't think I want to go to this place ever again, If you like very greasy food this is the place for you."}
{"text":"bad service, so far not impressed  with the food, had to ask for everything from straws to chips.  The enchiladas were some kind of red sauce the tacos suck, tripitas learn to cook them people.  The chips at least are fresh.  Come on now if you have a family restaurant cook like you want to keep customers."}
{"text":"The good was quick to come and very good I ate the shrimp burrito and it was great. The beer is super cheap really recommend"}
{"text":"Our first time in and it won't be our last. We had a tasty red-chili pork, and a carne asada. Each came with handmade tortillas that were yummy! Other than the beef tasting a bit salty to me (not my companion), it was all delicious. Love the neat table tops that are recreations of Spanish-language tarot cards. Fun!"}
{"text":"This place is really nice I enjoyed the atmosphere and the prices were reasonable. The food was amazing, everybody was really nice and the beers were so cold."}
{"text":"Their shrimp burrito gives me LIFE! It features a generous portion of giant, fresh, delicious shrimps wrapped with love. Best shrimps in town! Mmmm..."}
{"text":"Just stopped by for a chicken taco.  very good and the chips were hot with excellent salsa.  I will be back"}
{"text":"The ambiance is fun, family style. The bold colors of the paint and the \"loteria\" (latin American bingo) themed tables contrast nicely with the classic \"golden age of Mexican cinema\" black and white photos.

I've been here a couple times and had the fried tilapia. It was over done. Looked like it was deep fried. However the rice and beans were as if my mom, RIP, worked through the cook to remind me she loves me.  

My wife had the huarache. A thick oblong corn tortilla covered in beans and carne asada garnished with avocado, lettuce, tomato, cream and fresh cheese. That was superb!!

Not the kind to not tive a place a second chance, especially since the beans were divinely inspired.  So we went back. This time I had Nopales with Carne Asada. Excellent choice! The corn tortillas are hand made! I bought a second order of tortillas since I couldn't get enough. Karla had the chiles rellenos. Man, were they great!!

We drove by this place hundreds of time, oh if we'd known what we were missing. What fools!

Anyway, hope you take advantage of this hidden gem of Mexican cuisine."}
{"text":"One of the best Mexican food restaurants I've been to. Food has flavor and you get you money's worth.  Good musica as well"}
{"text":"I would eat here everyday if I lived closer.  Excellent tacos!  Pastor, pollo, carne asada, carnitas....I get two of each every time I go.

I'm a pig.  I don't care."}
{"text":"Just ate here for the first time. The food was excellent, and the servers were friendly. Next time we're in the area, we will eat here again!!!"}
{"text":"Waited 20 minutes for a chicken taco and a beef taco to take home- the beef taco had MAYBE a tablespoon of beef in it and the chicken was in pieces that were hard as a rock. Thought I would try it since it's right on my way home- big mistake. The salsa was spicy which is good but had a weird taste to it. What really surprised me was how long I had to wait !! There was only one person waiting before me and the rest of the people were seated and eating already!! I'll never go here again. Many more taco shops in the area."}
{"text":"I'll give the 'economic kitchen' a round up on a 3.5 star review. 
 I happened by this place the other day and ordered a carne asada burrito.  Usually I gripe about no free chips and salsa at Mexican restaurants but I ponied up the extra dollar for some chips to enjoy at their free condiment bar.  A basket of warm tortilla chips came out a few moments later and I was lovin' life.  The salsa roja was really solid I only wish I wasn't so rushed as I would have liked to have tried the salsa verde.  The burrito was big and beefy (insert joke here) and quite tasty.  I'll definitely return to try some of their other dishes when I have the time to sit a spell!"}
{"text":"Carne Asada and Horchata were delicious, service was terrific - only downside was no offer to refill our chips and salsa"}
{"text":"This place rocks!  Best beans and rice around and their chile rellanos are killer.  Al pastor is top notch along with everything else on the menu."}
{"text":"I love this place. Close to home big big tacos super fresh spicy salsa with warm chips and all at a great price. Great friendly service as well."}
{"text":"THe carne asada is delicious and those rolled tacos with guac & cheese, mmmmm.
My kids and I will always consider this our favorite hole in the wall mexican food.  The people are friendly and inviting.  It's great food."}
{"text":"The atmosphere is kitchzy but every time I have stopped in, it appears clean. The food has always been fresh and of a high standard of quality. Their perpetual 'special' of fish tacos is served with an unexpected and lovely flourish of shredded salad items. However, only four stars because of the pricing. So, I recommend getting a combination plate instead of a burrito. Pricing for a business is based on many things, overhead (rent, utilities), labor costs, supplies (staples, food items), etc and only the owner/management knows their needs to meet their ends so I can't say whether something is overpriced. However, I have found that the price for their burritos far exceeds the price for value of their meals. You pay for convenience at this establishment."}
{"text":"We were so happy to accidentally discover this authentic Mexican place while driving around Phoenix. Not only is the food and service excellent, but the folk artwork and paintings are just fabulous. Very colorful restaurant with ample portions and a huge menu painted on the wall. If you are near the airport, go here."}
{"text":"Very good Mexican food in a lovely, traditional Mexican Restaurant with tile floors and photos of old Mexican movie stars like Pedro Infantes. A beautiful mural depicting Theater icons from Mexico. You order up front and seat yourself and your food is brought to you. The menu is on the wall along with photos. Chips were warm, slightly thick and very good. The hot sauce was one of the best I've ever eaten. We also ordered pico de galo. My girlfriend had scrambled eggs and chorizo and she loved it. I had Divorced Eggs, which was a nice simple dish with an over easy eggs on tortillas, one with red sauce and the other with green sauce. Between were nicely fried potatoes and refried beans. Very good, simple and good. I also had horchata"}
{"text":"Super good authentic Mexican food.  Loved it, had the shrimp cocktail- Omg!!! Chilled, loaded with avocado and plump shrimp and enough spice to melt my"}
{"text":"My girlfriend and I practically lived on their food the first few months of doing renovations on our house. The 5 tacos for $5 and a carne quesadilla to split is an awesome way to go. Everything we've had here is great, even the napales... cactus fajita platter basically. The corn totillas are hand made and thick and delicious. The food takes a little longer than your averaged mexi spot, but so worth it.  As the other reviewer says, the ladies that work there are very nice and its always clean."}
{"text":"Restaurante Mexicano AUTENTICO (muy difícil de encontrar), rica salsa, deliciosas tortillas de maíz hechas a mano, recomiendo el plato de carne asada con nopales, arroz y frijoles. :) oh y precios accesibles!"}
{"text":"This is one of those places I've totally neglected to review on yelp despite it being one of my most frequented establishments. Like the name of their restaurant implies, they are a sound economical choice for a meal. But they don't skimp on the flavor (or portion sizes). The salsa is always hot, the vegetables always fresh, and the meat always wonderfully spiced and cooked to perfection. I have a serious addiction to their chimichangas, which are enormous and covered in cheese, sour cream, and guac, and I'm practically exploding by the time I get to the bottom of one. I have often eaten half for dinner and saved the other half for lunch the next day. The beans and rice are good too; sometimes I find restaurants don't bother to put the effort into the beans and rice but they do here. Basically I have never had a meal I didn't like here, and I either eat in or get take out a handful of times a month and have ever since I moved to central phx over 2 years ago. Everyone is really nice and friendly to boot. :)"}
{"text":"Very good food. Took the family there about a month ago. Two had enchiladas: cheese and chicken. One had shredded beef tacos and I had the shrimp al diablo. We enjoyed every bite!! Very affordable too which is a plus. Will definitely be back."}
{"text":"Que yummy!   Authentic Mexican food, my party had chilaquiles and sopes.   The chilaquiles were amazing!   They were crispy and made with fried corn tortillas, but NOT made with corn chips.  You can have them prepared with red or green sauce - I chose red, it was delicious!   The chilaquiles are served with potatoes and beans.  
My friend ordered sopes.  They were really yummy!   You can chose from several types of meat to top your sope with.   You're served chips and salsa, the salsa is a red salsa that is very tasty.  It's a small, clean restaurant, the employees are friendly.  You order at the counter and your food is brought to your table.  I recommended giving it a try."}
{"text":"The food here is amazing, everything is cooked then and there so its fresh as can be. the pictures and wall art make it seem nice and cozy. The staff are friendly and you can call to place your order in and pick it up."}
{"text":"Nothing fancy but will do in a pinch.

Like the name implies, La Cocina Economica  is an economical place to eat.   They offer Authentic Mexican food at decent prices.   The food is good and I have never had a bad experience.  The food is made fresh to order, so you may have to wait for 10 minutes for your order.  La Cocina offers several daily specials for $4.99.

If you want something fast and inexpensive La Cocina is not a bad choice."}
{"text":"This has to be one of my favorite places to eat!!!! I always get the Carne Asada plate or Tacos Al Pastor!!!!! They are DELICIOUS!! And they now serve fresh chips!!!! They place is super cheap!!!!"}
{"text":"Omg! The food is amazing. I ordered the Sopes and babe ordered the Green Chile plate. They are super nice. And the atmosphere is cute. Will definitely be returning."}
{"text":"Best shimp burrito in PHX since that place on Camelback closed. And they always have a real Mexican Coca Cola on hand. The kinda made with sugar cane rather than high fructose corn syrup"}
{"text":"Here is a great Mexican food joint that is not expensive, very affordable and the food is Fantastic. The atmosphere is very nice and cozy, TV's in the corners, music in the background. The Ladies waiting adn that work there are very sweet and nice and attend to everything.

The menudo here is the best i have tried along sides my moms, lol. Have not tasted menudo this good since i moved here from Cali. Many places in phoenix, either add too much oregano or make their menudo soup to thick. But ths place is awsome!!!

The wifey tried the shredded beef tacos and rice and beans, And wanted more. 

Have gone back often to eat their menudo and try differnt items, and were to my satisfaction. 

Great Food, Great Service, Great Job!!!!"}
{"text":"So, I always have mixed emotions with this place but the moment I eat the Al Pastor Tacos, I end up LOVING this place again. The only down fall is that occasionally, our order is incorrect, whether it means they added guacamole or they didn't give us 10 tacos. For example,  We had ordered 10 tacos the last time and the order came out to be $30!!! Without questioning, we paid, left, and felt ripped off. Come to find out, they had charged us for the \"bigger\" tacos that we never ordered versus our usual order of the 10 \"small\" tacos. The only harm done was in our pockets. Our stomachs and taste buds, however, were quite satisfied.

As far as Carne Asada Tacos, they are fairy good. The only reason I go here is for their Al Pastor Tacos... although, they always right down Adobada Tacos, so I am unable to confirm what it is I'm eating, because the menu says they have Al Pastor tacos. Nonetheless, these tacos are amazing. 

The place is like the usual little Mexican Restaurant but the food is definitely a bit superior on the food chain."}
{"text":"Great affordable restaurant for good Mexican food! I love the cheese enchiladas, the fact that they offer chips and salsa as well as bring you the food to order. The customer service has been great also! I'll be returning for the same enchiladas!"}
{"text":"Yum...the place is fantastic. Authentic Mexican food. We usually have the number 3 carnitas plate. Traditional pork, cooked all day and ends being browned in its own juices. Crispy edges, tender, flavorful...and not too salty..thank you! It comes on a plate with everything you need to fill their amazing handmade corn or flour tortillas...rice, yummy beans, guacamole, and pico de gallo. The chips and salsa that come after you sit down are amazing. They have their own deliciousness. And we always have a super cold Victoria beer to go with it that they shove down in a big tub of ice. Good prices and always friendly service. Yummy."}
{"text":"I LOVE MEXICAN FOOD, however I would be lying if I said that this place was worth recommending. I asked the girl at the counter what did she recommend since I have not ever been there \"Oh, I don't eat here, so I don't know\" maybe this should have been RED FLAG number one! 

I figured keep it simple, I ordered a chicken burrito and my boyfriend ordered 5 street tacos. We waited about 25 minutes, (there were 3 tables who already had their food) and when our food FINALLY came out my chicken burrito was burnt on the outside and when I opened it up the chicken inside was NASTY, well overcooked and HARD. I gave up quickly! The street tacos were greasy, I think he ate 3 of the five before he was DONE. Bottom line, save yourself the $20 bucks, there are plenty of FRESH and authentic Mexican food places around the valley, this is not one of them."}
{"text":"La Cocina Economica is a little place near downtown. I came across it on Yelp,  and decided to give it a try. The menu has some great stuff. And the prices are great. It really is \"The Economical Kitchen\"!

The interior has tarot paintings on tables, cartoony artwork of Mexican celebrities, and photos of actor Pedro Infante,  who is clearly the owner's favorite.

We walk in, and the record scratches. Yeah, thats right. We up in the spot! Clearly not too many güeritas visit.

You order at the front counter, and your food is brought to you. It does warn you on a wall sign that everything is made from scratch, so don't mind the wait. We waited a bit, but not horribly long. We had great chips and salsa. I had a Mexican Coke,  while J had a fountain soda. 

We each got a Torta Mixta. It was basically ceviche shrimp and octopus with onions, cilantro and avocado on top. So good! J got the Tampiquena steak, and thought it was well-seasoned and cooked. I has the huevos con nopales. This was great as well. The nopales were just right - not too spicy.

We will eat here again for sure. This was a great little place with great big flavors."}
{"text":"I tried the shrimp burrito per the review on here. One of the worst I've had...ever. (Salsitas' has a good one, IMO.) It just didn't taste that good...it was spicy, which I like, but the flavor was boring. Hubby and kid had bean burritos and weren't impressed either.

Everything was WAY over salted. And, I know this is TMI, but we all spent hours in the bathroom the next day. :( We will not go back."}
{"text":"We came here from Scottsdale to get some Mexican comfort food. The place is easy to find and you order at the counter and they take your food to your table. I was really hungry so I ordered alot, Torta de Jamon, Bean and Cheese burrito, and Quesadilla. Wow! Needless to say the food was delicious and  and the service was fast and accurate. The torta was juicy and my daughter's menudo came in a giant bowl enough for two. My hubby ordered the Potosino enchiladas which are a form of fried corn empanada filled with cheese topped with red sauce and cream, served with rice and beans. It was very good too. Prices are very reasonable. You get your money's worth. Flavors are authentic."}
{"text":"Pleasantly surprised when I walked in looking to get some tacos and they had mariscos on the menu!! The chips and salsa were delicious as well and the prices were super reasonable. 
I'm always searching for a good authentic Mexican food place and this is DEF it!  I live right down the street so I will be frequenting this place more often :)"}
{"text":"Having brunch with friends. The world must know what happened here.

I ordered a steak and eggs breakfast. The steak is literally as thin as beef jerky. Just look at it. It is dry and tough. 

 Everybody else seems hapy with their food but they did not order a \"steak\" breakfast. I am not happy and I feel ripped off.

Counter service. Ok decor"}
{"text":"Another great spot if you enjoy a quick lunch with out going to Filly B's.  The quality of meat is above your nomal quality for a burrito and the Cocina packs in a lot of tast in each bite.  Just South of the circle K on the corner of McDowell and 16th St."}
{"text":"My dad and I visited this restaurant because we had an entertainment coupon. The kid didn't seem too thrilled about it, like it was coming out of his paycheck, but he accepted it. The beans were the best part of the meal, excellent homemade corn tortillas! I ordered the chillaquilles, the sign said it came with tortillas but the kid said it didn't. Terrible customer service! If they hired some people that really want to be here then this restaurant would be much improved! The food is actually pretty good, above average. Grade C"}
{"text":"Really solid menudo everyday. Good flavor and not too funky. Comes with tortillas but ask for the excellent rice instead. The portions are very big. 

Bonus: they fresh fry their tortilla chips and put a nice chilli pepper on it."}
