{"text":"Worst service ever. Slow, then fave my I order to someone else. Need I say more. Well actually I guess I do. I mean how can you screw up an order for a single empenada? Which by the way are small, expensive and not really all that tasty"}
{"text":"Loved this place! Really reminds me of the authentic thing. Felt like we went back to Chile. Their empanadas are awesome!!! Delightful place with really nice staff too!"}
{"text":"If you're looking for a casual spot with a tasty menu, this is it. Delicious food and friendly service! I highly recommend the chicken empanada with spicy sauce, yum yum."}
{"text":"EPIC. The chicken Quesedilla is out of this world. Very generous portions, food is succulent, ingredients are always fresh, delicious and of excellent quality, employees are always  friendly and welcoming, their homemade hot sauce is perfect... yadda yadda yadda ( I could go one and on and on)

I've been going there for over 8 years and I'm always satisfied. (If only they had one on Vancouver) AND... Everytime I introduce someone to this place they only want to eat there the whole time we're in Montreal (with a mountain for restaurants to check out, that sais plenty about the place)

Whole in the wall, strange location, looks like nothing but \"never judge a book by its cover\" case in point.

Never tried the empanadas though, so can't review those.

Enjoy!!"}
{"text":"Went here a bit late in the day on a Sunday, and was disappointed that they had run out of a lot of the empanadas that I had wanted to try. The hot sauce was a highlight (lots of corriander). Good price, though I wasn't blown away. The ones I took home heated up reasonably well the next day for a second meal. 

 Will probably try again another time, but next time earlier in the day."}
{"text":"I don't even like Latin American food and this restaurant had me dreaming about going back for more empanadas!  (Their salad also looked amazing)."}
{"text":"The Chilenita they have the best empanada in town. It's a great place to take out or sit down for lunch. The staff is friendly. The food is so good. The price is affordable. There no other place that has 13 different empanada's to choose from. I love the Chilenita."}
{"text":"Decent Food. Fair Prices.

While their reputation for empanada isn't completely undeserved, I find their pastry dough on the heavy side. The fillings, however, are delectable.

As for their other fare, everything from their sandwiches to burritos are well-worth the value, but I wouldn't consider this place for much more of a lunch spot if you happen to be in the neighbourhood AND happen to be craving empanadas or some other Latin flavour."}
{"text":"Ce charmant resto chilien doit absolument faire partie de votre carnet d'addresse. Niché dans un petit coin tranquille sur la rue Marie-Anne, La Chilenita offre d'excellents sandwich qui sauront satisfaire les appétits les plus capricieux. Entre le Churrasco à la viande et le Barro Loco, vous avez l'embarras du choix. Parfait pour casser la croûte en fin d'après-midi et rigoler entre amis."}
{"text":"Great selection of empanadas. I'd recommend La Champetre if you like meat, or the Spinach one if you're a vegetarian.

They also have a relatively diverse menu of Mexican fair and sandwiches. The burritos are massive and probably the best value on the menu, but the tacos are pretty good, as well.

They also have this hot sauce you have to ask for specifically. It's some kind of oil-based green salsa. They make it on site and it needs at least 3 days to blend (from what I'm told), and it's the TASTIEST HOT SAUCE I've found yet in Montreal.

Because it's made fresh, it varies in intensity, but it tends to range from very-hot to nuclear inferno. But no matter how hot the batch, you can still always taste all the different flavors in it.

If you're into hot sauces, I'd go there just to try it."}
{"text":"Great chilean restaurant. Price are very affordable and food is delicious. I recommend their sandwiches, especially the Barros Luco, a traditional chilean sandwich. Their empanadas are very good too with a great variety of choice."}
{"text":"I have been living in the Plateau area for one year now. 
I have had the hardest time trying to find good  restaurants in this area that will offer quality and good prices.
I discovered La Chilenita on the corner of de Buillon and Roy streets in the plateau area about 2 months ago.

FIRST VISIT:
I was happy to see a wide variety of fresh foods in the menu.I decided to try the BEEF Chimichangas to go..
OH MY GODNESS was it ever good
#1
i was 100% satisfied
YUM YUM YUM!
10/10

SECOND VISIT:
Two weeks later i was in the mood for the BEEF Chimichanga again and went back to the same restaurant and ordered my BEEF Chimichanga to go.

I live 2 streets from La Chilenita restaurant and when i arrived home my dish looked very different from my first time at La Chilenita.
The rice was the only same thing from my first visit..My salad only had  lettuce,dressing and black olives,the first time i had cucumbers and tomatos in the salad including the black olives,lettuce &dressing..this time 2 vegtables were were missing from the salad....
The creamy guacamole type sauce on top of the Chimichanga was a watery liquid and the BEEF Chimichanga i ordered was CHICKEN!!!

I was not satisfied!

0/10

THIRD VISIT...THE LAST VISIT!

I decided to give La Chilenita  another chance...
I decided to go back and try ONCE AGAIN the BEEF Chimichanga to go...and to see if the restaurant would have the same issues about consistency as they did 2 times before.

Well...again..the rice was the only thing on the plate that looked exactly as the first timei ordered it .This time the salad had carrots,black olives,dressing and lettuce...and my BEEF Chimichanga.....

IT WAS CHICKEN AGAIN!!!!!

Chefs who can't tell what is a beef and what is  chicken!


After my second visit i went on La Chilenita restaurant web site and sent them via their site a Email..I explained the issue as i did here and the reply i got was a cold :
thank you...

No sorry you were not satisfied
sorry we made mistakes in the order
sorry we do not train our people to make consistent dishes.....

Why is my BEEF Chimichanga never is the same as the first time i ordered it?

The issue of this place is consistency and paying attention to orders...
2 out 3 times i ordered the BEEF Chimichanga it was CHICKEN and i had 3 different salads!"}
{"text":"Empanadas trace their origins back to the Moorish period in Spain and are believed to be derived from the indian meat-filled samosas. Although there are many variants, La Chilenita, opened 6 years ago, probably produces the best Chilean Empanadas in town! 

I tried the \"La Chilena\", apparently the most popular choice, with its traditional filling which includes beef, onions, black olives, and a slide of a hard boiled egg. The lunch special came with a hearty lentil soup for $6.99! Also available by the unit, 1/2 dozen or dozen, you can order your a choice of 6 meat and 5 vegetable fillings!

If you stop by for lunch, there's also your usual mexican fare including tacos, quesadillas, chimichanga, salads and burritos. I tried the chicken burrito grande jam-packed with savory chicken, beans and rice - there's enough for 2 people. 

Come say Hi to owner Patricia, hawkeye lady who pays attention to the team who helps produce these pocket of love and practice your Spanish!"}
{"text":"I really love this place. The food is all made in house including the tortilla.  I have had several items off the menu and uave to say it is all good so far. The tacos are delicious the empanadas are fantastic and the burritos are thw best in town.

Keep up the good work!"}
{"text":"While this may not be a popular opinion, I had a horrible experience here and wouldn't come back. I ordered food and waited for it to be prepared, after twenty to thirty minutes I asked what was going on only to be told they were out of the kind I had asked for.  I was not given an apology and paid for a bottle of water and left.  I will not return to this particular restaurant."}
{"text":"L'endroit sans prétention où aller manger (ou en take-out)  des enchiladas ou empanadas (autour de 11$ l'assiette). Il y a 3 tables dehors sur Roy, emplacement vraiment plus agréable que sur Marianne/St-Urbain. C'est un petit coin tranquille,
à 2 pas du boul. St-Laurent. On y mange bien et pas cher."}
{"text":"Le Chilenita est un snack bar latino de première classe. Le menu coloré qui occupe un mur complet, nous met l'eau à la bouche dès notre arrivée. Le rapport qualité/prix est fameux. La salade verte et ses quelques légumes nappés d'une huile est délicieuse malgré sa simplicité. Mon burrito végé était d'une saveur et d'une dimension rarement égalé ailleurs. Le personnel est très accueillant. Je vais revenir c'est sûr!"}
{"text":"Nice little and clean place in Montreal. They have several items in the menu ( Chilean and Mexican food). We tried the empanadas. I've got the beef empanadas. The meat to onion ratio was good. The dough was ok but in overall basis very flavourful. One of the best I have tried in Canada"}
{"text":"A bright place, small and homey, with friendly staff.  The menu, written in colored chalk up on the back wall, is large & diverse and definitely not just empanadas.  

Tested the Chimichanga plate and La Chilena empanada.  (9.95 + 2.75 + taxes.  Enough for two euro-size stomachs)

The Chimichanga was a 10\" flour tortilla, folded to hide chicken that was well acquainted with the Maillard process, painted with a healthy layer of guacamole on top, served with a side of moist, savory, stock-cooked rice, and a romaine salad with olives and onions dressed with delicious, well-made vinaigrette.

The empanada was ground beef and black olives in a well-browned dense bready shell.

Everything, the chicken, beef, rice, salad, were all well-seasoned and good quality.

Carafes of self-serve water and cups are available in the bottom shelf of the drink cooler.

Order at the counter.  Dishes will be delivered when ready (about 10 minutes when it's quiet).  Pay at the counter when done.  Cash or debit, but not credit card.

Will definitely be back."}
{"text":"I love when restaurants clearly have a specialty, you just know that they focus on that one thing and do it right. La Chilenita is all about the empanadas, and man, are they ever good!

La Chilenita has 3 locations around the plateau, but I like this one the best because you can watch them make all the empanadas. Everything from flattening out the dough to wrapping them up. 

La Chilenita has a great variety of fillings for their empanadas, and about half are vegetarian. So far I've tried 3 kinds and they've all been delicious. I've also tried their churrasco sandwich, which was amazing, too. I may just have to try their burrito next.

For about $6 you can have a great lunch at La Chilenita , but unfortunately they close at 6pm (at least on weekdays). I found that out the hard way when I tried to pick up some dinner after work!

Update: They just posted summer hours, they close at 4pm now! This is definitely a lunch spot."}
{"text":"Delicious tofu sandwich and lots of veg options. Owner is a really nice guy and all the food is prepared fresh on the premises. Just good honest tasty food at decent prices."}
{"text":"This review is only for the empanadas.

I actually ate here and at Pachamama on the same day with some friends, and we all agreed that the ones at Pachamama were by far more delicious and juicy!

The empanadas here at La Chilenita are still alright, but just that. They are a bit bland and dry in my own opinion. NOTE: even one Chilean and one half-Chilean agreed with this!

In addition, here empanadas are pre-cooked and then re-heated, whereas Pachamama ones are ready from the oven fresh! 
This does mean service at La Chilenita is about half the time, so come here if you are in rush and do not mind quality

As for the prize, La Chilenita is $3.50 per unit, Pachamama is $3.25. Even if Pachamama empanadas are smaller, they will fill you out more as they are heavier and tastier.
Then, it is not even cheaper here.

However, I have been told the sandwiches here are really great! I will update this review when I try them."}
{"text":"Bonne qualité avec ambiance agréable et authentique! Seul bémol: l'assiette n'est pas bien garnie...outre le met principal, il n'y a pas d'accompagnement, ce qui est assez décevant."}
{"text":"La Chilenita offers THE BEST AUTHENTIC CHILLEAN empanadas in Montreal.  This is what they're known for.  If you've never eaten here before, then I implore you to eat at least one.  

The empanadas are always fresh and come in over 13 varieties filled with meat, fish and/or vegetables.  Don't worry vegetarians, there are lots of options for you.  If you swing by during lunch hour, you can get a soup or salad and an empanada for 6$.  The restaurant doesn't have a lot of room for seating, so if you're planning to eat lunch, you're better off showing up early to taking your food to go.  

The restaurant is often full of people eating, which is always a good sign.  I've seen people from out of town \"stock up\" on empanadas, buying dozens at a time.  I've been told they're very easy to freeze and reheat, just make sure you remember to eat your empanada with la Chilenita's homemade salsa.  Also, the restaurant closes between 4-6pm depending on the time of year, so show up early."}
{"text":"This place moved a block away   Look for yellow owing.  On the other corner"}
{"text":"J'avais vraiment un gros craving pour un Completo chilien et j'ai été bien satisfaite de mon lunch chez la Chilenita!

Ma copine et moi avons partagé un empanadas, genre de pâte fourée à la viande hachée, épicée avec une olive noire au milieu, un Completo, qui est un gros hotdog avec avocado mayo, tomates, et moutarde et un barros lucos qui est un genre de burger avec des tranches minces de boeuf mariné, du fromage, tomates, avocado et mayo! Vraiment c'était très très bon et le service bien sympathique!

Pour dessert, j'ai découvert les Cuchuflis Manjar fait maisons.... oh miam!!!! Description dans mes mots: c'est en forme de cigare, roulé dans une genre de crêpe, avec un centre crémeux qui goûte ce que le bonheur devrait goûter: du Majar! Selon mon amie, ce qui se rapproche le plus du Manjar, c'est de prendre une canne de lait carnation la déposer ouverte dans un bain marie et laisser cuire (devient brun) Ça fait un peu penser à du Dulce de Leche! Trop bon!!!

Mini bémol, il faisait plus froid dans le resto que dehors... on a mangé avec nos manteaux sur le dos! (Mais j'enlève pas d'étoile pour ça)

C'est clair que j'y retourne!!"}
{"text":"Tasty hearty basics from an unlikely grey corner tucked one block away from the park. The dough is a little heavy but warm and flavourful especially if you can come early in the day - in general I think they close around 4pm. The homemade hot sauce is delicious. A hot box of 6 of the traditional Chilenita empanadas with the ground beef and boiled egg makes for excellent Mount Royal meandering and picnicking food. Throw in a flask and a fall day and you've got a little piece of Plateau heaven."}
{"text":"I live around the corner and really like this place. Lots of vegetarian options. Good, simple food, good prices. The empanadas are fantastic- I usually get half a dozen to take home in a box- and their burritos are tasty. The beef is always thinly sliced and nice and lean. Family-run, friendly staff. Little area with plastic chairs and tables outside, shady in the afternoon. Come here to satisfy your appetite!"}
{"text":"FINALLY!  My dad was from Chile so I grew up eating Chilean empanadas.  Since his passing over two years ago, I have been on the hunt for the most authentic empanadas and this place absolutely nailed it! 

The dough is just like my dad's and the beef filling is the most authentic I have tasted, and I have tried just about everywhere.  This place is small, just a few tables.  Service is friendly and fast.  Great lunch deal for $6 and some change...empanada of your choice and a soup or salad.  Very filling, totally hits the spot.  

It's a block or two off of St. Laurent, a little off the beaten path but definitely worth the small detour.  This place is a real gem.  I just wanted to hug the huge glass front storage fridge filled with empanadas.  Sigh...so yummy."}
{"text":"Potentially the worst food I ever had in my life. Had a vegetarian burrito, for which I waited really long even though I was the only customer, and the green beans and onions inside were imbibed in this disgusting dark brothy bitter sauce, I cringed every time I tasted leftovers of those veggies which I had to remove. Felt nauseated all evening (was just in a rush so I had to eat it) . And was way overpriced."}
{"text":"A very good Chilean empanada.   

The crust was light and flavorful.   The filling was tasty and full of veggies, olives, beef, etc..   The setting is cute with indoor and outdoor seating. 
When I ordered my empanada, the lady put it in the MW first to warm the inside, then in the toaster oven to crisp the outside.   Even though her steps were appreciated, my empanada was still cold inside and the outside was not flaky nor crisp....And I waited like 5 minutes....!!

Still, the taste and the dough were very good.  I'd come back again, but ask for them to take their time with the reheating."}
{"text":"There are not many places in Montreal for empanadas, so this place already gets credit for that. The empanadas there are awesome, I highly recommend. Haven't had anything else on their menu, but it looks good."}
{"text":"I had the pleasure of going to this spot today around lunch time since I was in the area and I heard they make some great empanadas. I took 2 beef empanadas to go since u was in a hurry, looking around the small resto I noticed they had many variety of empanada from beef chicken and vegetarian options.

Biting into the beauty delights I was surprised that there was not only beef but olives, egg, and other delicious veggies in he empanada, and it cane with a spicy sauce which I wish was a lot spicier. I will definitely come back and try more things here, they also have tacos, burritos. Looking forward to my next visit, I'll make sure to take more pictures also"}
{"text":"I've only tried the empanadas here, but they're pretty darn good. Considering they make the empanadas in such bulk (they literally have hundreds in their display case at a time), it would be nice if they were a *tad* cheaper, but they're otherwise pretty affordable. The staff is pretty friendly. The places is crowded most evenings with people grabbing dinner platters after work, so the other dishes must be good, too."}
{"text":"Great place, the terrasse is really good in summer, up on Roy street, which is pretty calm too. Vegetarian options are really good, whether it's for a burrito, quesadillas or empañadas. I strongly recommend it."}
{"text":"delicious Chilean food \"Pastel de Choclo\" and the Empanadas were tasty. They served Mexican food as well and it's truly delicious."}
{"text":"Lindo lugar para la gente que le gusta los empanadas, tambien hay otros platos latinos y hay tambien café/expresso. Argent comptant et débit seulement !"}
{"text":"Had a classic mexican burrito which turned out to be a greasy mess of onions, black beans and beef.  Had me longing for a fancier Mission-style burrito.

Not really worth the price, place is a little run-down too."}
{"text":"Practically every country in the world has some variation of the meat-or veggie stuffed baked or fried turnover. In Jamaica, they have patties. In India they have samosas. In Turkey, they have borek. In Latin America, they have empanadas.

La Chilenita is ground zero if you want empanadas done right. Mind you there are regional differences among South American countries and how they make their empanadas (Argentines for instance fill their's with more meat). Here the Chilean varieties are served and with 13 different varieties, vegetarians and omnivores alike can both be happy and both kinds are delicious here.
The people who run the place here are very friendly and it's a great place to pick up a snack on the go. Why even bother with fast food joints like McDonald's when you have places like La Chilenita instead?"}
{"text":"Empanadas and chimichangas, queso fresco and Chilean spices. A delicious (and affordable) lunch for two, with a flavor authentic enough to trick you into thinking that the rain pouring down is the steamy mid-day shower of a Santiago winter, unlike the sleety Montrealais reality."}
{"text":"too salty, long wait and pricey items compared to other mexican food places. the deserts are all dry. I ordered the chicken enchilada, they ruined the wrap so i paid the same price for a different thing on the menu. will never be back."}
{"text":"I am addicted to their burrito grande and burrito ranchero. I usually order mine with shrimp. In fact I actually just ordered a shrimp burrito ranchero and it is on its way here. My mouth waters as I wait for it. Seriously amazing burritos. I have tried their veggie burrito primavera when I went last year with my ex and I can't say I liked it but the burrito grande and the burrito ranchero are out of this world."}
{"text":"Great value for authentic Chilean empanadas!"}
