{"text":"Are you lost? Run away from this place as fast as you can! Not only the vodka will ruin your stomach but also the horrible thing they call food. At $35 ($45 with taxes and tips) the holidays menu is a total rip-off."}
{"text":"Hands down best place in town for authentic Eastern european food. I can gladly say that the only food that can compete with my Babushka's home made pelmenies would be the ones served at La Caverne. I even brought my aunt when she came from Ukraine and she absolutely loved it. Would recommend to everyone."}
{"text":"This is a very cute and cosy restaurant. We were greeted with a smile by the owner. The service is friendly and courteous. This is THE  place to visit if you want to experience the most delicious and yummy Russian dishes. We enjoyed the cabbage rolls, vareniki and borsch!!"}
{"text":"This is an old fave of mine, their specialty soup is delicious, and the other russian dishes also. Good portions and helpful staff."}
{"text":"I have been many Russian restaurant and tried their food many times, but this place was one of the best Russian restaurant! Fantastic atmosphere, delicious food and most importantly great service !!!! 
Thank you for the great night, can't wait to go back :)"}
{"text":"J'ai bien aimé le concept ! C'est du russe traditionnel de A à Z ! Même la bière venait de la Russie ! Nous avons essayé l'assiette mixte pour gouter à tout ! Par contre, je ne pense pas que la bouffe russe est mon type de nourriture pref haha Je suis quand même très content d'avoir essayé"}
{"text":"Authentic Russian/Slavic foods are to be had here.

Don't expect your standard (horrible) run of the mill pierogi, you know the ones you can buy in the freezer bags at your grocery store and somehow make it onto restaurant menus, this is the real deal.

For sure try the Khartcho (lightly spicy & sour beef soup with rice), and the pork & beef Pelmeni (small dumplings), they're amazing.

It's a small place, located, as the name suggests, in a basement of sorts.
It might be a little hard to spot at first, since the sign is rather small, but don't let that deter you from your ultimate goal: Tasty stuff & vodka."}
{"text":"Delicious food, great atmosphere, and amazing service. The cuisine here is authentically Russian, with everything made fresh. Highly recommended."}
{"text":"Bah. J'avais faim.
J'ai mangé. 
J'ai même mangé à ma faim. 

Mais était-ce savoureux? Non, pas particulièrement.
Le décor est horriblement étrange. Animaux empaillés, photos du propriétaire avec des célébrités russes et québécoises (vraiment, pourquoi?), le style \"pseudo-caverne dans le sens que les murs sont peints pour donner un style caverne moyennement réussi\", la télé au fond qui joue des succès pop russes (on a déjà compris que la pop est la même partout, est-ce qu'on doit se taper les clips aussi?). 

On ne m'a pas servi d'eau ni offert quoi que ce soit même si ça faisait un bon moment que j'attendais une amie. La nourriture était très ordinaire. Le charme n'était pas au rendez-vous, et pour une assiette mixte un peu fade et tiède, le prix (au-dessus) de 20$ devrait être révisé à la baisse. Serveur bien gentil et doux comme un agneau, mais qui ne nous a pas demandé une seule fois si tout était à notre goût. 

Merci quand même, mais non merci, malheureusement."}
{"text":"Nous sommes allés sans trop d'attente et sans trop connaître les plats typiques russes. Nous avons bien aimé l'endroit (c'est petit) et le service était super! Nous avons goûté à la soupe (Bortsch) et nous l'avons adoré! C'est aux betteraves, mais ça n'a pas le goût amer de d'habitude! 

Pour goûter un peu à tout, nous avons partager l'assiette mixte ! C'était bon, mais disons que ce n'est peut-être pas notre genre de bouffe préférée! N'empêche, nous avons très bien mangé pour la modique somme de 48$ (à deux, avec une bière) !! 

Si vous voulez essayer la bouffe russe, je vous le suggère! Si vous détestez sortir de votre zone de confort, n'y allez pas, vous serez déçus ! La bouffe est très parfumée et disons que ce n'est pas le genre de plats qui nous enchantent, mais nous avons adoré découvrir leurs plats typiques!"}
{"text":"Probably not the best restaurant out there to eat by yourself but I had to try! 

I had the chance to taste the borscht soup which is a mixture of radish, cabbage, potato and cheese soup. It has this mill vinegar taste which isnt strong at all. It was actually quite delicious. They have 1/2 portion or 1 portion. If you want a meal, go for the one portion. They give out the brown molasse looking bread with the soup. The bread was good, a little dry for my taste. 

Another plus, you check in on Facebook or Yelp, you get a free cranberry and voyka shot.  

The decorations of the place reminds me of dragon rouge, a very popular québécois restaurant without the smile.It is medivial looking with pictures of the owner with family and friends. 

I wouldnt say I am not a fan.  I Will go back for a fuller meal next time To review it again. The soup has gained my trust for another visit."}
{"text":"First Russian place that I tried in Montreal, satisfied for a first time. 

The ambiance there is great, close for students of UdeM and HEC. 2 minutes of walk from the metro

Try it if you are looking for a new place to try"}
{"text":"Great cozy russian restaurant! Menu choices are delicious & authentic. Belyashi are a must!"}
{"text":"Beautiful decor with cozy family-run style atmosphere. Dining area is a big small and not ideal for large groups (can get quite noisy). Tasty but somewhat bland food. Good selection of dishes. Overall a bit pricier than what I'd expect from the dishes (sold at high 10's to low 20's, but felt it should be low-mid 10's). Live music entertainment on some evenings."}
{"text":"Russian cuisine has always been on my to try list for a long time and I've finally had my chance at La Caverne. The Russians are no joke - mounted bear heads and torso perpetually give the dungeon-like restaurant a robust feel. 

The service was straightforward but friendly. The obvious choice for me was the mixed platter considering the fact that I'm a novice. But because of my inexperience with the cuisine, I couldn't judge the authenticity of the food but I can tell you that it wasn't bad at all. I really loved the thick glass mug of kvas, a fermented rye bread beverage that somehow reminded me of plum juice mixed with beer. The frozen mug was perfect for the hot summer day that it was. 

I'd recommend this restaurant to anyone who wants to try Russian cuisine without the need to book a plane ticket to Russia. Montréal has very few Russian restaurants so consider this place your chance."}
{"text":"I went there with friends. One of them is Russian and she said it's quite authentic. I ordered soup, rolls and beef dumplings. The soup is served with sour bread. I didn't know that, so, I tried sour bread without soup and it is truly sour (lol). But when I ate it with soup, it tasted so good! I like the flavor of the rolls too. But, the dumplings are just normal. 
The service and ambiance not bad. If you want to try something different, maybe this small, cozy, Russian restaurant is a good choice."}
{"text":"A great place for anyone who wants to try Russian cuisine! I brought my friends here for traditional russian food, and we were not disappointed. My friend got the mixed platter which included delicious pilmeni! 
I opted for the \"herring under fur coat\" salad which was delicious. I will definitely be returning."}
{"text":"Interesting little family run place. We came here after a day spent snowshoeing, and appreciated the hot hearty food. 

After you descend into the basement restaurant, the wooden cottage-like decor and stuffed animals (a bear!), certainly get you into the spirit. A huge Russian family birthday party was adding authenticity to the place when we visited.

Now for the food: The Soljanka soup was wonderful. The other dishes mostly consisted of dumplings with pork and sausages, and were quite tasty. I would have liked to see more veggies, though. But if you are into hearty meaty fare, this is a not a bad place."}
{"text":"Our party of four waited for 40 minutes to be served until we left. The place was almost empty, just another party of 6 which was preferred by the server, so she ignored us as if we were not there. I guess the day before was a better day and they had no food left for all of us. No chef on duty as well so we decided to skip yesterday's food. I actually have doubts if they even cook anything in house and not just defreeze and heat up stuff prepared elsewhere. Not recommended."}
