{"text":"Food at La Casa Latina is near authentic Latin American food with a few more purely Mexican dishes on their menu.  The restaurant itself is small and a little run down, which tends to add to the authentic atmosphere.  The service was fine during my two visits there.  The food itself was only OK.  It didn't taste bad but it lacked freshness that would haven't taken it from OK to good.  Because of this, I also think prices are too high.  La Casa Latina is a dining option to keep in mind if you work or live in the 17th Ave SE area but I wouldn't go out of my way to get there."}
{"text":"This place is unmistakable in the beige food scene of Calgary.  The building itself is brightly coloured (reminiscent of restaurants I've seen in real hispanic areas) and inside I heard people speaking spanish!  The menu was very limited for me, as a vegetarian, but the couple things I did get were delicious!! The tostones (fried plantains) weren't listed as coming with meat on the plate, so that was kind of a surprise, but I just gave the meat to my dining partner and continued on unfluttered.   He is a meat-eater and heartily enjoyed his food.  The empanadas were soooo good with the pickled cabbage. The service was kind of slow, but it was a really busy night so we didn't hold it against them."}
{"text":"Had a dealfind coupon so, I would have liked to have eaten at Casa Latina and given a review but arrived to an empty restaurant with a sign on the door \"vouchers not accepted on weekends\" which was not on the coupon. Went in and suggested that since the restaurant was empty they make be able to accomodate us- lady went back to the kitchen to check and the answer was no. Drove way out of our area to get here but won't give it a second chance - unfortunate."}
{"text":"La Casa Latina is one of my favorite Mexican/Central American restaurants in the city (and yes I know that isn't saying much).  I moved to Calgary from Austin, TX so I've been very annoyed with the lack of quality Mexican food in Calgary.  I was so happy to find La Casa Latina.  The service can sometimes be a bit slow but the food is great.  You must try the pork and cheese papusas (definitely eat them with the pickled cabbage & hot sauce that comes with them).  I really enjoy the chicken flautas and the Pork tacos (can't remember the correct name).  Definitely worth the trip to forest lawn!"}
{"text":"It is a small but cozy business that offers a variety of dishes (Peruvian, Ecuatorian, Mexican, Chilean and Colombian) at a high price. It's very colorful in the inside and it's music is authentic, however I'm not sure the dishes are."}
{"text":"This is my second favourite Latin spot in Calgary. Their dishes cover many of the countries of Central and South America. The owners are from El Salvador, and I have always been treated to some very nice dishes and service. Some traditionalists might find the sauce and pickled cabbage a little spicy, but I am good with them. Depending on the time of day, there might only be one person that does the cooking and the serving, but everything is done fresh so that makes me one happy camper!"}
{"text":"I love love love Empanadas ever since I had one in Costa Rica and fell head over heels into food love. I was on a mission when I came back: find something similar. It was obsessive. I have been to many, many restaurants in search of my holy grail of deliciousness. And then, when I wasn't expecting it, deliciousness was mine!  We came early on a Saturday, and La Casa Latina was pretty busy. The servers were nice, although there were only  two in the restaurant. Still, they sat us down quickly in the colourful, adorable restaurant with glass tabletops... It was super cute, all yellows and everything!  We were actually there for papusas, not empanadas (having found some tasty samples of other empanadas in Calgary.) But, because the papusas are small, we decided to get the mixed plate too.  So! Papusas - the pork and cheese mix is totally delicious (so is cheese!). They were great (Papusas are like little pancakes of dough with stuff in them). But the fried empanada I had - corn meal and what I think was pulled pork on the inside, was just amazing - flavourful, heavy but light, delicious. Gah. Magnifique! And unexpected. And now I can't wait to go back and get my fix! The wait staff were super sweet when I got a little over-enthusiastic with them.   The prices didn't seem too bad in comparison to similar restaurants in Calgary. Highly recommended!"}
