{"text":"La Colombe proved to be a very fitting BYO for a special bottle of wine we'd been saving from our engagement trip.  We started out with a cheese plate, from which the standout was a delicious mellow French blue. The prix-fixe started with a cold asparagus soup, which had an excellent flavor and texture. The appetizers were solid but the main courses were more memorable: a filet of bison in a rich sauce with roasted beets and a black rice risotto, and veal with a delicious parsnip prepared with the consistency of perfectly mashed potatoes.   For dessert we tried a blueberry tart (good) and a panna cotta (excellent!) with coffee. All in all, the food was delicious, service was friendly and the atmosphere was relaxed and romantic."}
{"text":"We had high hopes for this place, which had been on our to-try list for years, on many visits to Montreal. We finally got around to it on this visit, walking in without a reservation on a Friday night to find there was lots of room. Was this a bad sign, given that its Duluth neighbours Au Pied de Cochon and Khyber Pass were fully booked? We were about to find out.   La Colombe offers a short prix fixe menu with BYO wine. There are some extra app choices and some premium mains and desserts, but otherwise, you get soup, one of two apps, one of about six mains and one of two desserts for $45.  The vegetable soup: disappointing. Just not enough of a flavour profile. Come on, chef, work a little harder! Break out the truffle oil or something! I can make better at home.  Apps: buffalo mozzarella salad: disappointing again. The fancy mozzarella had barely any taste, the whole thing was aggressively average. And the venison terrine? Might have been better if it hadn't been served on a soggy pappadum. Huh?  The mains were better - and elevated my rating from 2 stars to 3. The magret de canard perfectly cooked, in a lovely port and fig sauce; the lamb shank equally good. The accompaniments: perfect haricots verts and parsnips purée - nice, but exactly the same for both dishes.    And finally, dessert. Tarte au citron, and chocolate fondant with espresso ice cream, the latter a $7 premium. Both delicious, not too sweet, and a perfect combination to share.   Service was friendly, but unspectacular.  The room looks a little tired - needs an update.  Looks like La Colombe is a bit past its heyday. Too bad. We feel no need to go back."}
{"text":"Pour Noël, mes beaux parents nous ont offert un bon pour aller manger dans ce restaurant, nous avons enfin eu l'occasion de nous y rendre samedi dernier.  Il y a 2 services, un à 18h et un à 21h. Nous y sommes allé à 18h, le restaurant était plein mais très calme.  Nous avons commencé par un gratiné de chèvre chauds au miel qui était tout bonnement divin (j'ai tellement essuyé mon assiette que j'ai certainement du manger de la porcelaine). S'en est suivi un porc à l'ananas qui était tendre et excellent. Nous avons fini par une crêpe fourrée (j'ai un trou sur la garniture, mais ce qui est sûr c'est le nappage au chocolat  :D) qui était aussi très bonne.  Le service est extrêmement professionnel et le chef ne prend pas les gens de haut.  Il me semble qu'il faut compter presque 50$ pour la table d'hôte qui comprend entrée/plat/dessert, ce qui fait assez cher, mais du fait que ce soit un \"Apportez votre vin\" l'addition en est beaucoup moins salée.  Si vous avez un budget d'une centaine de dollars pour un dîner en couple, n'hésitez pas une seconde."}
{"text":"I enjoyed our experience here.  BYO wine was great... but then again, we were on Rue Duluth and on BYOW row.   Service was great, food was ok.  Still an overall nice experience!"}
{"text":"Excellent establishment. The dining area is quite small, but the environment is intimate. Together, the quality food and personable service made all the difference. The prix fixe menu is reasonably priced for a decent selection of well prepared foods, and we were pleased to bring two bottles of our favorite wines to enjoy with dinner. This is a highlight of a wonderful first trip to Montréal."}
{"text":"After a long, long day of meetings, our work associates hosted dinner at La Colombe. All I can tell you is they have seriously good taste.  I enjoyed the most sumptuous meal I've had in a long time.  It's a small, one room place, with a simple, french-inspired menu of  \"cuisine du marche\" or \"cuisine of the market\". And it's fixed price, no matter what course selections you make; though appetizers are extra.  I wasn't starving, so I went for a simple beet and greens salad to start. My entree was leg of lamb, and it was the best I've ever had...in my life: falling off the bone and perfectly seasoned, over a bed of what appeared to be black-eyed peas in bacon-infused sauce (I don't exactly know what it was, except Good).  Dessert was a perfect blueberry tart with a matching cup of perfect coffee.  La Colombe is BYOB. Our associates had taken care of this as well. Did I mention their good taste? They brought quite a bit of excellent wine, and they didn't seem to want to have any left over.  It was a good thing I took a cab."}
{"text":"Back when smoking was still allowed in restaurants, this place was a class of its own for being non smoking.  This is a rare culinary treat on the BYOW street.  Service is professional, cooking is excellent and accommodating:  I am a vegetarian and they made me a special wild rice risotto which was terribly delicious.  I recommend dining here!"}
{"text":"The restaurant is positioned perfectly with easy parking on the street and easy to find. The atmosphere is quite friendly and the waiters are all very nice and professional. On the other hand, the food is only ok. Nothing neither outstanding nor original there. It's good but nothing more. The Cooking of the snail was not perfect and the blue cheese sauce was not very perfumed.I always expect blue cheese to taste a lot, but it was only subtle. The cavatelli was good, but nothing more. The meat was not exceptional though. I took the beef cheek and my friend had the duck. The first was way better than the latter. And the pistachio cake was a little bland. There are still Laguiole knives which is always a nice touch. I appreciated overall."}
{"text":"The best kept secret in town!! An established restaurant that has proven over and over that the food has to be top to come back years after years to a restaurant! The chef owner Mostapha really cares about the meals and the combination as well as the quality of food. The meat comes form an elevage out in the country where he knows where the animals were raised and fed. The service is excellent with experienced staff, which makes all the difference. PLUS it's not everywhere that the chef comes out and check on you to find out if you liked the food. Nice touch! The Bring Your Own Wine is a great concept if you want some value dining out.  This restaurant sits in my top priority list of restaurant in Montreal! Great location and lots of windows. They also have a second floor.  Hurry and try it!!"}
{"text":"La Colombe was a Perfect Location for a large Group. We had 20 people and it was easy to bring our own wine and as a Prix fixe Restaurant, the food was timed well for 20 people. Food was also good! The veal was cooked perfectly!"}
{"text":"NOtE: The menu changes all the time. We came wanting to try duck in a can and various foie gras dishes like the burger, but none was available. You can order  few appetizers a la carte. Otherwise it is a prix fixe menu $45/person.  Bread- is it French to not serve bread warm. The bread was good but would be better if warm. 1. Asparagus soup- Surprise, it's a cold soup. Refreshing though nothing special. Reminds me of creme of asparagus but less creme as it was thinner.  2. Duck foie gras terrine-hubby liked it but it tasted like roast beef with a canned tuna texture. Tasted better w the spicy mustard it came with. 3. Salad- cherry tomatoes w mozarella cheese and veggie. Liked the dressing and the greens but again nothing special.  4. Pork mignon w pineapple sauce and spicy honey- Good texture.loved the pineapple sauce but didnt taste the spiciness of the honey. 5. Duck breast w cherry sauce-Duck was chewy w fat and somewhat of a liver taste to it. Had to cut off or spit out poeces of it. 6. Blueberry tart w almond-more tart than sweet in flavor. Nice crust. But nothing special 7. Panna cotta w mandarin layer on top-light and refreshing. Yum. Desserts come w tea and coffee. Portions were filling."}
{"text":"Food was spectacular. We had a prix-fix with a lamb and rabbit, wrapping up with panna cotta and creme brûlée. All amazing, highly recommended"}
{"text":"Nous y sommes allés mardi soir 6 personnes. C'était tranquille. Tous avons été ravis des saveurs et du service aussi. Ce restaurant est définitivement l'un des meilleurs parmi les restaurants apportez votre vin."}
{"text":"Un groupe de trente personnes pour souligner la retraite d'un ami. Utilisation de la salle du deuxième étage. Service professionnel et courtois. Table d'hôte à 40$ et apportez votre vin. Soupe quelconque. Tous les plats étaient bien présentés et corrects. Quelques personnes ont choisi le veau comme plat principal. J'imagine que le chef ne s'y attendait pas car nous avons été servis une vingtaine de minutes.....après les autres."}
