{"text":"I was in Montreal for a week and a half.... My only regret is that we found La Dora the last three days here (best three meals we had).  Three of us were in Montreal on business - following the Yelp reviews.  After a week of \"fails\", we decided to give La Dora a shot (risky move for this Yelp aficionado).  Highly recommend the pork chop.... Almost all the veal dishes are a age betas well.  The prices are very fair, the wine selection good and the service excellent.   This is a great Italian  Restaurant that still has that family feel.  Enjoy !"}
{"text":"Après quelque années d'oubli, nous sommes revenu à la bonne cuisine dans l'Est de Montréal....en effet, les bons restos y sont très rares. Les entrées sont généreuses et servies bien chaudes. En plat principal, les portions sont très suffisante et d'une saveur que nous avions oubliée...pour le vin, les prix sont très convenable et raisonnable. La carte des vins ne gâche pas votre sortie.  Ce restaurant familial offre un service attentif et sympathique. On nous apprend d'ailleurs la fermeture de LA DORA POUR JUIN PROCHAIN! Ce sera une perte car seul les chaines de restos seront disponible aux alentours...avis aux intéressés, ce resto manquera aux gens d'ANJOU."}
{"text":"Repas excellent avec un service souriant. La facture est bonne pour la qualité servie.   La nourriture italienne et des recettes ancestrales de bon goût"}
{"text":"I have eaten at La dora twice and I have to say that both times were excellent!  I had the veal with pasta and it was perfect.  The age range is mostly people in their 50's - 60's  I have no negative comments.  I highly recommend it!"}
{"text":"Very friendly service and owner was one of the kindest people you'll ever meet.  I had the gnocchi with cream and gorgonzola sauce, while my girlfriend had pasta primavera."}
{"text":"Il y a longtemps que je passais devant ce restaurant en me disant qu'il faudrait bien que j'y arrête une bonne fois. Enfin l'occasion se présente et j'y vais avec un ami. Cela fut un merveilleux repas, un excellent service et assez rapide, une escalope de beau cuite juste à point et juste bien assaisonnée. Accompagnée de pâtes juste assez piquante a la sauce tomate pour agrémenter le tout. Légume de saison croquant à souhait. Je regrette de ne pas y avoir été avant, c'est sur que j'y retourne pour goûter au reste du menu. Un service agréable, aimable, rapide, courroie et sympathique. Je recommande a tous d'y aller faire un tour."}
{"text":"The food here was incredible!! Upon first entering the restaurant you are instantly welcomed into their restaurant and what feels like their family! The staff is very knowledgable and extremely helpful with gluten allergies, and Susan our waitress was so personable! From appetizer to dessert, everything was outstanding!! Such a pleasure to eat here, I absolutely recommend coming here while visiting Montréal!!"}
{"text":"Went there the first time in the summer of 2014 had the lobster, which was ok but the pasta and salad was flavorless. Told myself wasnt going back, only if last resort. so went back 2 months ago, i ordered salmon tartar and there was hair in it :-/ never going back there again! And its quite expensive for the quality! The only 2 stars i gave are for the waitress which was very nice and for the wine"}
{"text":"******* ATTENTION ******** Ça semble être fermé définitivement ... l'enseigne n'est plus la et la terrasse a disparu."}
{"text":"Cute little Italian place in Hochelaga Maisonneuve.  Awesome service, good food, and to top it all off: cheap.  I like it. Don't expect fancy, go here when you want a plate of non-pretentious food in a friendly atmosphere."}
{"text":"We ate here while we stayed in Montreal. From the very first moment we arrived, we were greeted in such a friendly manner, with the staff happy to speak French, English, or Italian as the customers required. Got a nice seat on the front deck on a beautiful evening.  We got the Agnello Francesco (lamb), and the Vitello Parmigiana (veal) with pasta, and I don't think I've ever completely cleaned the plate as well as I did this time, trying to get every drop of the luxurious sauce that came with the lamb.  Really outstanding experience!"}
{"text":"I am glad i went here! The staff is very friendly and food is terrific. I had the \"Frutta di mare\" pizza and my wife had the tortellini. Will definitely be going back!"}
{"text":"Air conditioner was broken... So we sat outside on the terrace. Service was ok. We had a bottle of house wine : ok. We had pasta, was good. A bit pricey compared to restaurants around. We would go back"}
{"text":"Tonight was my second time trying out this restaurant. The first time I was definitely not impressed but I figured with the good reviews it had, I should probably give it another try. I was wrong.  Let me start by saying that although what other people might say, everything is pretty expensive for what you get. My girlfriend and I both had pasta (14-15$) this time thinking it was a safe bet- it wasn't. They were both flavorless and the sauce tasted like something you'd buy in a can at the grocery store. Although the service is good and the wine card is interesting, it doesn't make up for the fact that the food resembles/tasted like something you would get at your high school cafeteria."}
