{"text":"The salsa was delicious and super fresh! The chips were nice and warm. The manager was on it! He was not only checking up on his employees he was helping out! Our server Joe was great, even though he was in a hurry he checked on us regularly. The dinner portions were slightly smaller than expected, but my husband and I liked our pollo especial fundido, and chicken chimi with fundido sauce (even though the fundido was much spicier than expected since we're used to garcia's fundido). My mother in law was not impressed with the chile rellenos as she thought it needed cheese. Didn't try the drinks or desserts this time but will definitely be back!"}
{"text":"It's decent Mexican food. All the basics are here--quesadillas, enchiladas, tacos. Nice beans and rice. The chips and salsa are worth the trip. We had visited 3 times and were pretty sure La Fonda would make it into our regular restaurant rotation...until...instead of handing our waiter my Master Card, I accidentally handed over my debit card. 

No big deal, really, I thought, until the next day when my bank account was emptied. Coincidence? I really don't think so. I never use my debit card...seriously, never ever ever. I hadn't used it in SEVEN MONTHS until our La Fonda trip. There is no doubt in my mind that our server, or someone else who handled my card, has and is using some card-cloning equipment. My bank agrees.

If you go, use cash...

(A somewhat lesser sin that annoyed me? My companion's father was the first customer La Fonda restaurant had. The original owner had a dollar from him framed in the original restaurant. My companion was talking to the hostess and mentioned this, asking if they still had that framed dollar bill in the new restaurant, to which she replied, \"I don't know. Whatever\", and walked away. So rude. Not cool.)"}
{"text":"As a Californian when I leave my state its a bitter sweet thing to find a gem of a place. This place tastes great and the Fondito sauce is FONtastic! I hope I can come here again and experience this wonderful Mexican masterpiece."}
{"text":"I live in the west valley but had to drive over here to pick up my son from summer camp and it was lunchtime so we stopped in. When I walked in, there was no hostess. I waited for a few minutes and a very friendly girl greeted/seated us. I asked where the restroom was and she pointed me in the direction.  When I was several feet from the door of the restroom the smell of poop emanated from the bathroom.  Unfortunately, it was an emergency so I had to use it.  I told the server of the smell and she said it was plumbing and \"Sewage\" which had I not already been nauseous would have made me so. The restaurant was extremely hot, my napkin was rolled and it looked like used at a previous table and reused because it had dried up salsa on it.  So, I already decided not to eat. The \"salsa\" was watered down tomato sauce with chunks of onion and cilantro.  I ordered an appetizer platter for my sons because it was 1 pm and we were already there.  The tacos and chimichangas were super greasy and unappetizing.  I will never eat here again. Gross."}
{"text":"First, I hope La Fonda management reads these reviews and takes steps to improve their restaurant.  Second, we miss the bloody mary bar too.  Hubby & I visited LF a few weeks ago on a Saturday night for dinner. We asked the waitress a general question about a beer and she made something up that was ridiculously wrong.  Okay, she doesn't know beer.  We liked the chips & salsa, it was a good start, then I took a sip of my water.  What the?  I know what Tempe tap water tastes like, but this was weird.  The aftertaste made me cringe, I couldn't drink it, even with a slice of lemon in it, maybe it was the ice.  Hubby ordered chicken enchiladas, which he orders practically everywhere, and it was so bad he didn't finish it.  My meal was not memorable either.  I wanted to love this place, or at least like it.  We walked out of there terribly disappointed, I doubt we'll go back."}
{"text":"It's not the same as the old place. Sometimes change isn't the best thing...and sometimes playing 70's music while eating a taco is not the ideal genre for a mexican restuarant. Never again"}
{"text":"I'm not a picky person and I don't typically complain, but I have never eaten food that tasted this bad. The queso looked like it had been sitting for days, the carne asada was horribly seasoned, and there's not much good that I can say about the carnitas. The biggest mistake I made in all this was not rating this place a no star establishment."}
{"text":"A Mexican restaurant that plays Lady Gaga and Huey Lewis... let that one sink in for a moment. 
The food was pretty mediocre, nothing that really stood out from other Mexican restaurants. 
Asked for no salt with my $11 margarita, got salt..."}
{"text":"It was delicious!!

Margarita was weak and not so good. Beers were cheap and chicken taco was fabulous!! Salsa is delicious! Yummy night out! Fun and friendly."}
{"text":"My wife and I eat at La Fonda's a couple of times a week.  We do this for several reasons. 1) the food including the chips and salsa are wonderful 2) the prices are great. 3) the staff and owner are very personable.  They treat you like family.  They are very attentive and go out of their way to take care of their customers.  When I read comments like \"it takes so long to get our food/drinks\" or \"the staff was rude\" I have to wonder if these people are at the same restaurant because we've never experienced any of these problems.  I say when it's busy...relax.  When you want another bowl of chips, another drink or your check, simply wave over any staff member.  Believe me they'll take care of your needs.  Also, to the last review I just read...if you want a true one-on-one experience maybe you should try sitting in the restaurant area and not the bar during happy hour!  Just sayin!!!"}
{"text":"My wife and I were excited to eat here as we live around the corner from this place.  Unfortunately we were very disappointed with the food quality.  The chips and salsa were good and the chips served hot.  You get a hot sauce and chunky mild salsa with the chips.  This was the only high point.  Everything else ordered was not fresh tasting.  My wife ordered the fish tacos which tasted like they used frozen fish sticks from trader Joes.  My dish was a combo plate of Green Corn Tamales and Spinach Enchilada.  Both of these items were lame.  The spinach tasting like it came from a frozen bag and the tamale was mushy and bland.  The rice and beans were also bland and lifeless.  Salt and pepper didn't do anything to help.  When the server asked how our food was we told her not good and we would not return.  We got no response from her except the check.  If the food does not improve here it will not last.  Too many good Mexican food restaurants to waste your time and calories here."}
{"text":"My family has been going to La Fonda for over 30 years, since they were at their old location in North Tempe.  It is a family favorite and a place we always look forward to going to!

I love their fresh hot chips, and their 2 different kinds of salsa.   My favorite has always been a bean burrito enchilada style, and even after they moved they have not messed that up.   

Thanks for 30 years of good food & memories La Fonda!!"}
{"text":"La Fonda is your basic Mexican food restaurant. Nothing fancy, but also not a dive. I like the food very much. Again, nothing fancy, but quite flavorful--and the portions are generous. I've eaten at La Fonda for many years, mostly when it was in south Scottsdale (or was that north Tempe?) on Rural. Now it is only a half mile from my house, so I go more frequently. Service is quick and pretty friendly, though I tend to eat out at slightly off times in order to avoid waiting. If you live in Glendale or Arrowhead, there is no need to make the long trip to try the food. But if you are anywhere near Baseline & McClintock in Tempe, you should try the restaurant at least once."}
{"text":"Great food, great service, great ambiance, the makings for a GREAT night out... Prefer anything with fundido sauce on it... It goes great with the refreshing margaritas that are all two dollars off for happy hour... Love you LA Fonda..."}
{"text":"My mom and I ate there last night. I had the Vegetable Fajitas and she had Enchiladas and the Food was FABULOUS and the service was FABULOUS!!!  I'd eat there every day if I could !  I don't see any truths to any unfavorable reviews for this place.  I've been a customer 30 plus years! You're missing out if you don't stop in! The chips, salsa and hot sauce were perfect and no we didn't have to ask for hot sauce,  they asked how many we wanted!"}
{"text":"I love this place! I can't Get enough! My best friend and I stumbled upom the scottsdale location one day and we were hooked. I take all my friends here and my sister is hooked too. One of my friends is gluten-free and the manager came out and talked to her to make sure her food was prepared to her needs. 

The chips and salsa are so yummy and I always get guacamole to go with it too. The taquitos are so yummy as is the green chile burro, taco salad and fajitas! I love this place!"}
{"text":"It's Saturday night at 8:29pm. Sign says they close at 10:00pm... Girl says they're closing early for the night. 
Yeah, o-hell-a early... Shame, this place has decent food if you ever have the chance to order some."}
{"text":"I can't lie. I went here because of the hilarity of the place's name... and Serrano's is closed on Sundays.

Having a strong hankering for some cheap American-ized Mexican food, we went here on a Sunday afternoon is hopes that La Fonda would be a lady and put out something good. Although the interior is pretty and they have a sperate dining room and lounge area which is nice so you don't have to sit with screaming children.

I guess we just ordered the wrong dish because neither of us were exceptionally impressed. Now the salsa was kick ass but the taco salad and chimi were not. I think I picked the wrong option with putting ground beef in it.

What also was unimpressive was that the salad with gac and sour cream added was $12. Ugh. I'd honestly give La Fonda a 2 score but our waitress was very nice and pleasant."}
{"text":"I wish you could give a place zero stars. We ate there last night because an old friend was in town and wanted to take us to this place because he used to love it years ago. I warned him that things change... but no, we went.
This was the worst Mexican food - let alone any food - I have ever eaten in Phoenix. The chips were cheap, the salsa \"fresca\" bland and warm, the hot sauce right out of a can...yuck. I ordered a cheese enchilada and a tostada thinking that they would be the easiest to not screw up.  Oh man, the enchilada was flaccid, hardly any cheese and the red sauce bitter, again, right out of a can. In fact, I think it was the same sauce they serve with the chips, only cold. The beans on the tostada had no flavor.  They serve no salsa with any entree. My husband had a tamale that did not even look like a tamale. Someone else had the fajita salad which was not edible because of all the refried beans on top. Don't even get me started on the frozen margaritas served in a water glass...
The service was slow, but we were a large group. The worst part was that when they were clearing dishes they were piling them on a chair in the room.  Classy.  Also, the fan right over us was blowing gale force and could not be turned down, so even if you wanted to eat the food, it would be cold.
People, do not waste your money! If you think this is good, you had better branch out and try some other places."}
{"text":"Had a late lunch here on Sat. Friend highly recommended it.. good high quality food, just a bit bland for my tastes.

Salsa is great, fresh made daily and good corn chips also.

If you don't like your Mexican food too spicy then you'll like it."}
{"text":"Great Food, reasonable prices, enjoy this place quite a bit... regular stop!"}
{"text":"Tried to go to dinner here. Was told there was a 30 minute wait, said that was fine, we will sit and wait in bar. Nope 30 mins wait for everything bar and restaurant! But lots of open seats in the bar..didn't matter. We left shaking our heads as did next 2 couples that walked in behind us. I think they need to rethink their seating policy."}
{"text":"Came here with my husband the other night for a meal.  It is pretty close to the house.  We typically don't love american mexican food.  To much fat and cheese.  This place was decent- not gourmet by any stretch but you can certainly get your mexican fix here.  What I liked: The salsa.  It was really tasty.  I hope they make it there it had just a great fresh flavor.  The chips were warm and salty to.  What I wasn't a big fan off:  the marg was just meh.  I have had way better.  Only refried  beans?  We like whole and find that most places are now offering a choice.  The flour tortilla didn't taste fresh to me. 

I might or might not come back.  There is such a selection of mexican food around here that is really really good."}
{"text":"Second time coming here, food was really good, waitress didn't get two of the orders correct, only wrote down beef, didn't remember who got shredded beef and who got the ground beef, the kitchen got my order wrong, ordered a shredded beef chimichanga and got shredded chicken. Waitress apologized for mixup, offered to get it fixed, but they were already half way done eating"}
{"text":"Once again I ate at La fondas and the food was amazing! The chips came to the table nice fresh and hot!! The street tacos are one of my favorite things to eat but I had the chicken fajitas for something different and they were fantastic! It's always clean and friendly when I go in. Actually took some food home for my family I'm going to go was also very good!! I will be returning to LA fondas again real soon!!"}
{"text":"I love Mexican Food. Better yet, I love good,great Mexican food. Maybe we came on a good night. But, I was very happy with what we got!
This was my first time here. Though Mario has been here many times.
The Chips and Salsa were very good and they refilled them for us several times. I got the shredded meat, even though I am not a huge meat eater, this was very tasty and I would order it again.
It seemed like it had been cooking all day. So it was tender and very tasty with whatever type of spices they put in.
Lots of food of course ,I had to get the rest to go. The server was very pleasant and the restrooms are clean. It was a tiny bit cold inside but, that is better than being hot. So I have to say I really like it and would go back any time."}
{"text":"I went in for apps and drinks with a friend. The place is nice. Nothing spectacular, but better than most. The appetizer platter was really good, margaritas were a little sweet and soury. It could have been better, but for the very inexpensive price it was worth it!"}
{"text":"Excellent! Went there today for the first time and was REALLY IMPRESSED! First of all, the service was prefect, it seems so rare these days to have a server who smiles. Ours was really pleasant and she never left us feeling forgotten. The food was exactly what I was craving! The queso fundido was yummy, not too Spicy but totally not bland. I tend to customize my orders wherever I dine, and I received it just as requested! Delicious Mexican food with a beautiful and clean atmosphere!"}
{"text":"Blah I am so tired of not finding a good mexican food restaurant.  I took the word from one of my cousins that this place by my house was good.  This place was full. Nicely decorated.  Service was good. The chips and salsa were okay.  Salsa was not at all spicey.  I asked for a hotter salsa they said the other one is a smooth one from bottle... I dont know if im just so used to homemade salsas or what.  I ordered a chili Relleno plate with a flauta. Flauta was good, but no salsa for it :(. The chili relleno was horrible.  It felt like I was eating an omlette.  The egg was wrapped around the chili and chedder cheese was all over it. Chili Rellenos are dipped in the well beaten egg whites... my husband ordered his fajitas. But he took those home cause he wasnt feeling good from work."}
{"text":"I had my 1st La Fonda experience with the daughter's location that opened down in Chandler. LOVED their salsa and the fajitas. Yum! We used to eat there a couple of times a month. When I moved to Tempe, I remembered that the original location was somewhere nearby...then...I saw the coming soon sign go up. I hate to admit it, but I would drive by and look for sign updates.  I was so happy to see it finally open. We stopped by around a 5:30 on a Friday night, but ended up leaving. The wait was approaching an hour and a 2 year old will NOT wait an hour for dinner. We came back a week or so later for lunch. The chicken fajitas were just as yummy as I remembered them. I got the cheese crisp and beans for my daughter; however, she was less than eager for either. I was less than eager to see the bowl of beans on top of her cheese crisp?  Would have rather had it served off to the side rather than the bowl on top of the cheese.  Quite a bit of the cheese stuck to the bottom of the bowl when I removed it.  =/  ."}
{"text":"My husband loves this place but I find the food average. Don't get the chile relleno! Instead of the fried and crispy version that everyone knows and loves, La Fonda's version is a cheese-stuffed pepper wrapped in an egg crepe. It was soggy and unappetizing. I also ordered a carne asada taco, expecting a crispy shell like the ones that came in our appetizer. Imagine my surprise when I got a soggy taco with two soft corn tortillas as the shell. The meat filling at least tasted okay. If you're okay with Americanized-Mexican food, you might enjoy La Fonda but don't expect anything authentic here."}
{"text":"We came here for my bday. I like to try different places. The service was great, the atmosphere was really good, but the food was ok. Nothing awesome, but good none the less."}
{"text":"Great carne asada tacos and their chips are always so fresh! Love coming back here when I am in Phoenix. Always have had great fresh food and great service here."}
{"text":"Food was good with a nice hot sauce and chips to start! It's hard to find a good hot sauce that tastes great and has a kick!
Server in the bar was attentive, but it was also a late lunch.
The waitress told me to come by on a day off or after work bc they have $3 Dos Equis drafts every day all day.
I'd come back if on this side of town again for lunch, fast service as well."}
{"text":"Carne asada chimichanga fundido style is delicious, one of my favorite items on the menu. Flavorful carne asada cut in to cubes, covered in a slightly spicy fundido sauce. They also have the best fresh hot chips thin tortilla chips. The hot salsa that they have is really good but can sometimes vary in spiciness, there have been a couple of times where it has been much hotter then normal."}
{"text":"If there was a zero stars that's what I would have given.  This used to be our go to spot for Mexican.  They used to have the best salsa and chips and their Carne Asada nachos were the bomb. We were bummed when they closed the one on Alma School and Queen Creek but we moved from that area and would hit up the Baseline location.  But after last night, unfortunately we will not be back and we had a party of 8!!!  The chips tasted like grease, the salsa was nowhere near as good as it used to be and the Carne quesadilla I had was just gross.  My husband had the fundido burrito and his stomach was really messed up from it. It didn't even look right when the server dropped it off. no bueno"}
{"text":"Still the same great food and service in a new much larger location, with an actual sports bar!  If you like the old location, you'll love the new location!"}
{"text":"To start, 2 meals are about 30 dollars, no problem if the food was up to par. The beans tasted canned. The tortillas were sour tasting and looked like the ones you buy at the store and heat yourself. Everything else was pretty greasy. Will not return."}
{"text":"HORRIBLE!  We were so excited too!  We visited La Fonda tonight for dinner around 5:45pm.  There were 6 people in our party and we were told a 25 min wait.  I didn't think that was too bad.  We were offered a table in the bar, but had kids with us and didn't want to sit at a tall table.  The wait was about 25 min.  When we were shown to our table my Mom (who had on white capri pants)  barely bumped the chair next to her with her leg when sitting down and got a nice brown wood stain, stain on her pants.  Weird their wood stained chairs would rub off.  When we told the girls up front all they said/offered was,  \"Oh, we are sorry!\"  That's it.  To me not okay.  Now on to the food...
My brother ordered a cheese crisp as an appetizer.  We waited and waited.  Seriously about 25 more minutes.  Finally asked the server who was like, \"Oh, let me go check\".  He brought it right out which was about 2 seconds in front of our food.  So you think you can't mess up a cheese crisp, right?  Just cheese on a tortilla?  Well they managed to somehow.  The after taste was like burnt oven or oven type cleaner, maybe?  Awful.  I ordered the 3 item combo.  Fish taco, carne asada taco and cheese enchilada.  Fish taco was good.  Carne asada taco tasted like Pastor, which was kinda odd.  It wasn't bad just didn't taste like carne asada.  Cheese enchilada was terrible.  In fact you could tell that plate had been under a warmer for quite some time.  There was a layer of grease on top, which did not look appetizing. Instead of being covered in red sauce it has some type of red spicy chili sauce inside.  It did not taste good.  Even the beans and rice that came on the plate were bad!  The beans tasted like crushed up Ranch style beans and the rice had zero flavor and was so seriously clumpy the nicest thing I had to say was that it was easy to get the clumps onto the fork.  I am so disappointed this place isn't good!  We really wanted a new restaurant to visit in the area.  I am not overly picky about food...at all and please let me tell you to save your money or at least go get good Mexican food at Rosita's or Manuel's, that are in the same area.  We will not be back :(  OMGSH I almost forgot!  My son ordered the cheese crisp and beans off the kids menu and when they brought it out they had the bowl of beans sitting in the middle of his cheese crisp.  Who wants the bottom of a bowl in the middle of their food!?  Is that even health code okay?  I asked the server and he said, \"Oh, that's the way we serve it\".  GROSS GROSS GROSS!"}
{"text":"The worst food we have eaten in a restaurant. We had a Machaca and Enchilada Trio. The beef in the Machaca looked like it was a week old and tasted like it- dry, overcooked and tasteless. I have had better tasting beans out of a can. The rice was passable. The soft corn tortilla was leather-like and tasteless. The beef enchilada had a sauce that tasted chalky and tart-terrible. The beef must have been the same beef in the Machaca. The chicken and cheese enchildas tasted terrible- like supermarket frozen fare. 
When we first sat down my wife went to the bathroom and while she was there the waitress pestered me twice asking if I was ready to order. Learn how to do your job."}
{"text":"Great service, really good salsa, fresh chips and actually delicious food. I will definitely be back and will recommend this place to friends!"}
{"text":"Have been here several times but won't be going back after our last visit. We went for a family birthday meal and everyone was sick the next day. No Bueno."}
{"text":"Okay, first trip here but have been driving past and couldn't wait to try it- we were finally able to since we came in Sunday, as we have tried going there Mondays and they are closed (inconvenient). My house marg was decent, the chips ok, salsa was fair but the hotter of the two tasted like canned tomato paste with some spice added haphazardly. 

Unfortunately, the service was awful. Side plates and silverware and napkins are nice to have... Refilling iced teas, the waitress asked if my fellow patrons would like more ice, since it had been so long all the ice melted. The obvious answer is yes please more ice, this being *iced tea and all. The pollo fundido was too smothered and too soggy, the rice and beans were decent. My boyfriend's chimi didn't have much meat There was a mix up with our check which topped off the Poor Service Cherry and the waitress didn't seem too concerned or bothered by overcharging us by $20 when we brought it to her attention. 
Also, for being brand new I was surprised to find the bathroom smelled like sewage, come on, that's gross. 
With all the mexican food restaurants in the area, La Fonda falls short."}
{"text":"I've been a regular at the old La Fonda (curry and scottsdale rds) since time began.  They always satisfied.  Then the entire strip mall was sold and everyone had to leave.  I was sad.  I was thrilled to find they were relocating right next to my favorite chinese restaurant, Wong's Place, on Baseline and McClintock.  Couldnt wait for them to open.  A really nice upgrade in the design of the new digs.  However, each time I ate there, the food was different.  The last two times the food was so salty we had to send it back.  This is usually a trick to keep patrons thirsty and ordering more alcohol.  However this is not good for high blood pressure.  I personally would fire any cook that cannot taste the salt levels in food.  Just thinking about it makes me sick.
I will NEVER eat there again.  They've lost my trust."}
{"text":"Very family friendly. Food was really good and the atmosphere was pretty relaxing. The music playing nice and low so we could talk without yelling. The waitress was very prompt and friendly."}
{"text":"Note to self: check Yelp reviews prior to going.

We passed by this one evening and thought we would try it.  The building used to be occupied by a biker bar called \"Chuy's\".  Every time we drove by their were lots of Harleys.

While the food is average, the service was atrocious.  Granted that our server was busy but it took three requests in order to get something.  One of our group had to physically get up from the table and search for the server.

The manager does not visit tables to see if everything is acceptable.

This was a shame.  We usually enjoy going to \"mom and pop\" restaurants.

After going I checked Yelp and based on our own experience, you don't have to be Sherlock Holmes to connect the dots."}
{"text":"After almost 3 years of living in the neighborhood, we decided to check this place out. So on a Wednesday night, at 6:30 p.m. we walk in, to give it a shot. After standing in the lobby for 15 minutes, we decided to seat ourselves in the cantina. We sat there for a few minutes waiting to be greeted, but had no luck. I went to grab a menu, so at least we could see what we wanted. More time passed, so we left. The restaurant was not busy at all, so I am guessing the lack of service can be attributed. However, Senor Taco next door, always greats you promptly, the food is amazing, and it is 1/2 the price!"}
{"text":"I love their tortilla chips and salsa, they're made fresh and they're not only crispy and warm, but free! I'm addicted to their spinach enchiladas with the spicy cream sauce. So much flavor and even when I'm stuffed, I still want to eat those things. I don't drink alcohol so I'm not sure how their drinks are but everything else is amazing!!! The staff is very nice and speak English very well so I never feel intimidated. The atmosphere is relaxed. Dim lighting, nice music, the decor is appropriate and some pieces look like they are really old and handmade. Every time my fiancè and I go, we never have to wait and always get parking in front of the building. I honestly don't know how this place isn't packed on a daily basis. Give this place a shot, you won't regret it! Perfect for date nights!"}
{"text":"Great family restaurant .. Wonderful service and generous portions ... The Chile sauce (salsa for the gringos ;) )
Could use a little more spice ;)

The address in Apple maps shows it on the other side of the street  I was looking left - it was on the right ...
Easy enough but a heads up"}
{"text":"Saturday night at 8pm there was no wait for a table. Chips literally have steam coming off of them. Salsa is tasty. Service was fast. I had spinach enchiladas and my husband also had the enchiladas with egg. Very good food. Large portions."}
{"text":"The Carnita dinner special has me coming back again and again. Just delicious. I'm sure everything else is too. I just can't get away from the carnita. Plsss try it!"}
{"text":"chips,salsa,authentic mexican food and if you love a great sauce try the fundido sauce there is kick but verall its great!"}
{"text":"Extremely disappointed in the dinner I had at La Fonda. The service was terrible. It took ten minutes after we were seated for a server to come take our first drink orders. Then another ten minutes before they actually came.. It was 3 waters and a tea, come on now. Then we were served chips and salsa and for some reason this is the only Mexican food place that doesn't give out side plates so the table was full of salsa that had fallen off the chips. Of course we never got napkins or silverware until we asked so it was quite hard to clean up. 

When our food came so did more disappointment. I order a chimy and it was all tortilla with a little bit of meat in it, the flavors were nice but I would have liked more meat with the food. The server only came around one more time to refill out empty drinks and then got an attitude when we asked if she didn't mind putting more ice in the glasses. Sorry we had to chew on all of our ice because it took you 20 minutes to come by our table to refill the drinks. 

Once the check came she charged our credit card to another tables meal and came back with a receipt over $30 than what ours was. When we brought this to her attention she didn't even apologize she just grabbed the tab and came back with the right receipt and the voided out receipt of the first charge. 

Overall I know I won't being going back, such a shame too, they spent so much time putting the place together I had such high hopes. Food was just alright and service was terrible. Not worth the $$"}
{"text":"We should have known by the space heater blowing behind the front lobby podium that the owner was trying to save money by not setting the thermostat at a temperature to make customers comfortable. We went there in December and the place was freezing. I asked the waitress and the owner to turn on the heat. The owner said that it was on, when it obviously was not. I replied, \"Well, could you please set it higher to warm the restaurant?\" She then said that it couldn't get warm because the ceilings were too high. It was so cold that I kept my legs moving constantly to generate heat, I gave my sweater to my little girl to wear on top of hers, my husband removed his sweatshirt and gave it to me and we ate as fast as we could.

My husband ordered soup to warm him and it came completely unheated! The waitress discovered that the soup warmer was not turned on. The rest of our meals were not good enough to make us want to return in the spring."}
{"text":"I been going to the La Fonda establishment for over 27 years. But since they moved to their current location I been hating this place more and more. They have become really stuck up and rude. In fact on Cinco De Mayo they went and sat these other people before us even though we were there first. They also give us soggy nachos. Their salsa is starting to taste like canned salsa. Luckily I found another Mexican restaurant in Mesa that has better food and salsa. So it looks like I'm going to retire going to this place."}
{"text":"Last trip here. Very poor service. No server for 15 minutes after our family of four arrived, then took 40 minutes to get food. We saw other parties arrive after us and get served in a normal time. Just our luck I guess. We stared forelonely at our empty chip bowl as orders went to other tables. Not like they were so busy it was getting backed up in the kitchen. Think our server just forgot to put in our order.  Not surprising, since she forgot about us arriving. Turned it into a very poor experience I don't want to repeat."}
{"text":"Service was good, chips and salsa good... my chicken fajitas omg probably 4 oz of chicken if you love onion and peppers was plenty! Beens taste bad, tortillas really bad!!"}
{"text":"Always a great place to meet friends, have a margarita and eat really good food. I love the mini sampler platter. It's the perfect size portion of food. Margaritas are yummy and service was really good. As good place for families as well."}
{"text":"So I just order this quesadilla from ubereats took like 1 hr to get it and I guess someone eat the salad?"}
{"text":"Their food is tasty and standard. There's nothing trendy or particularly regionally distinct about this restaurant. They serve pretty typical, generic, Americanized Mexican offerings, with lots of cheese and sour cream and gloppy sauces. That said, I like it! It's yummy and filling, and you get good portions for the price. Their salsas are amazing...the chunky salsa is one of the best restaurant salsas I've ever had, and the chips are warm and crispy, with just enough salt. 

I rarely eat in anymore, but when I did I was not impressed with the service. One evening a server \"lost\" my card, and he brought it back to be 15 minutes later, miraculously \"found\". A few days later, there were several unauthorized charges on my bank account. I'm not sure this was coincidental. On other nights, service was slow. Waiting around for refills of water is a major restaurant pet peeve of mine, and I learned quickly to just bring a bottle of water with me when eating at La Fonda, because refills just weren't going to happen in a timely manner. 

Their take-out is awesome. The woman who takes our order is polite and competent. It's prepared quickly and packaged well. We get takeout from La Fonda every couple of months and it's always a success."}
{"text":"we ate dinner there last night no problem with the food was great and awesome as it always is, great job chiefs. Service though was not very good, our waitress seemed to know the menu pretty well, but her listening skills need a lot of work. I had the mini combo and I asked for all beans and no rice, well I got both. I also ask for more ice tea 3 times and received no refills. AS far as the chips and salsa we got one helping and in the bottom of the bowl was nothing but oil. No refills on that either. So from now on I am going to have to ask to sit in any other section except hers. We eat here a lot and service has never been an issue. This all happened on 8/13/2014."}
{"text":"Third time in a row same result.  Good food but poor service.  Had to ask for water and salsa refills.  Waitress was very inattentive."}
{"text":"I've been coming to La Fonda - Tempe for over 40 years.
Great chips and Salsa
Great food."}
{"text":"New location in Tempe,  recommended from memory of the previous establishment on Curry. I was ready for a wow experience.  The interior is clean, nice wood furniture,  although minimal decor.  Service was average,  not a high mark for hospitality. Menu prices are affordable,  although I feel the food lacks flare and flavor.  Overall, not much atmosphere,  server enthusiasm or exciting food. I would say it's a mid range Mexican food experience.  Try for yourself,  you're opinion may vary."}
{"text":"Food and server were good. I always find it hard to swallow a place that charges $10-11 for a burrito. I live close and I was hoping for a new drinking spot to walk to that may take the place of the loved Chuy's. Nope! They are serving Coronas for $4.50 each. A 6 pack is $2 at the store.Why bother. They need to reduce their beer prices and get better happy hour and reverse happy hour specials if they want business. Will not go back until I hear of better prices and specials. Chuy's was cheap and good... learn from the success of the company that was there."}
{"text":"Started eating here when it was off of Scottsdale Road North of the 202 In a shopping mall. I really loved this place then. Found out they moved and stopped in and really enjoyed it again! I had a red chili burrito with a side of rice and it was very good. Been back a few more time after that and tried a few more thing and all I can say is it's worth your time to give La Fonda a shot!"}
{"text":"Moved into the area almost a year ago and we've been here more times than we can count! The food is always delicious and there's never a wait! Love this place!"}
{"text":"Tried the three-item combo with a tamale, enchilada, and flauta. The food was amazing and the lunch portions are huge. Wish I had room in the tank to try the flan. Until next time"}
{"text":"La Fonda is my go-to place for Mexican Food and has been for over 10 years.  I was beyond thrilled when I heard that they were taking up shop in my neighborhood.  Since they've opened their new location I've been there almost weekly.  

For what it is, a classic Sonoran Mexican Food restaurant, it really cannot be topped.  During their several-month hiatus, I visited other local restaurants that have a comparable menu, desperate to fill the La Fonda void, but they all fell short.

Their move came with a few major upgrades, including a made-over dining room with fireplace and a bar! It will be great to watch the Cardinals there this season!.  It took them a few weeks to get the place going...hence the early reviews that were not so flattering.  I really hope that these individuals give the place another chance because they are really missing out.

The one thing that didn't change was the food, thank God. In fact, I think it's better.  They kept the classics as tasty as ever while adding a few new menu items and excellent drinks.

My favorite is pretty much anything \"fundido style\"...a creamy cheesy sauce with just a twinge of heat.  There are no words to describe it... but if I am ever offered a \"last meal\" I want it smothered in fundido.  I like the build-your-own-combo option because it's allowed me to try different things.  My favorite combo right now is the ground beef enchilada fundido style, with a green tamale and rice and beans.  Its a bit too much food for me but I've been bringing my leftovers to work the next day and it is just as tasty reheated!

1 star for the food, 1 star for the best chips and salsa in town, 1 star for the brand new bar, 1 star for the excellent staff, and 1 star for FUNDIDO!"}
{"text":"Solid Mexican food spot located in a nice Tempe location. I've gotten orders for dine-in and take-out and have been pleased with both experiences. 

Nothing stands out on the menu but I've tried the beef tacos, enchiladas, chili rellano, tostadas, green corn tamales, chimichangas and thought they were all tasty.

Consistent food spot and will continue to go there in the future."}
{"text":"We tried LAFONDA for the first time this evening. It's a clean restaurant and has a nice atmosphere. Our server was very nice and attentive. We started our meal with chips, salsa and fundido dip. We enjoyed the warm, thin chips and the fundido! The salsa was mild but flavorful. Per our servers suggestion, we ordered the Carne Asada. The beef was super dry and over cooked. Instead of rice and beans, we tried the Calabecitas. The veggies were mushy and served in a broth. We got rice to substitute for the veggies and it had no flavor. We tried to find the positives , unfortunately we can't recommend eating at this restaurant."}
{"text":"I really look forward to coming here for the Chimichanga, a cold Dos Equis and their awesome salsa and chips!"}
{"text":"I am encouraged seeing the owner is reading and responding to user comments.

My experience the second week of its reopening was disappointing and I had made my mind up not to back.  But I came across these recent posts where the owner is engaged and for that will give the restaurant another go.

Not to mess up the ratings but be truthful, I would have rated a 2 before but will rate 3 now until I go back and try again.....

I want this place to be successful, especially since I live nearby...."}
{"text":"Me and my girlfriend went here on our date night, since its less than a mile from our place! We got seated pretty fast, but it went downhill from there. Our waiter was nowhere to be seen, and at least 3 employees passed us by without saying a word. We were hungry and thirsty but after 10 minutes of waiting, we decided that they didn't need our business and we left! Very disappointed!! Luckily there is a Garcias right down the street, and we had excellent service as usual.. Don't waste your valuable time on La Fonda's"}
{"text":"I have been here before and had good experiences all the time.
I came in today hoping  to have some good food, good margaritas and good Mexican music.  The food was good, the margaritas were good. The music awful.  They were playing american oldies. Wtf. Isn't this a Mexican restaurant???  I was disappointed.  Need to find a new Mexican restaurant to go to"}
{"text":"This place is a favorite for my extended family. My Grandma likes to talk about bringing my mom and uncles to the original location on Fridays when they were kids. For me, the family tradition of La Fonda's adds to the comfort food feel. With all of that said the food here is great. I love the Fundido and the fajitas are great!

The customer service could improve here. The staff used to all be very friendly and talkative. It was very much a family atmosphere. Now, not so much."}
{"text":"Not going to lie when we got their we were like this is a hole in the wall!!! Looks can be deceiving. Food was amazing and service is wonderful"}
{"text":"Update...Once La Fonda settled into their Tempe location, they really came back strong as one of the best Mexican restaurants in the valley.  I, usually, get the three item combination, with an enchilada (I add a fried egg on top), a ground beef taco, and a wonderful red beef tamale, with beans and rice.  It is quite a meal.  I tend to go with the red sauce, which is sublime. The chili flavor seems to blossom with a rich and full bodied punch, and ends with an almost fruity note that is incredible.  Their green sauce is equally as good, and it is fun sometimes to get both green and red on the plate, whic hmmis an option here. They serve great hot and/or mild fresh salsas, and the chips are always hot and fresh.  I finish with the flan, which is the very best I have ever had.  It is creamy, and not too egg-like, and the caramel sauce is to live for.  I shoud have updated this review a long time ago, as I have been going to La Fonda about once a week, or more, and loving it."}
{"text":"This place is just ok...nothing to write home about. Service was awful. Food was average. Atmosphere was ok, but the Bar looked pretty lively. I think its really 2.5 stars but its not available. I would recommend happy hour only for this spot."}
{"text":"Ok food. Awful service. I have eaten here once before; the food was average and the service was painfully slow even though the restaurant was nearly empty. I did return, though, to give this place another chance. My boyfriend and I arrived around 7pm and waited at the host stand.. And waited... And waited. We waited for 10 minutes and no one even acknowledged us! Servers and bussers kept walking by and looking straight at us but did not even say hello. The host was nowhere to be found. After another 15 minutes passed without anyone greeting us (no I'm not exagerrating), we decided to leave and try another Mexican restaurant. We tried out Manuel's just down the street and loved it."}
{"text":"Came here on a whim with my bestie. They couldn't get an order right. I wanted my order of nachos without onions and add chicken, and my vegetarian friend ordered just the nachos. Gave me onions and no chicken, and her onions with chicken. Took those back, and second time around I got onions on my plate. I ended up just not eating. Server guy was a little douchy, and I didn't even give him a hard time about it. Like \"Na dude, I'm just going to chill while she eats. No worries.\" Won't be coming back. Also, chips were oily.
Bye La Fondalesha.
Confirmed douchiness of the waiter. Just complimented my review. \"You're cool.\" Thank you. Also, here's a tip* since I forgot to leave one on the table. Find a new occupation."}
{"text":"My boyfriend and I tried lafonda's for the first time last night. Was seated right away , chips and salsa was good. I wish I could review the food , but we never got service. Seated between two tables that had service , but we couldn't even get a glass of water. After 10 mins of watching everyone else get service we decided we would leave. Servers need to learn how to make sure every table has been touched and management needs to walk the dining room to make of this. It was not busy , but still would not be excuse."}
{"text":"I began going to La Fonda after I found it on lists of celiac-friendly restaurants in Tempe. I was assured by the wait staff that the corn tortillas were free of wheat. Every time we ordered, we made it clear that the wheat thing was a health issue, not a preference, and we were always assured that my meals would be safe. So we ate there every week or two for a few months. 

A few weeks ago, we made a take-out order and went through the whole \"wheat-free\" spiel. This time, though, the employee told us that the corn tortillas are made in-house and contain wheat flour. She said she has worked there for several years and it has always been the case.

I am disappointed to learn that eating at La Fonda isn't safe for me, and that they were not honest with me about it."}
{"text":"Went here on Cinco De Mayo. This place has been around a long time but I haven't visited here in recent years. My first impression was that our waiter was in charge of way too many tables and while he tried to be accommodating we hated to bother him for simple things since we knew he was busy!  No silverware or napkins until food arrived  (i.e.none for appetizers). Started off with Chips(very good), salsa (tasty but very small bowl not enough salsa for two people) and appetizer (fundido cheese) excellent but didnt have enpough chips  because they were never refilled from chips and salsa starter. Overall our meals were ok and the margarita was ok. With so many other great places in the valley, and nothing here that stood out as spectacular, i probably won't be back for another long time."}
{"text":"The ambiance is good. Sangria was good too. But we were a big party and sitting on a big table. I asked for a salsa refil, the server picked one off our table, turned around and handed it over to me. I was thinking of giving 4 stars, but just 3 for now!"}
{"text":"We stopped in for appetizers and a margarita. The sampler platter was really good! Bonus, 1/2 price appetizer deal. The margarita was as expected. This was our first time eating here and we will definitely be going back!"}
{"text":"First time at the 'new' location and it didn't disappoint. Outer food was exactly how we remembered it. We sat in the bar and watched a D'Backs game, the bartender was attentive and friendly to the perfect degree. It's a hard balance, some don't say anything, and others Jin in on every conversation, she was awesome. Our food was served hot and was delicious, with high quality, fresh ingredients. Their chips are thin and crisp, fried fresh just the way we like them. We will be back."}
{"text":"Going down hill fast with no end in sight! I used to live across the street from the old location. I blamed them for my belly!! I was really worried they would change when they moved. We went there for my birthday last week. No one checked on us for a long time. The place was not crowded. Chips and salsa took forever. Water took even longer. The food was ok. Kind of bland. I add a LOT of the hot sauce (If you can get it!!!). They used to give you a jar of it. Now it is handed out in tiny bowls like it is 20 year old scotch! Three people in my party got margaritas. They do not serve pitchers any more. So they got their own. They were expensive and according to all three it was VERY VERY weak. I really am sad to say I just don't feel they are worth it any more. Their service never was their best attribute but now it is dismal. You used to not care because the food was so darn good. Well that isn't the case anymore. Add in that the prices went up by a fair amount I think put a nail in the coffin for me!"}
{"text":"Seriously, I am a Mex-Foodaholic, and I usually don't turn it down. 

Coming from Cali where taquerias are everywhere, that can sometimes set the stage for expectations, but if I know that I really like it, it doesn't really matter to me - authentic or not.

For example, I actually REALLY love Taco Bell. I don't care if it's authentic or not, I just know that I really like it.

Same with La Fonda. I mean, for what it is, and if you set your expectations accordingly, their food is pretty good, kind of like a glorified Taco Bell in a sit-down restaurant!

They got it going with regards to aesthetics and vibe, and it's a good place to take your larger groups of family or friends. 

Chips were good, and warm, and were served with something that was more of like a spicy hot sauce, and another that was more mild.

I ordered the following - 

CHEESE CRISP
Large toasted flour tortilla covered with melted cheese. 5.75 Add green chile strips, tomatoes or green onions for 1.00 per item

ENCHILADA TRIO
One beef enchilada with red sauce, cheese enchilada with green sauce and chicken enchilada with fundido sauce. Served with rice and beans. 12.50

Quite honestly, they were all pretty good, and the price was right. Service wasn't bad, either.

The only thing is that my buddy insisted that I try something with the  Fundido Sauce cuz he thought it was the absolute bomb, and is one of their signature items.  

Apparently it's made out of melted cheese and sour cream, and served/poured over the top of some of their items, though I didn't quite feel the love there ;-)"}
{"text":"I came to enjoy some of what I was told was great food. After walking in with no apparent signs of being closed the ride bartender informed us they were closed and we'd have to leave. Even though there were tables full of guests still waiting on their food. I won't return and suggest they hire less rude people if they want return visitors."}
{"text":"When I moved close by last year, my Mom, sister and I were doing a coffee run when we drove past La Fonda. 

A Flagstaff resident, she screamed, \"Whoa that place is good Meg! You need to go.\" 

So a year later, I finally tried it. 

Let's just be upfront right now: This is NOT the same La Fonda near Northern Arizona University. No connection whatsoever. 

Now that that's cleared up, the food was just OK. Not the best quality.

Dude and I shared the Pollo Especial Fundido Burrito. Shredded chicken with spiced red and green sauce, topped with Fundido sauce and melted cheese. 

Not impressed at all, kind of like On the Border and lacking the promised heat (spice).

Delicious silver margarita though, and our server Priscilla took great care of us, so two stars for that."}
{"text":"The food was very good. And the customer service was excellent. And Ashley was great."}
{"text":"La Fonda serves up no surprises, which is for some, exactly what they want in a Mexican restaurant. They have your standard array of chimichangas, fajitas, enchiladas, burros, and tacos, just to name a few, in your basic meats with a smattering of vegetarian options. Flavors aren't particularly bold, spicy, or stand out in my mind, but the food itself tastes decent. 

We started off with the obligatory chips and salsa. The chips were freshly made, light and crispy. There were 2 different salsas to dip your chips in, which I appreciated. There was a chunky mild salsa, and a more uniform blend of spicy salsa. Out of the two, the chunky salsa had more flavor for me. As for entrees, I tried some of the chicken chimichanga and had the spinach enchiladas. The chicken chimichanga was what you'd expect in your typical chimi: shredded marinated chicken, crispy, deep fried outer tortilla. The chicken was juicy, and it was served with guacamole, beans, cheese, and rice. The spinach enchilada was OK. It had a good amount of spinach with sauteed onion, with your choice of enchilada sauce (Red, green, or fundido). I had it with the red sauce. I didn't see much of the sauce, and perhaps the kitchen was compensating for this by using a ton of cheese in my plate. In addition to the cheese on top of the enchilada, there seemed to be an equal amount of cheese to beans and rice in my sides! For the dairy-inclined, you would be in paradise!

Our server was attentive and friendly. Drinks were refilled as needed.

The decor was probably the most distinctive element of the restaurant. Remembering how it used to look back when this building housed Chuy's, La Fonda's improvements have turned what used to be a divey, beachy, beer-guzzling bar into a warm welcoming Southwestern atmosphere. 

So if you're looking for a \"safe\" but not particularly inventive cuisine, in a cute scenic atmosphere, La Fonda is your place."}
{"text":"Meh. Watery margaritas and egg role esque mini chimis. Good happy hour prices. 

Welcome/service is barely acceptable. Awkward entry way. 

It looks like it could have a great patio, but it was closed."}
{"text":"This place was super good!!! I came with my boyfriend we had the nachos with chicken. Those were huge and topped with everything! I love chips and salsa, so we got the bean dip. It was a huge portion and so good. The service was good and they have decent happy hour which is until 7 on Saturday."}
{"text":"We were referred here by a friend and it was delicious. We had the carne asada plate and machaca plate. The meat in the carne asada plate was tender. The waitress suggested we both try something different and share so we did. We will definitely come here again!"}
{"text":"We ate here last night. It was really good mexican food. The staff was very friendly and helpful. I would definitely recommend eating here."}
{"text":"Well this was their last chance for us with the hundreds of Mexican restaraunts in the valley.  We've had subpar service here in the past but this time takes the cake. We sat down and were served chips and salsa but thats where the service stopped.  Several of the wait staff walked right by us without acknowledging us. After 15 min we decided to leave on the way out no one to lodge a complaint with so we called and let them know on the way to another restaraunt."}
{"text":"We had the WORST experience ever here this past Wednesday which is too bad since the food and drinks were good. We've been here before but will NOT be going back. The customer service by the bartender and manager on duty were awful!"}
{"text":"so the service ended up being pretty good they brought hot chips and two kinds of  salsa before we ordered.and the appetizer (taquitos) were tasty (esp the chicken) lunch was the beef and chicken fajitas. delicious! loved to hear the traditional Mexican music playing."}
{"text":"Worst experience with a new restaurant in a long time. The food was not to par and when we were finished eating my daughter's needed to use the restroom. Walking back there when i got closed to the kitchen, the smell was horrible. When we got to the restroomit was way worse. Unbelievable. Not to mention when the waitress brought my food she sat it down and burned my arm. She didn't even say the plate was hot."}
{"text":"The food was really good.  I had the chicken lime salad, the kids had a cheese crisp and beans and my sister-in-law had a big burrito that she loved. 

The atmosphere is really nice as the new location is a vast improvement over the last location. 

We had a new server so you want to give them the benefit of the doubt but she was pretty bad.   Ordering a margarita from her was a bit of a nightmare - not going to lie.  I had to send it back and of course got the excuse that it was the bartender's fault. 

Don't order iced tea though if you are not a fan of sugar or sweet n low - that's all they have."}
{"text":"Stopped in for an after work-work dinner last week. We had a very nice time. 

The service was quick, the food was good and my \"skinny\" margarita was awesome!

Their chips and salsa is very tasty, not the best, but good enough for me to eat way more than I should have. I had the chicken fajitas and they were very good. The grilled veggies that it came with were the highlight I think. 

I would defiantly consider going back if we are looking for a dinner spot on this side of town again."}
{"text":"Remember what I said in my last review?  I said, \"DON'T CHANGE.\"

You changed.  That didn't take long.  The place that seemed so incredible on its first night with so many subtle, balanced flavors suddenly turned into just another Mexican joint with \"pretty good\" food.  Edible?  Certainly.  But, nothing really outstanding nor distinctive.  We went there again specifically to recreate the opening night experience that we remember fondly.  They just couldn't maintain the quality, and the portions seemed quite a bit smaller too.

No, this just isn't the place to recommend anymore.  I certainly don't bear them any ill will and hope that they can bring the level of quality back up to what it was.  We'll come back some time and see."}
{"text":"I ordered two items for carry-out on 7/28/2013.  I was very disappointed in the quality of my food.

I ordered a grilled chicken quesadilla with chicken and cheese only and a ground beef taco with beef and cheese only.

They messed up both items.  They gave me a shredded chicken with tomatoes and onions in it and it was all liquidity.  Then they put lettuce on my taco.  The beef was burnt.  I took a bite of each item before throwing it all away.  The chips were stale and the salsa were bland and did not taste fresh at all!  What a waste of $15!"}
{"text":"So disappointed. The last time when it was pretty new it was good. This visit was horrible.  Carne Asada was overcooked and looked disgusting. The waiters seem uninterested in helping and only made the occasional pass by.  The place was deserted. Management needs to get their act together and bring this place back to life."}
{"text":"Went last weekend. Service came in spurts but short staffed probably. The food was not the best.  Got a carnitas chimichanga and it was so bland and flavorless. It was extra dry. I asked for salsa and chips to take home and offered to pay. I was told I could take the chips left on the table. But they gave me salsa to take which I paid for got home and it was not the one I asked for. I won't be back!"}
{"text":"Stopped off at this location in my neighborhood for some tortilla soup. Service was terrible. Waitress was very inattentive. I decided to order 2 ground beef tacos alacarte to go with my soup. The tacos were served in a fried crisp corn tortilla that dripped and oozed with grease with each bite.  All I could taste was corn oil or vegetable oil. Food had absolutely no flavor. Was quite disappointed as I've been here a few times before and had always enjoyed my visit here. This will be the last time I will eat at this restaurant. Try at your own risk and beware! Perhaps your visit may be better than mine"}
{"text":"Good food, chips came out hot and delicious!  ! I had tacos my husband had the enchiladas. The food was fast in coming out and hot!"}
{"text":"Last time I was here was 3 years ago. I ordered the chimichanga with chicken fajita. I don't know how to spell my waitress' name, but she was very attendant to my table. I ordered the paradise margarita. The food was hot and delicious, courteous helpful wait staff, and clean inside and outside of the restaurant. Got to love it."}
{"text":"Fabulous salsa(s) and hot freshly-made chips. Nice decor. Separate handicapped/family bathroom."}
{"text":"I see a lot of really great reviews here for this place. I think it boils down to the type of place you are looking for. My thing is finding little family run ethnic places where the food is good and the prices low. Service is important, but decor and ambiance are non-factors to me. On the other hand, if you like average food served up with old, piped in mariachi music and fake, yet expensive, Mexican decor, this would be your place. 

My family, when they visit from Indiana, like it just fine. They enjoy it. But to me the food was bland to average. We had a good variety of stuff on our first visit--I had a build it yourself combo plate and Carol had a shrimp dish, can't recall now which one. Average, as I said. The salsa was awesome though. Second visit, salsa still good, other stuff, still average. 

Considering how slow they were when we visited, the service was not great--slow and only marginally friendly. This was on both trips--the first time when it was just Carol and I, and a second time when I went with my family. That second trip it seemed like maybe the owner or a manager was waiting tables and building up a pretty bad attitude about. 

Bottom line...if you  like the real deal take a pass. If you don't mind this style, give it a try. It looks good and is not terrible."}
{"text":"Only been to La Fonda's for lunch, but was very impressed with the lunch menu and pricing.  The service an attentiveness was very good and the food came out to our table very quickly.  Had the Chicken Fundito with the Green Chili Sauce and it was unbelieveable."}
{"text":"Couldn't wait for it to open, drove past every day surprised to see just a  piece of wood spray-painted \"Open soon\".  Finally called and found out it was open.  I find it odd that they didn't take the time to paint an \"Open at Last\" sign.  Anyway, I really enjoyed the other location, so I expected basically the same thing.  The restaurant is very nice - but scaling up the dig includes raising $ as expected.  My margarita was very tasty  - better than the other spot but the food went downhill.  I'm so disappointed!!  Chips and salsa were good, entrees- just okay, beans and rice, really bad. 

I hope they figure it out - love having them in the neighborhood."}
{"text":"These guys were great! Met a friend here and we thought they closed at ten. But they weren't pushy to kick us out they were wonderful! Will definitely be back!"}
{"text":"I miss CHUY's on Sunday afternoon..... So, we tried the new digs at La Fonda.
Just maybe there was a Make your own Bloody Mary special (nope).. ok, new design, looked a LOT more formal and more like a restaurant than a bar.. We sat at the bar to test the food and have a couple drinks.

I got an Amber Dos Equis .... Clean, cold glass oh yea.... but then the after taste had a strong metallic hint to it.

Got Sampler appetizer, BEEF.. Taco, Taquito, Chimi... all 3 the meat was short on flavors, had to scoop in the salsa to get something going on.. Chimi didnt have that chimi crunch. .. one of the bartenders that came on shift while we were there did nothing but complain about her scheduled hours and being asked to come in to other customers... :-( 

Will not be back, cant get shredded beef right, why try anything else..

++ the chips were good, salsa  eh,,,"}
{"text":"My daughter and I had lunch here today for the first time.  Nice atmosphere, fresh chips, good salsa and hot sauce.  My daughter loved her chimichanga. I had a combo with shredded beef taco, enchilada, rice and beans, all good.  Plenty of food, we both brought home half of our plate. We are looking forward to coming again and trying some other things on the menu."}
{"text":"10/25/2014 Update: Much much much better experience this visit. Chips were hot, fresh and oily, much more like the chips at the old location and a dramatic improvement over the seemingly heat lamp bagged chips served last time around. Served both salsa and hot sauce without having to ask. The salsa, which was mostly chopped onions last visit, was quite tasty this time around. And service was solid. Thinking about upgrading La Fonda to four stars, but the inconsistency between visits is a great concern. Need another visit or two before deciding. Happy, though, to see more signs of the old La Fonda.

La Fonda, at its old location just north of ASU, was always my benchmark for Mexican food. The restaurant to which I compared all other Mexican spots. Why? It was the first Mexican restaurant I tried when I moved to Arizona. Having grown up in the Midwest, I had no experience with border food... Tacos with shredded beef? Unheard of! Plates so hot they could burn you? What the? Hot sauce that would peel the roof off your mouth? I was instantly addicted. Ate there once a week for years, gradually becoming less of a regular due to distance and life in general. I was horrified one day when I showed up to find a construction fence between me and my machaca burro enchilada style. Thought La Fonda was history. You can't imagine how happy I was when I discovered (through Yelp) that it had reopened, even if it was even farther away from where I now live than the original location. 

There are some noticeable similarities to the old La Fonda. The hot sauce is still tasty, although it has lost quite a bit of heat over the years. The shredded beef tacos are wonderful and as generous with the meat as ever. But the ambiance is totally different. Admittedly, the old location was a bit of a dive, so the new digs are a significant upgrade on the surface. But some character seems to have been lost. Also seems to be a big push toward selling more alcohol.  And the service, which was so prompt and sassy at the old location, now seems slow and indifferent. 

Case in point, my recent weekday lunch visit. Arrived to a half empty restaurant, but had to wait several minutes (seemed much longer - used the time to take three photos for Yelp) to be seated. Why? Two guys were picking up a take-out order and apparently it was necessary for me to wait for their order to be completed before I could sit down. No problem. I was happy just to be at La Fonda. 

Chips were delivered hot and fresh.  The chips are no longer the delicious hot and oily yellow corn chips of the old location. They're now light white corn chips, a significant downgrade for me, although you might like them if that is your preference. The hot sauce has to be requested these days. An interesting choice, since the default chunky salsa is heavy on onion taste and not much else. The hot sauce, on the other hand, is exceptional.

As the lunch went on, I began to feel sympathy for our server. Stretched way too thin. We waited to order. Waited for drink refills. Waited for a hot sauce refill. And waited, a really long time, for our check at the end of the meal. Such a contrast to the old La Fonda, where you would have been seated instantly, served chips that risked burning your fingers, be given a small pitcher of hot sauce, had your entrees delivered before the chips were cool enough to eat, and have you on your way in as much or little time as you liked. 

Overall, the food is fine, with just enough of the old La Fonda for me to want to drop in again if I'm in the neighborhood. Consistency of service at La Fonda seems to be a problem. Understaffing was the apparent issue this day, but the overall vibe was just not that welcoming in any case. Still family owned. I recognized one of the owners, so I know they are still hands on, but... I'll definitely give them a try again and hope for the best. Maybe they'll bring back the Number One Plate, my old favorite.

One more thing: Kids meals are reasonably priced when you consider they include a drink. That said, I'm not sure about the appropriateness of pushing \"kiddie cocktails\" (see menu photo). Perhaps as penance, kids eat free on Sundays. Bottoms up!"}
{"text":"This is one of our neighborhood favorites. The fajitas are delicious and the portions are massive. I'd recommend the chicken. The \"Mary Lou\" green quesadilla and the chimichanga with fundido sauce are also very tasty. I echo the earlier comments about servers being too busy to manage tables. On the positive side, the chips and salsa while you wait are fantastic!  I prefer to get carryout/takeaway here."}
{"text":"This place is amazing. The chips are fresh and cooked there and taste great. Ordered the enchilada trio the beef was good but the green cheese and chicken fundido was amazing. Also ordered was a shredded beef taco, carne asada, mini combo and machaca. All were really good. Definitely a place to return to. Portions were good sized as well. Only bad part is they have coke not Pepsi."}
{"text":"Came here with colleagues for lunch break. This place is your standard Mexican restaurant. Overall, I had a very pleasant time!

I was really impressed with the service. Our waiter was really helpful, brought us free refills on chips and salsa, and was super accommodating to my vegan-ness. I wasn't going to make a fuss about eating vegan at a Mexican restaurant, but when I ordered the Veggie Fajita he went out of his way to ask and make sure that I was okay with chicken stock in my rice and cheese on my beans. I appreciated his extra mile in making sure I was happy!

My fajitas were very good. I was surprised by broccoli and cauliflower in the mix but it ended up being a nice addition. They had a lot of nice lunch options for good prices. If you're looking for something very special and authentic, this isn't necessarily the place for you. But I think for families or work possees this place can make a lot of people happy."}
{"text":"When I came on here and saw the rating for La Fonda, I was appalled.  Since I am an Arizona native, I consider myself a Mexican Food connoisseur, and La Fonda is great Mexican food!!  Chips, Salsa annnnnd hot sauce, all delicious.  Options for a skinny margarita, check.  Rice and beans, yum.  Green chile, carne & enchiladas all bueno.  But I think my favorite part is the flour tortillas.  I am not sure if they make them in house or not, but they are legit!  I do wish they had a grilled fish option, or offered free range/anti-biotic free chicken, so I could eat here more often.  Long and short, fantastic Mexican food restaurant, with a really nice atmosphere!"}
{"text":"Bad food, worse service.  Their carne asada looks suspiciously like ground beef, especially since it is mixed with diced peppers and onions.  When I brought this up, the extremely inattentive server, Alicia, told me that's how it comes.  It was also greasy and overcooked.  The guacamole was tasteless and brown....  while it was taken off my bill, at my request,  not even the vaguest sense of concern was offered about my being unhappy enough to send it back.  I would have said something to Alicia about how I was very unhappy about my whole meal, but she never asked.  She hid out in the server station 12 feet away.  30 minutes later, after one reluctant soda refill, no offer of chips or salsa, and a cold plate of food with 3 1/2 bites taken still in front of me, I debated asking to speak with the manager.  I decided against it.  If a server completely fails to notice when someone is very obviously displeased, or even ask, I seriously doubt I would receive much help from the mgmt.  

I will never return to La Fonda."}
{"text":"Gross Gross Gross

This is probably the worst Mexican food I have ever eaten.  My fiancee and I ordered the nachos and they were a greasy mess with hardly any cheese on them.  It looked like there was zero effort when it came to making these.

I ordered the chicken chimichanga dinner and it was GROSS.  The chicken tasted like it was a week old.  I spit it out.  The chimichanga was drenched in grease as well.  I understand it is a fried item but your plate should not be swimming in oil.  BARF.  I would never eat here or recommend this place to anyone."}
{"text":"We have given this restaurant several chances but this will be the last time we eat here.  We come Monday nights and sit in the bar area for happy hour.  There has never been a time that it was adequately staffed.  Often times it takes 20 minutes for the server to take your drink order.  We have learned to make sure you have your food order ready so you dont have to wait until your drinks come 15 minutes later.  Also it would be best to ask for your check as soon as your food is brought to you or you will have to wait another 20 minutes for them to check on you.  I hope you only want 1 drink because even 20 minutes after you slurp your last sip of margarita, they still haven't come back to see if you need another drink.  Here we sit 20 minutes after asking for the check and she still hasn't come back to get our card.  If you like to leisurely eat 1 appetizer and drink 2 margarits in 2 hours time this is the place for you.  Oh yeah...the food is mediocre at best."}
{"text":"We've had a few different items at La Fonda. Burritos are standard. Well done, but not mind-blowing. Chips and salsa are great, of course. What did blow my mind though, was the chilaquiles! This is a dish I had for the first time in Puebla, Mexico years ago. I never expected it in Tempe. It's a dish of tortilla chips smothered in sauce, red or green, with cotija cheese and a fried egg on top. Sounds weird, but it is amazing. Definitely try it with the green chile sauce."}
{"text":"Been coming here for 27 years. Still love it and it's the first stop when I fly in!!!!  Red chili burro, dee fried, enchilada style!!!!! YUMMMMMM"}
{"text":"Sat in the bar area. Very friendly and good service.  Food was great.  Everything was obviously made fresh.  Salsa , fondido, chips."}
{"text":"This place is a stones throw away from my house so I come here by default most of the time. BUT. They're food is delicious and the margs are as well. Overpriced is a real thing here though. If you're looking for yummy mexican food and are okay with paying more than the average joint this is your spot. Realistically, if there was a better priced place in the general vicinity you would likely find me there. ;) Overall, good food...bar has seating basically always....delicious chips and salsa. *Thumbs up*"}
{"text":"I had heard great things about this restaurant ... I had to drive 30 miles to check it out!

My husband and I were very impressed from the great ambiance and our server, Trisha.  

I told Trisha it was our first visit and she had many recommendations.  The guacamole was the real deal ... the enchiladas so perfect, topped off with yummy cheeses!

The tortilla chips came fresh, right out of the fryer.

My true reason for writing was to compliment Trisha.  She was so accommodating, always a big smile, and put the frosting on the cake for a great night out!

Don't miss out on this place!"}
{"text":"Your chips and salsa are dynamite - chips are warm and crunchy, lightly salted and the salsa is spiced just right. But your entrees leave a little something to be desired. I've been here twice, once for lunch and once for dinner. Service is quick and friendly but the food again - just okay. I could compare you to another local family-owned Mexican restaurant here in the valley."}
{"text":"Tried this restaurant for the first time and had the private room for our family celebration. 

Had the Machaca Chimichanga with Poco Pollo Sauce, rice and beans. The Chimichanga was prepared well, nice and Crispy with a topping of cheese and the Poco Pollo Sauce on the side as requested.  The rice and beans were okay. Overall the Chimichanga was good.

We shared the Margarita Chicken also. Came with tortillas to use with the Margarita Chicken which was good.

The restaurant is simple, service was very good. Mexican music in the background to give it some festive atmosphere.

The food was good, the server taking care of our group of 13 was excellent. Not a big wow factor but pretty good."}
{"text":"Finally open, and worth the wait! The decor is nice and it is obvious the owner's have pride of ownership. The staff are still training but did a great job. The Tacos are authentic and served with a salsa verde that is delicious. Every dish I saw served looked wonderful. I will be back again to try some more. Give them some time to work out a few bugs with new staff and just opening but I think they will be a hit!"}
