{"text":"We booked this restaurant for my friend's birthday and we had a party of 15. When we arrived, the waiter rudely ushered us in and demanded that we closed the door so as to not let in the cold air. Then we told him we were the party of 15 and he showed us to a long table with a family sitting at one end. They had just started eating their food. The servers didn't acknowledge the fact that they had gave away half of our table to another party. Luckily for them, the birthday girl didn't arrive until after the other party left. It was very awkward for both parties and the other party even offered to move to another table, but the staff insisted that they stayed. They never consulted our party at all. We had booked the reservation a week in advanced. Unacceptable. 
The server spilled water on my friend's phone and reached over several people and plopped down dishes. They also served a cake that we brought without giving us any plates or cutlery.
The food itself was underwhelming."}
{"text":"This place doesn't get enough support and love in my opinion. 

La Forchetta is a great place for a lovely dinner with excellent service. It's upscale without being pretentious and the food is delicious. 

Every time we've been there the service has been impeccable. The wine list is extensive and the food is all incredible. Pasta, shrimp, risotto and a wide selection of mains - you can't go wrong with anything you choose from the menu. Their rosemary bread is amazing.

During the week it has a great prix fixe (fyi, you can't get it if you make your reservations on Open Table online) that gives you a great selection of appetizers and mains or desserts. 

We've taken family, friends and visitors there and everyone has loved it. I'm not sure why it doesn't get more hype. I guess it's pretty understated."}
{"text":"Great restaurant, attentive service, and the food was excellent. We accidentally went when there was a big street festival on, so the accordion music outside was loud and distracting, but La Forchetta was a great restaurant."}
{"text":"Pasta and risotto is alright. The pasta was a bit too over cooked for my liking.  I prefer my pasta al dente. 

BATHROOM - clean, but difficult to access for elderly.  You have to climb down some rickety narrow stairs to the basement.  The basement smelled foul - like rotten fish - I wasn't sure what that was all about.   Cleanliness of the bathroom - so so. Passable. 

Appetizers were delicious - try the scallops! They melt in your mouth!

Service was a-ok.  Wasn't impressed, but wasn't offended."}
{"text":"La Forchetta is located off College right in the heart of Little Italy.  A bit underwhelming upon first walking in... intimate smaller setting that might need some minor updating.

Food - Good variety on the menu especially the appetizer section.

Started with the Rosemary Bread which was done well and a nice touch.

Baked Goat Cheese Portobello Cap was probably the best dish I had.  Very tasty and just the right mix between the ingredients.

Pan Seared Sea Scallops were good but fairly small portion size.

Seafood Linguine was OK... it is a staple on most Italian restaurant menus and although decent... nothing that would stand out from other places.  Spicier sauce than most seafood linguine.

Service - Fairly attentive server but hard to gauge given I was one of the only ones in the restaurant at the time.

Environment - Definitely more of a date night kind of place... lighter in daytime/dusk... dark at night.  Just a side note I felt the tablecloths were a bit worn and could use a cleaning.

I would rate it 3.5 stars if Yelp had that option."}
{"text":"My wife & i had dinner with friends.  Atmosphere was good, small intimate restaurant.  Service was slow which was no big deal as we were not in a rush, but left us waiting awhile for apps.  Speaking of apps, try the calamari.  Pasta was a little undercooked.

All in all, nice experience & recommend."}
{"text":"My husband and I were very impressed with our meal last night.  We ordered ftom the prix fix menu and we were extremely satisfied with all three dishes. The service was attentive and quick, the food was delicious and the ambience was intimate and romantic. We will definitely go back."}
{"text":"So my boyfriend and I wanted to go somewhere small and intimate for our anniversary..everywhere else was doing summerlicious and I was really wanting some Italian dishes..so I looked at a lot of different menus and decided \"hey this place looks good!\"..My boyfriend was reminding me while we were driving that we had gone to a restaurant on College for our 2nd year anniversary and we both couldn't think of the name..but he knew it was the sign was red..as we were walking down College, I said \"hey look there's our restaurant\"..and instantly, something clicked! This restaurant was the exact same one we celebrated over 3 years ago! (Talk about chances but also..bad memory!!)..The service was spot-on as our waitress/server was so accommodating in helping us make our dining experience much more enjoyable..she was super friendly and made good suggestions for our meal..
We shared a caprese salad and seared scallops..Both delicious starts accompany our glass of wine..they also serve rosemary bread which was also delicious!
For our mains my boyfriend (who remembered that he loved the duck the last time we were here) got...the duck! Once again he really enjoyed it!
I was going for some pasta so I ordered the Strozzapretti con Pollo..it had this light sun dried tomato sauce which was soooo yummy! I wanted to eat it all but my tummy said \"no!\"..so I got the rest packed up to go.
This place was really amazing and the food was deeeelllissh!
I would definitely come here again (hopefully before our next anniversary!!) and would recommend it to anyone!
Very friendly staff (no snobby business) and amazing food!"}
{"text":"4.5 Stars

Apps
Rosemary Bread A+
Sicilian Rolls A+
Steamed P.E.I. Mussels B-

Entrees
Pan Roasted B.C. Snapper alla Puttanesca A+
Veal StriploinScaollopina al Limone B

Dessert
Honey Creme Brulee A
Classic Sicilian Gelato A

Excellent, friendly service. Will stop by again if I'm in the area.
Get the Sicilian rolls for your app or stfu."}
{"text":"I went here with a friend last night, and our entire meal was great! We got the three course price fixe for $30 and a pasta special. The salad on the price fixe menu was nothing to write home about, but the scallops, pasta special, and panna cotta were delicious!  Every plate was clean when they came to pick them up. I should mention that my friend is Italian and he was quite impressed.
As for ambience, the restaurant is small, so if it were packed you might be uncomfortably close to the table next to you, but we continually remarked that it was so nice to be able to hear the person at our table and carry on a conversation.  I was actually pretty shocked that it wasn't busier at 8pm on a Friday night, but that worked out well for us!"}
{"text":"This place is a great date night spot or catching up with old friends. The pasta I had was delicious, not too salty, not too oily. My friend's risotto was nothing special. But I really recommend the pastas."}
{"text":"Me and my friends came to this restaurant for a friend's birthday expecting a lot because of the great reviews but we were more than disappointed. Don't get me wrong the food was great but the service left a sour taste in our mouths. First off when our server brought us our drinks he tipped the tray and dropped an entire drink on the birthday girl's head and the glass broke on her head and also showered a few of us in the drink. Instead of apologizing right away he went to get a towel to clean and then came back to apologize after. At this point you would assume this is where the owner or manager steps in to apologize but that just never happened. The server then went on to pick up the pieces of glass that were visible and not even bothering to clean the table and we were left with tiny glass chards on the table. When we asked him to clean it he did and then went on the wipe the cutlery on the table with the same cloth he just cleaned the table with. Then after that when I began to drink my drink there was a fly in the drink. In the midst of all these problems not once had whoever was in charge come to apologize or see how we were doing at all. The only time he came was to collect our payments at the end because they were closing. On top of all that I've had smaller things happen at restaurants where they would comp certain things. My friend that has a glass dropped and broken on her head should have had her entire meal for free to be honest and my drink that had a fly in it I still had to pay for. The only thing taken off our bill was one drink which is ridiculous considering all that happened. I'm not saying that businesses should go around giving away free things but my parents used to own a restaurant and I go out to eat almost every night and in this case a lot more should have been done for us. And I am extremely disappointed in the service we receieved. It was unprofessional and amateur at best!"}
{"text":"I am tempted to give them 1 star for their extremely poor service. Their food would have been really delicious if it wasn't for the obvious piece of rubber I found in my dish (which by the way they tried to blame me for). Not only did he take my dish away (I wasn't finished), they did not take it off our bill, they didn't give us a discount, no new dish, heck not even a genuine apology."}
{"text":"I frequently visit La Forchetta and have amazing experiences but this Saturday night was a disaster. The food as always was FANTASTIC. I would reccomend the PORTABELLO MUSHROOM CAP, the muskox, the crispy duck breast, and the pork tenderloin. All menu items are full of flavour and are the perfect portions. The ROSEMARY bread is impeccable. 

The service on Saturday was the worst service I have had in any restaurant. We waited patiently at the door for around 5 min, having servers pass us but not even make eye contact. Finally I walked right up to one and asked if we could have a seat. Upon sitting down it took 15 MINUTES for some one to bring us menu's. By this point I was annoyed and being a small restaurant (30 tables MAX) could not find a reason for this. Every time we tried to get a waiters attention he would look away. The waiter also did not bring us out the wine menu. Log story short the rest of our dinner went on like this. From the time we ordered it took us 25 min to get our one appetizer and then after we finished that it took an outrageous 55 min to get our mains.  This was disrespectful, annoying, and came with no explanation what so ever. 

As we were finishing up the waiter had the nerve to bring us over dessert menus and smack them down on the table. There was no need for his attitude as we had remained positive about the situation the whole time. We politely declined stating that by this time it was 11:30 pm and we had to work in the morning. (We had been there since 8:45)

We went up to the bar to pay as we did not want to wait for the server to bring us the bill. 

I love this restaurant, I love the food and they have a fabulous wine selection. This single experience has tainted La Forchetta for me."}
{"text":"Le meilleur restaurant italien du quartier et de la ville, c'est aussi simple que ça. Réussir un risotto c'est pas évident, mais ici c'est toujours excellent. Service de table d'un grand restaurant et qualité des plats, on ne peut faire mieux."}
{"text":"The service was very nice and attentive. We shared the seafood risotto as an appetizer. It was well prepared and flavourful. The rice was still al dente. For main courses I had the crispy duck breast, which was well executed. The fat and skin were well cooked and crisp. The meat was medium rare to rare. Nicely done! The pomegranate sauce was a little sweet but ok. The vegetables were crisp and not overcooked. The mashed yams verey very good and plentiful. My daughter had the atlantic salmon, which was ok. But not spectacular. Both dishes were well presented. We had an excellent evening."}
{"text":"We reserved online and were greeted expectantly at the door when we arrived. The ambiance was very old world and cozy.  Service was quick but not rushed.  My partner had the Sweet Potato Gnocchi with Spinach which was creamy and delicious. I had the PEI Mussels, Rainbow Trout and Creme Brulee from the Prix Fixe menu which was just right. They had me at the mussels which were fat and tasty. Definitely will come back for more."}
{"text":"Wonderful experience! Delicious food. My waiter was lovely, attentive, and gave excellent recommendations. Very affordable, too- I noticed that this restaurant was rated with $$$, but I found the prices in line with other options rates as $$."}
{"text":"I really liked this place! We went here tonight as we're in town for a convention. The manager (?) was super nice and chatted with us while we waited for our food to go. I had the sweet potato carrot soup, which was delish, and the pork tenderloin (also delish). A really good meal. The ambiance and decor were very nice; if it weren't a work night and the wether wasn't crappy, we would have stayed and dined in. Next time!"}
{"text":"Worst restaurants i'be ever been in Toronto so far!! 
Worst food and customer service!!! 

I went there during the taste of Italy, got the prix menu for 3 courses. 

I ordered the sparkling wine called berllini. After I finished like half of it, I saw there's a fruit bug in it. I pointed to the waiter, then the waiter took it away, returned with the ORIGIN one!!! He just took the bug out from the origin drink!!!!!!!! It's ridiculous!! 

The appetizer is HORRIBLE! I got the steam mussel, the quality is SO LOW. The meat is tiny and not fresh at all! Some of them are pretty smelly!!!

The main course I got the trout. It's overcooked and tasteless. The mashed potato isn't smooth at all, my dining hall from college has much better mashed potato than here. 

The waiter totally forgot what I ordered for dessert!! He even brought us the dessert menu after the main course. The creme brûlée is ok. 

Won't come back ever again. And please stay away from this restaurant unless you want a bug drink, suck food and bad customer service."}
{"text":"Very warm, cute place. Everything we had was fabulous...terrific service. Best place in \"Little Italy\"!"}
{"text":"La Forchetta is top notch!  The servers are attentive, polite, and very friendly - some of the best service I've had in Toronto.  The ambience is perfect.  The food is surprisingly delicious - the dishes always surpass my expectations.  Even the way they serve the bread is unique and inventive and delicious!  It's affordable, especially for the quality of the food.  It's the place my dad always wants to dine at when he comes into town, and he has picky tastes, so that's saying a lot.  It's one of the last hold overs of real nice Italian restaurants left in Little Italy."}
{"text":"My business partner and I had dinner last night. Really enjoy the wine and pasta. I was very impressed with their service. The owner came over and introduced himself. He recommended certain pasta, which was amazing. 
I decide to take my wife to experience what I experience. Unfortunately it turn out to be hell for us. 
I can't even explain what a bad experience my wife and I had. 
I ordered the same meal as the night before. 
When it came I asked if it came with a white sauce. (Cream sauce) when the waiter went to the back and asked the chief about the different sauce. 
The chief , clear as day said (which we could hear  because we were the only people in the Resturant) make a rude comment about his bodily fluid  being used as \"cream\" sauce. 
My wife was so revolted at what we heard,
She could not go without saying something. 
With no apology or any remorse or denying what was said. I feel completely disrespected.
UNACCEPTABLE BEHAVIOUR. 
Clearly some people don't appreciate their job. 
I think he should be fired for such comments. 
I need to be contact by the owner or a general manager ASAP."}
{"text":"I came here with my friend 

Service is awful: The servers gave us bad attitude and charged us $8 per water bottle without informing us.

Food: it was undercooked.

I'm definitely not coming back."}
{"text":"I am relatively new to the GTA so I wanted to check out Little Italy. My boyfriend and I went down there with no particular restaurant in mind, picked this gem after strolling College for 20 minutes looking through everyone's menus. 

First impression - small. Let the night of listening in on other people's conversations begin!

The waitress asked us if we had reservations and we said no. The restaurant had maybe 6 people in it being only 6ish so we didn't think getting a table would be an issue. She snobbily seated us.

My boyfriend ordered a steak and I ordered the lobster risotto. Steak was super fatty. Lobster risotto was delicious but expensive. 

The steak came with a side of polenta and surprise! A lovely curly hair which my boyfriend noticed right at the end of his meal. That set the tone for the rest of the meal so we got the check and left. 

Fork fail!"}
{"text":"This looks like an old stuffy Italian restaurant, but it isn't.
Nick, who has been running the place for at least a decade is as \"with it\" as is necessary. He will adapt any dish to whatever you require. Yes, there are many traditional Italian items on the menu and they are fine; well honed in their preparation.
We had excellent Bruschetta, (not on the menu), to start. Followed by an interesting radicchio and orange salad. Our seafood risotto was okay, I think they may have been a bit low on seafood ingredients. The sea bass fillets were good and we asked for, and were given, french fries - not on the menu. (And I suspect if it is overly busy they wouldn't have time to prepare them).
We didn't order desert, but they brought us a really well-prepared Tiramisu anyway.
(Paul Roger champagne at $100 per bottle)

Free Wi-Fi available."}
{"text":"We made up pick-up order from this restaurant last night and it was absolutely delicious. We will be return customers. Haven't had Italian food that good in a while!!"}
{"text":"Boyfriend and I went here for our anniversary and we were not disappointed! 
The restaurant is small but nice, but very intimate where we could have a nice conversation comfortably.

Ambiance: Intimate, not loud, and romantic

What we ordered:
Calamari, lobster risotto, and seafood linguine 

Calamari was very delicious and needs to be savoured for sure as you get a small portion perfect for two people.

Lobster risotto, was very rich and well seasoned.

Seafood linguine was perfect, the noodles were cooked perfectly and not mushy. Portion size was great that we were able to share too! Lots of seafood added, the mussels were really flavourful. 

Rosemary bread was really good as well, nicely seasoned where you can actually taste the olive oil and rosemary. 

Service: Waiter was polite and took away our finished dishes/utensils. Came back with clean new utensils for us.

Overall, This was a great restaurant and would definitely return!"}
{"text":"Fav Italian in town so far. Love their rosemary bread. Great veal risotto. Best tiramisu I've tried yet. A little on the pricey side but it's worth it for a treat!"}
{"text":"Excellent Italian restaurant, upscale dining. Chic decor based on a modern take on traditional sculpture pieces. Service is very good. The tagliatelle napolitano, spaghetti a la forchetta, butternut squash agnolotti were good. The tiramisu was sublime, raspberry panacotta was an unusual treat."}
{"text":"This little space is very intimate....perfect for dates. In the warmer months, they open up the large windows and have a small patio....mostly tables for two.

The waiters are handsome European-accented gentlemen, which was a nice complement to the very good food that is presented well and delicious. Great for late night dining, as we made 9pm reservations.

Sadly, we weren't offered coffee with dessert, as I think our particular waiter had to go home, but other than that, it was a very good experience and I'd go again. Reasonably priced for the food and wine that's offered. I'd say you should try it out once....it's in such a great area of College Street."}
{"text":"I had a nice dinner here with my wife a few years back, and I know the food was really good! Definite return."}
{"text":"We went for Mother's Day and had a great time! The food on the general was very delicious! Both my mother and I were not a huge fan of the bread because it came on a bed of oil and we would have preferred the ability to dip it ourselves. The apps were pretty amazing: we had grilled calamari and the clams w/ tiger shrimp (the broth that they were in was flavourful and had a fantastic taste). For our mains, we had the pan seared scallops, which were prepared to perfection and the seared duck breast pappardelle (the duck was a little tough and lacked flavour but the rest of the dish was good). Overall, I'd definitely come back for another meal here!"}
{"text":"I came here with my husband for dinner, there was a 15 minute wait and quite busy.

The restaurant is nice and cozy, we were seated fairly close to other tables but it didn't matter to us because we were hungry!

The service was a little slow but scallops were delicious... they were seared just right and the mash and vegetables added a nice balance. My husband enjoyed his pasta as well. Will come back for another dinner date"}
{"text":"This place is great and I can't wait to go back!
 Went with my family and fiancee and we all had the 22$ choice of 2 out of 3 (appetizer, entree, or dessert) we all chose an appetizer and entree. The food was declicious. I had the butternut squash pasta (forget the exact name) which was delicious as my entree and the PEI mussels as an appetizer and both were amazing. Portions were reasonable did not leave hungry. 
For our group of 5 we were given 2 loaves of their rosemary loaf and it was also great. 
The wait was not long and the atmosphere was great. Our server was excellent on top of refills and removing dishes in a good way. 
The rest of the table enjoyed their roasted chicken, ceaser salad, scallops, and veal. I would highly recommend this place for a romantic evening out or a nice evening out with friends. Wine list is extensive and I enjoyed that as well."}
{"text":"Been here multiple times. The food and service is consistently good. Their butternut squash pasta is pretty yummy. Would definitely recommend."}
{"text":"Food was delicious and wait staff were polite and helpful. We were lucky enough to get a table on a Saturday night with very little wait but we were lucky. I would suggest getting there early or making a reservation. If I return to Toronto I will definitely return"}
{"text":"We had a fine meal here, more on the nouvelle Italian than the traditional Italian side.  Roasted pumpkin soup was thick and delicious, and two seafood dishes hit the spot -- the grilled European sea bass and wild haddock filet.  Photos of the food can be found here: http://paulalanlevy.blogspot.com/2012/10/a-full-saturday-in-toronto-touring-and.html"}
{"text":"The resto: the environment is good if you aren't seated right by the door when you can feel the cold breeze every-time somebody opens the door. 

Food: considering that nervosa in yorkville charges the same for their white truffle pasta I'm not sure how they couldn't get the mushroom risotto right at this place. It says there is a splash of white truffle oil on the menu, I couldn't taste it at all, might as well not even mention it. 
The duck, much better at la banane (where the food and experience was amazing btw!!!) the duck here was in so much sauce, the fat wasn't melt In your mouth fat it was chewy and obnoxious to finish. The wine was expensive - but good. 

Staff: the first server that came to our table barely said hello to me and immediately assumed that my boyfriend was in charge of all the orders? What year is this again? Even after my boyfriend told him to ask me what I wanted he stood still and still was waiting for him to give an order and didn't look at me. 
We asked to get moved from right next to the door and initially (even though more than 7 tables were empty) he didn't seem like he wanted to move us, finally we were given another table and the server was very friendly and we have no complaints about him! 

Overall: didn't enjoy the food and start of the service and wouldn't return."}
{"text":"Perfect place for dating! Very intimate! The service was very nice and prices were a bit high considered amount of food lol. Anyways a place I will definitely recommend!"}
{"text":"In the midst of the Taste of Little Italy we were looking for somewhere to dine and to get a break from all the hustle and bustle in the streets. I took a quick glance at the menu posted out front and by the looks of how packed the restaurant was we decided to give it a try. The hostess advised it was at least a 20 minute wait for a table but I don't think it actually took that long.

The restaurant itself is pretty small and tables are packed closely together however it has a very cozy vibe with it's dim lighting, dark wood tables and chairs and candle light on every table. At the back of the restaurant there is a bar off to the right and a window in the centre giving you a view into the kitchen.

The front of the restaurant opens up onto the sidewalk and were lucky enough to score a table right in centre front!
We had a very bubbly waitress and despite how busy and packed the restaurant  was she never neglected us and kept our glasses of water full all night long.

For drinks we started off with two glasses on white zinfandel.
Next came there delicious crunchy and warm rosemary bread drizzled with olive oil which we finished in no time.

For starters we decided on
La Forchetta's Sicilian Rolls - stuffed w/ smoked mozzarella, roasted red
peppers and fresh basil with a Chipotle-Roma tomato dipping sauce
Taste like an italian version of a spring roll, with lots of gooey cheese and a spicy tomato dipping sauce

Mains
Cedar Plank Roasted Atlantic Salmon - w/ mixed lentils with baby spinach, whole cherry tomatoes and honey-Pommery mustard glaze
The fish was cooked and seasoned perfectly. I loved the lentils with the cooked down tomatoes and baby dish. Beautiful and delicious fish dish.

Finally onto dessert which we ordered respectively an Americano and Tea to go with.
Twice-baked Warm Chocolate Cake - w/ a centre of warm chocolate ganache, topped with a Sicilian Vanilla gelato scoop and drizzled with a Belgium white chocolate sauce
The cake was phenomenally good! Crispy outside breaking into it revealing a fudgey interior with a deliciously rich ganache spilling out paired with there creamy vanilla gelato definitely a winner!

Overall a very enjoyable Italian meal with good service. Definitely worth checking out if your ever in the Little Italy area for some great Italian eats!

FYI Washrooms are located down a steep set of stairs off in the back to the right, before the bar."}
