{"text":"Absolutely delicious food from the owner's native Mauritania. Very short menu, but don't let that deter you. Everything on it is superb! Vegetarian and gluten-free friendly as well. The owner's hospitality is genuine, refreshing, and knows no bounds. You feel as if he has invited you to his home. The shoes-off policy and batik-draped decor make the experience that much more warm and fun. Good for romance as well as large parties. And so cheap; you get a lot of food for just 25 CAD!! I cannot believe more people have not rated this Montreal must! Allow sufficient time for the personalized service though."}
{"text":"This is a real special place, with a very special chef and owner- Atigh Ould. He will wine and dine you and charm you with his stories about his life growing up in Western Africa, as a Bedouin Nomad. 
The food is always delicious, filling and made with love. He always has different dishes - whether you are vegetarian or gluten free, he can adjust to your needs. He ends every meal with a tea ceremony, which is always my favourite part.
He also opened a cafe attached to the restaurant, serving only Mezzes, his famous Atigh's Hibiscus Juice (often he adds ginger or mint) and Hibiscus popsicles! All delicious. You will lose all sense of time here, so it's a great place to go for a birthday dinner, or to catch up with an old friend."}
{"text":"I bought a LivingSocial deal for this place, \"$30 for $60 worth of food.\" When my boyfriend and I went to the restaurant last Saturday we were impressed with the ambiance and the decor. Upon arrival we are told that it was a prix fixe for a 3 course meal. The appetizer, a mezze plate of tzaziki, a dill and cucumber salad and a sweeter dip was delicious. We opted for the sampler main course which consisted of a chicken, lemon and olive dish, an amazing beef, fig, date and prune dish, as well as a root vegetable dish all served on a bed of couscous. The desert was an uninspiring and very small piece of baklava served with a delicious mint tea.

Though my boyfriend and I both enjoyed the food we felt that  we had been taken for a bit of a ride in terms of the price. Because there is no menu, there is no way to see the price. I felt that $30/person was steep for the meal and that $20-$25 with a larger desert would have been more fair. Upon reading some of the other more recent reviews I noticed that other people were charged $20 for the same 3 course meal. 

I felt that the Living Social deal was a scam as we had paid $30 for supposedly $60 worth of food and then had to pay taxes and tip based on the $60 price tag. We will not return or suggest the place to friends as the lack of transparency in pricing is an issue for us."}
{"text":"The setting is very cute. Great for large groups. The food was average. Not bad. Just average. My favourite part of the meal was the Moroccan mint tea and cake. Very tasty."}
{"text":"Lentil soup and couscous with chicken was top notch. Great service! Small cozy restaurant with west N. African (Mauritanian) theme."}
{"text":"Gr8 place . The Owner is a very friendly person and the food was great . The ambience is great feels that you are having food in a tent and the atmosphere in here was very lively and casual.Food was also great starting with pita bread, hummus and soup . We had chicken and vegetables it was nice and not to mention the mint tea served in the end was amazing ."}
{"text":"I really loved the ambience of this place and the service. It looks like nothing from the street, but it is very charming inside! There seemed to be only two guys working the room and perhaps even the kitchen and things went really quickly! The food is worth trying and I only gave it three stars because it wasn't the right food for me... I kind of wish I could give it more because I liked everything else so much! I just wasn't into the flavours so much, but give it a go and see :)"}
{"text":"The food here was very decent.  The soup, stewed vegetables and chicken were delicious.  However, we were also served stale pita bread from the grocery store and the lamb sausage was quite dry (in fact, one of the sausages was rock-hard) which put a damper on the meal.

The service, however, was downright TERRIBLE.  There was only one other couple in the whole restaurant, but we still waited half an hour between soup and main course.  Worse still, the guy took our main course dishes away and offered us tea, which we happily accepted - and then he took FORTY-FIVE MINUTES to bring it to us.  He kept reminding us that he \"hadn't forgotten our tea\" but every time we looked up, he was just standing around.  We were exhausted from waiting around, but we still wanted to try the sweet mint tea, which looked very good.  (Turns out, it was so sugary that it was barely drinkable.)  And then, to top it all off, at the end of our meal, he TOLD US how much to tip him.

It's strange that all these other reviewers mention how nice this guy is.  The only possibility that I can think of for why he was so rude to us is, maybe, that we were a same-sex couple who came in holding hands? But I don't like to assume people's motives for their behaviour, so who knows - maybe he was just having a bad day."}
{"text":"Quelle expérience !! J'y suis allé plusieurs fois, je vous le recommande fortement. La bouffe est succulente, et surtout, chaque fois on nous fait découvrir des plats et saveurs différentes. Le chef-propriétaire \"Attigh\" se fera toujours un plaisir de vous raconter quelques unes de ses meilleures histoires venues du désert....

Bon appétit !!"}
{"text":"We went to La Kahima with a groupon for two. Our deal was *supposed* to include appetizers, a choice between 3 main meals (1 vegeterian, 1 chicken, 1 beef/lamb), hibiscus drinks, tea, and dessert of the day.

Turns out, that's what EVERYONE gets, groupon or not, as that's ALL they have.

As soon as we arrived, the owner explained us that instead of letting us choose each one of the three main meals (as it was stated on the groupon), he was going to put all three choices in a platter for us. We thought, yeah why not?!? Sounds good! Again, turns out that's what EVERYONE gets, whether you like it or not.

Not everyone however, gets the same portions according to this dishonest establishment! 

Everyone else around us was there with a groupon as well, and while they all got the hibiscus drink, it wasn't even offered to us as an option (even though we technically paid for it). The owner told us that for appetizer he would bring us a choice of different dips with pita, while really we got a platter with a bunch of canned corn and peas, and a tiny bit of a not-so-good zucchini dip. The people sitting beside us got 3 different types of dips, including the eggplant one, which is the one I really wanted to try. 

The owner told us that, regarding the main course, there was no lamb, only beef, and we agreed to it. Ten minutes later our neighbors got served lamb AND beef meatballs. We got 3 beef meatballs in our platter, our neighbors got 6. Again, SAME groupon, SAME amount of people. Lastly, we were not served any water until 30 minutes after we arrived.

In other words, this place is a very smart money trap. Be aware! Definitely not worth the $30 groupon + $15 of taxes & tip. STAY AWAY!"}
{"text":"Went to La Khaima last Saturday based on the reviews I saw online.
The welcoming staff was friendly, the deco was original (to say the least), and it was obvious that the waiter did not follow any basic 'restauration' training; probably à friend of a relative of the owner or something. But that wasn't really an issue..

'Can I see the menu?'
'We don't have one. We cook one meal per day, and we offer it to our guests.'

Still not an issue..

The lentil/ginger soup was ok. Nothing to write home about, but ok.

The vegetarian plate I ordered?
We were 2. There was enough food for 6 people.

The issue? NO FLAVOR!!
Couscous and chick peas in sauce and sliced tomatoes. Not even a hint of salt, not to mention other spices (or lack thereof).

So here comes the mint tea.
Pre-sweetened. Did anyone ask me if I wanted sugar in my tea?

Won't be going back."}
{"text":"The only thing I will say about this place is that I threw up everything I ate after I went home."}
{"text":"When in Montreal, take advantage of the presence of its many North African restaurants. The food was great! The meal ( lunch at least) came with an appetizer, a tagine, and some delightful baklava and mint tea for dessert. I ordered a chicken tagine that had olives and couscous mixed in. It was awesome. My friend ordered a vegetarian tagine which had peanut sauce and some veggies mixed in it. I tried a bit of her dish and it was delicious as well. I loved the  atmosphere of the restaurant,the decor is beautiful and the owner is very friendly."}
{"text":"friendly, great atmosphere. prix fixe price point a bit higher than one would expect (generous entree but small appetizer and dessert.)

worth the experience."}
{"text":"For those who are looking for a pleasant restaurant experience in addition to eating succulent food, this restaurant is a must. The atmosphere is original, welcoming and certainly unique."}
{"text":"So much food. Such good. Much wow. Can't really write right now I a so full from the GIANT meal I had at La Khaima. Not sure who these people are saying they didn't get enough food. We had leftovers despite being very full. They must be very fat or have extremely high metabolisms. For normal people you get a lot. It is very good. Great service, a little unconventional at times but really sweet. Good tea. Great dessert - and I don't even like sweets. It was really good. So good I'm going to laugh a bit."}
{"text":"We had a pleasant experience here. We got in early and were seated right away. The waiter (owner) was very friendly to us. The menu is very short, catering to everyone's taste. There is a veggie, chicken and beer option available. We had to wait a while to get our food and we were the only ones in the restaurant. But no big deal really. What really will prevent me from rushing back quickly was the price. We each got a soup, shared a dish of cous cous and had some tea for $50. Kind of a rip off. But worth checking out! It's hard to find cous cous."}
{"text":"Our family of four had a wonderful meal and delightful experience at La Khaima.  The menu is limited and changes each night.  The night we went, the meal started with a vegetable soup (not sure what it was called), then there were three tagines to choose from --  two vegetarian and one veal.  The owner, Atigh, greeted us warmly and offered to provide us with a selection of each of the dishes on the menu that evening, along with a hibiscus drink and a \"tea ceremony\" at the end of the meal.  Each tagine was delicious, especially the veal dish which was sweetened with dates.  But what really made this a special experience was hearing from Atigh about Mauritania and the camel races and treks he organizes to support the nomadic culture there."}
{"text":"Dès qu'on met les pieds dans ce restaurant, on se sent automatiquement transporter à l'intérieur d'une tente traditionnelle nomade. Les draperies au-dessus des petits sièges et des tables rondes complètent le décor à la perfection. 

Pour ce qui est des repas, une table d'hôte est offerte pour le prix de 25$ et cela en vaut entièrement le prix. La soupe est toujours exceptionnelle et les repas de tajine (une version végétarienne est offerte) sont énormes et délicieuses. 

La Khaima est un endroit idéal pour se retrouver entre amis et découvrir la nourriture traditionnelle des nomades."}
{"text":"Honestly, I get why people like this place. I do. But I was just underwhelmed but the whole experience.

Decor is cool, it feels mostly authentic, but it does looks a little worn and tired. Restrooms are sad (think super thin toilet paper, grimy sinks, supercheap bright pink soap) - but not disgusting or uberfilthy.

Our hostess was friendly and nice, quick and eager to explain everything. Essentially, as others have pointed out, you get some sort of soup, then tajines to share, and dinner ends with tea and dessert. All this, for 25$ per person.

Now, this sounds like an awesome deal - but I've had the same type of meal for roughly the same price with much more frills and thrills (and better appetizers). Granted, it was not Mauritanian, but it was either Moroccan or Algerian, which is close enough to compare.

Soup - lentils & spices. It was tasty, it wasn't so much hot as flavorful. Buuuut. It was just missing a little something. It came with pita bread on the side. Which was just dry and flavorless. I actually saw the guy in the back take them out of a bag and cut them up. It was the same kind you buy for the cheap at the grocery store. Meh.

Tajines - we had 3 varieties, all in the same plate to share. It's essentially couscous with something else. We got vegetable, chicken & olives and beef/lamb with dates (what dates? I didn't see any). That was pretty darn good. Highlight of our meal, for sure. It was quite savoury. But.... I don't know, our plate didn't feel exciting or very jazzed up. Presentation was ordinary. From reading the previous reviews, I was sort of expecting more.

Dessert - some kind of almond cake (or was it orange?). Nothing to write home about, it was a little dry. Good, but nothing special. Came with traditional mint&green tea. Tea was pretty good, but quite sweet.

All in all, we had a good time. Definitely deducting star for cleanliness. Half of the glasses at the table were dirty - and I mean fingerprints and little bits of crusted food.

So to me, this place is no more than a 3 (and if I take into account overall cleanliness, maybe even a 2.5). It's comfort food for cold weather, and the berber tent getup can be fun for a group. It's inexpensive, but it doesn't feel like you get your money's worth. So will I be back? Probably not, but I wouldn't be opposed to the idea."}
{"text":"The ambiance is very unique and authentic. Friendly and nice service. The food has very strong taste, its up or down. Soup was amazing. I had better Moroccan food in the city, but this place is different. Moroccan tea is very good. Price was $20-25/person."}
{"text":"Great food !!! Great service and love the great wait staff. Very cute place ! As my first time trying Moroccan food I'd say a great first time experience."}
{"text":"They cook the food the during the day and they serve the same plate to everybody in the evening. We had pita brad with hummus which waa good, lentil soup as well.... nothing wow. The beef in the main plate was very good cooked with cinnamon... the couscous was also good. A bit disappointed aaI expected it to be better."}
{"text":"Make sure you come hungry, because the portion sizes are a beast. Try the soup and hummus to start, and the beef is something else. Also the carrots are so big and taste good. Bring your own beer and wine makes for a nice party get together. You're going to leave here with your stomach full and satiated. Here's a tip, there's pillows hidden under the seats to make life more comfortable while you chow down."}
{"text":"I do not have better pictures because we were too busy eating. I loved everything about this place, starting from the atmosphere to the food even the hibiscus drink that is made by the chef. You will not be dissatisfied with their set menu because they have very generous portions. Definitely going back to this place again."}
{"text":"Came here this past Friday on a little dinner date and found this place to be a super cute BYOW restaurant!

Service is warm beyond words, and the menu is kept simple: only one option available which is the Table D'hôte consisting of baba ghanoush, hummus, lentil soup, and a mixed plate of chicken with olives, meatballs with dates and okra, and a vegetarian bean medeley (all over a generous bed of couscous). You then end with a piece of cake and mint tea all for $25!

Ladies beware, seating is on cushions close to the ground and the tables are not tall enough for your legs to fit underneath so maybe forego the little skirts and dresses (I looked AWESOME sitting there with my legs  a meter apart and my scarf filling in the gap created by that and the fact that I was wearing a dress. Soooo not a classy look but there was no other way to be comfortable). Because of this uncomfortable seating arrangement, I am docking a star. Had the cushions been directly on the floor, the seating may have been more comfortable/versatile but the way it's set up is really uncomfortable. Anyway, I digress...

So the food came and we were pretty happy with everything:
Baba ghanoush: I don't like eggplant so this wasn't for me but hubby thought it was great
Hummus: interesting - not your typical Lebanese hummus but good nonetheless
Main plate: chicken was our favorite. I wasn't crazy about the meatballs because they were wayyyyyy too sweet and the vegetable medeley was good
Dessert: you're given a little square of a hard and dry almond cake. It was terrible and so a star was docked here.

All in all, great experience. Would we come back? Probably not but only because it didn't wow us enough! Definitely a cute little date spot though so great job on the ambiance.

Oh, one last thing, there is NOTHING Egyptian about anything on the menu here so classifying it as Egyptian is pretty misleading. Otherwise, go check La Khaima out - it won't disappoint."}
{"text":"Des plats qui me ravissent toujours. Delicieusement copieux, c'est toujours un plaisir de voyager à la Khaima. Pour les groupes, c'est toujours top. On a assez de place, on se sent presque comme à la maison. Les prix sont aussi très abordables. Le must, c'est un apportez-votre-vin donc on peut se faire doublement plaisir avec une petite bouteille. Les quantités sont astronomiques, ce qui fait qu'on peut repartir avec quelques doggy bags. Oui oui \"quelques\". =)"}
{"text":"This place is such an experience. Right off the bat, you don't get menus, the host or waiter will tell you what you'll be getting that night and that they can make some alterations for dietary restrictions. Since we don't have any, we got some pita and hummus with a very nice dal-style soup. I'm usually not a fan of lentils but I do love soup, and this was excellent. I ate every last bit. Then they brought out a huge plate with chicken, beef and veggie sections all on top of some couscous, really really flavorful. The meal finished with some mint tea and a tiny ginger cookie, the perfect ending to the meal. Would absolutely go back and with more people as this seems like more of a large group place."}
{"text":"Nous sommes allés manger à ce restaurant avec des amis puisqu'il était un apportez votre vin. Nous n'avons pas du tout été déçus! Dès l'entrée dans le restaurant, l'ambiance africo-marocaine se fait ressentir. Grandes voiles partout au plafond, on doit enlever nos chaussures pour s'asseoir, les tables sont très basses et les chaises sont remplacées par des coussins. (si tu souffres de maux de dos intenses, tu peux quand même demander une table avec chaises).

Le personnel est courtois et s'assure que tu passes une excellente soirée. Il y a trois choix au  menu et chacun est 25$. Nous avons décidé de prendre un peu de tout; conseil venant du serveur. TOUT est délicieux, de la soupe au dessert !! 

Bref, un bon restaurant différent, rassembleur et délicieux!!"}
{"text":"Warm, friendly staff. Comfortable, low key atmosphere. Great food. Reasonably priced.
I stopped in for takeout after sunset during Ramadan and the scene in this place was nothing short of beautiful."}
{"text":"Visited this place last summer, my friend had a half-off coupon.

The menu on the chalkboard, had what was included in the coupon, for roughly the same price, so not much of a savings. especially if you factor in the we pay taxes and tips on the full price.

The food was pretty tasty, the portions were not huge.

At first, the service was pretty quick, since we were alone, but come tea time, it took them 45 minutes to serve us, only after we flagged a waiter. The place was never that busy to begin with. He had time to serve the full tea service to his buddies who came just for that while we were waiting.

A couple came in and started making out right in front of everyone, this is an open restaurant, the vibe is like a North African tent, so they were in full view of everyone and they kept at it while we just wanted to leave.

Those two issues aside, I would go back, probably for take out."}
{"text":"Second time here was just as great as last time. The owner?/chef came out at the beginning to go over the set menu. 

He came out with his own hot sauce and was extremely welcoming and friendly.

Both meat and vegetarian dishes had so much flavour!"}
{"text":"La Khaïma is the first and only Mauritanian restaurant in the entirety of the known world and universe!! This is of course according to the very charming and affable Atigh Ould. The first in the world, people, the first in the world and it just happens to be right here in beautifully sunny-like-the-Sahara-Desert Montréal! Monsieur Ould just happens to be the chef, sous chef, pastry chef, proprietor, chief executive officer, entertainment, accountant, waiter, barman, barmaid, prom king and queen, busboy, owner and chief bottle washer of this highly highly esteemed establishment. Keep this in mind when you come here and for God's sake be patient. Seriously, all you little uncouth philistine pipsqueaks (you know who you are) impatiently squirming in your seats whilst writing on your iPhones about how you so ought to bad mouth this place on Yelp had better shut right the fuck up if you know what's good for you because Papa Bear is looking at you like your pretty little head is a pot of honey. La Khaïma smash! I was pretending to be Papa Bear in that fun little scenario by the way. Seriously though folks, this place deserves at least four stars right off the bat for ambiance alone ... if not the full monty of five stars. Haters gonna hate and they need not apply. 

Trust in me -- for like George Washington, I too cannot tell a lie. This place is super super suuuuper good. The food is outstandingly sumptuous and you're bound to have a great time if you relax and let go of time just for a little time. First of all: our anthropomorphic conceptualisation of \"time\" doesn't actually exist and secondly: it definitely doesn't exist here. Bring a bottle or two of your favourite Pinot Noir or Malbec, take your shoes off and sit cross legged or even better ... lay back with your head resting in the lap of your favourite friend or lover and look up at the billowing tapestries that line the ceiling. Take a tab or two of LSD (that's Lysergic acid diethylamide for all you trippy chemists out there) or do half an eighth of shrooms or smoke a doobie or drink a mickey of gin or get all spacey on GOD. It's so beautiful, the colours, man, the colours! Those lamps you see are authentic from the Sahara! This place is one-of-a-kind. Err'body in the club getting their Bedouin on. Where else are you going to go to for that nomadic Mauritanian Berber cuisine you so dearly crave? That's right ... nowhere else. Why? Remember? Because this is the only place in the world! Enjoy!"}
{"text":"Great food, great atmosphere, great price. The take your shoes off bit is particularly great when you have your hefty winter boots."}
{"text":"Excellente place, que ce soit au niveau de la déco, du service et de la bouffe!
Tout est beau et bon! Les plats sont traditionnels de la région nord-Afrique, avec beaucoup de saveurs et d'épices. Il y a aussi des plats vegan pour ceux qui veulent.
Service très aimable! Proprio (enfin je crois que c'était le proprio) très sympa et drôle!
En plus, c'est un apportez votre vin!
La table d'hôte est à 25$ pour entrée, plat et dessert.. tout est très copieux, vous repartirez avec des doggy bag garanti!
Bref, à essayer!"}
{"text":"L'endroit était plein à craquer mais parmi les restos de cuisine de l'Est et du Nord de l'Afrique à Montréal, c'est l'un des moins savoureux que nous ayons essayé. Selon ma compagne, seul le buf était savoureux. Le reste était fade sans assaisonnement, même les options végé. Le décor est rustique et à améliorer. Le personnel est très sympatique et sont la raison de laisser un pourboire."}
{"text":"It's a really amazing place we found in Montreal. And I think it should be the best dinner we had in this trip. It's kinda of omakese in African style dish. Only $25/person. (It can actually be 2 meals)
Including appetizers(soup and pita), main, dessert and tea. The appetizer was really amazing. They gave us the soup, and hummus with pita. The soup was really savoury. The hummus must be the best hummus I've ever had. And the pita was really soft like bread. After the appetizer, they offered a huge plate for the main dish, which has beef, chicken, and vegetarian beans. Each kind was tasty. The meat was not dry. They were savoury juicy and fluffy. The meat was either savoury with the gravy or inside itself. And the vegetarian beans was amazing as well. After the main dishes, they offer the desserts, not sweet, also with a pot of ginger tea. Although I don't like ginger too much, I finished the whole pot. It was a really amazing experience.

The service was really good. They offer the service in the high pace. Very efficient and helpful."}
{"text":"My family's experience here was truly spectacular. This small place has a warm and authentic feel with colored fabrics hanging from the ceiling and other Moroccan decor, with two rooms: one with low benches around tables, and one where you sit on the floor to eat.

The owner (I presume) was very warm and came out to greet us right away. The entire menu was just what he had written on a chalkboard for the day, which he carried around with him: soup, a vegetarian entree, chicken, and beef. We couldn't decide what to get since they all sounded amazing, so he suggested getting a sampler of everything on a bed of couscous, and we ordered that for just $25 per person. (The owner speaks perfect English and French.)

The first course was the soup: lentil and chickpea, with cumin and other spices. Delicious. Next was the main course, which came out on one huge platter for all four of us. The beef was my favorite - cooked with dates, apricots and plums, and so tender that it fell apart effortlessly with a fork. It ended up being the perfect amount of food for four hungry people.

When we finally finished, we were ready to go and asked the waitress for a check. She agreed, but the owner came back and said \"No, no, please, we still have tea and dessert for you!\" A few minutes later he came by with hot, sweet tea served with a flourish (poured into the glasses from several feet up), paired with teacakes.

All in all, the incredible ambiance, warm and generous owner, unbelievably delicious food, and the great value for the price combine to make this place a wonderful destination that I couldn't recommend highly enough."}
{"text":"Wow. Just WOW! This is an experience like no other.

The food is tasty and hearty, and the price is very reasonable, but it is the exemplary hospitality and cordiality I experienced here that surely will live in my memory for many, many years. 

A Mauritanian meal is a communal repast. You don't just eat by yourself, looking all forlorn. So when I showed up by myself for brunch, Atique, the gracious owner of La Khaima, took it upon himself to bring together a merry group to share the feast. What followed was an afternoon filled with merriment, gluttony, and new friendships. 

While the chicken tagine and the omelette are full of flavor, I would recommend accepting the special hot sauce they offer, to give the food that extra kick. The hibiscus tea is nice and refreshing, and a great way to finish up the fantastic meal. 

This restaurant has me quite captivated, and Atique and his staff definitely will continue to see plenty of me!"}
{"text":"So it turns out that this restaurant is actually Mauritanian, more so than Moroccan or Egyptian. 

Upon walking in, they ask you to remove your shoes (good thing my sister had warned me). The seats are extremely low and unless you get the side with the wall behind you, there's no back support. The table is also low and in the way of where your legs go. VERY uncomfortable seating! Ladies, don't try to dress glamorously when you visit!! I did like the traditional vibes and tapestries hung on the ceiling.

The owner is a tall, loud and beaming man, who bellows \"hi, how are you?\" with a smile when he spots someone new walking into his restaurant. I like the kind of attention he pays to his diners, but his sense of humour can be a little hard to read at times. 

As part of the $25 table d'hote menu, they brought out family style lentil soup, hummus, eggplant dip and pita bread for the appetizers. The hummus was too acidic, the pita bread was taken out of a bag and sliced, the eggplant dip was pretty good, and the yellow lentil soup was excellent. 

*Personally, I would skip the hummus/eggplant dips for the $5 extra each and stick to the soup & tagines for the $20 table d'hote*.

They then served us 3 family style tagines with couscous; chicken with confit lemon & olives, beef, and vegetarian. The beef - while the least visually appealing, was the most delicious, with balanced flavours. The chicken was too acidic (though I loved the olives) and the vegetarian was too bland. The tiny bite-sized cake at the end was yummy and flavourful but the tea was WAY too sweet. They should bring the sugar on the side!

I really love trying new experiences in Montreal, and while I had a good time, I didn't find the food to be worth $33. Maybe I would go back if I had a Groupon. 

I totally see why this place is popular if you're craving a unique experience in Montreal. Great place for groups & BYOB!"}
{"text":"Seriously,  just wow. The food is the perfect blend of interesting and comforting. If you don't think you'll like it,  never fear. The space is beautifully intimate. The owner is just lovely, instead of kicking us out he told us stories.  I had such a great time here.  Definitely opt for the smattering of everything, because literally everything was superb. Very inexpensive for such wonderful, plentiful food and ambiance.  Byob which is a huge draw. Live music just walks in,  apparently that's a thing about this restaurant.   The music isn't obtrusive,  you can still have a conversation.  There is a music festival from February 7-11 when the owner rents a space across the street and does food and has cool live music. Def going."}
{"text":"Amazing place for lunch with great atmosphere. We got the special which changes daily. There was live music and you could play the instruments."}
{"text":"Great family styled food with an intimate setting. We sat on the floor with a long table, which was a great/ different dining experience. For 25 per person, you get soup, 2 meat dishes, and a vegetarian dish for share. The chef was very friendly and funny. He came out and introduced each dish and brought out a homemade hot sauce. BYOB. Would definitely recommend coming here!"}
{"text":"Love this place! Food is great and the space is beautiful!"}
{"text":"Fait que j'ai finalement découvert La Khaïma. Faisait un bout que je voulais l'essayer... c'est fait et définitivement à refaire. Nous y sommes allées 6 collègues de travail.

Premièrement, c'est un apportez votre vin... ce que j'adore, c'est dans ces moments qu'on s'offre des meilleurs vins. Dès notre entrée dans cette caverne d'Alibaba, des draperies aux couleurs flamboyantes et des grands tapis sur un plateau surélevé, avec un chef cuisinier (proprio??) bien souriant nous accueillait d'un grand sourire et d'un signe de la main.

Petit astuce: Nous enlevons nos souliers pour aller s'asseoir.. prévoyez des chaussettes :)

Une gentille serveuse et un sympathique suiteur, nous ont apporté de l'eau et un seau de glace pour le vin. Ensuite vint la soupe.... OH MY!!! Elle était trop bonne!!! J'adore ces nouvelles saveurs et odeurs!! Ensuite, le plat principal.. était un plat à partager... ÉNORME! C'était un gigantesque couscous 1/3Poulet, 1/3 boeuf et 1/3 Végé. Ils était tous bon, mais j'ai préféré celui au poulet. Très copieux comme repas, chacune de nous a mangé à sa faim.. même un peu trop et en avons tous eu pour ramener à la maison.

Finalement, la serveuse nous a servi une petite part de gateau et un thé sucré à la menthe, le gateau m'a laissé indifférente, mais le thé état très délicieux, j'aurais bien bu la théière au complet!

Overall, belle expérience, chaleureuse ambiance et bien sur que les gens qui nous accompagnent font toute la différence. 

PS: Je ne peux pas commenter les prix car c'est la boss qui nous a reçu!!! N'est-ce pas génial?"}
{"text":"One of my favorite places to come for warm service and delicious food! Menus are preset and always delicious. Remember to bring your own wine!"}
{"text":"BYO in Mile End that I tucked into for a friend's bday dinner last week and couldn't have been happier to find myself in such a cozy port in the -30 storm. We sat in the shoes-off elevated area surrounded by big pillows beneath the billowing tapestries that patchwork the ceiling. Water was served in cool glass carafes, wine bottles popped, bowls of hot dahl served, and then giant stoneware dishes, one vegetarian, one chicken, one veal (which I didn't try but folks raved over.) The chicken was moist and slightly spicy and the vegetarian had lip smackingly good potatoes. After the meal we were served hot sweet mint tea that was a perfect kick back out the door into the cold. 

The restaurant was short staffed that night so the owner was cooking and serving and he did an amazing job juggling it all with a smile. We paid a flat $20 each plus tax which seemed like a fair deal for the massive mounts of meal and the great good vibes."}
{"text":"We went to this place with a groupon. The owner offered us a 'special' meal because he supposably really liked us as guests. We would get to taste every type of tagine (chicken, beef and vegetarian)...that seemed like plenty of food for three people! They started us off with a soup. Quite tasty, but...my cousin found a thick black hair in her soup. Not ok! And then, to make matters worse, she found a little piece of bone. I don't think this is part of a traditional pea soup, right? We complained and the waiter apologized. The owner said he would make up for it with a delicious three type tagine platter. 
When we got the tagine platter, it turned out everyone around us (with a groupon probably) had EXACTLY the same thing. The owner was obviously just fooling us in telling us that he would make us something special. On top of that, the portions were quite small, really not enough for three people. Afterwards we got our desert: small pieces of almondpaste mixed with sugar (I was actually crunching on the sugar, disgusting). After this dinner disaster was over, we got our bill, paid it and didn't leave a tip. The owner yelled something at me as I walked out the door (probably about not tipping). The whole fiasco was finally over. My advice: STAY AWAY"}
{"text":"Génial !!! On est aller la bas avec 3 amies pour l'occasion de MTL à table, puis c'était plus qu'agréable. On arrivé dans cette ambiance nord-africaine avec un décor tout  en couleur, on dépose nos chaussures à l'entrée de la salle qui est rempli de banquettes et coussins. Le menu change à tout les jours, menu à trois services, tout le monde mange la même chose . Nous avons eu le droit à une soupe de lentilles, in coucous trois façon (poulet, agneau et végétarien) et pour finir thé à la menthe à la parfaite température avec petit gâteau. Tout est servi dans de grands plats 'family style', et est assaisonné parfaitement. J'y retournerai avec plaisir. En plus c'est apporter votre vin!"}
{"text":"Great place! The atmosphere was cozy , the meal price was fixed, and included an appetizer, main dish, dessert, and tea/drinks. The portions were huge and you could bring your own wine, it's such perfect :)"}
{"text":"I just love this place. This is from far my favourite restaurant in Montreal."}
{"text":"We came late in the evening for dessert and tea. Both were great, but not as great as chatting with the owner, who entertained us with stories."}
{"text":"A little late on this post....

I ate here with a few friends this past summer...and it was an all around, amazing experience! The meal price was fixed, and included an appetizer, main dish, dessert, and tea/drinks. As the food comes in courses, plan on spending a bit of time here. The experience is meant to be savored and enjoyed, not rushed through! Everything was absolutely delicious! Not only was the food amazing, but the decor, atmosphere, and service were great, as well. After having lived in West Africa (although not Mauritania) previously, this restaurant and the restaurant's owner gave me everything that I missed about that part of the world - the hospitality, the culture, and the flavor. 

Although I currently live in Buffalo, I will drive back to Montreal to eat at this restaurant again. I HIGHLY recommend it!"}
{"text":"It's one of the best African restaurant in Montreal. Hands down. The place is just like in the Khaima in the African desert. It showcases the African northern culture at its best."}
{"text":"Perhaps the only Mauritanian restaurant in Montreal, La Khaima is one of the best options if you are looking for a place to eat in the Mile End area. The decor is warm and cozy, with cloth covering the ceiling and giving a tent-like atmosphere. The owner, Attigh acts as server, cook, host and entertainer. He is a really interesting character and was the subject of an award winning documentary (http://vimeo.com/11617345). 

The menu varies, but everything I have tried there has so far been excellent. The cuisine is very similar to Moroccan cuisine and the menu usually includes one tajine, and one vegetarian option. You can ask for a sample platter containing the various menu items of the day.

The mint tea at the end is one of the highlights of the meal. It is sweet and intensely fragrant, and as a bonus, Attigh turns the process of oxygenating the hot brew into a fun show to watch.

La Khaima is a real treat and is highly recommended."}
{"text":"The diversity of Montreal's restaurant scene is on of the things that makes it so fantastic and La Khaima contributes to that.   Being in a group we we seated in sort of booth complete with comfy pillows.  The table was a little lower herethan usual which wasn't the greatest for eating but that is my only complaint really.

The food was really good here although I can't remember the names of most of the dishes.  We had a table d'hote menu which included a variety of dishes served family style.  We also had a hibiscus-ginger drink which was very refreshing as well as mint tea which I thoroughly enjoyed.

The owner is very welcoming and does a great job of explaining the dishes to you.  He also served us the hibiscus drink according to the custom from his home country which I thought was a nice touch.  Apparently the pitcher containing the drink has to be put on the table for all the guests to see before you can serve it. Anyways definitely check this place out if you get a chance!"}
{"text":"My husband and I ate here this evening and it was tremendous. The food was bursting with flavor and reflects the care with which it is made. It's rich and complex and hearty but not cloying or heavy. Really just beautifully prepared and wholly satisfying.
 As other diners have noted, the owner is uniquely hospitable and kind. He really cares about your experience and makes you feel as if you are a guest in his home."}
{"text":"Great cosy and original restaurant. The chef/owner/waiter/entertainer is a very friendly, pleasant person. The decoration takes you straight to Mauritania, you take off your shoes at the entrance and sit down around one of the decorated table. We  had lentils soup to start and then had a mixed of couscous with chicken and olive, lamb and dates and vegetarian dishes. At the end fresh mint tea to digest everything. Very good location for group. Finally it's a BYOW"}
{"text":"I love the concept of sharing food with a group of friends. If you're looking for a fun dinner experience and friendly service, then this is definitely a place worth a visit. The food is delicious and it's BYOB too so it won't break your bank. The decor is special too, so if you're looking to impress your date, check it out."}
{"text":"What to say about this A-M-A-Z-I-N-G place?! 

A piece of Africa in Montreal. The food is delicious and served in a very special way: in a big dish where each one can serve yourself. The sentiment of sharing the food. 

Seriously. Sounds silly, but it's a piece of home away from home. 

(I'm not from Africa but I'm from a place where you'll find lots of African influences: Brazil). 

If you're looking for something different from the \"French way\" of serving. This is the place. 

We tried two different dishes: one was made of chicken and the other was beef. Both amazing. 

The owner works in the kitchen and he is very friendly. Don't forget to ask for the famous tea they serve.

I will be certainly back!"}
{"text":"the decor is really authentic and the food is good
The chicken is really good, the meatballs were good."}
{"text":"The restaurant has a very authentic vibe. The service was very hospitable. However, the menu is poor. Only three plates that you get to try them all at the same time. It was a fun experience but not encouraging to try again."}
