{"text":"Very friendly staff! The food is basic but well-priced and very tasty. I had the pulled porc sandwich with lentil salad and a coffee for 8.50 which was very filling and tasted wonderful! They have vegetarian and vegan options. I will be back!"}
{"text":"I've spent a bit of time working in this neighbourhood and have always had to pack a lunch if I wanted to eat healthfully. This place has reached out to the not only those living in the neighbourhood but also those working here! 

The food is fresh, yummy, and reasonably priced. Their baked goods are decadent without being pretentious. The sandwiches are served on hearty bread. Haven't tried their salads of drinks yet, but you'd better believe that I will!!"}
{"text":"Petit café sympathique qui sert le brunch le week-end au son d'un trio jazz live. Je recommande fortement de prendre l'assiette du sud-ouest qui comprend un sandwich déjeuner avec du porc effiloché!"}
{"text":"The Cello player caught our attention from the outside. The staff were very friendly and helpful. The prices are very reasonable and the plates (we went there for brunch) have standard look, taste and portion. There is a small back yard with tables where you can sit. 
Although the furnitures are not brand new and in some cases on the verge of collapse, the place has a unique modest artistic vibe."}
{"text":"5.5$+tip for a small grilled cheese sandwich is a little steep, even with caramélisés onion and a nice smile. It's good but I'd rather bring my own lunch to work than eating there."}
{"text":"Super cute place with great vegan food. We ate on the terrasse in the back and there was a jazz band inside. Very much enjoyed my experience :-)"}
{"text":"Great place for quick lunch or coffee. Visited twice now and both times the staff was very friendly and helpful. The carrot ginger soup was delicious, even my 2 year old enjoyed it! Has a very nice community feel and cute interior. We will definitely be back again."}
{"text":"Aujourd'hui je suis sur le chemin pour regagner mon domicile et plusieurs fois avec ma femme on a eu envie d'aller prendre un lunch mais toujours un truc à faire.. bref 
Je m'arrête pour prendre un café et puis une petite pâtisserie il était presque 4 pm, je ne sais pas si c'est le gérant ou un employé mais super service très bonne explication ! Alors la semaine il propose des petites pâtisserie et viennoiserie très bonne, ensuite le week-end ils ont un menu pour les brunch les prix sont plus que abordable et le service top je recommande vivement cette place !"}
{"text":"Saturday brunch. Burnt coffee undrinkable. Asked for water 3 times (3 times!!) and then it was tepid and in tiny glasses. Sausages were almost inedible and really cheap. Salads on the website not on the menu. Eggs barely cooked. If those 2 very small pieces of dried (not toasted) bread was what passes for toast I'm the pope. No condiments offered for the potatoes. My dining companion told you they were Celiac and you still put a muffin on the plate, a corn muffin granted but they told you no bread. Scorching hot day and no AC so the inside was boiling but the outside tables didn't have enough chairs, no salt or pepper. Wanted to like the place for my dining companion who said they knew one of the owners but I will never go back there."}
{"text":"My new little favorite spot near my home!! I'm so happy. T have this around the corner. It's super cozy with home made food. Small menu but perfect! Very tasty Breakfast - lunch - coffee - a bit of wine - a bit of beer and cocktails. Vegetarian and vegan options! The music  is nice too :-)"}
{"text":"Great spot, service, food and atmosphere. Strong WiFi and pretty quiet before and after lunchtime rush so perfect for working."}
{"text":"This is definitely my new go to place in st Henri, great atmosphere simple delicious home made food and baked goods amazing service and a great outdoor neighborhood garden terrace.  It's on a quiet part of st jacques no hussle or bussel.  I highly recommend it."}
{"text":"Petit café de quartier très charmant! Le café ainsi que les déjeuners qu'on y sert sont très savoureux....on est loin des grosses chaines resto-déjeuner qui servent des repas génériques. Nous avons eu droit a de la musique live lors de notre dernière visite (petit band jazz relaxe)!!! À essayer: sandwich-dejeuner porc effiloché!"}
{"text":"I regret to report that this was one of the worst lunch experiences I've had in a long time. I was really looking forward to visiting this cute n' new spot in the neighbourhood and was sorely disappointed. The service was unapologetically slow and laissez-faire to an utterly frustrating point; we ordered our $7 sandwiches in an mostly-empty resto and, no joke, twenty minutes later the cook comes finds us on the terrasse to tell me they're entirely out of my sandwich contents. No worries. I order a fancy grill cheese in lieu. When it arrives, another fifteen minutes later, I receive the sandwich version of a pressed wet fart (with onions). Nothing drives me more bonkers than a $7 half-inch thick sandwich with zero accompaniments (I'm not even sure I got a napkin).
As well, as another commenter mentioned, getting water here is like pulling teeth.

The only redeeming bit about this place is that it is adorable. That's it."}
