{"text":"I do NOT understand why and how people give this place raging reviews.   1) China has many... Various ( North, South, Hong Kong) ... Cuisines...  2) Many Chinese-American or Chinese-Canadian restaurants drastically modify their recipes to cater to that population...  All that said, I ordered a sole fish with vegetables. The dish was drenched in a white, gummy, dense sauce. Fish was sooo salty. I like to be able to taste my fish.   My friend ordered Chow Mein Noddles. They were decent, crunchy. Still too much sauce."}
{"text":"Really enjoyed this place. The Cantonese pan fried noodles were really good. The stir fried watercress with garlic were outstanding.  Open late.  Overall a good place."}
{"text":"Authentic experience.  At first glance, you see the white tablecloths--ahh, white table cloth experience! Well sure, except that they are plastic for easy turnaround. The waiter first delivers free hot tea and sets an empty check and a pen on the table. Was I supposed to write down my order? I think so, but he ended up taking it for me.  I got the dinner for one, which had short ribs, egg roll, wonton soup, chicken fried rice, and something else that wasn't very good. Pretty good food, and what you would expect for the experience."}
{"text":"Been there 2 times. Open until 4:00 am. Found it funny there is a \"Canadian menu\" and an \"Asian menu\". Ordered from the Asian menu because I wanted a more authentic than watered down experience. Very cheap prices and generous portions. Service is alright but fast. Had the beef chow mein and broccoli and beef. Quite delicious.  L. John Dory Twitter: @LJohnDory"}
{"text":"Had the 4 person set meal for dinner and the portions were very generous. The fried rice, noodles, fried prawns and pork ribs were part of the set meal. Overall, the chinese food is pretty decent and authentic. This place was very crowded when we were there, so try to be early or make a reservation before arriving."}
{"text":"Great food.  Wait staff grumpy at times, but the food was great!  Portions are large.   Not expensive at all."}
{"text":"Best orange beef in town, the Singapore noodles are to die for, great lemon chicken. Love this restaurant, and I've had my share of Szechuan restaurants. Definitely a hit in my books!"}
{"text":"Excellent food with atrocious service. I highly reccomend coming here and getting the general Tao chicken. You will NOT be disappointed, however , don't be surprised when they yell at you for asking for a to-go bag or if they throw your tip money across the room because they don't think it's enough ( both of those happened to me on separate occasions.)   Worth going though , foods Hella tasty"}
{"text":"I can't believe I've never reviewed this restaurant.  Let me just start by saying I've been going here for about 35 years. Yes you can say I'm a regular, all the waiters know me from since before puberty, yes that's right I get special treatment, don't cry about it just keep coming back, once they know you, you get special treatment too. I realize that my review of this place could be slightly biased but hey I'm still allowed my favorites.  The favorite dishes here are the chow mein (cantonese or beef), the lobster special (ginger and scallions), and the hot and sour soup. Sweet and sour pork, Pekin style duck... pineapple chicken  Now most lobster specials in chinatown come with some sauce, this one is lightly battered salted and sauteed, so the shell is very flavorful, suck on it you must or you'll miss out on all the flavor. The sauteed dry lobsters (2 for 34.95) are served on chopped lettuce and ginger and scallions, it's not just garnish, eat it up, it all adds to the dish. When the lobsters are good (stiff shells gives meat with good body and texture, soft shells the meat is a bit mushy not as good) and the chef in on, there is no better lobsters. On average, it is still a very good lobster and hard to beat.  The chow mein, here's why I like it. It's part crispy, part wet. Don't let it sit, serve and eat right away, otherwise the wet part gets a bit soggy. get a bit of everything, crispy noodle, wet noodle, meats, veggies and enjoy. It's perfectly balanced in terms of taste and texture, add a bit of soy sauce and hot sauce if you want, a little chinese pepper is good too. you might find that chow mein is bland on it's own, but cantonese dishes are usually very steep in one taste and is meant to be paired with another to balance out, a meat dish with some sauce like mongolian beef or sweet and sour dish could fit the bill here, also Pekin style duck is a good dish to add here.  The hot and sour soup, again another of my favorite, sour and spicy just evening each other out is what you get, good color, shrimp just cooked, and tofu is soft and silky. Again perfect taste and texture.   Other good dishes are salt and pepper calamari, soft shell crab or shrimp (comes with the head) these are similar in to the lobsters in tastes and texture. You could add a sweet and sour pork or shrimp dish, which pairs very well with the salt and pepper dish. We always pair a wet dish with a dry one, sweet or sour against salty, also a simple sauteed chinese brocoli with garlic is good veggy choice which is bland and pairs well with all flavors...  I love this place and I'm biased but I've explained my reasoning hopefully it makes sense :)"}
{"text":"This is probably the best chinese place in Montreal. I have been here thousands of times with many different people, and every time it was great. Bugdet decor, small, frequent line-ups... even at 3 am...  C6, C22, H2....are the best items on the menu. I think I have tried them all. whether for lunch, dinner or after a long night out, this place will not disappoint. I understand why it's the only Chinese restaurant in china town that is continuously very busy."}
{"text":"Les prix sont aussi ridicules que le service. Ils vendent des repas à 4,50$. Comment se plaindre?"}
{"text":"Delicious food.  Try the green beans with pork.  Loved the Hunan dumplings- they have irresistible peanut sauce Good service"}
{"text":"Awful tables had plastic bags. After looking at a menu they give you a pad and ask you to write down what you want. Got annoyed when we asked questions . Chicken with pecans was so goopy I was disgusted .  Chicken was covered in fat.  Ate a  quarter of it and left it. No taste to it at all covered it in mustard just to get it down. Very disappointed"}
{"text":"I was pleasantly surprised by this place, especially after reading the mixed reviews. I went with a large group of people, so had the chance to sample several dishes and almost all were excellent. We especially loved the beef and vegetables in bird's nest (a crispy noodle fried into a nest shape), the general tao tofu, a fried pineapple tofu dish that wasn't on the menu but they allowed us to create, a huge noodle/veggie/chicken dish (the wheat noodles weren't amazing on this one, but it was still a fun consistency). One of my Chinese friends ordered a duck's feet dish. I'd never seen duck's feet so up close...it was interesting.  As others here have noted, the price is extremely reasonable and it's a great place to go with a large group of people (the lazy susans on each table make for easy sharing).  Well worth a visit!"}
{"text":"This is an excellent place for late night eating,big portion plates and very affordable"}
{"text":"Can someome please explain to me why this place gets such awesome reviews. Its awkward and oddly designed, understandable. But it was dirty. The tea pot was crusty with sauce. Service was ok, i felt like he didnt want to answer any questions we had, and i felt rushed. All in all it was a lot of food that is questionable quality, plastic trash bag table cloths, and awesome yelp reviews. Wouldnt return."}
{"text":"I have to wonder why New York City doesn't have just one good Cantonese restaurant of this caliber, but it is what it is (as they say here). I went with my family this past weekend on a Saturday evening (Canadian Thanksgiving weekend to put this review in context) and initially had some anxiety as to whether we would even get a table. We walked in and this family of five told us that without a reservation we didn't have a snowball's chance in hell of getting one. They themselves had ordered takeout and were trying to move heaven, earth and a seemingly unsympathetic waiter to get them a table to no avail. I had to start thinking of a backup plan (which meant furiously scouring this app) but to my surprise (and probably to the dismay of that family) the waiters saw that we were three and told us to wait for 15 minutes. Luckily that family had given up and left, otherwise I am sure there would have been a scene. But looking back, another family without a reservation eventually got a table so the comment about not having a reservation may have been a myth. Just to be on the safe side call ahead because this place is worth it.  Now the reviews that dwell on the table cloth a la plastique are correct and the decor ain't some decadent restaurant you'd find in Hong Kong. If that is essential for the dining experience then look elsewhere. I never got the impression that this place was dirty but we aren't talking about a five star hotel restaurant ambiance. It is the food that makes this place worthwhile. I would even dare say I would go to Montreal just to eat here if I was given only one meal (over poutine, smoked meats, etc). Get the hot pot with bean curds and assorted meats. The chow fun with black bean sauce and beef was amazing. If you like Cantonese style Chinese food (which I prefer over Shanghai or Szhechuan), you can't go wrong here. And the price is what makes it so reasonable and worthwhile. The waiter was honest in telling us not to order more than we could eat and that is integrity given he could have not cared, collected on his tip and made us carry multiple doggy bags. If you want good Chinese in Montreal (after you have had the typical Montreal staples) make your reservation today."}
{"text":"I've eaten Chinese szechewan food in restaurants all over  north america and the is one of my favourite spots. not a fancy place. not the best service - but the food...amazing...I've been eating here for over 20 years. best general tao, crispy beef, pan fried noodle dishes, baked salted shrimp, spring rolls etc ...just be careful cause parking is a bit of a bit*h."}
{"text":"On a layover nearby hotel, it was nice to find a restaurant that opens late. Ordered yeung chow fried rice and a supposedly fish and pork belly in a sizzling pot. The fried rice was pretty good  However, I had better sizzling pot else where. I asked the server what's in the pot when ordering. He told me fried fish, pork belly and lettuce. When the food came, instead of pork belly which was advertised in the name, I got shredded pork. I got snow peas, red peppers, mushrooms all shredded. Totally a dish taliored for westerners."}
{"text":"Just came back home from the place. Food was great however, I saw that one of their waiter treated another person like crap. :/ but my service was good. Food was good but depending on who's serving, the service may be horrible."}
{"text":"We waited 20 minutes at the door to he acknowledged and no one even bothered to answer to us. It wasn't even busy, the (numerous) staff just stood there and acted as if we weren't there. Great way to give a first impression. At that point, it doesn't even matter if their food is good or not, if they're not able to offer a minimum of decent service therefore acknowledging the clients that are waiting to be seated, they don't deserve to call themselves a restaurant."}
{"text":"We made a last minute reservation with no problem. Ordered beef and broccoli, general Tao, chicken fried rice and egg rolls. SO good! The waiter was kind and quick! I would recommend this place and definitely return."}
{"text":"Due to an amazing lack of reviews for Montreal's wonderful Chinatown.  I had to just take risks and walk into places unknown, just like the old days before the interwebs...  After walking around Chinatown for a few days, and spying on all of the different restaurants and their patrons, we finally chose this location out of many.  From peering in from outside the front window, it appears to be a white tablecloth establishment.  But, after reading the menu prices on the wall, I knew it was too good to be true.  Indeed once we were seated, we were quick to realize that the tables were covered in layers of at least 50 white plastic trash bags that slip around underneath your food.  Makes for an appetizing situation and sound.    Like I noted before, the specials are kindly posted on the wall in Chinese, French, and English with clearly listed prices.  The Snow Pea Leaves with Garlic Sauce were excellent and under $14 CAD, which was a surprise.  Normally, this dish will set you back about $14.95.   Sadly, that was the only item that we ordered off of the wall menu.  We should have stuck with the wall recommendations, especially the 2 for $24 lobster special that everyone around us was ordering.  They obviously knew what was up, and we did not.  The Salt and Pepper Pork Chops were actually a little spicy, much to my amazement, and it made me happy.  The Sliced Fish with Black Bean Sauce, could have been worse.  But, I detest celery and this dish had a ton of it.  It was my fault for not letting the waiter know.  For a Hong Kong style establishment, the service was absolutely amazing.  Again, much to my surprise.  The dishes come with complimentary bowl of steaming rice and a pot oolong tea.  Everything was plentiful and quite cheap.  Montreal has made me more humble in many ways."}
{"text":"When we finally got served, things were fine, but getting service was long and arduous. There was a large table which was taking up the waiter's time. When we did get service, things did start to move and we had dishes delivered to the table. The food was good, but nothing was outstanding. It's a good place to come with a group to share dishes."}
{"text":"STAY AWAY from this place!!!! Ordered a four course meal and every single one of them were absolutely disgusting!!! The waiter was rude and just walked away. We were never given water the whole time we were there. The Hunan dumpling came with sandy/slimy peanut butter sauce. You can tell they were old and pre made. The Singapore style noodles were void of any form of flavor, not even a hint of salt. The chef's specialty looked and tasted like the chef is a 4 year old kid cooking our meal. I just hope we don't get sick from this trash. We left with some food untouched. Stay away and save your money!!! I wish I can give this place no star. They don't deserve it."}
{"text":"First thing I'd like to post is that the food is absolutely amazing. You get great value for your dollar, it tastes great and comes out of the kitchen in okay time. They also give complimentary tea as well.   The service is not great. They didn't come and ask if we needed anything after the food was brought. I had needed to call over a waitress myself 4 times. Which for me is not the greatest. The place was half full and with 2 servers could've been the issue.   The decor is very dated and dreary as well the cheap plastic tablecloths that stick to your arms when eating is annoying. It was also very cold as the AC was on high but I understand on hot summer days is that way. Bring a coat.   I wasn't impressed I had to call the waiter 3 times to pay and leave. I was left sitting there. Overall, great food and value. But low service and low decor.   My friend was overcharged and he made an issue with fixing the bill $1.00 which to me was unacceptable. Also he showed he was annoyed about making the correction.   I'd order to go from here but the dine-in experience leaves a want for more."}
{"text":"This is the 2nd Chinatown experience that has us committed to returning! Fantastic!  We wanted to split a late night meal, nothing too heavy. I literally just walked around the corner from the hotel to this treasure around 11 pm. They were mostly full, but had no problem helping me with my to-go order. I speak French, but the server immediately  (and  fluently) offered suggestions in English. I waited 10 minutes at the most.  Most importantly, the food! All the dishes people were eating looked/smelled amazing. I was craving shrimp, so I chose one of the specials, #16 Plateau de Fruits de Mer Gresillant. It was so good! It had lobster, shrimp, scallop, and cuttlefish with tons of huge chunks of vegetables in the most delicious oyster sauce. It came with rice on the side, which soaked up that tastiness beautifully. We also had an order of  (2) vegetarian spring rolls, which were also good. I asked for whatever sauces he recommended; he loaded us up with something I heard someon else call  \"Chinese ketchup\". It was like Sriracha, but thicker and saltier with a bit more kick. There were plenty of other sauces too. We can't wait to go back. This is such a find! Oh, the total was  $20 Canadian, which was $15.42 American."}
{"text":"After a night out in the town, this place is pretty decent for some late night grub. For 5 people, we spent only $15/person and had a lot of leftovers. Service was good and the food was a tad salty. Nothing major to praise or complain about."}
{"text":"Being the very few caucasian to actually eat in Chinatown i have to spread the word to my white and colored fellow man and women this beautiful Chinese restaurant is super yummy at a terrific prices, bargain to eat. I credit my Asian friends for taking me here."}
{"text":"WORST SERVICE EVER!!! Not only the food wasnt that good, a friend found a cockroache in her food!!!!!!!!!! They were so mean and unprofessional. The place is nasty, the food is meeh, AND THE SERVICE IS HORRIBLE. Theres so many better places to go for chinese food."}
{"text":"Came here for the lobster that was such a rage on yelp. Told the asian waiter that we want the lobster our neighbouring table was having and then he looked  at my and my boyfriend's brown face, gave a slanted, skeptic smile and said \"that lobster? That's $22.\" I stared at my boyfriend with my eyes wide open while the waiter lefr our table to give us more time. I exclaimed to my boyfriend, \"how racist of this guy. Just cause we're brown we can't afford a lobster? We should like order TWO lobsters just to show him up\" and then my boyfrienda goes \"yeah we should but are you serious?\". I laughed and said \"lol no but we should get a lobster anyway\". So we ordered one lobster, chicken fried rice and thai style beef.  The lobster came in a big dish and looked great. We thought that we probably should have orderes juat the lobster and nothing else. The preparation was similar to fried calamari and though it tasted great at first, it gets very monotonous towards the end. Not to mention, you feel bloated like crazy because of the high sodium content.   When our bill came, we realized that they actually gave us TWO lobsters even tho we orderes one and charged us $38 for it. In total we ended up paying $77 for a rather ordinary meal. Never coming back."}
{"text":"Yum yum yum, this place was delicious! It's not the most glamorous (table cloths are white, thin, cheap plastic) but the service is good & the food was great. We were especially impressed by our waiters honesty when our group of 15 had duplicate orders. He told us the portions were large and no two people should order the same thing, as it would be plenty to share. And boy, was he right! Portions are huge! We had chicken fried rice, pork fried rice, egg rolls, spring rolls, shrimp lo mein, boneless spare ribs, wonton soup, beef/chicken/shrimp satay, general tsos chicken & chicken & broccoli. I tried a bit of every dish - fantastic! And the price is right!"}
{"text":"Based solely on their customer service, the server/host was rude. I tried to make a reservation in person and as I was talking to the man, he just walked away and went about cleaning up"}
{"text":"Very great food cheap. Open late. Got lost looking for another restaurant ended up here. Pleasantly surprised."}
{"text":"place was recommended and im glad i listened. reservations is highly suggested even thou i didn't make one but we got there in time that something was available and people after us had to wait. we got general tso chicken,dumplings (peanut butter sauce),fried shrimp chinese style,garlic sauced chicken wings and rice fried and we was happy campers."}
{"text":"Excellente bouffe, portions très copieuses (tout le monde repart avec un doggy bag!), prix très abordables et service excellent, poli et rapide! Le menu est très varié, une dizaine de pages avec des choix de plats incroyables! Il y en a vraiment pour tous les goûts et tous les appétits... A essayer sans plus tarder.. :)"}
{"text":"I believe most of the food could be very good here however we were 1 for 1. Shrimp fried rice nothing special; General Tao's great but didn't come with rice nor were we asked if we wanted any...which brings me to my biggest issue: customer service was non-existent. Barely a word was spoken, had to ask for waters!, and rice...sort of strange. Also, ambiance could really use some help. Get rid of those garbage bag table cloths...:/"}
{"text":"Service is one of the worst of all Chinese restaurants just terrible, slow slow slow. Very rude waiters. Go to Kam Shing so much better. The one on Van Horne is great, the staff is so friendly and the food is really good."}
{"text":"Je vais aller droit au but; la nourriture est bonne. Par contre, le service est quelque chose. Deux monsieurs d'un certain âge vous servent avec un des airs des plus désintéressés. Je crois que c'est un running gag des habitués. La déco est aussi vieillotte. Moi j'opte toujours pour le chow me in cantonais qui est selon moi un des meilleurs de Montréal. Les prix sont bons aussi.  Bref, on y retourne juste pour les saveurs et le prix."}
{"text":"Authentic Chinese food.  Very good prices. Very tasty food. Great quality food. Amazing ambiance.  What more can you ask for"}
{"text":"Good Chinese dinner at affordable prices although the space quality is below average.  I ordered #3 and #29, both were delicious. There are numerous selections on the menu. They even serve a free oranges at the end of the dinner. Liked this place."}
{"text":"Came here on two occasions 'cause their general tao chicken is godly (yeah I know it's not even real Chinese food, but hey it's good). I've also tried their chow fun noodles with beef, hot and sour soup, and chow mein noodles with chicken and pork. They were all very tasty with heaping portions! All their dishes you can split between two (with a side of rice) and be completely content. Their hot and sour soup was especially filling and more flavourful than ones I've tried at other places.   I'd like to come here with like 8 people and order 10 different dishes *_*. Time to make more friends..  Now, for their service, it's a mixed bag. They seem pretty structured in a sense they have an order of things to do for each customer (give them tea pot and cups, take order, put down serving plates and utensils, bring out food, take away dishes, give oranges and fortune cookies for dessert if dinner, else just fortune cookies). Besides that, it's hard to get their attention for other things you need, like more napkins, tea, etc. It's best if you walk up to them and ask. They won't come around asking if everything is okay or not so don't expect that kind of service. But honestly, I'd still come back for the generous amount of delicious food!"}
{"text":"What a nightmare , Mother's Day got there early for take out .. the owner said 40 minutes was all it would take , no big deal , ordered n took a walk in Chinatown ... came back 40 mins later no food n owner says you only came back 20 mins , I looked at my watch n since I added extra time on my parking meter I was sure it was 40 mins.. wait another 30 mins by the door.. she tells me to go to the waiter station n ask the waiter.. so I did as I was asked , waited 15 more mins n waiter as me to pay , getting closer right.... Wrong .....they forgot my order after waiting 1 hour and 45 mins I ask for my money back and went to shwartz , what a joke , the owner offered my a free meal next time , yeah right . There will be no next time n she will never give a free meal , would have laughed if I weren't so pissed"}
{"text":"My boyfriend and I arrived in Montreal for the first time and found this hidden gem on Yelp while looking for a local place to grab a quick and affordable meal before hitting the bars. When arriving, I doubted the food could be as good as described - the place looked relatively empty and lacked decor. I trusted other reviews and we grabbed a table anyway. We were seated at a table covered with what was essentially a white trash bag, then told to write down our own order - I became more skeptical, but the meal quickly proved me wrong.  We ordered the meat spring rolls, and got the best we've ever had. The outside was crunchy, while the inside was the perfect combination of meat and other good things. For our meal, we split the General Tso's Chicken (after admiring it on another guest's table) and Pork Chow Mein. We were given two huge plates of each order, again some of the best Chinese food we've ever had in the US. We ate until we couldn't fit anymore, and had enough leftovers for a meal the next day.  The restaurant also has extremely cheap drinks, which my boyfriend and I took full advantage of. This is a good place to get a nice buzz on while enjoying dinner. Our server was friendly and got our order correct. I have never had better Chinese food for the price, and would definitely go back if returning to Montreal. The only reason I can't give 5 stars is because of the ambiance - with a little decor and a more refined crowd (the man at the table next to us would not stop burping), this place would have it all."}
{"text":"We started out with a short wait and had a chance to observe others eating interesting looking meals.  After we were seated, our waiter made great recommendations and the service and food were top notch.  Simply the best meal in Montreal."}
{"text":"Ok so I will update my review on the next time I will get there.   This only time I visited this place is because I was craving for dumplings. Unfortunately for me it was past 11pm when that happened. I lookup for a restaurant that serves dumplings and found this one. Although on that night they only serve the peanut butter dumplings which it wasn't exactly that I was craving for. I still ordered that to takeout since my tummy was calling for food.   At home I was a bit disappointed on the amount the gave - I had a small box and expected the box to be filled completely but it was about half-full. From my experience chinese food has mostly been generous on the portion but this time... meh.   Do I have to mention that I was still hungry after devouring the dumplings? At least they were good..."}
{"text":"Another late night restaurant for us. We did a quick takeout order of beef chow fun to eat in our hotel. It was just perfect. Great Cantonese flavor with a complete menu. I was so happy it was open when my stomach started to growl at midnight. I can't say much for anything else since we didn't dine in, but the food was great!"}
{"text":"This is the best chinese restaurant in Montreal. If you're a local, you know this. I usually go after the clubs close. It's famous for that. So tbh I don't really remember much about the food but I know it was good and it's crowed at 3am. So go.   Update:  On a recent couple (and more sober) of visits I had the lobster special (2 lobsters for $32) made with ginger and chili. It's so delicious!!! You gotta have that!"}
{"text":"Cheap and great food!"}
{"text":"Mon amour pour le VIP est quasi inconditionnel. J'y suis allée pour la première fois il y a 6 ans et il est resté mon restaurant préféré de Chinatown. Tout ça à cause d'une histoire de chow mein au buf que je ne peux pas oublier. Il est PARFAIT! Crunchy noodles pour tous!   Le restaurant n'a rien de VIP mis à part son excellente nourriture, mais les serveurs sont doux et ils sentent bon. L'idéal est d'y aller en groupe (5-6) et d'y commander plusieurs plats, tout le monde s'en sort en bas de 20$ même avec l'estomac bien rempli (lire ici \"pas besoin de manger d'ici la semaine prochaine\").   Vaut mieux réserver, c'est souvent rempli... Mais ça ferme tard, alors on peut s'empiffrer pendant des heures! Yahoo!"}
{"text":"Came back and the food was EVEN BETTER!!! Everything comes out so quickly and is served piping hot- be careful with the egg rolls and shrimp ( I burnt my tongue). Service was great as always"}
{"text":"Barely passable chinese food. The prices are cheap fot lunch and portions are generous. Supper better go elsewhere, and there are a lot of good alternatives."}
{"text":"Probably the most well known Chinese restaurant in Montreal, patrons consistently rave about the place.  Open late late, this is often where famished clubbers head when the bars start to close down.  The food is cheap and the service is swift, but it's not fine dining, the tablecloths are disposable after all.  Think of classic Chinese food from the 80s, assorted vegetables drowning in a lumpy MSG laden sauce. At 3am after a night of heavy drinking it's the perfect meal, but on a day-to-day basis I find their style of food a bit heavy.  Le Maison VIP is really great for what they are. If you are in the mood for old-school Western style Chinese food, or the party is dying down late one night and the munchies are taking hold there isn't a better place to be."}
{"text":"Been eating there for over 20 years. Never had a bad meal.  Salt and pepper shrimp my favorite dish"}
{"text":"I went to Yelp to decide which Chinese restaurant to visit and hands down this was the place everyone recommended! I think it would have been a better experience if I just stuck to my favorites but I wanted to try one of their specialties. I didn't go for the lobster which i regret. I was in the mood for fried seafood so that's what I ordered. I received stir FRY... It was not listed as stir fry and when the food came the server was apathetic about they way the food was described on the menu. Again, being one of the highest reviewed Chinese restaurants on Yelp the servers weren't overly friendly but they don't have to be. The food was ok but I do blame that on the selection..."}
{"text":"Tout simplement délicieux , le poulet général tao  et string-bean sauté  avec du porc haché est un vrai délice avec la soupe wong tong  excellente"}
{"text":"Entrees under $10, drinks for $5, and a menu that is as large as China itself. And the service was great too. What's not to like? And definitely the best hot and sour soup I've ever had, served in a large china bowl and filled with vegetables and tofu.  Excellent choice in Chinatown."}
{"text":"Le restaurant est sale, mal éclairé et le service est très mauvais.  Encore là, ça va, c'est le quartier chinois après tout...  La bouffe était tout simplement mauvaise, sans drame. Les egg-rolls encore gelés au centre, la soupe sentait la sueur et les nouilles Won-Ton avaient une texture s'apparentant aux souliers chez Spring.  En fait, thème récurant; les ustensiles sentaient mauvais, eux aussi.  Le riz frit au poulet fait la job. Le reste; boff.  Allez au Bejing, quelques pas plus loin, pour un expérience pas mal plus intéressante.  Seule raison du 2 étoiles: Les prix sont très bas donc au moins, malgré la déception, mon compte de banque ne pleure pas."}
{"text":"Avoid at all costs - not proper Chinese food.   Terrible food, service and experience. I had dinner with 5 friends and we all agreed we would never go again.   The food is not tasty and I highly doubt it was prepared on the spot. I regret having wasted time and money at La Maison VIP."}
{"text":"Super busy so service was slightly compromised. Good flavor with everything. Definitely a well oiled machine of a business. Kinda fun to watch the fray. Reasonably priced as well."}
{"text":"Je suis lavalloise et il est difficile de trouver un bon restaurant chinois (difficile, non, il n'y a aucun bon restaurant chinois). Je suis venue à ce restaurant il y a plus de 15 ans et il m'est toujours resté en tête. En conférence à Montréal pour quelques jours, nous avons décidé d'y faire un tour. Il n'y a rien de chic dans ce restaurant et le service est inexistant, on y va seulement pour la bouffe. L'idéal est de se commander plusieurs plats différents, mais pas trop car les portions sont gigantesques, et de les partager. Les plats arrivent rapidement et sont très goûteux. Mon favori, les nouilles croustillantes. En groupe on s'en sort avec une facture autour de 15$ et plus que rassasié."}
{"text":"I'm usually picky about Chinese food but I'm happy enough with how the food tastes here to come back again. A simple comfort dish is beef and Chinese broccoli.  There's always General Tao chicken that is a sure bet and fried rice, you can't go wrong.  We didn't know the Ma Po Tofu has beef in it so it was not suitable for vegetarians.  However, the waitress was really accommodating and allowed us to custom order a veggie stir fry dish so we concocted an order on the spot and it turned out yummy. Service isn't great but really, who goes to Chinese restos for service?  Asians go for the good food at very decent prices :d"}
{"text":"Pretty solid Chinatown food with specials such as 2 lobsters for $30 and protein (beef/chicken/pork) in XO sauce.  The prices are about $12-17, so pretty reasonable, and the portions are generous.  We had the VIP sizzling platter with chicken, beef, and pork, which was served on a sizzling iron plate and very savory, and the crab meat with 2 kinds of mushrooms.  They are also more than happy to add vegetables to any dish.  The crab meat dish was a nice vegetable side as it is similar to a lobster sauce poured over fresh veggies. It came to about $39 pre-tip for the 2 entrees and a small coup, which is slightly pricey for Chinatown but on par with Montreal."}
{"text":"This restaurant has consistently good food at very reasonable prices. I wouldn't bring a date here but I would definitely come here for lunch or dinner with friends. Also this restaurant is open late so a great place to sober up after drinks."}
{"text":"Went to vip last night to pick up Chinese food for my Jewish Christmas. Yes, it's a thing  I've gone and picked up from vip before, and mostly it's just ok, but since I live just up the street, it's convenient. Unfortunately after last night's experience, I will make the treck to kam shing from now on instead. We ordered a few dishes, one of which being their ginger lomein with vegetables added to it. Normally the noodles come without vegetables, but I figured it might be a good idea to add a few healthy ingredients to our otherwise glutonous feast. When I went to pick it up, the dish they gave me was vegetable chow mein. I've had their chow mein before and I'm not a fan. The noodles are really mushy and it's all around pretty bland. So I asked them to change it to the ginger lomein, the item I ordered as was also listed on the bill I paid for, but they flat out refused and said that is how they make noodles with vegetables. I left the noodles there, didn't get a refund and walked out with the knowledge that I will never go back there again. Thanks for ruining Jewish Christmas vip!"}
{"text":"This was a fun place. Not too large of a dining room, but they staff moved well and it didn't feel cramped, although it was very lively. The food was great, what you would expect from well-prepared western style Chinese food."}
{"text":"It is true! The ginger lobster is amazing! Many thanks to the couple who recommended it while we were waiting to be seated. Get the special if you are hungry. Beware they won't give you tools. Although the poor red creature is already separated you would still need to use your fork and hands as the only way to extract delectable meat.   We ordered the fried rice too, not bad, but I wouldn't return for it. The fried vegetables were dominated by broccoli and were very well prepared. The remains of these extra orders were taken home and became a wonderful lunch the next day.    The service can be summarized with two words: experience and efficiency, and it actually became friendly when we were leaving. I think the hosts sensed they just won two new regular customers."}
{"text":"VIP is my favorite Chinese restaurant in Montreal.   If you're complaining about the service you don't get it. The surly wait staff is half the fun. I have been coming here for over 30 years, and this was my parent's goto Chinatown restaurant.  What makes VIP the best:  -Crazy cheap weekday lunch specials. -Open until all hours of the night. -Cantonese Lobster is always in season and a decent deal -Amazing Soft Shelled Crab -General Tao chicken that is sweet, sour, a little spicey, crunchy and HUGE. -The best Cantonese Chowmein I have ever had in my life. Don't ask me what's in it. -Huge tables for family style eating.  If you want a non-pretentious delicious Chinese restaurant to visit for 2-12 people you can't do better than this gem.   Parking is a nightmare, and on a busy night make sure you get a reservation.   Go with a sense of humor and an appetite and your taste buds and wallet will thank you."}
{"text":"Stayed nearby Chinatown and La Maison was our 1st meal in Montreal. Since there were only 2 of us, we got the fried shrimp that came with stir fried spicy peppers. The shrimp were large, plump, and delicious. However the spice wasn't very spicy however that might just be a Canadian thing. None of our meals were spicy no matter how much we asked for it at multiple restaurants. I asked for hot chili oil but they seemed to have no idea what I was talking about. I'm not quite sure how ANY Chinese restaurant wouldn't have that as a common staple on the table. Ah well. They brought out some strange srirachia mixture that seemed to mixed with ketchup or something to make it less spicy. Also got the Taiwanese fried noodles (basically the U.S.'s pan fried noodle) which was also really solid. The beef wasn't overcooked which was a major plus.   Service was friendly and they were really good about refilling our waters.   I refused to get the General Tso's because it was too \"common\" but I soon regretted it when I saw it everyone's table. Need to get over myself and just get what everyone is recommending!"}
{"text":"This is a good place to go with few friends to get something quick and tasty if you're on a tight schedule for lunch. You should not have high expectations about the service, you're in Chinatown, you don't come here for the service but the food. Their stir fries are great and Chinese broccoli is an excellent choice too. Yeah, the food makes up for everything else."}
{"text":"Such delicious consistent Chinese food, the servers have been the same for decades and they offer key with the meal and almond & fortune cookies and orange slices for dessert. My favorite dishes are the chow mein, general tao, lobster, Chinese broccoli, salt & peper shrimp. Ask them their specialties!"}
{"text":"Another classic! My parents are restaurateurs. When my sister and i were kids, this is the place that my folks would take is and their employees after our restaurant would close for the night. Everything is good. Sweet, salty, oily...oh the umami explosions of flavours in your mouth!!! As an adult i would go once in awhile to eat here. I especially love their salt and pepper pork and their ginger and scallion lobster.   The downside of this place is the service. They NEVER smile. Sometimes rude and if you dare ask for extra napkins, it would usually be thrown onto your table with a little grunt. I don't think it's anything against a specific patron. So perhaps two stars top for the service but four for the food!"}
{"text":"Some of the best Chinese food I have ever had and open late! Always call for pickup... the salt & pepper tofu and general tao  are amazing!"}
