{"text":"My boyfriend and I have been here several times and it never disappoints! I love everything this little Bradford Gem has to offer! The ambiance, although not high end is cozy and totally inviting. The food is authentic and filling. I love the flautas - they're great. A fun place to go as a family, with friends or on a date.   Thanks for the great time and always amazing food!"}
{"text":"The food by itself is 2.5 stars. Unfortunately, the total rating drops to only 1 star when you factor in the price, the service, and the condition of the restaurant itself. One Sunday in November we drove all the way to Bradford to check it out, based entirely on positive reviews here at Yelp. I was very disappointed to realize that the reviewers must be local to this area, and therefore extremely biased, or else there is not much around Bradford by way of competition.    The main negative issues first: The waiter started by taking the order incorrectly, bringing the wrong drinks to the table (we ordered one Mexican soda and 3 Jumex juices, he decided to bring 4 Mexican sodas). It was his mistake and he did not apologize or offer to replace the soda that nobody ordered with the right drink, since he had already opened the soda. He just added the drinks to the bill. It is not a big deal ($2.75 x 3), but is shows lack of interest and care.   The restaurant is not clean, and it is not new. I don't know when it opened, but it has been several years since this place got its most recent coat of paint. There are a number of orange electrical cords all over the place, powering fans and AC units (The place seems to have no central AC). The white pedestal fan near the door is filthy, especially on its base. A yellowish Corona pinata hanging from the ceiling is similarly powdered with grey dust. The washrooms' doors are supposed to be white, but look gray with black stains around the doorknobs. Paper towels and toilet paper litter the floor. Sink and surrounding areas have not been cleaned in many days. Simply disgusting. I would not permit my children to use it.   Same for the tablecloth at our table: dirty with crumbs and human hairs from previous patrons. No really, I only wish I were exaggerating: there was hair stuck to the multicolor tablecloth that they use at each table. Frankly, I shudder to imagine the hygiene standards in the kitchen.  To keep it short, the condition of the restaurant is disgusting, much more so when compared to Mexican restaurants in Toronto, like El Catrin at The Distillery. Even relatively nearby, Made in Mexico Restaurant in Newmarket makes a better impression.  Mexicanada's food is mostly limited to taco dishes, such as burritos, flautas, and taco-like burritos (almost the same filling in everything, so if you have one, you've had them all). Tortilla chips are not homemade, and taste like they come from No Frills. Churros are heavy and the dough inside is raw. When the restaurant chains can make an equivalent or better burrito than Mexicanada, then it is time to get out of the box and start pushing other Mexican dishes. If you don't believe me, you can buy a Mexicanada burrito and put it to the test next to a Fat Bastard Burrito, one from Burrito Boyz, and one from Chino Locos and you'll see than the locals are making a good a burrito as the Mexicans.  I recognize that this review must be disappointing to Mexicanada's local fans. We wanted to like this place. Really, we did. Unfortunately, whatever magic this restaurant may have had is long gone. Only the grime remains."}
{"text":"Stopped in for a quick lunch and it was excellent as usual,  despite some reviews saying otherwise.  I had the Chipotle chicken quesadilla and it was awesome!   So happy to still have a quality Mexican did destination!"}
{"text":"Without question the food is great second only to the amazing atmosphere  live band and people really enjoying themselves.   But big but  don't be in a hurry these guys are a victim of their own success.   Service is not great but keep drinking they will get to you.   Overall worth the drive to Bradford Ontario."}
{"text":"I dropped in here on our way home from cottage country - and what a great spot! I was transported to Mexico (have been many times). The food was delicious, service friendly and attentive and the drinks great! Ordered the tortillas and it cam with the creamiest guacamole - our server also brought us an awesome spicy habanero salsa to go with our meal. We then had the combo platter for 2 which included 2 each of the following: burrito, soft taco, quesadilla and tostada. The food was nothing fancy but the flavours, wow, were great. Smoky meats, spicy sauces and fresh ingredients came together in an authentic Mexican meal. Tablecloths were traditional, colourful table toppers and the live music was a nice touch. I wouldn't hesitate to recommend La MexiCanada! Excellente!"}
{"text":"An incredible hole-in-the-wall in downtown Bradford. This place has everything: great Mexican ambiance, friendly staff, and great food."}
{"text":"This is a great place! Authentic and wholesome Mexican food. Went here for lunch and it was fantastic. Got the Combo platter for One and the Mexicanada salad. All reasonably priced as well! Their churros are amazingggg...their served with warm dulce de lede..perfect! The owner is so nice and down to earth. It's a great place to go...highly recommend it!"}
{"text":"We live 100 km away. Having visited this place 3+ years ago and met with the owner, we had great memories of the amazing service, food and the live band. Waited for the opportunity to be back, had it bookmarked in the yelp. Finally in the area, drove 20 km off the route to visit the place and were left extremely disappointed with the service and food. Nothing in comparison to the first experience. A very rude waiter, impatient, threw plates on the table, showed irritation as if it was our fault they were busy and short of staff. On to the food... Sadly have to admit the quality of food has deteriorated immensely. We ordered 5 soft tacos, none came with salsa and guac contrary to the menu. 2 soft medium hot beef burritos came with very little lettuce and no refried beans or salsa, just very bland boiled ground meat with some rice wrapped into tortilla. Luckily we had ordered a side of medium salsa for our chips and guac earlier in the evening. How busy do you have to be to miss basic ingredients or is it an intentional scam?! They blamed their lack of service on being busy. Not a good enough excuse for me. I regret wasting my time. This left an especially sour taste precisely because we were so looking forward to going back to this place. Never again."}
{"text":"I came all the way from NYC to visit my family in Bradford. So we decided to try this new La Mexicanada Restaurant, OMG, our first time and last time. We we excited at first. The only thing we liked there was the \"Water\". The waiter, who does everything (cook, serve, clean & Bartender). He took 20-25 minutes we were served & asked us \"Are you Ok?\" like 3 times. We travel all over the world, this Mexican food was the worst EVER. Very disappointed because we were very excited, even my little nephew, who's 4 years old DID NOT like his kid food. The juices are not natural, the Guacamole is Horrible (fake). The chips are not served hot. Personally, we would not recommend this if you know your taste and good food. From 1 to 10, this place is a little 2, Definitely NOT a 4 Stars from Yelp. At the end He knew we DID NOT the food and He Didn't even ask us again. Today is 28 December 2017. That was our faces when the food  arrived"}
{"text":"Food is great. Service is pretty slow and a touch rude. Best Mexican around so we deal with the not so friendly service"}
{"text":"Incredible atmosphere, live music, very friendly staff, excellent authentic Mexican food and fantastic drinks. Had a great evening being served by Edson. Love this place!"}
{"text":"This restaurant was originally for Mexican farm workers in the old days. The date I was there the clienteles are from all over the world. The server is very good. Foods are good too. Sitting on the patio with light breeze on hot summer day is so refreshing. Prices are not too expensive."}
{"text":"Would love to give this place a 4 but their service brings it down. The food here is quite yummy however if you are ordering pickup be sure to give them tons of notice cause even after their suggested 20 min window you'll be waiting. And waiting. And waiting...the longest wait so far was 50 mins after calling and we were just standing there.   We alternate between dining here and dining in Newmarket at Made in Mexico (the food there is higher quality but a bit pricier) and we've just heard that Made in Mexico is opening up in Bradford soon!"}
{"text":"First time eating at this restaurant and will definitely  return. The meal was truly authentic Mexican cuisine, full of flavour and spice. It had a cute and quiet ambiance and the service was good. My girlfriend and I Ioved it overall and preferred it much more than the competitor in Newmarket."}
{"text":"Even with the sudden influx of Mexican restaurants in recent years, this place remains the \"great one\".  I love the small, intimate atmosphere with the live musician which really helps to set the mood for sipping Coronas and the best Mexican food you have ever had.   And if I remember correctly, the alcohol is quite cheap (yes, the irony of the fuzzy details on this fact isn't lost on me, and most likely proves it's a fact).  Tip: Ensure you make reservations for weekends in advance. We set ours up 2 weeks in advance as the weekends before that were all booked up."}
{"text":"Cool place, always packed! Ensure to make reservations as wait times can be long. Once we got there, we were seated in a table at the front door, but they quickly moved us toward the back of the restaurant as another table cleared out. Service however does not suffer although they are super busy, as all our food and drinks came in a reasonable time and staff did check in with us. They Usually have live entertainment on weekends.  Food Is great, and so are the prices.  We did the combination platters which is the best deal, especially if it's your first time here- you get to try a bit of everything.The drinks were my favourite part! Ordered the daiquiri and mexican bulldog... The mexican bulldog a bit strong but still really good.  Overall good mexican experience."}
{"text":"Great place. Ambiance feels like you are in a restaurant in Mexico. Had the tacos and burritos. Taste really good. Not a lot of condiments on the tacos which for me is authentic. Great selection of hot sauces. Yummy!"}
{"text":"I love going to this place! It feels like you're on vacation, the entire experience is truly authentic. I live in the Distillery District and I am no stranger to El Catrin, to compare the two is simply ridiculous.   The owner is always present and brings us the really hot sauces when we ask him for it. Our goal here is to sweat from the heat of the peppers! Always fun if you like spicy food!   The band is great too and they set a fun atmosphere. The combo platter never fails and you have a choice of half chicken and half beef. They make a great Michelada its best with Tecate. The staff have great personalities!"}
{"text":"Showed up around 545pm on a Friday night.  Seated right away.  Restaurant filled up quickly.  Food came pretty quick and was piping hot.  Combo platter was excellent. Beef, pork and chicken all great.   Will definitely be back as we left 100% satisfied.  $60 with tip, dinner for two with a margarita and a mohito.  Can't beat that."}
{"text":"Good food and not too expensive! They have a mariachis band on weekends which makes it a great place to stay and have a few drinks after you eat."}
{"text":"The most authentic Mexican restaurant in the area. Reservations are a MUST for weekend dinners, my only complaint is that when it is very busy (which is often) it gets PACKED, which results in a very chaotic, sweaty and loud atmosphere.. but enjoyable nonetheless! The staff are always friendly and they often have live music! Often the same band but they sure do know how to get the party started.  What I usually get when I come here: tortilla soup (amazing), nachos, chicken quesadilla and of course, flan for dessert! Their strawberry daiquiris are probably one of the best I've tried- don't hesitate to get it in the huge 'fishbowl' glass to share with friends!"}
{"text":"Showed up for our reservation on Sunday night. They said the restaurant was closed because they had sold all the food. Take your chances I guess."}
{"text":"Great  food great fun.   weekends this is the place to be to get all your predrinking done.   Great tacos ! great drinks ! great mixican atmosphere!"}
{"text":"Absolutely love this place. Best Mexican and worth the drive. The combo platter is great if it's your first time there. Make sure to get different meats to see what you like best ."}
{"text":"The place is not overly clean but I've been worst. Food was fresh but lacking flavour. Most Mexican restaurant have a small free chips n salsa but not here. Very small potion, $9 for 3 flautas without any side and $16 for a combo plate, 1 small taco, 1 taco size quesadilla, 1 small burrito and 1 small tostata without any side. Our bill with drinks comes to $35 and we were both hungry after. The up side was that the servers were super nice. IMO this place is too expensive for what they serve."}
{"text":"Stopped for a quick bite to eat. Ordered the 5 tacos - 3 chicken, 2 chorizo - really tasty! Service was fast and attentive. Will be back!"}
{"text":"I used to love going to this restaurant but over the last year, the food and the service has been sacrificed immensely. My regular business, big dinner parties are no longer at la Mexicanada, never again. The last time I was there with 7 other people, with reservation, we didn't have a table, were denied service, rudely dismissed. They finally found us a table, but the service and the food was disgusting."}
{"text":"Been there for lunch some time ago. The decor is typical Mexican and nothing to write home about. The food is typically Mexican if I was in mexico. Being in Canada anyone should find the fare outstanding and I fully recommend eating at this establishment if you can get in the door. Reservations are recommended weekends."}
{"text":"The best Mexican food ever.  Awesome food.  They have an outside patio too.  The spanish music is really nice.  Some nights you get a alive band.  The band lays really great music and  people like to dance to the music.  The food is out of this world.  It's really delicious.  I like this place so much.  I go to this place almost every day."}
{"text":"Overall I would say my visit was satisfactory.  My rating is based on the presentation of the locale, the service, and the food.  The authenticity of the restaurant was spot on.  The aesthetics of the place was quite nice, several Mexican trinkets were scattered all over the place (i.e. dresses, flags, guitars, etc). The band members playing classical Mexican music were quite talented and made the wait for the food bearable.  The service experience was not at all awful, but was lacking to some extent (Keep in mind I had made no reservation so your experience may vary).  I was immediately seated and given a pamphlet, after 5-10 mins the waiter had asked me for my order and so begun the wait. By this time it was around 7 pm, and after an hour of waiting the food had arrived.  I had ordered the chicken quesadillas, and the presentation was quite nice. They had separated the quesadillas from the toppings which were a sauce and some liquefied beans (frijoles licuados). And this is where I am unsure if I have a disagreement with their cooking, or authentic Mexican food. The chicken in the quesadillas was quite bland (no sign of condiments). The beans were quite similar. This is my personal bias(coming from a Salvadorean home), beans and chicken should be fried (all the spices just meld well) instead of baked.    I do agree that may review is quite skewed since I have not been able to compare this restaurant with other Mexican restaurants (or even cuisine), but what I can be certain of is that the meal made my experience in this restaurant less than perfect."}
{"text":"Really good, tasty authentic Mexican food. But that's not the only reason I'll be returning. It's the ambiance. Servers and staff are extra friendly and immediately make you feel like family. We happened to be there on a Saturday night and had the added good fortune to listen to a live 3 piece band. Pretty decent selection of tequilas! Make sure you end the meal with the churros!!!"}
{"text":"There ware Pros and Cons. I'd like to say that this place is 3.5 overall.  Interior was good, servers were great. Tortilla chips were disappointing because it tasted like one that you can get at Loblaws. Three quesadilla (vegetarian) that my boyfriend had was satisfactory.  I didn't have a chance to try their beans - next time."}
{"text":"Having just come back from Mexico, I was not only missing the food but also had a fresh idea in my mind with which to compare it to. La MexiCanada is definitely tasty. It is VERY close to the authentic as you can possibly get in Canada.  The decor and atmosphere, although a bit dim was actually very culturally appealing and I believe demonstrated an authentic approach to Mexican culture.   I ordered the combo platter because i wanted to taste a variety of their items. They were very tasty and the service was prompt, it wasn't however excellent- which is why I give this place a 3star rating.  I have been to one other mexican place here in Canada, and although the business closed down I must say the presentation spoke volumes!  First of all I believe their prices are much too high for the quantity of food offered.  There were no totopas served as an in-house app (like bread and butter )  Nachos(totopas) and salsa are the most common app in mexico and they are usually served free of charge. Here they will cost you $5.95!  Secondly, the entrees in my opinion should come with a salad or side soup or side of any kind.  Three churros are $6.25, which can also be bought at specialty bakeries all over  the GTA (stuffed w/ chocolate or dulce de leche) for $1.50 each.  And lastly, the famous mexican pop drink Jarritos is $2.75 at MexiCanada, but approx. $ 0.79 at No Frills. You can get 3/$1us in mexico....you do the math.  I am not going to tell you this place isn't tasty, all I'm saying is if you come with a big appetite, be ready to pay big prices."}
{"text":"We thought to try Mexican food up here and glad that we did. It was 6:40Pm on a Friday. It was not full yet, but boy it filled up fast. No wonder our server asked, first, if we had any reservation. I would make one next time, and there is a next time.   We were seated quickly, so we're other patrons pouring in after us. We sat next to the door, so we knew. We had. A view of the musicians playing great songs. For me, I missed Santa Ana, so this is the next best thing. We were served quickly, too.   The drinks: had tequila shot and margarita. Yummy. The margarita size was awesomely huge. Now, for he main dishes. We had the combo played for one, up sized the burrito, and carne asada. It is not as great as back in Santa Ana but I still like it. No worries.   We didn't have room for any more food, but I really wanted to try their churros and got it. Yummy in my tummy, too. Made me miss something: I miss my $1 Costco Churro in Tustin. Yum yum. This was $5, Canada for ya, eh?  I would come back. Our server came to check on us regularly. Hope to come back as a regular, too."}
{"text":"Great food, Slow service. Atmosphere is authentic... if you are ok with that. Tacos are pricey for what you get."}
{"text":"There are some people that are born with a gift, a magical gift that makes anything they cook taste fabulous. Such a person made my dinner at this place. Everything from the Mojito to the burrito was the best I've had. Yes the service is slow and they originally messed up the order but the food made everything better. I would sit in a pool filled with piranha for this food. We ordered the churros for desert and well worth it! \"Better then sex\" Is what my girlfriend said, so either I'm doing something wrong or they were that good.   Anyway, great Mexican and they have a patio as well. If in the area I highly recommend this place."}
{"text":"Saturday afternoon experience, also first time customer. Overall not good, the restaurant is old, appeared to be a social meeting place, the service1 was slow and the food was sub par.  We had the nacho's and two drinks, they used Tostito or Cheese Wiz from a jar, store bought chips, WORST NACHO's I've ever had.   Go to Newmarket if you're looking for a better experience."}
{"text":"After all the positive reviews we decided to try this place for lunch. Rather than have the standard taco, burrito, etc we opted for the Carne Asada and Adobado Chicken.  Both meals were excellent. The refried beans are the best I've ever tasted.  Homemade spicy mango ice cream was also a pleasant surprise. All in all well worth the visit to this small establishment in Bradford.  Next time I'll definitely try the taco, burrito, etc."}
{"text":"Of the three Mexican restaurants in the area, La MexiCanada might be the most authentic.  It looks like places I've been to in Mexico.  But, compared to Made In Mexico, the lone Burrito on the plastic plate for $13 is relatively expensive.  Still, the food is very tasty, if I remember to order several items to make it a substantial meal.    I just hate cutting a bite of burrito and getting a chunk of paper mixed in from the plastic plate liner.  Keep in mind that you get at least double the quantity of food at the same price at Made in Mexico, and on real plates.  Worth it to try for yourself, or on the days when your craving for Mexican won't accept that the other two restaurants in the area are closed."}
{"text":"I wanted so badly to like this place since our friends said they frequented here.   Unfortunately we had the worst experience. The service was beyond slow and also a mess in the sense that I asked for a few times that I never got at all even after reminding the server of it. We ordered chips, with salsa and guac which we also never received!   Now to the food. I ordered enchiladas... Which anyone who eats Mexican food knows it to be a rolled tortilla stuffed and then baked with sauce and usually cheese on top, I got no cheese for me. Well mine came more like a taco folded in half with everything just poured on top. It was soggy and apart from the sauce being tasty, flavourless. Perhaps it because I got the vegetarian option.   Maybe they were having a bad day? Perhaps understaffed that day but wow! I was totally let down :( maybe I will give it another shot when I'm up in that area next but for now a 3 star was being generous in accordance to the experience I encountered.   I wish them well and hope it was just a bad day."}
{"text":"Live music is fantastic, and not overly loud so you can continue to have a conversation without shouting- big bonus. I had the 2 chicken burritos and was a huge fan- not a big fan of the refried beans. The place itself gives off a great vibe and it's such a nice atmosphere, will definitely return."}
{"text":"So there have been some changes at this venue. Most of it I won't get into, because I am not a politics kind of guy. I like to focus on the experience, and go with that.  I rarely write negative reviews. My belief is that I simply may have been  there on someones bad day. I have them, you have them, we all have them. Reviews on the internet can make such a large impact to a small business, I am always reluctant to go in that direction, and risk doing so in error.   This time is different however. I have been here twice recently. The food quality has changed for the worse, there has been drastic change in atmosphere, and a general decline in service. I can't leave my 5 star rating in place, as it is simply misleading now, based on the experiences I used to have at La MexiCanada.  The food has lost any of it's former vibrance. I have to use colour here because its the clearest way to describe the change. Its gone from looking at a beautiful colour image of a Mexican beach, with blue sky's and a deep dark gulf sea, to a black and white picture of a run down cantina. It's utterly like night and day. Across the board too. It's not like they changed one dish (I had tostadas and burrito) and missed the mark on one. All the plates I dug into here have simply gone the way of mediocrity.  The first night I went there they had \"paint night\". Not sure what painting has to do with Mexican food but there you are. I think the owners tried to take a different direction and might have gotten bit lost.  My old friend Noe was nowhere to be found. I figured out later he had left. Probably due to an argument over \"paint night\".  Service was adequate but staff were less amenable than on my previous visits. This might just be my perception, as I had such a great relationship with all the old staff, these new folks seem a little strange to me.  Overall its not the place I fell in love with.  It's not the same.  And I am not interested in what it has become."}
{"text":"We arrived at this place at around 7:00 pm with two small kids. Ordered nachos with salsa and guacamole, soup and a taco dish. It was around  8:00 already and we still didn't get any food. So we asked what's up. We were told there were 2 more orders before us. Then another 10-15 minutes passed and we asked again. After that we got complementary nachos with cheese. Then when the soup and tacos came we asked what about our nachos with salsa and guacamole. They told us that thru didn't no nachos with salsa. After that they brought us nachos with but no salsa but we didn't bother asking them for that again. We asked for water that we did not get either.  Desert took a very very long time to arrive,  which we also had to remind them to bring. Honestly that compensates for the whole dinner because it was very very delicious. And we also got it on the house. Over all the service was very very slow we but we did  get a compensation for it, but definitely will not come back there especially not with kids."}
{"text":"Very friendly staff and very delectable food.  This is the first time I eat the Mexico food.  Even I don't know about the name of the dish, but it's tasty."}
{"text":"I've been here a couple of times and always enjoyed myself.  The staff are pleasant, restaurant clean, and the food is excellent.  It doesn't look like much from the outside but don't let that fool you.  Make sure you have a reservation for Friday and Saturday night!  I'll be back.."}
{"text":"Very disappointed tonight. When we lived in Innisfil this was one of our favourites. We hadn't been in a few years as we moved to Mississauga. Decided to make the drive and wish we hadn't. Service was abysmal, very loud and waited a long time for our food. When it did arrive mine was cold so I sent it back. Waited about 15 minutes and it came to the table no hotter than it was before. By that time I was so hungry I ate it anyway. As we were leaving we were asked if everything was okay and said no. My entree was taken off the bill which was the best thing of the night."}
{"text":"Some great Mexican food in a chance rest-stop find. Excellent."}
{"text":"Excellent and authentic Mexican food and worth the drive to this exurban community.  (Good place to stop after a visit to the Cookstown Outlet Mall.)  Tacos and enchiladas were delicious.  Would like to see a little more ambitious menu beyond antojitos as they cook so well.  Very friendly service. Delicious margaritas.  Pleasant patio. Recommended."}
{"text":"My sister had been raving about this particular restaurant for ages.  I would respond, \"So far???\"  Her friend brought her here a while back as they live in the area.  She has been a taking the trip North since then as a loyal customer.  On a random Sunday afternoon during the Civic Holiday long weekend, we went with our spouses up to Bradford.  There was no traffic so it took about 35 to 40 minutes to get there from 404/Don Mills and Steeles.  When we got there, my brother-in-law parked the car right across the restaurant.  We walked across the street and the cars were racing so we had to squeeze through.  Arrived the restaurant to much Mexican decor.  Nice atmosphere and Mexican memorabilia.  It was a lovely sunny day so the weather matched the mood of the restaurant.  My sister called ahead for reservations just to be safe.  It was not busy.  She recommended I try the pork tostadas.  It was her favourite dish that she always gets!  We ordered a plate of Nachos and Pork Adobado to start.  Pretty nifty.  The adobado totally tasted like Filipino Pork Adobo which was delightful to taste.  Almost tasted like mom's.  Ha!  The nachos were fine, but boringly normal.    I eventually decided to get the platter for one which would come with:  1 pork tostada 1 pork taco 1 pork quesadilla 1 beef burrito  You can switch between pork or beef, your choice.  What can I say, the food was excellent.  It was dang oily but it was not that salty for a change.  All simple ingredients but they all go together well.  By far, the pork tostada was my favourite part of the platter, just like my sister.  The shell was hella crispy, deep fried, the shredded pork was soft and juicy and the sour cream topped it all with creamy goodness.  The guacamole added to the toppings.  It's kinda like an open-faced cruncy taco.  The burrito was pretty decent and I only got to half of the quesadilla which was great. Took the taco in a doggy bag.   Stuffed as hell, for dessert we got the churros.  Amazing!  Crunchy, crispy, sugared but not too sweet with the caramel sauce.  Stellar!  All in all, it was a great experience.  I thanked my sister and bro-in-law for taking us there.  It is true that I do have my sister's great taste in food.  I most definitely would return for the great tasting food and bring some family and friends who wouldn't mind the trek.  Deliciosa.  Good thing I didn't drive home.  Totally woulda had a siesta behind the wheel!  ¡Olé!"}
{"text":"Authentic Mexican. Great atmosphere and even more amazing food. Me friend and I had the sampler platter for two. They made half spicy and half mild. It was delicious.  I will definitely be going back next time I head north :)  Happy to know there are some really authentic places to eat north of Toronto."}
{"text":"Without question the food is great second only to the amazing atmosphere  live band and people really enjoying themselves.   But big but  don't be in a hurry these guys are a victim of their own success.   Service is not great but keep drinking they will get to you.   Overall worth the drive to Bradford Ontario."}
{"text":"Best Mexican food, by far. The lunch flautas and the burrito grande are delicious, as are the churros for desert. Worth the drive, but must reserve for weekend dinners. Live music on very busy Saturday night!"}
{"text":"Being from the States, I'm used to Mexican Restaurants on every corner. When I moved to Toronto, I was shocked to find there were very few. The few that I did find were never authentic or owned by people who understood the culture and food.   Then we moved to Bradford. We saw the sign for La Mexicanada and thought, \"What the hell, let's give this place a try.\" THANK FREAKING GOD!   It's real Mexican food with FLAVOR and things one might actually eat in, you know, MEXICO! Every thing is fresh and well seasoned, and even the mild (i'm a wimp) is bursting with flavor.   There is amazing drink menu that is only a LITTLE on the pricey side, and we can't wait to try some tequilas on our next trip.   The staff was friendly and helpful, and we felt right at home.   The only criticism I have is the price. It's not all that expensive, but the portions are not large, and i must say, I'm a little spoiled about Mexican food portions from my upbringing in the U.S. :) Other than that, it's a real gem.   YOU MUSH GET THE CHURROS! They will make you want you stuff your face in public. :)"}
{"text":"Friends of ours (who live in Aurora) have been raving about this place for a good year....trying to get us to drive to their area to try this restaurant. While we love Mexican food, we were a tad hesitant ...well...because....it's in Bradford. What could they possibly know about Mexican food? As it gets very busy, our friends stated we had to make reservations. I thought this was probably because people in Bradford are starved for anything that's not from a McDonalds or Timmies...and that they'd be all over anything out of the norm....but after dining here, its obviously because the food is fantastic.  When we arrived, we were asked if we wanted to be seated on the patio or inside. Well...the patio overlooked an unpaved parking lot (not the most spectacular views), which meant that cars entering the lot kicked up a lot of dust, so we opted to sit inside. Our friends commented that they've installed an air-conditioner...which did keep the inside dining room very cool. The décor is cheesy Mexican fare......although I didn't see a piñata.  We started with a plate of nacho chips and guacamole. Not a fan of guac...I will admit it was very good and had a nice bite to it. Not sure if the chips are store bought, but they seemed to be.  Our friends recommended we have a drink which was basically a margarita (in what appeared to be a small fishbowl) that had an overturned small bottle of Corona in it. Not being that adventurous, I ordered a Diet Coke. I did taste the drink when it arrived and it was very good.....something I'll order on my next visit.  Our server was by a little while later and we placed our order. Both couples (there were the 4 of us) decided on 2 dinner platters (each feeds two people...2 burritos, two small quesadillas, 2 Mexican pizzas and another item whose name slips my mind). Our server asked what spice level we wanted so we asked how spicy their spicy was...and he said he found it to be a bit hot, but not burning...so we all ordered the spicy. When it arrived, the food runner stated that one platter was mild and the other spicy. We told them it wasn't our order, as we both ordered spicy. Well, our server came over and said he ordered 1 spicy and 1 mild, as he thought we might find the spicy too hot. Um...shouldn't we get what we ordered? As we were clearly displeased that our order was modified without out consultation, he brought over some spicy sauce, which was very spicy but excellent. We all used it on our meals...as even their \"spicy\" platter wasn't that spicy.  Food was very good...perhaps some of the best Mexican I've had outside of Mexico. Every item on our plates were devoured......and it was a ton of food. Rich in flavour ...I will admit I was hooked. Our friends explained to us that the restaurant originally opened to provide authentic cuisine to the migrant workers from Mexico, who work in the agricultural areas that surround Bradford. Whatever the reason...this place is a true gem.  Anyways, while eating our meals, a friend (who finished his Coke), was asked if he wanted another. As we were mid-meal, he stated yes. Well, his meal was finished and we were seated talking for about 10 minutes before his replacement pop was brought out...a good 20 minutes after being ordered. Our server did apologize and did take it back when we explained that it was no longer wanted.  A Mexican band (not the type you get in Mexico...you know the ones dressed in loud costumes and playing loud trumpets and guitars) provides a nice background noise....just a singer with a guitar accompaniment.  While we were waiting for our bill, a food runner was going table to table, asking each table if they had ordered it the food he was carrying....so service needs to be improved a bit. I think the food belonged to a table that moved out to the patio....but the runner obviously didn't know that...he circled the store for a good 5 minutes trying to find which table ordered the food before moving out to the patio.   So...the million dollar question...would we go back.....? For us...its a good 40 minute drive from where we live. If closer, this place would definitely become a regular haunt.....food is excellent and the atmosphere is fun and casual (and very loud). Despite the travel time to get here....I will go back......just wish there was a closer one to where I live.  Mexican in Bradford...who would have thought?"}
{"text":"First visit was very good.  Fresh ingredients.  I'm from the US so I have access to a significantly larger selection of Mexican restaurants, but this was good.  Nice clean atmosphere.  I wish I could have stayed for the live music.  Will definitely go again"}
{"text":"Authentic mexican food ! We travel 30 min each time for this authentic traditional food  Owner has changed , but has stuck to the traditional menu and traditional mexican menu  The atmosphere and restaurant is relaxed, nothing fancy , perhaps looking a bit on the lower end but the food makes up for it all !  Nachos are served freshly made , crispy and flavourful  Burritos and taco shells and house made  The food is very heavy and leaves you in a state of overindulgence - but thats traditional mexican cuisine for you!  Delicious, flavourful, fatty , and juicy  - not recommended for anyone on a diet ;)"}
{"text":"Love this place.... authentic Mexican food... exceptional ambiance... staff are great... I sincerely love everything about this place"}
