{"text":"I have been going to the pupusa loca for years, and have tried just about all of the different pupusa resturant  in the valley. This place is Authentic and although the ambiance and the area isn't five stars their food makes up for it! Everytime I go I have to order pupusa con loroco (a flower)  frijol, fried yucca, a drink can Chan and some fied fishies (I can't remember what they are called)....I forgot the fried plantains :-) Yuuuuuuuuuuummmmy!! I am not Salvadorian but my friends who are love going to this place."}
{"text":"Thank you for ruining my dinner.........gracias por arruinar mi cena... no ce si la persona que toma la orden por telefono sabe escuchar..pero no es la primera vez que me dan una orden equivocada.....las pupusas ni paresen pupusas, parese que con los pies las hicieron, mas masa que otra cosa......por gusto el nombre"}
{"text":"LOVE THIS PLACE!!! Yes it's in the hood, yes the waitress doesn't give a crap about you, yes it's hella hot in there and yes it's full of \"beanerish\" drunk men just giving you the creeps BUT THE PAPUSA'S ARE THE BOMB!!! That is the only thing I have ever ordered there and will continue to go there!!"}
{"text":"great place to eat just don't get the rice"}
{"text":"The food is great! No doubt. So why the 2 stars? Part of the restaurant experience is the customer service. The waitress messed up our order, the food took a long time to come out and came out piecemeal. At the end there were $8 tacked onto the bill and when I asked about it I was told that the waters were $2 each. Not bottled waters, not even iced water with lemon; just plain filtered water from the fountain. No ice, just water, they had the gall to charge $2 a glass.  I will never.. NEVER darken this establishment's doorway again."}
{"text":"The customer service was just amazing. From the moment we walked in everyone was so friendly. They took our drink orders right away and got them out right away. Once we order our main course, it wasn't long before they brought out our fresh delicious food. The place was clean and very big for a bigger party. I definitely recommend it to anyone"}
{"text":"I would have gave it a one star but I gave it a two for the simple fact that the food was good.. but the customer service was crap! It was my first time there and I have heard good things about their food, so I decided to invite my family. We get there and no one says anything... no hello or welcome. No one told us to sit down, but once we sat down the waitress comes over and doesn't say a word again. Just hands us the menu and asks us what we want to drink immediately, I haven't even got the chance to read what's to drink. I asked her for a Kolashampan and she didn't even know what drink that was, I had to point out to her what drink it was and what it looks like. Then she comes back and we order 6 revueltas... and she was already confused as to why one person wants 6 pupusas, when it was just 6 in total for my family and I to share.. so I had to break it down to her. I ordered empanadas for myself and she asked me how many I wanted and I asked her how many does an order of empanadas come with and she was confused and rudely said \"well I don't know I'm new here\".... well if you don't know simply excuse yourself and ask... without the attitude would be nice too... this place needs to hire more professional people. Not only does this place have rude unprofessional people, but it looks like a mess in there ! Besides the horrible experience I had, the food was decent. First and last time I'll be going here."}
{"text":"They got roaches everywhere I open my Pupusa and there was a dead ass mf roach I'm calling the police what kinda ghetto hood shit is this"}
{"text":"We usually come for the menudo, but tonight I had to try the chile rellenos. Wasn't expecting it to be swimming in grease, but that's where the tortillas helped.  Despite the appearance, they weren't bad at all.   My Babygirl has the fish tacos and thought they were good.  With that being said, we'll definitely come back and continue working our way through the menu."}
{"text":"The place is nice, still kind of fancy for me. Pupusas were good but very greasy. I probably consumed a whole week's worth of grease eating these today. El Carbonero is the better pupusas joint in my opinion."}
{"text":"Popusa was fried, music to load ( could not have conversation), rice tasted old, cabbage was not chopped up and very soggy. Will no be going to this establishment any time soon....My hunt continues for a good popusa....."}
{"text":"The staff was nice and polite.  the low rating goes to the food. There was a big lack of flavor in the pupusas I ordered.  The beans are the worse sorry to say but they had no flavor and they just didn't appear fresh .  Also I ordered an horchata assuming it was the traditional Salvadorian kind, but it was the Mexican white rice version and it tasted like it was store bought mix . The platanos con frijoles :( not good. It's the beans, they ruin the whole thing. I only ate the bean pupusas but my family had a few different kind and they didn't like it either for the same reason.  The food needs more flavor even the cortido."}
{"text":"This place is disgusting!  They were closed down for having German cockroaches everywhere!  They also had lots of expired,rotten,moldy food... GROSS!!   They were also on Dirty Dining....DONT EAT HERE!! STAY AWAY FROM THIS DISGUSTING PLACE!"}
{"text":"Well I'll just start off with horrible customer service from the second you walk in the door the waitress looked at us and didn't say a word so we proceeded to sit ourselves down. When she brought our menus, again, she didn't say anything. So while we waited for her to come back i looked for a different restaurant and we left. Never coming back and i recommend you do not come here."}
{"text":"Filthy, disgusting place with live cockroaches crawling on the food prep tables and up the walls! Shut down by the health department!"}
{"text":"This is place may appear a bit deceiving, seems like a hole in the wall, however seems to be quite spacious once you're in. I had the cheese pupusa with zucchini and oh boy!! So yummy and they're large! Both my hubby and I had one each. We basically had breakfast for 2 and spent under $5.00! Now that's a win!!"}
{"text":"Worst place ever!!! They didn't have no kind of waters not even ice water I had to buy a bottle! The pupusas were dry, the chicken and the beans were burn. Worst Mother's Day lunch!!!"}
{"text":"La pupusa loca es un lugar bueno para comer riquísima papistas, y tamales salvadoreños. It was quite fun and there was plenty of great service. The el salvadoranien  food was authentic and tasty. We didn't try anything else. We got many pupusas tamales and the breakfast plate. It was yummy and all about 20 bucks."}
{"text":"The pricing on this place is very good, highly recommend for some pupusas if you want that Mexican, Guatemalan, Salvadoran feel to the place very great service! But the horchata isn't all that great but over all it's a great spot for $2 pupusas!! So check it out!"}
{"text":"This place is the best for popusas. Sad to say the location on 43rd and Thomas has closed And is now a mariscos restaurant."}
{"text":"They don't know how to cook fish! Left the guts inside. They also charged us for our tap water. When we asked why since they weren't bottled water they stated it was because of the lemons in the water. It took them four times to try and add up the total and we're still complaining about refunding our three dollars for the tap water they charged. The way out, our server as well as the others were real rude by saying \"well if you don't like our Salvadorian food go eat somewhere else where they give you free water\" (they said it in Spanish). Save your money and headaches and DO NOT COME HERE!"}
{"text":"LOVED it here! If your a true pupusa lover you will get your fill here. Place is a little dirty and in the summer it gets real hot, but the food is absolutely worth it. Wish they had one in north Phoenix!"}
{"text":"Worst pupusas  I have ever had. The masa didn't taste good at all. The curtido was decent. But over all not great. :( will never be coming back here. Made my stomach hurt too"}
{"text":"Despite them hardly speaking English and feeling a bit judged, the server was still extremely polite and oh my lord the food!!!! It was so amazing. We had to wait a little bit but it was worth it, clearly the wait was for it being made fresh. So delicious, we will definitely be returning customers."}
