{"text":"Tout ce que j'y ai mangé était excellent: sandwich, salade et crème glacée. En plus, c'est très, très propre. Ne vous fiez pas à l'aspect extérieur. L'affiche défraichie ne donne pas une très bonne impression, mais la qualité qu'on retrouve à l'intérieur vaut le détour."}
{"text":"J'ai plutôt essayé la petite soeur de paysanne au centre Eaton.

Une petite gelateria, avec des gelatos et des sorbets tous plus délicieux les uns les autres. J'ai pris une petite coupe (petite est un euphémisme!) avec sorbet à la framboise et granita à la lime. C'est sucré, mais rafraîchissant en même temps.

Il y a aussi de superbes crèmes glacées sur bâton style Magnum, des macarons glacés (très original!) et des bûches de Noël. On peut également apporter à la maison un contenant avec les saveurs de notre choix.

Il y avait foule, car c'est le temps des Fêtes, mais ne vous laissez pas impressionner par cela, le service est rapide. Une petite pause en plein magasinage, ça fait du bien!"}
{"text":"Very much disappointed by the service, used to go on a regular bases for the past 3 years. Service was ok but the gelato is tasty. Last time i had the rudest and most unprofessional stuff ever met. As if they are making me a service by selling me gelato and not vice versa. For the past three years i always had 4 choices in the 1L box never heard if the 3 flavours per box rule. The young girl serving me refused to put 4 flavours , her boss too. I don't know what was the big deal , i pY for what i take and its by volume / weight per box. I has very polite and calm , but the person in charge clearly told me its unlikely that you had 4 flavours previously ( as if i a lying) its just a gelato for gods sake;  and that i have the choice of 3 take it or leave it. I end up leaving with my family and another 3 couples and their children's . That day they lost us all as customers . End up trying a new gelato place and we had the best service ever with better quality and at a cheaper price. I will never go back to any of the la Paysanne ."}
