{"text":"The food was delicious and fresh and fast!  I had a steak burrito and pastor and barbacoa tacos. I also got a can of coconut juice with pulp in it.  It is authentic Mexican food.  The kind of food that is hard to get unless you are in Mexico!"}
{"text":"These folks are great. The groceries are fine but I really come for the little food stand in the back. Good quality, very reasonable prices, friendly even though it can be quite crowded weekends."}
{"text":"Best tacos and burritos in Madison.  There meats are perfectly flavored.
Can be very busy at lunch time but they get orders out in a very timely manner.  The carnitas con chile are out of this world."}
{"text":"I am a HUGE fan of authentic Mexican food. The Monona Super Tienda is a gem of a find. They have a large fresh meat counter with tons of well trimmed specialty cuts of beef and pork (some chicken). If you are preparing that authentic Mexican recipe this place has your meat and their prices are much lower than Woodman's.

 Now to the best part--The Taqueria. They have a small cook-to-order counter with assorted traditional meats and fillings for your fresh made taco, torta, or combo plate.
The food is the most authentic Mexican fare that I have found anywhere at any price level in the Madison area. They also have a good selection of well priced produce and groceries and yes--the avocados are always ripe and low priced!
They do have a small seating area with about 4 tables to eat at."}
{"text":"You know the food must be good when you see a line of people 20+ deep.  

After moving here from California, I've been in search of my \"go-to\" burrito/taco place but sadly, every place I've tried has just been...off.  But luckily curiosity got the better of me when I decided to check out this little Mexican market. I was pleasantly surprised to see they were more than a just a market.   

So far, this is my favorite place to get a burrito in Madison.  The food was fresh, tasty, and pretty darn cheap.  I think my burrito cost $5.50 and it was as big as my forearm. They also sell tamales (I saw the ladies dropping them off one day), and tacos, and I'm sure lots of other yummy Mexican plates.  There's a sitting area of about ten tables or so but on the weekend, it can get pretty darn crowded.  I'm unsure about whether the taqueria is open during weekdays though.  

They also sell meat, veggies & fruits, and lots of Mexican spices and dried goods. This is where I go to buy lard, dried peppers, spices and piloncillo, queso fresco, corn husks, and now my burritos!"}
{"text":"This place is not fancy (it is a grocery store, actually), but when we need some fast and delicious, La Rosita's never disappoints. Usually I order tacos, but last time I got the burrito which was a) as big as my head, and b) delicious."}
{"text":"Their meat counter is excellent.  I've gotten a couple pounds of skirt steak and they are happy to trim it up so you get the most for your money.  The house made chorizo is lean and delicious, not greasy at all.  Carne para tacos and al pastor is also in the case and is great for dinner at home.

Now for the little taqueria.  It's incredible and an outstanding bang for your buck.  Massive tortas or burritos can be had for $5 or less and their barbacoa is just ridiculously good.  I just picked up a pound of it today.  With a little bit of their house made salsa and guacamole on some fresh corn tortillas...that made my day.

Keep up the great work La Rosita...you guys do it right!"}
{"text":"Very good tacaria.  It has authentic Mexican food.  One time I was there a person sad you can tell this is the real deal because all of the mexican's that eat here.  Another time a worker from Findorf was picking up 15 fords' that were breaded steak.  The steak was 12x6 on a large roll with peppers, lettuce and avacodo.  This is about $6.  I like their burrito which is $5.50- 6.  My wife like to get 2 of their tacos at $2 each.  The area has just been fixed up.  The problem is they don't have a soda fountain but you can get cold pop from the grocery.  Also they have frozen fruit bars.  Very good place for sandwiches."}
{"text":"Best authentic tacos in Madison. Meat Cilantro Onion Lime on a fresh corn shell. Embrace the culture! While your there grab some groceries and produce that is hard to find anywhere else in madison."}
{"text":"Food is great the service not so good 
I order some food to go and the guy at the kitchen told me I can't take any salsa to go... wtf"}
{"text":"These tacos are amazing. Authentic Mexican and a buck a piece. Grocery store has plenty of fresh meat choices. They have tables to sit and eat with fresh guacamole."}
{"text":"This place is great! Fantastic tacos, tamales (weekends), and everything else. I buy my skirt steak here for the grill. They cut it thin and tenderize for you. They treat everybody equally, even a gringo like me! Don't miss this place. Good new ice cream dept. now!"}
{"text":"Not a huge fan of the tacos here. The popsicles however; they are amazing! Try the pina colada and you will not regret it. :)"}
{"text":"Go and order tacos from their deli counter! You will not regret paying $2.50 for these delicious morsels! We got the chorizo and carnitas (pork). They came with a side red and verde salsas, white onions, and cilantro. These are probably the best tacos in the area!

Pick up some Mexican coke from the grocery section and you're ready for a night in or a picnic."}
{"text":"What can I say? Love this place!! Always come here to get an authentic chicken burrito. Not a fancy place but food is great."}
{"text":"My sister and her friend introduced me to this hidden gem, and I am a definite fan. I went a bit safe and ordered a chorizo torta, and I was in heaven! My sister and her friend order various tacos and we all shared, and each bite was delectable and perfectly seasoned. I'll admit that I was a bit sketched out at first, walking into the grocery store and seeing that we had to share the condiments that were left out in bowls on the tables. Once I got over it, the experience was pretty amazing."}
{"text":"This is a legit Mexican grocery store!!!  Great selection of canned goods and dry goods. Sweets for the kiddies and the real sugar Coca-Cola- yum!  There is also a decent selection of produce and you can almost always find ripe avocados.  There is also a great meat department!

Along with all of your Mexican grocery there is the hidden jem counter where you can order some of the best Mexican food in the city. There are even comfy tables to eat your food. The tacos are amazing!!!"}
{"text":"Great little Latin grocery and taqueria.  Prices are very reasonable and employees are polite and attentive.   Can't rate this place high enough."}
{"text":"I come weekly or more.  The lusciousness of their weekend beef barbacoa has become a fast favorite for my children. Ice cream, tacos, butcher... they've got it all"}
{"text":"This is the best selection of Mexican and Latin American goods that I could find around Dane County. Not only do they have all the frijoles and hot sauces I could need, but the staff is very friendly and knowledgeable. When I lived downtown, I'd head all the way out to Monona so that I could be guaranteed a fine selection of ripe avocados. 

As far as cost is concerned, I suppose it all depends on how hungry you are. It is, after all, a grocery store."}
{"text":"This is the place.  Now known as La Rosita. The grocery selection is fine, great hot sauce selection BUT go on a Saturday or Sunday when you can order freshly prepared taqueria food as good as any I've ever had, and I lived on Milwaukee's south side most of my life. 

The carnitas are terrific, just had to say it.  I bounce from the torta with your choice of meat (and bear in mind this is a butcher shop, so they make their own barbacoa and carnitas and marinated chicken, lengua, etc), to huaraches when you can get them, to just a simple soft taco.  This is the real deal, no Taco Bell Doritos taco here.  At $1.75 a taco, and they're huge, wow.  Oh, and the salsas they make are great, the red has a mighty nice zip.  

Oh, final word - house made chorizo.  Holy crap.  OK, that was five words, but it's unlike any I've had before.  Complex, perfectly spiced, a slight hint of cinnamon, not greasy, simply great.  You can order it on to-go food at the taqueria on weekends, or by the pound in their butcher shop (raw).  I use half, freeze half."}
{"text":"Dope ass tacos. Great service. The best tacos are always in the back of Mexican grocery stores."}
{"text":"While I haven't gone to their new buffet, my family and I think this is THE best Hispanic grocery in Madison. Great selection of meats and veggies and ugh, the food hall in back is SO good! The carnitas are not to be missed."}
{"text":"The best Mexican food in town.  Just a deli, so selections are small, but wonderful.  The pastor tacos are wonderful.  This is authentic, so if you like TexMex or AmericanMexican food, you will not like this and stay away.  Excellent tamales on the weekends."}
{"text":"I can't believe I haven't reviewed this place sooner - I'll keep it simple!  We are regulars - the tacos are awesome, nice and spicy.  I love all the sauces that come with your food.  Burritos are a TWO meal kind of gig, they are so, so huge.  We haven't checked out their new buffet yet, but you better believe it's on our list of places to go!  We hope they have much better luck than the past two restaurants that have attempted that space...they have the food down though, that's for sure."}
{"text":"This is a nice little hispanic grocery store and taqueria.   Fair selection of grocery items, including meats and produce. They had few bakery items. I thought I would be able to find some kind of bread, torta or rolls.  No luck.  I suspect it varies, day and time dependent. 

Really enjoyed my pastor torta which was modestly priced.  They have a classic informal menu posted on boards. Tacos, tortas and the like of other tasty fast items.  You order at a small counter in the back right of the store. There are a number of small tables to enjoy your items at. Then you pay at the front counter.  They also have a bowl of green sauce on each table which is very fresh, tasty and spicy!  Really informal and low key.  Love it. 

They also have a counter where they serve frozen treats. Looks good!  Looking forward to my next visit."}
{"text":"I love this place. They've got a lot of unique grocery items that you can't find in a grocery store, but the best feature is their made-to-order tacos. On weekends, they have steak tacos. My husband says he prefers the pork tacos, and I say I prefer the steak tacos (we usually order 3 of each \"with everything\" and take them home), but truthfully, neither of us is smart enough to know which ones are beef and which ones are pork, but it doesn't matter, because every taco is delicious. I've ordered their burritos (take-out), and while they're fantastic, they're too big for me to eat. If you can eat a lot, order a burrito. If you'd prefer to take your meal in smaller increments, order yourself a few tacos, and buy some sour cream to go with them."}
{"text":"This place is great. The grocery store looks a bit run down, but I love it for the butcher counter that has interesting cuts out there. Finally, a butcher counter where I can buy pork feet by the pound. They also sell marinated meats perfect for your own taco night at home. We grilled some chicken marinated in adobo spices from here and it was tasty.

I also ordered their carne asada burrito from the little deli in the back of the store. It's right next to the butcher counter. The burrito was delicious. Big, with ingredients well distributed and well wrapped with a warm flour tortilla. Their salsas are amazing. Eat at the few tables in the grocery store and rub elbows with the local regulars. It's been 3 days since the burrito and I'm still thinking about it. Tacos, gorditas and tortas are also on the menu. This place is worth a trip."}
{"text":"Tacos  are ok. It's located in a supermarket 
I've been spoiled with Texas Tacos and California tacos  
What was a surprise was the Gordita!!!!! 2 of them will make your day and will not have that taco 
He aftermath's!

Pro tip: tripas is the great tacos or carne asada 
Must get that Gordita"}
{"text":"Great local grocery store with good prices. You can buy home made tamales and order a taco while you shop."}
{"text":"I come here all the time to eat tacos. I'm mexican and I can say they are the most authentic tacos I've had in Madison! delicious. Although their food is great, I can't say the same for their customer service. No smiles or friendly staff, they can actually be pretty rude. I sometimes shop at the store as well and it's always a bad customer service experience. Mostly all the staff seems annoyed that you're there and can't wait for you to leave. They try to avoid eye contact or speaking. I hope they can improve on their service but I think I'll  keep going there  to get my taco fix and grocery items."}
{"text":"Finally reviewing this place that I love so much. I am definitely a regular here and I come for palets, groceries, produce, prepared salsa and guacamole,  and the tasty and oh so tasty, authentic Mexican food. But this is not just a grocery store, but also a butcher, ice cream shop, paleta factory, fresh juice bar, and small eatery. 

I mean come on, if the place you are eating at doesn't have the freshest ingredients while being attached to a grocery something is terribly wrong. They have the small kitchen pumping out deliciosity and never a long wait, even while getting very busy. The clientele ranges from Latino blue collared folks, high schools students, shoppers that are looking to snack, office lunchers looking for a quick eat, and families sharing a meal. 

On the weekends they have prepared soups and meat specialties, fiery habanero salsa, and tamales available. 

BEST BURRITO IN MADISON! And for $5.80 it is a steal. 

Highly recommended."}
{"text":"This spot is simply amazing. I often get the salsa roja and salsa verde to go. These salsas are made in house and have the perfect level of heat - they are actually spicy! I also frequent the butcher section to get the arrachera (skirt steak) which at about $8/lb you can't go wrong - so delicious when marinated then grilled! The cecina de res is also a must buy, especially when one cannot grill. Indescribably thin pieces of salted beef - perfect for any day! This spot has variety, service, and outstanding prices. This is definitely my go-to spot for Mexican variety foods."}
{"text":"We decided to try La Rosita on a recommendation and have had pretty good luck with Mexican grocery store tacos. Ordering: You order at the butcher's counter...there was woman sort of hiding at a cash register in the corner of where the butchers counter meets the kitchen.  Grab your drink and head up there to order. 

Tacos: we tried chicken, chorizo, pastor, and carnitas. They asked if we wanted cilantro and onions (yes), so they all came with that on top. There were two salsas at the table in squeeze bottles. Both salsas were good. The red packed some heat. Now, for the main event, the tacos:

Shells were pillowy and had good corn flavor. 
Carnitas were awesome! Really flavorful and moist.
Chicken was average. Needed the salsa to perk it up, but was nice and moist.
Pastor was average. Not the best I've had. A little dry, but at the same time, very greasy.
Chorizo was just plain bad. Tasted like burned, bitter chilies.

Really wished I had time to enjoy a stroll in the park with one of the paletas (homemade fruit popsicles). They looked really amazing. Every grocery store should have a juice bar and paletas to use up that fruit that needs to get used up!"}
{"text":"On a visit with my sister, I had a taste for some authentic Mexican food. So she recommended this place. When we went here, I loved how they had fresh salsa at each table for dine in patrons. I ordered steak tacos which were excellent!  The best I've ever had. The meat was tender and flavorful, and the pico de gallo I ordered on the side sealed the deal. I wish they had one closer to where I live, but I know I'll definitely be visiting this place again."}
{"text":"I think La Rosita adds a lot to the neighborhood. Authentic through and through-- at least it appears to be! Huge meat selection. I love their milk pops too! So many different and unique flavors. I've  enjoyed many of their menu items but they are not consistent. Every person working behind the counter seems to make the items differently. Unfortunately they use some kind of margarine that can be overbearing on certain things, I'm thinking the tortas in particular. It really has a strong and unpleasant flavor. 

Don't expect a smiling face. There's no emphasis on customer service here. Not for me anyway. Despite my smiles and Spanish greetings, I've never felt truly welcome or appreciated. Oh well. I'll still keep coming."}
{"text":"Amazing tacos! Hands down the best tacos de asada that I've ever had. The store sells all my Mexican faves."}
