{"text":"La Rista is a great restaurant for big parties.  I have only eaten at this place with big groups and each time it is a great experience.  Vincent, I believe is the owner or manager has been a great host.  He worked with us and had him setup pre-fix dinners.  Our appetizers were family style ranging from antipasto and grilled calamari.  Considering its location and parking, this place is a gem.  On the weekends they have live music which adds to the ambiance."}
{"text":"The service is excellent, it's very clean!!! The food is great... and in particular the homemade ice cream/gelato. I have dined their twice. My clients recommended and I took them there. The washrooms are clean."}
{"text":"Total rip off...  They're trying to give off an impression of a high-end restaurant but with their service and food quality... there's a long long way to go.   I purchased Groupon dinner for 2 includes 1 appetizer, 2 entrees & 1 dessert.  The value of the coupon is totally over stated but the worst part is they added tips to the bill (by hand) and the amount is overwhelming....   Ordered deep fried calamari but it doesn't taste fresh, in fact it kinda taste like frozen food.  The 2 pastas ordered, one of them was under cooked, very bland taste, description shows \"sausage\" but I can only find bacon on the plate.  The other one was a chicken pasta the sauce can be made with store bought sauces and again, we can only find a few tiny slices of chicken on the plate.  As for the dessert, it was crepe with ice-cream & strawberry sauce.... I'm very positive that the crepes were made a long time ago, tasted horrible... even a dessert lover like me will have to leave that alone.  On top of that, the wait time on the food was LONG....   Now the service, the girls were OK... at least to me, their services were no where near the high-end restaurant standards since not much attention was given to our table thru out the night.  As for the manager... all I can say is, he is the worst!!  Whenever we called him for service, we felt like we were being ignored.  When we managed to stop him to ask for some water, there's no initiation, no eye contact... just a blank face and walked away.   You just don't know if you'll get your water or not.  With all that, they wanted us to tip them more than 15%.... are you serious?!!  We will definitely not go back to this restaurant and words will be spread..."}
{"text":"Very clean,Stunning decor, polite service and food was great. I got a veal sandwich, it was unique, very fresh and came with sweet potato chips that were really good."}
{"text":"We came here for a business lunch.  We were quite pleased with the lunch. I had the sea bass, and it was quite good, albeit small. The same response came from others' meals."}
{"text":"Omg  Where do I start, we had Calamari and lamb spedini for an appetizer the calamari were decent and the lamb had a tangy taste to them  For our mains I had the peppercorn strip my wife had the salad and kids had the pizza and pasta  The steak was not seasoned at all, the peppercorn sauce was drowning the steak and also very bland, didn't even have that black pepper kick  The pizza was horrendous, the sauce was super tangy and the crust had no texture..... put it this way, if a 4 year old says the pizza is bad there's a problem  The pasta was a big glob of over cooked linguini that were swimming in cream sauce with the odd piece of chicken and spinach thrown in there    At the end of the meal the waiter ask if we wanted him to pack up the left overs, when we said no he asked how the food was and not to make a scene I told him how awful everything was and that after we leave I thought the owner and the chef should taste the \"peppercorn steak\"  he then proceeded to the back and upon his return he told us the owner said we didn't have to pay  I did pay the bill and I did tip the waiter, if I were to recommend this place I would only say to go and see how bad it was, but if you do go have the calamari, very hard to mess that up  Super disappointed"}
{"text":"Went here for the Groupon deal (3 course prix meal for 2 people).... and I can only say, DON'T DO IT! Please view my pictures and you will understand why."}
{"text":"Not very good at all  Lobster Ravioli had seven little pieces and was actually crab!  Ordered a pizza as well, toppings were good but the pizza was oily and too thin to hold weight of cheese and tomato sauce, last time I ever order a pizza at a non pizza joint  The mushroom soup was pretty decent with some pepper added, the bread was drizzled with olive oil and had a nice crisp  Unfortunately when bread is the highlight of your meal, well you know it's time to cross this one off the list  With so many good options such a short drive away, go the extra distance and get quality over convenience (only ended up here because next door sinners burger was out of burgers)"}
{"text":"I've been going to this restaurant for over a year. The owner is so niceand warm( very welcoming) The service is great and food is delicious. They serve meat Right on the mini grill that sits on your table  it's amazing!!!! Honestly another great  Thing about this reastaurant is it private and quiet so you can eat peacefully and avoid  The crowed environment of a moxies or earls.If you are looking for a good restaurant go here it's definaetly unique"}
{"text":"I bought two penny pincherz vouchers for here and 5 of us ventured out across the street :) (literally across from York U) to try it out! We made reservations for 6pm and were the only table for about an hour but the service was really nice, attentive and around 7ish the other tables started to fill in! They also have live music playing saxaphone/guitar, doing instrumental/covers! They have a wider range of wine, which I tried the pinot off my italian boss lol, good for a house white! Fpr apps we got two orders of calamari $9 each order, it was yummy, crispy, not super chewy and the batter stayed on the squid. The chipotle mayo type sause it was setved with was a hit with everyone. They brought out an amazing bread basket with olive oil drizzled over and some rosemary spice :) big fan  We also ordered the proscuitto and buffalo mozzarella $13 which they for got but brought it out with our meals, it was really great, drizzled with balsamic vinigar and sitting on a plate of mixed greens/cheese, the meat was roll around bean sprouts which added a nice offset to the meat.  The specual of the night was veal parmesan (everyone but 1 order this) with a side of penne, it was good, the batter stayed with the meat and remained crisp even with the sauce, doner very nicely! $24  My friend got shrimp/scallops pasta woth a sort of rose sauce $18 was a good portion and looked yummers!  For dessert we ordered almost everytype lol toffee/pecan cheesecake 6.95, creme brulle 6.95, chocolate raspberry tartofu 6.95, tiramisu 7.95! All but the cheesecake which tasted like freezer burn tasted like home made and amazing!  Decor was very white table clothes and glasses, but it was distictive because the chairs are wooden and multi color-red, green, orange, brown, and other colors! My italian boss' mom has the same ones in her kitchen so I'd like to say homey! The washroom was agreed by everyone to be very clean and nice! Only thing about the service is a few times they started to pick up our unfinished plates or not waiting for an answer before piking them up.  Also when the live band started it kind of got hard to chat, but you can always come early and then stay for the dancing :)  Tip they are closed for private events on saturday/sunday, would be a nice private venue, especially with the attentive servers!  I can say definitely authentic :) worth a try"}
{"text":"Bought a Groupon for a 3 course Prix menu for 2 people.  **PLEASE KEEP IN MIND THAT WE WERE THE ONLY TABLE IN THE WHOLE RESTAURANT!!  (Thursday night from 7pm - 9pm that we were there)   They gave us a bread basket with some whole wheat bread toasted in oil n rosemary with TWO tiny bread sticks. Bread was warm and toasted which was great.  We ordered the pancetta wrapped scallops and buffala mozzarella with beef.  The pancetta was thick and crispy, scallops were seared well too. It was served with a bed of mixed greens and a little bruschetta. Scallops weren't the freshest because when you bite into it, it had the fish taste. The aioli sauce on top of the scallops didn't have much taste to it, tasted like plain mayo. The bed of mixed greens had no dressing or any flavor.  Buffala mozzarella was served on a bed on mixed greens which again had no flavor, seasoning, or dressing. The 4 thin slices of beef just tasted like raw meat, no seasoning at all, no oil or dressing. The buffala had no seasoning as well, tasted like plain cheese. There werent even a single drop of olive oil or balsamic on the plate which could of given it a better flavor.  We had to ask the server to bring over the oil & balsamic to dress these ourselves.  For mains, we ordered the lamb chop with seasonal veggies and potatoes & tagliatelle with smoked duck.  When we received our plates it was cold like it came out of the fridge. Was definitely a turn off touching  cold plates. Any chef should know that hot foods are served on hot plates.   We ordered the lamb at medium rare but when we got it 1 out of 3 were medium rare and 2 out of 3 were rare. The sauce on top of the lamb was clumpy, the vegetables were cold like it came out of the fridge. One piece of zucchini, red pepper, Bak Choi and carrot. The only piece of potato was warm and well seasoned which was good.  The tagliatelle came in a pool of creamy white sauce with mushrooms. Tasted good except the fact that it said it had smoked duck and all I could find was small cubes of what I assume is smoked duck that tasted like ham from a supermarket. VERY DISAPPOINTING!!! Only if it didn't say it had smoked duck it would of been a good mushroom white sauce pasta.  Desserts was terrible!! Worst I ever had in my life. I wanted to spit it right out as soon as I put it in. We ordered a tiramisu and creme brulee.  The creme brulee was burnt. Clearly the chef didn't know how to brulee or didn't care about serving something BURNT to a customer hoping they wouldn't notice. It was bitter when it was suppose to be sweet because of the caramelized sugar. The creme itself was to thick and tasted nothing but egg. The chef added too much egg into it causing it to be not smooth and creamy but like a custard. Obviously there were no other vanilla or other taste than eggs.   The tiramisu was worse!! I would definitely not call this a tiramisu. It looks like one but tastes nothing close!! TERRIBLE!! It tastes like cold soggy crackers with coffee taste. Its disgusting!!  I would NOT recommend anyone to go to this restaurant please!! Especially the prices they charge for the food you get. We were the only tables there that night and this is the quality we get?  Service was just alright."}
{"text":"Came here for a lunch meeting. The venue is professional for a lunch meeting but the food and service is not.  Instead of reading the specials they placed a white board with the specials listed on an empty seat at our table.  I ordered the baked sea bass which was bland.  I later got a cappuccino which wan't very good and both the rim of my glass and my spoon were not clean."}
{"text":"You could easily miss this place, driving by, but I am so glad I went in to try it out.   Everything was really good. I got the carrot soup, which was so well flavoured.. best carrot soup I ever had. As a main, I got the grilled salmon which was awesome. It comes with a small side of vegetables, but the salmon itself is so filling that it wasn't a problem.   I would assume bruschetta is on the house, because they came and brought it to our table first thing once we were seated. I noticed they did that with other tables too. I didn't grab the bill so I'm not too sure.   They have an extensive wine list, and this may sound odd but I loved their tableware. Nothing too modern, simple, but still elegant. The servings were a good size for the price.   The waitstaff were so nice and made sure our finished plates were cleared in a very timely manner.  I would go again, even just to get some more of that carrot soup!"}
{"text":"Came to this restaurant twice already with my family. Great atmosphere! Restaurant looks clean and neatly decorated. It is not super busy which I prefer because it's quieter. The manager was super friendly and took time to help us select a good Pinot Grigio   We first trialled this restaurant with their groupon deal and it was quite impressive. Usually you expect to be short changed and given some shafted menu. Not at this place, they had a pretty big menu which let you go for soup of the day, fish of the day as well.   I ordered the soup of the day (purple carrot and ginger purée), which was quite interesting! Never had anything like that before. For my main, I ordered Tagliatelle with Duck. A little sparing with their duck portion but the pasta and cream sauce was delicious! Probably could've just sold it as a mushroom pasta and left the duck. I chose creme brûlée for my dessert, which was pretty standard.   Overall, service was great! Food was good! 4 stars! Would definitely come back!"}
{"text":"Please note the 1 star is based on food & experience from a special appearance by the chef himself. As we can't give 1/2 stars as the service was good!   Came here a couple of weeks ago for my sisters birthday. Had a groupon $49 for 3-course menu for 2  A lot of good choices! Bread basket was awesome! I love warm bread! Very few places warm up their bread! This place had very toasty crunch bread!   Appetizers: Buffalo mozzarella wrapped in cured beef tenderloin- this was basically raw ish thin slices of beef wrapped in mozzarella. The beef tasted like it was left sitting in the fridge with it's fridge taste! Nothing \"cured\" about it.  Scallop wrapped in porcetta- yummy scallops wrapped in thick bacon scallops were done perfectly!   Main: here's where the problem lie Veal scaloppini - veal of the day my choice of mushroom or lemon sauce Came in three pieces. The meat had a sour taste to it so we asked the waiter whether this was the lemon or the mushroom sauce (I had ordered the mushroom) as it tasted a bit sour. My sister known for her shop taste buds indicated the meat tasted a bit off. The waiter quickly went to check and came back claiming the meat was fresh and according to the chef was just bought today. But the sauce might have had some lemon in it. So is this lemon or mushroom sauce? He offered to change it to something else. So we chose the famous homemade lobster ravioli. The chef stormed out shortly after telling us off! ttat there is no way the meat was off as it was purchased yesterday! (So which is it? The meat was bought today or yesterday?) \"Do not claim the dish was off just coz you don't like it\" before storming back into the kitchen! Who does that?!?!   So the lobster ravioli came out and the sauce tasted like it had a tablespoon of salt added to it compared with the bland sour veal... The ravioli itself tasted decent minus the saltiest sauce on the planet! Needless to say right then and there we vowed never to comeback!    Lamb rack served with veg and potatoes -cooked perfectly medium rare  Dessert: Crepe wrapped in chocolate ice cream - the waiter was kind enough to remember it's my sisters bday and out a candle on it!   Tiramisu -made in house, a little dry but otherwise decent  Overall other than the main was a decent meal. However with the whole chef storming out & arguing with a customer? No wonder it was dead on a Friday night! I will def NOT recommend this place even with it's groupon deal! As there are so many better restaurants out there! There is no room for egotistic chefs here! Unless you are Gordon Ramsay! Even he knows better to storm out of the kitchen and go on defence mood with a customer!!!"}
{"text":"This place is very preconscious and the staff are extremely rude...they are an embarrassment.  Food portions are very small, not great, and everything is loaded with salt to camouflage the lack of freshness and taste.  I can forgive bad food and chalk it up me having picky taste, but I cannot forgive rude, ignorant service."}
