{"text":"We've gone out to dinner here twice and have never had a bad meal.   The dining room is small, seven tables, but that adds to the experience of a small town restaurant.  The prices are reasonable and the wine selection is really good.

We also ordered pizza to go a few weeks ago and loved it.  This is our new first choice for local pizza when we just don't want to cook."}
{"text":"Really good pizza. I order a pepperoni, basil, and kalamata olive pizza and they do it wonderfully. Delivery is consistent, food is consistent, quality is good."}
{"text":"La Rocca's is a wonderful edition to Oregon's restaurant scene. I enjoy their specialty pizzas but where they really shine is in the pasta dishes. This is great because my favorite pizza place in town has only average pasta...so between this place and that place all my Italian food needs are nicely covered!
It's not that I don't like the pizza here because I definitely do. When we want a non-traditional pizza this is our place or choice. The spicy aglio olio sauce is our favorite on a pizza topped with cheese, ham, artichoke, etc. super tasty! However, what we like the best is having a date night here. It's really cute and cozy inside, the pasta dishes are absolutely delicious, and the servers are always very friendly and helpful with suggestions. I love the lobster ravioli and my husband is partial to the spicy seafood linguini. I don't believe they have mixed drinks but we can get a good bottle of wine at a decent price.

Recommend!"}
{"text":"Three and half stars for food and five for service.  Over all it was a pretty good experince.  Others I know would sum them up about the same."}
{"text":"Last weekend we wanted pizza...shocking I know.  What we really wanted was Paisan's but it was still closed due to the fire and we did not want to go have our norms.   So...that when I turned to Facebook.    You know...it is amazing how many people have different opinions on pizza.  Personally I am a simple guy when it comes to pizza.....or not like Pizza Pit single but...simple.   No fancy dance topics, no weird french fry topping, no Neapolitan....just plain old good Italian pizza with cheese and the basic toppings.

So....going off the advice of one our our friends we tried the \"other\" pizza place in Oregon...La Rocca's.   We showed up early as people with babies do and were seated right away.  It is cute place and I know if I throw my back out while eating pizza the chiropractor is right next door.  We got some wine, some cheese bread that was very good and yeah...I cannot complain about the service or the atmosphere.

I know I should give this review a higher rating but I can't because sad to say the pizza was nothing special.   In all honesty it tasted like a DiGiorno.  I guess it just tasted bland to me and maybe it was an off night.  I don't know...I am torn.   Yeah...DiGiorno.

Am I ruling this place out?    No, not at all...it was a good change from our norm but defiantly no Maria's Pizza.    But the service and atmosphere rules and they were very accommodating for people with a baby.

Oh...one last thing....parking lot is tight and hard to get out of."}
{"text":"Real Italian, quality food. If you're in a hurry, call ahead, because they will not rush through making your food or compromise quality. Food is fresh and from scratch. The owners are friendly, genuine, and love what they do!"}
{"text":"I'd just like to add to my previous review now that we've lived in town for almost a year. LaRocca's has the BEST pizza in town. We've had Maria's and Pizza Pit too, which are ok, but we find ourselves ordering LaRocca's almost every week!"}
{"text":"Their alfredo was decent, but everything else I've tried here was just ok. Nothing out of the ordinary and with Maria's Pizza being in Oregon too, it's an easy decision to choose that over La Rocca's. The food's just not as good."}
{"text":"I visited with a friend on the eve of the Ironman 70.3 Madison. We were traveling with my dog. The staff was wonderful and attentive to us as we sat on the patio.  They even offered a bowl of water for my dog."}
{"text":"The lasagna was awesome!  Fetticine Alfredo with shrimp was 2.5 out of 5 stars. Sauce was a little runny. Service was slow,  but overall a good meal. Dining room is small and tables are close together."}
{"text":"Its average at best. I've tried the pizza several times hoping it'd get better. It hasn't. It's a shame because I want to like it. I just don't. The pizza never seems cooked long enough. Maybe their other food is better but I'd skip the pizza."}
{"text":"Great Italian restaurant in Oregon with great service.  Their thin crust pizza reminds me of the Italian restaurants I grew up with. Super main dishes too!  Follow on Facebook to find their nightly specials."}
{"text":"I absolutely adore this place, and this is coming from someone who grew up in Oregon on the iconic Maria's fare.  However, La Rocca's raises the bar for Italian dining in this town, despite two other authentic Italian food outposts (Alberici's and Maria's) and there certainly is no comparison to any of the chain pizza joints around the village.  

La Rocca's owners are welcoming and friendly.  They make you feel like you are actually part of the family (you know, just like Olive Garden wishes it could be, except La Rocca's isn't disingenuous about it).  On a few occasions, I have even been treated to complimentary items such as cannoli, hand-made Italian sausage, or glasses of wine (generosity that certainly enhanced the warm feelings my date and I were already enjoying).  Granted, it probably helps that I eat there often but, to be perfectly honest, there aren't many other places in Oregon I would bother to eat because they just don't measure up to La Rocca's.  The Tiziana's Choice is my favorite pizza there (eggplant, basil, cheeses... yum!) and the fact that there are tasty vegetarian options is greatly appreciated, even though I'm not completely vegetarian, just somewhat health conscious.  

And to those who complain about delays, it all depends on when you order.  I guarantee that most weeknights would present no trouble at all to receive your food in a very timely manner.  And it's only because La Rocca's is popular (and for good reason) as well as the fact that they don't slop things together but rather take their time (like any truly authentic Italian cooking ought to), that some delays may occur.  So, if you want quality Italian cuisine south of Madison, this is the place you are looking for. Thank you La Rocca's!"}
{"text":"This family run restaurant has a quiet friendly ambiance and simple but tasty food. After 6 years on Willy Street in Madison, the La Rocca family relocated their restaurant to this space on the edge of Oregon just off of Highway 138. My personal favorite is the Veggie Rolle which is layers of vegetable pasta with cheese and sauce all rolled up. I am not a vegetarian but love this dish nonetheless. The house red sauce is very tasty and made in house. In fact, everything is made in house which can sometimes lead to delays. On my last visit my companion and I waited 15 minutes for bread to be brought to the table because it was still in the oven. I recommend La Rocca's for a quiet date, families, and later in the evening, for groups."}
{"text":"A little family owned and operated pice of Italy in the little town of Oregon WI. All the food is good and home made. The tiramisu is the best we've had!!  Each time we have it, it just gets BETTER!!
Try the home made sausage   A step above!!  I tried the eggplant a side-great!  It's grilled not fried!"}
{"text":"Excellent pizza,  Not the best in the Madison area, but certainly amazing for Oregon.  Staff is friendly, appears to be family owned.  Prices are ok, ingredients are fresh.  I've also tried the cheesebread, which is not anything special.  When I need to feed people in Oregon, this is my go to.  I also keep losing the \"collect 10 get a free pizza\" coupons."}
{"text":"Excellent sauce!  There are quite a few pizza options in the area, but I find theirs to be the best (by far).  Really tasty crust.  And their Arancina (also spelled Arancini = stuffed rice balls) are amazing.  There are so few Italian restaurants that make Arancina and even fewer that make it well."}
{"text":"Used to love this place but for the last several orders the taste has been consistently \"off\".  The first \"off\" taste was the peppery sauce in a lasagna - which was so bad I couldn't eat it. I contacted the restaurant and didnt receive much for an explanation or offer for compensation.  Next few orders were again too much pepper but editable and one last chance today .... mushroom pasta .... :(  sadly it seemed smaller than normal and peppery.  Oh And our order was 35 min late with no call to inform us. Just too pricey to take any more chances.  Sad to see a good local restaurant go bad."}
{"text":"We just tried this pizza place out for the first time tonight. We ordered the Meat Lovers Stuffed Crust. Which we learned that their crust is not actually stuffed with cheese but rather the pizza has two crusts (one on top and one on bottom). It did taste good, though not sure it was amazing enough for me to order there again. But I'm not saying it wasn't good, just not my favorite style if pizza."}
{"text":"One of our favorite places in town. Family owned and amazing food. If you want a great experience in Oregon this family always welcomes you and serves you as their guest. Reminds me of growing up with some home Italian cooking I miss."}
{"text":"Overpriced underwhelmed mediocre at best and slow service that doesn't even seem to care of that they're slow proceed at your own risk"}
{"text":"Dined with friends on a Thursday night. Not too busy but a few tables taken. Ordered a chèvre and goat cheese appetizer that was excellent. XL pizza was great too. Had a few really good wines and beer list was good too. Highly impressed! Would come again!"}
{"text":"We love this restaurant!  The owners are so nice.. and this is hands down one of the best pizzas you can get in Madison area.  Everything tastes like it is made with love.  And we can't leave without a cannoli."}
