{"text":"The Chacarero was mouth-wateringly delicious. The brazo de reina was also really good. The bistec de res frito, the pastel de choclo, and the chliean salad were not bad, but not good. They also didn't have malta con huevo, even though it was advertised.

I'd stick to the sandwiches and deserts..."}
{"text":"Located just west of Dufferin on Wilson, La Chilena seemed like an interesting place to try since I've never had Chilean food.  This place is literally a hole in the wall type-of-joint.  Small kitchen as you enter, with small tables as you pass on by towards the back.  Maximum capacity for 10 tables, you know you've stumbled onto a small family resto.  La Rosa Chilena is a cute, quaint, and clean environment.  The service was exceptional, however the food... was questionable.
Their Empanadas: 1.5/5 the portion was huge, however not enough meat, and content in the empanada.  Not to mention, their spicy salsa sauce was very salty, which somewhat helped to heighten the flavors of the bland empanadas.

Cazuela: typical Chilean bowl 1/5 soup, rice veggie, meat all in one served in a large soup bowl, with coriander, and herbs.  the Stock was exceptional, however they use a lot of oil in their cooking. The overall presentation was not up to par, however KEEP in mind this isn't a fancy place...

Bistec carne frita:  Typical Chilean dish, served with flavorful rice, beef steak, veggies.  Overall 2/5  portion was good, price, and taste of the rice was lovely, the beef was a bit bland, and presentation was satisfactory.  
I
my overal score is a 1/5. Lo siento La Rosa Chilena! :("}
{"text":"Okay, here we go! 

The Buisness here has gotten better, they have a waitress here thats so nice and very sweet. They havent forgotten my food this time lol. Try the Pastel De Choclo, Its like Sheppards Pie type of thing but with mashed corn instead of mashed potatoes, very good. Oh and they have a avocado salad here thats really tasty. And for dessert get Brazo De Reina, its a Dulce De Leche type of cake roll. 

The waitress here is very helpful if you cant figure out what to eat, she can suggest many things for you."}
{"text":"More like a 2.5 star. Although I feel bad saying that. Go for the sandwiches.

Went here with my Chilean friend to watch a Chilean soccer match. As Phillip mentions, it´s a tiny hole in the wall type place with 8 tables or so at the back. I think it used to be someone´s house as it seems you are dining in someone´s living room.

The place is tidy but in a really worn out, tired looking building desperately in need of renovations, so this factor adds some grungyness.

They make excellent looking Chilean sandwiches (called completos) which many people seemed to be ordering. 

My friend suggested I try a traditional Chilean dish. It was called a corn cake and the description mentioned chicken. I wasn´t sure what to expect but it came out in a large stone soup bowl and the corn cake was more like a paste or extremely thick soup. It was sweetened with sugar and there was chicken thighs and wings cooked underneath - bones, skin and everything. I was pretty turned off by the bones and my friend said he'd never seen it prepared that way.

Anyway - don't try that dish. Otherwise. You'll be safe."}
{"text":"Cheap, plentiful and tasty, the Rosa Chilean offers homemade Chilean food for  my Latin sides delight. 


Empanadas, churrasco, pastel de choclo, y arrollado todo es muy rico.

Tax and tip: $45"}
