{"text":"Well here I go again. I could just say \"DITTO\" to my last review.
Today it was their meatball Stromboli and meatball parm. sub. Can't get any better. 
The owner operated restaurant is very consistent with their food quality. They are very generous with toppings and fillings. The service is second to none. Any better service would require the wait staff to hand feed me. 
My wife and I only ate half of our meal. So, we ordered a medium pepperoni and bacon pizza to go (along with what we couldn't eat at lunch) to go. Now, two more days of La Strada's at home. 
Oh! By the way, Their house made meat sauce is sold by the container and freezes well. Buy some to put on your own pasta.
Now, I only wish they had a more diverse dessert menu. 

GO ITALIAN ** GO LA STRADA !!  ( had to do this )."}
{"text":"Pizza was decent, very generous with the cheese!  However, I rated this place only 2 stars because they advertise it as \"brick oven\" pizza.  Being from the NY/NJ area, my idea of classic brick oven pizza is more of a thin, airy/crispy crust that ashes over in spots and can almost look burned around the edges; similar to what you find at Luisa's or Revolution Pizza.  If classic brick oven is what you have in mind, save yourself a trip because this is definitely NOT what they serve at La Strada's.  The pizza wasn't bad, but not what I had in mind in terms of brick oven pizza, nor was it worth the trip.  I also tried the baked ziti which was good for the price (good portion), but it came with a greasy piece of garlic bread which wasn't very appetizing.  Finally, the service was ok but, for what is worth, it is good business practice to acknowledge guests for their patronage...the hostess/server and manager never bothered to say goodbye or thanks for coming, or hope you enjoyed dining with us, or come see us again.  I could look past this if it was busy; however, it was early afternoon and the place was practically empty when we arrived and there was no one else in the restaurant when we left.  Superior pizza and service at Luisa's."}
{"text":"I can only speak for the pizza, but we found that the pie was nothing special.  They use canned vegetables, so the mushrooms were like rubber.  Service was good, but considering we were the only family there on a Monday evening, it was easy to keep tabs on our needs.  :)  It is rather pricey, so for the money, I don't think we will be back."}
