{"text":"amazing - everything. we had the smaller dishes: asparagus, lobster cerviche, tempura veggie, gravlax. All good."}
{"text":"Dinner at Salle a Manger was the only thing capable of distracting me from my sexy date. Yes, it was that delicious. 

On recommendation from a local, we ventured over to Le Plateau for dinner here and were not disappointed.

We shared Buffalo Mozz/Tomato/Pancetta salad, Foie Gras/Granny Smith salad, Scallop Ceviche, and the BBQ Pork Chop. While all the dishes were fresh, well-seasoned and delicious, the salads were hands-down the standouts. 

* Creamy mozz, sweet tomato, crispy thick-cut pancetta with a bright pesto 
* Creative combination of foie gras alongside tart green apple, sweet roasted pine nuts and a perfect drizzle of honey

Can't say enough about the attentive and friendly service.. no less than 4 different members of staff, including the Exec Chef and the Proprietor, stopped by to check on us. 

Atmosphere is casual and funky fun with an open kitchen, reclaimed wood tables (made from old bowling alleys?), and low lights. The blackboard offers several dishes to share which many of the groups around us seemed to be enjoying.

The only sadness? I live 2500 miles away. Thank you for a lovely dinner Salle a Manger!"}
{"text":"What a great dinner at La Salle a Manger . Busy , great atmosphere . A really good vibe of Montreal ! Tacos and vegetarian meal were excellence and cheese cake to die for !!

There really is a special feeling of Montreal at this resto .... Like the Pourquoi Pas Espresso lounge on Amherst- great coffee Montreal style 

Thank"}
{"text":"This was simply one of the best meals that I've ever had the best in Montreal. The food, service, and atmosphere were all perfect.  My partner and I split the charcuterie, the special veal entree, and the chomeur's pudding.  Our fantastic server suggested wonderful wine pairings and surprised us with a glass of sparkling wine at the end.  We had 6:30 reservations and that turned out to be the perfect time. If you're a first-time visitor to Montreal, it's located down the street (a number of blocks) from the orange line metro (Mont Royal)."}
{"text":"Great place for brunch! Stumbled upon this place grabbing macaroons down the street and this place was recommended by the girl who worked there. Thank you to her because it was a great meal :) 

Charcuterie plate to start was made in-house and was large (only 2 of us) and amazing! They even vacuum sealed up our left overs since we had already ordered our mains. Really appreciated that since we had a long drive back to Toronto. Followed that up with the bone-marrow pulled pork with toast and claimed it was one of the best brunch items he has ever eaten. I had the cheddar waffles topped with the same pulled pork. DELISH. I was told this was one of the most popular items and it did not disappoint. I would say both were very rich and could easily be shared if starting with something else. Cute, casual spot with some great drink offerings as well. If you are in this area, make a stop and you won't be disappointed!"}
{"text":"This is a gorgeous restaurant. It's exactly the style and decor I love: rustic tables and finishings with beautiful lighting and a gorgeous bar.

Speaking of the bar: we sat at it! The bartender was genuinely kind and knowledgable. We saw him making cocktails with fine detail to sieving juice and using great gin, so we asked why there was no cocktail menu? \"Because I hate making them - if you're having dinner, wine is the answer\". He laughed and so did we. I appreciate the honesty of the answer!!

For food - the apps blew us away. We had the lamb steamed bun, a riff on Momofoku's and arguably bolder, brighter flavours then their inspiration. The veal tartare was also lovely. Our mains were huge, too big to finish. I would have been happy with one more appetizer to share between us and that's it. Next time I go back, that will be my strategy."}
{"text":"I have been here at least 8 times and it's been great every time. Very solid menu and usually good service. I usually don't like brunch menus but they have some pretty interesting stuff for brunch as well."}
{"text":"This restaurant has been consistently solid in their service. The food has been delicious each time and they make excellent cocktails. The staff is friendly and make excellent suggestions.  I take all my out of town guests here."}
{"text":"Esta delicioso!!! Comimos los platos para compartir ... Meat lover y fue espectacular pero son abundantes y creo para tres personas puede funcionar perfecto.... Muy recomendable!!!!!"}
{"text":"Can't get a reservation at Pied Au Corchon? This place makes an excellent alternative! 

Fresh, well-executed dishes, manageable portions, and upscale rustic ambiance make this restaurant an good choice for out-of-town guests or (smallish) group dinners. Downsides include slowish service and a noisy dining experience.

My dinner was very tasty, and mostly worth the expense. I had the veal heart tartar, which was fresh and robust (though it could have used a pinch of something, I don't know what that something might have been). It came with thin fries, which are very thin, nicely cooked, and perfectly salted, and a finely sliced raw vegetable salad under a vinaigrette. For dessert, I shared the apple tarte for two. The tarte was nicely presented, and had slightly vinegared apple slices (a strange but unique addition) and a tiny scoop of apple sorbet (would have loved an entire dish of that!) on top as a garnish. It wasn't anything special, but it was nice and hot, with a nicely flakey crust.

Overall, as said, the place is worth the expense, and makes a great alternative to some of the more famous upscale restaurants in Le Plateau."}
{"text":"From start to finish, one of the top five meals I've ever had in my life. Great food, good service, neat décor, hip clientele. I can't wait to go back the next time I visit Montréal.

Edit: people keep mentioning the rabbit. I also had the rabbit!"}
{"text":"La Salle a Manger has a neat urban streetside cafe type of feel to it.  Very open type of feel with windows that open to the street giving it that feel that are streetside.  Service was good as you would expect.  The menu seems to change with the local ingredients which was nice.   

We started with the gravelax and the burratina.  Both very good and would recommend.  I admit that I probably didn't venture too bravely into the menu perhaps as I should.  There were 5 horse dishes including horse tartar and horse osso bucco.  As an american, I'm just not used to these types of dishes.  I think if I were to go back, I'd recommend you go in one of those directions.  I had the Salmon, which was quite good, but could have been prepared anywhere.  The cauliflower puree with heirloom tomatoes and peas however made the dish worthwhile.  

This restaurant was recommended by one of the servers at Liverpool.  I would certainly go back for another try next time we visit Montreal."}
{"text":"Nous sommes allés a la salle a manger après avoir lu les nombreuses critiques positives. Qu'elle déception!
Le cadre du restaurant est sympa, mais c'est extrêmement bruyant une fois la salle pleine. Au point d'être content d'avoir fini.
Côté carte celle ci est plutôt alléchante et donne l'eau a la bouche. La déception est du côté des assiettes. Le goût n'est pas la, ce n'est pas copieux, il va falloir recommander pour être rassasié.
Le service a bien commencé, serveur agréable. Mais une fois la salle pleine il devient difficilement accessible et a tendance a nous oublier.
La note finale sera l'addition. Digne d'un grand resto étoilé.

Pour résumer, vu les tarifs de la carte il y a bien mieux sur Montréal."}
{"text":"Went here for dinner last night, and it lived up to expectations. 

Had the beet/onion salad cold dish starter, which was light, fresh, and perfect for summer. Main course was rabbit leg / whole cauliflower / cauliflower purée / greens - meat was perfectly done, and the cauliflower was surprisingly tasty, which was different since I usually associate cauliflower with the overcooked soggy stuff you usually find in the 'mixed vegetable' tray at cafeterias. This was the opposite. Finished with a ridiculouslyyyy good cheese plate that came with puréed strawberries. Even the starter bread at this place was excellent (three kinds in the basket: raisin, sesame, white). 

While the food and wine (great selection!) were excellent, it was the service that really stood out in a class of its own. I felt like we had 4-5 personal servers, but not in a \"I'm just covering for your regular server while he's out for a smoke break\" kind of way. More of a \"we're all here as an incredibly attentive team, and are totally on the ball\" kind of way. And all this without being in your face or pushy. 

Maybe the decor could be a bit more interesting? Other than that, not much to say about this place that isn't positive. I would recommend it, especially for a nice dinner with a small group of friends."}
{"text":"I found this place to be overpriced and very average food. Not being a big meat eater, I was limited in my options, so I planned on having the mushroom risotto. The waitress then came to tell us they were all out, and that it had been replaced with gnocchi, but that the sauce would remain the same. I was very reluctant, but she assured me it was really good. It wasn't. I paid a good amount of money for something I could have made much better myself. The others at the table were also disappointed with their food (too much fat on one person's meat, a very small portion of meat on the others, clumpy soup, etc.). There are much better restaurants for the price, so I wouldn't recommend it for the food, although it did accommodate a large group well."}
{"text":"Everytime I come back here, there's some new twist to a dish I had before or some new additions to the menu, it's quite refreshing, and keeps it exciting :)

My one caveat is the place is really noisy, it seems like everyone is so loud, and sound just carries everywhere, and you have to talk loudly or lean in to speak... could be fun on a first date if you have to lean in closer to talk, ahem, smooth move...

the food is still amazing and very creative, and the dessert invites your inner child to the park, and says wanna play? and you say yesssss!!!"}
{"text":"Had a beautiful meal here. The staff were wonderful. Each course flowed well into each other with shared ingredients making the transition seamless.  Everything was very fresh and in season and each ingredient had a purpose and added something to the dish.  The only down for me was the environment which was a little informal for my taste and a little loud. I would love to see the same chef/concept in a slightly scaled up atmosphere. I guess I also felt the desserts were not as *special* as the other courses. The rest of the meal was outstanding though."}
{"text":"What a waste of time! I called in to see if they had Venison that day and the person who took my reservation confirmed that they did. I have had it there before and it was delicious so I wanted to take my friend from out of town. When we got there, they received my reservation but said that they had no Venison and didn't know why I was lied to. We ended up leaving the restaurant as that was such a pathetic experience!"}
{"text":"Great food from the bread to the main course!  Upscale but very casual, not pretentious at all."}
{"text":"I was there with my husband and a friend about two weeks ago, we heard a lot of good things about this place and decided to try it out.
When we got there, the restaurant seemed very casual, very Montreal style! We were sat down right away but were left by ourselves for at least 30-40 minutes without water or menu. When we were finally asked for what we wanted to drink, the waitress took 30 more minutes to bring us 2 beers and 1 soda. 
Some of the dishes on the menu were pretty good but some tasted really weird. I ordered the steamed asian style horse bun, the bun was under cooked and they put way too much sweet sauce. I asked the waitress if the bun was suppose to be gooey and wet (think about when you just mixed flour and water together to create a dough without cooking the dough), the waitress told me that's how they make it, the dough is streamed and it's not suppose to be solid (very disappointing). Finally, it we ordered a tartelette to share for dessert, it took them 45 minutes to serve us the dessert and the tartelette was SUPER sour.
Our favourite dish was an appetizer dish that our friend ordered \"Tempura style zucchini flower\" and the \"Salmon Tartar.\" 
I'm giving Salle a Manger only 3 stars because the service was really bad and the food was just so so with some interesting dishes on the menu."}
{"text":"Depuis quelques mois, la Salle à manger  offre le brunch les w-e. C'est peut-être l'un des grands secrets les mieux gardés à Montreal en ce moment. Wow. Une expérience magique... L'effiloché de lapin avec uf au plat gratiné et monté sur du pain grillé était exécuté à perfection. La petite salade toute fraîche de persil était la cerise sur le sundae! Le thé était bon même si je pense que le passage au thé en feuilles est un must (à bas les sachets de thé!). Service discret mais attentif, vraiment rien à redire. Et pas d'attente ridicule à l'entrée comme dans trop de restaurants pourris de brunch à Montréal. J'avais déjà visité la Salle à manger en soirée et bien que je me souvienne que la bouffe était bonne, l'effet n'était pas aussi intense que celui du brunch. Dépêchez-vous d'y aller avant que le secret ne soit révélé..."}
{"text":"I don't usually review any restaurants unless it is \"Exquisite\". This place has surpassed that. From the daily changing menu based on local demand, to the homey ambience, big wine selection list, they have exceeded expectations. This is by far the best French restaurant experience I have ever had. It's a package. The servers are amazing. Food enriches you and it goes beyond fulfillment. The lamb Tatare absolutely just melts in your mouth. Savour what I just said. Let this really sink in."}
{"text":"If all vegetarian dishes tasted like the ones we had here, I would turn Vegetarian.
(relax, that's not happening anytime soon)

If you're a real foodie and planning a trip to Montreal soon - this is a must. MUST.
In the plateau area (hip, trendy 'hood).

Ate horse. Horse tataki to be exact. It was yum.
The wine menu, the cocktail menu, the food menu, the wait staff - all amazing. 
Wonderful atmosphere (gorgeous lighting in case you care).

Even their bathrooms are stunning.

Love. Will go back."}
{"text":"Excellente ambiance, sans prétention mais rafiné, plats savoureux, bonne sélection de vins. Peu de restaurants nous donnent envie d'y retourner régulièrement, surtout sur l'avenue du Mont-Royal , mais la salle à manger passe le test."}
{"text":"Manifique! Outstanding! The highlight of our trip to Montreal.

Customer Service was spot on. We could only get reservations for the bar.  We sat, happily and ordered beverages. We were approached twice and asked if the situation was ok. We were just fine, no problem. They were not happy. If there was a possibility we could be given a table it was ours. A bit of shuffling, half a beverage later, we were seated at the perfect two top in the front window.

Moving on to the meal.

THE BEST CHARCUTERIE EVER. Changes daily, but ours had some beef, pig loin, pork shoulder, a pate, a liver and a rabbit (which we only found out was rabbit later) all to be enjoyed with a delicious (raisin? apricot?) bread, mustard, and pickled things. $17 a steal.

BEST CREAM ALE EVER some microbrew outside of Montreal? KILLED our local Ontario Cream Ales. 

My main was a fish, and decent. Not the star of the show. The SO had a steamed pulled pork and duck bun that he loved, but he could not stop raving out the housemade Kimchi on the side. He is Asian, and lived in asia and eats an alarming amount of kimchi... and still said it is the best he ever had. Boutique Kimchi. Amazing.  

The decor is \"Punched-tin-Slaughterhouse-chic\" with an glass walled walk-in and open kitchen. Specials on chalk boards if you can read French. Attentive, friendly, laid back servers. The women all effortlessly beautiful. 

If this restaurant was near my home it would be over. Honestly over. I would not go anywhere else. Cannot wait to go back to Montreal just for dinner here."}
{"text":"I wish that they spent the same amount of energy on the service as they did the decor.  The place is hip, the menu had my mouth watering, and the restaurant came highly-recommended.  However, we were there for 3 hours and NOT because we were enjoying everything.  Between each course we sat for 1/2 hour and once our main course arrived, we were ready to go home and still hungry!  In the end, the food is nicely done but it is more simple than necessary, particularly for the price.  The wine, on the other hand, was lovely.  Next time, I would just go for oysters and wine!"}
{"text":"Je lis depuis quelques années plusieurs excellents commentaires sur cet endroit, des revues qui m'ont mis l'eau à la bouche. Ma déception fût d'autant plus grande!  La qualité du service est un facteur déterminant entre une belle expérience et une triste aventure, ainsi l'air démoli à notre arrivée (et plus tard totalement nonchalent vers la fin de notre repas) de notre serveuse nous a foutu le cafard. Et même si nous étions tombés sur ''une mauvaise soirée'' pour le restaurant, il est impardonnable de servir des huîtres défraîchies (et trouées!) pour ensuite nous accuser de ne rien connaître en termes d'huîtres de Colombie-Britannique. (Et oui, les huîtres de l'Est sont fort supérieures) Bref, nous avons quitté avec le motton."}
{"text":"La Salle à Manger cumple a la perfección las características del restaurante de moda: decoración de diseño, servicio amistoso, ambiente relajado, materia prima de calidad y... precios por encima de la media.  

Fui el viernes pasado a cenar con mi marido y sin duda hicimos una buena elección. Aunque el local estaba lleno y no habíamos reservado, no tuvimos que esperar ni cinco minutos a que nos sentaran. El ambiente es informal y algo ruidoso, perfecto para lo que nosotros estábamos buscando. 

Como no teníamos mucha hambre, pedimos directamente los platos principales: un solomillo de ternera para mi marido y un confit de pato para mí, ambos un acierto. Hicimos bien en no tomar aperitivos porque los platos son muy generosos (y yo soy de buen comer, advierto). Tienen una buena selección de vinos aunque al final nos decantamos por tomar unas cervezas. 

Por último, vimos en la carta que sirven cochinillo bajo reserva para doce personas por $500, es decir, $40 por barba. Si algún día nos entra mucha nostalgia de un buen cochinillo segoviano y conseguimos convencer a otros diez, ¡lo mismo nos damos el lujo!"}
{"text":"Wonderful dinner here! Service is great and I would return. They use really fresh ingredients and it shows in the taste."}
{"text":"Excellent food and amazing staff. We shared a number of items 2 appetizers and 3 main dishes for 5 people. Plenty of food. The charcuterie plank was exceptional and the gnocchi and pork flank superb. No complaints and the waiter was extremely accommodating and patient with our poor French and three generations of taste Would definitely go again on another visit to Montreal."}
{"text":"I am not speaking in hyperbole this is my favorite restaurant in the world right now. Dominic the front of the house man is wonderful. If you can get Alex to be your sommelier all the better. Go here it is epic!"}
{"text":"Yum.... Came with a friend last Friday and was impressed.  Great laid back friendly service, and amazing food.  I had the salmon tartare with home-made chips~ close to perfection- some of the chips were dripping grease, but they were fresh:)...  I also had the warm vegetarian main- asparagus and fiddlehead salade-- wow, the flavours were a symphony in my mouth.  Very good and looking forward to when I can try more from their menu."}
{"text":"If I could give this place six stars, I would. Five of us dined there the other night, sharing about 10 dishes, all of which but one were home runs.

Highlights: 
- duck ravioli with fresh morels and foie gras - so great we got a second order. So many layers of umami in this dish, I could eat it every week and die a happy man.
- lamb tartare. Who's heard of such a thing? I wish we'd had the room to order another serving.
- grilled octopus with clams and lentils, and a strong hint of vanilla. The octopus was slightly over-charred, but the lentils were so unusual and and interesting, this was another home run for me.
- lobster salad with asparagus - the perfect dish of the moment (early June). 
- halibut sashimi with black bean purée. So fresh and perfectly simple.
- foie gras torchon with granny smith apple salad. What a perfect combination - could have been dessert. 
- the incredible charcuterie plate - something like 8 or 10 items, all healthy portions, for $16. (Shhhhh! Don't tell anyone - if too many people find out, they may raise the price.) All the charcuterie is housemade, and almost all the pâtés, terrines, rillettes, etc. distinct and delicious. Consensus favourite was the pork liver pâté.

The only disappointing dish was the stuffed duck leg - the only one we had from the Viande (mains) menu. The duck was kind of dry and underflavoured, and the foie gras side didn't quite make up for it.

The wine list: 90% French, intelligently chosen and with a lot of options in all price ranges. 

The service: extremely professional, smooth, friendly and knowledgeable, in both languages.

The room: a bit loud - lots of hard surfaces - but great design (love the Edison bulbs) and a really fun, boistrous vibe. The kind of place you could come to for after-work drinks and snacks at the bar, for dessert at the end of the night, or - as we did - for a full-on, all night dinner. This is my favourite kind of restaurant - bravo!"}
{"text":"Very good  food indeed! Second time there. Love the food, pretty good wine list, but VERY noisy. So I guess it depends how much you want to shout or listen... Worth trying, but with lots of energy and will to talk loud. Really delicious seasonal fare."}
{"text":"A total joke and rip off. First of all service is not really nice so it was not a good start. 
Then we ordered a \"cote de porc\" that came NOT cooked and totally pink and bleedy, are you serious??? this is a health hazard where you can get disease.
Don't get me wrong I think steak should be nice and saignant but PORC should be cooked all the way or at least if they want to serve it pink they should ask if we are ok with it. we returned it and got it back, some part were still pink...
I had risotto and it was too salty, small portion for $25
they did not even give us free desert or something...
Really expensive and will never return. I cant believe we were hungry leaving while spending so much money...shame on you salle a manger."}
{"text":"Food tasted good but had stomach ache both of us  afterwards.....don't whether it was the food or not"}
{"text":"Everyone I know raves abut this place but I find the food average and overpriced. The service is excellent and the ambience is higher-end casual."}
{"text":"The service was good and the wine selection is great .The food on the other hand was just ok 
i think it depends on what you order . i made the mistake of ordering salmon because while the flavour was good the portion was very small ,it was only half a salmon fillet !! for $26  
 i expected more . i was disappointed ..lucky the people i went with, ordered meat dishes and they were huge portions, enough to share, so i didn't leave hungry .. we had a good time but not sure if i'll be back ."}
{"text":"Superbe endroit chaleureux et convivial pour un souper entre amis ou en amoureux. La nourriture du terroir est à l'honneur et toute en saveur.

Le menu est inscrit sur une ardoise et change souvent. Nous avons pris le lapin pour 2 fourré au homard et servi avec papardelles (dans la sauce de homard), un vrai plat sublime et différent pour 50$ c'était très raisonnable ! Seul désagrément, nous avions choisi un vin rouge du Québec, et avons été très déçus par son goût 'sûrette', ne faites pas comme nous, demandez a goûter au préalable..

L'endroit était bondé, même vers 21h lors de notre arrivée, les gens ici mangent tard (les heures d'ouverture sont de 17h-12h). Il faut réserver d'avance pour les groupes et même pour de plus petites tablées.

Bon appétit !"}
{"text":"Franchement... Nous avons adorés !!!
Une ambiance chaleureuse, un service plein d'attention et une cuisine savoureuse avec explosion de saveur. Une très belle carte des vins même si globalement le ticket d'entrée reste élevé (pratiquement pas de vin à moins de 50$).

Nous avons opté pour un grand plat a partagé, plateau de la mer. Portion généreuse et de qualité. Explosion de saveurs en bouche accompagné d'un \"petit chemin\" (a 60$ tout de même.

Un souper en amoureux en tous points parfait grâce à un service bienveillant et de bons conseils. Nous nous sommes régalés à chaque bouché et complètement rassasié.

A refaire entre amis."}
{"text":"Absolutely amazing for a group of guys on a bachelor party looking for a great meal without the snooty white table cloth. Just great meat and seafood dishes with excellent liquor drinks. Great wine list but skip it unless you are ready to drop a lot because the more economic bottles (under 100) are not the best quality.  But great for large groups and many things you won't get in the states. Part of the best night of our trip! The staff treated us very well and were in top of all of our needs. Allow for atleast 2-3 hours for meal as you will want  many courses."}
{"text":"Nous sommes allés manger là à la suggestion d'une amie. Quelle belle surprise ! 

La nourriture y est excellente, le service ne se prend pas au sérieux mais est très bien et la sélection des vins, des importations privées, est très belle (et bonne !). 

Ils achètent une bête entière et fument eux-même leur viande. Les plats sont alléchants et les portions généreuses ! 

Les prix sont également corrects, dans la moyenne pour ce genre de nourriture. Mais comme les assiettes sont savoureuses et très grand formats, ça va !

Nous y retournerons certainement très bientôt. Vraiment, une belle découverte..."}
{"text":"Everything that the others have said is true. I do want to emphasize on the customer service. We had made reservations for 9:45 pm, but the place was still very crowded. Since we had to wait, the host gave my entire party a glass of this delicious white wine that I don't remember the name of. 

You must get the rabbit for your entree."}
{"text":"J'ai testé La Salle à Manger à l'occasion d'un brunch dominical. Par rapport à certains commerces de l'avenue du Mont Royal, il n'y a pas la queue, ça fait plaisir. Le décor est vraiment très joli, c'est aéré mais aussi chaleureux grâce aux luminaires.
J'ai pris les gaufres au poulet frit et salade de choux (14$), délicieux, même s'il manquait selon moi un filet de sirop d'érable en plus. Par contre, la portion n'est pas très généreuse. Pour certains, cela permettra de craquer sur un dessert, mais de mon côté j'aurai préféré être plus calée.
J'ai également pris un grand verre de jus d'orange frais, que j'ai trouvé un peu petit pour 6$.
En résumé, un endroit charmant avec une très bonne cuisine, mais à réserver aux appétits modérés."}
{"text":"sets my heart a flutter

La Salle À Manger is a true gem.  I loved everything about it.  I loved the location.  I loved the logo.  I loved the interior.  I loved our waiter. I loved the food.

It has been a while since I felt this much love.

I'll break it down, because amazingness like this deserves to be broken down.

The service was impeccable.  Rumour has it that they are always setting the bar for fantastic service.  Attentive, responsive, and friendly without being overbarring.  

The restaurant itself is a delightful mix of raw and refined.  Hanging lights, worn and industrial finishes, and beautiful wood tables.  It's my favourite type of venue, chic but laid-back.  No in your face frills or gimmicky garnishes.  Noteworthy is the glass encased room at the back where meat hangs.  That's badass, especially because La Salle will serve you the whole animal (suckling pig for 12 people at $500).  The night I went they were offering a royal rabbit.  No, there were no bunnies hanging.

Now that you have sense of what it feels like to dine at La Salle, let me tell you what it will taste like.  It will taste like intimacy on a plate.  Simple presentation, but deep flavours.

Their menu changes so what I'm about to tell you may no longer matter.  But read between the dishes.

The salmon tartar (small $15) comes on a wood slab with homemade chips and a salad/slaw.  The tartar was fresh, light and creamy.  The chips were fried to perfection and their greens were bonkers.  It was a simple mix of vegetables but tasted so complex with its different textures and the flavourful vinaigrette.

The trio of brioche or foccacia (I no longer remember) was my favourite: gravlax, proscuitto, and lobster.  Each was distinctly different, but worked together.  I savoured every bite.

For the mains I opted for the veal pappardelle, while my sister had the pork belly with lobster.  

Everything on our plates was amazing.  La Salle does rich and relevant - only what needs to be there is there, and it all comes together in perfect harmony leaving you happily full.

What's more, my sources (and they are a vicious bunch who will tear a restaurant apart for one mistake) keep going back.  Repeat visits are the greatest compliment to any establishment, and the great ones know to thank us for it by being consistent. 

Skip the 'be seen be heard' restos like Au Pied and give your love to La Salle, he'll love you back."}
{"text":"Fresh ingredients, small menu and up to date. Friendly staff, good beer. 

The cooking wasn't exceptional but decent. Our m'est was too cooked, a bit dry. But the explanation was the Québécois like the meat well-done, really though? 

Nice interior.

Good for brunch."}
{"text":"I'm a vegetarian and normally prefer hole-in-the-wall ethnic restaurants, but I was in Montreal, so wanted to eat French. But I know French food is not generally vegetarian friendly, so searched for one that was and chose this one for that reason and because folks seem to love it. But I didn't. 

I started with a tomato salad, the only non-meat appetizer of any sort. It was pretty good, especially the herbs sprinkled throughout, but they served it on a small cutting board for some reason, which was just plain stupid. I had to try extra hard not to have it fall into my lap or get balsamic vinegar everywhere.

There were three vegetarian entrees -- a pasta, a vegetable plate, and a tomato tart. The tart sounded most interesting and French, so I ordered that. It took forever to come and when it did it looked like some poorly executed \"artisinal\" pizza you'd get at a mall Italian restaurant trying to go uptown. It tasted better than that, but not by much. It wasn't a tart as I'd define one. It was a piece of poorly done crust, with some tomatoes and cheese, and a few greens, thrown on top, and probably put in the broiler for a minute.

Shortly before my tart came, the restaurant sat another couple right beside me with only about a foot separating our tables even though the restaurant was mostly empty. It made the rest of the night uncomfortable for me as a solo diner. I doubt the couple liked it either. When I finished my meal, I asked for my check, waited forever, read about 20 pages of a book without anyone paying any attention to me, and then had to flag someone down to ask again.

The music -- early Stones and T-Rex -- was the best part of the restaurant, which is pretty sad."}
{"text":"Surprised about some of the comments regarding the service. We thought that the service was excellent. We did arrive around 6pm though, before it got terribly busy. 

The food was excellent. We got one of the daily special combos for 2, which came with rabbit, paella, seafood and veggies. It was a huge portion, and cooked very well. Lots of variety. Also tried the tacos, which were good too. 

I liked the atmosphere.... definitely more on the casual side (not snooty or anything like that)

Will definitely return if I'm in the area. It was one of our favorite meals in Montreal"}
{"text":"Ah-mazing perfect brunch with zero wait. Shorter menu, but I didn't feel like anything was missing. Modern, totally Instagram-able interior. A+ friendly and knowledgeable staff, willing to make substitutions to the menu to accommodate a specific request. A couple different mimosas to choose from, both perfect with fresh fruit juice. Latte was perfect, I could have had them all day. Would definitely go back."}
{"text":"My favourite stop on my first trip to Montreal for F1 weekend. (Included au pied de cochon, l'express, lemeac)

Between 3 of us, we split 12 oysters, horse carpaccio, popcorn sweetbreads, asparagus salad, rabbit taco's & then finished with 12 more fresh oysters.
For dessert , I tapped out but the other 2 had the mousse and chocolate tart.

Service was fantastic, great mix of explaining what we needed to know, not bothering us too much and bringing out food as soon as our prior dishes were finished. Oysters were so fresh, horse carpaccio flavourful & sweetbreads crispy and light. Rabbit cooked to perfection, and just melt in your mouth wonderful.

The space is cozy, but definitely roomier than a place like au pied. But honestly just 0 complaints. Just want to reiterate how good the service was, their recommendations were spot on and helping us translate the chalkboard was definitely appreciated! Nothing stuck up or stuffy about this place at all, just come in and enjoy this great food."}
{"text":"2nd fancy place I hit up on my weekend trip to the MTL.  Great ambiance.  Dimly lit room.  Loud but didn't have to yell across the table to have a conversation.  Menu on a giant chalkboard was a great touch.  Started out with the deer carpaccio and foie gras au torchon which was out of this world.  Rabbit for the main course lived up to its hype.  A definite place to check out for any tourist or habitant"}
{"text":"We came here in with no expectation, wanting to go to Au Pied de Cochon, but it was closed since it was Monday.  So we found this place by Googling \"Alternative to Au Pied de Cochon.\"  

This is a modern interpretation of a neighborhood bistro in the hip Plateau Mont Royal area.  We had one of the best venison steak ever, and the rabbit leg was delicious.  Staff was very friendly and helpful.  We felt comfortable and welcome with our 4 yr old daughter in tow."}
{"text":"Terrific seafood, rabbit and salads. And abundant horse preparations we didn't sample. The server dress code is funky yet their skills and efficiency are exemplary."}
{"text":"We randomly stopped in here, looking for a place for dinner open late.  So glad we did!  The foie gras stuffed Cornish game hen was beyond fantastic, and the chocolate tart with caramel and orange marmalade was perfect. My sister had the rabbit and loved it.  The best meal I've had in Montreal so far."}
{"text":"Très bon brunch. Service attentionné et de bons conseils. Menus proposant des plats selon les arrivage de saison."}
{"text":"Although it's pricey, every time I come here I have a great time. They have 2 group services, 1 at 6 and 1 at 9. Which is why the restaurant is ALWAYS full, at the weirdest times (9:30 on a Monday night, for example). If you don't have reservations, get ready to sit at the bar (even though you call an hour or two in advance and they assure you they have a table for your dinner for 2). I spent over 175 for 2, but we had oysters and salmon tartar as appetizers, and cocktails. Certainly not a place you go to when you're on a strict budget. The only disappointment was with my boyfriend's salmon (which was pretty standard and kind of boring). My meals have always been delicious. And their plates for 2 (specials they generally put up on the blackboards) are over priced in my opinion! But I'm sure they're delicious."}
{"text":"Very ordinary. Very. Very. Very. Blackboard and chalk. Over priced wine. Plain French food. Try something else if you're trying to impress someone. If you go here... You might not get a second date;)"}
{"text":"Worst service and meal I've had in a long time. We were a large group but it is no excuse to have to wait over an hour to get the bottle of wine that I ordered. When it arrived I had to turn it away because it was AWFUL. I ordered a bourbon instead and that took another 20 minutes to arrive. 

So almost 2 hours in and I hadn't even ordered yet. When the food finally arrived an hour later, I was not impressed. The place was way too bright, I felt in a cafeteria. My bill was around $100 alone for an appetizer, a main and two drinks. Way overpriced for a mediocre place and brutal service."}
{"text":"I came here with my boyfriend and sat at the bar because it was so busy, but it was worth it! We split the delicious vegetable tart--lots of fresh vegetables, huge portions. The bartender serving us was so sweet, I'd definitely go back just to see her again. She made a really refreshing basil cucumber cocktail. Their music and ambience are really cool and welcoming."}
{"text":"Farm to table fine dining recommended by locals. It has casual elegance that you expect from a country inn.  The food, service and decor all shine.

The menu shifts frequently depending upon what's available and the wine list is expansive.  Meals are presented like edible art with drizzled sauces and garnishes.  The bread and butter are perfect.

Service was always attentive but not intrusive.  Overall, a very comfortable place."}
{"text":"Hit or miss. Been there 3 or 4 times over recent years. Had great food and average food, great service and bad service. The menu is creative and the plates to share are have a wow factor.

One time Justin Trudeau was there, occupying the better part of the restaurant with his group. Despite grabbing most of the attention, we still had a reasonable service and food at our smaller table.

But on my last visit, we left after 20 minutes of being seated and nobody taking our order. It's too bad because I don't feel like risking having a bad time when I'm about to spend $150+ for two. 

Don't think I will be coming back."}
{"text":"Nous avons choisi ce lieu pour faire notre repas de Noël d'entreprise cette année et plusieurs déception sont venues gâcher notre expérience.
Tout d'abord, le restaurant à l'air de miser sur la quantité de nourriture afin de donner une impression de bien-manger à ces clients. C'est pour ça que nous avons vu un plat s'insérer entre l'entrée et le plat principal. Celui-ci était très copieux voir trop et a empêcher une partie des convives à apprécier à sa juste valeur le plat principal, ce qui était bien malheureux.
Deuxième point négatif, et non des moindres, les allergies alimentaires qui ont été signalées lors de la réservation n'ont pas été prises en compte le soir même. Heureusement, pas de drame, mais cela laisse un peu un goût amer sur l'organisation.
Pour finir, le dessert n'a pas du tout été à la hauteur du reste du repas. De la glace presque liquide a été servi sur un plateau à partager en bois (c'est de le concept du restaurant), soit aurait-il fallu la servir vraiment glacée soit dans des bols individuels pour nous éviter un service personnel laborieux du à la liquidité de la glace.
Bref, la qualité est bonne mais ces différents éléments font que je n'ai pas apprécié l'expérience et que je n'y retournerais pas."}
{"text":"Looking for a spot to brunch on Mont Royal Street on a beautiful day can be daunting; there are lines everywhere! Having heard of Salle à Manger years ago, seeing that most acclaimed Montreal chefs have somehow all passed through its kitchen, it's been on my to do list for a while so a  friend and I decided to check out their brunch menu. If you have oysters and mimosas on your brunch menu, I like you already! 

The space is very laid-back, nicely laid out with a long bar, comfortable seating, and a bright open space. We started off our brunch with some lucky lime oysters and mimosas; both were perfect! My brunch plate consisted of Nordic shrimp Benedict over zucchini and perfect crusty bread, with a side order of salad and fried potatoes. The eggs were slightly overdone but I couldn't care less cause overall, the dish was super yummy, great flavours and textures. 

The service was a little off as no one came to see us after serving us our meal so we were perplexed about \"how do I pay for my meal\" before we decided to get up and just make our way to the cash..

Overall, the food was great, the space is nice, and I thoroughly enjoyed the vibe even though the service was a little meh; would be interested in trying the dinner menu as that looks more than interesting .."}
{"text":"My girlfriend and I went to La Salle because she wanted \"French Cuisine\" and with all the raving reviews, I decided to take her here. A lot of people say that reservations is a must, therefore we called and placed a reservation. We thought we were making a reservation for a table (the person on the phone didn't really speak fluent English), but when we got there, it was actually a reservation for 2 seats at the bar since the whole place was booked. While we're already there, we might as well try it out.

After being seated at the bar, we were given a menu and my girlfriend decide to go with the pork chops and I decided to go for the rabbit leg (a.k.a. Plat) since a lot of Yelpers say it's amazing. As for appetizer, we ordered the Foie Gras. After about 15 minutes, we were offered bread, and I don't know if it was because I was hungry, but damn, those bread with butter were darn good.

Anyways, even after 10 minutes of waiting, our server did not come and take our order. We waited and waited...after another 5 minutes, our server finally came and took our order. The appetizer came 10 minutes after we ordered, it looked like a piece of steak on top of bread. When we dug our fork in, boy was I wrong. The texture of the Foie Gras (Pork/duck liver) was like jello, or some kind of gelatinous piece of meat. I took my first bite, and it was okay, the taste was creamy and gamey. My girlfriend didn't like it much and I probably won't order it again.

The entrees arrived probably 15 minutes after we finished our appetizer. The rabbit leg was smaller than I expected, but boy was it good with the bacon and mash potatoes! If you order this dish, definitely take a bit of rabbit, bacon and mash potato and eat it all at once...it's like an explosion in your mouth with the sauce! Although, I must say that if I was blindfolded and given a taste test of rabbit's leg and chicken, I probably won't be able to tell the difference.

I also tried a bit of my girlfriend's pork chop, it had great taste and texture!

After finishing our entree, we had to wait a long long time for someone to take away our plates and even longer to get our check! We waited probably a good 20 minutes before the owner (I think) came over and asked us how our dinner was and went to the server and told him to give us our check. 

Overall, the food was pretty good and I would come back and try other entrees. The Foie Gras is definitely a love or hate thing, for me, the texture was a turn off. As for the service, I know it was busy, but I hate it when restaurants treat me unequally, mostly because I look like a kid. I can't really blame them, because A LOT of restaurants treat me this way. But, I must say, I have to deduct a point because of the horrible service. If you want to come here, definitely make a reservation a day in advance or so. The food is definitely a bit pricey, don't expect to drop down anything less than 50$ for 2 people."}
{"text":"Our brunch experience here wasn't bad. I got the pork chop and my friend got the \"egg Benny\". 
I liked their creativity, instead of using English muffin, the poached eggs were sitting on two pieces of fried pork croquette. The combination got a great texture differences and it was quite an unique taste. However, it got greasy in the end of the dish and my friend couldn't even finish it. 
For the port chop, they were good, got a good presentation, however, the portion size was on the small side. 
This is a nice French restaurant on the week days, and their brunch was decent. They got nice decor and atmosphere. However, their brunch wasn't top notch and on the expensive side with small portion sizes($17 for one dish)"}
{"text":"So good here! Big and open, sunny and warm, this place is really comfortable and fun. I've been here twice, once for an anniversary dinner, and once with another couple. While there are a number of private tables, our four-top was actually an eight-top that we shared with another party. But the high ceilings and great light-- maybe, I don't really know -- made it so our neighbours didn't make us feel uncomfortable or crowded. Instead, it just felt really fun and relaxed. It also helps that everyone in the place is young and beautiful. This place has an amazing vibe with a great wine list and a beautiful hanging light-bulb lit bar. The decor is definitely reminiscent of Au Pied du Cochon, but it's more open and not as dark, and less tables makes it less crowded. 

The food was incredible. I've had beet salad with manchego cheese and pecans-- a dish I've attempted at home numerous times since. It was served on a narrow and long slab of wood-- it was pretty but made keeping everything off the table a little difficult. Maybe a little gimmicky. The venison carpaccio was beautiful and delicious-- although as other reviewers have pointed out, it really could ditch the mayo sauce.  My first experience with gnocchi was at this place. And although the creamy sauce was a bit rich for me, I've since craved it many times. The blood sausage was perfectly crumbly and buttery. The pork belly was crispy-- and had the melt in your mouth fattiness that tastes so good it's sooo worth the bad things it does to your arteries. I love meat-- one of those people who can't be friends with someone who orders a filet well-done-- and this place does pork and game right. The portions are quite generous, I've never been able to finish my mains. Accordingly, I can't comment on the desserts as I've never tried any. It's pricey, but nothing you wouldn't expect to pay for such bistro fare. 

My only complaint with the place is that they didn't put enough cassis in my Kir. Also, while I found the view of the racks of animal carcasses in the back comforting and cool, it may make some squeamish, I guess."}
{"text":"Love the vibe and ambiance in this restaurant!
We ordered the charcuterie board (large was $22) which was very meat intense (see photos). We were expecting some cheese on this board but there was none. I felt there should have been something to compliment all the meat.
We dined at the bar which was nice though the chair will make you feel like a fat a$$ as the handles 'hug' you.
Cocktails are freshly made and you can watch the bartender make them as you sit at the bar.
The complimentary bread is amazing (I believe it's a sourdough) its light and fluffy so definitely ask for seconds!"}
{"text":"I was craving rabbit so I Googled \"eat rabbit Montreal\" and La Salle à Manger popped up.  

My friend and I were like let's go! Got a street parking right in front of the resto.  There were 2 rabbit dishes on the menu and we ordered both.  One is pulled rabbit on perogies and the other was a leg of rabbit on a bed of lentils and home made thick cut bacon bits.  The pulled rabbit was sooooooo good, too bad it's only entree sized!!! The meat was so tender and juicy and the perogies pan fried to a crisp with scallions and sour cream topping.  Amazing. 

My rabbit leg was nicely grilled a touch dry in some places but definitely satisfied my craving.  The bed of lentils had many surprises in it.  I couldn't eat all the lentils but I painstakingly fished out every single bacon bit I could find. Yes, it's that good."}
{"text":"It was our last meal in Montreal and probably the best.  Service was excellent. Very friendly and helpful. Especially helpful when describing the different kinds of beer and wine they had available. 

Started with the venison carpaccio which we enjoyed.  I had the rabbit leg which was served with farro, carrots and cauliflower. The rabbit was very juicy and the broth it was in was so delicious. I could have just had the broth and some bread. Btw- the bread is also very good. My husband had the venison steak which was also delicious. 

Everything about this place was great. We had dinner at Au Pied de Cochon a few nights before, and while we really enjoyed our meal there, I think this place is better. I wish we had gone here earlier during our trip so we could have gone multiple times!"}
{"text":"The poor bunny never had a chance.

He must have innocently popped his head up from his hole at precisely the wrong moment.   The blunt force of the bullet or poison dart or whatever they used must have instantly rendered him unconscious and quickly drained the life from his furry white body.

God only knows how the couriers-de-bois managed to sweep his lifeless carcass from the woods of the townships to the heart of the plateau with furious speed and medical accuracy.    I think that the body was still deliciously warm when he arrived on our stunning table.

He arrived de-furred and sans-le-tete but otherwise quite whole in the center of our dining area.   The staff quickly and clearly disemboweled the creature and portioned the useable meat into distinct sections for each of the four of us. This was served over a delightfully fresh mix of vegetables and potato-based mash.   This rabbit did not die in vain.

The name \"La Salle A Manger\" may be better expressed as \"Le Plancher D'Abattage\", but if you're a carnivore you're in for a treat. The wine list is outstanding.  The service is exceptional.  The crowd is gorgeous.  The ambiance is slaughterhouse-chic.  

A wonderful place to explore.   Worth every shot."}
{"text":"We had a fantastic meal here on a sleepy and blustery Wednesday evening.  We scoured the area for a place that could provide my veggie gal with an option beyond hot cheese, and this menu was really interesting (plus bilingual - merci!).  We trekked in right after they opened and were the only customers for about 20 minutes.  The server was very friendly, worked with our pidgin french, explained some of the special items, and suggested some options to my veggie gal.  She enjoyed an excellent salad and a few small wedges of cheese (mission partly accomplished!)

Things really started to line up for me when I spied an item on the wine list that seemed to indicate a sparkling honey wine (which is something I have been homebrewing for a few years).  Our server confirmed it was a dry, sparkling raspberry infused hydromel (mead/honey wine) but that she thought that they were out.  She went in the back and dug around, and came up with the last bottle, the empty vessel of which is now on my mantelpiece.  

From there my evening just got better.  I opted for the coppa steak, which roasted veggies and a nice mashed potato base, plus some amendments.  Now, coppa is a type of cured meat usually sold by the thin slice, so to come up with a steak was just ridiculous.  This glorious plate of awesomeness came out and melded with the hydromel into this fusion of late summer, autumn and the coming winter on my palate - it was a truly epic experience.  The essence of farm to table, and a testament to the effort put into this restaurant by the meal planners, purveyors, chef and serving staff.  To translate the work put into growing good veggies and meat seamlessly through a designed dish, prepped by a chef on a slow night, and delivering a well laid out dish is the goal, and they totally nailed it.  

Our dessert was another high wire act, and a really interesting way to end the meal.  Pavlova: house meringue cookies, a mango beer reduction and firm thin slices of a nice pear was a totally unique palate, if a tad sweet for our personal tastes. Still, well conceived, sourced and executed again.  

By this point our eyes were spinning in our heads, and a few other folks had entered to enjoy this excellent fare, and we wobbled off into the blustery night, fortified for the weather. Thanks for being a real highlight of our time in this great neighborhood, in this fair city!"}
{"text":"I came here at the recommendation of a friend after being unable to secure a reservation at Au Pied de Cochon for my last night in Montreal, I'm pretty happy about this choice.
As I came with a large group, I had the chance to sample almost every item on the menu.  The seafood appetizer platter is a good choice, you get to sample 4 kinds raw seafood: the oysters were delightful, halibut crudo had the right amount of sweet and spicy taste, and the lobster bisque surprised me as to how good lobster bisque can be when done right (the previous one I've tried was so awful I did not take more than a bite).  Out of the main courses tried, I liked my selection of the rabbit leg: it was very tender, with a great sauce, and served with kohlrabi and snap pea salad.  BF's dish came with 2 huge fried braised beef ravioli, with side of 2 foie gras medallions, == decadent.
One mishap with the service was that the waitress had forgotten about a friend's order of steak tartare, she apologized profusely and brought the dish within 5 minutes.  Other than that, service was everything you could ask for.
Apparently celebrities like this place too.  The people in my party recognized 2 men sitting behind our table as 2 Quebec stars, I have no clue who they are."}
{"text":"I am a restauranteur myself and an avid foodie and I simply can't rave enough about La Salle A Manger.  I have been several times myself, and sent my Culinary Director here who agreed that it is better than more famous Montreal restaurants.  Where to start? 

SERVICE: these people simply know how to do it.  I've been on a few dates, and they have the intimate service concept down pat with clear explanations of menu items including explanations of how they cook and prepare things.  The knowledge of each and every server is impressive.  This past weekend, they hosted my brother's bachelor party for 14 guys. We were supposed to sit at 10:30 but they weren't ready until 10:45, so they offered us beer tastings and an oyster.  I requested that they just \"do it up\" and they offered me 2 different \"freestyle\" menus at $55 per person or $70 per person.  They were fun and added to the party. At that late hour, we were seated by the open garage door window on a beautiful night. They brought out piles of food family style, explained what everything was, and coupled each course with a wine choice of good and reasonable or great and special.  Both in the date setting and this one, they readily shared their local knowledge of the city, recommending brunch places, bars to go to afterwards, things to do--it was just fabulous. 

FOOD: it's even better.  There's always an eclectic filet on the menu--venison, moose, beef, horse, you never know. The halibut ceviche is so good I actually dreamed bout it.  The charcuteries, rillettes and pates are fantastic and served with the perfect pickled complements.  Even the bread has subtle flavors of pistachios and dried fruit.  I am a local meat-atarian and I can tell you these people do meat as well as anybody.  The salads have light, tart dressings that are the perfect finish to the richer foods. The potatoes are perfectly spiced and cooked, the polenta is creamy and finely textured.  The rabbit for two is slow food at its best.  The desserts aren't just sweet bites, they are well thought-out flavor combinations. 

ATMOSPHERE: They have hit the nail on the head. It's a classy casual atmosphere. You don't feel like you have to dress up but you don't feel out of place if you do. The specials are written all over the restaurant on chalkboards. The bar is great and the bartender is knowledgeable. We hung out there and had espressos after dinner once the place had emtied out and honestly could have stayed another hour.  The open garage door makes you feel part of the neighborhood. There's definitely a bit of a din, which was good on the date nights so you didn't feel the need to whisper. 

Bottom line, this place is just awesome.  Check out the Reservoir too (especially for brunch in the fall, winter and spring only), it's owned by the same chef. Do not miss out on La Salle A Manger!"}
{"text":"Enjoyed this restaurant a lot - food was excellent, and the friendly service plus the casual ambiance made the whole experience even more enjoyable. We had a dozen oysters (all PEI and all incredibly fresh), a charcuterie plate (large) - which featured pate and head cheese (both excellent), as well as other meats, and then shared an entree of clams, snails, and bone marrow over a potato tart. PLENTY of food for 2 people. The restaurant was smaller than I expected,and also features a long counter where people can also be seated."}
{"text":"Perhaps my favorite \"fancy\" restaurant while in Montreal.

Couple things to keep in mind while eating here. They have a big chalkboard with the specials in plain view. I recommend you get the stuff off of there!

We had the rabbit. Oh man, loved the rabbit. It is a HUGE portion, though. So definitely you should only order this and MAYBE an appetizer if two people are eating here.

The mashed potato thingy with blood sausage and other things...was good. It's another HUGE portion! This, and a special is way too much for two people, maybe enough for 4!

The chautrucie board was pretty good. Not as amazing as people make it out to be, unless you like pates. If you like pate a lot then you might really love it. I don't, so not my thing...

The apple pie was delish! Yum Yum Yum! =) We got the last one of these and the last rabbits...which means...pay attention to the board, order it early, cause otherwise it will fall off the menu!

AMAZING customer service here!"}
{"text":"This place has become popular but just like many other sad cases the quality has gone down into the drain.

First ignore the photo of the beet salad I took a year or two ago, the one you get now has one tenth of beet in it.

The risotto was way undercooked. 

The salmon dish has a tiny strip of salmon. It should be called black bean with fish topping.

Not enough staff to handle the amount of people. Not their fault, but in compromises the experience.

Well let me correct myself there actually are a few guys working at the bar and just chatting, one waitress serving every table. Brewery tradition? Whatever."}
{"text":"I was in Montreal for a bachelor party this past weekend and we had some trouble finding a restaurant that could accommodate our group on short notice. La Salle a Manger had no problem taking our reservation and damn did they deliver. I can honestly say that I cannot imagine the meal going any better. From start to finish everybody was more than hospitable and the food was outrageously good. I eat out frequently in New York, and this restaurant's service, hospitality, food, and value would rival the best of them.  When I made the reservation through Amex I was only told that it was a price fix. I had no idea what I was in for when we went, but each course was outstandingly delicious, and everything on the table was the highest quality. They brought us out so much food that you couldn't even see the table. A buddy of mine is a vegetarian and I've never seen a restaurant be more accommodating. For each course they brought out a different, equally as delicious course for him. They went out of their way to make sure he did not feel excluded at a meat centric restaurant. Next time I'm in Montreal I am 100% going back."}
{"text":"Last night we enjoyed one of the best meals we have ever eaten in Montreal. We started with salmon crudo appetizer and a bowl of the chilled asparagus soup with nordic shrimp. Both were absolutely delicious. We paired this with a Hill Farmstead Dorthy Pale Ale. Just when we thought the meal could not get any better the main courses arrived. The expertly prepared Turbot served with a light cream sauce was incredible. The fish was melt in your mouth delicious. The Lobster dish with grilled/smoked asparagus and a spicy mayonnaise was delicious as well. Patrick, their resident beer expert, suggested we have the Brasserie Dupont Cervesia which we absolutely loved. Our server Veronic, was friendly knowledgeable, attentive and passionate about food."}
{"text":"Try the tagliatelle with seafood. The pasta cooking point and the seasoning is superb! Excellent crew attention. Great place!"}
{"text":"Clairement une déception, le nom du lieu laisse penser qu'il sera convivial et bon enfant. Première erreur, dès l'accueil et les premiers contacts on sent un service qui veut y donner un genre assez guindé ! Pourtant la place est tellement bruyante qu'on aspire à plus de camaraderie sans plus de fioriture.
Malheureusement la nourriture ne relève pas l'expérience, le rapport qualité/prix n'est pas en faveur du consommateur. Une cuisine qui a un goût de trop peu et reflète tellement pas son côté \"salle à manger\" revendiqué, mais surtout dont le goût n'est absolument pas à la hauteur de son prix.
À noter une belle sélection de boisson par contre, finalement on pourrait en faire un bar \"La salle à boire\" ?"}
{"text":"This was a great place to have stumbled upon. We had passed by earlier on our way to breakfast, but hadn't really looked at the menu then. We got out of our place late, so we already knew our dining options were limited. We passed other restaurants, but weren't feeling their menus. When we came upon Salle Manger, both me and my sister wanted to eat here. Out of all the food we've had in Montreal thus far, the food here at salle Manger definitely ranks at the top. She had the foie gras stuffed game hen, and I had the roasted rabbit leg with stuffed squash ravioli. I was expecting the ravioli to be stuffed with butternut, but the acorn squash was a revelation. The simple sauce was the right amount of acid, and smooth. The rabbit juicy and tender and perfectly cooked. I enjoyed it immensely.
Apparently the game hen was excellent as well.
We asked the waitress to reccomend a dessert, which she reccommended the chocolate tarte (with a layer of caramel and a dollop of Orange marmalade on top). This dessert was outstanding! The chocolate smooth and creamy. The tart shell thin, but supportive. The dark caramel was the perfect accompaniment and the Orange marmalade...well...if you're expecting something sweet, this was not. The Orange was soft, with just the right amount of citrus, and very slightly sweet.

All in all, we will be making another stop here before we fly out."}
{"text":"More precisely 4.9

Had a fabulous dinner experience there, sitting at the bar (probably the best places in the restaurant in fact): the waiter takes care of you, suggests good wines, explains to you how the restaurant was created, how the menus are re-thought every day etc.

Food was really good!!! fresh, good ingredients. From the bar, you can even see cookers, all super friendly guys who really seem to love what they do. You would think you are on Iron Chief on Food Channel, watching them preparing so great things!

Why not a whole 5? Veal in vineto starter was a little bit too chewy (why not adding one slice of red tunna instead of 3 veal slices?); food portions for (a very) big guy can be a little bit too small (and finally, I have a 5 star restaurant in Montréal, unbeaten so far)"}
{"text":"La première fois que j'y suis allée, je voulais mettre 5 étoiles, illico presto. J'avais adoré mon expérience et mon tartare de saumon et ce, même si celle d'une de mes copines avait été plutôt malheureuse avec un plat carrément immangeable, car trop salé. La cuisine avait acquiescé et offert un dessert à partager à notre tablée de cinq, pour se faire pardonner. J'étais donc plus qu'impressionnée et ravie de la tournure qu'avaient pris les choses.

C'est donc avec enthousiasme que j'y suis retournée avec un ami. QUELLE ERREUR ! 
Tout d'abord, le service a été terriblement long. Pas moins de 30 minutes d'attente pour que notre commande soit prise alors que la salle était vide ! Arrive enfin le lapin de mon ami. On ne va pas se le cacher, l'attente  (+ 30 minutes) en valait la peine, c'était un délice... alors pourrait-on m'expliquer ce qu'il s'est-il passé avec ma salade de homard ?  Parasitée de sel, elle n'était pas immangeable, mais complètement INFECTE. Même mon ami, à l'estomac bien accroché, a recraché le peu qu'il a osé goûter. La serveuse informée, elle insiste pour me proposer une autre salade. Je suis certes agacée, mais vu son insistance, j'accepte et demande à ce qu'elle ne soit pas assaisonnée. Ni une, ni deux, me revoici avec une salade, végétarienne cette fois-ci. La serveuse me spécifie que le chef n'a pas mis de sel. LA BLAGUE ! Certes il n'y a pas de sel, mais c'est dans du VINAIGRE que la salade est noyée cette fois-ci !

Si j'y retourne ? Avec une telle divergence de qualité d'un plat à un autre, durant un même service, SÛREMENT PAS."}
{"text":"If you like interesting food that tastes as good as it looks, this is the place to go.  There's nothing boring on the menu, they usually have daily specials as well as sharing specials.  The presentation is excellent, the atmosphere is fun, and the food is even better."}
{"text":"I'd heard this place was hit or miss. Luckily for me last weekend it was a hit.

Group of friends gathered to celebrate with cocktails, wine and supper.
The space is very sparse and unassuming. A bit too much for my tastes, but it works for the location. Oysters on the half shell appetizers were good. Sauteed scallops with a balsamic vinaigrette were cooked to perfection.

Great place for \"scenery\" on a Saturday night."}
{"text":"We went to try this place out on my birthday, in part because it was one of the few places we could find open on a Monday.

While the service was pleasant enough, the ambiance is very low key and the decor super simple. These are the kinds of things I notice when the bill for two is over $200... I want a little more from the staff. Describe the wine to me. Suggest some dishes. 

The portions were copious, and they came out super slowly. That meant that b bathe time our mains arrived, we felt full and took most of it to go. Now here's the cool part - they don't give you a standard doggy bag. We got our meals packaged in sous vide bags. 

The menu changes often, and it's a great place to check out if you want to try new things, but beware the huge portions (I would have been happy sharing three starters with my husband and having room for dessert) and the ridiculous wait."}
{"text":"love this place one of the best meals i had in Montreal, the rabbit risotto for two was so generous and refined. I know met the chef from doing volunteering at the food lab his such a funny and nice guy makes you understand his creativity and hard work."}
{"text":"A tiny menu, yet consistent of classics with which you can't go wrong. Burgers+Breakfast foods as such. I am in love with the scenery and will forever aspire to make my living space in suit of this aesthetic. Also, hot employees"}
{"text":"I love the food here, and I definitely have brought a few special people here just because I really think this is a gem. My only issue is that for how pricey this place is, the staff aren't always that friendly. My first time there, my partner and I were ignored for the large part of our dinner, and sat waiting to ask for our dessert order for about half an hour. The second time my waiter was much nicer, but overall the service is a toss depending on who is working. BUT, the food is good enough to keep me coming back."}
{"text":"The food is good- 4   But the staff and service and service is 10- the best I have experienced in MTL."}
{"text":"La Salle a Manger was the PERFECT choice for my brother's bachelor party dinner.  There were 7 of us from the US and I was looking for a place that would provide the quintessential Montreal experience.  The atmosphere and the food both blew my expectations out of the water.  The serving staff were extremely attentive and provided us with a wonderful experience.  We ordered the chef's tasting menu - and asked that it be both vegetarian and non-vegetarian friendly (3 vegetarians and 4 carnivores) - they went above and beyond to accommodate this request.  This was a 5 course meal worth every penny with an appetizer of fried zucchini flowers, 3 different salads, a charcuterie board, cous cous, rabbit, pork belly, a vegetable tart, plus dessert!  The quantity, quality, and presentation were all top notch.  The cocktails were also fabulous.  

The serving staff and manager truly made this a memorable experience - I would fly to Montreal every weekend to eat here if I could!"}
