{"text":"I came there with a groupon and I was disappointed with a lot of bad reviews I saw online. I went there on a Saturday and it was very quiet which let me and my boyfriend being able to discuss. The atmosphere was nice and romantic. Food could have been better but the prices are cheap. The waitress was nice. I would go back there."}
{"text":"Food was good but uninspired.  Waiter was friendly but not polished.  Loud noises of clanging pots accidentally dropping in the kitchen plus the noise of food frying. Was not the most romantic nor sophisticated venue for the price, but fine for a business lunch or dinner."}
{"text":"\"La Stella has a relatively low rating online, we enjoyed the food and would see it as under-appreciated overall. The dishes are very good value for the money.\" This is just a tad of our flu experience!"}
{"text":"It is tucked between a real estate office and entrance to office building.  Watch out or you'll miss it. I had dinner with my husband here on weekday night.  Was about quarter full, not bad for a week night.  Not a fine dining place, more causal dinning but still nice (Cloth napkins).    I ordered the duck squash risotto and my husband the special salmon and lemon risotto.  I enjoyed my entrée thought there was a good amount of duck in it. Could of used some more butternut squash chunks and squash could have been cooked a bit more.  Still I enjoyed overall. My husband was thrilled with his salmon thought it was cooked perfectly and risotto was perfect accompaniment.   We also ordered the house white to go with our meal. I liked that they had a house wine could get a half litter rather than just glass. It was quite a nice wine too.  We had dessert which I thoroughly enjoyed crème brulee.  Either a small or large size could be ordered. My regret was that I got the small, it was that good. The funny thing of note was that for an Italian restaurant not one dessert was Italian.    It's a simple but nice place.  The food good, simple and was moderately priced.  I would go there again."}
{"text":"Nice to see an actual restaurant for a change.  I have had enough of pub grub in this area.   Great Lunch.  Fairly priced.  Lots of specials daily.  They are suppose to revamp the menu, looking forward to it."}
