{"text":"La San grill looks like a fast food centre with some restaurant dishes. Indo-Pakistani cuisine dishes are made by students who doesn't have any experience in food making. Chicken biryani is good. Chicken wings are made in Indian style: marinated and then grilled. Except for these items going there is simply a waste."}
{"text":"Cant go wrong for the price esp during lunch(lunch Specials). Not sure why people are complaining about servers clearing their plates. THERE ARE NO SERVERS and YOU DONT TIP. You Order.. you sit .. then drop by the food.. you eat and you leave.. If you want full service go to a full service restaurant.... this place is more for take out and a quick meal.. Hits the spot."}
{"text":"Not sure if I will go here again. Just a quick summary of my experience. They made us switch tables because they wanted to start cleaning up before closing. We still had 45min left for closing time. I guess that's ok thinking from an employee perspective. But then, I did not want to sit where they moved me to.  Ordered Butter chicken and Lahori Chicken Kadahi. I have seen bigger serving sizes,  and better amount of meat, so disappointed there. I had ordered 5 Naans, and they just served me 3. So I had to ask them to recheck my order and get me my remaining Naans.  Didnt get to taste butter chicken as my kids were gorging on it. But definitely never ordering the Kadahi there again. It was very soupy!!!!! And I have a taste of Chicken Kadahi, if the 'Lahori' is what changes it, then I dont like the Lahori version.  Naans, I loved the naans. Nice, hot and buttery.  Haven't tried any of the other items, so thats why I am not sure, if I want to be there again. But I was not too impressed with the service."}
{"text":"I used to love this place for their butter chicken and malai tikka chicken which is a yogurt and cream based dish. However, they must think i know nothing about this dish because the last 2 times I ordered it they gave the malai tikka plain with no cream. I'm not sure if they're trying to save costs or cheat people out of the dish but this is just ridiculous. It was so bland and honestly I'll probably go there the next time just to five them a piece of my mind. Don't waste your time there. The quality of their food has gone down the drain."}
{"text":"Incorrectly over-charged - poor customer service!  My family and I ate here for lunch on May 9, 2015. While the food was good, their customer service was not. At the end of our meals, two of us decided to order desserts.  When I ordered and paid for my dessert the cashier pointed out that my cousin did not pay for his, to which I offered to pay. However, he DID already pay for his dessert. Therefore I was double-charged and when I tried to resolve with customer service, no response. I emailed their head office and still no response after 3 weeks..   Double-check your orders before you leave restaurant as you may be over-charged!"}
{"text":"the service is okay ( except for one person)  but the food is good (i like the rice and butter chicken) plus they make it fast :)"}
{"text":"It is the best chicken biryani I ever tasted, so, five stars for that. Spices are right and the smell is not that strong. Portion is good for 2 people but I can eat it all by myself (thats how delicious it is).  Butter chicken is good too - I get it once in a while. It is good with chicken biryani!  As for the location - parking is free so you can dine in. Interior is good."}
{"text":"Food is excellent in town. If you compare the Food Taste. Quality. Freshness & very important the Quantity then I believe this is the best place in Scarborough. I would recommend to experience it once. Our family enjoyed it as it taste so nice and naans you will love it. Amongst 25 food joints we tried I rate this 5;5 . Have a nice  time"}
{"text":"Worst customer service. Came in to place a takeout order and waited nearly an hour. Do not recommend. The food's not good enough to justify the unreasonable wait times."}
{"text":"What made me happy: price 37$ for all including 2 diet cokes. The taste of the mint chutney was delish. Nann was beautiful   What made me sad: no salad dressing, mint chutney served in shitty little plastic takeout containers though we ate in. No red wine.   On a Friday albeit early the place was empty. Seriously just the two of us in a 75 seater. Salad iceberg with basics no dressing.   Paneer something or other was spicy with 6 paneer  Beef Khury 2 chunks but really super tender. But 2 chunks.   Rice old oily and cumin seeds fell to the bottom. Paneer and Khury don't come with rice  Kababs middles were tender ends dry AF. Looked like dog shit.   *had to drown everything in mint sauce to survive the meal. But I liked it that way."}
{"text":"Went here last night for dinner and I must say the interior is quite exquisite! Lovely fake fireplace mounted in the stone wall, an extremely long fish tank along the left wall, and amazing seating. Ordered the skillet lamb chops, tandoori, and kebab. Also had some curry and palau, which was quite tasty. The naan was thin and crispy, which I liked a lot. The food was very good but nothing to drool over. At the end, we had a kulfi, which I remember from before tasted very good as well. I love their symbol, the flame. Reminds of the Fire Nation from my favorite tv show, Avatar: The Last Airbender! Anyway, would not mind coming here again, but the only idea I would suggest is serving bigger portions of food. I award this place 3 stars, which is not bad whatsoever. Good job, restaurant! You keep doing your thing and always improve! You should start with my suggestion as it will do you a great good."}
{"text":"First time coming here was amazing. Fast service, friendly,  great food and very affordable. Definitely a place to go again"}
{"text":"Good food, clean and great for a private party. Ajax location is huge and can hold a boat load of people."}
{"text":"I was there at La Sani with a friend post lunch and the restaurant was pretty much empty at that time. Ordered BBQ chicken wings, Veg Pulao & Kadai Paneer. The lady at the counter took our order and before I went and sat I asked for water and with a smile she said yes. 15 minutes later it the water never came and I asked her again to which she threw an attitude (Rude stare) that I felt was completely unnecessary. Then she got the food with the same rude stare. She forgot my pop and we had to go ask her again.   Talking about the food \"IT WAS EXCEPTIONAL\" no doubts! 10/10 straight.   La Sani has to understand the way their employees talk and treat their customers are also important. I request them to work on that. I'll NOT VISIT them again, service to me is more important than food.   My Ratings  Food - 10/10  Service - 3/10  Ambience - 5/10  Overall experience - 7/10   Cheers,  Sesha"}
{"text":"I had the Reshimi Chicken Tikka which came with rise and salad. This place is comparable to SAFA (another Pakistani cuisine place just north on Markham). This place had great tasting fresh tikka kebabs. We went for the lunch special which was $7.99. The meal also came with a drink. The plaza seemed new and the restaurant itself was massive even though it looked small from the outside. I highly recommend this restaurant."}
{"text":"Large location, but when we went on weekend lunch was deserted. Feels like the location was meant to be for another restaurant, with fish tanks unused and brick walls. Service was slow and generally uninterested in my group. Food was mediocre, large portion, but didn't finish."}
{"text":"I have been here few times with the family. If you are a fan of Pakistani food, this is a good bet. The portions are huge- so you definitely get a value for your money. The food is also very good here and they have decent variety."}
{"text":"Not at all impressed with this spot. The place was grimey, dark and had a funky smell. The food was below average and some items had a weird taste. Not sure how this place gets business. Don't see it lasting a long time. They need to clean their tables."}
{"text":"Food is excellent and the place is clean and family friendly. The prices are very reasonable  as well. They have some really well-priced lunch specials everyday."}
{"text":"I was very disappointed yesterday at the La Sani Grill. The food Quality has gone down drastically. The Beef Seekh Kebab was not made fresh, very hard felt like they were taken out of the fridge and heated up. Rice was so dry didn't look like it was cooked the same day. (I mean it wasnt what we expected). Nihari meat was also very dry for sure was left over of day before.Chicken Kebab was made fresh and was up to the standards of La Sani.  Fish Pakora were freshly made these are the only thing I liked. Counter people do not care for customer. Zero Customer service. I have been visiting your quite often; until yesterday, I and my family were big fans of your place."}
{"text":"I used to like this place, but recently, the quality has become very poor. The chicken used in Chicken Karahi and Chicken Biriyani is stale and uncooked most of the time. I've now decided never to visit this place again."}
{"text":"I ate here with a friend as she raved about the place and how good it was. Needless to say, I had high expectations especially with my friend being a pig with food. (I hate the term, \"foodie\", it's for basic people).  We ordered the Butter Chicken and some roasted lamb leg and a bunch of garlic naan.  So she got her order and waited for like half an hour for mine. Forty-five minutes later, nothing. They must've forgotten my order even though you actually order at the counter. So, something was definitely wrong there. Oh to top the cherry off, we got an apology, that's pretty much it. I can tell the attendant can feel my wrath but she kept mum.  I got my food, AN HOUR later of waiting, and unfortunately, it was subpar. It was just okay. Hadn't I received such bad service to begin with, maybe I would've enjoyed it better, but no.   We again ordered another garlic naan....... lemme tell you, GIRLFRIEND FORGOT THE ORDER AGAIN. And had the nerve to charge me for it still even though she forgot my order twice.  Sorry La Sani Grill, my money will never be spent in your establishment again.  PS. I do understand that reviews are subjective and unfortunately, I had a really bad experience."}
{"text":"If you're a freak for Paki food (as I am!), this area of Suburban Toronto is the place to be. So many places to choose from. The manager and most of the front desk staff at the Hotel I stay at while I'm in Scarborough are Desi, so I ask them their opinion. The first time, they steered me to a Hakka place called Tangerine, just a few blocks away, and it was fab. (Q.V. my review here). This time I said I wanted a different place to further my experience of the area. They told me to go here. (Actually right next door to Tangerine). Couldn't have been a better tip!  Ran into a Desi family who say they drive a long way from the other side of the city just to come to this place. Nice folks to talk to. I let the Father order for me. What a feed! Had Beef and some Veggie stuff, great Rice and Naan. Fabulous!! Didn't catch the names of the dishes, but it doesn't matter-I asked him to order me a selection that would put the best of the place before me. Sure did! Decor? Not much. And you've got to go to the counter to get your food. So what? I'd walk around the block for stuff this good. No booze either. Again, so what? This place is in a strange (at least for my Chicago ass) little shopping area. It kind of looks like if you are not Desi, you might be in the wrong place, if you know what I mean. It ain't like that. Everyone is most friendly.  Glad for the recommendation, Mr.Manager! Spot on!"}
{"text":"Authentic food i love there karahi panner, vegi options are limited but not bad. Bollywood music and family restaurant"}
{"text":"It doesn't matter what I say about the food; the women's washroom was filthy. Stalls were out of service, toilet was extremely dirty, soap dispensers were empty and hand soap replacement was filled with water. I M of the belief that the bathroom is a reflection of the the entire restaurant including the kitchen. I won't be returning."}
{"text":"We just happen to come here since I picked up here for food delivery for a customer since I courier food for Skip the Dishes.  It caught my eye, since I have been craving Chicken Biryani..and was wondering where my wife and I could go to satisfy that craving.  We aren't experts for Pakistani/Indian cuisine by any means.  We ordered the Chicken Tikka Tandoori and the Boneless Chicken Biryani.  We fully enjoyed both and we were stuffed by the end of the meal.  We also had quite a bit leftover for take home.  Lots of chicken chunks in the chicken biryani dish.  The only thing that sorta bugged me is the Chicken Tikka Tandoori.  What we received didn't match the product shot at all.  Was supposed to be served on a rectangular type dish with 4 pieces of chicken, decent portion of basmati rice and some salad.  The salad is kinda weak in presentation.  We ended up with a circular plate with only 2 pieces of chicken + the rice and salad.  The mint sauce and the single naan received were good.  I even got extra mint sauce for take home to add to the chicken biryani dish.  We'll definitely be back for the chicken biryani dish and try some of the other chicken based dish offerings."}
{"text":"This restaurant has good potential but the service is very bad. The food is excellent with nice flavour and the price is cheap. The service is bad. The waitress is horrible and she was very rude most of the time. It felt like she hated her job. I'll come back for food but this time only for takeout!!"}
{"text":"Came here twice. Ordered the butter chicken one time, and got a masor daal the second time. The butter chicken dish comes with naan and salad but you can ask to change the naan for rice if you prefer. The butter chicken was creamy and tasty and had a very distinct tomato soup kind of taste mixed into it (but it wasn't bad!) The masoor dal comes with naan and salad also but I asked to change the naan for rice. The daal had some spice to it and it didn't taste very traditional but the portion was quite large so that was good. Also, be sure to ask for utensils because they don't give it to you even if you order to go."}
{"text":"I first tried La Sani grill in Ajax and it was pretty good,,,probably a 4 star.  I've been there a half a dozen times and service and food pretty good.  Here's the issue I ran into, we thought we would try the Scarborough location as we were in the area and I thought it might be even better...Boy was I wrong, when we walked in, I didn't know if we should order at the counter or just take a seat as No Staff pointed either out so we took a seat,, and we waited and waited as the waitress walked by us about 6 times back and forth,not acknowledging us and getting food for the tables behind us, there was a lady behind the cash who was sort of busy but still when I saw she had some down time never offered us a menu or direction on what we should do, needless to say after 10 minutes of being on ignore we left and went to Zeera's by the water in Pickering, way better and as soon as we walked in the door, service from start to finish,,,Zeera's is our all time favourite Indian anyway so I'll just continue to take my service there."}
{"text":"I came to la Sani and made my family members pick out takeout from here. They have a sister store La Jawab in Markham, much closer to us.   However before that, I loved the curries here. The vegetable curry is great and the Karachi chicken is amazing! the naan is also very fresh.   You order at the counter and the food is brought to your table.   Pricing is alright for dine in/take out . The catering pricing is ridiculous"}
{"text":"The interior of La Sani Grill is styled with today's youth in mind.  A very clean interior with beautiful fish tank on the east wall and fireplace in the center.  Very interesting selection of music being played however.... didn't really see the theme song from Tokyo Drift fitting in with a predominately South Asian cuisine... but after that one song, things returned to more traditional South Asian music.   Well lit and the scents of the food filled the air... yes, I was hungry...  No greeter at the front door so we were kinda confused when we walked it and eventually sat ourselves... the menus were literally their take out menus... for the interior decor, with just some small touches, this place could be so much better.  The outside screams higher end family restaurant... but the presentation so far has been lacking but not by much.  On the the food...  for the price.. you can't go wrong.  Large portions of rice which is light and fluffy, the meat is grilled extremely well.  The roast chicken my wife had was still tender and juicy and had the perfect amount of flavour which is to say spiced but not overly spicy.  The beef kebab I had was definately worth it and the Naan was still steaming hot when it landed on the table.  Overall, good family restaurant and very flavorful food.  Would definately recommend for the food.  Atmosphere was good, the food was even better..  the service was spot on and I am leaving very happy and very full. Please be aware of the type of restaurant you are headed into, no alcohol is served here."}
{"text":"I'm a regular at the Ajax location as it's close to home and I love the food there. Tried the seekh kabobs at the Scarborough location today and had to return them as they were completely dry. Got a takeout of the same order as I was running late only to realize later they were still pretty dry. Guys you need to add fat to ground meat before you cook it else the kabobs will be dry no matter how you cook them. Get your act together before you start losing customers and shut down forever."}
{"text":"This is hard for me to do because the food at La Sani is so frekkin delicious. But the service is so off it's frustrating.  The first time around I overlooked it but it seems a consistent thing that I had to update my review.   I ordered take out for a large lunch group and was put on hold for over 10 minutes before they could get back to me on the phone for my order. The server didn't repeat the order,  she just took it down and said 20 minutes and then hung up on me - didn't even take my name. That's fine,  I assume they have call display and go by phone number of something.   So I get there 20 minutes later and wait in the long line up and then wait some more because my order isn't ready - also fine, they're very busy. When they hand me my bags I ask them to repeat my order and one of my items was wrong. They refused to fix it saying they confirmed twice on the phone. Since it wasn't a food allergy issue I eventually let it slide. Then I tried to use my yelp check in offer since I had spent over the required amount and they said no because it doesn't apply on lunch special (which is not indicated anywhere).  Before I could even discuss,  she shouted \"next\" and began serving the customer behind me.   I went back with my food and angrily ate the most delicious and well-spiced palak paneer and butter chicken in Scarborough."}
{"text":"I tried it for the first time yesterday, got in just before 4pm so we were able to order lunch specials. Four lunch specials fed 5 adults, plus we had extra to take home. So as far as the portions go, that was great. The food was delicious (palak paneer, karahi paneer, butter chicken, and mixed vegetables). My go-to in scarborough is usually A-1 for indian food, but the price of their lunch special here is great and will definitely have me returning again with those large food portions. I would also agree with some of the other reviewers is saying, yes the service isn't the greatest in terms of clearing up your plate or packing your own food. However, that's not really the type of place this is. It's definitely not a full service restaurant."}
{"text":"We had Chikkar Cholay, Palak Paneer and Butter Chicken. They were all very tasty.  The staffs were very friendly. We placed our orders and they brought them to our table. The price was very reasonable. We will definitely come back."}
{"text":"This is a rating only for the Karahi Lamb and Chicken Roast. I haven't had better Karahi Lamb or Grilled Chicken Roast anywhere else so far. Perfect amount of spice and sufficient meat, for the price, you cannot get any better."}
{"text":"My husband and I went to La Sani Grill, Mississauga this past Sunday. Typically, we go to the Scarborough location which we're always very happy with. Upon arrival, around 12:30 PM - there were no other customers in sight which was a bit concerning. We went up to the front counter and they only had ONE paper copy of their menu - nothing on the boards and no additional menu's to take to your table to decide on your order. We asked them how long they've been open for, they said over a year.. how do you not have more than 1 menu?   Next, we received our food - 2 words: absolute garbage. I got the kabab platter and my husband got the chicken tikka platter. My kabab's definitely seemed like they were not made fresh, but microwaved. My husband received his chicken tikka platter but they gave him chicken boti instead which is not what he ordered. The waitress apologized and bought him his tikka about 5 minutes later, which also was definitely microwaved - no questions asked. The garlic naan we received was not tasteful, garlic chunks were huge, there was no butter or coriander leaves and it was thin.   Overall, we were not impressed by this location at all and I'd really recommend not wasting your money here. The Scarborough location is MUCH better. Only rated them with 1 star because I couldn't give 0's."}
{"text":"Butter chicken is like soup and not very good at all.  One bite and threw the rest out.  Yuck. Have had way better at so many worse places."}
{"text":"This place has fantastic food by all means, one of my go to places to eat.  I normally get take out.  You may wonder why the great review, yet two stars.     I decided to invite a few friends to eat at la Sani grill, being that it's one of my fav joints.  But the customer service is just awful.  One of the worst! Not the counter service but more so that they give you the most awkward feeling when They want to close up 45 mins before the posted time.   First, they cleared away plates that were still being used w/o asking.   I had one and a half naans left, with 2 pieces of lamb karahi left (only comes with like 5-6 pieces).  They decide to come by and throw my dirty napkins into my food, just because I decided to take a break from eating to chat.   Mind you, it's 945pm and they close at 1030.  Basically saying gtfo.   I was actually planning to take that bit of food home because the curry is awesome.    Your employees represent you and your business.  Is that who you really are, as the owner? If so, I would boycott the place, even if the food is good.  You ain't the only spot in this great city."}
{"text":"La Sani Grill is a gem in Scarborough! We order dinner from this place at least three times a month. We've tasted every item on their menu and have not been disappointed. Our favourites include: Charcoal grilled lamb shanks, served with rice, side salad and raita. You get a well seasoned whole lamb shank which has benn slow cooked over charcoal until the meat is absolutely tender. The aroma is just tantalizing and the flavour of the meat definitely lives up to its promise! An order of chicken biryani is VERY generous, and comes with a side salad and raita, and naan. Two people with healthy appetites would be satisfied with this plus a veggie dish. Each forkful comes up with a nice piece of chicken and a well orchestrated symphony of spices. I would caution you from eating this for lunch if you don't intend to take a nice long nap afterwards. The palak paneer has generous chunks of paneer floating in a thick, bright green spinach mush. Every mouthful of the Lahore chikkar cholai is an explosion of flavours which are warm and redolent of spices - i can only recognize cumin, turmeric, ginger and cinnamon. I could go on and on, but you would be better off just trying the place out yourself! Other pluses for tis place: very clean, ample raking, great service and and you get 15% off pick up orders if you at with cash."}
{"text":"Chris and I had lunch today at La Sani Grill on Ellesmere and Markham Road. Chris had the butter chicken, I had the Chicken Roast, served with basmati rice and salad (Spicy. Described in the menu: \"Half chicken with bone marinated overnight in fresh herbs and authentic spices. Roasted to perfection then grilled to enhance the flavors\"). Well I couldn't add to that except to say I love it. The butter chicken served with naan was described in the menu: \"Tender chicken breast marinated overnight in a yogurt and spice mixture. Cooked in specially prepared makhni sauce and garnished with white butter, fresh cream, sliced green chilies and crushed fenugreek leaves\", just the way I like it! Overall experience with these two dishes...oh me oh my, wow!"}
{"text":"La Sani Grill has some very decent lunch specials. I ordered the Reshmi Kabob with 2 skewers of meat, salad and choice of either rice or naan. Food is flavourful, but I expected a slightly bigger portion for $8.49  Dining room is very well done though, romantic setting for couples. I'd hand em four stars, but three for the portion. Still a very good restaurant."}
{"text":"Never try this place. Worst place in the area. After having dinner, when l went to pay my bill, their card machine went down. So, after waiting for few minutes but still no luck. Owner/cashier forced me to pay my bill either by cash or share credit card details. He collected my credit card with Cvv number and l felt completely lost and upset for their behaviour. Absolutely it is their problem to fix the machine or notify me in advance if card payment not possible. Such a worst experience and food was again not good. Chicken was very hard and naan was having so much dust and small rocks. I was much worried after sharing details of card and really felt very bad for visiting this place."}
{"text":"So disgusted after coming here. Not only do the servers have so much hair they do not have hair nets. Almost all of the servers had their shirts top buttons unbuttoned exposing their long chest hair near the food i had ordered. They didn't wear gloves when touching my food nor did they even wash them before starting to touch it. I will never come back here again."}
{"text":"I've been to this place now 4x and I thought to myself it's about time to review it..this has been one of my hidden gems which up till now didn't want to share :)  Usually I go here for lunch and have tried a variety of items...and believe me you won't be disappointed.  The service is quick and the food is mouth watering. As soon as you enter the place the aroma leaves you breathless.  If I could critic one thing that would be decor but you know what...the food speaks for itself!!  Overall I would give them 4* in the hopes they add some more items to gain my extra star.  Stay tuned for the next great review!!"}
{"text":"Worst meal of my life! Not kidding.  The ajax location just opened up in my neighbourhood and I couldn't wait to give it a try.  I eat afghan food a lot, as well as Pakistani (I was born in Peshawar!) and been to many many of our friends Indian/Pakistani/Afghan and South African/Caribbean Indian weddings and events and by far this is the WORST meal I've tasted, it just couldn't be any worse. I'm thinking the Pakistani community must be appalled!!!!!!!!!!  My husband and I were shocked at the time and attention to detail it took to renovate this place and yet the food was absolutely disgraceful.  If you own this place or manage it I'd like to hear from you, please call me. I'm a food blogger and I've worked and watched many businesses and restaurants in my area as well as the GTA and they simply do not make it, if you continue like this you will be crushed, I guarantee it.   You just opened and have absolutely no focus with regard to service and menu, even the plating is very confusing.  Either you go with an upscale type service or stick to the food tray/food court style as they do in some afghan restaurants but your focus is all over the place. We sat down at a nice table, were served by kitchen staff and then watched them collect dishes from the little trolly rolled through the restaurant (you should have service stations!)   We ordered two simple dishes, beef tikka with rice salad and bread and lamb chops with rice, salad and bread. We were presented with one tiny square plate of what appeared to be salad (iceberg lettuce, 3 thin mandolined slivers of tomato, a couple  of chunky cucumbers and 3 slivers of a quarter of a red onion, no dressing, NOTHING!)  We were confused by this plate, was it for us to share? We thought our meals came with salad for each of us (we're paying 12.99 for each entree!!!!!)  Then the two little plastic containers of minty yogurt dip were plopped on the table followed by a rectangular dish of rice (looked broken, you would think if you're doing such a simple menu of rice and meat you could at least perfect your RICE after all it is our daily staple in these eastern countries)    The beef tikkas were these large chunks of beef charred to death, chewy, over done (appears to have been cooked directly from a fridge and perhaps even the wrong cut of meat, worse than anything I've eaten in my entire life be it travelling around the world or here in Canada)   The lamb chops were paper thin, charred on the edges. We had nothing but the taste of char in our mouths.   The bread was the only thing that was tasty, I'm utterly disappointed. $30 down the drain and I refused to tip another cent. I will NEVER be returning and will make sure to tell all my friends and family as well as the foodie community that I work with to never step foot in your establishment and stay as far away as possible."}
{"text":"Delicious food, good portions, nice presentation, good service, great prices!  The butter chicken was delicious, with lots of sauce to soak up with the naan. The chicken roast was spiced just right and cooked perfectly. The basmati rice was nice and fluffy. Portions were generous, especially for the price.  La Sani Grill is definitely worth a return trip!"}
{"text":"Good layout and clean place. Service ok, could be better. However, food is pretty good. Their chicken biryani is good and so is their butter chicken. The chicken kababs were ok. The naans are fresh and tasty. And seems like they do tend to forget some items that we ordered. We do more of takeout than dine-in so service is not my major concern. Overall, decent place."}
{"text":"After hearing about this place for about a year, I tried it today at lunch, going with two workmates.  We had the Reshami Kebab and the Beef Tikka Boti -- the latter was outstanding, tender and spiced beautifully.  We also had the lamb Kahari, which likewise was a standout with very generous pieces of soft lamb and a sauce that was great to mop up with the naan  (the tandoori naan, by the way was fabulous and came directly from the tandoor to the table -- we also had the stuffed kulcha, which is a bread  filled with paneer and spices).  We added a vegetable dish to our order, Lahori Chikkar Cholay,  chickpeas in a beautiful curry sauce. This was the only dish that disappointed as the chick peas were a bit on the mushy side. The salted lassi I had with my food was good, though it might have been a bit colder.  So bottom line:  the beef tikka boti was as good as I have had anywhere in Toronto, as were the breads.  I'll certainly come back, especially because I work about ten minutes away. ....  Came back a week later with a friend -- very consistent and, if anything, the beef tikka boti was even better.  Juicy well-cooked pieces of very tender meat.  Lamb Kakari, likewise, was every bit as good as I remembered it.  Service very friendly."}
{"text":"I really love the food here.  This is a family resto location on Markham and Ellesmere rd in Scarborough. It's busy, they have Bollywood movies and music video playing on their plasmas.  I got their kebab with rice and salad. AMAZING food, fresh, you can even see the cooks working behind the cashier.  repeat for sure"}
{"text":"My husband and I came to this restaurant thinking it's a nice restaurant due to its atmosphere and all, we ordered lahori chole and seekh kabob with rice to be honest I've never had food as bad as this place the rice was stale seemed like it was two days old, the kabob was hard I couldn't even chew it. The guy that works there has no customer service either. Worse place ever for such a nice atmosphere."}
{"text":"I can't say enough good things about this place.  Quality food and clean environment. Their lunch specials are a total bargain.  The seekh kabob is my favorite but be warmed it is spicy.  I like the ease of ordering.  Order at the counter and they bring your order to your table.  The nann is freshly baked too.  I'd eat there everyday if I could."}
{"text":"Got the lamb shank. It was completely dry and so unbelievably tough, I had to throw most of it away."}
{"text":"I tried this place for the first time  with a group of 8 for a team dinner upon recommendation from a friend.  As soon as we walked in, I noticed that the entire restaurant was a ghost town, there was absolutely no customers on a Monday night.   I decided to try the Beef Seekh Kebab Plate, and I'm so glad I did! I also ordered it to be spicy.  This dish came with two large kebabs, rice, a small salad and naan for $11.50  In our group of 8, about half of the people got a kebab dish, while the other ordered butter chicken.  Every dish came with one naan which they served in baskets all together.   Usually when you go to a South Asian restaurant, the food is ordered and served family style. In this case it wasn't, every entry was served to each individual.   I was also able to try the butter chicken and the Reshami Kebab.   The butter chicken was really tasty! Something I personally look for in a butter chicken is if the gravy is not sweet. A lot of restaurants serve it with a sweeter gravy, but thankfully this wasn't the case here.   The Reshami Kebab was ground Chicken based with a strong flavour of coriander. It was good, but a tad bit dry, but that may be because chicken doesn't have as much fat in it to seal in the flavour   Overall, I had a pretty good experience and I might come back for the Seekh Kebab because it's a good option for takeout if you're in the area.  I wouldn't recommend dining in here, as the service is VERY slow and the restaurant is often empty.  They also only have paper takeout menus for dine in, which they ask for back which was a bit strange to me."}
{"text":"La Sani Grill...comes on my Visa statement at least once a month.   Great place, located central-ish part of Scarborough, there's also a Pickering location. Both places have the same set up, nice clean open kitchen look. If you going with a large crowd for dine in, would recommend the Pickering location. Finding parking in the Markham Road location is just annoying at times.   Food - For the price you really cannot complain. Some things that I tried are :   - Butter Chicken - Nice creamy butter chicken. Not skimpy on the protein and definitely not some premix from a bottle.    - Half Chicken Roast - Comes with half naan, salad, half chicken, rice, and the sauces. For $14 with tax you can't go wrong. Well flavored and infused chicken and rice. Would recommend getting extra hot sauce, they drizzle on top of the chicken..( fist pump emoji )   -Chicken Tika Wrap - Good for a quick snack. Chicken Tika, veggies, wrapped in a naan.  -Lamb Chops - Good seasoning, but was rough to chew. Smaller chops then regular. Unless you really really want lamb chops would recommend skipping this one.    -Chicken Tika Boti / Tandoori - Comes in the same way as half chicken roast. Well seasoned meat. Don't forget the hot sauce ;-)   Good place to try out and for take out, good portion sizes. Would recommend for all occasions."}
{"text":"Looks nice, clean and fresh from outside but things changes as you enter... Men's washroom was a disaster. Huge disappointment. You'll see a lot of hand written notes all around. This does not work, use the other one. No Amex and etc...  Misprinted menu, hand written notes on menus. Tables, Windows, glasses dirty. Stuff quite uninterested and untrained. Our table was tacky asked to have it cleaned. The waitress came with a wee cloths, cleaned just the corner and left it all wet. Don't see this place lasting long. Food was average. Nothing special. Looks more like frozen kebobs were just grilled. Quite a disappointment. Couldn't finish the plate. Left more than half, paid and than left"}
{"text":"Horrible horrible horrible   party of 5 went to dine this , we were greeted by a not so enthusiastic server , made us sit on a table that was not clean.   Lamb chops came out with a long strand of hair and they refused to replace it initially but once pushed she took it back and brought out the same dish by removing the hair.   once again we sent it back only to be replaced fully   malai tikka chicken came out raw in the centre, when i mean raw it was medium rare done raw, which was gross .   they will not take feedback and we will never return here again,   no wonder their location was 90% empty"}
{"text":"Do not have any choice so have to give one star otherwise this place doesn't deserve any star.   Ordered red lentil and Shami kabob. Pathetic food ever had. Not fresh at all. Server was nice obliviously cause food wasn't fresh and it was microwaved. Lentil was stale and was stinking bad. They didn't charge cause they knew food was not good. Garbage food. Would not recommend anyone to go there."}
{"text":"Food is great! Delicious, fresh, fast. Decor and atmosphere is relaxed. Music is a little loud but that's okay.  Service is not so great. Twice my friend had to ask for our mango lassis. They were delicious - but why must we ask for something we ordered - twice?  I feel the customer service left much to be desired. If it weren't for the food, I would not return."}
{"text":"Love there nihari and garlic naan. Nice experience but waiting period was too long. Authentic taste"}
{"text":"Superbly disgusting. Flavourless to be called Pakistani food. Try this and compare yourself with Patna Kabab House"}
{"text":"I have been to this place cause the Butter-Chicken is great!  I would come with a friend.  Only suggesion is let us add the rise to the combo.   Good on price but the service is not as what i'm use to!!  But if your served by the manger/owner you get  perfect services!!    I have gone many times.   I would suggest it to anyone who is feeling like india food!"}
{"text":"To be honest I came here because it was on blogto....and I have to say I really won't be returning ever. Firstly it was hyped to be the best butter chicken in Toronto, which is what I ordered. And I kid you not, on a Friday lunch, where the restaurant was half full I got my food about 35 minutes later. When the food came out, it was pretty good, but I can't justify anyone waiting 35 minutes for it when I'm Toronto, you are spoilt for choice in terms of Indian/Pakistani food.   The butter chicken is delicious however. They use grilled chicken in curry so it's got that extra tandoori flavour on top of the butter chicken sauce, which was rich and flavourful."}
{"text":"Pros:  - price for the food was relatively cheap  - portions are big  - kebabs were really hefty, especially for the price ------- chicken kebab was a lot better than I thought, on point  - atmosphere was relatively clean  - naan was pretty good, esp garlic   Cons:  - beef kebab meat felt really hard, either it was something in the quality of the meat or they were stale and were warmed again?  - lamb karahi was really small, and wasnt even that good  - no heating in the room on our side  - servers were rude, didnt serve out plates - at the end, they gave us aluminum foil and styrofoam packing and told us to pack the remaining food ourselves LOL   All in all: good food, good portions, prices are fine, not too spicy, but service is lacking"}
{"text":"I've been to the Ajax location and didn't have the best experience. I would still give the Ajax location another try because maybe I just had them on an off day. The butter chicken was not creamy and did not have enough sauce in it at all, chicken was dry.  THIS location on the other hand, the interior was clean, staff were very friendly (not that they werent at the other location) The butter chicken was so delicious! The white meat was well cooked, moist on the inside, the portion of sauce to meat was perfect and the sauce was seasoned with all of the right ingredients making it so creamy.  I also really enjoyed the chicken poutine. It had lots of flavour and im a fan of their fries, crispy and yummy.  I would go back to this location! :)"}
{"text":"La Sani Grill is a good place for lunch. Yes lunch specials from $3.99 includes a bottle water or a can of pop!!  I like the way it is set up. Kind of like a mix of food court and sit down restaurant but no tips is neccessary. Just to to the counter and place your offer and they will have the food deliver to your table.   The Butter Chicken and Naan/side salad ($6.99) tasted great! The Naan bread is made freshly and still hot, tender and full of texture and flavour. It tasted so good to be dip in and eat with the Butter Chicken sauce. The chicken breast has been marinated first then grilled, (I can tasted the smokey flavour) and cooked in makhni sauce and garnished with white butter, fresh cream and fenugreek leaves. The chicken is really tender and the sauce is not spicy when I was eating it. But I can feel it is burning in my stomach afterwards!  The great thing about eating here is all the food are serve on real plate and cutley... not foam plate or plastic forks/knives!  There are over 13 choices for lunch specials, I will definitely be back to try out others on the menu!  They accepts Visa, Mastercard and Interac."}
{"text":"We have been meaning to come here for a while, so finally we made it for lunch. First off it usually isn't a good sign when every table in the place was empty and this is a big place.  We were met by a less than enthusiastic staff who ushered us to a table. She deposited menus, didn't ask if we wanted drink, she just vanished for quite some time. When she did come back we ordered and again it took about 15 minutes for our food to arrive. That was crazy considering we were the only people there and it was during lunch hour \"rush\".  When the food arrived it was a giant serving of rice, wilted \"salad\" and meat. I had the beef tikka boti which was dry and flavorless, not seasoned at all. My husband had the chicken tandoori which was supposed to be a half chicken but the size was more like a half pigeon and it was boney. The rice was tasty but that was it. The naan was fresh. The server took ages to come check on us. By that time we were ready to leave. She didn't tell us we needed to pay up front and she didn't bother to clear the dishes from our table. Eventually we figured out we needed to pay up front.  Bottom line if you are looking for good Afghani or Pakistani food this is not the place. Right in the same plaza is an Afghani dining option that outshines La Sani in every aspect. Won't go back here again"}
{"text":"3.5 *   I came here with my boyfriend on a Sunday evenings to grab something quick to bring back home to eat. We were craving bubble tea and the only store on the way is Bubble Tease so might as well get food at a place in the same plaza. We weren't craving anything specific but checked out Sani Grill. The interior is really nice and the store looked clean.   It was super empty though and we hesitated to order. Decided to give it a chance and we ordered lamb chops and butter chicken.   The bf originally wanted lamb shanks but I guess they ran out after a certain time? Not sure. So he got the chops instead. Everything we ordered was packed to go and they were all neatly placed and organized. Food portions were big and we got full from it. Lamb tasted dry. The salad was just slices of cucumber.   Butter chicken was good. There's a few pieces of chicken chunks in there. Spice level is right. I couldn't finish so I had it as leftovers then next day. I believe all meals come with naan and the pieces are so big lol, couldn't finish that. The butter chicken does not come with rice, huge con here but you can probably add it with additional costs.  No pics here cause we got it to go.   I think it's average priced. I think I would come back again to get the butter chicken as I really enjoyed that."}
{"text":"Food is consistently great!  Kebabs are big, juicy, flavourful and tender.  The rice is spiced just right and they allow for lots if flexibility in your rider. Just about anything can be doubled or replaced. I agree with previous reviews that the service is lacking in a couple of areas.  Would highly recommend it for the food."}
{"text":"The service is good at this location but the food isn't compared to the Scarborough one. The decor is nice and prices are pretty good. But definitely prefer the Scarborough location!"}
{"text":"Honestly one of the best places to have butter chicken. The other menu options are amazing as well. The price is really good and it's a good place to go if you're in groups."}
{"text":"Expensive for the quality of food. Ordered lamb chops they smelled and tasted like fish!  Bad customer service!  Wont recommend and wont return!"}
{"text":"Visited Saturday night. They give you a small salad with a small plastic side cup of a very good minty and yogurt-based peppered sauce.   -Butter Chicken (good, but had a unique, sort of dairy cream off-putting sweetness, love it or hate it). Chicken pieces were red Tandoori chicken breast pieces which were great, but not plentiful)  -Chicken Biryani (rice was not greasy/brothy, and flavour was above decent with more varied spices than most resto biryanis). Chicken pieces were non-chicken-breast plain chicken pieces which my friend and I disliked greatly)  -Naan (Very good, not too stretchy but thin and airy, which was great)  Best of all, they dont charge you for a tip or even offer a chance to (if you use debit or credit card, probably if you use cash too) so that was a definite plus.  But the price of that means somewhat less richer food.   Overall more homestyle/simpler and the butter chicken sauce/curry is unique in a sweet-like flavour which you will love or dislike.  Value was average but worthwhile."}
{"text":"Went there the first time there today Tried the kabob roll. Was pretty good. Was a bit spicy but good spicy  Good pricing Clean ambience Will go there again"}
