{"text":"Very good home style Colombian food. Try the arepas, plato tipico, bistec criollo. The desserts were great, especially the figs with caramel sauce! Service was very good also. All in all, well worth a detour. Muy buena comida!"}
{"text":"If you're Colombian, you have to go!!!! It's like sit at your house (there) eating your favorite food. If you're not, it's the best place to try this amazing food for a first time!"}
{"text":"I love coming to this cute cafe when ever I feel homesick for my mum's cooking. Its a great place to relax, listen to *JUANES*, and enjoy your food. Can't wait to go back!....

I would recommend:
-Empanadas de pollo o carne
-Jugos!! Tomate de arbol 8-) my personal favorite...but for the less adventurous mango juices is just fine too."}
{"text":"This is the best Colombian food in Arizona.  The food is amazing and with descent prices.  I love this place.  Everyone is nice and professional.   You are treated like family and you can assure is a safe place."}
{"text":"I was there on a Sunday for lunch. You will miss the location if you are not paying attention. The place not very attractive, but it is not a dump either. It has a dining area and a \"store\" with minimal products and souvenirs. My lunch was served on a metal tray (shaped in the form of a pig?), not very attractive. Lunch was a flank steak, tough for a super-thin piece of meat, a fried egg on top (poorly done), small salad, and two large potato chips (not fries) that were over cooked. My friend had the chicken with rice, it looked much more appetizing. What was good were the empanadas, which tasted very similar to Indian samosas. The attention was good, but Spanish only. For the service, location, and quality, the prices are too high. There are other latin restaurants in the area, I will try them first before going back to this one."}
{"text":"I went a long time ago and was disappointed I returned and I love going there the chicken is amazing and I love the passion fruit juice"}
{"text":"Love this place! Real Colombian food, Colombian coffee and friendly service. And they now sell beer and aquardiente!!"}
{"text":"Great little restaurant and grocery. Everything seemed homemade and well prepared. First time I ever had a warm chicharon and it was great.  Empenada was perfectly cooked and the sauce they serve with it was fantastic.  Maracuya juice was amazing!!!"}
{"text":"My wife is Colombian and I've been to some great restaurants serving traditional fare.  These dishes just weren't up to par with the exception of the bunuelos which were wonderful.  Inadequate seasoning in the beans and badly overseasoned empanadas filling.  The oil seemed a bit old as her chuleta came out dark."}
{"text":"I was told that there was only one Colombian Restaurant in Arizona and La Tiendita Cafe was it. I had tried two other places in the past located in Glendale and Phoenix which by the taste of their food, it is justified why they no longer exist. La Tiendita Cafe is a hidden gem! The first time I showed up I ordered the lunch special which comes with rotisserie chicken, white rice, and salad. The meal was fantastic and satisfying. I also ordered the beef empanada, and let me say, they make a mean empanada like the ones my grandmother made when I was a kid. I have returned several times and tried the \"perico con chorizo\" (eggs mixed with tomato, onions, and a Colombian sausage on the side). I have also ordered the \"Picada\" (An assortment of fried delicacies) along with \"Pan de Bono\" (A delicious moist bread treat) and the famous \"Arepas\". Everything taste so fresh and authentic. It's like having a little piece of Colombia in Mesa. German and his wife Marcela have been very friendly since the very first time I visited La Tiendita.

This is the place where you want to be for the World Cup! They have a fully stocked bar and several TV's to entertain and satisfy everyone. Don't hesitate to try this great representation of our Colombian cuisine and heritage."}
{"text":"This place is the best! Best people, best food and now they serve drinks! Awesome! The only real Colombian food in the valley"}
{"text":"I loved I got the bandeja paisa two empanadas one mango water and arequipe w cheese and OMG

Delicioso todo tenía algún tiempo deseando comer comida colombiana de nuevo y me llevé una excelente gracias ;)"}
{"text":"Last week my two sons, husband, and I ate here. We shared a plate of empanadas where were fantastic! Even my 7 year old who is the pickiest eater loved them! They had a crunchy exterior with perfectly seasoned potatoes and beef inside. My husband and son both had the steak (pounded very thin and seasoned perfectly) smothered in onions with plantains, rice, and a salad. The dressing was simple and tasty! I had arroz con pollo with a side of plantains amd a salad. It was all fantastic. Even my youngest had chicken fingers and fries and those were great too! It was filling and the price was ok for everything we ordered. I do wish the staff was a little more friendly which is why I didn't give it 5 stars. They weren't rude or anything, just not personable. My Spanish is terrible so maybe there is a language barrier? But the food is so good I will be back!"}
{"text":"Authentic, however small portions for the price.  Ample seating with flat screens for watching Selección Colombia!  If you have the need for a quick fix of Colombian flavor, this the place...actually it's the only place in Phoenix."}
{"text":"Some of the best Colombian food I've had in America. The Empanadas and Chorizo are well worth the 30 min drive from my house. Also was able to buy some Manzana and Arequipe  to bring home!!!"}
{"text":"Amazing food! The coconut broiled fish meal was spectacular. The plantains were perfectly fried. My wife got chicken (flawless) and it came with the best beans either of us have ever eaten. You will not be disappointed if you give these guys a try!"}
{"text":"We had never eaten Colombian food and the four of us were very intrigued. We asked the owner and chef for suggestions and he came through. My husband and I both had arroz con pollo. Excellent and enough for lunch the next day. Our friends had different entries.  One had leftovers, the other ate all her food."}
{"text":"If you are into South American food then this is the real deal. I here traveled to Colombia many times and this food is just as good and even more better. The passion drinks are the best."}
{"text":"The staff provided good descriptions of the meal and drinks, making suggestions on the best way to order. The guayaba drink was amazing prepared with milk.

The decor says, \"Columbia\" throughout.  A bijou little shop is attached stocked with items featured from the menu for purchase along with unique Colombia gift items.  I'll have to come back for dinner and try the chicken."}
{"text":"THIS PLACE IS SO GOOD!!!! Seriously, the people who work here are so nice and the food is absolutely delicious. The only time we get to eat Colombian food is when we go to visit family on the east coast (which is hardly ever). Anyways, this place is a MUST TRY. Authentic, amazing Colombian food!"}
{"text":"I was looking for a place to celebrate my mother's birthday. She is Colombian and I thought it would be great to find her some food from there. I searched on Yelp and came across La Tiendita Cafe. Although we live on the other side of town we decided to make the drive out there! When we arrived we were greeted by German and his wife and immediately felt like home. After a celebratory shot of aguardiente from a local patron we decide to order some food. Everything we ate was delicious! We had Empanadas (both beef and chicken), Bandeja Paisa and Picada. Everything was delicious and authentic! So glad we found this gem! We will be returning and bringing our friends! Also, a great little store there too, great place to find Colombian food, drinks and spices that are hard to find elsewhere!"}
{"text":"La Tiendita is the most amazing Colombian restaurant in Arizona. As a Colombian, I can assure you that you will get our best traditional dishes. I've been away from Colombia and my visit to La Tiendita was like a trip back home. I had a Bandeja Paisa with Empanadas accompanied with a Manzana Postobon soda which were delicious! Just like I remembered them. La Tiendita also has a market where you can find all the Colombian products you can imagine. From the market I got products with a very high sentimental value that reminded me of my life in Colombia, which was pretty awesome. Tutti Frutti juices, Postobon sodas, Jet and Jumbo Maní chocolate bars, Bon Bon Bum lollipops, Colombiana soda, Fruco ketchup, Rizadas potato chips, Golpe con Todo, and Alpina oatmeal smoothie. Also, the service was great! Marcela and German were very friendly and helpful. If you are a Colombian, someone who likes to try new foods, or looking for excellent food you must try this place! I live in Phoenix but I am willing to go all the way to Mesa just to eat and shop at La Tiendita."}
{"text":"First time trying spot out today. It was very authentic columbian food. I have been craving this for quite some time now. Thanks God for YELP. I finally found a awesome spot. 
Bandeja Paisa was very good. I can eat this everyday lol. For $12.95 you get a bunch of food, but I was kinda disappointed when I saw the fried pork belly coz it was kinda small. Everything is else is tasting real good though. The Carne Bistec was also good. The meat was soft and the empanadas are bomb. Chicken or beef with some potatoes wrapped of the arepa ( I think) lol. 
My overall experience was good. The customer service was awesome. Lots of recommendation. A+++"}
{"text":"I am a fan without even going there since I love, love, love Colombian culture and have been agonizing over where to get real OMA cafe.   I will try the empandas and hope they are good.  Every ciudad in Colombia makes them differently.  I liked the ones in Medellin the best, at El Machateca near to Hotel Dann Carolton.   Sigh... no more novia,  no more trips to Colombia.   I look forward to visiting La Itendita"}
{"text":"Authentic Colombian restaurant. Never had better in the United States. My mom is from Cali Colombia and loved it!! Give it a try and you won't be disappointed."}
{"text":"Best restaurant for people with gluten intolerance. There is a variety of  gluten free food. The service is incredible. Prices are great,  have a healthy natural lunch for less than $20. Options like \"arepas\" or corn pancakes, plantain, cassava, better alternatives than bread. Chicken is roast. Looking for a different option of sodas or water their natural fruit juices are delicious."}
{"text":"For the only Colombian place in town they satisfy all the needs for ok prices. The flavor is there for sure. Bandeja Paisa with addition of morcilla is the thing to get for firstimers. The Bandeja is one of the most known Colombian dishes and has so many different items you will have fun eating it."}
{"text":"Been here maybe 2 or 3 times now and I'm a fan.  Well, considering there are really no other places to get my Colombian food fix... hehehe.. it makes sense to be a fan!

FIrst, this is a family run place so they are friendly and I've alway struck up a convo with the guy (Owner?) or even another guest.. always about Colombia, or favorite foods or memories of there.

I've had: arepas, empanadas, pan de quesos, licuados, chorizo, yuca.. some other things I don't recall, but pretty much I have tried to get everything on the menu.  I've been to Colombia 2x as an adult, most recently a couple years ago with my husband. The food in that country is just memorable.. so being able to taste it here, made very well by Colombians, makes it a treat to have.

I always get a licuado of any of the awesome fruits from there (I'm sure they use a concentrate because some of the fruits are hard to find, even at the Asian grocery stores), and an arepa... I love me some arepas.. warm corn with cheese .. yum! AND, if they ever have any of their bread (almojabana, bunuelos, pan de queso, pan de yuca), you NEED to get some.. they bring back so many memories for me.

If I'm ever in the area (which is quite rare, since it's pretty far from me), I absolutely make a point to eat here.. always!"}
{"text":"I'm half Colombian and haven't really had authentic food since I was a kid. I was visiting my girl in AZ and she had never had Colombian food. This place brought back.memories. 

On to the food. I ordered the #6 breakfast combo. It came with an arepa, scrambled eggs, veggies and hot chocolate. The arepa was so good, I ordered a second one. They were stuffed with warm, gooey cheese. My only complain was they are pricey. They are 2.99 each and back home, I can get them as low as 1.50. The eggs were ok. I make better ones at home. The hot chocolate rocked thou. 

When I head back to AZ, I will stop there for some arepas. Owner said he was the only Colombian restaurant in the state, not sure about that but will take his word for it."}
{"text":"Highly recommend this place.  Authentic food, great service and decor. We went here for lunch and got empanadas, fried plantains, and Bandeja Paisa. There is also a nice grocery store attached to the restaurant. Make sure to get a cup of their coffee as well!"}
{"text":"It's not often we find food from home so La Tiendita was an amazing surprise. Their food is delicious and tastes like home"}
{"text":"The food was excellent as well as the service! We loved the empanadas and especially loved the chorizo sausage. You have to have their special green sauce on the side."}
{"text":"Stumbled across this place while playing with the nearby button on Yelp. This is a very nice little restaurant serving some tasty authentic Colombian favorites. The even have a swell little grocery area next door selling many of their goodies.

Inside is set up with the theme and colors of the county of Colombia. You will see many decorations on the walls that are unique to their culture and way of life. Puts you right in the mode for some excellent food that will make you smile.

Ordered the Delicious Bandeja Paisa plate on my first visit. This is always one of my favorites and a good test for authenticity. It was very tasty and made me want to come back for more. Tried out the Carne en Bistec on my next visit with a Arepa con Queso on the side.

Food is very good and has a nice flavor profile. This place is a true one of a kind in this part of town. I've been to a similar restaurant in NW PHX and La Tiendita Cafe is definitely going to be on my new Mesa rotation list.

Service is extremely friendly. Really enjoyed talking to the gentleman that works during the lunch shift. He was very polite and spoke excellent English. It was fun talking to him about tamales and how they wrap theirs in banana leaves. I wanted to try some but he said they only make them during special times of the year.

Looking forward to trying out the Roasted Chickens and several other dishes that they thoroughly enjoy making. Liked the Chorizo so much that I had to pick up some from their grocery store. Brought them home and cooked them up for my wife.

Parking is a little tricky and they are somewhat difficult to see from the street. There is still a lot of heavy lite rail construction in front of the complex at the moment. Just take your time and you will not be disappointed. ¡BUEN PROVECHO!

4.25 STARS"}
{"text":"I'm no expert in Colombian cuisine, but when you plop down a sampler plate containing no less than four different proteins, I'm going to be a fan. 

It's nice to get some exposure to some foods that have some familiar names, but not necessarily familiar interpretations. This is namely with regards to the chorizo, which is a little less spicy (in terms of both heat and the use of actual spices) than the Mexican or Spanish versions, and a lot similar in texture to the kind of hot links you find a barbecue places. Nevertheless, plenty juicy and flavorful. 

The arepa is a pretty plain corn cake, but nice to have alongside the typical rice. Beans were really flavorful. I'm not sure why they felt the need to include ground beef and top it with an egg, but even that was surprisingly tasty. There was just enough chicharron to appreciate the chewy pork and soft fat without my jaw getting tired.

There was nothing I didn't like, but the MVP went to the tajadas - those fried pieces of plantain were caramelized so wonderfully and so sweet and soft on the inside that really contrasted with the savoriness of the rest of the meal. That it was served in a warm and inviting atmosphere made it all the better, and a great find in downtown Mesa."}
{"text":"This place is awesome!? Super home cooked, great family, date, brunch anytime type of restaurant. They have a bar, superb service and are always playing soccer on the big screens and have music over the game. It's my new favorite!"}
{"text":"The food is MEH, not a Colombian taste. Spansive and litle.pedi una bandeja paisa , el aguacate duro , una cucharada de carne molida (?) un pobre plato sin ningún sabor Colombiano. No gracias ."}
{"text":"This is literally the only real Colombian restaurant in Arizona. I've been coming here since they first started and the work I've seen them put into this business is formidable. It reminds of how great small businesses really are. Owners are super nice, the food is delicious and the little store adjacent to the restaurant has a ton of Colombian goodies you can take home. They deserve every single one of my 5 stars to them. 

Food and drink-wise, here's my go to:

Empanadas for the appetizer
Bandeja paisa or the chicken for main course
Any Juice is amazing to drink 
Colombian coffee and flan for dessert.

Follow those steps and you will leave very happy."}
{"text":"If you're looking for tasty Latin fare when you're in downtown Mesa, this is the place to go. I got the bandeja paisa because it's a hungry man's meal and I wanted not just an abundance of food but also a sampling of different items in one dish. It was a good choice, pretty heavy on the proteins and very tasty, although the chicharon required a bit more chewing than I had expected. Service was fast and very friendly and the location is convenient (along the light rail line) although parking  may be an issue during peak hours."}
{"text":"Colombian food is simple to prepare and easy to serve fresh, size of the portions should be some what comparable for price you charge. Went there to eat today, and nothing was fresh or well presented. Told the owner who proceeded to tell me I was wrong, they are doing best they can and that I was the only one who has complained!! Don't waste your money, and maybe a visit by the health department is in order. Thanks for the \"experience\""}
{"text":"To preface the review: I grew up in a Colombian household in NY eating traditional and daily meals my whole life and dining at Colombian restaurants as well. I have lived in Colombia as well(Medellin to be exact). I ended up moving out to Tucson and a couple months after they closed the last Colombian restaurant in town. When I heard there was one in Mesa, I just had to drive up to try it. I mean why not, I have to have Colombian products shipped to me since I can't find them here and now I hear about a restaurant/store combo? I have to try it. Friday night is when I show up and notice that they're store side is actually well stocked in your usual items that will hold you by: Colombiana, Malta, arepas, milo, chorizo.. Etc... You get the point. I check out the menu as I prepare to order. Nothing complicated. Simple and to the point. I go for the traditional Bandeja Paisa. When it comes out, beans look dry/microwaved. Missing avocado and everything else on the dish was \"ehh\" nothing to brag about. How a simple,traditional dish ended up like that is beyond me. My date had the bistec cebollado and that was sub par as well. Prices were fair. The only reason I would be back was to MAYBE give the food another try but other than that. I'll go there for the products in their little store."}
{"text":"Still on our 'find cool places to eat near the Mesa Art Center' mission - La Tiendita popped up - Colombian food - haven't tried that yet, let's give it a go!

I ordered the Bandeja Paisa - this was described as a traditional Colombian choice - it included Chorizo, Chicharron (pork rind), Carne Molida (ground beef), Bajadas (fried plantains), Huevo (fried egg), Arepa, Aguacete (avocado), Arroz (rice), Frijoles (beans).

The beans were GREAT!  I thought the Carne Molida was a bit bland - definitely needed the Huevo with it.  Chorizo was good.  The Arepa was unlike the Venezuelan Arepas I've had (and I prefer them).  

It was a solid meal, and you will likely enjoy it!

My better half got the Bisteca a Caballo.  That's a steak with tomato and onion sauce, topped with a fried egg with rice, green plantains, and a salad.  She really liked this a lot - I wouldn't order it just because it doesn't come with their frijoles, and they were really good.  :-)

Definitely worth checking out!"}
{"text":"A taste of home is always welcome, and for this Colombiano, La Tiendita hits a home run. I dropped in for lunch while in Mesa and found a clean, well-stocked store and friendly staff. I had the chorizo con arepa and some empanadas for lunch, they were fresh, delicious and authentic in every way. Having Caracol on the TV and a good inventory of Colombian goodies in stock was an added bonus and I'll be back soon on a weekend for the Bandeja Paisa, my favorite dish. 

In a world of homogenized, look-alike, bland dining choices, La Tiendita stands out, as it should. Drop in and taste the real thing."}
{"text":"Since my husband is Colombian, when we travel we always try to find a Colombian restaurant to try out. This was by far the least friendly one we've ever been to. We got the stare down when we walked in and they continued to just sit there at a table, didn't greet us at all. Food was good, only plus side."}
{"text":"Really good, authentic colombian food as if your grandma made it :) alot of products from Colombia that you cannot find anywhere else.. Will be visiting again soon."}
{"text":"Amazing colombian food! Very authentic and great service. You can also find many colombian things to bring home like snacks and arepas :). We love this place so much!"}
{"text":"This is definitely a hole-in-the-wall place you don't want to miss! 
From the outside, it's a strip mall close to downtown Mesa, once you step through the doors you see it's a very clean little restaurant, with lots of Colombian decorations, flags and event a small market where you can find authentic Colombian ingredients! 
The owner has been very friendly and welcoming ( I've been here a few times already) and gets really happy about explaining the dishes to you if you have any questions. 
I've had their Colombian platter plate, breakfast, grilled chicken and and steak. ALL fantastic. 
The breakfast included a simple egg scramble with some veggies, however the highlights were the longaniza, which was a very generous portion of a savory and well spiced sausage and pan de bono, a yucca flour and cheese (think hard grated cheese incorporated into it not soft melted cheese) warm bread. They melted in my mouth, I could've eaten a dozen of them (I didn't but it crossed my mind). 

I did lunch, dinner and take out and have never been disappointed. Try the traditional platter for a real tour of yumminess. This platter can be shared in my opinion, as it brings rice, beans and several meats. The steak is a thin quickly cooked steak that is well seasoned and served with a lot of thin caramelized onion. It's very typical and while I'm not Colombian, I grew up eating similarly cooked steak. If you're not into onions, try anything else, but if you like 'em it's great. 

Finally, I got a whole chicken, fried yucca, rice and beans for take out and it was delish. The chicken was well seasoned, fall of the bone tender and juicy. The yucca fries were so.darn.good. My one year old daughter didn't want to stop eating, so you know it had to be tasty. 

I'll be back!"}
{"text":"Great colombian food and small shopping area filled with South American goodies. I came in for breakfast and ordered the \"Calentado\" which comes with rice and beans, a fried egg, and an arepa. The maracuya juice wasn't a little too watered down. I think I will pass on that next time. The food was delicious and service was pleasant, I will certainly be back."}
{"text":"I'm Colombian and I like this place, I can get some antojitos, buy groceries, send money and gifts to Colombia and there is just plain grilled chicken for my husband who doesn't like Colombian food

I wish they had a larger menu and more things but overall it is OK"}
{"text":"Wou que estafa de Bandeja, la peor que me he comido, ni buen sabor ni mucho menos la cantidad tan pírrica, es preferible pedir la bandeja en porciones separada pagar mucho más, a vender ese platico tan pequeño."}
{"text":"Tried this place on the recommendation of a friend. It was fantastic and the owners are super friendly. 

I had the lunch chicken special which was very tasty and affordable. Cant wait to go and try some more yummy food."}
{"text":"Very impressed with their Bandeja Paisa. Would go here again next time I'm craving Colombian food!"}
{"text":"Great food, flexible for vegetarians, great service, nice atmosphere. Will definitely come back-"}
{"text":"I was happy to hear that in Arizona we had authentic Colombian restaurant. Moving from Queens NY was hard enough leaving family behind and thinking Colombians were everywhere and especially out here in AZ. Wrong- our community is small. I was so exited that I drove to Mesa which is 45 min way from me. I mean people were friendly but not enough tables. My family and I waited at least an hour for a table. It's not the fanciest place but if the food was on point. Who cares right?
 I ordered the empanadas and they were tiny. I ordered 3 bandeja paisas and the chorizo is tiny also. They ran out of chicharrón so they just gave us another tiny chorizo. The sad part was that they only had two  ready and the last one was taking a long time. After my family was eating they explained that they had to make more rice because they ran out. I was not as upset because I ordered soup and was happy with eating something. I asked the waitress to just pack my food to go. To get home and the rice was hard and not fully cooked. 
We had the refago, and they use mexican beer instead of Colombian beer. Just pretty disappointed and will not be going back."}
{"text":"This is a small Colombian Cafe with a very small Grocery and Gift Shop. They serve only Colombian Beverages and our waitress suggested getting a Juice that they blend with Ice or milk. I picked Passionfuit with Ice and it was delicious.

The waitress was very friendly and knew by looking at us that we weren't real familiar with Colombian Food and made suggestions for us so we went with them.

We started with a Arepa Con Quezo and it was tasty and tasted like a Corn Flour Pancake stuffed with Mild Stringy White Cheese. I think anybody would like it.

I had the Arroz Con Pollo. It was made with nicely cooked flavorful chicken,rice, red bell peppers, maybe yuca root, and that familiar frozen mix of Greenbeans, Peas, Carrots and Corn. The dish tasted good but had a high level of salt in it. Oddly this dish was topped with Ketchup (possibly a Colombian Thing I'm not familiar with). On the side were Seasoned Fries that seemed like from Frozen. The salad on the side was some iceberg and tomato. 

Usually I'll give anyplace that prepares chicken well at least a four star rating but with all the frozen ingredients they used,  the salt, and the ketchup on top of food, I'm pushing my rating up to three stars and figure I just ordered the wrong thing for me.

3 Stars I'd give them another try when in the area."}
{"text":"No need to travel 3,144 miles to Bogota, Colombia when you can get authentic Colombian food here in Mesa, Az. First time in and everything was delicious! Started with two appetizers: arepa com carne and plantano maduro, both were extremely flavorful. For main courses had, la Tiendita platter (chicken) and bistec a la  Criolla. Both were extremely flavorful and plentiful. No need to add hot sauce to either meal, enjoy as prepared. Ended my meal with a small Colombian coffee, so good. We'll be back!"}
{"text":"Everything about this place is great, the people, the food...yummy!! And the store is great.  Definitely try the bandeja paisa, and don't leave without getting a pitcher of refajo."}
{"text":"Went here on the recommendation of another Colombiano and was disappointed. Empanadas and juegos were excellent, but the arepas, bandeja paisa, and arroz con pollo were flavorless and lazy cooking. Could be a regional style by the chef/cook but the recipes were not traditional Colombian food that I know and love from home cooking or restaurants."}
{"text":"I really enjoyed this restaurant.  I went with two Colombians and they ordered for me.  I loved the breaded pork and the different kinds of breads and pastries.  What's great about this place is that one gets to try authentic Colombian dishes and drinks.  There is nothing fancy about this place but the service is warm and friendly and the food is very tasty."}
{"text":"Todo deliciosos!!! Y la atención estupenda. 
La tiendita con productos deliciosos de nuestra tierrita"}
{"text":"Being that I'm Colombian I was excited to find a Colombian restaurant in AZ and was pleasantly surprised with how good the food tasted.  Excellent service. Loved the ambiance and the Colombian music playing in the back ground. The owner took time to talk with us and share about her and her husbands business. They've been in business for 4yrs and have seen it grow rapidly. It's a great place to experience and taste a bit of Colombia!"}
{"text":"Stopped in here for lunch and LOVED it. We were going to eat entrees but filled up on the appetizers. 

We had the arepas de la Casa which were so good. I know it's a Colombian restaurant but it reminded me of the time I spent in Venezuela. We also had the arepas. They were also good. Different than Venezuelan style but good nonetheless. My husband had the arepa con carne and arepa con pollo. I tried them both, both were quite good. 

I ended the meal with platano maduro. It was so amazing!  The sweetness of the platano and the cheese they used went so well together. 

One opportunity for improvement would be to work on the timing so the food comes out together. We got it all at different times but it was so good that we didn't care. 

I will definitely be going back!"}
{"text":"Wow no wonder this place has 8/8- five star reviews. I'm adding the mine to the mix. 

I was looking for a place to eat yesterday, Sunday after Day 2 of the Rubber Stamp Show at the Convention Center a few blocks away and a lot of places were already closed for the day or by 5 o'clock. I found this one on Yelp and even though my tummy hadn't completely recovered from the stomach flu that I had a few days ago I decided to give them a shot. Gut instinct, pun intended. 

I sure wasn't sorry. Being South American food I was concerned about it being too spicy for my still somewhat delicate condition. I had nothing to fear. I mentioned to the girl at the counter that I didn't want anything spicy and she assured me the food wasn't. She asked if I would like some recommendations since I hadn't been there before and I agreed. The first thing she did was smile and point to the Bono bread in the little display case to my right and told me how good that was which was totally true.  It was a dollar for one roll and was almost sweet enough to qualify as a cookie, very fresh and delicious. It could have easily been eaten as a light dessert at the end. 

FTR, I'm one of those people that doesn't usually order drinks because it's hard to pay $2 for something I can buy for a quarter from the grocery, but when I saw they had the fruit smoothie type drinks, or fruit juices they called them, I decided to try one out. I believe they were $2.75.  I was going to get a fruit that I was familiar with like strawberry or Blackberry or guava but she recommended the Guanabana fruit drink and I decided to take her word for it.  She asked if I wanted it blended with water or milk and I thought milk would be healthier. It too was extremely fresh and delicious. I look forward to ordering a different flavor next time. 

Then she told me about the daily special, a chicken dish with two sides, and pointed to a lady in a booth that had one in front of her,  It looked absolutely delicious.  It was $10.95 which seemed a fair price for the quantity of food and what I suspected would be the quality, but I I was a little worried that it might be too spicy or tomato-y so I decided to order ala carte off the menu. 

I wanted to try the empanadas so I got a beef one.  It wasn't huge but it was delicious and homemade and seat well with my tummy and my taste buds. The last thing I ordered was what they called a corn cake with shredded chicken.  It wasn't at all what I envisioned. I was picturing a piece of cornbread like you would find in a southern-cooking place that had sort of a chicken gravy over the top. I wasn't too far off with the chicken part but the \"corn cake\" was more like a thick tortilla. That didn't matter because it too was mild and delicious, in fact so much so I was wishing there was some pepper to sprinkle over it. Instead I sprinkled a little bit of the mildly spicy green sauce that came with the empanada over it and that livened it up a little. 

Even though the portions didn't look large I got full before I finished and asked for a container to bring home about half of the corn cake with chicken which I ate later in the evening. I didn't have room for any of their delicious sounding desserts so I will have to go back to try more things including the dessert. In fact I'll have to go back several times I think to try various foods, drinks and desserts. I suspect they will all be as delicious as what I had. All I can say is a sure wish I'd found this place sooner although it is fun to find new places no matter how long I stay in an area. I think I may have seen this place listed before but assumed it was yet another Mexican place and I don't eat a lot of Mexican food since I can get that in San Diego . 

In talking with the clerk she had asked me if I had ever had Colombian food. I told her about some of the various places I've been in the area that were Central and South American--Puerto Rican, Venezuelan, Salvadorian, Cuban, etc but she said that this place was the only Columbian place around. I told her I could definitely taste that it was unique from the other places. I forgot to ask her how long they have been open, if I might have overlooked them on previous trips or if they were recent . And not to go too TMI on you the food sat VERY well on my iffy tummy."}
{"text":"The service was great, food is made fresh and is hot when it comes out and it's not a long wait!  That said I think it has a decent flavor but could use just a little salt.  The Bifstec is good flavor but I had that on the Plato Paisano which is the typical Colombian plate as a substitute for the ground beef which I'm glad I did.  The red beans have a great flavor and the amount of food is great!  The empanadas are decent too!  All in all a good experience."}
{"text":"The food is ok.  The service ok.  But the atmosphere was terrible.  My son thought the television was way too loud AFTER the server turned it down.  We couldn't hear each other at our own table.  There was a WAR movie playing.  Dead bodies are not as appetizing as they sound.  
His Chicken was delicious, thus 2 stars.  Otherwise it would be a 1 star place.  My pork chop was flavorless, as was the rice...of course...If there had not been vinaigrette on the salad I would not have been able to swallow it.  My water tasted like Mexican food...which really grossed me out.  Makes you wonder about the cleanliness of the kitchen area.  We won't be back.  And we are sad about that.  Still searching for the great Colombian food in Mesa/Tempe area. 

Please comment and follow me for more reviews! I would love to have you!"}
{"text":"My current favorite place to eat. I had the bandeja paisa the first couple of times I went and today I had the Cartagena fish and I was blown away by how delicious it was! I was full halfway through but it was so good I finished all of it. Their juice with milk tastes like nothing I've had before, all of them very different than each other. They have good music and a big flat screen playing and the service is really good too. Would recommend to anyone!"}
{"text":"Really good food.

When I saw that there was a Colombian restaurant near where I worked, I knew I had to try it. And I was not disappointed.

This place is in a little strip mall that doesn't really do it justice. I was a little skeptical walking in, because there was nobody else in the restaurant--at noon. But I sat down with my friends nonetheless. The service was friendly, though not necessarily in a rush. They were very helpful with recommendations. I will mention, however, that they weren't very willing to make some requested changes to items on the menu. I know that some of my requests aren't all that easy, but I make them because of food allergy issues, so when restaurants aren't as willing to make changes, I'm more limited in what I can get.

I really wanted to order the bandeja paisa, but I ended up getting a chicken plate instead because I can't eat several of the items on the bandeja paisa plate. My friend did get that plate, however, and it looks amazing (and he said it tasted great as well). My chicken plate was excellent as well.

The food here is really good! We need more places like this!"}
{"text":"I just give 2 stars because I am Colombian but I find this place overpriced,  and the service is very ver bad.  I went twice and the first time service was normal. However, second time there was a guy, probably the manager who did not care for us at all even though he kept looking at our table, he was more focused on attending other people, the contrast was very big between the attention they gave to a bigger group than to us, just two people. they barely care and were rude with me and my boyfriend, so sad and never going back there, I'll tell all Colombians I know to don't go to that place because they really don't care for the customer and take advantage of prices, plus the food I cook at home is 1000 times better...if you want Colombian food, it is a lot less expensive at an international market than there and there are a few other Colombian places a lot BETTER, plus this location is really bad too."}
{"text":"Great service and great food! This place is a hidden gem! Every time we go the service is amazing!"}
{"text":"This is where I'm suppose to post a picture of the meal but I can't. It's been eaten quickly and efficiently. All that is left is the silverware. Now I'm going to buy the other half of this restaurant, which is a little market, with some of the most fresh ingredients in the valley."}
{"text":"The food was excellent, the portions were large and the prices were good. the owner was a nice guy and the store they have was interesting with a great selection of Colombian products"}
{"text":"Just had a quick minute before my flight left and I ate some of the best Colombian food. Not as good as my mothers, but pretty darn close. If you want something authentic this is the place. I ordered the Bandeja Paisa which is a favorite of mine and they hit it out of the park."}
{"text":"Great tasting food. First time here. Quick service. A little pricey for amount of food, but great flavors."}
{"text":"One of my favorite places for a quick snack to a nice dinner.  As a Colombian myself, I can say that the food at La Tiendita is authentic Colombian food.  Their sancocho is thick and full of veggies and juicy costilla (short ribs).  Their pan de bono and almojabanas are delicious, and spongy, and moist (great to take home and during cold months they are delicious with hot chocolate).  Their Bandeja Paisa is a authentic as it could get.  Their roasted chicken is so juicy and scrumptious... it goes well with just rice or crunchy yucca fries.  The service is friendly and quite fast.  You can also get stuff to cook at home from their little store.  You can get authentic Colombian products to take home."}
{"text":"Great Colombian food. The bandeja paisa was legit.  Nice  to have some new variety restaurants open up like this. 

The Flan was really good as well. Service was excellent and very friendly.  Will be coming back soon and often."}
{"text":"For an exclusive taste of all that is Colombian, La Tiendita is quite literally, the ONLY place in the east valley where you can savor Colombian cuisine.

And if it weren't only for the fact that they are the only such eatery in town, there's also the added bonus of getting exactly what you would get if you lived in say, Bogota! The family that owns it is Colombian, and boy do they know the recipies from back home! Proprietor German is always up for a chat, will always welcome you with open arms, and of course, will serve you anything you wish to sample. You cannot go wrong here. If you are a fan of beans & rice, try the Bandeja Paisa which is for all practical purposes the most traditional Colombian dish ever. Can't decide on what you would like to try? They have a sampler platter with just about all the finger foods the country has to offer. Morcilla (blood sausage), Arepa (corn & cheese pancake) and various assortments of empanadas all worth trying out.

I frequented this place during World Cup, as everytime Colombia had a game going on, this place would become party central! I would encourage you to visit this place when the Copa America hits the United States next year, as I can guarantee there will be celebrations and events happening here!

And even if you don't come here to eat, they are also a mini-supermarket, where you can buy Colombian goods that even Lee Lee's doesn't stock! (Lee Lees cut down on their Southamerican section as of late, and La Tiendita made sure to keep that Colombiana soda stocked!)

I cannot sing their praises enough. Check it out, and you too will be a fan!"}
{"text":"Don't go....I hate to throw other Colombians under the bus but the portions were incredibly small ...I had the bandeja paisa and they completely forgot the avocado ...the empanadas were half the standard size...if you want to try Colombian food just wait until you go to, well, Colombia or even New York.  There's one place in Los Angeles that's worth it if you're ever there."}
{"text":"I work right in the plaza right next to them, so this is going to be a great place for me to get lunch. They also have a mart section. I got a huge jug of Horchata concentrate and a couple bags of fried plantains which made me very happy :)

The owner told me and my coworker that they are the only Colombian restaurant in the state. Great food and very reasonable prices! I had an empanada and arepa and both were delicious. Next time I'm going to have to try their $5.99 lunch special of a 1/4 chicken, rice, salad and drink!"}
{"text":"The food was delicious, generous servings. Just like home cooked by my Colombian Mom. Service was great and the food was served fast and nice and hot! If you want good Colombian food while listening to great Colombian music in a nice relaxed environment this is the place! Enjoy!"}
{"text":"First time here and was very impressed. Great service and the food was amazing. Will definitely come back!"}
{"text":"I haven't had Colombian good in years. So happy to find the ONLY Colombian restaurant in AZ."}
{"text":"Had the Piasa plate, yum yum yum. It's traditional Columbian food in Phoenix. Owner has been there 6 years. We were in a hurry so got it to go but we will be back for more. Thank you."}
{"text":"Well priced. Had the natural juice, empanadas and bandeja paisa. Good flavor, well seasoned and good amount of food."}
{"text":"We've been here the past 2 weekends and I give both 5 stars for each visit.  

Last week when we came, we were in a super hurry and had to scarf down our food so quickly that it didn't make it enjoyable.  They were able to make our food quickly and serve us quickly, do everything quickly.  So that was awesome.  But, there was only one other table at the time we came, which was in the 7:30 pm time frame.

Yesterday we were not in a hurry, thank God.

We were so hungry and ordered a lot of food.  My husband and daughter ordered Bandeja Paisa each.  It's a lot of food.  My son and I ordered each the Arroz de Pollo.  Both were good.

But, I hadn't eaten pretty much all day and needed some food, so we had them bring two buenelos out for my daughter and I.  This would be nice to have cheese in the middle, but they were good, but a little dry.

We also ordered drinks - with the kids each getting some horchata with milk drinks and I got a guanabana with water.  The milk last week gave me diarrhea because I am semi lactose intolerant and drinking it with milk, though very delish, gave me really bad diarrhea all night.  

I knew this would be an expensive meal for our family and there was no way I wanted to spend the night in the bathroom dumping our dinner.  Not exactly pleasant so I avoided the milk.  The drinks were reasonably priced at about $2.75 or somewhere in that range.  No refills, though.  Bottles of water are $1.

We also ordered 8 empanadas - 3 chicken and 5 beef.  Both empanadas are so yummy, that maybe next time I will just order a bunch of empanadas to eat and maybe have a queso arepa.  We did not order any arepas this time.

Our bill for all this food came to about $71-72 before tip.  So, this is drinks, appetizers and main entree, so about $18/person.  Not exactly cheap, but I suppose you would expect to pay around this amount if you ordered this much food at a regular restaurant.

Service was great as usual.  I don't know how many times we've been here, but it's been quite a few times.  This evening, all but one table were filled.  I think the  place has like 8-10 tables of at least 4 people each.  One table is for 6-8 people."}
{"text":"Authentic food, my kids loved the arepas! Enjoyed the little store attached to the restaurant with grocery items. The employees were very friendly. Will definitely go back!"}
{"text":"The the food was very good. The portions were perfect. Not too big so that there were leftovers! Will come back every time I am in town!"}
{"text":"Had an unexpectedly delicious dinner here on a Saturday night. It's a small place, and was nearly empty when we arrived. The waitress seemed a little nervous that we spoke no Spanish, but she managed fine. 

I had the Bandeja Paisa, a terrific sampler of some meats and sides. My friend had the Bisteca with plantain, which although not a great cut of beef, had a nice flavorful topping (onions and something slightly sweet) that made it moist and tasty. For dessert, I asked if they could add a splash of dark rum to their Flan, which the owner was happy to oblige. Even asked me for my preference of rum to make sure he got it right. 

Friendly and helpful staff, terrific food, reasonable prices. Atmosphere is a little divey, but gave the impression of an authentic typical Colombian joint. They play movies on the TV, so just as my food was served I saw Jabba the Hut getting choked out by a scantily-clad Leia (Return of the Jedi), but hey, I'm a big boy, I can handle it."}
{"text":"This place has by far the most delicious and flavorful rotisserie chicken. I always order it to go with the jugo de mora with milk. Their spicy sauce is also really good."}
{"text":"So I actually wanted to eat at the Dia De Los Muertos festival but their food selections were sadly not that great so a search on Yelp brought me to La Tiendita. It had been on my bookmarks page for a long time so I figured now was a good time to try them out!

The restaurant is the corner building directly visible from the street in a nondescript little strip mall. One half of the building is the restaurant while the other side offers Latin American prepackaged goods, handcrafted items and a fridge with soda and juice available. 

It was fairly busy when we got here in the afternoon on a Saturday but there were enough empty tables that we didn't have any wait. After browsing the menu I went for La Tiendita plate and had a few bites of the Bandeja Paisa plate. 

Both entrees came out after a few minutes, served on a cast iron serving dish. La Tiendita plate includes a quarter of chicken, salad, sweet plantains, rice and beans. I got a chicken breast and wing and absolutely loved the flavor of it. The meat was very tender and juicy, almost rivaling the tenderness of dark meat! The salad was an iceberg lettuce mix with a light citrus based dressing, and I liked the beans and soft fluffy rice. 

The Bandeja Paisa meats included a link of chorizo, a piece of chicharron, and carne molida (Ground beef). Out of the three I liked the carne molida the best due to the marinade which was citrus infused. The beef was very finely ground and chopped. 

Service was friendly and drinks were refilled as needed. 

I browsed in the store for a little bit. Some examples of the items they had for sale were chocolate candy bars, bottles of liquid smoke, and boxes of bunuelos mix. 

I'll definitely come back for that chicken, and maybe to try out some of their other items like their arepas.

P.S. In case you were wondering, la tiendita means little store!"}
{"text":"Small cafe with an awesome authentic taste of Colombia.  Its been years since I visited Colombia and had their unique cuisine. The place was small, but clean. There is a small store that carries Colombian groceries next to the restaurant where you can buy coffee, candy, n Colombian yucca. Had the lunch special which is charbroiled chicken rice and a salad and drink for about 7 bucks. Tried the empanadas which were awesome and the Yucca which taste better than fries. Truly a great meal at a decent price. Would recommend."}
{"text":"Went in this week.  Had a great bandeja paisa and I had planned on taking half of it home.  Well, so good there was nothing to bring back home.  I also order an arepa con mantequilla y sal.  Very good as well.  I will order the house arepa next time, filled with queso,  Had a nice cold Colombiana to wash it all down.  It was a very good meal.  The little store that is attached also had a lot of Colombian products.  I will go back!!!"}
{"text":"Not a huge fan.  While the staff was very friendly and the restaurant was clean,  my wife and I didn't like the areas very much.  Dry sums it up.  The best part of the meal was the empanadas ($1 but quite small) and the platanos. Check it out, maybe your experience will be better"}
{"text":"This is good Colombia restaurant because of the food, the music and people. The service could be a bit better, but it is not a big a deal. Definitely a must go!"}
{"text":"this has to probably be the only colombian place in the valley and it lives up to its name, with a wide variety of dishes ranging from seafood to meats you cant go wrong with this place. they also have a small market on the other side where you can buy some pretty cool stuff. they are located on the north side of main just west of country club in mesa so if you are in the area and looking for something different outside the box sort of speak, give this place a shot."}
{"text":"I love this place, the staff is super friendly and the food hits the spot for people like me who have not been home in years. You won't find a vast array of goods, but it does have a good enough selection of chips, cooking ingredients and candy."}
{"text":"Always great, super nice staff and wow super delicious Colombian food, in a comfortable restaurant. I have the fish dishes, Cartagena Fish (amazing coconut milk sauce) or the pescado frito, my girlfriend loves the chicken (Arepa con pollo) and of course there great empanadas! I have not had Colombian food this good since I lived in Queens, NY."}
{"text":"It is very hard to find south American food in Phoenix. I was very excited to try  La Tiendita Colombiana.
I had the bandeja paisa- which was very good.

They also have  little store with some Colombian foods, clothing, etc.

It felt like a little slice of the east coast!!"}
{"text":"I'm so glad I found this place! The food is delicious way better than I expected !!! I loved the chicharron will come back again for sure"}
{"text":"This is a great place to get tasty Colombian cuisine. They are very friendly, they have big screens. The food is really good, and they have really good drinks. Great place to go for Latino food and have a change from Mexican food (which I love) but is so prevalent here in AZ. The food is not so spicy, but is very flavorful. It's in a small shopping center, so it has a store front feel to it, but it's worth a visit."}
{"text":"Great mom and pop shop. Food was good, but not great. A little bland for my taste buds. Makes me miss the Arepa place that closed down : ("}
{"text":"What is La Tiendita?  Some reviewers treat it like an economy restaurant serving Columbian food, but if so, then the prices are a bit high -- $7-9 for a standard breakfast, around $3 for most drinks, etc.

Of you might call it is an ethnic restaurant, which is what I would say.  As an ethnic restaurant you forgive the \"basic\" ambiance and applaud the friendly service and cleanliness.  The food, however, is spotty and the menu choices limited.

The best buy were the empanadas at $1 each (most of us would call them croquettes).  A crisp tasty corn meal outside was stuffed, supposedly with beef, but actually with potatoes with a few morsels of meat.  The one dipping sauce available was spicy but not tasty.  

The roasted chicken had a great rub but the breast was so overcooked that it was not only dry but hard to cut.  No sauces of any kind to alleviate the problem.  The arepa is a corn pancake, in our case stuffed with cheese, tasty but also dry.

The platano maduro was the best dish, but at five bite size pieces for $3.50, it was overpriced.  Give us a bit more please.

I would not make a trip of any length to go to La Tiendita but if you are in the neighborhood, try it - you might like it better than we did."}
{"text":"This place is amazing! Beef empanadas are my favorite here! Taste the way my grandma makes them except I don't have to travel 3k miles to get one. Bandeja piasa is my go to main dish here. Authentic taste, and authentic feel. Small spot but definitely worth visiting!"}
{"text":"We love to look up Colombian restaurants when we go out of town.  Tiendita had great reviews so we gave it a try.  The staff was extremely friendly.  Camilo was our server and was very helpful with explaining the menu and always had a smile.   We got the Plato paisa. We loved the portions of the plates...not too much or too small...just right.  The food was flavorful but not too spicy for those who's stomachs can't take it (like mine). Will definitely come back when we are back in Phoenix."}
{"text":"I have no idea why this place has good reviews... Maybe this is it for colombian food but is sooo not that good i am sooo sad. I just moved to Az from NC where there was sooo many delish colombian restaurants... I went to have their chicke. With beans and they were ehh... Honestky felt like mexican beans.  Maybe bc i am colombian i am picky about the food.

The enpanadas were good and the ajiaco was really good as well... Not sure i would go back."}
{"text":"Basis for my starred ratings (which skews heavily to the food or drink):
1 star:  Never again.
2 stars:  Poor food, poor experience, extraordinary measures in order for me to come back.
3 stars:  Average, nothing really special, nothing particularly bad.
4 stars:  Very good, would definitely return.
5 stars:  A favorite, one of the best.

This is going to be a rarity.  I've had my fair share of Latin and Caribbean cuisine, but this is only my second time having Colombian.  I only ordered one thing - the bandeja paisa.  Based on this small sample size and one dish, I'm giving a 5-star review.

I'll start with the two minor hiccups.  For a drink I ordered Pony Malta.  It is not as good as Malta Goya.  And it was a little warm.  Also, when I arrived, they were low on rice and had ot make a new batch - no problem.  I waited 20 minutes and my dish came, the rice was even just a little overcooked, but it was fine.

Now for the good.  Great size plate, good value.  The plantains were good, as was the sausage and the beef.  Came with one arepa, also very good.  The absolute best part of the plate - the beans.  These were, in my experience, some of the best beans that I have ever had.  When comparing Latin cuisine, comparing the different versions of beans adn rice is a good starting point, and these beans were superlative.  Perfect texture, great seasoning.  Also excellent - the chicharron.  I twas thick and chewy with perfectly crisped skin with deep porky flavor.  These two things made the meal, mostly the beans.

So there you have it.  An excellent Colombian  joint.  My buddy who lived in Medellin for 3 years also approved."}
{"text":"My wife is from Ecuador and I lived there for years as well - the menu was huge and the quality  of service and food was excellent.  If you like house made hot sauce, ask for their house made salsa picante.  My wife loved the experience; don't let the store front fool you - they have soccer matches on as well and the whole experience takes you back South America."}
{"text":"Okay, lets start with the food....My partner and I shared the \"bandeja paisa\" because it's such a HUGE plate right? I believe it was around $13. It was a small plate and flavorless. The meats were super dry too. They brought us bottled water, which I am thankful for now because I read another review saying that their normal water tastes unclean. The waitress, however, did not give us an option, RUDE!  My partner, who is Colombian, was not fond of the food either. The arepas were thin and tasted like nothing. I've had good Colombian food back east. It's such a shame that west coast doesn't have a good Colombian restaurant. Now....the service! Is it hard to smile and be polite? The girl, waitress, probably was a family member who did not want to work that day or something. We were the only people in the entire place and she only checked on us twice, to order food and to bring the check. She was more busy watching sponge bob on the television. I have to say this...who the F puts on sponge bob for clientele? I will not be going back here again, EVER. Do not waste your time or money. And to this establishment, work on your dishes and customer service. PAY attention to the people who bring you MULA, lol. NOT hard, like at all!"}
{"text":"This is a very nice local place to try .We are satisfied and will be back for sure.I had the
Lunch special chicken rice and salad and my husband had the banjeda with 3 meats and loved it !It feel like Home food well Prepared with the perfect balance of seasoning! empanadas Are Delicious and fresh ! thanks again for this delicious
Colombian meal!"}
{"text":"Absolutely amazing. My entire family is from Bogota and we lived in New York where Colombian food is more available. Discovered this place today and already going back tomorrow. Amazing and well worth the trip! Thank you so much for the kind service too!"}
{"text":"Definitely worth taking the time to check this place out. I like the variety plate w chorizo sausage and plantains. Very filling and a nice change. Clean restaurant.. good service. Recommended."}
{"text":"I am Mexican and my wife is from Cali, Colombia.  We found La Tiendita by searching the net for anything Colombian in this area.  I disagree with the assessment of the previous poster on the food.  Colombian tamales ARE quite different from Mexican tamales but are very tasty.  It is basically a stew of meat, potatoes, carrots and other veggies and rice loosely held together by masa.  I find it rather authentic.  I have traveled to Colombia more than 10 times and the food also meets with the seal of approval from my Caleña wife and countless other Colombian customers.  It has become a weekend tradition for us to ride on our motorcycle on weekends to sample the weekly traditional plate.  The food is tasty and plentiful, but a bit pricey when compared to Mexican fare.  My only disappointment is the lack of variety in the items that are available for purchase at the store.  When I first heard of this store I thought I would be able to purchase some Ron de Caldas and guarito but no dice.  Luckily those items are available online from wine suppliers at just about the same price as in Cali.  The owners of La Tiendita Cafe are a very pleasant couple and will make your meal enjoyable.  Enjoy!"}
{"text":"Good place to watch a soccer game. Service was good for how packed it was the day I visited. Food was very flavorful and the atmosphere was inviting."}
{"text":"Un pedacito de Colombia en el Valle! I traveled to Colombia and fell in love with the culture and food (especially the Empanadas). I would definitely recommend this place if you want to eat like a Colombian again. Oh and they are now on UberEATS!"}
{"text":"My wife and I are planning to go to Colombia soon.  We figured we would at least see what kind of food we would be looking at.  La Tiendita offered that glimpse.  

For lunch on 03/03/2018 my wife ordered the La Tiendita Platter.  Basically it was some roasted chicken, maduros, red beans, and rice.  My wife liked it.  

For me, I ordered the Cartagena fish.  It was a grilled/baked fillet of fish with coconut milk, rice, salad, and patacones (plantain chips).  It was good.  For me, being Asian, I am usually eating coconut milk as part of a curry or sweet.  While this was quite different, as the coconut milk did not have a strong sweet or spicy taste, it was still good.  I would have perhaps preferred the grilled fish without the coconut milk, but it was still good.

My wife's nephew, Tam, from Vietnam, was with us, and he had the pescado frito.  It was a pan-fried fish fillet with some patacones, rice, and salad.  He says that the fish was good, but perhaps a little dry.  Maybe, with a lemon wedge, or some kind of a side of chili sauce would have liked it more.  He had a beef empanada along with his meal, and liked it.

My wife and I also shared the arepa a la casa, cheese arepa.  It was good.  It was what we expected.

The thing that perhaps that really made my day, and perhaps that of Tam, were the juices.  We both ordered a guanabana juice (soursop juice).  I had it with water.  It was good.  Tam had his with milk.  He said it was as good as what he used to have on the streets of Ho Chi Minh City Vietnam (odd kind of comparing Colombian food to Vietnamese food).  In any case, it was good.  My wife liked it also, and wished she ordered one.  

The waiter we had, a gentleman, was very attentive.  This whole place does convey the feel that you are in Colombia."}
{"text":"awesome service and food wifey and I will definately be back !!
The empanadas were delicious , I had the special of the day and 
It was so satisfying."}
{"text":"The food has a very great taste overall. I ordered two beef and two chicken empanadas. Both taste great! Could use more meat, they loaded it with more potatoes. Still good. La bandeja paisa really hit the spot. Great plate!!! Great place! Definitely would come back. The guanabana with milk was very tasty. Our waiter recommended it. He was pretty nice too."}
{"text":"We showed up at 6:30 on a Saturday and all the tables were full...great sign of good food to come.  I asked if there was a wait for a table and was told there was an event and most people would be sitting for a long time...that's it.  Mind you the extent of this event was a Santa Claus walking around and some salsa music being played.  Basically felt like I was being told we weren't welcome so we left.  Maybe if we spoke Spanish we could have spoken with one of the adults running the place but that wasn't an option...English only patrons were handed off to the teenager.  Recommend you call ahead before driving across town for this place."}
{"text":"considering my husband is Colombian we decided to check this place out. We are from California and have tried many Colombian places. My husbands also a chef & I have high expectations considering his Colombian food is amazing! Lol This place though was probably the worst we've had. Service was poor from the beginning of walking in & the bread brought to us when we were sat down was burnt to a crisp. pics below. the empanadas were so small for $1.25 each and ok flavor. The rest of our food was very bland and not flavorful at all. portions very small and over priced. not worth it to me."}
{"text":"Ok while I try put the MOST Proper way to convey the Culinary Fantasy I just experience with the First thing I picked off the menu !!! I'm already dreaming of the next visit which I think maybe Tomorrow !!! Put it this way, if you've ever been North and visited Sedona and TRUE Enlightenment touched your Spirit ! You will need to walk threw their doors and experience it for yourselves and then YOU CAN THANK ME Later !!! Try anything on the Menu and then wait for the POP ! That will be your Brain being BLOWN !!! I can't wait for my next BB !"}
{"text":"The only and best authentic Colombian Restaurant in Arizona.
 The food was fresh and tasty. Food was served pretty quick. We ordered bandeja paisa and picadilla for 4. Both plates were delicious. For drink you want to try their milk shakes all are so awesome.
Owner and sever were so friendly and helpful, great vibe! There is also a little store where you can buy stuff from Colombia
 I highly recommend this place"}
