{"text":"Best authentic Mexican place. Food is ridiculously good, prices are fair and the staff is super friendly. Will always come here from now on for Mexican food!"}
{"text":"The food is SO GOOD!! Love going for the authentic food and the busy hometown atmosphere! And you can't beat $1 taco Monday!"}
{"text":"After living in So Cal for 5 years and to find this place is the biggest blessing! The food quality is TOP NOTCH! Couples with wonderful service! 

They cater our monthly company meeting. We use to frequent multiple local places for this. But for the last 4 or 5 months LA tap has come through with their consistency and completely won us over. I won't go into to detail about the food. IT'S ALL VERY GOOD! If you ever have a problem with it just talk to Jose about it and I assure you your concerns will be dealt with in a timely manner. 

If I could give 10 stars I would! 

Thanks La Tapatia for keeping it real!"}
{"text":"Love the food here! I have to admit I'm a bit biased because my in-laws own the place, but I've been eating the food for 8 years now and I still love it. My favorite is tacos with any of the meat varieties besides tripas that is a bit too much for me"}
{"text":"Wonderful food and such friendly employees, a little loud, but the food makes the noise worth it."}
{"text":"It's all been said in these other reviews. This place is incredible, super authentic, crazy delicious. I'm just here as another voice confirming the rumors. GO HERE!!!"}
{"text":"The most amazing fresh homemade tacos!!! Great service and friendly staff. It feels like you're eating at a friend's house every time. Have to try the chorizo tacos...and everything else :)"}
{"text":"Hands down the best Mexican in southern Oregon. Good prices, good atmosphere, super authentic."}
{"text":"Spent a great deal of time trying to find a replacement for my favorite burrito joint down in Santa Rosa CA. after moving up to Medford.  Well, I found something better.  Love the food at this place, especially the Al Pastor.  It's friggen the BOMB.  Do yourself a favor and hit this place up, and if you're like some of the people reviewing and don't like to be in an environment that feels like you are literally in Mexico (I love it), get it to go!!! :)"}
{"text":"Delicious!!! Excellent tortillas, tasty burritos, very good mole. Service is friendly and efficient. Best get your food to go, unless you enjoy the television being on during your meal."}
{"text":"inexpensive and so yummy!!!!! it reminds me of the best mexican food in LA!!!! if your looking for good mexican food go here!!!!"}
{"text":"This has been my favorite place to eat tacos. There's something special about the place and the people, and of course the food. No wonder it was rated as the best place for tacos. Also I love to support our local stores. I encourage everyone to go for a great meal. Provecho!!!"}
{"text":"Love this Mex. Dive!!!! Dollar tacos on Mondays!!!! Doesn't get any better that that."}
{"text":"I spent summers in Laredo and San Antonio and although I am a gringo I have two Mexican Tias. This place would be popular in the interior of Mexico or the south side of San Antonio.
The family that own This place are the nicest people you could ever meet."}
{"text":"Best Mexican Food in S. Oregon - don't even consider eating at El Tapatio - they put cheddar cheese on beans. This place, La Tapatia, is the real deal. Get this food - ignore the other ones, especially the chain restaurants. La Tapatias Tacos = great. Do try the Tortas - cheap, excellent. Really, just top notch."}
{"text":"After a very long day of traveling, my husband called La Tapatia for restaurant hours
and found to his disappointment that they were about to close early on a Sunday night.  However, the young man who answered said to come on in and not worry.  The staff was very friendly and the food outstanding."}
{"text":"There is only one great place for authentic Mexican food in the Rogue Valley. La Taptatia is the best, hands down. The tacos & tostadas are my favorites, but everything on the menu is good.
The staff are always friendly and working quickly. The place can be crowded on Monday when tacos are only  $1.00, but that doesn't stop me."}
{"text":"OK don't get me wrong this place usually is AWSOME but on this visit not up to par.
They must have changed cooks because :Salsa was watery, Tortillas were raw and undercooked, meats were flat and under seasoned.. What the heck?  This place usually is the best Authentic (not americanized) little taco place in this area. Its usually worth the trip there. Please fire the new cook."}
{"text":"Delicious cheap tacos. I rarely order anything else because of how difficult it is to find good mexican in the valley. Highly recommended."}
{"text":"We have been going to La Tapatia for years now and we still love it.  We used them for my husdand's 40th birthday party and everyone raved about the food.  We had the full taco bar with chili verde, chicken, tortillas, beans, rice, two kinds of salsa and a tray of cilantro, onions and lime wedges.  Oh and if you use them for catering make sure you get chips and guacamole (I don't think they serve the guac in the restaurant).  It was outstanding.  The guacamole is delicious and the chips have this wonderful spice on them.  They are so much more than the typical salted chips and plain guacamole!  They give you more than enough food to feed everyone which is great because you will want leftovers :)

The staff is always friendly and the food is consistently the best in the area.  Jose was very professional and made sure we had everything we needed for the party.  He always called me right back and even made a follow-up phone call afterwards to see how we liked everything."}
{"text":"This place is a gem. I always get the fish tacos, which are delicious and recently got even better somehow. The salsa bar also just got an improvement with some kind of guacamole-sauce and another hot sauce. Just keeps getting better! Fast service for a great price with quality ingredients. YUM"}
{"text":"Best food in the valley! It's a classic hole-in-the-wall place. One dollar tacos on Mondays - can't argue with that bargain. The chorizo ones are my favorite!"}
{"text":"By far the most authentic Mexican food in Southern Oregon. I sure do appreciate a great chile relleno and they know how to make a mean one at La Tapatia. I've eaten lunch here about once a week for the last four years and have never been dissapointed. Fresh made corn tortillas that are also for sale! Although not the most visually appealing dining area around, the food more than makes up for it. Great for take out!"}
{"text":"Hand down the best. No contest. I've been going there since I've been 5 years of age. Don't question. Dollar Tacos at their quality of service and food is always a win in my book. Don't second guess your thought and just go."}
{"text":"Wow this place is awesome. We ordered the al pastor torta, an asada taco, and the posole and gotta say everything was extremely authentic and delicious. The meats are perfectly seasoned and the service was great. Oh yeah and the horchata was very good. I could tell it wasn't one of those fake powdered horchatas."}
{"text":"La Tapatia catered our wedding and our guests raved about the food all night. Jose worked with us throughout the process and was very attentive to our needs, even when we threw in a last minute vegetarian request. We got carne asada, chicken, and al pastor but you can't lose when ordering there. We'd highly recommend anyone looking for a casual dining experience for a wedding look to these guys."}
{"text":"I grew up in Phoenix and this is truly where the best real, authentic delicious mexican food is. It's a small-town restaurant, so t is not \"fancy\", but if you want good satisfying food this is where you will find it! I live 30 minutes away and I still find myself making the trip over there just for the rice and beans."}
{"text":"I've been to this place many times.  I've finally decided it deserves 2 stars.  Here's why.  The food is pretty good.  It's not noticeably better than other authentic taquerias but above average.  However when it comes to location it gets a 1 star.  It's dingy and often smells in it.  That's not because it's not clean necessarily but because there is a butcher shop inside The surrounding location is drab.  Then for value.  It would get about 2 stars.  Yes they have dollar tacos some days but the tacos SHOULD ALWAYS be a dollar.  They are like the taco version of sliders.  Tiny.  You really need to eat about 5 or 6 to be somewhat satisfied.  If you get a side order plus a soda-you're easily spending over $10 for ordering at the counter.  If you want an enchilada platter-it's about $12 or $13 plus beverage and \"tip jar\" costs.  Mixed bag-fairly expensive, drab  interior, and food is good but isn't good enough to make up for the detractions.  It is seemingly a beloved place in the Medford area but it is a bit overrated."}
{"text":"Cheaper than Mexico. Very authentic taco's. Popular with the locals. I feel lucky to have found this gem. Salsa is good but I have had better. You might end up seated near a raw meat cooler if the place is packed, which could either interesting or disturbing depending on your mindset. I will definitely be going back."}
{"text":"The best Mexican food around hands down.
Also find some stellar meats in the deli case."}
{"text":"Great family owned place with delicious authentic mexican food.  One of my favorite restaurants in the valley."}
{"text":"I've eaten here for lunch before, but had not brought the family.  This time they all came.  Wow, everyone liked their food ! Very rare with teenagers.  This place feels authentic too. My stuffed pepper was full of flavor."}
{"text":"Tapatia has the closest thing you can find to authentic tacos in the Rogue Valley. Everyone from my husband to my one-year-old loves the tacos. Also worth trying is the chile rellenos. If you go on Monday nights tacos are $1/each - great deal!"}
{"text":"Authentic rare find that's above and beyond main stream Mexican meals in southern Oregon.  From the outside you wouldn't expect this gem.  Wonderful, delicious!  Love you"}
{"text":"no question the best tacos i've ever had.  ever.  had. ever.  big fan of the al pastor (seasoned pork).  Looking for some backyard BBQ-ables?  Both the pollo and carne preparado are a hit at any party.  Think you've had a good burrito?  Ask for the wet burrito and take notes.  They are frickin AWESOME.  
(side note: we mixed this up with El Tapatio the first time by accident.  just don't. don't do that)"}
{"text":"Definitely a contender for best and most authentic Mexican restaurant in town. Shredded beef tacos were different and better than any I've ever had. Beef was apparently marinated in some secret (and delicious) family recipe."}
{"text":"Loved this place we were in Medford visiting family and after three days of Asian food I needed a good plate of Mexican comfort food.  Food this place in yelp and I was very pleasantly surprised.  Being from the bay area we are spoiled with good taquerias but I must say I almost forgot I was eating in Mexican food in Oregon.  Try the toungue tacos if you are brave, and enchiladas verdes are also very good.  Next time I m in Medford I know were to go!"}
{"text":"Any time I'm passing through Southern Oregon. I eat here. Authentic, family operated, and absolutely delicious. An absolute must!"}
{"text":"Truly authentic Mexican food. The cabeza tacos are phenomenal and although the wait times can be long, it's truly worth it. So cheap too. $1 tacos Monday through Friday is insane in this day and age"}
{"text":"Housemade tortillas + authentically marinated meats= Best Taco Ever! 

You would never know from the exterior of the building but this joint has the best tacos in the state. Evidenced by the dozens of people you will see eating tacos right next to you no matter what the time of day.

You have to like authentic! This is no healthy, Americanized joint. You may find a bit of gristle in the meat occasionally (because it is real!) and lard in the beans, but you won't care because of the flavor explosion.

Watch out, this may turn into a taco addiction. Interventionists won't be standing by. 

And for something different, try the Sopes. Yum! Yum!"}
{"text":"This hidden gem in Phoenix has:

Genuine, friendly staff
The most delicious authentic tacos I've ever had
Excellent prices, especially on Mondays"}
{"text":"The Bomb, 
This place Rocks for Authentic Mexican food in the RRV.
Not up to So Cal Taco stands standards but pretty close. Blows everything else in the area away. It's nothing fancy, they ain't trying to sell you the store. 
My kinda place!"}
{"text":"Best tacos in all of southern oregon.  When I first walked in, I was in shock, the hallway stretched all the way back(as did the customers), passing a tiny Mexican shopping area, to what seemed an underground taco joint.  My boyfriend brought me, and had suggested 'we get there quick because they usually sell out', with that being said, after I tried those phenomenally authentic tacos, I really know why.  
The tacos are $1.25 and they are about as filling as two.  
Also do not be afraid to try some of the exotic meat that I'm sure most of you can't pronounce ;)
But I would be weary on the hot sauces, even the medium is extremely spicy, but, that's just me. Just taste them at your own risk, they even have a ghost pepper hot sauce, I believe. 
Every single thing I've tried there, has been fantastic.  
And like I said, best tacos in all of southern oregon."}
{"text":"Yum yum yum! In search of a good mexican tacqueria, we tried this place out and were not disappointed. I had the chicken mole special and my husband had the carne asada plate. Both were very good.

The place is lacking in ambience, as it's located in the back of a carneceria. The cafeteria style tables and folding chairs offered for seating leave something to be desired. Asthetics aside, if you're looking for good food, decent prices and a reasonably quick meal, this is a great find."}
{"text":"Very delicious shrimp la crema special today, very large portion.
Husband said the fish tacos tasted like a  reheat though.
Still, best in this valley.
This is the only restaurant around here that we \"crave\"."}
{"text":"Our favorite Mexican spot in southern Oregon. Food is great staff is friendly.  Atmosphere is cute and cozy."}
{"text":"This is one of the most authentic Mexican food eat ins I have ever experienced. The prices are extremely fair and the food is amazing. 

I ordered 6 tacos and two cokes totaling around $11. The meal was big enough to feed two and was freshly made. The pork is to die for and the carne asada is killer. Will definitely be coming back in the near future!

The staff was extremely friendly and the food was prepared in a timely manner."}
{"text":"Authentic Mexican.  Yummy and delicious.  The facilities are down-scale but I suppose that's part of the charm.  The carne asada plate is a favorite for me."}
{"text":"Loooove this place. Definitely what some people would consider a \"hole in the wall\" but the food is amazing. The owner takes the time to talk to everyone and is not above his workers. Before moving away, I'd go almost every Monday for the dollar tacos. The service is always so quick- but they manage to stay pleasant and make sure your needs are met. Everyone is always in good spirits as they eat. It's a word of the mouth place, but it seems to suit them well. I miss having authentic tasty Mexican food near me, can't wait till I go home to eat here."}
{"text":"Consistent, friendly professional service.  Jose Bugarin is tops and great to work with...always.
Fair and affordable prices with unsurpassed quality and taste.  I had a recent party and served La Tapatia.  Fabulous!!  Thank you Jesus and staff for your help and perfect assembling of tamales, chile verde, chile rellenos and all the sides.  The best part is eating all the leftovers."}
{"text":"it smells wonderful and it is clean just the way I like it! Major improvement!!! I will definitely give you all five stars... 
I will have a bomb meal this evening!!!"}
{"text":"Simply the best. Nothing fancy,  just absolute deliciousness. Authentic Mexican food at its finest."}
{"text":"We were really disappointed in this place .  I hate to leave a bad review but... my burrito was so cold that the cheese was not even close to beginning to melt! Not to mention the entire burrito was filled 95% with their cold dry rice... a little blurb of beans in the first bite and that was it! My boyfriend and I both ordered \"burritos\" and they came out as \"wet\" burritos covered in cold wet sauce and were soggy... which is fine if you ordered it that way? We did not. This place gets two stars just for their good salsa bar: 6-7 flavorful house-made salsas."}
{"text":"Best tacos in the rogue valley! Go check it out.. Little hole in the wall that is quick and delicious"}
{"text":"Every time my wife and I stop in Phoenix for the night, La Tapitia is the ONLY place we'll eat!! Had I not found it on YELP, we never would have eaten there. For the life of me, I can't understand anyone complaining about this place. Awesome, inexpensive and authentic Mexican food. What more can you ask for?"}
{"text":"Cool joint with hot food. All tacos were great. The different kinds of salsas were all fresh and flavorful. Very well priced. Lunch for two was 12$."}
{"text":"La Tapatia is great.  Cool mexican culture, friendly staff, grocery store, mexican party dresses and cowboy boots up front, crazy meat counter to the left, comfortable, casual restaurant in back.  

Love the tostadas, fresh tortillas.  Didn't know the burrito would come with sauce on it.  

Busy place."}
{"text":"When I thought Mexican food couldn't get any better! I've eaten here 4 times in the last two weeks. Fast and no frills. Carne Asada burrito is awesome-  the steak is well marinated/grilled right, the Tortilla has a great flavor, the salsa bar/pickled veggies are a nice addition, rice is fluffy....you get it. I like the set-up- small grocery, meat cases, and casual place to get something to eat.
 I think that people who are complaining about the service are used to restaurants where they: kiss us to you, bring you barely passable food, and then charge you twice the money. Enjoy it for what it is and stop being so snobby."}
{"text":"Oh so so so so so so good. It is the most authentic Mexican food I've ever found. My only gripe is that the building is pretty old and it can get cold at times. But the food is excellent. My favorites are definitely the tacos and the chili rellenos."}
{"text":"I find myself craving the al pastor taco a lot! Their al pastor is some of the best I've ever had. The great prices are just an added bonus! It's a shame I don't live near by anymore but any time I find myself in Southern Oregon again I know where I'm going for lunch!"}
{"text":"It's the closest to mexican food I find in my home state of California. Their tacos are are great and they have good salsa too."}
{"text":"Although we regularly eat here when we're in Medford, we hadn't been here for over a year and were surprised to see that they had enlarged the seating area.  The restaurant now occupies much more space than the market.  The best news is that the food is still fantastic.  This time my wife had the taco salad and I had 2 fish tacos & a burrito; couldn't eat all of mine, so my wife helped me eat the burrito.  This is undoubtedly the best Mexican restaurant north of the Los Angeles area of Calif.  I wish we lived closer!!!"}
{"text":"There's nothing more I can add here: the tacos are the best in the valley, hands down. Go on Mondays when they are on sale and don't forget to drink the big vat of horchata because it's best shizz around. Repeat. Enjoy."}
{"text":"This place is dirtier and grimier than most of the places I've stepped into in South America. I've eaten food from here twice, and not by choice. 99% sure I'm going to get food poisoning or some disgusting disease every time I so much as drive past the place. They have super cheap food, but when you taste it and see where it's being prepared, you're surprised it's legal to even call it food and sell it to people. Staff is complete crap. Parking lot is a gravel death trap behind the shed they call a restaurant. Weird, dark, creepy market with uneven flooring inside before you even get to the \"restaurant,\" which is a dirty counter with some plastic tables and folding chairs off to the side. The two times I've gotten into the unfortunate situation of having food from this restaurant have been to-go orders for large groups, hence my inability to eat elsewhere. Ugh ugh ugh. Won't be removing or backing down on my honest opinion any time soon!!!"}
{"text":"I ate their menudo and felt like I was eating from the fountain of youth. Their menudo brings you to a high level of relaxation. I believe that I was levitating to see a higher power. It is the food that can \"levantar un muerto\"

Great flavor, light caldo, tortillas hecha a mano. I brough extra so I could bring it home (300 miles away) 

Definitely, I will make special trips to bring more home and keep it in the freezer."}
{"text":"Best tacos in Southern Oregon hands down. Also that authentic feel like you are eating out of the country!"}
{"text":"This place is absolutely amazing. You just have to find it. Buried in the back of a convenience store, you have to look for the sign carefully. Greeted with friendly faces and a busy kitchen, it seems obvious that you'll be getting some great food; and you will not be let down. I don't think there is anything on the menu you won't like, it just depends on your tastes, and you definitely can't beat the price or speed of service. Just expect a line of you're at peak meal time. Their chicken is to die for, their chorizo is like nothing else, and I loved the chile relleno. Tacos are $1.25, and pick up a dozen fresh tortillas for the same. Decent ceviche, and great carnitas tostadas. Top your meal off with their horchata and you will leave a very happy customer. Great family run atmosphere. I can't say enough about this place.
P.S. - be brave and try some meats you may not usually go for, such as the stomach. Very much worth it."}
{"text":"My brother and I went here the other day upon a recommendation from a friend. I was amazed at the flavor, so authentic. We both had fish tacos, rice and beans. Delicious! 

I also ordered horchata and food to-go for my wife and daughter, perfection. I look forward to my next excuse to go to Phoenix and get more of this wonderful food. 

The only reason this review got 4 stars instead of 5 is because my wife was not very impressed w/ the vegetarian burrito (raw onions, blah)."}
{"text":"Absolutely the most authentic and best Mexican restaurant north of San Diego. Amazing tacos in amazing salsas and amazing refried beans. Don't leave without a pint of the beans. The beans are the bomb!"}
{"text":"Do not confuse this with El Tapatio in Ashland. LA tapatia is in Talent on 99. Just a few doors down from Roscoes. Grocery store up front and best Mexican food in the Valley in back. I have never had such a good Chili Releno. I especially like that I could order it w/o beans and rice. The tacos are excellent and the tortillas, best ever. Nice people, lovely place to eat. Bring a friend and take some chances."}
{"text":"Good basic inexpensive Mexican food. I usually order the simple stuff - tacos al pastor or carnitas and then split a plate of rice and beans with the spouse who eats much further off the menu. Inexpensive, tasty, pretty much all you could want, especially for a lunch or light dinner. There isn't much in a simple taco so it lives or dies (so to speak) on the quality of the ingredients and their meats are fantastic. 

Can be very crowded at lunch time and parking is minimal, particularly since Phoenix is tearing up the streets."}
{"text":"Excellent!  Dollar taco night plus Chile Relleno dinner was great. Passing through town, a great find!"}
{"text":"This place outside is nothing to stare at but inside is like Narnia. Lol. This is the closest to authentic Mexican food  in Medford I have tasted so far.  Everything was delicious. You cannot beat the one dollar tacos Monday through Friday deal. I bought a ton of Mexican candy too. Definitely will go back."}
{"text":"It is at the back of the Mexican grocery, so it looks like a basic taqueria.

We were a group of 4.  Our friends from Ashland recommended this place.  After eating, all our plates were empty.  So we all liked what we ordered.  

I had the Fish Tacos & my wife had the Taco Salad.  We usually share but I was enjoying my Fish Tacos so much I finished them all.  

Everything was very reasonably priced.

The service was great, they were very friendly.  This is a family owned operation.  We arrived just before closing, but the father kept telling us to take our time.  That they were in no hurry to close.  I met Jose, a younger family member, who recognized us from Salsa dancing the night before at a place called Tabu in Ashland.  We spoke Spanish with him and traded a few stories.

All in all a fun time."}
{"text":"If you haven't tried dollar taco Mondays than you are missing out. Best Mexican food in Southern Oregon hands down. It may not look like a restaurant from the outside, but walk to the back and you will find a busy restaurant full of foodies."}
{"text":"Best tacos ever!  What else can be said...go eat at La Tapatia!  The carnitas is amazing.  The homemade salsas are excellent.  The people running the place are super nice and welcoming.  Love La Tapatia!"}
{"text":"I'm giving this one a 3 star rating based on food quality only (taste would probably earn it a 4).  This place is like walking into a eatery in Tia Juana.  It's a fun little market and restaurant combo.  The food was delicious, but the beef and chicken plates we ordered contained lots of gristle and fat.  I'd go back, but would definitely order something different.   A little pricy for the quality, too."}
{"text":"Best Mexican food around!  Everything tasted so fresh and service was great. My husband had a chile relleno that was excellent!  I had a vegetarian burrito that was delicious. The portions were very generous and we were able to bring food home for lunch the next day. It was just as good the next day!  We will be returning for sure!"}
{"text":"Love their street tacos, especially beef cheeks &chorizo! My husband lovesss their pork rind, stomach. They are sooo good, simple and hit the spot every time!"}
{"text":"6 stars 8 days a week!!


Sooooo darn good!!!


We will eat here twice a day while in town
No lie."}
{"text":"Best tacos in town! Delicious salsas, fresh chips, and house-made chorizo make La Tapitia the perfect destination on your quest for authentic Mexican food."}
{"text":"Mondays For 2 years i have come to have their tacos on dollar taco night and they are the best dang tacos around this place is amazing i love it will keep going till the end of time"}
{"text":"Best authentic Mexican food I've ever had since I came back from Portland. Their quesadillas were perfect and the tacos ooooo don't get me started"}
{"text":"Stopped on the way to Eugene, found on Yelp. Great chile relleno plate, excellent carnitas tacos, diverse salsa bar with good spice in all varieties. Fast paced service, ambience of the back of a Mexican market, very good value on pricing. Loved it!"}
{"text":"Authentic mexican food (FINALLY) The full plates (come with rice, beans, little bit of lettuce and hot corn tortillas) are a little pricey (up to $13 ~ which is $$ on yelp), but you get a WHOLE LOTTA food for the price.

They have horchata (medium cup is $2.00), chicharrones made in house (with plenty of meat attached) for $7.99/lb and a variety of hot sauce to choose from (clearly marked mild to habanero).

Tacos are $1.25/each (served with your choice of meat on those smaller double layer of corn tortillas) A better deal if you're your not a fan of the rice/bean filler. I'll definitely be pack to try to menudo and the pazole soup. A price of $9 (just one size), but I'm sure it's authentic and enough to feed more than one... the fact that they have it on the regular menu and not just weekends tells me that it's a popular item *nice*"}
{"text":"This little short order Mexican restaurant is located inside at the back of a Mexican grocery store. It's menu is not extensive or complicated but it's food is delicious! 

I had the relleno and enchilada combo and it was divine! Their tacos are small but cheap. So order accordingly for your appetite. 

And they have fresh meat on display if you are wanting to cook at home....even had tripe! :)"}
{"text":"The best tacos I have ever had in southern Oregon!! Lots of other great things on the menu as well. The service was great and quick."}
{"text":"Been eating here for 10 years never had a bad meal. Favourites: Carnitas Burito, Caldo and Horchata to drink. Stop in you wont be sorry."}
{"text":"I have tried every hole in wall Mexican place, as well as the Taco Wagons in the area, and This place beats them all out for BEST!  They have awesome variety of Salsas, to go with their $1 Tacos on Mondays!  Just to let you know the only day their closed is Tuesday, guess because they sell so many Tacos on Monday."}
{"text":"I once biked 20 miles here in the rain for a burrito.
And it was worth it.
The best Mexican food, and arguably, the only authentic Mexican food in Southern Oregon."}
{"text":"Believe the hype! This is by far the BEST Mexican food in the Rogue Valley. Took our food home to Ashland and it was delicious. The Chile rellano was amazing. Tacos were the real deal. The best part is the tortillas. So authentic. We will definitely be going back."}
{"text":"I have driven past La Tapatia many times and it always seems busy which indicates that they serve really good food. Well tonite I noticed it seemed quiet so I thought I would pop in and order to-go. The gal who took my order was very nice and polite. Just as soon as she handed me my $15 receipt alot of people came in all at once. I must have come in at a lull and was glad I did not have to stand behind all those people for my food, which I wouldnt. I am not a fan of waiting in long lines for to-go food. I sat at a table with my order number and waited for my food. Im about 8 minutes some one brought me my order and left. I noticed in the bag, there was no salsa for my  carne asada nachos and no extra chips for my chicken burrito, just some napkins. I didnt wanted to push past the line so I just took it and left. I was really hungry and wanted to go home and eat. First the nachos, seemed kinda small and lite on toppings. It was good but not great like everyone says. Chips tasted fresh. Next burrito, I guess since it got busy so fast they had to roll it fast? First 4 bites I got globs of cilantro then the rest of the burrito, no cilantro. Again the the burrito was good, but kinda bland and the chicken, while tender chunks tasted boiled to me. I was hoping for powerful flavors. So sorry guys I was not in love with my food, it was just really ok. But with that said, I know most dont feel that way and possibly I went on a nite where the food was not as good as it would usually be?"}
{"text":"Love this spot.  My wife and I visited them while cycling through Southern OR.  We had a selection of tacos and every meat we chose was carefully prepared and seasoned-- especially the chorizo and the chicken.  I imagine that once upon a time this place served the local Mexican and Mexican American community but, now the place is busy with people from every member of the community.  OK, I guess that means it is discovered, but they have not acquired an attitude to make that a downer.  Jose, our host and who appears to be el jefe, was gracious and welcoming, as were the team in the kitchen and serving customers.  Yum."}
{"text":"Best Mexican both sides of the border.  Not much on atmosphere, but you will be too busy eating to care!"}
{"text":"The perfect Mexican dive local? Yup I think so, this is the real deal. Family owned restaurant/carneceria. All the traditional dishes plus lots of interesting specials, all at great prices and rock-the-boat delicious. Busy fun vibe, maxed-out grill cooks, line out the door sometimes. Quick friendly service, beer and wine available too."}
{"text":"Tacos? Por supuesto!
Much like El Gallo in Medford, this takes me back to the innumerable taquerias back in LA. Considering this is southern Oregon -- aka the land of utterly bland everything -- it is a joy to know one can find authentic Mexican food here. And given the lack of any other decent ethnic options here, you almost don't expect to find a place like La Tapatia. But there it is, and your taste buds will be that much better off for it.

Carne asada washed down with bottles of Mexican Coke. Good times!"}
{"text":"Best Mexican food in the valley! Talk about authentic food! Great customer service and friendly laid back environment. It's a low key very casual place. Great for a meet up or family get together."}
{"text":"I spend a good portion of my days dreaming of food from La Tapatia. It has become our works lunch spot, and I have to have a taco salad, a wet burrito, or street tacos at least once a week. Everything I have ever gotten here has been so much better than I ever could have expected. Setting the bar for quality authentic style Mexican food in the rogue valley."}
{"text":"This place doesn't look like anything on the outside but is tied with only Las Morenas for having the best tacos in the area- the salsas are flavorful and so perfect for the various meat options- okay so that would make this place pretty great right? What puts it way over the edge is the carnitas you can order on the weekends... I'm not talking a taco or a burrito I'm talking the entire carnitas to go home... pick at... savor.. and enjoy- for those of us that don't have the spare time to attempt cooking something that literally takes days it is the closest you can get to having an abuela that cooks for you!"}
{"text":"I'm from Seattle and I have to say that this is the best Mexican food on the west coast!! I also have some pretty extreme dietary restrictions (no - soy, dairy, gluten) and the staff was more than accommodating. If you are in the area, you HAVE to eat at this spot!!"}
{"text":"This secret restaurant is just outside Ashland city limits, so you don't have to pay the stupid city sales tax. It is also well hidden and tourists are unlikely to discover it. For both these reasons it is supported almost entirely, and has been for decades, by repeat customers who are locals in on the secret. Food is good and local family ownership deserves our support."}
{"text":"I have been going here for a while but lately something is just very off. Our orders are always wrong lately as well as the food just is not prepared right. I think I will sadly skip La Tapatio for a while. I sure hope they get their crap together. It is still really good sometimes but not the last three times I was there. Sad because it was my favorite place for quite a while but after one too many disappointments I am over it!"}
{"text":"Awesome in so many ways.  

If you like breakfast burritos you will work hard to find one better!"}
{"text":"This place is a hole in the wall. The catch is that if you go on Mondays they have $1 \"crack\" tacos. They are so good that you want more and more. I had 5 of them. Great selection of meats to choose from. I ordered a side of chips and rice and beans to go with them. The chips and beans were fantastic. The rice was a little over cooked and in some spots rock hard. Hence the 4 star review. Other than that the place is great! Never judge a book by its cover."}
{"text":"Insanely good food. Unpretentious and artfully crafted. I wish this were in my town I'd eat here all the time!  I had tacos, my boys had burritos. Highly recommended!"}
{"text":"Best Mexican food in Southern Oregon! Love this place. Great little market as well! Have to try this place if you are in the Phoenix area!"}
{"text":"Well where do I start... This place was DISGUSTING. I'll start off with I Never leave a review, ever. So that says something about here. I placed a rather large order and threw over half of it away. I ordered a chicken plate that was suppose to come with cut up chicken in sauce. What I actually got was a very dry piece of chicken breast. Not cut up and no sauce. Another burrito that was suppose to be a fajita that had NO onions or bell peppers... not even sure how that works.. And another fajita burrito that had only jalapenos on it which defiantly should not have. We also had ordered extra sides of beans and rice, which most defiantly was not a side more so maybe a sampler of rice and beans?? 
That's just the food... Now lets talk about the service. They should be ashamed and i really hope someone reads this and changes the way they do things. 
I call to speak with the manager which the guy on the phone immediately became very rude. 
So I brought the rest of the food in (which the manager asked me to do). The female that I talked to was nice.  The male who i assume to be the manager immediately started being very VERY RUDE in Spanish, As if non Hispanic people have never spoke a word of Spanish before.   Then after arguing with me THE CUSTOMER and him THE MANAGER, he finally gave me a partial refund, which would have worked fine with me until he started to say some even ruder things and started to literally THROW the food from the counter over into the trash and I don't mean just toss. I mean throwing the food, very unprofessional and as someone who worked in management he should be embarrassed. His actions were not okay. Never will i go back."}
{"text":"Had been waiting for an excuse to stop in here and finally was able to on a trip to the Bay Area. Glad I did.  Friendly, welcoming family in the grocery front and in typical fashion, walk past the meat and seafood counter to the restaurant in back.  Fabulous tacos, great varieties and a fantastic and diverse salsa selection.  Everything made to order and top notch, authentic family Mexican fare.  Only wish it was closer to my home.  Will be back!"}
{"text":"Best authentic food in the area! Let us stay late to enjoy ourselves on a busy $1 taco Monday."}
{"text":"The best Mexican food in Southern Oregon!!! We moved here a few months ago and have tried majority of the Mexican restaurants and none can compare to this place! The they have a variety of meats you can pick from. We had the chicken quesadilla, chorizo taco, carne asada taco, and another delicious tacos. They also have a variety is salsas to pick from. My fav is the Habanero! Half of the place is a Mexican grocery store. Happy grocery shopping."}
{"text":"This is our favorite place in the valley to eat! The owner is always here and will come over and talk to you at your table. The food is phenomenal. The Chille Reno is highly recommended."}
{"text":"Fantastic.  $1 tacos on Mondays, but the other days they are only $1.25 so with how crowded Mondays are, you can skip that day...I always lean towards the tostada or tacos, but have tried several other dishes.  Everything has been delicious, I just don't want a ginormous plate of food.  And it is in the back of a Mexican grocery store, I buy shrimp from them quite often."}
{"text":"The best, authentic, Mexican food.

Came here on a recommendation from a local friend, might not of noticed it or had the guts to try it if we were just driving by but so glad we did!  

We are here for breakfast and lunch in the same day!  Chiliquiles were awesome for breakfast (my only suggestion would be to add an egg).  Street tacos are unbelievably great.  Cannot wait for my next trip."}
{"text":"We never would have found this place without yelp--it's kind of hidden in the back of a market, and the sign is not huge.  It's just off I-5, and so we made a quick dinner stop on a drive south.  

This is clearly not a traditional road-trip spot, but it was fast, inexpensive and tasty, so it totally what we were looking for.  We got a bunch of tacos, which were some of the most authentic tacos I've had in Oregon.  A way better choice than fast food."}
{"text":"La Tapatia is the best authentic, real deal, family operated Mexican restaurant in Southern Oregon. Monday is dollar taco night so you can get stuffed on the best tacos in Southern Oregon, with numerous fresh made sauces and condiments, for five bucks.  Take a look at the picture I posted of my five dollar meal. This place is amazing."}
{"text":"Foods is okay if you aren't getting anythjng with beans or rice in it, those are pretty rough to get down. I now understand why the taco prices can be so low, you get anything else and they over charge out the ass. Ordered food to go and the order was short and just wrong and WAY over charged. They didnt bother to get my name over the phone either. Second time this has happened and now I wont be back. Sorry bout it."}
{"text":"Atmosphere leaves a lot to be desired (it's in the back of a store), but the food is incredible!!!!"}
{"text":"I was a little leary when I first walked in the front door. Doesn't look much like a restaurant. As soon as you get by the grocery racks it opens up into a full restaurant. Had the carne asada street tacos. Very good. Will definitely go back and try something new."}
{"text":"I've been eating here for Years, It's my favorite place in the Rogue Valley. A lot of people are psyched out by the grocery store in the front, but if you don't mind walking by a couple pigs heads, you'll be in for a real authentic treat."}
{"text":"FAVORITE tacos by far!!! Wonderful staff, quick and consistent! A must try! Tacos are only a dollar, their homemade sale is amazing, try the green one. Plus they have a taco eating challenge, and daily specials. They also have a market with fresh meat and other items that are fun to try. I never go anywhere else for tacos."}
{"text":"AHHH!!! My favorite place for tacos in the area. I mean, dollar tacos EVERY WEEK DAY?! forget taco Tuesdays! They have a full menu with tacos, burritos, and plates (meat, rice, beans). They also serve delicious, cinnamon-y horchata from a gigantic plastic vat. So legit. I've been here twice and had their carnitas, lengua, chicharrones, al pastor, carne asada, and pollo tacos. They load on the meats and don't put any bullshit toppings on there except for cilantro and onions! All this is loaded on top of two of the fluffiest corn tortillas I've ever encountered. The tacos are small though so I would get a few more tacos than you normally would eat. Their sauce bar is AMAZING TOO. They feature an avocado salsa and also offer the pickled onions/carrots/jalapeno mix! Their lengua is very tender and juicy! That was probably my favorite. The chicharrones is listed as fried pork fat and pork meat but mine barely had any meat and more pork fat. 

This little taco restaurant is also located inside a market so you can also pick up some meat to take home for a taco night when you're there!"}
{"text":"Best chorizo tacos I have ever had. Love how inexpensive they are having $1 tacos during the weekdays. Highly would recommend!"}
{"text":"Amazing chicken tacos. My dad had the carne asada tacos, and liked them a lot. Authentic Mexican joint. They sell meat and other Mexican grocery items."}
{"text":"Good food! Need I say more? Nothing fancy, service is slow (they take orders one at a time from a line), and no real menu. You select your protein from a list and the form (taco, burrito etc) from another. Many sides. Everything is fresh, house made and delicious. You can even order a bottle of beer. The prices are ridiculously low. And now, breakfast!"}
{"text":"Went down here while passing through phoenix during work one day. Needed a quick lunch and tacos sounded great. Stepping into the half store/half restuarant I joined the line and gave a look to the menu. Having never been here, I decided to try as many tacos as I could, picking one of each of the first six on the menu. And to put it bluntly, the tacos were great. Amazing even. Chicken, steak, pork, I loved every one more than the last. Thus La Tapatia has become my go to place for lunch whenever I pass through Phoenix."}
{"text":"I'm visiting from NY, so glad I tried this place! Awesome hole in the wall, best Mexican food I've had in a long time!"}
{"text":"I ate here today - there was a power outage all over the area before  I went in, but the restaurant was still bustling in the gloom.  I ordered menudo - it came with about eight tasty homemade corn tortillas, onions, cilantro.  I hadda get oregano from the next table.  There was a condiment bar with four kinds of salsa, plus a tub of pickled vegetables - kinda hard to see in the dark, but I got what I wanted there.... Soon the electricity came back and it  no longer felt like being in a cantina in some very isolated rural part of Mexico.  The menudo was quite tasty - and beside the cow stomach pieces there was also a fair bit of tendon - yeah, okay - I like that sorta stuff, don't register this as a complaint! - it's real Mexican food... but If you don't prefer this, there's still burritos and tacos, enchiladas, camarones in several manifestations, etc.  On Mondays tacos are only a buck each (excluding fish tacos.)  There's a big variety of taco meats too...."}
{"text":"I personally got a chicken chimichanga and was completely and utterly satisfied. Though my friend received a rather dry burrito."}
{"text":"We ate here mon night 6-19-17 and my kids got food poisoning from under cooked chicken. I am vegetarian so did not eat any. They are still really ill. :("}
{"text":"The holy grail. Literally everything I've tried is delicious...even the big fried fish."}
{"text":"Best damn Mexican food period

As authentic a Mexican eatery as you can find in the Rogue Valley. Make sure to grab some delicious meat and a beer on the way out."}
{"text":"Great little taco spot! Perfect for a quick lunch or to-go. Everything we had was tasty, staff was friendly and the place was clean. The horchata was one of the best I've had. We'll definitely be back."}
{"text":"Delicious little hole in the wall. I've only had the steak tacos and they're the best I've ever had. I also have a huge appetite and the tacos are small so get a couple more than you think!"}
{"text":"And this is consistently one of the best Mexican restaurants in the valley. I have been going here for years and I've never been disappointed. The food is great and the prices are reasonable."}
{"text":"Get there early or wait in line!
This is a \"must stop\" for us anytime we're in the area."}
{"text":"Best tacos in the Rogue Valley! Hands down...no doubt about it. Mexican food is my favorite and I have searched long and hard to find a place that could compete with Rita's located in Humboldt County. So happy I found this place. 

Dollar tacos Monday is out of this world! Everyone in Southern Oregon needs to give this place a try."}
{"text":"Definitely one of those places that you would never think about walking in based on its appearance outside. However, the food is indeed authentic and amazing. The actual dining place is hidden behind the grocery store and a small raw meat section. Staff is pretty friendly and gives excellent recommendations.

I had carne asada tacos ($1.25 each) and a small cup of their cinnamon milk....tea...drink thingiee ($1.00). Both were super good! Their burrito looks huge for $5.99, it could easily quality for two meals for me. Credit card is accepted for orders over $5.00 only. I think I've just found my favorite mexican restaurant in southern oregon =]

***edit 2/10/10***
Alright, unfortunately I would have to downgrade this place after trying out their burritos tonight. I am highly disappointed!! The burrito I got was very loosely packed, it had a very thin layer of rice and beans around the tortilla, thin layer of meat, about 85% of the whole thing were all lettuce ;alksdjf;laskdjf

So much for two meals...it only lasted about 6 minutes...I should NOT have paid 6 bucks for this. I'm going back to the other mexican place Las Morenas Taqueria for a much better supreme burrito at $4.99 including real alvacados, sour creams and solid burrito with real stuff instead of this fake lettuce thing..."}
{"text":"Went here to feed my taco craving. Fast, friendly service. Nice little store up front, restaurant in back.

I ordered 2 tacos al pastor, 1 chicken and 1 carnitas. The tortillas are made on site and very good. The meats were all cooked well and had good flavor. Overall good, solid, simple tacos. Nothing spectacular. I will definitely be going back."}
{"text":"This is in the back of a funky little Mexican Tiendita.  When you walk in, prepare to be unimpressed with the surroundings but floored by the food!

Delicious Menudo and Pozole.  Awesome Tacos.  Dollar Taco Monday!!  Superb Chili Relleno.  

The people are friendly - the food is delicious - I highly recommend La Tapatia!"}
{"text":"So delicious and fresh! Taco Tuesdays are always fun. Excellent customer service from the employees. I would have never noticed this place driving by, but so glad someone eventually told me about it!"}
{"text":"Frequent visitor, and most of the time I would rate it as a high 4 on yelp stars for the food alone (but I have had it as a low 3 when the place was busy and the food not executed as well as it had been in the past)... Bottom line is this place will scare the hell out of you if you just judge it by the decor and cleanliness of the dining area alone... However the food makes up for it... If your a dining room snob, order your food as take-out so you can still enjoy pretty legit Mexican food without the legit Mexican market experience...

***Eat Local***"}
{"text":"What a yummy taco shop! I love going on Monday nights for dollar tacos. This place is so affordable and delicious. I'm pretty picky about my chile rellenos but they make em just right at la Tapatia!"}
{"text":"Gross. We went Friday night.  I got the $9.99 fajita special to go.  Since I live in Central Point,  I'm glad I checked my bag before I left the parking lot.  No tortillas,  no silverware,  no side of lettuce/sour cream.  The tiny amount of beans they provided were greasy,  watery,  and bland.  The tiny amount of rice they provided was bland.  The fajitas were swimming in a pool of greasy sauce.  The veggies were mushy,  overcooked,  like it's been sitting in a crock pot all day.  The chicken was kinda dry.  The sauce tasted like cinnamon,  which surprised me.  The tortillas that I had to go back in for were good. The restaurant itself is dirty,  tables unwiped.  

The employees need to remember,  just because a person is white,  doesn't mean I can't understand Spanish.  I don't like being called names under your breath because I came back in to get what was supposed to come with my order in the first place."}
{"text":"Frijoles, chicharones, real lard... This is the real deal. If you want to feel like you just ate some REAL food, get over to La Tapatia. Your first visit will not be your last."}
{"text":"I'm a big fan of menudo and have had some of the best in my opinion. Now I ordered this to go which may have bin the first mistake. The lack of flavor was the first thing I noticed then the texture of the tripe was too chewy continued and ended with the lack of condiments provided was the last straw. I give it 3 stars because the tacos are are good and they are friendly people."}
{"text":"I LOVE the chicken burrito served wet (sauce and cheese). Always fresh tastes good.  The place doesn't fit the usual restaurant style.  The food is what brings people back.  And the prices are decent"}
{"text":"My friend and I had a bet over the best Mexican food in the Valley. Next day we're driving to Phoenix and he says \"Wait, is it the one in the back of the mexican grocery store?! I was gonna take you there too!\"

Moral of the Story - La Tapatia is the best. 'Nuff said."}
{"text":"I did the taco challenge and won back in 2012 which consisted of 30 tacos in 30 minutes with a reward of $50.00, a shirt, and the meal for free (otherwise $30.00). I have to admit -- all 30 tacos were delicious. I didn't even get sick of them. They might be the best tacos I've ever eaten to this day. On top of this, the staff was very friendly and made me feel like a pro athlete. Their other selections are also top notch. Everything is made fresh I'm pretty sure which is likely one of many reasons why the food is so amazing."}
{"text":"This is my favorite place for Mexican food in the Rogue Valley.  Great food and very friendly staff.  You will not be disappointed."}
{"text":"Just had dinner here tonight after reading all the reviews, an I have to say I LOVED the food, it was a big filling portion for cheap! And picked up some Mexican sweet candy on the way out the store. I love a good hole in the wall place they've always got the best food, I'm definitely coming back soon you should and bring your friends!"}
{"text":"We visited here as a last chance since 3 other Mexican  Restaurants in Ashland were busy.  The fates were looking out for us, the food here is FANTASTIC!!!!  I had a great bowl of Menudo at 8 pm with all the trimmings.  Carrie had a shrimp coctail rich with flavor and lots of shrimp, avacado, onions and tomatoes.  Katie had a Carne Asad burrito \"wet\", covered in red sauce and cheese.  Highly recommend this place.  Don't be fooled by the outside, your first deep breath inside will tell you have found the best restaurant forexican food in the region!"}
{"text":"For its location, this place gets a solid 4. A really authentic Mexican joint in more or less the middle of nowhere. If you find yourself on a long road trip on the 5, this is a great place to stop. 

My room mate and I are both originally from LA, but now live in Portland. Being from SoCal, authentic taqueria's are a dime a dozen. The last place in LA I lived had a 24 hour taqueria and two, open very late, taco trucks in a quarter mile radius of the house. Sadly this has not been the case in Portland. There is only one Mexican place that is open 24 hours and it is a few miles away. All the trucks have short hours and the selection is watered down.

La Tapatia is a diamond in the rough. If it was in Portland I would eat there all the time. The hours aren't great, but the selection is wide and has a store attached it to as well. I got a chicharon, pastor, chorizo, and carnitas taco. At $1.25 a taco this came to $5 which is totally reasonable. These aren't the best tacos I've had, but for practically being in the middle of nowhere, completely satisfactory.  The chicharon was pretty dry, as was the chorizo. The verde sauce was also more watery than my liking. I also like more cilantro and onion on my tacos and wish they would put those out with the salsa too. However they do have quite delicious picked carrots and onions. 

All in all, in LA this place would get a 3, but outside Medford, off the 5 in Oregon, a definite 4."}
{"text":"Friends and coworkers kept talking about La Tapatia:

\"Best tacos ever, especially dollar Mondays.\"

\"Can't find the place, but when you do it's worth it!\"

\"Biked from Ashland to Phoenix for a taco.\"

Luckily I had a working lunch and we all decided to go to La Tapatia.  The whole menu is in spanish, but they have the greatest chicken, carne asada, and pork options.  Great tacos, friendly service, and a pleasant surprise from a hole in the wall grocery store!"}
{"text":"There is no place in San Diego this good. WOW. Lengua tacos, birria, carne Asada, mole, etc. Oh, and don't forget the mariachi band during lunch. Ol"}
{"text":"We've made it a Monday night tradition! Can't beat $1 tacos, especially when they're the best tacos in the Rogue Valley!"}
{"text":"LOVE this place!  Freshly made chips, solid street tacos......a raft of house-done salsas......you cannot go wrong!  

My standard is the asada tacos.  When I go during the week.......these are $1 each!  For the reviewer that was annoyed at the (scandalous!) .35 increase on the weekends, I have nothing nice to retort.  This place is HAMMERED with families on the weekends.......sheesh, cut the owners a break for actually paying for their ingredients!  It's just cool enough that they can sell them for a buck during the week........

I've had the pozole.  It's just like the stufff I had in MX.  Bony bits to gnaw......and a broth that screams having been rolling for many hours.

The tamales are NEVER any less than delicious.  I usually opt for pork......and a red sauce that also feels like it was cooking in the kitchen for a looooong time......it's got a lot of nuance.

The carne asada plate is $14........you will get homemade tortillas.....and enough food for two people, honestly.  Get some free chips, and some of that bomb salsa from the bar, and you're gonna make somebody really happy.

Burritos are also bigger than you can honestly eat.  I try.  It's a curse!

I keep trying to branch out further......but seriously: the staples are just amazing!"}
{"text":"Delicious. Authentic.  Fresh. Great staff. Searched all of Southern Oregon for the most authentic mexican food, this is it!"}
{"text":"I lived and traveled around Mexico for 5 months and enjoyed some of the finest foods to be found....La Tapatia takes me back there at the first bite...trust me best tacos anywhere!"}
{"text":"Try the Carnitas Pork Burrito, the best ever!  with a lime Jarritos it's a perfect meal.  It's a comfortable family place you'll be telling everyone about."}
{"text":"Amazing food. Friendly staff. Hard to find an authentic Mexican restaurant with clean delicious lingua. My kids love their tacos. I love their everything. Check this place out!"}
{"text":"Food was ok. Not great but ok. Ordered the rice, beans and six side order tamales. For tamales they where pretty dry. Like disappointingly dry. The rice and beans where awesome. But tamales left something to be desired. And fell apart and became messy. Usually tamales are wrapped in corn husks but these where not maybe that's why they where so dry and falling apart. They where ok and still ate them just dry on inside and outside. Would try restaurant again. Tip to people, go when it's not super busy. As I could barely hear myself think."}
{"text":"Authentic, inexpensive, fast, mexican food in a casual diner/mexican grocery store.  Excellent pit stop for travelers.  A locals favorite...so happy we stumbled upon this place!"}
{"text":"This is everything good (and a few not-so-good) things about a Mexican restaurant. Highly recommended. The main courses are stupid good. The menu is deceptively small, in that you basically choose which kind of meat (from shredded pork to beef tongue to trip) you want in which kind of configuration (burrito, tostada, whatever). The second you see it come to your table you know it's special, just because everything's fresh, at least on the entree. And it tastes great.

If you wanted authentic, this is the real deal. Other than the very good quality (higher than average for any restaurant, not just those in Mexico), the look and atmosphere would look like any other restaurant in Baja. It's also cleaner than most restaurants, despite the rustic look.

There's a salsa bar, homemade horchata, and soccer blaring on flat screens all over. Mexico, all right! 

Service efficient but not flashy, and be sure to get their at an off hour. A line can stretch from deep into the building all the way out the door.

Minor complaints: Salad makings such as lettuce, tomatoes) seem to come from a less fresh source. Nothing wilted or egregious, it just doesn't have the flavor you get from say, local organic stuff. The tables and chairs are the cheapest plastic banquet variety you can get from Costco, so it's just not comfortable.  Also I found the rice a little bleh.

My complaints are so minor that I ate there 3 times in two days. Even if they address none of my issues, I'll be a committed fan for as long as they keep doing what they do."}
{"text":"Cheap, REALLY good prices, yummy authentic food.  I love it and so does everyone I know here.  Go get some!  (Not great atmosphere, just very good food). Perfect lunch for 6$!"}
{"text":"Long line if you go around 7. We had to wait 10-15 minutes in line to order. Food was pretty tasty. Most stuff appears to be very authentic compared to most places around."}
{"text":"Holy moly... This place is amazing!! Defiantly looks questionable walking in seeing first there is a meat market, HOWEVER walk 20 feet and there is gem tucked away in the back! 
My boyfriend and I ordered 2 pork tacos, 2 steak tacos, chicken quesadilla, fish taco and 2 coronas.. I've never had tacos like this before. Fresh veggies and a salsa bar with different sauces to put on your food, very good. 
Jose, the owner, was also there and was great company! For all my business trips to Medford, this will be my spot."}
{"text":"Great Mexican food and worth the drive.  Thank you yelp!  We would have never come to find this place on our own.  Good Mexican food at inexpensive prices plus market selections if you want to go home and cook.  We're only spending one night in Ashland but came here for dinner and enjoyed it.  Carne asada wet burrito, pork tamale plate, cheese quesadilla, chips and salsa order, and two horchata drinks was under $25"}
{"text":"This place qualifies as a dive but really it's much better.  You'll think you're entering a small grocery store but travel to the back and you'll descover a MUST VISIT.  It's great.  I first went with a Mexican friend and all the ordering was in Spanish . . . I just said, \"I'll have the same.\"  I ended up eating cheek.  It was awesome!  The second time I went with my wife . . . she knows only English and Japanese so we stumbled through and I did okay.  Then she pointed to the the God Damn opposite wall where there are pictures and words and Oh My.  It's a great place to eat.  Please visit this great place even if you're just passing through the area.  It's very easy access off and then onto I-5."}
{"text":"This place is legit. And I'm from Southern California where there's a taqueria on every corner. Their meat is so fresh and tender, no \"toenails\" (as my husband calls the gristle-y pieces), and the corn tortillas are freshly made in store. They are so fresh, they literally melt in your mouth. Salsas are nice and spicy and they even have spicy carrots! On point."}
{"text":"Being from the southwest and growing up on Mexican food, having lived and traveled extensively in Mexico, this little hole in the wall is the real deal. The food is great, fairly priced, and generous portions. We've eaten at La Tapatia dozens of times over the years and have never had anything but wonderful food and friendly people. The tacos I had today? You won't get any better than those."}
{"text":"Not bad, but lots of better Mexican options. I've tried it twice and both times weren't very good. The Fajita's aren't good, they're just bland. Every salsa is either A) lacking in spice or B) terrible flavor. There's no good spicy salsas."}
{"text":"Don't let the location or dilapidated building convince you to walk away. The meals served in the cafeteria portion of this little Mexican market are authentic and delightful. Despite lacking the requisite guacamole service, our family had trouble leaving portions behind as we finished off four generously portioned lunches. The BBQ chicken was tasty and both the Birro and the Verde were some of the best we have ever had. The prices were the fan favorite of the week too! Chase it down with a Mexican coke or cerveza and your lunch will be complete."}
{"text":"One of my absolute favorite places in this valley! Everything in phenomenal and I can't believe how reasonable the prices are! I would go here all the time if it was a little closer to me. So good! If I ever need catering I totally will go with this place. I don't know anyone who doesn't love this place, honestly"}
{"text":"The best most authentic Mexican food in the Rogue Valley by far. We've been loving this place for years. Recently they changed the recipe of the \"salsa cafe\" it seems really watered down. Please bring back the salsa cafe thick delicious salsa!"}
{"text":"A very quaint, backroom type atmosphere located in the back of the deli.

We tried the Wet burrito carnitas and Chicken enchiladas. Beans were fantastic. Burrito was absolutely delicious. The meat was good quality and well seasoned. Sauce was mild but good flavor. The rice was dry, but that could have just been the time of day. Loved the enchilada sauce and tortillas.

Great place for a casual meal."}
{"text":"Best Mexican Food in southern Oregon hands down. No one else can come close to the authenticity of the food in this region. Their salsa bar was great, their carnitas were cooked perfectly and the mole plate is inexpensive and delicious. I love this place."}
{"text":"just like being in Mexico at a real Taquaria! This place has been run by the same family for a long time and nothing seems to change including the prices. Not a fancy place, really basic, but about as authentic as you can get. And if you want to buy pretty much any of the ingredients, they are all available in the connected store and authentic butcher shop. This place is the best lunch spot for at least one hundred miles around, if you like tacos, burritos or tortas. The horchata and menuto (available weekends) is the best hangover cure ever. I eat here about 3 or 4 times a month. Love the place."}
{"text":"Our absolute favorite restaurant ever of all time!!! The Food is so delicious you dream about it!! And as for the prices they are amazing. The staff are always friendly and the food is very prompt!! We always celebrate family birthdays as well as bring every out of towner to experience La Tapatia... We Love Love Love La Tapatia's!!"}
{"text":"Best Mexican food I've ever had. Literally everything I've tried here is fantastic - even better than what I got in Mexico!

Definitely try the dark red sauce they have on the far right of their sauce area... I have to limit myself to going here every other weekend or else I'd be here every single day except Tuesdays (closed!)"}
{"text":"Best carne asada in Southern Oregon!! Feels like Mexico when you walk through the door, mainly because it's an all Mexican store/meat market with the restaurant taking up the rear half. Only a few employees speak English, and they are all so energetic! If you hate americanized Mexican restaurants like me you will fall in love with this place!"}
{"text":"Decided to give Mexican another try and had a really good meal. I got carne Asada platter and Mike got chorizo platter. The food was yummy. Chorizo is generally very greasy and other places put eggs in as filler- this was solid sausage grilled on the flattop and was not greasy !! It looks like they make their own here as its in the deli case to buy and looks nothing like the store bought kind. My carne Asada was a huge portion- I took pictures tonight if ya wanna check them out to see what they gave in portion sizes.
The inside of the restaurant has improved greatly. New walls, new paint and decorations and very clean tonight. 
I will come again, based on my good experience tonight."}
{"text":"YUM!!  
If you love mexican food you must eat here.  So good!  We've yet to have a meal we didn't like.  I take pictures for my friends to drool over.  Places as great as this are rare."}
{"text":"These tacos are so good atmosphere is amazing. Definitely coming back taco Monday is where it's at $1 tacos"}
{"text":"When you have to walk by a 20' long meat counter to get to the walk up cashier you know your in for something authentic.  Frankly some of the stuff on display is somewhat frightening like the huge slabs of fried pork skins the size of a tire and fish I haven't seen before but it's part of the charm of this place. Those who travel and fans of street food are familiar and comfortable eating in a market setting.  You don't find this anywhere else in the valley.  You are eating in someone's kitchen and the food is outstanding. It's worth the trip for the hot sauce bar...you wanna drink the stuff.  Everything is good and watch out for the daily specials.  Monday is 5for5 tacos and a better full deck you won't find elsewhere.  One of the very few authentic Mexican diners that's not on 4 wheels in the valley...worth drive through the convoluted traffic pattern through that part of town. The city fathers must have been on medication approving that nightmare."}
{"text":"Delicious tacos and friendly service! I definitely recommend for a very casual experience and good food. Will be coming back soon!!"}
{"text":"Def a local fave! Good food ordered up kinda like cafeteria style...Grab a table and stick your number in the holder. $1 tacos all week LONG, with fresh made tortillas. I really like their little salsa/sauce bar.8-12 different sauces available from mild tomatillo all the way beyond super spicy habanero. Same little bar has the escabeche, those awesome pickled  jalapeos with the carrots... oh yeah! Beers, Jarritos, Mexican Coca Cola, horchata, all available for drinks. Also, if youre a big eater and up for bragging rights they have a 30/30/30 taco challenge EVERY Monday (eat 30 tacos in 30 minutes win $30!)"}
{"text":"Best Mexican food ever. It's been a long time since I've had authentic Mexican. The tacos are highly recommended for the price."}
{"text":"Best Mexican food in the area hands down... friendly staff and quick takeout when you aren't wanting to dine in"}
{"text":"Was feeling some tacos so came to La Tapatia for lunch. 

They had all your classic taco meats except for adobada.   I ordered asada, pollo and birria tacos. Tortillas are handmade. They give a touch of cilantro and white onion which is all you need to top a taco. 

The pollo tacos was good.  It was lightly marinated/ seasoned and was tender. 
The asada tacos were nice.  Tasted like any basic asada taco ever made. 

The birria taco was good as well.  I had my order to go but next time I eat there I would ask for a side of consome (birria stock) to dip the birria tacos in.

There is a salsa bar by the cashier.  Salsas are all house made and look delicious.  I tried the salsa Verde which wasnt spicy at all for my taste buds but very flavorful. 

The place was very clean and had the mexican restaurant/ market aroma which is nostalgic for me. Looking to try the menudo, pozole and caldo de res on a Sunday."}
{"text":"This is hands down the most authentic, delicious Mexican food in the area. Being from LA where there is a surplus of Mexican restaurants, we didn't think we would find anything as good. I'm happy to say we were wrong! Best chile verde burrito I have ever had. The lengua tacos are also amazing. My husband is from a Mexican family and he says this cooking is as good as his dad's, which is saying a lot. This will be the only place we go to for Mexican food from now on."}
{"text":"Excellent chilaquiles, muy autentico, glad we made this our breakfast stop.  Huevos rancheros also good, served with fresh, light come tortillas. And yummy horchata."}
{"text":"Hands down my favorite Taqueria in Southern Oregon! I have eaten here quite a few times and always love what I get. Amazing chille rellano, tacos and beans and rice. It is inside a store which seems like a good little shop. They are quick, inexpensive and ever so friendly. Everything is fresh and delicious!"}
{"text":"I have been here several times and it is time to put my 5 stars to rest with this place. The pictures everyone has posted is my review.  Best Mexican joint in the valley. I only buy my carne asada for my BBQ's from them. Great meat deli and fair prices."}
{"text":"This place doesn't look like much on the outside but is actually a pretty decent little store/self service restaurant with tons of seating inside. The al pastor we had was good but left a lot to be desired at a place rated so highly by others. The fish tacos were interesting and made of good corn tortillas and what looked like tilapia grilled/stewed in a tomato sauce without any other condiments like cilantro etc. I've never had this type of fish tacos at a taqueria before so I'm not sure but they were good.. Just not what I was expecting/in the mood for. My fiance thought the burrito was ok as well. Bottom line: I thought it was a very good deal for the money but nothing special."}
{"text":"La Tapatia is a family owned Mexican restaurant hiding behind a small mercado. If you don't get directions from someone, or don't come with your friends, you might have a hard time even finding it. Don't expect fancy colorful interiors. Come to the counter, next to the kitchen and order your food. They make the best tacos I have ever had! If you end up there on Monday expect a long line as tacos are just $1 on that day. BTW, if you try their refried beans, you will never ever want to eat any other. They are amazing! The menu does not end on tacos. At La Tapatia they serve chile relleno, burritos,and so much more. Everything made from scratch. Everything fresh!"}
{"text":"Simple and perfect! If you want some great tacos or other tasty mexican food and don't need a fancy environment, then just go here!"}
{"text":"Best Mexican food in the Valley.  Seriously.  The burritos and tacos are fantastic, the horchatta to die for."}
{"text":"This place is tiny and easy to miss, but once you step through their door and try the delicious food they have, you'll never forget it. I have a hard time pulling myself away from their tacos. Such a good deal, and such a fantastic meal. Their homemade sauces are amazing as well! If you're a fan of spice, I recommend the habanero sauce!"}
{"text":"Love this place! I find it hard to order less than 20 tacos when I go I always get the Pastor it seems to be the most flavorful of the protein options Love the Horchata. My only complaint is that they're not open on Tuesdays and for some reason I always want tacos on Tuesdays"}
{"text":"100% authentic Mexican cuisine The tacos are only $1.25 each and come in variety of different meats options."}
{"text":"Best restaurant in Southern Oregon. This is authentic Mexican Food and the tacos are the best I've ever had. The prices are extremely reasonable and the service is fast. $5-$10 goes a long distance."}
{"text":"The staff was very friendly and the atmosphere is different in a fun way, especially when you sit across from the deli counter. The food was okay at best. I ordered the carnitas burrito and all the meat was on one end of the burrito, so poor craftsmanship and overall lack of flavor made for a average experience at best."}
{"text":"The best tacos in town...reminds me a bit of old Tijuana, small, crowded and great food."}
{"text":"When looking around Ashland for Mexican food this is just one of the many places that serve general dishes. 
Despite the location I couldn't really tell anything super impressive about this restaurant, but nothing against it either."}
{"text":"Great Tacos!!! 

Monday night is $1 taco night, and it's worth every cent. Some of the best authentic Mexican I've had in a long time!"}
{"text":"For the Medford/Ashland area, this is as good as it gets in terms of authentic Mexican cuisine. From the small, doubled up corn tortillas to the plethora of salsas. \"What is a plethora?\" The taco selection is extensive short of a brain taco, along with their beer selection, and side dishes. My personal fav is the carnitas al pastor. Monday or Tuesday (can't remember) they serve dollar tacos and if you drink enough Dos XX's you may be brave enough to take on the 30 TACOS IN 30 MINTUES challenge! Eat 'em all and its on the house and I'm sure you get some sort of commemorative token like a photo or a t-shirt, aside from the immense street cred you amass. Not to mention the service is excellent and everyone who works there are insanely friendly!! Why aren't you there now?!"}
{"text":"The food, prices, and staff here are all AMAZING. I grew up in San Diego and have missed quality Mexican food so much. Thank you, La Tapatia, for being part of our community and making us so happy and full of deliciousness."}
{"text":"Yes! It's a glory hole. No not that, but the edible, extremely affordable, authentic to the variable of Medford-influence, & in the back of a grocery. A quality hole in the wall that will fill the belly.

Ate:
Tacos $1.25 - cow stomach, pork, skirt steak
supposedly $1 on Mondays or Tuesdays"}
{"text":"Discovered this place today, very authentic Mexican food best I've found in Southern Oregon so far! Handmade tortillas & bomb tacos & really well made salsa. Not to pricy for good well made food, really hits the spot. 
The location is a little hidden for sure at first I thought I was walking into a little market but a hidden gem nevertheless. Will be returning for sure!"}
{"text":"Friends recommended. Don't be deceived by the outside! Service is great- food is amazing"}
{"text":"Best authentic Mexican food in the valley and nearly the same price as getting it in Mexico from a street vendor!"}
{"text":"We stumbled into this restaurant and had lunch.

It is located south of Medford in a rural area.

You would never expect such an awesome food in a place like this, but we were blown away...
The best Mexican I have ever had!! Seriously.
So much flavor that you can't stop eating it!

There is a parking attached to the restaurant and you can't miss the cute signs outside.

As you enter, the front of the place is a Mexican grocery store. You walk in to the back and there is a restaurant.

Great authentic Mexican vibe! I knew as soon as I entered, we were going to get some good food.

There are plenty tables and seats. The menu is displayed on the Big TV screen with photos so it is easy to choose.

They have a salsa station with most amazing tasting salsas. 

We ordered the wet burrito, chicken burrito and shrimp tacos.

Oh man, the sauce for the wet burrito was \"out of this world\" flavorful!
The shredded beef tasted amazing with the sauce.

My shrimp tacos were also mind-blowing! So tasty that I could have eaten twice as much.

If you are in the area, this place is definitely a must-try.

One of the best Mexican food we have had!

2 thumbs and 2 toes up!!"}
{"text":"For what it costs, La Tapatia is amazing. The best Mexican in Ashland/Medford area. Decent mercado, too: butcher, Jarritos, etc."}
{"text":"Tried here as of the best rated yelp spots in Medford.
I'm at a loss to understand this.
I had some pezola. It was loaded with bones, fat and bay leaves. They did have some traditional add ons.od radish, lime and lettuce. But I missed green onions, cilantro and possibly some avocado. 
I also had chili rellino and a chicken enchilada. The enchilada... well I ate 3 bites. Left more than half of it. 
The bright spot on food was the chili rellino... and Pacifico. Beer."}
