{"text":"So we were there last evening celebrating a family member's birthday. There were twelve of us. Being Italian, cooking is a passion of ours ,( my husband and I ). Having been in this kind of business,  we know we have high expectations. We know when good products are being utilized and when not. Last night we were a little disappointed. The focaccia they bring at the beginning was at least two days old. My husband's, daughter's and son-in-law's pizzas had no flavor and were burnt. My gnocchi had no hint of lemon or mint, which they were supposed to, and they sat in water instead of sauce. Even adding the grated cheese did not help, ( which was neither romano or parmigiano) When cooking, you have to cook with love and good ingredients. Yes, most people will eat anything, but some of us know our products. Only good products will add flavor to the food you are preparing. If you want people to continue coming you must use the best quality,it costs a little more, but it pays off in the long run.  We wish you only the best and much improvement !"}
{"text":"Let's start with the Terrasse...lovely! Not too big (which makes it perfect in terms of noise levels/intimacy), but not so tiny that it's awkward among strangers. Great for an afternoon lunch outside. If this review were JUST about the food, I'd give it 5 stars. Delicious! I think it's safe to say that their pastas come very close to the authentic dishes you find in Italian homes. Their pizza is also delicious overall, but there's something about than very thin and crispy crust that has your mouth watering after the first bite! Great selection of appetizers too. 10/10 for alcohol.  Awkward staff. The waiter attempted too many jokes & didn't get the message when no one laughed. Water wasn't refilled regularly. Lack of friendliness too overall (the \"I hate my job\" attitude). Regardless - this place is guaranteed to gain more & more popularity in the Laval area!"}
{"text":"Very good restaurant, The food is good, and pasta is great. Tomato sauce is just like grandmas! Staff very friendly. Recommend it for everyone."}
