{"text":"Put away all other menus and ideas of going any place else, ever again! I've been eating this type of food my entire life and after going to Dr Laffa, Thornhill it's like I'm experiencing food for the very first time. Nothing, and I mean nothing, comes close to the taste experience you'll get here. Mazel Tov on providing a memorable experience. Will be there often."}
{"text":"Great, friendly service, great food.  Sabich, I'd pass on (but then again, I haven't found a sabich that I like in Toronto, so maybe it's me).
A bit pricier than similar restaurants, because it's kosher, but then again, no restaurants in the area have as good falafel, kebobs or shawarma, and definitely not as good in the laffa.

This restaurant was the one that started the whole laffa craze, by the way (in its previous location near Dufferin and Steeles), and none of the others are as good to this day.

Downside is that they close early on Friday and closed on Saturday because of the religion"}
{"text":"Tried Dr. Laffa tonight and was extremely disappointed. Ordered falafel Laffa that the falafel balls where so salty that they were not edible. My wife had an overpriced Sabich plate that we asked not to have tabouli salad that they still put on the plate and the Sabich balls were under cooked, like raw and mushy. Probably the worst take out Mediterranean food I've ever experienced."}
{"text":"Mixed results, but for a kosher restaurant around here, it is good. The chicken schwarma is quite tasty, though the chicken kebab sometimes lacks flavor. We've eaten their catering more than a few times. Our only time visiting the restaurant for lunch, we found the server a bit overtaxed, but the service and food came out pretty quickly (which is NOT the case at a lot of other kosher places in the area). And yet, the bread and fries were both undercooked,"}
{"text":"The photo should explain itself. I ordered falafel not whatever this was.
I asked the manager what the green stuff was he could not answer
Like what was this? I am very existentially concerned, this is serious and i personally believe this is post modernism applied to food.
This is an omegalul experience .
Seriously it was nasty and disgusting."}
{"text":"Overall impression is that this place is way more expensive than competitors in the area. If you don't eat kosher, there are a dozen places in the area with similar food that are much better value. 

Food overall was okay. Laffa are good, chicken swarma slightly above average, snitzel average, chicken kebob is above average, fries horrible and tasteless, rice was hard and tasteless humus below average, and vegetables are just Boring. 

Long story short, I will avoid this place in the future, unless I am burdened with kosher guest!"}
{"text":"I was not a fan of this place! Laffa Shawarma was so vegetable packed, good size, pretty tasteless. Dr.Laffa hummus was average and way overpriced! I won't be back."}
{"text":"This is a brand new location, apparently open for just a few weeks, their other location is at Bathurst & Lawrence.
I ordered their Laffa falafel (shaped like a burrito ($6.99), I didn't expect it to be so huge! The falafel itself is super fresh and absolutely melts in your mouth, I have never had falafel of this quality before, the veggies were fresh and amazing colour, so much flavour!  This restaurant is licensed, you can order a nice beer with your food and enjoy their very courteous and attentive service. I'll be back!"}
{"text":"Shawarma review:

I heard positive reviews about this place. I for one was not impressed with the portions and cost. Over priced and expensive. Portions were small. I would prefer other places such as me va me and mr zagros and al tanoor at lawarence and warden. The shawarma dinner is not worth 20 dollars. Disappointed

The quality of the food was alright. The bread was good and the Israeli salad was good. Shawarma lacked flavour. It was near to plain chicken. 

Haven't tried the skewers or any other dinners. This is mainly for the shawarma review. Finished the shawarma portion in 5 spoons."}
{"text":"Being a BIG fan of the original Dr Laffa on Bathurst, I wasn't impressed here. 
What I like about the original is the ability to pick the fillings and watch while the Laffa is made. 
We ordered the falafel hummus and the order came after a rather long wait even though they were empty. The hummus is more tahini based and somewhat watery. Falafel is decent. Service is ok. 
The Laffa is quite good as always! I did like that they brought the tomato salad and the shredded cabbage salad while we were waiting. 
I may just stick to the one on Bathurst though."}
{"text":"Humus and falafel was delicious! But the laffa was amazing! Loved it and would definitely come back. The little salad/pickle dishes that were brought to the table before our order made it extra special. And the service was very good too! A real treat."}
