{"text":"A tasty dish and fulfilled my appetite.  An order of naan bread was a good complement to the rice."}
{"text":"Tasty food at a very reasonable price, along with proper portion, service is accurate and fast"}
{"text":"Food was good but the price is on the medium high side. We had the large sandwiches and they are bigger than we expected. The place is not the most modern but the staff seemed friendly even though our service wasn't the fastest. If you plan to order takeout make sure to order in advance!"}
{"text":"I always get the Large beef kebab wrap. 3 skewers of well flavored juicy kebabs in a humongous tandoor made naan.   Everything is fresh and flavorful. $10 and you are stuffed.  Tastes really good!"}
{"text":"I've never been to Lahore, the capital city of Pakistani province of Punjab. So I was delighted when Chris Cheong suggested having dinner with him at Lahore's Premium Kabab in Markham. Not an upscale restaurant, however, as I discovered it is certainly a gem of a restaurant. The service was on time and the waiter and waitress were always checking on us to make sure everything was going well. We ordered Boneless Chicken Tikka Biryani, Butter Naan, Butter Chicken, Extra Chili on the side, Lahori Beef Kabab, Sweet Lassi, Gulab Jamun and Kulfi. Each dish had its unique distinct flavor with the perfect combination of spices. The extra Chili on the side was blanched with a touch of salt. Whilst not trying to compare the taste nor quality of the various dishes to other upscale restaurant, I can say they held their own as I could've hardly distinguish the difference especially because the dishes were a touch different and my palate welcomed the slight change of the ecstatic difference. The quality of food to price ratio is a bargin. I do recommend this restaurant."}
{"text":"We have been here twice now.  I love Indian food and was introduced to this place several months ago and was really impressed.  It has a clean & simple ambience.  The service is very good, very pleasant, and the manager/owner takes the time to check in and see how you are enjoying your meal.  I did not grow up eating Indian food, I grew up in a very traditional UK home with typically bland and boiled food so I can't speak to authenticity, but the flavours and textures of the beef & chicken kebabs and the chicken tikka was delicious.  We also had the combo sizzling vegetable platter which included Palak, Chana Masala, Aloo Gobi & Tarka Dal.  I enjoyed this platter very much, the only thing I could have wished for was that they separated the four choices better so that I could taste them more individually, they were blended together the way it was dished out.  The vegetable samosas were fantastic, a nice crunchy skin and a really flavourful filling.  The naan was also really good, nice and big.  I had dinner with my husband and as always we ordered too much, we could have used two extra people to help us finish, and we are good eaters!  Our bill only came to $45 (inc. tax).  Really worth a visit."}
{"text":"I had arranged to meet a friend and fellow foodie, Raj N., for dinner. We often try to explore and discover new places to eat. On this occasion, I was browsing through this area on Google Maps when I came across Lahore's Premium Kabab House, close to my old neighbourhood. Off we went.  Being our first time here, we ordered dishes that we're familiar with so we could compare to similar restaurants - Boneless Chicken Tikka Biryani, Butter Naan, and Butter Chicken. We also ordered the Lahori Beek Kabab, Sweet Lassi, Gulab Jamun (dessert), and extra chillies on the side.  The first dish to arrive was a small plate of lettuce, onions, and carrots, with a couple of portion cups with sauces. It wasn't really a composed salad. DIY garnish?  The rest of the food arrived shorlty after and looked really good. They were all served on hot cast iron plates sitting on wooden blocks. The beef kababs were still sizzling. Presentation was nice but not very practical. The rice was piled up high on the shallow vessel and spilled as soon as we dug in. The sauce from the butter chicken also spilled because it was filled to the brim.  Nitpicking aside, the food tasted delicious! The biryani rice was flavourful and fluffy, with generous amounts of tikka chicken throughout. The butter chicken was rich with flavour without being too spicy. The beef kababs were nicely seasoned and cooked. The freshly made naan were huge (we couldn't finish it) and had the right texture. The extra chillies were grilled and seasoned. Nice.  Unfortunately, the service didn't match the quality of the food. I'll give our server marks for effort but he was clearly inexperienced and didn't understand everything we said (language barrier?). When we were seated, he placed a pitcher of water, glasses, plates and cutlery, on the table in a pile. Not an uncommon practice at small restaurants. One of the glasses, however, was dirty and the replacement glass was also dirty. There were times when it seemed like he didn't understand what we were asking for, such as asking about dessert and asking for the bill. It may seem like more nitpicking but it affects the overall experience.  We were the last diners to leave and met the owner on our way out. We chatted for a while and he seems like a nice guy. He recommended we try the beef short ribs next time. Yes, there probably will be a next time.  Food: 4 / Service: 2"}
{"text":"Some of the employees of Lahore Tilkka House on Gerard have opened it up, excellent kabab just like their former employers place, curries need working still, we went with their last night, ordered Haleem which was pretty brutal no meat in it seemed like a combo between channa daal and some nihari soup  The boys should work hard and pay attention otherwise success could be limited"}
{"text":"Price is definetly not worth it to really small portion s and extremely slow service I will never come back here again"}
{"text":"Came to this place after landing into Toronto pretty late and staying in the Markham area. Overall the food tastes on the above average, but the price is high and quantity is very minimal."}
{"text":"I often do take out from this place. Usually I get their kababs, biriyani and karahi chicken and gosht. I really like all of their kababs. The karahi dishes have lot of oil but I guess that's how it is normally made (authentic way). So no complains, when I order those I know I will be getting a dish full of oil and rich and flavorful curry with chicken/lamb! The biriyani is not so spicy but have a real nice taste to it, which I like. I also like the way they give fried chilli and a small packet of salad with every order."}
{"text":"The place lacks ambiance, food is average, there are many places like this. Their preparation time is not bad and quantity of decent. For the quality of food, price is not as much as well. It's ok to go with a couple of friends but it's not a very authentic family restaurant."}
{"text":"Great ribs, fried mogo and wraps.  Been here several times....almost perfect every time."}
