{"text":"This is some of the best Chinese food in TO by far.  While pricey the quality delivers! Nice place to take business guests if they like chinese food"}
{"text":"Food: 4.5/5 Service: 4/5 Cleanliness: 4/5 Price: $$$  Crystal shrimp dumpling- I almost feel like it's not dim sum if I don't have some har gow on the table! The dumpling was really well made because the shrimp dumplings were very plump, like no space in between the glutinous covering and the insides. It didn't taste any more special than your normal dim sum restaurant though, except that the shrimp used inside was very fresh and well cooked making the dumpling really juicy and flavourful.  Steamed dumpling of scallops, caviar, and bokchoy - Scallops and caviar in one dumpling! How could we not try? At $5.00 per piece, it was rather an expensive but totally-worth-the-splurge choice! The caviar used wasn't famous or very high quality of course, but having it on top of the dumpling definitely enhanced the overall textures and tastes of the dim sum. I especially liked the scallops, and overall the dumpling was well worth ordering again!  Steamed Chicken & Fish Maw in Rice wine Sauce - This was hubby's choice and it was well done! Neither of us had never tried fish maw before let alone know what it was, but it was a successful order. Upon googling, I've read that fish maw is essentially dried swim bladders of large fish. You can click on the link above to read more about it. Fish maw definitely had interesting textures to it which I think some may enjoy and some might hate. Overall, the rice wine sauce was lovely and I liked the fish maw more so than the chicken.  Steamed Dumpling of Lobster & Shrimp in Garlic Butter - This dish was too cute to eat! I felt so evil cutting it in half to eat...but once cut, I had no trouble eating it. Another more expensive dim sum dish, but the lobster and shrimp insides were so delicate and juicy that it is well worth ordering. It definitely seems like it's one of their most popular dishes, as I saw other tables ordering it as well. Besides, there must be a reason why it's the first dish on the menu! I'd definitely recommend that you try it if you get the chance.  Crispy fried pastry of foie gras & minced pork - This was both hubby's and my favourite dim sum dish. I had never expected the pastry commonly used for egg tarts and other sweet things to be used for such a savoury filling! It was so delicious and I really wanted to order some more, but successfully resisted. The taste of foie gras wasn't too strong, but I think it was well balanced between the minced pork and the sauce used. Stronger foie gras might've thrown the savoury tart off balance I think. Of all the dim sum dishes we tried that morning, we definitely both loved this one the most and we recommend that you definitely try this one over the others!  Deep Fried Shrimp Rolls w. sweet & sour sauce - Last but not least, we ordered this dish that was very delicious. Looking a lot like spring rolls, the deep-fried shrimp rolls was really well made! I especially loved the sweet & sour sauce, which was really magical when eaten together with the shrimp roll. I loved how it wasn't overly fried making it not too greasy and it was perfect for the two of us to share. I also liked how there was shrimp inside instead of your regular pork (although I'm sure they have a meat version of it somewhere on their menu!). Our waiter recommended we try this when we said we wanted something deep-fried. He was definitely right and we enjoyed it very much.  Overall, our brunch at Lai Wah Heen was very enjoyable and would definitely go back! I especially want to try their regular dinner as it looks really delicious! They have abalone, sea cucumber, and other exotic ingredients which aren't so easy to come by in Toronto. The restaurant is a great place to dine with your family or casually with friends, whatever the occasion, whenever. Service was really great, and our dim sum came out literally in a matter of minutes after ordering which I thought was amazing. Plus, the quality of the dim sum was not diminished by any means even though it took a short amount of time to prepare it.   Definitely going back!!!"}
{"text":"Hands down, one of the best Cantonese restaurants in the city. I have dined at Lai Wah Heen countless times for both dim sum lunch and dinner. Yes it is expensive, so don't come here with the intention that you'll walk out paying what you would if you ate at a Chinatown restaurant. Despite changing owners and some of the chefs being poached by the likes of Susur Lee or leaving to start their own ventures, Lai Wah Heen has maintained a general high standard of quality.   A few dishes to highlight - crispy chicken with black truffle, e-fu noodles, Peking duck, jumbo prawns, custard filled buns and BBQ pork puffs. The red bean soup is also great and probably my favourite across any Chinese restaurant where I've had this dessert.  I was worried that Lai Wah Heen would go away when the Metropolitan Hotel was sold and became a Double Tree Hotel, but I'm very glad that the restaurant survived and continues to put out great food."}
{"text":"Good decor, good service and overall good tasting dim sum. BUT I have to say some of the dim sum dishes were obviously cooked with MSG which I don't appreciate. As a fancy restaurant it should be more health conscious.   So the most I would give is 4."}
{"text":"Definitely one of the best Chinese restaurants in town. The servers were very polite and very attentive. One of them saw me frowning at a chipped sauce bowl and they immediately offered to change it right away.   I was craving for shark fin for a while and Lai Wah Heen delivered a great and reasonable price shark fin soup, which left me very satisfied. One of my friends ordered a sweet paste noodle bowl and it was absolutely delicious! Their dim sum was alright, not the best but their services and the restaurant's ambiance made up for it.   Will definitely return for more fine Chinese dining!"}
{"text":"I took my partner here for a birthday ending in zero, and we ordered the roast duck prix fixe dinner. Lai Wah Heen is known for its dim sum, but let me tell you: come by for dinner. There are fewer people, the atmosphere is quiet and elegant, and the service is very personal and attentive. Besides, the duck is amazing. It's probably the best roast duck you can get downtown, and it's presented authentically with the filets cut table-side after the roasting. The skin was perfectly crispy and the sauces piquant enough to cut through the richness of the meat. And despite the fattiness of the duck, it tastes very light, and you won't feel that sinking feeling afterward. One duck is more than enough for two people, and you could probably feed three or four with extra soups and side dishes.  I also very much enjoyed the tea service, and wish I'd tried more of their teas. That may actually be the secret to digesting all that rich food -- the tea! So do yourself a favour and order a pot."}
{"text":"We ordered the Peking duck and it was phenomenal. The location was somewhat hard to find, as it was at the top and the back of a hotel's stairway. Though this is a really expensive restaurant, I would say for the quality, it is worth it but not so much the portions. A lot of the Peking duck was wasted and so we asked the chef if we could have the rest of the duck (which ended up having a lot of meat still on) and we just paid for another serving. Nice classy place to eat if you want to splurge on some Chinese food!"}
{"text":"Good - Excellent service and Food. Wonderful hot & sour soup, steamed and baked pork buns. wife had the emu (loved it). elegant space and decorations.  Bad - $7.50 for a bottled beer. a little pricey for what you get.  we were there for lunch."}
{"text":"Lai Wah Heen used to be the place to go to for excellent Chinese food in downtown Toronto.  Today's dim sum luncheon was a total disappointment.  The quality of the food definitely went downhill from a year ago.  Both the crab dumpling & har kow's skins were thick & chewy; the foie gras pastry tasted of stale oil, and the custard bun was bland & like it was prepared from a week ago.  Paying a $8 premium for a dish of dim sum was definitely not worth it.   There were only 6-7 tables occupied during lunch hour today.  Can now totally understand why the restaurant was rather empty."}
{"text":"excellent place to catch up with friends, however lai wah heen serves more than your dim sum staples, offering fancy dishes including truffle, lobster and bird's nest not typical of your average dim sum place. some of the wester-meet-east fusion seem to meet the expectation of the experience Asian palette but there were quite a few that missed the mark, owing to its attempt at Asian tapas albeit with a cantonese leaning."}
{"text":"I've been spoiled by great dim sum in the past but every plate here was superb. The staff was great but I was focused on trying to finish as much food as I could and not waste it. When the dessert came out my stomach was about to pop but I carried on.  Not much else to say about the great food but make sure to try twisting the top half of the Papaya Milk Custard tart, if you just bite into it you might make a mess."}
{"text":"Had crispy foie gras, prawn in black bean sauce, chicken with noodles, sweet fried chicken strips. Everything was delicious except the fried chicken strips were too sweet for my taste. Very formal ambiance. Polite staff. Good meal."}
{"text":"My favorite dim sum place. It's a bit pricey but the food is good, the service is great, and the restaurant is clean. Their dim sum is tasty and the food is not greasy at all. The also have great tea selection, which can compliment the food you order.  One thing though - the parking at the hotel is not so good. There is always enough parking I find, but it requires some skill to park your SUV. If you have some extra $, ask for valet."}
{"text":"The best dim sum in Toronto. We've been coming here for many years for special occasions, like my birthday! Never disappoints both service and food! Phil"}
{"text":"Amongst the Asian population, this place is an institution and is known to have the best high end Chinese food in Toronto! It serves very authentic Chinese food, but much slicker, better quality, and better presentation than its counterparts in Chinatown. I have been coming here for more than 10 years and it is always the go to place I take my friends and family when they are in town looking for Chinese food.  It makes me sad to see some bad reviews. My only criticism about this place is that the underground parking is ridiculously cramped by North American standards. For example, on the ramps connecting two levels and the surrounding corners, only one car car fits at a time. If another car is coming from the other direction, one has to back up. You get significantly discounted parking for dining here, but I'd rather pay full price for the Green P lot adjacent to the hotel."}
{"text":"Not only did they nail the classic dim sum dishes, the chef has also created his own unique takes on the classics like lobster dumplings and foie gras rolls, and these dishes were very well executed. Service was one of the best I've had in a Chinese restaurant (and I have seen them all). Great place for \"innovative dim sum\"!"}
{"text":"Food is OK, great setting higher end Chinese food. Over price food. Some of the dishes is per serving.  6 orders of dim sum cost $50.00 Been there done that. Not going to go back."}
{"text":"We had the peking duck 2 course meal (with crystal fold lettuce wraps) and the $12 dimsum per pax for 2. Really disappointed with the service and I regret booking reservations so late in the evening. If the restaurant is unable to deliver proper service to their customers past 9PM, THEY SHOULD NOT ACCEPT RESERVATIONS FOR 9PM.   First issue: I'm not one of those diners that are picky when it comes to service but this time I cannot deny that the service was RUSHED. I might as well go to Asian Legend during closing time on CNY during a Friday night. I am not picky when it comes to service but it literally made us feel sick after. It's not even about the money we paid. It felt like an eating marathon of peking duck wraps - they fed us like a conveyor belt. I appreciate their efforts to prepare the duck wraps for us but I'd rather do it myself if it means being able to pace myself. Couldn't even breathe between wraps let alone have any conversation... This was on my birthday :(  Second issue: we paid $60 for a whole peking duck but I really don't think the whole duck was served to us. They wheeled it away after the flour wraps and the fact that 2 people could put away 1 whole duck is a bit questionable to me (I've had a peking duck shared amongst 6-7 ppl at one point). Also for a seemingly reputable restaurant, I don't think the crystal fold duck medley was made with the same duck presented to us... It was warm when served 10 min after the wraps and not hot...   Now the food itself... the Peking duck was average at best - it was good but the service really put a damper on the experience :( im not even exaggerating.. also the Dimsum platter (4 types of dimsum: shrimp roll, spring roll i think, har gow and siu mai) was decent, and since it was served at the start of the meal, it didn't feel too rushed. The shrimp roll was loaded with shrimp, spring roll was good but nothing memorable hence me having trouble recalling it, har gow and siu mai were awesome (very different texture and taste from any other I have had).   TL;DR just because they take reso's for 8-9pm, don't do it! Try to go for lunch when they have the dim sum menu available and the time to treat you right!  NOTE : my friend and his girlfriend went to Lai Wah Heen the night after us and ordered the same thing and they told us they received this type of service too!  UPDATE: I would have spoken out to the manager about this but he completely vanished in the back! Oh and they LOCKED US IN THE RESTAURANT! We had to let ourselves out"}
{"text":"Although the decor and service is nice, the food itself is just OK.  The chefs specialties are probably what makes this place unique from other dim sum places.  I ordered the wagyu beef and lobster dumpling from the specialty section. The beef was good but the lobster was not.  The lobster came out looking like  it was taxidermy'ed into a hard chewy orange gelatin. Def not worth $6/piece!    From the standard items, the beef stuffed fried eggplants were good. The inside of the crystal shrimp was ok, but the dumpling skin got really tough after a couple minutes of sitting on the plate. Maybe this is due to the fact that everything is coming out from the kitchen instead of the traditional hot carts that keep your food warm and steamed. I got a bunch of other stuff too but nothing notable to mention.   Honestly, the only item I really liked was the black sesame balls. These are the traditional deep fried sesame balls but with a hot gooey black sesame filling.    Oh and whatever you do, don't get the vegetarian mock duck. It's nasty!"}
{"text":"I went there for dinner. I am happy with the food but it's not very impressive. I do like the ambience and efficient servers though. It's a little pricey but I guess you pay for the ambience."}
{"text":"We went to Toronto in early June. The weather is fantastic with sun shining everyday. We came with the expectation of trying out some great Chinese foods in Toronto.   We were not disappointed with the restaurants in Toronto. Lai Wah Heen is one the best Chinese restaurants in Downtown Toronto. We had dim sum with our friends on a week day. With my friend booking it a day before, we have no trouble of getting seated upon arrival at the restaurant. We ordered our favorite Hong Kong dim sums including glutinous rice, pan fried turnip cake, crispy fried noodle with seafood and egg tart. One bite, I felt I am back in Hong Kong. The dim sum taste here is just as good as in Hong Kong. No wonder Toronto has such a good reputation for Chinese food.   In addition to the good food, the environment and services matched the high standard of food. The restaurant is on the second floor of the downtown Double Tree Inn hotel. You wouldn't hear the loud noise of a typical dim sum restaurant in China town. The waiters are very attended and alert. They change plates for you frequently and refill the teas without asking. We definitely will go back when we visit Toronto again."}
{"text":"I come here once in a while for dim sum since the food is generally good. The dim sum dishes here are presented very nicely, and service is top notch.   Due to its higher price point, I expect the dim sum to be reallly good. However, some dishes are just okay for the price . I have a few favorite dishes that I must get whenever I am here for dim sum .   My favorite dim sum items: -deep fried lobster dumpling -siu mai -baked mini puff pastry"}
{"text":"Nice upscale decor at this restaurant.  The food itself is fairly good and looks a bit fancier than your average Chinese restaurant but for the prices they charge it should be a lot better.  Its a decent option to visit once if you are celebrating a special occasion but other than that there are so many other Chinese restaurants in the area that are also good that provide better value."}
{"text":"Had the peking duck and foie gras fried rice delivered to my place. Suprisingly both items held well and tasted almost as good as dining at the restaurant. -1 star for a little extra fat on the duck than usual."}
{"text":"Fancy and high end dim sum.  I did like the premium ingredients and the attention to presentation.  For instance, our lobster steamed dumpling was decorated like a tiny lobster.  However, the flavors were pretty straightforward for what you'd get in a run of the mill dim sum place.  I would have liked some more innovation in flavors.  Though it's high end, we thought that the value was there."}
{"text":"This place is special to me because they catered my wedding 8 years ago and basically was the deal maker for me to choose Metropolitan hotel and its gorgeous ballroom for the reception.  The irony of it all is I wasn't able to eat the food on my wedding day.     Dim sum here is expensive but worth it for the rich foie or truffle seasoned items.   I highly recommend the broths.  Service is always efficient and thoughtful."}
{"text":"Not that good.  First of all, this was a very difficult restaurant to find. I had to call the place from outside the Metropolitan Hotel, to be told that they were located inside the hotel. Then, we went in, only to be told that the restaurant is upstairs and down a long (and wrong-way-looking) hallway. But finally, we got there. The service was passable, and the food was mediocre. Very expensive for what we got. We should have stuck with other restaurants down Queen Street."}
{"text":"Service is very inconsistent - the difference is on the extreme end of the scale.   Peking duck is what we usually come for, with a side order of foie gras with beef tenderloin. Quality is always consistent, not the best Peking duck we've had, but it tasted \"cleaner\" than the other restaurants.   Also got to try their dim sum, their sesame ball is so amazing!"}
{"text":"High end authentic Cantonese food. We came here for dim sum and also ordered fried rice (had pineapple) and chow mein"}
{"text":"Inside the Metropolitan hotel this lavish restaurant puts you in mind of the Hong Kong 5 star hotel dim sum experience. Service was impeccable and the range of dimsum was excellent. The Har Gau (shrimp dumplings) were plump and fresh. Many of the dimsum were original but a lot of the old favorites are there. Be warned though if you are looking for the overloaded MSG enhanced flavours you won't find them here. Expect freshness and subtleness instead. It is not cheap but it's worth it and will be my regular stop visiting Toronto"}
{"text":"came here for a catch up dinner w/my brother and a friend. It was waaay classier than we expected (to the point where i looked down at what i was wearing and was asking myself if they'd let me in) ... (we got in no problems in jeans and a hoodie).   The servers spoke English fluently and were really attentive (some people may find them overly so) but then again it was pretty empty when we got there (at 6:30?) It filled up when we left (8:00).   We ordered (i don't remember the exact names of the dishes)  Beef with mandarin peel  Taiwanese drunken chicken  Pork belly  Tofu pot.  All of these dishes had some vegetables in them.  Beef with mandarin peel - out of the four dishes, this was the weakest one. There is a citrus-y kick after you've chewed the beef a few times, but otherwise, it's nothing special.   Taiwanese drunken chicken was good - the chicken soaked in the rice wine, texture was really good.   Pork belly was one of the stronger dishes. you'll need a knife to cut them up (the dish had 4 pieces). it was firm and the sauce on it was just the right amount of sweet.   Tofu pot was fairly good - not too memorable (could be good or bad :) )  I'd come here to take my parents out to eat, but it's not really a place for new, young professionals :P"}
{"text":"Excellent set menu Dimsum. Pricy but worth every bite."}
{"text":"Very fragrant jasmine tea. Food was pretty good. The lobster \"har gow\" was shaped into a lobster. Pretty cute. presentation was excellent. It is one of the better and cleanest dim sum place in downtown Toronto.   I only give it a 3 star because i had better/tastier dim sum elsewhere."}
{"text":"Bad bad bad. I had dinner there, not dim-sum. And this place is just grossly overrated, or it has gone wildly downhill since many of these reviews were written. The food was mediocre at best, and poor at worst... I have had a lot of really quality chinese food as I grew up in New York City, and have traveled extensively in China. The best way I can describe this is that we were paying $25 to $30 for entrees that I would have been mildly disappointed with if they had been at a $10 corner Chinese restaurant. The few appetizers we had were greasy and flavorless. The roast meat platter was terrible -- cold and flavorless -- and that was *after* the waiter had to steer us away from one of the meats that he said wasn't great. Don't go here."}
{"text":"The food is really nice!! But it's so expensive! Should try it if you are a huge fan of dim sum! Nice environment and service"}
{"text":"This is one of the best dim sum places that I've ever been to. It's a little pricey but definitely worth it.   The dim sum was really tasty and fresh. I will definitely go back when I visit Toronto."}
{"text":"Very expensive for what you are getting, service is also very slow, there are so many great Chinese restaurants, don't understand how this one survived so long...maybe because there are not so many options downtown?"}
{"text":"Went there yesterday with my boyfriend and we ordered their Innovative Premium Prix Fixe. Their dim sum was amazing - especially anything with shrimp in it. We left feeling super full and very happy with the service. Everyone was very attentive. The manager even helped me charge my cellphone."}
{"text":"Best thing there was the tea. It was very flavorful. The food was not what I expected. It looked presentable but was tasteless. I do not recommend going there if you want authentic Chinese food."}
{"text":"It was a nice place. Foods were okay and staff were okay. The atmosphere was comfortable. Even though it was busy and I was chatting my friends long time, it was okay. Foods were okay and their puddings were good, but other items were just okay not very good. If I were in the area and I did not find other dim sum places, I would come back."}
{"text":"A group of 8 of us dined here for Sunday Dim Sum. The food is great, although a bit pricey. Service was excellent as well--definitely worth a try. Explore their noodle dishes, some might surprise you as being very, very good!"}
{"text":"This place is mediocre at best. I'm not sure if you're psychologically wired to think it's better than the average Chinese restaurant because of their price because the food was really just A-OK.   We ordered a set dinner - $88.00 per person. The abalone appetizer was so hard I couldn't even cut through it. It was pretty much the worst abalone I've ever had - small, tasteless and took forever to chew through. Next we had Cream of cassava with crabmeat, which was pretty good. You can tell it's been brewed for a few hours, too bad the portion was very small..  The next item was the scallop mouse cakes (2 pieces of scallops) and that was smothered in XO sauce. I personally like spicy food, but my mom couldn't tolerate it. Next, there was the lobster baked with cheese on top (I can't really see how this is a \"Chinese\" dish) and this dish was pretty good. Lastly, the chicken with 'exotic' mushroom in soy sauce was way too salty and oily for me to eat more than a few pieces. It was also served with foie gras fried rice, which was yummy - who can go wrong with fried rice?  As for dessert, we were served with cheesecake and mango sorbet. I was expecting red bean soup or something that is actually a Chinese dessert. The clientele is largely caucasian, which may have something to do with non-Chinese dishes. You will not expect to see many Chinese people dine here.   Overall, way too overpriced for the quality. I would rather go to places like Congee Wong or Kenny's Delight to get my money's worth."}
{"text":"I dined at this elegant Chinese restaurant years ago when it was located in the Metropolitan Hotel.  Back then, Lai Wah Heen received glowing reviews and it was a darling of all the critics.  Lately, you hear very little about LWH, as social media extols the virtues of trendier and hipper establishments catering to that pervasive youthful vibe.  However, Lai Wah Heen has not missed a step and is still one of the best Chinese restaurants I have ever dined in.    The decor maintains its zen like ambiance and service is still \"old school\" attentive.  The Peking Duck was sublime, perhaps the best I have ever tasted, surpassing what is purported to be the best in NYC.  The Dim Sum is prepared beautifully, portions large, and tasting great. The noodle dishes are incredible and we took some back to snack on later.    We ordered an enormous amount of food and I expected an exorbitant bill.  Low and behold the check came to 120 Canadian dollars for three people who ate more dishes than we could count.  Lai Wah Heen is unbelievably reasonable and is an experience not to be missed."}
{"text":"Once we ordered, we were virtually ignored, despite being in a very central and visible location in the restaurant.  This was my first experience at this restaurant, despite staying at the hotel above and below it several times, and I must say I felt the service and food was a bit lacklustre.  I think I'll stick to some of the restaurants elsewhere in Toronto."}
{"text":"Great upscale chinese restaurant. Bit on the pricy side but hey u get the quality u pay for.  The shiumau and the hargaw are packed to the brim.  Great food eventhough service may be a bit lacking due to the crowd"}
{"text":"i give it a 2 and half  Had dim sum today here for a change from the cheaper options on Spadina.  The white table service is a refreshing change from the regular chinese out of the box decor.  Bathrooms very clean, check, restaurant very clean, check, view very nice, check.  Servers still have that untrained attidude you get at chinese restaurants (4 people checked out bill fold to see if we were done, brought us all forks/knives didn't ask and water for three although one was asked for).   Parking is free in the hotel as long as you bring ticket to be verified. Then you go to concierge of hotel for them to scan.  Each dish step by step:  Pork with Mushrooms in a Sweet Pastry:  tasted like the british pasties that you get, I liked it.  Husband didn't.  Kinda a chinese meat pie.  3 for $3.50 each  maybe not worth the price but overhead is high here.  Seafood Springroll with a peanut schewan peanut dip:  Although tasty it was on the greasy side not much seafood taste the deep fried overpowered the filling.  Dip was very good.  They were $3.50 per order and served individual to each diner.  Lobster in noodle with butter and cilantro in steamer, one comes in each steamer shaped as a lobster, although interesting not that great would pass on this one.  $6.00 each  Spareribs in garlic with noodle, was good but not that different from Rol San Piquat.  $6.00  Sui Mai with scallops was on par with all dim sum that is a reasonable restaurant $6.00 for 4  Chinese greens with oyster sauce $8.00 for an order that was very small and seemed out of season.  I don't get it this stuff,  it is so cheap to buy in chinatown but always a king''s ransom at any chinese restaurant..take a pass  steamed tofu with shrimp and scallions, the shrimp was very good and fresh the tofu was too small the size of a quarter and they only gave you two in the steamer $6.00  Har chung fun and sticky rice in lotus leaf...both exceptionally good but pricey $8.00 each (2 sticky rice, 3 shrimp roll)  Jasmine tea $2.00 each is very good, one beer tsing tao $7.50  Three people $90.97 plus $15 tip.  free parking.  Although pricey the quality is above many dim sum places in the downtown core.  It is fresh but not outstanding in creativity.  Will try again and stick to the regular fair we usually order.  Maybe a 3 times a year kinda of place."}
{"text":"Great food. Fancy way to prepare it. Staff is always here for you, taking very good care of you. A very good time. Loved it !!"}
{"text":"I enjoyed my meal here and was tempted to have the veg tasting menu but it pretty overpriced."}
{"text":"Lets face it, dim sum can be a stressful experience. The waiting, crowds, loud noises and rushed service can all be off-putting. It may be a big price to pay for those delicious Chinese tapas that we call  dim sum.  Some may argue these unpleasantries are part of the quintessential dim sum experience, but I disagree. I don't like crowds and I don't like noise, so typically I stay away from dim sum. Lai Wah Heen is an exception to the typical Dim Sum experience.  Dim sum at Lai Wah Heen is more like a High Tea experience. It's mostly calm and soothing. The service is impeccable with attentive uniformed waiters. The ambiance is upscale with white tablecloth and minimal ambient noise.   It's pricier than average dim sum. True. But you get what you pay for. All the dishes are very good. The clay pot eel rice is delicious as is the steamed bean curd sheet wrapped with mushrooms. My gf's favorite dish was the steamed chicken with fish maw in rice wine sauce.  Now that my mother lives in condominium close by, Lai Wah Heen may be my new go-to for some \"peaceful\" dim sum. It may be more expensive, but it's worth it in my opinion, since I only get dim sum occasionally."}
{"text":"Really great food! The crab dumpling is  can't go wrong with much. Exceptional dim sum."}
{"text":"My daughter took me out for my birthday dinner there.  We have been to this restaurant a few times before and the food and the service was always good (two years ago).  But that nite,  everything was a total disappointment from food to service and more disappointing was how the owner/management handled dis-satisfied customers!  We ordered the peking duck set dinner and ordered a few extra dishes.  Our dinner took 3 hours to finish! Considering this is a Chinese dinner, it is unusually long!  The dishes came one by one very slowly and no one told us why...We asked to have the vegetables dishes came earlier but one came at the end of the dinner and the other one did not even come at all even though the waitress kept saying it was coming or even telling us it was being cooked and this was just a steamed tofu dish!   Unless they made the tofu from scratch, I dont see how it would take 3 hours to make!  The food was oily and plain.  The worst of all these unpleasantness was the owner's approach to deal with concerns/complaints.  He needs to realize and acknowledge that the food and service was unacceptable!  People go to his restaurant for a great meal and great experience (his restaurant is not a regular cheap Chinese restaurant, at least it used to be quite special).  For him to be so arrogant and he rejects feedbacks,  he shows no passion for his work and his restaurant.  If you want to go to a nice Chinese restaurant,  go to Lee Garden or Dynasty, as the food and services are consistently good!"}
{"text":"For those who may have noticed something different, LWH is under new management. Some of the existing wait staff are still here while others are gone - no longer protected under their union. One wait staff has been promoted. The original chef at LWH has been replaced by the one that used to work at LTH.   I don't notice it, but many say the cooking is different; One is more modern/fusion (LTH), while the other was more classic Canton.  Either way, I still think the food is very good. And so does my family as we loved LTH when it was open. And since my family were familiar with staff at LTH, nothing much has changed for us. Service is still excellent (we love it how we get our special hot sauce when we come). And the food? They now have Egg Tarts for Dim Sum (I still remember the dismay when they removed that from the menu). And anyone remember those long, fried, shrimp rolls at LTH? Yup! They have brought that classic over here!  Despite the mixed comments I have heard about the new management, I won't complain. I, and my family, are still grateful that there IS a LWH. The first time my family heard whispers of LWH closing down, we all sat in silence and stunned. We thought such an integral part of our lives would be gone (my family is prone to melodrama).   Happy Times though!"}
{"text":"I can say with conviction this place for dim sum is comparable to East Sea, Fok Lum Mun, and Four Seasons in HK who has M stars. Their DS creations are unique lobster, crab, foi gras, and other offerings are delicious. So are their regular menu DS. Service is attentive and not over done. The food overcomes the sometimes slow turnaround and it's need for a face-lift."}
{"text":"Party of ten.   One particularly picky eater, with both real and imagined food \"allergies\"*.  One native Chinese.  One strict vegetarian.  So, off we go to the only place in this great city of our that fit the bill (food allergy sufferer's request)??? I had heard good things, but right from the start, the Ambiance is like a grandmother's apartment a la 1990 with black lacquer and flowers.  We were not there for dim sum, but for a late dinner. Most of us looked at the pages and pages of menu and didn't know what to get.  So, the majority of us left it up to the Chinese native- let's experiment.  Vegetarian started getting nervous around this time (e.g. if she eats steamed veggies and tofu, should she really be asked to split the bill for the people eating crab?) The plates started coming and I think we all were able to taste a bit of everything that fit our particular restrictions.  Veggie Ma-Pa Tofu was spicy, but I added even more spicy sauce.  Whole crab cooked with egg coating was my favorite, but I could have used a lot more water through the meal as this was essentially salted crab.  A few other duck, veggie, seafood dishes kept coming and 9 of us were like- where is the rice??? Our food is getting cold and we weren't able to eat it without the rice.  Someone spoke up and finally we get the rice and start passing the dishes. Well, apparently at a fine-dining chinese restaurant, rice is not something you actually eat WITH the food, but AFTER the food. So, although the staff will accommodate western attitudes, this is a big faux pas!  After 3 bottles of wine between the table, and a few people who didn't imbibe, we go to split the bill and argh- it's one of those bad bill splits. Ten credit cards, at $50 each. A few folks went home and ate cereal to fill up. I'll pass the next time this place comes up. I fail to see the difference between $8.99 Tofu and veggies served with AYCE rice and $19 tofu and veggies followed by a small bowl of rice. ______________________________________________________ * Allergies to food are a real and potentially life-threatening problem.  However many people have intolerances that they call allergies (e.g., vomiting or diarrhea with antibiotics is a side effect and may be irritating, but should not be classified as an allergy.) This particular person has 'allergies' to sushi that isn't yellowtail or top of the line tuna. I have my doubts about many other of his preferences."}
{"text":"Absolutely amazing dim sum. I ordered a variety of pieces, and they were beyond delicious and beautiful (and in some instances, creatively!) presented."}
{"text":"Nice room.  Fresh dim-sum, but lacking flavoring.  Not impressed!!!"}
{"text":"This place has excellent quality and service.  It's a little pricier than most uptown Chinese restaurants but not by much.  The service is top notch.  We ordered the Peking duck and it was perfectly done.  They even wrapped my duck for me...actually I prefer to do that myself but the service is what I paid for.  The restaurant is elegant and very nicely decorated. I wouldn't go all the time because it is downtown but I would definitely bring my guests there."}
{"text":"Food was interesting but very expensive for what you get. service was really bad. very unfriendly and unhelpful staff. save your money and get regular dim sum."}
{"text":"So many hater reviews I had to say something.  It's understandable that most people think this is an overprice place for dim sum but this is an UPSCALE restaurant, not some place in chinatown.  It's like going to a nice french restaurant and expecting to pay bistro/cafe prices.  Most chinese restaurants are loud, sometimes dirty, and the food can be very spotty if you don't know where to go.  This place is very clean, the food is good and the atmosphere is great for a NICE meal.  I grew up in Toronto and have been here probably 25 times over the years and have always had great service.  Granted my family are regulars in the chinese restaurant scene and therefore know everyone but I don't think that's the only reason.  The dim sum is pretty good but I also had my wedding at the Metropolitan Hotel and Lai Wah Heen catered the event.  All 150 of my guests were VERY VERY happy with the dinner and we had a GREAT time!  The food was awesome and menu options were great for those who might want to spend less or those who don't mind splurging on their events.  All that said, I was so happy to have our reception catered by Lai Wah Heen and would recommend dinner here to anyone."}
{"text":"There are plenty of good Chinese restaurants out there, but being one of the, if not the most expensive Chinese place in the city, I'm expecting more."}
{"text":"The fact that Lai Wah Heen sits inside the Metropolitan Hotel clearly tells you it's not your average dim sum. The restaurant itself presents like your usual haute Chinese restaurant - clean, simple and beige.    My experience was pure culinary pleasure at a cost of about $45. That's a price tag I will swallow for a great friend. So, in honour of Aerie's birthday, we gathered to indulge in two orders of Chef Chan's Innovative Dim Sum Prix Fixe and two of the Classic Dim Sum Prix Fixe ($30). After trying both I would recommend the Innovative menu because if you're already going big, go with the biggest.   My favourites of the day were the steamed dumplings of Waygu beef, truffle and lobster escalopes, pan-seared cake of red wild rice, sticky rice, shrimp, pork and pickled vegetables, and of course, dessert - a yolkless egg tart and a mochi of red bean paste. The last two were enough to put me over the edge of happiness.   The service was what I would expect from any Chinese restaurant, and while there were no carts, there were glorified dim sum caddies who brought the freshly made dishes out so that a waiter could courier them to your table.  It was delicious in all its ostentatious glory.  You get what you pay for: classic dim sum amplified in flavour, quality, and of course, cost."}
{"text":"As far as Chinese restaurants go...this is an extremely nice restaurant...and the food excellent...the Metropolitan Hotel itself (in which the restaurant is) is somewhat depressing."}
{"text":"this review has nothing to do with the price, because for years i got to (and continue to) wave my \"kid status\" at family gatherings - uhh... let the awwn-tees and unk-kos fight over the bill.   in fact, i just recently learned that it was the Lai Wah Heen that so many rave about. i only knew it as the place close to grampa's. when he was alive, we'd go here for dim sum and dinner pretty often. but now that he's dead, we never go there. the wider-family takes turns in Markham and Mississauga for meals.   the point is that Lai Wah Heen's quality of food and service, as well as central location make it *the* downtown Toronto choice for chinese food in a more formal setting. but if not for the convenience factor, it may not be worth your while when similar quality is to be had in the near-905."}
{"text":"Oh Lai Wah Heen (LWH) we have had a sometime platonic and sometime affectionate relationship in my years up North. When I moved up to TO at first you seduced me with your immaculate dim sum while cleaning up my wallet and I kept on coming back like a masochist  thinking I can live with something being wrong all my life!  Then we broke up as I moved away and you found a new paramour (the duchess of LWH Charlotte W. I am calling you out) and our encounters became few and far between to an extent that I no longer come here or look the other way if I want dim sum. However you have rekindled our luv today as my fling for Peking Duck (Chung King Garden) disappointed quite a few times. As my eyes started to wander when an opportunity came up to visit you for dinner I immediately seized it.   Hmm Peking Duck for 2 people seems like a odd choice but this is the spot I wanted to try given our tumultuous history.  The bird was brought table side and the aroma was intoxicating with beautiful golden hue on the skin. Then the duck was carved table side and neatly placed in the purpose made pancakes (here is to other spots tortillas are not meant for Peking Duck!) They even placed the hoisin sauce, scallions and cucumber in for you already which is a bold move IMO as they are assuming the responsibility to get it right. Folks this is the way it is supposed to be just the ideal combo of crisp in the skin and succulent soft portion of meat to balance this delicacy.  One is left with a clean finish and not the greasy feel one gets if this course is not done right.  Next course is Crystal Fold - wok-fried minced duckling, assorted vegetables and fried noodles wrapped in crispy fresh lettuce leaves. The lettuce has the right amount of crunch so I am assuming they put it in ice water before serving.  They also provided house made hot sauce which packs a punch if you prefer some heat. An excellent way to extend the duck   We could have stopped here but the other diner wanted to try the 3 cup chicken as was craving this dish after seeing it on the menu. I haven't had this dish before and my exposure to Taiwanese style dishes has been limited so I didn't know what to expect.  From what I was told the name denotes the equal ratio used for the three key ingredients i.e. sesame oil, Chinese rice wine, and soy sauce with a true version also including basil leaves.   The presentation was interesting and the aroma was intense. I tried the chicken without the rice first and didn't appreciate the nuanced taste. Things improved when I had it with rice as it balanced the lightly greasy chicken . Hmm I didn't enjoy this dish much as couldn't appreciate the combo of these flavors however my fellow diner commented it was pretty authentic (only flaw being a slightly sweeter finish than the one served in Taiwan). The service started out excellent and then slid a bit as the place got packed (I have a hunch regulars are given a preferential treatment reminiscent of my limited exposure to some of the spots in HK)  however the meal more than made up for this shortfall.  There you have it folks this is among the best fine dining spots for this cuisine and I think I am going to woo it again.  To the people who say that only unfulfilled luv is romantic I say you are wrong rather its a river of fire and the only way to get across is by drowning in it!"}
{"text":"I've been avoiding this place thinking it was going to cost a small fortune to dine here.  If I can go uptown and eat the same food and pay half the price, I figured there was no point.    Today was a special occasion though, I attended a City Hall wedding!  The bride wanted dimsum so we thought, let's splurge!    Overall, the service was amazing.  I would pay a premium just for that!  Very attentive, courteous, and I never felt rushed.    We ordered the standard dishes of shrimp dumplings, siu mai, shrimp rice rolls, beef rice rolls, and various other dishes.  Everything was fresh and tasty.  The one dish that wasn't up to speed was the chicken dumpling with truffle.  It wasn't steamed evenly so the wrapper was a tad dry.    Our bill came out to about $25 per person including tax and tip.  We weren't stuffed, but we were feeling comfortable and satisfied.    I do have to say we didn't order the premium dimsum pieces and that's how our bill was still quite reasonable.  When you go with a larger group, you can order more dishes and get a better variety.  Btw: the XO sauce they have at the table is amazing!  It's this combo of dried shrimp, dried scallop and chillies.  I can eat that goodness on plain rice and be a happy diner!"}
{"text":"Was craving Peking Duck and found a coupon for half off on their website if you spend $50 on food. We began with a bottle of Prosecco since we knew it would be good with the duck and probably also the dim sum. It's hard to pair affordable wines with Chinese Food, so this was the obvious choice. We had the crispy foie gras, which was actually too sweet and the foie gras was lost inside the tempura batter. I would have said the orange sauce was far too sweet if not for the pungency of the orange. Little tempura broccoli florets were very good.  Dim sum platter was a nice mix of mushroom and shrimp spring roll. It was nice to have a spring roll that did't come frozen from a box. Shatteringly crisp and tasty. I asked for some hot sauce (which was both spicy and flavourful) for my shu mai. Really delicious.  The duck was perfect and we were almost full by the time we were done with the crepes, which themselves were soft and well made. Service was attentive never leaving us waiting for another pour from the bottle or a plate of duck. I did find that they portioned the duck for the crystal fold in two heaping servings each on a lettuce wrap. I think they were closing and just wanted us to eat it all at once. Maybe this is the way it is always served, but a few more lettuce wraps with a smaller amount of the duck would have been nice.  Shrimp in sundried Chili sauce was excellent. We were very full but managed one each and the shrimp were plump and juicy beneath a crisp batter. We asked our server what main dish she recommended and this was her pick. I may have gone with something that wasn't deep fried, but everything was very good.  I'd definitely comeback for dim sum or bring my parents here for a dinner if they were in town."}
{"text":"I went here for dinner, i cant imagine that my other reveiew was accurate, giving it only 1 star. That being said the food was just good. Coming from LA it is hard to find a chinese meal worth eating outside of my home city. We had a dinner for 8, the Peking Duck was good, we had a fried shrimp that was excellent as well as a clay pot chicken which was fantastic. We rounded it out with some wok fired beef, roast pork and some pea shoots, all which were very good. However, it is out of the way, pricey and not visually exciting. I remember Rol San at least for Dim Sum being much better, but im gonna try that again as well."}
{"text":"Dim sum in a hotel. Fancy food. Yum! The strategy is to go for the special items that other dim sum places don't offer. I don't get to try the deep fried green tea bees that some yelpers posted a few months ago. I guess those are seasonal. Will come back."}
{"text":"Tucked away on the second floor of the Hilton Doubletree Hotel, this restaurant is a hidden gem. While the décor is modern, uninspiring hotel style, the food is Hong Kong style French cooking with Chinese flavours, a fusion that works to perfection here. This place will confuse traditionalists, annoy the cost conscious, and thoroughly gratify those looking for a gastronomic experience not bounded by strict conventions. First was the Dim Sum platter four kinds. The crystal shrimp dumpling (hargow) was really good - plump shrimp in that sticky rice wrap. The beef ball was also good, but it's not my favourite dim sum. The vegetable spring roll was also good, but also not one of my favourites. The crispy shrimp roll with a hawthorn sauce was crispy, crunchy on the outside, shrimp goodness on the inside, with a delicious sauce - excellent! The pan seared foie gras in dark vinegar sauce on crispy fried rice cracker was a total revelation. I love foie gras, and I love dim sum, but I had never put the two together before. Wow! The crispy rice cake makes the perfect medium for the base of the seared foie gras with that amazing sauce. Again, wow! The deep fried minced lobster in a crispy fold was incredible. Sweet, succulent lobster in a tangy sauce encased in a crispy rice coating, I could eat 2 or 3 hundred of these in one sitting, or at least try to anyways. The deep fried crab claw coated with shrimp mousse was a bit of a disappointment. It was good, but beside the other dishes, this seemed ordinary by comparison. To say the pan seared jumbo scallop with truffle cream sauce was exquisite would be an understatement. Reminiscent of coquilles St. Jacques, the perfectly seared scallop floated on top of a rich cream sauce scented with a truffle slice - magnificent! The classic recipe of pork belly in dark vinegar was much more traditional Chinese, with a beautiful presentation to boot. The pork belly was sumptuous, rich, soft, utterly and decadently delicious. The wok-braised bunashimeji, king oyster and enoki mushrooms with seasonal vegetables were fabulous. The mushrooms were perfectly cooked - soft but not mushy, served above some simple baby bok choy braised in broth so they were tender and sweet with no bitterness. The deep fried lamb rack with truffle and assorted mushrooms was terrific. Deep fried rack of lamb was a first for me - delicious, tender and not overcooked. The assorted mushrooms enhanced with diced truffles was the perfect accompaniment. We enjoyed it so much we actually went back the next day for the Dim Sum! First to arrive was the deep fried crispy wonton of pork & shrimp - the wonton wrapper is flat and the filling is cooked on top like a mini pizza - and it was delicious! Rich flavours of minced pork and shrimp with a crispy crunch - yum! The steamed dumpling of lobster and shrimp in garlic butter. The dumpling is shaped like a little lobster, and filled with tender, tasty chunks of lobster and shrimp meat with a light garlic herb butter flavour, a feast for both the tastebuds and the eyes. The steamed beancurd roll of mushrooms and truffle - the balance of flavour between the rich mushroom and the beancurd topped off with the truffle is fantastic! The fried tofu sheet roll with mushrooms and dark vinegar was awesome! Kind of a fried version of the previous dish, but with a balsamic-like dark vinegar for dipping - oooh, so good. The steamed dumpling of scallop, bokchoy and caviar is a more delicate taste sensation, but so rewarding and beautifully balanced in flavour. The seared crab claw, shrimp and green chive wonton is a dream come true. Here, the crab is the centrepiece of a jewel dumpling, steamed and pan fried to maintain the lightness and sweetness of the meat. Possibly the best crab claw dumpling I have ever had. The chicken and truffle dumplings arrived next. Tender, juicy small chunks of chicken perfectly cooked and enhanced by the truffle - quite possibly the best chicken dim sum dumpling I have ever had, period. The deep fried dumplings of Berkshire pork and baby shrimp are shaped like little pigs with garlic sliver ears - terminally cute, but I found the filling a little too sweet and the dumpling a little too doughy for my taste. The crispy fried pastry of foie gras and minced pork was insane. A small pastry tart with a rich pork stew-like filling topped off with a piece of seared foie gras. Please lock me in a closet with 1000 of these and go away! The deep fried prawns and scallops wrapped in bacon is a delicious upscale take on the pub classic. The seafood is not overcooked, the bacon doesn't overwhelm the dish, and it isn't oily and leaden but light and flavourful. Dangerously delicious! The shrimp and yellow chive in rice roll, and the beef and mandarin peel in rice roll are the two traditional dishes we sampled from the collection. Both are very well done, using plump, large shrimp and perfectly flavoured beef in the classic rice roll form with the sweet soy sauce. Loved it!"}
{"text":"Located in the Metro Hotel, Lai Wah Heen is a gorgeous restaurant and dim sum location.  We decided to have dim sum for Sunday brunch and were happy to be seated without much of a wait.    All ordering is done from a paper menu that includes English and Chinese translations.  Selection is good and prices are moderately high.    Service is polite but otherwise unspectacular and the decor is perhaps the most notable thing about Lai Wah Heen.  It really is a beautiful place in the Metro Hotel and great to take out of town guests or visitors.    As for the food, it's solid but not noteworthy.  Most items are done well and they do try to add some variations to befit the high class location.  For example, XO sauce is included standard on all tables, the shiu mai is topped with a scallop, and the egg custard consists of egg whites only.    In the end though, while I appreciated these touches and the nice atmosphere, I thought the food was only ok.  I'm guessing there are better dim sum choices in Toronto, but if not, Lai Wah Heen is a safe bet.  Lai Wah Heen takes American Express."}
{"text":"Food is good. Compared to the $3 dimsum that I usually get, you can definitely taste the difference. Much less greasy, and much more flavorful.  We ordered some of the $9 a piece things and they did not disappoint my taste buds. However, no matter how prepared I am, it's still $9 for a bite, and subconsciously I'm just wondering if I could get the same quality for a tenth of the cost.   In general, all of the dishes were enjoyable.  Service I found it be pretty standard for a chinese restaurant. Perhaps it was because we were not dressed as well as the other diners who were decked out in business attire? The female staff paid very little attention and just served up dishes as they came. One guy however did take the time to explain what the dish was. Then again, it is a chinese restaurant, so I don't expect it to be that much different. Just the culture right?"}
{"text":"A really nice upscale dim sum joint that unfortunately is lacking in flavor...   The staff were accommodating, and polite, the mixed seafood fried rice was delicious, but we were all let down by all of the other dishes. Not that they were bad, not at all, but we have had a lot better in toronto.  (our favorite is pearl at the harbor front, but we are always on the hunt for another great dim sum place."}
{"text":"Grand dim sum in the heart of Toronto.  This restaurant's lovely atmosphere and history are met with decent service.  The range of wines is very nice, making this a great place to feast on dumplings whilst remaining liquid-fueled.  Makes for a good luncheon, date, working or celebratory dinner."}
{"text":"3.5 stars. Upscale dim sum venue that tries to get creative with traditional dishes but for some dishes I would've just preferred that they stick to the original recipe such as the crab claw and shrimp dumplings. I don't think it was worth the price tag. I was barely full and with tax and tip my portion was close to $50 (we had a table for 10)."}
{"text":"Best Dim Sum in the whole world Thus far. My friend 's concur.  The service? well.....it is Cantonese after all.  try the seasonal menu. the sea cucumber and foie gras is out of this world and most of their exotic desserts.  A favourite of mine for over a decade continues to deliver high end quality food.  Don't be discouraged by the wish washy staff or limited libation menus. it is the food that really counts."}
{"text":"While this is quite expensive for Dim Sum it was DELICIOUS.  Verrry authentic and very fresh.  The Lai Wah Heen fried noodles are amazing with big pieces of fresh seafood.  We ate the crystal shrimp dumplings, the chicken dumplings, bbq pork buns and the steamed spare rib with black beans.  All were very satisfying.  I wish all dim sum was this way.  THe other food looked amazing but we only had 2 people so we couldn't handle anymore!"}
{"text":"This place is great just not my type.  I am so not the person people should ask dim sum advice from. Although I am from China, but the cooking style between north and south can be very different.   My first dim sum experience was when I was almost 12, or 13 yrs old during my 1st visit to Guangzhou and Hong Kong. I even refused to eat egg tarts cause I thought the custard was actually lemon . ( 8 yrs later I made the same mistake the other way around when I first came to Canada, bought lemon tarts and think they are egg tarts).  Anyways, although I always told the best dim sum place should be you order on the menu and the kitchen prepared right away accordingly, I still miss those places have those displayed on the tray or cars you can choose from.  Also, I prefer food being cooked in a transitional way and using common ingredients, which are not very expensive.Knowing this, you might understand why Lai Wah Heen only a 3 star for me.  The dim sum is very good,  The presentation is even more impressive.  But I just don't appreciate the lobster meat in pan fried dumplings or the won ton with chili oil but wrapped with wanyu. To me I can be perfectly satisfied with a port cabbage dumplings and nth wrap my won ton will be great appreciated. And believe it or not even emu meat and foie gras are on the dim sum menu.   However, have to say  that it is great that Berkshire pork is used in dim sum, totally bring up the flavor.  Chef in charge of Dim Sum used to work in Luk Yu, one of the most famous dim sum place in Hong Kong and also my favorite. So that this place is definitely worth trying.   Very warm serve and nice dining environment."}
{"text":"First, the good news.  This restaurant has excellent dim sum fare topped off with attentive service.  The bad news?  It cost me $60 for a table of two for dim sum!    Bottom line is that this place offers really well made dim sum, but because of the price, this is really a special occasion type of joint.  But on to the food, which was fantastic (along with presentation)  The restaurant strays from the traditional type of dim sum plates and offers a variety of fusionesque fare.  Australian lamb and foi gras can be found on the menu.  Their barbeque pork in puff pastry is amazing!  I would highly recommend that along with the sticky rice wrapped in lotus leaf.  The latter is more along what the plate should traditionally taste like, but it's really well done.  The texture of the rice is just perfect and the lotus flavor is heavily infused into the rice.    For dessert, I had the egg tarts along with buns filled with preserved duck egg sesame.  These were fine, not spectacular, so in that sense I was a bit disappointed (especially given the price)."}
{"text":"Pros: Pekking duck was amazing (had a coupon for half price), clean restaurant, friendly and fast service.  Cons: Rest of dim sum menu was rather ordinary for the slightly above price point.  Verdict: Would recommend."}
{"text":"Service took away from what could have been a fine dining experience. Both of us felt the waitress to be surly and in attentive. The two managers were highly in a peripheral manner. We each ordered a main dish and combined. It was more food than we expected. We found the presentation very good. The food taste was excellent. Price was a tad high, but I think I'm just having problems keeping up with the times. The dining room is well appointed with table cloths and fine accoutrements. The restaurant is on the second floor of the Double Tree hotel."}
{"text":"Haven't eaten here in a few years, but when I had an early dinner of dungeness crab fried rice, sui mai and hot and sour soup, I liked it. I'm not an expert on Chinese food, so I stuck to the easy dishes that I've had everywhere and came away impressed. I will be back soon. That's my 2014 Year of the Horse resolution."}
{"text":"This was easily one of the best if not the best Chinese meal I've had in a number of years. Great food and excellent service in a nice environment. Got the 3 course Lobster dinner. Excellent choice"}
{"text":"Great dim sum but pricey  It's one of my favorite dim sum places in Toronto for Chinese brunch. Too bad it's so far.  Shrimp dumpling and any classics are always good"}
{"text":"Came here for the Peking duck for dinner and it did not disappoint. I'd for sure give the duck 5 stars, plus they were offering a discount on it if we ordered an additional $50. The second course of duck wrapped in lettuce was good, too. The service was very good, no complaints there.  Unfortunately, the other dishes we ordered were mediocre. The dim sum platter is about 8 small pieces, did not seem fresh, and was not tasty. It cost $12 also. They are supposed to be known for dim sum--maybe their lunch service is better. The steamed tofu with assorted mushrooms sounded good but was also not very flavorful. The sea cucumber filled with shrimp mousse was not memorable and tasted a bit fishy.   The deep fried crab claw was solid. Overall, the prices really do not justify the quality of food but the duck was stellar."}
{"text":"I'm surprised to read all these contrasting, love-or-hate reviews about Lai Wah Heen as I was fairly impressed with my experience here. And this is from someone who comes from a Cantonese background, grew up with dim sum flowing through my veins, and, as such, is very picky and demanding about it.  Yes, the setting in an otherwise aging hotel building (if the public areas are any indication) might not be the most inviting at first, but when you step inside, the first thing you notice is the clean, well-maintained venue that actually looks like a formal dining room - unlike the average unkempt dim sum house. Next, most of the staff appears to be native Cantonese speakers, which is always reassuring in terms of authenticity (although they do speak Mandarin, as many customers insisted). Perhaps, as someone who could speak Cantonese myself, I got friendlier and more engaging service than others would.  Although I got quite the sticker shock when I first reviewed the menu, I was also pleasantly surprised by how well-presented each item was. The lobster and shrimp dumpling, for example, came in the shape of a lobster, and had good chunks of seafood inside. The deep-fried prawn and scallop wrapped in bacon? Exactly as delicious as the description suggests. A steamed beancurd roll of mushrooms and truffle simply rose above typical dim sum fare. Meanwhile, the crispy fried pastry of foie gras and minced pork was also inviting in terms of its presentation - indeed, French-inspired - and also satisfying going down. Dim sum staples like the shrimp dumplings (har gow) and beef rice rolls (cheong fun) were also on point.  Furthermore, while it's all not going to be the best-tasting, best-value dim sum ever, nothing tasted bland or bad either. Just... decent. In another reassuring sign, I experienced none of the suffocating thirstiness afterwards that you'd get from lower-quality dim sum houses that douse their offerings with MSG or salt. Again, another check mark in terms of quality.  Given the effort they put into the presentation and the quality of the ingredients, I was quite satisfied with my visit here, even if it was quite expensive. Is this going to be a cheap, everyday dim sum experience? Absolutely not. But is this going to be a special treat that rises above the usual loud, busy, run-of-the-mill-quality dim sum hall? Absolutely yes."}
{"text":"This was the WORST dining experience I've had in my life. So unprofessional.  DURING THE MEAL // Table of 5  The service was painfully slow and disorganized. This wouldn't have been a big deal if someone had said something (e.g. \"So sorry, understaffed, thanks for your patience\"). Instead, we were left alone to starve and speculate.   Since we had a vegetarian at the table, we asked that the two vegetarian dishes come out early. The waitress said yes but seemed irritated. In the end, one of the veg dishes came out last and the other one never came at all.   The Peking Duck (the dish I was most excited about) came with cold, wet pancakes. The skin wasn't crispy, either.    We asked why the food was taking so long (in a friendly, patient tone). They said the orders were mixed up and offered us free dessert as an apology. Most of us declined but my mom got 1 order of sesame balls.   PAYMENT I was not thrilled at footing a $350 bill for the slowest and most mediocre meal I've ever had, but was looking forward to finally leaving the restaurant. Silver lining!   I had a $26 Open Table gift certificate that I planned on using up (Lai Wah Heen is an OpenTable restaurant) -- but they declined it. I asked to speak to the manager, who said Open Table certificates had been bouncing recently.   I said, \"As an Open Table restaurant, you need to sort this out with them.\" If certificates are bouncing, that's definitely something a restaurant should be following up on, no?   He went from useless to just plain rude and said, \"No, that's YOUR problem.\" While pointing at my face. Are you kidding me? You should NEVER talk to a customer that way. He should have just said, \"I'm sorry that we're unable to accept that certificate tonight. We'll be talking with OpenTable to make sure this doesn't keep happening in the future.\"   I then told him that the service overall had been incredibly disappointing. He stared at me blankly for a few seconds and then said, \"...I'm sorry? We gave you dessert.\"   Customer service 101: Listen to your customers, make them feel heard. Don't point in their faces.    TL;DR Unbelievably rude manager, no communication from the waitress, cold/wet pancakes with the Peking Duck. I will never come back here."}
{"text":"Regardless if you're Chinese food purist or a new age Asian fusion maven, you'll probably find something here that you'll like.   Keep in mind you are dining in the double tree, so you will be paying for everything from the food to the service.   I made a reservation for Christmas Eve dinner and it was quite busy. The star dishes here are really the Peking duck or lobster if you're having a big dinner party. The lobster can be cooked in two different styles, so I would opt for one fried and one steamed so you get some variety. The pork belly here is incredibly tender and the best I've had so far. I would stay away from the dim sum platter, as it leaves much to the imagination. However, their specialty dim sum seem to be a hit, so that may be something I'll have to come back and try.   If you are parking in the hotel underground lot, the restaurant will cover part of the cost!"}
{"text":"I really struggled to find an upscale Chinese restaurant in Toronto.  Most of my review searches returned places that appeared dirty, or geared more for take away.  The #4 Yelp reviewed restaurant even had a picture on a blog of a person apparently sleeping in the doorway  (http://www.blogto.com/restaurants/leegarden)  I found Lai Wah Heen, and the pictures made it look like one of the nicer offerings for Chinese in TO, but still it looked like it was stuck in a 30-year-old hotel.  The restaurant was easy to find on the second floor of the Metropolitan Hotel after navigating the hotel's tight parking garage.  I waited a little bit for a host to come and seat me, but I found the restaurant and dining room to be elegantly appointed and clean.  All of the server staff wore uniform jackets.  Really wanted to try the dim sum, and I was hoping their dinner menu would offer some of the dumplings as appetizers, sadly they did not, that's for a future visit.  Ordered the sesame chicken, by far the best Chinese chicken dish I've received I'm Canada.  It was so sweet and tasty and cooked to perfection.  Unfortunately I had to let it cool as it burned my tongue at first.  Big boo.  Service was otherwise excellent, plenty of drink refills, the waiter offered to validate my parking, and they were quick with the bill.  Can't wait to return."}
{"text":"I took the greatest grandma in the world here for dimsum last week. She really enjoyed it. Of course- she usually enjoys every place I take her to, because she's encouraging like that. That's why she's the greatest grandma in the world.    I'm not as benign so here's what I think: + Great for quiet and serious dimsum conversations. LWH is way quieter than other dimsum places. Probably because there's not as many Asians shouting at each other + Unique dishes i.e. Scallop/caviar dumping ($5), lobster/shrimp/escalope dumpling ($5), foie gras/pork pastry ($5) + It's not a Value Pick for dimsum. Note the Singular DumpLING, no S, above. You can imagine how the price adds up when each person wants their own dumpling + Price/Quality ratio was okay imo. You can definitely find better P/Q ratios uptown i.e. Casa Imperial, Casa Victoria, Crown Prince"}
{"text":"I try to scoop up a group of friends at every convention I attend and go out for dim sum at least once. I know where I want to head when I'm in Maryland or Philadelphia or even Vancouver, but since I was going to be in Toronto--well, Richmond Hill--I put out the call. Who makes the best dim sum in town? The answer I received from both friends and strangers was Lai Wah Heen.  Some friends wanted to know why I was bothering to drive 30-40 minutes into the heart of Toronto when there were plenty of dim sum parlors right by our con hotel. Well, all that advice, for one, but also because of what one reviewer had to say here on Yelp: \"If your idea of dim sum is $2 steamers and old ladies yelling from carts, then go back to Richmond Hill.\" That slam on the entire neighborhood in which I was staying made me laugh.  Not that there's anything wrong with dim sum at the basic level of comfort food. I do that all the time. But dim sum prepared by an internationally recognized chef, and incorporating such ingredients as lamb, emu, and foie gras? That's not something you get a chance to eat every day. (Or, come to think of it, at all. At least, I've never seen any of that offered before.)  And so four of my friends piled into the car last Friday, and we bombed into town, dealing with Toronto's marvelous midday, midweek traffic. But what we found when we got where we were going was worth it.  Everything on the menu was enticing, so we just kept checking off boxes on the order sheet until we feared we'd be unable to ingest all the promised wonders. I wasn't disappointed in a single choice, but here are the ones that most amazed me.  My first dim sum was the \"Jumbo Siu Mai wrapped with glutinous rice & foie gras.\" My eyes popped wide as I bit down. Very rich, very decadent. Not at all a flavor I ever expected to find in shiu mai, and I immediately knew the drive had been worth it.  Then came the \"Wonton of lamb loin flavored with cumin seeds & garlic.\" I love lamb, but once again, it wasn't anything I ever had or expected to have as part of a dim sum meal. There was a strong but not at all gamey flavor to the lamb, with just the right amount of cumin, not overpowering the taste of the lamb.  This was followed by (at least for me; we often ordered different items that arrived as singles and were unshared) \"Steamed dumpling of Australian Wagyu beef topped with thinly sliced Wagyu beef, in chili oil.\" While I enjoyed it, this was the one dish that didn't seem as well-conceived, because when I lifted it to my lips and bit through, the beef on top distracted from the delicacy of the dumpling on which it sat. But I'm willing to own that, as I'm thinking now that perhaps I should have eaten the slivers of wagyu topping separately first before diving into the dumpling. But don't worry--the flavors were still wonderful.  After that, the \"Deep-fried soft dumplings of Berkshire pork\" arrived, and while these were not as unusual as my previous bites--plus I've had pork dumplings prepared equally as well elsewhere--they were certainly the cutest dim sum I've ever eaten, with almond ears and doughy pig noses.  Which resulted in the obligatory photo of one attempting to escape my maw. (Hint: It didn't make it.)  One of my other favorites was the \"Deep-fried crispy taro paste dumpling filled with seasoned minced emu.\" It was my first experience with emu, which reminded me of suckling pig in terms of the texture of the meat. The spices certainly complimented the emu, though someday I'd like to try a few bites of the animal sans spice, so I can get a true understanding of what emu meat really tastes like.  Lai Wah Heen's presentation was often whimsical. But be assured that the restaurant wasn't relying on that alone, and that the cooking lived up to the excellent presentation.  To accompany our dim sum, we ordered some steamed bok choy, plus one of Lai Wah Heen's special fried rice dishes--\"Foie gras and diced shredded duckling fried rice flavored with deep-fried garlic.\" I had no idea what to expect from the latter, but the combination worked, though the strong garlic flavor made me glad I was among friends.  As for the non-food part of the experience--the restaurant was elegant, the service was excellent, and our parking beneath the Metropolitan Hotel which housed the restaurant was validated, so we didn't have to pay exorbitant Toronto rates to park the car.  What I liked best about Lai Wah Heen is this. I've been eating dim sum for years, and it's been a long time since I've been surprised. I always know what I'm going to get, and the only issue is whether what comes to my table meets, exceeds, or falls short of my expectations. But every dish at Lai Wah Heen was a revelation, sometimes to the eyes, but always to the taste buds. And that's not something I've experienced since I was a dim sum newbie."}
{"text":"If you're expecting traditional dim sum, go somewhere else. This places serves luxurious modern interpretations of Cantonese style dim sum. Expect truffles and caviar. Service is excellent. The food is also, albeit minor oddities like dinosaur sized dumplings. Overall an amazing lunch adventure."}
{"text":"My wife and I had their lunch prix fixe. The dim sum platter came with shrimp spring roll, scallop siu mai,  bean curd veggie roll, BBQ pork pastry. All were very good especially the BBQ pork pastry. Main dish was the duck meat fried rice, which was okay. Nothing really special.   Their egg tart was very good, probably one of the best I've had in any dim sum place.  We'll be back again to try their other signature dishes."}
{"text":"Disappointed. Food was excellent but the service made me feel as if I was at a quick service/takeout. We ordered a 3 course meal from their daily specials. The Dim Dum sample plate was amazing. A few minutes later soup arrived. I had won ton Soup and my wife sweet and sour soup. She was half way thru her soup when the main course arrived. Dropped on the table without any comment. Total time from the arrival of the Dim Sum to our main course was less than 20 minutes. We paid the bill, added a 15% gratuity and left. Back at the room (with more light), I checked the bill.  Our main was a Duck stir fry for $32 each. We were charged $38 for 2 beef Szechuan. So we gave them an extra $12 plus tax and top for a 40 minute dining experience. Total bill with 2 cocktails and 4 wine was $153. We extended the meal with wine but overall a forgettable experience. Would not return."}
{"text":"We have a tradition of rarely eating in hotel restaurants.  This goes doubly so for Chinese restaurants; particularly when you are so close to Toronto's vibrant China Town, but it was highly rated and when we looked in we were pleasantly surprised to see quite a number of Chinese families seemingly enjoying the food.  Having tried this restaurant, I can well understand why.  The food is great! The service is attentive and polished! The atmo is delightfully elegant.  So I am very glad we ate here and overcame our doubts about the place.  Now about our food: Moo Shu Pork, Spring Rolls, Hot and Sour Soup, Duck Mushroom Conpoy, Kung Pao Chicken, and Pork Chop w/vinegar.  Not all that unique in our menu selections, but the quality of the food was excellent as was the attention to presentation details.  It was a truly inspired dining event.  Therefore, this is a highly recommended choice of ours!"}
{"text":"Let me start off by saying this is my first dim sum.  We ordered a random selection of food off the sheet and waited for the food to arrive.  First of all we ordered waaayy to much.  Some was very good including the pork buns and the spring rolls.  I was not a fan of the noodles which were stuffed.  Overall it was good however I do not know if I would go back just because I don't think I really enjoy dim sum. However I would encourage everyone to try it at least once and to maybe get a noodle entry as well."}
{"text":"We went late. Staff were tired and not polite. Food was okay but very overpriced. Not much atmosphere !"}
{"text":"Went here for dim sum on a saturday afternoon.  Its in the Metropolitan hotel and takes a little effort to find.  Service was pretty good, considering most Asian restaurants are not know for their service.  They had a wide variety and had lots of twists on traditional dim sum dishes.  Very creative presentations for some of the dishes.  It was on the pricey side though for dim sum.  Nice place to treat yourself or take family."}
{"text":"Excellent service in a very nice setting. But the actual dim sum is a bit weak in its delivery. Presentation is excellent, the Berkshire pork dumplings come shaped like a little pig, but they just don't follow through with taste. A nice place to try but I can't say I'd rush back."}
{"text":"Dim sum is great but  you are much better off going elsewhere. The food is well prepared but you can get similar if not better dim sum for about half the price at the North end of Toronto. The service is pretentious and not welcoming if you're not a well dressed tourist it seems. Overall, if you're comfortable paying twice as much for adequate dim sum, go ahead."}
{"text":"I love a serene restaurant, and this one was just that. The music, the atmosphere, the service, everything made me feel relaxed and refreshed for diving back into busy Toronto.  The food is of course really amazing, too. I loved the novelty shaped dim sum, although I felt I had to apologise to them before I ate them, because they were just too cute!"}
{"text":"Amazing dim sum Very good service which is surprising for a Chinese restaurant  Great atmosphere  Very pricy Loved the lobster and crab dumplings, very unique!"}
{"text":"Fancy dim sum place because it was inside a Hotel. So clean, delicious dim sum and great staffs."}
{"text":"First don't think carts and lots of commotion ,,, this was more like ordering sushi then having Dim Sum. The hotel is kind of shabby but once you take the elevator to the second floor the setting is very nice and comfortable. Don't expect much guidance on your order other than a couple of pieces of paper, pen, a menu with descriptors, a \"like us on Facebook\" promo piece and the server telling you \"we have prix fix\".  We did not order the prix fix - stuff was weird combos like fois gras and did not feel like a Sunday Dim Sum meal. The crystal shrimp dumplings were divine and the spring rolls were delicious. The lobster dumpling was a work of art - tasty too. My friend enjoyed the steamed pork buns and the shrimp and sunflower seed dumplings. Clean and comfortable, as well as quiet. Good place for catching up with family and friends."}
{"text":"Expect to pay a pretty penny but they serve the best Cantonese Chinese food in the city."}
{"text":"Really expensive, upscale dim sum.  I was treated by my friend to a fabulous meal here and I quite enjoyed it, but truth be told, I think I prefer the more frantic, frenzied dim sum places in North Scarborough / Markham that are bustling with activity and feel a little more authentic.  The food here seems fancied up for no apparent reason other than to justify its price point, and it's good, but not the place to go if you want good wholesome Dim Sum."}
{"text":"Best dim sum I've had in North America."}
{"text":"Overpriced - I've had better dim sum in Markham for way cheaper.  Came here with some co-workers for lunch. We ordered the peking duck and assorted dim sums. For the Peking duck, we opted to get a second dish (It was called the Crystal Fold - lettuce wrap with the rest of the Peking duck and veggies for $12 (duck itself was a whopping $68!). We each got 4 small pieces of duck meat with skin which were wrapped in thin pieces of crepes. Nothing special to be honest. The part that i didn't understand was why 16 pieces of meat slices costed $68 so I was expecting the second dish (Crystal Fold) would be larger in quantity (as they use the duck for this dish).  The Crystal Fold was served and we each a single lettuce wrap with very minced duck meat in it. They showed us the roasted duck before cutting it and judging from the size of it, I really think they could've carved out more meat out of the duck, so the remains of the duck remains a mystery. Also, the common practice of serving a Peking duck is to do all the carving and cutting at the table. For whatever reason they took the duck away after showing us and I saw one of the waitresses carving it several tables away with her back towards us.  The presentation of the dim sum was good - the steamed dumpling that was shaped like a lobster was cute. Taste-wise, I didn't find the dishes to be exceptional. All the dim sum were priced much higher t than what a dim sum place would usually charge (a high-ended one too). I would not come back to Lai Wah Heen."}
{"text":"My cousin and I were here for summerlicious dim sum lunch on the weekend.  At $20 per head, I can reasonably say we were still hungry at the end of it all.  Starters - soup options, I ordered the shrimp wonton soup, and my cousin had the hot and sour soup.  They tasted ok, but nothing to write home about.  the Mains:  we ordered the medley of crystal dumplings (4 in total, one of each type), and the medley of crispy things (also 4 pcs).  These were super mini portions of what you would normally get a regular dim sum restaurant.  After the dim sum, they brought a small bowl of rice ~ also ok, but nothing to write home about.  We finished with Mango pudding.  yum.  Overall I would say, that we could tell that the dumplings were made with extra care, but the marginal tastiness, did not warrant the price.  Not to mention that we were starving afterwards....  It was nice to visit, as a novelty, of having \"high end\" chinese food.  But in future I'd pass.  PS this was accented by the fact that I had regular dim sum with my parents the following day, and our total bill came to $23 for all three of us, and we left stuffed."}
{"text":"Excellent quality, good service, nice decor, on the plus side. Limited variety of dim sum and plain chopsticks on the minus side. Ive had the dim sum twice and the Peking duck once. The Peking duck was as good as any I ever had in Beijing or other Chinese cities. (I ate the whole thing myself - it stretched my belly very nicely. I would normally recommend sharing it between two or three people.)"}
{"text":"Lai Wah Heen offers excellent service and good food. The prices are higher compared to restaurants in Chinatown nearby, but you are paying for better service and food.   The service is always great here. Servers are attentive and friendly. The atmosphere is casual. Overall, I enjoy most of the items I've had here. You will not leave disappointed if you have a dinner here. The service and food are both great.   However, I am only giving it a 3 stars because I think the prices are high for what you get. Yes, the food is better than some of the cheaper restaurants in Chinatown. However, it isn't anything exceptional to me for the price they charge. It is priced higher because it is in a great location perhaps. For the prices here, I am expecting more unique items."}
{"text":"Went in expecting a good-to-high quality dining experience and was not disappointed. With very little dim sum experience, the atmosphere was easy and comfortable. Portions were not overwhelming, interesting options, and fairly reasonably priced: two people ate comfortably but not exuberantly for $50.   The bacon-wrapped scallop with prawn was  fantastic - good balance and the right hits of bacony goodness without being overwhelming. The other dishes were tasty, not greasy, and well proportioned. The custard lava dessert is worth mentioning as being sweet and soft without being too rich.   Service staff were helpful and attentive.   Would definitely go back."}
{"text":"My aunt recommended Lai Wah Heen Chinese Restaurant to us. There was options to order set menu (set price per person) as well order al carte options. It wasn't your typical dim sum restaurant as it didn't have push carts.  We ordered hot tea and shared eight dim sum dishes including Roast Pork Pastries, Steamed Shrimp Dumplings, Sticky Rice with Meats and Vegetables, Minced Beef and Mandarin Peel in Rice Roll, Chicken and Truffle Dumplings, Steamed Pork, Shrimp, and Scallop Siu Mai, Minced Beef Siu Mai, and Deep Fried Dumplings Filled with Berkshire Pork. My favorite was the Roast Pork Pastries but all of them were yummy and I'd order them again."}
{"text":"Went here to try out what some call the best dim sum in Toronto.  Honestly, I found it nothing but hype.  Yes, the dim sum is good, but overall, it's not the mind blowing experience I was hoping for. The descriptions of the items make them sound much more luxurious than they actually are. They took a long time to refill our tea and for some reason, it took almost 20 min before they brought our desert out.  My wife said the women's washroom was quite disgusting, not something you'd expect for an establishment of this caliber. If you want an experience that's truly memorable and worth the expense, I'd say go to Crown Princess instead."}
{"text":"Not the worst place to eat but I expected way more after reading all the yelp reviews. I think the disappointment coupled with the overpriced food made the dim sum experience unappetizing.   From all the dimsum I have tasted, I think the staples should always be served no matter how \"high-class\" the restaurants are. I think my girlfriend and I ordered about 5 plates of food which wouldnt cost more then $15 at most in an average dim sum restaurants but here we paid $75!!! Anyone who consumes dimsum on a normal basis knows at that price you can feed at least 10 people. On top of which, the dimsum was if anything just average, all the unique items were too americanized and \"hip-sterized\".  I think if you want to have dimsum, you need to go to Chinatown. I think this is not a place for dimsum maybe dinner or lunch but not dimsum."}
{"text":"Waited at the front for 10 minutes with no host or hostess before we were seated. We were really excited about this dim sum restaurant but it was pretty disappointing. We had the beef noodle and it was chewy/ flavorless. The BBQ pork in the pork bun tasted stale. An expensive experience that didn't live up to the hype. Staff was also rude and didn't check on us and made us feel very unwelcome."}
{"text":"Best Chinese cuisine in Toronto!!! Love their dim sum to dinner. If you like Chinese tea, please try their lychee wuloong it's very special and has lychee taste in it."}
{"text":"This is a very pricey place, but it's really worth a try!!  Service is good, not the best I've seen, but definitely good!!  The food is good and they've put thoughts into how it's presented.  The sirloin roll steam roll, lobster dumpling, and double baked milk are definitely special.  Since it's quite expensive, I tried to order dishes that are unique to this place.  I'm glad my bf is up to it as well.  We did order the traditional shrimp dumpling too, coz we just couldn't resist not to order our favorite.  All the food are great!!!  They validate parking at a discount price.  We didn't know, but we did get parking somewhere else that's cheap, so it's ok."}
{"text":"I rate this place a 3.5 stars  I came here for dim sum. Reservations were made on open table, which was super easy.   TIP: Parking is $5, first come first serve in the underground parking of the hotel, Double Tree. However, it is only for 2 hours and it is added to your bill at the end. So for those of you that think you can park for $5 all day (like myself), don't do it! There is $8 parking at city hall, which is an 5-10 minute walk to Double Tree.   The restaurant is on the second floor. it is not to be mistaken for the restaurant on the main floor.  I have to say, the service was the highlight of my experience. The staff was attentive. Helped us cut the dim sum so people can share without us asking. Food also came quickly.  They have a list of different teas so have a look at the menu so you aren't on auto-pilot when you order, unless you like familiar comforts.   We ordered a total of 14 mains and 3 dessert dishes for 5 people.  Steamed dumpling of fresh lobster escalopes & shrimp in garlic butter - B - This is the most popular dish on the menu because the dumpling is shaped like a lobster. Aesthetically, it looks nice and unique, but the pastry was too thick. There was a good amount of shredded lobster, but it was mixed with veggies. Overall, this was not my fave as I was expecting. Grade: B  *Crispy fried pastry of foie gras & minced pork - this was my fave dish. The Tart was crispy and flaky. There was a long piece of foie gras and the flavors paired nicely together. Grade: A+  Steamed soft bean curd sheet wrapped with assorted mushrooms & truffle in soy sauce dressing -  I didn't have this, but my aunt liked it. It was pretty small, but nicely plated.   Crystal shrimp dumpling - same as any other dim sum place, but pretty pricey.  B  Steamed minced beef Siu Mai - I didn't like this. The flavors were not like regular siu mai. It was very salty. It also looked very dry. C  Steamed barbequed pork bun - it was melt in  your mouth, but nothing special. Not worth the price to be the same as other dim sum places.  Baked mini turnover filled with pineapple & barbequed pork - this was really good. Flaky and good flavor. B+  Beef mousse & mandarin peel in rice roll served with sweet soy sauce - couldn't taste the mandarin peel. Underwhelming - B  Shredded chicken & abalone in congee - chicken was soft and a hint of abalone. B  Veggie noodles - my aunt had this. It was underwhelming for the price.   Steamed soft bun filled with custard lava - the custard flowed out. The filing isn't too sweet. B  Deep-fried sesame ball stuffed with pickled ginger & lotus seed paste - I could really taste the ginger. It was was nicely fried. B  *Deep-fried pastry stuffed with milk custard & papaya - my fave dessert - flaky and a nice milk custard taste and consistency. A+   I was full at the end, but some of my guests weren't too full and didn't want to order anymore. The bill came up to $180 with parking for two cars.   It is a very expensive dim sum place, but nice for a special occasion. I did enjoy the uniqueness of the tart and milk custard, but the other dishes aren't outstanding to other dim sum places that are cheaper in price, but just as nice. I think if there were more unique dishes, it would make this place worth the price value.  At the same time, as a whole, I did enjoy the service, atmosphere, and food.   I wouldn't necessarily come back again, but if there was a special occasion, I would pick this over Pearl near the habour front for food."}
{"text":"We order a bowl rice, lychee mango dessert, and crystal jelly scented with goji. None of them is impressive, jelly doesn't feel fresh, you can even smell weird sense of their napkins. They also charge for tea. And we also pre ordered the rice, but still waited for half an hour. Service is kind of slow, Not gonna come again."}
{"text":"Lai Wan Heen has some unique taste on some Chinese dim sum dishes, which is nice and innovating but some of the dishes aren't the best. Let me clarify some of the traditional dishes are fine with quality and taste but the price really drives it south for me.   Dim sum is meant to be a family style and affordable meal that most people can choose to eat. I think my friend and I ordered around 7-8 plates of food and it was around 40 CAD per person if memory comes to serve. It's been a few months since I visited there but it's not on my favorite spots to visit. They had some foie gras and truffle in their dishes but it didn't do much for me . I couldn't eat the foie gras cause of allergies and the truffle didn't taste any different or special from a regular dish.  The service was good and attentive. As a whole, I don't think the price and my friend's recommendation was living up to the hype.  Overall: 3 (Rounded) Food: 3 Service: 3 Price: 2 Atmosphere: 3"}
{"text":"The other day, as I was buying groceries, the cashier asked me why I was buying the premium olive oil (he insisted it tasted the same as the PC olive oil).  I couldn't convince him that there was a genuinely different taste during our 30 second exchange, so went on my merry business.  That's what Lai Wah Heen is about.  For those that don't \"get it\", they'll never get it, but for those that do,they'll really appreciate this place.  To start off - I've been coming here since they opened (about 17/18 years?): between dim sum, weddings, birthdays, and other celebratory banquets, we must have enough of those black box takeaway containers to fill 100 trucks, so I've seen it at its best and its worse.  This is not the place to go if you want sweet and sour pork, fried rice, and some tea - it's high end Cantonese cooking mixed with some Imperial influence, and a Hong Kong flair.  Let's start off with the dim sum.  If your idea of dim sum is $2 steamers and old ladies yelling from carts, then go back to Richmond Hill.  Dim sum here is done the Hong Kong way - classy, dignified, and ever so tasty. The \"usual\" dim sum dishes are done amazingly well: their shrimp dumpling / \"har gow\" has a delicate yet tasty casing, and perfectly cooked shrimp.  The rice rolls are similarly delicate.  Oppositely, they'll change it up every once and a while and bring out something crazy, like truffled Chinese BBQ chicken (amazing too!).  My only qualm is that sometimes they go a little too crazy and introduce 10-20 items, which push the \"standard\" fare to next season... but I guess the chef needs to challenge himself someway.  Banquet dinners are always done to perfection at Lai Wah Heen.  Whether for a small group of 4, or a big group of 20, they never skimp on the details.  Pre-ordering special dishes: whether it's shark fin, winter melon soup, some crazy exotic fish, or 'Buddha-jumping-over-the-wall' soup (something is definitely lost in translation there) - they can always meet the challenge.  If you're not sure what to order, their banquet prix fixe menus are always a solid bet.  Each dish looks immaculate, and is served by experienced / highly trained / perfectly bilingual/tri-lingual  waiters/waitresses, most of whom have been there for more than 10 years.  Ingredients are not skimped on, and if you really break down their food prep, you'll understand the careful work that needs to go into it: their broth alone probably takes 12 hours to create, and alot of their braised cuisine stews for days.  Chinese food is pretty diverse and complex, and largely mimics the culture it's taken from.  It can be serious business, and LWH is one of those places that takes it seriously."}
{"text":"Overpriced dim sum. Worst part was that the quality wasn't even great. Crown Princess is way better in my opinion. The bill ended up being $30 per person and we were still hungry after."}
{"text":"Came here for dim sum and ordered the $45 a head set menu. Yes, it's $45 a person, I know. Get over it. It's a creative menu with extra touches you don't get in any standard Chinese dim sum selection. Wagyu beef, chunks of lobster, truffles, etc.    Shredded Peking Duck and enoki mushrooms in a thick soup flavored with finely shredded conpoy.  Steamed lobster dumpling stuffed with shrimp mousse & finely diced vegetable flavored with garlic.  Steamed scallop, shredded dried conpoy & white fungus in dumpling.   Steamed dumplings of Waygu beef accompanied with thinly sliced Waygu beef, in chili oil.  Deep-fried roll of mixed vegetable & assorted mushrooms.  Deep-fried taro root paste dumpling filled with shredded chicken.  Truffle & lobster escalopes on crispy egg noodles flavored with truffle scented oil.  Chinese dessert - this was a dan tat and a steamed red bean stuffed rice skin ball type of item.  Obviously you don't go to a fancy dancy Chinese restaurant and order the same-old same-old as all dim sum places when you can have something besides that. There is a tea menu as well but you can order more standard teas as well for less. I ordered Tiguanyin (not part of the tea menu), it was alright but definitely not a tiguanyin I would buy by itself. We enjoyed every item on our tasting menu and actually left quite full. They speak Chinese and English perfectly fine, and it's easy to converse in both together. Easily the best Chinese food we had in Toronto, this being our first time there and unable to get out to the burbs where I hear there is more dim sum to be had. And a MUCH better way to spend $100 than stupid Bier Markt, so there!"}
{"text":"Food ranges from 2-4 stars, service 2 stars, prices seemed ok.  Somewhat vegan friendly.  I normally wouldn't visit a place that didn't use the word vegan on the menu or have several yelp reviews mentioning it, but The Sweetie came here once before without me and had a really good waiter that built her a delicious vegan meal.  Unfortunately, on this visit, we ended up with a waiter who didn't understand \"vegan\".  We ended up ordering some dishes that are vegan by default (in theory anyway) and some where they substituted/removed the meat/fish/eggs.  I think the result was vegan, but I can't say for sure.  I have an adventurous palate when it comes to smells, flavors and spices -- but not when it comes to texture -- I dislike anything rubbery.  Unfortunately, over 1/2 the dishes were in this category, so I wasn't a fan.  Those that were NOT rubbery in texture were pretty good -- delicately flavored and well prepared.  For me, the food overall was just 3 stars.  Someone who doesn't have texture aversions would probably give them a 4.  In addition to the difficulty ordering the vegan meal, the service was a bit slow and it took a long time for the table to be offered dessert and to receive the check."}
{"text":"Supposed to be upscale. Well, we did not notice that. Water tasted bad, and the dishes were average. For the price we paid I expected something better than that."}
{"text":"Dinner - The price was expected if you are coming to a restaurant like this. The three of us ordered a seafood set plus some extra side dishes, barely finished half. Most recommended cuisine is of course the Peking duck and the crab soup. Peking duck was individually served by the waitress, with scallion/sauce/cucumber slices placed with the duck on the pita for you, therefore you get the perfect portion of everything. A huge miss was the stir fried eel. When I ordered the waitress told me the dish is made with fresh eel rather than frozen one. However it was NOT made with fresh eel when I tasted it, because this species is not native to North American water body. Unless you smuggled them somehow, you wouldn't be able to get live ones here. That's either a lie to sell, or a crime - either is not pretty.   Would recommend to come for special occasions - just stick to their usual set menu, don't order outside because apparently the chef is not experienced enough to prepare any nontraditional dishes outside of the set menu.  Dim Sum - Also I've been here another time for Dim Sum - which is pretty good - and VERY CHEAP. So good for brunch too."}
{"text":"This was pretty horrid Concomitant with hotel downgrade to Double Tree . Greasy rewarmed second rate. Totally to be avoided. Help Mother!!!"}
{"text":"The best part of this meal was the fact that I didn't have to pay. And the fact that I was living across the street at the time. My friend's father was visiting from Hong Kong and took a group of us out for a fancy pants dinner at this restaurant. I had peeked into the dining room during a fire evacuation (the hotel kindly took us in for a few hours...February in Toronto is NOT FUN) but never thought I'd have a chance to dine there.   That said, we enjoyed several dim sum appetizers, and delighted in Peking Duck prepared in 3 ways. The most memorable was in the classic Chinese pancakes. The waitstaff prepared everything for us, cutting the duck before our eyes and arranging the juicy meat and crispy skin in the rice crepes with some scallion and cucumber for good measure. The cucumber was a wonderful match for the duck.   If my memory serves me correctly, the second preparation of the duck was sauteed with vegetables and glass noodles, which was then wrapped in lettuce leaves as you would with bulgogi. It was yummy, but kind of like a duck spring roll and I was definitely over spring rolls at that point (While I was living in Toronto the closest restaurant that everyone could agree upon was a Thai chain called \"Spring Rolls\").   I had a very lovely dining experience here...I am guessing that the previous reviewers did not order the Peking duck and did not enjoy a free meal. I find that I enjoy an meal less when it seems to be overpriced. So...get someone to pay for you!"}
{"text":"Lai wah heen is not what it used to be! It's trying to be an upscale joint and charges upscale prices but the ingredients, tastes, and service don't measure up at all."}
{"text":"I have been wowed by their Dim Sum many years ago and realIy enjoyed the food while attending a wedding banquet  5-6yrs ago.  Had dinner there last weekend and was in shock at how poor the quality of the food was, the service was as you would expect from a regular Chinese restaurant and the washrooms were what you would expect from a typical Chinese restaurant.  The restaurant was also very noisy and I did not feel I was in an upscale restaurant.  It has lost it's wow factor from all spectrums and is way way overpriced."}
{"text":"Best dim sum I ever had in Canada. Almost tried every item on the dim sum menu. All taste great. Don't like the look of the lobster shaped dimpling."}
{"text":"Lai Wah heen has very good dim sum. It is imaginative and very fresh! High quality ingredients. It is very good but definitely not great by New ork, Hong Kong or Vancouver standards. Room needs a major facelift and hotel is very depressing."}
{"text":"I just went to Lai Wah Heen yesterday. I gotta say that if you are only looking for  atmosphere and decent quality food, then this restaurant is for you. If you are looking for highest qualities and  highest quantities, then avoid this place . This is one of the high end restaurant. So don't be cheap and bring only $ 5 to $10 and expect you will get the best of it. The price is ridiculous high on the menu and  almost all the food cost 2 to 3 times more than other restaurants. A mapo tofu dish cost 18.99!!! Where most restaurants cost less than $10. I  can't really say that it's the worst place because i knew it was going to be expensive.  I was going to give 3 stars because of free wifi. And I didn't expect to get free wifi but they were nice about it. But i gave 2 stars because i end up paying $2.50 for the  tea which i  didn't even drink it."}
{"text":"Been here a few times, dim sum was really good and that was main purpose of most visits.   Last time I came, I was in the mood for peking duck and was pleasantly surprised with the service I received. The duck was crispy, and over all delicious. The 2nd course was also fantastic, we had the common lettuce wrap etc etc. What blew my mind was the service with the Peking Duck. The server actually was making two wraps per person and serving it to us rather than me doing it myself.   Not sure if that was a standard service or because it was a little after lunch and slower. That being said, why 4 and not 5? Because the dim sum was a little off that day, especially the cute little lobster roll. Not much, but not as bang on as it was with previous visits."}
{"text":"I've eaten a lot of Chinese food in my lifetime and Lai Wah Heen definitely stood out. I wasn't so concerned with price as I was eating here with my boss so we kinda just ordered whatever. The best thing however was the duck we ordered which they cut up and served to us almost like duck tacos. Amazing.  Everything we had here was exceptionally delicious. Great place for a long dinner as each course was brought out separately. Their wine menu is also very extensive."}
{"text":"Excellent restaurant and unusual subtle flavors.  It looks like they changed the dinner menu, but there used to be a really good dish - Oolong flavored duck with greens.  Definitely try it, if it returns."}
{"text":"I came here for dinner so I thought I'd review since most of them seem to do with their dim sum.  The place was EMPTY when we arrived except for another table of four. The waiter was therefore really attentive, service was fast, and food arrived quickly.  Aaaaaaaas for the food, there were definitely some interesting touches. Some of the dishes were similar to what you'd get in other places (the shimp bao hot pot) while others I hadn't had before (there was this zucchini one that was lightly garlicked and it was kind of spectacular). They definitely pay attention to detail so this place is not somewhere you should go if you haven't eaten for weeks and just want a big meal. I agree with Kat T--the menu is kind of difficult. As Kat T did, we left it up to the master chief in charge, my mom! HAHA.  And there seems to be a language problem (as with pretty much every chinese restaurant, but I was surprised one that was this \"classy\" also had it)--the waiters probably all speak Cantonese, but the Mandarin and English is spotty and it depends on which one you get. The waiter that served us dessert was different from the one who had taken our normal orders, and he pretty much only spoke Cantonese functionally."}
{"text":"Great dim sum. One of only five in downtown worth going to and the cleanest of them all.  It's pricey."}
{"text":"Excellent service by Sabrina.  Great well presented prix fix dishes. Very fresh ingredients.  Great attention to detail."}
{"text":"Oh man this place is pricey. I came here for a quick afternoon Dimsum snack. I came in with the expectation of ordering around 4 different items (4pcs each). But each item costs $5.50-9.00 and most of them were per piece. So we decided to order items we felt were more unique and tasty and skip out on the siu mai etc.   We ordered lobster & shrimp dumpling, deep fried shrimp & scallop wonton wrapped in bacon, and their special spicy braised noodle with minced pork.   Lobster & shrimp dumpling was delicious. You can taste the lobster though subtle. It came in a super cute lobster design that I just didn't want to consume it. The piece was large and packed. They didn't skimp out on filling.   The shrimp & scallop wonton was savoury. Although I couldn't taste the scallop at all, it reminded me of those giant crab claw balls at other dimsum places. It had that same flavour plus the crispy bacon.   The only item that wasn't a hit was the noodles with minced pork. It tasted exactly like canned bean sauce was slathered over the noodles. We lost our appetite after this. We regret not ordering some other dimsum item instead of this. I cannot justify paying $9 for t. Still regretting it as I type this!   I'm giving this 4/5 stars because the quality of the two dimsum dishes we ordered were able to offset the crappy noodles. Yes this place is expensive but the happiness I got from the cute lobster and my partner's reaction from the shrimp and scallop wonton made the trip worth it. I'd come here for a snack not a meal if you don't want to blow the bank but still want to experience a more upscale dimsum."}
{"text":"I admit, we weren't necessarily in the mood for Chinese, but given the option to stay in our hotel instead of venturing out into the tsunami-like weather conditions, we went for this place... I would have been much happier if we'd decided to order pizza. The service was very spotty and the food was over-priced and unsatisfying. I shan't return."}
{"text":"It's as good as it gets for Chinese food in downtown Toronto, definitely in the top 5 of GTA as well. Yum."}
{"text":"Oh my goodness. Overrated and expensive dimsum place ever.  I've tried dimsum multiple times in NYC, and this has got to be the most expensive-est and not so great tasting dimsum.  My bf and I ordered about 10 small dimsum dishes, total was $85. We came here thinking that the dimsum would be yummy bc it's so highly rated. I ended up stuffing my face even if I didn't like it because it was too expensive to not eat :/ Although, I have to say it is fancy and more catered to the American palate. If you enjoy dimsum like they give in NY, try going to Chinatown of Toronto. 2 stars for the fancy dimsum experience and the aesthetics."}
{"text":"The dim sum of my DREAMS! The snow crab and lobster dumping came-- SUPRISE (!)-- shaped as a trembling pink rice crab, down to the chewy pink claws!! Every steaming portion was perfect-- the yellow crystal packets were savory and...well..I just keep using the word perfect. Worth every penny (more like fiver) per dish.   I was tempted to knock a star for pretentious service. I mean, it's wobbling rice in little bamboo baskets-- skip the 'tude!   On the other hand, this place wasn't as cacaphonous as some more authentic dim sum places, and my clothes didn't smell like dried shrimp afterwards. And the place is clearly family owned-- I could tell by the sky-high cheekbones and dashing way all the men sashayed the aisles in their suits."}
{"text":"I have been dining at Lai Wah Heen since 2007.  I have consistently recommended friends and family to try the Peking duck.  I have always enjoyed the service, atmosphere and especially the food.  In fact, my cousin held her wedding reception at Lai Wah Heen in 2009.  However, in January 2013 when Lai Wah Heen shut down and reopened in March 2013 to layoff the unionized jobs, this to me was an unethical practice, so I stop going there for 2 years.    This year I dined at Lai Wah Heen 3 times; my first 2 initial visits were not very outstanding.  The food was still great, however, I noticed 2 things, first, the lack of enthusiasm with their servers; most don't smile and look absolutely miserable and, second, the lack of dining customers even on a Friday night.  My third visit was last week involved my colleagues -, a party of 6.  For some this was their first visit to Lai Wah Heen and, I convinced them to try the Peking Duck since it the restaurant was currently having a great promotion.  I called the previous week to make the reservation and also mentioned that we would like to order 2 Peking ducks and take advantage of the promotion.  At dinner when before we ordered, I reiterated again the promotion and this was acknowledged by our server.  I won't go into too much detail regarding the food or the atmosphere as I had no issue with both.  What I will focus on this review is the terrible service and dishonest practice at Lai Wah Heen.  Our first issue was with the service, when I ordered a glass of beer, I noticed that there was large black residues at the bottom.   When I advised the servicer, she had a confused look and did not know what to do.  I had to flag down another server to explain that I wanted a new drink.  Our dining was pleasant enough for the rest of the night.  Once the bill arrived, we promptly paid and left, however, what we did not notice until the next day that we were fully charged for the Peking ducks.  We were overcharged over $60.00.   While the cost is not an issue, I am not a fan of dishonest practice at Lai Wah Heen.  For a restaurant that prides itself as offering fine Chinese cuisine, what we experienced what a lack of customer service.  Please train your servers on how to provide great service; they should learn to smile, act friendly, and most important of all, be honest!  Downtown Toronto now has many excellent fine Chinese restaurants like Crown Princess and Pearl Harbourfront.  This is my first review on Yelp and also my last visit to Lai Wah Heen."}
{"text":"So lots of times, I don't find dim sum that appealing. But Lai Wah Heen may have changed my mind. The dim sum is very nicely done, the service was amazing, and all in all, I had a great experience.  There are many items on the menu that are more innovative, but the classics are also offered here.  The barbecue pork puff pastry is divine! The flavors are perfect, with a nice gingery, sweet, savory note and the pork is tender, which often is not the case. The sticky rice wrapper in lotus leaf also had the perfect texture, and the earthy aroma and taste of the lotus was just right.   I did try some of the other more non-traditional dim sum, but I like the classics. The dim sum here is expensive though, especially since dim sum can be found at much lower costs, so it's not a place to go to all the time."}
{"text":"Very good atmosphere and classy restaurant, foods was authentic and delicious, the dim sum  was  something special different than the regular dim sum places"}
{"text":"Came here for lunch during the week because I love dim sum and have been wanting to try this place (mostly because it looks cute). We got here half an hour before closing and it was a weekday so keep in mind my experience may differ from a weekend visit. I was really excited to try the lobster and crab dumplings but was quite disappointed because it was expensive ($8 for one piece) and not fresh at all. Actually I can't say that anything we ordered was fresh. The service was really good, staff were very attentive. I would possibly try coming back on a weekend when it's a little busier to see if the quality of the food is any different. Ps the cuteness of the food is 4 stars! Very photogenic!"}
{"text":"Ok yes it's over priced for dim sum.  Yes some of the food is just well presented regular dim sum.  And yes it seems hard to get into without a reservation.  The whole staff is very professional and friendly, but yes the place is a little too high brow.  Not exactly what I'm used to when I just want to dig in and stuff my face with yummy dim sum, but I can see what they are trying to do and appreciate it.  The presentation is beautiful with quality ingredients and preparation.  The food is very detail oriented and is an interesting take on classics.  I would definitely go again, but when my wallet is a bit heftier!  If you want to go, make a reservation!"}
{"text":"I was slightly disappointed because it has such a great reputation! It was good but not great! A few of the other Toronto area Chinese  restaurants were better. Zagat rated it high. I expected better. I had also read it was the best Dimsum in North America. Also Fodor's said something similar. In my opinion it was mostly show. I might be willing to give it another try if going again because I am having a hard time believing it is the same place I have read rave reviews about. It wasn't bad, the room was clean and service was formal. But it seems it was more about  show than good tasting food."}
{"text":"I love everything about this place!!!  would definitely come back for more : )  such a nice restaurant with great good and great staff the only downside is the price"}
{"text":"Situated in a hotel on the second floor, Lai Wah Heen isn't exactly a restaurant locals would stroll into for a meal. I visited Lai Wah Heen a few days ago for their Spring Equinox event where they collaborated with Sake Kurabu & That's Life Toronto for a set menu with Sake Pairing. Since this is a review for Lai Wah Heen, I will limit my review to the food, as sake is not what they usually offer.  Our meal started off with a cute lobster and shrimp dumpling that was shaped and colored to look like a lobster. The filling tasted good, not amazing - so the appearance was definitely better. This item is usually on offer during their dim sum hours for $5.50 a piece.  A pan-seared scallop with white truffle cream was next - the scallop was perfectly seared (not overdone) and the white truffle cream was a heavenly pairing.  Scambled egg white with dungeness crab meat and silver fungus mushroom - the taste of the crab came through and the dish is on the light side. The egg whites didn't do too much other than adding some needed saltiness  Deep fried lamb rack, with truffles and assorted mushrooms - the truffle didn't really come through, but I like the assorted mushrooms. Deep fried lamb rack tasted ok, but I would have liked it better seared instead.  Pan-seared wagyu beef with raw sea salt and zucchini - I think the wagyu would have benefitted if it was grilled instead (with bamboo charcoal), but it was delicious and tender nonetheless  Briased pork belly - this is my favourite item of the night. The pork belly was very tender and braised well and flavoured well. YUM.  Crispy foie gras and minched chicken wonton, with clear truffle consumme - this was my second favourite dish. I thought the wonton was presented nicely, and the truffle broth was delicious  Black sesame rice ball with ginger syrup - I thought Lai Wah Heen could have given a few more rice balls considering this is probably the cheapest thing on the menu, but alas, one lone rice ball in a bowl lol.  Overall, I think the food at Lai Wah Heen tasted great, although there are elements of their cuisine that are not Chinese (i.e: truffles, wagyu beef). I believe the Spring Equinox menu was good value considering I got to taste a lot of premium sakes that are normally not found elsewhere.  There is very little question that in terms of Chinese food, Lai Wah Heen is probably the best in downtown Toronto. Given the price tag they normally charge however, I probably would not visit Lai Wah Heen on a normal night unless it is for a special occasion for someone who likes to dine in an upscale chinese restaurant."}
{"text":"Cuteness overload!   They make the cutest dim sum here like the Berkshire pork Wellington which looks like a piglet and the lobster shrimp dumplings, as the name implies, looks like a lobster.   It's so cute that I don't even want to eat it buuuut at the price I'm paying, they are going in my tummy.  Everything was delicious! They did not sacrifice in vain.   Lai Wah Heen targets patrons that's willing to pay a premium for the convenience of being able to make reservations and actually get seated on time.  The decor is a lot more upscale, it's very clean and inviting.   I particularly enjoyed their high level of customer service which is very refreshing from the typical chines restos."}
{"text":"I was surprised to see so many good reviews on yelp. However based on my personal experience, I was very disappointed. The food is very mediocre in terms of quality. Especially the hot and sour soup, which makes Mandarin's look miles better. The dim sum platter was barely heated, and the skin rubbery. The only saving grace is the braised pork belly, which was tender and delicious. Overall, the price is that of a fine dining restaurant, yet the quality is supremely subpar. Wouldn't recommend as there are much better Chinese restaurants in the city."}
{"text":"First and foremost, this is the only restaurant in all of Toronto that serves Taiwanese food I can actually stomach.   Befitting it's name in Chinese, Lai Wah Heen (LWH) is indeed a \"luxurious meeting place\". Upon sitting down at the table I immediately feel at ease. I can definitely draw parallels between the decor and the food: it's elegant, simple but rich in aesthetics and design. The black granite is complemented with a display of beautiful Chinese calligraphy and paintings with white backdrops. I spent quite a long time admiring the artisanship of the paintings (gave me a few ideas of how to furnish my condo).   I firmly believe that the litmus test for quality for any Chinese restaurant is its Green Tea. Few restaurants in Toronto have been able to hit the bar for quality green tea, with LWH being one of them. Having grown up in a culture where Green Tea is not just for consumption, but a form of art expression, my bar for quality tea is quite high. The green tea is infused in the right temperature, and steeped for the optimal amount of time. The bitterness of the tea is carefully tempered, making sure it wasn't oxidized too much during the drying process.   LWH serves over 8 types of tea. I would highly recommend the Monkey Picked Oolong Tea Lychee Scented Red Tea, Jasmin Scented Silver Needles and of course, the Dragon Well Longjin Green Tea.  LWH's new chef Sam Tse does not disappoint at all.  It never ceases to amaze me how Dim Sum chefs are able to transform what used to be commonplace fast food into a sophisticated cuisine that is worthy to contest that of the Japanese.   I thoroughly enjoyed the food.  This is the one restaurant in Toronto where I will highly recommend the Peking Duck. It is divided in two courses, with the first being a whole duckling fried and served with finely shredded scallion and cucumber on steamed rice crepes. For the second course we chose the Crystal Fold, which is consisted of wok-fried minced duckling, assorted vegetables and fried noodles wrapped in fresh lettuce leaves. Impeccable.  In addition to Peking Duck, I would also recommend the Taiwanese Triple Cup Chicken. This is a staple of Taiwanese food and gives you a quick introduction to the cuisine if you aren't familiar with it. It is served in a hot clay pot flavoured with soy race, rice wine and vinegar.   I also highly recommend the Moo Shu, Foie gras & diced duckling fried rice, Stamed soft bun filled with custard lava, Wok-fried diced Atlantic codfish & minced truffle with egg white.  For dessert I would recommend  the Supreme grade Imperial Swallow's Nest and Chilled Sweet Soup with tapioca, lychee & mango.   I have nothing to say about the service but that it was irreproachable.   The bill came to around $100 per person, but I was definitely a bit liberal with our orders. Just got a little too excited that's all. I know there are prix fixes for around $60 for lunch, but have yet to try them. Someone please write a review for them.   This is definitely a restaurant you want to try if you want to be conversant with the Toronto food scene."}
{"text":"If you can afford it, then it is a great dim sum restaurant! You're not paying for bad quality food, it is delicious despite the price! On par with the dim sum restaurants you would get in Hong Kong! Lots of variety in their selection too!"}
{"text":"The food was surprisingly delicious. Most Chinese dim sum tastes the same but here you can taste the creativity of the dim sum chefs. The atmosphere is very nice and the servers are very professional. There is valet parking. Park at P4 or P5 go straight up to the restaurant and let the host know your license plate number."}
{"text":"This is the first Chinese restaurant I tried at Toronto. Someone else paid the bill so I have no idea if the food worth the money we spent. I would assume it's a expensive place based on its location and the decor.  My love for dim sum is persistent and started since my childhood. It's hard to define which dim sum shop is good because everyone's favorite dish might be different.  For this particular restaurant, I would give a 8/10 for its food because everything tastes fresh and quite authentic. But nothing really stands out.  Everything else was spotless. Service, atmosphere, location. I will recommend to those who live nearby and want a decent dim sum experience. Of course there are many dim sum shops nearby and I haven't got a chance to visit those.  Will I come back? Probably not, for the reason there are so many dim sum restaurants in Toronto."}
{"text":"See Blog for full review, highlights below:  Greeted promptly by a friendly young Chinese woman we were asked if we had reservations and when we responded to the negative we were told this was \"not a problem at all\" and swept away to a table in the main dining room - a beautiful two top near the stairs and adjacent to the large bay windows with an excellent view of the street and the room.  Browsing the immediate dining area as we were presented with our menus, water, and a pot of green tea I was impressed by the mixed population - older, younger, Chinese, Canadian, businessmen and families were all represented in large numbers and the room had a \"buzz\" without being loud.  Kicking things off, from Chef Chan's \"Innovative\" menu, a steamed dumpling of smoked sturgeon, shrimp and minced butter squash and a steamed crystal purse filled with five spicy shredded duckling & heart of garlic.  If the measure of a chef's skill in dim sum is gauged by the creativity, flavor, and thinness of his noodles then I've no doubt we were in the presence of a master - the translucent noodles alone were works of art with my friend's lobster featuring the crustacean's characteristic shape and the sturgeon presented as a small fish while the purse did appear to be a tied-off bag.  More impressive than the appearance, however, were the textures and flavors of the dumplings with the mildness of the sturgeon perfectly complimented by the sweetness of the squash and the spicy anise/clove/ginger bite of the five spice duck proving an adequate foil to the pungent and sweet heart of garlic.  While certainly not \"cheap,\" the quality of the ingredients was apparent and I'd gladly re-order each dish again.  The next round of dishes were again served in threes, yet somewhat more interesting than the pork dishes.  The first dish, Deep-fried taro root paste dumpling filled with sweet plum & minced duckling was an absolutely astonishing dish that my companion summed up as \"light, but really dense.\"  Featuring a crispy and airy taro root shell absolutely stuffed with an amalgam of chopped plums and minced duck I have to say that this may have been my favorite flavor pairing of the afternoon and it honestly could've served as a dessert or a savory - an absolute must order.  The second option, Filet of bass & thousand years egg in rice roll served with sweet soy sauce.  Having never tasted the unique egg-preserving technique prior to this I have to say I didn't know what to expect, but what I received was superb.  Mildly salty and somewhat sour the egg proved a balance to the smooth and meaty bass while the sweetened soy brought out the flavors of both the egg and the fish without masking any of their more subtle notes.  More or less stuffed at this point we opted for only one small dessert - traditional Chinese Egg Custards.  Served as four small 1/2oz tarts the custards were barely set with the buttery pasty and only a thin skin of custard preventing the creamy vanilla egg compote from being a liquid - absolutely delicious and flawlessly executed - a great end to a wonderful meal.  Making our way to the exit after paying the somewhat impressive bill (I mean, Dim Sum isn't supposed to be \"haute cuisine\" normally) we took a look at some of the party menus and both agreed that Lai Wah Heen would be an awesome place to return with a larger group in order to sample some of the noodle and rice dishes (normally intended for parties of 4-6 according to the menu) as well as the myriad soups and entrees.  Thoroughly satiated and happy we made our way out the doors where our hostess bid us farewell.  While I can't say I'm a dim sum expert by any stretch, I can say I've been to some great restaurants and would rank Lai Wah Heen's presentations, flavors, and service favorably amongst many of them."}
{"text":"A nice upscale place for dim sum, with original combinations of ingredients. One would like to taste all the different sorts.  That being said, I was not as impressed as I was expecting to be... not all dim sum or siu mai were very fine or subtle in their flavors.  Would probably to go back one day, to try different dim sum, but not tomorrow... or perhaps for a fancy Pekin duck serving"}
{"text":"Best Dim Sum in Toronto. Food and service are excellent. Pieces are properly proportioned. Better than the sum of its parts."}
{"text":"Lai Wah Heen is a fine-dine dim sum restaurant on the 2nd floor of the Metropolitan Hotel  It translates to \"elegant and splendid loft\". LWH serves dim sum for $4-8 per order, so for the average person, it is a one-time visit just for the luxurious experience. When I sat down, I was presented with table napkin, a stand for my spoon and chopsticks, and a fancy teapot and teacup.  I ordered the following: 1. Crispy fried pastry with foie gras and minced pork ($4/pc) 2. Pork shrimp and scallop siu mai ($6.50/4pc) 3. Steamed barbecue bun ($5.50/3pc) 4. Baked mini egg tart ($5/3pc) Jasmine tea ($2.50/person)  Some of the dim sum at Lai Wah Heen is not the traditional version, but fits under the noveau/innovative category.  [1] Crispy pastry with foie gras and minced pork was the most impressive dish that I ordered. The foie gras had a rich and creamy texture, and was uniquely paired with the salty flavors of minced pork with sprinkles of tangy ginger on the surface. This dish is a must-try, especially for those living in California since foie gras has been banned for sale there.  [2] Pork shrimp and scallop siu mai was my second favorite item. Each order arrived with 4 pieces of delicately crafted siu mais. Each piece is wrapped carefully and layered with jumbo shrimp, minced pork, and scallop, in that order from bottom up, and topped with salmon roe. Siu mai is a traditional dim sum dish, but adding scallops to it made this Lai Wah Heen version unique. This impressive savory dish is worth ordering.  [3] The steamed barbecue buns were bite-size. There was no culinary sophistication found in the buns, but they were very soft on my hands and melted in my mouth. The barbecue pork inside was sweet. Save your money and do not order this traditional dim sum dish.  [4] Baked egg tarts appeared to be the flaky kind, but the crust stood well. I was able to hold the crust without crumbling the egg custard. The filling was creamy with rich egg flavor, although not too sweet. Although the egg tarts were delicious, I would pass on this next time and save my stomach for another non-traditional dim sum dish.  The bill was $30 including tips and the expensive 13% Canadian HST. I did not leave with a full stomach, but instead, with a satisfied mind that I experienced Toronto's standards of creative dim sum. The dim sum in Toronto is more creative and far superior to those found in Los Angeles (although the former is much more expensive). A message to my LA friends: I can confirm that the best dim sum outside of China can be found in Vancouver and Toronto, not the San Gabriel Valley in LA."}
{"text":"OK!  Peking Duck - I enjoy how they come over with the cooked ducked, go \"see\" and make eye contact with you until you say \"YES. (Duck.)\" And then they put it all into sweet little pancakes for you. Wine selection is *totally fine* (we had an Ontario Chardonney that ran about $40...Cool. Great.)  They brought it in a silver ice bucket on a stand, and in doing so threw me into a reverie regarding the legacy of Chinese food restaurants - supposing good ones like this are the last bastions of an early 20th century service style marked by finesse, traditional rules of comportment, proud precision, silver chalices, etc.  I say: Yes.   Soon after, a lady was so drunk she ran into someone's chair, and then uproariously bashed in a half-height glass wall she mistook for the exit.   She also fell down the 3-step transition between floors.  I had a great time.   I highly recommend the soup, especially the double-boiled ones, which are infused with smokiness and deep flavour. *Amazing*."}
{"text":"This was our second visit here. This is definitely some pricy but delicious dim sum. The service is great and no plastic tablecloths. This is some upscale fancy ish. We ordered a few different dishes. The bbq steamed bun was yummy and actually had generous amounts of pork. The mini fried shrimp rolls were yummy and the sticky rice was also delicious. Lunch for two with 2 glasses of wine and 1 beer was 80 be for tax and tip so definitely on the pricier side but like I said for a special occasion or to impress it fits the bill. Saw some delicious looking Chinese food coming out whoch id like to return to try. The hot sauce they serve is more oily than hot. Could be hotter."}
{"text":"Lai Wah Heen's regarded by many as the best dim sum in Toronto proper, as well as some of the best Cantonese food in the country.  I've been here several times over the past year, mostly for dim sum but a couple times for dinner as well, and despite middling Yelp reviews and a frightening hiatus that brought significant menu changes earlier in 2013, I've never been disappointed.  On the lunch side, their dim sum has always been excellent.  Classics like har gow and shiu mai are familiar, but executed with a level of excellence that elevates the dishes above the Toronto norm.  But it's the innovative dim sum that really shines: crystalline dumplings filled with diced Peking duck; tiny pies of foie gras; ostrich and crab dumplings shapes like tiny ostriches and tiny crabs, even more remarkable for their presentation than their considerable taste.  I can't recall all the amazing things I've eaten here, and the dim sum menu rotates every now and then anyways, but everything on the menu that may look a bit pricey?  Well worth it.  Guests from out of town and numerous friends have all agreed.  Regarding dinner, hits have been many and misses are few.  Their Peking duck's a surprisingly good value, with table-side service dutifully doling out rice flour pancakes two by two to a friend and I as we assembled little rolls of succulent, crispy skin.  The second course is a perfunctory showing of lettuce wraps and minced duck flesh, not remarkable, but still satisfying and a pleasure to eat.  Speaking of, one can't help be amused at the beginning of the Peking duck serving process, in which the whole duck is brought to the table before carving so that the silent server can intimate a clear message of, \"Look!  Duck!  Ehh?  EHHHHH?\"  Sure.  Show me my food and let me admire it.  I'm fine with that.    It's the little things that make up life.  Mains in the past have been more expensive, and I've heard Lai Wah Heen taken to task for the prices of its entrees from early 2013 on back, but they never failed to blow me away.  They seem to have adjusted their menu to account for that though, as my favorite dishes - largely involving incredible treatments of lobster and crab - are now gone, or at least no longer on the website.  Medallions of lobster perfectly sauteed in white wine sauce, and a spicy whole Dungeness crab dish complete with delicate brains, are now both gone from the menu in favor of a new range of offerings at half the price or less.  Regardless, I'm eager to try a lot of the new items, and Lai Wah Heen classics such as Bird's Nest Soup and the Triple Cup Chicken are still available.  I don't know if you've noticed, but there's some god-awful dim sum in this city.  Really, just some serious Mickey Mouse sh*t.  Lai Wah Heen's one of the few bastions of not just quality, but innovation, and it's a helluva mid-day repast.  The service can range from almost overly-attentive to, \"dammit where the hell is that guy,\" and the prices are kind of all over the place, but the ambiance is lovely and almost everything I've eaten has all been outstanding. If you're looking for envelope-pushing dim sum or high-end Cantonese, this place is better than many reviews would have you believe."}
{"text":"Hands down my favorite Chinese restaurant in the entire world. My family and I have been coming here every week since I was a young child and the quality of everything has always been consistent. The atmosphere is classy and not obnoxious, the food is so delicious and fresh and the restaurant is much, much cleaner than most Chinese restaurants in Toronto. Their service is also really great. Their dim sum is amazing (I recommended their shu mai and lo bak go) and for dinner their Peking duck and fried chicken is so good. Highly recommend and everyone should come here."}
{"text":"Lai Wah Heen is worth the visit once in awhile or a nice place to let my out of town guest to treat me to a nice dim sum lunch (thanks so much!).   Service here is definitely top notch. Their dim sum is quite unique compares what other dim sum restaurants in Toronto or even GTA would offers. These all comes with a price.  We ended up ordering:  Steamed dumpling of fresh Dungeness crabmeat ($4/pc) - the cutest thing I ever ate, maybe not taste as good as it looks but great for photos!  Crispy fried pastry of foie gras & minced pork ($4/pc) - I expect a little more, the taste and the texture of the foie gras was lost... not really memorable  Deep-fried lobster dumpling served with a clear consommé ($5/pc) - chunks of lobster meat with great bouncy bite!  Steamed dumpling of minced chicken & truffle ($6.50/3pc) - A little over cooked and dry  Steamed chicken & fish maw flavored with rice wine ($6.50) - meh... I can barely taste or smell the fragrance of the wine  Baked mini puff pastry filled with cured ham, shrimp & pork ($6.50/3 pc) - delicious! love the pastry shell, I ended up eating 2 of those!   Tapioca, lychee & mango in chilled sweet soup ($5) - presentation is pleasing! And has tons of fresh lychee inside, so refreshing!  Make sure you ask for hot sauce, which is really a chili oil but loaded with dried scallops!   I love the options of ordering some of the dim sum selection by each piece as some time as a person that dine alone, it give me more option to try out other things!   I think I will be back again! Especially if I want to have some decent dim sum in the area, as there are not too many to choose from that worth going."}
{"text":"I came here twice recently - once for dinner, and once for lunch. This is like expensive, elevated Chinese dining, but the food is good quality. There is definitely some stuff (especially with regards to the dim sum) that is just bougie and kind of necessary, but cool to try anyway.  Food highlights:  Soup - we ordered soup to start our dinner with, and it was just a simple, traditional kind with these like long, green, stringy vegetables. I've had this soup at many different places, but I found the flavour particularly good here... the vegetables had less of a bitter flavour and more of a softer/slightly-sweet flavour. Also the soup was very smooth and had almost a velvety texture.  Dessert - chilled pear glazed with light osmanthus syrup. This was a lovely and unique way to end off our meal! The pear was very refreshing, and the syrup was a little bit sweet, but not overly so. When you cut open the pear, there are some chunks of aloe inside, which was a pleasant surprise. It's pretty pricey ($6 for one pear), but I guess it doesn't seem so bad if you share it between a few people.  The mains we ordered that night were pretty traditional Chinese fare. Nothing stood out to me in particular, but everything was tasty and unlike some other cheaper Chinese food places, you can tell they don't put MSG in their food as it's not as salty.  For dim sum, my dad and I ordered the following which was plenty of food for two people, but at around $60+ definitely the priciest dim sum I've ever had.  Steamed dumpling of fresh lobster, scallops & shrimp in garlic butter ($5) - this is probably the single most gimmicky thing on the menu. Yeah, it tastes pretty good, but the main hype is that the dumpling is shaped like a lobster, so like... you gotta do it for the 'gram. I found that none of the three main ingredients particularly stood out, so I guess they just blended together into some indistinguishable (albeit tasty) seafood-y lump.  Crispy fried pastry of foie gras and minced pork ($5) - again, $5 for one tart, which I thought was good to try (I love foie gras) but ultimately a one-in-a-lifetime experience for me. It was a good tart, the pastry had just the right amount of flakiness, the texture of the filling was smooth and creamy and the meat was tasty although the sauce was a bit overpowering.  Open-purse dumpling of minced scallop, shrimp & bok choy, topped with caviar ($5) - this was my favourite bougie dumpling because the scallop flavour really shone through. Honestly though, the rest of the ingredients are simple and basic, so you are mostly just paying for the caviar (which you can't really taste anyway.)  Har gow (shrimp dumplings) ($7.50/4) - these are some damn expensive har gow, BUT they are also the best shrimp dumplings I've had in my life. Quality on these is next level, with the dumpling skin that is not too sticky and the huge ball of shrimp inside that is bursting with juice and flavours. If anything, come just for these.  Siu mai ($7.50/4) - again, Lai Wah Heen's take on a traditional dim sum dish was just another level above. What makes their siu mai unique (and justifies the price) is the fact that they put a scallop on the top of each chunk of pork. The scallop flavour actually blends wonderfully with the pork and shrimp and adds a lovely extra dimension of flavour.  Tapioca, lychee & mango dessert ($5.50) - this comes served chill to you in a glass with a straw, so more like a drink than a soup. I really did not think this was worth $5.50 given the size and the fact that it's just like a typical dessert/drink.  Steamed soft bun filled with custard lava ($8.00/3) - this is typically one of my favourite dim sum dishes/dessert, and we ordered this as an add-on mostly because I was still a little peckish after all of the other food. It wasn't significantly different from the buns you get at other dim sum places (except 4x the price.)  I enjoyed both of my experiences, but thought the dim sum experience was definitely more fun, unique and memorable. Many of the things I got were just cool to try, but I would not feel the need to order them again unless I just really felt like treating myself. However, I would highly recommend trying some of the more traditional dim sum items (specifically har gow and siu mai) because Lai Wah Heen's take on them really impressed me."}
{"text":"Although I didn't like the dinner much here since I thought it was overpriced and mediocre, the dim sum here is awesome. It's pricey for sure but it's really good. The shiu mai was some of the best I've had. They even put a scallop on top. The bbq pork bun and har gow was good as they should be. I also thought the rice rolls were quite good. We tried the shrimp, beef and the veggie one too. All were great. Lastly, I liked the sesame balls, lotus leaf style sticky rice and the congee which was a bit unique combining pork and oyster. The only dish I didn't like much was the other sticky rice dish we got which had a funky taste to it.  Other than that, the service wasn't bad and the inside is very elegant. Parking is underground and $5. They tack it onto your bill so make sure not to pay at the machines at the elevators. Overall, this place deserves a solid 4/5 for the dim sum even if the dinner here isn't great."}
{"text":"Don't waste your time.  The food doesn't make sense and taste less then satisfactory.  We ordered the set dim sum menu for 2.  It seems they are trying to be innovative and modern by incorporating truffles to their dim sum.  One dish in particular made me mad.  Bean curd wrapped around tofu skin and celery like a little sushi bite.  Then topped with a piece of truffle.  I ate this thinking rubbish topped with a piece of truffle.  I understand that truffle, like bacon, can make a lot of things wonderful. I still think it takes a chefs effort to make the dish harmonious.     Mediocre food made to look decent with a piece of truffle thrown on top."}
{"text":"Located on the second floor of the Double Tree Hilton, I knew from the moment we walked in we were in for a treat. My friend and I were visiting Downtown Toronto to attend a science conference and we...dressed like scientists. I was a bit embarrassed but the staff didn't miss a beat and greeted us like we were VIPs and immediately offered to take my Starbucks coffee and poured it in a tall elegant glass for me to enjoy. This level of service stayed throughout our meal, with our plates always clean and our cups always filled with hot tea.   I'm definitely not used to paying too much for dim sum and so I had a bout of sticker shock when perusing the menu (I also forgot to mentally convert CAD to USD so that certainly didn't help). I was also a bit skeptical that fancy fusion dim sum would be any better than their traditional counterparts, but Lai Wah Heen proved me wrong.  The two things you should absolutely order are the sticky rice in lotus leaf and the Berkshire pork fried dumplings. The sticky rice was and is thus far the best I have ever had. Perfect filling to rice ratio with not a single grain over or under cooked and bursting with bits of marvelous pork, sweet Chinese sausage, and a perfectly salted egg yolk. The fried dumplings came in the form a cute little mice with garlic chip ears. They were beautifully light and crispy on the outside without sacrificing any of its glutinous mochi skin chew. The filling tasted different than what I'm used to but the Berkshire pork came in superb bite-sized chunks.  Granted, not everything was a home run (I don't recommend the siu mai or the rice noodle rolls) but judging from the other pictures Yelpers have posted, there is plenty to try on the menu that I have a feeling will be good as the sticky rice and deep fried dumplings I loved. All and all, I would recommend this place as a must-try for anyone visiting DT Toronto."}
{"text":"I was pretty excited to go to Lai Wah Heen, one of the ultra-high-class Cantonese restaurant in Toronto. I'd heard my friend rave about their $48 lunch dim sum prix fixe menu, but I wasn't really willing to shell out that much for dim sum.   Stepping into the dining room, I felt transported to the 90s. Everything was very old school, perhaps due for a renovation. Though it was probably very nice when the restaurant opened, the décor felt a little dated to me, . For a restaurant of this calibre, the overall ambiance paled compared to the lavish extravagance of other Chinese restaurants, such as Casa Imperial and Casa Victoria.   Lai Wah Heen's gourmet chili oil had chunks of dried conpoy and shrimps, which made very good snacks. But the chili oil itself wasn't very spicy at all and didn't make a very good dip.   Now onto the actual food:  Siu mai of pork, shrimp and scallop ($6.50). I'm usually not the greatest fan of siu mai, but this version was quite delicious. The bold, meaty flavours made up for the small sizes of these dumplings.  Crystal shrimp dumpling ($6.50), or har gow, was quite ordinary. The sizes were on the smaller side, and it wasn't particularly outstanding. Overall, it was well executed, but for this price, I expected some sort of wow factor.   Baked puffy turnover filled with minced barbequed pork & pineapple ($6.50)- My favourite dish of the entire meal. The soft, buttery pastry was filled with sweet, delectable barbequed pork fillings. The pineapple added an extra sweet dimension and a perfect tinge of acidity. Altogether, the turnover was divinely rich (in a good way). This wasn't one of the restaurant's intricately presented dishes, but it impressed me based on flavours alone.  Certain items on the menu were served by the piece. We ordered one to try- crispy deep-fried roll of pitaya, mango and shrimp ($3.50). I liked it, but it sounded better on paper. The fried roll was filled with salad dressing, and I wished there were more fruits to counterbalance the greasy richness.   Seared beef sirloin in rice roll served with sweet soy sauce ($8.00). This was a pairing of a dim sum classic with gourmet ingredients- in this case, beef sirloin. I didn't actually enjoy the combination all that much because the beef sirloin wasn't prepared in a Chinese way. However, I have to say that the rice noodle roll itself was lovely and velvety smooth. I ended up eating the two components separately.  Deep-fried bumble bee dumpling of sweet green tea paste ($6.50) were adorably irresistible! On a side note, the bumble bee dumplings tasted as good as they looked!  Tapioca rice ball in a lightly ginger flavored syrup ($6.50). I didn't love this because it was filled with red bean paste, and I prefer black sesame filling. But the unique part about the rice balls was that the skin was covered with tapioca pearls. My bf loved that part, and I happily gave him my share as well.  Looking back at the bill, I noticed that they over-charged us by $1.50, as we had actually order 5 items that were $6.50 and only 1 item that was $8.00. But I'm willing to look past this small fault as we were offered complimentary tea for absolutely no reason at all. Nevertheless, the meal was still very pricey for dim sum. Would I come back again? Not anytime soon, but I'm tempted to come back just to try some of their more exquisitely presented dim sum. For ordinary dim sum, there are infinite cheaper alternatives uptown. However, some of the dishes here are definitely worthy of a visual feast, and I would very much like to have the pineapple and barbequed pork turnover again."}
{"text":"This place has a very upscale feel to it... but in an uninspiring corporate kinda way. It's nice enough but it lacks any real ambience.  (The upscale feel though translates into some very upscale prices.)  We went mainly for the Peking Duck. We were told it's the best in the city. Well, for $60 it better be! Lol. If you've never had Peking Duck, it's a whole roast duck with the skin fried to a crisp. First they carve it at your table. Then for the first course, they serve slices of the duck and crispy skin with hoisin sauce (the sauce is key!) on little warm, steamed crepes - which you roll up to eat. This was my favourite course by far. Second, they fry up some of the duck meat with noodles and serve it on lettuce leaves.   We also ordered a beef tenderloin dish which was very good. And of course the requisite plate of fried rice.  One thing to keep in mind. If you're going to order the Peking Duck, there should be at least 3 people.  The duck gets 5 stars but the ambience gets 3."}
{"text":"My friends had never tried peking duck before and I remember having the best one there a few years ago so I was of course excited to recommend it.   I went to their site to book a reservation and noticed a happy surprise, they had a coupon for 1/2 off.  We booked our reservation on open table described that we would like the duck and that we had the coupon. I also mentioned to our waiter BEFORE ordering that we had the coupon. He explained that we needed to spend over $50 which we did with just the first bottle of wine.   - The duck was very fatty and way less than I remembered.   - We got some noodles that were 2/5  - The staff was somewhat attentive  When it came time to pay they charged us the full price for the duck so I asked the waiter and he grabbed the bill out of my hand, stomped off without a word and came back 2 minutes later saying he fixed it,  but not really as it was still more than what the coupon had stated but I wasn't going to bother brining it up as he did not seem too pleased. We just paid the bill and left.   Never going again!"}
{"text":"Had regular evening menu, not dim sum. Disappointed at how it has deteriorated from former great days. Flavorless, bland food, small portions; negligent service. Will not return"}
{"text":"Being in Toronto, with the 2nd largest Asian population in Canada, Danny was adamant he wanted to have Chinese food while in town. I happily obliged because, hey who doesn't love Chinese food!? I let him make the decision because he's quite particular. He had wanted Peking duck and this place had great reviews online about their Peking duck. It's tucked inside the Met Hotel in Toronto just off Dundas. The place is very tastefully decorated; simple but classy. We were unable to see a menu (and prices) beforehand, so after walking in we were afraid how much we'd end up spending. Looking over the menu, everything seemed pretty pricey, but was (pleasantly) surprised that their Peking duck dinner was 60$ (good for 2-6 people). It's a 2 course meal, with the breasts cut thinly to eat with little tortillas drizzled with hoisin sauce and dycon, and then the rest of the meat is chopped up with carrots, celery and mushrooms and spooned into lettuce cups. Not ever really having a duck meal, I must say I really enjoyed it. The duck was flavourful and moist and paired very well with the hoisin and dycon. The second course offered up a different taste but was just as delicious. I left sufficiently suffoncified and would definitely recommend this place for the Peking duck. We saw the other dishes featured and the portions looked rather small for the pricing, so stick with the duck (it's a much better deal). The service is very proper and professional, however we ended up waiting a good 30 minutes before getting our bill, and the waiter never bother to bring back any change; we wanted 5$ back, but after waiting an additional 5 minutes to get his attention, we just decided to leave."}
{"text":"There was a restaurant in Toronto that I was told had good quality Chinese food and dim sum that my foodie friends would always post about. When I had an opportunity to visit the city this place was definitely on my list.   The restaurant itself is located inside a hotel. The interior seating area is very spacious and elegantly designed. The evening I went to dine it was somewhat late but they were still open for dinner.  I was a little disappointed I did not arrive in time for any dim sum. My server was a very nice lady who informed me that there was still available to order some dim sum with my entree. She checked on me often to make sure everything was all right.   The chicken and truffle dumplings went well with the Taiwanese 'triple cut' chicken.  It ended up being quite a bit of food for one person.  The chicken was wrapped up for me.   Unfortunately I was visiting for a short time and therefore did not have time to go back.   This is certainly a very high end restaurant but the quality of food and service certainly matches the pricing. This is a place that is good for large parties, celebrations or in my case, dining solo.    This is a spot I would certainly like to visit again when I come back to Toronto."}
{"text":"After a long day of sightseeing in Toronto, we decided to try our hotel restaurant. Lai Wah Heen is located in the Doubletree by Hilton hotel. We went in just before 9pm. We noticed the service staff seemed to be short handed, but they did their best working a number of large tables. The food was well prepared, even late at night. I'm reading from other reviews they have quite a large dim sum selection, we'll definitely go back to try it next time we're in town."}
{"text":"Bathrooms are a very important part of restaurants. Since I always have to pee, I always have to and make it a point to visit the restroom. Restrooms tell a lot about a restaurant. For example, at Lai Wah Heen, located in the Metropolitan Hotel, the main restroom door opens into a little carpeted area. It's nice and clean. But, open the door to the women's room and you will see a familiar sight, typical painted metal doors with turnstile locks. The walls are wallpaper and the sink marble. Still, you get the sense something isn't right. Is it upscale or not? With this experience, I was able to predict what Lai Wah Heen was all about. It's a basic chinese restaurant with only slight modifications to elevate its culinary status. For example, the Shiu Mai was regular Shiu Mai with a slice of scallop on top. To be honest, I prefer the \"average\" chinese restaurant 's Shiu Mai. Heen's was too clean, no grease, no texture- so clean that it was lacking flavor. The wonton soup with noodles was no better than the ones I get at any normal restaurant. The duck purse was OK. My friends really enjoyed the Wagyu Beef in Chili Oil. I really enjoyed the Papaya Walnut Crepe.  FAB! (So fab I am going to try and recreate it.) The ribs weren't extraordinary but I enjoyed the vermicelli drowned in its sauce. The Jasmine tea was really fragrant. Really, I don't even remember what we ordered (and we ordered a lot if you look at what we paid.) I guess that's how unmemorable it was...  So really, sometimes, a dirty ol' mom and pop shop or \"dirty\" chinese restaurant is what delivers and hits the spot. For three people, we paid $120 so I would not return."}
