{"text":"As usual the hubby and I cant decide what to eat.\"you want to go out?\",\"fast food (NO!!!), \"how about order in?\".well this time we picked the Lake shore Eatery and was very pleased by our take out order. I ordered the Chicken Parmesan with a side of their homemade chicken and dumpling soup instead of side salad.The Chicken Parmesan was wonderful and homemade not frozen patties. Two Real chicken breasts pounded and breaded.Nice light red sauce over a small linguine style pasta.too much for one meal.Saved the second piece for lunch later.my hubby got the house special Pot Roast and potato and choice of veggie.He also chose the soup over the salad tonite.I dont know how this place can consistently make this dish so outstandingly good.Every Time ! Large portion of beef that is cooked to perfection."}
{"text":"This place was awesome!  I had french toast made from wheat bread and my companions had biscuits and gravy and then a basic two egg breakfast.  The hash browns were shredded, cooked all the way through, and just the right texture.  The gravy tasted great and the biscuits tasted fresh.  My vegetarian companion had no trouble finding meat free things on the menu.  The waitress was knowledgeable about the ingredients and the side offerings.    My french toast was so good that I didn't even want to put syrup on it.    The food came out after a short wait and it was clearly cooked-to-order.  The waitress even recognized that we were on a road trip (ie not a family) and offered us separate checks. The bathroom was clean and everyone was friendly.    I'm going to say this is as good as it gets for diner breakfast.  I however, cannot speak to the American Egg Rolls (which claim to have pot roast in them!) or any other dinner food such as one of the schnitzel choices, which is what I would have ordered if I had been more adventurous.  I will be back the next time I pass through Mentor."}
{"text":"Very good food at reasonable prices look for coupons in the mail even makes it more reasonable.    We usually get breakfast never a disappointment biscuits and sausage gravy is excellent. Staff is always very friendly service very good no complaints at all about this place. Now I see they are remodeling much overdue will even be better when it's finished. Should give the new restaurant up the street a run for it's money if you haven't tried this place you really need to will not be disappointed. In addition it's family owned much rather support them, as opposed to big corporations."}
{"text":"Went here on a Sunday afternoon for lunch. Everything was disappointing. Server never refilled coffee, we waited over 30 mins for 2 burgers, one burger was missing toppings and the other was raw inside. They took the raw burger, offered to make another but I didn't want to wait another 30 mins. Totally dissatisfied with the server and the cook. Server blamed our wait on a large party (7 people) but there were only a total of 17 customers in the restaurant. I wont be returning. Sad, because I would rather frequent small local places instead of big chain restaurants."}
{"text":"We have been here several times and always enjoyed it. Today we waited for 45 minutes and then found out that our order was not put in. We had to leave to get to work and were told it would be another 20 minutes since they were so busy. Nothing was offered for the fact that we received terrible service other than an apology. We are both in the hospitality industry and this is not how you handle a situation like this. Hopefully the guests waiting heard how disappointed we were too."}
{"text":"Great little place that someone recommended.  Glad we went.  Nice sized portions and very fresh foods.  I loved the homemade spatzel's and mashed potato's, but the potato's had some lumps in them. No biggie in my book as I'll take lumps over boxed potato's any day."}
{"text":"Our family has been regulars at Lakeshore Eatery pretty much since the beginning.  In fact, my kids and I accidentally crashed their pre-opening party.  :)  The food here is wonderful.  Lots of homemade dishes and some neat twists on things that you don't see often around here.  The poutine is great, as is the meat-lovers' pasta dish, and the daily homemade soups.  However, the best item, hands down, is the pot roast.  It is the most tender, juicy pot roast I have ever had and I highly recommend it to anyone.  In fact, if you're a vegetarian, take a break from that nonsense to try this pot roast.  It's that good.  The prices are reasonable and the servers are well-trained.  The owner is a good guy and very friendly.  He has incredibly high standards for food prep and cleanliness, which is evident as soon as you walk in the door.  And, they are in the process of expanding the dining room so we look forward to seeing the \"new\" restaurant.  Check them out!"}
{"text":"I have been patronizing this restaurant ever since it opened. I'm a fan of a hearty  breakfast, and I've never been disappointed here.The staff is not only knowledgeable, bkut they remember who you are. Breakfast cook is kind enough to know whart kind of potatoes I like and cooks them for me without any prompting.  The restaurant uses first class ingredients and the cooks make them exquisitely. I like the fact that there is a counter there. Great place to eat."}
{"text":"We come here almost weekly for breakfast... We live 20 minutes away but it's always worth the drive. Mark is usually our server and he's excellent. The food is always great and consistent and the restaurant is clean."}
{"text":"I had the best meal ever here! My order was simple, scrambled eggs, hash browns and toast. Everything was exceptional even the toast. Best hash browns of my life.  The wait staff was super friendly.  The best part: my whole meal cost $3.50!"}
{"text":"This is diner food folks! This is a diner/family crowd as well! As another reviewer put it: Not fancy but well done. This will be one of the regular stops when in search of a meal in that area. For sure."}
{"text":"Lakeshore Eatery is a hidden gem. Don't judge a book by its cover, although it doesn't look like your average restaurant, it is far better then alot of dressed up places. The breakfast is excellent and the prices are cheap and affordable. I highly recommend bringing your family and eating here."}
{"text":"We had lunch here on Saturday.  It was the first time I'd been here since they first opened.  I've got to say, things are MUCH IMPROVED!  We both had the roast beef hash an loved it!  We were in a bit of a hurry and the server made sure our meal came out in a timely fashion.  Two thumbs up to her.  My biggest \"complaint\" is the fact that they serve Diet Dr. Pepper but not regular Dr. Pepper.  :-)"}
{"text":"This will be an unusual review.  I haven't written one like it.  This has to do with the all you can eat fish places that we go to with regularity - Mentor Family Restaurant, Lakeshore Eatery, Mama Roberto's and Manhattan Deli.    The fish tastes great at all of these places and the price is not unreasonable.  All give a good portion on the first plate.  It's thereafter that we have an issue.  One piece every 20 minutes - some a little better, some a little worse.  Those that ask how many you want, take longer.    The management and owners need to take some things into consideration.  For our family, one person gets AYCE and the rest of us order from the menu.  That means 1-4 profit makers in our party of up to five.  We also come in at other times and spend money.    The slow down only serves to make our fish eater stubborn and he isn't afraid to tell the wait staff what he wants, especially when he isn't getting it.  I'm sure the wait staff hate AYCE fish.  Tonight we had a different tactic to the slow down.  They ran out of fish. I have very rarely been at a place that runs out of anything.  I am sure we are not the only ones disappointed in this situation.  Again, I ask that management take some time to rethink how we can make everyone happy.  Copying this to the other restaurants listed.  Don't think I am singling out any one place.  Now I am going in search of other places that do AYCE and hoping for the best."}
{"text":"I love little mom and pop places that are out of the way, and this one was a nice surprise.   My wife and I found some info online and stopped off here during a shopping trip; it was worth it. Their menu is one of the most eclectic combos of Midwestern family fare I've seen. Pot Roast was one item that had been used as a base for a whole host of tasty treats like their American Egg Rolls which were filled with said wonderful roast, and were getting rave reviews from the clientele. I got a chicken schnitzel that was just wonderful. It came with a light spaetzle  in a garlic sauce that was just delightful. Patty got a battered fish plate that was really great, along with hand cut fries. All of it was tasty and fresh.   Our waitress was really friendly and we asked about their traffic during the week; I guess they get busy on weekends and recently on Fridays for their fish fries. The place looks quite deceptive; from the outside, very small, although it woudl easily accommodate quite a few folks. My wife described the place as \"comfy\"; I have to agree. It reminded me of a lot of little diners that are gems amidst all the commercial eateries that you see these days, the ones that you go to for a nice place to take family and friends.   They also have a host of pies and desserts, home made, and quite delicious, and they told me that they have a whole separate menu for breakfast fare that sounded really great.   So, if you're out in Mentor, check out this little establishment, but don't blink, cause you might miss it; believe me, you don't want to, cause it's a tasty treat. :)"}
{"text":"Although the decor seemed a little dazed and confused with various cool music and movie posters in random areas, it was a welcome refuge from the nasty cold and rainy northeast Ohio crud. The duct taped booth seat was a sticky eyesore, but the service was sweet and courteous. We initially ordered the Cuban sandwich, but were informed that they were out of the special sauce to make the sandwich, so ended up getting a basic grilled chicken sandwich instead. We also ordered a cheesy cheesy grilled cheese sandwich with caramelized onions. Both sandwiches came with fries and were hot, fresh and tasty. We got a piece of the chocolate peanut butter thunder cake to go. Everything was reasonably priced. Overall it was a pleasant experience and I'd go back and enjoy all of the quirkiness again."}
{"text":"Good eats! Was apprehensive to order off anything but the breakfast menu since I had bad experiences with other mom & pop places serving lunch & dinner. This place serves up some great home cooked meals at a great price. We had the pot roast and the chicken finger dinner. Both came with big salads. The pot roast was huge and very tender. The chicken fingers were hand dipped/breaded with fresh cut fries. Surprised to get this kind of food from a little diner. Definitely will be back!"}
{"text":"Showed up at the restaurant at 7:50pm and was seated at a table with my fiancé and was given menus by the hostess. 10 minutes later the hostess came back and told us the kitchen was closed down and they weren't taken any orders even though the sign on the door said they closed at 9:00pm . Very unprofessional and won't be coming back."}
{"text":"My family and I came here for dinner and were sorely disappointed. First of all even though it was later in the evening and there were only two other parties in the restaurant, they had us seated in a cluster right next to each other. The booths were so uncomfortable and unsupportive that every time the person behind me moved, I felt it. I got excited to see poutine on the menu as I've been wanting to try it, but the waitress explained to me that it was made with an American cheese sauce instead of Mozzerella cheese curds so we passed. We ordered the onion petals which was okay, but overpriced for the amount you get.   I ordered the paprika schnitzel, my fiancé ordered the regular veal schnitzel, and my son ordered the Lakeshore burger. The salad that came with our meal was brown and wilted and didn't taste good at all. The paprika schnitzel was very bland, even with the sauce on top. And the pork was kind of fatty which turned me off. The buttered spatzel was good.   My fiancé, who is the least pickiest person I know didn't even enjoy his meal. It was too bland for him, so he drizzled Tabasco sauce over the top and still wasn't happy.   My son seemed to enjoy his burger, but he ate only half. At least the fries were made from real potatoes and not frozen.   I was also unhappy with the bill. For one appetizer, 3 meals and our 3 drinks, our total was $50. Thank goodness we had a coupon. This place might be good for breakfast, but I wouldn't recommend it for dinner. We won't be back."}
{"text":"Nice atmosphere- great little menu. Would love to come back. We all had eggs - Omelets- very good."}
{"text":"My fiancé and I frequent Lakeshore Eatery for breakfast on the weekends. The service is always great, and the food is prepared quickly. We go here for the hash browns, which are the best either of us have ever had. Everything else has always came out fresh and delicious. I highly recommend Lakeshore Eatery for breakfast and hope to make it in for their fish fry sometime soon."}
{"text":"First time back since remodel.  Good dinner dumb restaurant layout.  Total wasted space.  We don't get it. Will come back because the food is good for the price.  Just not a cozy restaurant."}
{"text":"I would eat here again. They have a varied menu with some interesting items like wiener schnitzel with spaetzle. We were there for a late lunch, so I ordered a Buffalo wrap. Service was fast and friendly, and the food was well prepared and flavorful."}
{"text":"This is my new favorite place to go to when visiting family! I hail from New Jersey, the land of diners. And Lakeshore Eatery beats out a lot of them. The food is typical diner food and it is excellent. The staff is super nice. But today I ventured into a non-traditional diner dish: I tried the Kasse Schnitzel and it was amazing. The speatzel was buttery and perfect and the chicken so perfectly pan fried. And their secret sauce was very creamy and not overwhelming. I would expect a dish like this to be served at a German restaurant, not a local diner like this. It's a hidden gem. While the wall decor is fun (nostalgic movie, music, & comic book posters), the booth cushions could use some TLC (or simple replacements). But please don't let that distract you from this great restaurant! You'll love it here."}
{"text":"I like this restaurant very much. Everything I have tried is delicious. Hard menu choices after a few times. Worse on Friday evenings (4pm to 8pm) with the \"All You Can Eat\" fish fry. $12 but you aren't going to find a better deal. Wait staff treat you like family. Owner manager makes his rounds. He remembers me and that I'm an out-of-towner. Coffee seems endless. A genuine mom-n-pop place out of the boring landscape of chain places.   I pay cash to save them that % by not using a credit card. Tiny reward. This is small business. Proud small business."}
{"text":"Laid back, nice staff, decent food, great prices. Nice place to hang out and talk to friends without feeling rushed."}
{"text":"Went here this morning with my girlfriend and it seemed like a good place. Until the server messed up her order. The server clearly repeated to my girlfriend \"omelet with bacon and cheese\" yet when she brought it out there was no cheese in it. I know it wasn't the cooks mistake because when the bill came it only showed bacon on the order tab. I myself ordered the roast beef hash which the server told me was a house favorite. It seemed like the idea and flavors were right but the execution failed. They threw the hash browns in with everything else and when it came out the potatoes were undercooked and still slightly raw in the middle. Most likely wouldn't recommend to anyone or return."}
{"text":"Lakeshore is one of the local dinners we go to a couple times a month. Honestly I haven't had a bad meal here. The staff is always friendly and the price is right. Have I mentioned before that I love dinners!?   They have all day breakfast, homemade cookies and pies. What more do I have to say? If you haven't stopped in please do. It's one of my \"go to spots\" in the neighborhood."}
{"text":"Not fancy, but well done. The weiner schnitzel was two nice-sized pieces of slightly chewy veal with spaetzle. No veg. But the buttered spaetzle was a treat, and it came with choice of soup or salad. The salad was iceberg, lettuce, tomato, onion and cucumber -- basic, but fresh, crisp and ample. I finished with the best strawberry-rhubarb pie ever; too often places overcook the rhubarb. Also picked up a coconut cream pie for my wife, and she thought it was great. Went on a weeknight and there were several tables full, and lots of people ordering the house specialty, the pot roast."}
