{"text":"This is a nice little hidden gem of a place for brunch or lunch, located right on the waterfront in the bottom of an apartment house.  It's kind of hidden away and there is only one small sign near the driveway so you pretty much have to know where it is, and most of the people who eat there are locals.  Decor is no-frills cafeteria style although you order from a menu and not a buffet line (the place is too tiny to fit a buffet line).  The big plusses are:  you get a great view of the lake without having to spend much money on your food, and the food is good.  I ordered a chicken wrap which was recommended to me by my dining companion who'd been there before.  Since Lakewood has always struck me as more of a hamburgers-and-fries kind of town rather than chicken-wraps-and-salad, I was pleasantly surprised that my wrap was most excellent.  I'd definitely come back to try another one.

The main reason I'm only giving three stars and not four is what seemed to be an inordinately long wait for service.  Even though the place was just about full the day we went, \"full\" is still not that many tables, and there were at least two wait people working (with a third guy who I think was the owner or manager helping out).  Yet, we probably waited about 15 minutes to even get a cup of coffee and menus.   This would have been understandable if it was a larger restaurant, but it's so small that wait staff had to walk/ squeeze past our table repeatedly to reach other tables and failed to even acknowledge our presence with a \"hello\" or \"we'll be with you in a minute\", let alone a cup of coffee."}
{"text":"If I could give 0 stars I would.  I've come here three times now and yet to be served food.  1st time I came at lunch on a Sunday and waited 30 min for a burger and left before they could serve it. I was told at least another 10 min.  Today I went at 10am and waited 15 min to be seated ...then I was told it would be another min to be seated, followed by another person saying at least 15-20 min.  They had at least 5 open tables!  So me and my GF said oh well...let's come back after our walk through edgewater drive and give them another chance...at this point we are dying to try this place but should have just gone to Clifton Diner.  We came back an hour later and finally!, success!... We actually got a seat.  We order two omelets that are serves with tomato salad and fruit salad (both I imagine are pre made). We waited another 45 min watching everyone get seated and even ones who were seated 15 min after us getting their food and look to be enjoying it.  

I wish I could say I tried my omelet but I didn't.  I am not exaggerating.  This place shows no sense of urgency to feed people.  They have the attitude as if we should feel blessed to have a seat.  

I highly suggest to find another place.  They don't let you eat outside for the nice view and place seems dirty as well.   Clifton Diner is a 10 min walk and 1 min drive away....go there.  It's also cheaper and everyone seems very happy.   

Again I wish I could have eaten this places food but obviously they didn't want to serve me for the 2nd time.  I've never in my lifetime gone through this.  People I know told me not to try this place because of this exact reason too, but I've ignored those people twice now. Probably won't for a third time.  

If they read this they will know exactly who wrote it...hopefully they change their ways.  

I never do yelp reviews and I am going out of my way to do this because I am so disappointed.  

Thanks."}
{"text":"Very friendly service. When it's a bit slow, they are very apologetic and accommodating. My favorite is the manager that walks around and asks how things are - he is really committed to the Cafe doing well!  The breakfast is basic, cheap, good. For lunch/dinner there aren't any good vegetarian options, so we really only go for weekend brunch."}
{"text":"The best grilled chicken with cheese over it, and thin pasta with Alfredo sauce"}
{"text":"Is funny how the so called or self proclaimed \"elite\" are all over the places to bash restaurants. This little restaurant is the perfect place to have an affordable meal while enjoying a beautiful view.
These \"elite\" want fine dinning food at burger king prices. This Yelp \"yelp?\" elite seem to enjoy bashing the little guy thats trying to make a living."}
{"text":"Great location on the Lake.  Food and service always fine.  Has become my favorite spot for simple early and midday dining in a relaxing environment. 
Wish they were open earlier for breakfast.  8 am is a bit late for those of us seeking breakfast before work or to begin the day."}
{"text":"What a hidden gem! I searched for a restaurant with a lake view and came across this place. It's nothing fancy - just a casual diner. The food was amazing. I had the turkey wrap, and I tried my family's chicken marsala and lemon shrimp pasta. Everything was delicious. The best part was our server Patrick. He was so kind and friendly. He made sure my son's food came out early, and he was very attentive to us. Awesome!"}
{"text":"Great little spot. Has a great view of Lake Erie, a hidden little gem, waitress was great and food was served pretty quickly, I had the Lake house chicken Parmigiana it was very good. I got desert to go Lemon cake so delicious was recommended by our waitress. Would definitely recommend this little hidden place."}
{"text":"What a great place. LOVE their perch dinner. Great service. Nice people. Very friendly and the menu is delicious."}
{"text":"Love, love, love this little gem.  The food is great; the service phenomenal.  It's a bit pricey but absolutely worth it.  It's very quiet and has a fantastic view.  It's a must try!!!"}
{"text":"A nice traditional diner in the back of an apartment complex with great views of Lake Erie.  

The food was very good.  I had a Perch sandwich and home made Ham and Bean soup that was amazing.  My wife had a burger (average) with really good home made kettle chips.  

The service was very friendly and attentive.  We really enjoyed the experience. 

Prices were very reasonable.  We will be back."}
{"text":"Good breakfast. A lake view at diner prices. Great service. A great neighborhood find."}
{"text":"I called in to place an order. Was told to call back once bc they were taking another order. Called back again and told to call back AGAIN because they were too busy. The assholes attitude was horrible. Poor customer service."}
{"text":"This place never lets me down! What a gorgeous view of the Lake Erie sunset! Enjoyed the food and the wine ! Will definitely return again when I'm in town !"}
{"text":"I am going to TRY to keep this short and simple.  Ordered fish, \"chips\" and coleslaw (meal) and I got one big, burnt piece of fish on a bed of lettuce and french fries (no really, it wasn't coleslaw but a bed of brown lettuce).  I also ordered some kind of Strawberry cake...the cake was super dry and the taste of the so called strawberry filling was not sweet but blah and bland.  The one half of a strawberry they put on top of the cake was super sour...like a punch in the right eye reaction when I bit down into it (definitely made the ugly face).  What I will give props to is the view...beautiful!"}
{"text":"Great food, Fantastic lake view, Good prices and Great service - need I say more? Big fan of this place, it's staff and it's food and I think you will be too."}
{"text":"Finally found a great breakfast in Lakewood!  There are many good breakfast spots, but the cooks here have breakfast mastered.  A bit of a wait, but well worth it."}
{"text":"Very delicious food, great view of lake erie, super nice staff, food was straight out awesome!!!!"}
{"text":"This place is just so cute. And the food I had was very good. Me and the bf went here on a very cold blustery Sunday morning. Sandy had caused some water damage and so they had a tarp up blocking the lake view but I can imagine it is usually a very nice view. We got seated right away and got hot coffees and water. I ordered the gyro omelet and the bf got some other type of omelet. Both our omelets were chock full of the stuffings which is how I like it - so I get a bunch of the ingredients other than the egg in every bite. The potatoes were really crunchy on the outside, cooked perfectly. And for our coffees, omelets, and tip it came out to less than $20. This place is right across the street yet I think most people don't know it exists. It doesn't have much signage on the road. We will definitely be going back."}
{"text":"Giving a weak 4 for the Lake House Cafe. Stopped for lunch with my mother early afternoon and found a decent crowd enjoying themselves at the cafe. First things first - what a Super view of Lake Erie without having to a lot of money to dine. I would have liked to seen tables with umbrellas on the patio taking advantage of the view, a true missed opportunity. 

We did enjoy our inside window table overlooking the lake while we ate lunch. I started out with a cup of the clam chowder that was ok, nothing special that I would go out of my way to order again, it was just average. My Triple Decker Club Sandwich was pretty good with nice amounts of turkey and ham. I liked that the lettuce was fresh and the bacon was crisp. My mother went with the Cobb Salad, nice portion and fresh looking. The dressing was served on the side in 2 containers, nice not having to ask for extra. 

The restaurant looked neat and clean and our waitress was pleasant and attentive enough for our needs and wants. When I asked for an extra napkin she was promptly in bring it over to me, a small but good touch.  All in all a decent place for lunch with typical dinner food that has a million dollars view."}
{"text":"I had a late breakfast (3 egg omelet with ham, cheese, bacon and sausage, served w/crispy fries and sautéed onions and 2 slices of toast) at the Lake House Café during the week of 
10-31-16. I believe the price was approximately $8 or $9.  I ordered a coffee for an additional $2 or so.  I think the prices are a teeny bit high but the service is great and the food was served steaming hot and perfectly prepped.  It was a big breakfast and was tasty. The sweet view of Lake Erie is tough to beat, so that, alone, about justifies the prices.  It's a quiet place, even when busy.  This is not my first visit to the Lake House Café.  They also serve well prepared, but not fancy, lunches."}
{"text":"The food is pretty good and the prices are very fair. Came on a Sunday afternoon and was able to get a seat instantly for breakfast which is unheard of in most diners. The waitstaff were very friendly and seemed family-oriented, and the view of the lake was perfect for the morning view of the lake. The diner is located in the back of the building so it is completely hidden from the streets. One complaint is that their hash browns are not hash browns, which is typical of most diners. Home fries are not hash browns, as they are neither hashed nor browned."}
{"text":"I agree with m.m. This is basically a hidden little restaurant. Unpretentious, but friendly staff and pretty good meals, a cut above the usual diner food. Give it a try for a simple meal, reasonably priced. It is closed Mondays."}
{"text":"Cost of Easter brunch for what was served was high. Staff was very friendly. Coffee was good. Brunch eggs overcooked and grey. Honey Baked ham overcooked and dry. Chips Ahoy cookies - for kids? Prime Rib tasty. Definitely a food disappointment.  We have ordered breakfast there before and were pleased. I get the impression it was all cooked too soon and expected to stay edible for hours."}
{"text":"After spending the afternoon bicycle riding and flying my kite at Edgewater Park Cleveland Ohio I used the restaurant application to find someplace selling seafood items.  My GPS and and the app brought me here.  

This is the ultimate hiding or meeting place on the Lakewood Ohio beachfront area with a great view of Lake Erie.  Classy menu should make a good impression on company invited to join you for a meal. 

At first it takes you to the front of the apartment building and I as a single guy got kind of happy at the prospect but a small 8.5\" x 11\" sign inside the door tells that the restaurant entrance is out back.  There is no sign on the street and this place is a perfect hideaway for married politicians out cheating that I write stories about in East Cleveland Ohio on #44112News.  

This place is short staffed so crowds of people slow service down to t a crawl but I ordered the Salmon Dinner with their shrimp appetizer.  The shrimp were more like a crunch chip over-seasoned to the max.  They might want to check their Old-Bay season shaker a bit. 

The salmon was coated with cheese and it looks like the kitchen loves cheese because every thing comes with a lot of cheese.  At this place you are paying for the seclusion factor and prices are reasonable to treat a one time date to dinner and they won't complain.  Bottom line is you and the date will never see each other or this place again so enjoy the meal.

Not the best dinner I have had but I certainly will add this to my out and cheating places to take a married to if I ever need to do that or places cheaters in East Cleveland might read and take someone to enjoy a beach front dinner, lunch or breakfast."}
{"text":"This place is a really nice lakeside restaurant near my home. It offers B/L/D, but I think breakfast and lunch are its main business. The food was good. I had their pancakes eggs and bacon. Coffee was hot and poured often. 
It's definately laid back. As our waiter had no problem dropping the \"F\" bomb in general convetsation at least 1/2 dozen times. My friend and I didn't mind it was a little wierd but strangely inoffensive.
Give it a go. I think you'll enjoy the experience. 
I did."}
{"text":"I have spent almost a year writing my own yelp* reviews and reading those of others. I have learned a lot from my fellows. I learned that I am an old person, a cotton head and I go to dull places that use no seasoning that are well suited to us dull poorly seasoned old people. I have learned that many of the restaurants that serve Cleveland style stuffed cabbage or chicken paprikash are unhealthy and again filled with old people. I learned Melt and B Spot serve food that may be a bit unhealthy but Oh so worth it and are filled with the young hip beer drinking crowd. From yelp* I found that Cleveland lacks places on the lake.

I could care less about opinions about my age or stereotypes concerning my age group. I take great pride in my generation's accomplishments. I find the excuses for eating or not eating healthy food more revealing of the writer's inconsistencies than the restaurant's cooking abilities. However, I puzzle over most lake front eateries struggling when East 4th Street or West 25th Street win accolades.

I simply loved sitting by the fire drinking coffee looking at the frozen lake at Boardwalk Cafe. In summer sitting at an outdoor table eating a chicken salad sandwich with the lake surrounding me made me smile. Boardwalk has gone out of business.

I frequent Lake House Cafe. The bright small restaurant sits on the waterfront with a menu as good as most but with an incomparable view. Yet it is rarely crowded. Today I had breakfast at the Cafe with a close friend. We sat for three hours catching up. The server kept our coffee cups filled. No one waited for our table.  There were lines in Tremont waiting for tables. 

Lake House Cafe on any given day is far more stunning than most any other place I patronize. Our lake died years ago and now it lives again but in loneliness."}
{"text":"Most recently I ordered the buffalo chicken wrap and fresh cut chips. The chips were totally undercooked (essentially dunked in oil and served cold) and the wrap was inedible-- completely soaked in buffalo sauce to the point where it was pouring out of the wrap all over the chips. I took the food back and was met with a tremendously poor attitude by not one but THREE employees, referring to me as \"the wrap guy\". I politely asked for a refund ($10.95) and it took almost 15 minutes to handle the transaction. 

I would not recommend this place. The service is typically awful, and there's a 50% chance your food will be worse than the service."}
{"text":"You know the saying, \"you get what you pay for?\" My experience at Lake House Cafe was exactly that. After purchasing a $20 dinner for two Groupon for $12, my boyfriend and I decided to check the place out. Living right down the street in one of the high-rise condos, the location was super convenient. However when we walked in at about 6pm on a Wednesday evening, we immediately felt the weirdest vibe--there appeared to be one woman working in the entire restaurant: hostess-waitress-busser-cook-cashier. Although the restaurant was full, not a single table had food on it, and most drinks were empty. I actually saw a woman get up and go up to the station with the fountain drinks and get her own refill (unless that is how this place works normally???) We stood around for about 10 minutes, without being acknowledged at all, and eventually decided the wait (which was obviously ridiculous) was not worth the $12. Maybe someone called off, maybe someone quit, I don't know, but first impressions are key and it's unlikely I'll be back any time soon."}
{"text":"I love this hidden lakewood gem. The restaurant has a great view of the lake and downtown cleveland. Come for a reliable casual meal at any time of the day. The tiramisu is awesome and the breakfast sandwich really hits the spot."}
{"text":"Meh. That pretty much sums up our experience here this past weekend. Portions were good, but the food was certainly bland to say the least. The best thing we had were the Guinness Pretzel Bites. Not worthy of the Guinness name, but they were OK. We also had the Lake House Pasta and Tilapia which were both pretty bland. Let's just say we both had plenty to take home but opted not to. Service was good until we declined to-go boxes and then it just got awkward. Pretty sure she knew we weren't impressed. If you are looking for a view this is a great place, but the food we tried certainly didn't make the visit worthwhile. (Luckily, we had a successful shopping trip at GVartwork prior to which is the main reason we were in town. Definitely worth stopping by if you are looking for Cleveland apparel!) If it weren't for having a small baby with us, we certainly would have opted for a more upscale dining experience in the area."}
{"text":"One of the few things I miss about living in the Lake House condo building is having this homey little diner downstairs. 

The food, for the most part, isn't spectacular, but it's consistently decent, with a few exceptions. If they still have it on the menu, skip the fish and chips (I tried it several times, and the result was always disappointing) and the veggies that come as a side with many of the entrees are... well, they're weird. Vinegary. Not in a good way. Being a nearly weekly regular for a few years, there's not much there I didn't try at some point, and those are the only things that stood out as not up to par for passable. 

The portions are more than generous - the cobb salad (which is more of a sort of smorgasbord salad than a traditional cobb) would make 2 meals if lettuce didn't get all soggy and weird left overnight in a styrofoam container. The pasta entrees are easily two meals. The corned beef is almost always juicy and yummy - on St. Patrick's I still usually make a stop there for the corned beef and cabbage special. This is possible blasphemy in Cleveland, but I like their corned beef more than Slyman's. A friend of mine digs the steak wrap enough to specifically ask to go there occasionally, just for that. 

The restaurant itself isn't much too look at - no fancy decor, rather small space, mom and pop diner sort of feel. But the view of the lake is what you want to focus on while you're there anyway, and there's not usually much of a crowd, so getting a window seat to take in that view is rarely a challenge. Fantastic spot for breakfast if you've got time to sit and wake up with that view... 

The staff has always been friendly and swift - even before they got to know me as a regular, I always had a good experience on the service side. 

All in all, decent, friendly, and priced reasonably. Not a foodie haven by any stretch, but solid comfort food with a lake view is nice to have."}
{"text":"Lake House Cafe has a great view of Lake Erie. If this is something you care about then you will absolutely love it! While we were here there were something like 20-30 sail boats on the lake. Otherwise, this is a poor location unless dining behind an apartment complex is your thing...

Service was quite slow. We actually got up and left after waiting too long for someone to come take our order. At a different restaurant we were seated, and received our food in less time than we waited at Lake House. After reading the reviews I now realize this is a pretty common thing.

Tip: You're a cafe. Come on. Dont keep people waiting around!

We went here because my parents got me a Groupon. Make sure to read the fine print. You can only use it 5-9pm on week days or something like that. Although, when the waitress was there she was willing to ask if we could still use it. That was nice of her.

+1 star for the view.

Sorry Lake House Cafe, it is unlikely that I will return."}
{"text":"Stopped here for breakfast because I remembered years ago it was a middle eastern place. The view is fantastic. The breakfast was excellent and reasonably priced. The homefries with onions were terrific. It was definitely a case of breaking good, we found a great breakfast place on the lake, not easy to do in Cleveland!!"}
{"text":"Great little place with a perfect view of Lake Erie The  service was great and everyone was quite friendly   I had  a delicious breakfast need to catch lunch or dinner on my next visit"}
{"text":"ZERO!!!!!
On Sunday August 17 we went for what we thought would be a nice diner breakfast. We were a party of nine, the rude person that showed us to our table was quick and rude to announce \"I will not put a chair in the aisle\". Two of us went a a two person table where we waited 45 MINUTES .....YES 45! All we got was coffee while the other tables (who were all white) around us came in for their meals and finished while we waited. A lady that was cleaning tables was working I the kitchen area handling food. One do the waitresses stated that \"they were short and training a new cook\". Still everyone's orders we being completed EXCEPT ours.
We received strange looks while walking in to the establishment. I would hate to assume that it was a racial thing as we were the only non-white people in the diner. We are very proud to be Americans though our skin is tanned and we speak another language. 
POOR POOR CUSTOMER SERVICE!"}
{"text":"I love Yelp. I found this treasure because of Yelp. My family wanted to have breakfast on the lake and all I did was search lakefront breakfast. Coffee was hot and good. The prices were very reasonable. The food was amazing. The highlight of Cleveland."}
{"text":"You would never find this place if it wasn't for yelp. It has a great lake view and the food is perfect! Fresh fish and tilapia is amazing! It is not a fancy brand new place but I dont mind! Its byob!"}
{"text":"This was my first visit to The Lake House Cafe and I was impressed!  My mom and I each had the Lobster Bisque which was miles above any other in flavor and content.  It was loaded with large chunks of lobster and crab, it wasn't overly rich and had a nice kick.  The perch dinner was perfection, fresh, lightly breaded and perfectly cooked!  To top it off, our server Patrick was worth checking out The Lake House for by himself.  He was gracious, friendly and on top of his game!  We will not only be going back ourselves to try some other foods, but have already recommended it to many others!"}
{"text":"I went to breakfast with a couple other people.  To say we were not impressed is putting it mildly.  I had tried this restaurant on two other occasions, once for breakfast and once for lunch.  I was disappointed in both of my previous visits as well.  It had been at least 3 years since my prior visit.  I decided to give it another shot this past weekend.  I am sad to say that I will not return.  It could be such a great spot! The location and views are spectacular!  The coffee was decent as well.  The service was lacking.  We were the first people to walk in that morning.  The server ignored us for the first several minutes.  I understand she was still setting everything up but an \"I'll be right with you\" would have been nice. Two of us ordered bacon with our breakfasts.  I never thought I would say this or that it would even be possible but even the bacon was disappointing!  I am not sure if it was deep fried or what? It was completely flat and dry!  It was even a weird rusty color.  It practically disintegrated when you put in your mouth.  The one diner who ordered the breakfast sausage didn't like that either.  I had to try a bite out of curiosity... It was like a grease tube.  Last but not least, one person ordered eggs over medium, when the server delivered them she said, \"you ordered your eggs over medium right?  I'm pretty sure the cook made them over well, he's not awake yet.\"  She checked her eggs and sure enough the yolks were cooked through.  The server took them back and did bring us a corrected order of eggs. Thanks for that, but why send out the order when you know it's wrong first place?"}
{"text":"BEST CAFE IN LAKEWOOD!! Their breakfast is out of this world. Awesome view of the lake and downtown! :)"}
{"text":"Did a Google search and drove out for breakfast. Cute little place behind an apartment building with lake views. Not a fancy place by any stretch but the staff was friendly, the breakfast was yummy, and the prices were fair. Check out Lakewood Park after you eat here!"}
{"text":"Okay the food here is delicious and very reasonably priced! But I do have to say the service is pretty slow and they only have like two people working. It does take a long time but personally I think it's worth the wait! I love the veggie omelette and their hash browns are very good! Great breakfast spot!"}
{"text":"Wonderful, small, local diner. We're traveling, wanting to avoid chain restaurants, and ended up here. We had ciabatta French toast... So good! And it's right on the lake so a great view!"}
{"text":"Wonderful view.  Great service.  Tiny place with good food.  Gave it 4 stars because the menu was limited in variety.  View is worth eating here!"}
{"text":"Ordered a buffalo chicken wrap & pretzel bites (delivered with GrubHub). The boxes arrived without a bag. The driver said the restaurant ran out of them so I had to fumble with the boxes. The pretzel bites were ok but became hard & chewy after about 20 minutes. They came with a microwaveable container of Ortega cheese dip. The wrap, however, was INEDIBLE. It had so much sauce & tomatoes on it that the tortilla literally disintegrated.. I couldn't pick it up. I picked it apart trying to at least find the chicken & just eat that but there was barely any. It was an INSANE amount of tomatoes & onions (I'm posting a pic of it here). Threw it out. First & last time eating here. Not to mention it was $26 for that. I would love to make the person who made that wrap eat it themselves to see how disgusting it was."}
{"text":"I'm giving this place 2 stars for cleanliness and décor and 5 stars for the friendly staff and fantastic food. We were brought here for lunch by one someone who lives in the area. He had good things about it so we decided we should all try it. We ended up using street parking and then had a hard time finding where the actual restaurant was and walked into the apartment building! Finally we made our way around back and realized then, too late, that there was a huge parking lot back by the entrance. So, signage is not great. We were greeted and seated immediately with a table window, we were one of the first lunch tables so that was nice.VERY dated décor and dirty window ledges, not a fan, were the first things I noticed. Until I saw an ant crawling along towards my chair(yes, I killed it and never said a word) Another one also came along during the meal. The three of us ordered and not knowing what to expect we waited for our food. It wasn't the fasted prep but its nice to know that everything we were served was fresh made to order. All of us were extremely happy with our choices. Honestly I was surprised! I ordered just the house caesar salad and had the grilled chicken added to it. It was a fantastic little salad complete with tomatoes, croutons, real shaved parmesan and some of the tastiest little bits of chicken chunks. For a small salad it wasn't the cheapest at $8.49 but it was very good.  My husband went with the Chicken Bacon Ranch Wrap. Also fresh made to order and the tortilla was grilled which is unusual for a wrap but a great idea.  All in all we had a very delicious lunch but the atmosphere could definitely be improved. Also wanted to re-mention that the service is very friendly and welcoming."}
{"text":"The Lake House cafe is a great place to grab breakfast, lunch, and dinner in Lakewood. Not only is the food and service fantastic but The Lake House provides one of the best views in the Cleveland area (second only to Pier W). 

Patrick is an amazing server and has great reccomendation a if you can't make up your mind on what to order. Eat here!!!!"}
{"text":"Quaint little place to walk to for a bite to eat. Portions are good for the price and it's as good as if I made it at home."}
{"text":"So, even though the decor is out of date, the food was...really good. Our kids devoured their food. Everyone enjoyed the fresh seafood. And a great view of the lake!"}
{"text":"Hurricane \"SuperStorm\" Sandy is no excuse for how bad this place was!

Determinants of a good diner:
* Coffee:  um... was it brewed with lake water?  yuck yuCK YUCK!
* Omlette:  corned beef and swiss, actually passable, worth a \"meh\"
* Pancakes:  soggy, rubbery discs of bitter disappointment.
* Hashed Browns:  I get it... you don't want to prep potatoes differently for hashed browns and potato chips... but for the love of god, please cook them!

It comes down to one thing:  I don't care how \"beautiful\" the lake view is... if the food is garbage, you're not going to get me to come back."}
{"text":"Not bad, but not incredible either. Decent food, but it's definitely one of those places you'd go with your grandparents begrudgingly when you visit them."}
{"text":"Great e petite NCE overlooking the water.  Burgers are great.  Perch was very good also.  The homemade chips are good and are seasoned with ranch."}
{"text":"Nice view of the lake. The food is decent and affordable. The waitress was very nice however, there was a bit of attitude from the man in the kitchen who brought the food to our table. We arrived about 45 minutes before closing time, for lunch and maybe he was not happy that we were in the restaurant a few minutes past closing."}
{"text":"The Winton Place has Pier W. The view at Pier W will allegedly get you in good graces with the date you spend too much money on. This is where Lake House Cafe comes in. Or as I call it: Pier Z. The food isn't that bad. It isn't that good either. The view is nice though. If you happened to take a date to Pier W, have an overnight guest, go the extra mile and take him/her to Lake House Cafe in the morning to remind you that things are not always as they seem. The night before may have been full of magic but the day that will follow will pale in comparison as you eat Pier Z breakfast. Or just welcome them into reality with a meal at Lake House Cafe and bypass Pier W on the special date night altogether. Let them know how you usually get down. This will also serve as a great life lesson. Don't live a lie."}
{"text":"The Lake House Restaurant has never let me down every time I have visited.  That atmosphere on the Lake is fabulous.  They give so special attention to every diner and make sure that what you ordered is exactly what you get; if it is not, the are most willing to make it totally correct.  The amount of food one gets for the price is unreal.  Hats off to all of them from the waitresses to the chef. Atmosphere, qaulity of food, price, and quantity cannot be outdone by any other restaurant in Lakewood."}
{"text":"Modest little place in an apartment complex. I live right across the street, so i usually just stop in a grab some coffees to go, when in need. I have eaten here. It is quick easy breakfast, of the simple nature. The whole menu is very affordable, i have heard a few complain about the price increase, but I'm ok with the price point. 

To my surprise, i have walked in to this place and have seen it packed! All these people can't be wrong. My favorite thing about this place is the fact that they have beer, bottled and tapped.  Reminds me of my college days down at mike's. as long as they are open, we like to wander over."}
