{"text":"The stewed chicken, beans and rice and potato salad was DELICIOUS! Just double check your order before you leave I was missing an entree"}
{"text":"For the location, the food was surprisingly good. I was in the mood for some Jamaican food. The Beef patty and Jerk Chicken was better than expected. Rice and beans were flavorful and the plantains were sweet and delicious as well. Improved quality of the ingredients for the jerk chicken would make this a 4-star review!"}
{"text":"Lmao!! She said she didn't try the oxtail because she don't eat pork anymore.lol oxtails is not pork it's beef and it's rich and good so next time you there get it .."}
{"text":"This is my first time and mu last time eating here. Not only did it take 30 plus minutes to get my food. But when my food came i was shock to see i got a leg and a drumstick for 9 dollars"}
{"text":"Lally is an Amazing cook!  Had the Belizian stew chicken and tried the jerk chicken my sister got..both were DELICIOUS!! Rice & peas and potatoes were also so so good!   Definitely will be back!"}
{"text":"I'm deployed here for a couple of weeks and I loooovvveee this placed . I tried their oxtails yesterday . They are always sold out but fortunately I finally got a plate . It was soooooo yummy. It sucks that it's in a casino."}
{"text":"Look at this plate I LITERALLY JUST ORDERED.... I'm so mad right now. This place is hood but they usually have good portions and good food. While my jerk chicken was good it was clearly reheated and not freshly made. Then my plantain look miniature. I'm not happy with this visit by far."}
{"text":"Food was good just a long wait but if you want island food this is a cool place to go to."}
{"text":"I was pleasantly surprised by the food here considering the location of this place. Obviously not  in the nicest part of town, and not in the greatest hotel/casino. My mom spends a lot of time here, so my boyfriend and I decided to hang out with her for a bit and grab a bite. We didn't get anything too exciting (just chicken fingers which were very good), but the menu has some good choices of food that I would like to come back and try."}
{"text":"****located in the casino  As a west indian I'm always looking for some good Caribbean food out here, heard about this place and had to try it. The ox tail did sound tempting but since I stopped eating pork I decided to go with the jerk chicken and belizean stew chicken. In the past I've only had Trinidadian stew chicken which I'm not a huge fan of but I loved the belizean stew chicken definitely different from Trinidadian stew. Food was delicious and the portion sizes were great. Definitely making this a regular spot when I'm craving some good old Caribbean food."}
{"text":"Smh only reason I went here was so I can get something cooked cause I don't eat fast food and since I've moved here I figured I'll try they special. Two pieces of chicken and two sides. The chicken tasted like it was cooked in old grease. The sides were tiny didn't even fill half of the Togo box sections. The sides was whatever tho' tase like the pre-made stuff. I also got my favorite famous breakfast I just be wanting two eggs and hash browns. How can anyone mess that up. Man Came with two pieces of your choice of meat and some toast. I couldn't believe how you can be selfish with has Browns. Omg. I pay less at Boulder station and they give you a huge. (compared to this place-paper thin.) It tripped me out how I had more eggs then the hash browns. SMH yeah I'm coo' off that place. I had to do a review cause I keep convincing myself to just be hungry b4 I spend my money with selfish cooks."}
{"text":"I have been here a few times you gotta go during lunch time I kept going late getting leftovers it's been hit or miss when there on point it's delicious I had oxtails and there stew chicken didn't like getting two legs at least get a thigh for the same price manchesters gives you a thigh and a leg quarter they got some competition but if you live in the area location is great and reachable there's nothing around to compete"}
{"text":"My food was ok. Wife's food was way too spicy!!! Customer Service was Horrible!!! Located in a very smoky casino.  No real soul food.  Disappointed."}
