{"text":"I sat at the couches and it feels so dirty in that area. There was a spider creeping the table. The menu had an ice cream milk tea with an option of about 6 different ice cream flavours to choose from, but when I was ordering it, I asked from the coffee flavour, waitress says they don't have it, I ask for green tea?, nope. Okay so what do they have? just vanilla. 
The only decent thing about this place is you can stay there and play games or chat for as long as you want (closing time is about 2am)."}
{"text":"Food/bubble tea was $4-$7 and was not the best. The bbt was made from powdered flavour. I chose the handmade noodles which had a mediocre texture. However, the board game selection was superb with all the mainstream titles alongside some indie titles. The atmosphere was calm and friendly. The service was pleasant!"}
{"text":"Good service! Came here from out of town with my cousins. The waitress was really thoughtful of us and the drinks are pretty good too!"}
{"text":"I would give this place 3 stars if they actually had more detailed pricing for the drinks.  The drink itself was not bad--I ordered a mango smoothie with bubbles (large) but when my bill came--take out btw, not staying to pay the fee for board games, etc.. I was greeted with a $8.65 bill for 1 drink!  I about had a heart attack--had I known, I could've gotten the same quality drink for 1/2 the price inside of the First Markham place mall food court where they had 4 bubble tea shops with the cheapest one being $1.99 for a drink.  Regardless, the idea is neat to have a place that opens late and with board games, and a place to hang out for kids.  I will most likely not revisit due to the hefty price of my drink.  I'm sure I can find better bubble tea elsewhere."}
{"text":"Cute shop, but totally empty. I came here before a movie on a Friday night and the place was deserted. A shame, because they've got a good variety of board games (plants vs zombies the card game? what??) and the place seems really nice and cozy. I ordered the egg-flavoured milk tea with mixed tapioca pearls. The drink was standard, nothing powdery but nothing mind-blowing. I thought the tapioca pearls were tasty as well, not too sticky. 

You also get a stamp card, which is a bonus - 9 drinks gets you a free 10th one. If this place starts picking up, I'll certainly come back to try it again. I miss Toronto bubble-tea."}
{"text":"Service was pretty lackadaisical, and the drinks we ordered were only so-so.

I like the fact that they had games there, and wifi, but I won't be rushing out to come here again."}
{"text":"My friends and I went here one night during the summer after we watched a movie.

We all ordered french toasts with peanut butter.  It took around 20 minutes for our orders to come.  The portion was okay but there was barely ANY peanut butter on any of our orders.  There was so little that none of us really tasted it.  The cost for the french toasts was not particularly cheap either...

Then, we decided to order dessert and we all ordered cheesecakes.  There was an option for a normal slice and a small.  One of us ordered the small and well, it was legitimately tiny.  I would say it was around 4 x 4 cm cube of cheesecake...costing $2.
For those of us who ordered the normal sized slices, it was a decent size considering the price however the cheesecake were still a bit frozen when they gave it to us.  When we ordered our cheesecake, it took another 20 minutes for them to bring us our order.

The thing that irritates me the most though, was when we got our bill.  The lady tried to rip us off by adding an extra dollar to each of our french toast orders.  When we told her about the mistake she said \"sorry the machine sometimes makes mistakes like that\" even though it was obviously done on purpose..."}
{"text":"I'm going to give this place a 4 star mainly because I've only been there only once. When I first entered, I loved the atmosphere! All the post it notes and pictures on the wall made it feel very homey. It was quite packed, even though I went around 10PM. Despite that, there were a lot of people just sitting around playing games and it seemed like a really cool chill spot! They had a whole wall of board games! I just wish I had more time to experience it.

The drink I got was the Matcha Green Tea Smoothie. I originally wanted a regular bubble milk tea, but they had no bubble left. The green tea was alright, it tasted like a green tea latte from Starbucks. It was good, but I would want to try something else.

4 stars for an awesome atmosphere and a pretty decent drink."}
{"text":"I'm surprised that this place has such horrible reviews to start.

Pros: 
- This place is open until the wee hours at night. This is so convenient because it's when all the night owls come out and hunt for their favourite bubble tea shops 
- They have games! I can't remember how many nights I would make the trip to Markham (and I don't even live in the city) to play Monopoly Deal with my friends
- They have Polaroids! If you request it, they will take your picture with a Polaroid and stick it up on their wall (I have two up already ;D)
- There's always plenty of people here when I come which means that it must be a hot spot... but this can in turn become a con (because I prefer the couches which may be taken if this place becomes too popular)

Cons:
- The shop isn't very big. It can probably fix a maximum capacity of 25-30 people. 
- Typical bubble tea prices. If you aren't used to paying $5+ for a drink and don't like the idea of it, maybe bubble tea isn't your scene. 

Nonetheless, thank you for letting me catch up with friends on multiple occasions through talks, time wasting games and tapioca. Lambie Bubble Tea is the Asian version of Snakes & Lattes... only it's better!"}
{"text":"One of the most interesting things about Lambie is really how relaxed it is at first glance.  Everyone in First Markham Place is up and running at around 10-11 am at the latest, but these guys aren't open until 3 pm.  This makes sense, because they're open till 1-2 am as well.

One thing to note that a lot of people aren't quite getting is that food comes secondary to the board games here.  Yes, this place is supposedly a \"lounge\" where people sit down with drinks and chat for hours on end, but the main focus was the board games.  Lambie may have associated themselves with \"bubble tea\", but it hardly is their main focus.  Their focus was to be a hangout spot for people, where people can find a means to just enjoy time in each others' company, all at the price of not having to stare into another person's face blankly like the average tea/coffee shop.

In that regard, Lambie has succeeded quite well.  They offer a drink + games package, you order a drink and you get to stay for about 2 hours? 3 hours?  The more you order, the longer you can stay really.  This works out well.  Not all games end in 2 hours, and let's be honest, board games have made a very significant comeback recently, and the crowds it has attracted is hardly small.  It would make great sense to kick you out so they can do more business because you can't keep hogging their tables for the price of a single sub-$4 drink.

However, I think to some extent, it lacks a bit in the sense that you do feel rushed to be kicked out.  It is a small store, and definitely not well-suited for something like this especially when people tend to call up a lot of friends to hang out together all at once.  The layout is not quite meant for relaxing with friends, but are more for stiff dinner with relatives you don't know very well.  All of this added together isn't exactly as welcoming or inviting as some other places.  

This isn't as important, but they don't seem to host any gatherings to encourage more board game players to come out.  It really seems like they couldn't pull together and figure out a way to make their place more enjoyable.  It's already a tiny store, and they're geared to encourage people to play board games at their place, but they have absolutely no interest to encourage you to come back.  That is an unfortunate shame, because I've passed by recently, and they're closed.  I can't tell if they're remodeling or closed for good, but the games are all gone, and the cabinetry is all torn out, leaving only a few chairs lying around.  If they are gone for good, then it's a bit of a loss for First Markham Place, because it was showing signs of an aging population.  The mall no longer seemed to want to sell to a specific younger crowd, just only stuck with mainly selling glasses, dried seafood and Chinese herbs, jewellery, and cell phone accessories.  It has 3 convenience stores inside the mall itself, and that in itself really speaks for the lack of variety in the mall. 

I do hope they make a comeback soon, because they deserve a second chance to make a good first impression."}
{"text":"A new bubble tea place just opened up in First Markham Place replacing A Place for Us http://www.yelp.ca/biz/a-place-for-us-markham

Pretty quiet here on a Sunday afternoon as I stepped into an empty restaurant..

The decor is quite nice with high ceilings. The chairs though not really comfy unless you able to settle into one of the 2 booths.

Chrysanthemums Tea with Honey ($4.99) with free hot water refills was A-OK, 

Lambie Bubble Tea is a great place if you want to get some work done. Great if you in the neighbourhood, but definitely doesn't  worth a special trip!"}
