{"text":"My family was treated very badly here. I was being helped by an older woman, I assume one of the mangers. I asked to sample the turkey and didn't care for it. The woman asked me if I wanted the turkey and I apologized and told her I didn't care for that particular turkey. After that, she was extremely abrupt with me and acted like she didn't want to help me anymore. Another woman behind the counter asked her if I'd like a different type of turkey and the woman shrugged and said \"I don't know\". I left the deli because I felt very badly treated."}
{"text":"Their meats are cut fresh and really really good. The only complaint I have is the handling of the ground beef. I wish they used gloves to pull the meat out of the tray and not their bare hands."}
{"text":"We stopped here one day on a whim. There is a older lady here I don't know if she is a manager but she is very unpleasant. Good food but the price they charge should also include good customer service. But I can tell you from my experience that good service here cost's extra apparently. Stay away from here. Go elsewhere. There are plenty of deli's that are not as expensive and will treat you way better."}
{"text":"I drive around for work and that sometimes takes me into new yet interesting places. I was told about this place from a co-worker and one day decided to check it out. It is a little deli that does its own meat processing. I love meat so thought why not try it out.

What service!!! I was greeted right away and was serve with such passion and helpfulness. I ended up getting more than I was even looking for. 

I have used the ground beef and the Cajun sausage so far. Let me tell you that ground beef was so fresh it was ridiculous. I made it into a sauce and I had so many complements on it. I believe the freshness of the meat really made it so much better.

The Cajun sausage I made into a kale, bean, and corn saute. That sausage is the greatest! It was not salty at all. I was worried because a lot of the times sausage can really be hit or miss. This was not a miss at all. The sausage was so plump! It didn't break down when cut and really was nice and thick. It had that kick of spice to it that made the dish a lot better. I loved it. I really am looking forward to getting it again. 

I have not tried the pork sweet or hot sausage. I am looking forward to trying it because if it was anything like the Cajun or ground beef then my meals will be amazing.

I know that it looks like it is out the way BUT if you go it will be worth it!"}
{"text":"Service was strange. Young kids returning from bathroom fixing his belt behind the counter. An even younger one in the back kitchen constantly touching his hair... slicked down forward and he kept touching it. Sandwich gal had no gloves on while making my philly steak. A so-so sammy, nothing special. It took quite a while to get my ordèr.. and there was atleast 7 peeps working. Two on meats, two on sliceing cold cuts two on the register. Two young kids trying to look busy. And a couple of old timers lifting boxes and loading cars with orders.   I take it the old man started it or perhaps a second generation... this is ome of those places where you like the family that owns it. I kept it at three stars so not to effect their status. But cmon... show so respect for the ones giving you a job. Just my opinion in the fifteen minutes in this otherwise everyhing looked fresh and clean family place. Good luck."}
