{"text":"I have ordered online twice from this restaurant. Both times the bill was around $45 . Delivery was fast and courteous, but I find everything tastes the same, be it shrimp, chicken or beef; I suspect this is due to a very heavy hand with the soy sauce. My last order, the only dish that was edible was the won Tom soup.! I will not be ordering again.Sharon G"}
{"text":"Ginger beef was good, huge chunk of hard mysterious white thing in the calamari and shrimp was very \"fishy\". Also pricey"}
{"text":"I had the pleasure of having dinner with some close friends of mine at Landmark Oriental and I must say, the experience exceeded my expectations.  First of all, the ambience was classy and beautifully designed. What impressed me the most is the bathroom.  It was clean and very well kept as the bathroom is usually the key and soul to a restaurant's cleanliness. One can often tell how clean the restaurant is by their bathrooms.  The food was deliciously prepared and very tasty.  We started with their famous Cold Spring Rolls and you can tell that they were freshly prepared as the rice wrapping was soft and fresh and the ingredients inside were carefully mastered to bring a refreshing palate to your mouth.  We then had their Hot & Sour Soup and Mango Salad.  I had many Hot & Sour soups in my life but their Hot & Sour soup is top of my lists so far.  The Mango Salad was amazing!  It was refreshing and by adding green apple to the dish made it even more delicious.  For the main course, we had the Panang Curry with Chicken; Pineapple Fried Rice; Pad Thai with Tiger Shrimps; Crispy Ginger Beef and Szechuan Eggplant.  They were all delicious and had great flavors.   Their Pad Thai was authentic, as they don't use ketchup sauce but actual tamarind sauce; which a lot of Thai restaurants don't do these days.    The service at Landmark was impeccable and friendly. They truly take great care of you and making sure you are happy and satisfied. The manager was attentive and definitely made the entire dinning experience enjoyable.  He provided great service even in small little details like providing extra napkins when needed without even asking for them and making sure our waters are filled at all times.    For a small family owned type of restaurant, Landmark surely knows how to impress in all areas and they indeed won my friends and I over.  I am looking forward to going there again and try more of the other dishes!!"}
