{"text":"Langolino's has everything to love, except for the food... 

The restaurant is very cute and cozy with great ambiance.  We arrived early, and were greeted by the chef who informed us of the specials and helped my dairy-adverse dining companion to navigate the menu.  

I ordered the gnocchi and asked for arrabiata sauce instead of the tomato-cream listed on the menu.  After eating the dish, I suspect that they gave me the tomato-cream anyway because there was not a hint of chilli spice and it was a little bit creamy.  It wasn't bad but it also wasn't particularly flavourful.  The pumpkin pie that we had for dessert was also tolerable but not memorable or really all that fresh.

That said, the restaurant atmosphere is great: not over-crowded, great service and you can actually have a conversation without yelling or straining to hear.  They have a nice selection of martinis and wine is reasonably priced at $15 for a half litre.  It would be a great place to share a bottle with a date and may warrant a second chance before I write it off --maybe for that $3.99 breakfast that Sarah M. mentioned?!"}
{"text":"My husband and I have discovered the great brunch at this place. Right now they have a $3.99 breakfast that includes 2 scrambled eggs, potatoes, fruit, and toast. It's a tasty meal at a great price.

We've gone several times since finding this great deal and each time we've been happy. The servers are attentive and friendly. The food is good and the ambiance is great. I love the ever changing music selection. It's so far been very much in my wheel house.

We've only been once for dinner. I had a pasta dish and my husband had a lamb special. He loved his dish. The lamb was well cooked and the accompanying pasta was a good fit. The portions were plentiful and just what he wanted that night. It's been a while since we ate dinner there, but I believe I had tortellini. It was tasty and I liked that they allowed me to add a side of their vegetables to the pasta. Added a bit more to an otherwise simple dish.

The only negatives is the one time our breakfast potatoes had obviously been sitting in the warmer too long, noticeably reducing the yumminess of the potatoes."}
{"text":"A hidden gem of Little Italy. Superb food and awesome wine selection. The service is warm and very un-pretentious. The ambiance is cozy, romantic and inviting. Great for a date or a nice dinner with friends. Highly recommended."}
{"text":"Okay, so perhaps this beautiful little restaurant does not deserve a Woohoo (5 stars) but 4 did not feel to be enough..

As my 'march break' or 'reading week' drew to a depressing close, a classmate and friend of mine decided to try to brighten the dreary assignment-filled week with a late-night dinner, which is one of my absolute favourite (albeit unhealthy) things to do. We decided on Little Italy since it is my favourite part of Toronto (okay, it ties with Kensington), and I hadn't been in so long. 

It was really chilly that night, so we were rushing to pick out someplace nice to eat. We settled on a little restaurant that looked nice and dark inside with romantic little lights flickering. When we entered, we were welcomed by a lovely little room, decorated beautifully. The young waiter told us to sit wherever we so pleased as it was not busy that night. 

It was a wonderful evening, the food tasted terrific, the portion sizes were perfect, and the bread they brought with our dinner was perfect for dipping. The waiter was incredibly kind and did not rush us out, which I've experienced as an increasingly alarming personality trait servers seem to possess. 

It was very romantic inside, this would be a perfect place to take someone on a date. I cannot imagine how lovely it would be to sit outside on a warm summer's night for dinner here.

I feel like this restaurant is a little gem that more should know about!"}
{"text":"My friend and I stumbled across this gem in Little Italy on 9pm on Friday night because it was very close to where we parked and the kitchen was open until 11pm. It's a charming little restaurant tucked away on Clinton just north of College St. We were drawn in on the 3 course $25 fixe prix menu that is available every night of the week. Even though we didn't end up ordering that, we were very happy with what we did order - the potato gnocchi in a rose sauce that was enthusiastically recommended by the waitress. Throughout the evening we were checked in on by the Maitre D' who beckoned us in at the door. We stayed there for 3 hours, catching up over tea and wine, and were never once hurried out. 

The restaurant is small with a very intimate decor and I can see this being an excellent place for a date. There was live music by the bar which added to the charming atmosphere.

Granted, the menu wasn't terribly inventive or exciting - it consisted of pasta and a few main dishes (that also comes served with pasta), but the prices were reasonable - $15 for most pasta dishes, and mine came with 3 huge tiger prawns.

All in all, a charming spot for dinner in Little Italy!"}
{"text":"I had been to Langolino for brunch before, and it was quite good, but the service wasn't great.  We were seated on the patio, and had to get up to go inside to retrieve the bill after waiting for 30 minutes.   

When I heard my best friend was planning her birthday party dinner and drinks at Langolino, I was skeptical at best.  As this was my first time dining inside the restaurant, I took notice of the decor.  There was an eclectic mix of prints on the walls that looked like they were more suited to a hotel room or a garage-sale bin.  There was one beautiful red pillar candle on our table, but it's charm was reduced by the tealights in random holders scattered on the rest of the tables.  There seemed to be little unity in anything.  The kitchen pass-through is open to the rest of the dining area, and the bright fluorescent lighting from the kitchen bleeds out into the ambient lighting in the dining room.  I found it distracting.  The best feature of the decor are the wooden panel windows that line the front of the room.

I had looked online at the wine list before arriving at the restaurant, but when I ordered the wine I had seen, I was told they didn't have it anymore.  I might be picky, but I think it's important to keep your online menu updated.  The food was hardly impressive.  The menu was so standard, so boring, I couldn't understand why they felt justified charging those sorts of prices for the same selection I get at Boston Pizza.  Many of the guests ordered the Tri-colour Tortellini.  When it arrived, the portions seemed insanely small for an entree.  I wondered if maybe they ran out of tortellini, and had to split whatever they had left between the people who ordered it.  When I saw the other varieties of pasta arrive at the table, the portions were almost double, so I figured something had definitely gone wrong.  I had a warm-mushroom salad that was very bland, and used regular button mushrooms.  I think it would have made more sense with sliced portobello or shitake.  I spoke with another guest having the fettucini alfredo, and he remarked that he made better pasta himself at home.  My best-friend's future sister-in-law was slowly picking at the salmon she ordered, saying it was over-done and rather dry.  She also said it had very little seasoning to it.  

When I ordered dessert, the waitress came back and told me they were out of 3 things on the dessert menu.  I asked her about their creme brulee, and whether she thought it was good.  She replied that it was \"store bought\", and preceded to tell me that many of their desserts were.  When you're charging upwards of $6 for your desserts, it just seems wrong.

There were a few service issues.  In the beginning, we actually saw two servers fighting over our table, even though we could have used two servers working together to ensure things went smoothly.  It seemed to be over tips.  We had quite a large party, so some delays are expected, but we had reserved 2 additional tables besides the big long one we initially had, as we had some guests arriving late.  However, a party of 4 came in before our remaining guests did, and we observed a waiter remove one of our guest's coat from the back of a chair at one of the tables, hang it up, and then seat the party at the table we had reserved.  Our late guests arrived shortly after, and had no place to be seated, putting the host in an embarrassing spot.  By the end of the night, our bill totaled close to $700, which is fine, but when you've spent that kind of money you don't really expect that the staff will try and rush you and your large party out of the place 45 minutes before last call.  Granted, the birthday girl was young, 22 that night, but many of us were 30+ and didn't appreciate being treated like a bunch of teenagers.  

Bottom line, the food was not very good, the presentation even less so, and the service will make sure I will not be going back."}
{"text":"Food: we had pasta gnocchi and rigatonio was pasta ok- sauces however where to be one tomato creme, mine was a vodka some how they tasted they same bland... We had to ask for chill flakes to at least add flavour. Meh food
Location great - patio nice , service good. Not to noisy.

Come for drinks, I would not come for the food - to many other choices"}
{"text":"Last weekend my friend and I decided to go bar hopping on College street.
We ended up coming here because they had big tv's outside with the Fifa soccer game and a small patio.
We grabbed some seats outside and were quickly served by a very nice gentlemen! 
The drinks were fine we just ordered a beer and vodka 7. 
The restaurant from what appeared to be was very small.
I think the food menu was Italian..
The service was great!"}
