{"text":"I don't generally go for the sort of fare offered at this restaurant: burgers, fries, poutine, meatball subs - we were just swinging by here to get some Ben and Jerry's (sold by the pint, FYI).  That said, poutine is my Kryptonite and we succumbed to ordering a small (split between two people was enough for me) - the large poutine comes in a size of metal takeout container I didn't even know existed, easily 10\" in diameter.    The poutine is good (a respectable 3/5), they use grated cheese curds, which is blasphemous for some, but the fries are hot and fresh (could be crispier). Gravy is average. I wish I wouldn't turn into a human balloon if I ate one of their meatball subs because I watched one being made while waiting for a poutine and I swear to god it looked like something sent down from heaven. Well over a foot long, melty cheese, meatballs, tomato sauce.   The kitchen is very clean and efficient and the service is fast. Don't hesitate to try it."}
{"text":"Great mom's and pops place in the area. Have tried pizza and some sandwiches at this place and like them a lot. But what I like the most is poutine more precisely chicken poutine. So everytime it's late and I want something deliciously bad I go there. For prices,  comparing to other places they are cheap for the quality you get."}
{"text":"TERRIBLE PLACE!! Took 20 mins for the food to be ready and it wasn't even accurate order!! And on top of everything only cash, they dont accept interac debit or credit cards!!!  I asked for a chicken hamburger and a beef hamburger specifically the chicken with fries and beef burger with poutine. The gentleman at the cash suggested the steak hamburger which got me confused since steak burger is gravy on beef patty. Which he did not specify. He even asked twice both all dressed? Cost 30$ and the order wasnt even right and took forever.  NEVER COMING BACK!!"}
{"text":"This is one of the best examples of Montreal pizzas, poutines, subs and all things good you will find..... anywhere!"}
{"text":"Not gonna lie, it's a dive... the location in major need of upgrading and cleaning. Definitely a greasy-spoon.. Having said all this... the staff and food are AMAZING! Makes it easy to overlook the flaws."}
{"text":"I love the location on the river. My favourite menu item is the Lasalle special sub. Try it!"}
{"text":"Nice little diner that's just on the bike path by the riverside, offering a nice view. They offer standard American-style fare with burgers, subs, sandwiches, pizzas and poutine. Nothing really outstanding in terms of signature-style items.  Do they cater? Yes and no. They can do bulk orders and they deliver, but as for an actual catering service, I don't think so. You'd have to talk to the owner.  Do they accept credit or debit? Yes and no. The counter only takes cash, but they have a mini ATM in the back. Too bad for those of you looking to avoid service fees or rack up rewards points.  As an aside for comic book and figurine collectors, Johnny the restaurant owner is the co-proprietor of Expert Comics in the Carrefour Angrignon shopping mall at the other end of LaSalle. He also has an annex store on the top floor of the restaurant. It's a mini warehouse up there, with long boxes full of comic books and shelves with figurines and statues. You can't access it from outside, you have to enter the restaurant and go through the back door past the restrooms and the ATM machine, then turn left and go up the stairs. They're typically open until 4:30PM."}
{"text":"Club sandwich was terrible I asked for bacon well done it came pretty much raw and it said on the bill \"WD\" not impressed I orderd two sprites never got it.  They don't accept debit or credit when you use delivery.  -update- Came within 20 minutes 2 salads.  Twas excellent"}
{"text":"For a diner that doesn't accept debit or credit, doesn't have wifi and has the most boring decor in all of Montreal, everything is extremely over priced. Their fountain drink options are no good.  We ordered a smoked meat sandwich combo which was actually just a thick piece of ham with cheese and mustard. The overload of fries was completely unnecessary but I feel it's just to justify the price. This combo was $15 (with tax)!?  I'm appalled and very confused at how this post only has 1 dollar sign. Don't be fooled, this restaurant is simply a landmark because of how old it is. The food wasn't great, they're very overpriced, and the employees weren't bubbly to say the least."}
{"text":"Been coming here for years from Toronto to Montreal. This restaurant has the best pizza and steak subs that you can find in Montreal! made fresh, and never a disappointment. They also have a secret sauce with the sub that is a must try!"}
{"text":"Stopped off for a quick little snack and ordered a poutine. It was very good but nothing special. Good service, great location but man was the place extremely warm.  I believe further testing (eating) is required so far now, 3 Stars. I am sure it has been said before but just to make it clear cash only."}
{"text":"When I'm hungry after school and I want the best pizza or a hamburger that's the first place  that I think of its this restaurant."}
{"text":"Okay place for fast food. Pretty pricey and they don't take debit which sucks. Love the poutine here they put lots of cheese which is a bonus for cheese lovers. Clean inside and fast delivery when ordering from home. Considering the fact i live almost right beside, overall its a pretty decent place to grab a burger and fries"}
{"text":"Premièrement le spécial peters sauce à orange c'est un must, (juste trop bon). Très belle emplacement sur le bord de l'eau. C'est un fast food c'est pas idéal pour un souper romantique. 7 /10"}
{"text":"Came by yesterday as I was out on a long bike ride and I happened to be close by at around dinner time. The view is even better now than it was before. There used to be very tall bushes and brambles right along the riverwall which have now since been cleared and grassed over, so you can literally sit right over the river now. Try to come around sunset, with the setting sun behind the Mercier bridge, the river swiftly running by and the best time to catch pike and other fish jumping out of the water if you happen to look at the right spot at the right time."}
{"text":"Everything you need late at night. They close at 1am, so if you crave a pretty good poutine Lasalle is the spot."}
