{"text":"Le Petit Laurea is the bar right under restaurant Laurea on Laurier. It is now as well known but also deserves to be famous. Not as fancy but as delicious in my mind. Great for a more casual night out. Check out my review of the place: http://delifeed.ca/2015/10/25/cosy-57-at-le-petit-laurea/"}
{"text":"Laurea used to be The place to recommend for those who could appreciate a good restaurant.  Well, not anymore. Even the best restaurant with the best food becomes mediocre when the service is bad. Though the restaurant  wasn't full, the waiter didn't show up till one of us went to the bar to ask someone to bring us the menu. The rest followed in the same terms. The guys which were
 just serving the food were much nicer and professional then the waiter which was responsible for our table. On top of all at the end we found a \" mistake\" of 120$ bottle of wine in stead of 40$. I felt embarrassed in front of my 4 colleagues whom I brought to the \" awesome new restaurant\". So in stead of having a nice dinner we left rather upset ad annoyed. Will I recommend this place again? No."}
{"text":"Excellent repas! Et très bien conseillé pour les vins.

Il y a aussi d'excellents cocktails pour l'apéro.

Le décor est feutré ce qui permet de passer une excellente soirée entre amis."}
{"text":"If you're a fan of high-end and precisely prepared food, this is definitely the place to try out at least once in your lifetime! However, if you go there in hope to satisfy your endless hunger, you'll probably end up deceived.
I definitely recommend you try out Laurea at least once just to experience the beauty of the place, the outstanding service from the staff and Chef Chajar's modern cuisine."}
{"text":"We love the chef Akim (from les chefs show), very good at what he does.

Very clean and delicate food- but clearly not enought in my plate. Prices for the dishes are between 22$ and 30$. I left hungry.

Good Wine (average 12$ per glass).

But still the restaurant is so beautiful and the service is very complete. Many Many staff. I am not sure i will go back.
Their bar: lorbeer is a better choice for value with also an excellent quality!"}
{"text":"A real gem that I am surprised has not been more widely reviewed and praised! The food was outstanding, and it was easily one of the best meals we had in Montreal (different, and better than other places that are highly regarded like Liverpool House).

We tried the foie gras and the scallops to start, and both were excellent.  The foie gras is served with a lightly buttered, airy brioche that was just perfect. For dinner, we had the halibut and the black cod. Again, both were delicious. The black cod is served with shrimp dumplings that offer a little more depth to the plate. The halibut was cooked beautifully, and balanced perfectly with artichokes, brussel sprouts, and a glaze of hazelnuts.

Really outstanding restaurant, cool design inside, and memorable ambiance. A very nice buzz downstairs (where there's an old timey piano and someone playing it) and a little more trendy-feeling upstairs. Will definitely be returning if/when we make it back to Montreal!"}
{"text":"J'attendrais aussi un peu, mais en soit le restaurant est super beau, la bouffe est très bonne avec des produits de grandes qualités. Bravo. Bon resto!!"}
{"text":"Excellent service, belle ambiance.  Cependant, je vous conseille d'attendre un peu, le restaurant semble encore en rodage. J'y retournerai"}
{"text":"Endroit magnifique: chic et bobo.
Service impeccable. 
Les raviolis en entrée sont parfaites. 
Les pétoncles avec la sauce d'agrumes extraordinaire.
Le canard: merveilleux. 
Les desserts plus que gastronomiques. Ce sont des goûts à prime abord qui ne vont pas ensemble, mais le mariage est parfaitement réussi! 
À chaque plat, il y a une touche de wow."}
{"text":"Much anticipation as we finally found a night to try out this newish restaurant opened from a partnership between a member of simple plan and Chef Hakim (runner up from Quebec's version of master chef). 

The decor was very well thought out. Bar on the main floor, restaurant on the 2nd floor. Open concept dining room with the kitchen in full view and another central bar station right in the middle. There were seats at both the kitchen and at the bar which could allow guests to meet the staff in a more personal way. 

Service started out a bit with a hiccup as our table was not ready. However, the waiters were very accommodating and made sure we were attended to at the bar while waiting. 
Great selection of cocktails and wine by the glass. We opted to try a bottle from our waiter's recommendation after telling him our choice of dishes. He seemed to know his wine list fairly well but we unfortunately didn't enjoy the wine he had suggested. (A bottle of Pinot from Finger Lake NY, highly reviewed as I did some research afterwards, but a bit disappointing since we were told that the taste was similar to a Pinot from Burgundy which was not the case).
 
As for the food itself, we ordered from a short yet quite complete menu.
For starters we had the scampi raviolis, lobster bisque sauce as well as the risotto with rock shrimps, basil butter and celery-root in its appetizer size. 
The ravioli was good but not memorable, the bisque was on the heavier side and the lobster got lost in it.
The risotto was very tasty; the use of celery-root in its base definitely freshened it up and paired well with the fragrance from the short grain white rice.

For mains, we ordered the roasted scallops with cauliflower, dried duck, lentils and
orange-curry dressing and the piglet from Gaspor served with sweet potato, nappa cabbage, cromesquis, mushroom relish and five spices glaze.
The scallops were cooked perfectly, very much enjoyed everything on the plate but did not taste at all the curry. 
My boyfriend, being the bacon lover he is, really enjoyed the piglet. The skin was really crispy and had a thick layer of fat underneath (a bit too thick for my liking). Again everything paired well together but I can't say I could distinctively taste each separate ingredient. 

The dessert course highlighted yet again their creativity. All the items listed mix sweet with savory in combinations that almost make you hesitant to try. However, do order dessert! The odd combinations were excellent. The rosemary mousse with little black olive cookies was divine! Best dish of the night for me. We also had the lemon onctueux with dill and fennel but the lemon overpowered the other ingredients (it was good but tasted like a lemon sorbet, not velvety smooth as the description made it seem). 

All in all, it was a quite enjoyable experience. All the dishes were enjoyable and some surprisingly unexpectedly good. However, they could be a bit more bold with their flavors overall. Seemed like they wanted to kick up the creativity by mixing unusual ingredients together but tiptoed a bit around it. Total came out to just over 250 with tax and tip. Not a given, but worth the splurge once in a while."}
{"text":"Excellente soirée au Laurea hier soir! Je m'y suis rendue pour célébrer mon anniversaire avec mes amis et j'ai eu un super moment! En arrivant, l'hôtesse nous a accompagnés à notre table. Très belle surprise en arrivant: pour mon anniversaire, on nous avait réservé la table 'cuisine', ce qui veut dire que nous étions à côté des cuisines, dans un espace où il n'y avait qu'une table. On était donc isolés du reste du resto et c'était très cool! C'est certain que le fait d'être à côté des cuisines fait en sorte qu'il faisait plus chaud, mais comme l'espace est tout de même ouvert, ce n'était pas tellement dérangeant. En apéro: un Pimm's Cup pour moi et un Dark & Stormy pour mon copain. Les 2 cocktails étaient très bons. Ensuite, les entrées. J'ai dégusté la terrine de foie gras avec purée de dates, orange et fenouil (et bien sur le pain brioché!). Superbe entrée! Mon copain a pris les sashimis de dorade: WOW!! Tellement doux, délicats et savoureux à la fois! Un must! Des amis ont dégusté le velouté de choux-fleur. Ils ont ADORÉ! En plat, je me suis régalée avec l'agnolotti aux courges, lait de sauge, noisettes et ricotta. C'est un des meilleurs plats que j'ai mangés dans ma vie, rien de moins. Absolument rien à dire, sauf que j'en remangerais dès maintenant!! Le risotto aux betteraves, chèvre et estragon, a été bien apprécié aussi. Le faux-filet de boeuf était aussi très goûteux, de même que ses accompagnements. En dessert, nous avons opté pour l'onctueux au chocolat au lait et son parfait glacé à la coriandre. Sans vouloir faire de jeu de mot, ce dernier m'a laissée de glace, mais le reste du dessert était très savoureux. Nous avons passé une super soirée au Lauréa grâce à la nourriture parfaite, au service chaleureux et professionnel et à l'ambiance privilégiée à laquelle nous avons eu accès grâce à notre table 'VIP'. À essayer, et réessayer!!"}
{"text":"A breath of fresh air for the Montreal food scene. 
The restaurant space is an open kitchen concept with a counter, bar and nicely spread out tables. The atmosphere is very relaxed with a hint of upscale. 
The food is good, more on the refined side. The dishes combine imaginative flavours and textures - most of which are a hit with, like any restaurants, very few misses. (Yes, I have tried all dishes on the dinner menu)
What makes this restaurant for me is their service. It is unpretentious and friendly, from the hostess to the wait staff to the busboys. 
The only critique I have of this place is their dessert menu. They play a lot on savory/sweet which is not my cup of tea. At this point, it is only a matter of personal taste.
Been there over 5 times, will definitely be back."}
{"text":"Went for a work dinner and enjoyed it. Not outstanding but very solid (at the low end of 4 stars).

I had: (1) the terrine foie gras appetizer (good but not memorable), (2) the sea bass dish (excellent), and (3) the rosemary mousse (so excited to order this because I love herbs in deserts, but was disappointed w/ the taste of the final product).

Broad remarks: on apps and main dishes, everyone at the table was happy. At the time of our visit, deserts all seemed inventive and had all of us quite excited. Alas, the final verdict on these dishes were hit or miss. Everyone agreed that the rosemary mousse was a miss (generally bland w/ the dishe's highlight being the candied olives). The milk chocolate onctueux seemed to be the best of the bunch.

The restaurant itself is beautiful. It has a bar downstairs that seems like a nice hangout (it's equipped w/ a piano!) and a dining room upstairs which is stylish-casual in its decor. The service is friendly. One remark: if you like dining in peace, I recommend eating here early before the bar-crowd starts playing the piano and singing. I liked this but some folks surely would not.

Overall, this was enjoyable and I'll come back. However, it's not a high-frequency repeat or a strong recommendation (like, say, Bouillon Bilk)."}
