{"text":"Had lunch here today, loved the place and the people. This is a hidden gem! Will be back often!"}
{"text":"Love the food here! Burgers are excellent! So happy to have Laura's here in fountain hills. *****"}
{"text":"This is a hidden little restaurant/bar that serves as a neighborhood go-to place.  It is surprisingly dim and plain inside, but had a nice variety of booths and larger tables besides a bar with TV.  My friend and I both ordered lunch.  She had a patty melt and I had a roast beef melt.  Our onion rings on the side were very good.  She was surprised that the sandwich was grilled on the inside buns and not the outside. The server maintains that's the way they cook them and he could get her another bun if she wanted, but did not offer to warm or grill it. I thought she was picky but when I started in on mine, my bun was cold with the warm insides of the melt. Like the cooked portion was slapped on a bun just taken out of a package. When I do any sort of bun thing at home, I always warm the buns.   Also, the mushrooms were canned, not fresh and had a rubbery taste.  I left most of them on the plate.  Not cheap, the drinks were $2.50 and sandwiches $12-ish.  Substituting anything for the fries was $1 extra.  It was decent food, but not for that price."}
{"text":"Another visit found Laura & Robert with an evening off. Jeanna and Randy did an excellent job handling things. She is an excellent waitress. We took a friend who had not been there before but lives in area. She enjoyed the stroganoff and my wife had salmon on a salad with Thai sauce. They were very happy with their choices. I had the special, the briscut and was very disappointed. It was dry and not very fall apart as I like briscut. Would not order again. The veggies were great. Will return next year when we visit Fountain Hills again."}
{"text":"There's nothing quite like homemade sauce and meatballs (on spaghetti!) to pull you out of an emotional funk! I originally drove to Fountain Hills to see some nice views. While stopped at the 4 Sons gas station, I asked the kind folks behind the counter if there was a local spot that made home cooked meals (the opposite of fast food). Laura's Place was the spot that was first recommended. It is off the beaten path, in a quite part of town, which I liked. Once inside, I was greeted in a friendly way, and promptly attended to. The special of the day was the spaghetti, and it was available at a great price. Love at first bite, and second, and fifteenth. I didn't make it to the end of the bowl, but I tried. And, I will be back again for another attempt at their delicious food which tasted like it was made with love."}
{"text":"I  just discovered Laura's Place while having breakfast at another restaurant Laura owns called Flapjacks. As soon as I knew it was her place I just had to try it.   I have to say that it definitely lives up to the high standards set at Flapjacks, but here Laura isn't always cooking so she can come out and socialize.   The atmosphere is really friendly. Very casual and family friendly. Bikers are welcome too as Laura and Robert both ride.   The food is excellent, and made with fresh ingredients. Nothing packaged here. I had wings, cooked just right, pork tenderloin with mashed potatoes and zucchini with a nice brown gravy. The pork was nice and juicy, the breading was nice and crispy but not at all heavy or greasy, and the veggies were done just right.   Of course I had to have the home made peach cobbler, and it, as I expected, was outstanding.   So come on down for a really good meal, at a reasonable price, with friendly and efficient service.   See you there!"}
{"text":"Love having a place like this in Fountain Hill's.  Home style cooking and everything is fresh and from scratch.  Awesome burgers and fries, meatloaf, breaded chops and so much more.  Lovely atmosphere, extremely clean, nice bar and very friendly owners who care about their establishment.  We have been twice and both times the food was great. Not bar food like so many places in Fountain Hills.  Excellent!"}
{"text":"This restaurant was formerly Jimmy's Krazy Greek Restaurant.  Decided to give it a whirl.    The menu is kind of limited, having about 10 items listed on it.  I had a craving for a burger, so I ordered a cheeseburger, that had a poblano green pepper on it.  It was very satisfying.  I liked that the sides that came with it were different than the usual fries, they had a \"potato of the day\" which were rosemary potatoes, and some steamed veggies, both were a nice complement to the burger.      The ice tea I ordered was very bitter, I had a few sips, and wished I had stuck with plain water.  There were a few dessert items on the menu, but they were 7.00, too pricey.    The interior of the restaurant is bland, needs some decor to brighten it up.  Seeing as how it is a new place, they're probably still setting things in order.      The owners seemed very nice, and were chatting with the patrons.      There is a bar inside the restaurant."}
{"text":"Nice place and friendly service.   We had the pork medallion special.  The veggies and mashed potatoes were perfect but the pork was a little dry; either over cooked or under marinated. We rarely get dessert but the skillet cookie sounded good to my hubby so we shared and it was really good.  We will go again.   Three stars as no good craft beer, fat tire was best they had."}
{"text":"Is this Great amazing company very laid back with the attention to detail overlooked because of location"}
{"text":"Yelp says they open at noon but they don't open until 3pm.  Went for lunch and they were closed."}
{"text":"What a little hidden gem!  Homemade everything!  From their meatballs to their beef brisket to the amazing Reuben sandwich and let's not forget Homemade smashes.  We will be back"}
{"text":"Found this hidden treasure on Yelp because we were in the mood for something different than the same old lack of good restaurants in Fountain Hills.  And, thanks to Yelp, we have discovered a fabulous restaurant.  The food was incredible, the customer service was even more outstanding, so excited to have another choice for an evening our in Fountain Hills. We highly recommend Laura's and will be back!"}
{"text":"Very simple yet cozy restaurant, a true hidden treasure, probably the most welcoming place I've ever been to. As soon as I walk in I feel like part of the family. There is a good variety of home cooked meals here with lots of flavor. This place would be a good place to bring family and friends or any visitors coming in."}
{"text":"This place definitely needs a face lift.  It is very depressing place, it looks like a warehouse with empty walls and just thrown together.  No one cared for the area or the place.  Needs a make over, very boring.  I was surprised how expensive the food was for the amount you receive.  The food is good but the prices are way expensive.  There are much better places to eat in town with quality food and less expensive.  I had the burger which was smaller than I am used to, while it tasted good, it was not worth the $10.00 price tag. We were not informed they had dessert and not given a dessert menu but there is an ice cream place right next door."}
{"text":"We came in for lunch. We were seated right away with a smile. I am beyond limited in what I can eat and so is my husband but the people here are patient and understanding so we each found good things to order with the waiters helpful suggestions.   Fresh and reasonably priced food. My burger was beyond good, not some frozen patty thrown on a bun, and it was a healthy portion too. The salad was fresh and the dressing was a home made creative chef concoction. So good!  My husband had another salad with chicken and some amazing pepper infused ranch. He said it was tasty.  While we ate, the owner came by just to say hi and chat for a moment. I appreciated her friendliness.   Overall, 5 stars for food, atmosphere, and price! We will have to stop by and check out dinner one of these days."}
{"text":"We were very disappointed with our experience, as we enjoy eating at her other restaurant and expected a lot more.   The décor is minimal, at best; in fact, it is very depressing.  Definitely, doesn't look like it belongs in Fountain Hills.  As far as the food, it was O.K., nothing special at all....may even call it mediocre.  Unfortunately, we will not be returning."}
{"text":"Phone ordered a cheeseburger & fries to go.  The bun & burger were grilled, lettuce was fresh romaine, ripe tomato, & onion.  Burger perfectly cooked medium rare!! Fries lightly crispy & scrumptious!!"}
{"text":"Had our first of many more meals at this wonderful find last night!  Laura took the night off to fix her husband dinner at home, but her hubs, Robert was there and gave us excellent service! Kind of off the beaten path, but well worth finding.  The food was delicious!  All home cooked and just oozing of comfort! I had the beef Stroganoff which was excellent.  Perfect flavor and brought back memories of mom's cooking!  Hubs had the Rueben and tator tots smothered in Green chili Pork sauce that was to die for!  We had them add some jalapenos for more heat and it was perfect.  To top it off, we had a huge brownie ala mode that was the best, that Laura made. This is our new favorite place to go and we look forward to many more great meals in this darling little gem in Fountain Hills.!!!"}
{"text":"We love the place! Amazing meals like mom used to make. Brisket, Pork Chili, Fish...it's all amazing, and they really treat you like a guest. We just moved close by and have been there 3 times already.  Love it."}
{"text":"Definitely a little gem in a quiet part of town. Very friendly! Laura & husband Robert are amazing cooks! Everything we have had there was excellent! They do things special for you if you add as well. A rarely seen thing in restaurants these days. If a sandwich is the special, you can ask them to make it a dinner plate instead.  Dessert is just delicious...awesome! I heard there was karaoke on Thursdays but not sure as I have not been there on a Thursday yet. I wonder if that is just rumour because they are only open till 8 pm. Have to find out so we can go on that night with friends. This is a must place to visit while in Fountain Hills!"}
