{"text":"French & Asian Fusion, Chef is from Le Cordon Bleu, every dish twisted with traditional French and Asian"}
{"text":"Pretty new but can feel chef's enthusiasm about the food. Great taste and decent portion."}
{"text":"This is a great addition to Calgary's restaurant scene. The décor is bright and modern and most of all I love the chalkboard paint they've used on some of the walls. The main one is an instructive one on the various cuts of lamb, pig, beef, fowl, and fish. There's another one along the corridor to the washrooms to satisfy those of us who never lost the urge to write on walls. They have very sensibly included a fairly roomy vestibule that will prevent the drafts from coming in during the winter months.  They offer a great lunch deal $21 for 3 courses. You get to select an appetizer and an entrée and dessert is the petite four of the day. There are 4 selections each for appetizer and entrées. Appetizers range from $6 to $10 and entrees from $15 to $18 so it doesn't take a math genius to decide to opt for the deal; even with the cheapest appetizer and entrée you still save as you get dessert for free. The entrée of the day was pasta with creamy mushroom sauce. My companions and I tried the Roasted Squash Soup, Chicken Galantine, and Thai Chili Calamari. The Thai Chili Calamari was delicious, the salad and vinaigrette a perfect companion to the slight spice of the calamari; the calamari was cooked to a perfect tenderness. Each mouthful left you wanting more. My friends all gave thumbs up to the other appetizers.  This is my first encounter with anything sous-vide. The patty was about 1\" thick, gently coated with a tangy BBQ sauce, and topped with a couple of thick slices of bacon, lettuce, and tomato. This is a knife and fork burger, there is no way you can pick it up and chomp down on it without making a major mess. The only thing I found is that it could have been warmer but then it's cooked sous-vide. I found it hard not to make a mess. The burger is served on slicing boards, artistic but not practical as it was easy to have food slip off as the dish was completely flat. Each element of the burger complements so you should make sure that for each mouthful you get a bit of everything. Dessert was a trio of petite four consisting of a pavlova, lemon tart, and a raspberry bavarian. The desserts were good but not extraordinary. My favourite was the lemon tart as it had the most flavour.  Presentation of food is par excellence here. Meticulous care is given to each plate and dish. Our server was very pleasant and friendly, conscientious and took pride and delight in the fact that we enjoyed our food. Prices are reasonable for what they serve: $17 for a sous-vide burger. Parking can be a bit of a nightmare as it's right on the main block of 10 St in Kensington and one entire block of parking was lost to construction the day we went. There's street parking most of the time and some pay lots within walking distance. Lava Dining is not your average brunch/lunch place. They have features served after 5 p.m. such as sushi pizza, charcuterie of meats made and smoked in house, and in house made ice-cream. I'm definitely going back to try the dinner menu, I think the food is worth it. Executive Chef Jason Chen certainly adds an exciting Asian French fusion cuisine to the Calgary food scene."}
{"text":"Been here twice. For brunch I tried their Chicken Galantine, baked mac 'n cheese with mussels and scallops, and a mini dessert trio. It was so good that I decided to come back for dinner a week later: calamari, Brome Lake duck, and a brownie dessert. They may be new, but they're already on my list of new favourites to explore further!"}
