{"text":"Drinks are ok; but food is terrible for the price.  We had to leave the place because we can't stand the greasy smell coming from the kitchen.  And with no service, they still charge 15% for party of six.  Would not recommend to have food there."}
{"text":"The passion fruit green tea was pretty delicious. I can't say I enjoyed the food a whole lot (except the yam fries), though the only time I have eaten here is at an event where I didn't get to choose the dishes and they were predominantly deep fried dishes. My friends enjoyed many of the dishes though--I think it might be personal preference."}
{"text":"The Taiwanese fried chicken here is the best in town! They also have a lot of other Taiwanese cuisine like pulled chicken with braised pork on rice, deep fried corn, and chicken leg bento (a chicken leg with rice and vegetables). For the adventurous, they also have chicken hearts on a stick. (Don't knock it until you've tried it!)   I wish they used good pudding instead of powder pudding but I've liked all the bubble tea I've gotten here. They have other choices besides tapioca like coffee jelly and grass jelly. This is where I go when I crave some Taiwanese food. Their original milk tea is the best! My favorite bubbletea place besides Try Again."}
{"text":"Lazy Monkey, an small Taiwanese bubble tea joint across from Sir Winston Churchill High School and between what used to be a Mac's and a Canadian Pizza Unlimited.  AMBIENCE/SERVICE: Small restaurant with about 4 or 5 tables and limited seating. Most people tend to just order a bubble tea for takeout and the crowd is predominantly high school/college aged Asians. Nothing special about the service, but it can be hard to get service as a sit-down patron when they are constantly taking takeout bubble tea orders. 1.5/2.5  FOOD/DRINK: Good selection of bubble tea in terms of slushes, smoothies, and milk/green teas. I've had the milk tea with pudding, taro smoothie, almond smoothie, and traditional milk tea and they've all been pretty good by Calgary's standards but nothing to write home about. I tried the double Q once but the jellies were quite chewy. The food is more of a mixed bag. Their Taiwanese chicken is their speciality and probably best dish. Don't expect too much when you order their mains. 1.5/2.5"}
{"text":"Went here for the first time a couple weeks ago and was pretty disappointed. The bubble tea was okay, but the food and service was poor. The waitress did not acknowledge my husband and I once from the moment we walked in. We sat ourselves and she dropped some menus in the table without saying anything and walked Away. She came back a few min later to take the orders, again not saying anything just stood there with a notepad to write down the order and walked Away. Same thing when she came back to drop the food, said nothing just put it on the table and walked away. If you are working customer service, you need to work. That includes smiling, greeting customers, saying please and thank you. Basic customer service retraining would be a good idea."}
{"text":"Friendly staff, very tasty bubble tea & food. Their pearls taste really chewy and delicious compared to other bubble tea places. I think that they have the best wintermelon tea and oolong milk tea in town! Taiwanese Deep Fried Chicken is also delicious. I love coming here with friends on weekdays, weekends can get pretty crowded due to lack of tables/space."}
{"text":"This is one of my favorite place to get bubble tea in calgary. I would give a 4.5/5 for their milk teas. They have a very good collection of tea and jelly. I love their lychee jelly with non authentic tea ( try it with mango it goes very well ).   The place is well decorated and have a friendly good vibe to it. But, when it comes to food be really careful on what do you order. Fried chicken and tofu are good. But, their take on other dishes and casseroles are not inspiring and upto the standards. There in which they loose points.  If you live in the neighborhood a good place to go have munchies and bobo on weekend night after 10.00.   I will recommend you to stick with traditional milk teas and taiwanese appetizers."}
{"text":"We went in for a late night dinner on Friday with very low expectations since everywhere was closed - but we were impressed by the taste of their bubble tea and the rice dish that came with Mushrooms chiken and some kind of tasty cheese sauce."}
{"text":"It's alright. Room for improvement. Inconsistent service and drinks. Haven't got food in a while since the last time, food took longer than expected to come out. Highlight is cheap bubble tea...depending what you select."}
{"text":"Ordered a Taro milk tea with pearls and had only a few gulps. It was too watery with no flavor. Told the waitress right away and she said I can choose another drink. I waited for her to come back but she never did. When I went up to the cash register to pay for the bill I asked if she had taken off the taro milk tea. She said she cannot because \"they didn't make a mistake on the drink\". I believe the mistake was the drink was made terribly and I shouldn't have paid for garbage. Never coming here again and I don't recommend anyone to either."}
{"text":"Solid bubble tea and food is good too! One of my go to bubble tea places. Some of my favorite drinks: traditional and green milk teas, passionfruit black tea, wintermelon milk tea and mango paradise. With the new chains popping up, I still come here to support local family businesses! :)"}
{"text":"Too bad they don't Yelp don't have. Half star. As it should be 3.5 stars for the food. One of the best in turns of Taiwanese style snack places in the city. Plus you don't get much Taiwanese food in this city great welcome in the NW."}
{"text":"Came here after dinner the other day for some snacks and bubble tea with a couple friends. Parking was plentiful, as it's located in a strip mall type situation. The decor is very quaint and cute!  I had the champagne peach green tea with pearls, 1/2 sweet. Our other friends got the same drink but full sweetness - I tried both and didn't taste any difference? It was pretty good, kind of like a peach green tea with less sweetness (but not in a bad way). We also ordered the Taiwanese chicken nuggets ($10). I feel as though the portion could've been a bit bigger for the price, but they were really good!   They have 3 big tables or so, but otherwise not much seating. Would come back if I was in the area!"}
{"text":"I'm giving 1 star due to the service. Went on Saturday and sat down, there was only another table that was waiting for drinks. Ordered food and 2 bubble teas, got our food really quickly.  Halfway done our food, we haven't seen our drinks so I had to ask for a water at the till.  We notice that people ordering take out was getting their drinks prior to us, so we ask and was told that take-out gets priority, which is unheard of.  So by the time we finish eating and go up to pay we still don't have our bubble teas (this is 45 min later).  Finally we get it after we pay, but if there was a continuous take out line, we would never see our drinks."}
{"text":"Good for bubble tea and etc small selection of food. I find the prices are a bit too high"}
{"text":"Traditional milk tea is quite good.  The second time that I went the server messed up my order, then got mad at me like it was my fault, and the pearls clumped together so they wouldn't fit in the straw.  Trying to drink the thing was like trying to squeeze blood from a stone using my lungs."}
{"text":"I like to go here for a moment of chill time before heading back to the daily work grind. Don't go during lunch break, because students from the local high school will make finding seating hard. They have a lot of variety for bubble tea, relatively inexpensive. I usually get a side of fries. One thing i've noticed is the portion of the food you order is always fluctuating, which is frustrating. But overall the atmosphere is great. I've been going here since high school, so five or so years, and they're really putting effort into upping the decoration. it's a cozy place but it's extremely well decorated. Always clean too! Really like it"}
{"text":"The Taiwanese fried chicken is as good as everyone says it is! I was super impressed with it, as well as the curry casserole I ordered. Large portion, so it was a good value for the price.   Their teas were excellent as well. I would definitely go back!"}
{"text":"- Love the pearls here, its nice and sweet.  - Pearls portion i feel that its to little.  - Service is great when it comes to take out - Prices for milk tea cost a bit more here in my opinion."}
{"text":"The milk tea is always delicious, the Taiwanese fried chicken is awesome but every time I've ordered main course food...... I'm always disappointed.... it's overly oily and unflavoured.  So I must say, go for the apps and drinks and save the main for another spot!"}
{"text":"Lazy Monkey - A series ofHaiku Reviews by Dale E:  Oh, where can I go? I'm out of my neighbourhood and I'm so hungry.  I'm also sleepy is there a place with coffee? I need caffeine soon.  I found a small spot that is next to the high-school, I hope that it's good!  They have bubble tea! There are so many flavours! Choosing one is hard.  \"Like, he said she said...\" \"Science sucks, like omg! \" ...Don't go at lunch break.  Quick! What has caffeine? Lychee green tea, oh heck ya! I'll have one of those.  You have chicken too? I'll take the 4-piece strips, please. So hot and tasty!  Smokers by the door. Don't you have places to go? Silly teenagers.  I went alone, but it would be good for groups. They have large tables.  This place is so cute and it's called \"Lazy Monkey.\" What more do you want??  I thought it was great! Chicken, Bubble Tea, Wifi. I will like, be back."}
{"text":"I've been here twice. The first time I had a pork chop entree which comes with rice and something else, can't quite remember. The 2nd time I had the deep fried Tofu and Taiwanese chicken. The food is flavourful and delicious but also quite greasy. The deep fried tofu was unevenly spiced, this I think because the food is greasy and the spice ends up clumping on grease and so does not get spread evenly. The chicken experienced the same problem as I found some pieces much saltier than others. The servers are extremely polite and friendly.If they could cut down on the grease I probably would be back more often."}
{"text":"First time I've been here I've ordered a hot lychee milk tea without bubble. The taste it's not like the lychee but durian.."}
{"text":"Hubby and I decided to try some Taiwanese cuisine for a light lunch since I'd been making empanadas and juggling with musical commitments this past week.    The good:  my honey lemon green/black tea was the best tea I've had in a long time.  Nom, nom....  the Taiwanese fried chicken was absolutely delicious!  Wonderfully spiced and not overbattered, it's served with a bit of fried Thai basil and garlic.   The fried calamari (fairly large tentacles) was also done perfectly--nicely seasoned with just the right amount of crunch and soft on the inside.   Our server also recommended that we try the tomato and beef noodle soup.  It came in a steaming hot bowl with melt-in-your-mouth pieces of beef in a flavorful broth.      The bad: I found everything a bit pricey.  When we ordered the Taiwanese fried chicken and the fried calamari($8.95 and $9.95), they combined both orders into one serving basket (compare our photo with the photo of Linda C.'s fried chicken which fills an entire basket).  The tomato and beef noodle soup was $14.50; I was expecting a bigger portion size.             There are a limited number of tables in this restaurant (most customers usually order takeout) and the ambiance outside the front entrance is less than desirable.  There were half a dozen teenagers smoking and distributing their cigarettes to minors."}
{"text":"Probably my favourite place in Calgary for a good milk tea! Finally a decent bubble tea store that is NOT downtown! Their Taiwanese fried chicken and their chicken strips here are delicious. The Taiwanese fried chicken looked like a popular choice amongst many of the people here.  I think the pricing is reasonable, especially compared to some other bubble tea stores in Calgary. The service is quick and efficient, and I like that there are tons of parking outside.   I wish there were more seats. Also, I wish that they would make more pearls, especially for weekends. They always seem to run out at around 10pm on Fridays and Saturdays when they close at 1am!"}
{"text":"I came here with my boyfriend through a friends suggestion. The menu was fairly big including drinks. The service was decent. There was only one person grabbing orders because the place was quite small. I ordered the pork chop meal which was decently price. The pork chop was great however everything else was bland. There was some type of sauce on the rice but even that was bland. Unfortunately my rice came out cold. My boyfriend ordered the Tomato beef noodle soup. It was ok. Nothing special about it. The noodles were udon noodles and the beef was more like beef flank. The only things inside the soup were spinach tomato and beef other than the udon noodles. I would probably go somewhere else for noodle soup. We also got 2 appetizers, the Taiwanese style fried chicken and spicy wontons. The fried chicken was fairly good, crispy. They were garnished with spinach¿ on top.. and the wontons are just wontons in satay sauce. Nothing here really \"wow'd\" us. Just any other cafe with bubble tea."}
{"text":"Taiwanese chicken and chicken wings are the best here.  Traditional milk tea with 3 of a kind is great too!"}
{"text":"We wanted to try this place because of a recommendation from a co-worker. We had the  Pork and rice dish which was decent. The pork was cooked well and was not dry one bit. The rice had a sauce on it but didn't make a difference in taste, Just bland as well as the egg. We also had the Taiwanese style fried chicken. Season and cook was fantastic but we were given just two skewer sticks and utensils for this and the meat we not cut all the way, barrel of monkey's more like it. The wonton in spicy sauce was decent just because of the peanut butter sauce added. The service was decent but can't say I'll be coming back anytime soon. It was a good experience. Nothing more."}
{"text":"Nice name for a Café.   We came here for bubble tea and I got the mango slush with lychee. I have to say it was pretty good. Would be better if less sweet. I think its made out of real mango. You can taste it.   Overall. I liked it.  Lots of parking and the only fall back is the prices are more here compared to other places.  Sitting is limited"}
{"text":"Lazy Monkey?   What a name!  The story goes like this. I was craving bbtea near my bandmate's place, and so we decided to go here since it was the closest.  The prices at Lazy Monkey are super reasonable, and you can definitely get some great value here.    We ordered the dumplings (fried) and also the chicken gizzards.   What is a chicken gizzard you might ask?  It's just something super chewy and tasty.  However, $3.75 for a singe stick was way too high for what I got.  Meh, probably won't order that one again.  As for the bubbletea, it is all right but nothing that amazing. I would still rank Bubblemania higher than Lazy Monkey.  3 stars."}
{"text":"Came here after a yummy lunch at a nearby restaurant. Was craving for something sweet to finish off the meal.  Wasn't too sure what to expect from this restaurant, when we pulled up there was a crowd of people smoking outside. So it came off kinda shady... but when we entered, we found it to be chock full of asian high schoolers. The bf and I may have been the oldest customers in the crowd that afternoon...  Anywhos, we both weren't sure what to expect, and when we try out new bbt places, we try to stick to the staples so we have a good benchmark.   I opted for a hot triple milk tea, and the bf got a \"double q\" milk tea. We loved the funky texture of the crystal jelly. It was a refreshing change from regular pearls. Will seek out a time to come back and try their hot food options."}
{"text":"The food here is decent. The Taiwanese Fried Chicken is excellent, juicy, soft meat and crispy batter but the portion size I feel is quite small for the price. The casserole was not that big either, but it did taste good with a tomato-y cheese sauce on rice with chicken.   The interior is sort of lacking. It feels sort of messy and .... let's say practical. There are also supplies stacked within plain sight of the eating area which enforces that feeling.  WiFi password is 11234567."}
{"text":"It's amazing. Totally Taiwanese style cuisines, no doubt! Puffy tofu and Taiwanese style fried chicken are good for snack. Hot spring noodle soup taste really good, it's in lighter flavor, not too much salty, enjoy it with the snacks, absolutely matched! Especially in the coming chilly winter, we should get something hot to warm our body up!"}
{"text":"mom and pop shop. Taiwainese.  Come for their Taiwainese fried chicken. That's it!"}
{"text":"Love the bubble tea there, Taiwanese fried chicken is also a good snack. I wish they had more entree options but otherwise definitely recommend it"}
{"text":"I like the Taiwanese Fried Chicken and Fried Squid Tentacles. But last week I went, my fried squid tentacles were not seasoned well, some of them were good, but some were lack of favour.   My husband and I do not like the hot spring noodle. The presentation was nice and unique, but the yee noodle soup had no taste and the meat balls that came with it just tasted like the ones we could buy from super market.   The Taiwanese Pork Rice with Tofu and egg was not bad, and I will try the casserole/baked rice next time I go as I were told they are good.  Bubble tea is good, I like the High Mountain Oolong milk tea; but I do not like the pearls as they are too sweet for me, especially I only order 1/4 sweetness for my drink.  Have to mention the food was hot! very nice!!! Because recently I found most of the food that was served by other places  are not hot and I do not like thatl"}
{"text":"This is the epitome of a mom and pop shop.  It appears to be run by an Asian family.  However, my first experience here the other day was an unfortunate one.    I ordered a mocha and they only had one cup size left, being large.  I wanted a small so the dude was going to do his best to make a small in a large cup.  Then he realized he was out of ingredients and actually ran out the door to purchase them at the neighboring Mac's store.  By the time I actually got my beverage, it was a long wait.  Upon drinking it, I realized it was mostly foam and a tiny bit of espresso.  I literally could count on less than ten fingers how many sips of mocha I had before it was gone.  Rip off.  I also was told they couldn't issue me a receipt for cash purchases, which didn't impress me either.  I won't go back.  On a positive note, this cafe is well decorated and kind of unique.  The tables and chairs are nearly bar height and are the style that one would actually put in a dining room, so they are large and heavy.  This business mostly caters to students I presume (it's across from a high school), so flimsy furniture wouldn't last long.    There is a small hot and cold food menu that includes grilled cheese sandwiches.  If I ever did go back, it likely would just be for bubble tea.  April Challenge: The Underdog  6/10"}
{"text":"Like the food here and sure will come back. Bubble tea is perfect, not too much sugar and tastes really smooth."}
