{"text":"Do not eat here. It's a ripoff. The food is horrible. Over priced. Their reasoning is, 'it's at the airport. What do you expect?'"}
{"text":"I am fond of their smoked meat sandwich. Nothing special, and today a bit slim, but genuine Montreal flavor. For me the Richard red and the sandwich is a good-bye to Montreal."}
{"text":"Bad place for breakfast.  Drinks probably fine. Returned the Oatmeal!  Who screws up Oatmeal?  Eggs were runny, toast over buttered, sausage when I asked for bacon."}
{"text":"A better option at YUR than most of the food kiosks. Food is freshly made, rather than sitting in a case for days on end. I had to have one more Montreal bagel with lox before we left, so we hit this place. Attentive, yet unobtrusive bartender. 

Great Bloody Marys 'cos no matter what time it is at an airport, it's okay to have a cocktail.

I liked this place. Bright, clean and well maintained, it was an enjoyable wait."}
{"text":"See a lot of bad reviews here, I guess everyone's experience is different.

Stopped by for a quick meal (lunch/dinner), while waiting for connection. Was very happy to see couple of local (Ontario) wines on the list. At CAD13.5/glass, the wine is not the cheapest, but was very decent.

Had Chicken Club sandwich, which was recommended by the server, and it was excellent, nice bread, good sauce, served with shoestring french fries. All in all, excellent meal. 
Service was nice, prompt and friendly. 

Recommended."}
{"text":"I was flying back to US late evening after Labor Day weekend in Quebec and ended up at Terminal C.  There are not that many sit down places there.  One was a rather formal steakhouse and the other one was this sports bar, the rest were quick grab-n-go food court type.  Steakhouse looked boring and windowless so I chose Le Bar Sportif.  There were two people working this place: a butch waitress and a mild mannered bartender.  I chose to sit at the bar  and ordered fiesta nacho with chicken for $14 and drank total of 3 pints or red beer for $32.55.  The total bill with taxes came out to $53.51.  Needless to say that the beer is way overpriced here.  The food was \"meh\" to say the least.  Nacho chips were the thickest I've ever seen and the whole thing was just dry.
On a plus side, the bartender let me charge my phone and was generally pleasant and attentive.  Also, it's a nice place to strike up a conversation when you have nothing to do and feeling bored."}
{"text":"Need a place to kill a little time whilst you wait for your flight? This is the spot. Catch the game, grab a beer (or a completely passable Bloody Mary), try the open-faced chicken nachos, and watch the international flights roll in. Then get on your flight pleasantly buzzed. Win-win all around."}
{"text":"Had some time to kill at the Montreal airport and needed some place to sit down and have breakfast while watching Sportscenter.  Le Bar Sportif fit the bill quite nicely.  I had the pancakes and 3 meats (bacon, ham, sausage) breakfast with a glass of orange juice and it was more than sufficient before I had to hop on a plane to Chicago.  Staff was very nice and I was satisfied."}
{"text":"We had NO luck at Montreal Trudeau Airport.  We first wanted to go to Houston's and we waited out front for about five minutes while the help looked at us and were pointing fingers on who was going to wait on us.  So, we walked down further toward our gate and since this place had on NFL games and looked decent, we stopped in.  I will say that our waiter was very nice.  And they had Molson Export on tap, which ironically they do not export and is difficult to find in a lot of places.  So, I had that to drink.  And this is where things took a sharp turn downward.  The menu is VERY limited and some very strange combinations.  Maybe they are popular in Montreal, but we had hard time trying to find something that sounded ok that we wouldn't be paying for later on our five hour flight.    We both ordered Montreal Smoked Meat sandwiches.  I've had one before in Vancouver of all places, and it was good.  We told our waiter that we only had about 20 minutes until we had to board and he said that it would not be a problem.  25 minutes later, my Dad had to go flag them down to get our sandwiches.  And it may be Montreal Smoked Meat, but whatever they did in Vancouver was so much better.  My Dad and I both ate less than one half.  The fries were hard and cold.  They offered to make us something else, but we had to board and we got to the plane as they were saying \"last call\" for our flight.  Also for the two sandwiches and two beers, it was almost $60 Canadian.  Absolutely ridiculous for that meal.    I noticed that the choices were MUCH better before you clear US Customs, so if you're traveling from Montreal to the United States, eat at one of the establishments in the Canadian Domestic Terminal."}
{"text":"Was not expecting much from an airport resto but this place succeeded in underwhelming even my lowest of expectations. Tried to keep it simple by ordering quesadillas and a caeaar salad, both were quite unsavory and difficult to eat. One of the worst meals I've had in a while."}
{"text":"Had a very nice lunch here today before we caught our connection back home. The Bloody Marys were a lot better than those we had at the other Montreal Airport saloon on the way to Calgary (No GD Salt on the rims of the glasses this time.).

The smoked meat sandwiches were terrific, the fries were hot and fresh, even the cole slaw was very good. Service was fine and the interior of the restaurant was pleasant.

All in all, a very nice place."}
{"text":"I ate here before boarding (well trying to board) a flight back to the US. There weren't a ton of options in the terminal, so we landed here. The service was completely non existant. We had to flag the mannish waitress down to be seated, and then had the bartender take our orders. Not a big menu, but had smoked meat sandwiches, soups, regular sandwiches, a bunch of appetizers and a couple salads. After much back and forth, we chose the chicken quesadilla and the roasted turkey club sandwich.

My sandwich came with sad looking bacon, two pieces of deli turkey, pickles, coleslaw and some soggy oven baked fries on the side . I was starving so I ate. There were two mayo packets also on the plate (a little plastic bowl would have been much nicer). The sandwich was just okay; nothing to write home about but not inedible. The quesadilla looked delicious though. 

All told, bill was under $30 for 2 with drink and tip. I'd probably choose one of the quick serve places in the future is in Montreal's airport."}
{"text":"A few years ago I was in Montreal for meetings. Fate put me at the airport about 3 hours early so I checked in and found this restaurant near my gate. Me and a few co-workers sat down for breakfast while we waited for our flight. We almost missed our flight. The server was quick to take our order but then disappeared. He showed up to serve the people at the other end of the restaurant but only came our way when he dropped our food off. He didn't come to fill coffee or check on us, we sat there for an hour after he brought us our meal waiting for him to return. When he did he took our cards and then disappeared for 45 minutes. We got them back just as they paged us for last boarding call. I came to the airport 3 hours early and still had to run to my plane because the server was too busy serving the 3 other people or hiding in the back room serve us. The food was alright, but cold. I would rather grab an over priced snickers bar from one of the convenient shops than ever go to this place again."}
{"text":"Stopped in on a layover today...  The food was just okay, as was the service.  The prices were typical for anything in the airport - so basically overpriced.  And the alcohol was significantly overpriced!"}
{"text":"Great spot for affordable quick decent food before your flight!  Decently priced drinks and some solid wings (difficult to find in Montreal).

I would much rather grab a bite here than be overcharged for something average at Houston or thrown together from the quicker places."}
{"text":"Decent airport food but beer was expensive! Really, it was almost as much as my sandwich."}
{"text":"One of the worst bloody marys I have ever had.  The burger was one of those frozen packaged patties.  Thin and tasteless.  I should have ordered the smoked meat."}
{"text":"It's an airport bar. But in the area, it's the only one that will let you sit down if you're not ordering food. Good beers on tap and giant windows for watching the planes. Lots of seating too. Not bad for a final drink before takeoff."}
{"text":"A kind gentleman was my server.    The food was extremely mediocre.   The facilities were clean.   The view out the window was plane-y.  

Lots of televisions with sports shows on.  

Not a bad place for a captive audience, so I was forgiving of my sad,dry quesadilla."}
{"text":"Food was ok 

Waiter forgot my water but the biggest sin was the shut off the baseball game I asked them to put on in the Bottom of the 9th...some sports bar"}
{"text":"Beer was fine. Food bordered on bad, plain at best. Awesome picture on menu of quesadilla, reality was as far away as possible. Smoked meat sandwich and roast beef sandwich were not memorable. Lived down to expectation of airport food from 30 years ago."}
