{"text":"Our experience wasn't cozy at all. I was really looking forward for a nice brunch at this place! we sat in the back were we can see and hear the carts from IGA being pushed along... there were also a whole bunch of turned over tables, chairs and folded boxes next to us, with an office like suspended ceiling and neon lights. As for the food, the eggs Ben were very good but my asparagus were dry (non edible) and the fruit portion was basically as tiny as the garnish... For a 15$ plate , I would have expected more. As for the service, The very young and non-experienced waiter brought our food to another table (although the cafe was almost empty) and he didn't know our order at the cash.... This restaurant is not cozy it's just tiny and awkward... being next to the IGA just makes the whole setting terrible. For 35$ bill and much better service we'll stick to our usual spot \"delice at cafe\" in St laz."}
{"text":"This place was so charming I felt compelled to write my first ever Yelp review. 

We stopped by Le Cozy Cafe on a trip from Ottawa to Montreal. It was well worth the detour. Fantastic quirky atmosphere. Very friendly and helpful staff. My son ordered the Ranchero omelette said it was the best omelette he ever had (kid eats a lot of omelettes). My daughter had the philly steak crepe which she loved. I had the Matin sandwich which was fantastic.  My wife raved about the BLT she had. The sides were all delicious as well."}
{"text":"I own a restaurant in ile perrot and also consider myself as somewhat of a foodie so i love trying small, little, isolated places like these. In hopes of one day finding a diamond in the sand. Here it is folks. My girlfriend and I have now found it. Honestly, delicious quality food with good prices. Im also very picky and so i asked the chef ( which also was our waiter isn't that cool ? ) if she could make 3 eggs bacon sausage because it wasn't on the menu. She made it happen. Honestly guys this place you gotta try !!!"}
{"text":"Best breakfast/brunch in the region. Big menu with a good vegetarian selection, the omelettes my friend and I ordered were delicious. Gluten-free toast available on request. Laid back and cozy, as the name suggests, don't expect the fastest service: quality takes time and the food here is absolutely worth the wait."}
{"text":"A charming place to stop for lunch or coffee. Staff are friendly, food is good and healthy, and the coffee is above the common run."}
{"text":"My husband and I went here finally after months ,they're always packed! 
I ordered a pesto egg white soufflé
And he ordered the breakfast poutine. 
I loved everything about our experience. The service was great. I got free coffee. Everything was nice and clean. I love the atmosphere and all the cute cow paintings. It is definitely worth the hype and the wait to go."}
{"text":"What a find. We are from San Francisco so the bar is set high. Not only was every dish delicious but the presentations matched 5star restaurants. High quality ingredients cooked so well. Prices seem totally in line with what we have found in Quebec and dishes include huge coffees that one would probably pay $4 for on other menus."}
{"text":"Very cozy indeed. Not a lot of space so I would not recommend going with a lot of people but its very nice for couples or even small groups of friends. Their food is really good as well as their desert. Make sure to reserve beforehand."}
{"text":"We waited 65 minutes for food after sitting down at lunch time. The waiter forgot the kids drinks. Potatoes were dry. Breakfast food was alright but nothing to write home about. 25$ per person for lunch plus tip."}
{"text":"I'm torn. There are things that I liked and things I did not. Let me start with what i liked.
The food is delicious! I had a crepe and it was probably one of the best i've had. It was a decent size and very satisfying.
The people are delightful. The dining room quaint and,well, cozy!
It's not the typical breakfast place as it doesn't have pages of items that are overly greasy or sweet. There's a nice selection of items that would satisfy any palette.  
Here's what I didn't like.
The prices. As good as the food was, it did not justify the prices. A crepe on a plate with no side should not be as expensive as, say a pizza at a good pizzeria. I felt extremely ripped off having to pay nearly 50$ for 2 crepes and 2 bottles of water.
The timing. The place is small but diners at the same table should be served at the same time. It sucks having to eat while the others watch and wait for their food.
I can't speak for the smoothies and ice cream as i didn't have any, but they looked good and fancy!"}
{"text":"Wow great place, I had the onion and mushroom egg benedict they were delicious. My husband had the poutine breakfast he raved about it. We will b back"}
{"text":"Breakfast is breakfast right ? No , this place brings breakfast to a whole other level , delicious homemade sausage , bearnaise sauce absolutely everything is made with loving care , a feast for the eyes  as well as the taste buds .
Chef Sue comes out and interacts with all the customer's 
I love it there and go every chance I get"}
{"text":"It's a little place in Hudson that serves a pretty good breakfast. Used to come here with my partner from time to time after we did our groceries. However, I went there with my mom during the summer after I took her to the garage down the street and our waitress was kind of rude. She was a young skinny blonde girl with kind of a \"self-entitled raging feminist\" kind of vibe. While I was ordering my breakfast she came up to us and was like \"Oh, you're the person that complained about us the other day!?\" (totally random). I think she was confusing me with someone else because I rarely, if ever, complain about restaurants. This might even be my one of my first negative Yelp reviews. Anyways, even if I disregarded her false assumption her demeanor was pretty unlikable in general, and even though I don't see that experience as the end of the world it still left a pretty bad taste in my mouth and has prevented me from returning ever since."}
{"text":"We stumbled on this place driving in the Hudson area. Quaint place. Small but well decorated. I was just really hungry and needed to get my fix. The food did not disappoint. It was fresh, tasty and came in generous portions. We went for brunch so you ended up having a wide selection of choices. Never had I had such a tender hamburger, juices flowing from every corner of the meat yet the bread remained crunchy and doing its job of keeping me from making a mess. I'm going to try out the supper menu one day and I am sure I will not be disappointed. One more note, the staff is very courteous and quite attentive."}
{"text":"This place has quickly become our favourite breakfast place. I cannot say enough good things about it. Two words: BREAKFAST POUTINE. Phenomenal. 
I've also had their eggs Benedict and one of their crepes. Incredible, all of it. And their toast...they do not have toasters, they grill them...so tasty. 
Sue the chef is amazing and will come out to chat when she has time. The owners (Jessika and Sue) are super nice ladies and have a little gem on their hands. Do not be put off by the small size of the dining room...it's worth a wait. We've been lucky and have never had to wait. I guess we have good timing. 
Also, they cater! They did my son's Confirmation (and opened their dining room to us) and hit it out of the park with Portuguese chicken (which she had never made before), filet mignon, seafood rice, bean salad, roasted potatoes and veggies...and much more!
As I said at the beginning, I can't say enough..."}
{"text":"Je ne connaissais pas Hudson et le Cozy Café fut mon premier arrêt dans la ville. Quelle très bonne surprise! Le décor est Instagram worthy et il y a même une petite terrasse accessible lors des journées d'été (toutefois définitivement moins belle que l'intérieur). Je ne peux pas parler pour le brunch mais le menu du midi vaut le détour! Les plats proposés sont assez variés et originaux et les portions servies sont amplement suffisantes. Plusieurs options santé sont disponibles et quelques produits, comme la soupe du jour, proviennent de l'épicerie bio et naturelle située juste à côté. Osez aussi essayer un des shakes pour compléter votre repas! Je vous suggère le Moroccan (lait, avocat, amandes et dattes). Une réussite!"}
{"text":"Reserver le resto en soiree juste pour vous
a compter de 12 personnes ce sympathique café peux devenir un endroit prive pour votre groupe le soir"}
{"text":"Une bonne option pour déjeuners/brunchs à Hudson/Vaudreuil-Soulanges ! 

On cherchait avec ma copine une belle place pour déjeuner dans Vaudreuil-Soulanges plutôt que les ''chaînes'' traditionnelles commerciales à déjeuner. J'ai trouvé par hasard ce petit café sympa sans prétention à Hudson sur mon app. Il est localisé dans un mini centre d'achat, à côté d'un magasin bio et une épicerie en plein centre d'Hudson. Déco légère. Ambiance tranquille, nous étions les seuls clients, un jeudi matin. Mes oeufs bénédictine au bacon (15$) étaient super bons. Le café filtre correct. Service de la serveuse sympa. La proprio était gentille. On a bien déjeuner. On reviendra sûrement si on est dans le coin. Wifi gratuit sur place. 

4/5 visité en janvier 2016"}
{"text":"A small little gem in Hudson! The food is amazing, staff very friendly. It is pricy, but worth every penny!"}
