{"text":"The worse food and service. Ordered online and some of my food was missing. I wish I could say that the food that was there was even edible . They had the nerve to tell me they couldn't deliver the missing items to me."}
{"text":"I ordered it on  foodora, The quesadillas were good but way too spicy for me at least. The rice was good the fries look better on the picture but still OK and I was very disappointed with the burritos because there is a lot of toppings that weren't mention on the description that I dislike and would've I known I would've not had them in it so that was a total waste and the churros was thicker than  the typical so I was like damn this is going to be good but it was actually way too soft on the inside"}
{"text":"Went on a whim one Tuesday afternoon after reading about their $1 tacos. They didn't have guacamole the day I went (I heard the owner?/person at the cash complaining later to the owner of Ichi Sushi next door about being unable to find decent quality avocados and the exorbitant pricing of late for them, so I'm guessing that's the reason), so I ordered three chicken and three steak tacos. I was the only one there at first, but the place became busy fast as we approached 5 pm. The tacos themselves were acceptable, but not perfect. They get their flavor mostly from the large quantity of spicy mayo/sauce on them, instead of any real flavor cooked into the meat themselves. The chicken was drier than the steak. I believe the regular price for three tacos as a meal (served with something on the side, but forgot what exactly) is around $13. I don't believe I would be happy eating three of these tacos for that price, but for $1, I would return. I wouldn't, however, go out of my way to come here if not in the neighborhood."}
{"text":"Pretty good food and great hours. Be careful though, they try to get away with charging you for extra things you didn't order(This has happened to me 3 times already). Check your receipt if you decide to go!"}
{"text":"Had the cheese quesadilla trio. I don't know what constitutes at cheese these days but it felt like cheese mixed with a thick corn starchy béchamels. I ate it fast so it could go down with having to taste more of the first bite. Definitely not Mexican or Tex-mex. The fries were good. So was the hot mayo. I wouldn't bother going back unless I was really hungry or drunk.  Maybe the other items on he menu are better?"}
{"text":"I have mixed feelings about this place. It could really be a gem but they have some big flaws (in my book!). Okay well first off, they're french fries are the absolute best! My favourite type of fries, so crispy yum! The steak and chicken quesadilla was AMAZING the first time(ask for extra cheese to hold it all together), second time, they put in this gross mix of old hamburger meat with a bit of steak to hide it up, it was disappointing. Another bummer is I pay an extra $2 for the Mango Juice X2, so $8 in all and both times I've received ginger ale and sprite. I can understand making that mistake once, but the exact same mistake twice? Scam. Also, they don't serve sour cream, salsa or anything with the quesadilla which kinda sucks... I mean you serve dipping sauce for the fries but not the quesadilla??!?!!?!"}
{"text":"My boyfriend and I wanted to try a new Taco place, so we ended up at Ice and tacos.  My boyfriend got the jalapeño tacos trio and I got the don  patron quesadilla trio. We both enjoyed our meal but it just didn't hit the \"spot\".  It's a very small restaurant and lovely decorations and the service was great. They answered all our questions.  Overall, good food and service but it just didn't hit the \"spot\".  I would recommend this place to friends and family."}
{"text":"nope, nope, nope.  Came here desperately searching for somewhere to charge my phone, since the electricity in my place is turned off (it's the day before moving day).  All I needed was somewhere with plug sockets, AC and food. This had the former and the latter, but it also had the door open - meaning mosquitoes all over the place and flies on my food - and an overall grubby, dirty feeling that left me feeling like my food probably wasn't all that cleanly prepared either.   The music was way too loud, competing with a loud TV playing american football as well, there was a weird leaky bucket of something dark brown in the drinks fridge, and the whole place felt like the back of a restaurant - with bins, empty cutlery trays and bottles stacked in the corner, and stained floors - rather than the front of one. There were precarious wires and extension leads all over the place and the walls were painted this unflatteringly stark white, which along with the florescent lights ahead, made the place look really dirty.   Next to my head was a safe (I think) that had cork board stuck to it. The cork board had partly fallen off, and so the tape underneath was covered in bits of cork and...hair?? Not the most appetising view.   Plus, one of the two guys who worked here kept disappearing for ages, which means service was a little slow. No idea where he was going - there's no terrace at this place. Not too bothered about this since it was a slow evening (it was empty except for me) but maybe a little weird.   The food was...ok. I had the cauliflower, guacamole and cheese tacos. The guacamole was piled on only one of the three tacos. The cheese - sparse enough that I thought they'd forgotten at first - was hidden underneath a pile of sort of soggy, flavourless veg. The pico de gallo was alright, but not that fresh.   Can't say I recommend this place, really, and I'll have the mosquito bites to remind me."}
{"text":"In the former Copoli burger location, close to The Main has arisen a taco shop with a clean, fun decor and one heck of a get-you-in-the-door special (on Tuesdays) - Taco Tuesdays...and what a deal it is $1 each. Yep, for real, any of their 6 or so topped tacos (authentic size to boot) - so you can mix and match. I got three for a snack - even one with tofu - and believe it or not it was worthy of the buck or even more.   Now, for that ice part. Well it's not that kind of ice, but I'll explain soon. I'll let you guess for the moment. More on this fresh local find tucked away neatly a few locals from the classic cross roads of the island.   OK, I'll spill the beans, the ice stands for a dessert, which in turn stands for popsicles. Sounds good to me."}
{"text":"Haven't tried the tacos here, but the burritos are damn tasty. The ingredients are fresh, the sauce is on point, but most importantly, it doesn't drip all over the place like those soggy burritos you're used to getting from whatever shady Tex-Mex place just opened up around the corner from your house.   I also can't speak for the fries, but an order just went by and they looked like the crispiest potatoes I've ever seen in Montreal. Will report back shortly."}
{"text":"$1 tacos on Taco Tuesdays!! While the tacos are a bit small, you can't really complain because a) they're fully stuffed, b) they're absolutely delicious, and most importantly, c) they're only $1.  Verdict on the types of tacos: Chou-Chou: my friend and I both ordered it, loved it, and ordered more. Jalapeño Tofu: surprisingly good, I even ordered a second! Fine herbs Tofu: okay but I preferred the jalapeño Chicken: my friend found it quite underwhelming Steak: I received a thumbs up from my friend as she stuffed it in her mouth  We both ordered our tacos all-dressed and spicy, and enjoyed that option thoroughly. Overall, each taco was a flavor bomb and definitely worth the $1. I'd even be open to returning on a day that isn't Tuesday to try the other items on their menu!  Lastly, the resto itself is teeny tiny and counter serve. There are ~15 seats and they're all at bars along the walls and windows, with cute cacti decorations. Be warned that is it a bit cramped and not great for groups. Our first server was a bit brusque and quite rude but when I went to order our second round, the new server was much nicer."}
