{"text":"Endroit très sympa pour prendre un café, un chocolat, un chai ou diverses pâtisseries (dont certaines sans gluten). Lieu très cosy et chaleureux où des magazines et quelques jeux de société sont mis à disposition. Il n'y a pas beaucoup de places (15 environ) donc il faut venir tôt ou avoir de la chance. Au niveau des prix, ça reste moyen-correct (4$25 le chocolat ; 2$50 le croissant au beurre ; 3$ le muffin).
Autre plus : lait de soya et lait d amandes :)"}
{"text":"J'étais à la recherche d'un espace où je pouvais à la fois boire mon traditionnel café du matin et travailler sur mon ordinateur en même temps. Le café \" Le Moineau masqué\" semblait parfait et situé non loin de chez moi.

Et je n'ai pas été déçue, l'espace et l'ambiance est parfaite pour travailler tout en buvant un très bon café! La décoration est sympa et la musique agréable! 

Le seul hic, un prix légèrement plus cher qu'ailleurs!"}
{"text":"Un petit café sans prétention dans une ptite rue pas tres passante mais au top! Accueil et restauration de qualité! La deco est super et il y a meme une terrasse. Vraiment chaleureux on peut y rester un bon moment! Wifi et table parfaite pour bosser ou chiller. Bravo le moineau!"}
{"text":"This is a true neighborhood cafe, which captures the Plateau spirit. The baristas are friendly, real, and full of personality, in the very best way. I love the exposed brick and light fixtures. It's really a lovely space. I always pick up a cold brew, and sometimes a pistachio croissant or a yogourt parfait."}
{"text":"What a lovely, relaxed spot. Despite being only a few blocks from the Mont-Royal métro station, it is on a quiet corner. I can see myself coming here with my knitting whenever I need to get out of the house.

I had a soy latté, which was decent but not memorable, and a yummy raspberry danish. I think I'd return more for the atmosphere than the espresso...but I will be back.

Tip:  they will give you your drink (and food) in to-go packaging if you want to sit on the terrace. Next time I'll ask if they'll give me a real mug if I promise to bring it back inside when I'm done. I guess with one person working they can't bus tables outside.

This is one of the cafés participating in the Indie Coffee Passport (2014)."}
{"text":"Parmi tous les cafés testés grâce à l'Indie Coffee Passport, il me semble que c'est le seul où j'ai vu une table réservée aux personnes sans ordinateurs portables! YOUPI
Rien que pour ça je lui donne 5 étoiles...
Non pas que pour ça. Aussi car j'ai beaucoup apprécié la serveuse, très sympathique. Le café est très bon et la déco confortable qui nous donne envie de rester longtemps longtemps. Il y a d'ailleurs un canapé et j'adore quand il y a des canapés dans les cafés. 
J'ai aussi pu découvrir les pâtisseries de la Bête à pain et j'ai beaucoup aimé! 
Je suis souvent passée devant la terrasse pendant l'été et j'espère pouvoir en profiter l'été prochain!"}
{"text":"I went to Moineau Masque in the summer. I loved this coffee shop because of its interior. It's a sunny, airy place with cute chairs. The coffee is served in bright yellow cups, sprinkled with chocolate in a heart shape. They also have a garden but we sat indoors. The barista was also very friendly and welcoming."}
{"text":"Really good latte. For baked goods, it depends on what you pick. The pistachio croissant is delicious, the chocolatine is ok. The inside is pretty and stylish; it has some toys for kids. The patio is pretty large and SO nice in the summer time. See the picture I posted, really pretty, and quiet. The lady working there helped me get out with the stroller, latte, and food; it was nice of her. I like the relaxed atmosphere of this side-street cafe."}
{"text":"Summary: Arrogant, cold, rude lady behind the counter made it a terrible experience. 
After reading other reviews it seems I'm not the only one. I love indie coffee shops and visit them all over the world, I've never had such a bad experience. I ordered a cappuccino and was given a 'latte' with almost no foam. I'm not an expert but I'm well experienced with cappuccinos and know what to expect. When I told her it was made like a latte and I'd like it with more foam she said \"that's how we make them here, we don't do foam\". Even if I was wrong (which I wasn't) or being difficult, her attitude was unapologetic and agressive. Totally unacceptable for a cute neighbourhood coffee shop which is supposed to be a happy place. With so many amazing options in MTL no reason to go here."}
{"text":"Top ! Leur chai latte \"grand\" est en fait un peu petit mais l'endroit est chouette, avec des espaces dédiés aux personnes sans laptop ! Nickel quoi :)"}
{"text":"Location: On the Plateau. If you're using transit and get off at Mont-Royal, it's about 10-minutes away on foot. Street parking available but in short supply.

The place: Tucked away on a quiet street, this café is small and offers up a bright but minimalistic decor. Brick walls, large window, wood - it's got a very cottage feel to it that I like. A few tables and a couch are available to its patrons.

The coffee: They use 49th Parallel beans which I'm generally a fan of (think Old School Espresso), but I wasn't that crazy about the latté I ordered. It was too bitter for my taste and I've had tastier coffee using the same beans at Myriade, and at home (hey, I'm no barista - I'm just saying'). They also offer some baked goods that looked quite tasty, but I wasn't hungry enough to try anything this time around. 

Service: A little chilly. The woman who served us wasn't exactly brimming with energy or friendliness - something I would expect from a neighbourhood coffee shop. The fellow who showed up later, however, seemed friendlier and he took the time to chit chat two customers who left me with the impression that they'd never ordered coffee before. It was a big production for something so basic, but dude was cool about it and gave them some suggestions.

Price point: Average. I think the latté was about $4."}
{"text":"A few more days before the end of the Indie Cafe Passport, I've made a stop by this cafe in the plateau.

Good : the latte art is done pretty well. The decor is cute with a bunch of lanterns hanging over the tables with a welcoming atmosphere. However, that welcoming atmosphere ends as soon as you hit the counter to order your drink.

Bad: *sigh* I did enjoy my first trip to this cafe with my sister, but when I went back today, I received a very cold service. I ordered a cup of tea to go, and I've asked for a bit of ice in it (I'm not patient, I want to sip right away so i need my tea to be \"drinkable\" hot ). She responded by saying they don't have ice. Fine, I've asked for a bit cold water to dilute the hot water. She tells me she can't. Huh? I told her it's too hot, I can't drink this. In her most condescending voice, she tells me that I have to wait 3 minutes to steep the tea and then I can drink it (as in I can't decide what goes in my tea, but my tea decides when I can drink it?). Already this attitude was irritating for me, but whatever. I picked up my tea cup (to go) & realized it's so ridiculously hot, I can't even hold it. I turn around and asked if I can get a sleeve or another cup to put over it. She looks at me hesitantly as if I really inconvenienced her and gives me a few napkins to wrap around. Maybe if she added some cold water as I've requested, it wouldn't be so damn hot and I wouldn't have to ask for a cup. I've already felt irritated leaving the cafe with my cup of liquid devil, but when I spilt tea on my hand and it burned me, I've completely lost it. I don't ever want a barista to convince me of how I want my drinks again. 

Bottom line: after that crappy service, I will probably come back once every never."}
{"text":"This is a adorable tiny place to grab lunch, coffe/tea with a friend or to study. The seats are limited. People are friendly and so is the staff. 

I got their veg panini and soup. Food is great! 

Totally would come back again, in the sring/summer this time :P"}
{"text":"Le moineau masqué fait bien de rester caché, parce que sinon le peu de chaises disponibles ne seraient jamais libre lorsqu'on veut aller y prendre un café! Un logo mignon, un décors digne de Pinterest, un café au goût délicat (avec 49th parallel on ne se trompe jamais) et une ambiance bien relax, pour quand on veut oublier l'animosité de la rue Mont Royal pendant un instant. Ils ont également une sélection, petite mais efficace, de paninis et salades, ainsi que des viennoiseries gagnantes, telle que le fameux et délectable croissant aux pistaches d'Arhoma.

J'aime les cafés qui me font sentir bien, où je peux manger et siroter mon cappuccino sans lait d'vache bien tranquille et relaxer sur un divan en regardant Instagram. Le moineau masqué, c'est exactement ça."}
{"text":"Cute cute cute. Le décor est vraiment mignon, on dirait qu'on est dans un tableau Pinterest. 

La terrasse est mignonne aussi. Les grandes tables s'y retrouvent. À l'intérieur, soulignons la présence de la \"table sans laptop\", plus que nécessaire parce que les clients qui travaillent prennent beaucoup de place.

Je demande un espresso, je reçois un allongé. Il goûte l'eau un p'tit brin. Le latte est bon et bien exécuté, le chai latte est correct, sans plus. 

J'y reviendrai si je m'égare sur le Plateau, mais ne ferai pas de détour pour m'y rendre."}
{"text":"Off the beaten path you'll find this charming little coffee spot. The coffee itself is great, I had a latte. Service was friendly especially for an Anglo such as myself in a more Français part of town. There were complimentary blankets in case you catch a chill from the cold Montreal air. Overall environment - I wasn't feeling the vibes for personal reasons, just didn't feel like my style, but if I'm in the area I'll gladly pop in."}
{"text":"Super petit café bien mignon non loin de la station Mont Royal.
Il y a un bon choix de boisson chaude et froide ainsi que des pâtisseries produite par une boulangerie.
Nous avons pris un café court, un chai latté et des pâtisseries de la veille (-50%).
Tout était à notre goût et j'ai vraiment aimé l'atmosphère du lieux.
Il y a une table sans laptop (ouf on est sauvé), des canapés et on peut même prendre des jeux de société dans l'étagère pour faire un scrabble ou autre :)

Pour info j'ai aussi vu que c'était un point de livraison des fermes Lufa ;)

En bref un petit café de quartier bien sympa que je suis heureux d'avoir découvert !"}
{"text":"What a wonderful little find in a quiet part of town.  My friend and I were looking for free wifi and a place for a snack and were lucky enough to be nearby this place when we revved up the Yelp machine.  Friendly staff, delicious panini, ice cream and tea (sorry, we didn't have any coffee).  Beautiful relaxing decor and nice outdoor patio."}
{"text":"J'ai   commandé  un  savoureux  mocachino  !!!  Bel  ambiance  de café   assez   agréable !"}
{"text":"A review is, by its nature, a very personalized and biased thing.  I was torn about how many stars to give this place because I know what I value in a coffee shop isn't what most people value in a coffee shop, so that may skew the validity of my review to some people.  That being said, Le Moineau Masque is, hands down, my favorite coffee shop in any city.  I found it through the International Coffee Passport (if you live in mtl and don't know what it is, definitely look it up asap) and find myself continuing to come back here even though I could get a free coffee elsewhere.  Why?  Well, I know the coffee isn't  necessarily the BEST, but it's plenty delicious enough for me.  What sets this place apart from the rest is the service.  I've never, ever been to a coffee shop where I got such quirky and friendly service.  In fact, it's hard for me to recall a coffee shop where I didn't feel like I was burdening the baristas; it's become an accepted part of coffee-shop-culture, and I love that Le Moineau Masque doesn't stoop to that level.  To top it off, the space is pretty sweet, with a super nice outdoor terrasse, far enough removed from the bustle of Mont-Royal to give you a feeling of seclusion but close enough for easy access.  I'd much, much rather have a warm interaction and a not-wobbly chair than a *perfect* cup of coffee."}
{"text":"Pretty little cafe with good coffee and pastries.  We had lattes and split a plain croissant and were not disappointed.  The back patio area is cool and relaxing when the weather is nice.  Next time I'll order the pistachio croissant, for sure!"}
{"text":"Charming little cafe that has good coffee, pastries, nice panini and it appears yummy gaufrettes. Besides that they will squeeze some fresh juice for you or you can try some artizanal ice cream if in mood. 
This adorable coffee shop is so well hidden from the hustle and bustle of the main streets of Plateau. Relaxed and refreshing, people sitting in the small patio and chatting over the wooden tables about big and small things of life: tango, food and who knows what else..... Sweet!"}
{"text":"Cute, whimsical and magical cafe. It's so warm and cozy inside that you almost want to keep this place a well-kept secret reserved only for those in the know. It's a hidden gem!"}
{"text":"J'aime beaucoup l'atmosphère cosy de ce café, et le service aux petits soins. Une très belle découverte à Montréal."}
{"text":"Super spot à Montréal! Le café y est vraiment délicieux, ce qui n' est pas toujours évident à trouver en dépit des nombreuses enseignes de cafés dans la ville. Paradoxe quand tu nous tiens!
On y va pour le café chaud mais aussi pour leur café glacé infusé lentement mais surement. Goût surprenant et rafraîchissant garanti!
On y va aussi pour la deco et la terrasse/jardin.
On y va enfin pour le service souriant d'une équipe dynamique et serviable.

Restez attentifs, on en parle bientôt sur Kimbylicieux kimbylicieux.wordpress.com"}
{"text":"Charmant café de quartier. L'endroit parfait pour se détendre et lire, surtout l'été avec la terrasse."}
{"text":"Très joli petit café, lumineux et confortable. Un chouette endroit pour s'installer et travailler, lire ou rêvasser avec un café (excellent par ailleurs). 
Les prix sont affichés avec la taxe comprise ce qui est pratique pour les nouveaux qui débarquent au Canada."}
{"text":"Le ''parfait'' petit café sympa du Plateau qu'on aime. Bel aménagement, mobilier, sofa, luminaires, bien sûr, délicieux latté de qualité et viennoiseries. Ils ont aussi une petite terrasse l'été sur le côté. J'y reviendrais pour sûr. Wifi gratuit."}
{"text":"Stayed at this café for the whole day and definitely enjoyed everything: great service, good coffee and beautiful decor! Quite close to Parc Lafontaine, it is a popular café and many people come around 2-5PM, they can play games like poker or Monopoly or Scrabble there. The terrace is the most unique one I have ever seen, with a wood structure with plenty of colourful cushions. The café has light music and many bubbly white lantern balls suspending from the rooftop, I love it!"}
{"text":"Super cute cafe nestled in the backstreets of the Plateau. The decor is charming, with a cozy sofa for lounging and two big tables for sharing, paper lanterns and little sparrow-themed decorations throughout. There's not much seating, but the space is bright and welcoming, and the bathroom is a chalkboard of cheery phrases. On the back counter are magazines for reading, and kids' toys to entertain the little'uns.

Food is good, coffee is good, space is delightful."}
{"text":"Cute neighbourhood cafe. The cold brew was super good (I tasted a bit of mapple syrup... Might have been in my head but anyways, it was good). The decor is super nice and cozy. The service though... Oh boy. Whoever served my friend and I was definitely unhappy to be there and extremely rude to all clients except the ones she knew (regulars I'm assuming). Kind of ruined the experience for me; I probably won't be back."}
{"text":"Very special taste. The latte was really nice. I was planning to go somewhere else, but the place was packed so I've found this precious small café. 

Lucky me! 

Very silent and calm place. Excellent for those who goes for reading. Not all seat are allowed to use laptop! The decoration is amazing and fun at same time. I tried a chai gluten free cookie. (I like to try different things). 

Worth coming back!"}
{"text":"Such a cozy warm welcoming little coffee shop. Not expensive at all compared to Starbucks! The espresso was a good one and the hot chocolate was a regular hot chocolate which tasted like hot chocolate! But the fun part is the little detail! Decors! Little bit of chocolate sprinkles forming hearts, floating above the foamy hot chocolate. How can you not have a smile on your face while drinking your cup??? If you're looking for fancy stuff, go elsewhere. But if you're looking for good drinks and simple snacks at a low price range, then you've come to the right place!

Beware! There are not that many seats, so if you come during exam seasons, good luck!"}
{"text":"Je suis entrée au Moineau masqué, Indie Passport en main, avec pour seule attente d'y boire un bon café. Ce qui s'est passé ensuite m'a éblouie et a catapulté l'endroit en tête de liste de mes coffee shops préférés à Montréal.

J'ai d'abord rencontré Jean-Pascal de la France. Un barista hyper sympa, sans aucune prétention, drôle (il a tenté, presque avec succès, de me faire croire que l'accès à la terrasse se faisait à travers le miroir -méfiance), dont l'attitude et la conversation n'étaient pas sans rappeler mes barmen favoris. Je suggère fortement que le Moineau installe des tabourets au bar afin qu'on puisse discuter tranquillement avec lui en savourant notre café. Notre entretien s'est conclu avec un sac en papier plein de brioches gourmandes offert cadeau \"pour ton déjeuner demain matin,\" parce qu'il se faisait tard et qu'il ne les vendrait probablement pas.

Alors, côté bouffe justement: tout était délicieux (croissant aux pistaches Arhoma, muffin choco et cannelé), en particulier le panino au thon. Miam. Ils en ont plusieurs variétés qui semblent tout aussi bonnes. Les prix incluent les taxes, parce que la proprio Fannie est Française et que voilà.

Finalement, l'intérieur, sans être spacieux, est néanmoins très bien décoré, clair et lumineux, hyper douillet avec sofas et magazines, et quelques tables à partager. La terrasse est un havre de tranquillité, again des tables communes posées sur le gravier, avec 2 ou 3 arbres pour faire de l'ombre en été et des guirlandes de lumières en suspension. Bref, un must pour tous les habitants du Plateau, ou ceux qui y passent."}
{"text":"Quiet place, good service, small inside but if the sun is smiling you can choice for the terrasse."}
