{"text":"As a brazilian i did not like tis restaurant. This not near a good churrascaria like brasa or fogo de chao and the maitree was very mean with me and my friends. The sides are poor, not even a black beans was served. The waitress forgot our table many times. The music volume was too high, we asked to move our table because we were on the direction of the aound box and the meat was good. But not anything special and i did not try all of them because the people keep forgettin where we were sitted. The only thing good on this restaurant was the guys that cut the meat for me. If you expect to have a real churrascaria experience, do not go to this restaurant. Try the other brasilian restaurants on montreal."}
{"text":"Don't go there. Ive been there because of groupon and they stole my money. They charge u for tip on the full price before the groupon so imagine. The full price is 100$ = 15$ tip but i had a groupon of 50% off so i would tip them 7.5$ big difference when ur a student. Plus the dancer is a douche bag on cocaine. The servers also kept serving us the last pieces of meat and ananas. Dont waste your time and money there."}
{"text":"Wow, just went on Saturday night and I had a great time.  Ambiance was amazing with the Brazilian dancers and the food was never ending with the meat cutters coming around non stop. I will definitely be coming back to this location."}
{"text":"Recently checked it out for the first time. The portions are enough to get really full. If you take the meat feast, i suggest to ask for the waiter to bring you the good stuff right at the beginning if not they just keep feeding you with turkey and sausage. then when thr filet mignon comes you are so full you can only taste it.  the service was very friendly. but at one point they had a show going on where a guy and a girl dressed in carnival clothing went around dancing. the music was so loud it felt like my ears were going to break. it went on for a good 30 min. that was a major minus of the restaurant."}
{"text":"Excellentes Viandes, décor sympathique  ! Le tout rappel parfaitement ceux fait au Brésil !"}
{"text":"Went here twice while we were in the area. Food was great, Isabella was a very good server. Definitely try the different drinks they have, they were not stingy with the alcohol they put in our drinks. Good service from guys that bring the different skewers of meat out also, always asking if & what meats we liked, or if we needed more sides. Really good place to eat."}
{"text":"Offering an authentic Brazilian experience, Le Milsa is something everyone should have the privilege to enjoy.   With several different types of meat (turkey wrapped with bacon, chicken, filet mignon, lamb, striploin, sausage, amongst others) brought to your table on pitch forks and sawed off for you at the table, Le Milsa is perfect for parties. For $30, it's all you can eat meat, rice, sauteed mushrooms, salad, bread and sweet potatoes. Dessert is also included.   The standout for me was the turkey wrapped with bacon (anything bacon is good in my books). On the other hand, the lamb was very tough and \"lamby\". Make sure you refrain from going too early as you will only be served the ends of the meat, which tend to be the driest and toughest. Even if you ask for another piece, they will twist the meat and still shave off another end-piece (makes sense as a business model).  The service was good but I'm not a fan of the required coat check."}
{"text":"This is an awesome place to go for large parties.  Although on the pricey side, it's worth at least one visit to experience the unique style of buffet.  The way it works (if you choose the meat buffet option) is that servers will arrive every 5 min or so with a different type of meat on a skewer and serve you some if you wish.  The service was consistent and overall friendly.  Some meats were really good, some were simply mediocre.  My favorites were the chicken legs, lamb, and top sirloin.  Feel free to pass on the pork sausages and turkey w/ bacon.  Everything else was simply ok.  Pineapple with cinnamon is the dessert option I had and it was really sweet and juicy.  I would highly recommend it.  Another unique aspect of this dining experience is that during dinner time around 8 PM, they'll have dancers come out and perform with you in what I assume to be traditional Brazilian outfits.  They actually pulled me out to dance with them which was only slightly embarrassing but I'm sure it amplified the good time everyone else was having.  Not a bad idea to dance though since it got my appetite going again :)  Overall, a decent place to eat and have a unique experience.  The food didn't blow my mind but was altogether still good."}
{"text":"What a great restaurant if u like meat it's the place to be  Great atmosphere and music equals a great time  Friendly service  I was impressed !!"}
{"text":"Could have been better. Drink service was good but food service was terrible. Also, delays between meat service was more than 10 min. It seemed almost intentional and ruined the experience for our group of 9.  Personally, I hate giving negative reviews but I can't recommenced this place based on my experience.   Maybe we hit it on an off night? .. hope so..  regardless, will not go back."}
{"text":"Eating out is more than just having Food ~ where you are and how you're treated count as well!  Atmosphere:  Le Milsa's goal it seems is to create as much \"atmosphere\" as possible.  The place is often crowded (especially dinner time), and sometimes even more than usual if a live show (dancers) are on hand.  The staff all wear the Seleção (Brazil's national football team) jerseys - and are encouraged to be chatty with the customers.  It may sometimes come off as been too contrived - but points for trying. A little too much on the touristy side.  Service:  The service at le Milsa is good to very good.  The staff is friendly, and being young(ish) tend to be open to bouncing around and mingling with the patrons on nights when a genuine part attitude develops.  They make their rounds, with their spits of meat, as fast as possible, but sometimes that means it takes longer than necessary to catch a hold of one of them to ask for something like a menu, cutlery, etc.  Food:  For a churrascaria no where near anything else Brazilian, Le Milsa's food get a C to B- grade.  It tastes well enough, but those having been to an authentic Brazilian restaurant can tell the different.  Indeed, le Milsa is not owned by Brazilians and neither is the chef / cook (as far as I have known).  Not sure what the owner's connection to Brazil is or how much they know of it's history and culinary traditions, but it very much seems that le Milsa tries to capitalize on the whole \"endless meat on a stick\" wow factor. Lots to pork on the menu & lover of succulent filet mignon beware, you may only see the waiter with that type of meat only once or twice per sitting, the management seems to offer less of this in an attempt to move the other (cheaper) meats faster.  Good for a group and a ruckus time - but not for an authentic experience."}
{"text":"If you want a fix of never ending meat then Le Milsa is where you should go.  I have a couple of issues with Le Milsa.  Sometimes, the meat from certain cuts that you get are dry or fatty.  This isn't a problem because they always come back and you can get as best a piece that you want.  The main issue I have is the stinginess with the best cuts of meat, such as the filet mignon.  They only come by once and only give you two pieces.  We had to ask 4 times before they came back with the filet, and the rudeness that was exhibited by the meat server was evident.    Now I understand they are trying to run a business, but don't advertise yourself as all the meat you can eat until you are begging us to stop, if it takes 4 times asking to bring the filet back again.  The customer is paying for this meal, and deserves to be respected.  However, since Montreal does not have a Fogo de Chao, this will have to do..."}
{"text":"Let me start by saying I'm brazilian from Rio de Janeiro and I truly know what a brazilian place should be in several different levels.  We decided to go to Le Milsa and experience some of the food we miss from Brazil. We were appalled to find a place that if not for the tacky Macaus and brazilian flag not to mention the TV sets showing the Carnival parade in Rio we would never imagine this is a Brazilian place.   Straight to the point the food is BAD (WITH CAPITAL LETTERS) and I mean B-A-D ! The side orders are poor and any comparison with a brazilian churrasco is an offense to say the least.  Grilled champignon ? 1 (one) sweet potato ? They've got to be kidding me. No fries ! No yucca ! No Farofa !  Not even the easily found \"pao de queijo\"  (cheese puffs) were served. That is simply insane !  For the meat we got the famous Picanha (really hard to eat, bad taste, poor cut and bad look), Lamb (seriously ?), Filet Mignon (which was an \"ok\"  for us). The sausage was good and we didn't try the chicken.  We asked for some chicken heart and the waiter said they did not have that but that we could find it at IGA (which is a supermarket for those reading this review who do not know it). Really ????? All brazilians in Montreal know where to find sausage, Picanha, Guarana Antarctica (I didnt even bother to ask if they had it), chicken heart and (c'mon !) pao de queijo !  For dessert they had vanilla ice cream which in an odd fashion came with cinnamon (why ?) and a shocking grilled pineapple with cinnamon too. (that's it that's all) Are you serious ?  At this point mentioning the lack of smiles from the staff and the manager's refusal to change our reservation from 6:30 to 7:30 (he could move it to 7 only) considering the place was only 5 or 10% full in an optimistic perspective is pointless.  What about the spanish music soundtrack ? No wonder everybody thinks Brazilians speak Spanish instead of Portuguese. What a shame ! SHAME SHAME !   Pricewise the tab was 86 dollars (tax, tip included and 2 coca colas).  If not from the Groupon coupon this is a major rip off and if want some tasty homey brazilian food hit Cafe Guanabara on Du Parc Ave. The premises may be simpler but the food is authentic and good.  If I could do minor changes, I would turn off the TVs and put some amazing pictures from brazil with its nature, cultural aspects and sports sensation. Samba enredo is definitely not the best ambiance for supper and if the customers want to watch almost naked woman they have no shortage of places in Montreal with more privacy."}
{"text":"Pros: - Great Good - Great Service - Great Ambiance  Cons: Do not go there if you want a quiet diner, it is noisy!  Conslusion: I go there at least once per year, because if you want MEAT, then you got to go to the all-you-can-meat!"}
{"text":"?????????????????????????????????????????????????????????????"}
{"text":"First off, I'll admit I made the unfortunate mistake of having been to 'Copa Cabana', a similar Brazilian Steakhouse style restaurant in Toronto which set the bar excessively high. It was one of the best dining experiences I've had the privilege to have.   On a rare visit to Montreal from the Maritimes, my friend and I hoped to have another such carnivorous delight. Even with a few mediocre reviews, we were quite optimistic that it would take a lot for our night not to be spectacular. The Brossard location of La Milsa found a way to have us almost leaving halfway through our meal, a way to have my friend apologizing for putting me through this, and me wishing we just suffered through a Big Mac instead.   I'll make it simple, and in point form.  Negative  - Though I got my drink relatively quickly, 20 minutes (no exaggeration) after our initial order and only visit from our waitress at this point, still didn't have her glass of water. I had to go to the bar myself and get one.  - 30 minutes after arriving we finally got our salad and rice. No meat until about 35 minutes.  - On more than one occasion, the wait between slices of meat was upwards of 10 minutes.  - After not having seen our waitress for well over an hour ( the manager had delivered the water), my friend had to ask the manager personally for a drink menu and a drink refill. The waitress appeared 5 minutes later quite concerned. I think the manager gave her a bit of a blast of sh**. - We were unlucky enough to be seated in the vacinity of the 140db speaker when the Carnivale style dancer started her show. All guests in the area had a look of pain as their ears were blasted for 30 minutes with mindnumbingly loud Brazilian music. For the next half hour, our conversation was on hold as there was no talking, or hearing, over that speaker.   Positive - The manager was the only positive point I can come up with. He was helpful when his 20+ staff weren't able to help.   So, don't waste your money here. Perhaps the other locations are a bit better, but this particular one is quite sub-par. I rarely dissuade people from trying out a new place, but I can't rightfully encourage anyone from spending 110$ like we did at this spot."}
{"text":"Everything was really great - Food, service, atmosphere and price! Beef sirloin 'picahna' was by far my favorite meat. The sweet potato and seasoned mushrooms were my favorite sides. Grilled pineapple dusted with cinnamon was a delicious way to end the meal. A truly pleasurable dining experience!"}
{"text":"Lots of good meat to eat! Nice ambiance. The only thing I don't like is that the waiters serve you very little meat when they stop by. I asked for more and the waiter would cut one small additional slice then start leaving... At some point I got tired of asking for more after every little slice he cuts. I know he can come back to the table later to serve more but still."}
{"text":"The meat was ok, but there were no really all you can it because after the first set of meat pieces I have to ask for every little bit. We ask for the wifi password but no one could answer our question, because of this we shorten the tip but the waiter came to claim more :-( very unkind!"}
{"text":"Lot of meat, fun atmosphere, beautiful service and outstanding synchronization among the staff."}
{"text":"Negative star rating. Was there on Saturday at around 5pm and witnessed owner or manager mistreat and disrespect a customer with a young boy. You should be ashamed at the way you treated a Latino customer. Disgusting."}
{"text":"I went to Le Milsa for a friend's birthday party (we were about 20). Let me pre-face my review by saying I can eat and when I say I can eat, that means I can go until I'm ready to burst and then go a little more. I'm not a big guy, but if I am presented with an all-you can meat menu, I take full advantage of it.  That being said, at the beginning they came around with bread (I passed), rice, mushrooms, salads that were set on the table. If I wanted rice, I would have that at home. If I wanted mushrooms I could have them at home (I did try them and they weren't bad), and if I wanted salad, well..... I'd go to a salad bar. Everything comes off these big skewers. They start coming around first with chicken (you want near the middle or middle bottom), otherwise it seems a little dry. Next came sausages (a little salty), and then bacon wrapped turkey (I passed as turkey makes me nauseous, but everyone at my table loved them), then came the lamb (again like the chicken, you want the middle or middle bottom), finally the last round is the filet mignon. The filet was nice, tender, very soft, and most importantly not over cooked.  After about an hour of them coming around, people start turning over their tickets that they don't want anymore, but I stay green. The guy thinking I forgot tries to take my plate and I take it out of his hands. He asks me what I want, I told him the filet mignon, he asks the rest of the table if they want coffee and ice cream. Another waiter comes back with the deserts and tries to take my plate away. Again I take it out of his hands and tell him what I'm waiting for. He says he'll be right back. A third waiter shows up with the coffees and seeing my empty plate tries again to take it away, I again take it out of his hands. He asks me what I want and I tell him. I'm beginning to think I'm in a battle of wills and I'm not backing down. Finally a waiter comes by, fills up my plate with filet mignon and I was quite content. I managed to have their desert, a bowl of ice cream (vanilla) and their roasted pinapple with cinamon which was surprisingly good. I'm going to have to figure out how to make that at home.  Overall cost for the meal I find reasonable for what it is, however their alcohol, beer, and wine prices are way to expensive. The prices of wines seemed about 10$ more than other restaurants I've been to. A pint of beer is 8.50 and a pitcher is 25$. That is a little bit exaggerated for beer prices. A martini was 10$, a glass of scotch was 8.50$ and a double was 14$. You could get some wine by the glass, but they were 8.50$.   The dancing was fine and not too in your face as some others have written. They went around, took the birthday boy for a dance, I even got up to dance, all in all the \"dancing\" lasted about 5 minutes in my section of the restaurant and then moved on to elsewhere. It was a nice distraction, but nothing more, nothing less.  All in all, for my wife and I with two meals, 1 bottle of wine and a pint of beer, it was 150$ tax and tip in. Although I gave a 4 star rating, I would have preferred to give a 3.5."}
{"text":"What a unique experience!  Le Milsa is located fairly centrally in Montreal.  We were able to walk over from our downtown hotel.  This was my very first time dining at a Brazilian buffet so I wasn't quite sure what to expect.  We were given cards that say \"GO\" on one side and \"STOP\" on the other.  When you're in \"GO\" mode, the servers come by with great big skewers of meat (beef, pork, lamb, chicken, turkey) and shave off as much as you want onto your plate.  What a concept!  A buffet where the food comes to you!    I wouldn't necessarily call myself a meat lover (definitely not a hater), but I was surprised by the amount I was able to consume in one sitting.  I loved all of the meats equally.  They were all juicy and tender and full of flavour and it was nice being able to control how much or how little you wanted of each type of meat.  The skewers come around frequently, so your plate is never empty.  They also serve you sides of salad, potato, rice and mushrooms.    As you consume your delicious meal, the entertainers (dancers) come out and perform for you.  They make their way all around the restaurant, so everyone gets to enjoy the show.  Beware: they may even ask you to dance with them!  It appears that Le Milsa was built in an alleyway.  The interior walls of the restaurant are made up of the exterior walls of the neighbouring buildings.  I love the atmosphere - very cozy and romantic.  What I remember most about my visit to the Le Milsa was the dessert.  (Don't forget to switch to \"STOP\" mode or you'll never get dessert!)  Have you ever had roasted pineapple covered with cinnamon?  Just like the other foods, their pineapple is on a skewer and roasted to perfection.  Had I known I was going to love the dessert so much, I probably wouldn't have had that last portion of meat.  The price was on the high side ($29.95 per person), but it was all-you-can-eat and included entertainment.  Service was incredible.  It's obvious that they want you to have a great time.  If you're not up for doing the buffet, there are other options to choose from.   Lots of fun, great food - try it at least once!"}
{"text":"Mmmm... what can I say about Le Milsa...... It's really nothing amazing... The meat is extremely salty (obviously..so you drink a ton of water and therefore eat less), it's always very loud, and the service is so-so. The only \"amazing\" thing here is the sauteed mushrooms. Out of this world. But not really worth $35-40... Meh."}
{"text":"Very good place - the food was good - the dancers made it fun - a great place for a group."}
{"text":"Service was extremely slow. Was about to get delivery on the table.   When it came to the bill at the end was like we're planning our assault on the death star and asking for a complicated flight pattern. So much confusion  What made everything even better is that a few people from my table last night got sick."}
{"text":"I feel so bad giving this place such a bad rating as I had previously heard so many good reviews from friends, therefore I came in with very high expectations. I went out for dinner on a Sunday evening with my family. The place was surprisingly empty, but yet the service was extremely slow, we had time to drink a full glass of sangria between two services. The price is the same as what you would pay on a Saturday, which does not really make sense as there is no dancing show on Sundays, the ambiance was pretty boring. Our waiter seemed to be new, which is okay but he seemed pretty clueless about 3/4 of the menu. The food was pretty bland, lack of variety as they do not offer any fish/seafood, and the sangria tasted like flavored water. For what you pay, it is really not worth it unfortunately."}
{"text":"Disappointing experience because of the very long wait and the fact that the price was quite high for the quality of the food.  I was there as part of a pretty large groupe (about 30-40 people). It seemed to be the perfect place for that: they have a large room that can fit several large groups (there was another table there with about 15-20 people), away from smaller parties. However, it seems like they did not have the staff required for all those people. It took about 90 minutes just to order the food!! it was a Saturday night, and we had a reservation, so there is no reason to be so short on staff.  The meats tasted OK, but I it was definitely overpriced.  On a more positive note, the staff was nice and polite, and of course you get the little Brazilian dance show to create a fun ambiance towards the end of the night, which many people in the groupe appreciated.  That being said, I will not go back and I will not recommend this place to my friends. The person who organized the birthday party there said she regretted she picked that place."}
{"text":"Klasse Restaurant. Wir waren mit einer Gruppe von ca. 20 Personen dort und sehr zufrieden. Fleisch, Fleisch und nochmals Fleisch, direkt vom Spieß geschnitten ein absoluter Genuss und die HÖLLE für Vegetarier ... DerLaden ist super laut, an jeder Ecke hängen Fernseher und plötzlich kommt eine Sambatruppe rein, die 15min lange eine Show machen, bei der man mitwippen muss und fast taub wird. Ein echtes Erlebnis."}
{"text":"Absolute favourite place to eat. Fun, great food. The staff are always on the ball, listening to each table to see what they want. You say to your dinner party \"ooh, I'd really like some more....\" Bam! It's at your table a minute later. Love this place!"}
{"text":"Terrible service, even the manager was not helpful. Food wasnt even that good. Worst restaurant experience ever. It took them 30 min to get a glass of water for a friend. I would recommend anyone to stay away from this place. They only had one waitress on a Saturday afternoon (F1 weekend)."}
{"text":"I've been to quite a few Brazilian steakhouses like this and to me, this one struggles a bit. But it's not bad either.  The salad starter we got served was super plain and no dressing options other than some weird spiced one. once the meats rolled out we got some ok sides, sadly no staples like fried plaintains or anything. Just some rice, beets, and potatoes.   The meats weren't bad they were just overcooked. And there wasn't too much variety. You've got your usuals like prime rib or top round. The waiter we had was a bit awkward at cutting and we'd get extremely small pieces. Always had to ask for more.  The biggest let down is desert. They have either the signature pineapple slice with cinnamon or vanilla ice cream. That's it. And the ice cream was weird tasting, like sugar free or something. The pineapple was ok, but I've had it better elsewhere.  So what went well? Decent meats, just overcooked a bit. They came by often and we ate a lot considering. And the place wasnt overly packed when we were there."}
{"text":"As I walked up to the doors to Le Milsa, out of nowhere I heard the cries of joy of all the souls that left these doors. From that moment, I knew this place was gonna move me spiritually. The waitress sat down, and a waiter came, we chose their best seller.   After a brief chit chat with my mistress, I could smell the first of meats coming my way. It was turkey wrapped in bacon, the man came with his skewer of voluptuous piece of the juicy meat. I was almost drooling by the time I got my piece. After I took that first bite.....it....blew me away!   It was if time flew by as each piece came. A moments flash, I became fat. Gluttony is my sin, but oh my will I ever escape my sinning ways. It just too good. This establishment will forever be in my books. Thank you, for the pleasant dinning experience and enlightening me with all of the finest meats.   I'll be back soon......with more love!"}
{"text":"Compared to several other similar restaurants I've been to in the US this is not worth mentioning.  The service is good but food is disasterous.  Waiting for servere to bring out beef or lamb is almost like waiting for second coming but when you get it ithe servers slice it paper thin.  I mean if it is unlimited lets make it so.  And because the slicing is so thin the pieces don't get turned over which means that after keeping it warm the beef goes well done and becomes dry.  TVs deserve a special mention.  I would have expected to see them around thr bar.  But they seem to be everywhere and they play carnival on a loop.  I mean I do understand Brazilian theme but after a 4th iteration of the same damn thing that is just annoying!   The only thibg that is a breath of fresh air was the samba dancers.  That is fresh and new but it is not going to save the rating any because when everything else sucks show is just something that only postpones the inevitable."}
{"text":"When we noticed that there was a Le Milsa in DDO, I was happy as we could take my dad to a 'typical' Brazilian Churrascaria. However, as soon as we arrived I knew it wouldn't be typical. What Brazilian restaurant doesn't serve Guaraná (a Brazilian soft drink)  pão de queijo (cheese bread), farofa (manioc flour) and vinagrete? Being married to a Brazilian, these are all things that you come to expect at that kind of a Brazilian restaurant.   Then, I was further surprised by the fact that there was no salad bar. Not being much of a meat eater, I was looking forward to having the big choice of salads. Instead I had several pieces of sausage.   Another surprise was the fact that the pineapple with cinnamon was not included in the meal itself, but as one of the two choices for dessert (one scoop of ice cream being the other). There was no Brigadeiro or passion fruit mousse, no flan. Regarding the pineapple, it was good. However, when I took several pieces, we noticed the manager give a negative look at the waiter. It was because he gave it to me before dessert while the food was still being delivered to our table.  Once one of the waiters found out that one of us at the table was actually Brazilian, the service kind of improved a little. They were a little more attentive.  Regarding the ambience, I was very surprised that the TV was playing a DVD from Carnival from 2011. I was surprised that they didn't get a more recent DVD. I   It is interesting to note that apart from my husband, there were no other Brazilians. It is obvious that their intended customer are non-Brazilians, and that they wanted to introduce their culture. Kudos to them. But if I were new to this cuisine and had no prior knowledge this is what I would expect if I went to another churrascaria. And if it were up to me, based on this visit, I would not.  Upon arrival, I was a little shocked to notice two puddles of dried up vomit outside of the restaurant close to the steps from the street. I would have expected them to take care of the outside as well as the inside of the restaurant. After all, the entrance is the first thing a person sees when entering any establishment. A quick hosing down would have been appreciated.   In review, I was disappointed with our experience. It was expensive and did not have the basic food that I have experienced in other Churrascarias."}
{"text":"Service à chier ! Le serveur ne prends même pas le temps de faire le tour à notre table . Tout le monde fait comme si notre table est invisible . Très déçu du service . C'est pour cela que le restaurant est quasiment vide . Ne perdez pas votre temps à aller la bas . Une chance que j'avais un billet de Tuango parce que c'est vraiment de la merde."}
{"text":"I would not recommend this place at all. Overpriced and not particularly good cuts of meat. They come around w meat and cut it in front of you but it's messy and not very appetizing. They never even came around with three of the meats included.  There are far too many other restaurants on crescent than that"}
{"text":"Brazilian steak houses have made quite the impact over the past few years.  More and more restaurants have been popping up and popularity has increased.  Well at least in the GTA.  In Montreal it seems to be just becoming popular more recently.  My recent trip to Montreal I was introduced to La Milsa.  Its has a very hip and modern look.  Everything was red.  Its right in the heart of downtown Montreal so of course its very busy.  No reservation could mean you will get turned down or you will have to wait a very long time.  I've been to my fair share of Brazilian steak houses in the GTA but La Milsa I have to say is on its own.  They do thing different then in the GTA.  Instead of your usual buffet all the sides are brought to your table and of course are unlimited as well.  he meat selection was about half of what we have in the GTA but was very tasty and cooked to perfection so say the least.  The services was very slow which left me waiting hungry quite a few times.  Had to ask for chicken like 7 or 8 times before they actually brought it to me.  Price wise La Milsa is just the same as going to any other Brazilian steak house.  May stop by La Milsa at some point in the future."}
{"text":"All you can eat meat was very good - most of the meat are very well cooked and well marinated thus super tasty.  However, i was very disappointed that the grilled pineapple was NOT all you can eat. How come they can afford to have all you can eat meat but not the pineapple?!? Mind boggling. For almost $40 on Fridays and Saturdays, you can't accommodate that?  As other reviewers have mentioned, the dancing music is super loud."}
{"text":"L'endroit parfait pour tout carnivore qui se respecte! Ambiance parfaite mais propreté de la toilette qui laisse à désirer!!"}
{"text":"This was my first Brazlian steakhouse experience, and as much as I hate chains (and as American as this may make me sound), I wish it would have been Fogo de Chao.  The quality of the meat was questionable and, as I read in a previous review, they were much more generous with the cheaper cuts of meat, only offering up the filet or ribeye if you specifically ask for it.  I was also underimpressed with the side dishes.    Don't get me wrong, it's hard not to enjoy a night of eating unlimited meat, I was just expecting a much higher quality experience!"}
{"text":"Although the food is good and there is a good flow of service, I was a bit baffled at the fact that they would not provide a second cup of coffee with dessert. Weird when everything is all you can eat but the cheapest thing to offer your patrons is not an option. Seems a bit petty on their part."}
{"text":"Le Milsa, c'est pour les mangeux de viandes. Les serveurs munis de broches fumantes te coupe l'animal directement dans ton assiette; filet mignon, porc, buf, saucisses, bacon de dinde.. Overall le concept peut être très agréable lorsqu'en bonne compagnie.   J'y suis allée pour l'anniversaire d'un ami. Puisque je suis pas folle de viande, j'ai choisi le saumon, dont la cuisson était parfaite. Il y a aussi des à côtés un peu anodins qui viennent à volontés avec toutes les assiettes, alors j'ai pu manger des champignons et des patates douces quand j'eus finis mon plat et que les autres se délectaient encore de rouge. La bouffe, top notch, rien à redire.  Il y a aussi un carnaval en repeat sur des TVs et pendant 30 minutes il y a une danseuse en paillettes qui vient divertir la foule du restaurant principalement constitués d'hommes fêtant a) leur enterrement de vie de garçon ou b) leur anniversaire. C'était quand même drôle.  Là où l'expérience a pris un tournant désagréable, c'est au niveau de notre serveuse principale (on a plein de serveurs, mais la je parle de celle a qui faut donner du tip). Nous étions un groupe de 20, et jamais elle n'est venu se présenter ou nous servir de l'eau. Y'a même quelqu'un du groupe qui est aller s'acheter un coke diète dehors au milieu du repas et qui est revenu avec la bouteille dans le resto parce que \"hey, elle nous sert pas d'eau et j'ai soif!\". Y'a fallu qu'on demande à la pauvre fille qui nous apportait le pain de nous donner de l'eau, elle on voyait la peur dans ses yeux parce qu'elle savait que c'était pas sa job et qu'elle pouvait de faire chicaner. Elle je l'aimais, elle était fine. La serveuse principale par contre, non.   Dès notre arrivée, elle nous demande avec son air bête si on veut consommer de l'alcool, et si tu en prends pas, elle va revenir 8 fois te demander si tu veux boire quelque chose, juste pour être sur que tu aies pas soudainement envie de dépenser 60$ pour un pichet de liquide qui ressemble a du carwash. C'était juste ça sa job, nous servir de l'eau et l'alcool, mais on dirait qu'elle a eu 50% dans son test de serveuse.   Ensuite vient le temps de payer. Et la première chose que tu entends quand elle arrive c'est OK LÀ SI TU AS PAS PAYER TU RESTES ASSIS. Elle a même limite envoyer chier le père du fêté parce qu'il voulait se lever pour.. Ben pour être debout parce que c'est long 4h assis! Elle prend les facture de la première moitié du groupe, repart.. Et c'est après 30 minutes de disparition qu'on s'écure et qu'on va la voir à sa caisse. Elle devait avoir de la misère a trouver le bon bouton pour faire les factures qui étaient toutes au même prix parce que le menu est à un prix unique tsé. On a clairement pu observer un échange avec son patron lorsqu'il lui a demandé ce qu'elle faisait et pourquoi tout le monde avait pas encore payer, et qu'elle lui a répondu \"ben je fais payer une moitié en première, puis je sors les factures pour l'autre moitié après!\" Mais la cerise sur le sundae, c'est quand elle nous dit que quelqu'un a pas payer. Et qu'elle a obligé quelqu'un à payer le repas supplémentaire. Nous traiter de voleur, pardon? On a tous l'immense certitude qu'on a gaspillé plus de 100$ pour deux chez vous, et tu oses nous dire qu'on te doit un repas de plus?   J'ai jamais été une grosse mangeuse de viande. Mais là c'est définitif, le Milsa, plus jamais.  Shoutout à la ptite jeune blonde qui nous servait de l'eau et du pain. Lâche pas."}
{"text":"Never going to this Milsa location again. I've been to the one at Bishop, and although the service was never stellar, it was much better than the service I had the le Milsa on Saint Catherines. I knew what level of service Milsa offers (mediocre) so I was worried when we arrived at around 9pm (service at great restaurants isn't supposed to fluctuate). We sat down and the waitress said she'd be right with us. Our table did not have plates, glasses, or utensils. Twenty minutes later the waitress finally walks by us, we get her attention and she lets out a gasp (acknowledging that she forgot about us, I assume). She brought us plates. The meat arrived shortly after. We started with sirloin (usually they start with cheaper cuts, like pork). The sirloin was extremely tough. So was the lamb. And the pork. You get the picture. Everything was so overdone, it felt like I was eating leather. At this point, I stopped ordering meat (I think I had 4 bites total) and just ate my $30 meal in salad (I hate their rice). At this point, they still haven't given us water, so we asked for water...3 times. An hour into our \"service\" we finally received empty water glasses. Ten minutes after that, the water pitcher came. We heard other tables around us (who got there much earlier than we did) experience the same sort of service. I brought this to the attention of our waitress, who understood but said \"maybe it's because it's late?\" I responded \"if service is going to suffer after 9 o'clock, be up front with your clientele and simply stop service and let them know the kitchen is closed. I would have gladly gone some place else for a meal I would have actually enjoyed.\" The waitress seemed really understanding and apologetic, and 2 of the servers were really sweet (both men). All in all, the service was slow, the meat was cooked terribly, and for the price it certainly wasn't worth it. They also seemed to be having a Tuango promotion that a bunch of people were claiming (a $30 dinner for 2) ..but we paid full price. It was not worth our money in the least. Won't be coming here ever again. Which is a shame. Oh and I'd also like to mention that the restaurant doesn't have it's own bathrooms. You actually need to go through a connecting door, into another restaurant to use their bathrooms. It was very dirty and disturbing. And the locale where le Milsa is used to be an old bar from what I can tell, and it doesn't look like they renovated much. The tables and chairs were very 80's looking, and for a brand new location it 's a let-down."}
{"text":"What a horrible experience I had at this restaurant! I had the unfortunate luck of attending a friends birthday party at Milsa.   They are well-equipped for dealing with larger groups. Unfortunately they don't know what the hell they're doing. Even though they come and dump all the sides on the table for you to pick at, and even though all the meat comes to the table with some unhappy guy and a sword, they still manage to turn this into an extremely long evening.  The food is really nothing special. Unless you're one of the XXXL people who live and die at the buffet table, you can do so much better than this restaurant.  Now let's talk about Brazilian culture. Do I really need to see some young girl dancing around a room in a glorified bikini while I'm trying to eat my dinner? I felt creepy. The whole thing seems quite inappropriate to me.   Don't go!"}
{"text":"Si vous aimez la viande, ou mieux si vous l'adorez, vous allez être aux anges en sortant de ce restaurant brésilien. Le menu est assez simple et, du reste, presque tout le monde choisi, avec raison, Le Tourniquet, qui est la spécialité de la maison. Pour à peine 30 dollars, cette option du menu vous permettra de manger quelque 10 sortes de viandes à volonté, que les serveurs vous proposeront régulièrement à tour de rôle. En effet, les serveurs ne vous amènent pas de nouvelles assiettes, mais passent de table en table avec une viande qu'ils tiennent sur une broche et en servent à volonté. Après le dixième service, il est fort à parier que vous n'aurez plus faim, mais si vous voulez continuer à vous régaler des viandes proposées, vous pourrez continuer! De plus, en accompagnement, on sert du riz et une petite salsa qui est excellente sur les viandes les plus sèches. Un incontournable pour tous les carnivores qui s'assument !"}
{"text":"Amazing food and service. This is my first time having Brazilian BBQ and I totally love it!"}
{"text":"Pour 40 dollars (taxes et pourboires compris) on vous sert un repas de viande à volonté. Dans la tradition brésilienne, le serveur vient à votre table avec un morceau de viande sur la broche et découpe le morceau à votre table. Une dizaine de viandes sont au menu: saucisses, dinde et bacon, roast beef, haut de surlonge (picanya), poulet, porc, agneau, filet mignon etc. etc.  Les viandes sont accompagnés de salade, de patates douces, de riz et de champignons sautés. À la fin, le dessert (ananas roti à la broche ou crème glacée) et une boisson (café ou thé) sont également servis.  Il convient de réserver parce que très souvent le restaurant est occupé par de très grands groupes. Notons en terminant que la cuisine ferme à 22:30  L'animation peut être assez bruyante (musique à fond) pendant que des danseurs et danseuses brésiliens vont et viennent entre les table."}
{"text":"Pour le décor c'est assez simple et chaleureux sans luxe. Quelques objets et la TV qui passe un défilé Bresil nous rappelle ce pays.  Pour amateurs de viandes c'est idéal. Au moins 10 viandes grillés sur charbon de bois. Le serveur nous offre le cocktail maison. Similaire au mijito mais sans menthe. Très bon. Le service est particulier à part la salade , le riz et les champignons, tout était sur la broche. Même le pain a l'ail. Nous avons eu droit à au moins 5 sortes de poulet , a l'ail, au bacon, ailes etc. Ensuite la saucisse , le surlonge de boeuf ainsi que le filet mignon. Toutes les viandes étaient delicieuses. Grilles juste a point pour le boeuf. Très bien assaisonnées. Le desser est très ordinaire. Crème glacée our morceaux d'ananas grillé. Le café etait vieux et pas buvable. Désolant pour finir un bon repas.   Les points positifs:  Stationnement facile Excellent service Bonne qualité de viande et bonne cuisson sur le charbon de bois Belle ambiance Brésilienne   Les négatifs   Le prix du menu tourniquet. Même si c'est a volonté, 36$ est dispendieux.  Le prix de notre mijito? 14$. Exagéré au cube La liste de vin est très limitée Le cafe n'était pas frais Un bâton en plastic pour brasser mon cafe pas buvable ça fait fait food.  La facture : 4 mijito ,2 menus tourniquet a volonté , dessert (ananas) et café. 147$ avec les taxes avant le pourboire.   J'y retournerais mais pas à ce prix."}
{"text":"Le Milsa is a legend spoken by many and apparently not enjoy be enough. This legendary offers two things every carnivore desires, all you can eat meat, and no need to rack (no pun intended) your brain about which to try because the answer is all of it.  Sit back with friends and family while letting the skewers of roast beef, chicken, filet mignon, lamb, and many others be delivered to your plate no questions asked.   Don't be fooled by the complimentary bread or salad... They're just taking away space from the MEAT!!   For vegetarians there is a grilled vegetable plate which is also fantastic.  The ambiance is incredible, live Brazilian dancers entertain while servers come by with the goods.  Among the best Brazilian barbq in the city, and experience not to be missed."}
{"text":"Le Milsa is the place to go to have \"Meat on a Sword\" and I am not kidding. The meat is amazing, and tastes really good, the prices are reasonable, but the drinks (even soft drinks) are more expensive then usual. Great for a night out."}
{"text":"Un mot : DÉGOÛTANT !!!!!! Au debut ils vous disent qu'il y a dix sortes de viandes à goûter mais le service est extrêmement lent et vraiment mal organiser . Je n'ai pas eu le temps de goûter au dix sortes de viandes tellement que j'en avait marre d'attendre je suis partie. Les viandes sont tellement salée c incroyable et de plus elles ne sont pas du tout bien cuite . Par contre les serveurs sont très gentil et agréable. 48$ je vous jure que ca ne vaut pas la peine c très décevant comme restaurant, un des pires restaurant que j'ai visité jusqu'à maintenant. Gaspillage d'argent mais aumoin l'ambiance est bonne avec la danseuse brésilienne, c dommage que pour 400 personnes il y avait seulement une seul danseuse . Bref je vous déconseille fortement d'essayer ce resto ."}
{"text":"Un mot : DÉGOÛTANT !!!!!! Au debut ils vous disent qu'il y a dix sortes de viandes à goûter mais le service est extrêmement lent et vraiment mal organiser . Je n'ai pas eu le temps de goûter au dix sortes de viandes tellement que j'en avait marre d'attendre je suis partie. Les viandes sont tellement salée c incroyable et de plus elles ne sont pas du tout bien cuite . Par contre les serveurs sont très gentil et agréable. 48$ je vous jure que ca ne vaut pas la peine c très décevant comme restaurant, un des pires restaurant que j'ai visité jusqu'à maintenant. Gaspillage d'argent mais aumoin l'ambiance est bonne avec la danseuse brésilienne, c dommage que pour 400 personnes il y avait seulement une seul danseuse . Bref je vous déconseille fortement d'essayer ce resto ."}
{"text":"All you can eat meat, i'm not a big lover of meat but I have the opportunity to go with my family and I really liked it, the service is excellent and the indoor decor is very unique."}
{"text":"I went to milsa three times. The first time in Quebec city, the second time in Brossard for my brother birthday and the third time, it was the same place with my boyfriend.   I love the concept of all you can eat meats, rice, mushroom and pinneaple. I don't like to eat meats that much but once in a blue moon, I need my fix.   My second was pretty good. Last time I went, I was disappointed at the meats selection. everything tastes so bland except the filet mignon. I was disappointed by the lack of services for some of our side dishes. it took about 10-15 of wait time before we started to say sonething.   My past milsa experiences have taught me to be nicer because bad services happen."}
{"text":"The concept of the Milsa is nice. Different waiters walk from tables to tables with different types of meat on a sword. You want some? Say yes. You don't? Just wait for the next waiter. All that is served with rice, mushrooms and sweet potato.   To add to the exotic feel, there is a dancer going around inviting people to join her. I have to say she was very respectful of those who prefered not to, and wasn't insisting, which was appreciated. The music and people dancing created a loud, but enjoyable atmosphere.  Honestly, the only down side was the quality of the food itself. Not horrible, but average. Very salty, sometimes overcooked. I guess they want you to drink more so you'll eat less."}
{"text":"O.M.G.   This is like an eater's paradise. Meat, Meat Meat....More Meat. Can I have some more meat? You will never find yourself asking for more MEAT as its constantly being brought to you until you beg them to please stop bringing me more MEAT!  Everything we had was delicious. EVERY.THING."}
{"text":"Absolutely loved this place.   I had a great time. The meat was cooked perfectly, but traditionally, the meat is quite salty so get ready to load up on sodium. The caipirinhas are strong, as they should be, for $8 for a tiny glass.   Dessert was good, even though I have no idea how we made room for this.   I've heard people saying that even though it is \"all you can eat\", the service slows down after you've been there for a while. I disagree, we were there for an embarrassing amount of time, and the meat just kept coming.   I will go again the next time we visit Montreal."}
{"text":"I went there for a all you can eat meat. The food was ok. Some were too tough, some were delicious and juicy. It all depended on the food we were offered. They came quickly and with number to our table. They always refilled everything we needed when we needed it.  When it was time to pay, the server asked us where we came from (we were all asian). Intrigued, we just answered his question. However, the followup question was extremely rude and I don't know how the restaurant even permit that kind of person in their staff. He asked us if we pay very low tip in our country. We were asians, but we all lived in Montreal for almost all our lives and are mostly students.  Ok? Really? What kind of waiter asked that kind of rude questions? He asked us after we paid, but we wouldn't have paid ANY tip if we knew."}
{"text":"Not impressed at all i was expecting better food and better ambiance.  I am what you can call all-eaterian :) i eat everything, (OK my all favorite is seafood) but i absolutely cannot pass on a good grilled meat. A big variety of meat on a sword (sirloin fillet mignon, chicken, sausages etc...) but its just OK, your cut could vary from burnt to rare, many pieces were salty. saute mushroom was very good as well as the sweet potato, salad was OK. I wasn't impressed and i usually prefer a very good piece of meat than an ok all you can eat, at the end you can eat what your body can take and over stuffing your stomach is not the right thing to do. Prices are high for what your getting even if you don't take the all you can eat menu you still end up with 30$ just for a piece of salmon or chicken and a soft drink (without the tip) 45-50 for the 10 variety menu , this is on a regular weekday (45-50$ on weekend) on weekend. Service was very good and fast, the restaurant was not full so i don't know exactly how things will change on a regular weekend night. its always good to try things but i  don't think i will  revisit this restaurant in the future."}
{"text":"Only reason I didn't give this a perfect 5 star rating was that a 2 or 3 of the meats were more on the overdone and dry side, and I'm more of a rare lover. But MOST of them were VERY tender and juicy! I enjoyed it very much :) Gave me the dam meat sweats !  They had a lot of meat variety, which was very exciting. A lot of them were quite flavorful, so it was quite enjoyable to try each different one. I'm happy that they kept slicing thinly, because I wanted to try everything, and was getting quite full. So hard to say no to meat lol  I've been to their other location not far away, and it was mostly dry except for one item, so this place was much better, and others at my table discussed that the one in the west island that they've been to also had dry meat too, and that it was better here.  Mushrooms ok but no punch Sweet potatoes good Red beats interesting to see and nice Rice bland :( Salad fresh but mostly \"leaves\"  \"Ranch?\" dressing tasted homemade :) \"Spicy\" sauce on the side for meats gets a flat ZERO. It had zero flavor and was not spicy at all. However, one waitress apologized and was nice enough to give us a new mini tobasco bottle... we finished the whole bottle! and, it still wasn't spicy enough per each bite lol not a fan of tobasco, but it's better than nothing when you want spicy. Their cinamon roasted pinapple was out of this world :)  Their service was really great too. They were always around to make sure our waters were full and that our side dishes were refreshed. Super friendly, and I was so happy that they seemed to have no problem putting up with one of our more difficult companions, like that was finess. They were also very helpful with details, and if they didn't know something, they would come back with the answers and always check up on us.  The all you can eat option was great, though they also offered a separate saumon or cornish hen option, which made me feel awkward because one person with us opted for it, yet they couldn't resist asking us for pieces of our AYCE meats. The waiters were very nice to look the other way about it, so that was a relief.   Our companion who opted for the cornish hen... their dish was huge! She liked it a lot, though it really felt out of place with the rest of our ayce. Their AYCE pasta/pizza option sounded interesting on their 2nd level, and was cheaper, but, pft, come on, like i'm going to turn down meat lol  I thought it was more expensive on the weekends because of their dancers, but we arrived too early, and their dancers only come later at night... so I can't say I'm too happy about paying 10$ extra for a show I didn't see. Had we known, we would have made our reservations for later.  The male waiters were surprizingly hawt and cute, and not awkwardly friendly, acted very normal and comfortable. The less good looking ones were a nice eye palete cleanser and helped remind me that this place was real and not a strip club, and they were very pleasant to come either way, since they all kept that proffessional yet comfortable ambiance.  I like the uniforms. Looks comfortable and not awkwardly sexy or bland/formal like most restaurants. When the workers are dressed comfortably, then I can eat comfortably. The soccer theme is kinda cool.  I suggest they invest in better hot sauce (obviously) and eventhough I can tell they coat their meats with fats often while cooking them, we can tell that they put the heat too high to cook the outside of the meat fast, serve only the outside, then bring the inner part back to cook all the way through. This is why their meat goes dry no matter how much fat they paint on while cooking. Would be better to cut the meat chunks thinner to cook the whole thing evenly on a lower heat for longer and do it more often with prep. They know how much they need on an average night. Not a fan of this corner cutting tactic, as I'm sure their other locations are doing it and can tell it's not the best method. Eventhough I found the meat at this location to be the least dry, everything was still more on the well done side, and it's not like they initially ask you how you like your meat before serving.  Ditch the cornish hen and saumon option. Eventhough it's 10$ cheaper than the AYCE meats, it feels very awkward for the rest of the table to eat with that 1 obnoxious person among us who orders it. There's already chicken included in the ayce meats and the side dishes are the exact same anyways, so ditch the cheaper non ayce options, and can replace it with fish of the day (for same price as ayce so we don't have to sneak them the tempting meats and they can indulge with us) and just lay the fish out nicely on the table for us to help ourselves while we wait for our meats.  The side dishes are useful as pallet cleansers only. I'd rather cleanse my pallet with raw celery/carrot/cucumber sticks. Potatoes and beets can stay, but the rest can go. White potatos would have been great because they absorb meat juices better than sweet potatoes."}
{"text":"What a disappointment! Being a Brazilian, I was sad to see a restaurant that charges a lot but offers to little.  Usually, a real Brazilian bbq place has a salad bar with several options. At La Milsa, they serve you a bowl of (boring) salad, plus a little bowl with rice, mushrooms, and a sweet potato on the side.The rice doesn't taste like regular Brazilian rice at all. It was dull. I never saw a churrascaria without farofa (yuka flour), vinagrete, and even a basic pao de queijo (cheese bread), all basic Brazilian side dishes. The meats were okay but, for the price you pay, there isn't a good variety. For dessert, you have two choices: grilled pineapple or a scoop of ice cream. Usually, in any Brazilian churrascaria, the pineapple is part of the main course (along with the other meats), and not a dessert. It's surprising they don't offer passion fruit mousse and even a milk pudding, both very basic in any Brazilian restaurant and very easy to make. When our kind waiter served some slices of pineapple to my husband before the \"dessert time\", the  owners didn't look happy with the waiter. Another surprise: they don't have guarana, a very popular soft drink. If you go to any Brazilian place and they don't have guarana, it's a sign that it won't be good. As a bonus, the DVD on the TV was showing the Rio de Janeiro carnival parade, but from 2011! It's amazing they can't play a DVD with good Brazilian music.  As a Brazilian, I felt embarrassed that people could go to this restaurant and think that bad food and service could be really Brazilian. It's not."}
{"text":"We haven't tried a Brazilian Churrascaria restaurant in Montreal. After we found a Groupon deal, we were happy to try it. With this deal, we had two all-you-can-eat turnstile style and a drink, and the price is 32$ per person before the taxs and tips.  Regular price for Weekend is 38$, week day 32$ There are 9 kinds of BBQ items. The choices are enough for me. In addition there are rice, mushroom, sweet potato, salad, and two sauces. Pros: The portion is generous. Our waiter always asked whether we need more pieces. The salsa is very flavor and refreshing. The salad is fresh but simple. The mushroom was tasty. Cons: No salad bar. The meat was not well marinated. The garlic bread was too oily to my taste. The weekend meals charge 6$ more per person but with no extra menu or performance. The place was pretty empty. For the dessert there are ice cream and grilled pineapple, coming with tea or coffee. We asked for a coffee and a tea, but the waiter asked whether we want a Brazilian coffee. We didn't know the difference and thought it was a better coffee here but it turned out to be a cocktail with extra charge. We didn't like it."}
{"text":"Je suis vraiment déçu de ma dernière visite! J'y vais depuis 5 ans et la dernière fois on a été 20min sans se faire servir de viande pour un 2e service alors que c'est sencer être à volonté! C'est dommage mais vous ne me reverrai plus jamais chez vous!"}
{"text":"With the lusty reputation of being a man's paradise where you get served your heart's desire of meat on a stick, cut with swords I couldn't help but try it once in my lifetime.  DECOR :  You can't help but notice huge fake palm trees outside of the place. I was baffled. I didn't know Brazil was known for its palm trees. Welp! You learn something new every day.  This is a huge restaurant with no booths and large tables everywhere. The ambiance is warm and inviting with an impressive modern bar.  Lastly, I assume I can consider the belly dancers decor as I have no where else to put them in this review. It was scandalous! You try to enjoy a meal then some saucy ladies show up in silks and shake their valuables in your face as you try to focus on eating your meat.  The nerve.   FOOD :  I took \"The Turnstile\" experience which consists of 10 kinds of meats grilled on charcoal the Brazilian way. The selection is \"at heart's content\". The meats are pork sausages, chicken legs, turkey breast with bacon, roast pork, top sirloin, strip sirloin, flat sirloin, contre-filet, rib of beef, rib steak, filet mignon, lamb, etc. served with salad, sweet potatoes, rice and sautéed mushrooms.   Obviously, when I ordered this my eyes were popping out of my head. Will this be an experience like none other?  Sadly, everyone likes their meat a bit different and if you like your meat being burnt on the outside and raw-ish on the inside, you'll find a lot of cuts \"meating your desire\". If this is the Brazilian way, I'm afraid of visiting another Brazilian restaurant.  Furthermore, what's up with the salt cooks? Hey cooks! A little salt. Don't marinate the meat in it!  \"I can't even taste the meat at this point!\" I exclaimed angrily as I chew some overly salty burnt on the outside filet mignon while not being bothered by the gooey pinkness of the inside. I paid $30 for this meal and I will EAT IT.  None of the meats stood out being excellent. They ranged from bad to good with most leaning on the mediocre side of the scale.  The mushrooms and grilled pineapple were very good however.   SERVICE :  The service was very disappointing.   At no point or time did our table of 10 know who was our primary waiter. Some of us ordered drinks only to have another waiter ask if we wanted drinks 20 minutes after we ordered the first round and still haven't received our first wave of drinks.  The gentlemen who passed around with the meat and swords were always frowning and looked unhappy at what they did. Why? It's such an awesome responsibility. Why be sad?  At first it was off-putting, then after I made the joke about not messing around with unhappy service who carry swords. The joke lingered until the end of our stay.  When we sat down, they served our side orders right away and we waited for the meat to show up. 5 minutes go by, then 10... 15....  20 minutes... while our side-orders went cold with no one telling us when to expect the \"Feast of Meat\".  Eventually it came, we asked for fresh side-orders which came right away and we moved on with our evening.  Furthermore, kindly note that they WILL try to stuff you with their cheapest meat while the good stuff \"somehow shows up late.\" You can have pork sausages and pork roast anytime you want.   PRICE :  A 30$ buffet style place is pretty standard with most extras being what they are, overpriced. Nothing more you'd find it anywhere else.   MY HEART :  Broken. My meat desires were crushed. Why? Why?!??!?   BOTTOM LINE :  I give The Milsa 2 stars. I'd give it 1 but I cannot... the mushrooms saved them from earning that note form me.  Saved by mushrooms. Really? Yes, they were very good.  Specialized in meat? Avoid 1 star rating by internet food critic because of mushroom.  Brilliant.  Anyways, the food was lackluster, even heart crushing. How can you suck so much at serving MEAT? I'm a man, I'd meat anything meaty. I didn't get my meat quota out of this place.  The service was lackluster as well. Slow delivery of meal, unhappy and unclear service.  Will I go back? Absolutely not.  I already visited this place 3 times.  The first time, the last time and one time too many!"}
{"text":"Ya I really like this place.  It's like a rotisseries where the waiters bring rods of meat to you every 2 minutes and all kinds of meats too (like sirloin, chicken, turkey, etc). The food here is really good and the service is good. I like it. It's a meat lover's delight!  My only complaint is the selection of drinks here. It's a bit limited."}
{"text":"Was here for a birthday, originally attracted to the festive atmosphere and all you can eat meat - proved to be fun, although a little too \"in your face\" with the super loud music and dancers shaking their booty at you every hour.  This is a good place to come as a group, but I wouldn't recommend it as a date unless you're not the type to get embarrassed easily and have a lot of patience.   I've been to this location on Bishop and the one in the gay village, similar experiences. The one on Bishop is much smaller and cramped.  Basically you choose from a set menu, which comes with all you can eat salad, rice, sweet potatoes and mushroom and wait for the guys to pass around with skewers of meat. My favorite were the turkey wrapped in bacon, filet mignon and anything beef. Tried some of their sausages and ham, although those are extremely salty.   Even though it's all you can eat, it really depends on what is being served and how often the guys come around. You can be sitting for a long time waiting for your favorite to arrive. If you're extremely hungry and need to stuff your face at once, this will not be the place for you!  Dessert consists of grilled pineapple or vanilla ice cream, although it is NOT all you can eat dessert.  It's around 30$ a person, a unique concept- I can't vouch on whether his place is authentic Brazilian food or style as I've never had anything else.  Bottom line, it was tasty and fun, very loud and best to come as a group where everyone can chat while they wait to be served."}
{"text":"I went to many other Milsas, always with great experience. But this one was by far one of the worst restaurant I have ever been to. Horrible service, they kept mixing our orders (drinks), the wait was horrendous and the meat was raw. It was disgusting and very disappointing and I would never recommend this place to my worst enemy. If you don't want to get seriously sick and disappointed, don't go there"}
{"text":"I think downtown location was better than the west island location , meat came around more didn't seem like I was waiting for meat,  The west island location was ok but ended up waiting for meat long periods of time and after 2 or 3 offers they just asked us what type of meat we wanted as there weren't many people for a Saturday night"}
{"text":"Viande excellente! Vraiment à recommander pour les amateurs. La formule à volonté est top pour permettre cette découverte. Le dessert est un peu décevant, l'ananas : on en voudrait plus! La musique y est un peu forte pendant les shows mais pour le reste c'est un régal!!!"}
{"text":"Pros - The meat is A1. Very delicious and mouthwatering - The carnivale dancers are an awesome addition and fun to watch - All you can eat meat!! Are you kidding me??  Cons - The manager, after moving us from our already seated and reserved table, shoo-ed us over to another spot to seat his friends. Rude. He promised drinks free drinks but charged at time of billing then disappeared.  How it works: Upon seating, you order either a specific dish or the \"turnstile\". With the turnstile you get a one-time serving of side dishes and a coaster. If the coaster is on the green side, waiters holding large skewers of meat will approach you and offer you. Flip the coaster to the red side when you've had enough.  Caution:  They try to fill you on the cheap stuff first. Hold out for filet minion!"}
{"text":"La viande du Milsa vaut le détour. Toujours de qualité et a volonté, c'est un endroit désormais incontournable pour moi. Le concept est rodé et j'y adhère complètement. Service quelque peu approximatif lorsque le restaurant est plein mais j'ai connu pire. À faire et à refaire."}
{"text":"Better than I expected. The meat - while a bit too salty - was reasonably good. The basic all-you-can-eat offers 9 or so different meats, so you should find something you like. I personally enjoyed the roast beef, sirloin, and chicken thighs. The meal also comes with: bread (meh), salad (simple), beers and sweet potato (meh), sautéed mushroom (quite good!), seasoned fries (quite good!), and rice (didn't try). Their Brazilian cocktails are nice as well.  Service is friendly - but trying to get your desired meat can take more effort and time than necessary."}
{"text":"Petite découverte brésilienne. On mit à invité pour ma fête. L'ambiance est très festive. Il y avait plusieurs groupe pour des anniversaire ou d'autre événement. Durant la soirée, éventuellement, la musique démarre et une danseuse avec un danseur débarque et se déplace partout dans le restaurant. Comme l'endroit est bien à découvert, nous pouvons les suivre peut importe où ils sont. On peut aussi se joindre à eu pour danser.  Pour la nourriture, il y a deux choix pour le souper. À la carte ou à volonte  Le repas à la carte consiste en un repas de poulet et un d'agneau avec plusieurs accompagnement. À volonté, il s'agit du tourniquet. Le principe est simple. À votre table vous avez un jeton oui/non pour indiquer que vous voulez autre chose. Puis, des serveurs passes avec des viandes et vous la propose. Agneau, saucisse de porc, saucisse de boeuf, porc, poulet et bacon, roastbeef, filet mignon et j'en passe. Comme accompagnement, riz, patate douce, salade, frites, betterave...  Comme vous lirez dans les autres commentaires, la viande est très salé. En fait, elle a beaucoup d'épice et comme les épices ont souvent beaucoup de sel, cela augmenté le taux de sel global. Par contre, comme je suis un amateur d'épice, c'était parfait pour moi. Vous pouvez demander des morceaux plus saignant ou juteux, il seront alors couper plus au centre et ils ont alors moins d'épice. Pour ma part je préfère bien cuit avec assaisonnement alors je faisais le bonheur de mes hôtes.  Deux personnes à ma table m'ont indiqué que les autres miles (Longueuil et Montréal dans leur cas) n'avais pas autant de sel sur leur viande et ils ont trouvé cela salé.  Malgré cela, on a tous très appréciée notre repas. Je ne suis pas le plus grand amateur de viande mais c'était vraiment bon.  Pour dessert, vous avez le choix entre crème glacé ou ananas grillé. Je n'aime pas les ananas mais j'ai décidé d'essayer tout de même. C'était très bon. Il est grillé avec du sucre et de la cannelle. Cela goûtait la croustade au pomme.  Ensuite pour le service. Cela peut paraître long au début, comme les pièces de viande ce déplace tu semble attendre un certain temps. Mais quand ça commence, tu te danse où tu vas tout mettre. Pour les extra comme l'eau, remplissage des accompagnement ou autre, vous accrochez n'importe qui et vous l'aurez rapidement.  Une belle expérience et une belle découverte. Est ce qu'il existe mieux ailleurs, selon d'autre personne yelpeuse oui, alors je devrai allez voir les autres coins de paradis. Mais si on m'invite au milsa, je sais maintenant que je n'ai rien à craindre."}
{"text":"Service was slow at times, generally the food wasn't on par with Chima or forgo de chao.  Overall not bad, but I won't go back."}
