{"text":"This place has kinda become the back up to my staple breakfast place. When I get bored, I come here and for the most part all goes over well.   Pro   - Breakfast (eggs and bacon) are always pretty consistent and done to meet expectations.    - Service is friendly (even in English)   - Banana Bread is AMAZING  - Pretty decent prices.   Con   - Sometimes the wait can be a little much. Be it waiting on a table (watching bus people walk around looking lost) or the kitchen having a bad day.  - The floors need a really good scrub  All and all - It's not out of this world but it's not the worst either. Besides, its just eggs!"}
{"text":"guy i was surprise... amazing breakfast great staff very friendly. huge plat definitely will go again and again....."}
{"text":"Premier brunch à Montréal depuis mon arrivée et je ne regrette pas l'avoir pris au Nid de poule. L'endroit sympa à la déco originale et bien choisie...bref agréable pour un dimanche matin. Les serveurs sont accueillants et tr`s gentils. En ce qui concerne le plus important...la nourriture! Rien à redire. J,ai pris le brunch Nid de poule et tout y était: fruits frais, pancake, oeufs brouillés, lard et saucisse sans oublier le jus et le café à volonté. Rien à redire. J'y repasserais peut-être un de ses jours."}
{"text":"Mes expériences au Nid de poule furent, comment dire... Inconstantes. L'endroit ne cesse de changer d'administration depuis mon arrivée sur le Plateau il y a deux ans, mais je ne réussi pas à dire s'il y a vraiment eu une amélioration au fil des changements. Je m'explique:  Premièrement, le restaurant ne fait pas de patates traditionnelles, ils font des röstis, qui sont en fait des galettes de patates râpées qui sont ensuite frites. C'est cool quand tu as envie de röstis, car c'est pas commun comme staple de restaurant déjeuner, mais pas cool quand tu as envie de petites patates et qu'il est pas spécifié sur le menu que les patates comprises avec chaque plat ne sont pas des petits carrés tendrement assaisonnés. J'ai un deuil à faire sur le déjeuner que je viens de manger, excusez mon acharnement sur le sujet. Deuxièmement, ils ne sont pas capable de faire une omelette. Je me suis plutôt retrouvé avec un amas trop gros de garniture et d'uf semi-brouillé-but-on-the-dry-side, en dessous d'une croute de fromage suisse (mais ça c'était mon choix, je la voulais gratinée mon omelette parce que #yolo). Vient dernièrement le cas des fruits, 3 solitaires tranches de melon qui semblaient avoir commis un pacte de suicide (aka, maigrichonnes et garochées dans l'assiette). En bonus, j'ai trouvé deux cheveux noirs dans mon assiettes, pour combler le manque d'assaisonnement j'imagine!   Wouh, that was harsh. J'ai clairement encore le manque de patates sur le cur. Mais j'ai eu de belles expériences antécédentes et si vous avez envie d'un déjeuner pas trop compliqué, c'est toujours mieux ici que d'aller chez Cora en face!"}
{"text":"What it looks like inside: Monster truck meets rural housewife in a clash of décor about as compatible as a bad marriage. The large format graphic text wall murals in acid yellow and random road signs do nothing for the tole painted flower and chicken wooden crate details. It's like your grandmother and your nephew... you know. Am I done yet? NO.  Is the food at least in good taste? I ordered a standard egg breakfast: two eggs over easy, home fries, toast, coffee - you get the idea. Typical breakfast diner fare, which was what the menu promised. What I got was a scant plate of food that included *cold* eggs, a flattened blob of shredded potatoes that had been thrown on a grill and burnt, with NO flavour whatsoever (also cold) as well as some barely buttered toast. The promise of fresh fruit was a tiny stack of bits of melon and pineapple held together with a toothpick. My breakfast arrived without my coffee and I had to request that the coffee I'd ordered be brought over.     How was the service? HORRIBLE. The waiter was clearly miffed that we spoke very little French and treated us like plague victims for the rest of our visit. This is NOT how I'm used to being treated in Montreal. Flaunting himself around the restaurant like the Queen of the Scene, and ignoring the fact that we were putting on our coats and ready to leave, he left (if the food did not) a very bad taste in my mouth.   My advice? Don't waste your money here. I'd gone in for a pleasant Sunday brunch and left feeling cheated."}
{"text":"I don't normally write reviews. I don't normally even consider writing reviews, but this place blew my mind.  We came in at 2:45 so it wasn't busy, the service was quick and the waiter was very nice.  But the main thing is the food. Holy crap...  For $13 each, three of us got three course meals.   Started with a cream soup that was surprisingly light, then a main that none of us could finish, then an amazing desert.  I guess it's partly that we're coming from Vancouver where everything is expensive, but I can't believe the quality and the amount of food you get for $13.  Another reviewer complained about the decor, and I suppose it's a little brash, but with food this excellent, who cares?"}
{"text":"Pour un bon brunch pas trop fancy mais délicieux : c'est l'endroit !   Points positifs :  - les assiettes sont énormes  - le service est gentil - les prix sont justes  - on ne manque jamais de café   Points négatifs :  - les tables sont petites  - comfort food plus qu'autre chose  - plein de touristes , mais ce n'est pas si pire"}
{"text":"L'endroit est sympa et lumineux. Les portions sont bonnes ; quand on sort de la , on n'a plus faim. Les gaufres sont bonnes. Et les prix raisonnables."}
