{"text":"After reading some great things about this place, myself and my boyfriend, including a couple of friends, decided to check it out one Sunday afternoon. I'm also planning on opening up my own breakfast cafe in the near future, so visiting and comparing various breakfast places is also helpful for my own market research. 

It being a busy afternoon, we had to wait 10 minutes before being seated. One drawback to this place was the size of the hallway, with people ahead of us already waiting, we had no choice but to wait out in the rain.

The layout is very long and narrow, with a simple brick wall. Very few artwork on the wall though (I saw one in the corner) so nothing to catch your eye while you're waiting for your meal, although the bar was neat to gaze at. 

Once seated, the service was fast and friendly. I ordered the Hardy Gal Breakfast ($9.95) and the cafe latte ($3). The latte was delicious but disappointing that it was served in a glass cup (as it makes it difficult to hold the hot contents). The menu was one page with the second dedicated to drinks. There was also a little section welcoming and thanking customers, with some history of the place included, a nice touch.

Our meals arrived exactly 9 minutes after ordering, pretty fast, and considering they were full on packed, quite impressive. 

The meal was good, but nothing spectacular. The bread was pre-buttered which I'm always in favor of. There was also a small shredded apple salad included which was lovely and complimented the rest of the dish nicely. When I asked for ketchup, it was served in a shot glass, hmm. Although I was satisfied with my portion size, the rest of my table was not. Total bill for the two of us, $30.

Overall, nice food, nice buzz but a bit overpriced."}
{"text":"The place was good, the wait was bit long, service was nice( she was very pleasant) . The order did take a bit longer than others. I had ordered the vegetarian omelette. The omelettes are super fluffy ( I wonder how they make it ) and the toast ( from homemade bread) was the other best thing. I loved the place. And again the eggs were super fluffy"}
{"text":"Belgian waffles done right. This cafe offers waffles, sandwiches and salads with some European flare. Try the smoked salmon waffle Benedict. It comes with a pickle and apple slaw that is the perfect mix of sweet and savory. Quintessential Toronto brunch."}
{"text":"This fun funky place is a great way to hang for breakfast. If you sleep in, not to worry cause this joint serves brunch until 3pm. Listening to the Smiths, Queen is Dead Album quietly playing in the background while we sit on glittery dark green banquettes that are surprisingly comfy! 
The service is fun and casual. Plays into the theme.
The croque monsieur is one of the best that I have ever had. A classic grilled ham and cheese. However, the bread is incrediblely fresh, topped w/ melted gruyere cheese.. Hmmm. The eggs Benny were cooked perfectly but the hollandaise was loaded w/ viniager. I suppose someone's hand slipped. Oh well, this place is not one that will be perfect but i would suggest sticking to things that they know... Waffles and croque monsieur's...don't go to this place of you're in a rush and all we be cool. In and out, 2ppl for under $30."}
{"text":"This place is good for:
- 2 people - large groups did wait longer than everyone else
- good size and tasty brunch if you're OK waiting for a table
- if you like the diner atmosphere

This place is not good for:
- large groups - even groups of 4 or more
- if you're really hungry and can't wait to eat

I came here on a Sunday at around 12 pm with a group of 3. We waited about 30 minutes - mostly in the cold as it's a small place and there were many other people waiting.

What I ate: Eggs Benjamin ($16.50) - 3.5/5
- the eggs and hollandaise sauce with the salmon were perfect
- I wasn't a fan of the apple coleslaw - I'd prefer some berries, mixed fruit, or even some mixed greens
- the potato rosti was OK - I've had better homefries at other brunch places (for example, Insomnia near bloor and bathurst)

Service - 3.5/5 
- the host and server were friendly. However, there was no system for those waiting. I would recommend taking phone numbers and sending notifications via text to confirm if those waiting can still make it or not. I find that many restaurants are starting to do this and it definitely helps to provide better service.

Overall, in my experience, I'm not sure the wait was worth the meal. It was good, but I would go back to try other plates, like the crepes and waffles, to be a better judge."}
{"text":"I've been here a couple of times now. Both times have been pretty good and service was great.  My first time I had the strawberry waffles that were yummeh - light, fluffy and the strawberries were fresh!  The server came by every so often to ensure that my coffee was topped up, which was nice.  The second time I had the salmon omelette which was good but not great - just a tad salty. 

Overall, it's a place I would recommend because the food is pretty good and the restaurant itself has a good vintage character."}
{"text":"I visited Le Petit Dejeuner on a Saturday afternoon, thinking it'd be a change from the usual spots I go to, and its a nice walk  from home. When I arrived at the place there was one person in line, waiting for his other 2 friends to arrive, so my boyfriend and I stood patiently in the enclosed glass cube between the street door and entrance, waiting to be acknowledged by the staff.. and we waited.. and waited...while many tables emptied up, before we were acknowledged and invited in to sit. I wouldnt really have had a problem with the wait, as long as someone said \"oh hello, give us a few minutes\". I thought it rude for the servers to walk by many times without saying anything. Also, they were pumping \"Daft Punk - One more time\" as we waited for breakfast. I don't really enjoy listening to daft punk while eating, let alone for breakfast.

We were finally seated, and told  they were out of smoked salmon right when we were handed the menu. Smoked salmon is my favourite part of brunch, so this was turning out to be a disappointment already. On top of that the tables were really close to each other, and it seemed like the 2 loud obnoxoius girls seated on the next table, were almost at ours, I know this isn't the establishments fault, but the closeness of the tables and the club beats pumping just added to the unpleasant experience. 

I ordered the Toast Champignon, which was salty, and needed the extra hollaindaise sauce that I ordered to make it acceptable. The coffee had a strange taste to it which i couldn't really place. The Apple coleslaw turned out to be the best part of my meal. The service was slow to non-existent, as they forgot to bring us some stuff we ordered and had to request it again (and this is when there were quite a few empty tables, so they were not very busy),

Overall, the decor of the place was nice, and the ambiance would be good if they stopped playing late-night lounge music. The food was overpriced for the quality, and charging extra for a very small side of hollandaise certainly didn't add to Le Petit Dejeuners likability. I'm definitely never going back again."}
{"text":"The Petit Dejeuner is one of those breakfast places and always has a line-up. It's worth the wait if you have the time & patience to wait. 

I've been lots of times and tend to pick either the Hungry Gal or the Eggs Benjamin. Delicious!! The apple cold slaw is so good! 

**Honestly, if you can get up early on the weekend, check it out!!**"}
{"text":"Not impressed. I thought based on tge reviews this would be a good spot. we went for brunch on sunday.  No, not good... they need a real chef.  i am hoping he or she was off.  The meal lacked flavour. I ordered the breakfast crepe. I found a mushroom, piece of carrot and a cucumber piece in my breakfast crepe. Needles to say it wasnt in the recipe. a few dabbles of goat cheese which was very confusing to the palate. it was supposed to contain 3 cheeses, potato rosti, and peameal bacon.  A mouth full of goat??? Anyway the others in my party ordered the tasteless benny which contained no carmalized onion.  The apple slaw was mediocre.  It is not quite on my save yourself list but close."}
{"text":"Had it not been for the offensively rude waitress, I would have given this place a higher rating. And it only  gets a 2* because of the super sweet, attentive and all-around lovely server (guy) who had to put up with the sour-faced minx that Sunday, March 13th over the brunch shift, otherwise it would have been awarded the lonesome lucky star, or strike in this case.
The food was yummy and the server went out of his way to accommodate the lack of options on the menu and if I was to judge the place on food alone, I seriously have no complaints. My meager 2* goes hand in hand to the awful, obnoxious and down-right callous front of house who passed the most insensitive, untoward comment after watching the atrocities of the past week unfold on the news airing on the TV. She really made me want to vomit."}
{"text":"You will definitely have to wait for a table for brunch, but if you love breakfast food you won't be sorry. I splurged and had the duck confit eggs benny, and was not sorry. The duck had the amazing, crispy outside and tender, moist inside. My husband had the eggs benjamin which he loved, and we shared a plate of the lightest, fluffiest waffles we've ever tasted in Canada."}
{"text":"IT'S NOT WORTH THE WAIT PPL!! 
Don't get caught up with all the hype about this place or you will be very disappointed as we were. We've been to a lot of other brunch places in Toronto so it seemed reasonable to check out this place especially when you search/google for \"Best Brunch in Toronto\", it comes up.. Nothing about the food is worth trying for a second time. Lame toast, lame eggs, lame 1 piece potato, lame \"home made sausage\"... Save yourself the time & money & go somewhere else!.. Check out Average Joe at Kensington, or Gladstone Hotel on Queen west or Lady Marmalade in Leslieville or Cafe Le Gaffe on Baldwin OR any OTHER PLACES besides this one. Consider this a warning.. Put it this way, I signed up on Yelp just so i can warn ppl about this place... We lined up for almost 1 hr on a Saturday morning then finally seated, waited for another 1/2 hr or so to get our food, trust me I'm being generous when i say that the food there is mediocre at best. That is about 2 hrs of my life that I can't get back, what a waste of time & effort.."}
{"text":"Y'all... the perfect breakfast.  The waffles are light and airy, the bacon is crispy, the eggs are fluffy-perfection. And that apple salad thing is like whoa!  Don't let the title fool you; it went great with the rest of the breakfast.  It's hard to mess up breakfast food, but it's also hard to cook it perfectly to one's liking. Ate their twice in the three days that I was in Toronto in late summer.  Is a really small spot, and the two employees up front at the time were acting as wait staff, host/hostess, bus-person, and barista.  The wait can be long and must wait in a line outside, so weekdays, if possible are best. For Americans: pea meal bacon is what Americans refer to as Canadian bacon, which is what I personally refer to as (breakfast) ham... The more you know.  lolol"}
{"text":"Petit Dejeuner was my favorite brunch place in Toronto for a while. The lines can be long on weekends though.

I've only ever been there for brunch, so this review focuses only on their brunch offerings.

The Belgian waffles are probably the best thing on the menu. Light and fluffy, without leaving you full. Depending how many people there are, we usually get some to share, along with whatever else we're having.

The omelettes are great too.

It's a pretty good experience all-in-all, not too hipstery either."}
{"text":"Waffles! Waffles! Waffles! They have the most flakey and light waffles I have ever seen (which may not make you full), and the best part is you can pair it with pretty much anything. The place is pretty small, so theres always a line up during weekends. Also the coffee is amazing!"}
{"text":"This was our Saturday brunch choice. Was on our list for a few months, and I'm glad we tried it.

I had the waffles with peameal bacon and scrambled eggs and a cappuccino. My girlfriend had waffles with strawberries (I can't remember the proper menu names) and a mocha.

Her beverage was on the \"damn that's really sweet\" side. Mine was alright.
Both of our breakfast dishes were very enjoyable. No big portions here (just about enough), but well priced, tasty food, good service and nice atmosphere were more than enough."}
{"text":"Long wait for brunch. Waffle Benny was ok but nothing spectacular.  Terrible service."}
{"text":"Quaint place. Friends we went with waited in line so we didn't have to wait that long. Would have suck if I had to wait in line in the cold...

Service was good. Food came really quickly, which I appreciated after waiting in line.

I had the Eggs Benjamin and it was very good, but would have like more potatoes for a $14 plate!!"}
{"text":"We went on a sunday for brunch and managed to get a table without much of a wait.. however our server requested we wait for the rest of our party to arrive which took another 30 minutes! we started off with some beverages; coffee was alright and the orange juice was quite fresh. having read rave reviews about the waffles, i ordered a waffle with strawberries and split with a friend who got the eggs benjamin. The waffle was light crisp and airy, probably the best ive had in toronto. the benjamin was basically eggs benedict with smoked salmon, so another safe choice. tried another friend's three cheese omelette which was also delicious. the bill was also pretty reasonable. The only drawback was the small portions. will definitely be back to try other things on the menu!"}
{"text":"Cute spot and the waffles are great. Other than that nothing overly amazing. We ordered the waffles Benjamin and the smoked salmon Omelette. The smoked salmon was extremely salty. I love lox and I could not even finish it due to the amount of salt. However, the waffles really are that good and worth trying."}
{"text":"I only come here when I can get a table immediately (usually weekdays midday), because the lineups get long and waiting isn't good when hungry. The staff is no-nonsense but full of hustle, so I don't take it personally. My new favourite order is the vegetarian breakfast crepe and the pickle/apple slaw is fantastic!"}
{"text":"Came to LPD for Sunday Brunch based on Yelp reviews, and I wasn't disappointed! Firstly, my BF and I barely had to wait for a table. We were seated within 5 mins! What a lucky day. I like the deco and ambiance there, has a hip, cozy little diner feel to it, even with its shiny green plastic chairs, doesn't feel at all tacky. 

On to the service, felt a bit neglected in the beginning, after we were seated we didn't get served, not even a glass of water after 10 mins or so. I even tried to waved down a waitress, had a feeling that she was trying to brush me off. Anyways, finally ordered our food. I ordered the waffles melody (waffles with peameal beacon and scrambled eggs). Its true,  waffles here were as amazing as ppl said it would be!! They were light, fluffy and not too sweet. Waffles I have had before were usually very heavy and doughy. Even the eggs and beacon was hot and yummy. Portion is also just right. I didn't feel too stuffed after. All in all, Le Petit Dejeuner is a great little breakfast place, and I would definitely come back!"}
{"text":"Good food. Great location. Nice people. I have a great time everytime I go. Free Mimosa's on Mother's Day for the ladies. Belgian waffles are delicious, tasty green apple slaw and really good granola dish. It's the first place I think of when I want to take my friend's out for brunch!"}
{"text":"After reading about this place we were in the area and stopped in for brunch.  It's very busy - we were two people and our wait was about 20 minutes.  Expect much, much longer if you have a bigger party!

The breakfast is quite well done.  My partner is very particular about her eggs and exclaimed that they were perfect.  My omelette was quite good, except they brought me a different one from what I ordered!  I was too hungry to wait for a new one, and the waitstaff was quite apologetic, offering to replace it quickly, bring out additional items (I was given a vegetarian omelette and I don't eat mushrooms so much of the filling went to waste) and removed our drinks from the bill without any ask from us.

I would have given the place 5 stars except for this, and the fact that it's due for some updates as the decor is starting to look worn."}
{"text":"I like the atmosphere and the food was great. Only downside is the wait. Try to go during non-peak times or else you could be waiting outside on the sidewalk for quite a while."}
{"text":"Came here around 2 on a Sunday afternoon. Luckily it wasn't too busy and my boyfriend and I were able to get a seat immediately. I was a little worried since I've heard this place can get pretty busy.

I knew Le Petit Dejeuner is famous for their waffles, so we ordered the authentic Brussel's style waffle - \"light, crispy and SO delicious.\" They really were light and SO delicious! Definitely some of the best waffles I've had. The serving isn't very big (it is only one waffle, cut in half) and you certainly won't be full just eating this given how light they are.

For my main, I was debating between the eggs benny and the breakfast crepe. Since I always order eggs benny at brunch, I decided to switch it up this time. Big mistake. The breakfast crepe (filled with three cheese mix, peameal bacon, two scrambled eggs & spuds) was disappointing. It lacked flavour and probably could've used a bit more seasoning. However, the apple slaw that it came with was very refreshing and enjoyable. I should've just stuck with the eggs benny - my friends later told me that they do it really well here.

My boyfriend ordered the smoked salmon omelette. This was another mediocre dish, nothing special. It also came with the apple slaw, which he enjoyed.

This visit was a little disappointing... but I'd definitely be back for the amazing waffles (and to try the eggs benny)!"}
{"text":"We were looking for a great breakfast place and boy did we ever find one! We ended up having to wait about 45 minutes to just get in the door but the food made up for the wait. From the hot chocolate, to the waffles, to the eggs Benedict, everything was out of this world! If I lived in Toronto I would definitely become a regular here."}
{"text":"This place use to do 'ayce' mussels for a set price between a certain time from 5-7pm i think. We came here with 4 ppl a while back and we were all hungry and decided to go with the mussels special. 

We all got our mussels and its an appetizer size portion with maybe 12 mussels per bowl, and I got to say their mussels did taste good and fresh, however, after asking for a refill on a second bowl, they decided to bring a big bowl to split between 4 of us! We thought it was strange, but after finishing that, we asked for a refill, that's when our server tells us that the chef who is the owner says they 'ran out of mussels' when its 5-7p time frame and we started at 5:30p. Hmm...did they snake us? We asked how they can run out so fast when we didn't eat much, the chef didn't apologize or try to subsidize anything, instead, gives us the bill. 

Let's just say it wasn't enjoyable and we went to Quiznos for a $5 foot long afterwards!"}
{"text":"This is a brunch review
If you are willing to (most times) wait 10 to 20 minutes for a table, this place is a real gem. Keep in mind no reservations are taken.
The restaurant is small, very long and narrow, which is typical of old toronto storefronts along King East. Tonya and Johann, the owners, have kept as much of the original building as possible and it shows. Old brick outside, cool windows, and lovely little details.
Inside, the first thing you notice is the long bar up front (a gorgeous old alter piece from a church), with cute, hip servers, busy whipping up delicious teas of all sorts, specialty coffees, juices, and even caesars. The walls are adorned with art that rotates from month to month, keeping a fresh perspective for returning customers. Hip chill music is played at the perfect level, still allowing people to enjoy their conversations.
The menu is not very large, but what they do offer, they prepare very well. All ingredients are fresh and delicious. The various styles off eggs benny (florentine, veronica, etc) are done to perfection. The hollandaise sauce is 2nd to none in the city.
Le Petit is well known for its Belgian waffles, and for good reason. These little babies are served up in several ways; fresh fruit, whip cream, jam and butter, maple syrup, however you like. They are a wonderful addition to any brunch and I highly recommend them.
Another big draw are the crepes, which they do to perfection. The ham and cheese is one of my favs.
Omelets are fluffy and scrumscious with various cheesy, meaty, veggie fillings. 
Traditional style breakfasts can also be ordered, and they offer many sides. Sandwiches are also on the menu, and are warmed on a grill, making them warm and delicious.
Both owners are often present at the restaurant and very friendly people. One gets a sense of a true neighborhood restaurant upon entering. The staff are friendly, very hip, and quite knowledgeable of what they are serving.
The seating is best described as old school booths, with some tables at the back."}
{"text":"We always have brunch along queen west, king west,  Bloor & Bathurst area....so we thought may be we should explore some of the brunch places in the east side too and found this place from yelp....but we are a bit disappointed and here are my comments:

1. Portion was small (I ordered the plain waffle and added two sides, a sausage and a scramble egg. The sausage was $3.25 but they just give you one small piece and it's very dry
2. Quality of food was just so so
3. Waffle was not amazingly special
4. No ganish (e.g fruits or salad). Basically you get what you ordered and what they described on the menu.

I have been to better brunch places in Toronto. Thanks god the wait was not too long for us that day, maybe 10-15 minutes."}
{"text":"We decided to stop here for breakfast because of the long line out the front. Figured it must be good. Small restaurant, we had 6 people and didn't have to wait long to get a table. We ordered the waffle Benjamin and the peameal bacon sandwich. The hashbrowns were burnt. The sandwich itself was good and the waffle was great. If I were to eat here again I would order a waffle. The staff was friendly. When we left, the line was still very long to eat here. I'm not sure why it was such a popular restaurant."}
{"text":"Went for the first time this Tuesday morning. No lineup, service was good. Loved the appearance and feel of the place. I had the \"Hungry Gal\" dish with coffee. Apple slaw is delish. I was very curious what type of dressing was used. The eggs were cooked well (I like mine \"over hard\") but salty, the peameal was great and not tough at all. The toast was just your regular kind of toast not great or anything but I'm not sure what I was expecting to be honest. Loved the potatoes; they had some kind of seasoning or something on them that was tasty. My boyfriend had the eggs Benny and had no complaints. I'd go back to try waffles for sure as that was my second choice when ordering."}
{"text":"I agree with the review just below mine. (Marie. F.)

This place is okay. The food is decent, tasty. Service is good. But nothing spectacular that would have me waiting in a line-up during the coveted Sunday brunch-a-thon. It's just not that amazing. 

My advice: try this place if there's no line-up and you're hard-up for a decent brunch option. Otherwise, skip it and head over to Gilead, NOW lounge, or a ton of good places on Queen West."}
{"text":"Terrible breakfast experience - overpriced, toast was black and charred, rosti burnt to carcinogenic levels. Asked to order something else and a \"chef\" stormed out of the kitchen to our table, yelled \"WHAT'S THE PROBLEM!?\" and then yanked our plates away aggressively, spilling things all over the table. I absolutely do not recommend this place, and would not come back! If I could, I would give 0 stars!"}
{"text":"Cute little place that has some upsides and downsides.

Downsides:
No reservations and no hostess to take names or anything. Basically if you want a table and the place is full, you wait in the tiny, tiny, tiny entryway, staring at the patrons through the glass walls until a waitress opens the front door and asks \"Who's next in line?\"

A bit awkward, but I guess it works for them.

Upsides:
Interesting decor and friendly wait staff. The food is ok. I was expecting more out of the waffle, but as light and airy as it was, it was also bland as all get out. I will say that the side salad/apple coleslaw side that came with the meal was AMAZING. I ate it first before my main dish and even stole some of my bf's.

Their buttermilk apple pancakes are pretty interesting. I liked them and the bf gave them a solid \"it's ok.\" 

Not a bad choice if something better isn't available. 

Oh, and if you have a group bigger than 4, forget about it. You'll never get in. Groups of 2 are best because this place is tiny."}
{"text":"Have worked about a 5 minute walk from this place for over a 8 months and only found my way in today for a late breakfast, early lunch.

Always has a line on the weekends, figured it must be good. 

Arrived on a Thursday at noon, was able to get a table for 6, think it was just that we were lucky, after being seated, there was a line-up until we left.

Ordered drinks, coffee and ceasars all around. Their ceasars are amazing, just the right amount of spice. Coffee is also decent, better than most brunch spots in the city.

I opted for the Croque-Monsieur ($10.95) that comes with a side salad of mesclun greeens, apple slaw and a paprika mayo dressing. The sandwich was buttery good, chalk full of delicious ham, dijon mustard & smothered with very tasty cheese. Also sampled the Eggs Benjamin ($14), eggs benny with smoked salmon. Also good, the eggs were poached perfectly. Someone at the table ordered the Toast Champignon (10.95) a half bagel piled high with sauteed mushrooms, onions, herbs and a poached egg. It looked amazing. The side of rosti looked to be french fries though. 

Service was good, they could have used a third server as both were pretty swamped. 

Overall, a good brunch."}
{"text":"We'd trekked all the way to M&B, looking forward to some good thin-crust pizza for dinner when a sign on their door stopped us like a third-wheel cock blocker: \"Closed. Private party for hospice volunteers tonight.\" WAAH!* 

So we searched the culinary wasteland around King & Sherbourne and settled on Le Petit Dejeuner, which is primarily a brunch spot but we were prompted by their charmant interior and chalkboard sign offering moules frites.**

We started with the soup du jour: French onion soup ($6). The broth was rich and heady but I wish it had been served in one of those cute little crocks, the kind that allows the cheese to bubble over and get all crusty along the sides. And I wish the chef didn't have such a heavy hand with the fresh thyme because I had to keep picking the thick, woody  half-chewed*** stems out of my mouth.

Next up was a wacky salade Nicoise ($11) that was composed with mayonnaise-y tuna salad, dabs of mashed potato, and big shards of papadum. It was a salad that had traveled from Nice to middle America by way of New Delhi. Quel bizarre. 

Luckily, the LPD moules frites ($14) did not disappoint. A big towering portion of mussels arrived in a creamy rosé sauce fragrant with herbs and coconut milk, and a thick slab of of buttery challah toast. The frites were hot and crisp, made only more delicious by the house-made mayo.

The wine list is short, and much like their Nicoise salad, scattered across the globe with Dao from Portugal ($35) and Cab Sauv from California ($40), to name a couple.

LPD does offer good value for the price in a charming space. I think one way they keep prices down is by short-staffing. We only saw one sweet-but-frazzled waitress that night who had to play host, bartender, and server to the 14 or so customers. So, yeah, the meal came at a \"leisurely\" pace.****
_______________________________
* At least the closure wasn't for a bunch of corporate douchebags. 
** And it was hella cold! I'm not used to these temps in September!
*** Half-chewed by me otherwise that'd be ew.
****And by leisurely, I mean \"I'm gonna choke a bitch if I didn't get some food soon\" kind of pace."}
{"text":"Great ambiance, great food! A bit small therefore you can end up waiting... but the small space contributes to the ambiance. 
Belgium inspired restaurant... must bring back the Liegeoise waffles :)
Would definitely recommend."}
{"text":"I've been here a few times and the food/service has been hit-or-miss. 

If you're craving something sweet, I would definitely recommend the belgian waffles with strawberries and cream. The waffles were light and crisp, with a nice touch of sweetness. If you're hungry and you want something savoury, I found the Hungry Gal platter (eggs, rosti, sausage) very filling. (I could not finish this dish!)  

Unfortunately, the only time I ordered eggs benny, my whole plate tasted like vinegar. It might have been an off-day, but I've stuck to the waffles since then."}
{"text":"Incredible waffles, easily the best I've tried in Toronto. A bit of a tight space. Hard to get in on weekends. They open a bit late at 9 am -- 8 would be better. But it's all worth it for the waffles."}
{"text":"Got the waffle benny, Oh man that is a delicious waffle. Good crust and amazingly soft on the inside...I don't know how they do it. The eggs benny was good, I think the Hollandaise sauce could have been better but still really good.  

From the look of the place I wasn't sure if they would have good lattes so I never ordered one, but as I was leaving and saw other peoples and their Faema machine I regretted that decision. 

I will definitely be back"}
{"text":"This is definitely a great little place.  I had a delicious croque-madame that was perfectly prepared.  It came with a delicious little rosti and a perfect side apple-pickle salad that was an unexpected, yet surprisingly tasty addition.  It's a great spot for brunch, totally recommended!"}
{"text":"I wish I could give this place 2 ratings:
3 Stars for brunch
4 Stars for dinner

The main difference is the quality of service. The food is always good, but the service is atrocious. They don't have enough staff to keep up with needy brunchers.

At night, it's a quiet and romantic place to have a dinner or just drinks."}
{"text":"I found this place online when I googled \"best brunch in Toronto\" - with a name like \"Le Petit Dejeuner\" they HAD to know one or two things about breakfast - and boy did they ever!

Best eggs benny I've ever had - and I have been slowly making my way across the GTA and Mississauga on my endless search!  Perfectly runny with a nice citrus-y hollandaise sauce.  My friend and I were split on their apple coleslaw... I loved it, but he wasn't quite sure.  I told him he was wrong :P  At the end of the meal, we both left extremely happy and full.  

The decor is great - i love the vintage and brightly coloured green booths.  You get a real homey feel when you walk in and you could see that they have a solid group of regulars that have become friends.

We got there just before 11AM on a sunny Saturday morning - what a great way to start a weekend!  We only had to wait a couple of minutes for a seat, but by the time we left, there was a line up, so get there early if you want to sit right away.

I've been recommending this place to everyone who mentions anything breakfast/brunch related.  Can't wait until my next visit!"}
{"text":"There is usually a line up outside this place but today there wasn't so my friends and I went here for lunch. We were a group of 5 and they informed us that groups of 5 or more cannot have separate bills and that gratuity would be included into the bill. Okay, it's a small place that is understandable.

Anyways, we sat at the front booth by the window. It was a nice view until I looked up and was creeped out by some marionette dolls (I HATE dolls). Despite the strange choice of decor, the venue has an unpretentious vibe despite it's name, however the food left a lot to be desired. 

The soup of the day and challah was not what I expected and came last to the table. The server said that the soup was a bisque which had pieces of ham in it. There were no pieces of ham. Also I encountered a very odd salad which had pickles, julienned green apple, carrots, argula, red and green lettuce greens and what appeared to be thousand island dressing. Needless to say, it was gross and I left it behind. 

My friends ordered breakfast which in retrospect was the wiser choice. They were satifistied with their food except their potatoe latkes were quite loose in structure and fell apart when they tried to pick it up with their forks. The best dish sent to our table was their poutine. 

All in all not a horrendous experience but not a stellar one either."}
{"text":"The food wasn't mind-blowing, but definitely good. The service was great too!

The waffles were definitely different than the usual super sweet and savoury ones at most breakfast joints, which i liked, but i didn't particularly enjoy the slaw/salad served on the side."}
{"text":"The food was decent, but the overall thing is overrated.
The waiter was not nice to us and never smiled once, the atmosphere inside the restaurant makes you feel like they want you to rush and get done quickly so they can put other people at your table.
Also, coming from Europe and having tried Belgian Waffles, those are definitely not the \"best\" ones. 
Wouldn't even think of going back there, and would not recommend it."}
{"text":"Just a brutal experience. The restaurant first off is very dirty. The waitress was incredibly rude. They got the order wrong, not to mention the food was awful. Ordered bacon and eggs - except there was no bacon. So instead we ordered peameal bacon. The peameal was extremely under cooked and made me feel ill after eating it. My husband had chunks of gristle/uncooked peameal in his meal also.  The whole plate was filled with grease. They are cheap with their condiments as well. We asked for ketchup and hot sauce, they provided only the tiniest amount and when we asked for more, the waitress literally rolled her eyes.  The toast wasn't buttered and there was no butter on the table, again we had to ask and were treated rudely by the server. No jam either. I would NEVER go back here again. Still feeling sick from the food btw."}
{"text":"So one of my best friends is trying to go out for brunch at least 30 times this year. FYI, I believe that he has nearly managed 20 already. 

In a selfless act to try and help him out I have been trying quite a few of T.O. brunch places with him. It is a tough assignment, but these are just the things you do for a friend.

Le Petit Dejeuner, is nice spot. Appropriately, it is not much more than an hole in the wall, with a comfortable, slightly hipster vibe. 

I tried the western omelet, which was good. However, if you find yourself in Le Petit Dejeuner, I must insist that you try the waffles. They are awesomeness. Even if you aren't a waffle person (which I am not), you have to try at least one. They are really good."}
{"text":"I had a very pleasant time here. We got a table straight away, and I loved the green sparkly booths. Really great eggs royale although confused as to why it's called eggs Benjamin here. It came with a side of apple slaw which I'd never even heard of. An odd combination but delicious none the less. The atmosphere was nice and the service was great. Bravo."}
{"text":"We love Petit. Cute environment, cozy, nice beer , & the waiter on the weekend is always very kind. Yesterday when we went for dinner we were quite disappointed as the proportions had been cut in half. Same price less food. We always order the Flemish stew- this time we left hungry. 
We're sad to say it, but we won't be back.. We actually had to eat again, when we got home- after spending $60."}
{"text":"Great place, friendly staff. I had the Brussels Medley... Waffles, bacon and eggs. Really really nicely done. 

I was meant to leave 20 mins ago but ended up sitting at the bar ordering another beer - it's quite a comfortable place."}
{"text":"Came here with some girlfriends over the weekend. Arrived at 1030 and there was a line up going out the door. We waited in line for maybe half an hour partially because we wanted a table for 3 instead of sitting at the bar. Parties of 2 were seated quite quickly so I would recommend going as pairs if you want a table fast. 

I had the eggs benny with peameal bacon which was delish. the english muffin was turned so that the outside had the egg on top which actually made it kind of hard to cut. It came with an apple coleslaw that had pieces of pickles in it which on first inspection seemed a bit odd but actually kind of worked. I loved the potato rosti...the potato was cooked perfectly and had a great crunch on the outside. 

My friends got the cod eggs benny and the toast champignon.  Both thought they were good as well. 

We decided to share waffles with strawberries which was excellent. They were light and fluffy and were perfect with fruit and maple syrup.

Brunch here is delicious but its a bit on the pricey side.  Although the waffles are good, they were expensive at 11 dollars.  In total, we spent 70 something dollars not including tip so if you're looking for a cheap meal, this isn't the place."}
{"text":"Stayed at the hostel in Church St. near this restaurant so it seemed like a neat place to get brunch. Needless to say, the experience was just bad for me:

The seating queue was completely unorganized. We had to walk in once or twice to inquire about tables/seats and none of the waitresses had either an estimated time for seating or any clue as to any available tables. Took about 20 minutes, not too bad or unusual, but added to the negative experience.

My friend and I sit for about 20 minutes before anyone offers a glass of water. They bring us coffee and juice in no time after that. We place our orders; and as someone with an onion allergy I ask the waitress: \"PLEASE NO ONIONS IN MY OMELETTE.\"

They bring the omelette with extra onions. I return it to the kitchen... After which the chef steps out and tells me: \"EVERYONE USES ONIONS, HOW DO YOU EVER EAT OUT? YOU SHOULD HAVE TOLD SOMEONE.\"

They bring me another menu, but I'm so annoyed, I just wait for my friend to finish her meal. 

So, they're unorganized, don't listen to customers, and the chefs are clueless. But the waffles are good, says my friend."}
{"text":"FANTASTIC eggs benny!  DELICIOUS belgian waffles!
For those of you who are looking for massive portions, go to a dirty diner that costs half the price or go to Denny's (ew).  This place is way better than other chain breakfast places (such as Cora's or Eggspectations). I dont find their portion sizes to be small, perhaps for the price but it's no different in price than places like Cora's but the dishes we had were so so good!  The hollandaise sauce is so yummy, the eggs are cooked PERFECTLY..and I even loved the peameal bacon which I don't normally prefer.
The rosti on the side was just meh. But I didn't line up outside for 20 minutes to eat potatoes.
Service is okay. Kind of slow to bring the bill and give change.
Line at 1pm was triple that of the line at 11:45 (for Sunday Brunch)...I would say if you're coming after 12:30 to be prepared to wait at least 45 minutes to an hour."}
{"text":"Came to this cute little place for the first time yesterday for brunch. I'm always on the hunt to find places like these - cozy warm interior with delicious food! The place was packed but my boyfriend and I waited only about 10 minutes. When we were seated, the chef came out with a small plate of belgian waffles to us, saying that it was for making us wait! HOW NICE!!!! I absolutely fell in love with this place when the chef did that, seriously... the fact that the chef even saw us waiting and then brought it out to us directly. Such a kind act really left a great impression of this restaurant. 

My boyfriend and I ordered french toast and belgian waffles with smoked salmon and poached egg. Both were so delicious although the belgian waffles dish was quite small, but that's okay. Both tasted so good. Highly recommend!"}
{"text":"WHAT HAPPENED!?
I pretty much retract everything I've said about them in the past. I've tried to pursue this relationship a few times in the past months but gave up due to extreme hunger and long lines, but finally did go again the other day - when magically there was no line!

Foreshadowing? My portion of Waffles Benjamin was miniscule and sloppy. The steak and eggs that my partner ordered had a broken egg which they compensated with an egg that came later - too bad they did not compensate for their flavour. My partner's mother was probably the only one satisfied with her Toast Champignon. I was so hungry after finishing my meal in 2 minutes that I had to order a bagel and bacon. Do note, I am a slow eater so you can imagine how small the portion was!

I'm no coffee drinker but my partner's coffee tasted like crap (and she's had a lot of coffee in her life) and they forgot the mom's tea. 

Things just didn't feel right, or the same. It's like she's let herself go in this relationship because she knows I'm committed... but alas, no more. I will not be returning anymore to this unfulfilling relationship. Goodbye, LPD."}
{"text":"Absolutely yummy!

The french toast here is like nothing I have had ever before. I always get the french toast on the side or get a french toast based meal. 
My second favorite is their home made sausage. 

The only downside of the restaurant is the slow service. It takes at least half an hour to get your meal. So, don't go there when you are very hungry."}
{"text":"I was disappointed having read so many positive reviews on Yelp. I ordered the 3 cheese omlette and it was small and lacking flavour. It also contained red onion which really annoyed me. It's a strong flavour and not to all tastes, if you're going to use it say that on the menu. The potato rosti was near raw too. Service was lovely however just shame about the food."}
{"text":"I have been there for a few times already.
Love their food!!
You need to expect to line up any weekend, though!"}
{"text":"The cutest place for brunch in Toronto! The strawberry jam crepe was wonderful and I just love the whole vibe of this place. Definitely a great place to sit and have coffee in the morning. I love the sparkly emerald booth seats, and the owner was very friendly and attentive."}
{"text":"I just finished my brunch here. The food was okay but the service was horrible. I stood in a freezing doorway while tables sat empty until someone finally let me in. I ordered the duck confit bennedict which was great but for 22 dollars I expect to get a coffee refill or the chance to get one throughout brunch. 15 minutes after I asked for a refill my waitress came to take away my plate and asked if I still wanted a coffee. Thanks. 

I will not be visiting again."}
{"text":"I live in the neighbourhood and go to that place a lot for brunch. There is usually a line up on weekends, although we've never waited more than 30 min for two people - which, based on the food and service, makes it totally worth it. 

The food can be quite overpriced if you get their fixed meals. I usually get the plain Belgium waffle ($7) and then choose add-ons from the side menu, which is the cheaper and more flexible option. 

Besides the fact that they're known for their waffles, I love their scrambled eggs and coffee! 

Atmosphere and service is really good. Overall, it's a really cute little brunch place in this area, that's nice to visit every once in a while!"}
{"text":"I, like many of my fellow Torontonians, adore my breakfast. I also adore my family.

Front on either of these things and you're in trouble. Front on both of these things simultaneously and you're getting an angry Yelp review.

One lovely weekend afternoon I decided to take my family here for brunch after hearing much hubbub about how delicious and charming the place was. After arriving and waiting in a quick-moving line (that was a treat) we were happily seated at an indeed charming table with charming decor and charming sunlight. What can I say, I was charmed! 

We placed our order... but after waiting almost 45 minutes for our food kindly asked our server how much longer it might be. We could see that it was busy and understood, but we saw tables seated long after us already digging into their teensy waffles. We received naught but a rude \"We are very busy now and your food is almost here\". Hm, okay.

After waiting for another 30 minutes, we asked again, and this time, she checked with the kitchen. Lo and behold, the order was never put in. At this point my family and I had been there close to 2 hours with no food, hungry, and frustrated. The decor wasn't looking quite so charming anymore. Shortly thereafter they quickly brought out our plates separately. A couple of us were already finished our plates before others had even gotten theirs (given, a couple waffle slices doesn't take too long to finish when hungry). When the pancakes (last to arrive) were cut into, they were oozing uncooked batter. Seriously?!

This was a 3-hour ordeal, and while the the manager offered to give us the meal on the house (we paid for half of it anyway) I left wishing we'd just gone to McDonald's for a Sausage McMuffin Meal. At least we wouldn't have left fuming. No matter how good an establishment's food might be, poor customer service is enough to leaving nothing but a bad taste in your mouth."}
{"text":"This place has great service and the food is decent (as in nothing special). I ordered the 'Hungry Gal' with my toast on whole wheat, with scrambled eggs, and fruit salad. Everything was decent in taste and fresh. The prices where decent as well however for the same price I would have stuck to Cora`s. Its a very cozy place to be in especially in the morning. There is plenty of parking available on the streets even though we had a difficult time finding a spot at 8am on a Tuesday."}
{"text":"came here with my boyfriend two sundays ago. there was quite a line outside the restaurant, but we managed to skip the line because we were willing to take the seats at the bar.
both of us had egg benjamin because we're big egg benedict and smoked salmon fans! hurray, the food was great. but the service was a little bit slow, we had to wait quite a while before we got entertained to pay the bill. Staff was not helpful in referring to the right person to deal with orders taking and paying bills.
Nice environment, and very clean and decent washroom as well. recommended for brunch but expect long line."}
{"text":"I love this place, especially the eggs benny and belgian waffles. mmm. peameal bacon, egg and cheese sandwich is great too."}
{"text":"I wish I could rate this place more than three stars but as others said, the line up is huge. We waited almost a full hour on the street on a Sunday at 12pm. The line up is a little messy but we stuck with it. 

When we were eventually seated the interior was very nice. They are going for a European vibe (clearly). While we were sitting, I noticed dirty water dripping from the ceiling. The owner was called and told me he was mopping his office above the restaurant.... Absolutely bizarre. And I was so glad I didn't have my food yet. It would have been ruined. We got free waffles for our troubles. 

I ordered the special, blackened cajun haddock eggs benedict. Really really nice. The hollandaise was spot on. The portion size was decent. Served with potato rosti and a very very tasty apple / pickle slaw. My friend had the salmon benedict and was very happy. Another had the eggy bread. The portion was massive and served with fruit and cream. Very sweet, she loved it. I dislike sweet brunch so it wasn't for me. The waffles were light and fluffy. Nothing like real buttery Belgian waffles. If you expect they will be you will be disappointed. 

The cucumber mint lemonade was absolutely divine. Not too sweet. Would be fab with a little gin. The coffee was so so so good. Highly recommended. The Americano was a proper European style strong coffee with decent crema. The filter coffee wasnt great but came with a mimosa for $9. We paid 116$ for five brunch meals and several coffees. Not bad. Not sure it was worth the wait and mop water dripping though."}
{"text":"Best hollandaise sauce,  the waffle tastes marvelous and fast service. I highly recommend this place."}
{"text":"Love the French toast! The egg Benny is not bad either. The place is small and there is always a line! The service is a bit slow due to server/ table ratio. Not a good place for big group unless you don't mind waiting an hour+."}
{"text":"The service is always fast and friendly even when they are slammed - which is always on weekends.

The breakfast crepe is delicious!! That is my fave - can't go wrong. Great coffee, caesars and mimosas too.

The place is small and the line up is loooong during peak hours. To avoid this, if possible for me, I go after 1:30pm on weekends. I don't think any breakfast resto is worth a wait in a long line. 

Price wise on food - not a steal of a deal, probably a bit higher than many diners in TO, but still worth it."}
{"text":"The belgium waffles were sooo good! A little costly for the quantity but still worth it!!"}
{"text":"I think this place was great! Good food, quick and polite service, comfortable atmosphere and they brought REAL maple syrup with my waffle. Maybe that seems obvious being Eastern Canada but I appreciated it having come from the U.S. side of things where, even in Western New York, you have to ask and pay for the real stuff."}
{"text":"I had very high expectations after reading the Yelp reviews. I was not disappointed at all. I went this past  Friday around 1 pm. There was not a line. The staff was very kind and knowledgeable about the menu and made recommendations. I had the caramelized french toast, sausage terrine, scrambled eggs and apple coleslaw. All the food was excellent. If there was anything that could be improved, I thought that the music was a bit loud at times and the Chai latte was sweeter than I prefer. However, the place still deserves 5 stars. I would definitely recommend anyone to check it out."}
{"text":"Hands down best waffle in the 416. Personal favorite dish is the eggs florintine with potatoes...  they also give you a side of apple slaw with any order ....yum!"}
{"text":"I've been a couple of times now to this place and I can definitely say that I found my new spot for breakfast. I see lots of kids here complaining about the wait outside, I know you guys are used to fast internet connection, but in the good old days, good things don't come easy, and you have to suffer a little bit.
Let me start off with the service - one of the best I've ever had in downtown Toronto, everybody is always very friendly there and ready to help and accommodate any requests.
I had different things each time I came here and I found it delightful every time.
I love their selection of teas for breakfast, I sign up to try a new one each time I'm going come here.
I love the decor, very retro and also the street and neighbor: after this always a visit to the market which on Sundays offers the antique zone in the south part of it.
I definitely recommend this place."}
{"text":"I went there on Sunday morning with my friends. We realized there would probably be a wait to get in but what we didn't realize was that the place had a lot of 2 seater tables so we waited a good 45 min. The food was ok but the experience was pretty much ruined when my friend gave her money to my other friend to pay. She gave 17 dollars for a 13 dollar bill (way over 15%). The waitress then accused my friend who was trying to pay that she had only given her $10.00. My friend tried to explain to her that this was not the case and then the waitress said \"Ok, we'll just pretend that you gave me enough.\"

In other words, it's not worth the wait. There are a lot of other good brunch places near St.Lawrence Market that have better food and service."}
{"text":"Best cup of coffee so far in Toronto. And then the food came - also delicious!  Just a simple slam-dunk on our last day. Highly recommend."}
{"text":"Very good food, the benedictine eggs are specially awesome. There is a great ambiance, the staff is friendly and efficient. It worths a little wait ;)"}
{"text":"Decided to try out this place today. From reading reviews we knew that we should be prepared for a wait. We waited outside in the line for about 30 minutes before we were seated. I realized that the lady seating people was  a waitress as well, and had multiple jobs to do. The turnover time between customers is pretty long. I think if they hired one person, like a hostess, to just seat people and clear off finished tables, things would go a lot quicker.

Once we were seated, it took about 10 minutes before we were brought some water and coffee. Then it took about 20 minutes before our food order was actually taken.

Once we had ordered our food came in a short period of time, maybe 15 minutes. The food was delicious! It's worth the wait. I actually ordered something that isn't mentioned in most reviews, the Croque Madame, it's a sandwich with dijon mustard, cheese and ham, served with a sunny side up egg on top. It was really good and the apple slaw was awesome. The waffles were light and airy and sweet, and I think it's awesome that they have a dish, the Waffle Benny, where you can get their famous waffle AND their famous eggs benedict in one. 

After we finished it did take about 20 minutes before we got the bill. When paying we asked the waitress what she suggested we do if we wanted to avoid the line ups, and she said to come between 9-10am and 2-3pm when it's the slowest. 

TL;DR
Good food, fair prices, worth the wait."}
{"text":"Stay away.  Bad attitude bad service.  They won't seat you because they can.  As long as you finish your meal, the bill is ready for you.  No follow up on food quality not to mention they will refill your coffee when they feel they like it.  

Oh. The reason they don't seat you because they wouldn't want you to sit there and chat forever.  Just eat and leave. 

Seriously its over priced."}
{"text":"La gérante, du moins si c'est elle, est particulièrement désagréable. Le repas était de qualité inégale malgré un bon choix de bières belges. On y retournera peut-être, mais nous ne sommes pas particulièrement pressés."}
{"text":"Brunch, the atmosphere was OK (nothing special), wait 1 hour in line (for a group of 9),  good food (again not special) but small portions, Unbelievably delicious  waffle..."}
{"text":"Restaurant: Le Petit Dejeuner
Cuisine: Breakfast/Brunch
Location: St Lawrence Market
Address: 191 King St E
Price Range: $10-15

1: Poor 2: OK 3: Good 4: Very Good 5: Excellent

Food: 3
Service: 4
Ambiance: 3
Overall: 3.5

Extra information:

*Specialize in Breakfast and Brunch
*Wait gets long over the weekend
*Special Green Apple Coleslaw
*Known for Waffles

First of all, I am not much of a Breakfast or Brunch person. I do occasionally enjoy pancakes drenched in maple syrup and the scrambled eggs with cheese, but I never go out of my way to plan a brunch outing. Sure, the whole concept of getting up a little late on weekends and going for a brunch does sound relaxing, but I'd much rather spend few more hours in bed and go for huge lunch instead!

However, occasionally when there is a spot that's much raved about- I do like to scramble out of bed early and give it a try. Le Petit Dejeuner is a neighborhood brunch place that's constantly praised for their special breakfast menu as well as their waffles.

I got there around 9:55AM on Saturday morning expecting a long lineup at the front according to other foodie reviews. But when I got there, it wasn't busy at all and didn't even have to wait (not complaining). The restaurant looks small from outside, but once you walk in- there are more tables near the back past the bar area.

Once I walked in, there were 2 people working but none of them looked my way. I stood there for good awkward 60 seconds before one of them noticed me and sat me down at a booth for 2. I was waiting to meet a friend there, so I decided to order a coffee and read through the menu (that i already stared at for good 10 mins the night before as I always do).

Ordered: Toast Champignon with a Poached Egg 3/5

*A halved bagel topped with sauteed mushrooms, herbs, onions, bacon and served with a potato rosti and apple coleslaw for $10.95
*I asked my eggs to be cooked thoroughly because I don't like runny eggs unless on top of fried rice
*This is not a big dish but decent size for breakfast and bagel will fill you up
*Overall presentation has home-dining feel to it
*Came with lots of mushrooms on top and the eggs done just the way I asked for it
*It came with Sesame Bagel so make sure to ask if you are allergic to seeds
*Bagel was kind of hard
*Overall kind of dry, but this might be because I asked for the eggs to be cooked all the way
*I asked for hot sauce (ketchup would work as well)
*Was looking forward to apple coleslaw that everyone liked so much
*Sweet tangy julienned green apple pieces with carrot pieces topped with creamy tomato sauce
*I think I would enjoy it more if the sauce was something lighter, something that wouldn't overcome to sweetness of apple
*Potato roti was thin, burnt and dry

Ordered: Eggs Benny with Peameal Bacon for $12.95

*Ordered by my friend and I didn't try any so I can't comment but she said it was good
*She mentioned how the Hollandaise sauce is very lemony

Other than the awkward 60 seconds when I first walked in, the service was absolutely fabulous. I don't mean fabulous as in they treated me like a queen, but they were there when I needed them. It was probably one of the friendliest service I've ever received in Toronto that felt genuine. They always checked up on us time to time and refilled my coffee/water.

Plus, even when there were people waiting at the door for tables, I really appreciated the fact that they didn't try to rush us out (not that we stayed there for that long anyways).

Bill was $14.50 plus tip for my breakfast and a cup of coffee

Summary: If a friend was in town and wanted to check out a brunch place, I would def bring them here.Next time, I am trying their waffles."}
{"text":"Best egg Benedict so far I had in town. I had it with Duck confit($19). Yummy! And then I also tried their plain Belgian waffles with maple syrup($7ish). It was a bit crispy on the edge but fluffy inside. So good! Highly recommend!

A bit pricy but worth trying. Will definitely come back again.

PS. Very packed. I went at 1:30 afternoon and waited for about half hour..."}
{"text":"It's a hole in the wall restaurant but it dishes out great food!"}
{"text":"My girlfriend and I came here for brunch, as we have many times before. She likes their apple and brie panino so much that on occasion, we've been willing to wait in line in the freezing cold just to get a table.

This time I ordered the Toast Champignon, but was disappointed with my meal. The poached eggs were overcooked and drenched in vinegar, and the mushrooms were extremely salty, so much so that I just couldn't eat it.

I decided I would let our server know when she came in to check in on us - only that never happened. 25 minutes passed, and we watched the tables beside us get attentive service from their server, who whipped around us so quickly without acknowledging us that we couldn't even come close to getting her attention, while our own server took orders at other tables and never batted an eye at us.

Finally, the server who was not ours, came to take our plates, and asked if we had enjoyed our meals. I said, \"well, actually...\" and let her know my dissatisfaction. She became very abrupt with us, and said that while she was sorry, the restaurant was very busy this morning with the brunch crowd. \"Fair enough,\" I said, \"but I noticed that you have actually been very attentive with the tables around us, and our own server hasn't even walked by in 25 minutes.\" Again she gave a quick, canned, empty apology, like she had somewhere else to be and we were wasting her time. She offered to replace the meal I said I'd lost my appetite, and just wanted it removed from the bill. She said \"fine\" and snatched our plates from us.

As we were preparing to leave, the cook came out of the kitchen to our table and told me that if I'd said something sooner then he could have replaced the meal for me. I opened my mouth to respond, to say that I would have if someone had checked in with our table, but the cook turned and went back to the kitchen, giving us both the cold shoulder before we could even say a word.

Needless to say, we were extremely disappointed with this experience. As regular patrons of this and other popular brunch spots, we're familiar with how busy things can get. We can also accept that not every meal that comes out of the kitchen will be perfect. 

From what I know of customer service, every dissatisfied customer equals an opportunity for service recovery. At le Petit Dejeuner, the servers and cook chose to disregard that opportunity. Instead we were treated as though we were the problem. I understand that the place was busy, but a little bit of kindness and understanding, as well as a genuine apology can go a long way in ending the experience on a high note. Even after all this, our own server who had ignored us, never came back to apologize.  We left with a bad taste in our mouths, and can't say we will ever go back.

But then, with the line-ups of people outside waiting to get in, maybe they care little about customer retention. What a shame."}
{"text":"Heard really good review about brunch at this place. First time here ordered the egg benjamin (smoke salmon benny) and the famous waffle. They are sooooo delicious!!! Especially the waffle, so far the best waffle I had in Toronto!"}
{"text":"My friend and I visited Toronto and wanted a non tourist/ local eatery for breakfast and happened upon Le Petit Dejeuner. We figured this place was popular since people were waiting outside to be seated. Parties of two get seated much more quickly, we waited about 15-20 minutes while a parties of 3+ waited about 30-45 minutes.
The menu was extensive and has a lot of options. I chose the Half Eggs Benjamin since I HAD to try the waffles. Everything was delish and well put together! 

The atmosphere was calm and not too loud. It can get chilly by the door when folks hold both the outside and foyer doors open. The staff was also very friendly.
When I return to Toronto I'd love to have brunch here again or even try their dinner menu."}
{"text":"It's a nice place but over priced. I went on a Sunday so there was a bit of a wait. There are certain places worth waiting for their signature food item but their waffles were a bit disappointing. I had a waffle with back bacon eggs and slaw. Good but not great. Nothing I would rave about and not worth waiting in line for. 

In summary, this is like the 2006 Toyota Camry of brunches. Boring bland and needs a little work but it'll do the job if ur hungry."}
{"text":"I live in the neighbourhood so I have been going to Petit Dejeuner for a few years now. I used to really love this place but I must say both food and services have gone downhill. Food is sloppy and the servers (not all of them but most) have some serious attitude most of the time. I don't get what's the hype about this place and people are willing to line up for an hour. 

I would much rather go to the pubs nearby for bunch since there's no lineup and you get what you paid for without the attitude."}
{"text":"I never will understand why people wait in a line up for this restaurant.  For 5 years I have lived 2 minutes away from this place but would rather travel elsewhere  to get food (or preferably make my own) than go here.

I've been twice and the second time was to give it a second chance, but I had the same experience both times.  

The service was poor, either not being attended to or almost shamed for asking for something like the bill or a glass of water.  

The food is okay at best. I love a good salty smoked salmon omelette, but they top everything with a coating of salt. Too much.  

It's sad cause I love a little cute local restaurant that's close to home, but I don't plan on ever going back."}
{"text":"Lovely place for brunch - good food, great coffee, lovely ambience, warm service. 

Was on my way to St. Lawrence Market and saw that there was no line (I understand that's rare), and decided to drop in. 

The door waitress was decidedly unwelcoming, takes her time to acknowledge you, and just looked like she wished to be somewhere else. She was the exception though - all other food servers were helpful and warm. 

We had the Waffle Benjamin (half a waffle, one eggs benedict with smoked salmon) and Eggs Benjamin (two eggs benedict with smoked salmon), both of which came with potato rosti and apple slaw. As others have said, the portions are smaller than elsewhere, but the quality is quite good. Waffles were light and fluffy, and the smoked salmon had a nice flavour. Sides are also a step up from the usual home fries and piece of lettuce/tomato. Coffee is better than most specialized coffee shops - we loved the Americano. 

Overall a lovely experience. A bit on the pricy side for what you get, especially with options galore just steps away at the Market. Would come back if I was in the area, but wouldn't make a special trip or wait in line."}
{"text":"Service was amazing and the food was the best breakfast food I've ever had! I would definitely recommend this place not just to the tourists but also the people of Toronto! Do yourself a favour and go - the organic oats are to die for"}
{"text":"Just OK. A redeeming quality is its low price point. I had a ham and cheese crepe and BF had a croque monsier. 

I think they were very understaffed because it look a long time for the server to return to our table to take our orders after she gave us our waters. 

I was thrown off by how my crepe looked. It came smothered in a light orange sauce with the peppers, ham, and onion under that made it look like vomit. I was expecting a Parisian-style savoury crepe with all of the fillings on the inside- not outside of the crepe. The ham itself was good and the crepe was good too but it absorbed to much of the sauce that I could barely tell. It tasted good, but it definitely didn't need all of the sauce. 

BF says his croque monsieur was good, but he had asked for no dijon and he got dijon in the sandwich. 

We both had a hot chocolate which was great, frankly. But the milk could have used a longer steaming- it wasn't hot enough. 

Wouldn't come back."}
{"text":"This is a wonderfully quaint establishment.  It is a small place in the middle of the block. It has a nice sized menu and features quite a few options that you will probably not find all that common. 

The eggs florentine are wonderful. I wanted to lick the plate. The waitress was very pleasant and everyone I was with enjoyed their meal very much. If your downtown Toronto and you are looking for breakfast, don't miss this place."}
{"text":"A nice cozy brunch spot! 
I didn't think that there would be a long line up at 1pm.
There was a line.  I was hungry.  Not the best place to bring a large group.

I think there are only a few brunch places in that neighborhood.  
So, all the lawyers and suits that decide to take a quick break for weekend brunch end up here. It's mad busy.

It was worth the wait though.
I had the smoked salmon, poached egg, and waffles.

Not the largest portions, but everything is super tasty.
Everything was cooked perfectly, but really, this place is all about the waffles.

The waffles are awesome.
Crispy, warm, fluffy...with syrup...delightful!
Waffles, worth waking up for!"}
{"text":"4 star rating is for the waffles.  The waffles are good.

As others have said, the service is not very good.  They're very disorganized and take a long time to seat you, a long time to take your order, a long time to bring your bill.  My wife's view was \"these waffles are good, we should buy this place and organize it better, it would make twice as much money\".  She's probably right."}
{"text":"I recently tried this place for brunch for the first time and was not disappointed. It's a small place so expect to wait to be seated but the food is quite good. I had an omelette with spinach and Brie and a side of their in house smoked salmon, both were great!"}
{"text":"Good waffles, delicious even, but for the price, I would have liked to have at east two waffles, not just one! I had the Brussel Melody: one waffle served with one egg and one pice of peameal bacon. I wasn't very hungry, so this meal was enough for me... though a dining companion who was male and usually ate a lot for breakfast had to order two breakfasts just to feel full..."}
{"text":"Good food and friendly staff. Waited for about 20 mins on a Saturday but served quickly once seated. Food was flavourful and fresh. Had the waffle eggs Benedict which were fluffy and savoury. Would recommend this place if you're looking for a twist on traditional waffles or brunch"}
{"text":"I was visiting the city and in the neighborhood I stayed in everyone talked about this place for brunch! And I mean everyone. When we got to the place there was a line, and apparently in Toronto people like making lines, I don't know. But we made the line and about 30 minutes later we got in, after so much hype we thought we might as well.

There are many breakfast options, specially waffles! And it was delicious! The waffles were kinda crispy and fresh! Also the options on breakfast drinks was pretty interesting, hot apple cider and belgian mimosa. The service was nice, the bartender and the waitress were really friendly. They seemed to me to be a bit short staffed for the amount of people that go there, but then again I don't know how things work in Toronto. 

The two things I didn't like were the canadian bacon because it was salty and ruined the sweet meal a bit, but it was also my first time trying that type of bacon so I took a risk. That and the fact that they charge $1 for extra syrup, and for a sweet lover like me the little things of syrup they give is not enough. 
Great place still!"}
{"text":"Came here with friends on our first full day in Toronto after journeying up from the Detroit metro area the night before. 



We tried the waffles and they were delicious - I really liked them because they were light, fluffy and didn't leave you with that we-ate-too-much-for-breakfast-and-now-are-comatose-for-the-rest-of-the-day feeling. 

Ambiance: nice feel - eclectic + diner-y + old school

Service: a little slow - we walked in and it definitely took us a few minutes to get anyone's attention, otherwise, our waiter was very friendly and helpful and my coffee was consistently refreshed

Prices: I think they are a little on the high end, we ended up with 3 orders of waffles of various kinds (2 with fruit, 1 with egg/bacon) a coffee, juice x2 and we had a 50 dollar bill by the end, but we were very satisfied overall, and this was a great place to start the day off!"}
{"text":"Zero stars if I could. Waited in line for 20+ min, in -5C weather, to seat a party of 2. With friend en route and next up, told by hostess I could not be seated without other party present. Rather furious. Will not be patronizing this place ever. Petit? Oui!"}
{"text":"I had their eggs benedict for my brunch. it was great~ they were all fresh ingredients. But the bill came to $13 something...The service was nice, and the service speed was prompt. So I went back another time with 5 friends for lunch. But we were disappointed that we couldn't get their Beef Stew because we were there early:( . We will definitely go back again..."}
{"text":"Hey, not a bad place to eat!  I got the salmon benny on an English muffin and a latte.

The hollandaise sauce was light and perhaps requires slightly more seasoning.  They know how to poach their eggs so I was extremely pleased when it oozed out in slow motion (although it was in real time).

Their apple slaw is interesting and their rosti is well done.

Good place to eat when you're in the area.  Hard to find a parking spot (did you guys know that you're not allowed to park in no standing zones?!  I thought it was ok as long as I parked and wasn't standing...)."}
{"text":"3.75 Stars.  (I don't know...I just can't pull the trigger on 4 stars.)

I had the spinach omelet, which was quite good, and my wife and cousin both had the Toast Champignon with a Poached Egg.  They both quite enjoyed it.

Highlights 
- friendly, attentive and quick service, even though they were FULL.
- VERY good coffee (which they served to the people that were lined up outside on a chilly morning.  A nice touch).
- space has a lot of character
Lowlights
- potato rosti was chewy/tough, tiny and lukewarm.  Pre-made and warmed up?
- one piece of non-nondescript, boring toast.
- bathroom had grungy caulking behind sink, broken mirror, and accumulated dust on exhaust fan.  

Definitely worth a try.

NB  I heard someone say \"the French Toast is to die for!\""}
{"text":"If you want a basic brunch then petite dejuner is the place for you! The only good thing about our meal was the potato rosti subbed for the homefries. Disappointing."}
{"text":"I have many times been disappointed by French toast. This place serves the best I've ever had - of course it helps that they're caramelized. Hot chocolate is also top-notch. I live in the Vancouver area now, but I plan to return here every time I'm in town."}
{"text":"Awesome breakfast place with a great ambiance. The place is packed and has a line up.  

+Good+
 - the bacon and back bacon is great
 - eggs are awesome
 - tea is unique and coffee is alright
 - friendly service

-Meh-
 - small portions
 - slightly expensive"}
{"text":"So so so so good!!!! The best waffles I've ever had in my life. They are super super fluffy and taste like cream. I love the waffles with Eggs Benedict because it's the perfect mix of sweet and savoury. The maple syrup is also beyond comparison and the dusting of powdered sugar on top makes them perfect. The place is so cute and the wait time for two goes by so soon. Always a bunch of people waiting outside but it's definitely worth it. This place is beyond comparison."}
{"text":"Great location right in the middle of everything. But over all look and feel of the place left me wanting. Food was -okay-... Service could use some adjusting. There is only 1 girl for the entire place and shes not rude but just in a rush. Also for the place it is priced very steeply. $14 for a breakfast plate. Which I was surprised only had 1 egg included.  In my opinion move on to the next on the list. This has a lot of reviews because of the location but I bet there is somewhere nicer with better food elsewhere."}
{"text":"I have been on the hunt for the best brunch in Toronto. After relentless searching I decided to go with Le Petit Dejeuner which has been very well reviewed. When we got there we had to stand outside(might I add it was raining) in a lineup waiting for it to move slowly.  After about 10 minutes I had a good view of inside where I saw a table that was empty but had yet to be cleared...10 minutes later the same table was still empty but not clean. I being a server find this particularly annoying to be stuck outside waiting when there is a (dirty) table inside screaming my name...

Alas we finally made it inside. We had already mentally prepared ourselves for sh*tty service. On to the food... I ordered the Eggs Benjamin which was ok. not bad but nothing to write home about. My co-part ordered a Belgian waffle which came out cold with butter and a minimal portion of syrup.

The worst part.... while i was doing my research one of the things that I noticed was that while looking at the menu for Le Petit Dejeuner is that brunch is served until 6pm...So when at 3pm I am witnessing the \"bartender\" rudely signalling to prospective customers that they are now closed I was a little more than shocked. When our server came over I asked by they were turning people away when their website states that they are open and serving brunch till 6pm. She had no answer other than they were closed and she hasn't seen the website... 

I will never go to this restaurant again."}
{"text":"This is busy restaurant due it's limited seats. But the food makes up for the wait. They have a breakfast, lunch, brunch (only available during the weekends), drink (alcohol and espresso based) and dine menus."}
{"text":"For dinner today I was craving brunch. I decided to try this place out due to the raves I've heard. Apparently on the weekends this place gets busy and the lineup outside gets extremely long. I had called an hour before to make reservations incase it gets booked. The man on the line assured me that I didn't have to worry about it and just to come in. I had arrived at the restaurant and thought that I would get a good seat. To my dismay I was seated near the entrance. It was chilly at the front even though they had double doors. I couldn't expect anything though, as I had only called in an hour before. Just a note: if you want a good table near the back where it's warmer, call ahead of time.

As you enter the restaurant, right away it has a diner feel. It's very dark and rustic, and kind of romantic. If you want a casual atmosphere, I'd suggest this place for maybe a first date. Assuming the date you are bringing is also budget conscious like you. It's right across from George Brown College so I can only assume this is another place where students go for brunch.

We had decided to order waffles with fruits and an eggs and benny with peameal bacon. Bacon just makes everything right. The eggs and benny came with a side of fries and apple coleslaw. The coleslaw was a nice combination as it cuts down the creaminess of the hollandaise sauce. The waffles are not really worth talking about because there was nothing special about it. It was good but not worth raving. If there was one good thing I could say about the waffles, is that they were light and fluffly.

For the service, I was very pleased. They greeted me with a warm hello, were very attentive, and made sure to check up on us. Our server was very friendly and gave us alternate options.

Overall, Le Petit Dejeneur is reasonably priced. Our bill each came up to less than $20. I would rate it a 3.5 if there was that option only because the food was just okay. But for the budget conscious, you should definitely check this place out if you are looking for a friendly and cheap bite."}
{"text":"Brunch was alright, a bit overpriced IMO. I had the smoked salmon eggs benedict--it was alright but that apple slaw was bad. I also got a cold pressed juice, and it was WAY way too sweet (and expensive)."}
{"text":"Wait was horrible but I think they were down a server. Lots of empty tables inside and no one seating us or taking down names to see who waited longer. Finally managed to get a seat at the bar. Loved their Belgian waffle very crispy and airy. Good job on the poach egg and hollandaise sauce as well. Fruit salad was nothing special."}
{"text":"There's nothing better than sleeping in...though the definition of sleeping in changes depending on who you ask. For me, it's 10 am. And there isn't a lot that can get me out of the house on a Sunday, except brunch. I love brunch, you'll see. It's my favourite meal of the day.

There are so many great places to have brunch in Toronto. Each with its own merits and character. But there is only one place that fills my heart with pure joy. J'adore Le Petit Déjeuner. It'd be a hidden gem if it weren't for the line up. The fact that I'll wait in line for this place is the first sign it's damn good. I'm not a big fan of waiting for anything - instant gratification, it's one of my downfalls. 

PD, as I like to call it, is a funky restaurant that's just big enough to accommodate you and the few friends you can stand that early in the morning. As soon as you settle into one of their vinyl green booths, a server pops up to see what you want to drink. Their coffee is great, and as you can see, the service is perfection. Sold aren't you? It gets better.  The menu has something for everyone from Belgian waffles to eggs bendedict.  The dishes are perfectly seasoned, garnished, and delivered. They have a killer apple coleslaw - simple, crisp and fresh.  You leave satisfied and full on flavour, not grease. My personal favourite is the eggy bread aka french toast. It's perfectly fried challah bread with the right amount of fresh fruit and a dollop of cream. Mmmmm, bon appétit I say."}
{"text":"The waffles are out of this world!!! Better than any typical breakfast places.
Warm staff and lovely atmosphere. Coffee is great too! Recommend!"}
{"text":"I went a year ago and the place was not as busy as it is now. 

Good food. Price was a bit overpriced for what you get in my opinion but cute little shop. A bit snug."}
{"text":"When you arrive and there's a line outside, get in that line. Don't try to squeeze your way in to find the hostess to put your name down. Like, sorry, how was I supposed to know?? Good thing I was with a local who knew the unspoken rule. So I guess we get in this line then every once in a while a server will come out and get your name and party size on The List. When you finally get to the doors, your party waits in the vestibule. Unless you are a party of 5 then you get to stay outside and continue to stare at the table by the window, drooling.  The place is small, so just expect to wait. Service is pretty quick so the long wait is most likely due to people sitting there sipping coffee and chit chatting. 
Let's get to the food. I ordered the Hungry Gal even though I was pretty ravenous at that point. The eggs were the highlight of the dish. I ordered them over-medium and they were perfect. The yolks were so creamy, probably the best I've ever had. Definitely top quality. The others ordered Eggs Benedict and commented that the hollandaise sauce was perfect. The waffles were also ordered and devoured. 
So, clearly the food is delicious. The wait can be long and a deterrent but if you got the time just do it."}
{"text":"The best waffles ever !! Would definitely go again, the next time I'm in Toronto. There was a 30-45 minute wait on a Saturday morning, but was so worth it."}
{"text":"I've been here three times, all on Saturday mornings, and each experience has been the same.

The Good:
The hollandaise sauce here is lovely - citrusy and homemade (or at least it seems homemade).  The food in general is quite good.  Apple coleslaw is always a hit, potato crostini is hit or miss - two people in our group had perfectly cooked ones, while two had hockey pucks.

The Bad:
There is always a wait for a table, which is not necessarily a bad thing.  However, they don't take names or approach the door in any way unless tables are free.  The lineup is first-come first-served.  There is no \"please wait to be seated\" sign or any indication to do so.  The last time I went there, 3 girls were milling outside (who I found out later that were next in line for a table) and I stood in the doorway of the full restaurant as servers made eye contact with me and promptly ignored me.  The whole process could be made a lot easier and less confusing.

The Ugly:
After being seated, our drink order was taken by one person, our food order by another, and food delivered by yet another.  Drinks took forever, and we had to remind servers that a few didn't arrive.  We were seated by the kitchen, where the music was incredibly loud.  We were a party of four, and food was delivered 2 plates at a time, about 5 minutes apart.  And even then we had to ask for cutlery.  Coffee refills were not offered, and had to yet again flag someone down to get some more.  No one bothered to come by after we were served our food to do a quality check and again had to flag someone down for more water and napkins.  The check was delivered without asking if we were all on the same bill (or if we wanted anything else for that matter), and when we asked, we were told that they wouldn't split the bills up for us, even though were were all using different methods of payment.  After some insistence, the woman sighed, rolled here eyes at us and said, \"Fine, I'll do it this ONE time\".  If someone had have asked as they took our order or before they brought us our bill, they could have avoided the hassle. 

I understand that they are busy for weekend brunch, but you'd think that they would hire an extra server for rush times or somehow adapt to be more competent in service quality.

The food is decent, but the consistent poor service certainly leaves a bad taste in your mouth."}
{"text":"This place is amazing, the apple coleslaw is an absolute must.  Everything was cooked to perfection. Ive been here a few times over the years and always feel like I should come more often.   It feels like home in a modern day family. Definitely one of the best and worth a try."}
{"text":"Not much room for big groups here, but the breakfast food is commendable - such delicious waffles and French toast!"}
{"text":"Probably my favorite place for brunch even if you have to wait a little while before being seated! You should try the waffles they're the best I've ever had!!"}
{"text":"My husband and I enjoyed this quaint place for breakfast, it felt more unique than a chain restaurant and we enjoy that. Service was okay. Food was really good!"}
{"text":"I could eat plate after plate of those waffles. Luckily for my waistline, my mother and i split a waffle and a spinach omelette. Everything was fresh and done perfectly. Our tea (can't remember what we got but enjoyed their variety of loose tea selections) hit the spot."}
{"text":"I have marked all the places that serve Delirium Tremens and intend to try them one by one. Finally had a chance to try one on my list. This was an easy pick considering the positive feedback it has here on Yelp.
My friend and I showed up at 7 and the place was almost empty. After ordering our Delirium Beers  we went through the dinner menu which surprisingly is not viewable online. My friend settled on the fish and chips and I went for the seafood crepe. I guess I was expecting  a more French menu as the sauce  for my crepe was asian inspired. Not bad and considering the price we paid I think it was good deal. Will visit again for sure (3 Star for the food and adding 1 star for the beer :) ) 
They have all you can eat mussels on Tuesdays and Wednesdays BTW will give it a try if I get a chance."}
{"text":"Popped in for a weekday lunch and surprised it was quite busy. At the entrance, it was unclear if we had to seat ourselves or be seated.

Service was lacking and food took a while to come out from kitchen. We ordered a Waffles Melody and Eggs Benny. I expected to be blown away by the waffles, but they were just 'ho-hum.'  Both plates came with an odd apple/pickle salad.

We found the price point a bit high given the quality was just OK. Probably wouldn't return as we have experienced much better egg and brunch spots."}
{"text":"The irony of driving to Toronto from Montreal and picking a French* place? Not wasted on me at all.

Another on the great breakfast tour of the 416 stops, this place easily deserves the hype.

Food was delicious and tasty, coffee was brewed fresh, and our server was terrific. My only complaint would be the weird apple/pickle slaw that came with the meal, and the price was fairly high for what we had.

(*it's not French, its Belgian)"}
{"text":"Delicious, sweet, light waffles. Good service. VERY crowded, but that's to be expected with a good, popular place. Decent ambiance - nothing fancy, but they played good music."}
{"text":"Atmosphere is lovely, as is the name. Apple slaw with the breakfast was a nice touch, saved the experience from a single star. Steer clear of the coffee, even saw the cook bring in his own. Had the Hungry Girl with previously cooked and kept warm bacon. I have had worse. The hash browns were dry and petrified on top. The toast faired worse it was dry all the way through with a distinct burnt note."}
{"text":"A local favorite

I eat here all the time. Living in the King East neighborhood I am privy to one of the best bkfst/lunch/brunch places in the city. Le Petit Dejeuner's retro diner decor makes you feel so comfortable. The food- belgian canadian comfort. One of my favourites being the \"hungry gal\" breakfast with their signature potato rosti and apple coleslaw.

For those who haven't been- I'd recommend going during the week for lunch. If you plan to do brunch on the weekend be prepared for a lineup down the sidewalk."}
{"text":"Easter Monday, 1130 am.  How to wait in line is very confusing.  You don't put your name on a list, although a list exists.  You just line up, they come out and put your name on the list.  Wait times are never quoted, just \"not too long\" or \"long\".  

There's no indoor waiting space, so just be sure to dress weather appropriate.

Now, I don't mind line ups.  Especially because they're a visual representation of how long your wait is -- okay, there's 20 people ahead of me.  But what I didn't like was that once we were sat, we waited 20+ minutes to get our orders taken, and 20+ minutes for our food to come.  So we had like an extra hour after finally getting in the restaurant to be served.  

Getting the bill was like begging.  If you have a line up, you need a more efficient system to turn tables.  Two servers making all the beverages, taking names in line, serving, bussing - that's insane.

The Caesar was boring (I always get without tabasco, but have had great versions of this less spicy Caesar at Grand Electric and White Lily, so it can still be good).  I ordered my sandwich with no sides (save $3) and they brought it with sides, since clearly no one is really paying attention.  (Also - the sides were insanely pathetic and I can't believe they cost $3.)  I enjoyed the sandwich...I think...hard to tell when you're so hungry if the food is actually good or not.

Overall, it's not worth the line up and then the wait inside.  When you line up for Aunties & Uncles, it feels worth it.  This just felt like a giant scam."}
{"text":"This place is very cozy and has a nice old fashioned vibe. The staff is very friendly and welcoming. The food is worth coming and the wait that sometimes happens due to it being across from gb so there can be a flood of students at some points. But definitely a great breakfast spot it is one if my favourites."}
{"text":"Horrible service. I asked for something twice, two different people, never got it. Never got asked by my server if everything was okay. Food was meh, not worth the long wait though. Smoke salmon was extra salty."}
{"text":"This is a tiny little place sadly, but very quaint, sadly due to it's limited seating, there are always small line ups at this place. But the wait is definitely worth it. 

The chef/owner is a master baker and churns out true Belgian pastries and breakfast foods. His food is just to die for, and they even plate the food really nicely too which is not what you'd expect at the price. Of course they also serve standard breakfasts too, but their speciality items are just incredible. 

The service is fast and friendly and the prices are fair. The food is just really great the waffles will blow you away. This is easily one of the most unique and delicious breakfast/lunch joints in the city."}
{"text":"Well, I would have loved to review the food here, and maybe it would have been good. Sadly, the moment I stepped into the restaurant, I was yelled at to please wait outside. Not politely asked to wait outside, just yelled at.  I wasn't told anything else, and there was no other staff member present to take our names. There wasn't even a proper line up of people outside, just a mish mash of groups standing about - so confusing! I just walked away at this point. If this is the type of service I can expect to receive once I'm inside the establishment, I want no part of it. Sad to say I'm crossing this place off my list."}
{"text":"Their waffles are so good. The portion felt a little small for the price but the flavour make up for it. 

If you have a craving for waffles this is the place to come too!"}
{"text":"I used to not think there was much difference between a good and bad brunch - Oh, how I was mistaken.  I had the Croque Madame.  Killer.  Such an amazing little spot that fills up very quickly.  Be prepared to wait 30 minutes if you come in at peak hours.  The only way to get a seat quickly is to either be an early riser or come right before they stop serving (3pm).

I hear the waffles are crazy."}
{"text":"Love the waffles and eggs Benedict with Apple coleslaw! Best I have tried in the city so far."}
{"text":"YUMMMM!!! So freaking good and the staff was delightful. Highly recommend this place!"}
{"text":"According to thefreedictionary, a petit dejeuner is \"a breakfast that usually includes a roll and coffee or tea.\"  That does not sound like a breakfast to me.  That sounds like a tease.

Fortunately, at Le Petit Dejeuner (the capitalized one), I crammed my face full of plenty of things in addition to a roll and coffee.  Coffee was had.  Oh yes.  It was had.  And much of it, since it was chilly, gray, rainy, and miserable out.  

However, for -my- petit dejeuner, I subbed the damn roll for a giant honkin' plate of crisp greens and one big-as-hell croque madame.  You know the kind... with crispy buttery toast sandwiching savory dead pig, all topped off with a gooey egg.  Admittedly, my egg wasn't so runny, but that suits me just fine.  And I was way more interested in the butter and meat on the croque than anything else.

This joint was shockingly dead considering how pleasant the service was, how much I enjoyed my meal, and the reasonable (although it's not cheap, by any means) price.  I kinda wanted a petit nap after my petit dejeuner, though.  Not gonna lie."}
{"text":"hands down the best french toast I have EVER had in my life. The french toast is caramelized to perfection.  Light layer of hardened sugar on top and then soft n fluffy on the inside.  MY . GOD. it also comes with a side of fruit which is a nice touch as well.  I will definitely be returning to try other things on their menu!

super cute diner feel and the service was standard.  Expect to wait to be seated, the line up can get longg."}
{"text":"The eggy fried bread here is one of my guilty pleasures. It is perhaps the perfect french toast: crunchy carmelized sweetness on the edges, a soft sponge-cake like texture on the inside, real whipped cream and strawberries on top. I don't normally go for such sweetness, but once I tried it I was hooked. Primarily because of the carmelized edges, they totally slay me.

The service is always nice despite often being over-stretched, the decor is friendly and warm, the green diner booths are welcoming and the noise level is fine. I suspect they have a good list of on-tap beers and it's a good spot for evening dates or dinner. Until then, I'll keep coming here for sinful lunches."}
{"text":"My friend took me here and my god... Foods were sooooo goooooood!!!!!!!!!
We didn't have line up since we were there super late, but food took a while to come out.
BUT! So delicious!!!!!
Service is amazing and friendly :)
Waffle is a must eat..! A waffle per person!!!
Seafood crepe pouch had lots of seafood with delicious sauce!
Mac and cheese with eggplant had packed mac and cheese and eggplant tasted like tonkatsu!"}
{"text":"Anything below four yelps is just misinformed or a victim of the challenges a breakfast place occasionally has when it has line ups out the door every weekend brunch.

Here's what I suggest you start with:
Easily one of, if not the best Eggs Benedict in the city.  When the kitchen is clicking, their waffles are probably the best in the city.

Other dishes are good, coffee is good, affligem for breakfast also good.

Eclectic atmosphere, and all in all one of my favourite breakfast spots in the city."}
{"text":"Great little neiughborhood brunch place.  Fantastic food and friendly service.  A small wait on weekends is always worth it!"}
{"text":"The best waffle that I've ever had!!! Truly worth the line up !!! Although I came here on a week day .. For sure will come back"}
{"text":"Thoroughly enjoyable but I can understand the hot and cold reviews for this place.  MY experience was great because it was on a slower saturday afternoon.  But had I come at a packed time I can see how the service can turn into a hurried rush and the food could lack quality.

I ordered the bennies just because I heard it was so good.  and true enough, they were quite well done.  I'm a HUGE fan of their hollendaise which I usually HATE.  It has this wonderfully light lemon taste.  SO yummy.

The service was fine, all the female servers were quite nice and friendly and took their time to make sure we felt welcome.  But again, had I come at a busier time I can see how they might be perceived as not-so-nice.  

the decor.  Can we talk about the decor?  It is AWESOME.  It is a narrow little room with nice dark wood tables and then some weird ass shiny/sparkly vinyl seating for the booths.
The small and intimate space was VERY nice.

This place is a tad pricey, but it is quality food for a portion that is sensible (meaning they don't give you too much food that you feel obliged not to waste and they don't give you a tiny portion where you feel cheated).

I'd go again, but I wouldn't be a regular."}
{"text":"It's a very nice place with an awesome staffs. And the waffle's so delicious thanks again for the discovery."}
{"text":"Holy cats was my breakfast crepe AMAZING. I flipping love the food at Cafe Crepe, which I live about ten feet from, and yet I know I will be returning here for another breakfast crepe. I was especially pleased by the fruit side, which is something I basically never say. Good presentation, good flavour.

That being said, my date treated me so the price didn't exactly bug me when it is definitely around $5 more than the comparable ham/egg/cheese crepe at Cafe Crepe. I think you get what you pay for, though, in terms of portion size, sauce and additional content (lovely hash browns).

It also took showing up a little after nine am on Canada day to dodge what I'm told is generally a huge line up. By the time we were ten minutes into our meal that line up had materialized and when we left it was out the door and about ten people deep down the sidewalk.

So maybe bring a book?

Anywho, the service was good - though that line did make it feel like I was being chased a little bit during my final bites. 

Overall, I'm very impressed with Le Petit Dejeuner and will happily make the trek to eat there again."}
{"text":"I went here on a beautiful Sunday afternoon to treat myself to a quiet brunch while reading the paper.  Inside they are very European in feel especially the lack of AC.  I was fine with that as long as I get my food on time.  It took a while for me to get seated and it took even longer to get my food.  I ordered quickly but unfortunately it took a very long while before I got my food and I had to remind the server if my food was ready before it got delivered to me.  

I wanted the waffle benny but instead I got the Eggy bread aka French toast.  It was quite good and was served with fruits and whipped cream.  The portion size was adequate.  However, by the time I was done I got two invoices from two different servers.  I guess they really wanted me out of there and what better way to signal that than by ignoring you the whole time and then when it is time to pay overwhelm you with the bill.  

But this is in my hood and I am willing to come again another day as the food was quite good and I have yet to try the waffle benny."}
{"text":"Excellent food and great staff. Very busy on weekends but worth the wait. Waffles are to die for."}
{"text":"Awesome brunch spot on king st. 

The eggs benny was amazing.

It is a small place, and if you can get a window seat on a sunny spring or summer day, you are set. 

Service was very good. 

Would come back - if not for the fact there are so many brunch spots to try in T.O."}
{"text":"Meh, a little overrated. Ordered the eggs benny and I gotta say it was really underwhelming. Sauce - OK. Egg was cooked pretty well - just soft boiled and a little runny. But nothing mind-blowing, nor was it worth the price (overpriced, forgot how much it was.)

Also the lineup for this place, wow.....definately not worth it. For an amazing eggs benny I'd recommend Chewchew's diner - damn good."}
{"text":"Oh what a treat it is to have brunch here. There is a line that goes out the door, and people can be very competitive about it. 

I've had a few things here--the waffles are spectacular, the hungry gal is great, and the eggs benny [any of them] are delicious. 

Staff are friendly but service is not the quickest."}
{"text":"Went to this cozy little establishment for brunch on a complete hangover morning.  The waitress was very friendly and pleasant and made my food selection 

Can't really comment on my food as I only had a fruit salad with smoked salmon and toast on the side.  Presentation was nice, but all i could taste was the rum & cokes from the night before.  

The rest of my party had beautifully fluffy waffles, a soup that looked well made and a decently packed sandwich.

Seems like the perfect place if you want to brunch and read the paper by yourself for a calm 'ease into my weekend' type morning.  During the week however, I imagine it can get quite busy with all the offices around."}
{"text":"Rude & Arrogant waitress + mediocre food.

They served my plate incomplete, and decided to justify their stance rather than apologize. They said they intended to serve the second half ( the second egg ) later on. By the time I was done with my first egg, I was left waiting with bread that went stale on my plate for the rest of my food. 

They served the rest of my food to another table and forgot about me. I left hungry and disappointed with no discount on my bill.

Tip to restaurant: Don't justify your stance when you are wrong rather than apologizing. When someone decides to call you out on the bad service, DONT snear!

Not Coming Back again!

Dining Date & Time: 17 September, 12 PM"}
{"text":"The waffles are amazing . However, the chicken caesar salad was disgusting. The chicken was old and wasn't fresh at all. The servers were nice enough to take if off from the bill.
So was the salmon omelette, there was water with the omelette."}
{"text":"Where do I start!?!? You need to come here for Toronto's best brunch! I went on a day while the city was experiencing a deep freeze and let me tell you, this place was the only restaurant that was hopping along King Street E.! If you're coming on the weekend, be prepared to wait anywhere between 15-20 minutes by the door with other couples who had a craving for their delicious food!
A few things to take note of: 
-Their menu doesn't have a lot of non-pork options. 
-but that's okay because their fish option with eggs Benedict is one of the best things you'll ever taste! 
-when I was there chicken was not an option. 
-didn't see chicken and waffles on the menu (don't know why) 
-The atmosphere is warm, friendly and cozy. Careful not to knock the person beside you when you're heading out and putting your coat on."}
{"text":"I eat here at least once a month.  The food is unique, healthy (mostly) and honestly delicious!  The staff is always friendly, and it can be hard to get a seat... but, it is worth it!"}
{"text":"A little overrated in my opinion, considering the wait/line up. Arrived around 11 am, waited about 30 minutes.

Ordered the hungry gal - eggs over easy, rye toast, potato rosti and peameal bacon. Eggs were cooked nicely with yolks still runny and peameal bacon was tasty! I'm not a huge fan of breakfast/brunch joints that skimp out on potatoes - would have enjoyed it more if the serving size of the rosti was more substantial. Service was quick and friendly. 

Overall, pretty good but nothing to write home about."}
{"text":"I've never had better waffles before. It was crisp, light and crunchy. 

brunch : The wait to get in on a weekend, was maybe about 10 mins. And they have a very quick turn over, food arrives quickly, and it seems they just want you out. But still, amazing food, but not really a place that you can stay and chat.

lunch on the other hand is quite different. I like that I can get eggs benedict for lunch. It seems much calmer and people taking their time to eat. food is delicious"}
{"text":"Nice breakfast spot very near the St. Lawrence Marketplace. Waffle was incredible! Small and cozy with what appeared to be one man being barista, host and waiter. Despite that, he was fairly quick. Only complaint was there didn't seem to be a clear coffee menu."}
{"text":"Don't be turned off by the line-up! Worth the wait and the line moves quite promptly. The Belgian waffles are crisp and light. Perfect when topped with fruit. Also enjoyed the Hungry Girl Breakfast with the sausage and apple coleslaw. Everything was delicious. 

Four stars because this place feels quite tiny so not great for groups and it's really busy so coffee refills are few and far between. But no complaints about the food."}
{"text":"We probably should have heeded Kat F's sage advice about groups and Le Petit Dejeuner but four of us turned up there on Sunday anyway. 

We waited at least 30 minutes outside. I was freezing. My Canadian companions didn't think much of the temperature nor the tiny snowflakes that occasionally landed on our coats.

When we got to our table I promptly ordered a hot chocolate (everyone else had coffee). My cocoa was prepared just to my liking - in a tall glass, not too sweet.

I contemplated the entire menu but in the end chose to go with the plate that provided the most options: The Hungry Gal - two eggs, toast, potato rosti, apple coleslaw and peameal bacon (aka Canadian bacon). The Canadians ordered pretty much everything else on the menu - apple pancakes, Belgian waffles, french toast. And you better believe I tried them all!

In sum, brunch at Le Petit Dejeuner was worth waiting outside in the cold for!"}
{"text":"First time here and loved it!  There was a line up on a Sunday at 11:30 but it moved fast.  There were 3 of us.  Had the table right at the front by the window.  Two people had waffles and I had the ham/cheese sandwich.  Everything was amazing!  Tea was nice and hot!  Staff was really efficient and pleasant.  Place is small and cozy."}
{"text":"RIP XXX DINER

I never ate here, but worked here when it was XXX Diner.

It rocked.  It was a fun kitchen and a nifty spot to work at.

Peace!"}
{"text":"We got here on the morning of good friday at around 10:30 and there were about +5 people waiting by the door. Luckily, since we came as a small group, we could skip the wait and sit at the bar. I am really into the decorations inside - the chairs are bright shimmery green and everything has a retro style. 
I ordered the toast champignon with a poached egg; everything was on a well-toasted sesame bagel. The mushrooms, onions and bacon bites were seasoned and sauteed. The bagel was soft and a bit crunchy at the same time. The dish comes with rosti potato and apple slaw on the side. It was very delicious and I absolutely loved it. 
My friends ordered The Hungary Gal and Waffle Benjamin (with smoked salmon) and they were both happy with their order.
The only reason im giving 4 stars instead of 5 is their serving time was horrible. The place was not big and it was pack so it was understandable that we had to wait. and we were already grateful that we got to sit at the bar right away. But after we sat down, it took them a least another 50 min to make our food. Very strangely, some people who came after us even got theirs before we did. The servers were nice people but i was not a fan of the wait."}
{"text":"i regret not having the waffle..
i had sauted mushrooms on bagel.. was good..
but after reading all the reviews i would have loved to try the waffle.

apple slaw was yum on the side and service was very nice as well..!!"}
{"text":"Nice small restaurant for a casual outing. Often gets packed fast. I ordered the Belgian waffles with fresh fruit (Brussels and fruits). The waffles tasted great and fruits were definitely fresh. Added to the side was whip cream and maple syrup which complemented the dish well. I did find the place a bit dirty. When I sat down the tables were not wiped down. There was crumbs and pepper on the table. However, the staff were quite friendly."}
{"text":"Mmmm the Belgium waffle was divine - truly light and crispy and yummalicious! If only there were more of it! I loved so many things about this place - the geniunely friendly service, the cute and kitchy decor, the quality of the food - but the quantity left a little to be desired, and the price was perhaps a wee bit steep for what you got. And although the idea of apple coleslaw excited me, the reality of it disappointed. Nevertheless, I'd definitely go again, and recommend to anyone!"}
{"text":"Arriving at Le Petit Dejeuner it was a good sign that there was a line up, but bad that it was such a cold and blustery morning. The other reviews had mentioned that the place would be worth the wait. A sign on the window indicating an oversupply of peaches had allowed a special on peach Bellini's to be on offer was also a good sign. Particularly for brunch.

The first few lucky people waiting in the line had made it into the ante-room to keep warm and we only had a few people in front of us. The hostess came out to mention that she had seats for two at the bar and we took the offer.

The bar seats gave us an immediate feel of the place, the hostess welcomed us and the place felt more like a shared space than a café, with the hostess coordinating everything. The benefit of being at the bar meant we could order and receive our coffee orders immediately. Seated with coffee and food ordered. Magnifique. 


Considering that the place was fairly full, I had settled in for a bit of a wait, nothing that I was not up for. I was surprised when after what seemed like only minutes the food arrived. The Eggs Benjamin I had ordered it was noted by the hostess is made with salmon they smoke themselves. The dish was great, good balance of flavour and particularly nice with the lemony hollandaise that was clean and light. I am not normally one to select any kind of Eggs Benedict or varieties due to the sometimes over rich sauce which most places slather over everything. LPD however has done Eggs Benedict the way they were intended."}
{"text":"We followed our yelp here ... Sunday morning 10:30 ish canada day weekend...no waiting...had the waffles benny..lightest waffles we've ever had...eggs perfectly poached...great blend of savoury and sweet..peameal bacon finished it off nicely.  service friendly ...not overly pricey..$15 per person...nice busy diner atmosphere"}
{"text":"Weekday breakfast and no line to get in. Decent service and food is delicious. Enjoyed the Belgian waffle and the French toast. Coffee and cappuccino a bit in the pricier end. I don't know if the breakfast is worth waiting in line for on weekends though. Not in my opinion."}
{"text":"Very crowded. Have to show up early and wait in line for Brunch. But it was worth it. Just make sure to come early. The best thing about this place was the waffles! Best i've ever had. It turned our hangover around and put us in an amazing mood. Thats how good those waffles were."}
{"text":"Came here with my friend to see how the brunch food was like here. Have to say I was very disappointed with the pancakes that she ordered. There were 3 pcs and they were barely the size of my hand. They were pretty expensive for what we were expecting. I don't expect a giant stack of pancakes obviously but for an order of them not a side they should be a bit more generous. Needless to say they weren't worth the price she paid for them. My mocha latte was good, but I can't weigh out the cons with my drink."}
{"text":"My wife and I were visiting Toronto for a weekend without kids, we stopped in for a bite after reading favorable reviews.

Even though it was packed, we were seated quickly and waited on in good time. 

I had a breakfast crepe that was fantastic. As did my wife. We were both quite full. Coffee was good as well."}
{"text":"I just had to go back to this place for breakfast. Best waffles ever, nothing will disappoint you on this menu."}
{"text":"Best waffles in Toronto - hands down.  

Super crisp flaky - comes with real maple syrup and whatever you'd like on the side - eggs, bacon, fruit, eggs Benny. 

Coffee is decent - was pleased to see they had almond milk which is rare for most breakfast places. 

Service leaves a bit to be desired- but for a busy brunch/lunch place but given the volume they get the job done. 

Also note it's packed on weekends - definitely expect a wait on Saturday or Sunday.  But so worth it!"}
{"text":"cute little belgian style diner. came here for brunch on valentines' day.

french toast was awesome, waffles were apparantly delish, and they had duck confit egg benedict...wat? that was a bit of a weird concept. good food over all. the house made sausage patty was also very flavorful. yum!"}
{"text":"Been here for the first time last week, and i know i'm sure it will NOT be the last. Their hollondaise sauce is just perfect... Im very particullar about what i like. Their waffles were also so scrumptious.... If it was a bakery style, id buy a few to munch on. It was a great experience... The server was also very good."}
{"text":"Charming diner. The Niçoise salad was really filling and really good (despite the lack of olives). Staff were inattentive but otherwise friendly. I should have ordered a crépe or a croque monsieur/madame but I was feeling something light that day. Oh well. Next time I'll order either items for sure!"}
{"text":"Had the Hungry Gal breakfast, apple coleslaw, fresh toast, succulent scrambled eggs. Best breakfast I've had in recent and not-so-recent memory. Ah'll be bahck."}
{"text":"This place has become a holiday tradition for me and my family.  The three of us always visit the week after Christmas.  We live north of the city, so driving downtown on the weekend only to line up forever is not how I like to spend my days off.  Hence the after-Christmas visit was born.  

It's hard to avoid a line up here, so I was excited today to see that it was so so cold and was hoping that would deter diners.  We arrived at 11ish and there were only two parties of 2 in front of us.  We waited about 15 minutes for a table.  The service was very swift, even though the place was full and there were only 3 people serving.  The place is always jammed, and I've never really experienced \"slow\" service as other report.

I always get the ham and cheese crepes - they are outstanding.  The are drowning in a delectable chive cream sauce.  I order a side of potato rosti to sop the leftover sauce.  I wish they would double up on the crepe (is that even a thing?  It should be a thing).  The crepe is the best part and often gets lost with so much filling.   

My husband and son usually get the hungry girl breakfast, an omelette or the peameal/egg breakfast sandwich.  We always order the begin waffles to share.  The waffles are amazing, light and crispy, not the dense type that is more common in North America.  The rest of the food is very good.  It's a little different than other places, and it's tasty and consistent, and that keeps us coming back."}
{"text":"THE best delicate belgian waffles. Great brunch fare. This place is crazy busy, small but worth it if you can arrive before the rush. It is rushed and crowded for a reason. You have to try a least once."}
{"text":"Amazing brunch place - specially for their Waffles!

Good: 
1. Their Waffles - one of the best waffles I've had
2. Other brunch options are also good
3. Ambiance

Not so good:
1. Portion - quite small and a bit pricey for the portion"}
{"text":"I was so excited to come here but now I'm not sure why. 

The wait is long, the service is terrible, food is average and prices are not reflective of the quality of food. I feel like they bank on people coming but if they ignore their customers (even when trying to pay) they won't have folks coming back."}
{"text":"Omg! This place it's a must.
It's super casual, great for brunch, on the weekends it can get pretty busy (I've waited outside for over 30minutes, and it's ok cuz the food it's amazing) 
 The waffles are a must, even if you are gonna share you have to try them.. My fav are the eggs Veronique (SO GOOD) the eggs are perfectly cooked. 
The coffee it's pretty strong and they keep your mug full which is always nice.
If you don't want to wait outside arrive early :)"}
{"text":"Wow, wow, WOW this was incredible brunch!  Eggs were beyond perfect, bacon was unbelievable, and the waffle was light and delicious.  I just wish there had been more on my plate!"}
{"text":"The CONS:  First, don't go to this restaurant incredibly hungry because you cannot judge the wait and you will get impatient with the staff.  The restaurant only seats 50ish, so it is small...you have to wait outside, so good luck if it is snowy or raining...

The PROS: Great waitstaff, fast service and INCREDIBLE food.  I had the 3 cheese omelet that was cooked perfectly and had the most amazing fresh herbs.  My boyfriend had the waffles and they were insane...SO light and fluffy.  The chefs here knock the food out with incredible care.  We went to another breakfast spot the next day and were really disappointed...next time we are in Toronto, we will stop by this gem on King St."}
{"text":"Ok. Short review here. 

1. A short wait about 10 mins.. That wasn't bad the waitress was polite and really nice...
2. Portions are really small. About half the size of the breakfasts that are at Insomnia.  The potato was like the hashbrowns they sell @ Tim Hortons!
3.  Service was very poor once you sat down. We were ignored like 5 times.. that blows
4.  Food was sub par. Overbooked sausage. Poor salad and a very standard waffle. 

Hmm. Hate to say it but I likely won't be coming back. I had pretty high expectations for this place as Laura C put up a good review.. 

Back to Insomnia for me!"}
{"text":"We were in the area and decided to look for a brunch place- I had bookmarked this place a while ago and so we decided to try it. When we got there, sure enough there was a line at the door, good thing we only waited for 15mins as during our meal the line got super long.
I was super excited to try their Belgium waffles since there are so many raving reviews of it. I opted for the Waffle Benjamin which was Belgium waffles with poached egg and smoked salmon. This would be similar to eggs benny with smoke salmon but the waffles are just on the side and there is no English muffin.  What I thought about this dish? Not so great as the waffles had a particular taste and texture that I did not enjoy. The apple coleslaw was pretty good but not significant. Also ,to be honest with the price of this dish, I expected 2 eggs but there was only one. For an egg lover like me...it is not cool..
I also ordered a side of  homemade sausage terrine- I thought it was pretty tiny for $4.5 and it was quite dry imo.
The boyfriend ordered the Croque Madame- it was a grilled sandwich with ham, swiss and dijon. There was also a  sunny side egg on top. The side salad was huge and yummy as well- remember to ask for the dressing on the side though. He said the sandwich itself was good.
In regards to service, it was not the quickest as it was quite busy for a small restaurant; especially when we had to wait for the debit machine. The staff were friendly though.

I probably won't be back again due to the line up and I am sure there are better eggs benedicts and waffles in the area.

It is always fun to try out places with a hype, so try it...why not right?!"}
{"text":"Go here! Le Petit Dejeuner is a gorgeous little breakfast joint that has the feel of a cocktail bar and hands down makes the best waffles in the city. Seriously, it's been voted that twice!

I've been there a few times and this last trip saw me eat the Belgian Waffles with strawberries. Serves with the most scrumptious cream and maple syrup. Now, something you should know about me if that I am a maple monster, it rivals my love of poutine. Typically when eating pancakes, waffles, french toast or general breakfast I would require my own syrup bottle. If the restaurant danes to serve the syrup in one of those measly tin shot glasses, I need to ask for two more (at least). Well, yes, they serve the waffles in one of those mortal tin shots and while I was at first very worried it wouldn't suffice, the waffles absorbed the perfect amount of syrup (not sponging it all up, like a lesser waffle) while leaving loads on the plate to push around with each bite. One shot, that's all that was needed.

The lightest, fluffy (yet crisp) waffles in the city. Go try them now.

Also, the other options are pretty delish. They even have a dish called the hungry gal, much better named than the hungry man. Much more hilarious vison. ;)"}
{"text":"Yes, you will wait... a loooooooooooooong time to get seated here. So when we took Miriam here for brunch, we made sure she was bundled up. We waited about 30 mins or so. The servers would check on us once in a while to give us an ETA. We were unwilling to split up in 2s so we kept on waiting...outside. 

But once we got inside, we decided to go for the gold. Usually, we'd order one dish per person. But this time around, the four of us ordered six dishes - steak eggs benny, apple pancakes with a side of bacon, the hungry gal (seriously kitchen sink), eggs benny, waffles and french toast. And yes, we ate it all. The food is always excellent here; it's the service that's hit and miss.

This time around the service was quite good. A little rushed and frenetic, they actually stopped when we flagged them down. One of our servers has a great sense of humour; always nice when you're frozen and starving. The only hiccup for me was when they informed us that they ran out of maple syrup and only had Aunt Jemima. UHHHHHHHHHHHH ok. What can I do? I took it anyway. 

Anyhoo, LPD deserves 4.5 stars but is only getting 4 for the Aunt Jemima incident."}
{"text":"We have been meaning to try this place for such a long time but I always see the long lineups on the weekend and then we backed out.

So when an opportunity came to try this place on a weekday we didn't hesitated to go there. We came before 10 am on a WEEKDAY and THERE. WAS. NO. LINEUP.

Once we were inside the restaurant, you can tell the place is already busy. We were seated immediately by the hostess and given the menu. This is where the waiting game starts. Since we only saw 2 people working both as a server and barista, we have to wait for 20 minutes before our order was taken.    Another 15 minutes before the food came. So word of advice - don't come here if you're starving and expecting a fast service.

But through it all, the servers were very nice and pleasant. And the food - OMG they were so delicious!

Whenever I go to any breakfast place, I always try the Eggs Benny. This is somewhat my test to see if a restaurant is a FAIL or SUCCESS.  

And I must tell you that the Eggs Benedict here is one of the best! Perfect poached eggs with creamy hollandaise sauce, a WINNER! 
And since we also want to try their Waffles, I ordered their Waffle Benny which is Eggs Benedict without the English Muffin and 2 Authentic Belgian Waffles plus a choice of Peameal Bacon or Bacon Strips. The Belgian Waffles is so light, airy and fluffy - sooo good. It also comes with an apple slaw which is also delish.

My SO ordered the Eggy Fried Bread which is Caramelized French Toast and he raves about it and since he's picky this is a huge compliment! We also got a side order of Potato Rosti that everyone liked and were wolfed down in seconds.

Final Verdict - I should have tried this place long time ago regardless of the lineups coz it's really worth it!  Don't let the lineups deter you from trying this place, if you want good food then you will surely like it!"}
{"text":"Very mediocre breakfast - I had the waffles with strawberry. The $6 upcharge from the plain waffles was not justified for the 3 skirts of 'Chantilly cream' (read whip from a bottle) and the 4 strawberries fanned out, of which 2 were rotten on the inside. Slow service even with few patrons in the restaurant, wouldn't recommend."}
{"text":"One of my favorite breakfast spots in the city.  If you get there past noon, you may have to wait upwards of 30 minutes (which can be annoying if the weather isn't great), but the wait is generally worth it.  Belgian waffles are excellent as are the eggs benedict.  Great homey place with good service.  Definite recommend!"}
{"text":"Excellent breakfasts. Great atmosphere. Friendly personal service. 

Their Eggs Veronique with peppers and onion was fantastic. And my friend had the Toast Champignons. She said she liked it but that the mushrooms tasted a bit too sour. 

I'm quite certain I'll become a regular at this place. 

Love the diner vibe"}
{"text":"This place was great. Glad we didn't listen to the lady that came out talking crap. Small spot, have to wait outside if it's crowded. Had the Western omelette which was excellent. Loved the apple coleslaw! Mimosa was great! Service was great!"}
{"text":"First time I attempted to eat here, the place was closed due to a plumbing problem.  They gave us a free cinnamon waffle snack.  Second time I went was a Monday afternoon so there was not line-up and the place was not busy. Even though it wasn't busy I do have to say the service was slow.  My husband and I both ordered the eggs benedict & benjamin.  It was delicious.   The third time we went, it was a Sunday afternoon.....big mistake there was a line-up and we decided to wait it out.  We finally got a table which was right behind the entrance door which was kept swinging towards our table and a bit annoying.   At one point the entire kitchen staff came from the back to go out to the front entrance to have cigarettes.  When they came back in they looked filthy.  You could tell they wiped their hands while cooking on their dirty jean shorts and I got that nasty feeling they weren't going to wash their hands when going back into the kitchen to cook.  I can't really say if they did or not because the kitchen is in the back and we were sitting at the front.  When we got our order (I ordered the eggs benjamin again & my hubby ordered the waffle benjamin).  My potato rosti was dried out and inedible.  They did replace it for a new one.  I have to say due to what I saw with the kitchen staff, I don't know if I'll go back to this place."}
{"text":"Had brunch here with 2 gf's.  The server was pretty nice.  But I'd have to agree with Lauren M, that it is a bit slow.  Hard to find parking on the street, so take transit if you can.

I ordered a savoury crepe with seafood.  It was tasty, if not a bit...wet?  Their slaw was ok also.  

One of the girls ordered something like a grilled cheese with it had apples in it (also ok), and my other friend had a regular breakfast crepe."}
{"text":"theres a nice old time, worn feel to this place and then it has these strange sparkly vinyl blue seats.  they are quite fun but if you are going to grab a booth then make sure you have one of their extra long tables as some of the the shorter ones are too close for comfort.  

after we changed tables to somewhere closer to the back, we poured through the menu and made some difficult choices...everything sounded great.  i settled on a poached egg with sauteed mushrooms atop half a bagel.  that came with potato rost and apple cole slaw.  my mum had a spinach and brie omelette and we shared smoked salmon and fishcake sides.  admittedly i didnt try my mums omelette, but i had everything else.
 
the mushrooms that doused my bagel were very flavourful, like they had been sitting in some great chicken stock or something for an entire day.  the egg was runny (love that), rosti roasted, the slaw a nice surprise.  the salmon was awesome.  the best smoked salmon glistens with salmon oil and is pinky not peachy.  this was.   the fishcakes, were, well, slightly fishy.  go ahead and call me a goof for that one; i think i dont like smoked salmon cooked - which is what this had in it.

the staff was great, helpful, direct and kind.  the prices, though, i think are a little too high for what you get but on occasion, id go again."}
{"text":"My friend and I came here yesterday for brunch. You need to know the following:

* there's no waitlist! Make sure you let someone inside know you are waiting for a table (& # of people) and wait outside. Queue orderly behind the front door. It pays off
* wait time can last up to 15 minutes if you arrive at 11am

Once inside we were seated at a cute, minute booth.  The servers are efficient. Not overly gregarious. They promptly took our drink orders but it took a while to get our food order taken in.  

My friend ordered the Hungry Gal and I ordered the buttermilk apple pancakes. My pancakes were delicious! So well made - no soggy, lumpy, large mass. Just the right size and great tasting.  They were served with a fresh apple coleslaw. That was different and I enjoyed it. My friend also enjoyed her breakfast. By the way, my tea came with milk on the side!

This is definitely a lovely place for brunch and I will gladly return!"}
{"text":"meh . pretty average and nothing too special for me . 

we got there on saturday around 10:20, in a group of 3 and had to wait about 15-20 minutes or so . we ordered egg benjamin x2, breakfast crepe & a strawberry waffle to share . i thought the waffle was really good even tho waffles arent really my thing . but i dont think it justifies the price for the portion they give you . hollandaise sauce was a little more lemonier than most places but not necessarily better imo . so the egg benj was nothing special . lady marmalade still holds the best egg benny in toronto title for me . i was excited about the apple slaw but it was nothing interesting . 

booo . i really wanted to fall in love w this place, with its cozy-sounding cute french name and all ."}
{"text":"Had Benjamin waffle. The quality of food is good. But, I have to say it was probably the longest wait for food I've had in a long time. Also, the portions were surprisingly small, for $15 I was not full."}
{"text":"It was a cute and cozy brunch spot. Inside was small, or should I say, petite. The decor was very old school with little diner-like elements in there.

My friend ordered the waffles with bacon and egg's while I got the omelette. We also ordered a plate of pancakes because we were craving them! Unfortunately half way through our meal, the waitress comes and informs us that they have ran out of pancake batter so they gave us some french toast and a piece of waffle instead. Sad face because I really wanted to try their pancakes too!

Onto the food, the food was average. Nothing special just a good plate of food. The waffles and the omelettes were good enough for me to like it and to finish it with ease. One thing to note was that my omelette was super salty in some areas, it didn't really bother me but it was a huge hit of sodium overload when I was ate without knowing. The French toast was pretty good too.

Overall, it is a cute little brunch spot. It's in a great location just minutes away from St.Lawrence Market and the farmer's market! So you can eat before you go shopping or eat after you shop, either way it's right there! I would definitely come back here again to try their pancakes(when there's enough batter next time...) and their egg bennys!"}
{"text":"Cute little cafe with vintage decor.  I recommend the buttermilk apple pancakes.  Actual pieces of apple!  A bit pricey, but I'll do anything for brunch."}
{"text":"Mediocre brunch place. No line ups on a weekday. The egg benedicts were a bit subpar and on the small side. Staff were friendly and the environment was nice."}
{"text":"I've only been here for brunch, so keep that in mind. The food here is excellent. There is no better place in the city to get Belgium Waffles. They are pretty fucking good. I've tried several different breakfast combos here, and they've all be enjoyable. It's a bit pricey, though I think the food is worth what you pay. The problems? Well, the long-ass lines are a bit of a suck. I've never gone and not had to wait 20-30 minutes to get a seat. I wouldn't come here with more than 2 people. Service is slow; oh so slow.  Finally, the place seems to attract all sorts of douchebag customers. Perhaps the proximity to Bay street is the problem? Or perhaps waiting so long in line makes people surly? Anyway, what can you do? The Waffles are pretty fucking food."}
{"text":"I have been here twice and have managed to avoid any sort of line-up. The last time I was there it was 10am on a Tuesday and the place was completely empty. So chances are if you're showing up on a weekend you're going to do battle with everyone else in the city for one of their tiny tables, but it's certainly possible to get a seat with no wait here.

Both times I have been the service has been more-than-pleasant. And in the last case our food (there were three of us) all showed up about 15 minutes after placing our order. I had the spinach omelette and it was fresh and tasty. The coffee was also good and my cup was never empty.

Not usually in the King East area that much, and I've not been here for dinner, but this place is definitely on my radar for future dining."}
{"text":"This place has some of the best waffles in Toronto.  Light and fluffy with the perfect amount of crunch!  Eggy Fried Bread (aka French toast) is absolutely fantastic with the Chantilly cream.  Get there early or you're gonna have to wait outside, but if you do see a line, it's worth the wait!  Great ambiance and friendly service!"}
{"text":"I went here last Sunday for brunch. There was line but it was not too long a wait. 
It's a quaint place, servers were very friendly. 
I had the breakfast crepe(vegetarian) and the masala chai roobios and I loved every bit! The apple slaw was delicious, with the tangy taste. 
My friend had the Waffles Benjamin, and seemed to like it as well. 
I would definitely recommend this place, they are friendly and got good food. Be prepared to line up and wait though!"}
{"text":"Waffles, waffles, waffles!! This place gets 4 stars simply because of its amazingly light and airy waffles. I honestly think they're the best in Toronto. Unfortunately, I'd say the rest of the food is only mediocre. If you think waiting in the cold outside for 45 mins is worth it just for these waffles, then definitely check the place out. If you're not a waffle lover, you will probably be disappointed. Their coffee/lattes are quite good too though! And service is pretty good as well."}
{"text":"We are regulars here. We come right at 9am so we don't have to wait in line. I've gone through most sections of their menus and tried their specials. Always good. 

We love the bread pudding when it's on special, we also love the beet ginger apple juice (a great hangover tonic IMO), and we love love love their hollandaise sauce. The eggs florentine always have fresh spinach, which makes a world a difference. 

Friendly service, they know us by face.  Fun music selection. Nice ambiance. Lots of young urban professionals go there (we see many fellow lawyers)."}
{"text":"It is to my good fortune that I neither live nor work anywhere near this place.

It really is.

The waffles. The waffles are just incredible.

In fact, everything about the menu was amazing, it made me really struggle to decide what to go with. I'm assured by my breakfast partner of the day in question that it's pretty much always like that, too. She's more of a regular than me, and has never been let down.

Service was prompt and friendly, always important."}
{"text":"Great vibe for brunch. Located in a lovely part of toronto downtown. Had a veggie omelette with potato rosti, chopped fruit and their light original belgian waffles."}
{"text":"Food: pretty good, small portions. 
Waffles: delicious; but advertised as 2 waffles for $7 but was actually 1 waffle cut in half.
Waitress: waited at door for 5 minutes before being acknowledged when the restaurant had empty tables and wasn't busy. Then once sat, menus thrown on table and the waitress walked away, not to return for another 15 minutes. We had to remind her of our beverage order, which ended coming out with our food. We had to further ask for every fundamental condiment for our breakfast, whilst wincing at the awkwardness of her cold demeanor. My group also witnessed this waitress unnecessarily move an elderly woman to a smaller table when the restaurant was virtually empty.  

Overall this place is not worth the money. It has a fun atmosphere, but anything positive is ruined by the terrible service and mediocre food."}
{"text":"Delicious waffles ! For brunch. But service could be better. We wanted to sit at the bar and they ended up sitting us at a super small table at the back even though there was space. One of the waitress kept rolling her eyes at our questions - I must say the male waiter was actually amazing he forgot my order but then took responsibility and took care of the plate."}
{"text":"Yes the wait is long...but well worth the best waffles I've ever had. Saturday's French brunch crawl started with Le Petit Déjeuner, featuring strawberry watermelon juice (the real deal, not syrupy slop), waffles, eggs, bacon and extra potato rösti ($2). 

The vibe of this place is very diner-like. After waiting 20 minutes, my borderline-hangry friends and I got booth seats and quickly ordered. The wait for food was pretty long and my waffles ended up being a bit cold but still very fluffy and very delicious. It came with \"apple slaw\" (strips of apple, a few pickles and a carrot?! And some mystery orange sauce), some fabulous scrambled eggs and crispy bacon. The portion of extra rösti was a bit disappointing (barely filling up a tiny saucer), but still very delicious, crispy and warm. We scarfed our food down quickly and left for our next brunch destination. 

I've been here several times now and the food never disappoints. Come early, there's always a long line outside."}
{"text":"This place is small but cute and they have very friendly staff. I ordered the salad nicoise and it was NOT a salad nicoise, it was actually beyond gross and honestly inedible. I absolutely hate the idea of sending food back because I didn't like it vs. there's an issue with it but I had to send to it back it was that gross. The server was so so so understanding and offered up some recos to replace my meal and I got the flemish stew and it was really good. I ended the meal with the waffle house for dessert and it was both cute and delicious, the waffle was light, sweet, and crispy.

Our servers readiness and response was super professional and it really made all the difference."}
{"text":"Try the waffles they're light, airy and sweet served with lots of really delicious whip cream"}
{"text":"Very basic. I would say a type of food you can find in a diner. Not worth the wait. Been here two times. Not a nice experience both times. I would not suggest this place and bring anyone here anymore. Turned me down twice. 

Atmosphere - To me everything smelled, from the burnt smell from the kitchen to annoying dishwasher smell all over.. no ventilation in the whole place which makes you not enjoy your food experience. The water glasses smelled. Everything to me was smelly and wet and affected our experience of the food. 

Food - Out of everything I think I liked the Coffee the most. I tried Florentine & Veronique benny and waffles with strawberries. The eggs benny was so basic. Something you may find in a regular diner. Lacking hollandaise sauce. Waffle taste was unique though and I would say was the highlight. 

Service - Not happy with the service. I understand it is brunch and there is a line up, but doesn't mean this should affect your experience. None of the servers were that nice to us especially the person who brought the coffee and he raised his voice as we took long to answer when he brought the coffee to our table and asked \"COFFEE??\" as to who ordered the coffee to place it in front of them..Not in a nicest way.. I would say kinda rude."}
{"text":"Brunch Review: Great decor and friendly staff. There was a wait but I sat immediately at the bar. Had 2 tap Belgian beers. Ordered the Waffles Benny. Waffles were light, fluffy and crisp with just the right amount of powdered sugar and excellent maple syrup. The eggs Benny were excellent and the apple slaw was refreshing. Highly recommend . The coffee solid as well"}
{"text":"Great food but too bad they don't take reservations.  We had to wait 25 mins outside till we were seated.  This was during a typical Sunday brunch.  Nevertheless, food was great but I don't really think their green shiny seats were that attractive.  Their food compensated for those seats:p"}
{"text":"We were dying for some good breakfast/brunch for the weekend.  We were searching for the \"best brunch places\" according to BlogTO.  Le petit dejeuner was named the second best place.  Fellow yelper and I, Linda T., were looking for places to eat and this place was conveniently located for us as we were walking around in that area.

We got to the restaurant around 11:00 AM or so.  We saw a small line-up of about 8-9 people outside.  We were questioning whether or not we should wait or not.  The person in front of us told it was definitely worth its wait (and yes it was)!  Surprisingly, we got in pretty quickly - possibly because we were a group of 2.

Anyhow, my friend ordered the toast champignon, which was a half bagel with bacon and mushrooms.  I ordered a smoked salmon omelette.  It was absolutely delicious!  The eggs were done perfectly.  The apple coleslaw was definitely interesting.  I was so surprised by the tangy taste of the pickles mixed in the sweet green apples.  The rosti was great too!  All the food worked really well together!"}
{"text":"This place was recommended and it seemed nice upon entry. It was definitely crowded. I sat over 5 minutes without being greeted. There was one waitress for the entire restaurant and she was busy serving food and cashing people out. I was basically invisible. No \"I'll be right with you\" or anything. I was in a time constraint so I have no tolerance for this lack of service."}
{"text":"The. Best. Waffles. You. Will. Ever. Eat. 

It was like eating sugary air. 

I just wish the order came with more than two.

ProTip: Get there before 10:30 a.m. or your screwed."}
{"text":"Visiting Toronto for the first time, my friend brought me to LPD (just gonna abbreviate it for convenience) for brunch. We went to LPD on a Friday morning around 10 and it was still quite busy. While my friend told me our wait today was short compared to a normal weekend rush, we still ended up waiting about 10-15 minutes. 

LPD is fairly small and most likely only seats about 40ish people. The establishment looks rundown and old but not necessarily in a bad way. It's really much more in a aged secret classic way. Once seated service took a little bit to get going but, as I said, it was busy and I only noticed 3 people working the front. 

LPD serves breakfast all day, which is amazing. We ordered the eggs Benedict and the waffles with fresh fruit. The waffles were delicious and fluffy and it was served with a variety of fresh fruit and Chantilly cream. I would definitely go back to LPD for breakfast or brunch but recommend leaving yourself extra time to accommodate the wait."}
{"text":"I have to say, it's worth the hype! From the outside, it's easy to miss, being a bit nondescript, but inside it has a cozy atmosphere with knickknacks on the wall and shiny, sparkly green diner seats. It was crowded when my bf and I got in, on Saturday at 10 AM, but luckily we were seated right away by close to window - score! The only issue was we were by the door, so every time anyone opened it we got a bit of a draft.

I ordered Brussel's Style Waffles in Strawberries and my bf got the Toast Champignon (poached egg with sauteed mushrooms atop a half bagel with apple slaw). The food didn't take too long - maybe 10-15 minutes? And when it came, WOW! Just the presentation itself made my mouth water. The waffles were light, crispy and delicious, especially with the strawberries and the delicate chantilly cream. Add the maple syrup on top and I was in heaven. The Toasted Champignon was equally delish - at least what my bf would let me taste, since he wanted it all for himself! We practically inhaled our meals.

Pricewise, it was a little steep for us college kids used to the overwhelming portions at IHOP or Dennys, although they're not even on the same level as LPD. The waffle was more of an appetizer size, and even though the Toast Champignon was one plateful of food, it supposedly left my bf only \"70%\" full. But despite this, I would love to come to Le Petit Dejeuner again to try the rest of the menu!"}
{"text":"I once read that this place had the best eggs benny in the city.... this may be true but what really did it for me was the Croque Monsieur.  Delectably rich and beautifully paired a light salad.  
The line up down the street for weekend brunch is worth the wait.  
Just make sure you don't have any dilly-dalliers since they won't seat you till your entire party has arrived."}
{"text":"if you are going to charge a premium price for a simple dish, it had better have a premium taste. These Eggs Benny were a major disappointment.  Hollandaise sauce is bland, salad is dull, and what are passed off as \"hash fries\" come across more like a cold, dry scouring pad. I have had way better Eggs Benny elsewhere in Toronto for less money. As with all the other reviewers who gave these a high rating, you will probably like them if you've lost your sense of taste."}
{"text":"Visited last Friday 21st Oct - advertised as best waffle place in town which I can confirm. Freshly made and wonderful, I also had the breakfast special (I was hungry ok!) which was french toast, egg and some meat side - equally among the best. Service really is friendly but it is a busy place, one of the waitresses is indeed firm and direct but also efficient and fast. Other staff are equally efficient but a little more laid back and despite the rush hour spared a few moments for a chat. Local Belgian Johan is very friendly and I can heartily recommend. The location and decor are a definite plus - finally the locals patronise this place in droves. What other recommendation do you need?"}
{"text":"Don't get discouraged by the lineup outside. It moves fast and someone walks out and takes your name down. My pet peeve with this place is the slow service once you're inside. 

I've been here twice already and although the waffles and apple slaw are to die for, the service here is incredibly slow!  I don't know if its because there are only like, 4 girls working the floor on a busy weekend brunch rush or if they only care about certain tables but it took forever trying to flag down our waitress for our food order. 

This is the kind of place where you try and get someones attention and then after waving your hand in front of the server passing you by, they stop and tell you who your server is and that they are on their way over. No one came over within 10 minutes ugh ugh ugh. 

When we were ready to pay, it took a long time to flag someone down to get the bill. Once we pulled out our credit cards (yes, debit too!), it didn't look like they got the hint so we got up and waited by the cash register to pay. 

Best waffles in Toronto but you'll suffer a little bit for it."}
{"text":"Their name explained all, Le Petit, small portion. Not recommend to go when you are hungry."}
{"text":"I'm a big fan of this place - it is directly across the street from my work and so I adore hoping over here for a nice, relaxing, yummy lunch.  I feel extra sneaky if I come over at 11:30 instead of 12 and I beat the crowd.

I think this place is mostly staffed by women (at least during the day) and they are fiercely awesome.  Service is always good, as is the food.  I seriously doubt you can order anything not delicious on the menu.  Just thinking about it makes my mouth water.

The decor is adorable, and while it's not the cheapest brunch options it sure is a great one.  Plus, since the name is the restaurant is French, you can feel just a teensie bit smug and international when you go there!"}
{"text":"Oh! I'm in love!  What a cute little place to have Sunday brunch with your bestest after a subpart brunch somewhere else!!  Feeling less than satisfied with our prior noms, we decided to venture off into Le Petit Dejeuner at around 1 pm on a Sunday afternoon.  Despite the place closing at 2 pm, there was still a line.  

We ordered the breakfast crepe and waffles benny.  The waffles benny was okay - I really did enjoy the waffles part of it but the benny wasn't really that special.  The waffles were light, fluffy, and airy, which was the perfect texture.  In terms of portion, it was definitely not as bit as my breakfast crepe.  The breakfast crepe came in a generous portion with a delightful, nom-tastic combination of a carb wrapping (crepe) filled with a carb inner layer (rosti) filled with meat and eggs.  It was absolutely fantastic.  

A helpful tip for all your spicy dwellers, is to have the breakfast crepe with Sriracha - it definitely adds that extra punch which makes it all that much more mind-blowing.  

Overall, the decor and ambiance was dated but it added a quirky charm to the place.  Food was lovely - would definitely come back!"}
{"text":"Finally got to visit this hidden gem! The atmosphere is really cozy. The food was really good!!!! We tried the waffle, the hungry gal and the champignon bagel. The apple slaw is absolutely delicious and the mushroom is sautéed just fine. However, the sausage terrine is a little bit dry and under seasoned, and the fish cake is a little bit salty. Other than that, everything else is perfect. Will definitely come back!"}
{"text":"After hearing from a friend that she wanted to check this place out we went for breakfast on a Saturday as soon as they opened. The atmosphere was ok but the lady at the front didn't smile once, and generally seemed like she was there only out of desperation. Also, she seemed like she was one of the managers/owners... Anyway, when we ordered our food it looked fancy on the plates, but my poached eggs tasted like vinegar. Not just a hint of vinegar, no no they tasted like they were boiled in nothing but vinegar. Yuck.

The apple salad that everyone talks about is okay at best. It's just some julienned apple pieces with dressing... Oooooo so cool... Yeah... No thanks. They do this to take up space on 2/3 of the plate because it's cheap and looks like they are upscale while they cheap out on ingredients and portion sizes.

At the end of our breakfast I went up to pay the bill and behind the counter the lady stood again. I looked at her with my wallet, and she just ignored me!?!?! I thought maybe she just had a bad day before but come on now... So then another nicer guy behind the bar took my card charged me and then just left. Didn't rip the reciepts didn't ask if everything was ok, just dissappeard and never came back. Then when I went back to the table that same lady comes to drop off the bill for \"whenever we are ready\". Seriously? You didn't see I have already paid?!

If you like fancy looking frou frou food with no substance and below average flavour for a somewhat higher price than other establishments, you will LOVE this place. If not, go somewhere else. Almost anywhere is better than here."}
{"text":"I had read about this place and decided to take a friend there for brunch but we saw the long line outside and got discouraged so we went elsewhere. I was intrigued so this past weekend I woke up early determined to get there before the brunch rush and see what all the fuss was about. So I get there about 9:30 and only have to wait about 10 minutes- I don't think the line I saw the week before was as bad as I expected, you have to line up outside to get seated so its not as if there are more people inside waiting. 

The waitresses were nice and enthusiastic BUT getting my coffee refilled was a challenge. I had an empty coffee cup for quite sometime and no one offered to refill it. Finally i see my waitress and ask for a refill. She never comes back with my coffee. The waitress for the table next to me comes by with a coffee pot to refill their coffees so I ask if she wouldn't mind topping me off as well. At this point there is only enough coffee for about 1/3 of a cup so she says she'll be right back with another pot. She doesn't appear with a new coffee pot for about 10 minutes. Now, I have no idea if the coffee needed to be brewed or what, but if that was the case she should have said something because at this point I was just feeling totally neglected. 

The food was pretty good- but not the best brunch I have ever had. I had the eggs benedict with the peppers and caramelized onions (I unfortunately can't remember the name). The peppers and onions were really flavorful and I have to give them props for creativity as I've never seen an eggs benedict with peppers and onions. 

I would probably go back as long as I didn't have to wait too long, but not really worth waiting an extended period of time in the cold for."}
{"text":"Hard to see even when you're looking for it - but worth the effort. I had two breakfasts here two days in a row. $20ca for a breakfast is a lot, but worth it on a special occasion. Service was great. Place was packed, Coffee rocked!, and the food was even better. Hipster vibe, but obviously not run by hipsters. They do care about your pleasure and there was no pretension. Had the Eggy Toast (french toast) first. Next day had the Benny Waffle (Eggs Benedict  with a waffle). will go out of my way to go back - but I was on a per diem and the cost was less influential."}
{"text":"This place is one of my favorite breakfast places in Toronto, however, the main problem with Le Petit Dejeuner is getting seated in the first place. The restaurant only seats maybe 50 people (it's very cramped) and there are always lines. Repeat there are always lines. If you can brave the wait the food is worth it. The menu is pretty decent. Not the most comprehensive of choices but what they do, they do it right. I have had the eggs benny, croque monsieur as well as the all the omelets. I have not been let down yet, however be warned if you are really hungry I would suggest going somewhere else. If you like good food this place is a must it's just a shame this place is so small."}
{"text":"The waffles are worthy waiting. Lining up at the street sucks but who cares if I just had the best waffle on earth ahhh"}
{"text":"Nestled in \"Corktown\" of downtown Toronto area is Le Petit Dejeuner, a small Belgian Canadian restaurant serving comfort food with lineups regularly outside the door.

Our party of three arrived at 11:15 am and were told it was a 30 to 40 minute wait. Luckily we were seated within 20 minutes. I ordered an earl gray tea (they offer special loose leaf teas) which paired so well with a hot breakfast! 

With any brunch place I recommend getting something sweet off the menu (Belgian waffles are an excellent choice!) paired with something savory - like a crepe or one of their sandwiches. I ordered the Authentic Belgian Waffles - Brussels' Strawberries and chantilly cream which will hit the spot especially if you have a sweet tooth or sweet craving. I paired this with Croque Monsieur Sandwich: ham, swiss & dijon mustard with cheese gratin served with mesclun greens, apple coleslaw and paprika mayonnaise. Delicious.

Would come back again!"}
{"text":"I didn't think this place particularly stood out to me. The brunch items we ordered were pretty simple and could've been made at home which would've cost a lot less than what we paid.

The waffles at this places are lovely - crispy while still soft and it holds it's shape if you held it. Although the waffles were smaller than I had expected."}
{"text":"Don't expect to be seated right away, but the wait is worth it.  The service is fast and friendly.  The cooks really put heart into what you get; the apple coleslaw is fresh and the three-cheese omelette rocks!  Can't wait to try the rest of the menu."}
{"text":"Solid 3.5 (c'mon Yelp, give us half stars to use). 

I've been in the area for the past 2 years, and always curious about the hype of this restaurant. Always long lines in the morning for this place, no weather can turn away some hungry people. Since I had a day off today, my girlfriend and I decided to venture out. By 10:30 a line had already formed but the hostess said it would be quick for 2 people. It end up being about a 15 minute wait, not bad compared to other places I've been to. However, behind us the monstrous line began to form. It's a really cozy, old school looking place. The menu is pretty straight forward, Benny's and Waffles or regular breakfast. I went with the Peameal Benny and my girlfriend went with the Waffle Benny or something like that. My Benny was pretty good. I had asked for light hollandaise and the server said they usually do it light - well it wasn't lol. I had to scoop some off. The egg was done perfectly and runny - just the way I like it. My friend really loved her waffle too. We both enjoyed the rosti and the apple slaw.

Why did I contemplate about just half a start? Well for starters, I felt the brunch was lacking in the portion size. They gave a good amount of peameal on the english muffins, but there wasn't enough rosti and slaw that made me full. My friend also commented the same, that she felt \"hungry\" after we ate lol. We don't want to be in a food coma, but we still want to feel satisfied and full afterwards. Also the wait is long. I felt bad for the people at the end of the line.

Will I be back? Maybe on an early day if the line up is short. It was good and 3.5 star worthy, but I wouldn't wait over 15 mins in line."}
{"text":"The wide range of ratings on this place is totally understandable. It has many things going for it... Good food, charming ambience, and a real buzz. However, the small size and almost always busy atmosphere can make the whole experience totally frustrating. So your experience may vary. 

As for me, I love the waffles, and their eggs benedict. The eggs flourentine was also delicious, and if you get served in time, the food is wonderful.

The problem is that it really depends on when you go and what kind of crowd you're facing."}
{"text":"I had brunch here today with husband and my cousin who was visiting from out of town. We ended up here as a result of a Yelp search for a breakfast joint near the St. Lawrence Market area. Happy with the 3.5 star overall rating that this place got, we decided to venture on in. While we weren't sure if they were open, due to the dimly lit interior, we took a chance and walked in. It wasn't very busy inside, and with no one there to immediately serve us, we decided to just find a table and have a seat (turns out that exactly what was expected of us). We were very promptly greeted with a friend hello from someone who soon became our waitress. She brought us our menus and was quick to ask if we needed a drink (of coffee of course!) 

While we sat and enjoyed our coffee, we perused the brunch menu (served until 6pm). Our waitress gave us lots of time to do so, which was good, since it was so hard to decide what to get. I was very intrigued by the apple coleslaw that seemed to come as a side to many of their dishes. I wanted to try it so badly I looked away from meals that did not list it as a side. (I later learned that in fact it comes as a side even when not listed). 

Between the three of us, we each ordered something very different. I ended up going with the Eggs Veronique, which was poached eggs a top an upside down English muffin with sauteed bell peppers and caramelized onions, topped with a lemony hollandaise, served with a side of potato rosti and apple coleslaw. Every component of my dish was delicious! It was just too bad that it was a bit too much food for me to finish. That is not to say the portion size was too large, because in fact it was a great size, I just did not have a big appetite this morning. 

While I was tempted by the waffles on the menu I did not go for them, but that did not stop my husband trying them. He ordered the Waffle Benny, which is essentially eggs benedict (without the English muffin) with a side of waffles which were topped with a light dusting of icing sugar. His dish also came with a side of apple coleslaw which he too enjoyed.

Not being an omelette lover I did not go for one but my cousin did. She ordered the 3 cheese omelette which included swiss, goat and cheddar cheese all mixed with fine herbs into the omelette. Each bite delivered a taste of all three cheeses. This dish also came with a side of coleslaw and potato rosti. 

I will certainly be back again and in fact I recommend this place to anyone looking to get away from some of the commonly frequented breakfast chains within the city core."}
{"text":"The service was great and the food was awesome. We were greeted well by the friendly staff and they remained friendly even though the restaurant was quite busy. We tried both the waffles with smoked salmon and with bacon and they were delicious. I'll definitely be back for more!"}
{"text":"Pretty good lunch today, but service was a little slow. I enjoyed my experience here and the food was pretty good. People should check this place out."}
{"text":"We got the waffles benjamin and french toast with sausage (which was the special of the day), and they were both great. The salmon in the waffles benjamin was delicious, and the french toast was sweet and soft. The scrambled eggs that came with the french toast wasn't anything out of the ordinary, but overall I'd highly recommend for brunch."}
{"text":"Effing amazing! This place is a 10 on all levels, minus the wait but after going here I can see why. The french toast is delicious, like dessert for breakfast, I almost vacuumed suctioned my boyfriends plate. The hot chocolate is also great, the only downside is its not endless refills. The server was out of this world fantastic. He was an older bald guy with an amazing personality, social and attentive. Even if the food was subpar which it was far from, I would go back for his service. The eggs benedict with the canadian bacon and it was so filling. On my list for another visit when Im back in the 6!!"}
{"text":"Was skeptical about this place at first but after seeing a long lineup at the front entrance it became quite evident that this place was going to be good. 

Atmosphere of the inside is warm and cozy. Staff is super friendly. Ordered the waffles with fruit. Was a great appetizer. Had the duck confit special which also included eggs Benedict, hash brown, and apple slaw. Food tasted great and hits the spot!"}
{"text":"Yum eggs florentine (gluten-free adaptation), and clever apple coleslaw. Alex'  waffle was the fluffiest he'd ever had, and by the Bruges postcards and Mannequin Pis photo, we gather it's real Belgian. We went for a late brunch, and were seated right away, but blasted with the heat of the kitchen in the back. Campy diner feel, cute service."}
{"text":"Terrible experience today. Tried getting a table for 4 adults and a baby. Were told 45 mins by the hostess. Waited over an hour and fifteen. 17 other people were seated before us, 4 of those groups where the same size as ours. After waiting all this time we were the only people waiting outside and the hostess said she would possibly seat us she was just waiting on ppl who just got there food. We told her we didn't understand why other groups were seated before us, she had no answer just smiled and said I'll see what I can do. I'm not sure if we were discriminated against for race or the fact that we had a child in arms who didn't make noise the entire time we waited but this has never happened to me at a restaurant and my entire group was truly horrified. When we told her we were thinking of leaving she smiled and crossed our name off her list. If she couldn't accommodate us with a child I completely understand but that should have been communicated. We ended leaving fearing we could wait another hour and still not be seated. There was no reason why this happened to us. I just could never support a business who practices this type of customer service."}
{"text":"Oh the waffles. So good. The terrine is a star too. My wife lived the omelette. The French bread was nice too. This is our go to place for breakfast. It's worth the wait.

A gem on the east side."}
{"text":"I never get the chance to experience breakfast during the week; no lines ups are awesome! 
I ordered the toasted champignon with poached egg. The waiter was kind enough to accommodate extra potato rosti in place of the apple slaw. 
Delicious!!! The portion size was perfect and the peppers, mushrooms, onions and bacon were seasoned to perfection! The bagel was just as good! 
Comfortable seating and friendly staff was the cherry on the sundae! 
Will definitely be returning to try their waffles!"}
{"text":"Came here for dinner for a rehearsal dinner and thought the food was excellent. They always have a great prefix that is very reasonably priced.

Came here for brunch and had the best hollaindaise sauce i've ever had in life. My only complaint is no reservation and large line ups. If you come here with more than 2 ppl, the wait sucks. If you are single or two ppl, you'll get in fast."}
{"text":"I love this place! Just came back from my third visit.  I have tried three different things, and each has been equally delicious.  Atmosphere is warm, quirky, and inviting.

They have a very delicate way of handling food, items express their own flavours without being overwhelmed with sauce or salt.  The waffles are the best I've had, and that includes a little stint in Brussels - home of amazing waffles.  This morning I had the 'Waffles Benny'.  AMAZING! The waffles were fluffy and the eggs were perfect.  Creative and interesting combination - I've never seen anything like it.

We had to wait in line outside for about 20 minutes, totally worth it!  There is always a line for this place on the weekend - for good reason.  You won't regret waiting, and they have a good system to make sure everyone gets sat within a reasonable time.  The servers are well equipped to handle the load as well and don't seem overwhelmed or rushed.  Great service!

Fish cakes are also delicious and I recommend adding them on the side - I didn't like fishcakes before this, now I can't keep away from them."}
{"text":"Came here on a Sunday afternoon for brunch. There was a line up out front but luckily I was able to skip it since my friends were already inside. I ordered the hungry gal, which came with scrambled eggs, toast, hash browns, and a fruit salad, and I got coffee to drink. The food itself was pretty good, but the coffee not at all. They had a bunch of other things on the menu that I would have liked to try and their waiters were quick to serve and friendly, so I wouldn't mind going again but I'm not too keen about it just yet. Overall, 3/5."}
{"text":"I love a properly cooked omelette, meaning light and fluffy and still moist inside.  Like Didier used to produce at his resto at St. Clair and Yonge.  Definitely not like the industrial frittata that tries to pass for one at Cluny.  So it was with great pleasure that I ate my spinach omelette at Le Petit Dejeuner.  My partner had the vegetarian omelette and had the same reaction.  Heaven!  And the side salad is unique.  Speaking of unique, try the sausage terrine.  And they make their own marmalade!  In fairness, we were eating around 2:00 pm on a weekday, so the kitchen wouldn't have been as pressed as on a weekend.  Still, this is going to be a go-to place for all-day breakfast."}
{"text":"The best Belgian Waffles in town. They are so light and tasty I paired them up with egg and salmon Benedict which comes with the most delicious apple slaw! Avoid it on the weekends because the lineup is at least 45 minutes to an hour!"}
{"text":"Hands down one of the top five Eggs Benedict I have ever had. I travel extensively for work over the years and made a game out of finding the best Eggs Benedict in the different cities I have stayed. This place is amazing. Atmosphere, so so. The guy who opens in the morning is a bit grumpy, but the Eggs Benedict has brought me back every time I am in Toronto. Wow"}
{"text":"Of all places in Toronto on a Saturday morning, there are only a few you'll ever see a lineup of 10+ people anxiously waiting to get seated in this hidden gem of a breakfast spot. It's not any mistake because this menu is well worth the wait!"}
{"text":"I dont get it. Why ppl line up outside of this place all the time. I walk by this place to work every morning, theres often a line even when it is minus 20 degrees out. I roll my eyeballs so hard I could see the inside of my skull.

I have been here a few times when I need something close by and there was no line. The food wasnt bad. But there is ABSOLUTELY nothing exciting. Nothing. The brunch menu is very standard, centering around the soporific two eggs whatever way type of deal, and the portion is tiny.

Maybe it is the name??"}
{"text":"Santa Clause Sunday Brunch Fail.

Scene: an overcast afternoon, limited food options in this neighbourhood, two twenty-something girls decide to stand in a short line for brunch to satisfy their curiosity about LePetit Dejeuner. In front of them, a woman in her late forties is worse for wear from the previous night and after being delivered a glass of water from the hostess, she is escorted into the neighbouring alley to vomit before being seated (seriously.  This was my line experience).  After a pleasantly short wait, the two are seated next to the coffee grinder at a table that is uncomfortably large and uncomfortable close to a table of 40+ year old hipster douchebags who meander between English and French (when they have something particularly offensive to say about the other patrons or the establishment).  The table of bilingual fixed gear cyclists stay long after they are done eating, taking up 3 tables in the front window where the line up outside was very much in their faces and said out loud, 'we had to wait a long time in line so we're going to sit here for a long time.'

These are pretty much the type of people who are here.

The good:
- The apple slaw was okay

The bad:
- The aforementioned other patrons
- The breakfast was nothing special and was expensive
- The potato rosti was failure personified in food - it was a tiny serving of overcooked potato puck that lacked flavour and character.  I couldn't even find it when she brought my plate because it was hiding under my toast.  Epic disappointment.
- There is a breakfast deal where you can add a coffee & a mimosa for $6. I ordered this. They said they were out of champagne. I got a greyhound instead (fine). Then new people sat down next to us and ordered a mimosa, and they brought it to them right away. I was in a seat where I could see the bar, and the guy literally reached into the fridge, got a bottle of champagne, opened it, and made mimosas. So I feel like I was basically refused a mimosa.  
- Even Laura didn't like this restaurant and she pretty much likes everything.
- It was expensive at 35$ for 2 people, and the portions were small.

I will never go here again, but I'm glad I went once so I don't feel curious anymore.  The hipsters can have this place to themselves.  The mimosa incident happened after we had already put cash on the table, and I took 2$ away from the tip when I saw what had just happened out of spite. I spitefully undertipped and I'm not ashamed."}
{"text":"Fresh juice selection superb. Apple slaw lovely update to the usual boring fruit sides served at most restaurants, poached eggs perfect. Recommend too the terrine sausage. Fun funky atmosphere and friendly super efficient wait staff = top pick for Breakfast in Toronto!"}
{"text":"Toronto is a great city for brunch and i am slowly making my way through this city for one of my fave breakfast traditions.  I went to George Brown and the fact that i was unaware of this place blows my mind, considering that it is located across the street.  We visited Petit Dejeuner on Sunday, and the line outside had just begun.  The whole seating process is slightly chaotic, but bottom line just get in line and it is pretty much first come first served.  After waiting for about 10 minutes we were seated, however we waited at least 15 minutes before our waitress took our order.  I understand that they were busy and there was only one server taking orders, however i don't appreciate being greeted with a \"what will you have?\"  This restaurant truly needs a service intervention, considering each table around us was becoming increasingly impatient due to lack of communication and horrendous wait times.  
Now to get to the food, it was fantastic, they serve up authentic Belgium cuisine.  I ordered their Brussels' style waffle which was as promised, light and airy.  For $5.75 you get one waffle with real maple syrup.  The waffle was crispy and buttery, absolutely divine.  I chose an order of smoked salmon to accompany it, and the portion size was extremely generous for the small cost of $4.  I appreciate the fact that they are taking the time to smoke their Salmon in house. The salmon was beautifully smoky, however it was too salty.
Overall i absolutely loved the food that they serve, i just think the restaurant from friendlier staff who work as a team whose overall goal is to satisfy their customers."}
{"text":"Love this place! A perfect way to fuel up before heading out to the St. Lawrence Market on a Sunday to dig through the antiques.

I've been here a few times and have always had a really great meal. I've had the Belgian Style Waffles, the Eggs Benny, and have tasted a couple others on the menu. The menu currently says they offer Liege waffles, which are beautifully dense, firm, and spotted with sugar pearls that crunch in such a satisfying way...magic! However, the last time I was there (granted, it had been a while) they said they no longer serve Liege waffles...Or there may have been a miscommunication and they were just out. Either way, I hope they've come back or are still on the menu because they were my favourite! A couple other times, the sausage was also sold out, so come early to avoid the wait times and to get first pick of the good stuff! As others have said, service is quite slow, but it's a small price to pay for a really good meal. Definitely worth the wait! Gotta plan my next trip..."}
{"text":"Le Petit Dejeuner is one of those quaint little Toronto brunch institutions that I wish I loved, but just don't. It's taken a number of tries over the years to finally get through their doors and actually be sat down, so maybe my one and only experience had been overly anticipated. A more likely explanation though, would just be that in the many times that I've gone  elsewhere for brunch instead, I usually had much better.

To start, the freshly squeezed orange and apple juices were very good. This obviously doesn't happen to everyone, but my eggs benjamin (with smoked salmon) featured a hair in the hollandaise. I spotted it after my first bite and the very apologetic server was surprised, but happy to replace my meal. Unfortunately, this took longer than my brunch date did to finish his very conservatively portioned eggs and waffles, so it was kind of a bummer that we had to watch each other eat in turn. I was glad to know that my meal must have been recooked though after all that time. The side of \"apple slaw\" that came along with the benedict turned out to be a disappointing and unevenly julienned pile of apple sitting atop of mixed greens and drizzled with dressing and nothing like the colourful and flavourful marinated coleslaw featuring apples that the name had conjured up in my spoiled imagination. 

I also thought the service was nice although hurried. I wasn't expecting  a free meal, but it should be noted that there were no comps or discounts after the unappetizing curl was found on my plate, just a promise that it hadn't happened to anyone else' dishes. Between that comment and my brunch date's assertion that he never sends contaminated dishes back, I was almost made to feel that I was making a fuss. 

Although the food wasn't half bad and I liked the decor quite a lot, I'd be hard pressed to come back again. There are plenty of much better brunch spots out there and with people still lining up at the door at 2pm, there is little reason for the less than perfect food and service recovery to improve."}
{"text":"Worth the wait outside! You'll be waiting 20 minutes max. (there's pretty much a lineup before it opens)

Been here many times and will be back many times. Get the waffle benny if you can't decide between an egg dish or waffles, because you MUST try the waffles. They are so light and fluffy! The apple slaw is a perfect pairing with everything here too. The breakfast crepe is delicious but extremely filling. Make sure you're hungry if you order it! Toast champignon is really flavorful and hearty. Would pick this over the crepe! Coffee is good and the wait staff are friendly! Nice, casual vibe. 

They're pretty good at seating large groups and making sure everyone in the line outside is accounted for."}
{"text":"Overall I really enjoyed this place!

I went on a Saturday, and as other reviews have mentioned, there was a lineup. It moved fairly quickly though, and I made some friends with some fellow tourists in line - we even ended up sitting together!

I ordered the traditional eggs benedict and it was great! The eggs were nicely poached, the hollandaise was rich and lemony, the peameal bacon was thick and salty, and even the English muffin was nicely toasted. But the potato roesti (a side dish I found everywhere in Toronto instead of hashbrowns), was unflavourful. I also didn't enjoy the apple slaw. 

My new friends ordered the special - an eggplant parmesan Benedict and completely raved about it.

Service was nice and friendly, but a little slow considering we were seated at the bar (although it was a Saturday morning), but I had to ask for more coffee and only got one refill. 

All in all, if definitely return for the Benedict, but I'd ask for a different side dish and I'd try to go when it's not as busy."}
{"text":"The restaurant is in an old building and has a rustic charm. There's street parking and there's a street car on King St that will drop you off nearby. The door leads directly to the street and is accessible. The bathroom, however, is not accessible and is down a steep flight of stairs. The seating seems just as old as the building so I prefer the booth to a chair. The service is great. I love the fries here by themselves or in the poutine. The, what feels like, straight from Belgium Waffles and the best maple syrup in the world is amazing. Everything else on the menu is okay. It's worth it for the first two items I listed. Just keep in mind that they do change the menu around daily ,so the waffles are the only permanent staple."}
{"text":"My wife and I ate breakfast here on a Saturday morning while visiting Toronto for the weekend.  I think it popped up in one of our searches for good places to grab breakfast.  It is quite a small place, so by the time we got there for brunch the line was already out the door.  We waited about 20 minutes or so, with most of that being outside.  That was not too big of a deal, the vestibule provides waiting space for about 6 adults or so and then there is seating inside immediately beyond that.
Once inside, we happened to be seated right by the door that separated the dining area from the vestibule.  This meant any time someone came inside, we felt the draft of cold air.  Aside from that though, our breakfast was delicious.  We both ordered eggs benedict and bailey's lattes.  I opted for the traditional with peameal bacon while my wife ordered hers with salmon.  There was some sort of apple slaw on the side that neither of us cared for and our hash brown potatoes were on the colder side, but the eggs were done perfectly.  We still left pretty happy with our meals and I wouldn't mind visiting again to try some of their other offerings."}
{"text":"An intimate space with excellent food, friendly service.

Expect to line up for brunch (no reservations) on weekends. Other times you can drop in without a problem"}
{"text":"Popped in here today for lunch. I ordered a croque madame and it was delightful. Glad to see the quality is still top notch."}
{"text":"Came here on Sat at 11:30am and waited for 50 mins. There were many tables that were waiting to be cleared or just empty but the servers take their time slowly (while everyone is lining up outside in the cold). Took them atleast 15 mins to seat us on the table when the table was already empty. One thing good is they do come by often to refill your coffee. Food was alright but lacked service. Probably will not come back, esp if you need to wait so long."}
{"text":"As close to the movie \"Amelie\" as you're going to get in the Big Smoke, Le Petit Dejeuner sits just far enough from the madding business crowd to make you forget that you've basically crawled through the office district in order to make your brunch date. 

If you're a daytime dater this is almost the perfect spot; a long, narrow room with near doll-sized chairs, tables and tchotchkes. 

Narrow booths and tables are perfect for conspiring or canoodling over mugs of strong coffee. 

The seating arrangements may feel cramped if you're on the tall or leggy side, and this is no place to go if you're worried about stashing your briefcase, coat or shopping trip trophies. Better to hold off nearby St. Lawrence Market with its random antique fairs until after. 

Le Petit Dejeuner demands patience at the outset. Would-be patrons queue up for weekend brunch, which is really what this spot is all about. If you don't speak French, I'll translate. Le Petit Dejeuner means the Little Dejeuner. I think that \"Dejeuner\" means death; but then, \"the little death\" might be an odd name for a French diner for more reasons than one. 

Unless you're early, the line snakes around the sidewalk, and while you appreciate not being rushed once you make it indoors, you wish to God that the people ahead of you would just take their coffee and waffles to go. 

There's franco-diner classics for sale elsewhere on the menu, but to be honest, I just ignore them in favour of the breakfast selection. Scratch that. I ignore most of the menu except for the waffles benedict. 

I pause to note that I've eaten other menu items here. 

The ubiquitous apple slaw is cute, but quality varies wildly with the season. In Fall, it's tart and crisp and cuts nicely through the rest of the richness. Made with storage or foreign apples, it's a wan and mealy distraction from serious good eatin'. 

Rosti are hashbrown's European identical cousin, or latke's shikse goddess girlfriend. They're also golden brown and deliciously crispy. 

The waffles benedict are testament to the power of the carb; elevating the English-muffin based classic to full-on foodgasm. I've tried innovative starch-based bennies elsewhere, and always found them lacking: latkes go limp beneath still-damp poached eggs, while donuts just dissipate. The waffle's brittle fused crust is a perfect vehicle; its wells catch runaway egg yolk and lemony Hollandaise, and segment for proper rationing against back bacon. I like to think I'm not greedy, but dude, one egg and one slice of peameal for almost $12 just leaves me begging for my next hit. 

Now, if only Amelie would return..."}
{"text":"Great waffles!!!! 
Good juice 
But terrible terrible service (two accidents by two different waitresses) 
Long wait + bad seats (cushions are sinking) 
Will not be going back"}
{"text":"Decent little spot for brunch with a perfect breakfast menu.

Likes: portion sizes (on the small side, which I prefer), nice traditional diner vibe/decor and food quality was OK.

Dislikes: Slow-ish service (not terrible but definitely on the slow side) and long wait for a table.

Prices were reasonable. If you were a guy and hungry, you'd probably be unsatisfied with the portion size.

I had the Hungry Gal breakfast special with two eggs, hashbrowns, apple slaw, toast and peameal bacon. Food was quite good. Apple slaw sounds exciting but was kind of blah. I think my meal came to $13 with tax and tip. 

Had to get up a few times to retrieve my own condiments, etc. 

Would probably go back if I was in the area, it's very close to the SLM!"}
{"text":"Small line-up on Saturday Dec. 24 around 10am. Small portions, reasonable price.
Enjoyed the Belgian Waffles. Not the best, but enjoyed the food and the friendly environment."}
{"text":"croque masseur was really good. they got my order wrong (didn't want sides) but that's fine. sausage was a bit disappointing. more like a meatloaf"}
{"text":"Toronto classic that is not fresh but definitely isn't stale. 

The Good:
- fast service
- good food
- cool ambience

The Bad:
- not going to impress a date

The Ugly
- nothing to report"}
{"text":"*** 2.5 stars***

My friend recommended this as a meet-up location for a little brunch and catch up. I showed up first and encountered a bit of a lineup which is to be expected for most decent breakfast joints. I go to the front of the line and my friend told me he was about 5 mins away. I told the waitress I needed a table for two but since my friend was not here she declined to seat me. This is ridiculous for two main reasons 1) it's not like I was asking her to hold a table of four and I was the only one there... there were two of us and he was 5 mins away. 2) There was a table for two available and all the people behind me were parties of three or four so no one could sit there anyways!

Once my friend arrived we were seated. The menu was pretty good but nothing really screamed out at me. I ordered an omelet which was pretty tasty, but not incredible. The entire meal was ok and they'd probably get the third star if I wasn't forced to wait outside but honestly this place is nothing special. If someone wanted to go here I would probably be ok with it but I probably wouldn't go back on my own account."}
{"text":"I didn't think I'd like the place because the menu seemed pretty average. I stopped in this small cafe and was immediately greeted by a friendly server. I had heard about the waffles and eggs benefit, and not being a huge fan of either, i was happy to see they had a Waffle Benny combo, that incorporated both. The waffle was the fluffiest and lightest waffle I've ever had, and the benny was absolutely delicious. The portion size was perfect and for the first time I didn't feel full after eating waffles. A+ all the way around."}
{"text":"This is a small and cozy little restaurant on the east side of the city. Given the size, you will likely have to wait outside in line for weekend brunch, so try to pick a nice and sunny day to come - I think my friend and I waited at least half an hour in light drizzle.

Food-wise, I have to say everything here is quite good. We ordered the Eggs Benny and Waffle Benjamin (like eggs benny but with two Belgian waffles and smoked salmon). The Eggs Benny with peameal bacon seemed pretty standard at first, but their hollandaise sauce here is great, it has a hint of some kind of citrusy zest in it. Likewise, I really enjoyed the Waffle Benjamin, and the texture of the Belgian waffles was absolutely perfect. I've had waffles at other places that are too crunchy and too hard to the point where you have to hack away at them, but these were lightly crispy on the outside, and so soft and fluffy on the inside. Would recommend. They also give you this apple slaw as a side, and it's quite a refreshing change from the usual potatoes or green salad. This was tangy and light and appetizing.

Compared to other brunch places though, I have to say the portions seem quite a bit smaller for a steeper price. Both dishes we ordered were $15, and the Waffle Benjamin only comes with ONE poached egg. That being said, I would not hesitate to recommend this place to people, and would return to try other menu items."}
{"text":"I have been here several times now. I love this place, it has a European feel to it for sure! Some guy in the back with a cool moustache is cooking and the place is super tiny with a kind of rustic feel to it. The food is great here and I have enjoyed it every time"}
{"text":"Come here for the waffles (crispy and light as air) and the eggs benny (great hollandaise sauce). The lineups for weekend brunch are really long so it's best to show up before 10 (once, I had to wait an hour outside)."}
{"text":"Food is off the charts excellent! Even though we have to admit maybe there equality in kindness to minorities can be better... Yup I know it sounds weird coming from a white man but I was dining with a few of my ethnic friends and we felt they were much kinder to the table full of white people next to us. 

Don't get it twisted they weren't rude or mean to us but they did seem more cheerful and friendly to others. Maybe because we were American? Hopefully not and I'm soo sick of this American/French beef. DOWNRIGHT CHILDISH LOL 

Long story short there food is off the wall great! Food Network prime time TV quality! If you're looking for a high quality brunch in the TDot area this is your place"}
{"text":"Food: 3/5 . good quality. Medium portions, not enough for big person. Slightly overpriced $11-12 for 1 portion with no drink.

Waiting time: 2/5. Long line. be Ready to way 10-20 min. Tight sits. 

Very busy place

Will NOT come back

:)"}
{"text":"Our first visit to Toronto, and the first stop was breakfast at Le Petit Dejeuner. At 10 AM on a Saturday we waited for 30 mins to get a table. Their waiting system is not the best. You have to wait in line outside, until the hostess gets your name down. Now that could take a good 15 mins.
It is a small cozy place with a fair amount of food options, and extensive tea selections.
We had the Belgian waffles with fruit on the side, and a crepe with ham and veggies. The waffle was very light and had a distinct flavor. The crepe, I am told, were flavorful as well. 
I am a very heavy breakfast eater. So for me, this is not a place I would go to when I have been up since 5:30 AM and drove 3 hours to get there.
I would go to this place when I have had a breakfast in the morning, and need to meet up someone for brunch again.
I would suggest on improving on how they make the customers wait."}
{"text":"Mmmm breakfast!  What a great way to start our beautiful sunday in Toronto. Although we had to wait for about 20 minutes I did not mind it one bit! 

The quaint interior of this place really sets the mood for a delicious breakfast. I had the eggs benny with onions and roasted bell peppers on a muffin and I loved every single bite of it.  

Apple coleslaw on the side was refreshingly delish! Unfortunately the potato crostini was not that great!

Of course I had to pick my curiosity when I saw Liege on the menu. I never had liege before and I always see it everywhere. I decided that I was finally at the right place and time to try it! The liege was good. It is pretty dense with a sweet flavor profile. Great as a snack but not as a meal. 

The best part about this place is that not every item on their menu is laden with cheese! Yes, I am not quite a cheese person. Cheese to me is like tofu to a Westerner. Every time a breakfast place loads up on cheese I have the heavy, greasy and sleepy after effect but this place definitely does not leave you feeling like a piece of lard. 

Now, if I can ever get Texas to stop loading up on all the greasy stuff in their breakfast joint :P"}
{"text":"Working their way through a list of 20 recommended Toronto brunches, two friends suggested meeting at Le Petit Dejuener. \"How convenient,\" I thought, since I live on the next block yet had never been -- telling. My boyfriend made a face when I told him where we were going. \"Is it bad, or just boring?\" I asked. \"Bad,\" he said.

And there you have it. I was there the same Sunday as Sarah L. and stood in the same long line, experienced the same indifferent service, ate the same merely passable food. The hour-long wait and the line down the block are baffling. 

Pros? Well, the green \"sparkling naugahyde\" bicycle banana-seat cushions are kind of fun, and yeah, the apple slaw was tasty. But by the time we were seated, I could have made my own anyway.

I save one-star reviews for the truly offensive (like the mimosa situation Sarah L. had), but this was close."}
{"text":"I was excited to check out Le Petit Dejeuner, there was quite a large line-up on a Sunday, but I have no problem waiting for an amazing restaurant. 

The servers and kitchen were very slow. It took quite a long time to clear off empty tables and seat new people, take orders, and bring over the bill. It easily took over 30 minutes for our food to arrive. You would think a place that has a line-up outside would be more proactive in turning tables over. 

Above all else, the food wasn't good. I would not go back."}
{"text":"I didn't realize how many reviews this place had! 
I guess this place is super popular, which it should be.
If you're in the area you should definitely check it out.

It was my first time here for Brunch on Sunday and I absolutely loved it. 

There was a line up around 11AM, it only took 10mims to get us seated.

The food and staff were amazing. I love the whole feel of the restaurant, including the decor which was beautiful. 

The staff were extremely nice and attentive.

So for my meal, I order the \"Hungry Gal\".
I got eggs, apple slaw (which was delicious), potato rosti, home made sausage and challah bread.

My friend loved the home made sausage, I wasn't really a fan. It wasn't bad at all, I just would choose something different next time.

Can't wait to visit again to try the other options on the menu."}
{"text":"This place is cute.  The staff are friendly, and the food is good (not too large portions!) but I have to admit it was nothing to write home about!  In the menu, it said that the waffles were rated the best in Toronto but I found them to be average.  I ordered the waffle with fruit, and my apples had a bit of an oniony flavour to them (made me wonder if the person chopping in the back hadn't washed the knife properly!)  We were also shooed out by the staff, which I thought was slightly unnecessary.  May return if in the neighbourhood, though, for a moderately decent brunch."}
{"text":"Petit has been losing it's touch for a while. We've been regulars for both breakfast and dinner. Breakfast today was the worst we've seen. We were there today on a Monday and it was busy but not how like it is on a weekend. Our waitress was nice but was definitely on the slow side. The kitchen was fast with our orders but the waitress was so slow that it didn't make up for the food coming out fast. After asking my bf if he wanted ketchup and hot sauce, we had to remind her 2 times before it was actually brought to us. I think 15 minute elapsed before we got it. What bugged me was that when she remembered she was dumb enough to ask if he still wanted when obviously half his plate was still there (getting colder by the minute as we are waiting for the condiments!). The poor table next to us must of waited at least 15minutes before having their orders taken. Food was meh- bfs omelette was ok but my french toast  burnt! Fruit was soggy and not sweet. Another negative is the waitress brought us the cheque before we even asked, this makes u feel rushed/being kicked out and she didn't even take the time to say there's no rush but I'm leaving the bill with you in case. Petit needs to have more than one waitress and a better trained one as well. I will say the gentleman we usually have as our waiter for dinners is super pleasant and helpful."}
{"text":"After a long flight back to Toronto I was craving brunchy things and remembered a Yelp tip I once read about the fact that Le Petit Dejeuner is open during the week for brunch. I gasped and promptly marched into LPD to collect some food. 

I was lured in by the melted cheese and apple sandwich - note they don't call it a grilled cheese - with soup of the day (tomato lentil) for $8. Oh, those crazy Belgians! 

Moments after I ordered the A/C broke down. What ensued was a Louisiana style heat the likes of which I've never before endured. It was like I'd been transplanted straight into the bayou or the set of \"A Time To Kill\". The heat was relentless and it didn't help that I was right next to the kitchen.

When my soup arrived it was flanked by a spoon the size of Jupiter. No joke this was a serving spoon for Andre The Giant. When I called the server over and he asked what the problem was I screeched: \"MAH SPOON. IS TOO BIG!!!\" 

This didn't even elicit so much as a smirk or grin from him. Either he didn't find the skit funny, or -- gasp -- didn't know what I was referencing (the more tragic of the two options). 

http://www.youtube.com/watch?v=PONvX6LmAPo"}
{"text":"I came here with two friends for a late lunch. All three of us ordered \"The Hungry Gal.\" It was really good! It cost 13 dollars with an additional dollar if you're getting the sausage. 

First off, the place is pretty cramped seeing as it's a small restaurant. We had to wait outside until a server called us in. The waited wasn't too long - probably about 10 minutes. Service was very friendly and tried their best to pay special attention to all their customers. 

The food itself was delicious. There was this apple compote (am I using the right word) with green apple and pickles that seemed like it would clash at first, but it ended up being really good. The sausage wasn't like traditional sausage and ended up being more like a slice of meatloaf, but it was also very good! Otherwise the potato, toast, and eggs were generally average but still tasty.

I would love to come here again sometime!"}
{"text":"This place is lovely and the food is very tasty and infused with love. Coming here for brunch was such a wonderful experience! Everything came hot and delicious! I had the eggs Benny and my partner had the house special. Her order was so much better then mine because it came with a tasting palate of the restaurant. The sausage terrine is to die for and you should definitely order it as a side. I did really enjoy the apple coleslaw that was very delicious as well. This restaurant boosts so much individual flavour that you won't find anywhere else! 

Beware of the lines on the weekends as it could take up to an hour!"}
{"text":"After reviewing brunch options online, Le Petit Dejeuner ranked amongst the top options, so we were excited to check it out. We visited on a Sunday morning around 11am and waited 45 minutes for a table for five people.

The decor here makes it a pretty cute spot but that's about the extent of what I enjoyed about this place. I concur with the previous reviews - servers here are not the friendliest. She came to our table, told us the specials of the day and left without taking our orders. While food arrived in a reasonable time, my plate (waffles benjamin - a play on smoked salmon eggs benedict but with waffles) was oddly separated - as was my partner's egg benny with duck. Duck and salmon were on the side, the egg was on the side, and there wasn't much hollandaise. We requested extra hollandaise but only received it at the end of the meal. The waffles were cold and stale - as if there were made in preparation hours earlier. Being with friends, I didn't want to mention anything because I didn't want to put a damper on our day. 

At the end, we were served a bill for  $145 for 5 people with a 20% gratuity included. When I approached the server, she merely stated that it was their policy. There is no mention on their menus of this forced gratuity - only the cost of food. If the managers believe their servers should be paid more, then pay them more and adjust your prices accordingly if needed! This was an unwelcome surprise at the end of a very long wait for a mediocre meal with shoddy service. 

Overall, I will never be back and I would not recommend it."}
{"text":"Food awesome. Great benny. Best waffles hands down.

Dear owner please get your head out of your ass and hire more waitresses. I see them working like mad. We waited twenty minutes to get in. Another twenty minutes to order. Food came quickly though. The wait staff are really nice and did their best but seriously with the volume, the owners need to hire more staff. At 15$ a plate for eggs, bacon and potatoes...they can definitely afford to hire more staff! So ridiculous....you will lose customers eventually if this keeps up."}
{"text":"Good food. Great staff, and the line moves reasonably quickly, which is nice. 

It's hard to find Brussels-style waffles - most places serve that dense, chewy Liege variety that I really don't love - but this place offers Brussels waffles, and they are very good. Crisp and light. The legendary apple slaw was very good, as were the scrambled eggs. The peameal was quite salty, but it was juicy, though there was only one slice. For a $13 breakfast, I thought the portions were on the small side, but the food quality was good.

I had a passionfruit/mango/strawberry juice, which was tart and refreshing and not too sweet, but I was disappointed to see it come out of a jug in the fridge. It might have been made in-house, but I was under the impression it was freshly made to order, which it was not. The pear and ginger juice also was good but came out of a jar and had a sort of pasteurized flavour to it. They will offer cinnamon when they serve it to you. I personally really prefer the spiced pear juice at Bannock, which sadly was seasonal and which I haven't had in a long time!

The main gripe is that I waited half an eternity for my food. As a regular solo diner, I'm unfortunately used to my order falling through the cracks sometimes, but it's still disappointing when it happens.

*Edited to add: I've been struggling over whether to give this 3 or 4 stars, because it's a solid 3.5 in my mind, but I've decided that it's closer to a 3."}
{"text":"After waiting 40 mins in -13 degree weather we finally grabbed a table for four right beside the bar. 

I was cursing the entire time while waiting in line, wanting to go down the street and just have something else, but the long line of people battling the cold temps reassured me that the food and atmosphere would be one not comparable to many others. 

As soon as we walked in, we were warped back in time to the 90's with their lime green fluorescent booths and playlist of wicked 90s hits playing (Backstreet Boys, Vanilla Ice, MC Hammer etc.)  

The order: hungry gal with bacon with an extra egg ($2) and side of Peamel bacon ($3). Total cost : $15. Came with Apple slaw salad, potato hash brown & toast. 

In response to some of the other reviews saying the serving size was small.. I feel that maybe you just didn't order enough food lol. For $15 I was full till dinner. 

The service was good, they forgot my peamel bacon at first, but it eventually came out after I told them. Coffee was bottomless, they only asked me to refill it once though. 

Overall it was great. All the other food we ordered was good, the cappuccinos were also delicious too. 

I do recommend coming here if you've never been, I personally wouldn't wait longer than an hour, especially in the cold.. the food was better than good, but for the hype this place has it's not worth TOO LONG of a wait, if you get what I mean."}
{"text":"Their brunch is definitely something you gotta try. We got the eggs benny with salmon and the daily special - the toasted tuna melt, and both were made perfectly. The poached egg was cooked so meticulously that you poke it and it jiggles like jelly. When you stab your fork into it, it melts and coats the salmon and English muffin that you have to fork it all in your mouth to get that sense of Umami.  

I'm huge on their Eggs Benedict and my boyfriend loved the special of the day - the tuna melt. He's a heavy carb muncher in the mornings so it really satisfied his cravings, and the hot chocolate to go with it compliments his sweet tooth.

The menu is really a classic and I really enjoy trying their daily specials on the weekends for brunch! If there's anything I would change, it's their option of making people line up outside even in the winter. They should really think of expansion or a better naming system where people can come back or get a text because it's ridiculously busy every weekend here that I've seen."}
{"text":"Came here on Easter Sunday brunch. Waited for a while but me and my friend had a good time. The food was good but the place was a little on the noisy side since it was full. Our waitress was very attentive and pleasant. Good experience overall."}
{"text":"Best waffles I've had in a while! The drink special of lemonade infused with cucumber and mint was also refreshing and delicious. My partner had the eggs benny, which he really liked. Service was a bit confused and we were about to be seated when another couple (who arrived after us) insisted they were ahead on the queue and the waitress obliged. It also took a while for the bill to arrive."}
{"text":"This was my second time going here. It was great the first time I went. Food was good, service was okay.. could have been better. The first time I went with my friends we waited so long to get the server to finish cashing us out that we ended just using their debit machine on our own to cash us out so we can leave because we had class after. The problem was just that we asked 30 mins before we left and still waited so long. 

The second time was worse. The potato rosti was burnt. When we asked for another one, he said it would come back out the same because its supposed to be crispy on the outside... BUT it was BURNT. Like charred. We couldn't even eat it, but we didn't push it and accepted it. After my friend finds egg shells in her food and the mushrooms on my plate tasted weird. Half of it tasted sour and the other half tasted normal so that felt off, but again I didn't make it a big deal. BUT what really pushed my buttons was the service. It was moderately busy, but yet again it took forever to get my bill. Not once during my meal did the server ask if everything was okay, he only asked after when we were already waiting for the bill. we tried to ask another server to get our bill and she said sure, but she didn't even pass the message onto our server so we ended up waiting even longer for our bill. This just made me and my friends not want to come back. We only came back because we love the food the first time, but after this second time we would not come back. 

Here's a thing to keep in mind too, I do not usual judge this hard, but I get it, its busy and thats why it may take longer, but where is your customer service. How are you going to tell me that you can't make me a new rosti and make sure the chef watches it, so its not burnt. My advice is to hire more people to help take on the tables. There was no opportunity for these servers to provide customer service, since all they did was jump table to table and kitchen to table. If at least they provide some customer service I wouldn't have felt to mad about my experience."}
