{"text":"La baguette au levain est incomparable, une pure merveille, bien alvéolée, délicieuse, qui reste fraîche toute la journée, ce qui est le signe de l'excellence. Et en plus, ils sont tous sympas! Ils sont même une des raisons pour lesquelles je ne voudrais pas déménager du quartier!"}
{"text":"Montreal has many very good bakeries, and it's perhaps risky to rate them. However, in this case I do not hesitate to rank this one very near the top. In addition to excellent bread, they offer a good selection of pastries -- croissants, muffins and scones (my particular favourite). They also serve excellent coffee, and there are several tables where one can read the paper, etc. And - most important - the staff are very pleasant and helpful.  Highly recommended."}
{"text":"Excellent neighbourhood bakery! Everything is delicious and you can buy you bread by weight."}
{"text":"I almost never give 5 stars but this place deserves a 6.  The Sweet Pastries were simply mind blowing and I'm not even a fan of desserts or pastries. The Sandwiches were fresh and bursting with flavor. I just can't believe a bakery makes such good sandwiches that simply CRUSH the competition from dedicated sandwich stores.  The bread was tasty.  Everything is fresh and reasonably priced. I regret not trying the coffee. Service was friendly. The place is well lit with cool wooden benches."}
{"text":"Passed by here after reading yelp reviews.  Got a baguette and an almond chocolatine. Both were spectacular to say the least. The baguette was crispy on the outside and nice and airy on the inside, perfection. We ate it up in the car and I regret not buying two!  The almond chocolatine / croissant was buttery goodness, a must try.  This place will become a regular for me!"}
{"text":"Les croissants aux amandes sont incroyables, et les baguettes : OMG ! Personnel très sympathique qui plus est !"}
{"text":"I & mom went to brunch today; we shared the braided bread with sundried tomato, feta cheese and pesto, lemon/cranberry scones, coffee and the coffee/toast special. While everything was undeniably fresh, the braided bread and scone were nothing to write home about & certainly a bit pricey. The value came in the coffee/toast special; it allowed me to taste the walnut bread, the fruit bread (apricot, raisin & walnuts) and the raisin bread, the confitures were; raspberry (super fruity not too sweet) another spread which I likened to grated pear with nutmeg & sugar; interesting + butter. I'd likely drop in again if in the neighborhood, mom said she wouldn't."}
{"text":"It's not every day that an store owner thanks you for your criticism of the whole bakery chain with a \"no question asked\" refund and some free croissants, especially when the aforementioned refunded item wasn't even purchased in his branch. Let me explain, a day before visiting the Villeray-set \"Pain dans les Voiles\" I bought a yule log at the newly opened Saint Bruno store. I remember asking for a soft and celebratory cake for my mother in law and they suggested the one log left from a week before: a thick, rock-hard, old fridge tasting ignominy that didn't taste anything like praliné hazelnut. Needless to say it was a huge expensive disappointment. Realizing that the people working at the south shore branch didn't what they were doing (none of the employees knew what frangipane was) I went directly to the main location.  I'll never forget how the manager Jimmy welcomed me, apologizing for a mistake that clearly contradicts what he and his brand stand for and ensuring that as a customer my opinion matters  Very good croissants by the way!"}
{"text":"Enjoyed their pain Choco-noix as well as their cannelé. They apparently also have good breakfast options to go. However, I still prefer la Boulangerie Guillaume!"}
{"text":"Petite pâtisserie de quartier à essayer. J'ai toujours un faible pour ces petits endroits qui offrent des sélection de pains différentes et qui changent continuellement. J'ai goûté à la fougasse qui cette fois contenait portobello, oignons caramélisés et cheddar. Tout le monde l'a adorée. Ils offrent aussi d'acheter des pizza fraîches du jour au 1/3, moitié ou entière. Les prix sont un peu plus cher que la moyenne. Si vous passez près du marche Jean-Talon, le petit détour vaut le coup!"}
{"text":"Superbe boulangerie de quartier! Toujours de nouveaux produits à découvrir. Très achalandée, mais le service  courtois et rapide est efficace! Choco-framboise, pain noix et chocolat, épis, sandwichs...tout est bon!"}
{"text":"I had two meals from Le Pain dans les Voiles on my recent trip to Montreal. The first I was just looking for something for a late lunch to tide me over until dinner. I got the amazing item photographed - thin pastry with some cheese (I think), tomato and fresh basil. Really wonderful and edible cold. Then, on my last morning in town, we got pastries for breakfast. An easy walk from my cousin's place that I stumbled upon the first time because of Yelp and know it is a neighborhood favorite. Friendly staff and tolerant of my extremely limited French conversation skills :)"}
{"text":"La meilleure boulangerie de Montréal a mes yeux ! Ils ont du choix, le pain est tellement bon et se garde tellement bien ! Il reste moelleux plusieurs jours. Beaucoup de bonnes viennoiseries aussi :) une valeur sûre de Villeray :)"}
{"text":"It's the best bakery in town! Always has fresh bread, great croissants, tasty soup and the $5 unlimited bread with coffee!"}
{"text":"First thing i have to mention is how beautiful this street has become over the past few years.  Rue de Castelnau from St-Laurent to St-Denis is 500 meters of delight to rival any stretch in this city. There's a bit of everything to dot the area, churches and schools, trendy grocers and old school dépanneurs. The coffee shops and the tons of sitting areas make it a must for summer \"flanage\".  This bakery sits as one of the jewels in area, Saturday morning has the rush of people queuing for the huge choice of baguettes, they can sit indoor or out and savoring a latte.   Free WiFi and daily newspapers plus a bright and pleasant atmosphere help to make this a top destination.  The coffee is one of the strongest ones around and had me energized for quite a while, the traditional baguette had a bit too much crispiness for me but aside from that it is well worth it."}
{"text":"Amazing amazing bakery. I don't want to move apartments because of this place. Good prices. Best croissants I've ever had. They even give deals on batches that might be slightly over cooked. Baguettes are delicious. Of course as well not to be forgotten is the staff. Really nice people"}
{"text":"Really love this bakery. Fantastic croissants (my favourite is the chocolatine with raspberries), really innovative breads (I had one once with hummus in it and it was really great) and overall good ambiance. The line is usually long but the service is quick. There are tables and chairs there to eat and drink but I tend to take it to go."}
{"text":"Amazing bakery with great croissants, lattes and sandwiches.  Loaded up this morning for the week.  This place is a cross between a Parisian boulangerie and Tartine Bakery in SF."}
{"text":"This with a few other independent bakeries in the city is tops in Montreal, the others are great but this is my go to. All their breads are fantastic, from their Kamut, Baguettes, Miche, Integral, grain bread, all of them. Croissants are very good too but there are some better ones around town. Their cinnamon rolls and pizzas are also very good and it's very kid friendly."}
{"text":"Nice modern dining area.  Awesome pizza ."}
{"text":"I loved this boulangerie. The bread it's delicious! Super fresh and crispy. The service is very kind, here you can feel very comfortable, you have the view of a whole corner in a such cute neighborhood and this combination with relaxed ambiance it's a pleasure. Try the chocolatine with framboise ; ) one of my favorites!"}
{"text":"Sometimes if you venture beyond the more active and bustling areas of Montréal, you will be able to find hidden gems like Le Pain dans les Voiles. It offers a warm and inviting, yet slightly chic environment to enjoy baked goods and aromatic coffee. I ordered a large cappuccino and a maple croissant, the perfect breakfast combo for when you want something that's light but still satisfying nonetheless. The maple croissant had wonderfully flaky, buttery layers that meld into the maple glaze seamlessly, and it was one of the best croissants that I've had in Montréal so far. The cappuccino was bold enough so that it balanced out the sweetness of the croissant, but not so much that it overpowered it. Overall, everything gave me a warm and toasty feeling inside that can only be accomplished with food made from the heart, and it's safe to say that I would make the trip to come here again!"}
{"text":"First experience visiting this bakery, had high hopes from the reviews. Picked up an olive fougasse, and unfortunately found out when I got home that it was hard as a rock. I like a little chewiness to balance out a crunchy crust, but this was all crunch. Ouch."}
{"text":"Todaýs croissant day 1$ each !!!!  Best pastry shop in the area.  I cant resist to go every weekend   Choco framboise pastry is my favorite. Canele also really delicious when still warm  Everything looks handmade  Good job!"}
{"text":"Just an update to say that aside from offering truly exceptionalicious baked goods at truly sweet prices, the staff here are beyond nice and fair. I just saw them load up a customers bag with 9 croissants and charge her for 6 because they were smaller than usual. Myself and everyone in the fast moving line smiled and thought to ourselves, I'll be back. I love it here."}
{"text":"C'est bien de retrouver une boulangerie dans le quartier. La plupart des produits offerts sont bien intérssants mais je trouve que leur pain n'est tout simplement pas assez cuit. Lorsqu'on le tranche il colle au couteau... mais le goût est bon! J'y retourne une fois de temps en temps pour voir si leur pains me conviennent plus et à chaque fois je me retrouve avec ce pain pas très cuit... donc un bon dépanneur... ou parfait lorsqu'on veut faire des croques monsieurs (madame) ou même des toasts mais je continuerai de fréquenter une autre boulangerie où le pain est parfaitement cuit..."}
{"text":"Just got sick from a vegan sandwich on ciabatta bread of all things. Will not be eating here again. They give you your meal cold unless you ask for it to be warmed up because it takes them extra effort to do so. You then have to wait 10-15 min for your barely warmed sandwich. How does this happen at a bakery? People expect warm fresh baked goods without a side of food poisoning."}
{"text":"Terrific scones, baquettes, Camu, really a awesome bakery - a taste of Paris in Villeray"}
{"text":"J'adore cette boulangerie!   Excellent pain frais et viennoiseries.  J'y retourne régulièrement pour me régaler."}
{"text":"This is a lovely bakery that I walked past many a time because it looked a bit schmantzy with over-price potential. Then, on a whim one day, I popped in to check out their wares and was so impressed by the delicious curried chicken and spicy pepper sandwich on ciabatta that (and at $5.95+tax VERY reasonably priced!) I ended up going back a few days later and ordered it again. I will eventually get to the goat cheese sandwich as well as other delights - the maple cream drizzled croissant caught my eye as well as the $1.50 blueberry and cranberry scones...They have pizza as well as all the typical (and atypical) French breads etc.   And I agree whole-heartedly with Risa D's review - the staff are exceptionally nice (and fair) - even when it's busy everyone, staff and customers, seem to be in a good mood. Something about the space, the light, the design...and the baked goods!"}
{"text":"I stopped by today bought a loaf of nice crispy olive bread still hot out of the oven. Brought it home to find they sealed it in a plastic bag. Had a soggy loaf that now in the oven but probably headed for the trash.  Obvious they do not train their counter help. Wish I had a chance to taste and leave positive review. Really a shame."}
{"text":"I stumbled across this insanely great bakery running an errand and picked up a perfect baguette.  Perfect as in robust, properly thick, rich, crunchy crust which complimented everything I put on it.  Mind you I live between Thorough Bread and Tartine Bakery in San Francisco.  The next day I went back to try the coffee and pastries.   I had a cappuccino which was nothing to write home about--a few blocks away you can get a very tight rendition of traditional Italian espresso.     But I digress from the most important thing:  the sublime cannelé.   Carmelized,  crispy outside, just cooked creamy inside.  Like no where else in Montréal and certainly no comparison to the pathetically squishy offering from La Boulange(rie) in San Francisco.  Peng, you were right (if heavy-handed) in our Facebook battle on the subject."}
{"text":"You know you are in for a treat when you enter a bakery and are bombarded with the smells of freshly baked bread.  This is what a visit to Le Pain dans les Voiles is like.  The bakery is a short walk away from the Jean Talon markey and is well worth the detour.    There may be lines but they handle them well so things tend to move along fairly quickly.  In addition to that the staff here are very pleasant and serve you with a smile.  Their selection is awesome and it is difficult to narrow down your selection.  I picked up some toast bread and croissants to take home.  Everything was super fresh and exceptionally delicious.    The Yelp ratings for this place are spot on.  My first visit here was awesome and I will definitely be back to try more of their offerings."}
{"text":"Un endroit que moi et ma copine a été en marchant dans la rue, une belle surprise, super boulangerie le pain est vraiment bon, ambiance est décontractée, et les Amandine exelent, c'est un endroit que je conseil"}
{"text":"Probablement une de mes boulangeries préférée du quartier, à peine la porte passé on est accueilli par la délicieuse odeur qui émane du four !  Un pain goûteux et peu onéreux, que demande le peuple !"}
{"text":"Located near Marche Jean-Talon, this French bakery is owned & operated by the parents of  Laurent Duvernay-Tardif, a Canadian-born American football guard for theKansas City Chiefs of the National Football League(NFL). He was drafted by the Chiefs in the sixth round of the 2014 NFL Draft after having played college ball for the McGill University Redmen!   Heard this very inspiring story on the Player's Tribune, when I made a return visit from California to visit my parents in Montreal, I've gotta check this place out.   Other than actually making a visit to Paris, this is without a doubt, THE best pâtisserie this side of the Atlantic, fresh baked breads, baguettes, croissants, yummy!"}
{"text":"Very good baked goods and breads. Although I prefer the one in MSH, this one is still chill! I especially love their pain brioché. The service could use a little bit of refining and could be a bit more efficient. It's kinda slow. Besides that, no complaints :)"}
{"text":"Boulangerie et café , local bien fenestré comme j'aime , plusieurs places au comptoir et aux tables. Viennoiseries , café thé etc mmm :)"}
