{"text":"Le resto se présente bien, belle ambiance. La nourriture est moyenne - rien de spécial. Où ils m'ont perdu c'est acec leur hot-dog à 14$, que j'ai commandé, et en plein quand je le mangeais la réalisation m'est venue: \"heille, c'est un hot-dog à 14$...\" bon, c'est de ma faute pour l'avoir commandé. En passant le hot-dog était ben correct, mais vaut en rien le prix qu'ils chargent. L'autre point négatif c'est l'attente de 30 minutes pour la facture à la fin - je comprends que la serveuse est occupée, mais 30 minutes..."}
{"text":"This is a nice spot with both indoor and outdoor seating (in the summer obviously). The wine was good but what surprised me was the tasty food. Delicate tasty finger food."}
{"text":"Très bon bar à vin, de bons conseils pour les choix, et les plats ne sont pas très copieux et un peu chers mais très fins."}
{"text":"What can I say?? This place is amazing. . Please, have the CALAMARI. Best I've had ever. I make it a point to try calamari from different restaurants, and this place is hands up top tier. Ambience, food, drinks, prices, and best of all the customer service is beyond great. I love this place."}
{"text":"Bar très sympa avec superbe terrasse sur Mont Royal; large choix de drinks et qqs trucs de bouffe sympa (assiette de fromages, croquette de pois chiches,..) Très bon service, bonne ambiance A essayer!"}
{"text":"I had to wait until the summer crowds died down a bit before being able to fully experience this new hot spot on Mont Royal. I watched how packed the place was all summer long, from the bike lane that passes beside their front door. I finally had the chance to try it out in October, because there was actually a place for me to sit down!  First of all: POPCORN SHRIMP. I ate a small basket, and then I ate the big basket. I was full but I couldn't stop. This place gets a huge thumbs up for having a kitchen open till 2am, because there's nothing worse than hanging out and having a good time somewhere and BAM, you get hungry but the kitchen's already closed. No worries here, in that regard, so we can all relax.  The bar staff are really FAB. They take time to stop, look you in the eye, make thoughtful recommendations for wine choices, and let you sip a little o' this and a little o' that, if you're trying to make up your mind. Supah classy.  What I really enjoy about this place, though, is the mixed crowd. All kinds of age groups, singles and couples, groups of ladies, groups of office mates, young lovahs, old flames, and every other type. I feel like I can be myself. Nobody's pretending. A genuine good time."}
{"text":"Une très bonne adresse. J'y suis allé uniquement dans le but de déguster un ver de vin avec mon compagnon. Je n'ai pas été déçu. Les conseils sont excellents, et les vins le sont encore plus. Un très grand choix de bouteilles et de verres y sont proposés, ainsi qu'une pléthore de nationalités allant du vin français, jusqu'à l'australien, en passant par l'italien et l'espagnol. La seule remarque que je pourrai faire, et que le service est un poil long. Cependant il y avait beaucoup de monde, mais pour deux verres de vins, j'estime que je ne devrai pas avoir à attendre 20mn. Ceci étant dit, je conseille vivement cette adresse. Elle est remarquable."}
{"text":"Nice spot, a little bit noisy though. Nice variety of wine, the price are reasonable and they serve taps. The food is nothing amazing but I always like when bars serve food so that's a"}
{"text":"Très joli carte des vins ! Des importations de qualité pour un vrai bar à vin. Amateur de vin je me suis reconnu dans cette carte des vins qui possède une joli complémentarité sur les différentes régions françaises et internationales. Les prix sont dans la moyenne et permettent donc de pouvoir découvrir des bons producteurs dans de jolies appellations. Il est important à préciser que la carte des cocktails n'est pas ridicule et celui que nous avons goûté était réussi. Prix compris entre 10 et 14$ pour les cocktails.  Il est possible de prendre des choses à manger, nous n'avons pas testé mais certains plats me tentaient pour une prochaine fois. Cela varie entre 8 et 14$ suivant votre choix. Les assiettes avaient l'air appétissantes !  L'endroit est vraiment sympa, j'aime l'agencement des lieux qui donne un style cosy qui permet d'aussi bien ramener sa gang qu'un rendez vous plus amoureux. Il y a aussi bien des places au bar que dans des tables. L'espace est assez conséquent et lorsque nous y sommes allé ce vendredi soir cela était assez remplis, preuve du bon départ de ce bar !  Au niveau du service il est agréable. Les 2 gérants sont présents en salle pour placer les personnes ou s'occuper du vestiaires. Alain (l'un des gérants) possède un domaine viticole en France et donc connait le métier du vin et possède en conséquence une expertise en la matière. La qualité du vin est donc présente tout comme les conseils qu'il peut vous faire durant les choix des bouteilles suivants vos goûts et envies du moment.  Pour une première je suis satisfait et je reviendrais tranquillement un soir de semaine pour profiter de l'espace dans une autre ambiance.  Je le conseille fortement aux amateurs de vin."}
{"text":"Bel ambiance  de bar à vin.  J'avais fait une commande d'un   succulent  vin rouge corsé  léger . J'ai essayé  leur plat à base de betteraves qui était  bon et enfin  j'ai terminé avec un Cointreau et une crème brûlé  qui était très  délicieux !"}
{"text":"Fabulous ambience. I only had their chocolate fondant dessert so I can't rate the food, but the dessert was good for the price. Overall, great experience. Perfect for a date or a relaxed hang out with friends."}
{"text":"J'ai eu l'occasion de tester le rouge gorge un dimanche apres midi juste pour prendre une bière. L'endroit était relativement vide ce qui est relativement normal. Malgré tout il y avait pas mal de monde pour s'occuper de nous. Le service était vraiment rapide de ce fait. J'ai trouvé le lieu sympa et assez grand pour de grosse soirées donc à refaire."}
{"text":"Really nice staff, great wines (and suggestions). Th meat and cheese platters were paired well together. The fact that it's open late is a huge plus."}
{"text":"Exceptional service! We decided to sit on the pateo since it was such a beautiful day too bad the tables are made out of metal and it was just too hot for our liking. We decided to bring our drinks and our beautiful selves inside lolol. The bartender was so sweet and genuine. It was his first day and was super nervous to get the drinks perfectly right to our likings. The drinks were great and They are very well reputable for the fine selection of wines and other alcoholic beverages.   We ordered a crême brûlée as well and devoured the delicious bowl full of temptation.  We definitely recommend this place to have a drink and enjoy a wonderful time with friends or co-workers. Service was amazing super quick and attentive both the bartender and waitress were super friendly and happy to serve us. The food was 5stars!! Top notch! Super happy with our experience and will definitely be back on another occasion.  Thank you for this afternoon a big thumbs up!!!!"}
{"text":"Had the best wine and tapas here with friends. 10/10 would recommend this spot for a good time and top quality plates."}
{"text":"Bar à vins situé sur le Plateau. Premier essaie, je ne connaissais pas la place et ne savais pas à quoi m'attendre. A mon arrivée, j'ai été agréablement accueillie, on m'a dit de m'installer où je le souhaitais et on m'a prévenu qu'un band de jazz allait débuter sous peu, mais que je ne serais pas trop dérangée. Information très pertinente comme j'avais un tête à tête, donc faut s'entendre parler :) Il semblerait qu'il y a un band live tous les lundi vers 19h, c'est super agréable!!! La carte de vins est très complète, on prend des demi verre afin de pouvoir essayer différentes variétés les prix sont raisonnables. Les serveurs prennent vraiment le temps d'expliquer et de trouver ce qui pourrait nous plaire. La carte des snacks est aussi intéressantes nous avons gouté aux revettes pop-corn avec mayonnaise au wasabi et à l'érable, c'était vraiment délicieux!!! A essayer et j'ai bien hâte de tester le Royal, leur speakeasy qui vient d'ouvrir ses portes :)"}
{"text":"I really enjoyed the charcuterie board. It came with different types of meats such as duck and salami it was a regal tasting party. The creme brulee was really good as well. Place is very nice and the service was on-point. I'd go back.  Price-tag is a bit high but that's what you get when you go to wine bar."}
{"text":"Excellent bar à vin sur le Plateau ! Voulant passer une soirée sympa avec ma copine, j'ai décidé de l'inviter pour boire une bouteille de mousseux sur la terrasse extérieure du Rouge Gorge par une belle soirée d'été. Excellente idée dans un bel endroit, belle décoration intérieure. Bonne carte + menu/tapas (assiette de charcuteries 15$ / pieuvre tempura 9,50$ / cassoulet de canard 25$), ils ont beaucoup de choix de vins rouges/blancs/rosés, mousseux & whisky/spiritueux. Service sympa de la serveuse. Définitivement, un bar à vin de qualité qui s'ajoute à Montréal. J'ai déjà hâte d'y retourner pour essayer d'autres choix viticoles et aussi goûter leurs tapas. Une nouvelle valeur sûre, sur le Plateau pour sortir avec des amis ou encore avec sa blonde.  5/5 visité en juin 2015."}
{"text":"What a fun place. I was walking in the area on Sat. night with 2 friends looking for a pub, since all the ones were crowded we went inside this place. It was full but still not packed and had a cool atmosphere. The music in the back was super fun (I felt like they downloaded my playlist), the wine selection is superb and I just dont have anything bad to write about this place...I MUST revisit it :)"}
{"text":"Nice place to gather around for a drink the atmosphere is quiet people from the neighbourhood is here on the week like many weekday pubs on the plateau. Not the noisy type of place. The crowd is a bit older for some reason lots of baby boomers, don't except young people like at Buvette Chez Simone. It is lacking something maybe better music and people watching. I can't say for the beer because I don't drink any but it looks like they have a wide selection of local beers. As for the food because I'm here to rate the food: nothing special, not much people ordered any food, they have a pear salad not bad with a nice balsamic dressing, I also had their potato wedges, grilled octopus and the charcuteries platter. If your looking for a quiet night and talk with some friends during the weeknight this is the place.Have dinner somewhere else after 1-2 beer max here."}
