{"text":"My sister had eared about this restaurant so we decided to try it for my last evening in Montreal. Located right at the corner of Fleury and St-Urbain people knowing Montreal won't have any problem to find it. Visitors might have a harder time but with a map or a GPS they will find they way for sure.  This French Bistro style restaurant is quite inviting. Inside it's like an open space. From the dining area you can see the cooks preparing the ordered meals. I liked this concept. I'm always curious to see how they work. The decoration was simple but very nice. Our waiter was perfect. He was always smiling and answered all the questions we had concerning the menu. To note the menu is on the wall, no paper menu is offered there. From appetizers to dessert we enjoyed our meal. It was well presented and really delicious. I have to say that the size of the main dish portion were small. On the other hand the appetizer's plates size were perfect.  One thing I loved there is, they offer wine from private importation. The reason I'm saying this is that in Quebec the state control the alcohol business. Which means a lot of very good wine never make it to Quebec because their producer can't comply with the \"production volume\" requested by the state company. But here in this restaurant 80% of the wines were imported by private companies. It's, for me, a big plus for this restaurant. They can offer special wines which can't be found in stores in Quebec.  Even if I spent a great evening enjoying great food, I can't give a 4 nor a 5 stars. The reason: the prices. It's was too pricey for what we had. We were 2 and we paid, including taxes, 277$ CAD.  The prices were like I was here in Zurich in a good restaurant but I was in Canada where everything is much cheaper. I honestly wonder how locals can afford a complete meal including a bottle of wine there. You can definitely eat as good for half the price somewhere else in Montreal."}
{"text":"Expérience plus que décevante. L'impression générale est qu'ils frappent au dessus de leur poids. Prix vs la qualité, portion et service décevant. L'entree de petoncle n'avait qu'une petoncle, le boeuf avec les nouilles (style asiatique) ne devrait pas faire partie du menu d'un restaurant qui a cette réputation et ces prix. Enfin, au delà du look trendy,  si vous êtes minimalement critique et aimez bien manger, plusieurs autres restaurants offre mieux."}
{"text":"Excellent repas.  Bonne ambiance.  Bonne musique.  Excellent service.  On aime le concept.  Filtrer l'eau municipale au Brita serait un atout."}
{"text":"Expérience très décevante dans l'ensemble. Le point fort de ce restaurant : le pain de la boulangerie 'La bête à pain', située juste à côté et qui appartient au même chef proprio. Pour à peu près 50 $ par personne (avant vin et service), ça ne vaut pas le coup. Les plats sont très ordinaires et le service peu chaleureux, limite antipathique.  Ce que j'ai mangé :  Entrée - crevettes nordiques à la coriandre, sauce soya et avocat. Bonnes crevettes, mais le tout était trop salé et la portion petite.  Plat principal - saumon avec chorizo, sauce clamato, chutney tomates, fenouil et lime. Bonne cuisson pour le saumon, mais le plat était vraiment trop sucré.  Dessert - panna cotta, avec confiture et 'crumbling' avec pistaches. Pas bon du tout comme pana cotta. Ça m'a rappelé un mauvais genre de 'pudding' d'une cantine d'école!"}
{"text":"Depuis que le St-Urbain a ouvert ses portes sur la rue Fleury ouest, on se regale sans avoir a se taper le brouhaha du centre-ville! Je vous suggere les petoncles ou le fletan s'ils sont au menu...une excellente carte des vins, service professionnel, une cuisine  hors pair..."}
{"text":"This was our first time here but on the recommendation of friends. We had an excellent dinner. The scallops with shrimp were beautifully prepared and presented. The special cote de boeuf was cooked medium rare and was tender and succulent. My wife had the Buratina and the Papardelle which were also excellent. The wine list was not extensive but there was plenty to choose from to complement the meal. Wrapped it all up with a 375ml bottle of tawny port from Warres and a selection of fine Quebec cheeses. Couldn't ask for more. The decor is minimalist with the menu prominently displayed on a large blackboard which stimulated discussion around the table. There was also the option of a 7 course degustation menu which looked very interesting. There is a patio but, not surprising for a central restaurant, it is close to the road. The service was excellent. Very friendly, attentive and timely without being annoying. Prices were not cheap but I found it very good value for money. Overall it was a great experience and I would recommend St-Urbain to anyone who enjoys good food."}
{"text":"Very fresh and tasty.  Friendly service. A bit noisy. Nice terraces"}
{"text":"Went on a business Dinner with my company and I can say after three years eating here it just keeps getting better, great food, value and service.  A little out of the way but worth the cab or Uber to and from.  Wine selection was great and all at a value that I cannot believe.  Lastly ...the bread is the bomb."}
{"text":"Our lunch at Le St. Urbain was as good as it gets, and perfection in every bite. Let me tell you why!  Chef/Owner Marc Andre Royal is no stranger to the foodie world of Montreal. Owning two successful bakeries(La Bête à Pain in Ahunstic, and Griffintown) which I brunch/lunch there often. He also is known for his catering services as well.  Montreal Cooks cookbook(A must buy if you're a foodie!) has featured him, along with other top rated chefs of Montreal.   Situated in a cute suburb of Ahuntsic, easy to find with street parking.  Upon entering we were politely greeted by a lovely hostess. We made reservations(Which is highly recommended!) and our table was ready for 1:00pm. Since it's October and the weather has become colder, we brought our coats. Our kind waiter offered to take them out of the way and hang them for us. Within only five minutes, I'm already quite impressed with the staff members.   As we are sitting down, our waiter introduces himself and the menu as well. The restaurant has two different menus. One for the evening and for for lunch time. Our lunch time menu came in this very cute little clipboard, with a clear description of each dish.  The lunch menu consists of two stages; appetizer, and main dish. Dessert is not included. Having said this, I strong recommend you save room for desserts!  In terms of portion size, they are perfect! You leave feeling very satisfied and not overly full or sleepy. I loved that!  Within five minutes of being seated, our waiter took our order. Deciding what to eat was a challenge for me. Why? Because everything sounds delectable! So I discreetly glanced at other tables around me, to see what I could get inspired by.   While we waited for our meal, the hostess came with a lovely bread basket and offered us a slice of what I think it's the most outstanding bread I've ever had in a restaurant. Most restaurants in the city do not provide you with good bread. Le. St. Urbain's bread was simply addictive. Dense, moist and with a perfect crust on the outside. This is how well baked bread should be! It was served alongside of a cute piece of slate with your own slice of creamy, cold butter.  We were so focused on the bread, that we didn't realize how fast time flew by. Within 10 minutes, our appetizer was served. Very beautifully presented!  We had confit zucchini & onions, served with a creamy goat cheese, slivered olives(Not salty) and a light sprinkling of peanuts. Outstanding! Again a perfect size portion to feel comfortably enough to enjoy our main dish.   Another 10 minutes go by, and our main dishes arrived. Once again beautifully presented and served at a perfect hot temperature where it gave me time to photograph our dishes.   Our main dishes consisted of; A loin of pork pan seared to perfection, along with green cabbage, fingerling potatoes, sweet sauteed carrots, in a light sauce.  The pork cooked to an absolute perfection. Juicy, and fork tender.  My main dish was a Pot au Feu. Buttery and tender pieces of braised meat, served with a mixture of roasted root vegetables. Along side of a little pitcher of au jus. Which is the tasty juices of the simmering meat that was cooked with vegetables, herbs, and seasonings.   Lastly came desserts. We shared a spectacular dish of brownie bites, that had a wonderful and strong pronounced taste of chocolate. Clearly a good quality chocolate was used. Served with a compote of fresh cranberries, tangy cherries, along with a scoop of sour cream ice cream. The combination of textures, and flavours to contrast the sweetness of the brownies was just perfect!  Overall this was an absolute flawless and excellent lunch experience. Filled with dishes that consisted of seasonal fresh and excellent quality ingredients. Along with very professional, and hard working staff.  Le. St. Urbain was placed on my top five favorite restaurants in our city. I look forward in returning again, and again.  Bravo to all the cooks and staff members! Excellent job!"}
{"text":"Expensive and very small portions. Thankfully, bread and butter were good and abundant. I will definitely not go back."}
{"text":"Holy sizzle! This place was so good!!!! We got the duck breast and the pork belly and lobster. The flavor was excellent; a pure revelation. Holy efff this was so good. Portion sizes were good, and it wasn't as pricey as I had imagined.   I'm so happy I kept my reservation, even though this place is a bit far out. Excellent, 10/10 would recommend."}
{"text":"La nourriture y est incroyable ( particulièrement les huîtres gratinées, qui étaient sublimes). Le services y est excellent, la sélection de vins permet un agencement adéquat à l'ensemble des repas.  Un excellent endroit pour une sortie spéciale."}
{"text":"J'ai hésité à mettre 2*...Alors admettons  que je donne une note de 2.5/5. Voici pourquoi...  J'ai été le midi. Le menu est très bien...que ce soit à la carte ou le menu midi. 23$ environs  pour le repas midi, qui inclus un choix d'entrée et le plat principal. Il y a aussi un menu midi dégustation à 40$. Je sais que le menu change quand même  assez souvent...la journée où j'ai été, j'ai pris la salade de betteraves  et chorizo. Petite..très petite, mais excellente!. C'est servi en plus sur un plat qui ressemble à un plat de terre noire.  Très belle présentation! J'ai ensuite décidé de prendre la bavette de boeuf, servi avec légumes et purée et choux fleur.  J'ai bien aimé les légumes et surtout  la purée, la bavette était correct..mais aurait été meilleur si elle avait été saignante comme j'ai demandé...elle était médium saignant. Il n'y avait pas de poivre sur la table, et venant d'un resto un peu plus haut de gamme avec les ingrédients  qu'ils utilisent, on aurait pu  avoir un service de poivre sorti du moulin.   J'avais tellement faim que j'ai mangé 2 tranches  de pain, qui vient de la boulangerie affilié  La bête  à pain. Le pain avec différentes sortes de graines est délicieux...miam!  Pour le moment j'aurai mis un 4*, par contre...pouet pouet pouet...Le service a fait descendre la note comme ça ne se peut pas. Par exemple, un de mes collègues a simplement répété langue de bison (un élément sur le menu) et le serveur à dit d'un air bête...MAIS OUI L'ANIMAL\" comme si on ne savait pas. Il était bête et a mal répondu à un autre collègue car celui-ci ne savait pas un truc sur le vin...Bref...Un monsieur qui n'aime pas sa job ou qui a des préjuger sur les gens qui viennent dîner au chic restaurant  sans être habillé en veston cravate.  Bref...en terminant...si vous êtes un groupe de 8 ou plus...on exige que le paiement soit fait comptant car...selon notre \"sympathique\" serveur...Faire payer 8 personnes chacun avec une carte débit ou crédit ça prends 2 min par personne et quand on est 8...on vient déjà de perdre 16 GROS MINUTES...J'aurai compris si Monsieur avait été dans le gros rush...mais non il y a une autre serveuse et en plus une vrai gentille madame qui est au comptoir à l'entrée pour faire payer les gens...Bref...j'ai payé Intérac TEN TOE"}
{"text":"Oh how I love Montreal and its wonderful cafes, brassieres, bistros and cafes. We joined an old friend who lives here and ended up in this amazing place! Surely one of the finest farm to table restaurants we have eaten at. No set menu. The items available are all local grown and dependent on the available fresh ingredients. It is not a tourist bistro so french is the primary language. Our friend is a quebecois and our waitress spoke English .  No sweat! On a Friday night it was buzzing snd very noisy, didn't matter, its a cool place.  The wine list is extensive. Both international and domestic choices. I had a wonderful Sauvion Blanc, right brain a delish french Chard. Friend had an amazing Syrah. Both right brain and I both ordered duck, awesome! Friend had the Boeuf, was extraordinary! I can safely say the chefs are something to write home about. We left full, happy and wanting to return. Please try it when in the city, worth it. Make reservations as it is very popular."}
{"text":"Ahhh. I can't forget about this place. Of all the Montreal restaurants we could've gone to, my boyfriend and I chose this place because this place serves tongue and it stood out from the rest. Plus tongues are delicious, so I knew this was the place to go.   We ordered an appetizer to share, which was grilled cauliflower (Chou-fleur grillé, 1608, amandes, truffe), and it was creamy and flavorful. You can taste the grilled charness of the cauliflower, while the puree complemented it as you combined them together. Absolutely delightful, so we finished that up nicely.   Then we both got the Bison Tongue (Langue de bison grillée, crème de thon, maïs, câpres et citron) as our main course. I've had tongues before but this dish had the softest, most delicate texture. The heaviness of the meat was well balanced with the radish, capers, and lemon. The cream was very delicious as well. Was it really made out of tuna, I wonder...  Check out this beauty: https://s3-media4.fl.yelpcdn.com/bphoto/GN5hRkRpNFSPtGtX8MTa8g/o.jpg  Price wise, I thought it was fair, and quite generous with the serving. Really impressed! I also oversaw a French couple enjoying their dinner, and I really want to come back to try what they were eating. So Le St-Urbain, I'll be back...I'll be back."}
{"text":"Cet endroit est à l'origine du renouveau de la rue Fleury Ouest. Depuis 7 ans, leur cuisine est constante, inventive et de très haut niveau. Pour moi c'est le meilleur resto du nord de la ville."}
{"text":"French bistro. We were three for lunch. It gets loud. Tables are close. Good French cuisine. My French guests enjoyed the duck confit, risotto and braised beef. Excellent wine selection. Nice neighbourhood with street parking. Good service and popular. Reservations probably required. I'll come back with the Mrs."}
{"text":"I went with my Foodie Group and Enjoyed the Atmosphere, the service and the food very good and different ( with a nice little twist).  The only thing I was disappointed in was that the owner threatened to give the table, a table of strangers ONE bill if we were more than 8 people.  We, as a group have done many restaurants and thus I was shocked when he proposed this.  I would have had to restrict everyone's intake because I would be forced to collect cash from everyone to pay my ONE bill.  As it turned out we were only 7 and the owner is the one that lost out because Half the restaurant WAS Empty when with my group, if I hadn't restricted us, we would have nicely filled it up for them.  All in all I do recommend this place but not for groups more than 8, unfortunately!!  BTW  The bread they served with their meals was Amazing and so Fresh! Came from their bakery next door. Nice touch!"}
{"text":"Première visite au St-Urbain vendredi soir dernier.  L'exaltation était à son comble; le restaurant m'ayant été vendu plus d'une fois. Or, l'expérience ne fut ni catastrophique ni nirvanesque.   Disons d'emblée que j'accompagnais une douzaine d'amis.  Un menu de groupe nous a donc été assigné. Les entrées étaient excellentes, notamment la pieuvre de la Méditerranée que je vous recommande chaudement (la cuisson était parfaite, le goût de charbon de bois, divin). Quant aux plats principaux, peu de choix nous a été offerts (Le loup de mer, la truite saumonée et la pintade de St-Ignace). À notre demande, le magret de canard fut ajouté au menu. Les plats sont préparés et présentés avec soin, rien à redire là-dessus.  Pour avoir goûté le magret de canard, disons qu'il était coriace, parfois très coriace.  Quant à la pintade, elle était, comment dire, fade.  Il manquait donc les feux d'artifice auxquels nous nous attendions, ma compagne et moi. Dommage. Cela dit, ceux et celles qui avaient choisis la truite saumonée semblaient ravis.        Le dessert (Yogourt, baies et sorbet) manquait de grâce, si je puis m'exprimer ainsi.  Plus que quelconque, tant dans le goût que la présentation.  À revoir selon moi.  Heureusement que le serveur a mis sur la table les beignets chauds, le caramel au beurre et fleur de sel.  Un pur délice, je vous les recommande chaudement.    Quant à la carte des vins, le St-Urbain propose plusieurs produits d'importation privée. La sélection des vins est variée et intéressante.  Les prix des bouteilles sont honnêtes. Désirant sortir des sentiers battus, nous nous sommes procurés un vin de Serbie, soit le Obecanje, Francuska Vinarija, E. & C. Bongiraud, 2009.  Un beau produit, bien fait.  L'attaque peut surprendre au début, mais vos papilles s'y habituerons très rapidement. Ajoutons que le serveur nous a très bien informé sur ce vin, ses origines et ses caractéristiques. Ce qui m'amène à commenter le service.  Très amical, rapide, disponible, professionnel.  L'une des forces de ce restaurant à mon avis.    Bref, l'expérience fut agréable, mais sans plus. Rien d'exceptionnel compte tenu du rapport qualité/prix auquel nous sommes en droit de nous attendre. Étais-ce dû au fait que nous étions plus d'une dizaine de personnes attablées ? Cela est probable puisque plusieurs de nos convives en étaient à leur seconde expérience à ce restaurant et constataient une différence entre leur premier visite (plus intime) et leur seconde. Peut-être devriez-vous songer à vous y rendre en groupe de deux ou trois personnes maximum ?"}
{"text":"This restaurant has been on my to do list for a long while but haven't had the chance to visit mostly due to location. Situated in Ahuntsic, it's a little out of the way from other trendy or chic restaurants however, the chef is well known and has made a name for himself as has the bête à pain bakery next door. I finally decided to check this place out with a group of friends as part of MTLaTable on a Saturday night.  Firstly the food was great! Bistro style not too fancy but generous portions and good flavours. I especially enjoyed my entree of mussels which was full of flavour and textures that really elevated the dish. The brisket main was perfectly tender served with a wonderful and flavourful jus. Lastly the panna cotta and shortbread dessert was outstanding; the lemon and basil flavours really worked well together.   The service was good although there was a lag in getting our drink orders but overall, considering this place was packed, the service was professional and effective.   I would love to try the regular menu even though this spot may be a little out of the way and discover what this chef can do with seasonally fresh produce."}
{"text":"Bel endroit cosi .Bon service à la clientèle . Mon cocktail était délicieux. vraiment bien"}
{"text":"Having a enjoyable evening after a stressful day. Our waitress were marvellous and friendly. The foods was to die for. It just kept on getting better every time I visit. Every bite is just DELICIOUS. The chef is so talented. Both appetizers and dishes were Fabulous! Full of elegance with gorgeous decorations, freshness, textures, seasonable and colours. The desserts treats were exquisite. Everything is just Perfect!!"}
{"text":"Had a great lunch here. Delicious Risotto  and the best roasted duck ever had! Valerie was super nice helping us in selecting a perfect wine for pairing and give us great suggestions on where to go to ski during our stay here in Montreal. Highly recommended."}
{"text":"An enjoyable dining experience in every way.  One of my favorites.  Unpretentious, sophisticated space.  Excellent food.  And the last time I went, I had the best waiter ever - not only thoroughly knowledgable about the menu and wine list, but also appreciative of the food in a way that made me think he was actually the chef in disguise."}
{"text":"I came here with my boyfriend on Friday night. We ordered the charcuterie plate which consisted of four different meat. This place is not known for its charcuterie but my boyfriend wanted to try it. The charcuterie doesn't even come from the resto so it wasn't the best choice of entree. I only liked two things on the plate: the lamb sausage and the nduya sausage pate made with pork. We got bread from the bete a pain bakery. It was thick and soft. It was almost cake-like. We shared two mains. They were the only two meats on the menu. We had the confit de canard with duck heart, sweet potato, rapini, porto sauce; and the hanger steak with celery root, carrots, aïoli and veal juice. I was a bit worried to eat duck heart but it didn't taste like what I expected. My boyfriend found it bland but I liked it because similar to tofu it doesn't taste like much and basically just tastes like whatever the sauce is. The crispy skin of the duck was fabulous. It was salty and fatty and juicy. MMmm so good! My boyfriend found the steak to be chewy but i thought it wasn't chewy at all and I liked the way it was cooked. The taste of the steak alone I didn't particularly like but with the sauce it was very good. Event the veggies with the sauce was amazing. My boyfriend didn't like the food but I think its because he is sick. I thoroughly enjoyed the food. ."}
{"text":"This is an amazing restaurant! Food is fantastic. Service is good. Went there a few times and the fish was so tasty. It's a must try. Updated my review. This place went up a star. One of the best restaurants in Montreal. The choices are always original and full of flavors."}
