{"text":"Décor correct mais le menu est lamentable. Beaucoup de combos ou forfaits imposés pas vraiment une place pour les amateurs de sushis."}
{"text":"un des meilleurs resto de sushi. Le déplacement en vaut la peine Proprios et serveurs très sympathiques Ambiance autant pour les couples que pour la fête On peut sans crainte suivre les recommandations des serveurs Faut réserver, endroit très achalandé"}
{"text":"Attentes élevées, amère déception.  Choix de sushi limité et surtout axé vers makis spéciaux trop chers.  Que le menu ne fasse aucune mention de Nigiris démontre que ce n'est pas un endroit pour amateurs de sushi du tout.  Table d'hôte limitée en options.  Le Tartare de boeuf était bon, les frites aussi.  L'entrée de dumplings frits était correcte, mais beaucoup trop salée.  Le seul truc plus salé étant la facture, au dessus de 72$ pour 4 entrées avant le pourboire... un peu élevé!"}
{"text":"This place came up as having the highest reviews (or having any reviews at all) in our search sushi in and around St Jerome.   My GPS (Garmin) took us a bit too far north on the highway, by at least a few km. When we eventually arrived there, the parking lot was full of high-end cars. When we entered the place (schlepping in wearing shorts and flip-flops) we ended us in a room full of men wearing suites and women wearing high heels and plenty of makeup. Obviously, the sushi experience in this corner of the world is much less casual than where we come from.   We didn't have a reservation and the only tables available were outside on the porch. The sun was getting down and as we were about to have dinner, so were the moskitos. We took the porch table anyway.   There was not a single oriental face, neither in the front or the house nor in the back (a staple feature of any sushi place in GTA).   The menu didn't have a single items that would look or sound familiar. After a bit of a consultation with the waiter, we ordered some rolls.   The prices were on the high side. I would say, 60% to 70% higher that what we are used to pay, just outside of a major metropolitan area. The portions were small. However, the food tasted GREAT.   Now, I realize that what we typically call \"sushi\" is not necessarily something uber-authentic. The food here was even further away from its Asian roots, so far, in fact, that I would hesitate to call it \"sushi\". That aside, it was absolutely delish.   Overall, this visit was a positive experience. We got introduced to a very different take on a type of food we thought we knew everything about.   The people here don't just come to this place to stuff their stomachs with food. They sit down for a long and enjoyable evening of food and conversation over a bottle of wine. Suki caters to this type of clientele very well."}
