{"text":"This place is awesome! I'm a huge fan of Pret-a-Manger in the UK, so finding Le Sanbox was a dream. Their hot wraps are delicious, their ever-changing variety of soups and hot pots are great and the staff is super friendly. It's a perfect stop if you're on your lunch hour in Mile End."}
{"text":"Je suis allée pour la première fois au Sanbox aujourd'hui, j'avais entendu parlé du concept et j'étais curieuse alors pourquoi pas! Première remarque: le staff tellement sympathique! Jade avait des étoiles dans les yeux lorsqu'elle elle m'expliqua le concept de la place et les produits, et j'ai vraiment aimé le fait que le menu s'adaptait au fil des jour selon les demandes des clients. Je me suis finalement laissée tenter par le sandwich concombre melon, de l'eau de coco et la salade de pois chiche, que je pris pour apporter. Rendu chez moi je commence par me faire un smoothie avec l'eau de coco, (parce que tout seul je suis pas capable d'en boire) avec du Kombucha a la citronnelle, de la glace, des fraises et des baies congelées :) puis on goûte ai reste. La salade de pois chiche était surprenamment légère, principalement parce qu'il n'y avait pas de mayo mais de la moutarde de Dijon dans le mix, et ça goûtait vraiment bon, un goût qui a un caractère subtil, juste assez doux pour ne pas voler la vedette au plat de résistance tout en nous faisant apprécier chaque bouchée. Puis vient le fameux sandwich. Plusieurs erreurs auraient pu être commises: Trop de concombres/melons qui rendent le sandwich tout mouillé et pas très agréable; trop de fromage a la crème qui camoufle le goût de tout le reste; pas assez de tout, ce qui fait que ça goûte que le pain à 75%. Quel soulagement lorsque je pris ma première bouchée; un équilibre parfait entre les concombres, les mêlons et le fromage a la crème. Un pain frais, pas mouillé un poil par les concombres (ma plus grande peur) et une surprenante touche de pesto qui vient relever le goût du sandwich. J'ai été comblée et totalement charmée. Et avec ce premier 30 degrés de l'année, j'aurais pas pi rêver d'un meilleur lunch!   Ce long texte pour dire: Merci et bravo pour le beau projet, je serai de retour sans faute lorsque je serai de passage dans le Mile-End pour les encourager dans cette belle aventure, et j'espère que vous aussi! :)"}
{"text":"Super endroit pour une bouffe de qualité et rapide. On ramasse un sandwich ou on s'y attarde pour jaser."}
