{"text":"a friend took me to this place and i couldn't stop going.  definitely one of the best inidan resto in mtl.    their naan is soo delicious and moist, yummy!! damn too bad SD doesn't have good indian resto.. i love their eggplant dish, out of this world.  not sure how they cook their eggplant but it comes out smokey.. perhaps they grill or roast it in the oven but it is one of my fave dish there.    i used noticed that we're the only non-montrealers writing this review.. what happened to these montrealers?    i can't wait to go back once i'm in town!!"}
{"text":"The best! Great food that is always consistent. Excellent service that parallels the nice ambiance. Favorite dishes are the Chicken Korma, Chicken Biryani and Butter Chicken served over a nice dish of rice pulao. Definitely recommended!"}
{"text":"This place is the best. The ambience is cozy and nice. We went there several times and all foods that we tried were perfect. Now I am a big fan of Indian foods.I  suggest butter chicken, beef khorma and le taj platter. Beside the pea rice with saffron and nan were awesome. The Indian tea is also special for us. The service is very good  and people are very friendly. I definitely suggest this place."}
{"text":"I went to Le Taj this afternoon for lunch. I was having a not so great today and was in the  mood for some comfort food. Being an Indian, comfort food is Indian food for me. I did not have to wait too long and the lunch buffet food wise was descent overall. The malai kofta had this strange burnt milk smell and the naan was chewy. But the reason why I have given the place poor ratings is because of the service. Once I got the table it's almost like I became invisible. No one offered me water or guided me or nothing. Till the time I left I had no idea who my waiter was. I was just ignored. I really don't want to think its because of my ethnicity but it seemed like everyone around me was served on time. I was hungry so I got up and got my food and came back to the table. Still no trace of anyone asking if I wanted a drink. Asked for the check, they come with the swiping credit card machine to the table itself, swipe the card and hand it to you. I really didn't wanna pay a big tip cos I felt like I served myself but I ended up giving a 15% tip a) Because I know waiters don't earn a lot b) that was the lowest tip that machine allows you to offer. Went for the comfort food came back feeling ignored and uncomfortable."}
{"text":"Great food, beautiful atmosphere, Fayzul was a great waiter. Get the chard or Pinot pairs great with the spices."}
{"text":"You are in for a very special treat if you go to Le Taj for their lunch buffet. For a  very reasonable $16.99  you will have your fill of a most delicious variety of freshly prepared Indian food from appetizers to deserts.  The ambiance is cheerful and friendly with Indian decor, attentive waiters, and sparkling white starched linen. Go and enjoy!"}
{"text":"We went for the lunch buffet.  Overall, it's a reasonable price at $14.95, but the food is nothing special and generally short on the spice.  The tandoori chicken was dry.  The butter chicken was pretty good but the sauce was a bit too sweet for our tastes.  Out of the three meat dishes, the curry beef was the best - could have used more curry flavor but the beef was pretty tender.  The curry mushroom and peas was good.  All the desserts were pretty good although the honey doughnut was too sweet. I'm also taking a star off for the service.  The waiters were good at timely removing used plates, but we had to ask for our drinks to be refilled.  When we paid the bill with large bills, the waiter did not return our change and presumed that the entire change was tip.  This was a huge no-no in my book."}
{"text":"I am in town on business and I was looking for a great Indian restaurant the bellman at the hotel suggested Le Taj. From the moment I walked in I noticed a great atmosphere, full restaurant and everybody seemed to be enjoying their meals. I had a momentary wait at the bar before being seated I was able to order a martini and it was at the table shortly after sitting down, my drink was perfect. The waiter took my order I asked him for a dish that wasn't on the menu (chicken madras) but he was happy to accommodate it extra spicy like I like it.  The food and service was outstanding I would definitely recommend this restaurant to anyone who is looking for authentic Indian food. I spoke to the owner on the way out and let him know what a great job he's doing he said he's been doing this for 30 years, his experience certainly showed in the wonderful food he delivers. Happy eating."}
{"text":"Le pain naan était dur et brûlé, le riz me semblais très banal. J'ai pris une entrée avec les trois choix (les ognons bhaji étaient très bons) Je suggère de prendre un lassi à la mangue. Je donne 2 étoiles sur 5 mais je ne crois pas que mon choix représente vraiment le Taj; j'ai pris que des plats végétariens."}
{"text":"Absolutely love this place! Very tasty food with tons of options to choose from. Very authentic and not too heavy/oily. Great service too!"}
{"text":"Best Indian food I have had! Vindaloo is so spicy! Loved it! Staff were very nice, but kinda slow... Had to ask three times to end the meal etc...."}
{"text":"Excellent lunch buffet. I don't think there is a strict dress code but be dressed business or smart casual or you may feel under dressed. Delicious food. Seating is a bit crowded."}
{"text":"The food was awesome and had a number of vegetarian options. We went for the lunch buffet and were very impressed."}
{"text":"Very nice restaurant, food is palatable and portions are moderate therefore you will leave with a gratifying feeling after you leave.  I recommend it."}
{"text":"I loved this place. I split the Valentine's Dinner for 2 menu which meant I tried a lot of food and must say it was all delicious. They made the menu all vegetarian for me easily and the service was very good as well. The sauces that come as a garnish complimented the appetizers well. Don't miss the pistachio ice cream as a dessert! It's great and helps you digest all the delicious Indian you just ate."}
{"text":"The service here was fantastic, although it wasn't a busy time when I had come in. When I was here, I only ordered take out. The server was friendly and very prompt in greeting me and helping me with the menu. I ended up ordering the Saag Lamb, which was delicious! It did not take long to be prepared, and during my wait, the server made sure to ask if I wanted any water and what cutlery/plates I needed with my take-out.  The only thing that's keeping me from coming back is the price. It's a bit too expensive to eat here often with my college budget. It's conveniently located near campus, though."}
{"text":"awesome food and good service. it's little too heavy on the pocket but it's worth once in a while.."}
{"text":"Incredible experience: the menu is diverse, the flavors complex and the garlic naan phenomenal. The renovation makes the atmosphere that much more enjoyable and I have had solid service every time I've gone. Highly recommended."}
{"text":"Ordered the Fish Amritsari as an appetizer and shared the Saag Paneer with rice and naan. The dishes each had a nice flavour and weren't saturated with an excessive amount of oil. Compared to many other Indian restaurants, I was very satisfied with the cleanliness of the room.  Price is decent for Downtown Montréal."}
{"text":"During lunch time, this place offers a 20$ buffet and it is one of the best places I've gone to! I come here at least 3 times a month and it never fails to amaze me!"}
{"text":"Was taken here for my birthday today. MOST AMAZING Indian food I've had in a long while. So much food!! Taking two doggy bags when we leave (two of us) and dessert hasn't even arrived. We did the 40.00 menu and its just awesome! Atmosphere is great and clean. We got the best table in the house it seems. Super friendly wait staff. Must come here again!!"}
{"text":"Good environment and service,good location which is easy to find,their Naan is highly suggested!"}
{"text":"I've been meaning to try this place for ages, and finally got around to reserving for two on a Friday night.   First of all, this place makes Ghandi in the Old Port look like a piece of shit.  The ambience is very elegant but restrained at the same time - tall ceilings, wine tower in the middle of the restaurant, tablecloths, and cutaway windows to the kitchen framed in patterned metals. Beautiful! There's even a bar near the entrance you can relax at before or after eating.   Service is first rate. The waiters are professional, attentive, and friendly. So polite, just like in India! Food comes out quickly and it's bloody good. We tried the lamb vindaloo (excellent), chicken xacutti (never tried it before and loved it), a few vegetarian dishes (all excellent). The dishes, on their own, are on the pricy side - the average meat, chicken, or lamb dish is around $20 or even more, but the quality and presentation is top-notch. The best bet is the table d'hote - $38 a person gets you a soup, appetizer, main, vegetable dish, dessert, and coffee. You can't finish it and have to roll out of there. Absolutely worth it.  The wine list, as someone alluded to, is limited but all the staples are represented. Furthermore, it's dirt cheap. Half of them are in the low $30 range, so what's the problem?   Dessert, by the way, is phenomenal. The gulab jamuns are the best I've ever tasted.  A new favorite for high-end Indian - definitely the high-water mark."}
{"text":"Average Indian food and very overpriced ... Nice ambience . Good for a date although Indian food in general is not really recommended for first dates ;) Good for business dinner or lunch ."}
{"text":"Very good Indian food, large variety of dishes, friendly staff, and very reasonable prices. The naan is some of the best I've had.  My only complaint is that I asked for my food very spicy and it wasn't terribly hot."}
{"text":"Pathetic service... not going again. The servers lack courtesy and will leave you hanging. The owner talks the big talk lacks walking the talk.  All in all too little for too much..."}
{"text":"Over rated resturant.. if you are looking for indian hospitality, then this is not the place. I tried this place today, after giving me place to seat no one bothered to check if everything is fine, i need something...food was just ok.. limited items ..like many other indian i dont eat beef , i did not had any non veg curry in main course.. surely not going to try again.."}
{"text":"Le Taj is the best Indian restaurant in Montreal downtown. They have an excellent selection during the lunch buffet. We were highly satisfied with all the dishes. Everything was freshly prepared and with the right amount of spices. Not only Indians will like it, but it will satisfy non-Indians as well. I will go back and highly recommend it. Staff is good."}
{"text":"The decor is beautiful. Service good. Food could be more flavorful. Not worth the $$ ."}
{"text":"Ambiance feutrée! Service efficace! Du choix! Un bon repas du midi entre collègues ou amis!  Le cadre: Intérieur plutôt joli. Pas très spacieux. Pas trop bruyant.  L'accueil: Équipe très professionnelle. Aimables. Cela manque un peu d'échange intense. C'est sûrement le service soutenu du midi qui génère cette distance.  Plats et prix: J'ai testé le buffet du midi à $15 + un verre de Lassi à la mangue : salade fraîche, soupe de lentilles, samossas, pains naan (miaam), poulet au beurre, plats de viande et du kheer. Bon repas du midi. Manque de saveur plus relevée mais pour le midi en pleine semaine, cela ne m'a pas gêné. Rapport qualité prix vraiment Correct pour un buffet dans ce cadre. Conseil: Réserver, c'est mieux :) Conclusion : J'y retournerai le midi pour retrouver des collègues. Pas pour discussion d'affaires. Et en douce compagnie, j'y retournerai bien un soir en début de semaine..."}
{"text":"really nice and attentive staff, so so food.  chicken vinderloo was spicy good but chicken was dry.  the butter chicken was creamy but not very tasty"}
{"text":"Amazing service, waiters were very helpful and super friendly. Food was cooked to perfection and not to mention- BEST nan bread!!!!"}
{"text":"The food here was wonderful!  I enjoyed both a buffet lunch and a vegetarian Thali dinner.  The four stars here is because it just didn't have that something special, but it was undoubtedly a worthwhile restaurant, and I would return again!"}
{"text":"Bonne carte des vins, pas mal de plats vegetariens, service prévenant, bel endroit en soirée, ideal pour un dinner en tete à tete.   Le soir il semble prudent de reserver, nous avons eu un peu de mal á obtenir une place."}
{"text":"I went here two times during the week for the buffet at lunch time.   I really enjoy this place because of the variety of Indian food you can find. Meat, fish, vegetables, all your friends will find something to their taste! Plus, I feel like the dishes are well seasoned: you are not crying your way through the meal, you enjoy the spices. This is certainly something you don't get in all Indian restaurants. I also really like their deserts!   The waiters are also very friendly and polite. The second time we came, we arrived ten minutes before they closed the buffet. The waiter who welcomed us in told us we could stuff our plates and he even gave us an extra plate so that we could take as much as we wanted. This is super fun, especially since it is a really nice restaurant.   I definitely recommend trying it out during the week at lunch, because of the price range: excellent food, service and nice and clean decor and place. Try it out :)"}
{"text":"Good food but very expensive (rice and nan bread are purchased separately). Quite small portions also for the price. We went on Friday evening. Reservation is necessary."}
{"text":"I came here and tried the 5-course set tasting menu and was very pleased. For 36$ you chose one soup/salad, one starter, one meat dish, one veg dish, and one dessert. The menu had a dizzying array of choices so I requested the waiter to choose for me a set of dishes best representing the restaurant - with a request for spicy.   The first dish was a lentil soup with a clear base and very spicy with coriander. A nice taste to set the tone for the meal, hearty and warm. I requested spicy and they obliged with this dish - which was the most spicy of any dish served.   The entree was garlic shrimp. This was a miss for me. The sauce combined with the breading on the shrimp ended up being a mushy mess with a strange consistency. The shimps themselves were nicely cooked once you got through their soggy exterior   The veg and meat dish were served together. The meat dish was a very nice lamb vindaloo. The lamb was tender and very flavorful. The vindaloo curry was excellently spiced and not too greasy. I do wish it was a bit more spicy though. The veg dish was another lentil based dish with saffron, coriander, and garlic. A nice combo, but the taste could use some more pop. As a pairing with the lamb vindaloo it was good, but on its own I would find it a bit bland.   The waiter picked an excellent progression of dishes and the tastes went very nicely together. The service started as a bit indifferent, but warmed up over he meal with my waiter. Another waiter stood in for the dessert order and we were back to the indifference again. The decor of the restaurant is pleasing and would be a pleasant place for a group of friends or a date."}
{"text":"This place has a great Indian lunch buffet.  The food is quite good, but I'd only rate it average when compared against other Indian places I've been to."}
{"text":"Service was friendly and prompt. The meal; delicious. Butter chicken, aloo gobi, shrimp dish, lentils and naan; all cooked to perfection."}
{"text":"The Best Indian Food in Montreal and authentic to boot. I would recommend coming here for the weekend open buffet (12-2pm) pile your plate high with the 7-8 to dishes they have on offer grab a couple of slices of naan and some pekora and indulge. A la carte meals will cost you a lot more than the 12$ buffet but you get a large selection of authentic Indian dishes."}
{"text":"My first trip to Montreal, looking for good Indian food, so here it goes:  This place looks good inside, I think it is expensive but the food was good.  We ordered: a) Chicken Vindaloo - Excellent and the chicken was really good, it was not some kind of processed chicken.  - I will give this an 8/10  b) Lamb curry - Really nice, I give it a 7/10.  c) Plain Nan - I haven't had this good in a big while. This deserves a 9/10 baby!              - In Concord, NH, in early 90's there was an Indian restaurant who made some real good nan, but that guy moved someplace.  d) Chicken Tikka Massala - Massala (gravy) was good but the chicken was processed chicken, not tasty at all, my recommendation don't buy it.  On the whole, food was good and therefore made one more visit before leaving back for USA.  Note: Chicken Tikka Massala is so common in USA and I can't understand why people don't see the difference between processed chicken and real chicken!"}
{"text":"Awesome restaurant.   We showed up without a reservation and they seated us without issue.  The food was awesome. We had the the Keema Matar and some other dish, plus and appetizer and it was awesome  Waiter was really good"}
{"text":"Delicious Indian food...meat and chicken were very tender and juicy...friendly and fast service...highly recommended"}
{"text":"Very nice decor with high ceilings. The chicken saag was excellent as well as the salmon in a coconut masala xacutti sauce, so good! Bindi/okra was way too salty so we wouldn't order again. Really delicious and flavorful dahl/lentil soup! Good service."}
{"text":"C'est bon signe, le restaurant est bondé de monde pour le party de Noël.   J'ai commandé le repas spécial à 40 $.   Une soupe ou salade, une entrée, un plat de viande, un plat de légume et les nans et riz.   Comme je suis seul, je mange au bar car la salle est pleine. Le serveur est formidable; je suis choyé !  La soupe Mulligatawny est exquise. L'entrée poulet tandoori est très copieuse et excellente.   Puis poulet Korma, champignons et pain maman.   Excellent, je suis rassasié et je recommande sérieusement ce restaurant."}
{"text":"I visited Le Taj for their lunch buffet and really enjoyed it. It is close to McGill and the dinning area is very nice. It is suitable for a business lunch or a nice date. The buffet was very diverse and the food was really good. Lots of vegetarian options, which is important for me. The only downside is that it was a little expensive for Indian food."}
{"text":"probably the best gulab jamun i've ever eaten. they were pure fried-and-soaked-in-syrupy goodness!  the rest of the buffet was perfectly good, but not outstanding. naan was rather sweet. the biggest downside was the scope of the buffet- on a sunday afternoon they had 2 vegetarian entrees and one meat entree (plus daal, tandoori chicken, salads, and the naan). that may sound a bit whiny, but it was a bit disappointing as around here we tend to see more variety at indian buffets :)   service was very friendly."}
{"text":"C'est là que j'ai découvert la cuisine indienne. Lors de ma première journée de travail à Montréal, il y a de cela bien longtemps (LOL!), mes nouveaux collègues m'avaient invité à luncher et j'avoue que j'étais un peu hésitant lorsqu'ils ont proposé un restaurant indien. Je ne connaissais rien de cette cuisine, je ne savais même pas à quoi ça pouvait ressembler, bref je me préparais à faire un plongeon dans l'inconnu et j'avais un peu peur de passer pour un idiot. Mais, comme pour certaines histoires d'amour, qui débutent parfois avec la peur de foncer et les inquiétudes reliées aux déceptions potentielles, mais deviennent passionnées et éternelles par la suite, mon premier contact avec la cuisine indienne a été un véritable coup de foudre. Et le coup de foudre a laissé place à un amour qui est resté. Et quand je veux me rappeler de ma première fois, je retourne inlassablement au Taj, où j'y redécouvre avec joie toutes les qualités que j'avais trouvées à la cuisine indienne lors de notre première rencontre."}
{"text":"Outstanding atmosphere and zesty foods... Best part?  The pricing is really satisfying"}
{"text":"Good restaurant, if looking for an Indian restaurant with up-scale ambience. The food is good but nothing to die for."}
{"text":"I really do not like to leave negative reviews but I have no choice I guess when I do not get good value for my money which is fair.  The two stars are for the fact that the restaurant is clean and it was a good ambience when we were there. I was disappointed though with the service and more with the food. I ordered my favorite Indian dish, butter chicken. First the portion was small for the price they are charging and worst part it was tasteless. There was no kick or a rich flavor in the sauce at all. Their front staff need to smile a bit more.   Despite the fact that it is conveniently located in downtown and it is a clean place, I do not think i will it a second chance."}
{"text":"They have an extensive menu, and there are many vegetarian dishes.  They even serve beef, which is unusual for Indian restaurants.  I'm not at all happy with the fact that the dishes do not come with rice or nan... all you get is a bowl of whatever is described in the menu.  They are already on the pricey side and you don't even get a complete dish... No one is going to eat a spicy saucy dish without rice and/or bread.  They know this, and sell them separately to make it seem as if the place isn't as expensive as it is.  I had the dahl chicken (lentil chicken) which was described on the menu to be a \"healthy dish.\"  However, it was positively swimming in oil, which I did not appreciate.  The flavor was good.  Also, the nan came to the table so greased up that I had to send it back for a fresh and plain nan.  Then it was very good.  A friend had the lamb bhuna, and there were a couple of really tough pieces in there.  The flavor was good/average.  The chicken tandoori was really good and flavorful.    What I do like is that when food is ready, the cook rings a bell so that the waiters know to come pick it up so that it isn't cold when brought to the table."}
{"text":"One of my preferred Indian restaurants in Montreal. I recommend getting Naan with a variety of curries to share among the table. Mix it up: lamb, beef, chicken, shrimp. Service is consistently strong. I've only been there at dinner, but I know it's popular for the lunch buffet too."}
{"text":"Went with a group of 12 and they were very accommodating.  After some discussion they set out a series of dishes to satisfy everyone.  The food was excellent, the service was attentive and we came in under budget so the prices were very fair.  I would certainly recommend.  If you want hot ask for very hot as they tend toward mild..."}
{"text":"The food is authentic and tastes fresh. This place scores points for its ambiance, very relaxing and with lots of nice touches like traditional lamps lit on the table, well-thought out decoration and soft music.   The major downside here is the price. Expect to pay about $25-30 for a decent meal, excluding starters, dessert or alcohol. I'd recommend taking a close look at their menu and prices online before going."}
{"text":"I sometimes go to Le Taj to enjoy their buffet. Had brunch here recently, it was quite satisfying except smelly lamb curry, frozen shrimp+green pepper in light sauce & watery sour daal soup. However, liquid smoke in tandoori chicken was a big no-no. Pakora was too dry, not flavourful according to friends. OK service."}
{"text":"I've only been to three or four different Indian restaurants but I've liked all of the ones I've been to and this one was a slight step up above the others.  I arrived a little late but almost as soon as I walked in the waiter was ready to take my drink order and had my beer at the table before I could take my coat off.    I ordered a Thali which included an entree as well as nan, rice, different sauces, and dessert.  For my entree I ordered the Saag lamb which was very good.  I took everything they brought and mixed it all together and ate it all with the nan.  It was an explosion of awesome and way too much food.  I ate until it hurt and there was still plenty leftover.  I'm happy this place was recommended to me, and if I'm in the mood for Indian I'll gladly return."}
{"text":"Excellent indian food.. Must try the Naan.. Reminds me of Delhi"}
{"text":"Way more expensive then I expected with $$  more like $25 a dish then add some rice or naan. Dahl Lamb was decent,  butter chicken was weird. You can get better Indian food nearby for less then half the price."}
{"text":"Great! Food and service is perfect! The place is very clean, menú has a lot of really great options."}
{"text":"My wife and came to Montreal to honeymoon and after a long drive from  Toronto we wanted some good food.  We first checked with the Bell Hop then  the concierge at our hotel, both rated this place very high.  So we gave it a try.  This place was AWESOME.  Coming from Houston both my wife and I are veterans when it comes to Indian Cuisine, so this comes as a very welcomed surprise.  We started with the samosa, great flavor and it came with a mix or sauces, try to carrot mix, it was tangy and spicy.  Then we ordered the butter chicken with a side of garlic naan and saffron rice.  All were very good, butter chicken was creamy with a good flavor and the rice was a great mix with it.  I also asked for a hot sauce, which they mixed up a sauce for me that had an awesome flavor with a HOTNESS that as too much for my wife, but on point for me.  If you are in the area and want some good food, with great flavor, you must stop in here."}
{"text":"Absolutely delicious Indian food -- we were so glad to have the chance to eat here during our stay in Montreal. I went with one picky eater and one vegan and both were over the moon about the food. We had the Vegetarian Appetizer Platter, Channa Masala, Mattar Paneer, and Chicken Xacutti (along with rice and naan). On top of the food taste and quality, the service was excellent; I had accidentally made a reservation for Sunday instead of Saturday, so when we arrived Saturday night we were not in the list. The owner/manager took a few minutes to move things around and find a table to accommodate us, which was so appreciated. Highly recommended!"}
{"text":"The appetizer samosas were fine (according to my guests), as was the vegetable korma. But the lamb vindaloo was the best I've had. I asked for it to be \"very spicy\", and it was quite hot (not the hottest - which is fine when the ingredients are so high quality). Comfortable atmosphere; very nice interior, and easy to get to - just off St. Catherine. Service was fantastic."}
{"text":"My experience at the Le Taj was not very memorable. The food was not spectacular by any means but not bad either. I had the chana masala with Tandori roti and aloo paratha. The chana masala was watery and not the greatest tasting dish I've had. The breads were ok, not great but just ok.   The service was good.   I don't think I will be back."}
{"text":"Offensive prices for tasteless and greasy food however it's clean comfortable and nice decor  Fennel seeds at the door tasted good though."}
{"text":"I love Le Taj! Definitely my favorite desi restaurant in MTL. I love the ambience. The place has nice atmosphere, amazing staff, high ceiling, well decorated dining space and delicious and decadent selection of amazing items on the menu. On our most recent visit, we ordered lamb biryani, chicken tikka, lamb curry, mango lassi and gulab jamun. I gotta admit that the gulab jamun was the best among the thousands I tried in my last 8 years in MTL, served fresh and warm topped with almonds and pistachios adds a nice balance to every decadent sweet bites. Last but not the least, impeccable service from the staff makes the dining experience unforgettable everytime. Thank you Le Taj!"}
{"text":"This place is packed during lunch buffet, so be sure to make a reservation before coming here!  The ambiance is great, nice decor, but very crowded. The service was alright, but sometimes not very caring (never filled my water), though it was probably because the waiters were too busy serving that many people.  The buffet was very mediocre, it consisted of multiple choices of salads, two appetizers, two vegetarian dishes, and two proteins. I was surprised to see beef and salmon served in an Indian restaurant, interesting.  There are two common problems with their food: they are under-seasoned and unbelievably dry. I had to chug water in between every bites to avoid suffocation. Maybe we went in an off-day, but that's how it was.  Their renowned Naan bread and Tandoori Chicken were big let-downs. The bread was cooked and let inside the container for too long, such that it became rubbery. The chicken was dry, and had no taste at all besides the smell of charcoal.  The salmon really saved the day, it was really moist and flavorful, delicious. The beef was overcooked and dry, because the cuts were too lean, but the sauce was enjoyable and tangy.  Overall, not a bad experience, but I expected more, especially since they were boasting so much with their Tripadvisor awards."}
{"text":"Best Indian food I've ever had. Waiters are super chill and will help you put together an amazing plate. I would suggest getting a table d'hote (comes with unlimited naan) and just make sure you get the Dahl lamb. Love this place."}
{"text":"Let's start with the ambience... Very nicely decorated with sculptures and pictures from Indian history n heritage of le taj itself .  Staff was prompt and very courteous.... Went during lunch hour but still managed to get a table as ,usually this restaurant is very busy n needs a reservation in advance ..... Food was good with quite a variety in vegetarian n non vegetarian items ..... Being an Indian I am very opinionated with the Indian food served at the restaurant abroad ... Well this one is really good ......The sweets (Gulab Jamun or honey balls in English) very awesome and quite authentic .... Wud definitely recommend this place for someone who njoy a Indian food or is making his first attempt for Indian food ..."}
{"text":"The buffet is good... Thought not that many types, but is well enough for everybody! Taste is good, though not that unforgettable XD I find myself in love with Indian food. I went to LE TAJ with two friends, one of them is kind of expert of India:) she explains to us many different names of dishes, and we had a wonderful time there. I especially love nann... I feel like I can go with every dishes as long as there are hot fresh nann:) I didn't try those India dessert, which according to my friends, is very sweet:) will have a taste next time! It's apparently quite a famous restaurant. At lunch time it is full of people, so we have to wait in line to get the dishes."}
{"text":"My husband is from London. And he took me to my first Indian restaurant when I lived there. I loooove spicy food..  since London I haven't been able to find good Indian food anywhere!! Me and my husband tried this place on our first week living here and we were both really impressed. The meat was perfect. The only reason I'm giving 4 stars is because it could have been a bit more spicy!"}
{"text":"Sehr schönes Restaurant mit sehr gutem Service und vor allem sehr gutem Essen. Von der Vorspeise über den Wein bis zu Hauptspeise sehr gut! Bei unserem nächsten Besuch in Montreal sicherlich wieder einen Besuch wert. Reservierungen sind dringend erforderlich."}
{"text":"I was in Montreal on a business trip and we were directed to Le Taj as the \"most excellent Indian Restaurant\" by our hotel's front desk. She made reservations although we walked right over. The atmosphere is upscale, and we were seated by the kitchen where one could see the food being prepared though a large window. I ordered garlic nan, samosas, and chicken curry. I've been comparing Indian restaurants as of late, and this is a go-to dish, the \"control\" if you will.  The samosas were to die for. I am thinking of them still, days after the meal. The nan was brought with the rest of the meal, although we had requested it to be brought with the app. Oh well. The server suggested I order some rice for the chicken curry. Is this a thing? In the States you get the rice with the curry, not as a separate item. I was also not asked what level of spicy-ness I wanted, which again may be a cultural difference.  I would have preferred a little more, as it was relatively mild. (As someone who has to explain to my American friends that Mexican food is not super spicy, this was an odd position to be in.) The curry was still good, however the chicken was too tender. I didn't think chicken could be too tender but yes, I discovered, it can. The nan was fine, but not the garlic nan I had ordered.  The service was incredibly friendly and professional. It was a bit more expensive than Indian restaurants I'm used to, but the atmosphere is more upscale. If I visit Montreal again, I'd gladly go back."}
{"text":"I was in Montreal for a long weekend and came here TWICE for the lamb vindaloo. We also tried the Dahl beef, chicken tikka masala, and butter chicken. Everything is wonderful and this is up there with the best Indian I've had."}
{"text":"Bon indien. Tikka massala épicé pomme vous le souhaitez. A recommander même si ce n'est pas le meilleur indien que j'ai pu testé.  L'ambiance est cosy, lumière tamisée. très bon service: rapide, friendly, efficace."}
{"text":"DELICIOUS FOOD, OUTSTANDING SERVICE and UPSCALE AMBIANCE!  I was visiting Montreal and one of my friend recommended us to try this place and I am so glad we did. It was the best Indian food I have had so far in North America.   Ambiance: We arrived at the restaurant for dinner from all day driving from Quebec and the server was so kind to seat us up right away. We felt little out of place since everybody was dressed up. The restaurant setting was romantic and welcoming.   Food & Service: Our server was very polite and responsive and answered all the question we had. We ordered Veg Thali with out choice of bhindi, Chicken Tikka masala, Garlic Naan and taj beer. Our pakories from thali were served as appetizer which were cripy and delicious. Next served were thali and chicken tikka and Naan. Every ingredient in Thali was delicious and fragnant and had balanced spices inclucing bhindi masala and chicken tikka was spicy and tender from inside. Next served was my tea and Gulab jamun. I asked the server to make tea with ginger and he obliged very happily.  The gulab jamun were very soft and perfectly sweet with the hint of saffron.   Overall, I had Food-gasm while dinning at Le taj and I will definitely go there again on my Next visit to Montreal!"}
{"text":"Was traveling through Montreal and found this place listed among nearby restaurants.  We figured we stop in for lunch.  To our surprise they had a reasonably priced buffet. Being very experienced with Indian restaurants, I had no problem with that. Everything on the buffet was quite good and it was all clearly labeled so we knew exactly what it was.  Service was great and attentive. I would definitely recommend this place to anyone in the area looking for a solid Indian meal."}
{"text":"amazing butter chicken, daal, samosas and naan bread. truly suggest this resto to any indian food lover"}
{"text":"Incredible eating experience. Brothers are the head chefs, their son Sunil was our waiter two days in row - yes it was that good we came back the next night. The restaurant has been here for 34 years and when I came across it, I asked a person and they said \" it is the best Indian Restaurant in MONTREAL.\" it was a brilliant experience, beautiful environment, and I will be back again and again."}
{"text":"Over priced, Basic, Indian food.  Service was excellent.  The food had to much turmeric and Curry, it was overwhelming, however it was not that spicy.   The cost was outrageous for the amount of food you got.  The bar tender was very good, drinks were mixed very well, and were quick.  The Nan was good, however not what I am accustomed to and appeared to be designed to force you to buy three or four baskets for a table.  The best dish of the evening was the Spinach, sautéed and added chunks of cheese. The atmosphere was nice, however it was a little crowded for only having about 30 people in the place."}
{"text":"Went here for the lunch buffet with a few colleagues and was not disappointed. The line ups were huge because it was peak lunch time, but the food was pretty good. They have a nice spread with a good variety of vegetarian and non vegetarian food. For me, the star of the meal was the salmon tikka. It was juicy and nicely done.  Ok, I understand where they are coming from and why they do it, but this pisses me off more than it should - daal isn't had like a soup. I also wish they had a paneer dish. (These two things made me put this 3.5 * place, imo, as a 3 instead of a 4 - I know, so ruthless lol)"}
{"text":"A very nice venue and atmosphere, and the food was served quickly. Sadly the food was really bad. I may have ordered poorly, but mine was bland and luke warm. South Asian food is my favourite, but this isn't it."}
{"text":"The atmosphere is cozy and service is good even though it was slightly busy.  The shahi paneer was sweet and oily, the daal makhani was okay.  We had asked for spicy food, however there was no extra spice added.  For Asian vegetarian palate the food is nothing great as per the international reviews."}
{"text":"A few fellow Indian food enthusiasts and I met up here for dinner. Being poor college students, we went simple and split samosas, two orders of chicken tikka masala, pilau rice and garlic naan. The samosas we nothing to write home about. We ordered one tikka masala spicy, and one mild and they tasted like two different dishes. The spicy one was enough to make my lips burn, but was still flavorful. The mild one was buttery and delicious. The garlic naan was well prepared and fluffy. Having tried four other Indian places so far in Montreal, this was the one I liked the most. I would say that althought the food was good, it was over-priced for the amount you got. Service was so-so."}
{"text":"Another Montreal winner.  Excellent gourmet Indian cuisine. The only thing I'd say that you should consider is that various guides designate it as in the \"$$\" two dollar sign category in terms of cost, and we definitely found it to be a bit pricier, a \"$$$\"  being more appropriate-- but worth it none the less, due to fine taste, great service and welcoming ambiance."}
{"text":"Rating scale: 1 - I'm not coming back here. Even I can cook better than this. 2 - I didn't like the place/food. I may not come back here. 3 - I liked the place/food. I would probably come back here. 4 - I loved the place/food. I'm bringing my friends n family here. 5 - The place/ food was incredible. I would travel to the city just to eat here.  So clearly from the ratings scale above, you can tell that I fairly liked the place.  Decor was nice. Above average compared to the Indian restaurants that you usually find overseas. It wasn't just about a painting of 3 elephants on the wall. The place had a good collection of murals and statues aesthetically placed. Lighting was appropriate. It had a nice open wine cellar and a full service bar.  Food was ok. I say ok because it was catered more to the local taste. Understandably though. After all its about running a successful business. However, if you're an Indian, you may find it a tad bland.  Service was good. Wait staff was courteous, polite and they smiled.  Pricing was fair. I had the lunch buffet for USD20 which included the taxes and 10% gratuity."}
{"text":"Good food! This is coming from an Indian who is a very picky eater and cooks Indian food all days in a week :)  We ordered Aloo Paratha and raita, and Chaat Bahaar ( it had boiled Chana ,potatoes and pakora - less spicy) but accompanied with chutney which makes it spicy :)  Gulaab Jamun was delicious like in India. Perfectly cooked.  Lovely ambience!!  Good servers! Good people :)"}
{"text":"Average experience.  The aloo ghobi was alright.  Beef vindaloo's taste was hidden by the spiciness.  Decent naan bread  Prompt, attentive and respectful staff."}
{"text":"Very delicious Indian food. Chicken, lamb, cal, Nan were all first rate. A bit pricy, but some of the best Indian food. Also , wonderful mango creamy ice cream . Go."}
{"text":"Really sick of this place and its BS. Overpriced, very average Indian food - beautiful decor and that's what you're paying for. Vowed never to go back, broke that today and went for their lunch buffet. Very subpar, cold - asked when we were first seated if we could be moved to another empty table of two in a more desirable spot. The manager/owner type who sat us refused and mumbled that it was going to be pushed together with another table for a bigger group... 5 minutes later he sat another couple in that same spot without issue. Only difference between us and the other couple was the colour of our skin... you do the math. Much better Indian for half the price readily available - AVOID."}
{"text":"Authentic & formal dining but not strict dress code.  Aloo gobi was great & very hot. Great waitstaff."}
{"text":"This place was mediocre. The garlic naan was old and crusty instead of being warm, soft and fluffy. The shahi paneer tasted like a ketchup-cream sauce. The dal was passable but for fourteen or so dollars I could make like a dozen servings of dal ... and my dal is the best!! The papadum and chutneys and pickles were good. The chai was tasteless brown lukewarm water. The rasmalai was mediocre as well. The ambiance was alright.   This is exemplary of the typical, tired and tastelessly bland subpar Subcontinental offerings we have in this city. This is colonial or postcolonial British Raj type of food; not very authentic whatsoever. Surprisingly, little Britain is not the \"motherland\" of Subcontinental cuisines. Indeed, while it may have had, once upon a time, been the seat of an exploitative Machiavellian colonial empire, wee little Britain and the British Indian food that comes out of this tiny rainy island in the North Atlantic, does not in any way reflect the vast and ancient sophistication of diverse flavours and ingredients to be enjoyed among the multitude of ethnocultural traditions and cuisines thereof in this vast subcontinent with over ten harvests annually.   If you're looking for good typical North Indian fare I suggest trying Durbar on Saint-Laurent or Thali on Saint-Marc or someplace on Jean-Talon between Acadie and Parc.   I also implore all lovers of food to explore South Indian and Tamil-Sri Lankan cuisine as well! Try Thanjai on Van Horne or Janani on Victoria.   All the best to you and yours on this epic quest to find wonderful Subcontinental cuisine in Montréal. The truth is out there!"}
{"text":"Never have the thali here. Biggest ripoff. They give you a huge pile of rice and tiny portions of the actual dishes. Order each dish individually instead. Most expensive Indian resto I've ever been to. $20 for butter chicken not including anything else."}
{"text":"Service is friendly and this restaurant is nicely decorated. The food is very oily. The salads, pickled carrots and the hot dishes had a heavy layer of oil. The samosa too was very oily (You can usually tell by the texture). We came for the lunch buffet which was quite pricey. The cauliflower dish and potato dish I think are supposed to be separated but they taste exactly the same. Salads were not replenished and we came around 1:00. I did like the onion bhaji and the naan. Also, gulab jamun was one of the best I've had, however the rajma, the cauliflower and the potato dishes were okay but not very flavourful. The potato was not very tender and could have been cooked for longer."}
{"text":"Lunch buffet is 16.95 CAD and after adding tax, it's about 19.50 CAD.  For the price, it's not the best but you get good fluffy naan, tandoori chicken, butter chicken, lamb curry and a few vegetarian items.  Flavors of dishes were OK but nothing was spicy so if you are craving spicy Indian food, ask something a la carte.  Friendly/attentive service.   PS: Free wifi available. ask for the password."}
{"text":"Came for the lunch buffet and thought it was excellent. Much classier than the majority of Indian buffets, but also more expensive."}
{"text":"I went to Le Taj for dinner last night. First, I loved the decor - it's very simple, with lots of brass sculptures of Hindu deities. No complaints there. The layout is good as well, with tables being spaced apart such that you don't feel like you're dining with your neighbors.   The person who I assumed was the host, was not friendly or smiley. He barely acknowledged us when we arrived and when he showed us to our table.   Our waiter was OK but not great. If I ask you whether or not your Shrimp Tandoori is excessively salty, you should be able to answer my question - I mean, you work there. If I'm asking about the shrimp, it's because I want shrimp - don't recommend your most common dish (butter chicken) assuming I've never had Indian cuisine before.   We ordered the vegetarian plate to share as an appetizer; I must say that there wasn't much on the plate. One samosa, one onion Bhaji, one Aloo tikke to share between two people. As this was an appetizer, it's not that big a deal that the portion was that small, but I've had samosas at other restaurants that were bigger than the three appetizers combined. Just saying. That said, each item was flavorful and we enjoyed them.   I ordered the Bhunna shrimp (green peppers, onions, spices, tomatoes). I wasn't crazy about the dish; there were 6 shrimp in a tomato-based sauce with LOTS of onions. The shrimp were a bit tough and chewy, and on the small side. The sauce was OK but something was missing. As a side, I ordered the Pulao rice (Basmati with onions, green peas and saffron) - I found it lacking in flavor and a bit dry. I wasn't expecting the rice to be incredibly flavorful, but I was hoping for something.   Where price is concerned, the appetizer and rice were decent at $7 and $5 respectively. However, the shrimp dish was $19, and I found this to be too high for 6 small shrimp that weren't cooked properly."}
{"text":"Good service and overall good environment. Appetizers were delicious but main entrée food was bland."}
{"text":"We got to visit this restaurant while we were in Montreal. The location was easy to find, and luckily we were able to find parking as well. It's located on a small street, which doesn't have much parking near by. The restaurant does require reservations for large groups. We had about 6 people with us as we walked in, not knowing about reservations we asked to be seated. The manager had told us he would have to see if we can be seated. At this point we were a little disappointed. But he came back with good news and seated us at a table. The menus were designed in a old fashion, which made the restaurant unique. The food was delicious and had just the right amount of spice. As a person from a Indian background, I was pleased with the food. The restaurant was clean and well maintained. I will definitely be going back when I'm in Montreal!"}
{"text":"Good service and quite a variety of dishes.  I was amazed with the beef curry.  The meat was so tender I had to have it twice.  I was less impressed with the watery looking and tasting shrimp dish.  The chicken tandoori appeared dried  out.  The price is a bit steep at $17.95, but I was overall happy with what I received."}
{"text":"I have been to more than my share of Indian places.  By far best, naan and chicken makhni I have ever had.  EVER!!!  Okra was just okay.  But the makhni and naan were incredible.  Would suggest closing with either the kulfi or ras mali.  So good.  One final tip, ask for medium Indian spicing, not spicy - flavors are deeper than their standard fare.  Naan so fluffy.  So delicious.  Sorry - reminiscing."}
{"text":"Un excellent restaurant.   Le cadre est très beau, simple, tamisé.  Les serveurs sont aimables et rapides.   Quant à la nourriture elle est délicieuse, j'ai rarement eu l'occasion de manger de si bons nans, faits en direct derrière la vitre par les cuisiniers !  Une très bonne soirée !  Petit conseil : réservez peut être, j'y suis allé et c'était plein, on a réussi à avoir une table par chance mais ça semblait impossible en arrivant !"}
{"text":"J'ai tenté le buffet récemment. Il est correct mais à 17.95, sur l'heure du dîner, c'est plutôt très cher pour ce que c'est. Si le prix avait été plus sympathique ( genre 11.95 )  je serais allé pour 3 étoiles... mais pas plus car il n'y à quand même rien, qui à mon palais, vaille le détour dans ce resto, dans le cadre du buffet du midi ou je suis allé tout au moins. Cela écrit je ne comprends par l'engouement pour leur pain naan, que je n'ai pas du tout apprécié alors qu'autrement j'apprécie bien les pain naan."}
{"text":"C'est la quatrième fois que je vais à ce restaurant. La première fois, c'était un midi, donc j'ai testé le buffet. Pas mal. Les trois dernières fois, c'était le soir en bonne compagnie.  L'atmosphère du restaurant est plus romantique le soir :) Dans le restaurant, on peut voir le cuisinier en train de faire tourner la pâte des pains naans à travers une grande baie vitrée ! D'abord, leurs pains naans sont excellents et bien sûr frais. J'ai un faible pour celui à l'ail. La première fois, nous avions pris des plats un peu trop épicés, c'était de notre faute mais c'était très bon. Les plats sont gouteux et leurs différentes sauces sont succulentes. La carte des desserts n'est pas très fournie mais j'aime bien leur semoule particulièrement.  J'y retournerais juste pour leurs pains !! Modification de mon avis : La quatrième fois, j'ai pris une entrée \"assiette non végétarienne\" et ma conjointe une assiette végétarienne. La salade n'était pas fraîche, le reste était correct. Les plats étaient toujours très bon. J'ai pris une boisson \"un lassi à la mangue\", un mélange avec du yogourt et de la mangue, très bon. Finalement, je trouve le rapport qualité prix pour les entrées uniquement un peu élevé. Récolte un 7.9 au lieu d'un 8.2/10 auparavant. On perd donc une étoile :( Juste travailler la décoration des entrées et ce serait parfait :)  Mes notes : Ambiance : 8/10, Service : 8/10, Nourriture : 7.5/10, Propreté : 9/10, Rapport Qualité prix : 7/10 Ma note globale : 7.9/10"}
{"text":"Le Taj is all glitz and glamour without the authenticity or flavor of India. One of the few white napkin Indian restaurants in the city, it is a facade made for people who don't know what a real curry should taste like. Sure if you want to impress your in-laws, take them to this bougie restaurant in the middle of downtown, but don't try and impress someone who knows anything about Indian cooking here."}
{"text":"Service was good, food was ok, prices were high.   I enjoyed the items on the vegetarian appetizer plate and was happy that they were served with the traditional chutneys. However, the staff should explain what the chutneys are to those who are potentially unfamliar. Thankfully my mother, who does not like spice, did not put mint chutney all over her appetizers!  We shared the chicken tikka masala and the lamb korma along with rice and naan. Granted we requested mild (for my mother), but I found the food to be lacking in flavour. And I HATE paying extra for rice.  I know the restaurant is downtown, but prices seemed high for the quality of the food."}
{"text":"If you are looking for real authentic Indian food, this is not the place to go. India is known for its rich spices and this place was just lacking it in every aspect. Not only was the food tasteless but the over priced bill leaves a more bitter taste. The place is a complete tourist trap. This was not worth the 60 min wait. The only good thing was it's closeness to our hotel which turned to be our undoing"}
{"text":"Please, No!  I must first start by saying that I did see a few bad reviews and I should have taken heed. Indian cuisine is normally layered with flavours, however you will not find that at Le Taj. We went for Sunday buffet \"just in case\" and I'm glad we did not order from the menu. Two buffets and 2 drafts came out to be 55.00. ???? There is absolutely NO flavour in their food.  I'm not talking about hot/spicy I'm talking about the normal spices you find in all authentic Indian dishes. If you want spicy do not even WISH that you will receive anything remotely close, even if you ask for an addition. Their suggestion is a carrot/oil mix which has no spice and has the distinction of canola oil. No lime pickle, or methi on the menu. Everything from the buffet was cold. Even though we only had a few bights we had indigestion for hours afterwards. Don't go if you like flavour or authentic Indian cuisine."}
{"text":"Awesome atmosphere.  Super-duper atmosphere.  Okay service.  Okay Indian food.  Great location."}
{"text":"Excellent Indian with something for everyone. Halal meat for one colleague. Vegetarian options for another, and a fantastic meatfest for another my third colleague and me.   Great and attentive service. Particularly as one cleague needed to leave for a late-night call and the kitchen hurried his order through allowing him to enjoy while remaining on time.    When my Indian colleague told me that this was the best Indian food he'd had outside of India, I knew that my enjoyment of it wasn't due to not knowing the cuisine well.  I will definitely be back."}
{"text":"Nourriture incroyablement bonne, pour 40$ vous pouvez avoir une table d'hôte à 5 services et +, menu très varié pour tous les goûts. Tous les plats de ma table d'hôte étaient délicieux. Bon service... Il y a un buffet à 15$ le midi que je n'ai pas essayé! Un must au centre-ville de Montréal!"}
{"text":"Good deal for a quality lunch buffet, but some items didn't impress.  Not a bad option overall, though.  Food - generally good, although the tandoori salmon and beef curry were bland and dry.  Great, fresh naan.  Service - not much to say here as it was a buffet, but drink refills were quick.  Atmosphere - clean, bright interior with a chatty lunch crowd.  Price - less than $20 per person."}
{"text":"Excellent quality Indian food, little pricey but well worth it.  The service and staff were super nice and welcoming, can't say enough about the staff.  The food was delicious! We each ordered the feast to save a few dollars and it was an awesome amount of food. The Naan bread was to die for!"}
{"text":"Authentic Indian food prepared the way it should be. Great flavors and excellent service!"}
{"text":"Great buffet, great Service, great Indian food and a great selection. Overall a great experience. I absolutely adore the all you can eat buffet, probably one of the best all you can eat Indian food buffets in Montreal.   If you like Indian food and your are in the Montreal area its definitely worth a stop."}
{"text":"Decent lunch buffet.  My Montreal contact told me it was a place for a quick & \"cheap\" lunch, so I am assuming it was a good price, but it still came up to be about double the Indian lunch buffet in Seattle.  Food was decent.  Service was slightly on the slower side, but then, it's buffet, so we didn't need a whole lot from the servers."}
{"text":"Le buffet du midi est un peu cher (autour de 15$), mais le restaurant est agréable et la qualité est au rendez-vous.  C'était la seconde fois que je visitais cet établissement du centre-ville et j'ai aimé mes deux expériences. Mes plats favoris ont été la soupe Mulligatawny, la salade, le cari de boeuf et le dessert... Des Gulab jamun que j'arrose de kheer!  Un peu déçu qu'il n'y ai pas un plus grand choix de chutney ni de papadum. Par contre ils servent un assez bon masala chai (en supplément).  Petite anecdote, le restaurant s'appelle \"Le Taj\" (en l'honneur du Taj Mahal, j' imagine) et le pire repas que l'on est mangé en Inde était précisément sur le site du Taj Mahal! C'est mieux ici, mais pas aussi bien qu'à l'hôtel \"Taj\" à Mumbai (aucune affiliation)."}
{"text":"Really good Indian food. It was so busy when we went that we had to sit near the kitchen, which was very busy. It didn't bother us though, since the food was tasty and left us very satisfied. The decor is average and the service was good."}
{"text":"A perfect combination of reasonable price, tasty food, and friendly service."}
{"text":"Okay, but nothing to rave about.  And, their Amritsari fish wasn't really Amritsari, nor was their chaat very good.  Also a bit too pricey for not anything special Indian food.  I'm not from Montreal, so not sure what the residents of the city have to compare it to."}
{"text":"I ordered take-out from Le Taj in Montreal the other day. I was in town for a week and was staying next door at the Ritz-Carleton. Their online menus had no prices and the girl on the phone said \"it'll be about $20.\"  I ordered one order of butter chicken. I got an individual white rice and naan bread with it. When I went to pick it up, it was $29 - that's with the 15% take-out discount.   When I got back to my hotel room, I was expecting this to be the best Indian food I had ever eaten. It wasn't. I'm sorry? $30+ for one portion of flavourless butter chicken that was mediocre at best?.. Quite a rip-off.   Luckily there are many Indian options in Montreal, this one certainly won't be on my list next time I'm in town."}
{"text":"My sister and I were wandering, trying to find something great for dinner and a shopper recommended Le Taj. It ended up being very good! We ended up ordering an appetizer, naan, and entree to share and it was plenty between the 2 of us.  So glad to have found Le Taj as we struggled finding interesting places in the downtown area within walking distance from our hotel. And not too far, because it was freezing cold in  Montreal!"}
{"text":"My number 1 restaurant, the food is to die for! I recommend the tablr d'hôte with extra dish if youre two! The ambiance is super romantic perfect for an anniversary or date!!!"}
{"text":"Le Taj had one of the best Indian buffets of my life, and it was definitely the healthiest Indian buffet I've ever had. They had five or six vegetarian options on the buffet, and the meat options were good too.  Everything was really flavorful and nothing was greasy at all. Even the desserts were good, and they had a decent number of options.  I left feeling really full, but not bad about myself and not in need of a nap, which is usually an issue with Indian buffets.  My only complaints are that nothing was very spicy, and the masala tea was just weak tea with spices, and you had to add creamer to it.  Service was decent, and they were good about replenishing the buffet with fresh food.  I would definitely go back."}
{"text":"Ambiance was excellent (don't miss the decorations), the wine selection was super, and the food compares to the best restaurants in Montreal (of any type of cuisine).  Our selections were best quality, from the appetizers, through desert.  Breads impressed us (my wife and I are both bakers), the mango lassi is prepared with housemade yogurt and the entrees (do you still have room?) were wonderful.  This is an oasis in the business district.  Service is excellent, and if the table seems a bit small, it's only because you ordered too much food.  (smile)  Enjoy."}
{"text":"Chicken tika, salmon tika... dry, naan... dry. Beet salad ,potato salad , chopped cucumber & tomato salad ...very good. Like their mugawaaly(sp) soup, basmati rice,    Indian style rice pudding, shrimp in spinach (yum) & Indian beer. Overall not bad for $12.50 buffet.Service good, place looks more  upscale since the renovations a couple of years ago. The lunch buffet in now $17.95 (2016)."}
{"text":"We ate dinner here on 23 July 2014. We love Indian cuisine, and when ever we are away on vacation, we try to find a good example. Le Taj was the right choice!! It was very close to our hotel on Boul. de Maisonneuve which was very convenient. We were greeted warmly by a gentleman who also happened to be our server. He gave us a choice of tables, and we chose the one by the window to the Tandoori clay oven. This was a special experience, because we could watch the chef prepare all the wonderful delicacies. We ordered a few things to share: Beef Vindaloo, Vegetarian Appetizer Platter, a coriander shrimp appetizer ( not sure of the name ) and Garlic Naan. The star of the meal was the Naan. Potently flavored with fragrant garlic and ghee, it was a delight! The Beef Vindaloo, although \"medium\" was too hot for us, but still edible with lots of rice and raita. The Vegetarian platter was very good as well, although the Aloo Tiki was a bit dry. But the Samosa and the onion fritter was perfect! The shrimp appetizer was special: Delicate flavors, perfectly cooked shrimp, and crisp greens. Delicious! The service made eating here really special. I started off with a chai before the meal came and told the server I would have my glass of Sauvignon Blanc with my meal. He waited until my tea was empty and then graciously poured my glass of wine. Very polite and attentive service! They did not rush us at all and let us enjoy every bit of the meal! For dessert we had Gulabjamun and some other cottage cheese delicacy which was delightful! Overall an amazing experience!"}
{"text":"OK, the last night in Montreal we were exhausted and wanted to eat nearby.  We couldn't decide where to eat so we tried Le Taj on the theory we wouldn't eat as much- boy were we wrong.  We started with the Salad Katchumba,  which was very large so it was a good thing we split it.  I ordered the Chicken Korma and it was outstanding, as good as our favorite restaurant.  My Husband ordered the Lamb Vindaloo which was SO hot.  I tried it but it was too much for me.  My Husband, however, loves hot food and he really liked it.  I had a glass of the Pinot Grigio which paired perfectly with the spicing of the meal. For dessert I had the Halwa \"cake\".  It was nothing I expected, texture was sort of like couscous, but the flavor was outstanding.  The tab was $92 and worth every penny as the meal was outstanding."}
{"text":"\"Cuisine indienne\" as its called in these parts, was a something I was craving for badly during one of my last trips to Montreal. Already a city filled with so many ethnic options, Taj was literally the closest Indian place near our hotel. There are almost always questions for me before I head out to a new place: Is it local? Who goes there? What are the prices? How is the food? etc. Without consultation of my group due to my affinity for Indian cuisine, I immediately set forth for Le Taj and never looked back.   It so happened to be during their lunch buffet hour, which at that time was priced at $12.95. Even before the clock struck noon, the place was crowded enough to warrant a wait for 4. While I waited I noticed how clean and modern the restaurant was. Some gourmet Indian establishments prefer the maharaja palatial look, where as Le Taj was simple, elegant, and sophisticated.  The buffet was wonderfully presented. Everything from the serving spoon to the trays they were served in were immaculate. There was a service person on hand to wipe away any immediate spills and adjust items if they were put out of place. I thought the job was a bit tedious and unnecessary initially, but it really does make a difference for how people perceive lunch hour gluttony in buffet form.  There was an amazing slew of options, with an adequate veggie to meat ratio along with some stellar desserts and sides. All of this food was presented in an open window where someone in the back was baking fresh naan (to be served table side) and dangling along a skewer was some freshly made tandoori chicken. I couldn't stop eating the fish curry here, it was perfectly flaky, the curry was rich without all the excess oil. I was also a very impressed with their lamb vindaloo, which was a little bit sweet and a lot savory, I went for seconds only moments after gobbling the first go-around. The naan was fluffy and even fragrant; a puffy bit of goodness that was a great complement to the meal. With the exception of rasmalai and burfi, I am not one for desserts, however the mini-grenade sized galub jamuns were as stellar as I've ever had.  Service was quick and professional. They were attentive throughout the experience and were awesome all around. They were also armed with individual credit card machines, which made it an easy process to check out and pay without hassle.  I've been back several times since and I've been quite satisfied each time. The buffet has since surged to $14.95, but with that the options have also been souped up as well. I've eaten some scrumptious veggie dishes (veggie samosa, fried cauliflower, sag paneer, aloo gobi, eggplant) and some excellent meat curries (goat biriyani, sag murgh, chicken makhani), which have all been delicious enough to give this place my blessing."}
{"text":"Food: 4 Chai: 5 +++ Vibe: 5 Staff: 5+++  Just wandered in, craving Indian food. The food was pretty good and we opted for the \"Feast\". Good value, lot of food comes.   The real treat was the chai. Unreal, tasted as good as what you get in India. The servers are very kind too.  Would recommend!"}
{"text":"Extremely mediocre Indian food that was also overpriced given the taste and portions ($25+ for an entree plus naan and rice). I've been to many other Indian restaurants that were priced much more fairly but I will give them credit for the nice decor and ambiance."}
{"text":"Utter disappointment. I had so high hopes for this place. The location is great, the reviews were good, the high prices $$$ suggest a luxurious place. Well, the reality didn't match my hopes. I mean, the location is great and the prices are surely high, but everything else was just my imagination. I will not start talking about the service but about the thing that shocked me most: all curries are 100% pre-cooked. It is basically the same concept as a food court: the food is cooked and they just plate your order upon ordering. So a $16 dish can be very well nothing else than left overs from the lunch buffet... I am not saying it is necessarily from lunch, I am saying that there is a disconnect between a full-service, \"fancy\" restaurant and heated up dishes. To top it off the food seemed extremely heavy and oily (even some food courts are better) the taste was off, and the service was mediocre at best. I will not return."}
{"text":"Dahl Lamb was really good rich in flavor and ingredients. Highly recommended.  Can't say the same about Butter Chicken. It was very poor in flavor and too creamy, almost as a bowl of hot cream with orange coloring with some unspecified non essential meat dipped in it.  Very easy dish yet so disappointing. this dish didn't taste as the real indian butter chicken.  It was an absolute washed down orange cream dish with no spices at all.  I have eaten this dish all over the world countless times and that really is far from the real deal. Absolutely not tasty at all, not fragrant at all. There was no trace taste or smell of :  tomato sauce, ginger, garlic, Indian chili powder, garam masala, dried fenugreek leaves, no chicken taste or any other ingredients that were supposed to be given the dish a traditional spice and fragrance.    Go for spicy dishes with lots of ingredients if you are dining here. It will come out mild anyways.  Good service.  Very high price as for the food we got.  On average with tax you will pay 30$ per dish. ( high tax)"}
{"text":"Excellent food, wine, service, ambiance and artwork. A perfect date night Indian restaurant in the heart of Monreal downtown!"}
{"text":"This was our first experience eating at Le Taj, and we were not disappointed.  Our party of four all agreed that the food was some of the most flavorful Indian food any of us had ever had.  The service was very quick and friendly which was impressive on such a busy night. Our only minor qualm was the serving sizes of each entree. Paying close to $20.00 for a chicken tikka masala dish that only had 6 small pieces of chicken in it and didn't include rice seemed a bit steep. Overall though, we enjoyed our meals and I would certainly be inclined to experience Le Taj again."}
{"text":"Very good indian food!!   If you like yours spicy...you know the kind that gives you a sweat mustache, you must ask them for VERY spicy. I asked for spicy and the heat level was minimal. so, i ended up eating the entire cup of pickled carrots (also, not that spicy)   i get the feeling that people dont eat crazy spicy here in Montreal. Im used to tabasco, sriracha, and chili peppers on everything from ramen to cereal so perhaps my perception of spicy is slightly off kilter.  Really good dishes to try? butter chicken, tandoori chicken, chicken jal farezi, and of course NAAN NAAN NAAN!!! Everything we ordered was very tasty though, samosas, some sausage looking apetizer, chick pea apetizer, rice with shrimp, lamb chops...."}
{"text":"Good healthy indian food without the oil and spice. Natural flavours. A little pricey but fits its niche. Heard the owner has had it for 30 years, thats a lot of work! Cheers."}
{"text":"Came back here recently for dinner. On the pricier side, esp. compared to my fav Curry Mahal, but I think it's worth it as an occasional treat. I just came back here to say that I had the best naan I've ever had at this restaurant. They were fresh, buttery, crispy on the outside, and soft on the inside. I had the vegetable korma and it was delicious (note: rice costs extra). I would highly recommend splitting both a rice and naan order with a friend as you get best of both worlds! (And one of each order per person is a bit much). I'll return again!"}
{"text":"Honestly, Le Taj had some of the best food I ate all weekend in Montreal over vacation.  The service was 5 stars.  We had a few different masalas, and a chicken vindaloo along with some other vegetarian dishes. 4 stars only because we thought the wine selection was not so great.  There weren't many bottle options that were very expensive and the pinot was a Beringer which leaves a lot to be desired."}
{"text":"We came in and had a 30 minute wait but it was worth it. Although it's a bit pricey and the portions are small, the food, staff and ambience make up for it. The mutton and chicken biryani are petty good and the servers make it a point to listen to your specific asks. My brother-in-law was with us and he is a chef (and Indian too) and he loved the food. My wife loved the Keema Naan. Overall, a great choice if you are craving for some Indian food!"}
{"text":"Tasty Indian food with good service. Unfortunately it is not child friendly since the clientele is mostly downtown Montreal office workers and they want to sit down and have a good quiet meal. Great for larger groups and they have small buffet available."}
{"text":"The food is great, good atmosphere ?comfortable? Good service? a little pricy. I tried the lamb, it is great, not spicy, not gamy. I tried their bread, tastes soft but chewy."}
{"text":"This is definitely my favorite Indian restaurant I have ever been too. The food is amazing but the service is even better. I recommend the Lamb Vindaloo, little spicy but fantastic. I loved this place so much I came back the very next night. The owner is charismatic, engaging and cares about your experience. If you are in doubt on where to eat while in Montreal, then doubt no more come to Le Taj."}
{"text":"A decent Indian buffet. A good place for lunch with work mates. The food is less greasy than at most buffets of this sort. Nothing special or memorable. The nan is ok, tandoori chicken is well prepared and the rice is decent. It's hard to get excited about a buffet like this, but if that is what you crave you won't be disappointed."}
{"text":"Le Taj is without a doubt westernized Indian food. Nonetheless, it's delicious! Their nan bread is freshly made everyday. Their butter chicken is top notch. It's on the steeper side when it comes to pricing - in my opinion: worth it."}
{"text":"Très bonne nourriture ! Très fraîche et beaucoup de choix . J'y suis allée un samedi soir avec ma famille donc le restaurant s'est vite rempli. Il est mieux de faire une réservation :) plus cher que les restos indiens typiques et les portions sont plutôt petites. Leur pain naan est trop graisseux à mon goût... Idéal pour un rendez-vous en tête à tête. Leur thé chaï est délicieux."}
{"text":"JJ and I rolled into Montréal close to 9PM on the first evening of our trip and were pretty desperate for a bite after being on the road for a while. We decided to grab Indian at Le Taj because it was so close to the hotel and liked it so much that we ended up there again later on our trip.  I ordered lamb vindaloo (spicy), which JJ refused to touch, with a side of rice. The lamb was succulent and the vindaloo sauce was more along the lines of a \"tangy\" hot sauce than a \"so-hot-you-can't-feel-your-face,\" but I still only powered through half before I got too full. JJ had the \"Thalis,\" which was basically a tasting course and came with a great variety of dishes (with rice and naan). The buttered naan was so good that we had another order when we came back, though we stuck with a more conventional chicken tikka masala (spicy for me) this time. We both demolished the dishes and were very full when we finished up.  The service was slow at times during both of the occasions we visited, and it was unusual that rice was not included in the price of the entrees. Overall, though, stellar food and a lovely upscale vibe made this place one of my favorites for our trip."}
{"text":"Excellent Indian with something for everyone.  Vegetarian options and fantastic choices for meat .   Great and attentive service. Had a bit of a cold and happen to mention it to the waiter and he took great care to bring a proper healing tea.   From what my Indian colleague tell me this was the best Indian food outside of India. I've been to India and did ask to which region the chef hails.   That's the thing in Montreal; so many choices. Love it!"}
{"text":"Whether you love Indian food or not this place is sooooo good. Garlic naan was delightful! We ordered way too much but enjoyed it all :) They also serve excellent cocktails."}
{"text":"Take it from a North Indian, amazing Indian food! Everything that we ordered was amazing, a bit spicy (as we like it) and great ambience."}
{"text":"I tried the buffet here last week. For ~18$ a person it's very expensive for lunch buffet. However this place smelled good passing by so decided to try it. In my opinion  the good - The vegetable dishes The beef The naan Daal makhni Gulab jamun  Samosa and chutney sauces   The bad or meh Salmon tandoori. I think fish w tandoori is weird The chicken tandoori was okay  The chicken wings not great The salad options meh Rice was very oily  I only enjoyed half of what was offered here so didn't feel like I got my money's worth. Would not return but glad I tried it."}
{"text":"Le Taj is my favourite Indian restaurant, hands down. Before I ate here 4 years ago, I didn't think I liked Indian food. Now I love Indian cuisine and sample it everywhere I can. Le Taj is still the best I've had. Try their butter chicken--it's life changing. I come here every year for my birthday. Service is very attentive and prices are reasonable considering how delicious everything is. Everyone I have brought here loves Le Taj by the time they leave."}
{"text":"Great atmosphere, great food, great gastronomic experience.  The decor was nice, the food was delicate and tasty. Indian food has great bold flavours but the chefs managed to express them in a such great combination.  Everything we ordered was really tasty! The nann bread was a bit too milky and sweet for my taste, same as the mango lassi.  Everything else was perfect! I can't wait to go back to try more!  Lunch buffet was nothing spectacular, come here for dinner instead!"}
{"text":"The best, I go here every time I visit Montreal.  Chicken vindaloo for me and shrimp tandoori for my wife. Awesome."}
{"text":"Excellent food, courteous service from the waiting staff, nice ambiance...what's not to like?"}
{"text":"Decent quality Indian food with the spice level tuned down to suit a wider clientele. I came here for lunch today 'cause the cafeteria in our building is closed, it's -20c out there and this place is right across the street. They serve a buffet composed of: lentil soup, salad bar, rice, lentil, naan, cooked veggies, tandoori chicken, curry beef, curry chicken, and three deserts. All for $18 plus tax and tip."}
{"text":"My cousin and her fiancée took me here for dinner, and the atmosphere was nice and quite. I ordered Butter Chicken, and I've got to say it was one of the better Butter Chicken's I've had. Next time I go back to Montreal I'll have to go back to Le Taj and order the Butter Chicken again."}
{"text":"Having spent two weeks in India, we found the food was just as good. In fact we went twice in a few days.  We ordered a wide selection from meat to vegetable dishes including garlic and plain nam and roti and found everything full of spice and flavour. I ordered extra spicy which was perfect for me.  The waiter each time was attentive, didn't kept us waiting long and came to the table several times to check on us. We'll worth a visit if you are a fan of Indian cuisine."}
{"text":"I loved the service here almost as much as the food, they were very polite and friendly. They did forget one item the second time we went, but they brought it out quickly enough and everything tastes so good that it's hard to think about complaining over something like that. It's a bit pricy but worth it if you are in the mood for a dim lit comfortable dinner out"}
{"text":"The ONLY place I have had better Indian food has been at my neighbors home, made by his mother; and they are an Indian family.   Do not let the Vegetarian, Vegan tags dissuade you if you are a meat eater. There are plenty of offerings on the menu that will easily make your food soul happy.   It is nice to give a 5 star. Everything about this place was exceptional. Once you walk in, the opulence is startling, yet not \"over done\" or over the top. The staff, somehow managed to contain and satiate 8, senior corporate types that were getting a bit \"hangry\", after yet another long day. I frankly have no clue, how our waiter kept our orders straight.   It would not have mattered anyways, we ended up sharing everything anyways. Which is common as we learned because one of our compatriots in our party is from Dehli. Gotta say, having him along made it that much more enjoyable because he's an Indian foodie. If I could order like that on my own, Indian food would move to the top of my favorite food list.   I cannot even begin to tell you what I had to eat, besides what I specifically ordered. Which was chicken curry, and some sort of lamb shish-kabob. (I love curry so much, I think I'd probably drink it in cocktail format). So so good. Even the rice. The freaking rice!!! Was delicious. How the hell do you do that with rice?   Portion sizes are about right, to slightly on the large size. 6 of us are of larger stature height wise, and every single one of us, walked out of that completely and totally satisfied. Already wanting more.   On top of it all, the place is just beautiful. The menus look like they're made out of engraved silver. They are metal front and back, but obviously not real silver. I only mention that to give you an idea of how beautiful the place is.   This is one of the places that I will always have to eat at when in Montreal (Deville being the other). For sheer richness and variety of flavor, it is hard to beat Le Taj.   Seriously.... if you there in Montreal... Go here.   Oh yea... very very good, or shall we say, fair pricing BTW. You can order family style, and I think it's around $30-40 Cad. And you can mix and match wildly.   I am excited to go back to Montreal next week, and make another trip to Le Taj."}
{"text":"Being indian with a mother who cooked curries at least 3 times a week my bar is pretty high. With that being said this is my all time favourite Indian restaurant and lives up to my high standards. The restaurant is modern, clean but with Indian ornate decoration. The food is presented in traditional indian style metal bowls which is great for family style sharing.  We started with popadoms that came with four sauces/dips; tangy tamarind, cooling yoghurt, spicy mint and another that was unidentifiable to me. The restaurant had a very authentic style of cooking and the curries tasted as if they were home cooked by my mom, using very minimal amounts of oil/ghee and with perfect seasoning.  We ordered the tandoori chicken, lamb saag and dhal. The chicken and lamb were both succulent.  The dhal had perfect consistency! As sides we ordered rice, roti and keema naan. In my mind the only thing that wasn't on point was the keema naan, the flavors just weren't what I was expecting and lacked depth and the decadence I normally associate with this type of bread. However, the desserts were on point! The warm gulab jaman was just sweet enough without being sickly, the freshly made rasmalai tasted creamy and milky. The perfect end to a gorgeous meal. The waiter was attentive without being overbearing, he answered questions and added suggestions. The whole experience was pleasant and reinforced that the positive experience we had the time before wasn't just an anomaly."}
{"text":"Wonderful dinner. Fine dining but not stuffy. Some guests were in shorts others in dresses. Service was impeccable. Food was delicious. One of the best meals we had in Montreal."}
{"text":"The best Indian restaurant in Montreal!!!! I love saag paneer, lamb vindaloo, and the tandoori chicken!!!  The service is excellent as well."}
{"text":"One of the best buffets I've ever had.  Exceptional shrimp saag alongside many of perennial faves like okra, cauliflower, many other options with so much flavor in a very comfortable setting.  Highly recommend it!"}
{"text":"We were recently in Montreal and were craving Indian food when we came across Le Taj. We didn't expect much but were blown away by the ambience, the service, the food, and how crazy packed this restaurant was all night.   We ordered bhindi masala, dal makhni, chicken xacutti, with gulab jamun and cappuccinos to end our evening. Thank goodness for our incredible server, Arif. He kept my tastebuds from burning off - I always ask for the food to be extra spicy and he strongly cautioned me against that saying their food already has a kick to it and if I wanted additional spice afterward he'd be happy to accommodate. He was such a delight and attentive to us all evening, keeping us updated on any delays and going out of his way to make us comfortable.   The food was amazing but it was really the service that made our experience. The owner was also on the floor helping his team and checking in with diners regularly."}
{"text":"I have been here twice for the lunch buffet. The interior of this restaurant is very nice and fancy. It gets quite packed during lunch hours from 12-1. For the buffet, they have a variety of little starter salads and samosas/pakoras. There is usually three main vegetarians dishes and three main meat dishes. They always have naan bread and tandoori chicken. I really liked the eggplant and potato curry they had, and the cauliflower and mushroom dish. Beware that some of the vegetarian dishes may have cream in it if you don't eat dairy. My friend really like eating the naan bread with the beef curry. There are also a little section of desserts, including gulab jamun, halva, rice pudding, and fruit salad."}
{"text":"bad cold overpriced food... good service though. no taste in anything... only two high chairs."}
{"text":"Un bon buffet indien en plein centre-ville... Le décor est très bien, tout en teintes de beige et de brun chaud, des plafonds hauts et des sculptures en bois aux murs.   Il y a une soupe, des salades froides, des plats végé, des plats de viandes, du riz, des nans, des gulab jamun, du kheer (pouding aux riz crémeux), des halwas, des fruits frais. Tout est bien bon, mais j'ai trouvé le poulet au beurre un peu sucré à mon goût. Terminez votre repas avec un masala chai, un thé au lait épicé et délicieux.  Pour 15,95$ le midi et à volonté, c'est l'endroit idéal pour luncher avec des amis végétariens, votre douce moitié ou pour un repas d'affaires.  En plus, la viande est halal et très bonne."}
{"text":"Hidden gem , should have more rating on yelp! Awesome food, great atmosphere and good service ! Food came quick, fresh and not rushed !   Def would recommend"}
{"text":"Great service, nice Indian dishes, and an overall nice experience. The restaurant is a bit fancier than I anticipated the first time I went in - but jeans and a dress shirt is suitable. I would recommend trying it!"}
{"text":"Being an Indian cuisine fan I just had to try out this restaurant in Montreal. We came in on Friday evening when the restaurant was busy but there were still lots of nice tables available in the area next to the windows (really nice, fancy looking area). However, we were brought all the way further into the corner next to the wall, far away from windows. The hostess did not seem to be very friendly. We were in such a rush so we did not mind, and I thought that those tables must be reserved. Only later a couple next to us expressed dislike to the table and asked for a window area, the hostess was not happy but said \"Jeez, no problem!\" Having sensitivity to dairy I asked the waiter if they can make some dishes without it (all the other restaurants would say \"yes\"), but they told me that all dishes contain cream and can't be served without it. I asked if even Saag Paneer can't be made without it, and they explained that the sauce is already pre-made (really!?). Most places I asked this question they have no problem as they cook things and can adjust the recipe! They only offered one dish without dairy that I was not interested in. We ordered Saag Paneer, Chicken Tikka and onion naan. To our surprise the food arrived in less than 5 minutes! Seemed like they did not cook anything fresh, as even the naan was a bit cold, not crunchy, seemed like just heated up. - Saag Paneer was very watery but okay (3/5) - Chicken Tikka was extremely oily! I can't express enough how I dislike food where the oil (or butter) is swimming all around and on top, it's like you have to pure it out which I tried. Then I tried to mix in the rest of the oil in the sauce but it kept separating. Gross. The sauce was so plain, missing any tomatoes or bell pepper. Looked like Butter Chicken (2/5). So the bottom line is that our chosen dishes were pre-made, and either too oily or too watery. Definitely not a place where I would return."}
{"text":"Been going there for over a decade now and it is one of my absolute favorite restaurants of all time!! Not cheap but both food and service are fantastic! It's a la carte but during the week there's a lunch buffet which is very reasonably priced and what a feast!  Whether you go for supper or their lunch buffet...it is consistently fresh and so delicious!"}
{"text":"I love their shrimp ! I remember coming here a few times with my sister and friends. Delicious wine too.  Could you PLEASE have ties with delivery services or deliver? Winter is here !"}
{"text":"I sat at the bar as they were busy this night.  The waiters work hard and the staff are friendly and helpful"}
{"text":"Excellent food and service. I have been to many Indian restaurant and I must say this is one of the best restaurants I have tried. Amazing diverse crowd in the heart on Montreal and the place is beautiful to dine in for lunch/dinner/date. I took my date for lunch...wifey"}
{"text":"This is one of the few Indian restaurants around the Mcgill downtown campus, I have to say their lunch buffet price is affordable for a student.   Haven't try their dinner order yet, but looks like the menu price is higher than the average cost of Indian restaurants in Montreal. Like I usually order a Thali for around $12 after tax, but here everything is more expensive, the lunch buffet is your choice.  The best naan bread I had is from Curry Mahal if anybody wants to know, but the naan here is good as well. The bread is thick and you can feel the wheat flavor from it.  Tandoori chicken is good as well, especially the legs, very juicy.  The lamb curry is just fine, I'm not a big fan of lamb curry but they like to include that in their buffet. And by the way, their buffet order changes but always have the tandoori chicken and naan.  Little disappointed about the butter chicken, creamy source but the flavor is not enough for me. I will say it is not sweet and salty enough but have a bit more sour taste inside, taste so so with rice. But the chicken inside the source is pretty good.  The salad, dessert and samosa part is just good, nothing more to say about these parts. One more thing is that since this is a buffet, the food is not very hot as many people like, but I guess this is hard to avoid.   And great service all the time!  Since I still have couple of years here in Montreal, this place will be my lunch choice for many times in the future."}
{"text":"Best Indian food I've ever had. All the ingredients are fresh, great service, beautifully decorated. I'm surprised it's not more expensive! My friend that grew up in India said it reminded her of home (the closest thing to the real deal through all her travels in the west). Must go."}
{"text":"Pretty great lunch buffet and it isn't half as packed at midday as it is normally. It always delicious and the service is always great too! Try the butter chicken and curry okra with onions - I could become a vegetarian if someone gave me an unlimited supply of that okra."}
{"text":"\"Enough food to feed a horse\"  Great restaurant with fast service and generous portions.  I ordered the lamb tikka, which tasted delicious, like any restaurant on Curry Row in new york city. Sorry, but I cannot compare it to food in India. The place is a little pricey but the food and ambiance makes for it ... a little bit. One complaint is that I requested the food to be a little spicy but I found it to be a little bland.   Oh if you want to eat here around 630-7 make a reservation. I was lucky to get a table at 645 but I had to be done by 8. At first I thought the host was messing with me but 98% of the tables had reserved placards on them."}
{"text":"Beautiful atmosphere, friendly, helpful staff and delicious Indian food! Best I've ever eaten. Highly recommend:)"}
{"text":"This is our first trip to Montreal and we were so excited to find a highly-rated Indian restaurant just around the corner from our hotel. We love Indian food! Both of us ordered the \"Feast\" which includes a soup or salad, appetizer, meat entree, veggie entree, and dessert with coffee/tea. Feast was definitely the right word to describe it. We ended the meal full to the brim and brought several take-home boxes back to our hotel room. The food was great. Service was average. Maybe they were short staffed because it took them awhile to take our drink orders and service towards the end was pretty slow. Also, it was insanely warm in the restaurant - I drank a ton of water to stay hydrated!"}
{"text":"Wow surpised I havent written a review for this place. I went to Le Taj a while back before during their lunch buffet special. The place and atmosphere really won me over. They have a nice open wine celler and the place was really nice and clean. I loved how they beautifully fusioned traditional with modern decor and the ambiance just perfectly hit the notch to be okay for both a group of friends/coworkers/couples etc. The service was nice, servers attentive, prompt, and most importantly courteous. Seemed like the people running the place has a lot of skills. Anyway Everything was good I just dont know why I cant seem to giving the place a 5 star. Probably because the food wasnt as impressive. I remeber trying their nan some vegetable curry, butter chicken, and some karahi dish. I recall their butter chicken having a lot of gluten as I had only a little bit and was full immediately. Drinks are good, and the dishes edible but not memorable.   Overall I'd say this place this great for nice get togethers with friends and family if you want to try Indian in a nice environment.   Price definitely not overpriced. I tried buffet style but even then most of the things on the menu are well priced for restaurant in heart of downtown. You certainly wont be disappointed, so dont hesitate to drop in."}
{"text":"If you know Indian food, you'll know this place is bad. If you're a novice, the food will probably taste good. Strong statements I know and each batch is different but both times I've gone (lunch buffet) I did not enjoy the experience and found the food bland, the buffet options limited. Better places to visit."}
{"text":"Close to our hotel Sofitel. If you like Indian food you will love this place. Food was amazing. My husband had lamb and I had paneer a tomato and onion sauce so amazing with cheese. They make fresh naan bread you can see the guys behind the window making. Make sure if it's the weekend to have reservations, the food that good. Great dinner to start off our anniversary trip here in Montreal."}
{"text":"Great food, good price, nice decor - exotic taste  All you can eat buffet under 20$/person!"}
{"text":"Delicious buffet! Loved the salmon tikka, daal, tandoori chicken and everything else was so good! And the dessert and fruit was great too! I would definitely recommend this!"}
{"text":"Overhyped and tasteless coupled with poor and limited selection of dishes. The only plus is the decor and ambience which is unquestionably good but as far as food is concerned please stay away..you would not regret. We tried the buffet just to be clear..perhaps may have something to offer for the main course dishes but strictly for buffet avoid don't go by the hype ..my two cents :-)"}
{"text":"I went two nights in a row. Food was above average to great compared to Indian food I've had in other major cities, including London and NYC.  Not the best ever but pretty solid, enough for four stars even if the place was priced significantly higher.  However, at his price point, which is barely above what you'd pay at decent Indian takeout places, possibly lower if you get le Taj's feast, it's worth five stars.  The feast is a $40 CAD that gets you a soup or salad, an appetizer, a vegetable entree, a meat entree, a big bowl of rice, a big naan, and a desert.  In other words, it's a lot of food.  I suggest coming with two people and ordering one feast and then an appetizer and/or an entree to round out the meal for two.  I am a big eater and I found the feast a little too much to handle by myself but the feast is such a good value it's not worth ordering a la carte off the menu. Of course getting even more people is even better.  Beef vindaloo is highlight for me.  It's not special or best ever, but it's spicy and the beef is properly tender. If you aren't into he vindaloo taste you will probably find it too spicy and may be turned off by the visible hot oil.  The Dahl soup is basically lentil soup with spices and a pinch more salt than usual.  My wife found it a little salty but I thought it was fine.  Chicken malai kebab was a triumph of the tandoor chef.  He meat was so tender my wife and I cute through it with our forks. It tasted pretty good if on the light side.  I ended up dipping it in sauces of other dishes hat we ordered.  Seeks kebab was pleasant enough but I couldn't really taste the meat.  It reminded me of alligator sausages and really spiced but delicious street meats all over the world where he star is the spices and the meat just carries the spices.  Dal makhini was kind of bland, but that could be the Dahl soup already numbed my tongue a little and I followed the dal makhini with beef vindaloo.  Tava fish was perfectly cooked and he spices didn't overwhelm the fish as I thought it would.  Still, probably better to stick with chicken/beef/lamb which stands up to Indian spices better.  Mixed vegetables curry was actually surprisingly good.  It's a bit light for my taste but I still found it delicious.  My wife and I both used it as sauce to change up the Tava fish and chicken and found the combination to work well.  The naan was just about dead average and a little inconsistent even for the two nights I visited.  First night it was pretty much dead average on every dimension.  Second night it was thicker than usual and less oily than usual. Still, good enough for me to eat with the beef vindaloo so no complaints for me.  Mango ice cream as dessert was very good.  The mango ice cream itself was closer to a sorbet and I think was homemade.  It wasn't the best mango ice cream, probably not even above average, but it's the perfect dessert after a heavy meal to cleanse the palette.  Decor is really good for the price range in the area. It would be above average even in Manhattan or London compared to places charging 20-30% more.  Service was fast.  Food was obviously precooked, enabling the fast service.  Don't be turned off by this.  Remember most of the stuff on the menu takes forever to cook. This isn't a place to order and then chat for hours over wine.   TLDR: not the best Indian restaurant I've been to. For international traveler, it's not good enough to make a special visit unless you are craving Indian food (like I was). It is however a solid option if you want good Indian food at reasonable prices."}
{"text":"I have been to this indian place on Stanley street multiple times. They serve decent Indian food. And their lunch buffet is affordably priced at 16 cad for eating out in Montreal downtown. Although, I do not really like the taste of dishes they serve for the buffet. I usually prefer to order separately from their menu, as it much more tastier. Though, then your meal becomes very expensive. The service is also not above par, especially when compared to the rates they are charging. Brownie points: they have a very good wine collection."}
{"text":"Nice place, friendly waiters, fantastic food!!! I would strongly recommend this restaurant!"}
{"text":"Delicious.The Saag Beef and Murg Makhani (pardon the spelling) were perfect. Garlic naan: yum! Chai was not as spicy as I like but it was ok. It was the only thing that wasn't excellent."}
{"text":"Went on a Monday night and the place was busy. Nice room. The currys were bland by Irish/UK standards. Veggie starter platter - bahji was dry, aloo tiki was too salty, samosa was standard. I had the beef curry - beef quality was good, however the sauce was tasteless. Service was fine."}
{"text":"With out a doubt the best Indian I've ever had with North America.  I highly renamed LR Taj to anyone whom loves authentic well spiced Indian food."}
{"text":"Excellent Indian food, some of the best I've had recently. Good, friendly service. Reasonable prices. One suggestion, improve the beer list and serve it colder."}
{"text":"After reading all the good reviews I decided to give this place a try. WHAT WERE THESE PEOPLE SMOKING when they gave this place such good reviews? One of the worst Indian restaurants. Food was too bland and there was no flavor. Being an Indian, I know about the Indian food, especially the North Indian food and there is nothing to write home about this place. Service was poor and it took the Server a good 15 minutes after we signaled for the check, to bring us the same. Also, it seems the place is run by people from Bangladesh or some other country who have no clue about flavorful Indian food!"}
{"text":"I went to this restaurant to meet up with my friends and find the decor of the restaurant quite tasteful. It offers a group table for my friends who were around 8-9 people. The food is okay but I wouldn't say really amazing. The staff is friendly and nice."}
{"text":"Everything about this restaurant is great. I loved both the ambience and decor. The waiter was extremely friendly. He was very accommodating after I mentioned that I had allergies, and made excellent suggestions. My food was amazing, and my friend loved her dish as well. I will definitely be going back here! I highly recommend this restaurant!"}
{"text":"Quelle belle expérience, en congrès dans un hôtel à proximité j'ai trouvé ce restaurant sur Yelp, n'ayant gouté cette cuisine que quelques fois j'ose demander au serveur son opinion, il me pose quelques questions... et me propose un menu sur mesure... WOW ! Oser vous laisser dépayser!!"}
{"text":"We were glad that we had a reservation!  The restaurant was packed and remained full during our entire time there.  So...make reservations.  Now for the food...  The restaurant features a modified Open Kitchen format, where behind the glass, one can observe chefs making fresh Naan Bread and chopping a variety of items...activity which provided a source of tremendous curiosity for a little boy at the table besides ours.  We ordered appetizers, a traditional beef curry, chicken tandori and a chicken curry with bismatti rice.  The Naan Bread was delicious and we enjoyed a trio of dipping sauces.  Our waiter did indicate that they could cook our food to mild or spicy.  Since this was our first experience, we didn't want to risk spicy.  I wish we had.  The meal was blander than I expected.  When I go to an ethnic restaurant, I think that exotic, spicy flavors are the best part of the package.  But, this was my bad...we asked for things to be toned down; probably a bit too much.  Service was attentative, albeit a little slow.  As every single table was taken up, this was understandable.  We enjoyed the experience and would not hesitate to go back again.  A pretty solid choice for Indian cuisine."}
{"text":"I was in Montreal on an overnight stay. I wanted to find a unique restaurant with a good vegetarian selection. Everything about the dinner was amazing. One of the best dining experiences of the year!!  The food, service and atmosphere was top notch. Price was quite reasonable. I highly recommend Le Taj the next time you are in downtown Montreal!!"}
{"text":"Positif :  Nourriture absolument délicieuse (le pain naan est à tomber par terre!) Très beau décor avec de belles pièces d'art oriental. Ambiance romantique (lumières tamisées, chandelles, etc.). Service rapide et aimable.  Négatif : Un peu cher (20 à 30 $ par personne sans consommations et ni dessert)"}
{"text":"I heard lots about this place and finally got my chance to try it out. Food was excellent and the reason for the 4 stars as I found the service was not 5 star. Nan was excellent, butter chicken, lamb etc...all superb. But I hate driving down town and it took ages to find anything becuase I have a SUV. lucky for me I have a friend with a building near by.  My fave is still on Jarry in Parkex. Just as good half the price with personal service. But If I am in the area I would go back."}
{"text":"Definitely one of the best indian restaurants I have been too.  It was packed with people when we went last time.  The atmosphere/ambiance of the place is very comforting and the food was amazing.  We got the korma lamb and eggplant courses that came with appetizer, naan, rice and dessert.  It was delicious!  Looking forward to going back again!"}
{"text":"Amazing Indian food inion nann great service possible the best Indian food in Canada."}
{"text":"Some of the best indian food I've ever tasted, honestly, everything we ordered was delicious, even the dipping sauces they bring out in the beginning with the appetizers were very tasty.. Mango Lassi came in a nice big glass (I usually need to order a second in other indian restaurants!)"}
{"text":"Only 3 meat dish 2 dessert and 2 vegi dish to choose from almost $18 per person plus tax food is not bad but not worth the price they are charging unless they get more options or reduce the food price not coming back."}
{"text":"After a long drive from Toronto, I was craving some Indian food. I checked online for something close and Le Taj came up and it had a great rating!   The restaurant was decorated beautifully. It seemed authentic enough despite the name. The dining room was packed with people. I was getting excited!   After a wait, I had to call the waiter over to order but, besides this the service was great.   The food however was another matter. I ordered the dal makhani, the vegetable korma, and saag paneer, all medium spicy. The dal makhani was the best. The korma was the worst. It was so bad, we had to order mango pickle to help boost the flavor a little. For a $16 item, I was expecting a lot more.   Overall, I would not recommend. Definitely, I've had a lot better!"}
{"text":"I had some of the best Indian food and the best service I've ever had at an Indian restaurant here. It's also more expensive than I typically pay for Indian food, but it's worth every penny.  I typically get The Feast, where you get: *a soup or salad (I like their green salad because it comes with nuts, cheese, and mango dressing) *an appetizer (I love their samosas, but I want to try their chicken kabob next time) *a meat curry (I love their chicken korma, didn't love their chicken tikka masala, planning on trying their butter chicken, chicken jal-farezi, and chicken xacutti) *a vegetarian curry (I ADORE their baigan bhartha, which is their eggplant curry - one of my all-time favourite curries ever!!!) *naan *rice *tea *dessert (their classic cardamom & pistachio kulfi is amazing - I'd never had kulfi before and was delighted by how incredibly rich and creamy it was)  You can get a thali for cheaper and get to try a bunch of dishes, but I'm not a fan of daal tarka or raita, so I always opt for the Feast combo.  Whenever I go, I have to make sure that I stay super hungry all day and even then, I am always super stuffed at the end of the meal and can never finish all the food - and I can out-east most men I know. It's a ton of (very delicious) food.   It's one of my Montreal staples and I will always return. Next time, I'm thinking of trying their chicken biryani."}
{"text":"Probably the best Indian restaurant in Montreal. I visit Le Taj every time I'm here and I've never been disappointed. Nice selection of dishes including vegetarian ones."}
{"text":"Indian food has never tasted this bad in a place that looks this good How I hate the fact i wasted my time and money on you Le Taj this place has more oil in their food and than flavor and taste Horrible naan and sub par food - Do not waste your time or money"}
{"text":"This is the best Indian food I have ever had, hands down.  The servers are nice and I love the decor.  Good wine selection, as well."}
{"text":"Decent restaurant, nice staff, excellent location with car park. Being served quickly. Nan bread is quite good, took the Vegetarian platter. Portions are very generous.  The venue is very clean . Loved it."}
{"text":"Delicious options, fresh and tasty food. Large range of options for vegetarians and a couple of vegan options as well. It was on the pricier side but definitely worth it as it was a lovely atmosphere and overall a great experience! The naan with paneer cheese was fresh and delicious, and the 4 sauces/chutneys they brought in were great tasting. We shared different options such as the beef korma, aloo gobi and veggie curry and everything was great with a good range of spiciness."}
