{"text":"Un excellent choix de bières québécoises! Le personnel est toujours sympathique et ils connaissent bien les produits."}
{"text":"Un de mes bars préfères a Montréal. Un choix de bière très large (aux agrumes, florales, de saison, fortes ou douces) des serveurs géniaux et qui conseillent très bien selon nos envies. Les encas servis sont très bon même si c'est un peu cher mais les ingrédients utilises sont très bons, notamment les différents saucissons. Le décor est très sympa, les prix très abordables pour un bar de qualité. Soirées quiz le mardi très sympathiques. La terrasse l'été est très appréciée."}
{"text":"Un bar chaleureux, sympathique et rempli de bonne bières, autant de micro de chez nous qu'un choix impressionnant de bouteilles de la Belgique! Des serveurs et serveuses super agréables et professionnels!

Lundi quiz un must a ne pas manquer!
Soirées entre amis de qualité, toujours réussies!"}
{"text":"Un bar vraiment sympa! Les serveurs sont très gentils! Bonnes boissons! Bonne musique en fond (dont le son est un peu augmenté à partir d'une certaine heure le soir)! De l'espace pour accueillir pas mal de monde! Des cendriers qui aspirent la fumée de cigarettes pour éviter d'enfumer les voisins?! Quoi demander de plus?"}
{"text":"Note: This review does not reflect what you might see on any given day, but don't let that stop you from coming here.

So post-Osheaga day 1, my friend and I were wandering the streets of Montreal looking for munchi...err, DINNER and then grabbing a quick beer somewhere before calling it a night. We had just dropped by a bar near our Airbnb a bit earlier and decided to take a different street back and explore a bit.

Walking down the street we ended up passing by Le Vestiaire and we could very clearly hear 90s music being blasted inside the bar. We start cracking up, but we didn't head in, at least not initially since it looked like a private event. We didn't make it very far before one of the girls waved us in and at that point we couldn't say no.

Once we were seated at the bar, I took a quick look at the beer menu and was blown away at the selection. I went straight for the stouts and got a 9% beer, but I didn't notice until after I got the bottle at how boozy it was, so needless to stay I would not be chugging this and then heading out.

So while I took my time with my boozy stout, we made small talk with the bartender, danced to \"Cotton Eyed Joe\", sang along to NSYNC, and watched as the employees danced on top of the bar while they blasted Ace of Base. It was a surreal experience for sure. Hell of a good beer list and a really fun bar staff. I definitely plan on returning next time I'm in Montreal."}
{"text":"Nous avons été une fois pour écouter un match d'hockey durant les séries et l'ambiance était excellente. Le service était rapide et sympathique. J'ai déménagé à 30 secondes de là, alors j'irai essayer leur terrasse sous peu."}
{"text":"Great bar in Montreal that has an excellent beer selection and amazing trivia night on Monday nights. I was staying with a group of friends for a couple of weeks and they told me that I had to go to this bar when them and their friends for trivia. Don't speak French? No problem- there were some American pop songs amongst the questions that I could have my hand at guessing. Every time there was a song/Hollywood movie/American geography question, everyone would look over at me like a lifeline to confirm their guesses. In all, I enjoyed the bar- it had a young adult (almost all French speaking) crowd. I'd definitely go back the next time I'm in Montreal."}
{"text":"Un secret bien gardé sur la plaza St-Hubert pour les amateurs de bières québécoises! Le choix de bières en fut et en bouteilles est parfait! Il y a de tout pour tous les goûts. Mêmes les connaisseurs y trouveront leur compte. Attention au bruit et à l'achalandage les soirs de hockey. N'espérez pas autre chose que des grignotines si vous avez faim, les plats sont un peu décevants."}
{"text":"Ce fût une belle découverte et une belle soirée dans ce bar de la rue St-Hubert.  Pour le décor, les crochets, un peu partout, ainsi que les plans de matchs, viennent appuyer l'effet de vestiaire et le reste du décor est très chaleureux.  On s'y sent bien.  
Nous avons été accueilli par une serveuse tout à fait sympathique et qui a su bien nous conseiller pour notre première visite. Ils se spécialisent en bières artisanales québécoises.  J'ai goûté à la Pale Ale Framboise Lime.  Elle était très bonne et les saveurs fruités étaient en parfaite équilibre sans jamais tomber sur le coeur.
La musique était une playlist des années 90, faut aimer le genre, car, à ce que j'ai entendu, c'est souvent ce style qui y joue. Pour moi, ça me convenait.
Une seconde visite s'impose car j'ai adoré ma soirée !"}
{"text":"Great selection of beers. Food is also good. Nice place .  Waiters are friendly and allow u to taste the beer if u dont  know much abt it and wanna taste it before ordering."}
{"text":"Very grateful and surprised to find this excellent place on the otherwise depressing collection of blocks of rue  st Hubert, which in some blocks is filled with dollar stores and knick knack shops and other crappy retail stores. 

After being ignored waiting to get a table at Isle de Garde we walked around the area and found this place. We were looking for simple, quick, affordable and this met everything we needed. 

We had the duck burger, croquet Monsieur and mac and cheese. Drinks were a very good cider and a flight of beer. The drink selection is excellent and the food was very good. Staff were friendly and prices were decent."}
{"text":"Vaste choix de bières de micro et les meilleurs nachos de Montreal ! Les serveurs sont toujours sympas et le bar bénéficie d'une petite terrasse sur la promenade sur Hubert"}
{"text":"Great beer!!  I came from Vermont where we know beer and this place is awesome.   They put the open golf highlights on for me and the beer is cold and tasty.  Cheers !!"}
{"text":"Je ne sais pas si j'ai été charmée par le serveur, le choix des bières, la place en général ou un peu de tout ça. 

Spéciaux tous les jours, soirées Quiz le lundi (juste ça, ça m'a charmée en fait), diffusion des parties du Canadien (je sais, pas très attrayant ces jours-ci mais quand même), un bel endroit avec une ambiance juste assez tamisée pour amener ta date Tinder, avec la musique juste assez forte pour lui dire des cochonneries au creux de l'oreille sans que le reste de la table entende.

Excellent service, le barman était sympathique comme tout et beau comme un cur. J'ai réussi à passer une belle soirée avec des amis en savourant des bières d'ici, sans me ruiner! Yay!"}
{"text":"Amateur de bonne bière, ce bar est fait pour toi !
Un cadre cosi, une déco sympa mais surtout une belle carte de bières !
Elles te sont bien détaillées avec les saveurs que tu vas découvrir en les dégustant. Une question ? Pas de soucis, le personnel fort sympathique et parfois plus rapide que son ombre (je ne vise personne ;-) orientera ton choix.
Les bières proviennent principalement de microbrasseries québécoises mais il y a également une petite sélection de bières belges :-) Les bières sont en fût ou en bouteille.
Si par malheur tu as des chums qui ne sont pas fans de bière, pas de soucis, il y a aussi du bon cidre.
La carte compte également un peu de petite restauration. J'ai goûté les 2 burgers à la viande de canard et ils sont tops (surtout celui au chèvre, c'est mon coup de coeur !).
Le bar propose également une soirée quizz le lundi soir et organise de temps en temps d'autres événements, je vous invite à checker leur site ou encore la page facebook.
En résumé un bon plan pour les amoureux de la bière qui aiment se retrouver entre amis."}
{"text":"Aw! I thought I reviewed this dear joint back when there was still snow on the ground, when I was first delighted to tumble in here and discover this oasis of nice design, great local beers, decent little scotch and whiskey selection, super cool bilingual staff, free wifi etc etc and so much more to love. Le Vestiaire is tucked in between the surreal tube top shops and wedding supply stores of St Hubert, right where you would least expect but most hope to find a cool local bar. So let's give a halleluiah for that asap. 

There is a special sangria on the menu right now with cranberries and lychee, not sure if this is a usual occurrence but it sounds delicious enough to mention. Also there is a cute patio out front for outdoor drinking, and a few weeks of summer weather left...."}
{"text":"Bon petit bar situé sur St Hubert. Ce n'est certes pas mon bar préféré mais je dois avouer qu'il y a un truc sympa dans le cadre avec les murs en bois. En plus le choix de bières est sympa.
L'accueil est souriant mais le service manquait un peu de fluidité.
Coté prix c'est dans la moyenne de ce que j'ai vu et leur nachos sont bons."}
{"text":"Pas cher!
Beaucoup de choix de bières! Toutes québécoises!
Jai pris le demi Nacho avec bacon, Miam! 
Le croque-monsieur est super. 
C'est un peu bruyant mais c'est normal c'est plus un bar! 
Très cute!"}
{"text":"This used to be my local hang for a while, but I terribly misuse it. Instead of drinking like one does at a bar, I just stuck around eating and loosing terribly at their weekly trivia night. And that right there is my main issue with it, the Monday trivia is now so well known that you basically have to show up at 5pm to secure yourself a table...and that's ridiculous. The teams are essentially composed of the same 15 people every week, so between two teams of 6-7 people, you are not getting those shots tonight buddy!

I hear great things about the snake bite, but the food is just okay - don't go for the nachos, they get cold and soggy super quick! Same for the pizzas, disappointing. They serve their burgers with chips, which I think is the one true cop-out for any kitchen, but they are very good, so go with that ;)"}
{"text":"Un des bars de micro les plus under-rated de Montréal qui s'explique par 3 facteurs
1: Il y a de la compétition
2: Moyennement bien situer: dans la Plaza St-Hubert c'est un clash!
3: Pas le même niveau de bouffe de sa compétion 

Mais ça n'en fait pas moins un bar qui qui est excellent avec un bon choix de bières qui change régulièrement. Ils ont en exclusivité la DIPA Ste-Anne-de-Beaupré, dans les très bonnes DIPA du Québec. Une belle liste abordable de bière en bouteille. 

Il a une terrasse qui a pignon sur rue l'été et c'est un bar sportif qui passe les games de hockeyl"}
{"text":"Super bar, très très bonne bière, serveurs agréables et une petite terrasse très sympa sur st hubert pour quand il fait beau. Je n'ai pas eu l'occasion de tester l'intérieur, mais je suis conquis."}
{"text":"Bonne bouffe bon prix. Situé dans un centre commercial extérieur, Le vestiaire nous offrent des boissons d'ici. Le menu style casse-croûte est parfait pour passé du bon temps. Lors des soirées thématiques, il devient rapidement plein et c'est alors qu'ont se dit qu'on a bien fait de venir ici!"}
{"text":"This is a very good bar, nice offer of beers, the bacon nachos are really good, fair prices and good music."}
{"text":"Un de mes endroits favoris a Villeray! Les serveurs sont super sympa, la nourriture est bonne et le choix de bière est génial!

Un gros bravo pour le choix de bière avec une description du goût! J'adore!"}
{"text":"Un choix de bières impressionnants, vous y trouverez forcement votre bonheur ! 
La spéciale du jour est à 6 dollars environ.
Mais je n'aime pas vraiment l'endroit, ce n'est pas un pub très chaleureux, c'est assez froid et aseptisé.
Service agréable !"}
{"text":"J'adore! Et les raisons sont assez simples:
1) C'est beau et c'est propre. J'aime le décor moderne et la grande terrasse.
2) La liste de bières n'inclut que des bières québécoises et la sélection est super originale : framboise et lime de La Barberie, Double Porter de Simple Malt, et ma favorite, la première sur la liste (j'oublie le nom en ce moment!)
3) Les prix sont vraiment corrects. De 4pm à 8pm ils ont de prix spéciaux ET à chaque jour de la semaine, deux bières différentes sont à prix réduit.
4) Ils ont de la sangria pour ceux qui ne tripent pas sur la bière.
5) Le wifi est bon et se rend jusqu'à la terrasse. Parfait pour bronzer et travailler en même temps!
6) Et le meilleur? Le staff. Super gentils, ils se connaissent vraiment en bières et se feront un plaisir de jaser avec vous!

Alors, qu'attendez-vous pour y aller?"}
{"text":"Bon service, bonne ambiance, possibilité de karaoké en soirée. Bouffe correct. Degustation de biere disponible. Endroit étroit par contre."}
