{"text":"Came here on a holiday (June 24TH). Very dissatisfied. Employees lounging around, mumbling waiter, dry food... I guess the staff here today would rather be home watching fifa. Hopefully for the owner the food and atmosphere is better on regular days. What a waste of time, thank god most plates are only 10$."}
{"text":"Je suis allé à ce nouveau café de type « lounge » à saveur maghrébine (avec chicha, cocktails (non alcoolisés) et divers desserts) pour sa soirée d'ouverture. L'endroit est bien situé pour aller relaxer après une soirée au restaurant (tout près de l'Académie St-Denis et des divers restos de la rue Duluth). Je ne suis moi-même pas un  amateur de chicha (narguilé), mais les connaisseurs en la matière y trouveront sûrement leur compte avec diverses saveurs disponibles. Quant à moi, j'y ai apprécié l'ambiance cool et relax et le décor chaleureux et invitant. Le personnel, à la fois fort courtois et ma foi très joli (n'ayons pas peur des mots), était débordé en cette soirée de première, mais le service a répondu à mes attentes.  Le menu fait référence à des déjeuners et plusieurs types de sandwiches, que j'aurai sûrement l'occasion d'essayer au cours des prochaines semaines. Pour l'instant, je peux me prononcer sur le café et les desserts, qui étaient excellents et à un prix assez raisonnable. Bref, un endroit intéressant à découvrir pour les gens qui veulent relaxer après un souper ou simplement bruncher un dimanche matin, selon l'ambiance recherchée."}
{"text":"Been there for breakfast at 9am on a Thursday morning. The whole restaurant was empty and the air conditionning was running at it's maximum capacity (it's was freaking cold in there). When my plate came by, it didnt took long for it to became cold. I ordered scramble eggs and english muffin instead of the french toasts. They made a mistake in my order (even if I was the only client to take care of in the whole restaurant) they gave me some pancake instead of the english muffin I ordred to replace the bread. It didnt took long for the waitress to notice the mistake and she immediately brang back my english muffin, but forgot to toast it. Kinda weird!!! The breakast was okay, but nothing \"wow\" there. Positive: It wasn't expensive and I had a good services from the waitress who was pretty friendly."}
{"text":"I've been here twice, and both times were solid just OK, could be better. Zephire has so much going for it: good location, cool vibe, lots of food choices on the menu. I really want to like it more!   There are a couple of factors that if improved, could make it great. Number 1 is service: it just wasn't that great. The waiter wasn't very friendly, very brusque. He automatically brought us a high chair for our little guy, which was really cool. We didn't stick him in it right away, preferring to keep our limited happy high chair time for when we were actually eating. Instead we let him toddle around from person to person in our party. I guess they only have one high chair, and I guess someone else needed it because it was whisked away without comment, to reappear across the restaurant with another baby sitting in it. We made do, but it really would have been more enjoyable with the high chair! We were 5 people eating, and everyone's meals came out very much staggered, with at 10 minutes wait between the first and the last. Awkward. The second thing that could be improved is the ingredients. One crepe needed a substitution because they ran out of mangos. Mine had avocados, that weren't quite ripe and rather hard.  Otherwise the crepes are pretty good.  So overall, just ok.  Which is too bad, because it's a really nice place, and if the service and food were awesome, we would definitely be back on a regular basis."}
{"text":"Food was good but that's it. Waitress didn't understand the orders given to her or even bother to write them down. Also didn't seem to be bothered by me getting the wrong plate. Just seems really complicated for a simple night out with friends. Smiling was optional too."}
{"text":"The food is all fresh and very tasty, good customer service, best shisha in town and all in all a very enjoyable experience!"}
{"text":"Good place to hangout for shisha as that is what everyone was having apparently.  I had some tea - it was from a tea bag and not so great."}
{"text":"Went in on a weekday for brunch. Huge place but only about 4 other tables in use. We were the only ones indoors. Has comfy chairs and staff are bilingual. The waitress is extremely friendly and patient with us and was accommodating. I had an almond crepe that came with two scoops of ice cream-one chocolate, one vanilla. I'd say the scoops are very small and that the crepe is a bit thick and chewy. I could do without the syrup on it. My friends had sandwiches and waffles. I don't plan on coming back for the food, I think it's just standard. Service was excellent though."}
{"text":"Je pense sincèrement qu'il s'agit de ma PIRE expérience de brunch à Montréal.   Mon amie et moi cherchions une terrasse pour aller bruncher sous le soleil et nous sommes tombées sur ce resto, rue Saint-Denis, qui avait une place juste pour nous sur la terrasse. C'était la dernière table disponible sur la terrasse, il n'y avait que quelques clients à l'intérieur, bref, ce n'étais pas achalandé du tout.  Après avoir pris notre commande, on nous a d'abord apporté un café filtre. Quand mon amie a voulu y verser du lait, nous nous sommes rendues compte que les \"cups\" de lait posés sur la table étaient sales. On dirait qu'il y avait eu de la poussière provenant de la rue dessus. On a demandé au serveur si c'était possible de les remplacer et il s'est justifié en disant que c'était seulement du café. Bien honnêtement, on s'en foutait de ce que c'était selon lui : ce qui est mis à la disposition des clients devrait être propre et cette saleté nous a dégoûtées. Il est finalement reparti avec les cups de lait, mais on a dû lui en redemander à nouveau, car il avait oublié de nous en rapporter. Je tiens aussi à préciser que quelques minutes plus tôt, notre serveur s'était obstiné avec des clients qui avaient demandé à plusieurs reprises qu'on leur apporte du sirop pour leurs crêpes. Bref, ce serveur avait un sérieux problème d'attitude.  Vient ensuite le temps de goûter à ce que nous avions commandé. J'ai pris les oeufs bénédictine et mon amie, un oeuf avec saucisse merguez. Mes oeufs pochés étaient trop cuits et froids, les muffins anglais n'étaient même pas toastés, les pommes de terre avaient l'air de petites patates McCain. Mon amie a reçu 2 oeufs au lieu d'un seul (au moins, ils ne lui ont pas chargée l'oeuf supplémentaire) et la merguez étaient vraiment ordinaire... Mon amie avait aussi commandé un cocktail de fruits qui était plus une salade de fruits qu'un smoothie tellement les morceaux de fruits étaient gros. Vraiment décevant ! En plus, quand on a demandé au serveur ce qu'était la petite crème sur le dessus (c'était du achta, finalement), il n'a pas su nous répondre, et n'a même pas proposé de s'informer !  Finalement, on a dû demander par deux fois nos factures avant de finalement entrer dans le resto pour payer à l'intérieur. En somme, un service médiocre, aucunement professionnel, et un repas de piètre qualité. N'y allez pas."}
