{"text":"I went to their new location in Scarborough.  The place is dirty and looks like an abandoned Warehouse. The owner or worker was rude and disgusting. Answering the phone while making the food.  No thanks I'm outta here"}
{"text":"*** Edit: business is closed. Ugh! ***  I'm trying not to review any more places with 5-stars because if you look at my profile you would think I'm either constantly on Prozac or I'm so happy-go-lucky it could make you sick... but there's no way I will watch this place displaying only 3 stars and not do anything about it.  For those who don't know, Lebanese food is huge in Brazil. I grew up munching on sfihas and kibbes; tabouleh, halva, baklava are also well-known, albeit by different names. After almost two years in Canada it hit me that I've never had a sfiha here, and it did surprise me to realize that these specific treats almost can't be found, in spite of Arab food being so ubiquitous.  Not only Lebanese Bakery offer everything I was expecting in terms of variety, but they do it right. The kibbeh was the best one I've ever tried, even when compared with the ones from my childhood. There are so many kinds of sfiha! All the ones I've tried are great. My wife loved the \"cheese triangle\", with feta and olives. The one with spicy meat is terrific as well.  Visually the place is very pleasant, it looks like it was inaugurated yesterday. The service is good and I thought the bill was cheap, I spent $40 for lunch, dessert and dinner (I simply had to get sfihas and kibbes to go).  I hope this place keeps in business for a long time. I did my part: as soon as I posted on my Facebook that I was having some sfihas, at least four of my friends jumped in their cars and crossed town to get there. They must have thought \"what's with all these Brazilians coming here today?\""}
{"text":"Lebanese Noob makes me a Le-Noob.  LOL, I know what you thought I would put instead of Le-Noob but don't be cruel.  I've been eye-ing this place for awhile and typical me that you know and love means I always pass by when they are closed.  So after a few months later, I finally got a chance to try some Lebanese flavours.  The setup is something like an Italian Bakery shop up in the Northern GTA.  You go up the the Pastry, Cafe, Bakery/Food counters, then pay and somewhat line up to request your order then wait at your seats or browse at the small retail area until you get called.    It's a quiet open area that doesn't attract much youth but then the location and parking isn't the greatest either.  I found it quite relaxing environment with sunlight shining through the big windows and friendly young staff that are very helpful.  Bakery/Food Counter(Mana-eesh, Fatayer, Shawarma and Pita, etc...)  Zaatar Mana-eesh($0.75) had an earthy & herby flavour topping. Spicy Veg Mana-eesh($0.75) was slight spicy and very veg Pizza feel. Kibbeh($1.50) is a Rice Croquette with Mince Meat interior.  Pastries & Sweets Counter(Cakes, Baklawa)  Almond Baklawa($0.75) is typical Baklawa but no distinguish nut flavour. Pistachio Baklawa($0.75) read Almond Baklawa.  As an initial Lebanese taste, I've got to say I'm not a big fan personally but I can definitely understand the cuisine much more from the ingredients used.  The Kibbeh was quite a unique experience that I can't find a Chinese equivalent to while the Spicy Veg was my favourite out of the bunch although you can probably get it at Pizza Pizza."}
{"text":"Lebanese Bakery Cafe and Desserts is located on Birchmount Road South of 401.   I would never notice this place because it is like tugged inside a factory looking complex.  The inside decoration is really simple but quite comfy with plenty of seats and even a little fireplace with armchairs.   There are 2 areas you can order food from.. one is the bakery for pizza, fatayer(pies), shawarama and salads... We tried some of the little appetitizers ($1 to $1.50) each which are all really tasty. I love the dough! It is firm but fluffy and have a lot of texture. Hey and almost all of them has spice inside!   The other area is devoted to sweets and drinks. Almond and Pistchio bakalwa. I have to tell you I do have this weakness over flaky pastries. Though both of them are really sweet but oh flaky shells dripping with honey... great to enjoy over a cup of dark arabic coffee..."}
