{"text":"I went with family on a Saturday night and were told there is a 2 hour window to finish. It was our first time there and I was trying to figure out the price per person and dishes to order. The waiter was impatient and suggested serving a mix of food of HIS choice to get to the first round. WTF? To be fair the food is descent but as we are approaching 2 hour limit, we got dirty looks from waiter and the guy at reception. We were a little bit over time and were rushed to leave. Waiter kept coming by to ask collecting the pots and sending the bill. And of course, the 5% cash discount they claim, which almost forces you to pay cash. Meh, the restaurant is only about getting the money in your pocket rather than retaining customers and creating a comfortable dinning experience. Not going back and won't recommend it."}
{"text":"High quality food and really good (small portions). Offers a diversity of tastes with the all you can eat nature. Love the individual pots because I got to choose the super spicy ones. The price is a little high since the soup base is separately charged (outside of the all you can eat menu). I would love to go again."}
{"text":"Will never come here again, maybe they change the owner.  Service were different now.  pricey but not even worth the price cause everything you orders they just brought out little, never want to refill water but refill salty soup to make soup very salty so you will stop eating, will never never never never come here again"}
{"text":"Got in at 8, they made us wait half an hour then proceeded to play favorites and skip over us. Next they told us at the table after sitting down that the only menu available was their more expensive special menu with lobster. We didnt want lobster or pay the extra just becuase it's new year's eve. 

Their saving graces are the staff and the decent food, but that still pretty pricey for what they offer."}
{"text":"A little obsequious and expensive.  But good quality."}
{"text":"I am gonna put some good words first. Nice decor, very China-styled. Servants are nice and helpful. Always answered ur request with patience and smile. Ok, let's talk about business . First of all, over priced, and The food is not this good that people have to wait for like 40 minutes to get seated. Secondly, the spicy soup is overstated and trust me, it is not even close.  Dipping sources are boring and not customizable. Meats are ok, but just mediocre. Totally not recommended, especially u need to line up for not-that-good food"}
{"text":"There's a 5% credit card surcharge added to bill without letting us know in advance. Damnit!!"}
{"text":"Never! Never! And never come here again.  Come here on Easter Sunday group of 8 people at 7pm, not busy at all, half restaurant empty, was very surprise cause used to be a long wait at this restaurant.  When we sat down ate we realized why the not like busy like before.  Everything we ordered they cut our order just brought out half, Tom yum were crazy salty, event to others soup.  We order juice brought it out to the table very quick but when we asked to refill water 4 or 5 times they pretend they busy not let us have water cause water can make you eat more.  I didn't believe be cause the service were bad, I knew that the owner want them to service the customer like this all you paid but can  not eat more.  Even dessert we ask for 8 pieces each but end up only brought out 4 pieces each order.  Never ever come here again. Never"}
{"text":"I have had hot pot in various cities in North America. I enjoyed Legend Hot Pot on several times. 

They do often miss orders of dishes, but seeing as it is all-you-can eat, eventually after a few rounds you're bound to have everything on the menu. 

Service is overall, great. A couple of times, I felt like the hostess/host did not know how to prioritize the needs of waiting customers with the needs of other customers already in the restaurant coming up to them and interrupting. 

I recommend this place when it isn't as busy. Food itself is fresh. Selection is great."}
{"text":"Good food, tons of selection. 
Pricey compared to other hot pot locations in the area."}
{"text":"????????????????????????????????????
?????188??????200???????????????????????????????????10%???????????????
????????????? ???????10? ???????????????????? ????????????????????????????????????????????????????????????????????????????????????"}
{"text":"We got served two tiny plates of lamb, both times we went there.  We were told that their kitchen is too busy cutting the meat! Wow I've never have this issue at Morals Village, located at hwy 7 and Kennedy.

If you're going to be cheap with meat, don't open a AYCE hotpot restaurant.  This alone will keep me from going back again.

With that aside, they do offer great selection of quality hotpot items as well as soup bases. 

I don't know what else to say, would have been a 4 star if they were not too cheap with meat."}
{"text":"The only special thing about this hotpot joint is its price.  

I went on a weekday so the price for me was starting at $26.  It seems the only thing you get for free is the dipping sauce.  There's no free broth (why?!), drinks start at $2.50, so expect to pay at least $30 for a standard hotpot meal.  Other places at least give a platter of seafood or free tea, not this one.  

The servers all use tablets to put in your order.  You'd think this would reduce human errors and missed orders as all order are digitally sent to the kitchen.  That is not the case.  After waiting hungrily for 20 minutes with only beef being brought out, we told the server to check our food status and we ordered more food.  Only some items from our second order came, and that was after another lengthy wait.  For our third round of order, most items came but not all.  

The portions are also not generous.  We received one piece of meat/wonton per person at our table.  

Service was decent though.  

There's many other better hotpot places in Markham and Richmond Hill."}
{"text":"Legend Pot is like a shiny, brand-new mid-end fancy car - quick, get here before the new-ness factor rubs off. 

Looks-wise, it's a decently/mid-large sized spot, with black and stereotypically \"modern Chinese\" decor with spacious booths.  The booths house an electric/induction burner in the middle of the table which fits one large, 1/3rd-mop-bucket sized pot split into a yin-yang shape for you to fill with two base soups of your choice.  The tables with regular seating contains one small burner at each spot, for small, individual pots (roughly the circumference of a larger personal sized pizza). 

The \"engine\", if you will, would be the food.  So good.  Beef is fresh, sliced and rolled up to the size of about two fingers wide.  Lamb is sweet and tender. Somebody has gone and paid enough or sourced their eggs really well to serve extra-large grade - literally a \"Good egg!\" Vegetables are fresh, lovely and green.  Mussels are large, fish is not \"fishy\" tasting, and the shrimp...cake things are unctuous. 

The soup broths are flavourful and actually made and topped up with broth rather than water when your pot starts to run dry.  We chose the second level/two chilli rating soup and the pork bone soup.  This spicy broth won't taste spicy until the end as it takes some time for the spices to brew, but after 2 hours, you will start to have that authentic \"mala\", tongue-numbing feel. Being a spice aficionado, I would compare the peak of this spiciness level to the heat level of \"hot\" wings at hot wing restos and pubs. 

On a silly side note: the individual bathroom stalls contain a thoughtful tray of dental floss for patrons. Not the kind that comes in a tiny plastic box, but the kind that comes built in to a small green plastic pitchfork. Ahh, the new restaurant feels. 

My only gripe about this place is they can be very odd about serving portions. For example, we asked for squid/beef/fish balls for our table of 4 and would receive a varying number of each: 5 squid, 4 beef, and 1 fish. Random. Also the gluten puffs (my favourite) which are usually served whole, have been cut into four pieces per puff and passed off as four servings. Although I admit their gluten puff is higher quality than many other AYCE hot pot places, gluten still remains one of those super cheapo grocery items, so why stinge out on a few cents? 

Finally, my tip to you is to wear wear only easily laundered clothing and consider leaving your jacket in the car.  Unfortunately, leaving any hot pot joint at the end will only leave you with the smell of boiled meats for days and not like new leather!"}
{"text":"The food is delicious and all my stars go toward that... BUT it's definitely more expensive than I'd like; the individual pots are neat but I think it's mostly for larger tables; they don't seem to have basic soy sauce -  we had to ask for it and they were confused; the service was a mess (granted it was a busy Saturday) but always super polite -  we sat there unacknowledged for 15 min, then the food came before the broth. My friends who ordered the \"fancier\"  broth didn't get it for another 20 min on top of that; no one answers the phone and, when they do, they greet you in Mandarin (they even left me a voicemail in Mandarin to confirm my reservation). That being said, I want to give them the benefit of the doubt (as it's still \"relatively\" new). I would definitely go again - I think the food speaks for itself here. Because I had great company during the long waits and the service was friendly, it wasn't bad enough to turn me away for good."}
{"text":"Really like the ambience of this hotpot place. Honestly, one of the best in the GTA. The restaurant has really good ventilation as it was 30 degrees outside and I was still able to enjoy my hotpot comfortably without sweating. 

You can tell that the food was really fresh as the meats were bright red in colour and also no old or withering leaves on the veggies. Every dish they served seem to be very clean. They have many different flavours of soup bases to choose from; it was a surprise that they offered a fish base.

The service was good. Servers were attentive and well mannered. I had a very pleasant dining experience. The only downfall was that this place was on the pricier side. I came today on a weekday and it was almost $40/person with drinks so weekend will be even more expensive. 

Happy potting!"}
{"text":"I love hotpot and Legend Pot's predecessor (iCook) was decreasing in quality and I was happy to try its replacement.  

The wait is long and I'm not surprised since it's a new restaurant.  The decor is much nicer than iCook - dark sophisticated decor with asian elements.  

Each person at the table gets their own pot, and I really must say that the quality of the soup is great.  The soup is thick and the flavour stays even after soup is refilled a few times.  The spicy soup creeps into the meat and is still a dominant flavour even after dipping into the sauce.

However, this is where my compliments end.  

For their slightly-over-average price, you have to pay additional for each kind of soup.  (Most hotpot offer a few free soups and a few premium soups).  For me, a large part of hotpot is making your own dipping sauce - however, when order sauce here apparently only two is allowed per person.

The service is horrid - the place is full of waiters rushing around but when you wave at someone they all pretend not to be able to see you.  In the occasion where they can't hide or run away, they tell you someone will be with you shortly, and of course no one ever is.  This greatly affects an all-you-can-eat experience where the waiters have to take your order and bring you food!

I've ordered quite a few things that never came.  Of the meat that arrived at the table, the quality was average.  My favorite of the bunch is maybe the stuffed meat balls/fish balls."}
{"text":"TL;DR version: I will not be returning....

I went to Legend with a few friends and I must say the service was pretty good. We were quite the demanding group and our server was always courteous and was always back to check on us to see if we needed anything else, or if anything was missing. 

HOWEVER, I not all servers were as nice. When other servers walked by and I happened to ask for something (not thinking we had a server assigned to us & like other Chinese restaurants, everyone covered any table that needed anything) they were less than nice and I even caught a guy rolling his eyes at me when I asked if he could check on our order that was taking longer than the previous..

The food was good in that it was fresh. The soups bases were pretty good as well and there was also a wide selection of sauces.

The one thing I really did not appreciate was how the pricing was set up. I am all about spending money on good food BUT do not dupe me into paying for something I was not told I needed to pay for upfront. The menu and all advertisements say it is $27.99/person. Reasonable for hot pot eating out. But...that does not include soup base. Depending on the soup base you choose it's an additional $3-6. Most places charge more for specialty soups so I wasn't too surprised at first but I noticed no soup base was \"included\". Being the inquisitive person I am, I asked, what about just plain water? Server's reply: oh but then we'd have to charge you for the pot.... Me: how much is the pot? Server: $3. If you choose a soup base though, the pot's price is included. Unfortunately, there was no option for no pot (roasting always works right?).

So, basically you are looking at a minimum of $30.99/person. I would've been fine if they had just said that upfront, many other hot pot places charge that much anyways. Put in the advertisements or pricing or menu that it is $30.99/person but your only option is the clear soup. That's fine. But to make the pricing like that is like inducing people to think they are getting a deal only to sucker punch them after they've entered. I do not appreciate such business practice and quite frankly it should not be encouraged. I will not being returning to this place ever again."}
{"text":"Overall I enjoyed dinner at Legend Pot.

Place: one of the nicer hot pot restaurants, seating good for both groups and couples, nice interior decor, spacious, well ventilated.

Food: very good quality beef, nice variety but a bit too much of the intestines/organs and too little of the seafood options in my opinion.  Fresh veggies and good soup bases.  Was a little odd that the soup base price is not included in the hot pot price.  Most hot pot places come with a one time seafood platter including oysters, shrimp, scallop, etc.  While shrimp, octopus, fish slices, and mussels were ayce here, that was pretty much the extent for seafood unless you pay extra.

Service: very good, server kept coming to our table to ask if we needed to re-order, food came quickly in general.

Price: more expensive than most hot pot places, expect dinner incl. tips to be around $40 to $45.  Foid quality is goid but I would expect ayce non drinks included for this price (ie: pop or tea or prune juice)

Would come again but not a regular go-to place."}
{"text":"Legend Hot Pot is definitely more pricey than the average hot pot place in town or doing it at home. But even though dining for 2 costed us around $50 per person on Christmas Eve, I think it's definitely worth it at least for special occasions.

The restaurant was super busy when we came in but we were still seated promptly in a clean area. I noticed the whole, large restaurant seemed much cleaner than the average hot pot place. The meat balls seem to be hand-made as well, no bad frozen flavour at all. They have a lot of luxurious a la carte items such as lobster, kobe beef, and even geoduck if you are feeling extra adventurous.

The washrooms are nice, and the servers are friendly. Food comes out really fast since the order is directly rigged up to a system on a pad so they immediately prepare it. At one point, as we were finishing up our first order our soup bases had already come out along with some of the assorted mushrooms we had ordered. 

They don't have the average cheap hotpot beef or lamb or assorted types of meat balls -- everything has a very nice flavour to it, like they have bought more premium cuts. Each person gets an individual hot pot bowl which is either a plus or minus depending on whether or not you like the communal aspect more, or like choosing soups you personally want for your bowl and what you want to eat in particular. 

This place only gets 4 stars because I have to admit I don't like that all the soup bases cost money (even though I understand this is a more premium establishment) and because the Deep Fried Milk Dessert was not too great. 

Just stick to their hot pot items and get dessert everywhere and you will be okay."}
{"text":"the server must have forgotten things from the kitchen in the first half dozen visits. when asked why she forgot, she blamed the kitchen but things still took forever to arrive.

at the end of the evening, when the bill was to be split, the restaurant, insteading adding up what each person's base cost was with each their own invididual adds on and extras, she decided it was fair to add everything up (with a 5% adjustment ... WHAT IS THAT? this was discovered AFTER she told me that tip was NOT included...) and divide it like it was a bar tab, which was annoying because the soups were all different prices and drinks were all add ons. i DID NOT appreciate paying for SOMEONE ELSE'S soup and drinks. i was very disappointed."}
{"text":"Higher end hotpot with a variety of meat, veggies, seafood and soup bases to choose from. Servers are quick to top off orders and fill up pots. The fact each customer is guaranteed their own pot (fixed in the price of all you can eat per customer) is convenient. The price of the soup base is not fixed; with soup bases range from $4 to $10 which is tacked on the price per person. However, the soup bases are full of quality ingrediants and are very flabourful on their own, while complementing the meats. Weekends tend to have longer wait times to reserving space is highly advised! Would highly recommend their desserts, specifically the fried milk."}
{"text":"Came here with friends around 10pm on a sat night and the place was empty. 
I think that in itself shows how popular this place is. 

Overall, the food was just ok. The sliced meat setved were paper thin....which would have been great if we  were eating tataki. 

Nothing really stood out about this place.
But at the end of the day, the food was fresh and the condiments for making the dipping sauce were abundant."}
{"text":"3.5 stars. If you want hot pot with great aesthetics look no further. This place makes you feel like you're in a ultra modern tea house, the decor is dark but suiting and somehow comforting. It's chaotic, loud, fast paced; places like this are only worthwhile if the patron is assertive. The offerings and food quality is great, no complaints there. To get good service, you have to put effort. I'm sure the Chinese locals here are accustomed to that, but if you're venturing into these establishments expect to do leg work and calling in the server and knowing what you need. Paying for the soup base was almost somewhat unethical, I think they can raise a whole star in feedback if they change that to an all inclusive price. That's if they care. This place is bery busy, however service and price honesty aspect is how you stay relevant in the long run. Hopefully they don't live up to their name and become a legend. Still, a worthwhile visit!"}
{"text":"I like the food and the slices of meat are fresh which I always look for when going to a good hotpot place. Cleanliness is also #1 and Legend Pot definitely covered both. But I just don't like being surprised with prices. It's not really \"all you can eat hotpot\" when you charge extra for a flavored soup. Isn't soup part of the hotpot experience? So I just don't get why they have to charge your extra. Why not just flat out and advertise it on your menu that it is $30.99 opposed to $27.99 + (Pay your own soup base). Anyway ... servers were nice even though ENGLISH is sometimes a hit or miss at this place. Some days I'll eat here and our server will have broken English but can understand our order well... and other days I go here and the server can't speak a word of English. Kind of boggles my mind because we are in Canada. Figured you would need to know that much to serve majority. Either way, still like this place but giving it a 4  Stars till they can polish up some or the things they need to deserve it a 5 star. I think this restaurant should read customers reviews to learn from the Pros and Cons of what most of their customers have to say."}
{"text":"Very busy place, but clean and nice atmosphere. Quality and variety of food is very good! Every body gets their own pot and soup base. I got the spiciest one and IT IS SPICY. But it was still good ahahah. 

However, it is kind of expensive. We each got a beer and ended up paying $55 incld tax and tips each. But no doubt their service was pretty good and considering the fact that they open till 2AM. Good place for some late night cravings!"}
{"text":"When I first saw this hotpot place opening I was very curious being a hotpot lover. The quality is definitely really good as you get what you pay for. Yes it can be very pricey but considering there aren't many hotpot places in Scarborough area that are like the ones in Richmond hill I'm definitely putting this over some of the ones I've ate in Richmond hill. The beef was very fresh every time you order, the soup base was good enough that I didn't need sauce for dipping. I would definitely try their seafood platters next time but everything is very fresh along with the nice decorating. When it's busy the waitresses do occasionally forget to get what you ordered but overall worth trying for all those hotpot lovers. Note it's $25.99 for Monday-Thursday and $27.99 for Friday-Sunday not including soup base."}
{"text":"This is me and my colleagues' review of Legend Hot Pot:

***Cockroach***

***Dirty Food, Food Poisoning***

We are having a farewell dinner with one of our colleague, unfortunately the experience has been terrifying for all of us:

When we started ordering, one of our colleague noticed there's a *cockroach* crawling on our table, the waiter that's taking our order right away smashed the cockroach in front of us with his bare hands (no glove no nothing), then we switched to a different table due to the incident, but this is not the worst thing we have encountered....

When we all went home later the day, some of us already started to have reactions to the food poisoning, some of us started running back and forth to washroom, and the situation continued to today morning and EVERYONE who dined at the hot pot last night all had food poisoning reactions, some more severe than others,

I would not recommend anyone to the restaurant as food is definitely not clean, and the restaurant definitely have pest issues"}
{"text":"This restaurant is WAY too pricey for what you get. Yes there's lots of options and variety on the menu. However, I swear you can buy seafood and have hot pot at home for a better price. The decor of the restaurant is clean and very modern. However I can't justify for the price."}
{"text":"The staff here was very friendly, spoke English (you have to tell them your order verbally, and they enter it on an iPad) not the best fluent English, but you will get by.

The fried bun w/condensed milk is good, spicy beef, enoki mushrooms, bean vermicelli, pork, fresh juices...

The booths provide good privacy

If you get drinks, get a pitcher, it's enough to fill 3-4 cups

Soup bases are extra $ 

Good ventilation, I didn't smell bad when I came out.

5% discount for cash payment"}
{"text":"This is THE worst hotpot restaurant i have EVER been too. 

The Cons: 
- meat was sliced very thin
- long wait time when refilling orders 
- hot pot is very small in general ( a tiny sauce pot you boil an egg in) 
- the sauces aren't good at all 
-charge you a service fee for not paying cash and they also claim that this is written in Chinese on the bottom of the menu
- pitcher of 9$ freshly squeezed orange juice also known as Tropicana 

If you are thinking about eating here PLEASE save yourself and do NOT go here. 
Bill was 90$ for 2 people including 1 pitcher of juice. Would have rather went anywhere else. Not for people who have ANY sort of standard for going out to eat."}
{"text":"This place is a fraud. Takes cash only and pretends to be test opening for months. Gave our seat to someone they knew even though we waited 40 minutes for their sub par food. Don't feed these frauds."}
{"text":"Have been there twice. I have to say the place is a typical hotpot place and food are also good. The service is considerable. Their waiters and waitresses always take initiative to help you out.

The only thing I don't really appreciate is the pricing. Story is the price they put on menu is 26.99/person for adult but it's actually a discount price only if you pay by cash. If you pay by debit / credit, there is additional 2 bucks they gonna charge you. Adding the soup base it will cost you around 31.99/person. So the menu price didn't list clearly what is the actual price is. I think customers should know what the exact price is no matter it is paid by cash or by card.

Before you start ordering, ask the exact price they will charge at the final stage when you want to pay the bill. As customer, we should protect our rights."}
{"text":"Legend Pot is a new hotpot place that I was looking forward to because a few family friends talked a lot of positive things about it.  I came here with 3 other friends on a Friday night, I was late, so I didn't have to wait to be seated, but I heard the wait time wasn't too bad.

Other than the nice seating for this place and the individual pot concept, everything else were bad!!

1) Huge communication barrier, all servers will speak to you in mandarin despite when you are talking to them in Cantonese or English.  If your customers cannot response back to you in Mandarin, it means we don't speak it!  So STOP ASKING us questions in Mandarin.

2) First round of ordering was good, all subsequent orders, they tend to not want to bring the food out.  We asked for some meatballs and beef 4 times before they FINALLY come out with ONE plate of beef and one meatball per person.  WTF?!

3) All soup base other than their \"water base\" requires additional cost, it's around $3 more, which is a big no-no for me unless the food you offer offsets the premium.

4) Literally everything we ordered looked familiar, and after thinking for a bit, I realized everything is bought from T&T. No wonder they all look like the food I have at home when I do hotpot.

5) My BIGGEST complain about this place is the misleading price they have on their menu.  When we asked for the bill, the server said if we pay cash, we will get 5% off.  So i was like, okay cool, we can pay cash.   The bill came and we did not see any 5% off, so we asked.  The server then said the price you see listed on the menu is for cash price, so if you pay with cards, you need to add 5% on top of that price.  WTF?! WHO THE HECK LIST THEIR PRICES LIKE THAT?!!

NEVER EVER coming back here again.  Only positive for the night is, the Chinese deep fried buns which I will upload a picture to show."}
{"text":"worst hotpot in markham. very limited food and broth choices. very expensive considering limited food availability."}
{"text":"Went with a couple of friends on a Friday night and this place was packed and had a line up! We waited about 15 minutes before getting a seat and once we sat down, the waitress served us. The staff was pretty friendly and quick to serve despite the busyness. The restaurant has a romantic ambiance due to the very dim lights but it was pretty loud with the restaurant bring a full house.

Although all you can eat, the prices were fairly expensive compared to other AYCE hotpot (~$37 with tip). I had a spicy broth which was actually too spicy for me to enjoy the food. For me, the chicken broth wouldve been perfect. The variety of meats and veggies is pretty good. 

I don't think I would come back here again knowing that there are several cheaper options with similar selections."}
{"text":"I'm quite surprised at all the negative reviews I'm reading... Maybe I just got lucky with a good experience.

I was devastated when I saw that my favourite hotpot place, iCook, had closed down. It was one of the rare hotpot places that lets you go up and grab the stuff you want rather than waiting on the staff to order your items and deliver them to you.

So when I first walked in, I was impressed at the renovations they did to this place. The interior decoration of this place is probably the nicest I've seen for a hot pot place in the GTA. But then I was worried when I saw that it was an ordering system - most hot pot places I've been to which had an order system would often forget half the things you order, and/or give you very small portions so you have to constantly order again and again until you just get sick of ordering.

I was even more worried to see that there was no pen and paper, so I had to tell the servers what I want, which I thought was unnecessarily tedious. I also tend to be a big eater when it comes to hot pot, and I didn't want to be judged for the amount I was ordering (you know, that \"ugh huh you sure you can finish that amount?\" look from servers).

I was surprised that the servers were all proficient enough in English to take my order - not that common for a Chinese restaurant in Markham. There was no judgement, they just took down everything I said. They were honest that the portions were small, but told me to just order more as I finish so that the items can be kept fresh. It was a good point, and because there were lots of servers around it wasn't hard to flag one down. Everything I ordered came very quickly - maybe it was because there weren't that many people there, but I was quite impressed. On top of that, they bring everything to you in neat arrangements on a variety of different shaped plates and bowls - for once, they actually cared about how the uncooked food was served. It was the cleanest hot pot place I've ever been to, and while ordering the sauces one-by-one from the server can be kind of annoying, it is nice to know that no one else had touched the sauce but you. If you have a friend who is nit picky about the sanitation qualify of hot pot restaurants, Legend Pot is definitely the place to go.

Yes the portions did come quite small, but when I just asked for 4 orders of something, they actually did bring out 4 orders. The quality of the the meat was better than any of the hot pot places I've been to, and nothing that came to the table was frozen solid.

So not everything is perfect, I would give this place 4.5 stars but I just bumped it up: First, the plate you use for the entire meal to eat off of is completely flat, which is annoyingly messy because the soup just spills off the plate onto the table. Second, the place is expensive. I spent about $70 for two people on a weekend night, which is considerably more than most all-you-can-eat hot pot restaurants. Lastly, and this is more a tip rather than a criticism, the Legend spicy soup base is VERY spicy. My usual hot pot soup base is the Sichuan spicy soup base, and this one was a lot spicier than what I was used to - so be warned.

As long as I'm going to hot pot with a bunch of financially well-off friends, this is going to be my go-to spot... That is until a Hai Di Lao decides to pop up in Toronto one day *fingers crossed*"}
{"text":"I really liked this hotpot spot. Toronto is saturated with various hotpot spots so it's hard to point at one that is a go too. Legend pot is close because their menu is extensive with some quality beef and even some cooked food like fried buns and their popular fried pork. What stood out the most was the amazing service. All servers had a smile and was helpful no matter the question. I cannot speak mandarin so I often asked to clarify what is on the menu and all servers happily tried to help. Even younger servers who did not speak English tried to help and learn the English terms as we ordered. I truly believe you \"eat\" service. I will definitely come back again. 
*there are 2 for $50 coupons on some Chinese Groupon apps"}
{"text":"Hot pot on a hot summer day? Yaaas..
We came to Legend Pot for an individual hot pot session - one pot per person. Service was great - we had multiple servers ask us how our food was / what we needed etc.
All the servers spoke in pure Mandarin despite us ordering in English sooo make sure you know what they're saying when they repeat your order! haha

Interior of the restaurant is like a fusion between ancient and modern China lol. Cleanliness here is also a plus.

Highlights:
* Fatty beef
* Lamb
* Mango pudding (There were two options, one is fried milk which is a spring roll with milk inside - not a big fan of that one)"}
{"text":"I ventured out to Markham for dinner with a friend this week, who swore that's where we'd find the best places for Hot Pot. I'm always up for new places, and since she was treating me for my birthday, I figured why not. Well, I'll give you two reasons why not: The 404. And the 401. Don't even get me started on the 407. Ugh. It's either going to take forever to get there, or cost you an arm and a leg. Granted, we left at probably the worst time ever (from close to Yorkdale) around 4:45pm. When we finally arrived at the restaurant two years later (ok, it wasn't 2 years, but it was about 90 minutes) I was starving!! 

I told my friend to just order for the both of us, since she is practically a Hot Pot pro. It has been many years since I've had it, and I wanted to experience everything the way she recommended. She did an excellent job of selecting a wide variety of items. The only thing I didn't care for was the tripe. It smelled weird and I was reminded again that I'm not a big fan of tripe. 

We both got the duo pots, with pork bone broth and Tom Yum Goong broth, with a whole lot of good stuff to go in it. I enjoyed the supreme beef slices, pork belly, beef tongue and the deep fried pork. The house sesame dipping sauce was really tasty, especially when mixed with green onions and garlic. We tried so many items that I'd almost be listing the whole menu here. 

We also had a pitcher of fresh pear juice to share, which was really nice, and not something I've seen elsewhere. 

I would definitely go back for this again, just maybe not during rush hour."}
{"text":"Service at management level musy feel they have to much business, because management definitely does not seem to care. Servers try but when the management team leads with such poor attitude its hard. One of the worst examples of i don't care i have ever incountered."}
{"text":"I like this place.  However I don't understand why they dun take reservation for party under 10.  Food is good, however for the price that I'm obligated to pay $28 on weekend plus $2.50 for broth is pretty expensive.  I ordered food 3 times and it never came, you really need patience.  I love the individual hot pot however which is hard to find.  Recommended if you've never been!"}
{"text":"It has been a long time since we have hotpot at a restaurant. A good variety for their selection of meats, vegetables, and sauces. The decor of the restaurant was nice. The restaurant is big and has some private rooms for large groups. Found the soups a bit expensive at $4 and the service was a bit of a hit and miss."}
{"text":"I like this place because it offers semi-private booths instead of a large open area. 
The one-bowl-per-person idea is great because everyone can get the soup base that they want. However, it's a rip off that you have to pay for the soup base ($2.50-3.50) on top of the buffet price ($28 for weekend dinner). So overall, this place runs on the pricier end, especially for Chinese restaurant standard.
I do love their large selection of food though. They are pretty good quality and definitely fresh. Make sure to come in with an empty stomach and order more."}
{"text":"I decided to pay this place a visit off a recommendation of a fellow yelper. He said I'd love the spicy pot and you know what, I absolutely did! I went on like a Wednesday night so there wasn't even a line and I had superb service! The servers kept coming to ask me if I wanted more and consistently refilled the soup base.  I don't had too many complaints.  Reason for a lack of 5 stars is the freshness in the ingredients..it's not bad but could be better.  The trip tasted a bit off.. Maybe it was cut too thick.  The sauce options were good and I liked how all orders were on an iPad. Only downfall is you have no record of what you order, so you can't even verify if everything you wanted came. All memory based.  

I wanted to come back for a group party but they were asking for 700 min before taxes and tip for one of this private rooms...it was too much for hot pot. 

Though I do love the decor! Can't find another hot pot place with better decor, that's for sure."}
{"text":"Five stars for offering such an authentic Szechuan hot pot experience. We opted for the fish broth and medium spicy broth combo. It was just spicy enough for everyone. Hot spicy must burn! The essentials, such as the hot pepper paste and some soup base are all airlifted directly from Szechuan China."}
{"text":"Went on a sat night at 6pm with a group of 4. Since it was quite early the wait wasn't too long. I would say 15min wait. These ayce places , I'm always rolling out the restaurants after wards since I'm like a ball after eating.

The service was good. All the food came really fast and didn't miss anything. The price doesn't include a soup base . So that was meh for me. Since I'm paying $26.95, I was hoping they have free soup base to choose from. The soup base range from 3-5 dollars additional. 

Good for groups since it's individual pot. Also it's relatively clean, and nice decor. But due to price I most likely won't go back. Hot potting at home with a group of friends is more lively."}
{"text":"Clean place, friendly and efficient service. Good was good quality and staff don't make you feel that they don't wanna region your food.  Raw food is served on frozen plates, which assured that raw foods were properly storee. Nice decor. Clean and roomy bathrooms. Could use a better ventilation. On the pricy side."}
{"text":"I like this place, probably the top 3 AYCE hot pot restaurants I've been to. It is 4/5 not 5/5 because it is a bit more expensive than the other place (charge extra for all soup base, i.e. no free soup base).

The food is good. Wide selection. They have most of the things you would want to put in a hot pot. The meat is fresh and quality is better than the average of all the other AYCE hot pot places. The omasum wasn't that good day I was there.

The service is great. When your plates are getting empty, the server comes and asks if you want to order more food, which is extremely rare in AYCE restaurants. Speed is fast, no need to wait at all. But we only had 2 people, so not sure how is it like for a big group. The ordering is different. You don't order on an ipad or put tick marks on an order sheet. You actually have to tell the server what you want. In my opinion, this is better since the server is there to answer all your questions."}
{"text":"Less than a year since our 5 stars visit, Legend Pot is almost unrecognizable in terms of its service, food, and price. 

Service - we had submit each order almost 5 times before it was brought out. They enforced a two hour limit - we weren't served our first plate of meat until 45 mins after submitting our first order, our first plate of veggies 15 minutes before they sent us our check. 

Foods - didn't get sample half of the menu since most of what we ordered were never brought out. What we did taste however wasn't as fresh as they used to be. 

Price - we felt as if we paid to be starved and ignored. When we asked to check on our orders, we were told they were busy and we needed to wait. In addition, we made a reservation for 12 ppl, but was given a table where two of the stations weren't working. 4 of the guests had to share a half and half pot - which we had to pay a dollar extra for each  and also paying full price for all 12 guests! 

Beyond frustrating. Like many predecessors, i don't expect legend pot to last long if this is its standard. I certainly wont come back to confirm."}
{"text":"Just keep coming back for more! I love to eat spicy food and their spicy soup base is actually hot unlike some places that is watered down. Their chicken soup base is also superb it's made with herbs like goji berries and ginseng (good for complexion which is a plus)! Before I was actually really against the idea of individual pots for hotpot because I thought the point of hotpot is to eat it over one pot together. But it's actually much better not only does water boil faster so less wait time, but u get to pick your own soup base to your liking instead of having to decide on one soup base for the whole table. Also food you put in won't get \"stolen\" by someone else. 5 stars because all their ingredients are very fresh and they have a wide selection of meats, veggies, snacks and balls. In addition the service here is amazing!! Every waiter, waitress and server are all super helpful and nice. Their food and service has always maintained at this level. Always a good experience !"}
{"text":"Pricy but quality of food is excellent for a hot pot restaurant. Lots of choices, on the down side they last call u at midnight but close at 2am. So u can order as much as u want and if u don't eat it that's fine. But what a waste of food if they do throw it out. Hot pot items do not take any effort to prepare you put uncooked food on a plate and bring it to a table. Why not let people order up until 1:30am if they come late. That way your not throwing all that food in the garbage. We saw so much go to waste from tables. 
Do not get the royal spicy soup, 2 of us had it taste like perfume could not eat it.. 
Down side they charge you for broth even if you just want a simple chicken broth. Not like other places where they give you free options. Drinks like pop tea all extra. 
Per person your looking at $50 each that includes tax, tip, one drink maybe and your broth. 
Staff very friendly and accommodating."}
{"text":"The place looks nice inside and everything is pretty clean.  The restaurant is kept at a very comfortable temperature too.  The waiters / waitresses are generally very good and the ones I've had have been very patient.  They've also spoken English well enough both times too so I'm not sure where the language barrier complaint is coming from.  The tables are pretty far apart from each other, aside the large ones in the middle, which may cause them to seat smaller groups at the same table.  I believe they only do this when necessary.  They do limit you to two hours, but on both my visits, they didn't seem like they were in a rush to get rid of us, which is fantastic.  Honestly, should you take longer than two hours anyway?

The menu's pretty large in the selection of both food and broth.  In my experience, all the food is pretty good and they tend to have some items that many others don't (including one of my favourites, cucumber).  No matter what broth you get, they always refill it with chicken broth though so your soup can get watered down in a hurry if you like to eat food that absorbs a lot of soup.  The people I go with are generally very happy with the food too so it's not just me either.  One of the semi-unique parts is that everyone at the table get their own pot, which I also like.

The part that makes the rating fall apart a little is the price.  I ordered the pork bone soup and ended up paying roughly $35 plus tax and tip.  The price is $3 cheaper on Mon-Thursdays.  This is very expensive for a hotpot place.  While I love the selection, food quality and service, that's a hefty price to pay.  Not only that, but if you need to pay with your debit card, they tack on an extra 5%.  In addition, if you ever want to split the bill, they make you total it at your table and make your party give their payment as a whole, which seems like way too much effort to put on your customers (plus you can't really get change back in this manner either).

At the end of the day, I love Legend Pot but the price is just way too high to recommend to others without thinking twice."}
{"text":"This place looks clean and has a good variety of food. Everyone gets their own individual pot. Orders came fast , but people were not friendly.  I will personally not go back as this place is expensive, and I don't see the value in it. All soup bases are extra, and have little to no taste, so add another 3$ to the price before deciding to go here."}
{"text":"I probably come here at least once a week. I've been to a ton of hot pot places and by far this is my go to/favorite. The prices for all you can eat is reasonable. Since they're grand opening the food quality has always been consistent. I usually order the legend pot spicy soup base which I'm totally addicted to. I've tried their other broths such as the pork bone and tomato soup base, all of them are super rich in flavor. I never feel super dehydrated after eating here which is another good sign. They have a wide variety for you to order from. The ambiance of this place is nice and clean. The staff are also super attentive and kind, they tend to come back to make sure you have plenty to eat until you're stuffed! I highly recommend this place !"}
{"text":"Let me say this first, never have i left an ayce hotpot hungry.
Our server was very friendly in introducing the menu, asking politely what soup and sauces we wanted. Cool. Anyway when we ordered our first round of food only half of it came. The rest were missing ... As we call our server she apologized and said the kitchen was busy. Come to think of it most of the food is frozen or raw. Weird.  As we ordered the next batch of food it came quickly but still missing stuff. There were also other tables that sat before us and got served too. Its just weird on how this place works...
I also asked for water several times and never came. I had 2 glasses in the whole 1.5hrs dinner experience. Horrible 
 I got really upset on what was going on that i just wanted to leave. No point of staying.
Luckly t&t is just around the corner.


Would not recommend to anyone. Its such a waste of money. Sorry."}
{"text":"My cousin told us about this place and I enjoyed it very much. I love how everyone can have their own personalized hot pot. 

I love my soup scorching spicy and their soup was delicious. Be careful when you're putting stuff in your mouth because there were times I would enhale and I immediately coughed and choked on my food. 

I love their selection of meats and veggies. I was super impressed. The only thing that bothered me a bit was the sauces. I just couldn't mix the sauce to my liking at all and the sauce is one of the most important things in hot pot. They had many sauces to choose from and you could mix them too but I'm so used to the chili and garlic fish sauce with my hot pot. 

Their service was amazing. They were super quick with their food and kept filling up our water. They were also quick to remove the empty dishes. 

I would definitely come back here. It was so delicious."}
{"text":"not too shabby. fresh selection of food (meat, veggies) soup bases aren't that great I had the most spicy and the chicken broth one. (duo pot) 

the freshly made drinks are good - pineapple juice , and watermelon 

and the dessert I had was good!! mango sago"}
{"text":"Party of 5 including myself came here for dinner. This hot pot place used to be called iHotPot. This place is situated in the T&T plaza so finding parking spot during dinner hours can be chaotic. Luckily, I was able to find a spot right in front of the restaurant. 

As you know with AYCE hot pot, you choose a soup base and you can pick everything from the menu. The pots comes individual and you either choose single or double soup base. FYI, the menu listed on their website is outdated. They have increase their price on soup base by 50 cents. I opted for the Royal Spicy Soup Base and the Pork Bone Soup Base. We also ordered 2 jars of freshly squeezed orange, and 2 bottles of Coors Light for myself. 

The staff here only speaks Mandarin or Cantonese. If you can only speak English forget about it, the staff here don't speak English.

The pot came less than 5 minutes so it was extremely quick. The Royal Spicy Soup is like medium but the more it boils, it gets spicier so be cautious on that. I'm love spicy food but I had to flag down the staff to get me water. Vegetables we ordered are fresh but the portions on meats is way too small for 5 hungry hippos. We had to constantly order more. When it gets busy it's frustrating to flag down staff.

Fellow Yelpers, you should also be aware that there's a lot of Chinese immigrant students who comes acting like a boss. They cut in line and act like they own the place. There were a couple students my bummed into who drives a white BMW M4 acting all cocky towards her when she was waiting in line. I had to straighten that out when I pulled up. 

The bill came to $198 - that's almost $40 per person without tips included. I rather go to Han Shin Fang. Nothing beats Hot Pot and BBQ at the same time. 

To conclude, I'll only come if my friends or colleagues invite me. 

Food:  3.5/5
Ambience:  4/5
Service:  3.5/5
Cleanliness:  4/5"}
{"text":"Avoid this place if you are impatient. Ideally when you're at an all-you-can-eat hot place, the food comes at a rate that is tolerable.  We came in and sat down at 6 pm, ordered our soup bases and sauces, meats, veggies, etc.  Nothing came by 6:45, even after we checked with waiters and waitresses. At 6:50 the manager came and said we ordered nothing, that nothing was on our \"list of orders\" (what? Why would we order nothing on our first go? Do we just want to drink the soup and eat the sauces?) so obviously by now we're losing our temper and ordered everything again (gritting our teeth) guess what, still nothing at 7:15 pm.  I think everyone can guess what our feelings are at this point."}
{"text":"Really enjoyed eating here. By far one of the best hot pot places I've been to, although it is on the pricier side. After soup base charge, tax and tip you're looking at about $40/person on a weekend- excluding drinks. Make sure to come with lots of stomach space. 

The meats were really fresh and came in good portions to avoid wasting. The waiter told us they slice the meat at the back themselves fresh and you can really tell by the color of it- bright red, nicely marbled. The veggies were also really fresh didn't get any old or withering leaves. The corn is amazing, super sweet! The only thing I wouldn't recommend that I've tried was the spicy beef slices. It's thicker slices of beef and the texture was just bad and hard to chew. 

The service was good. They always came around to refill our pots with soup. Very pleasant and well mannered.

The restaurant is also well ventilated. So you don't feel hot with all the pots boiling in the restaurant. This is important especially if you plan to go on the hotter days. You're still able to eat comfortably. 

The only thing about this place is that they really need servers who are able to speak and understand Cantonese and English. And not just Mandarin alone!"}
{"text":"For the first time in a while, I was finally able to go here without an excessive wait. A few things right off the bat: they only accept cash and they aren't cheap. Base price per person is $25, plus your soup which is an additional $2.75 or more. Drinks are also extra. Now on to the food: food is fresh and seafood is included. The soup base was a little bland but the assortment of sauces was good. Service could use some improvement. The waiters got our order wrong or incomplete multiple times and it was difficult to flag down a server, many of which didn't speak any English. Overall the meal was alright. But wasn't worth the $35-ish a person we had to pay. With so may other hot pot options around, it's hard to justify such an expensive meal."}
{"text":"This price is pretty pricey for hotpot. Although, it is on the expansive side, I wouldn't say to never come here.

Let's start with what's good here.

This place gives you a feeling that you're in a slightly higher class restaurant. Yes, that's right, I'm using 'class' to describe a hot pot place. Bet you'd never hear that about any hot pot place. The decor and atmosphere gives it a nice clean feeling, as well as an actual restaurant feel, instead of the normal opened space, seeing everyone stuffing their face until they can't eat any longer. The food quality is pretty nice too, as their seafood doesn't taste too fishy (so it's decently fresh, or at least kept fresh). They also have a nice choice of soup base to chose from, and you can get individual pots instead of a big pot to share. 

Now, the bad side.

Because of the location, and if you're familiar, you'll know that there are always lots of people. I know this is not something the restaurant can control, but keep in mind, some of the customers will try to cut in line to get a number for a table, so make sure you don't let people cut in. As I've said before, this place is pretty pricey. If you're looking for a cheaper hot pot place, this is definitely not one of them. When you order food, they might miss some of your orders, so you'll definitely need to constantly follow up with your server, to ensure you're getting what you ordered. One last thing, language barrier. Most of their servers are Mandarin speaker, and might have some difficulty with English. Hopefully by now, they have more servers who can communicate in English."}
{"text":"The food was good, fresh. Surprisingly excellence service,  very fast and polite. We will definitely coming back."}
{"text":"I would say the food was good quality, but doesn't justify the price of $26 + 2.50 for the broth.  There is no default broth for free like most hotpot places, every broth is about $2.50 - $3.50.   The servers were polite, however I ordered rice cake twice, and it never came, along with other items we ordered that never came.  

I give this place a 3/5, the quality was good, the servers were polite, but the price for what you get, and for all the items that never showed up is where it loses the marks.  

by the end of the night, after 2 cokes, 1 jug of Asian pear juice, it came to $200 for 5 people after tax and gratuity.  For that kind of price you can have a way better meal."}
{"text":"Although i am not an expert in hot pot dinning i enjoyed the experinece and food in this restaurant. It was perfect for the cold weather. They have a lot  of selection in broth and meat. Its also eat all you can but will charge you if you waste food. Regardless, i like this place and would like to go back if given a chance"}
