{"text":"My wife and I go out of our way, to Mesa's Lenny's, to go get this great comfort food.  The burgers are really good, every time.  They have all you would expect and much more for a burger joint.  The garden burger (if you're serious, I mean it's a burger joint!), fries in all versions (chili jalapeno artery sludge fries if you're insane and a burger and shake isn't enough?).  They ice cream cone it, they shakes it, they floats it too.  And yes, they soda pop it, for those that still don't realize that stuff (not stuff) is real poison.  Plus they have breakfast.  Nothing particularly healthful about the food, so don't go there to wag your body temple flag!  But as good as it is, I suspect they use very good for youse ingredies.  I give it 4, because nobody was/is as good as my Dad's restaurant.  
The whole 50s theme is sooo over (take it from a 50s war baby boomerette), but it's a sorta occasionally kinka of a distraction while you wait.  Who didn't know that Elvis was a twin?  Drive thru easy and quick.  The folks that work in the joint are really nice, so don't F/screw with them or you will have to answer to me, an old 6' 4\"...ahh okay...6' 2 1/2\" me (what can I say, settling).  They are always nice, courteous, very good at their jobs and fun...so don't be a jackass!  They can't help you with that problem, so don't go there for that, it's food, it's not for problem solving, you!  Hey, they geniunily laugh at my bad puns, they obviously know how to treat people, not just customers.  It even shows they respect old curmudgeons like me.  
Go, go now, don't bother with the other much more expensive, pretenders.  Go NOW!  Bacon cheeseburger everything w/grilled onions, sweet tater fries and a Root Beer float (Yeah I know, but a Root Beer float is only sorta poison.)"}
{"text":"The fried zucchini is delicious. Dip them in some ranch and you can't go wrong. Service through the drive thru Is always speedy and its right by my house on my way home. They are always friendly but everything besides the zucchini is so so at best. I'm giving four stars because it is decent food at a decent price but it's not something I would go out of my way to eat."}
{"text":"I recommend only going to the 35th Ave and Thunderbird location if you want the best version of this chain. I would say ask for \"fresh off the grill\" because it is worth the wait, but I think the cashiers are trained to actively ignore this request."}
{"text":"I love their Reubens pastrami sandwiches.  And the old school feel of this place. They have great food and shakes. Yummmy!....."}
{"text":"Lennys burgers is an amazing chain restaurant.  I especially enjoy there cowboy burger combo meal with their delicious raspberry tea. The dine in area is great to eat at and enjoyable. Thanks lennys!"}
{"text":"I have gone to this location twice now, months apart and each time I went my burger was burnt and the bun was soggy. Not satisfied at all. They also got my order for what I wanted on the burger wrong both times. I will never go back!"}
{"text":"Small and cozy diner atmosphere. Good friendly customer service. Burgers and fries are really good. I will be visiting this place often to get my hamburger fix!"}
{"text":"Great burgers, make sure you ask for your burger \"off the grill\" so it is fresh.  Otherwise youll get a pre-cooked bueger that has been sitting in broth."}
{"text":"I'm being dead serious when I say that Lenny's is has the best burgers in Arizona. My favorites are the Mexican burger and Pastrami burger. My hubby loves the Cowboy burger. Here's the thing, I don't like hamburgers, they are boring and have never been a choice of mine. But then we moved down the street from Lenny's and I figured I'd give them a try. Now it's our weekly treat. They're shakes are too die for so don't forget to get one! So many flavors to choose from. Eat at Lenny's, you won't be disappointed I promise you!"}
{"text":"They charge an additional fee for credit cards AND DEBIT CARDS. That isn't cool. I really like the place and have been coming for years but didn't realize they were charging extra for debit cards. Uncool."}
{"text":"Lenny's offers gluten free buns.  This is something I didn't know until today. After I was told about it, I went directly to the drive thru and ordered a deluxe hamburger on a gluten free bun.  I am so thankful that this restaurant realizes there are people like me who are gluten intolerant and crave a hamburger just like everyone else.  It tasted sooooo good.  I will be back!"}
{"text":"The drive thru takes forever! By the time I finally got to the window, my order was wrong and they had already run my credit card for the wrong amount. I waited another 10 minutes for them to get my order right and refund me some money. The staff there isn't very friendly. They charged me for an extra sauce I didn't order. It was a mess. The food wasn't that great. Reminded me of Burger King but this place has way higher prices. The only thing going for this place is their 99 cent root beer floats."}
{"text":"This is a great place to get a tasty greasy burger (I mean greasy in the best possible way). The inside of the restaurant is decked out like a 50's style diner which is fun. They also have some delicious shakes."}
{"text":"Some of the best burgers and fries around! 

The double bacon cheese burgers is just what you would grill at a picnic. Add the root-beer float chili cheese fries and lunch is complete. 
Nice to see that my burger was made to order and not under a heat lamp for hours. 
Clean tables and booths to sit at.  Friendly personal service with a smile. Not like the other places.  
Close to the freeway too 
If you use Yelp to find places, this is a must."}
{"text":"Manager and associate not very guest focused. Left my order in back for five minutes while they talked about what they need to do so they could leave, the cook finally brought it to my table.

Food was ok...

Cashier was eating in kitchen.

I Paid over $8 for chicken strip basket, asked for extra ranch and the manager wanted to charge me.
That extra charge for ranch just lost them a customer."}
{"text":"Definitely the best burger joint in town and one i stop into frequently. Fresh ingredients and perfectly cooked. Had my first one cooked by Lenny himself at a motocross track!  Don't forget the fries either"}
{"text":"great place for burgers. been here plenty of times and each time the food is awesome."}
{"text":"First time there and last time there! I ordered my food, girl did not smile, it was like it was a bother to even take my order, that in itself was enough,  their were 2 wasps flying around and the frys were extra soggy!!
The burger was ok but a little red inside,.the place i thought was dirty.will never go to this dump again!!"}
{"text":"One of my coworkers said that this place is better than In 'N Out. I can only think of 3 reasons for this, 1) She has recently been kicked in the head by a horse, 2) I have recently been kicked in the head by a horse and thus misunderstood her, 3) The Lenny's on the West side of town are much better. Still haven't decided which one it is...

Went here because it's close to my office and I'm lazy (my lunch pardner usually drives and she is on a plane to Korea right now). I ordered the Southwest Pastrami burger and some cheese fries. Pastrami on a burger sounds like a solid plan to me as I love meat (as a carnivore). What I got was a couple pieces of pastrami on a boring hamburger sandwiched between 2 slices of soggy bread. The fries weren't especially cooked and covered in what is best described as 7-11 pump cheese. 

While I respect the fact that they have a lot of options topping-wise I think I will stick with In 'N Out and just bring bacon/japs when I crave something different...."}
{"text":"We were just here for a few days from Washington state and I actually just came here to get a t-shirt for my son, whose name is Lenny. Unfortunately, they didn't have any.  It was such a cute place we decided to stay and just have some fries and sodas since we had a dinner date later.  The fries were perfect and the atmosphere was great.  Looking over the menu we saw alot of things we were interested in having and the prices were good. We plan on coming back soon to try some.  The best part of Lenny's burger I have to say is this.  I went online to see if they sold the t-shirts online (they don't), but I sent a email off to them asking how to get one. The response was fast and they asked what size I wanted and where to send it, and I got one in the mail a few days later at no charge!!  I'm not sure exactly who did that because they did not give me their name.  But I thought that was great of them to do so. You don't usually find places that do that kind of thing anymore. They definitely rate 5 stars in my book!"}
{"text":"Placed an online order at 6:25 for a 7:15 pick up. Arrived at 7:20, then waited another 5 minutes for them to make my order. Why ask for a pick up time or even do online ordering if you aren't going to make it until I get there? I didn't order online for the fun of interacting with my laptop, I did it so I would be in and out in the shortest time possible. I was there just as long as if I had ordered in the store. 

Will never be coming back."}
{"text":"One of the best burgers in town! And the fries are amazing with that seasoning on them! And depending on how hungry you are, they've got a burger for you! The new building is great, i feel i should be wearing a skin tight white t and levis! I love the fifties look! So if you're looking for a good burger, this is the place!"}
{"text":"Lenny's has excellent customer service and delicious food which is why I keep coming back. Even on busy nights, I get my food in at least 10 minutes. 
I would recommend the Southwest Pastrami burger. Its delicious and filling and worth it."}
{"text":"Food a little over cooked, understaffed, but good value, I have 4 kids, it's not cheap."}
{"text":"99¢ ROOT BEER FLOATS!
I like the burgers and fries pretty quick service not too friendly because they are working the drive thru so no time for chit chat but good food!"}
{"text":"I love lennys for an all around good hamburger joint. I recommend a shake,onion rings,and a burger to wash it down."}
{"text":"They have good Burgers, kind of reminds me of Astro Burgers back home in Cali. I love the seasoned salt  fries.  =P"}
{"text":"Great little place - convenient from the road too.  Drive thru is very nice to use especially after a long day at work.  Love their grilled cheese sandwiches and fries.  For two weeks straight, I had a yen for their Jamocha shakes - mmmmmmm!  For a nice little compliment after dinner for a little bit more, get the small cone of frozen yogurt.  Delicious!"}
{"text":"Been living in here for 4 years yet to find a good old school burger like I find all over but haven't found here until now. Excellent burger joint. Great cheese burger, juicy chili cheese dogs and good inexpensive chili cheese fries. Stopping 1-2 times a month for now on. Would say more but a little to far from my house or work. 

I recommend this A++++++. Take my word for its good."}
{"text":"What's there to say about Lenny's? Let me make a list:

-- Awesome Shakes (all time fave is the Peanut butter/banana combo!)
-- Great burgers ( I have had better, but these are awesome, good deals too if you look)
-- Nice ambience (ugly on the outside, but the inside is very nice; complex owner's fault tho)
-- A dive with a drive through
-- The best Onion rings you can find in Mesa (and I would venture the east valley)
-- an excellent pastrami sandwich
-- Awesome fries (crispy on the outside, fluffy on the inside; best served with ranch)
-- did I mention it has a drive through? (how many dives do?)

I highly recommend this place especially early in the week when you can get their 3 burger meals deal for cheap."}
{"text":"Lenny's is one of my family's favorite spots. Everything is fresh and of great quality. I love the fact that they have gluten free buns for my burger. Make sure to try there assortment of specialty fries."}
{"text":"Horrible service!  They don't care if you wait, God forbid if you ask for special anything.  They are way over priced and if you ask for extra ranch they charge you.  What a joke!"}
{"text":"The best burgers ever. Super mouth watering. I start drooling before my burger is even made. Would definitely recommend to everyone I know. If you're ever in this area stop by and get one of those burgers you will not regret it."}
{"text":"Lenny's was great. Burger was huge for price paid. Chili cheese fries were really good too. For a fast food burger, oh my this place is good! Expect to wait in line, but worth it. Fast service."}
{"text":"Big burger.  Lots of fries.  3 hours later, and I'm still stuffed....even though  I couldn't even finish my meal.  I may even go there again, even though I hate cheapskate places like this that charge you for the slightest thing....I had already received my food and paid, so I had to go without a side of ranch with my fries - rather then have to stand in line again and swipe my card for another freaking 30 cents.  Hey Lenny - when you spend $20 for two combo meals, it won't kill you to give your customers a side of ranch!  It sure put a bad taste in my mouth...pun intended.  Otherwise, good food...!"}
{"text":"Picture the Fonze, Richie C, Ralph Malph and Potsy eating one of the best burgers in Mesa -- better than 5 Guys, better than In and Out -- equal to Giant Burger -- and that is Lenny's Burger. And it's inexpensive. And it's like a 50's diner inside. Unfortunately it's like a deserted shopping center on the outside. Top notch onion rings too."}
{"text":"I had high hopes and expectations from the excellent food and service I had always received at the Glendale Lenny's. Every question asked was met with a blank stare, our order was wrong and the food was subpar. We were extremely disappointed and will not be returning to this Lenny's location."}
{"text":"I like the taste of the burger without a lot of toppings.  I get a teriyaki burger with no sauce. I like the junior burger.  I like the fries - and I always get a couple of their fry sauce.  It is a slightly spicy version - more southwest flavor and not the ketchup & mayo sweet version.  Yummy."}
{"text":"Service is always excellent. Food is always delicious. And Shift Manager Kim makes us feel right at home."}
{"text":"Doesn't look like much from the outside, but you'll be surprised when you step inside the 60s themed Diner. The food was even better than what I expected. The waitress suggested the chicken fried buffalo sandwich on grilled sourdough which was nothing short of exceptional. The extra crispy french fries were perfection. Now I wish I had tried the cherry shake.  Looking forward to my next visit!!"}
{"text":"Why do a pretentious upscale burger joint when you have this gem right in your backyard? These guys do burgers and they do them right! This location is like stepping back in time to the 50's with the burger stand decore. I did the cowboy burger and it was delish. It had a pile of bacon in it and it sure was tasty. No need for me to drive across town with this place down the street. I can't wait to come back for the Mexican burger."}
{"text":"Ok, please know that I'm not knocking this fine establishment. Just understand that I'm a \"burger-holic\" who is looking for the best of the best...

Having tried many, many burgers, Lenny's is pretty good, but nothing special. I thought the fries and milkshake was delicious. The double burger is a great bargain since it's large for a great price. The taste is nothing special. Also add that the decor inside is cool...Always love seeing the old feel at a restaurant like this."}
{"text":"Place sells a solid burger, sandwich or hotdog. I've been by a few times during their super busy hours and was pretty underwhelmed. Shouldn't charge 30 cents for extra sauces if they can't manage to put them in the bag. Beyond other small annoyances like that every once in a great while, they're worth checking out. 

And their chili cheese fries are some of my favorite."}
{"text":"I had the Swiss / Mushroom burger. Oh it was good. My hubby had the Mexican burger, it was even better."}
{"text":"The burgers are fantastic and i love the fries. It was my first time going a few weeks ago. I would recommend it to anyone that wants a affordable burger and fries. The decor was cool and the staff was friendly and fast."}
{"text":"First off I'd like to say I have always received good service here in the past until tonight. I placed my order with the manager Virginia it was for cheese bacon fries, and I asked for the cheese on the side as I have done in the past so the fries wouldn't be soggy by the time I got home. The manager told me she didn't know how she would do that, I informed her that they normally put it in a small sauce contaner. I end up with less then I would normally, but that's no big deal. She responded saying that she wouldn't know how she would tell the cooks (the ones directly behind her) and that they never make alterations. Before I could respond she said that she would deal with it this one time only, but never again. After that I turned to the group I came with and we all left. The fact that she made such a big deal over such a tiny thing was very odd. However the biggest problem was her attitude.  She was obviously angry,  you could see it on her face, and hear it in her voice. I have worked in the food industry myself, and know it can be stressful,  but the normal five star service was a half star tonight."}
{"text":"I love love the food don't get me wrong. But the customer service I get everytime never fails and it's always by the same young girl. It's almost like a bother to her that she takes my order. First when I was in the drive thru I wasn't quite ready then I said I was didn't get a response back for about 2 mins . I looked and saw they were passing things out the window to another car which I understood but anyway I then wait til she's done passing things out and still hear no response and say hello? And I get \"give me a second\" whaaat? I've worked in the food industry for the last 4 years, definitely not how you talk to people. So I get up to the window and the girl is right there sees me and walks off to start cleaning, doesn't take my cash. When she opens the window no smile , no thank you, acted as I said before it was a bother. Other than that the foods good, and I will be back just not so often."}
{"text":"My family and I have been long time customer's of Lenny's at Glendale and 25th Ave location, from the little burger shack to the new facility. This evening, by far just pushed the icing over the cake, we've been able to tolerate previously a few mishaps here and there, because of course it's expected in small business and you don't over-react in situations where it may be an honest mistake.


The customer service attendants and employees that currently work the line have become very rude. Situations where an order is forgotten can sometimes happen, but when we have to sit and wait and watch the people that have come in after us leave with their orders can become a bit irritating and very embarrassing. When we asked about our order, the cashier turned to the line cook and they made it seem like we were lying about our order not being complete and automatically demanded (with attitude) a refund ... with no anticipation as to when we can get our food. Tensions run high of course, when in these situations ... but after we'd left, decided to place a valid complaint, the same cashier answered the phone, cursed in Spanish with another employee and slammed the phone on me. I had asked for a contact number or email to management.


This definitely is not customer service and Lenny's may have lost loyal customers. Remember in business, it is hard to gain a customer and complaint of one to lose hundreds due to unreliable staff.

The best part of this evening ... I received a call back from the gentleman that's been with Lenny's for 14 yrs ... his service to Lenny's customers is outstanding! He called to make sure that Lenny's didn't lose a customer tonight and apologized for the bad service. We need more people like his dedication to the business in customer service. Thanks."}
{"text":"First time at this place.
Fries were ok, nothing great.
Hamburger, not that good, meat didn't look very appetizing, looked and tasted poor quality.
Do not recommend this place.

Place looked very nice, 50's theme, however customer service needs to be improved, the person taking our order didn't seemed very pleasant and not very friendly, places like these need friendly smiling people, so the customer feels welcome."}
{"text":"It had been awhile since I had been to Lenny's and I was really looking forward to it. 

The food is still great but you should take it to go...unless you want a hooker with your burger. Yeah got propositioned by a hooker in the drive through.

The burgers are big and delicious with many combinations of condiments to choose from...fries? crispy on the outside soggy in the middle and just a hint of garlic salt..yum. They close the shake machine at 8 which blows. I really wanted choclately goodness. 

There is also one of those meth billboards with the gross mouth right across fromt he drive through and that is not appetizing. Oh yes and the kid working the drive through kept playing with his lip ring which I must say grossed me out a bit...just not enough to not eat my delicious goodies....

If someone had picked the food up for me I would have gone four stars but I must say...the hooker, meth, and piercings brought my appetite down a bit."}
{"text":"Lousy service. Terrible prices. The girl at the window ignored me after shutting the window before I could even check my order which they rang up wrong, despite me explaining it multiple times. Definitely not worth $13 for a combo with \"large\" drink aka 24 ounces."}
{"text":"We live in the area and have tried Lenny's twice - both times it's been awesome! I tried the burgers and chicken - both delicious. They're homemade ranch is delicious and they're burgers are so good with their homemade sauce.

The staff/service is great - very friendly, prompt. 

My only complaint is they don't have a kids menu, but it's not going to stop us from going! 

We're definitely long-term customers!"}
{"text":"It was alright for a burger place but their onion ring was good.  Their cashier staff was friendly.  It was a cool place.  We got the cheeseburger and fries combo, chicken stripes, and chocolate milk shake.  It was a good experience overall."}
{"text":"The Mexican burger is my favorite but the single burger, chicken strips and chili dogs are also really good! The milkshakes are delicious they have so many flavors but chocolate is the best!

The regular French fries with the seasoned salt are usually really good. They come fresh out of the fryer all hot and crispy but today it seems like they served  me French fries that have been sitting out for awhile. They were hard and cold. I didn't care to go thru the trouble of complaining although I believe they would have offered me new ones. I have never had a bad experience with their customer service."}
{"text":"This establishment here serves up some good food. The style and environment is real neat."}
{"text":"Delicious, Greasy, Fat, Juicy Burgers! Get a big burger, fry and drink for about $4. The place is small, and gets warm in the summertime, so to-go is the preferred method for me!"}
{"text":"This place is one of my favorite places to grab a burger. Newly built store has that 50s theme which adds a great taste to it. Malts Burgers and Hot Dogs are great here."}
{"text":"I LOVE LENNY'S SHAKES! They have the  best milk shakes! My personal favorite is the Peanut butter! The Burgers are good as well, but nothing like there Milk Shakes! The price is really reasonable! For a burger, fries, and a shake for under $10! Highly recommended!"}
{"text":"Had burgers at this place and just didn't like them too well. Seemed greasy and way too much sauce. Fry's need to be hot and a little crispy for me to like them and I didn't get that here. Perhaps I could get better food on a better day for them but I may not go back to find out."}
{"text":"I had chance to stop into this place tonight based on the fine reviews here on Yelp!

I afraid to say that I was underwhelmed after all the build up.  The burgers, while fresh were very basic.  I also didn't get the burger I requested.  It seems that the employees, which there quite a few were busy having fun and chatting about things for them to pay attention to what they were doing.  The fries were undercooked and somewhat burnt, which I'm not sure how they accomplished that.

I'll try again going inside one day when I'm in the area to see if this was just a fluke."}
{"text":"We come here all the time just to get the root beer floats this is the only fast food place that sells it. The service in the drive through is very quick."}
{"text":"Awesome food like always great service Charles was exceptional very kind highly recommended definitely will return."}
{"text":"Good food, nostalgic, have some yummy treats that I used to eat growing up. Worth a,trip! Also very clean."}
{"text":"Wasn't really a fan. Burger was almost soggy and greasy and mushy. Fries were eh. Service was slow and no tables were cleaned off. Probably won't  be back. The boyfriend says the Phoenix location is a million times better so will probably give that one a try but this one is a no."}
{"text":"I dont EVER write reviews about anything, but i just got done eating here and my experience was so bad i thought i had to say something.  First off we were treated rudely over the drive thru order radio.  We had to repeat our fairly small order three times and it still wasnt correct when we got to the window.  Second we waited for close to 30 minutes with only one car in front of us.  We finally got our food and went home to eat it.  Upon taking my first bite of my mexican burger i immediately started to gag and threw up a little in my mouth.  All i could taste was extremely burnt onions and insanely soggy bun.  I dont know how somebody could hand this food to somebody to eat and not feel bad.  I wouldnt even give what was left to the dog.  It went strait to the trash and now im ordering a pizza.  At least this 30 minute wait wont end badly. Thumbs down Lennys"}
{"text":"We brought in a group for lunch. Everybody loved their burgers and dogs. I had a double bacon cheeseburger with fries. The burger came out wrong the first time but the chefs quickly got me a new one. I love that charbroiled flavor! We'll be back to try some dessert another time."}
{"text":"Wow surprised by the price....it's pretty high for a small burger combo.  The drink size has changed also over the years from a small to a medium. SMH. The food is good still just expensive. Not sure if it is worth the money."}
{"text":"The food was good but I went through the drive thru and my order was completely wrong.  Way bigger order than what I got so it worked out.  I would go back"}
{"text":"food is solid. garlic mushrooom swiss brought a didferent element to a burger. fries are above average and milkshakes are some of the best ive had in AZ!"}
{"text":"Had a BOGO coupon from the newspaper so we tried it out today. I wasn't a fan of the burger. I loved the French fries! Almost like red robin's. They also have many sauces to try (30 cents each) like cheese, ranch, lennys sauce, fry sauce, etc. Styrofoam cups are also a plus in the heat! Fun setting, lots of retro signs hung about and black and white checkered floor. Friendly staff too!"}
{"text":"Best burgers in town in my opinion. Clean establishment, with great customer service. The burgers are always fresh and the French fries are pretty crispy. I continue to take family and friends local and out of towners to Lenny's to enjoy the made to order burgers. Be sure to check out what they have to offer."}
{"text":"Always great food and exceptional customer service.  I've frequented two different locations and I've never been disappointed.  I highly recommend Lenny's."}
{"text":"If I could give no stars I would. The menu looks amazing so of course we were excited to order. We got cheese burgers which fyi, they do not have a plain cheeseburger for a cheaper price so your stuck paying 2.50 for a thrown together burger. Mind you this was for my younger child who doesn't like anything on her food. The burgers were ok but ugly looking and I very much enjoy when I receive my food and it looks edible. They had messed up on our hot dog order so they asked us to pull to the side and wait for them to bring out a new order This new order consisted of ONE hot dog...completely plain.
I decided to go in and order another root beer as now my two year old was crying for his hot dog to make things a little faster.
Funny thing is I walked in to this young girl arguing about making the hotdog for my son. So of course I was not too thrilled with the costumer service. I sat and waited 8 minutes while this girl worked slower than a sloth at everything she did. I have never in my life seen someone work so slow and make three other orders before making the one hot dog I needed to console my screaming two year old. This is when I seen that they fry their hotdogs in grease before putting them on a cold bun...makes no sense. 
So do not let the menu board fool you because their menu looks amazing and who knows maybe we just had a bad cook and customer service that day. I wish I would have recorded her nasty attitude along with her slower than a snail motivation to make food. I heard this place was family owned and I just do not see how someone who runs a company with so much potential and apparently the finances to keep it going to want to be mediocre.  
Needless to say, we probably will not be back."}
{"text":"Awesome! Awesome!! Awesome!!! The burgers are messy and fresh. Which I love! For the price, and taste of the food, you would be hard pressed to find better. It's not a big place, and the drive-thru get a little crazy if there's more then 2 cars, but that doesn't affect how good the food is!"}
{"text":"Good comfort food choices! From what I have tried, I have liked it. Price wise there food is okay, but beware if you use plastic to pay there is an additional charge!"}
{"text":"I arrived at the drive thru and was happy to see there were only two cars in front of me. I pull up and they quickly take my order; side of bacon ranch fries, small vanilla shake, and a medium Oreo shake. (The shakes here are SO GOOD) 

So I wait. And wait. Oh did I mention I sat and waited?.. About 15 minutes pass by and there is FINALLY one car in front of me. (Oh and there were about 4 cars behind me) So I wait a little more,  it is now 20 minutes since I've arrived, and it is now my turn! Yes!! Hallelujah!

I pull up to the window and the girl has my order messed up! Ugh! (Rootbeer float and a cheeseburger) So I now have to sit and wait some more. 8 minutes later and I FINALLY get my food. As I sat there and looked inside through the window, I did notice that most of the employees are teenagers. There was a lot of fooling around in the kitchen so that might be the reason for the SLOW service... Yes I mean SLOWWWWWWW. 

*I've never waited 30 mins in any drive thru.. I would've seriously driven away, but I was stuck in between cars and my little niece would've been disappointed without her shake.. Stay away if your in a hurry!"}
{"text":"My first trip to Lenny's on Nov 4,  2014 11:35am. I had the single patty burger, no cheese, everything toppings (lettuce, tom, onion, mayo). Aprox 6 minutes order to delivery to the table.

The place was clean, inside and out. The strip mall where they're located is a ghost town, Lenny's is the only surviving business in what looks like an economically depressed neighorhood. Lots of parking. Drive thru window. The dining area is rather small inside with booths, raised tables, and a small bar. Self serve drinks, limit one refill please. They serve pepsi beverages.

The process was simple, walk in the door, stay to the right, walk right up to the register and order. Your number is on top of the receipt ticket, the fountain drink dispenser is literally right next to the order takers, then take a seat and wait for them to walk into the dining area and call out your ticket number. Napkins, mustard, ketchup, salt,pepper and hot sauce at every table.

Their regular fries are great, way better than In & Out, Freddy's or Culver's. The burger was slightly above average. I added a small amount of ketchup and mustard to mine but there was little beef taste, but still very acceptable.

On the 0 to 10 scale I would give their fries a 7 of 10 and their burger a 6 of 10, nice but nothing to drive ten miles for. 

Just for comparison I would give 5-Guys burger a 9 of 10, In & Out a 5, and Culver's a 4. I would give Fudd's an 8 of 10 and Red Robin a 6 of 10, and McDonald's a 1 of 10. This places Lenny's above average overall, worth checking out but I would suggest a Burger King or 5-Guys any time over this. This scale does not take price into consideration. 

Having sat in the dining area waiting for my food to arrive I've watched the kitchen work,  I noticed that they pre-cook burgers. When they're going to make your order the burger comes out of the plastic slide bin and goes on the flattop grill while the other cook prepared the toppings and buns. You mostly never get one right off the fire.

They have a pretty big menu, probably should check it out online before you go. If it was in a better location I would raise my review to four stars. All in all well worth the time to go here and give it a try."}
{"text":"I love their tuna salad sandwich! But be prepared: it's very messy! The napkins they provide on their table are hardly enough to keep up with the drip! Oh, but it's worth it! There's plenty for 2, if you want to share! I'm sl glad Lenny's came to the neighborhood!"}
{"text":"When I moved to my new apartment I had no idea that I was moving a couple blocks from my best food find. The staff is nice, the food is amazing and the shakes are just unbelievably yummy without being over priced. The only thing is that they changed the tops on the shake cups and they aren't secure. I was a bit irritated that I got shake all over my hands while driving, because every time I picked it up the lid popped off. Just go back to the regular lids guys, we don't need the pretty domed tops if it means that we're going to get messy"}
{"text":"If you're looking for burgers and fries but don't want the same old fast food - go to Lenny's! Awesome service, good food! Probably my only complaint was Lenny's felt like a 50s diner to me and they played 80s music... kinda strange but my tummy was happy!

There's been a lot of businesses come and go from Southern & Stapley, I hope this place stays around for awhile!"}
{"text":"Cute little old style dining spot. Great burgers and fries."}
{"text":"These guys are always really solid and I love that they have a veggie burger option. Tonight I had a patty melt with a veggie burger, wife had a burger combo and the kids had the chicken tenders with fries. Their fries are amazing... now, gotta decide about what flavor milkshake to order..."}
{"text":"I've told people for 20 years Lenny's was the best burger in the valley. Unfortunately, tonight will be the last time I dine there. What was once a cheap delicious burger is now an incredibly expensive overly charred small chunk of meat. It's often dirty and run like a typical fast food joint instead of the diamond in the rough that it used to be. Truly sad."}
{"text":"There are a handful of Lenny's Burgers in the Phoenix Metro area, this was the first one I went to and still my favorite. They have Retro design with lots of chrome and neon lights. My first experience was with their original building, burgers are first rate."}
{"text":"Let's just say, I had a hankering for a good burger, even though I shouldn't be eating them, but I convinced my husband that we should try Lenny's Burger! Can I say, we were in heaven for about 1/2 hour yesterday. From the minute we walked into the door, to the beautiful décor, and the FABULOUS food, we will, when we just have to have burger and fries. Oh and the fact that we only waited about 5 minutes from ordering to eating, was simply customer service at its finest. This will be our go to burger place from now on! Thank you for the great experience Lenny!"}
{"text":"Another good old Lennys like the rest of them

Lunch time can get crowded and the parking lot is very small.  The drive thru lane goes a little slow but not too bad.

They have a 2 for 2 dollar special on corny dogs as well as a Lil Lenny special that comes with a burger a little bit bigger than a slider and perfect size if you dont want to kill your gut.

I would have given them 4 stars but they forgot to add mustard to my order as I requested.  Details, details..."}
{"text":"I had one of their burgers for the first time two weeks ago and I've been back about 5 times already. My family and I have been making it a point to try to support more local businesses this year and not solely depend on franchises, so in order to step away from unhealthy fast food burgers and franchises we decided to go here. We didn't have much of an expectation, but we were beyond delighted with our very first meal here and with pretty much everything we've had since. Their vanilla milk shake is very nice. Their fries are distinctive to them and always hot and finally their burgers are just awesome. The beef is well seasoned, moist, hot, and goes great with their toasted buns. It's become a new fave among our food spots and we've pretty much replaced McDonald's and other burger places with Lenny's. It's obviously slightly more expensive, but by very little. The benefits obviously being that, one the food isn't so processed, and second it's a local business, so eating here is supporting the community, and three the food is way tastier. Now I've only gotten food to go, through the drive thru so I can't speak to the actual dine in experience, but when I do I'll add it to this review. I recommend Lenny's!"}
{"text":"I am at Lennys several times a week. Always friendly and fast service and the food is great."}
{"text":"So my boyfriend and I came around 9 ish pm , I always go to the one on central and Thomas but I was in the area so we stopped , however I know it was somewhat late, but when we received our order our burger was \"crap\" super sloppy made , the bun was soggy , lettuce all over the place , my bf patty wasn't cooked all the way.  Not a good dinner for us. The customer service was like if we didn't exist we weren't acknowledge  or anything . I know it was somewhat late but we're paying customers . I expected the same service as a customer who would go in on the afternoon. By far worse Lenny's experience I've came across."}
{"text":"WOW! Found this place thanks to reviews from YelpFriends, and boy, they were right - the burgers are fantastic! Really, really awesome big burgers at low prices; super seasoned fries and even fish 'n chips for your anti-social burger-free cousin. Big portions and great prices; an almost-new restaurant in an area it's tough to find anything nice in, and great 50's-diner atmosphere inside - not hokey and over the top like some retro diners, but just right. 

I can't recommend it more highly!"}
{"text":"Food wise, this is my favorite Lenny's location. They make the perfect jalapeno cheese burger. The fries are really good too.

The location kind of sucks. Its  surrounded by a greyhound station, a liquor store and some kind of AA hall. Need I say more?"}
{"text":"This place is lovely. The environment is amazing and the people make me feel like my service is welcomed. The employees have the best attitudes I want to hang out with them!!! I love that there is a drive-thru. Who doesn't want to get their food on the go!? Got my dad a banana split. Ate half of it on the way home because it looked so YUMMY and it was. Have nothing negative to say about this place keep it up!!!!"}
{"text":"Lenny's burgers have just been around since 1984 It has a couple of different locations around the valley which all have great 50's theme with great inside to decor they make a good hamburger with many different choices."}
{"text":"Nothing fancy about Lenny's. But it's the best burger your gonna find in a drive through. I don't usually eat fast food, but when I do, it's from Lenny's."}
{"text":"Mexican burger is worth the trip here!! Unique tasting burger with perfectly cooked french fries! The atmosphere of the place is also nice. Nice, casual place to sit down and enjoy a good burger!!!"}
{"text":"Great pastrami sandwich but cut after they put in foil so little piece of foil. the best ranch fries with bacon very awesome. Still had good time"}
{"text":"The pastrami fries are pretty good, I also ordered the buffalo ranch chicken sandwich and it only had like one line of buffalo sauce ( when in the picture it's completely covered in it)and no ranch.. I told nicely but I was just given a side of buffalo sauce -__- so disappointed. The side sauce was freezing cold which just made my sandwich cold, the picture looks beyond different, not ordering that again."}
{"text":"Might as well go to portillos. For the price and quality and service u get not worth it. Their chicken tenders are not really chicken tenders, they look like a portion for 2 yr olds, small portions. They dont listen well so they screwed up our order. They dont have the right tops for cups, too big. 

Super greasy and way too hot to eat. The outside of grilled cheese wrapper burned me. Baddddd

Awful...... :("}
{"text":"Found this cute little place on Yelp. It's located at the end of an empty shopping center in a not so nice part of town. Maybe just an old area of Mesa?? I went through the drive-thru but I could see the inside and it looked very cute, like a 50's diner. The customer service was excellent. I wish I could review that separately and give five stars. We ordered a burger and fish & chips. The burger was okay but saturated in ketchup. The fish was disgusting. It had a creamy texture on the inside (maybe all of the grease?). The food was all heavily salted. I have a feeling I'll wake up in the morning super bloated!  Again, the customer service was wonderful but we won't be driving to that side of town again to visit."}
{"text":"green chiles on a burger SOUNDS good, but not when the burger isn't very good. 

i asked the guy what he recommended and he told me 'fries'. um, ok. but he ended up being right. after i wasn't a fan of my burger i ate a few of the fries and some of my $.99 rootbeer float. 

both of those are good. i probably won't be back just because i don't really want either of those on a regular basis, especially when the main dish isn't very good. 

those should be delicious compliments to a delicious burger, but not the only thing likable. 

in thought, a burger is relatively easy to make it delicious. it's pretty cut and dry but for some reason so few places can make a decent burger."}
{"text":"It was ok. I felt the burgers were a bit overpriced. If it's chicken strips you are craving, drive over to Cane's on Peoria. You'll get chicken in your strips and not just bread. I was charged for a large drink on my receipt but only received a small drink do check your ticket before signing. Also there is a fee for using a debit/credit card."}
{"text":"Great burger and fries; very old fashioned and filled with flavor. Hit the spot immediately, more backyard and back east than the major fast food chains out here. Go inside and eat for the full experience. The service is pleasant as well. I will definitely be going back here before any of the other chains when I'm in the mood for a big, delicious, and juicy burger!"}
{"text":"I came in with my wife today around 12:30 This is place is by far the best!! Great customer service and super clean store. And the food is just to die for and was great to our standards! I had a pastrami sandwich with Swiss and my wife got a garlic mushroom. I would definitely recommend this place to anyone looking for a great burger joint!! I am for sure gona be back!!"}
{"text":"I like Lenny's but will admit their burgers are a hard and miss regarding taste and presentation. Price wise, i think they are pretty overpriced. For that reason i don't go to Lenny's often. 85% burgers are good. 

This location: 
SERVICE most of the time is not good. Today it was average. Employees seemed drained and just not into customer service. - 1 star
FOOD - tasted fresh and had good taste. However burger they were just sloppy with soggy bread. Fries though were perfectly cooked; crispy, piping hot and well seasoned. 

Overall good food and so so service."}
{"text":"Burger: 2/5 tasted like a reheated premade burger. Huge and cold bun to meat ratio. 

Fries: 2/5 very little flavor

Iced tea (for those of us who don't drink soda). Disgusting 0/5

Side salad: minimal with prepackaged dressing 3/5

Onion rings: beer battered and very good. Ranch side was good too 5/5

Ambiance: cool retro 50s diner. Enjoyed the music and art 4/5

Service: average 3/5"}
{"text":"The burgers were good, but nothing special.  They actually reminded me of Burger King.  My husband ordered the Cowboy Burger with fries and cheese dipping sauce.  I ordered the #1 combo, which is a single patty burger with fries and a drink.  The fries were the kind that I like, but they had a lot of salt on them.  All the items are priced really well.  I enjoyed the atmosphere.  It's made to look like a 50's Diner.  However, it also has a drive - thru, which I didn't even realize when I've driven by several times before.  When your order is ready, they call out your number and someone brings it to you.

When you walk in, it looks kinda small, but it helps that they have bar stools on onside along with booths.  I wish that there was a foot rest on the barstools though.  Oh well, I dealt with it.  

I wanted to try their milkshakes....They looked really good, but I was full.  I will have to go back for one sometime."}
{"text":"I have been visiting this Lenny's since it opened and I was lured in by the smell of hamburgers as I biked home from work one day.  I been there with about everyone who will go.  I have had their burger on many occasions, but our stand by (my son, daughter and I after school) is cheese, or chili cheese fries and root beer floats.  The last visit was so wonderful I just have to Yelp about it!  I got my burger and it was perfect, our fries were perfectly hot and crisp (as always) , the side of cheese was warm and generous, our food arrived quickly and the service was friendly and attentive all around.  I will definitely continue to vote with my dollars for Lenny's to stay in my neighborhood!"}
{"text":"I found Lenny's recently after a service account, and was very pleasantly surprised (especially because I was just trying to find some fast food for lunch).  These are some of the best burgers I've ever eaten, and the combination of surroundings, food, and service truly makes this stand out.

The lady at the register was the sort you always hope to encounter at a lunch spot (and rarely seem to): someone who really enjoys their job and is determined to make sure you love the restaurant as much as they do.  She was friendly, happy to meet a new customer, and pleased to offer recommendations.  She was spot-on, too; I am picky about fries and shakes, and she was right about me being hooked as soon as I tried these.  The burger pushed it over the top.

I think the most impressive part, though, was the restaurant itself.  It is a small place at the end of a shopping center, and I wasn't expecting much.  The decor, though, is really cute 50's-diner stuff -- chrome and red and neon, very well-designed.  The place is clean...as in, the cleanest restaurant I've EVER been in.  You could eat off the floor...of the bathroom.  Very impressive; just made me really confident in the care that was being taken in preparing my food.  The food is diner-standard, but this is no greasy-spoon.  I will be back.  Regularly.  Even though it's a 40-minute drive from my home."}
{"text":"I don't understand why Lenny's doesn't have a 5 star rating . This location is a classic , always leave satisfied & full , one of the best burger joints in Phoenix in my opinion. Came here the other night for dinner with my family & tried their new chili cheese fries with pastrami (pretty sure it was like a secret menu item that people would create themselves) first of all their pastrami is to die for and then their chili cheese fries and are gift from the fry gods and putting it together should get a Nobel peace price"}
{"text":"Fun oldies style burger joint.  Chicken sandwich was good and juicy.  The cheese fries were good, just run out of cheese too soon.  A little pricier than I thought it would be, but fun atmosphere for the family."}
{"text":"Man, I have been driving past this place everyday for years. From the outside it looks like some kind of dive. But it is not. 
      Finally brought in by the price, I was happy to see a newly renovated interior of a classic diner and a warm welcoming staff. 
      I ordered the chile cheese Fry's and the double cheese burger and they brought the  food to me. It was amazing and for the cost - outstanding!"}
{"text":"Such a fun diner-style experience. They have hotdogs, pastrami sandwiches, and every kind of burger you can think of. Tons of different sides to like fried zucchini chili cheese fries, etc. it's an all-around great burger shop. I have the Southwest pastrami burger with chili cheese fries and it was amazing."}
{"text":"Tasted like frozen patties. Kinda expensive. & they had a sign on the soda machine saying \"one refill per visit\" like really?? Never going back to that place."}
{"text":"My brother is the one who introduced me to this place and now this where I take my fam bam to eat! LA LA LA LA LOVE the burgers here!! So bombay everytime, never disappointed :P chicken tenders are so big so my kiddos always have a \"happy tummy\" ^-^"}
{"text":"My girlfriend and I's first time in have passed by it many times and finally decided to make the stop in. We enjoyed all the decor and music it gave it a real 50's diner feel. We were happily greeted and gave good service for a first time customer. We ordered the Mexican burger and Crispy chicken sandwich and both were delicious. Would definitely recommend to anyone looking for fast service and great food!!"}
{"text":"Great food decent prices, real vintage feel to the place, a lot of things from the 50's. Pastrami chili cheese fries are really good"}
{"text":"I'll be honest.. The only reason we stopped here is because of the great reviews. The look from the outside looks old and dated but the inside is totally different. I loved the decorations and style! The service was fast and very friendly. The tables were clean and the food was decent. The prices were alright, can't beat the $1 root beer float! There is room for improvement... They need to have two bathrooms and the fountain soda sign says \" please limit refills to 1 per visit \" which I thought was odd. Overall, great place and it has a drive thru!"}
{"text":"This food was delicious. It was the best the drive through attendant was very friendly and helpful"}
{"text":"I am impressed!

Huge, delicious burgers, bargain priced. 

They have a nice menu with a variety of burgers and good looking hot dogs too.  I had a  double cheese burger. It was flame grilled and besides being big and juicy, had a nice smoky taste.  The fries were hot, crisp and nicely seasoned.  
After eating his 3/4 lb TRIPLE cheeseburger, my teen son had to have some ice cream.  For just over a buck, he got a generous soft serve cone with that crunch coat stuff that I haven't seen since I was a kid.

The place was very clean and the staff were all polite, helpful and friendly.

I foolishly drove by Lenny's for years, thinking it might not be so good.  

Don't make my mistake!

I loved Lenny's and can't wait to go back."}
{"text":"I like the place, it really has good food. The staff seems to really Hate their job. No one smiles and they are not that friendly. Seems that either they are not paid enough or are stuck working here with regrets. I eat here out of desperation."}
{"text":"5 stars this place has the best milk shakes in the whole valley!! The burgers and fries are good but the milk shakes are exceptional. The people that work there are very nice too. If you're some what regular they'll remember you. I have recommended them to many friends and family!!!"}
{"text":"Expect a solid experience. Their burgers are going to be what you expect them to be. They give you soooo  many ways to order your burger. Their sweet potato fries are great. Shakes are straight up delicious. Normal fries need work."}
{"text":"I am over the moon about this place!  It's right off the i17.  You can't miss the bright neon lights!  

After opening up the chrome shined doors, you step back in time when dining was truly an experience that was meant to be had.  Lenny's is lined along the window side with red booths and a Tiffany style lamp over each table.  At the very far end table are half sized sculptures of the Blues Brothers.  The music ranges from sock hop to 70s funk.  It's played at a volume where it's not obnoxious that you have to yell to each other, but not too low that u have to stop talking to enjoy a listen. 


That cashier was fun and her customer service skills are EXCELLENT!

The food came fast! We ordered a regular, cowboy n a Mexican.  

My kids got the cowboy burgers and loved um! They were stacked !

Hubby loved his regular burger.

I had the Mexican burger n loved it!!! It was very flavorful, although I do wish it had more of bite.  I barely made it thought half before I had to tap out. 

The fried were a bit too salty for my liking, but my hubby thought they were perfect. 

We normally visit a place once n move on, but Lenny's stopped us in out tracks. Definitely looking fwd to our next visit"}
{"text":"This location has really stepped up there game. The new building is awesome. Real 50's feel. The food is still fantastic!
I love there thick cut French fries and the seasoning has always been tasty. There burgers are always meaty and delicious! 
I just had there garlic mushroom burger and fries. 
Every time I come to this area, I stop by and grab a burger."}
{"text":"We don't get a greeting, we walk in and a young lady announces \"just so you know we're only taking to go orders.\" Ok, thanks. Good evening to you too. Food was good."}
{"text":"The Cali burgers spot is what me and my friends call this place. Being from California it reminds me of back home. I love this place & the chili cheese fries yum!"}
{"text":"Too pricey for what it is. A greasy burger. Adding cheese and other toppings makes it pricier. This is a diner/fast food burger that costs what most really good restaurant burgers do. It's fine in a pinch, but the drive thru takes forever."}
{"text":"I expected more of this place after reading the reviews, burgers where okay but nothing fancy. Just the same as all the other fastfoodchains. Location is not really nice."}
{"text":"Grossly awful way overpriced! Ordered a bacon bacon cheeseburger fries and a veggie burger. Old little pieces of soggy tomato, Brown wilted lettuce.  we took our meals back and we're told that this locations Under New Management who is trying to do Cost Cuts.  First time customer will never be back"}
{"text":"I only went through the drive thru... But it was super fast like quicker than MDs. I got my food and it was hot. Portions were bigger than I'd expected... Not super big but just right. Flavor of the burger was right on. And the bun was buttered and toasted prior which made it even better."}
{"text":"Excellent homemade style burgers, 99¢ root beer floats, cute atmosphere, and I think it says a lot when that's pretty much the only business open in the entire shopping center where it's located."}
{"text":"Back in the day before there were $14 gourmet burgers complete with locally sourced pickles there was the type of burger joint embodied by a place like Lenny's.  This is an old fashioned, calorie busting, get a malt type of place."}
{"text":"I love Lenny's but the people work there really need to pay attention to customers orders.  Every time I go there, something is made wrong or missing.  Plus the orders of french fries is pretty small compared to other places.

Please pay more attention to when a customer asks for something special to be added or taken off, there is a reason.   Besides,  without us customers,  you wouldn't have a job."}
{"text":"Holy cow this place has gone down!! They used to be so nice and great with customers- sadly not what I witnessed today. The lady taking out our was so rude and short with my family and I. I felt she was very impatient when taking our order for no obvious reason. Very unpleasant group of girls. Maybe it was the 80 degrees they had the air set to that fueled their attitudes. Can't give my money to an establishment so undeserving."}
{"text":"I was blown away by the rude behavior! Very poor customer service. We went through the drive thru for the first time based on the reviews the other night. The girl working at the window was extremely rude! She slammed the window shut before I could even get her name."}
{"text":"First time at Lennys, the cashier was very helpful with helping me decide on my entry. Good food and friendly atmosphere."}
{"text":"Today was my first time going to Lenny's burger and I was really satisfied with the great customer service from the drive thru employee . I did not get his name but he was bald and had a beard . I took a while to look over the menu and it was a first I didn't feel rushed in giving my order & he was very polite . I even asked about the different sauces they had . I wasn't a fan of the cheese dog but #2 burger was really delicious. I will definitely come back here again. My order # was 128 if the Lenny's manager reads this and wants to know who that employee was for recognition. Gained one new customer because of him. :)"}
{"text":"We decided to go again, 2nd visit. It was not super busy.. We were greeted by the cashier and I asked if there were specials.  She relayed about 6 specials. We decided on the #1. It came with fries and drink for 5.63. I subbed out fries for onion rings.
The burgers were hot and fresh, the fries cooked perfect and the onion rings were overcooked, but I LOVE them this way.  Cashier even asked if I wanted a side sauce for dipping.  I did not want the sauce, but just be clear, they are 30 cents extra. All in all a good burger. We will be back.."}
{"text":"Out in Glendale last night for my kid's track meet. Everyone was hungry so we went to a place we saw near the highway. I was kind of weary of going here because I'd never heard of it but I saw the long line and packed inside so I figured it muddy be pretty popular. So we decided to give it a try. The line moved quickly and the customer service was great (hence the 2 stars). I also thought the burger I had was pretty good too....until I woke up at 130 this morning vomiting! My stomach is so upset. I woke again about 2 hours later vomiting and stomach cramps. Now it's 5am and my stomach is still upset and I'm \"releasing\" from both ends!"}
{"text":"Awesome burgers. If I'm gonna go to the grave over cholesterol and heart blockage it might as well be in Sir Lenny's hand basket. Well done."}
{"text":"Saw this place on-line as providing the \"Best Burger\" in Arizona.  Never heard of Lenny's before so my wife and I and another couple decided we had to try it, plus its close to where we all live.  Major disappointment!!!!  Décor is 50-ish with posters, etc. of Three Stooges, Andy Griffith Show, etc.   That was OK.  We each ordered the basic cheeseburger.  None of us enjoyed this burger at all.  The patty was overcooked and dry, I mean no juice at all!  It was tasteless and needed beau coup salt to give it any flavor.  The fries were greasy, as if the oil wasn't hot enough when the potatoes were cooking.  How this place was rated as having the \"Best Burger\" in Arizona bewildered us.  I would not recommend this place to anyone.  Save your money.  You'd be better off with a Whopper or a Whattaburger."}
{"text":"This is a very comfortable, locally owned hamburger joint.  The service has been quick and accurate with a smile the times I have been there and i love the down home, clean, retro decor.  The food and the restaurant make me smile!  It is always a treat to eat here."}
{"text":"We have been waiting for a place like this to open in Chandler Arizona.  Anyone whos lived in SoCal and is now in AZ and missed places like Tops in Pasadena you will know exactly what you will get at Lenny's.
YUM!
Check all the pics others have posted."}
{"text":"This place is okay. Really expensive. Tables are dirty and the wait staff is nice. I guess. They are very quiet. Very small inside and the way they organized their tables is not high chair friendly. The food is decent."}
{"text":"Been going here since the 90s. The building has changed, but, not the food. The prices are very reasonable, $8 still gets you a burger, fries and a drink. And it's not that McDonald's garbage. I always order the Mexican burger, my personal favorite with green chile, can't be beat. The seasoned fries are also good."}
{"text":"Cute little 50's diner inspired burger place. The staff is friendly and the service is fast. It's located in an empty plaza right off the 60 and Stapley. I'm not usually to big on burgers but my boyfriend always raves about how amazing the burgers are so I ordered the Garlic mushroom combo. The burger was juicy and I loved that the fries were hot and crispy. ( I hate when places give you soggy fries) if you're in the mood for some good burgers and fries, defiantly come check this place out!"}
{"text":"Lenny's Burger has its \"BLING ON\" now with it's new place right beside the old one!!  WOW, what an awesome looking 50's style dinner Lenny created in his new place with tons of chrome everywhere on the walls and ceiling, fancy lights above each booth and really very comfy booths!!  Had lunch with Rand H, Robyn N and Mike C today.  Take a look at the pics we took today!

Lenny's Burger offers several different burger and hot dogs options but they also have a few salad options as well.  All of the burgers and dogs can be ordered as a combo with fries and a drink.  To upgrade your fries to onion rings it's just an extra 30 cents.  They have shakes, malts and floats too.

I had their #5 ~ Cowboy burger with onion rings and a soda.  It was a burger with all the trimmings including bacon and onion rings on the burger.  The beef on this burger got a little lost with all the extras but it was still very good.  I spotted their #6 the Mexican Burger with grilled onions and green chilies for my next visit!! 

The service at this Lenny's Burger is top notch!  They are very accommodating and eager to please their customers.  Their new place is really nice inside and out, so the next time your in that area and thinking about lunch, give Lenny's Burger a try.  I hope to see you there!"}
{"text":"For a fast food burger place, it's pretty good. I'd put it in the same category as 5 & Diner, similar vibe and all. Price-wise, not great bang for your buck, but okay to stop by every now and again. 
A homeless man came in asking everyone at their tables for change, and I believe it was Lenny himself who got up and asked the man to leave. I have no problem throwing coins to the needy, but nobody wants that while you're inside a diner in the middle of eating. He handled the situation promptly, and that's appreciated."}
{"text":"This is the perfect casual burger joint.  Counter service and self-serve drinks in a 50s diner atmosphere.  Clean tables and nice people.  The burgers are good.  I think the pictures don't really do them justice.  They taste much better than they look in those photos.  :)  The fries are great too, topped with a lovely savory seasoning salt.  They are so good with the house fry sauce, a spicy mayo.   I wish I could buy their seasoning salt and the fry sauce in jars to take home.  Onion rings were thick rings, battered and fried to a nice crispness.  Delicious. No soggy rings here.  We liked every food item we tried.  Also, worth noting that they have a drive-thru.

Overall, just a great place to tuck into a burger and fixings.  It's probably a good thing I don't live too close, or I'd be here twice a week.  4 stars."}
{"text":"Not a bad place at all. The prices for meals and such aren't bad. The food tastes great and the ice cream... They make a tower for you. The employees working here are very nice and they usually make sure you have everything you may need. Try the fish and chips! It's not bad!"}
{"text":"Watch out golden arches Lenny's is in town!  Great burgers, friendly staff, and a fun vibe!  If you're in the mood for a greasy burger and fries with a fun atmosphere you must check out Lenny's."}
{"text":"Outstanding Burgers..!!!  
...in a world filled with substandard Burger Restaurants, this Joint proudly rises head and shoulders above the competition...!  with Superior quality ingredients and the old grill from the original Lenny's they make one of the best Damn Burgers in all of Maricopa County... Lenny's also has wonderful Fries & Onion Rings, you gotta get 1 or more of the 6 different made in house dipping sauces that they offer..! and if you can manage a Shake too you won't be sorry.... and to top it off there's a Great staff to take and make your order to go or eat there in there Wonderful new 50's Chrome Diner... there are many Lenny's in the Valley, Please make sure you go to the one off the I-17 Freeway at Glendale Ave... That's The Only Lenny's That ROCKS My Burger World...   

Lenny's Burger
2545 W. Glendale Ave
Phoenix, AZ 85051"}
{"text":"I have been to this location twice now. The first time I was just driving by and it looked alright so I went through the drive through with my buds because they locked the dining room early (big disappointment to me). The lady working was real rude an you could tell she didn't want to be there, but who cares, its her job. I also work in the food biz, I know it sucks, but still. The burger was alright, the fries were great.
The second time I made it into the dining room before they locked it early. It was the same lady, i almost walked out, but my friends wanted to stay. Same deal....if i see here in there again, I will leave."}
{"text":"I really love the burgers, fries, and shakes here. They hit the spot, and remind me of the food from back home in Los Angeles. However, some employees seem very \"meh\" about their job. It's kind of a downer, and compared to places like Chick fil A and In N Out, the customer service falls short. Overall, great place to grub at."}
{"text":"I'd had Lennys in Phoenix and this mesa location is no different!! Great fries and burgers! Decently priced as well!"}
{"text":"Parking is pretty good. They also have a drive thru. Walking in the decor is equal to any other 50's diner burger joint with great pictures, statues and neon lights. The service was fast, they got our order right which was nice and it was super cheap. Burger was pretty good. Fries crispy, onion ring breaking wasn't great but edible. The music was great."}
{"text":"Yesterday burger was perfecto even though the service was a little slow give them the one star. Today chili dog was the nastiest, disgusting but but presented fairly nice to cover up these old,  dry, nasty hot dog. I tasty it in the first bite but took the third bit to be smart enough to know something not right, Im praying that I don't get sick from what I did eat"}
{"text":"There are several outposts of Lenny's around town.  This is the nicest one I have been to.  Getting there at the end of lunch hour it was quiet.  By the time I was done the place was packed again and people were waiting for tables to clear.  I don't think I have ever had a bad meal at Lenny's and my Mushroom Swiss burger and fries this trip were no exception"}
{"text":"Nice atmosphere I love 50s style diners , have been to many across the nation . I will continue to visit here despite the fact that the older woman who claims to be a manager is a complete  witch , i asked her for a little paper bowl for my 3 year old to eat his ice cream cone out of and she basically told me to go to hell , my son ended up making a mess w the ice cream on the table and she gave us dirty looks , , spare a little foam bowl bitch"}
{"text":"Not only do they put there heart and soul into the food they serve, but the staff here is second to none. Thanks for making Delicious Burger choices and for being one of the friendliest places we love to have a meal..."}
{"text":"Lenny's Rocks!!!  Their Mushroom Swiss burger with garlic mayo is the BOMB!!  Have also tried several other burgers and the fish and chips.  Love it!  Their fries and sweet potato fries are good too.  Definitely recommend, and will be going back again."}
{"text":"Weak! Just ordered a double cheeseburger and fries. Fries were miserable. Burger had ZERO flavor. I could taste mayo more than meat or cheese. Save your money, go to fudruckers or red robin"}
{"text":"Fantastic  root beer floats.  Great chili.  I haven't  tried anything else but maybe next time I will."}
{"text":"This is our celebration place. Comfortable and everyone has a favorite and the portions are big enough for us to share. We have been in several locations and they have been great."}
{"text":"I wish that I could give zero stars. My wife just was stuck in the drive through for over 30 minutes. While watching people walk in the restaurant, eat and leave, she was still waiting. Upon getting the food and coming home 10 minutes away, the food was ice cold!!!  I called and spoke to the manager and they would do nothing for me. All Lenny's had to do was refund my wife's $18.50 and you would have had a customer for life. There have been several other times that I have been treated rudely, but this is the last straw. By doing nothing, Lenny's will never get another cent from me and I will make sure and let everyone I know how horrible the customer service was. DON'T GO"}
{"text":"First of all, the ambience of this place is amazing. The food is spectacular. Fresh. And you can even watch them make it. I highly recommend this restaurant!"}
{"text":"My husband & I love Lenny's!!!   We first found  a Lenny's Burger at this location on Southern.  My husband makes it a point & schedules his appointments so that he can stop at Lenny's for his favorite.... a tuna melt & a root beer float!   For me .... I love the Hatch Green Chile Cheeseburger!   It is scrumptious!!!!   I have to eat gf & they even have the best gf hamburger bun I have ever had!   ...........   Lenny's just opened a new store on Alma School just north of Warner!   Same fantastic food & it is as cute as any place I have ever seen!!  A \"50's\" style retro Diner with authentic items.   Spotless!  Great Service & Delicious food!"}
{"text":"Good burger unique combo of toppings.  Mexican burger was good.  Clean.  Neat 50's diner vibe.  But would you please turn on the a/c?  I melted in the vinyl booth.  Temperature not much difference from indoors than outside."}
{"text":"I love Lenny's! They make a great burger and even BETTER shakes! Definitely a favorite!"}
{"text":"Lenny is the man and his burgers are some of the best you'll find in the Valley! I first met Lenny and his family at the Burger Battle a couple months ago. After experiencing how great their burgers tasted and how nice the family was, my girlfriend and I decided we'll have to check out one of the actual restaurants in Phoenix. I am glad we did because it reminded me why we gave Lenny's Burger our vote for best at the Burger Battle! 

My girlfriend and I both ordered the Ranch Bacon Cheeseburger and it was out of this world! Lenny came by to check and see how everything was and we informed him that everything was just as delicious as we remembered it from the contest. It was nice to get to talk to him about Lenny's Burger history in Phoenix too. The fries are awesome and I recommend trying one of their six dipping sauces. Everything is reasonably priced, the seating area is nicely designed and clean, and service was great! I'll definitely come back to Lenny's to satisfy my frequent burger cravings."}
{"text":"A very good burger. I ordered the Mexican double cheeseburger combo and added Avocado to my burger. The burger was piping hot, seasoned okay, but was cooked a bit too well for my tastes. Thus the burger patty was a tad dry. The added avocado was puréed, which I didn't expect. However, the grilled onions and chiles were perfectly cooked and the bun was buttery and soft. By no means is this place a slouch in the burger department. The fries were pretty average, and a little overlooked. In the world of fast food Lenny's exceeds all, except for 5 guys and in-n-out.  I would recommend definitely recommend this place."}
{"text":"Lenny's unfortunately was a Total LET DOWN. The quality of food is definitely not the same as it was a few years ago.  We went there tonight (Order #62) inside and ordered our food.  We ordered 2 Patty Melts (Plain -Meat & Cheese Only), 2 orders of Fries and a Pastrami Dip with Auju Sauce on the side.  We get home and They get our order wrong. Yup, onions on both Patty Melts  and only 1 order of fries in the bag and they even forgot the Auju Sauce for the Pastrami Dip!  We called them back immediately to let them know the order was incorrect. The girl who answered the phone asked us to call back tomorrow because there was no manager there.  SERIOUSLY!  Instead of telling us to bring our food back so they can fix it.  She tells us to call back tomorrow.  REALLY! Ugh, I don't think so.  My hubby told her, \"Ugh NO, what about our dinner tonight.  We are bringing the order back tonight so you can make it correctly.\"  So we drive back to Lenny's (such an inconvenience) with the incorrect order and they did make it right this time, almost.   We checked our order before we left and had to ask for the Auju Sauce because they failed again to put that in the bag.  Got home to finally eat the food and the Pastrami was Greasy and Saltier than ever.  The Patty Melts were not good at all.  No flavor.  Unfortunately, The only decent thing we got tonight were the fries.  I'm so sad because I use to like Lenny's.  Not after tonight's experience.  I'm so sad and Disappointed.  Well I guess we won't be going there again."}
{"text":"So I had just gotten done with my daughters dental appointment. I wanted a burger. This was the right place to go! The burgers are amazing! Not to expensive and great reviews! The ice cream sundaes are awesome! They have great music and great service! I just wish I lived closer!"}
{"text":"Hands down, the best place to go to for burgers and shakes. This is my go-to spot when I'm not sure what to eat, and they haven't disappointed me yet either. I've ordered from here numerous times that I lost count, the mushroom burgers are the best. The patty melt was a bit weak and their green chili is a little weak as well. If you've had NM chili, nothing else really compares. But come get some burgers"}
{"text":"Best burger? More like nope! Their chili fries tasted awful and they use that cheap cheese liquid"}
{"text":"I watched staff handle a disgruntled customer flawlessly! Super impressed! Also, they have great chili cheese dogs!"}
{"text":"This place is amazing. Especially the pastrami burger. Do yourself a favor and check out this hole-in-the-wall type place. They have cool 50's style decor, huge and delicious burgers, and cheap root beer floats. I have never gone to Lenny's and been disappointed. But seriously, try the pastrami burger."}
{"text":"Love the food and prices.

Only giving 3 stars because we wanted to do a large catering type of order for their pastrami sandwiches and fries for a huge birthday party. Both times we asked, in person and by phone, we were told pretty quickly that they don't offer that,there's no discount or anything special at all, but that we could place an order that day and pay full price for everything. 

Essentially what this told us is that no, we aren't willing to work anything out with you and we don't want your money, and we don't value you as customers who live in the local area and who may recommend us to others."}
{"text":"My first time here, it's small and cozy diner atmosphere. Good friendly customer service. The girl who took my order was very nice and helpful, she gave me a small sample of the horchata ice cream before I ordered it.  I got the Ranch burger with thousand island instead of mayo and it was soooo good!!! Yum..yum!! Their fries were hot, fresh and very tasteful!!! They grill their burgers once you order them, which is nice! Unlike some of these other fast food places they have their food sitting under a hot lamp. Not Lenny's!! Their food is fresh! 
My husband ordered the jamocha shake and I had the horchata and it was soooo delicious!!!! I definitely recommend the horchata shake! 
The inside was nice and clean, they bring your food out to you once it's done. Overall I had a good experience and definitely will be back."}
{"text":"Solo fui una ves con mi familia, pero no fue realmente de mi agrado, el lugar es agradable pero la comida deja mucho que desear está muy falta de sabor las papas estaban como recalentadas  y no es como que sea un lugar muy barato tampoco me refiero a que sea caro pero creo que cuando algo no te gusta pues si te pesa lo que gastaste y viceversa, el servicio fue amable está bien localizado pero igual no volvería, igual estoy consciente de que en gustos se rompen géneros."}
{"text":"Horrible, hamburger... I was not happy one bit. The booths are tight and the food is mediocre. Sorry I am being honest. The onion rings were not that great either."}
{"text":"Finally got a chance to try Lenny's had the Polish which was very good , wife had a burger which she said was good , o rings very good also , good food for a good price , the cashier could have been a little friendlier but then again she looked like she was about 15 years old , all in all we will definitely be back, good job"}
{"text":"I had two chili cheese dogs and a butterscotch shake. The shake was amazing, but I've had better hot dogs from shady gas stations with burnt, crusty rollers. The chili was very bland, the hot dog tasted like it had been chilling in a pot of water for a while and they just heated it up, and the only way to describe the queso is that there's no way it didn't come out of a bulk bag of liquid cheese. They intentionally turned off their drive through lights an hour before close and a customer had to ask them to turn them on so they could order. If you're looking for some quick ice cream, come here."}
{"text":"Let me just start by saying a YUM! The burger is flame broiled juicy and seasoned just right. I like mine with crispy bacon and cheese. The cheese is gooey and melted by the delicious greasyness of it all! The fries are fat and go great with the greasy, juicy yummyness!

If you want a tasty fat juicy burger go see Lenny! They also have a drive through at this location. Perfect on my way home."}
{"text":"Great Burgers!  Fast service! Staff is always friendly!

Located on Stapley between Hwy 60 and Southern; East side of street."}
{"text":"Love the 99 cent rootbeer floats. As far as the food, I'm not so sure."}
{"text":"So I fall asleep watching the food network, I wake up and was sleeping through a show about amazing hot dog places all across the U.S., now, I am not a hot dog fan, but I must have had some sort of hot dog subliminal message pumped into my brain while I slept, because I needed a hot dog like 10 minutes ago. 

I jump on Yelp to find a hot dog place near my house....They are all closed on Sunday or further then I care to drive. So I think, hey, lets hit up Lenny's, I bet they have a decent dog. 

I believe I gained 5 pounds from this meal. I ordered the polish sausage, mustard, onion and relish. Fries and a butterscotch shake. 

The polish sausage was insanely good, in fact, I cant stop thinking about it! Its a MUST try! 

The fries are fantastic, they put season salt on them! Who else does that? No one! I could eat these french fries all day long. 

AND lets not forget the butterscotch shake! People, this was my very first butterscotch shake, I was a butterscotch shake virgin. I am soooo glad I no longer am, because now I am a butterscotch shake slut! I will do what I can to get my paws on one of these amazing treats. Do yourself a favor and order the large, your eyes will fall out of their sockets when you see how large it is. I have been nursing mine for 3 days now. Its HUGE! You could easily split it with 2-3 people! 

Lenny's, I heart you."}
{"text":"Always love me a Lenny's burger! Don't forget the bacon!! Only thing keeping you from 5 stars is your soggy bun, not sure what sauce it is that makes it so soggy, but def use less it. The Bacon is awesome!!! Love the fries and the environment is very welcoming. It is a old style burger joint that I will continue to visit.  Highly recommended if you're looking to catch a burger, put down the Big Mac."}
{"text":"So Good! I love these burgers! I love the Fries! I love their shakes!  Many a Saturday morning after practice spent here! Yummy! My Inner Fat kids is salivating!"}
{"text":"A great find on our way back into Phoenix to catch a flight home. I had the Mexican Burger which really hit the spot ... Onions, green chilies, and two cheeses. The fries were quite good, too.

The inside is decorated like a 50's burger joint."}
{"text":"Great burgers, probably one of the best in town. There good is really good but the condition of the restaurant and restrooms were lacking. Just seemed a little beat up and dirty. Next time we'll just go through the drive through."}
{"text":"My boyfriend and I went to Lenny's Burger to use the free burger combo tickets we received from the Burger Battle.   My vote was for Lenny at the Burger Battle so I was thrilled to check out the actual restaurant.  I met Lenny and his family once before at the Burger Battle and thought they were friendly, informative, and very nice.

Today, he was at his restaurant and I got to hear about how Lenny's opened and some more about the family owned business!  Lenny moved from Detroit and has been in Arizona since 1984 serving his amazing burgers.   My visit here was fantastic.  I ordered a Ranch Bacon Cheeseburger with fries. The service was great, the food was delicious (just the way I remembered it) and Lenny was there with a smile.  He even came by our table to see how everything was.  

I recommend this place to anyone looking for great service and amazing burgers!! 

Job well done Lenny!"}
{"text":"While the food was hot, order was wrong. Ordered double got single.  The service was too slow for me to be interested in getting it fixed. The sourdough burger came on plain toasted white bread and was dry. At least the fried were decent and hot. They also did not screw up the fountain drink. 2 lame and wrong burgers for $20 could have been had for 10 at Jack in the box."}
{"text":"The Mesa Lenny's has been our favorite Lenny's location for years. The staff is always friendly, the establishment is always clean, the food is outstanding, and who can beat a 99 cent rootbeer float? We've visited all the other Lenny's in the Valley and this one is a step above all the rest."}
{"text":"I would have given a better review their food is great but not fond of the customer service. We came in to enjoy our lunch we had a 7 year old with us and she had to use the restroom so bad that she was holding herself. Well they have a rule about going thru the line and paying for your meal before using the bathroom. Well there was a very long line and we had no time to wait for her to use it. Lucky someone was coming out of the bathroom so we dashed in there. I feel that it would have turned out really badly. I'm not happy about this policy and will think twice before coming back. Even though the food is great."}
{"text":"I've been here one time and will never go back the corn dog was basically Frozen and the burger was so salty it was inedible if you actually like this place you do not have an actual pallet and you only eat salt"}
{"text":"So good! The staff was informative and friendly, the lobby was clean, couldn't ask for more!  Get the cowboy burger!"}
{"text":"Great place! It makes you feel like you jumped into a time machine back into the 60's. My boyfriend and I came here for our first time and share the chili cheese fries and shared a rootbeer float everything was amazing!! Everything came out quick and hot! Can't wait to come back and try more of there delicious food!"}
{"text":"This place has awesome food ! Super good burgers I got the #1 and Fry's it was super hot and was delicious I highly recommend!"}
{"text":"If you're looking for a burger joint this is it! Juicy burgers priced just right! The atmosphere really takes you back as if you were in happy days! Love the cheese fries!"}
{"text":"With 5 locations in the Valley of the Sun to serve you, if you are in need of a good burger, Lenny's most likely will have a location convenient to you.

It is a 50's style diner with burger, dogs, sandwiches, salads and a small breakfast menu to serve you. With burger in the name that was the route i took.

They have a solid burger specialty menu with a mexican burger, a cowboy and a garlic mushroom  swiss burger. I went basic and got the the Single. They do allow you to pick your style.  The choices are;

Ranch Burger - Mayo Sauce
Country Burger - 1000 Island
Tasty Burger - Mustard & Ketchup
Hickory Burger - BBQ Sauce

I went Country. The best way i would describe the burger was it tasted like a Whopper did when i was kid and i loved the Whopper as a kid. It had a great smoky grilled flavor, ample american cheese, nice tomato and onion and a nicely fitting sesame bun. I know that the whopper does not come with thousand island but rather ketchup and mayo but hopefully you get the example. The fries were steak cut style and very generous.

Overal a very solid 3.5 star burger and with my complicayed ranking system i will give them a four."}
{"text":"while the milkshakes weren't bad in taste , I didn't get the milkshake I asked for , my fiancé's milkshake was melted by the time we got it and we waited 20 min in the drive thru to get them. I believe Lenny's should find a better drive thru system. Hopefully one day we can give it another try inside rather than the drive thru."}
{"text":"Good burgers, Good fries, good service... As  an Angelina Im used to seeing burger  joints every where then I moved to AZ and it all changed. Now I feel if I crave a burger I need to do some searching! But now I know bout Lennys! A bit pricey but hey why not LOL"}
{"text":"Lenny's serves a good burger in an old school diner style feel. They offer all the fast food favorites like shakes, fries and burgers. We ended up with a mushroom swiss burger and a Mexican burger. The mushroom swiss had a balanced amount of cheese and mushroom and came with lettuce and tomato. I preferred the taste of the Mexican burger though due to the inclusion of green chile giving it a spicy kick. The burger patty itself tasted decent, cooked well done.

The banana shake I tried had good flavor and consistency. As for sides, the onion rings I ordered were great. They had a nicely crisp batter with sweet cooked onion inside.

Service was decent and our orders took only a few minutes to be made. One thing to note though is that they will charge you extra if you are paying by credit card. We didn't see any sign stating this policy and weren't aware of this surcharge until we looked at our receipt.

Overall, pretty good!"}
{"text":"This is our late night burger spot if we are not  feeling like going far, maybe a few times a year. They have a decent burger, but not the best I've ever had. We always go through the drive through, except for our very first time. It is usually pretty busy inside when we have been, so we like to avoid the crowd."}
{"text":"Had sourdough bacon ranch sandwich.  Hubby had swiss mushroom burger. Side of regular fries and a loaded fry.  ALL were perfectly prepared, hot and delicious.  Cook was a friendly Latina.  We thanked her for the great food. Took a PB and a banana shake for the ride home. 
Will visit again and hope it's as good as the first time."}
{"text":"This review has nothing to do with food. I was in a fairly bad car accident yesterday directly in front of this diner. I am a social worker and was transporting two clients-- a baby and a toddler. And it was roughly 115° outside. The AC was the first thing in my car to quit and I had to get the kids indoors to avoid heat stroke. I went inside the diner and was promptly helped by a young waitress. She wrote down the address of the restaurant-- a big help because I was pretty shaken and unsure of the exact cross streets when I was trying to direct 911 over the phone. She also brought ice cold water bottles for us and a high chair for the baby. I didn't get her name so I won't be able to call her manager and commend her for a job well done. I sat in a booth there for 3 hours either talking to police, GEICO, tow trucks, etc. Being out in the heat was obviously not an option so I was relieved to have somewhere to sit down in air conditioning and deal with my crisis. Sorry if I caused a scene, guys! Lol! But thank you to the kind staff at Lenny's for easing my stress during a crisis."}
{"text":"I went here a few days ago with my mom and my family n we loved it. I am kinda picky with my hamburgers, they have to be flame broiled or similar. I can't stand that McDonald's or Wendy's processed crap. So upon entering here I immediately loved the setup. It was like an old 60's diner. There was all sorts of cool memorablilia and signs from the era on the wall and a cool old jukebox that's not working but was still cool. I ordered the double burger meal which cost around $9.50 and that's kind of expensive but the quality of the burger makes it worth it. The french fries were good and salted n seasoned perfectly. The place is a lil more expensive but the food is great and totally worth it. We will be back here again."}
{"text":"I ordered in the drive thru 2 cheeses burgers with grilled onions, bacon, lettuce and tomato and 1 regular Pepsi with no ice.  When I got home we had 2 cheese burgers with RAW onions, MUSHROOMS, bacon, lettuce and tomatoes and a regular Pepsi with ice.  I do not speak with any type of accent and they were NOT busy.   Food is very good, good fast service.  Cooked to order WAY OFF is why I gave them 3 stars."}
{"text":"Yeah, Lenny's gets 4 well deserved stars! ( Could of had 5, but we will discuss why.)

Not because its super fancy, with servers waiting on you hand and foot.
Not because of the fine silver and china place settings.
Why then?
Because sometimes you get a hankering for some good ole greasy diner food.
And Lenny's comes through!
Me and the family stopped in, and everyone was happy with what they got!
My wife got the Lenny burger with fries. I did not get to taste it, but she ate the whole thing, so I can say with over 20 years with her, that is a good thing as far as quality and taste go.
I got the fish sandwich.  For something so simplistic in its construction, it was filled with flavor. I think the batter on the fish was seasoned...then tartar sauce, mustard, pickles, American cheese slices, and shredded lettuce.
YUM. I also got the chili cheese fries. These were textbook diner-style chili cheese fries.

Now for the reason for loss of star. My daughter is vegetarian. On the website for the location we went to, the menu included a veggie patty.
When we ordered, we were told that they didn't have any available.
My daughter ended up having to eat cheese fries. I would be immensely disappointed, too. She did enjoy her shake, of which Lenny's has no shortage of flavors.

The inside is properly decorated with tons of diner/50's era wall signs and posters.
Minus the menu issue, we all enjoyed it thoroughly, and will be back for sure."}
{"text":"Lenny's is always a classic. Every time I go I make sure to dine inside. The music is great and the scenery reminds me of my grandparents. The BLT is the best on the menu. Add some avocado and 1000 island sauce, amazing flavors ! Today when I had went the avocado was a little old, a bit brown. But never the less, the burger was still delicious as ever !! Thanks for always satisfying! YOU GO LENNY !!!"}
{"text":"I do like tasty burgers. I normally get chicken sandwiches at fast food restaurants, but the place has \"burgers\" in the menu, so I thought \"why not?\". I'm glad I went with my gut here. I simply had the single burger but it was definitely enough to fill me up! My 15 mo son had yet to eat a hamburger before today, and he ate his whole slider! My husband had the Cowboy burger and it was huge and delicious. Prices are extremely reasonable for what you get. The atmosphere was fun, too. Only 4 stars because we got a drink and filled the cup with Sobe, and it tasted waaaay watered down."}
{"text":"WOW. A few days back, tried Lenny's for the first time, and was not impressed.. I was contacted by the owner, and he graciously offered to correct the situation. Instant awesome. I was an oscillating combo of skeptical and optimistic about my next experience at Lobby's, and I'm SO GLAD to say that my experience today was FANTASTIC. Figured I'd  bring home a few different items from the menu including : Triple Cheeseburger.. SO FANTASTIC. SO CHEESY. SO MEATY. SO TASTY. LOVED IT. GIGANTIC. HUGE. BurgerPerfekt!!! Also grabbed a few different hot dogs, and a Mexican Burger. Those were great too. The next real gold star winner are the ONION RINGS. These are serious. Huge portion, cooked perfectly, and absolutely wonderful.. batter dipped too (i detest breaded onion rings..)  I'm sooooo glad that I gave Lenny's a second try because I now rank them VERY high on my list of local burger places. WOO!"}
{"text":"Damn good. By far better than JITB in front. $12 for a combo. Price and crowd only reason to bump it down to 4*. Otherwise, awesome. Recommend double cheeseburger with bacon and avocados and onion rings. Absolutely decent and close enough to freeway if in a hurry."}
{"text":"I ordered veggie burger and it was mushy and made me ill...the fried zucchini tasted like the oil they were fried in was old. I will not be returning..."}
{"text":"Met The Lenny today when I was visiting my dad at a rehab facility. Lenny was so gracious and passionate about his burger shops that I knew I needed to try one out before leaving Phoenix. What a great decision. 

My mom ordered a Mexican burger combo and I had the pastrami burger combo. Everything was fantastic from the moment we pulled into the parking lot until we left. Excellent service from the cashier and manager who helped her out with a coupon we had. Food was prepared perfectly and quickly. 

Fries were superb. Slightly seasoned, a little crunchy on the outside, soft on the inside. Yum. 

Burgers were also superb. Tasty, hot, juicy, and just messy enough to make you salivate. I rarely get pastrami anymore but love it. Really great with the burger. A little salty like pastrami should be. Rich and meaty like a good burger needs to be. 

Will I be back? Hell yes. Hopefully before this trip ends."}
{"text":"I've lived next to Lenny's for a while now and it went under my radar until recently. This is one of the best burger places in the city. I regret not hearing about this place earlier."}
{"text":"Ordered 2 chili hotdogs, and a chicken salad. Hotdogs didn't taste good at all, like they were sitting for a little bit then added chili and cheese. The salad only came with 1 ranch, and my girl friend ordered with no Tomatoes and of course it did."}
{"text":"Amazing service the young man with glasses who wears a black shirt is very nice and makes sure we have good service so if the company who owns Lenny's burger sees this please give him a bonus and something. He is amazing."}
{"text":"A+ customer service. Food is too notch. Very 50'sish feel. The pastrami chili cheese fries are legit. Had the double burger and it was cooked perfectly. Huge and delicious. Great atmosphere, with super friendly staff. I can see myself coming here more often."}
{"text":"Please READ entire review!!!!!
My kids are always excited about lennys, but this visit.. Not happy!!! Drive through took forever! Ordered the crispy chicken which probably was a mistake at a birger joint... It was not good and sandwich was so soggy!!!!!! Chicken had weird taste to it! Also, we ordered a bacon cheeseburger with just pickle and ketcup, but yet no ketchup and now mustard on it!!! Really people you want more than minimum wage??? Next up I paid extra for ranch and cheese sauce which I did not recieve!!!! Kinda annoying when you are Already several miles away and are not turning back to wait in line again for their uneccessary screw up!!!

Sooo...a day or two after I wrote this review I recieved a message from the owner stating they were very sorry for my Sub par visit. She wanted to make it better!! She asked if I wanted to come in or have to food delivered to my work. Customer service at it's finest!!! Kept in contact through yelp and responded immediately!!!! We went today to have our lunch and they treatsd us like royalty!!! Honestly, it was amazing!!! And.... The food was just as it should have been... Delicious!!!!! We even had THE Lenny come to our table to make sure everything was satisfactory!!! Wow... Talk about how to run a company right!!! Thanks again for making the wrong a right!! jen"}
{"text":"I practically grew up with Lenny's, I've been going there since I was 10. This was way before they upgraded to the nice eatery it is now. Although I do miss the good old days of the small hole in the wall shop he had! 'Lenny' himself is very nice, very good to meet you sir! I highly recommend eating here"}
{"text":"Food was good but ruined by the the 33 cents extra I had to pay because I used my bank card. Won't come here again.  I'll stick to the one on Central Avenue. That's the BEST one."}
{"text":"Left the house and flipped a penny in which way to turn at every major intersection. We ended up finding Lenny's and we couldn't have been happier. The food is great value. I had the pastrami, my wife had a ranch burger, and we split bacon cheese fries. Everything was treated excellent. The restaurant had great character, like walking into the fifties. Will definitely make it a point to make it back this way."}
{"text":"I want my old Lenny's back. Since moving into your new building several years ago, I have noticed a lack of care, a decrease in quality, and service.

In my last few visits I have experience issues with my order dealing with the quality, quantity, and correctness of my orders.  and I have called, emailed, and left my name for a manager/owner to contact me.

It is a pure shame because I love supporting and referring to mom & pop place.

On my last visit we came about 30 minutes before closing and ordered the Mexican burger adding lettuce and tomatoes,  the meat was dry, and over cooked, their was almost no green chilies, and they didn't put the lettuce and tomatoes that i was charged for on it.   When I went to the counter I got additute. and few minutes later a small tray of the missing items was brought to my table, by then my burger was almost gone. 

While we were eating they started mopping the floor with a soured smelling mop, now don't get me wrong I understand that restaurants but a lot of pressure on their employee's to get their employees off the clock as soon as possible, but at least use clean water so it does not ruin my dining experience.

I gave 2 star because I have been a customer for a long time and I know they could do better (but I should only give them 1 star for my current experiences ) small business guy just remember bigger is not always better.   I still want my old hole in the wall Lenny's back.  even if your are in a bigger new building don't lose what u had.

Currently I cannot recommend Lenny's"}
{"text":"We've been going to Lenny's for a couple of years.  They used to be excellent, but the service and the food have both gone downhill.  Tonight, we brought our little foster child in for a banana split, as he'd never had one.  We ordered 2-one for my husband and one for me and our little guy to share.  My husband ordered his with nuts and I ordered mine without.  Mine was served first and as soon as we started to dig in, (and had unfortunately both taken a couple to bites) I noticed a big hair entwined right in the middle of the ice cream.  As my husband's split with the nuts had not arrived I just waited until his was served to report it to the server.  Well, the nuts must have been imported or something, because it took a full 10 minutes between mine being served and his.  I pointed out the hair and another was made fairly quickly.  I noticed the pineapple was not quite yellow, so I gave it a taste before we let our kiddo try it and, sure enough, it has a weird, almost fermented flavor (must have been sitting in the can for a LOOOONG time).  As we didn't want to hassle it because we had already complained about the hair, I just scraped the pineapple off.  It was a totally disgusting experience, and the two banana splits sure weren't worth $13.  We're done with this place-they need to hire a new staff!!!"}
{"text":"I ordered my Lenny's bbq burger over the phone and was told it would be ready within 10 minutes. I arrived about 15 minutes later and the cashier couldn't find my burger. 
Turns out I ordered from the wrong location. There's a Lenny's Burger SHOP also on Glendale Avenue that I mistakenly ordered from. Confusing!
This was my first time at Lenny's so I didn't know all the options they had on the menu. I saw a picture of the Mexican burger and decided to get that instead. It was ready within 2 minutes. It's a cute place so I decided to eat in.
This burger was delicious with, yummy grilled onions, sliced green chilli's and  ranch saunce and the fries were big and I couldn't even eat all mine. 
Also for such a delicious burger they are well priced, my combo was $6, almost the same price as a fast food joint but this food tastes better.
Lenny, the restaraunts namesake, was there and greeting people. He was really nice, there were two other people who had order issues and he took care of them right away. He said that since they've moved to the new location it's been overwhelmingly busy. So perhaps that's why there were order issues. They are still working out the kinks. I'd return here with frirends."}
{"text":"Love this place, love the service, love the happy smiles, love the bringing the hamburgers to our table with a smile, love the atmosphere. And I love the music. And they have great food!"}
{"text":"This is a solid tasty burger. Cheep and cheerful. 3. At least at this location the flame broiled sandwich was not greasy this evening, a big plus. The building is all new and the house is looking like a vintage diner.

Having already covered many of the burger institutions that are routinely heralded on yelps \"best of\" lists by all of the locals, I decided to take a look at Lenny's before working my way back home. I believe it is time to say the Lenny burger is worth it."}
{"text":"A little disappointed today guys.  The service was quick and friendly, but someone dropped the ball on my order.  My order is very simple - a double cheeseburger with bacon and mayo only.  

When my burger arrived, it had all of the regular toppings, lettuce, tomato, onions, etc.  No big deal, I nicely took it back and told them about the mistake.  Five minutes later, my replacement burger arrived.  I open it up and to my surprise, there are still remnants of the old toppings.  They literally dissected the first burger and glued it back together, complete with most of the original shredded lettuce glued to the cheese.

Pretty disappointing for a $8 burger.

Check# 702347
Register 1
3:53pm"}
{"text":"I have been to Lenny's several time always enjoy the food and prompt service. My favorite is the pastrami burger with a root beer float"}
{"text":"Now Lennys is by no means completely bad but compared to what it used to be i am so disappointed and sad. I've been coming here for 6 years and was always satisfied until the prep for the new building. 

It obviously wasnt cheap to build a new place and i can tell they took it out on their loyal customers. I used to be able to come here on my lunch break with a five dollar bill in hand and get a no 1 combo with a BIG soft drink. First the price went up about a buck, thats fine its not gonna cost the same forever. But then as they were planning the new build there went the big drink in exchange for a small drink not half the size it used to be.

Now with the new building open prices are even higher, food is nothing like it used to be (half assed), food takes ten times longer to come out, and none of the old friendly staff is there, just pimply teen agers that don't give a shit and are rood as hell. Plus they now wrap their food in this tin foil shit that makes my food even worse bc now its soggy AND half assed- I'm assuming the new wrap is cheaper.

The whole place has become a production. Lenny you may have had the best burger in town at one point and i may have agreed but not anymore, not even close.

I paid 9.48 for a no 1 combo with a beyond SMALL shake. Long cry from its roots. Just another burger king or mcdonalds now..."}
{"text":"It blows my mind that anyone can think In-N-Out is better than Lenny's. In-N-Out has to be the most overrated place ever. I have no idea what the appeal is; the patties are thin, the cheese is mediocre and the fries are terrible. The burger itself tastes okay, but nothing better than, say, Whataburger, which I think is a lot better than In-N-Out. Lenny's patties are actually beefy (pun intended), their cheese is good and their fries are 100x better than In-N-Out. Is it the best burger joint around? No, but it's a lot better than In-N-Out."}
{"text":"This might be the biggest bang for your buck in the entire valley. Lenny's serves up good old fashioned burgers, shakes, and fries... The decor is cute-over-the-top 50's and it just works just fine - Well done you guys! They even have a drive-thru!

*Again, I am astonished that reviewers would give this little family-run joint such a hard time - one star??? A freaking McDonald's in Iran doesn't deserve that. How would you rate the What-a-burger down the street?  Huh? Seriously, save the one-star reviews for food poisoning you drama queens. (I'm mostly kidding - no death threats this time)"}
{"text":"Had the patty melt and it was very good, the cheese fell from your mouth with every bite! Had the pastrami jalapeño fries as well and they were good and a perfect kick if in the mood for something spicy. The milk shake was the perfect kind of sweet if you like something sweet but not too sweet. I will come back to this location to try other meals!"}
{"text":"Wow! Loved the classic burger and fries! So many other great options too like pastrami sandwich or chicken strips.  Very friendly atmosphere, the staff was so attentive, and the 50's diner feel was so fun, not at all like a typical fast food restaurant. I will definitely be back! I would recommend this place over a typical fast food burger joint."}
{"text":"Good stuff! The fries are the best! I wish I could eat here everyday, but I will die if I did. So I go every couple month's. Love this place!"}
{"text":"I've only been to Lenny's a handful of times and never this location until last week. Swung through the drive through to get a quick burger and fries while running errands and was on my way in under 5 minutes. The burger was pretty good as were the fries, though they were a bit heavier salted than I would have preferred. Definitely check this place out if you want a good burger and prefer to avoid the normal McChain places."}
{"text":"Today is July 18,2014, my wife and I went to Lenny's thinking it would be good as usual. We were wrong. My double burger was something that was pre cooked and dried out. Had never had such a horrible experience here before. Wondered how our food got to so quick, now I know. Wife was not happy with her hot dogs either. After going there many times before, will never go there again."}
{"text":"So good! I can't wait to try something else from the menu! But like next month, after my cholesterol recovers. For this first visit, I ordered the #1 with cheese fries (because, well, cheese) and a drink. My husband ordered the #5 garlic mushroom burger with chili cheese fries and a drink. Our total bill was under $20. Granted, they put chili on my fries mistakenly (happy accident). Others might not be ok with that. It's the only reason they missed that last star."}
{"text":"I went today for lunch and WOW I can't say how great this place was.  Ok you do have to get past the fact it's not the best looking location or even in the best area but this place is a must experience.  I got the Mexican Burger which came with grilled onions, mayo, monterry jack cheese, and green chili's.  I tried a fry first and was amazed I usually don't like the bigger cut fries cause they are never crispy enough but no these fries were the best I've had in a long time.  They came with seasoned salt on them and were just amazing.  I had a milkshake with m&m's which was amazing as well.  I can't say enough about how good this place is.  If you have never went as I never had you need to go NOW."}
{"text":"We had THE BEST burgers and shakes at Lenny's!  We met the assistant manager Carly, who is an absolute doll! She asked us a few times if we were happy with our order.  She genuinely cared about our experience!  The restaurant was clean and had a really cute 1950s theme.  The next time I'm in PHX I'll definitely go back!!!"}
{"text":"I had the pastrami burger. It was sooooo good. I've been looking for a good pastrami in Phoenix every since I've lived there. Who knew, I lived so close to a yummy place like Lenny Burger. They deliver with Uber Eats which makes them all the more like able for me"}
{"text":"It is a bit pricy for burgers but I mean their fries are good! I usually do not order anything to eat from here only my mom and sisters but I really love their shakes, I have gotten the banana one and it is definitely tasty!"}
{"text":"So the BF and I felt like a burger at about 9:15 tonight (I know... we are sick people)... we found this place on yelp. I was kind of concerned that this place didn't really exist because the Lenny's website does not list this as a location. But it indeed exists! We went by and it was such a cute little place. It's a tiny place with 50's style booths and a drive through. So we got a couple burgers and an order of fries to share. The burgers were just alright.... nothing super special, but definitely not bad. The fries though..... mmmmm...... they were really good. Hot, crispy, and just the right amount of salt on them. They were seriously yummy. While we were there (for about 10 min) about 6 cars went through the drive through. At 9:30 on a Sunday! So there must be something good about it. Also, it was very reasonably priced. All of our food totaled around $10. Not bad.... I'd definitely go back."}
{"text":"The food was really good I liked the old Diner and old music vibe  The servers could've been more personable but still good I'd recommend it for a good cheeseburger"}
{"text":"First time here, at the recommendation of a friend. The burgers were bigger than expected, and had a good amount of toppings. The onion rings were TASTY, but be aware that sauces, such as ranch are 30 cents apiece. It was pretty hopping on a Friday night, and the drive thru was many cars deep. Overall, it was good food, good prices, and good environment. We will be back!"}
{"text":"Lenny's has the best cream sickle shakes around, they really do taste like the orange cream sickle ice cream. You MUST try one next time you're at Lenny's you won't be disappointed I promise you that !"}
{"text":"Good food nice and clean most of all it makes my gramma think of her younger days excellent service too. What a great place"}
{"text":"Decent size double burger,  tasted fresh. The Coney dog sucked was tiny and bland"}
{"text":"This is a really affordable and delicious place to eat! The hamburgers are really great and so are the fries.  I love the fact that there are several sauces to choose from to dip your fries in."}
{"text":"I went to Lennys on my way home from work tonight.  I live approx 10 miles east of this location and its on the way.  I ordered a burger and sweet potatoe frys.  As I was giving my debit card to the girl at the drivethru I ask her what kind of dipping sauce they had.  She told me the types as she was swiping my card.  I told her I would have some Fry sauce.  Well she had already completed my transaction and told me it would be 33 cents.  I didn't have change and I didn't want to use my card for such a small amount so I told her to forget the sauce.  My burger combo was over $8.  If I were the employee I would have said don't worry about and it threw in the 33 cents worth of sauce.  I am disappointed she didn't take that approach and probably won't be back.  Just doesn't seem like good customer service. 

The burger was good and the sweet potatoe frys also were also.  Definately not Smash Burger or In and out but better than McDonalds!"}
{"text":"I love Lenny's! The decor is awesome, it's local, burgers and fries are great, and they have really inexpensive ice cream cones and root beer floats. If I'm craving a burger, I head to Lenny's."}
{"text":"I've been eating at their midtown location for years, and recently meet a friend here for lunch Sunday afternoon. While not as hectic as the other spot, the food was equally amazing. The Mexican burger and fries is my standard order, and I saw no reason to change this up. Fast, friendly service should be expected, and they nailed it."}
{"text":"Good burger, adequate fries and Pepsi on tab.  Oddly reminded me of Bob's Big Boy back in the day (like 40 years ago)"}
{"text":"We have been wanting to try the \"new and improved\" Lenny's for a while now. Having a lazy, relaxing Saturday we decided to give them a try. You order at the counter, take a seat and they bring your order out for you. The new diner style joint is clean and efficient with self serve Pepsi machines, which is kind of a  negative for us..we are a Coke only family, but hey they have Dr. Pepper and ice tea, sweet & unsweetened for non-Pepsi drinkers.

I ordered a #1 Ranch style with cheese (a single patty burger with lettuce, tomato, onion and mayo..lots of mayo), the husband ordered #2 (double patty)  Ranch style with bacon & cheese, no tomato, the child ordered a hot dog with ketchup. 

Food came out fast and hot. The burger was...well ok. Not great, not bad either, the cheese was melted and gooey which is a plus and they use red onion and Aunt Hattie's buns..another plus. Fries are frozen variety with the addition of a seasoned salt, I like greasy fries and these weren't, not a bad thing to most though. The all beef hot dog was average size on a very fresh seeded bun. 

This Lenny's has a lot to offer for someone on a budget. They sell ice cream too, but we found it a little over priced unlike the burgers and dogs. Dinner for 3 was around $18..not bad. Food was good and we would definately go again some day, but nothing really wowed. Next time I want to order one of the specialty burgers like the Mexican or Cowboy. I don't like that they charge $.30 for a very small cup if you want actual Ranch for the burger or fries..the same price if you want cheese sauce.

I also didn't like the fact that you have to have a key to use the restroom but there isn't a sign to state it, only a sign that says \"restrooms for customers only\"..if a kind lady wouldn't have approached me and told me I needed a key I probably would still be standing there thinking someone was taking a very, very long time."}
{"text":"There are only 4 burger places I like although I eat at many of the places in town. 
Lenny's is one of the places i like. Maybe because they are home grown Arizona. and because their burgers are good. I always get my burger just the way I order. They have a good menu and everyone should be able find something they like. My mother-in-law likes the Ruben. Occasionally you will have a employee that is having a bad day and takes it out on the customer but that is not often and usually the customer is very good."}
{"text":"WOW.

I would have NEVER come in if my friend didn't work by and needed something quick.   The food was good, the service amazing (Kim the shift leader checked on us and was always friendly and was always smiling) and the ambiance SO FUN!!!! I was eating and singing the whole time!! Thanks for taking care of us Kim!!"}
