{"text":"Great place to go for comfort food. The price is reasonable and the staff are friendly"}
{"text":"A regular old family diner. 

Stumbled upon this place because Olde York fish and chips is closed on a sunday.

They have a huge menu - from sandwiches to all day breakfast to their own fish and chips - they offer a huge variety. 

I have to say that when I think diner, I think huge portions for cheap.  This place has smaller portions than what I was expecting (smaller than say a Cora's restaurant for reference). 

I had the corn beef hash - it wasn't amazing, but decent.  Did I leave satisfied with my meal? Not really. The service was good. The bathrooms are small, but clean. But I just felt like something was missing from my experience. Not sure what exactly, but maybe something more memorable to make me want to return."}
{"text":"Was looking fwd to a good family resto greasy spoon breakfast but never even got to ordering. Servers were surly and cranky, muttering annoyance under their breath and brushing off customers requests for coffee, ketchup, etc with disdain."}
{"text":"At last, a comfortable and enjoyable meal for not much money.  Like some others who've reviewed this place, I wandered over from Canadian Tire.  The decor is pleasant and clean, there are windows to look out of, and service is attentive and quick.

I was dreaming of fish and chips, and there it was on the menu - halibut or haddock for $8-something for one piece of fish with fries and coleslaw.

The fish was fresh and perfectly cooked.  Portion sizes are ok for the price though I maybe should have ordered the two pieces of halibut instead of one.  The coleslaw was just right, made there I think, and there was a too-sour pickle to top it off.  When I asked for coffee, a pot of decaf was made fresh and it was good, in a bottomless cup!

Not in the mood for dessert so I can't comment on that.

The only fault I can find is Pet Peeve #4, which is FROZEN fries. Horrible things. No resemblance to actual potatoes.  Is it really that hard to peel a potato?  Still, because I enjoyed the rest of my meal so much, I will deduct only half a star, so please consider this a 4.5 star rating.

I will return for sure, it was lovely."}
{"text":"I would not go back to this place - went on a Sunday around 11am...waited to be seated for 15 min and the food took another 30 min to come.  Thank god that I wasn't in a rush.  Food was so-som nothing special and small portion for the price, had to ask for coffee refill various times too...I think they can do better!"}
{"text":"I love mom and pop diner type places and was looking forward to trying this one.  It was extremely quiet on a weekday around 11:00 am.  We ordered breakfast and drinks and our total bill came to just over $20.  For what we got i would say it wasn't worth the money.  The home fries were few and the egg was just okay.  The orange juice was around $2 but came in a sample size cup.  Usually breakfast places load up your plate with home fries for a good price and you feel as though you got your money's worth.  I can't say I felt that way about this place.  The staff were friendly and I hope they make a go of it but i feel like this place is on its way out."}
{"text":"Walk in, and this place screams \"Family Restaurant\" (and has been screaming it for at least 40 years)! The decor is uninspired, lacking any noticeable character. The location is off the beaten track, but has it's own small parking lot.

My breakfast special of 2 eggs over easy, brown toast, \"home fries\" and coffee was forgettable. Their version of a home fry is a large potato wedge deep fried like a jumbo french fry. It was well cooked and tasty, but isn't really what most people consider a home fry. Imagine that on a plate, devoid of spices (paprika, pepper) or onions with two fried eggs, and it paints a pretty bland picture.

A friend's eggs benny looked pretty good, and another was very happy with her grilled cheese sandwich, but their reviews weren't compelling enough for me to bump mine up a star.

I WOULD NOT go out of my way to seek out this oddly-located neighbourhood institution."}
{"text":"I was on a mission for all-day breakfast.  By 3pm on a Monday, Sunset Grill and Cora's are both closed.  (Don't judge me, it was my day off!)  In this area, the only other option for all-day breakfast was Golden Griddle, but I wanted to do better.  

Atmosphere and decor was plain, which I expected of a family diner.  Since it was clean and not scary, we decided to stay and try it out.  

We were the only people in there, so service was very prompt.  Since my primary goal was breakfast food, I was a little disappointed by how small the breakfast section was on the menu.   

The food quality was comparable to Sunset Grill and Golden Griddle, but not as fancy as Cora's.  For the low prices, I thought the portions were generous.  The peameal bacon was moist and tender; french toast was crispy golden brown; the western omelette was flavourful; my only complaint was with the turkey club - mayonnaise came on the side but the sandwich itself tasted really dry.  

The prices are good, the food exceeded my expectations, and I like that it's not a busy place.  It's a nice little neighbourhood diner."}
{"text":"Sunday Brunch in Leaside Neighbourhood.  Leonard's is a very recognizable spot for such an event.  If you drive by Laird Dr, you cannot miss noticing this yellow bannered red lettered building that stands out from it's neighbour of houses and across from the Leaside Centre.

Overall, this place reminds me of Sunset Grill at least while I was there to have Breakfast and looking through the Menu.  Semi-open Kitchen of experienced(aged) short-order cooks that get food out at a good pace unlike my Sunset Grill experiences where I literally wait for the Sun to set.

Eggs Benedict w/Turkey Sausage & Coffee/Tea ($8.35) - Nicely done Poached Eggs with alright Hollandaise and unseasoned Home Fries.  What I learn here is Turkey Sausage is probably something for the Dogs over at Petsmart across the street.   2.5 *Star*

Western Omelette with Coffee/Tea ($8.95) - This was very FLUFFY, light and delicious made of fine chop Onion, Green Bell Pepper and Ham.  Simple item done right and quite fulfilling especially with Toast & Jam.

Note: Next time I'll have Coffee instead of Tea.  Pouring from Tea Pot, I got lots of wastage if not done to specified codes."}
{"text":"Leonard's 

It's a simple local diner.  Not much character to the place or anything to make it stand out, safe for maybe a little stone wall in one section. At least it was clean. 

Service didn't even come with a smile, forget the warm feeling.  Made an order an paid. 

Menu had good selection, but confusion amongst the eggs Benedict. It list different meats but doesn't tell you they come on the side.  Anywhere else I'd expect those to be on the Benny, not next to it. 

There was very little portion of what is clearly made-from-frozen home fries. Benny was ok but without anything between the egg and muffin.  I ordered the pork sausage so apparently it came on the side and was greasy and fatty. When nothing I put in my mouth feels right mixed with the others - something is wrong. 

I expect better from the locals.  When I know I could have had a better experience down at sunset grill, I'm pretty sad."}
{"text":"This is the kind of place you just come to hang out, the food is alright, you could probably make the same at home.  

Don't expect the world's best omelette or homemade sausages, it's a place for a quick simple bite or to catch up with old friends!"}
{"text":"Every neighbourhood does need a family runned greasy spoon that serves homemade comfort food. Leonard's Family Restaurant is the one to go in Leaside.

All Day Breakfast are served here so you can have your brunch anyday of the week..sleeping in and enjoy your breakfast/lunch whenever! 

The decoration here is simple and functional! Service is quick and fast! 

Egg Benedict Turkey Sausage with Coffee/Tea ($8.35)
- Egg nicely cooked when ordered.. nice and runny...
- creamy and buttery hollandaise sauce was not bad... just a really light touch
- Turkey sausage I would have skip that! not really crazy about processed meat.. But it was fried nice and moist and have great bite

Western Omelette with Coffee/Tea ($8.95)
- A-OK... has a lot of flavour
- chucks of onion, green pepper and ham 

Both served with home fries = potatoes cut into irregular pieces.. as home made as one can get!

Menu is simple and serving comfort food... just like what you or your mama will make at home!"}
