{"text":"First time here and the food and service is outstanding. Very nice people and my meal came with a great explanation of Hakka food and it's origin. Really enjoyed it."}
{"text":"Cam here the 3rd time. Really like their Hakka dishes here. The staffs are friendly and attentive. The food are delicious. I really like their chilli chicken, just not a big friend of their shrimp dishes. Always think about this place when needed a dish or 2 for dinner. Will definitely come back and really hope they can maintain the good quality and taste!"}
{"text":"A new and clean Chinese and hakka restaurant. Their menu are full of choice, a star!
Service is kind of slow
Food is Fresh and good 
Price is moderately a bit higher in comparison, to affordable lower Asian style restaurant. 
So price is really reasonable, you get what you pay for.

We will return to try more choices"}
{"text":"This is the best Hakka food I've eaten in north Markham so far. I would like to try everything they have.

Staff is incredibly friendly and the prices are really reasonable.

It's a great family business and very convenient, with amazing food!!!

Look forward to more meals at Li Dynasty!!!"}
{"text":"This place is only a week old, but it's so far really good. It looks like a family business and they are really friendly. Decor is modern and still under minor adjustments. Prices are reasonable and the food is great! Good luck! I'll will be coming back again! Hope they will offer delivery soon!"}
{"text":"I went to the new resturant based on the good reviews. This has to be the worst Hakka food I've ever had. The food was flavourless and watery. Not to mention it was close to twice the price of where I usually go. Won't be going back to this restaurant."}
{"text":"A very clean, bright and spacious restaurant with friendly folks working there. Two large HD television sets also greet you with either the current news or the latest sports event. Now for the food...

Combo Platter (Mixed Pakora) - Fried fresh hot and very tasty. The seafood ones were okay but I enjoyed the chicken more so.

Chef's Special Fried Rice (beef, chicken, and shrimp) - Not bad. The wok taste ('wok hei') was more so in the rice than in the meat. If just eating the meat, I noticed less of the tastiness from the use of the wok.

Singapore Rice Noodles - Same as the rice. Not bad but could have been stronger in taste.

Not sure if I would go back but if any are curious and are in this restaurant's area, I'd suggest that you give this place a chance and try it out. Everyone has different opinions about food and most obviously different tastebuds!

Cheers folks!"}
{"text":"I'm excited for new Asian restaurants in the area so we had to try this place when it opened. We ordered the Shanghai Stir fried noodles and Chili Chicken Rice. Firstly, the Shanghai noodles were very light in color and taste. It would be closer to a regular chow mein using Shanghai noodles. The Chili Chicken was pretty tasty and quite spicy. Also,  the chicken mixed well with the white rice.
Hope to try this place again and give their other dishes a chance."}
{"text":"Was in the area, walked by Li Dynasty Indian Hakka Chinese Cuisine. So decided to give it a go. The place was empty at 6:30pm. Only 1 other table was occupied besides us. The place was bright, modern and clean. 

Our meal of the night:

Pakora Platter
Mixture of Spicy Fish, Chicken, and Shrimp Seasoned Deep Fried Nuggets. Chicken was my fave, nice and crispy outside and moist inside. Fish was really tender, moist and crispy as well. Shrimp was the spiciest, but it was good as well. All was very seasoned.

Chef's Sepcial Fried Rice
The portion of the rice is quite large. There was a mixture of beef, chicken, and shrimp. The flavour of the rice was very good, had a lot of wok flavour. But the main ingredients actually lack seasoning. The beef, chicken and shrimp didn't seem like they were seasoned at all, when you eat them by themselves. 

Singapore Fried Noodles
Again portion is large. The noodles consists of curry powder, shrimp, chicken and onions. This as a whole was pretty good. I think it was because of the curry powder it covered everything. But I also tried the chicken and shrimp by itself. It did have some flavour because of the curry powder. But it was mild.

We ended up not finishing the rice and noodles and we packed it home. Overall it was an ok place to grab a quick bite :)"}
{"text":"Visited this place..2nd time..i am a big hakka fan..went for lunch special . In comparison to hakka wok down the street 
I find this place ok. Lunch does not include anything but your rice and meat. Should include drink and soup or some side. Had chilli chicken and chilli fish ..both seemed very salty to my liking."}
{"text":"Only come here if you have no plans for the rest of the day. Food took forever to come out. Definitely a deal breaker for me."}
{"text":"I've been here a few times now so I thought I would show some love to one of my new favourite Hakka places. 

Today we had the Chicken Chow Mein, General Tao Chicken and the Chili Chicken (white meat). 

Lets start with the Chicken Chow Mein. First off the quantity is huge. It's a large takeout container full of perfectly cooked noodles chicken and thinly sliced cabbage. It's a very good side for anything on the menu!

The General Tao Chicken was fantastic! It had tender pieces of chicken with peppers, onion and carrots all mixed in a thick sticky sauce. This is one of the better ones I've had.

The Chili Chicken is my usual go to at any Hakka place I visit. This one didn't disappoint. It was tender white meat pieces with plenty of onions and HOT chilies. I used to the spice nice but it comes usually very hot. They will tone down the spice of you ask. As a quick tip I always ask for more sauce as I like my Chili Chicken more wet versus dry. I will have to try the dark meat version next visit!

Most menu items come with a side of steamed rice.  I am not a huge fan of steamed rice. This one is good and fluffy. It soaks up the extra sauce nicely. 

Everything was fantastic as usual. I look forward to trying more of the menu items.

I will definitely be back."}
{"text":"BS reviews.. food was flavourless. Ordered for takeout both the standard fried rice and noodles ( bland  ), chicken wings  ( small and soggy ) and their $16 special shrimp ( 10 pcs of soggy shrimp ) Won't be going back to this restaurant."}
{"text":"We did take out 1 day for Chicken hakka noodle and cashew nut chicken. The food was ok , definitely pricer than similar restaurants around. Nothing too special."}
{"text":"This is a new Hakka restaurant located in the North east area of Markham. Restaurant is spacious and bright; service was good. Food was better than average. They have lunch specials available for $7.5; good value. 
Chilli chicken was not greasy and quite spicy"}
{"text":"Great new hakka restaurant in Markham. It's only been open for a few weeks but I've already visited several times. Restaurant is clean and modern and service is wonderful. Food is delectable and not ridiculously spicy. Treat your taste buds and check this place out."}
