{"text":"Ended up here by the way of an invite to a party. The music was great. Basement seems a little dingy. The drinks were ok."}
{"text":"This is mostly a review for the nightclub (electronic/trance/house music).  Back in '07, Lily was the place to be. The music was bumping, the bartenders were fast and the doormen were personable. So you'd expect that I'm about to say all of that changed somewhere in late '08/'09.  Well, it didn't; but then \"what happened!\" you say.  Well, it's hard to explain, but Lily pretty much died of exhaustion, at one point the place tried to have R&B nights, which brought in crowds at first, but they were love 'em and leave 'em types. Then no one showed, since they thought Lily was now an R&B place. For a while they just didn't open the club anymore.  So now we're back to late '09, start of '10; and Lily is back for a last go at things.  Music is good, Bartenders are good (not as experienced as they could be), small crowds are coming back on most weekends; but the real kicker is that they are open very late (5am which may not last).    So try Lily out for a relaxed after hours sometime, hey at least parking will be easy and free. Come before 2 though, since I think they hide the fact they are open after about 2:30 or so (it's not a redbull and waters affair folks ;p)."}
{"text":"Doing frequent business in this area, I took advantage of a Groupon to try this restaurant, as if it was a pleasurable experience, I definitely could return, or even recommend to clients in the area.   I will say, the server was attentive and pleasant which is why I chose to rate two stars instead of one, but overall, it's quite unlikely I will return.   I used the Groupon to take advantage of having a steak dinner, chose to have it with a Caeser salad. While waiting for my meal, a patron seated behind me had their steak delivered, it looked well presented and delicious, I was excited in anticipation for mine as a result.   The waitress returned to my table to inform me they were out of Caeser salad, and asked if I preferred the house salad or fries, I chose the fries. She returned moments later with my plate, first with a house salad, that was not the disappointing element, although why ask. She did bring me fries as well after. But I looked at my plate and was utterly disappointed. I was not presented with a 10oz steak as mentioned on the menu, nor did it resemble the steak served to the patron behind me, it appeared I was given a 4 or 5oz cut that would be used for the steak sandwich.    Now this restaurant signed up on Groupon, so they need to deal with this element (you are to inform your server of the deal when ordering) had I not, odds are I would have received the meal I had ordered...  I waited for the waitresses to return, and told her I did not believe this to be a 10oz steak, she mentioned the menu had changed and it was 8oz not 10. Still, there was no way this cut was even close to 8oz. Like I mentioned, I saw a proper steak served and this was nothing close.   I even said I didn't feel it was 8oz, and she shrugged. It was not her fault the kitchen is ordered to shortchange people who use a Groupon.   The steak was cooked well and flavourful, although it was to be accompanied with mushrooms, I barely had one mushroom sliced and served with this.   All in all it was a disappointing dining experience, and I left feeling short changed and ripped off.   As I stated off the start, the point of the Groupon is to give you the chance to try somewhere new, and if you enjoy, you return. With a slew of restaurants up and down this stretch of little italy, I know where I will not be dining again."}
{"text":"I like Lily.   They have nice DJ of house music.   They allow real dancers to dance with casual clothing.   All the staffs are nice.   However, they have really bad DJ, sometimes."}
{"text":"A bunch of my friends and I stopped by for my birthday this past weekend for the Lily lounge experience.  The music was great, I am house/trance fan.  Upstairs had limited seating with folks smoking sheesha.  The patio was packed but the upstairs dance floor was bare.  It might have been the fact that we got there early, around 12:30am.  I have been told that this place gets busy after 2am.  We ended up downstairs for about an hour and were dancing the night away.    Definitely recommend it for those into House/Trance music."}
{"text":"Absolute unpleasant and rude experience! Attempted to visit this neighbourhood restaurant with a Buytopia deal for 3 course meal. The deal was stated for Thursday - Saturday only, and since I am only available to get out on Thursday nights due to my household schedule, I thought this would be perfect!   Since they only open at 7pm, I left a message with my reservation. I eventually got connected to a woman staff member who told me that they do not work on Thursdays and that I can only come on Friday or Saturday. Upon inquiring about the Buytopia fine print, she turned very rude and instead of kindly explaining the situation to me, she rudely told me that it's not her problem that I can't come on Friday or Saturday.  Although the fine print may have been a mistake on Buytopia's part (I don't know), they staff person was extremely impolite, refused to provide me her name so that I can at least try claim back the near $80 paid for this no cash-back or credit-back voucher.  Although I never had the chance to step foot in this resto lounge, the extremely unpleasant exchange experienced on the phone with the reservation person discourages me to ever step foot in that place or to recommend it to anyone."}
{"text":"hello everyone ok so i eat out a lot and go too many different places. i was here saturday night and i must say thissssssss place by far is a ok restaurant     not not not not!!!! this place was the worst place i have ever been too. the good was horriable . the waiters were not bad but the management was the worse. this place looks like its a cover up for some shady stuff. the owner was very very rude and disrespectfull which made me feel like he dosent care about what the restarunt reviews are but more whats going on the backround!! i suggest everyone to run run away from this place!!!"}
{"text":"This place is pretty awesome!  There are different events on different nights and there is an upstairs (usually more chill) and a downstairs (usually for more dancing).  Personally I enjoy the downstairs better.  Security, bartenders, etc. are all AMAZING and super nice.  There are a lot of techno / tech house / house events at Li'ly.  We put on events there (Point Entertainment Toronto) and there are tons of other events like Jungle Funk parties and whatnot.  Some of the best local DJs play there :)  Washrooms are OK as long as it's not too busy lol otherwise there is a lineup.  It's also a bit inconvenient as the washrooms are only downstairs so you have to go downstairs (if the event you're attending is upstairs) to use the washroom.  Then if you're downstairs and want to smoke, you have to go upstairs.  Hahah."}
{"text":"The music was blasting way too loud. In the upstairs lounge-ish area, the music was loud to the point of being extremely uncomfortable. How does one lounge in this place? The downstairs dance area was even worse. It looked like a concrete hideout/cave with outdated and wimpy laser-type rays of light pulsating to illuminate a small gathering of dancers who seemed like they were on something. May I have my hearing back?"}
{"text":"Came in with a buytopia deal that covered $130 worth of food for $40. Now, given the yelp reviews, I was expecting utter disappointment. And...well, it wasn't that bad I guess, but we spent $108 on two entrees, two sides, two half-full glasses of wine, and a piece of cake between two people. Given the quality and portion of the food, it would have been really disappointing if we were to pay the full price for it.  The most popular item in reviews is the steak, which is advertised as a 10 oz striploin. The first thing the waitress does is explain that the striploin will be 8 oz instead of 10, due to \"recent changes to the menu\".  I had a steak sandwich for starters and the steak as the entree. It's basically the same steak, except one comes between two slices of artisan bread and a piece of lettuce, while the other comes on a plate with fries. Both come with mushrooms and some sort of sauce. The steak wasn't too small, wasn't too thin, and it was cooked I suppose. Tastes like the same steak I had at japanese AYCE a few weeks ago, which is not bad if you're not expecting much! Given my expectations for this place, it was not a bad meal.  My dining companion ordered the calamari fritti and the pan roasted chicken. The calamari came with 8 pieces of deep-fried squid, though another table received 9. Awkward. The pan roasted chicken was very juicy, so that was a plus I guess.  The cake was probably the best item of the night, though it doesn't seem like cake is available on the menu. Makes me wonder if they had it specially brought in for the coupon users. It is unfortunate the cake is just a small square piece of cake, shared between two. Would have been nice if they had two pieces of cake.  We had the opportunity to witness a fireball during the meal when a napkin caught on fire on one of the candles on the table, so that provided some entertainment.  Overall...you'd probably have a better experience just going to an AYCE sushi place nearby."}
{"text":"Place is nice and has a great ambiance.  I love the Thursday night band, Jumple and went to see them play one of their regular sets.  Crowd was great and the music rocked.  Why the 1 star review?  $2 for a highball glass of water with more ice than water.  They charged this despite the fact that I had paid for other things at the bar and my friends had spent a fair bit on drinks as well.  As much as I love the band and as much as I would love to make this a regular spot to hang out, I can't go back to Lily lounge for this reason alone."}
{"text":"I don't know why there are two postings for the same place but I'm assuming \"Li'ly\" denotes the downstairs portion of this place. http://www.yelp.ca/biz/lily-resto-lounge-toronto-2#hrid:Nrx7FP50UHw9YXwU0wYbdA  Now I've passed by this place before and have actually kind of loved the music (electronic, house) that blasts from this place.  But the clientele is just so........  Woodbridge... And so I've always continued to mosey on down the road to meet at my intended spot.  But last night this WAS my intended spot and didn't even realize it til I was at the doors saying to myself, \"really?\"  A few moments and 10$ cover later (for the downstairs party- they were hosting an EDM party) I'm dancing to possibly some of the best electro house I've heard in Toronto.  This is likely because of the party and not because of the venue- but it seems like this venue generally has some great potential and I'm looking forward to checking out subsequent electro-house to make this 3 star place a 4.  really, the only weakness is the crowd- but when they host parties you get the regulars of the party and not the regulars of the venue, if you know what I mean.  Generally a great space.  The upstairs has a nice long bar with some space up front to dance (although I've never seen it busy and I've never seen people dance even though the sound system is capable of a good dance party).  Downstairs is a small square space- great intimate dance space and just enough room for how popular this place is as of now.  Come here, but bring your own crowd.    ps: I don't know what's with this place but it always seems a bit man heavy for gender breakdown- I never had to wait to use the washroom and the washrooms were really really clean at the end of the night still."}
{"text":"went here for some dancing on friday night...  we came early (10pm) and as expected the place was empty... but up until midnight main floor was still empty. noone danced...  we went downstairs and there were a few more people more or less pretending to dance. music wasn't any exciting too. drinks are on an expensive end. basically for the $10 cover I would expect more.  don't think I'll be coming back."}
{"text":"I was extremely disappointed here, they had booked other djs at a private party, on top of the dj that was scheduled to be there months ahead of time. The managers made no apology and often dissapeared instead of dealing with the problem. If there is one place I would never step foot in again its Lily Lounge."}
{"text":"Ughhhh... so... Li'ly...  This place is bad. I held a group event at Li'ly, party of 20. Called in 2 weeks in advance and asked about the menu, space, and pricing. Everything sounded good and they claimed to have served larger groups before, so this was a good sign.  Ohhh boy, it was much below anyone's expectation. To start, we were the only ones at the restaurant. The space was fine, big  enough to accommodate larger groups and some dancing after wards. The bar was long and the bartender/wait staff were friendly.  Drinks were expensive, 7 for domestic beers and more for import. The menu looked fine in print, but extremely disappointing when presented before our eyes. Although we made this reservation weeks ahead, they didn't seem capable of handling our orders. The appetizers arrived 45 minutes after ordering. I remember this because I had time to walk over to The Spotted Pig (a restaurant a block east on college) for a few drinks before returning, just to wait an additional 7 minutes for the food to appear.  I ordered the Antipesto platter which was literally a mash of store bought olives recognizable from a grocery store (Metro across the street), deli sliced ham, a few grilled zucchini and toasted bread on the side. I mean... how can you serve this and get away with it? This was a crime against fresh and simple food. For $15, I expected much much more than store bought ham and olives... the wait time for this app wasn't justified. Little did I know, they would eventually get away with a lot more...  The group ordered other appetizers as well, calamari, salads, etc. They were decent but not great by any stretch.   Another 30 minutes pass and our entrees come out. The servers didn't remember who ordered what and in two cases, dishes that were not ordered by anyone were placed in front of us. The waiters began to accuse us of ordering the misfit dishes that no one considered ordering. One was a chicken dish served to a vegetarian. This was unacceptable.  When we asked for the manager, he came out with his guards up and without surprise, defended his restaurant and wanted us to pay for the unordered entrees. What kind of horse shizzy did we fall into?  After more debate, he stormed out of the restaurant without offering any solution to the matter. It was like dealing with a 5 year old, just a bit more hairy, and a bit more immature actually.  At that point, I wanted to leave. The food and experience was horrible. The waiters commented on their manager as well. He was unprepared and forgot about the reservation. The staff said that they never had to serve a group of 20 before.  In the end, the manager stormed back in passing our table without mentioning a word. We then begin to hear him yelling to or at the cook. Whatever happened back there, I have no clue. But the last time we spoke to the manager was when we left the restaurant leaving a terrible tip and a few words of advice.  Oh, what about the food? The Steak was cooked from frozen for...$28 bucks with a side of salad and no fries... Noticeably from frozen because it was grainy. It was also cooked well-done and not medium rare like I asked. My second steak came out when everyone else was finishing up their dinner. Such an epic fail.  Li'ly, NEVER AGAIN!! Such a terrible experience. Although I don't truly believe that Li'ly is garbage as a stand alone lounge, I think it's absolute toxic waste as a restaurant. Ownership should change, people should't have to deal with 5 year olds. Whatever happened to servicing the customer. They seem to be only concentrated on getting a quick buck."}
{"text":"It's not great, but there are worse venues in Toronto. I'll give it the 3 star review simply because you can catch some decent dj's playing here from time to time, and has 2 rooms which for small to medium sized venues in Toronto is pretty rare nowadays."}
{"text":"Went there Sunday 1am for dancing (bar hopping).  The place was not busy at all.  The staff was not pleasant.  They charge cover charges. The place was dirty. Floor was sticky. Young small crowd. The music wasn't to my liking.  The only thing I liked was that the dj enjoyed himself a lot. Very happy and into the music.  We left after one drink."}
