{"text":"Average--just plain forgettable pizza. I love pizza and consider it a staple, but I'd choose Papa John's over this place."}
{"text":"The best pizza shop in charlotte and excellent management, we love \"Doc\". Chopped Sicilian salad is delish!  It isn't true New York or Brooklyn style pizza but close."}
{"text":"Edit  I went in and it was 5 minutes before they opened and the bartender, she said we're not open and made me leave and wait outside for 5 minutes before going back inside. I went in and got 3 meatballs to go, however the meatballs were about the size of a quarter, and the total was around 7.60 so 2.50 for a meatball the size of a quarter. When I went back in at 11 and ordered she scoffed and said is that it?? with a slight attitude and then laughed at me as I got my food and left."}
{"text":"Moving from San Francisco, perhaps I was dumb to think a city bigger than that from which I came could suffer to deliver a pizza after midnight on a weekend night. I must be insane right!  Yes, they are open util 3 am, but stop delivering on FRIDAY at 10:30pm? Huh!?  Someone recommend me a pizza place that is there when I actually need them."}
{"text":"I love the pizza here! I went on a Tuesday and made it for $2 slices of cheese and pepperoni. The slices are huge and filling. They have great local beer on tap! The garage door near the bar is great when the weather is nice."}
{"text":"My roommate and I ordered delivery on a Friday night. Driver was 25 min late from the time quoted. Paid for ranch that wasn't delivered with the rest of my order. Wings just aren't the same without ranch. Over all, the food was ok though."}
{"text":"The space itself is very nice and relaxed. When it comes to the staff & food, the expectations were not met. There is  slow service, strange since not many people were there. Too many times the order was a bit messed. The quality of the food didn't match the pricing, I was very disappointed. It is safe to say we will  not be back."}
{"text":"If you are strolling through the EpiCentre, stop in for a slice. I must admit that I have stumbled here late night after some EpiCentre bar/club antics but the place always delivers hot delicious pizza. I swear, the same dark haired guy who works get the register has served me every single time (def from somewhere in the North East and friendly).  If you work Uptown, you can stop in for lunch. The place has the best hours, literally open every day at 11am and closes at midnight (4am on the weekends). So when everything else is closed in Uptown, there is ALWAYS Librettos. Thank you for staying open! The only prob is, if you don't live Uptown and want a slice, parking can be tough and it's silly to pay for parking which costs more than your slice!  Remember to get your loyalty card- for every 10 slices you get a free one. I have filled 2 cards and will definitely fill another one soon."}
{"text":"So I have had 2 experiences at Libretto's.  The first one was great, it was around 5 on a Wednesday and there was a really pleasant guy working behind the counter who amicably informed me of the prices and the best way to get out of there for cheap.  However the 2nd time I went, it was not that great at all. I convinced one of my coworkers to try this neat pizza place instead of Five Guys to change it up a little, not the change we were looking for.   When I ordered the 2 pepperoni slices, I'm sorry they are called \"roni\" slices here, I was a little disappointed to see the guy behind the counter take a slice of cheese pizza and put pepperoni on it. Not that I am a pizza expert, I just think a piece of pepperoni, should always be a piece of pepperoni from inception to birth, it just seemed inauthentic. And when I did order, the cash register guy asked me if I told the other guy behind the counter what I ordered, you have to order before you order here as well. I also wanted a diet coke fountain drink, but when I drank it at my desk, it was regular coke, for $2.00.   My favorite part was when my total was rung up, I asked how much it cost and he told me $8 with Cash, $8.66 for Credit. So now we are paying for the fact they use credit cards there. Yes the customer is paying for using their own credit card.   My coworker got a 20 oz bottled Coke for $2.20, seems a little high, so be on the lookout for that.   The pizza itself was comparable to Fuel and not nearly as great as Brixx, so keep all of the above in mind when looking for pizza in Uptown Charlotte."}
{"text":"Librettos is one of the better places for Italian food. My favorite is the Eggplant parmesan. It tastes fresh and homemade. Limited choices of wines. Wait staff is young & inexperienced. I think the prices are reasonable and the service is OK. the back room is quiet although not much atmosphere. Mostly families eating there while couples were at the front in the bar area."}
{"text":"Hit this place up after bar hopping at EpiCentre and it didn't disappoint! Line was long, but it moved quickly and the pizza was perfect! The kids behind the counter work like a well oiled machine!"}
{"text":"I had no idea this was in Ballantyne and knew nothing about it when I went. I was with my two young kids and was having my oil changed across the street. Love the pizza. My new favorite in Charlotte. AS close to NY as I've found. My 4 year old loves pizza but he's really particular. He loved it too.    Service was pretty slow and it wasn't even crowded. Lucky for me - and everyone else - my kids weren't in terror mode. And the wait staff seemed kind of lost. Like they didn't know what to do with themselves. I thought it was a seat yourself kind of place because when we walked in no one came near us.  But I'll go back for the pizza."}
{"text":"Nope, not coming back and you can thank your customer service.  Pizza was okay.   We told the waitress the cup she gave us was chipped.  Instead of saying sorry let me get you a new one she looked at us confused and asked \"did you want new one?\" Like really?!  Her name is Jessica.  We also didn't get our order on time.  She claim that I didn't order it I only asked about it. My husband heard me said \"well do this one .\"  She even wrote it down and then she actually came back to tell me that I never ordered the first pizza."}
{"text":"The place itself is nice, service OK. Their garlic knots are pretty good but pasta not and pizza blah. I find their food dry and tasteless. The only was I would choose their food is if it was for free and even then that is a maybe."}
{"text":"DO NOT EAT HERE!! Awful service, just absolutely terrible, the man on the phone just kept hanging up everytime I tried to order it was unbelievable. They need to get some better customer service before they get any more business."}
{"text":"The many different varieties of pizza type can match those of a snooty wine list, but Libretto's focuses primarily on New York style by the slice.  If you've been tainted by Fuel's inedible pizza by the slice, Libretto's will be your new mecca.  Large, thin slices are premade, popped in the oven upon order, and handed across the counter piping hot.  Dine-in can be a bit choppy, as tables fill up quickly and the ordering process varies whether you want pizza (order at the counter before sitting) or pasta/salads/sandwiches (seat yourself and order from your server).  The menu is large, so there should inevitably be something to satisfy everyone's tastebuds.  However, consistency is not their strongest suit - I've eaten here 10+ times and have ordered the same thing, yet my bill has been a different amount every time.  That being said, pizza prices are reasonable, and entree prices are affordable as well.  A small patio next to CVS allows for the classic epicenter people watching experience."}
{"text":"Being a northerner, it is difficult to find great authentic Italian food or good for that matter.  Libretto's does not disappoint. From the many times I have gone there, either with friends of family, the food has been great. However, the delivery service is mediocre. One night when working late we ordered food for eight people, and food for seven showed up with one being wrong and one left off the delivery but we were charged for all eight. When we complained, the problem was resolved BUT the final one of the sub's came on burnt bread. Was that retaliation? I recommend you Dine in!"}
{"text":"Wouldn't go back if you paid me. Always ignored the staff attitudes and awkward cashier experience where you feel like you're doing them a favor by ordering (when they finally pay attention to you) because the slices are pretty good and like back home (Long Island). Met my sister there for lunch where as she ordered her slice which looked as it had been sitting on the counter for a while....before it even went in the oven a fresh pie comes out and she asks \"actually, can I get one of the hot slices instead\" where the staff member tosses the old slice in the oven and says \"you already ordered\", doesn't even look at her and goes back to writing....are you f'in kidding me ?!! She had to drag me out before I made a scene. Good pizza & great Sicilian unfortunately not good enough to put up with that bulls&$t. If you eat here be sure to bring your pepto and blood pressure meds...."}
{"text":"Wow.  What a bad experience.  To start the night, our waiter, Caleb, was upset he had to work over on his shift and passed that feeling on his customers.  Rude is one thing, pissed is another.  He was so impatient to leave, it took him 3 times to take our order.   Another clue of how the food would be is when the table is stocked with granulated garlic and Italian herb mix. The calamari was very bland (the fried peppers with it were good) and the entrees leaved much to be desired.  Best suggestion is to drive past, better options not far."}
{"text":"We usually really like Libretto's but last week we had a sub-par experience. The service was AWFUL. The pizza tasted like it had been sitting forever and we ordered an entire pie. The shrimp scampi was tasteless. I'm not sure what happened to this place, but I'm not sure we'd go back."}
{"text":"Third and last time there. Went in for a quick lunch. The kids pizza was decent- a good portion and average on the taste scale. The BLT with avocado was horrible. They skimped out on the avocado and the bacon was broken into many pieces. The roll was small and very meh If you can't do something right, don't do it."}
{"text":"Small, dimly lit, and filthy bathrooms. Looked like they were left that way from the day before. I ordered the Bacon Chicken Ranch pizza and a artichoke pizza. They weren't bad, but not great. I felt like the toppings weren't fresh. Could have been better. Nothing stood out. Server friendly. Creative menu."}
{"text":"Good little pizza joint, mostly college kids. Decent bottle beer selection.   Nothing fancy, but the pizza was tasty.  I had the Il Diavolo which had Italian sausage, pepperoni, jalapeños and garlic.  The garlic knots were marginal."}
{"text":"I moved to charlotte from connecticut,  and I was feeling a bit homesick. The calzone I got from here cured that problem! Honestly, very good new England style italian.  Thanks guys!"}
{"text":"Whether it's late night or just dinner Librettos has amazing Pizza and Dishes. I rate it number 1 on my pizza list! Authentic New York Style Pizza. Fun environment, people. people are nice. I could eat it everyday."}
{"text":"This is a Sister company to Strike City, they have connecting walls. This is the only place on the block that serves pizza to 2:00. The pizza is really good! They have beer and soda to wash it down with. Really nice atmosphere and staff is on the ball!!!"}
{"text":"This is my go-to place for pizza in Charlotte. I've always gotten delivery or takeout, so I can't comment on the service if you're dining in. But their pizza is amazing! Delicious tangy sauce, perfect crust. If you're getting delivery, expect to wait at least an hour, but it's so worth the wait! I live really close by, so I usually just pick it up to get my food faster."}
{"text":"Worst delivery experience I've ever had. Our order was 2 slices of pizza, 2 small salads, and chicken Marsala. The first delivery man brought only the chicken Marsala then realized he forgot everything and said he'd come back. 30 minutes later a new delivery guy shows up tells us the last guy was fired (so unprofessional) and delivers the pizza... No salads and tells us we won't be charged. We call the manager and he tells us we will be charged and asks if we still want the salads we paid for... So disappointing. Took 3 visits and almost 2 hours and still had to pay full price. We will not be returning."}
{"text":"I came to pick up my pie, they had inadvertently given it away to someone else. The manger apologized and offered me some free garlic knots. Very much appreciated and I left happy. I wish more managers of restaurants would handle the little things so customers don't leave annoyed. Thank you Librettos"}
{"text":"Overpriced. Biggest complaint is that they skimp on toppings. You get about 6 mushrooms and mushrooms are cheap!  I have complained to the manager in the past but it doesn't seem to do any good. Crust is great though."}
{"text":"AWFUL! We were told 45 minutes for delivery and after an hour and a half we called back twice for the manager to not give us an answer to where our food was. Then after calling back for the third time we were told the driver returned the ticket because the location was out of range. When we ordered and gave our address they should have known if we were in range! So disappointed and will never EVER order from here again"}
{"text":"This was our 4th visit, all within the last 2 months.  The first 3 were good, but not this visit.  Overall, this is a good choice for good food at an affordable price.  The staff is good and hard working.  Our opinion changed during our last visit Friday night.  My wife and I arrived Friday around 6:30 and were told there was a wait, which was to be expected.  The hostess informed us that there was a table being held for a reservation and if they did not show-up we could have their table in 15 mins., if they did show-up it would then be about 40 mins.  We decided to wait.  Within 10 minutes the reservation party arrived, the hostess informed us and then said we were next.  Over the next 25 minutes we saw 3 different parties seated, finally when the 4th party was being shown their table we asked about us.  The hostess told me that we were a party of 2 and that the other parties were larger and were being seated at tables of 4.    To make matters worse, there was a group in the bar area celebrating a birthday, difficult to estimate but we thought there was 12 or so.  They were given 3 tables that seated 4 each as well as the 2 larger tables ( seating for 8 or 10 each ? ).  As you could imagine, most of the time these people were up and mingling.  In fact the 2 larger tables were being used for the food, with no one even sitting at them.  Considering all the other options available, I cannot imagine ever going back.    Mike, thank you for your quick reply.  Yes, perhaps I should have made an earlier review regarding our past visits, as I mentioned in this post they were all good experiences.  However, we were told by your hostess that after the party with the reservation came in, we would be next.  It was she who set the expectation, not us.  This party that came in was for 2, yet they were seated at a table for 4.  The other parties that were seated ahead of us did NOT have reservations, again, as per your hostess.  And finally, when my wife inquired as to why, your staff was rude, and one turned her back to my wife."}
{"text":"I had high expectations since I heard a lot about this place, I asked for a recommendation and my server replied everything so I decided to try chicken parm. The moment I received the dish I had a big doubt deep fried chicken over boiled pasta!!( I asked my server if the pasta is homemade she said yes,but no is wasn't) no way I decided not to Question anyone and write this review.   Mr manager wake up!! I payed $16 and left my whole plate the way it came out form the kitchen hope this might help you'll get you Serious in Bussines"}
{"text":"The food is okay, the service sucks ass. A bunch of druggies who are always stoned and look like the have not had a proper up bringing in life work there. Since I can't stand to go in the place I recently started ordering deliver which I probably will not do anymore because it always take them over an hour to deliver my food, then it's cold and needs reheating. :/"}
{"text":"Spaghetti and meatball is awful here, watered down and it's not like the price is great for this quality either. I've had their pizza and it's ok but spaghetti was a fail."}
{"text":"Avoid. Literally the worst thing I have eaten in years. Threw away an entire pizza and wings it was so bad"}
{"text":"Very good pizza.  Generally consistent.  Not too much to say good or bad.  We've eaten in and taken out.  Pizza is good.  Not the best we have ever had but better than most in Charlotte.  Highly recommended."}
{"text":"Great pizza at a great price.  I would argue that it's among the best in the Ballantyne area."}
{"text":"Went for lunch on a Friday. There was hardly anyone there, so we figured we can get in and out fairly quick. Wow... Not even close! Waiter was 2 iq points above retarded and ridiculously slow! Took over 1 1/2 hours to eat lunch. About 20 mins of that was just waiting for the check. The only saving part was the pizza was decent.   I would never go back..."}
{"text":"Obsessed! My fiance and I moved here a few months ago from NY, where we actually lived down the street from the Libretto's there. This place is just as good, if not better than the original! I may or may not have ordered delivery 3 times in the past week and a half. The pizza is as authentic as you can get outside of the city, and the soups and salads are great, too. I have yet to have a bad meal. Delivery was slow for a bit but it seems they've fixed it. As delicious as their pizza is, the meatballs are the best. They taste just like my moms."}
{"text":"I actually really like Libretto's, but a delivery blunder has left me feeling a bit sour. Pizza showed up 50 minutes late (after I called at the 30 minutes late mark). Pizza cold AF."}
{"text":"I have eaten here twice now in the past month.  I've had the New Yorker, Il Diavolo and the Chicken Parm pizzas.  This is certainly better than average pizza pie don't get me wrong but my main issue is the pricing.  For $20-$22 per pie, I expect to be super impressed which I haven't been.  The larges do provide a lot of food so that's certainly a positive.  If the prices were more fitting to the overall quality I would be tempted to give Libretto's 4 stars.  I'm happy to pay $20+ for a pizza that knocks my socks off."}
{"text":"I order from Libretto's all of the time, the delivery is FREE and their menu is amazing.  Very good food and very friendly folks.   I 100% recommend them.  They have become my favorite restaurant in Charlotte."}
{"text":"The main reason you go to a restaurant is for the food. Libretto's does have good pizza, their other entrees are decent. But their service is by far one of the worst places to experience in Charlotte. If it wasn't for their good pizza I would not come back. They don't greet or seat you. Several times the wait staff have been plain assholes and rolled their eyes. If they don't want to work with people, don't be in the food industry."}
{"text":"Just had pizza, wings, & a eggplant parm hero from here.  First of all they need to change there words on there sign. N.Y pizza are you kidding me.  Oh yeah I forgot to mention I just moved here from N.Y.  I just had the worst dinner in my lifetime. The pizza was like cardboard. No flavor at all.  The eggplant was so soggy and drenched in oil. Was like eating a wet paper towel. And the wings were smothered in hot sauce as if they were trying to hide something. My advice to any one who reads this review is please don't waste your money as I did. My dogs wouldn't even eat it...... Please take your sign down because you are making N.Y look bad. Anthony C."}
{"text":"The closest thing to true New York pizza that you can get in North Carolina. It is consistently great. The building is a obscure. But if you look hard enough you will have a \"true pizza\" experience."}
{"text":"Looking to get your money worth?  Or just want great tasting plates... Well I recommend this place hands down! I ordered pasta and a cannoli (must try) that knock me straight off my feet afterwards."}
{"text":"Love this place late night on the weekends for pizza. I try to be healthy and get the tilapia or salmon on the weekdays but they are almost always out. Oh and I got called out for checking in on Belly without buying anything tonight so that was embarrassing."}
{"text":"I haven't had many good experiences here.  I think the manager is hotheaded and cocky.  They seem to be there to socialize than to serve people.  They never have the pizza labeled in the case and they act as if I'm an idiot if I ask them what kind it is.  There have been multiple times I've been there and there are plenty of other places to choose for pizza or Italian specialties.  My advice people go elsewhere!"}
{"text":"Libretto's Cheese Pizza is very good (18\" NYC thin crust)...close to the NY style I grew up with.  I was disappointed with the Classic Calzone.  The crust was overcooked and there was hardly any cheese inside. I told the Manager that the crust was burnt and she said they have to bake it that way or the cheese does not cook.  I disagree.  It was tough and didn't even taste that good.  The pizza was very good.  Also, the website lists the Calzone at $6.95 but it's really $7.95 (another disappointment that their website has not been updated).  My order was to go so I didn't have the option to send the calzone back."}
{"text":"Libretto's has been epic in the past. I have never had a complaint with the downtown location. It is always there for a late night rescue. I was really excited to stay with my sister and discover there was a location just  over a mile away.   We ordered through the app for delivery. A confirmation email was sent with the expected delivery time. Cool....!!!! Pizza was 90 minutes away. They were 45 minutes late. When we called about the order,  the person up front said the delivery guy had left a while ago and it will be there shortly. When the guy arrived, he was unsure of the delivery location (we flagged him down), and the pizza was cold .   Next time I will pick up the pizza or the app needs to accurately set delivery expectation times."}
{"text":"Very good appetizers and pizza. We had a big party, and the staff was very pleasant and courteous. A few members of the party ordered sandwiches and enjoyed those as well. Would definitely recommend if you're looking for some good Italian in the area."}
{"text":"The good:  Location is very good for Ballantyne and the restaurant itself is clean and well decorated.  The staff was friendly and service was prompt.  I would give this part of the visit 4 stars, but I came for the pizza.  The bad:  I consider myself a pretty decent pizza connoisseur, but I'm not a pizza snob.  I'll eat what's available and won't generally complain.  While our meal may have been worth $25, it was not worth the $55 we spent on 2 sodas, a small salad and 2 pizzas.  Maybe their pasta dishes are really good, but the pizza just wasn't.  We ordered a plain cheese that was definitely plain; bland and without flavor, but it was also too doughy and way undercooked.   We also had their 'New Yorker' that really looked great to the eye.  They didn't skimp out on the toppings at all, but it was also without flavor despite the onions, roasted peppers, pepperoni and mushrooms.  While it was more cooked than the first pizza, the crust was nothing special.  Flags always get raised in my mind when the wait staff bring Italian seasoning, Parmesan cheese and red pepper flakes all to the table when a pizza is ordered.  If customers ask for those regularly, it supports that the pizza has no flavor.  I give the pizza 2 stars and so a 3 star score overall.  Will you die if you eat this pizza?  Probably not, but for pizza there are other local places MUCH better. (See Zio or Riccio's for example)"}
{"text":"The decor is good and the staff attentive but the food took an inordinate amount of time to arrive.  When it finally did arrive, the sandwiches were smaller than what I'd make at home.  My husband asked the manager about it and we were told they focus more on pizza and pasta.  Not impressed and won't blow our dining budget on it."}
{"text":"Not sure how they're boasting #1 rated pizza. It was ok. Thin large slices resemble NY style but not very authentic. Service was slow at the bar. I stood around for a while even searching for someone who worked there - no one behind the bar at all. Bathrooms smells like sewage and mildew buildup."}
{"text":"The mister and I decided to delve into the Epicentre this Wednesday night and try out this place after a neighbor suggested it.  Being born and raised in the South, I take issue with the idea of folding pizza like you would a piece of loaf bread, so I have never been all that impressed with New York Style Pizza- hey, we all have our personal preferences.  The first thing noticed was that the dough appeared freshly made- the mister had plenty of time to watch the crust master making the dough and tossing it about while I had to tend to my bummed up left ankle in the ladies' room- and that is a REALLY big deal for him since he was born in Connecticut.    The pizza options were different from most places in town- and for a little before 8 o'clock they were busy- so while the pizza was a bit pricey for us ( we opted for the New Yorker which was $24.95) we were game to see if maybe this New York style pizza would tickle our taste buds.  It was a VERY large pizza that looked great coming out and our server was polite, friendly but didn't seem to be hanging over us all of the time- the perfect type of service where they take care of your needs i.e. more beverage, occasional check ins to make sure things are good- but otherwise stealth-like.  The pizza was the best New York style pizza we have had in Charlotte, and we have eaten at almost a dozen such establishments over the last 7 years.  The pizza was tasty, the crust didn't taste like so many others- to me an indication that it wasn't frozen, too- and the mozzarella and sauce was REALLY good. As the pizza got room temperature, though, the crust got a little tough, but it was still tasty.  We would certainly go back again."}
{"text":"Dined here in August.  I had the calzone and my wife had the lasagne.  Both were good, though I was surprised how little meat was baked into the calzone.  We're rating the experience a 3 because the of the noise level.  Neither the restaurant or bar areas were full, but it was so noisy we could barely hear the waiter or ourselves."}
{"text":"Ordered delivery rather late on a Friday. Didn't seem to have the same late arrival issues that others have had, but I was also pretty close to this location.   Ordered an Italian hero assuming it would be the bomb diggity, with lots of that salty herby spicy authentic flavor... It was alright, but the bread to meat and cheese ratio was skewed, more on the bready side. The meats are super thin sliced, which is fine, I just expected a lot more. Provolone was very thin as well, and there were only a few half slices on my sandwich. Hot cherry peppers and vinaigrette added flavor to an otherwise bland tasting sandwich.   Would like to try their other menu offerings sometime, but I'm in no hurry."}
{"text":"Delicious and well-priced slices. Definitely going to marry the garlic knots one day. It's pretty packed on the weekends, especially after Alive After Five, but the service is quick."}
{"text":"This place always disappoints me.  The Hawaiian pizza tastes good, but I think whoever cut it tonight must be high. I've attached a picture of this...   We also got a brownie sundae. The brownie was actually cold like it had been in the freezer. I tried a bite, and the brownie is gross whether it's cold or warm.  The ice cream they gave us with the brownie sundae had really bad freezer burn. It was inedible.   We got 6 Medium wings. 5/6 were drums, which was disappointing. The only flat wing was tiny, soggy, and had broken bones inside. My first bite of it consisted of a little bit of meat, soggy skin, and bone fragments. While the drums were sturdier (no broken bones), they were still soggy and not very good.   My ranch that came with the wings was only filled halfway. As a former server, that level of laziness drives me crazy!!!   Finally, the only good thing was the Sicilian style Diavolo pizza. For $25, I'm glad they didn't mess that up."}
{"text":"I received so many recommendations from friends that this pizza was the best pizza in the Charlotte area. My boyfriend is a huge fan of pizza so we decided to try it one night. With high expectations we ate our pizza and found it to be slightly average. For NY style pizza it is one of my least favorite in the Charlotte region. The pizza itself was good but no where lived up to expectations."}
{"text":"Best pizza in downtown (they say uptown - whatever).  Slice and a drink very reasonable.  Good pepperoni.  I frequented this place when I worked close by a few years ago, hope it's still the same."}
{"text":"We got the cheesy garlic bread, fries, and cheese pizza. Everything was so delicious! Our server was really nice and attentive, and the bingo they had going on was awesome! Will definitely be back with my friends"}
{"text":"I've never been in the restaurant, but I ordered delivery for the first time, this evening. I have four words for Libretto's... Fast, Fresh, Friendly and (most importantly) Delicious!! Honestly, I had a great experience. I ordered the Chicken Parmagiana Hero(with fries) and Calamari for my friend and I to share, and I was Very pleased! Ordering over the phone was simple and expedient. Delivery was better than prompt, and shockingly still piping hot! Thank you, to every person involved with my order!"}
{"text":"Thoroughly disappointing. Delivery was way past scheduled and pizza was cold by the time it arrived.  Kept bring told it's on the way.. Poor service and food quality"}
{"text":"Food is usually good but the last two times we got delivery both took over 90 minutes.  Good option if you can pick it up but try somewhere else if you need delivery"}
{"text":"Took my son's here and they loved.  The pizza has a fantastic crunch and fresh toppings.  Best I've had in Clt."}
{"text":"Just left this joint after watching Wonder Woman at the Studio Movie Grill.  The spot was empty  - Sign 1.  Walked in and the employees looked at our fam like we were uninvited guests - Sign 2.  I asked the guy with the red beard if they were still open.  He said yes...and I ordered the cheese slice.  Like, after dining at Tupelo Honey (another story) and drinking a Double Ginger Mule (no kick at all) at the SMG...didn't want to go home hungry.    So, he proceeded to cut the cheese pizza.  Dear Lordt...why did his big a** thumb touch E-V-E-R-Y slice he cut?!?  I could not even say I want \"that one \" - Strike 3.  Well, all I could hear was \"Get Out\", then I Ran Out..leaving my son and husband, and looking like a crazy woman doing the Italian sign for \"Finito\" outside.  Libretto's owners...they don't care near closing.  Watch 'em!  Wait...the Double Ginger Mule just kicked in...and at least the nice manager at Tupelo made sure we had hot, delish mac and cheese .   Sincerely..."}
{"text":"The hot cherry peppers are a must if you like spicy on your pizza.  The seating is limited so be ready to stand and eat if need be,  If coming after the nightlife, make sure you get there before the 2am rush.  Fresh, clean, and reasonably priced.  It is good New York style pizza, the kind you can fold in half and eat!"}
{"text":"So far not good.    Just moved to the area, a mile away, and ordered for the first time.  Girl who answered couldn't figure out how to add a new address to a new phone number and after 5+ minutes trying, put me on hold for the manager to help.  After a few minutes another person got on, and same thing happened again.    My girlfriend called while I was on hold waiting for the manager, so I went to talk to her and was disconnected in the meantime.   Called back, asked to speak to the manager right off the bat, and even the manager took time to figure out how to deliver to a new address.  This time I was ordering for delivery to a hotel since it had been so long and we weren't going to be at our new place.    Same issue with hotel, took 5 minutes to figure out the address.  Finally got order in and was told 60 minutes.  75 minutes later I called and was put on hold for another 5 minutes without even being acknowledged, finally got to ask the whereabouts of my order and was told any minute.    Delivery finally showed up 85 minutes after ordering and of course one of the pizzas was the wrong order.  Tried calling back to let them fix it, hold again forever and I finally hung up.  To the manager's credit, she called back using caller ID or the number on my order, but by then I finally had a bite of lukewarm pizza and had lost my patience.    I hear Mellow Mushroom pizza is pretty good.  Will try that and many more before giving Libretto's another chance."}
{"text":"The food is great but the take out service is not.  We've had two to-go/delivery orders that have been disappointing.  We were double charged on our take-out order and then we had to remind them of menu items that we had ordered because they didn't look to see if we had everything we needed in the order.  When we asked about being double charged they said it wouldn't be, even though we were.  With our delivery order, we received the confirmation and after waiting an hour we called the restaurant and they said they never received the order.  It's a shame because the food is really good"}
{"text":"Came into the place for a late lunch around 230. Had a slice of mushroom pizza and garlic knots. Hit the spot. Quick service, although the girl seemed like she hated to be working here. If you're in town for business and need to grab a bite to eat, would recommend this place. Right across from the bb&t building."}
{"text":"Waited almost ten minutes to be seated and decided to leave. As we were going out the door, a young man said \" sorry it's a little hectic tonight...\" I was thinking...do you work here? Why would you just let us walk out the door while you talked to your friends? I understand the Heroescon was bringing in more traffic than usual, but to put things in perspective, we went to Mortimer's Cafe instead and were greeted and sat immediately upon entering the restaurant."}
{"text":"First Visit....POOR SERVICE, management is horrible and so is the staff. I visited last Thursday and was refused service. Me and a few friends stopped by to order wings and pizza 'to go' on our way out of the Epic center, I requested wings as I did not want pizza and was told they do not have wings (so why is it on the menu?), I requested a sub and was also told that was not available and I had to choose from the pizza options that were on the line. I declined to order pizza and I still traveled the line with my friends and decided at the last minute, ugh I'll just tack on a slice and deal with it. When we go to the register I nicely asked if he could just ring me up for a slice and he refused to sell me a slice and told me to go to the back of the line because he staff already asked me what I wanted. I nicely asked why must I go to the end If I am already here and I only stood in line so I could order wings which you do not have, you would think one would accommodate you if they do not have options available although advertised. A second guy walks by and jumps in and says \"you guys are being \"A_holes\" just get to the back of the line, BETTER YET, do not go to the back we do not have wings and we refuse to sell to you\" :-0 WOW! I requested to see the manager only to find out that the guy at the register is the manager and he stated \"whatever my staff says goes, you will not get any pizza this evening\" How ridiculous, you let your staff run your restaurant and this actually will run business away with this mentality. I stayed with my friend who successfully ordered pizza (as her mind was made up upon arrival so they happily served her with no problem since she did not cause additional work on their part (HA!)) and she actually said the pizza was not tasty and she ate most but not all due to the taste. It's okay, I went to wild wing cafe upstairs and my money spent there just as well as it would have at Libretto's and the service was excellent.   *Tip: Libretto's- If you cannot handle the \"fast food\" service and the crowd that comes with the Epic Center, this is not the place for you and your business."}
{"text":"Always Has a good variety of slices to choose from for lunch. Place gets packed during lunch hour so get there before or after noon.   The slices are big New York slices. Try the Bianca pizza."}
{"text":"This would be a 3 or maybe 4 star review but we continue to have issues with Librettos take out.  It seems everytime we take out an order, something goes wrong.  Either it takes an hour (this has happened) or they give us someone else's order (this has happened), everytime we take out, we are disappointed.  I really wish this place would get their act together when it comes to taking out food,  as we would be much more inclined to go and recommend.  When they got our order wrong, I should mention they did credit a little money back to us, but we still had to drive all the way back to the restaurant to get the correct order.     The food itself is solid.  Basic NYC pizza that you will find at numerous places in the south Charlotte area.  Nothing special about it, its solid.  The rest of the menu is just ok. Good beer options, the atmosphere is just ok, service is good (when dining in).  There are many options of NYC pizza in Ballantyne (thanks to the thousands and thousands of New Yorkers who have migrated here), and at this point I would probably go to any of them, sans Librettos.  I just can't promote or give business to an establishment that is constantly screwing up our orders."}
{"text":"I decided to eat at Libretto's after driving into Charlotte late on a Sunday, 9pm.  I was spending the night at the A Loft hotel which is part of the same development.  On a Sunday, the food options were slim pickings at 9:45pm.  Most places nearby seemed to be closing at 10pm.  Libretto's comes off as a pizza joint, but they offer table service, and we had a beet salad and eggplant parmesan dinner.  We subbed broccoli for the pasta that came with the eggplant ($3 charge).  Overall, food was excellent and better than what we were expecting.  We also ordered a Brooklyn Lager and a glass of Cabernet.  The beer selection is respectable for a more casual space.  We were still hungry at the end of the meal, but the portions were acceptable and reasonably priced.  We ended up ordering three cheese slices to go for the hotel room.  Pizza was great.  All food plus tax came to $35 - relatively inexpensive.  Libretto's is casual, but a good value.  It won't be your first choice for a swanky date, but if you are looking to get some good, simple Italian food or pizza, you won't be disappointed.  P.S. - I'm from NYC, and can vouch that this place is legit, even by NYC standards."}
{"text":"Big libretto fans. We ordered a pizza and wanted whole wheat crust so we paid extra for it... they gave us regular crust. We called, spoke with a manager, and he reimbursed us. Amazing customer service, even better pizza"}
{"text":"We visited Libretto's Pizzeria in Ballantyne last night, after a torrential downpour. It was relatively empty even though it was a Saturday night, due to the weather.  The restaurant is smaller than it looked like it would be from the outside. It has faux brick walls and rustic wrought iron accents. There are at least 5 large televisions in the relatively small bar area. We opted to sit at the bar, as the hostess informed us the back dining room was a little loud.  Service was unimpressive. After 5-10 minutes of waiting, we caught a waiter's eye. He came over and asked us if we'd been helped. When we said no, he seemed taken aback, but decided to take our food and drink orders anyway, and he was our waiter for the night. When I ordered Miller Lite, assuming I'd get draft since it was clearly on the tap, I was surprised to receive it in a bottle. He explained that it was on special in the bottle, which was great. Just wish he'd mentioned that earlier.  When my husband needed a drink refill, our waiter was either nowhere to be found or actively ignoring us. (He had perfected the \"ignore everything but what's directly in my line of sight\" walk throughout the restaurant.) Someone who appeared to be a manager paced all around us, but his eyes were so glued to the Panther's game on the television that there was no way to get his attention without shouting at him or physically going up to him. After waiting so long for a refill that he had almost finished his meal, my husband finally decided to go directly to the bar for his refill. When the bartender informed our waiter, he didn't seem terribly pleased with us, but it was a relatively empty restaurant, and trying to flag down someone - anyone - for ten minutes for a refill was unacceptable.  The pizza (San Gennaro) was good, but didn't stand out. We ordered a Medium which was ample sized for 2. The Bruschetta \"3 ways\"? Not so good. The classic tomatoes/onions bruschetta topping had pale tomatoes. Not a sin in December, but it's August. The olive tapenade was good, but the bean puree was underseasoned and bland.   We had a nice evening out at Libretto's, but the food was pretty forgettable and the service was sub-par. I'm pretty sure we won't be back. There are too many other good pizza options in this area of Charlotte."}
{"text":"Pizza is good but service SUCKS! And this isn't from a one time occurrence. I've tried to give them multiple chances as recent as today, but every single time I am met with a less than friendly attitude. Customer service is definitely not their thing. So if you don't care how you are treated as a customer this is the place.  Like I said, the pizza is good. But if service, or shoot just being treated like a valuable customer, is as important to you as the food. Then this is not the place.   Me and my money will go elsewhere."}
{"text":"I've previously sang the praises of Libretto's in Ballantyne. We have a number of pizza spots here, but Libretto's has always been the best tasting and most consistent.   Unfortunately, things have changed.   The past three deliveries have been pretty badly burned. Not just a little over cooked, but burned.   And to make it worse, for the last three deliveries (at least, we didn't check before), they have doubled charged the tip amount. I put $5 in the online order, and they've billed me $10 each time. It's a $15 pizza, a 66% tip is a bit ridiculous.   I have really liked Libretto's in the past, and for that reason I will give them at least one more try (they have an option to order your pizza slightly undercooked, maybe I need to do that from now on). But there's a new pizza place opening in Stonecrest, if they deliver and make a good pie, it's time to move on."}
{"text":"Bottom line:  Disorganised and unprofessional.   I flew into town and stayed near the airport.  I was not sure if they would deliver out here SO ASKED THEM IF THEY WOULD. They told me they would so I ordered,  PAID and waited. The not too intelligent worker behind the phone did not know the menu at all and put me on hold for a total of 27 minutes as well as getting sidetracked by some other email conversation every two minutes. The manager had not idea how to run any type of business.  In the end I wasted 2 and a half hours of my time waiting and by then it was too late to get something else. Please just order from someone else. It's not worth their most likely mediocre attempt at pizza."}
{"text":"We went at a weird time at the end of lunch and were the only people eating for a while. Their menu was good looking and we ordered the garlic knots, and the Spinach Pie calzone and added eggplant. The garlic knots could have used a bit more time in the oven and some flavor, but the dip was nice and garlicy. The calzones came out very crispy...but we were pretty hungry so we didnt wanna be pains and send them back. We will try them again since they had a good looking menu and the staff was nice."}
{"text":"Great food but service is awful. Wasn't even crowded and waited 20 min before someone even acknowledged our presence at our table and that's after we had to ask for a server."}
{"text":"I ordered delivery there was a $3 charge plus I had to tip the driver. It took over an hour for delivery. So my small chicken Caesar salad was $16.80 after over an hour wait. :("}
{"text":"I have had the pizza to go and it was AMAZING! I have also been there for lunch and got the calzone, also wonderful. The service was a little slow for being a lunch place down town. It took about 20 mins to get our food and 15 mins to get our check. I wish it faster for the lunch crowd but still the food was wonderful so I will go back.."}
{"text":"The service was awful. The wait time for 3 pasta dishes to be ordered and brought to our table was an hour....the restaurant was EMPTY. The spaghetti and linguini was broken in half before boiled which is a huge NO in cooking long pasta....any real chef knows that. The waitress didn't know which red wine was Cabernet or Pinot Noir so we were left trying to figure it out. The Librettos in Ballantyne is 100% better - I was embarrassed bringing visiting guests to this location. I won't ever go back."}
{"text":"Been living in the area for almost 11 years and never had been to this place.....man I missed out all of this time!  Hadn't been a big fan of the pizza \"restaurants\" because typically they are really only good at pizza and not the other dishes.  I was in for a pleasant surprise at Libretto's Pizzeria.   Decor/Atmosphere: It reminds me of a pseudo bar in a pizzeria.  Traditional dining area is in a side room so I didn't have to have my kids around alot of people at the bar.  It was nice enough for the four of us to sit and have a meal and talk. Food:  There is where the surprise comes in.  I been to other types of restaurants like this and usually the dishes are overlooked because the place concentrates more on the pizza.  The family and I started off with simple mozz sticks.  The marinara sauce is outstanding.  For dinner I had the chicken marsala.  Typically not my dish, but it WAS GREAT!  Chicken was tender, marsala sauce was really good.  Even the presentation of a simple side salad was better than I usually get at other restaurants. Cost:  VERY good price for the portion sizes.Fed family of 4 under $40, even with appetizer.  If you want or need somewhere to be with your family or even for a simple date night with the Mrs or Mr., go to Libretto's for really good time and good food."}
{"text":"Great pizza, very friendly and helpful staff, and spotlessly clean.  Look no further than Libretto's!"}
{"text":"In the mood for a large slice of some goooooood pizza? This is the spot to go! They sell pizzas by the slice or by the whole. I always get 2 slices but feel completely stuffed afterwards (so worth it). The prices are completely reasonable and definitely a great deal for lunch in Uptown."}
{"text":"Visiting the area for the weekend from Columbus Ohio but am a NY native so when I find something that is \"NY style\" I have to try it! The staff is very friendly and can answer any questions you have about items on the menu. Very quick take out service! I ordered a chicken cutlet hero and a chicken cutlet parmesan hero, both delicious, seriously couldn't be better, I wish I was here longer so I can try everything! Will deff be recommending and visiting this place every time I'm  in town!"}
{"text":"Enormous menu w/ lots & lots of options - salads, sandwiches, pasta & pizza - either whole or by the slice.....ANNNND there's thin or *thick* crust   We went here twice in the 3 days I was in Charlotte.  My tummy was thankful.... waistline, not so much but who listens to such a silly body part  We got slices & a whole pie & they were pretty consistent:  Pizza Bianca for me - creamy ricotta & lots of mozz w/ an awesome white sauce make this a creamy, chewy slice that I couldn't get enough of   Veggie Pizza - no olives which was perfect for my coworker - I would have rated down for this but it was perfect for him   Zitti Pizza - kinda bland & carby in a bad way & coming form me, that's saying something. The starches from the pasta (& there wasn't a lot of it) & the overabundance of cheese gave me a tummy ache   [ But then, the next morning, it was *great* cold. So note - hot pasta pizza bad, cold pasta pizza good ]    .....   you may notice how I *did* eat it again but come on, everything deserves a 2nd chance, right?  Spinach Salad (you *know* this wasn't mine!).... coworker was completely impressed by this salad w/ its veggies & hard-boiled egg but was hoping for a bacon dressing instead of the Balsamic Vinaigrette but claimed it was still impressively tasty.... I say yuck all around but he luved it   Best tip: stick w/ the Bianca!  Wonder if I can get that in a thick crust variety.....  Ending assessment? I now have to work Libretto's into my Charlotte rotation for every trip....so many more menu items to experience!"}
{"text":"We get delivery from here a lot because it is the only delivery outside of the chains in our area. Too often the crust is burnt so we started ordering our pizza \"undercooked\" which is still hit or miss on what you receive. The pizza always seems to look like it has a rough ride to our house. Tonight we ordered 1/2 sausage and received a full sausage pie after about a 75 minute wait (added photo of pie and order in the photos). My husband hates sausage. Disappointed.... Again."}
{"text":"Opening day!!!!!!!! (July 26th,2013) How exciting right??!! I've been following Libretto's on Instagram (@librettospizzeria)  with much anticipation for the GRAND opening. I thought I was going to be apart of the first 100 to come and receive free pizza for a year. I was sadly mistaken lol That's Saturday (7/27/2013) for the free Za for a year. Amazing offer!!! Can't pass that up if you can get there. I went for lunch with a couple of co-workers and two of them had lunch specials. One had half a hero with a side salad and soda and the other had a slice of cheese with a side salad. I had a personal sized pizza with Spinach and six of the Garlic & Butter wings. Our waitress was fun and giggly (not giggidy lol) but, didn't know the menu yet or, what diet soda was. My lunch guest asked what diet sodas they have and our waitress asked us \"is lemonade diet?\" Hilarious, she was really nice. I was thinking they were going to be slammed with people but it was just us and a couple of other folks. With that being said, I was surprised how slow the service was and how long the food took. I would think they would have had a few cheese pizzas ready \"on deck\" for lunch slices. My lunch buddy that ordered the slice didn't get it until we were ready to leave. Over an hour. The salads were fresh, and the Hot Italian Hero was good, no complaints there. The Garlic & Butter wings were cooked fresh but a little greasy and it hurts me to say this, there was a long feather...still attached...sad. I'll keep the pic to myself. My pizza was okay. My co-worker enjoyed it more than I did. Just a few things that Libretto's needs to work on. I would say time management in the kitchen to get food out quick and hot. Our food was brought out one item at a time I know this isn't their first location so, they've got it!. Libretto's will be a great lunch destination, just give them some time to work into their new space. Hopefully I will be going back to try some pastas and other delicious menu items. Check them out!!"}
{"text":"I wouldn't walk in Libretto's again if you paid me. Came in for a quick beer while waiting on some take out. The bartender was quite caught up in arguing with a manager to notice us. When he finally did, it was almost as if we were inconveniencing him. When our food was finally ready, we continued to wait for him to bring his heated point on home directly in front of us before finally handing is our tab. I was almost sure it was an April Fool's joke. The food was less than stellar as well. I didn't know tomatoes could be greasy or that fries were best served hot on the outside, cold on the inside. Gross. Had the food even been decent, it might've made up somewhat for the complete lack of professionalism or courtesy."}
{"text":"Ordered via direct website at 252pm, at 341pm we received an email saying our order would arrive at 423pm.  So 90 minutes for 1 pizza to go 2.1 miles to my office.  When we called to inquire about the time, the manager stated that a person typed the info in wrong.  They'd be here in 25 minutes.  When we pressed the issue he then said that the person waiting tables put the order in late.  He stated he was in the back helping with paperwork which is why he couldn't help when they were apparently too busy to place an order.  No apology, no trying to make it right.  Some Bro is in management and had every excuse in the books but no interest in fixing the issue or repairing a bad experience.  Bad news."}
{"text":"Being from New York I know pizza. The number one pizza in Charlotte was from La Strada from 1974 to 2012. Now, the title of best pizza in our area is definitely Libretto's. Pizza that you see in Brooklyn, NY is virtually identical in taste and look."}
{"text":"Margarita Pizza was yummy and staff were friendly. Definitely good pizza for the area, As someone who has had pizza in the Northeast multiple times, this place does quite a good job of making quality pizza!"}
{"text":"First the good. Libretto is in a great location. And they gave me a free slice of vegi pizza while I waited on my take out order. Which I thought was nice. I'm glad they did because even though the slice wasn't that great it ended up being the best thing I got. The whole wheat pasta w/chicken was awful. The Pasta fagiole was worse. I really wanted to like this place but I have to say it was a bust. I ended up throwing most of it away (which is something I never do)"}
{"text":"Ok, look... this is a family-style Italian/Pizza joint... they have fancy paper napkins, and a cool ambiance that almost mirrors romantic, but if you're looking for highfalutin... this is NOT your place.  The food is good, well made, fresh, filling, and yummy.  My husband and I generally get take out on Friday nights, but last Friday (10/3/2014) I decided to tidy up well enough after my evening workout for him to actually take me out... (I know, sometimes it's more of a stretch that you'd guess after a long week)... the point is... we wanted to go somewhere tasty, and close to home... So we chose Libretto's (as we have done MANY times before)...  This time, we ordered the El Diablo pizza, and I had a spinach salad with salmon... The salmon was a TAD overcooked, but no matter... no one actually asked me HOW I wanted it cooked... The salad was crisp and fresh, and the pizza was delicious... I decided to really splurge and order a glass of the house white... it was a Pinot Grigio... cool, crisp, refreshing, and really took the bite out of the super spicy El Diablo.  Our waitress was prompt, courteous, very kind... the hostess who seated us was happy and chipper... the food was yummy, as always.  I have also had the meatballs, the lasagna, the antipasto, and many other dishes here... if you like garden-variety home-made Italian food, this is the place to go.  If you're looking for wait-staff in tuxedos and uber-fancy service... go elsewhere... people bring their families here... there's always some loud dudes at the bar, someone's always laughing too loudly... it's great!  I love it!"}
{"text":"You know, even us bred Chicagoans can respect a well done slice of the thin stuff.  And I respect Libretto's pizza.  Heck, I downright like the stuff.  I got a slice of the veggie pizza, and I could actually *taste* the veggies... but you know, in a good way.  They tasted fresh.  None of that slimy canned nonsense.  There was a light smattering of sauce, sufficient cheese (you don't want too much cheese or too chunky a sauce on a thin crust) and the crust was delightfully crispy.  It was just a well constructed piece of pie. Now, the contentious point between myself and David X. was the grease factor.  I really enjoyed the freshness, the minimal grease on the slice.  David X. felt that his slice of mushroom would have benefited from a nice grease slather.  Well, I suppose that comes from a preference point.  If you're a greasehound, you will not be pleased here.  But if you actually kind of like tasting every ingredient on the pizza, if you're the type who sometimes looks at a Sbarro's slice and then runs through a napkin or two trying to clean it up, then you'll appreciate Libretto's. Heck yeah I'll be back."}
{"text":"18.99 for the cost of a 18\" pizza would have been acceptable with 3 additional toppings if you could actually find the toppings.  We added broccoli, onions, and mushrooms.  We'd guess there were 6 mushrooms, 5  broccoli crowns and maybe a quarter of an onion.  I don't have an issue paying extra for toppings, but basically this was a cheese pizza with  enough toppings for 2 out of the 8 slices.  I don't know the area as we are just passing through but with the amount of pizza places around, I'll look someplace else if we come back. This isn't a 2 star review i'd give if 1.5."}
{"text":"Let me start by saying that my co-worker and I went in last week and had a different server.   Young kid, probably out of college and although he was a little slow getting started, he made up for it and provided good service.   With a little more time and training, he could be excellent.  We did notice that the dining area consisted of me, my co-worker and another patron sitting at another table yet we sat next to a dirty table for over half our meal.  It took four people and numerous trips to clear a four person table.  Not the most horrible thing in the world but still, not very professional.   Then there was today.   Fail.  Royally.   We went back today.  How was our meal?   I wouldn't know since it was over before it began.  Last week and again this week, no hostess to greet you at the door so you're standing around looking like you're waiting for the 3:45pm bus to Nowheresville.  She finally shows up like she just came back from cheerleading practice   and seats us in the dining room.  There is no one else in there and there are two tables outside being served (total of 4 people outside).  A gentleman joins the dining area about 5-7 minutes after we arrive and he tells the hostess that he would like some ice water and she runs and fetches it for him.  Ummmm, it's hot outside. ....I sure would like a drink of something....Where's our waiter?  Then she winds up taking his order.  Hello?  Ma'am?  Bueller?  Bueller?  Anyone?!?!?!?  So he's got a beverage and his order placed and we don't have anything??!?  Two more minutes of waiting and it was over.  We left and I looked right in the face of the guy at the register who said absolutely nothing as we passed.  I wonder how long it took for anyone to even realize that we were gone.  My friend and I walked right over to Dickey's next door who must have overheard our conversation about your place because guess she gave us our beverages on the house.  Dickey's = 1 Libretto's = 0 Fail. #slackers"}
{"text":"When attempting to order a pizza I asked if their crust is vegan-friendly and was immediately told no. Though this was the only food option available- I persisted and encouraged to ask if the crust is homemade, which she confirmed it is. So I asked if she could find out if they use eggs in the dough at all. Annoyed- she put me on hold and asked. When she delivered the news back to me, I said \"ok...\" and was about to place my order when I was hung up on. I understand that not everyone supports vegan lifestyle but as a business making money from serving food, I would have expected at least a little customer service when asking a few simple questions about the food- and then being hung up on entirely before I could order. Needless to say, I did not call back."}
{"text":"Omg! This pizza is incredible! One of the best in Charlotte!!!   Half Cheese pizza - Half Blanco! Both were delicious!!  Love the outside seating!  Their customer service is incredible! Our pizza arrived with a bubble hole, and before they brought it to us our waiter said he had another one already in the oven. The first pizza was amazing. I brought the other to my neighbor.  He and his family said it was the best pizza they've had in the 8 years here in Charlotte!"}
{"text":"Ordered a large cheese and a medium with ground beef, or hamburger can't remember. Order was ready on time for oil up, the guy who helped me was nice. The pizza was good, close to NY good. Opened the medium box and was shocked at the tiny amount of beef. $3.25 topping charge and they barely put any on it! That was a rip off to charge that much and put that little . Probably continue my search for a better NY pie."}
{"text":"Pizza was good. That is where the good news ends. The garlic knots were soggy, the wings weren't even tossed, and I was charged for extra blue cheese/ranch and never received it. I heard great things about this place and spent nearly $60 for good pizza, slow delivery service (over an hour wait), undressed wings and no sauce that I was charged for. This will be, most likely, the last time I order from this establishment."}
{"text":"Being from Chicago, it's HARD to find GOOD PIZZA in my books however I can definitely DIG the pizza at Libretto's. My husband is a NYC native and while in the EpicCenter we were so hungry we went into the Liberto's there and grabbed a slice. I wasn't impressed, my daughter wasn't either (we are both Chicago Natives). My husband insisted that it was because the pizza had to be heated and if we sat down in the restaurant and ordered pizza that it probably would taste better.  We were staying in Camden Ballantyne in corporate housing while our home was being built and once evening when I refused to cook my husband said let's walk over to Libretto's as he was adamant on making sure we TRULY taste the pizza there because it's made NY style and he wanted to feel like he was back home in NY.. I must admit the pizza was tasty to be so THIN, being from Chicago I need some type of thickness to my pizza however the flavors were all there so I won't deny this place that fact. I say it's OK because I can eat it without complaining to much because of the flavor. I would recommend people to definitely give them a try. If you like thin crust, NY style pizza you are in for a treat. However if you like Chicago style pizza you will be disappointed however if you just like FLAVORFUL pizza then you are going to the right place.  I say this according to our ingredients we get on our pizza: Spinach, Garlic, Onion, Mushrooms  Other Tasty items we tried using our coupon book: Garlic knots, Shrimp Scampi (a tad bit bland but it will do with a coupon ;-)  Where they lack: SERVICE, they have some very unattentative staff and rude staff as well. I don't LOVE this place so I don't give them business often however the couple times I have I didn't have a great service related experience."}
{"text":"Tried this place a couple of times too many. It's just not that great. Pizza, salads, garlic knots... none of it stands out. Wouldn't try it again even for free. Much better places out there."}
{"text":"I ordered wings online earlier today, got an email from ChowNow at 12:40 saying my order was placed etc. I showed up to the Park Rd location at 1pm and they hadn't even rung in my order to the kitchen. The receptionist was apologetic, however, the restaurant had 1 table and all the staff were all just standing around. I then sat for 15 minutes for my food, with no offer for anything to drink or a partial refund for the wait or anything. I'm not sure if the online ordering is down or if the staff was just not paying attention, however individuals on lunch breaks do not have time for 45 minute wings nor does it make me feel any better by the customer service I received.   I then went to their website to contact them and let them know their online ordering is messed up etc, and their contact page on the website wouldn't submit comments either."}
{"text":"A group of us ate here because they were in the mood for pizza. They have a variety of options to choose from. I ordered the mushroom & pepperoni slice, it was okay... nothing more, nothing less. I don't really expect much out of pizza restaurants in the south. I had to add a lot of pepper and garlic powder to it. Everyone agreed that the pizza wasn't great.  The young girl who was heating up the slices was a bit rude. She didn't smile or interact with anyone. It seemed like it was killing her to take our order."}
{"text":"Food is ok but not great. Recently ordered take out which I do not advise. The portion was small and the food was below average. The pricing for what I received in terms of quality and portion size was not reasonable. I will have to go elsewhere for good Take out as this is the second time that I was disappointed."}
{"text":"Great last night place in Epicentre. Connected to Strike City (pizza is brought in for bowlers and others!) this place is known for it's endless options, both for a full pie or a slice. I usually vary it up with 2 slices. Sausage is good and the margarita even better. Usually packed with folks who are getting the base of food they should have gotten before the 10 drinks they put in themselves. Seating is limited, but there are places to eat outside when the inside is full."}
{"text":"This was my first time ever at Libretto's and all I can say I is WOW!   The food was great it came out hot and everything was good.  I had the lasagna and a side of mushrooms and just so you know this place was more than your average pizza place it was more of a fine dining experience.  The sauces and cheese on the Lasagna was good and you must try the stuffed mushrooms they are absolutely the best.   The server was excellent but I was thrown off by the delivery driver that kept walking back and forth throughout our stay it was very unprofessional.   I will visit this place again it was great to receive good service and food under one roof for a change."}
{"text":"We used to visit this location when it was Al's Pizza.  We loved the retro modern decor, menu options, and taste of food.  We tried Libretto's for the first time recently, and it was just kind of average.    Our party of five was seated in the very last large booth.  While these big booths are fantastic for larger parties, they're unfortunately aligned with the open kitchen where we could see the hustle and bustle of the servers, chefs, and delivery people standing around, and then coming and going.  (p.s. That kind of ruins the \"open kitchen\" concept.)  The last booth also gives a fantastic view into the back room with its unflattering fluorescent lighting, the comings and goings of the servers, and the brisk wind from outside due to the propped open back door.    I was going to order one of their specialty pizzas but, unfortunately, I did not.  I opted for the Chicken Francese (Chicken French), because it's a Western NY specialty that you can't typically find outside of Western NY, and I was excited to see it on the menu.  The chicken was just ok.  It didn't have a lot of flavor.  And then I got a pile of plain pasta on the side.  Really?  That's it?  No veggies or anything?  So while it was edible, it was nothing exceptional and I was kicking myself for not trying their pizza which, I'm sure, is much better than their pasta dishes.  The meatball hoagie and calzone that others at the table got looked much better than my somewhat boring entree.    As for the service, it was quite slow.  It was a lonnnnnnnng time before we got our garlic knots appetizer (20 minutes?) and then even longer after that before we got our food.  And then another 5-10 minutes before I could even flag down our disappearing server to bring me Parmesan cheese (that should have been already on our table) to make my bland dish a little more exciting.  We also had to specifically speak up and request our choice of pastas because our server never asked what kind we wanted.    Would we go back?  Possibly.  I would like to give their pizza a taste test.  I certainly wouldn't get a pasta dish again.  And I don't want to sit at the \"back of the bus\" where there's no atmosphere and where the delivery people just hang out, leaning against the walls."}
{"text":"A low-end, dirty dump that shovels NY pizza slices and that's about it. Fugeddabout it!  I came for lunch; the cashier guy started to take my order, then ignored me to answer the phone and take an order, leaving the pizza oven guy to figure it out. I was given my pepperoni calzone in a cardboard box even though I was \"dine in.\" Another trip up to ask for silverware, which the pizza oven guy finally found in the unmanned hostess podium. I tried to connect my tablet for some lunchtime reading and....you guessed it...no wifi. The cell service in their location is crappy, so effectively I was \"off the grid\" with no Internet connection. To have no wifi in 2017 is astounding to me, and a terrible business decision. (More likely, they never thought about it.) If all you want is a slice and a drink as take-out, you're OK. Otherwise, steer clear of this dirty, poorly run dive with no plates, utensils, or wifi. Fugeddabout it!"}
{"text":"My boyfriend and I decided to have a late cheat night (around 11pm). We reluctantly ordered from this place knowing we were probably going to be disappointed because of past experiences and friends who warned us. We definitely were. We ordered a small Margherita add spicy sausage and pepperoni knots to go. We wanted a dinner salad to share and dessert as well but they weren't serving that stuff at the time (Which is odd to me on a Friday night when you're open til 3am...). Anyways, we finally get the pizza and knots home (we live about 3 minutes drive away) both the pizza and knots were cold, the knots were over cooked and burnt and the pizza was a sloppy mess of cold cheese, cold sauce and NO sausage. We were charged for the sausage that was not on the pizza as well. This is definitely not the best pizza in Charlotte, far from it. We will not be returning. Save yourself the money and go somewhere decent."}
{"text":"Came in for a nice Sunday dinner with the fam and we had some good food! I didn't get any of the Pizza by the slice but God it looked good! I ended up getting the Eggplant Parm and it was great, it was pretty large and sat on top of spaghetti- It hit the spot! This location seems to get really busy and they definitely cater to everyone. The menu offers a little bit of everything. i will definitely be back to try some pizza!"}
{"text":"I would give this more stars but the fact that they don't validate parking is ridiculous and i'm not going to pay $10 to just run in and out of this place. Now i have been in the epicenter and went a head and grabbed a slice and they were pretty tasty. Service is whatever and its pretty reasonable. I like the Ballentyne location better because of parking and the service was great but I don't live very close to that spot."}
{"text":"This review is just regarding the delivery experience.  I ordered through Eat 24. My pizza showed up cold about an hour and 45 minutes later. The place delivering my pizza is only a block and a half to two blocks away. They had a ready excuse (places with bad service always do). I was told that they had six orders at the same time and apparently that never happens. I called the restaurant at the one hour mark and was told that my pizza was only a couple of minutes away. 30 to 45 minutes later when I received my cold pizza.  There was no heat detectable through the box when I got it right out of the supposedly insulated delivery bag pack from the delivery guy nor could I detect that special aroma of a warm to hot pie. I called the restaurant again and complained to the manager.  He explained that my pizza had been the last order to go out (of course!) and that the delivery guy had already headed home. He said the only thing he could do for me was give me a refund. I'll be paying close attention to see if that actually occurs. I will not be ordering or visiting this place ever again. Fool me once, shame on you.  Fool me twice, shame on me."}
{"text":"Bar service...great. Food...better than average. To-go counter service...TERRIBLE. You would think an empty restaurant on Labor Day would be excited to see a to-go order walk through the door. Alas, you are incorrect, because the to-go counter will only treat you with sarcasm, disrespect, and a general \"I don't have time for you\" attitude. Despite living less than 1/2 a mile away, most likely will not return due to the poor service from the to-go counter \"waitress\". Such a shame as we were hoping to support a local chain. Oh, well."}
{"text":"Stopped in randomly on a rainy Sunday and found this hidden gem! The calimari was served with fried cherry peppers which have it a spicy edge, very tasty. Then we ordered a lasagna pizza and a florentine pizza. The lasagna pizza had dollops of ricotta, fresh mozzarella and tomato sauce. One of the best pizzas I have bad in Charlotte! Very happy to have stopped here and the waiter was super friendly. Will definitely return :)"}
{"text":"Being the huge pizza fan that I am...it's really so sad for me to say that this pizza is just ok in my book.   They had a great first impression! When I walked in I did like the huge variety of available slices...they had cheese, pepperoni, meat lovers, and Chicken Parmesan just to name a few...   I opted for a slice of the Margherita and it was topped with fresh basil...which was super yummy...Now I was not disappointed with the toppings the fresh mozzarella and crushed tomatoes were delicious...However, in my opinion, the crust is the best part of NY style pizza...and to me this crust just turned out ok...it was not as thin and crispy as I usually like...or maybe I just had a bad batch...who knows!   But since they do have daily specials and lunch specials which seemed very reasonable, a good variety on the menu and a nice atmosphere with some tvs, bar stools ... I am sure I will be back...I have to give it one more try!"}
{"text":"This was our first time ordering here. I was hoping it would be worth it. We were so disappointed. This is the least authentic Italian food I've ever had. We ordered through Ubereats....Baked Rigatoni, Garlic Bread w/ Cheese and Pinwheels with pepperoni and extra cheese. What a waste of $35. I took before and after pics...first impression and after we actually dug in.   First of all, there was nothing baked about the rigatoni. The sauce was watery and the cheese was just melted on top. The \"garlic bread\" was basically a sub roll with cheese melted on top, and I'm pretty sure there was no garlic anywhere near it. The pinwheels would have been decent if the cheese used wasn't so salty and if the bread had been cooked through...literally raw dough inside. We ended up throwing eve. Please see the pics...you can't make this stuff up. Needless to say, I will never be ordering from here again.   **Response to Mike: Thanks for responding. The mere fact that you said \"you don't know what other baking could be done\" to the Rigatoni is odd to me. Maybe you're right about the missing ricotta b/c there definitely wasn't any in there, but even if it had been, the sauce was so loose and watery that I fear it would have produced the same or at least a similar result. The \"garlic sub roll\" could have at least had garlic on it! The Pinwheels literally had uncooked dough inside....forget a/b the fact that they were salty. I said in my review that the saltiness was from the type of cheese used. I still stand by everything said in my review, and I, too, wish I had a better experience with Libretto's. Unfortunately, I did not. Thanks again for responding though."}
{"text":"I enjoy this pizza to end my night every time I visit the epicenter. I literally drag my friends here every night we visit. I will not be going back any longer however due to the ridiculously rude customer service I was given recently. They think because they deal with drunk people on a regular basis that people will not realize how rude they are, they are mistaken. I will not be back and I will not be encouraging my friends to go either. They have lost a loyal customer."}
{"text":"I love these two places, immensely.  We've been to the Woodlawn location many times. We recently moved to a different neighborhood and were happy to find a Libretto's near our new place. I've ordered delivery, twice, already!   What a treat to have fresh, delicious, Italian American food with no mess in my kitchen!  The chopped Sicilian salad is so flavorful and crisp! Lasagna is a dream. The portions are generous! The cannoli, mmm.   But remember, the food has to travel from the store to your location, so, if mozzarella sticks are hardened by then, you'll live."}
{"text":"Love the bar area's atmosphere. The service is great, and the food is delicious!  We keep coming back for a chill evening w/ good food and drinks."}
{"text":"This place is attractive, has great service and delicious food! Not generic, canned stuff, but real yummy Italian American cuisine. Casual, too"}
{"text":"Best pizza in Charlotte!  NFL playoffs is the perfect excuse for pizza delivery, and whenever my husband and I give into our pizza craving it doesn't take long before we call Libretto's.  It is by far the best pizza in Charlotte and we were thrilled when we found their Ballantyne location.  We have eaten Libretto's pizza many times and we are never disappointed!  That being said,  I have to rate the restaurant itself a 4/5 is because while the pizza is unbeatable, the rest of the menu doesn't offer anything to write home about. My husband and I were both disappointed after testing out a few pasta dishes and salads. So make Libretto's your go-to pizza place, but don't assume it can meet all your Italian dish needs."}
{"text":"I was in town for the Hornets vs Thunder game 1/2/2016 and we stopped by here after the game to get some pizza. The place was pretty much packed and I understand why. This was by no means the best pizza I had ever had but this spot sells by the slice or however much you want at a really reasonable price and the pizza is way better than a chain pizza place. I just became a season ticket holder for the Hornets for the 2016/2017 season and I see lots of late night Libretto's in our future."}
{"text":"On Sunday, January 5th at 6pm I ordered pizzas online from this \"restaurant\", and went there to pick it up 45 minutes later as the order confirmation instructed. When I arrived, they didn't even have the order. They tried to shrug it off as if I ordered at the wrong location and that I was supposed to print the order confirmation...what terrible and insulting excuses! I rendered the order confirmation email on my iPhone, proving to them that I did order and pay for the requested pizzas. The employee went back and \"found\" the order and asked me to wait as they fire up the pizzas... I left. There is a reason why I ordered online. I will NOT be coming here again."}
{"text":"I know this is supposed to be a pizzeria, but I just wanted to let yall know their BROCCOLI was on point!  My son and I shared the spaghetti and marinara which I had prepared with sauce and broccoli on the side and we really enjoyed our meal.  Plus my son is picky so if he eats the broccoli you know it's got to be good.  Anyways, the place was very nice, cozy restaurant.  There is a bar area and a back area with more tables which is where we sat.  If you are every in Ballantyne and need good pasta for a good price this place is where you can surely be pleased."}
{"text":"Our first experience to Libretto's was on July 12. The pizza was terrific. Headed back the following Saturday, 7/19, with the family. Ordered two pies: sicilian and white pizza. I don't think I've ever had this happen. Someone reheated the white pizza from the case! It was stale, burnt, brown on top, quite disgusting. I informed our server who \"tasted it for himself\" to see if he agreed. We had to wait for another pie to be prepared fresh. No adjustment made in our bill. No apology from a manager. Too many other places to get pizza in Charlotte. Oh and how do we know the pizza came from the case? It was full when we came in; one pie was missing when we left.  Won't be back at Libretto's."}
{"text":"***This review is based solely on the LATE night service***  This really is a prime location to catch all the after hours crowd. After drinking and enjoying a night out in the Epicenter...there is nothing better than soaking some of the liquor up with greasy goodness!!   Things to remember at this location:  1. This is not fine Italian dining. Don't expect top notch service with a friendly face or \"hello\"...Be prepared! When they stare at you (that's your hello) order your slices and get out the way.   2. These slices are huge and greasy. Get LOTS of napkins!   3. When you're finish throw your own damn plates away! It's a steady line of people rolling in and I guarantee you they are not your mother and don't want to clean up behind you!   Is this the best pizza I've ever had? Nope.   Would I go earlier in the day if I had another option? Probably Not.   But for dining after 1AM would I recommend it? YUP."}
{"text":"I have never eaten at any of the Libretto's locations, and I finally got a chance after hearing nothing but good things.   Upon walking in, I noticed the décor was pretty dark and rather bland, but we weren't looking for a fancy place, so it didn't matter too much. We went on a Sunday night, so it was basically empty.  I ordered a chicken fettuccine alfredo, and my husband got the chicken parmesan entree. My meal was great! Linguine was al dents, the sauce was creamy and cheesy as it should be, and the chicken was cooked perfectly. My husband wasn't impressed with his meal, saying it was \"okay.\" Dessert was tiramisu, which was light and not overly sweet (yay!).  We had a Living Social deal that saved us some money, so that was nice!  This is definitely not the place to go if you're looking for a nice romantic meal by any means, but if you want good Italian, then you've come to the right place!   Will I return? Sure!  :)"}
{"text":"Librettos has unfortunately been an inconsistent experience for me. Sometimes the food is great, sometimes the food is horrible. The pizza is NY style and it's really good sometimes, with perfect crust. I like adding prosciutto and spinach to the Bianca. It's one of my favorite pizzas in CLT... When it's good. Then other times the pizza is cold or isn't cooked enough or just meh. It's really expensive pizza ($2.50 per topping with bacon costing the same as tomato?) so it's hard to justify the gamble. The pasta dishes are on par with Olive Garden. Ravioli tastes like froZen kind from grocery. Don't get to go slices- always cold and dried out toppings"}
{"text":"Where do I begin? I've had two separate experiences with this place. The first time was calling for delivery. The person who answered the phone stated that they were no longer delivering for the night waaay before closing time. That's fine. The second time was a horrible experience, and the food is not good enough for this poor of service. First our server was completely clueless ( bless his heart ) he stated it was his 5th day. All of our food came our separately. We waited 20 minutes for fries and 25 for a whole meal after everyone was already done. We ordered side salads and received entree salads as if we ordered 2 entrees. And might I add we were the only people here when we ordered, so being busy is not an excuse. The manager looked directly at us when we were trying to get her attention and acted like she did not see us. We had to ask the server for her and it still took her 10 minutes to come speak with us. All while they were not busy.    I should have listened to the employee who said that since they got a new owner or manager that the place was trash.   Needless to say... avoid at all costs. Papa Johns will treat you better."}
{"text":"It took 1 hour and 20 minutes to deliver a medium pizza and a salad. It was a Friday night during dinner, so I feel as though the timeframe was appropriate.Delivery driver was very polite.The staff was friendly and nice when I called to check on my order. Food was ok but not worth the $26 I spent on it. I won't be ordering from here again because the quality of the food. The staff did a nice job!"}
{"text":"My wife and I went to dinner with another couple.we had a reservation and were seated promptly. The waiter came quickly and was followed by a young lady trainee. The drinks came fine it once the entrees arrived we had never received our bread. Once we asked for the bread they apologized and TEN minutes later it arrived. That aside, the pizza, manicotti and lasagne were very good. Other than a little service hiccup this was a good spot."}
{"text":"On the coldest night of the year in Charlotte, Librettos didn't have the heat on. The dining area, for families and couples, has always been noisy beyond belief because there's no way to keep the noise from the bar out. The waitress told us that the entire restaurant at this location will be turned into a sports bar so the whole place will be noisy. Tonight's meal was our last at Librettos. I've lived in Charlotte over 27 years and seen some great restaurants fold up their tents and leave town. How you treat regular customers says a lot about the management. Food's still great, but it's a shame that the bar and sports crowd wins at this location. Thank you."}
{"text":"Decent pizza and they deliver so that is a plus. Like the thin crust. Would have given it 4 stars but the chicken wings were underdone. If you order them just specify well done :)"}
{"text":"We ordered a chicken florentine pizza to try Libretto's for the very first time. It will also be our last time. The pizza was average at best. The chicken was breaded for some reason; why not use grill chicken like everyone else does? The flavor was also very average. The crust was pretty good though.   Bottom line: A $23 thin-crust pizza shouldn't be cutting corners on quality."}
{"text":"Terrible. I wish I could give you guys four titties down as rating. Waited 35 minutes for an order that I was told would be ready at 7:55. Husky, letter p shaped hostess has a terrible attitude. No one washed their hands before handling food after touching their cell phones, smoking cigarettes, and touching the register. And the guy making the f#%%## pizza wasn't wearing a hairnet."}
{"text":"Libretto's, Get your act together!   You're food is very good yet your service at this location was terrible.  Great looking place and good food yet I can only give you 2 stars.     Spend the money and time to hire the right people and train them properly.   Bad attitude should be highly discouraged."}
{"text":"I already had a bad experience couple months ago but once again I allowed the front desk to give me recommendations and I chose to give it another ago. This time I ordered 1 side Broccoli , balsamic chicken entree , side Caesar salad and for dessert the Cannoli. To be fair I have never ordered pizza but back home my favorite lasagna is from pizzeria . I downloaded the app for this place which made things simple for me and they take Apple Pay so that deserves 5 . The food however has no flavor at all and reminded me of  the TV dinners from my childhood. The sauce that came with my linguini was like soup and missing flavors . The Caesar salad was ok , loved the croutons . The chicken was like rubber and potatoes overcooked . Since I don't care for anything I was excited about the Cannoli! It looked so good until I took my first bite and all crumbled . The cream inside was old and no taste of sweet inside at all. The strawberry garnish was old . Will say the delivery driver was professional and they called to confirm my order before delivery. Delivery was less than 30minutes however I would have Prefered waiting 1 hour to have food with flavor. To be fair I will give them a 3rd attempt on my next business trip and order pizza  After all I did take time to download app ."}
{"text":"Really 2.5 stars.. it was just ok.  Not terrible nor great The decor looked pretty much the same as when it was Al's Pizza, so no complaint. We tried the Chicken Florentine and it seriously lacked flavor! I very seldomly have to add salt to a pizza. It is like there was no flavor in chicken or spinach. We did like the chewy crust and the service was very attentive. It is a little pricey for quality, so we will probably return if we see a deal/special/coupon."}
{"text":"Great pizza, HORRIBLE SERVICE and mean and cranky staff. They swear at their customers."}
{"text":"I have only eaten here one time - at lunch with a co-worker.  I ordered a calzone, which was really huge.  A little more sauce on the side would have been nice because there was so much dough screaming for it.   It was super cheesy and really a bit decadent for me. Next time, I will go with a slice and a salad.  I also stopped in last night around 9 or 9:30  to have a few beverages with friends on the patio.  The live music, laid-back atmosphere and friendly folks make it a great place to socialize.  I went inside once or twice, and the pizza smelled amazing.  I'll be back soon to have some!"}
{"text":"The website needs to say what time delivery ends. All it says on maps when you pull up this location is that they deliver. Had a rough draining first week and all I want is a good pizza! That too much to ask? I think not. Don't get my hopes up by looking through a menu salivating and not putting you guys done deliver at 11pm when open til much later. Aggravating."}
{"text":"I've been in NC for 15 years and this was some of the worst pizza I have ever had. Everything from the crust to the sauce was not what you'd expect for a pizza. Huge disappointment. Spend the extra money to have quality italian food not overpriced ketchup on bread.  As a follow up and only because someone can't take constructive criticism....I am not affiliated with any of the places I rated. I work for a fortune 500 company in CLT and am a foodie plain & simple. I had a free evening and just decided to rate all the places I've eaten in the last few months including yours. I believe in rating the places I dine at no matter how good or bad. If you've done your research on my profile as you've indicated then you'll notice I gave more than one negative review and more than one review in the same day. I can't help it if the 5 star pizza place is the best in Charlotte.  You should try the pistachio pesto pizza. It'll make you want to close up shop, go to Italy and learn how real pizza is made. Boo-ya !!!"}
{"text":"The closest thing to NY style pizza. I HAVE to come here every time I'm in the area. Very friendly hard working employees and very clean restaurant. You've got to try it out!!"}
{"text":"I'm a big of Libretto's and have enjoyed the other two locations in town for some time. Happy to say that the newest location (here) has easily topped my list for a number of reasons.   First, the menu is easy. Family recipes that aren't overly presented, spiced, salted, or done with too much fluff. I'm not the biggest Italian fan in the world, but when I do go for Italian, I tend to gravitate to the more puristic menu items. Libretto's recipes are made with love and it's pretty easy to tell. Recently tried the traditional spinach pie calzone and the veggie pinwheel. Both are served with a small side of perky marinara and aren't of ungodly, gargantuan proportion. I appreciate the size to price ratio.  The kicker for this location is easily the bar/patio area(s). HUGE patio that wraps around the corner, front patio with some umbrellas over 4-tops, and giant garage doors that open to the bar. We sat on the patio around 12:30pm and it was perfectly shaded, breezy, and comfortable. How can you sit on that patio and not knock back a beer or six? Also, check out the mural at the end of the bar on the far wall. Gives it a really cool Brooklyn vibe.   Props to Libretto's on this new location. Looking forward to more patio time really soon.   Cheers."}
{"text":"This is our regular pizza place for a few reasons, and not because I love it. It is close to where I live in South Charlotte and easy and fast to pick up. It's a good price for a large pie, especially compared to the other wood-fired pizza places in the area. Don't get me wrong, I adore wood-fired pizza, but for a classic \"New York style\" at a fair price, this is the best I've found since moving to Charlotte about six months ago. Having eaten a fair share of real NY pizza, it is incredibly disappointing, but good enough. The garlic knots are terrible. Don't waste your money."}
{"text":"Service was ok, it was pretty empty but they had the music booming. Beer on tap selection was decent but limited. Pizza it self was good. I like that you can have the vodka tomato sauce on your pizza. It added to the flavor. Toppings were generous. I would come back for the pizza."}
{"text":"Came here on a late Friday evening for some dessert and coffee. It took them over 30 mins to bring a coffee, which I think was made from some instant powder. And another 15 mins for a slice of pre made cake. Seriously bad service.  My bill was only $9. I put down $20 and the waiter asked if he should bring back change! Well of course he should, that poor service doesn't deserve a tip. Took another 15 mins for him to bring back the change."}
{"text":"I've had two experiences with Libretto's and both of them have been negative.   The first time I ordered delivery from Libretto's the delivery driver brought up the wrong pizza. Wrong toppings, wrong size and everything.  Long story short Libretto's called us back and told us the next time we ordered there would be a 20% credit on out account.   Flash forward to today. We called to get a pizza delivered again. When we called the attendant took our name, address, and placed us on hold...for 13 minutes. 13 minutes later a new attendant answer the phone and asked for all of our information again. They quoted us that it would take 45 to an hour for our pizza to arrive. We called Libretto's at 7:25 the delivery driver rang our doorbell at 9:26. The pizza wasn't bad albeit cold. I can't say I'll give Libretto's a third chance."}
{"text":"It's pizza after midnight. Don't expect much. My medium cheese was folded over on itself when I picked it up. I pointed it out, they took it in the back, unfolded and gave it back to me. I took it, cause, it's midnight, in hungry. Roll the dice, let others know what your late night was like."}
{"text":"This place has the absolute BEST pizza outside of New York!!!  I've tried several different toppings and all were excellent. If you love pizza like I do, stop here and get a slice or two."}
{"text":"We are from New York and this pizza is amazing. Best ny style I've had outside of New York! And the delivery was really fast"}
{"text":"We ordered take-out tonight for our first experience with Libretto's. It arrived 35 minutes past the scheduled delivery time, food was cold and had to be re-heated, and nothing was particularly good. Mozzarella sticks were bland and the pizza was about 45% plain crust on the edges with all toppings/cheese piled up in middle. Really disappointing.   In the future, we'll stick with our regulars of Hawthorne's and Dean & Deluca."}
{"text":"A solid place for NY style pizza. The only downside is that every time I went they ran out of garlic knots, which I have heard is one the best things they offer."}
{"text":"Do yourself a favor and skip Tony's pizza. Trust me. Come to librettos. This place is legit. I should know; my parents are New York natives. I know pizza. I've grown up on good NY pizza. I love pizza. Dang, I've even dreamed of pizza. Granted, that was while I was pregnant but still. Pizza!!!!   Librettos has good pizza. They know what's up and have perfected their pie making skills. Their pies are a perfect marriage of crispness, cheesiness, chewiness, sweetness and tanginess all rolled into one.   It's one of the most perfect foods ever made! There. I said it.  Pizza is awesome.   There are a lot of places in NC that claim to have NY style pizza, but most of these places are houses of lies and are not even close. We order takeout at least once a week and I've had lunch a couple times in their restaurant.   Their lunch specials are great! What other place in Ballantyne can you get great service, a slice, salad and a drink for $5.95?   My favorite is the Monday special - cheese pie and garlic knots for $10.95. Good deal for a quick dinner when you don't feel like cooking for your family...mostly because you don't want to wash dishes or unload the dishwasher.   So, go here. Order pizza. Experience deliciousness. Repeat.   You're welcome."}
{"text":"Tried this pizza a few weeks ago . My friends loved it so we had it delivered! She boasts they have some special dough that is gluten free and healthy (if there is such a pizza- I'm not sure) ! It was delicious!  Came to the brick & mortar to pick up a couple slices to take home.  After ordering and paying.... I noticed the rating is a B.  Hope I don't die. I'm eating it anyway. I'm giving them the benefit of the doubt and praying before I eat it.  If they change the rating I'll change my stars from three to a four ."}
{"text":"More than 6 people working behind the counter . They forgot  to prepare our order . Another customer walked out as he was tired of waiting.. there were no customers in the dining hall Very bad service. How long does it take to warm up a slice of pizza?"}
{"text":"We get pizza from Librettos every week for the office.  Their pizzas are fantastic and typically the service is on point.  Today we had a mishap where they lost my order.  When it was late, I called and spoke to Lilly who was sincerely apologetic and made it right.  We will be returning because of Lilly's incredible service."}
{"text":"Don't even waste your time. Did an online order. Came by 20 min later and the order hadn't even been started. The guy working the register couldn't even find it. Place is run terribly with managers just standing around instead of making sure things are actually getting done. Thankfully there are more than a dozen other restaurants next to it. Won't be eating here again."}
{"text":"Terrible service.  In the past I have enjoyed their pizza but the service tonight has changed me being a future customer. Delivery took 2hrs and pizza was cold.  Staff was not even apologetic and seemed less than concerned when I called to complain.  Even papa johns/dominoes will guarantee good service or it's free, utterly unacceptable and ridiculous."}
{"text":"Stumbled upon this pizza joint on $1 slice Thursday. Huge slices, taste Good, service is a bit slow. Overall a great place."}
{"text":"The pizza was crisp, thin and delicious.   However, they are currently under reorganization and it's apparent they need it. We waiting 5 minutes at the front for a table because no one was there. One the hostess showed up she asked \"Can I help you?\" and we were then told \"sit where you want.\" Not a problem! A sign could have been helpful.   Server was not knowledgeable about the menu. We ordered cheese sticks as an appetizer, a 10 inch pizza and chicken parm with a side salad.   Cheese sticks where burnt to the point there was no cheese in them and had a bitter taste. Server was happy to take that away and offer a replacement (we declined).   Ordered the chicken parm with penne pasta. It arrived with spaghetti instead. Ok - not a problem. Good flavor, pasta was well cooked, chicken crispy with lots of gooey baked cheese.   The problem came when the pizza arrived almost 20 minutes after the chicken parm. While waiting we saw bags and bags of pizza walk out the door. Server finally came over about 10 minutes after receiving the first entree and to let us know there were a lot of delivery orders and the kitchen was backed up....  Long story short. If you want pizza get it delivered. It will be there faster than dining in."}
{"text":"OK, I've given LiBretto's Uptown 3-4 more tries since my previous review and much has improved.  First, I stopped online ordering, (2) I call and ask for delivery times, and (3) I avoid weekend nights if possible.  I varied the entrees and each order was spot on, AND delivered within the promised time (once under 30 minutes!!).  Of course, it is silly that I comment on what's expected,  but things had gotten so bad I wondered if they would recover.    Maybe they have my number posted on the wall and go outta of their way to please; hopefully, they found some managers and staff who are proud of what they serve.  I'll order again."}
{"text":"the delivery man could not find my house on the 2nd order of the night , lol missed tip lost client , bad business"}
{"text":"I can't really rate them on their food ... but I can rate them on their customer service which was HORRIBLE!!!  Although I work downtown (uptown I guess they call it) only about 2 blocks from the Epicenter, I've never been there before, never heard of them.    The Hostess was very professional, friendly and hospitable...However, she is is not the reason I'm only giving two stars, if not for her I'd try to give zero...  I told her I was interested in a Calzone to go and she directed me to where I could get an order to go ... the woman at the counter was short, rude, disrespectful and unprofessional to say the least, not knowing this place, figuring they had \"standard\" calzones, I asked her what they had and she barked at me like I was some sort of an idiot ... which is why I can't comment on their food, I'm just glad I wasn't in a confrontational mood today or I wouldn't be sitting here writing this, I'd probably be being detained by Charlotte P.D...   Needless to say ... it's probably a good place, but thanks to one rude, unprofessional employee ... I for one will never go to a Libretto's ... ever!!!"}
{"text":"Coming from the north we were spoiled with amazing pizza. We couldn't find any pizza we liked in Charlotte until we went to librettos. It's the real deal"}
{"text":"Walked out after I sat for 4-5 minutes without being acknowledged - wasn't too busy, and both of the bartenders either walked by me, or right near me. Would've liked a \"Hi, I'll be right with you,\" or something. Also, three kids (7 or 8 years old) sitting right at the bar (without an adult, I should add) didn't provide the atmosphere I was seeking. A shame, because I like their food, and wanted to drink a beer and order dinner to go for my family. I just think customers should always be acknowledged immediately. It makes the wait time for service easier."}
{"text":"Exceptionally friendly staff. Very young and hip atmosphere. One of the waitresses actually sat down by to the most indecisive customer I've ever seen at the table next to mine and walked her through multiple dishes. And she did it in the most genuinely friendly attitude.  Amazing!  The food itself was mediocre. I had the pizza and it was far from memorable.  The sausage tasted like sliced up hot dogs."}
{"text":"I live 5 blocks away and waited 2 hours for a delivery.  The pizza really was terrible, seriously; not even decent.  Oh, yeah, the toppings were expensive too.  The one cool thing was that the delivery guy gave us a second pie for being so late. I am done with this place.  Dominos would have been twice as good for half the price and it would have taken a third of the time."}
{"text":"I have been to the Ballantyne location once before and had a decent experience, so I decided to try the Park Road Libretto's, as I live around the corner from this location. It's safe to say that our experience was awful from start to finish.   When we were seated in the bar area, it took our waitress 10 minutes to greet us and bring menus. She was rude from the beginning. We ordered mozzarella sticks and a beer.  5 more minutes pass and she finally comes back. I say I have a question about the menu, about what veggies are included in one of the dishes (I was interested in ordering dinner). She gave me an attitude saying she didn't know and would have to find out. Well, yeah duh that's kind of what I was asking her to do.....no need to be so rude about it. She also tells me they are out of mozzarella sticks and we should pick something else. So we say cheese garlic bread and garlic knots.  Wait another 20 minutes for the food to come out. Some guy brings it to us, except it doesn't have any cheese on it. I let the guy know and he said \"oh you're right! I'll have them throw some cheese on it for you, It should only take like 30 seconds.\" He takes my food back to the kitchen. We eat our 4 garlic knots, and wait for the food to come back.  Wait another 10 minutes, and the waitress finally brings the garlic bread out. \"Oh you changed your mind and wanted to add cheese?\" ...uhhh no, we ordered it that way. She said \"oh I only heard garlic bread\" with an attitude. She asked if we wanted to order anything else (hah - after 45 minutes + her attitude, definitely not!). Then we asked for the check.   I have never eaten at a restaurant and NOT left a tip, but tonight was the exception. I have never had such horrible service, and it's safe to say this was our first and last experience at Libretto's Park Road. They have done nothing at all to earn my repeat business. We will take our business elsewhere next time."}
{"text":"My husband and I were staying at the Aloft for the weekend and came in to grab a pizza and calzone about 1am on a Sunday morning after drinking at Tilt all evening.  It was pretty crowded but we got our food relatively fast and headed back up to our room.  Everything was fine, but nothing was outstanding--absolutely average.  If I was in uptown Charlotte late at night and I was craving pizza, I'd go here again.  Otherwise, I'd try somewhere else."}
{"text":"Called a few times to place an order and whoever was responsible for answering the phone kept hanging up. Guess I'll try somewhere that wants to take my order."}
{"text":"Didn't even get to try the pizza. Called, ordered, paid and confirmed my address. 15 minutes later they called back saying my order was cancelled because I was outside the delivery area? Not even an apology.  I understand there being a delivery area, but shouldn't they have told me that when I placed the order and gave my address?  This was my first and probably last experience with this place.  I did get a response from the owner. Thank you.    He said it is hard to know where people are even if you give them your address.  If you have trouble locating where your customers are, there is a free app called Google maps. It shows exactly where the customer is located. It even gives directions. This might help with these types of issues you are having."}
{"text":"I came to south with a total elitest, pizza pretentious, close minded, jerk-face mind thinking there will be no good pizza in the south.  Libretto's you have proved me wrong!  Libretto's by far has the best pizza charlotte.  Not too thin of a crust, great sauce, and a decent amount of options. You can also order beer at the counter from miller lite to brooklyn brewery.  This place gets packed on the weekend due to it being in Epicenter.  Though who wouldn't expect 1,000 people with drunk munchies to hit this up.   The price is a little high, but you have to expect it being in the location it is.  The only thing I wish for is that they would have delivery. If you want good pizza come here NJ/NY approved"}
{"text":"Really good place. Seems to be owned and run like a true New Yorker. Pizza slices are generous. Although they have a full italian menu, I can only speak for the pizza. This place is good!   You can keep it pretty cheap if you stick to cheese or pepperoni. But with that said, they have many exciting looking pizza varieties, but expect to pay a significant premium over a slice of cheese to try one."}
{"text":"Stopped by the EpiCentre on a Sunday afternoon to catch a game and eat some pizza. Libretto's pizza seemed like the right place to be. The atmosphere was good, the service was friendly and very efficient.   I ordered a pepperoni calzone and it was good and tasty. My husband had a hot sandwich...it looked good too.  It's a smaller joint, but it seems to accommodate to the large groups. It also caters to the casual, sporty crowd. Go for pizza, game-watching, and beer drinking...it just has a good atmosphere for that!"}
{"text":"Another pizza joint that I wanted to love and another meh.  I have upgraded from a Meh to an A-OK out of charity.  Nothing was bad, but nothing was WOW either.  On my continued quest to find a white pizza that I love, I decided to try Libretto's after attending a Yelp Elite event that I didn't eat at because I arrived late, after already eating.  Everyone there had nothing but good things to say about the food, so I put Libretto's on my list.    While running errands today, I ended up on this side of town.  In Ballantyne shopping center, at the corner of Johnston/521 and Ballantyne Commons Pkwy, there is plenty of parking at the end that Libretto's is located at.  Arriving around 4:00 pm, there were a couple of people at the bar, but other than that, the place was empty.  A few folks came in and out retrieving takeout orders.  There is outdoor seating, indoor seating at bar-looking wooden tables and chairs and then a back area with tables cloths and a more formal setting.  There are 4 TV's in the bar area and they were tuned to golf on my visit.  The hostess, who was also my waitress, was pleasant.  I could have done without the singing/yelling from the kitchen area.  It's a mostly open floor plan so noise carries.  Even with practically no one in the restaurant (off hours on Father's Day), there was a hum to the place that made it rather loud.  I ordered a Diet Coke and a 10\" Pizza Bianca (white pizza) which totaled just under $13.  The crust was thin and crisp (too hard for my liking, but that is a personal preference) but didn't have much flavor, it also had a burned taste to me, though it was only black in a couple of places.  This may be exactly how it is meant to be, as some folks may like it, but I didn't care for it.  The ricotta for the white pizza was in blobs on the pizza.  While the ricotta was smooth instead of curds, the pizza was zzzzzzzzzz.  White pizza has to have an extra effort put into it since there is no sauce and I didn't care for this.  I shall continue my hunt for a delicious white pizza in Charlotte - so far, Hawthorne's holds the crown for the best to me."}
{"text":"I use to love this place. It had what I consider the closer version to New York style pizza. I went recently on a Saturday night and was surprised that the establishment had changed. The wait staff wasn't friendly and the pizza wasn't as good as it use to be.   I ordered a cheese slice and the white pizza with Ricotta cheese. My friend ordered two slices of pepperoni with beef. All four slices were dry and flavorless. We were surprised.  I don't visit the EpiCentre often but when I do it's for this place but not anymore.   I hope that improve again before the new pizza spot hits the block."}
{"text":"Al's who?! Precisely. Libretto's has done a great job moving in and building a new reputation for that space.  The pizza does its job by bringing a taste of NY to the Queen City. The slices are thin, greasy, and foldable! The salads are standard. The spaghetti is good, although salty. They aren't as quick as other pizza joints, but maybe I'm not used to waiting 25-30 minutes.  Pro and con: They only deliver in a very small area. Lucky you if you are within their zone. I'm about 1.5-2 miles away and either the website is not updated or truly they have a very, very small delivery area.  When I'm in the mood for yummy, foldable pizza, Libretto's is where I'll turn."}
{"text":"Like the outdoor space.  This was not as good as the Epicenter location & although I love Uptown location not sure we will be frequenting this location."}
{"text":"Nice pizza place uptown! The harvest pizza is my favorite. We did ask for delivery about 12pm and they told us they couldn't deliver until 2pm bc they were busy. So we went and picked it up. Don't say you deliver and then basically say you won't! Cray! Overall pizza is great."}
{"text":"I have spent a lot of money in the uptown location and the Ballantyne location.  We would often have several people go to the one uptown and get pizzas and beer before a game.  When they opened the Ballantyne location, I began patronizing that one as well.  They had a good deal on Mondays for a large cheese pizza and garlic knots that we often ordered.  I called to order it this week with toppings added as usual and they told me the special was just for cheese; if I wanted any additional toppings I would have to pay full price for the pizza.  I explained to them that we ordered this often, and they said the owner changed it to this.  Besides the fact that any other pizza place lets you add toppings to a special for the price of the toppings, I do not want to support a business that is that cheap.  It makes me wonder where else they may be trying to cut corners, and based on previous reviews of poor customer service, they may not be doing too well.  Sorry, Libretto's.  You lost a loyal customer who turned many others onto your pizza.  I'd rather support a franchise than this business now.  My pizza dollars will be spent elsewhere."}
{"text":"All the cool kids like this place.  And I want to like it.  I have tried twice (in two different locations) to like it and meh - not again.  Today's lunch was a huge fail in practically every aspect.    The new spot is lovely, well decorated and should make for a pleasant dining experience.  I was instantly greeted and seated upon entering.  There was one other gentleman there banging away on his laptop and a few minutes later a table of 4 was sat.  That's it.  At 11:30 on a Friday, we were it.    Not a fan of the pizza at their Ballantyne location (personal preference), I thought I would try a sandwich.  I ordered the grilled chicken with mozzarella and peppers sandwich lunch special for $8 with fries.  I waited.  And waited.  And waited... my waitress came by about 20 minutes into my wait to let me know the kitchen was working on a huge delivery order, and while I appreciated the update, the reason as to why it was taking an eternity for a freakin' sandwich is inconsequential.  Shortly thereafter she brought the sandwich, no fries, and told me the fries had been dropped and would be out in a few minutes.  Um... okay.  The wait for my food had allowed me to listen to the DMB, Hootie, (that douchey guy that keeps getting much hotter girls that plays guitar) music and the guys in the kitchen going back and forth about one of their f'in girlfriends and her habits that are annoying to him.  As with the Ballantyne location, the voices from the kitchen and the language is disruptive.  With a fairly open floor plan, high ceilings and solid-surface floors, it reverberates.  I'll get off of my rocking chair yelling at kids to get off my lawn and back to the food... the sandwich should be called a pepper sandwich with cheese and chicken bits.  The grilled chicken, charred as I imagine only the temperature from the flames of hell would produce that shade of black on a chicken, was about 1/2 of a very thin chicken breast (think the Perdue thin cuts from the grocery store, but not an entire breast, just 1/2).  The black edges and end pieces would break off as I bit into the sandwich, but since we were 30 minutes in, I trudged on after dissecting the sandwich to see if I was just getting bad bites, or if the sandwich really was that bad.  Loaded with peppers, the peppers were cooked well and well flavored.  The mozzarella, while not much of it, was fine.  The bread was fine. All I could taste were carcinogens and peppers.  I was about 1/2 way done with my sandwich when the fries came.  They were smoking hot and good.  The kind that are soft on the inside and super crunchy on the outside.  I was then brought a small cup of ketchup, that was enough for about 1/2 of the fries.  Service was fine, kitchen staff was loud, food was yuck (1/5 for sandwich, 3.5/5 fries -the highlight of dining should not be french fries), the wait for the food was not justified by the quality of it, the portion of the meal was very reasonable for the price.    At 0-fer-2, Libretto's gets my Pawpaw's smackdown - \"I ain't goin' back\"."}
{"text":"This place is great. You cannot find better pizza in the area. Wednesdays wine bottles are half price."}
{"text":"A solid Italian bar and restaurant with ample seating inside and outside.    Menu is excellent and covers all the Italian food groups.  Pizza, pastas, salads, calzones, etc.  And the portions are huge.  Wife had pizza there with a friend so we decided to do a lunch experiment.  Lots of take-out and not just pizza, plus on a Sunday, there were a number of people eating in and at the bar.  Went for somewhat of a sampler so split a salad, and glad we did because the portion was more than enough for two people.  Was good.  Calzone had the best dough or as my wife says, crust, ever.  And cooked perfectly.  Just ask to go light on the ricotta cheese as it is pretty dominant.  Ours was really cheezy and could have use more spinach.  Pizza slice was very good.  They can do thin crust and even have three thick varieties.  And they have prepared about a dozen pies that you can buy by the slice.  Very convenient for the business lunch crowd.  Service excellent.  And everything is made to order, so be prepared to wait, but the wait will be worth it."}
{"text":"Delicious pizza and some true New York style, we ordered takeaway and it was ready in about 15-20 minutes for pick up! Yum will be back..."}
{"text":"Calamari is awful.  Hot wings are salty.  I know the pizza is great and so are the stuffed mushrooms but tonights choice of wings was a let down.  *I miss Hefs wings.   On the bright side the bartender is kinda cute.  OK OK EDIT EDIT EDIT.     This Calamari is very good.  I wrote that a long time ago and something has changed.  My taste buds, the kitchen management, the pollen in the air, IDK.    Heres the skinny.   I now order the calamari every time.  The marinara is divine, a little lemon juice and its a party!     Thats about it.  I will update about the wings when I try them again.    Cheers!  Life is awesome!"}
{"text":"Went here about two weeks ago before a Charlotte Checkers game with some friends (yeah I have a few :) ).  I love their pizza but already had leftover pie for lunch, so I ordered a chicken cutlet sandwich, which was like a mini sub cut in half.  The quality was decent, but the bread was like real Italian bread which isn't my thing.  It was a little too crunchy for a sub type sandwich.  It was also a little small for $8, and fries were $1.50 extra.  So fries, sandwich drink, tax, and tip is approaching $20.  The pizza is awesome here but the other food is average and overpriced.  If you go here, get the za, okay?"}
{"text":"Delicious slices of pizza. The slices were huge too.  I think they offer a 15% military discount."}
{"text":"Friday night ordered a personal pizza for delivery and was told it would be 45 minutes. Took an hour and a half to deliver. Of course by the time it got to me it was cold. My pizza was under $10; I gave the driver a $20 and he started walking off. I can't believe I had to ask for my change.  The pizza was fine but service is subpar. Inadequate management."}
{"text":"The food here is sub par and the service is about the same.  I prefer to go down the street to a more authentic Italian place instead of coming here even if it is closer to my house."}
{"text":"If you want a slice of pizza after a long night of hitting the bars in the Uptown area, then this is the spot.. big, greasy, and hits the spot!"}
{"text":"Came in late sat night and was welcomed so pleasantly!  They sent garlic knots to the table and never rushed us out. The trio meal was very good as was  my husbands spag bolonaise. We certainly will return"}
{"text":"In town for a last minute wedding change of venue and found myself staying at Aloft with my wife and small kids. Other than five guys and Pizza Hut there's no real obvious choice for kids. This place was close and had some enticing options. We ordered a Sicilian and a margarita pizza and both were delicious. The delivery was prompt and the price was great. Very happy."}
{"text":"I've been giving this place the benefit of the doubt since it's so close to my condo, even though the quality of food & service has steadily declined over the past year. Tonight (a quiet Tuesday in the city) was the worst. After over an hour the pizza arrived cold, greasy, with a rubbery crust, and hardly any cheese. The trash can got dinner instead of me!"}
{"text":"Pizza and calzone served piping hot and delicious. I would defiantly go back. Slice was 2 for $6 and so big I couldn't eat but one"}
{"text":"I was kind of excited about Libretto's but it ended up falling into the category of just meh pizza. First, our waitress, granted it was slow when we came in but she acted like she didn't give a f***, forgot waters and other drinks, took a long time to get our checks, also we we asked if she could split them up evenly we all got different totals, and she just had an attitude of meh (kind of like the pizza). Got the New York Pizza, none of the ingredients stood out to me, seemed like the pizza you'd get at a joint at 2am."}
{"text":"I'm a huge sucker for this place's cheese ravioli & garlic knots. Simple, consistent. I am not, however, a fan of the pizza. Too bland & too little toppings for this Chicago girl. I'm definitely going to keep coming for the pasta & knots though!"}
{"text":"We had a pizza with peppers, sausage, and pepperoni. It was sooooo good! It was delivered hot and fresh to our door with plenty of toppings and delicious sauce served with garlic knots."}
{"text":"Tony, pls forgive me....But there's a new sheriff in town.  Our go to pizza spot used to be Tony's Pizza in Ballantyne...and then I had Libretto's at the Epicenter..I was in heaven.  So much so that I had to order a pie from the John J Delaney location just to try it out and the consistency was the same at both locations and I was sold...The New York style pizza is by far, the BEST I've had in Charlotte...If you don't know...now you know."}
{"text":"So the service is fine but the food is super bland. I got spaghetti with meatballs and it had no flavor. Don't be afraid to add garlic, salt, flavor! Oye vey! My husband got the lasagna, same thing... taste like nothing. My kid got a pizza which was huge but greasy and average. Overall it's a little expensive for what you get. Large portions but no taste. Ugh."}
{"text":"Like their Uptown spot the pizza slices here are just awesome!  I def reccommend just ordering slices and having them heat them up there to eat because it ends up tasting better than when you do it yourself at home.   They also have some really great salads that are perfect for sharing, and even better they split them up for you and the portion sizes are big.  The service can be hit or miss depending on when you come in, but for really great NY style pizza I will overlook that in order to indulge myself!"}
{"text":"I used to go to the Uptown location for a slice for lunch or after the bar.  And it was always really good.  Then on Friday we went to the Ballantyne location and ordered a pie and a salad.  Salad was good, but the pizza had that sogginess until you hit the crust area, and that is not a quality I enjoy in my NY style pizza.  So I guess the lesson learned is their reheated slices are where it's at!!"}
{"text":"First time ordering here and will never order again. Ordered basic large pizza with toppings and they did not make it right.  I live literally 1 minute from the pizza shop and it was delivered cold. Delivery person was nice and went back to get another pizza (this time made right) but not worth the hassle or money (was very expensive, over $30 for a large pizza and 2 drinks...and the pizza didn't even taste that great)  Defonitely will not be a return customer."}
{"text":"Oh my gosh I Went to the one by epicenter and being from NJ I've never had pizza here that compares but this one was Amazing. The employees are terrible though"}
{"text":"If there is something that Libretto's does extremely well, it has to be their pizza. The crust is thin and crispy (excluding their deep dish pizza which I have not tried yet.) and it does not get soggy.   There is a nice variety of different pizzas to choose from (my favorite is the BBQ Chicken) or you can create your own. Slices are offered during lunch and are priced very reasonably.   If you are looking for a slightly more upscale experience, Libretto's can help with a very nice dinning room that is separated from the more noisy bar area.   So why only three stars?   Well, service tends to be somewhat on the slow and spotty side (refills are key to keeping me happy).   And then there is the other half of the offerings at Libretto's - the pasta dishes.   The Chicken Marsala we ordered was a chicken breast with a couple of mushrooms and an extremely watery and runny sauce added to our choice of noodles.  The side salad was mainly lettuce with a small slice of tomato hiding at the bottom and dome flakes of cheese.   I expect more from a restaurant that advertises Italian \"cuisine\".   Stick to the pizza and you shouldn't be disappointed."}
{"text":"The delivery service here is OUTRAGEOUSLY TERRIBLE.  I've now been waiting for my pizza for over an hour and a half.  I don't even have the option of picking it up because it left the store...wait for it...45 minutes ago.  This is unacceptable."}
{"text":"So i normally come to Libretto's for a decent meal and tonight I was truly disappointed. I brought my friend here cause I love some of their apps and half price wine on Wednesdays. Well the mozzarella sticks were totally over done. They were pretty much burnt. The antipasta was blah but the stuffed mushrooms were kinda cold and they did not taste good. We ended up moving because the table next to us got too loud. Our waiter/bartender was super nice. We had the tiramisu for dessert and we're excited to eat something sweet but honestly it totally sucked. I gave it two stars because I enjoyed the company of my best friend and the bartender was great. Also, every time I go to Libretto's there is a new staff. I neverrrr see the same waitress/bartender. Strange."}
{"text":"Since I have moved to Charlotte i have always wanted to say Librettos is the closest thing to NY pizza or northeast pizza but i have been continuously let down. The uptown location is the only one that has some consistency. Stay far away from Woodlawn if you want anything remotely close to what Libretto's should be. This is now the second time in 2 weeks were my order has been messed up. First time around I ordered a medium pizza and a caprese salad. Once I got home I found my caprese salad was only tomato and mozzarella cheese. When I called back to say they were missing the basil, balsamic, and olive oil, the manager argued with me saying that the caprese salad didn't have those ingredients. I have worked in NE pizza shops for 4 years...and ran restaurants for another 6 years, I know what a caprese salad is. Tonight I ordered another medium pizza and it came out looking like a small for $18. I asked the manager if this was right... he said yeah that's a 14\" pie. I hate being this critical on pizza but it barely filled the box.   Consistently is key to running a restaurant (or pizza shop). There is no consistency here."}
{"text":"Great pizza! My coworkers and I walk over at least every other week to grab some slices! It is truly the best New York style pizza uptown! I keep telling them I am lucky I live 30 miles away, if not I would be going for dinner as well as lunch! The pizza is always good, and the garlic knots are excellent as well!"}
{"text":"2 hours for a delivery...you're kidding me!!  It doesn't matter how good the pizza is, this is ridiculous."}
{"text":"Do not come here when it's busy! The pizza is great the guys behind the counter and behind the scenes work their butts off and it shows in the food. It's just a really small place and gets crowded really really crowded. We were there for a big panthers game so maybe it's not always like that. Great prices and really great oven fired pizza. Worth the hassle."}
{"text":"Nothing special.  Due to my awful experience with The Mystery Detective (if you wanna laugh check out my review and the owner's response - he was unhinged to put it mildly) my friend and I were left with living social bucks.  That's the only reason I found myself at Libretto's on Friday night.  We were using a Living Social deal.  Housekeeping was a mess - it wasn't even that late at night.  Tables hadn't been bussed.  Servers were nice enough, but it was just meh and very slow.  I ordered the bacon ranch pizza. It was drowning in ranch.  DROWNING.  How could the cook even serve that piece of slop. It was inedible.  The ranch was so plentiful that it was pooling and dripping down my arm.  Yuck.  Girlfriend had the buffalo chicken pizza.  Previously she's reported this as being a good option, but this time, it was also dripping in sauce.  However it was at least edible.  I will give them credit, when I brought up the issue I did receive a replacement plain cheese pizza.  That's what I'm basing this review on.  It was nothing special.  I give props to our waiter Marcus.  Yes he was slow, but he got me the replacement pizza w/o issue and he didn't charge us for our beverages.  That was decent of him.  Unfortunately we have another living social deal to use so we will be back.  At least this time I won't order anything with ranch."}
{"text":"First of all the food is pretty good.  But when I ask for grilled shrimp on my Fettuccine Alfredo, are your prep cooks really too lazy to take the tails off the shrimp?  That's pretty lame having to pull each shrimp out and get rid of the tail.  Come on, you guys can do better than that!"}
{"text":"If you are from NY, you understand how hard it is to find a *real* slice of pizza.  I've gotta say, Libretto's is the closest I've found to real deal.  I'll get the l\"ate night, been drinking\" experience out of the way first.  It is literally a slice of heaven at 2 AM.  However, if you must have Libretto's I'd advise leaving the bar a bit earlier than closing so you are not standing on a line out the door.  Also, be warned that on weekends there are usually 1-2 police officers controlling the crowd (although I've never seen anything get out of hand).  Maybe they get some free food?  I don't award 5 stars because the 2 times I've called for a regular dinner delivery, I've been disappointed.  I want to clarify this by saying that I've only ordered a white pizza - not the usual pie. Both times it has been dry and overcooked.  I wouldn't be so picky accept for the fact that they are kinda pricey for a full pizza.  So of course, my expectations rise as the cost rises!    I would definitely recommend Libretto's.  However, they need to prove that they can deliver a good dish before they get my top notch rating!"}
{"text":"I've only been here once but I'd go back in a heartbeat. I went here for my weekly cheat meal. It was an easy breezy Sunday afternoon so it wasn't crowded and the atmosphere was nice and chill. I got the pizza by the slice and the slices were huge and delicious. I love for my cheat meals to count & this place made it worth my while! My server was super cool. He knew it was my splurge so he offered me a cannoli when I finished but I was too full! He said they were the best in town. I've never had a cannoli before but he was so convincing that I'll be sure to pick Libretto's for my first one. :)"}
{"text":"I am honestly surprised at the low rating for this restaurant. We frequent here once or twice a month to meet family and it is our pizza place of choice on this side of town. The food here is always hot and fresh and the servers are always very friendly. I love that there's slices at all times of day in case everyone can't decide on a pizza or you want to try a few."}
{"text":"Worst pizza in the country.  Seriously garbage but people are still here waiting for their inevitable disappointment.  Ordered a whole soggy pie!  Only in Charlotte can a place like this remain open..  Absolutely terrible product with nieve owners."}
{"text":"As one of NYC finest transplants into the Charlotte Metropolitan area, I hold a high regard for the term \"New York style pizza\"  as I've tasted many in my days there. The pizza here is as close to a New York Style pizza your going to get without boarding some mode of transportation and heading up there.  Next up on my list to try with them is their canzone, and if it's anything like this pizza,  I'm changing my rating to 5 stars."}
{"text":"Love running in this place for a pizza by the slice or by the box. Can't go wrong! Staff is great, delish & comphy atmosphere. They have more food than just pizza and it looks yummy, I just haven't ordered it."}
{"text":"I, like other reviewers, like good pizza.  I would say I'm relatively easy to please though.  Libretto's was good.  Salty and cheesy with a crispy crust.  Definitely did the trick for delivery pizza.  But it was a little chewy and could use more sauce.  Worth getting if you're looking for some decent pizza."}
{"text":"We had pizza from here a few times at work. So, I decided to try them personally. It is really convenient  because they deliver. However, my last 2 meals have been disappointing  simply because it took longer than the 60 minute window I was given and my food was cold."}
{"text":"We've been ordering from Libretto's since arriving in Charlotte 6 1/2 years ago. Back then we were thrilled to find real New York style pizza here (guess that's because they are from NYC where I lived most of my life). We've moved around Charlotte quite a bit over those years and owner Mike Libretto had the \"courtesy\" to open another Libretto's location within delivery distance of us ;-) Aside from their pizza, we enjoy their Sicilian Chopped Salad w/balsamic vinaigrette, their Chicken Marsala and Chicken Francaise, Penne Palermo (Italian sausage, roasted red peppers, fresh mozzarella) and Penne al Verde (w/sauteed broccoli in garlic and oil)."}
{"text":"This review is based solely off my late night munchies satisfaction**  I've never had a bad experience at Libretto's but maybe that's because when I'm here it's usually after a long night of drinking and club/bar hopping. The service is quick and the pizza is always good and hot. Perfectly located in the epicenter and they stay open late so no worries about leaving the club early to get here, they'll still be open once you arrive."}
{"text":"Came here on a Saturday afternoon 5/8 and food is great. Ordered a pizza, appetizers and some drinks.  I will say that while we were sitting close to the bar, and ordered a \"specials\" drink from the sign behind it.  Midway through our dining experience, the bartender took down the \"specials\" and wiped it clean.  When the check came, she said that \"the sign was from yesterday\", and didn't bother to grant HER mistake since it was hours past opening, although she was probably too busy chatting it up with her friends that were seated at the bar to care.  Spoke to the manager after we left and he granted us a discount on our next visit.  So I would agree with everyone here, service is really bad.  That bartender should not work there - her handbag is up behind the bar, and she was putting on makeup during shift... isn't that unsanitary?  So besides her, everything else is great here."}
{"text":"Yummie. It's been awhile since I have had cheese pizza and this pizza definitely reminded why I liked it so much in my childhood. The only complaint here is the wait time is a little ridiculous. Like a 90 minute wait for a pizza???"}
{"text":"The buffalo chicken pizza here has become a tradition in our Ballantyne Corporate Park office- it is incredible! The people are nice, the pizzas are fast, and the pies are tasty and generously sized. I'm a fan and I'm hoping to soon be unshackled from my desk and actually sit down in the restaurant and try some beers! Until then, the to-go service continures to rock Pizza Friday."}
{"text":"Decided I wanted a canzone for lunch and wasn't sure whether I wanted to go to Mellow Mushroom or not. It wasn't busy and I was seated as soon as I walked in. The guy who seated me also took my drink order, then placed my food order as soon as he came back. After that, I was subsequently ignored. The waitress only checked on me once and that was from the middle of the room. She didn't even refill my drink until I asked for my check. The calzone itself was ok. It seemed like they simply slapped ricotta and mozzarella in without a care, instead of mixing it together. But, maybe that's just how they make their calzones. There was also no seasoning used, it relied only on the various flavors of the ingredients."}
{"text":"Tried to get a slice of fresh pepperoni and they refused to serve it to me claiming they had to get rid of their old inventory pepperoni that had been sitting there for hours.  Come on... That is a policy that should be changed immediately.  As for the quality of pizza... I'llwait until I can get a fresh slice to judge."}
{"text":"Came in to get food to go and a drink while I waited. I wasn't sure if I was coming in too late to get food but the bartender, Ashley, assured me they would be glad to take my order.   We got Chicken Parm with spaghetti, bruscette, meatball, sausage and peppers hero, and garlic cheese bread. Everything was prepared perfectly and absolutely delicious.   The service was inviting and genuine throughout my experience and overall I know I will be back.   By the way, I came here by chance due to a different biz not being able to perform. I wouldn't have had it any other way."}
{"text":"A slice of NYC Style Italian in South Charlotte!  This location is right of of Johnston Road and 485. It offers indoor and outdoor seating. The outdoor is a square courtyard. The indoor is dark woods, white walls and purple ceilings.The walls are decorated with 1940-50 B&W pictures of Italian families living large. The music was a bit loud and too rocking for a lunch crowd. C'mon can't you play some Sinatra?   The staff here was quick, courteous and friendly. I made it before the lunch rush and was in a hurry to make it back to work for an afternoon conference call.   The food here is pretty standard: pizzas, pasta and salads. The lunch specials were reasonably priced and included a side salad and soft drink. I choose the lunch special of Penne Vodka, Garden Salad & Coke.  The salad was very basic consisting of baby field greens, tomato and light dressing. I was kinda puzzled that no bread was served before or during the meal.  Italians are known for their bread. I was a bit disappointed in this omission. Penne Vodka was great. The pasta was cooked al dente and the vodka sauce was savory.   If you are in the area let Libretto's bring NYC Italian to you."}
{"text":"The pizza here is decent and delivers, but the service and delivery make this place absolutely terrible!  I have eaten in during lunch and the service was awful like no one wanted to be there, which we all have our days but this is multiple times. It's not like at 1:30am and we are drunk people trying to order slices, so why are you annoyed at me asking for a pepperoni slice?   Now I used to order pizza from here when I first moved to Charlotte. First delivery to my place was quick and pizza was hot everything was good to go. My next 3 deliveries were things out of a nightmare!   (keep in mind I like less than a mile from Librettos)   One was cold (ok, I have an oven not a huge deal). Another delivery was cold, the marinara sauce for the garlic knots spilled all over the pizza which sucks, but I could live with had it not taken almost 2 hours to get to my place when they quoted 45 mins. Called in to check on it and they said \"it's was out for delivery\". An hour later it shows up at my door, guess that explains the cold pizza. The last time I ordered a large pizza it took again close to 2 hours AGAIN when I was quoted 45 mins, the pizza was cold AGAIN!, and it for sure was not a large even tho they charged me for a large. How do you know it wasn't a large you may ask. Well I measured it! Yeah I am that anal retentive I took out my measuring tape and measured it because it looked like a medium sized pizza. Come to find out, it was not a 18\" pizza more like 15\". Which would be find if I ordered a 16\" and paid for a 16\" but I ordered the 18\" and got the 16\". Which leads me to the next issue I had with Librettos. I called in and spoke with them about the small pizza, it being  cold, and taking 2 hours to get delivered. They told me \"Sometimes it takes the drivers time to park at epicenter and get the pizza, and they have had a lot of orders to deliver so we are sorry about that. We can make you another one and bring it to you.\" I said \"Sure that should be fine\". An hour and a half later no pizza! When it got there an hour and 45 minutes after we spoke the 2nd correct size pizza was COLD!   From now on I refuse to eat anything from here. I will go to Benny Pennellos from now on."}
{"text":"Planned and executed a gathering of friends here because their reviews on another site were so good. This was not a good experience. We ordered a pizza and a calzone to start. The calzone had very little filling. We ordered a meat lovers pizza with mushrooms. They made us the wrong pizza. We also ordered barbecue wings which came out cold twice! At which point we asked for a refund. When we finally got the correct pizza, it was actually very good. However overall it was a poor quality experience. Will not likely return."}
{"text":"I ordered 2 hours ago.... Talked to people at the restaurant 3 times and everyone said my order was on its way. 45 minutes after my first phone call, my order arrived. It's cold. The manager was personable but none the less offered no solution but to wait for our food and if it's cold he'd get us new food. Not worth it after a 2 hour wait. #disappointed"}
{"text":"The pizza was very good, as well as the lasagna. However, the mozzarella sticks are some of the best that my wife and I have had. The prices were very reasonable and the staff was very friendly. It is a nice place to visit while at the Epicenter."}
{"text":"FInding great pizza is impossible outside my hometown of Chicago (Deep Dish) and pizza from NY/NJ. However, this place gets it fairly close.   I love the fact you can just get a slice anyway you want it. My personal favorite is the Chicken Parm pizza slice.  It's good thin crust.   The garlic bread is okay, needs more garlic.   Service is good, not great, but it's a pizza joint.  I know it's in the middle of Ballantyne and the residents near there are used to a more posh type experience, but hey like I said it's a pizza joint. If you want great service go to Ruth's Chris.   Great location, good selection of beers.   If going to have pizza, this place is on the short list."}
{"text":"This is one of our favorite pizza delivery places. We live Uptown Charlotte and there seem to be limited delivery options, but we hit the jackpot with Libretto's. I love the Harvest pizza (spinach, broccoli, mushrooms, roasted peppers, olives, tomato) and the  Sicilian Chopped Salad (romaine, roasted peppers, chick peas, tomato, kalamata olives, feta, balsamic vinaigrette). We got a medium pizza and salad last night- great for two with a little extra for later. I love pizza the next day, I won't lie. Delivery was quick (they anticipated 45 minutes on a Saturday night around 8- it came in about 30).   Next time I want to try the wings!"}
{"text":"Add about 30 minutes to whatever deliver time they quote you, because they are slow a.f."}
{"text":"Do not buy this pizza!  It's rubbish. Ordered a large margherita pizza. I was told its thin crust. It's not. This has NO tomatoes but it had about five places where tomato sauce has been poured in a puddle. Basil?  Approximately 1 tablespoon on the entire pizza. Price? $18.95. As far as I'm concerned it's the worst pizza I've had in 20 years including freezer pizza.  Be warned."}
{"text":"Good pizza, cool music, friendly service in a cozy atmosphere with reasonable prices and with awesome patrons. The menu was full of variety I would recommend for family and friends or that special someone for a fun night out!!!"}
{"text":"Decent delivery service. Taste was good but not outstanding. Had calamari, which were send fairly cold and dry, but still okay... I mean it's delivered and expected not to be hot/fresh as on-side. Also the grilled chicken was good; mushrooms appetizer were great. Salad was a bit boring. Liked that they called when they didn't have enough calamari left for a full size&added it up with jalapeños. Was wondering that they told me they will exchange it completely with something else and reduce the price difference but at the end I got them with jalapeños."}
{"text":"Yum! Yum! Yum! I love this place! I've been while it was slammed, while it was slower, at all different times of the day and I've never been let down. They recently added new T.V.s to the dining room and I've always been able to ask my server to adjust the station to whichever game I'm hoping to catch that night. As for the food, the pizza is delicious and has just the right amount of crust and sauce. The salads are also done well, and a nice add-on to any entree. It's nice to find a place that you can meet a friend for the night or just stop in to grab a slice and a beer for a great price! I'll always come back for more :)"}
{"text":"All I can say is OMG this is awesome pizza!!! My friend turned me onto it when she had a couple (cheese and white pizzas) delivered while we had early happy hour at her house! Both were amazing and huge (and I'm not a plain ole cheese kinda girl)! And they deliver . . . extra bonus!!  I ordered a large margherita with half portobello and half pepperoni for delivery last weekend (too lazy to cook). Again it's a huge pizza with perfect crust! Other than the toppings shifting during delivery (2 slices were nothing but tomato sauce and a little basil), it was wonderful! My husband enjoyed it and he's somewhat picky!  I lucked out and got a Groupon for dine in. With delivery nowadays, it's not often we go out for pizza. But we'll look forward to a casual date night soon with our Groupon!  I highly recommend Librettos for a delicious filling pizza!!!!"}
{"text":"The service was a little slow, but the pasta is amazing! There are select drink specials on week nights. Pretty decent bang for your buck."}
{"text":"Just moved back South after 25 years in NYC area; first pizzeria we tried was this one based on their \"supposed\" NYC heritage.  We ordered a thin crust sausage pie and when waiter delivered it we said...\"oops - you brought us someone else's - we ordered sausage\".  Waiter says THAT IS SAUSAGE.  When I asked him to show us he pointed to some small crumbs that I mistook for bread crumbs, and walked away.  We laughed - ate a \"floppy\" slice - and left with the rest in a box.  We stopped at Harris Teeter, bought some precooked sausage, took it home, and tried to revive it.  Not worth the effort...we should have just gotten Harris Teeter's instead.  Somewhere along I-95 they also lost the instructions for making thin crispy crust.  Pitiful!"}
{"text":"We went to the location on Woodlawn. I ordered a Margarita which might be the worst drink I've ever had. Old, bottled mix, almost no alcohol,  and almost no ice. Ridiculous!!!      Our server ; Sean;  actually did a good job but our food was VERY slow coming. Our bill was wrong, and after 3 attempts by the manager to fix it we just gave up. Food was pretty good, but they need a competent bartender and a better manager."}
{"text":"I have had some good experiences with this restaurant ordering delivery in The Ballantyne area in the past. The shrimp scampi is delicious as well as there linguine and clams. However, tonight they really failed on something as simple as a calzone. Seriously how hard can calzone be? I did create my own which was vegetables and cheese and there was so little cheese in there I actually thought that they had forgotten it. So I opened it up at in my own cheese and some seasonings and made it edible. Come on guys you can do better than that."}
{"text":"Visiting a friend here in Charlotte, ordered the cheese and the buffalo chicken. Can't say I'm an NY style pizza expert but this pizza left a lot to be desired. The cheese actually wasn't bad - the buffalo chicken looked like it was made with frozen chicken bits and plain hot sauce - and it tasted like it. It wasn't bad by any means but I wouldn't recommend - not for me."}
{"text":"This Libretto's location has gone downhill fast! I've ordered large deliveries from them several times in the last 6 months and after each time something was wrong or forgotten. I have crossed them off the list for good.   1.) Called in and ordered 10 pizzas, only 5 were delivered. The person taking my order did not input it correctly. Had to have the rest of our order made and re-delivered 45 minutes later... only half of the people could eat, the other half had to wait..  2.) Had 10+ pizza's delivered, all but a couple were smashed! Looked like the driver had them in his backseat and they slid off onto the floor. Most were un-edible but we picked through it since we had a short time frame for lunch. I called to speak with the General Manager but he was too busy. The guy i spoke to did give us 50% off.. I asked the GM to call me back later when he's free.. never heard from him.  3.) I decided to give them one more chance.. Pizza's were delivered OK but we didn't receive our catering salad or the dressing. I told the driver and he said he forgot it and went back to the store to get it. Came back 30 minutes later.. everyone had already finished eating so it was a waste.   It's a shame. Their pizza is pretty good.. most of the time but the management is terrible and doesn't seem to care. My Company orders pizza a couple times a month and they just lost all of our business!"}
{"text":"totally effing rude AND their pizza sucked. zero stars wasn't an option or else that's what they'd get."}
{"text":"Really deserves a one star. Calamari was fried hard and tough. Pizza was mediocre at best. Went with several people who all ordered different items. No one really cared for the food. The service was so so slow so many better options. I won't be back. We were at the Ballantine location"}
{"text":"Libretto's is our new pizza place for sure. Really good pizza. The sausage is the good Italian sausage that is in flat slices like pepperoni, not that round stuff you get from papa johns or dominos. Service is good. Place is cool. Bar is good. Lots of TVs in the bar area. Outdoor seating. Oh, and get the bruschetta! That olive tapenade that comes with it is awesome! If you like olives, that stuff is like crack. Chopped kalamatas, a little tomato, basil, oil (I'm making assumptions here). Whatever is in it, it's good. The place ain't cheap, but it's not gonna break the bank either, worth it."}
{"text":"Stopped in for dinner on a Sunday night. This place was slammed! Our waitress was awesome, but you could tell she was running the entire show, cashier, waitress, busboy, cleaning the floors, everything. She was quick and friendly. We ordered 1/2 New Yorker and 1/2 cheese. After 20 minutes and our pizza didn't make it to our table, she apologized and brought us complimentary garlic rolls to hold us over. Another 10-15 minutes roll by and she comes back to apologize, kitchen is backed up with orders and the chef hasn't gotten to our pie yet. She suggest by slice because it'll be cheaper. Ok, agreed. We got 5 slices total and it cost more than getting a whole pie + the additional waiting time. But she was so sweet you couldn't even be upset. Pizza slices are huge, one per person is plenty. Well cooked and generous amount of cheese and topping. Defiantly delicious!"}
{"text":"Today, a colleague took me here for lunch.  I was surprised they had my favorite Italian dish--Chicken Francese.    Was it the best Chicken Francese I've ever had?  Nope.  Would I go there again?  Heck yeah!  Positives:  The server was fantastic, food came out fast, the chicken was soft, the flavor was lemony but not overpoweringly so.  Best thing was the price.  Without tip, the bill was $23.70 for two drinks, two salads, and two entrees.    Negatives:  The bread does not come out first; it's on the entree plate.  There was very little sauce on the pasta.  Bad for me because I prefer butter or to dip my bread in olive oil or the sauce.  Seems nitpicky but these are the only negatives I could think of."}
{"text":"I ordered food using postmates and was really hoping I'd enjoy the salad and authentic Italian mozzarella sticks. My boyfriend had the meatball sandwich and said it was just okay. Unfortunately, neither of us cared for the mozzarella sticks. They were cooked to long so the cheese became hard and chewy. The salad tasted okay but it was the price that I can't agree with. It was $9 for the spinach salad and the entire entree barely filled up half of the container. The bacon pieces were all clumped to one side and seriously stuck together.  I think the concept is there: convenient locations, good menu, fresh food, but there needs to be better quality control."}
{"text":"Have enjoyed Libretto's in the office during long meetings,when we'll order in. And have enjoyed the pizza with family.   The pizza reminds me of New York/New Jersey style plus the garlic knots are awesome.   This pizza touches the soul!"}
{"text":"I ordered my food and told them I was eating there. The guy who took my order told me that he will bring my food out to me then left. Then I sat at the table and waited for my food. It took 30 mins before I had to go to the counter and ask for my food. And I was the only person in the restaurant!!!! When I asked for my food I was looked at like I was crazy and was told that they thought I was watching the game when the game went off by the time I finished placing my order. Then when I got my food it was ice cold and I never got a drink. There was like 10 people behind the counter and only 1 person was working. One of the employees got him some food and ate all of it before I even got mine. The food would've been good had it been hot but the service is HORRIBLE!!!!! I WILL NEVER GO TO THIS ESTABLISHMENT AGAIN!!"}
{"text":"I was a bit skeptical about going to another pizzeria place.. but, good job Libretto's!  Place - Blown away with the layout of the restaurant.  Maybe that was a strong word, but I was suprised.  It was clean, new, and not run-down or messy at all.  It was refreshing to come into a nice restaurant to eat.   Service - Carrie was helpful and took care of our crew of 10. She was attentive and took care of our order despite the questions we had asked about the size of the pizzas and what draft beers are carried.  Food - We had: - Chicken Florentine:  I personally liked the pizza, it has your typical chicken and veggies, which was good. Some of the people were 'meh' about it.  - Anchovies and Mushroom: I did not eat this, but everyone else loved it. - Tuscany: Was so-so  The food came out quick, did not have to wait too long. So that was a plus. Liked they had the $3 draft beer special.  Price - I did think the price of the pizza was a bit pricey, especially for a large and a medium.  Large will get you 8 large slices, Medium have 6, and a small will get you 4 slices.  Overall, I would not mind coming back here agian for some pizza and good company.  If it was just myself or with my husband, it would be too much for us to finish."}
{"text":"Big mistake to dine in Sunday evening.  You can tell no one was on charge. . Since we step in servesr staff walk around you and ignore customers at the door. Finally a hostess appear. On a bad mud.  Service over all bad. To be honest are better NY pizza places on South charlotte than this. At the time of you order make sure those specials on the board still available.  Reason server said...because football season....so ERA SE the damm board.  And check you bill before pay...just a tip. I don't see thus place longer on that location.  Good luck guys."}
{"text":"It's ok. Almost NY style. I'm sure the pizza tastes good if it's fresh. I had a slice that was re-heated so was just alright."}
{"text":"Such an amazing spot that I found out about through an amazing bingo event on Facebook. Upon entering there are tons of tables and open seating. Towards the left and back area of the restaurant is a separate bar, where the 45 second music bingo was being held. It was so much fun as the staff and DJ were very laid back, positive, and encouraging. On Wednesdays the restaurant has half off glasses of wine and bottles of wine. I ordered the riesling and lambrusco, which were both amazing and not super sweet.   The bingo was super fun and something different to do on a Wednesday night. It went from 7:30pm to 9:30pm, so not super late so if you have work the next morning and want to have a couple of drinks you can make it there! You can definitely have a few as my tab for two glasses if wine was $7.50!! The food smelled delicious too, but I was stuffed from dinner before.  The service overall was great. Our waitress was very attentive and made me feel wanted there. I think I will definitely come back for the drinks and fun whenever I am in Charlotte."}
{"text":"Good grief don't order delivery! Took an hour and a half for a messed up order and cold food. They could care less when we called to complain. Absolutely ridiculous!"}
{"text":"When they first opened, loved the pizza (and was awesome they delivered!)  After a while, quality began to suffer and literally the pizzas started to be burned several weeks in a row.  Stopped eating there for about a year and went back in Nov.  Called in an order and was told 30 min.  Had they said longer I would have not ordered from them bc we had an event to attend.  Went to pick up and they said it wasn't ready, 10 more minutes.  Ok.  Come back and STILL NOT DONE.  This was for 2 pizzas!  I'm really peeved at this point and almost walk out but my 5yo was begging me to wait to get it.  Another 10 minutes and they offer me garlic knots.  I said, how about next time, tell me an hour because no one likes waiting and that's about how long it took.  Think they gave me a pizza for free or something?  NOPE.  Likely never going back.  Don't like attitudes from business owners who think they're doing me a favor."}
{"text":"Upon walking into your establishment (on park rd 11-25-17 at 12:00) no one greeted us for at least 2 minutes. When we were finally \"greeted\" we were asked, what do you want? Ummm to sit for lunch.... this is when we were to just go ahead so we picked our own table and the person who \"greeted\" us was apparently our server who didn't even know the drink menu. Asked me to pass the table tent to her so she could read it. She had to flip through the pages to get to Saturday's drink menu and proceeded to read it to us. When we finally ordered we wanted a 14\" half cheese half chicken Parmesan and the \"server\" obliged. After waiting a long time for this Pizza (keep in mind, we were one of the only customers in the place minus the two people at the bar), our \"server\" (who's name is Jennifer) brought us over an enormous pizza. I quickly say wow that's a huge Pizza. That's the 14\"?! She said no that's the 18\", the chicken parm only comes in that size. I said well if i had known that, we would not had ordered it. She never specified this to us so when she walked away, i went to look at the menu and noticed you can get this pizza in any size. I hear a shout from across of the restaurant asking what i wanted. I quickly said \"a manager\" and sat back down. Our \"server\" Jennifer came back and rudely said, the manager is taking care of it. Where i replied, i still wanted to speak to them. After waiting forever, we ask another person for a to go box and they basically threw it down on our table. A manager never showed up and I promise you that i will never return to your establishment ever again and i have no problem letting more people know about this."}
{"text":"The pizza is really good. Like NY pizza good. But their delivery always takes forever. Maybe they need a kitchen just for delivery, I don't know. It's been over 2 hours now. I called and they didn't even apologize. Told me it was on its way....."}
{"text":"There food taste like cardboard! It's 100% flavorless and the service is awful. I ordered baked rigatoni and it seriously tasted like nothing but watered down pasta. We didn't even receive napkins and the. During the appetizer he brought it and said did you guys want plates or are you good with just eating off the one big plate. Who does that in the service industry. Anyway save your money and go to a really Italian place because this isn't one of them."}
{"text":"Sitting here trying to have dinner with my family and they have a DJ playing nasty explicit music and the manager said his hands are tied. The owner Bob knows about this and is fine with scaring away the families for the dinner hour. This has been going on since 430pm and its not 830pm. We will regulars but we will never be back again."}
{"text":"I am recently relocated from NJ to Fort Mill.  My wife and I tried Libretto's based on previous reviews on Yelp. On our first trip 2 days ago I ordered a Brooklyn Pizza as an appetizer along with eggplant rollatini.  The pizza was very good, similar to pizza we have eaten in NY. I would have liked the crust a little crunchier but nothing that another couple of minutes in the oven couldn't fix. The eggplant rollatini appetizer was very tasty, i just didn't care for the skin on it.  For a main course I ordered fettucine alfredo with a side of meatballs and my wife ordered linguine in clam sauce. All I can say is both dishes were off the chart delicious. The fettucine cooked perfectly with the alfredo sauce had wonderful flavor and wasn't as heavy as some I've had before. The meatballs, big and tasty, were very close to the ones I make myself from my mothers recipe. As for my wifes meal she said the clams were fresh and the pasta was cooked perfectly.  We will certainly be back to try more items on the menu."}
{"text":"Amazing New York style pizza in the heart of downtown Charlotte in the Epicenter plaza. Definitely the hot spot to eat pizza after, during, before a great night out. The classic cheese pizza is the one option you can't go wrong with. It's thin and big enough to fold over for a reminiscent slice of New York. John from Virginia was very helpful at the counter and Josh hooked it up behind the counter. Diner seating was comfortable, very packed and popular. We look forward to returning very soon the next time we are in town! Definitely a must for late night craving. They close at midnight and a large pie decently feeds 4, but it's so good you could go in on at least another half of a pie with 4 depending how hungry you are."}
{"text":"Went in last night for the Yelp Event and was very pleased. Food was great, service was pleasant, and we had an overall good experience. Loved the outside patio too! Ballantyne is a little far for me but I'd definitely go again if I was in the area."}
{"text":"Best pizza in Charlotte.  (That I have found so far).  Visited the Ballantyne location. Saturday afternoon after thanksgiving at 3pm was a great time to come for no crowd. This has got to be the only pizza joint in Charlotte with an original location in NYC.  The homemade marinara is amazing with the fresh mozzarella frittes.  A decent beer selection.  We will definitely be trying not only the parktowne location, but also the NYC location ASAP!"}
{"text":"One of my favorite eats at 2 am, Libretto's caters to almost any carbohydrate craving you might be experiencing. While the pizza (New York style) is as good as it gets, I would much rather comment on the delicious Italian menu items listed on the blackboard. After all, $4.50 spent on a slice of sausage / pepperoni could be used instead, on a luscious cut of tiramisu.   I decided to try out the Penne Vodka with Grilled Chicken. When I sampled my first bite, my teeth sank into the penne rather easily (was hoping for an 'al dente', but you won't find that in many places anymore unless its Michelin starred). My next sensation was the creamy, salty, tomato texture of the vodka sauce that coated each individual piece of pasta - the main reason why I think so highly of this dish. I broke the sauce down into its components in my mind and I was able to discern the fresh garlic, the plump chunks of tomato, the (double?) cream. I didn't get the impression that much, if any, of the dish was processed or preserved. The pasta was topped with freshly grilled chicken, which appeared to be escalloped or flattened with a tenderizer. I could see and taste the light char on the meat, which was finished with minced parsley - adding some nice green color. Everything goes together so well and the seasoning is perfect every time.   I would also note that the garlic knots are the best I've had in this city and pair nicely with the tasty plates that Libretto's offers. Everything here will be a little more pricey than other restaurants in the area, but I'm always willing to pay a premium for the best.   Venture out and try something other than the pizza! You might find yourself pleasantly surprised!  4/5"}
{"text":"Heard this was a great place for pizza... So I tried it. Can't say that I would seek out Libretto again though as I felt my pizza was pretty sub-par and the wings were kind of soggy. I ordered the New Yorker pizza, and it was fine... Pretty basic yet scarce toppings. They go very light on the sauce which is fine... But the pizza was so bland and flavorless I couldn't tell if it had any seasonings or salt at all. Then I moved on to the Buffalo wings. I could tell by looking at them they could possibly be fried soft., and I was right. Sadly again, unimpressed with my selection. If I was in the kitchen I would have left the wings in longer... Who wants to chew squishy buffalo skin? Gross. Will be trying other pizza parlors around the city in search of something better, which shouldn't be too difficult."}
{"text":"I always get delivery to my work and I'm glad to say I'm never disappointed. Their deliver is always on time and the food is always absolutely DELICIOUS! I recommend  to anyone who enjoys good Italian food :)"}
{"text":"Genuine Quality Italian Food in Charlotte? Never thought I'd say it. Pizza by the slice is awesome, will add/subtract anything you want. Prices very reasonable for area. And Dinners are great especially the entrees. And the Pasta carbanara- too die for"}
{"text":"I get so sick of ordering Pizza from Dominio's and Pizza Hut, I thought I would try Libretto's !   Well, not the most pleased. I ordered the Chicken Parm , the 18 inch with Grilled Chicken, and Ricotta, and fresh mozzerella, I like the crust , the ricotta was pretty good but the Chicken and the fresh Mozz were not there. I could not find them anywhere ...a couple of brown small pieces of what looked like fake meat but no grilled chicken. I also ordered a 18 inch  Il Diavolo , well I received a 10 inch with 5 pieces of Pepperoni and a couple small pieces of what I think was sausage. Once again, I liked the crust, but the pizza was so lacking in toppings it was ridiculous on top of being 8 inches too small!  They did refund me 10.00 but I dont know if I would ever chance ordering Pizza again from them.  Now for the positive. I also ordered the Stuffed Mushrooms which were probably the best I have ever had! The cream sauce over the top was so delicious I could have drank it as soup!! My thoughts are so confused on this place. Not sure what to do?"}
{"text":"We only had the pizza (two slices off an already made pie) and it was OK.  I think, based on the hours, that this place probably makes a great post-party spot."}
{"text":"Cheap, quick, and oh so yummy! Hey give the small business 5 stars! Atmosphere- okay so it isn't the cutest or the most trendy place but it is nice! It doubles as a quick lunch stop as they sell pizza by the slice.   Service- Great! We were seated immediately (Monday around 2:30 PM) our server was young and not overly chatty but sweet and quick! He refilled our drinks quickly and was competent with the menu.   Food- Love pizza :) I ordered the spinach calzone, and I really enjoyed it! It was perfectly done and came with the yummiest pizza sauce for dipping! My boyfriend ordered a build your own pizza and made his own Hawaiian! He also enjoyed his pizza and was happy with the large portion. This place has good pizza!   Price- The best of all is a good meal that doesn't break the bank! With all the eating out I was pleased to see that this place was very well priced! we paid around $20 for us two and were more than full!   Overall, I was thankful for the great food at great prices! will be back!"}
{"text":"You have to try hard to screw up pizza.  Unfortunately there are some that try REALLY hard.  Libretto's isn't that place.  They do it right.  I actually prefer this location over going to Fuel b/c it never seems as crowded and the service seems quicker/better.  I try to steer clear of eating unhealthy when I can, but when I need to indulge in some junk food, pizza's normally on my mind, and Libretto's really hit's the spot.  This place is also a good spot for a late night bite to eat if you are into people watching as most people pouring out of the clubs and bars are hitting this place up to get some food to offset their drinking.  Makes for a very entertaining environment opinion.....so it's like dinner and a show :)"}
{"text":"Ive been to this place like 5 times in the past 2 weeks(I dont leave there spending less that 20), but after yesterday I will never go back.  It was the place to go after you get a couple drinks and then grab a bite. Yesterday I was at Strike City went outside to smoke some waitress from the pizza joint snapped at me and told I couldnt sit there and had to go to the other side.  Its really not that serious, you could have just asked instead of being a bit*h. So I went in and talked to the manager who was just as much of a tool bag as she was.  Dude I manage a couple restaurants.  Just apologize, sugar coat and move on with your day.  That is all you had to do was say you are sorry and you will take care off it.  Screw this place their pizza is not THAT GOOD. It is just like fuel pizza.  Pizza Peel is awesome(cotswold)."}
{"text":"I have to admit that I've only had their pizza, but with pizza that good, it's all I need.   I stop in quite frequently after work. They have excellent crispy crust pizza, and the slices are huge. It's pretty basic- stand in line, grab your slice, and go. The line usually moves pretty fast too. My favorites are their Hawaiian, Pizza Bianca, and Fried Chicken Pizza. Be on the lookout for this one- sometimes they just call it Chicken & Tomato, but trust me, the chicken is fried and it's delicious.  It's not that much of a problem, but the only awkward thing is the community tables. I find it a little off-putting to sit down at the end of a table of 6 strangers and then ask them to pass you the napkins, the red pepper flakes, etc. (And then listen to their conversation.) But the pizza usually goes down so fast it's not a huge problem.  Just a tip- need the restroom? Go through the swinging door next to the cash register to Strike City. Similarly, if you're at Strike City and need a pizza, it comes from Libretto's."}
{"text":"Hours during the week are shorter than shown on website and Yelp. Pizza was tasteless and cold. Crust was hard as a rock. Won't be back. Totally disappointed at the waste of money!  If this is what people think authentic Italian food and pizza is like they are sadly mistaken!"}
{"text":"My wife a I stayed downtown Charlotte for the weekend and found this place practically across the street from our hotel. We thought this would be perfect to grab and take back to our hotel for a movie night.   The menu seemed to have everything you'd expect and want from a pizza place; i.e. Pizza, Stromboli, Calzones, Subs, and some deserts. One nice thing is they sell pizza by the slice (and not just cheese and pepperoni) there were a lot of different pizza by the slice options.   We bought pizza and a couple cannoli. My ham and pineapple pizza was good (not great) and I enjoyed it for the most part. My wife got their \"New Yorker\" (meat, onions, peppers, and mushrooms). Again, good not great. The biggest miss was the cannoli!!! I was looking forward to it more than the pizza and it was gross! We both took one bite and into the trash can they went. The cannoli filling had a rancid flavor, it was definitely old or something. (And this is coming from someone who has had their fair share of cannoli, and knows what it is supposed to taste like).   With so many restaurant choices located downtown Charlotte, I'd take advantage of another option next time. Wasn't worth it for me."}
{"text":"DO NOT ORDER DELIVERY. This place is good on a drunk night at the Epicentre but don't dare try to order delivery. If the free and no minimum delivery seems like it's too good to be true, it is. BECAUSE YOU NEVER GET THE FOOD. I've ordered from this place twice and both times I got some half assed excuse and a nonchalant apology when I didn't get food I paid and waited hours for. I even have a credit sitting on the books for the awful service but I doubt I'll ever use it. Just order delivery from any of the MANY other restaurants close by who will gladly just fulfill your order and bring it to you, what a concept."}
{"text":"After church mom and I went to Libretto for lunch. I bought a living social deal for this place. We have the 18 inch Margherita and it was very yummy. I love the basil on the pizza. We also have the garlic knots, and that was good too. Mom really enjoyed the pizza and the house salad there. The house salad was fresh. Our server was very nice and thoughtful. We had a good experience there. My friend who works at uptown also recommended me the Libretto at the Epic Center. She told me it was very good also. I am tempting to buy another living social deal for uptown location."}
{"text":"Pretty good pizza. I usually go to the one in epicenter for those late night shenanigans. However my husband and I have been here for a couple of dates. It's always good."}
{"text":"Did the takeout here, 3 slices because they're kinda small.  Very tasty pizza, but otherwise nothing special.  The crust is waaaaay too thick for ny pizza.  I definitely prefer Tony's thin crust to this.    Libretto's does have more topping options when you go by the slice than Tony's, but I'm all about the thin crust.  Guy at counter was nicer than the guys at Tony's, so props to him.  The bar area is super loud, FYI."}
{"text":"Had the pepperoni and chicken. Pretty tasty, pretty greasy. Tea was too sweet- a very pardonable sin. Great view of outside goings-on @DNC... (apparently this review didn't post in Aug' 12...)"}
{"text":"Really enjoyed our visit. We were craving pizza but not fancy. Libretto's was perfect $4 pizza slices and cool casual vibe. It is typical counter pizza.  If you are a pizza snob or gourmet buff, this might not be the place. Perfect for us. We were particularly impressed with their customer service. Young man,Trey, behind the counter was incredible and what made this a 5 Star visit. Thanks Trey!"}
{"text":"What was once the paradigm for quick counter service at the Epicentre has transformed into an inefficient mess. The service is slow and unfriendly, and the quality of pizza has slid faster than the mud in Haiti. I'm not sure if they're going to extra mile to be \"New York\" style by hiring rude people with poor attitudes, but if that's their theme, it's working.  I think I'll have Domino's deliver to the Epicentre before I return here."}
{"text":"Tried it for the first time at lunch on Friday. Menu had all the Italian standards. I had the cheese ravioli and it was delicious. The portion was just the right size, so I didn't go back to the office and struggle to stay awake for the rest of the day. Definitely will be making this at least a once-a-week lunch spot during the work week."}
{"text":"If I could split this review in two, I would give the food a 3 and the delivery a sub ZERO.    The food...we appreciate the fresh ingredients.  Delivery Order 1# The garlic knots are great...if you get them.  Ordered a Tuscan Salad with grilled chicken and garlic knots along with a pizza.  The Tuscan salad has bacon, ditalini pasta and blue cheese crumbles for $8.95.  Chicken is an additional charge.  For $8.95 it would have been nice to visually SEE the blue cheese instead of having to hunt if it's even there.  The salad was mostly lettuce.  Even the ditalini pasta?  Come on, it's pasta, it's cheap, it's an Italian restaurant!  I could probably count 10 little noodles in the salad.  This salad had the potential of being great but the chintzy portions of the featured ingredients makes it waay over priced.  People make meals of these salads, make it worth a meal!  The chicken was nicely packaged separately and tasted great, but again, we paid extra for that.  As for the garlic knots, they never came with the order.  I called the restaurant and they offered to send the delivery person back out, but seriously?  I was starving and didn't want to feel guilty not tipping someone a second time for $2 worth of garlic knots so I asked for refund (fyi, plz refund your customers the tax they paid with the order, not just the item).  Pizza for hubby was delish and waaay over priced.  Charging $2.50 per topping is excessive and not being able to make a minor swap on a specialty pizza is uncommon.  So when you start with a cheese pizza and add 5 toppings you end up with a $28 large pizza!  Unfortunately it arrived bone cold because it took an hour and half to get our order!  SO you're not only upset about waiting for so long, you still have to turn on your oven and wait to reheat a fresh pizza!  Delivery Order #2  This time, a pretty simple calzone, 6 wings and a large pizza (yes, the same ridiculously expensive pizza).  The calzone was disappointing in the portions of ingredients.  I had pepperoni in the calzone and couldn't even taste it.  In general it was \"meh\" and I was just hungry so I ate it.  Will I reorder it again?  No.  We tried the chicken wings and those were actually quite tasty...best part of the order.  Hubby's pizza had those fresh ingredients again, but guess what?  It took an hour and half to get the order again and it's not a busy night!  It's Monday!  Pizza was soggy even after reheating and the whole meal was a general disappointment.  Total price of the order with delivery?  $46.13  In both cases we had to call the restaurant and ask where our order was.  We kinda felt sorry for the delivery guy who had some story about a previous \"serious order issue\" that caused the delay.  He told us we could call the store and contact the manager.  Frankly, that's not our job.  Great customer service would have had that manager calling the people who have been waiting a ridiculous amount of time and personally apologizing.  It's not hard to look up a phone number on a take-out order.  All in all, there are too many other pizza places locally to deal with these issues.  It's just not worth the aggravation dealing with this place, especially after you've worked a long day and just want to have a nice meal before 9pm!"}
{"text":"My husband and I think this is the best pizza in Charlotte! I especially love the thin crust personal pan pizzas which I add a couple of extra toppings to. The size \"small\" is big enough to make TWO dinners for me. We've tried some of the entrees as well and that has been hit or miss. One evening the Chicken Francese is gourmet delicious and a couple weeks later it's barely edible. They do a very nice sauteed spinach as well. Best of all, they DELIVER! Very friendly delivery people, many from up north like we are. If we had any complaint it would be that we ALWAYS STRESS al dente pasta, and like the Chicken Francese (which comes with pasta - we ask for the penne, I think they they replaced that with Rigatoni) is sometimes overcooked. All in all our experiences with Libretto's food and staff on the phone and delivery people have always been good!"}
{"text":"Best pizza in Charlotte with lots of other yummies on the menu. AND THEY DELIVER TO SOUTHPARK! Warm & friendly staff. We are regulars."}
{"text":"I ordered delivery from this place. I ordered parm garlic wings, tirimisu, and a Ceasar salad. My salad didn't cover the tin it came in. The wings were bloody and bland. The two I ate tastes like plain chicken. The tirimisu was broke in half and covered in Hersheys chocolate syrup. I called to get my money back and had to fight with the manager about bringing my money to me. He kept urging me to take a dine in credit which I did not want because I won't be ordering anything else from them."}
{"text":"Yum! Traveling on business to Charlotte Ballantyne and this place was recommended by my hotel as a place that would deliver. Great variety in the menu. I ordered the grilled chicken with mozzarella and peppers sub/hero and a side salad. Delicious. They told me delivery would take awhile (an hour) but it was so worth it. And the lady who dropped it off was lovely. Highly recommend."}
{"text":"TRASH!  we waited in a very short line FOREVER for a SLICE and it was garbage! Pizza was lukewarm and stiff!!  The garlic knots were small DOTS of dough (like they took one knot and pulled it apart to make a single order of 4 knots).   Staff was SLOWWWWW af!   Everyone looked confused.   WTF???!!! I dont understand how theyre in business!  This is a bare hands place too!  No gloves when handling the food.  First time/Last time!"}
{"text":"Charlotte's got a lot of great pizza places, but for my money, Libretto's is near the top. The pizza's about as authentic, NY-style as it gets, the pasta dishes are wonderful, and the garlic knots out of this world. Kid-friendly atmosphere and a convenient Ballantyne location make Libretto's a must."}
{"text":"Very disappointed. 3+ hour delivery.  We have probably eaten librettos dozens of times. Unfourtently the service I received yesterday was inadequate and shameful.   The sequence of events.   (1) Ordered at 1:15 pm using the new online delivery checkout.  (2) Email received saying the order would not be delivered till 2:35 pm. I called to confirm why it would be so long. \"They did not have a delivery driver available until then\"   (3) 2:35 pm rolls around and no delivery, waited till 2:50 to give them a ring back. They said the delivery guy is ready and just waiting on getting the food out.   (4) 3:40 pm the food finally arrives. (1 hour after they had a delivery guy, and just to think, this is over 3 hours of my original order), I was minutes away from giving them a call. I probably should have anyways. But given we waited hours, we were starving.   Overall, I waited over 3+ hours for a lunch which became dinner.   The fries were not that good, more soggy than crisp. The pizza was lukewarm and nothing sizzling about it. I waited for mediocracy, it was a waste.   They did not refund the order, they just sent it out oblivious of the repercussions."}
{"text":"So I work weekends sometimes for merger related work and need to feed the folks that staff my command center............Libretto's does a good job making those folks happy when it comes to a \"feel good\" meal.  The pizza selection is extensive and they can make pizza's to order.  Located right in town makes them convenient and pricing is very affordable for what you get.  I have yet to be disappointed with them."}
{"text":"I waited months for this location to finally open. I often go in just for the garlic knots and a few beers or glasses of wine.   If you've never been do not settle there. The tapanade is great as the the fried calamari. They have a large list of pizza by the slice and there individual slice pizza is almost enough for two.   I think its Mondays and Tuesdays that the offer a 3 course meal for only $9.95. Includes a starter, choice of pasta, and dessert.    The added garage doors near the bar do during summer it's almost like sitting on a large patio. This place is never a miss."}
{"text":"I have been to this location in ParkTowne shopping center multiple times. This place is certainly worth a visit. Do yourself a favor and order the garlic knots. They are my go to here and order every time- Delicious! I have also tried the pepperoni knots and they are tasty but usually opt for the classic garlic knots. Their pizza is pretty good but not what you would find in NY but that is hard to find down here. I will also add  I usually order by the slice but you can also get whole pies. I hear the Diavolo is the ticket here. Sounds really good. The pasta dishes aren't bad either but I think I will stick to the apps and pizza. Oh the calamari is good here too.  I will leave you with this . It's also a good pace to have a few beers (usually have some good beers on draft and on special) at the bar and watch some football (especially if you like Oklahoma) .  Order some tapenade and watch football because what two things go together better than tapenade and football :)"}
{"text":"Placed a delivery order today. Got a phone call 50 minutes after placing the order apologizing that my order was late. I was told that they had no romaine lettuce for my Caesar salad and would I be ok with iceberg which tells me they were just starting to fill my order. I was also told that my order was going out the door immediately. 35 minutes later I called back because my food still hadn't shown up. I live .5 miles from the restaurant and google maps says it takes 3 minutes to get to my house. The manager informed me that my order went out with several other orders and that it should be there shortly. When you call somebody to apologize for their order being late and tell them their order is going out the door immediately you are setting an expectation that their order would be there soon. I was offered nothing for my inconvenience. Won't order from them again."}
{"text":"After the Third Eye Blind concert, my buddy and I went wandering around downtown Charlotte looking for more watering holes to visit. We eventually tapped out and wanted something to eat and figured pizza would definitely hit the spot in our inebriated state.   We showed up around 11pm and obviously people had the same idea. The place was pretty busy but the line to order your food was pretty quick. The service was lively behind the counter and took our order promptly. This was probably 7 to 8 months ago but my buddy and I still joke about it today that the pizza was so hot that it was cooked on the sun. Really though, the pizza was really hot. From what I remember, it was also delicious.   I really hope that I am able to visit Charlotte again so I can stumble into this place again for a slice a 2."}
{"text":"Decent Italian food in Ballantyne. They also deliver which is definitely a bonus. I would eat here again."}
{"text":"I just recently moved to North Carolina in the Ballantyne area and my boyfriend and I were craving some pizza so we figured we would give this place a try. The menu offered a lot of options but, we decided to go with the New Yorker pizza. It was delicious and the large was more than enough, however the price was slighter higher than I thought it should be for a pizza coming in around $30."}
{"text":"Good pizza! We got the eggplant rollatini appetizer, a 18\" bianca pizza half pep/half chicken and a garden side salad with 2 beers and it was less than 50! You get a lot for your money and we brought home 2 boxes of leftovers."}
{"text":"We came in on a Groupon just moved here from Upstate NY where we have pretty amazing pizza! Local beers on tap which were good. We shared the appetizer Eggplant Rotinis which were amazing & I got a small side salad which was huge!  Pizza was decent - I think the Eggplant was better tho. Prices weren't bad. Overall eh- okay for pizza but there entrees were GREAT!"}
{"text":"If I could give this place a minus one they would have it. NO ONE greeted us when we came in and it was quite clear they did not want to serve us. I ordered a coke and asked if we could sit outside. Coke was flat. Waitress had the nerve to tell us she hopes she doesn't forget about us because she's not used to serving ppl outside...really? Why do you have outside seating? Ordered a margarita pizza with spinach n ground beef and I be damned if she didn't come out less than five minutes later saying they were out of fresh mozzarella....really? A pizza place out of cheese? I offered to pay for the flat coke because I was disgusted!!! Never have I been so insulted by obvious racism in my life! I will NEVER go back and will be certain to have someone look into this business and their ethics."}
{"text":"Have ordered takeout here many times and never had an issue.  But my last experience is my last.     Placed a takeout order on the way home as their location is about 15 minutes away with traffic.  Among other items ordered 2 orders of wings and asked for extra blue cheese.  Did not check the order before leaving, which I suppose is my mistake.    When I got home and unpackaged my order they did not include any blue cheese, which pretty much makes wings pointless.  I called the restaurant and advised them of their mistake.  They offered for me to drive back to get the blue cheese.  Since this would mean eating at least 45-minute old wings, I declined.  They seem to be confused as to why I was frustrated.  The manager then said they work refund 50% of the wings back to our card for the troubles.  I accepted and gave the manager my receipt number.    5 days later they still had yet to issue the refund so I called and asked to speak to a manager.  He advised that they would 1) go back and take care of the issue that day and 2) call me back to confirm.  No refund was issued and no call back happened.    I have worked in the in industry and mistakes do happen.  It's how you respond to those mistakes is what matters.  Libretto's was given 2 strikes to fix this simple issue and they didn't.  They have lost my business due to apathy.  All over some blue cheese."}
{"text":"Came for a quick weekday lunch as I am within walking distance and wasn't quite ready to do Maddio's again.  Wanted something that really tasted like pizza, even if that meant it wasn't going to be fresh or made to order.    They do by-the-slice, tell-us-which-one-you-want-and-we'll-reheat-it style pizza.  Interestingly, several of the flavors have a discount if you buy two slices of the same pizza.  How's that?  Well, my mushroom slice was $3.25 and my margherita slice was $3.26 but if I had bought 2 of either rather than one of each, it would have be $6 flat.  And I mean flat, cause they bake the taxes into the price already.  Which was a pleasant surprise.    The crust was crispy, so that I could hold a slice and eat it without it dripping all over me, but not thick or dry.  So it really was a good quality flavor and texture.  I'm glad I ordered two different pizzas as the flavors were clearly distinct and I enjoyed switching off between them.   Although I didn't do anything but the pizza, both of my coworkers ordered and finished their garlic knots so I'm assuming they were good.  A decent sized, yummy tasting lunch for under $10 in uptown?  Yeah, this might be my new go-to.  One star removed because they didn't have their outside seating set up (and we were very much at risk of not having a place to sit--even ordering to-go just in case) and one of my coworkers didn't get his garlic knots with his order (he had to remind them and we all waited awkwardly near the register for them to arrive--and by arrive I mean be put into the oven despite two reminders)."}
{"text":"Pizza is mediocre. For charlotte standards i guess pizza was good. Service is unprofessional, bunch of kids behind the counter. For some odd reason  you cant have extra cheese on your pizza after midnight or something.  That sucks. Not sure if its all toppings but i personally like extra cheese and mushrooms and was DE-NIED saying they dont do toppings late night. Meanwhile a nice huge bin of mozzarella cheese was right in front of him as i got denied my topping.  Bummer because i was craving a nice slice of pizza."}
{"text":"I've had a slice of Libretto's pizza from the uptown location in the Epicenter, so admittedly didn't have extremely high expectations when I met a group at the Park Road location for a dinner meeting last night. I was pleasantly surprised. The space itself is nice -- decent sized bar with several TVs broadcasting several different games, and the dinner area was cozy with a family-friendly atmosphere.   Service was quick and friendly. I ordered the Tuscan salad with added chicken, and couldn't resist trying the garlic knots ($2 - great life choice). The overall menu had a good variety of Italian-esque options, and I was pleased to see healthier options mixed in amongst the variety of pasta dishes, pizzas, and calzones.   Overall, the Librettos on Woodlawn is a good place for a decently-priced, sit-down meal, and our group will be returning again for our next meeting."}
{"text":"I think this is the closest pizza to NY style pizza in downtown. Tastes good and open late what else can you want."}
{"text":"If you are what you eat......then I am a LARGE Pizza Pie!  I had to give these guys a try, so in order to do this right I stopped by, looked around and placed a take-out order,  A slice of cheese, and a slice of pepperoni.   Now, let's get this straight, Tony's is hands down (IMO) the best pizza in Ballantyne, and having read good reviews from fellow Yelper's Libretto's Pizzeria was bound to get my attention.    The building is unique in its present design layout, and why I mention this is that you cannot use the back door as an entrance.  I had to walk all the way around the building, to enter the establishment.  This has a nice outdoor patio, but very few seating arrangements in the bar / front dining area.  The back area, ie the main dining area is nice in that it is a little more formal, located behind the wine racks with white linens on the tables.  After getting home, I tried the pizza, it was good, the crust was edible and not dried out like stale bread, and this warrants the opportunity of ordering a fresh large pizza, so that I may share with others.  Based on the reviews of other Yelper's,  I may just stick with the pizza, but as I see it, I eat enough pizza to to keep Libretto's and Tony's Pizza in business.  NCFoodGuy"}
{"text":"Love love this place I come for the three course meal special on Monday or Tuesday for 10.95 they give huge portion of pasta and amazing dessert . We came there close to closing and they still let us dine in. Well come back again . Great service"}
{"text":"We ordered a pizza and garlic knots, and it took Libretto's almost 2 hours to deliver, and we live less than five minutes away. To top it off, the pizza and garlic knots were cold when they arrived."}
{"text":"The good: the food is pretty good.  The bad: delivery is horrible.  I live uptown, less the 6 blocks from their location. Every single time I've ordered, it has been a debacle. Usually its delivery times that are far from what they promise. Sometimes its food that's been forgotten.   When you order online, as the order completes you get an email with a \"delivery time\". My delivery time tonight was \"10:37 - 10:57\". That is what my email read. My actual delivery time was 11:45. Almost an hour late. This has happened every single time that I have ever ordered from Libretto's.  Again. . .I like their food. They occasionally have had some issues with delivering the correct food compared to what I've ordered. But I won't order again. For the 5th time, they were far outside the time they promised me to deliver. My wife and children had fallen asleep by the time it was finally delivered. The entrees were still semi-warm but the pizza was cold.  Hopefully they can fix this part, because their food is pretty good, and their delivery guys are very nice. But if I have to wait an extra hour, every single time, to get cold food, then I won't use them again."}
{"text":"Their lunch specials are EXCELLENT! I got a pasta, salad, and a drink all for $10! I ordered a house salad which was fresh and incredible. It came with an excellent cheese dressing. Later, the chicken Marsala came and it was spectacular. A little heavy in that it was quite oily but it was still flavorful and the oil didn't overpower the spice (thankfully). The pizza and calzones were spectacular as well. Best thin crust fresh pizza I've had in a while to be quite fair.   The pricing was extremely fair. The service was good! Busy place, but you can definitely say there is Southern Hospitality in these folks. The ambience is that of a bar. It goes with the theme of the restaurant being a \"pizza bar.\"   Truly a gem in the epicenter! Worth checking out!"}
{"text":"Ate here on Friday night... it was pretty packed but we only waiting a couple of minutes for a table to clear up.  The hostess seemed new, in that she looked a little lost and kept assuring us that a table was getting ready for us.  There were at least 3 times where she came up to us and we thought the table was ready so we had a stand-up/sit down session going on.  At least we burned some extra calories before the meal doing that.  Once we got seated, our server greeted us warmly and we ordered drinks.  I split a roasted red beet salad with my mom and we all shared a 18\" Large New Yorker - mostly meats and cheeses with onions and colored peppers.  Everything was delicious.  I'm looking forward to coming back and trying their pasta."}
{"text":"I know I did a review of this previously...just not sure what happened to it.  Oh well, it was time for an update anyway.  I've been here a couple times for lunch and dinner.  I've always though their food was good.  It's the service that usually lacks as was the case today.    I was craving pizza for lunch and Italian pie was my goal.  This was actually the 2nd place I went to.  The first place which was nearby was just a circus and I drove around 10 minutes trying to find a parking space.  So it was op to Plan B, Librettos.    Judging by Brian's review, I expected the place to be closed but it was open and the front was quite busy.  The back had a large group and 2 other tables occupied.  I was seated back there.  I ordered a slice of pepperoni pizza and a slice of sausage pizza and an order of garlic knots.  The knots came out right away and they were chewy with a great marinara sauce.   The slices took a while to come out.  How hard is it to heat up 2 slices?  Anyway, finally they arrived.  Both were large slices, not as large as other places but still respectable.  The pepperoni was crisp but all the slice was quite greasy.  And it lacked sauce.   The dough was quite good but I was left to dip it in the leftover sauce from the knots.  The sausage slice was less greasy and the sausage was thick and tasty but this slice also lacked sauce.   Is there a shortage on pizza sauce these days?  Anyway, it still satisfied my craving but I'd love to find a locally owned place that is generous on sauce on their pies.  Man cannot live on dough alone!"}
{"text":"I had been to the librettos in epicentre a couple of times, but not recently. But a buddy of mine and I have been heavily craving some good pizza so we decided to get a large pie for carry out. We called ahead, placed our order and were told to come by in 15 minutes. (They're going to start delivery for their Woodlawn location very soon. A week or so, she said). Anyways, we arrived in about 10 minutes and our pizza was ready! Piping hot and smelling all kinds of amazing.   We brought it back to the apartment and it did not disappoint. The flavor was excellent, the cheese, crust, all of that. Terrific. Definitely coming back again. Hopefully can avoid the drive and have it delivered.   What I liked: the pizza was ready faster than expected, it tasted great, the person who took my order and helped in person was very friendly, reasonably priced, and  it's open late, AND the sell pizza by the slice, too.   Gotta love the new location. Definitely check it out. It's the closest thing to NY pizza I've had in Charlotte so far.   A+"}
{"text":"Great pizza and great service!  I first ordered a slice of pizza while enjoying some drinks at Strike City and was blown away.  It was hot, fresh, plentiful and arrived quickly.  From that point I have become a fan and have never been disappointed with Libretto's.  Also, I read a great story on CharlotteAgenda.com  about Libretto's donating pizzas to CMPD during the recent unrest and with that I am a customer for life!  I urge others to patronize this place and take care of the ones that take care of you!"}
{"text":"I've been here a few times now.  My most recent trip I waited 5 mins at the door to even be greeted.  We were the only people in the restaurant. A lady came to the table and told us that she wasnt even working but she would take our order. Meanwhile the lady that was supposedly our server was sitting in a booth in the back of the restaurant with 2 other employees hanging out. Our salad was disgusting. The calazone was the only reason I  didnt give one star. The calazone was actually good. The visit before last our pizza was gross and I also witnessed the kitchen staff spending alot of time in the bar area watching tv. Worst of all I decided to leave after watching the same kitchen employee enter the bathroom two times in less than thirty minutes wearing his apron. Gross.  Between the terrible customer service, lack of concern for customers and mediocre food I'll never step foot in here again. There's so many better options nearby."}
{"text":"The service is slow and the dining area is nasty. It's clean and set up your own table. I would comment on the food but I'm still waiting for a salad and a slice of pizza. I rather be in NYC at a real pizzeria."}
{"text":"First impression was great. Second third fourth and fifth were the pits.  Every hour on the hour I woke up with the unreal acid indigestion. I never get sick but this is that one roll that you never say never with. My Mischel impression was very very good then the acid woke me up from a dead sleep. After repeatedly taking Pepto-Bismol and drinking a whole bottle I was finally able to remain asleep. Next time it won't be a whole pie but, a slice if I'm ever in a desperate situation!  I have to say I was appreciative that Mike the owner has sent me an email to discuss this issue with me. I look forward to hearing what he has to say and hopefully having a better future experience so I will raise his star rating buy one for now until I get his response  Mike want to go and has responded to my emails and I appreciate his efforts would show me he genuinely wants to show me all of the great things that I heard about his business himself. I have a raised the bar once again due to his efforts and I told him I will honestly review The food when I come back in the next few weeks to try again. Bravo Mike!"}
{"text":"Today I went for dinner with my husband and my 18 month baby and we really enjoy it, we ordered New Yorker Pizza and Meat Stambolli and it was delicious, on time, and  the waitress was really kind, prices are regular and also there was live music with a very cool band my experience was great and I highly recommend this place ;)"}
{"text":"Had the best service before our hornets preseason game!!! Season tickets for us and we will b back for that Brooklyn style pizza!!! Thanks to Joe as well!!! Really accommodating to any need!!! Big help!!!"}
{"text":"Libretto's has GREAT Chicken Parm!  All the staff are friendly and fun! I come here a couple times a week if not more because they have WIFI and a good atmosphere!  They also have a lot of cool things going on during the week for entertainment...oh and nice patio!"}
{"text":"In Charlotte by myself on business and I hate to eat alone. I like places like Libertto's for situations like this. Personal size pizza and MNF was a good was to spend the evening. The staff was very friendly too."}
{"text":"Finding good, reasonably priced Italian cuisine is always difficult, but they do it right here! Their pizza is good, but I recommended eating it there at the restaurant; whenever I've ordered it \"to-go\" it tends to lose its flavor and get soggy. Also, their chopped salads are fantastic. When I get in late from work I just call in an order for a Tuscan salad with grilled chicken...it's awesome."}
{"text":"I can really only speak for their specialty pizzas, having grown up enjoying some of the best pizza NYC has to offer, I can say that Librettos is among the finest I ever had.  Truly, their Margharita, Chicken Parm, & ala Vodka pizzas are amazing.  Whenever my kids want pizza, they insist on Librettos and they are not wrong.  Best in Charlotte, maybe best of anywhere.  Both locations are stellar.  I just wish they delivered a little further out... I'd be happy to pay a delivery charge."}
{"text":"Visiting the city for a football game and walking through the epicenter and only place at nite for kids was this.... great great pizza, but limited seating....if you want specialty slices you are out of luck have to order a whole pie, if you want regular slices they have those available. ..."}
{"text":"We were staying at a downtown hotel, Libretto's was one of the only places open for delivery on a Monday night.  Delicious pizza and beet salad! Still hot when delivered and very friendly delivery person called well in advance to let us know our hotel policy would require us to meet him in the lobby.  Delivery took about an hour, which is what was advised initially, and with the Panthers game that night, was very reasonable! Delicious pizza, Definitely recommend!"}
{"text":"Just ordered a pizza from Libretto's at Parktowne.  It was an hour later than the delivery time in the email and cold.  My wife always thinks they are too expensive for pizza.  Guess I just lost the argument.  Bye bye Libretto's."}
{"text":"Soon after arriving in Charlotte I dined at Libretto's Pizzeria & Italian Kitchen for lunch with a family friend who works in a similar field. There are two area Libretto's: this one is in Ballantyne and the second one is uptown at the EpiCentre. Additionally, there is a NYC location and a fourth location in Jacksonville, Florida.  Libretto's serves a full Italian menu with specialty pizzas, salads, soups, traditional entrees and pastas as well as heros, wings, calzones and desserts. For lunch there are some great specials including the eggplant parm special that I tried. To start, we shared some of the delicious, buttery, garlic knots served with tomato sauce for dipping. These are truly worth the carbs and were great with the salad that comes with the lunch special (salad not pictured). The eggplant parmesan includes choice of pasta with sauce and it's a huge portion! I took half home for later. The dish itself was quite pleasing, with a well-balanced tomato sauce, lots of cheese and plenty of eggplant goodness. The pasta was also tasty with that same great tomato sauce.  I had one odd thing happen when I went to the restroom - I won't go into great detail but let's just say that the restroom needed some real attention! I mention this mainly because as soon as I told our waiter about the problem we noticed that the staff shut down the restroom for cleaning - a good sign that they actually checked out the issue when I brought it to their attention. Service was actually quite good overall, which is always welcome.  I really enjoyed my visit to Libretto's and I look forward to trying them out again soon for another lunch or for dinner. They are also prepared for folks who want takeout also as you can order pizza near the door and take it to-go. I will be back!"}
{"text":"My husband and I went to Libretto's for a Yelp event last summer.  It was pretty good, so we wanted to go back for a full meal.  I kept this on my list for some time, but we rarely venture out that way.  When a Deal Saver coupon popped up ($20 for a $40 value), we decided it was time to go.  We went at 6:30 on a Sunday night.  There were a few people sitting in the bar area (including staff) and only one table of diners in the front dining room.  They brought us to the back dining room where there wasn't another person in there.  Then...we waiting 10 minutes for someone to acknowledge us.  I finally caught the eye of a waitress...she rolled her eyes and came over.  She took our drinks orders with a scowl on her face.  Lovely.  I ordered water 'without' lemon and my husband ordered a beer.  Another 10 minutes later our drinks arrived....mine was a water WITH lemon...and not just any lemon....a brown, nasty lemon!!  We should have ran for the hills right then and there, but we decided to ride it out.   30 minutes into our experience, we were finally placing our food order.  We asked the waitress for recommendations and instead of telling us what was good, we got a rundown of what NOT to order.  (Say what?!?)  Again...we should have ran, but we didn't.   So...Chicken Parm with pasta and meatballs for my husband and Chicken Parm with fettuccini alfredo for me.  We also ordered a side of garlic bread.    Our food arrived 20 minutes later...minus the garlic bread.   At this point, we thought we were being \"Punk'd\"...we were waiting for Ashton Kutcher to come out at any minute!   Alas...no such luck.     My husband's chicken parm was scorching hot on top, but the chicken was barely warm and the sauce on the side of pasta was a runny mess.  The meatball was HUGE...and so was the piece of cartilage/bone that my husband bit into.  GROSS!!!   He was done at that point.    The chicken parm on my plate was much like my husbands, except my piece was paper thin and the illusion of \"thickness\" was made up by a mound of luke warm sauce and a thick pile of cheese.  Nice try, folks!   The Fettuccine alfredo was the grossest thing that I have ever seen on a plate.  The alfredo sauce was breaking down so it was a gelatinous mess in some spots and watery in others. We both send our meals back, but we didn't want anything else....except the garlic bread!  (My husband was an angry bear at this point and needed to choke something down to stave off the anger...I mean hunger).    By this time, another waitress (one that actually smiled) delivered the garlic bread. We each had one piece...placed our certificate on the table...and got the heck out of there.  On our way out, the waitress asked if we wanted to take the certificate since the meal was being comp'd, but we told her that wasn't necessary since we wouldn't be back.    I don't know what happened between the summer and now, but it was like we stepped into the Twilight Zone!  We left disgusted, disappointed, and STARVING!   Maybe it was just a bad night??  Who knows.  Doesn't really matter because we will never step foot in there again!"}
{"text":"Mmmm!  I lovelovelove the spinach calzone. Their sauce (for dipping) is also really tasty. Pizza is really good, too. Tends to be very crowded, so we do take-out mostly."}
{"text":"Wow I really love Libretto's pizza!   Ive gone twice and both times my pizza was fresh, hot, and tasty! There are many choices to choose from - some very unique, some standard. The pizza is NY style (wooohooo) it's thin and crispy. Both times I went for a white version pizza (white veggie, and Pizza Bianca) - so I can't attest to the red sauce but these two were scrumptious.   There are other options available too, garlic knots (they were good!), pasta, salads, sandwiches etc....and it's open late!  My only complaint (why I didn't give it 5 stars) is that it's a bit pricey (almost $5 a slice-yikes!). I also heard a rumor that come 1-2 am when the post bar drunkies come in they charge whatever they feel like....geez l hope that's not true!  I think they need to get some good specials going for the lunch crowd and this place should do very well.  I will be back to get my slice of NY ....couldn't resist the cliche sorry : )"}
{"text":"Great Pizza. Love that they support the Charlotte Independence. Mondays -- Large Cheese w/ Knots for $10.95"}
{"text":"It's a little disturbing to see a guy kneading his hands in the tub of cheese. It was slow and he was staring at the ceiling, wringing his hands in the one and only tub o cheese. Other than that potential health issue, I really like the place. Good pizza. Great price."}
{"text":"Libretto's is in the Epicentre on the lower floor next between CVS and the bowling lanes.  Note to new people: if you just want a slice, just walk up, order and then sit anywhere.  No need to wait to be seated unless you want to order off of the menu. Also it's helpful to grab yourself a drink first unless you want a fountain drink.  Drinks are in a case on the left.  Alright now for the review: this is pretty good New York style pizza, it was authentic, hot, folded properly for one-handed dining (this is a good place to check scores), and just enough toppings.  Their pepperoni was my favorite.  I will be back for lunch."}
{"text":"Really bad pizza...  I am giving them 1 star for the the online ordering and delivery.  I'm giving a 2nd star since it seems from the other reviews that their other food might be better than pizza?  At any rate, I ordered the Brooklyn pizza (cheese only).  I incorrectly assumed it would be a thin foldable crust.  If it was good pizza, I wouldn't care if it was NY style.  I was open and hungry.   However, it was a square, thick and soggy pizza with very strange cheese or cheese application. I really wish I had my phone with me so that I could take a picture.  I knew right from the get that it was not going to be good - just by looking at it.    No taste.  Weird cheese. Disappointing crust. Sauce was fine.  I forced three pieces down because I am stuck in a hotel room with no other options.  I'm actually kind of pissed I spent $20 plus $5 tip for totally crappy pizza."}
{"text":"Lots of words are coming to mind when I think of Libretto's.  They have locations in Charlotte and one in Manhattan.  It's legit NYC pizza.  We've even heard a rumor that they import water for the dough from New York.  My Husband and I have been to the EpiCenter and Woodlawn locations many times.  Each have their own feel.  This post describes the Woodlawn location.  We always sit in the bar area.  They have TVs with sports on, daily drink specials, and good hot food.  Our favorite is the Bianca Pizza.  It is Mozzarella...maybe Parmesan, and dollops of Ricotta.  The crust is perfect.  It is thin and crispy and can go up against any pizza in Manhattan.  Get Marinara on the side if you're into that.  The service is friendly.  All In all this is a good casual spot for good food and a good time."}
{"text":"It seems like this shopping center is often overlooked in favor of the Park Road one across the street, but there are some reasonable finds here - though a good number of places have not had good luck just downstairs from Libretto's.  Still, it seems that this spot is a good one for Libretto's, as they have been here for a couple years now, and it's a winner - though make sure you take a look at the full menu, because it has plenty of items in addition to the pizza that are well worth a look, such as pastas and yes, even salads, that are well worth a chance.  If that's not your speed, then the pizza is definitely worth a taste, though Charlotte has no shortage of pizza joints, and Libretto's is a reasonable sit-down option to add to the rotation, since there are so many other menu options from which to choose (and for those who don't like pizza, it makes for a nice change of pace)."}
{"text":"My and my boyfriend came here one night and noticed the place was really loud even in the dining area. We got the calamari appetizer first. I will say I have always been a big fan of calamari. But I was not a fan of this one. It was so bad we had to ask to take it back. The calamari was very soggy and the breading was seriously falling off of the calamari. It was not good. When we told the server, he must of told the manager and the manager came up to us and made a comment about how calamari isn't for everyone because they don't know it's squid. I had to let him know that I've tried calamari plenty of times and that I know it's squid and it wasn't the reason why we returned it, it was because it was soggy and the breading was wet. I've been back before ordering their pizzas to go and they are really good. Pizza sauce is so good. I highly recommend their pizzas!"}
{"text":"Service is ok. Ordered quick through the line to get a few slices of pizza. Slices came out quick and hot."}
{"text":"Don't do delivery!   Ordered on 10/9/16 @ 8:47pm.  1 small pizza, 1 salad.   Driver finally showed up at 10:52pm...  Went upstairs to go eat, found out we got the wrong salad, plain side salad when we ordered the Tuscan salad...   The pizza was actually good.   Just save your time and frustration, go somewhere else."}
{"text":"Extra napkins?!? Libretto's has been on our regular restaurant rotation for 3 years, but after last night we're taking them off our line up. The only reason I gave 2 stars was the food was OK. My husband and I went to the Libretto's after the movies last at night. We arrived before 8:00 which I think is still relatively early for a Saturday night and noticed the parking lot was almost empty and wondered if they were opened. They were not busy; only 4 tables of people, but we had to wait before anyone acknowledged our presence to seat us. The place looked dirty--table tops that hadn't been cleared, trash on the floor and servers that looked like when they weren't taking an order they were standing over the dishwasher.  Not too long ago, I remember that Libretto's had tablecloths and butcher paper on the tables and a staff of professional servers. What happened? Are they going out of business? Once we were seated, we waited so long for anyone to take our drink order we were literally getting up from the table to leave...but then the server approached and we stayed. The screw ups continued. We ordered a house salad, garden salad and split an order of raviolis. The raviolis came out first, we had to ask about our salads, when those came out he brought two of the same salad. It was a joke. The manager came over, apologized and offered us extra napkins. What?!? Who in the restaurant business thinks that extra napkins makes up for completely missing the service mark? He went on to say that 4 people called in sick, he was firing someone else, something about a food truck and they were busy. Hello, it's restaurant week. Get it together, man! The food was good, but with the lousy service and lack ambiance we've experienced the past few visits we won't be back. Our server ended up crediting $10 off our bill, but they screwed that up, too. He brought two bills--one for the full price and one less the $10--and ran the full price bill through the credit card machine. My husband noticed it and the manager fixed it. Good luck, Libretto's."}
{"text":"Terrible. Last time I gave them another chance they said they don't deliver to me (1 mile from thier store!)  So I ordered from the other store 5 miles away.  Anyways they took the order and said 45 mins. I called at 1 hour and 20 mins asking where the delivery was..they said the driver came to my house (didn't ring doorbell? My family was here hungry just waiting.   When asked why didnt they call if there was a problem they said they tried to call my phone but it stated it wasn't in service.  This is the same phone I'm using right now to type this review and rings all the time.  This operation is terrible they'll be out of business if they don't hire some better people.  I think they just lost my order so they lied to me and said they couldn't reach me. They were rude when I called to check!  The guy told me he was the manager who sounded like a teenager. Who knows."}
{"text":"Terrible service.  Insulting people should not work in service.. This last time I gave them another chance they said they don't deliver to me (1 mile from thier store!)  So I ordered from the other store 5 miles away at Park Road Shopping Center.  Anyways they took the order ok and said itll be 45 mins. I called at 1 hour and 20 mins asking where the delivery was..they said the driver came to my house and we didn't answer? (didn't ring doorbell? My family was here with me on New Years Day ready for a movie night, hungry just waiting to call.  We finally called at 1:20 thinking something wrong.   When asked why didnt they call if there was a problem, they said they tried to call my phone but it stated it wasn't in service?  This is the same phone I'm using right now to type this review and rings all the time.  This operation is terrible they'll be out of business if they don't hire some better people.  I think they just lost my order so they lied to me and said they couldn't reach me. They were rude when I called to check!  The guy told me he was the manager who sounded like a teenager. Who knows."}
{"text":"Great New York style pizza.  Sauce is nicely sweet and crust is excellent! The lasagna pizza is my families favorite."}
{"text":"For a slice on the go, Libretto's is pretty much aces, IMO. I'm usually hitting up this particular pizza palace late night when I've been watching the fist pumping at Alive After Five for 20 minutes too long. So, yeah, I just want a feed the hungry monster and get on my way home.   Libretto's is pretty basic inside: a front room with a handful of hightops and a back room with standard tables and TV's (I have never been back here). Every time I've been in here (granted it's been after 9 pm each time), I've found tons 'o intoxicated peeps and some folks who were working way too late at the bank of choice. The food is decent and pretty basic - it's a good slice of pizza on the run.   I usually order a slice of cheese or their tomato and mozzarella. They warm your order in the oven, you pay and you're on your way. The service isn't much to speak of - they're friendly and efficient, so that works for me. When I'm hungry and looking to grab some 'za in a hurry, Libretto's is a solid choice."}
{"text":"I must say when you are drinking at the Epicentre and want some good NY style pizza. This is the spot to go to. I have never had any problems with the food or service here. I did not like the fact that some of the customers were fighting in there which can happen anywhere and they were drunk and the managers asked them leave or settle down and eat pizza..Yes that is how that played out. I hope to continue dining here when I return to Charlotte in the future."}
{"text":"I love the pizza. I've been 5 times and it has always been hot and very good  The crust is thin , the kind you fold  The toppings have been equally distributed and plentiful  I like how long it is cooked too. The crust and toppings are done and not watery  Easy to order and nice staff"}
{"text":"Nice pizza. Thin crust a little sweet. Good roasted peppers  skimpy on the cheese. good waiter    indifferent manager who wouldn't sit me in a different open table. Why??"}
{"text":"DO NOT EAT HERE!! THEY SERVED RAW CHICKEN THEN DENIED IT ONCE THEY TOOK IT AWAY!!!!!!!!!!   Nothing like sitting down for a nice lunch on my day off and getting 1/3 way into my chicken dish only to notice that the meat is raw!!! NOT WHITE. Pink to dark pink in color. So just had to run to the restroom as the thought of just eating raw chicken made me lose what I already ate of the lunch. I thought it was overcooked when I first bit into it cause of the consistency. Boy was I on the wrong end of the spectrum. SO disgusted right now. Stomach is flipping around.   It's a medium sized pan grilled chicken fish. How the heck do u serve that raw?!?!?!  It's been 15 mins now since I notified my server. He's been very apologetic. Said the manager would be right out and he's still not here. I'm sitting here nauseated, unhappy and they're making wait now?!?!?!   Waiter just told me he's testing the chicken before coming to see me?!?! Seriously?!?!?!  I cannot be more upset right now. The manager, Aaron, came out, immediately had an attitude asking me \"So what's you're problem with the food?\" He's now denying that the chicken was raw. He's saying it was completely white, lying to my face!! Even the server verified it was raw when he took it!!!!!! If it was clearly white like he claims, why the 20 min wait so they could test their cooking times and the chicken?????  This is how you run a business?!?! This is how you deal with making a mistake?!?! Tell me I'm lying so you can cover yourselves?!?! Cause I have so much to gain by a partially eaten meal and vomiting in the bathroom?!?!   Do yourselves a favor and do not eat here!!  Update: The icing on the cake. Apparently when u post a bad review on yelp the employees or friends of the employees for this establishment take it upon themselves to send you nasty private messages via yelp using newly created fake accounts.   While I appreciate the owner Mike returning my phone call and offering us a free dinner, until they get new in-store management we won't ever be back."}
{"text":"Not to discriminate against the other two Libretto's locations in our lovely city... but this one is the best. Why? Well, it's walking distance from my house. Better yet... they DELIVER to my house.  Okay, so none of you probably care about that. Let's focus on the things we can all appreciate. This Parktowne location has a killer bar and patio area. They have the garage-like doors that open up into the patio. So nice.   And like all the LLs (that's slang for Libretto's locations... not to be confused with Cool J), you can expect the same delicious food. My two favorite pies are the Buffalo Chicken and the IL Diavolo (pepperoni, spicy sausage, jalapenos and roasted garlic).  It's a great place for lunch. You can easily get a pasta dish, side salad and drink for less than ten bucks. Pizza by the slice is also available: BONUS: Libretto's has punch cards for both pizza slices (buy 10 slices, get one free) and lunch entrees (buy 5, get one free).  Tons of specials throughout the week. Here are some of the highlights:  Wednesday: Half priced apps 4-7pm 1/2 priced bottles of Wine   Thursday: Half Price bar menu from 4-7pm $3 Craft Beers & $3 Drafts  Saturday: Brunch Pizzas $4 Mimosas, $5 Bloody Marys, and $10 Bottomless Bellinis and $5 flavored vodka bombs  Sunday: Kids eat free (if you don't like to be in a restaurant full of children... you may want to skip this day)  Another great restaurant by Mr. Mike Libretto. Spoiler alert: he's a hell of a great guy, too!"}
{"text":"Called in a to go order and the guy that answered the phone acted as if he just started. Every question I asked him he had to put me on hold to go ask someone and lastly he was acting like I was bothering him for calling. Bad svc!"}
{"text":"I absolutely LOVE this restaurant! I've been a patron for years, and as a former service industry employee, I tend to be pretty critical of those in the like profession. That being said, I have always gotten exceptional service at Libretto's.  My delivery driver (Mark) was super polite, and was even earlier than anticipated. The food is ALWAYS fresh and at the proper temperature, and they have NEVER botched my order.  I called and spoke with Jessica to update some of my account information, and she was so kind and accommodating! My expectations are always exceeded. My personal favorites are the lasagna, any of their pizzas, and of course, the cannoli. When I meet someone who has just moved to the area? I always recommend Libretto's- everyone needs their go-to neighborhood pizzeria! Keep up the great work everyone-  you've got a good thing going!"}
{"text":"Delicious pizza and fast service, but pricy for lunch, and they charge way too much for additional toppings. They also overcharged me for the one additional topping I ordered on a personal pizza and instead charged me the price listed online for their bigger pizzas."}
{"text":"Kinda overrated- NYC pizza mmmm I Think not- ordered specialty NY pie uber overpriced, undertopped/  Lorenzo's is way better!"}
{"text":"I quite enjoyed Libretto's Pizza. Of course, I ate alone and didn't have pizza, but balsamic grilled chicken with veggies and potatoes. The glaze was a little on the sweet side but still good overall, and I enjoyed the garden salad. The cannoli was quite flavorful - almost cinnamon like, but the chocolate syrup on the plate was just enough. The server was very attentive - had an error with the price of my side salad, but she corrected it. Very pleased with my trip and hope to be back for pizza soon."}
{"text":"I had such a delightful time at this quaint little pizzeria. They had live music and a lively atmosphere. My waitress' name was Taylor.  Now, Taylor was a very attractive and attentive young lady. She did a fantastic job my drink was always full and I never had to ask for anything! I will definitely come back and ask for Taylor!"}
{"text":"It's authentic New York Italian meaning in actual Italy where I've visited and spent time many many more times than New York NY, there is a rarely chicken served, no philly cheese steaks, though the food is still great here. My server though is a different story. She was slow, even took a smoke break cause I could smell the smoke on her breath. Service is very disappointing. Maybe take out will suffice."}
{"text":"Great food, bad service. like one of the other reviewer said order at counter and pick your own table, the server are burnouts"}
{"text":"Uptown.  Pizza lunch.  Bomb-diggity.  Since Sabarro closed (patooey!), this is the only game in town for a quick slice during the lunch hour, and it's perfect.  They have by-the-slice pizza in tons of varieties, and that is so perfect for hungry uptowners during the lunch rush.  They also have some pretty great specials if you want to sit down, and their sauce is pretty good (**yankee transplant translation - when we say sauce, we always, ALWAYS mean marinara or meat sauce.  Never BBQ, never any other kind of sauce, and yes, we judge places on how tasty their sauce is)  You can sit outside if you want, which is great, and they have some high-tops inside if you'd prefer, but beware, it gets crowded at lunch, so you might have to *gasp* sit next to a stranger!  But that's okay, if there's something that everyone can come together over, it's pizza.  I'd give it 5 stars, but I'm a pizza snob and it's not my favorite style, but it's still great!"}
{"text":"We had the spinach pie canzone which was excellent.   It oozed cheese great tasting spinach slivers of garlic and plenty of pepperoni in a crispy cust.  Highly recommend"}
{"text":"Me and a few friends stopped in here before the Ringling Bros. and Barnum & Bailey Circus show this past weekend.  Cant say it was the best experience or the greatest wait staff.    To start off we walked in to come grab a quick bite before heading to the show, the lady (girl) standing at the front was rude and barely acknowledged us, I think the wall she was staring at was more interesting.  We ordered our pizza and the cashier behind the register was screaming for someone to come cash us out because she couldn't because she wanted to leave.  After we attempted to find a seat, there were plenty open inside and it was chilly outside, however everywhere we sat the people told us we had to be sat by the hostess who was still more entertained by the wall then doing her job, so we simply went outside, froze our butts off and ate.  The only other time I've been here are those drunk nights, which clearly are the only times you should visit this establishment."}
{"text":"Went to Libretto's last Friday, just me and my boyfriend to grab a quick bite to eat after stopping at about 3 other restaurants which had a thirty minute wait.  I had a Bolognese pasta and he had lasagna, I finished my food right there on the spot, it was delish! The sauce is made in house.  Not only that but great service, quick and friendly."}
{"text":"This place is going down hill fast!  They need management to turn this place around or they will continue to lose business.    Parking can be a challenge at the place but mostly because there are lots of other businesses as restaurants here.   We showed up for lunch a little after 1pm on a Friday.  There were approximately 4 tables being occupied at the time.  We waited at the front desk to get seated for close to 5 minutes - that should've been our first clue.    A guy came out from the back and looked lost but didn't apologize for our wait or greet us.  When I asked for a table instead of a booth, he said oh good because all of the booths are dirty.    It turned out that he was the hostess and only waiter for the restaurant.    He tried his very best and worked hard to keep up but there's only so much that one person can do!   We placed our drink, appetizer and pizza order at the same time to make it easier on him and because we are familiar with Libretto's menu.    Food took forever to come out.  I can only assume that the kitchen staff is also short staffed.    For our appetizer, we ordered the calamari and when it came out it was good but the jalapeños and cherry peppers outnumbered the calamari. Not a good thing for someone who doesn't like spicy food.   When the 18 inch New Yorker came out, it looked good but I'm not sure it was cooked fully.  The ingredients didn't taste like they normally do and some of the bell peppers were crunchy or hard.   Hour an a half for \"lunch\" on a week day."}
{"text":"Best pizza in the city the appetizers are a little pricier but I'm so addicted to the meatlovers pizza so glad for the great addition to park road shopping center"}
{"text":"Slowly, this place is carving out a special place in my heart.  It all started with a Yelp event at the Ballantyne location, then late bites at the Woodlawn location after catching a flick at the theatre across the way, and now, infinite delivery orders from the Uptown location.    Everything here is pretty good, but not blow-my-mind good.  The pizzas are pretty plain if you get something basic, I'd recommend going with one of their specialties like BBQ Chicken or the Harvest pizza.  I used to be a fan of their linguini in clam sauce (adding shrimp), but after ordering it like 3-4 times, it doesn't quite have the \"it\" factor.  Their subs and heroes (what's the diff?) are tasty and fresh.  Two things really stand out though:  Boylan soda and garlic knots.  If you've never had Boylan soda, yer missin' out, bub.  The root beer is what root beer should taste like.  Truth:  I've ordered delivery just to get root beer.  I love that they have it here.  Garlic knots?  You haven't lived unless you've had their garlic knots.  So good they have slayed many a vampire.  Food aside, their service truly stands out.  I shot them an email about a 50% discount that they had said they would apply to my last order.  You see, they were slammed and my order was late.  The chick on the phone was really nice and I didn't really care for the discount, but it was nice to offer to take care of it for me.  Well, she didn't - and that's when I sent an email.  Just doing my part to better all Charlotte businesses and make sure they follow through!  Anyways, within 24 hours, Mike emailed me back and handled the discount quickly and with no effort on my side.  Being responsive is the key attribute in good service IMO.  Hell, they could screw things up all they want, but if they are answering my questions and putting forth effort, you can't really ask for more.  Handled perfectly.    Libretto's #1 fan here.  dmo out."}
{"text":"It's probably more of a three-star rating, but I've been pretty impressed by the Epicentre and Ballantyne locations.  Besides, I didn't get a chance to check out much beyond the bar.  Me and the mouse scurried over here after catching a flick that ended as 12AM - which is awesome bc this place is open until 3AM!  We split a pepperoni & jalapeño pizza which was decent, but didn't blow me away.  Looked like a bunch of locals would drop in for a late-night beer and pizza - I know I would.  Oh wait, that's pretty much what I did.  Hm, is it sick that I kind of want to go over there right now at 1AM for late-night beer and pizza?    I like this place to wind down the evening.  dmo out."}
{"text":"Great place to grab a quick slice of pizza or even customize your own personal Pizza. Watch out when building your own pizza. Unlike most custom pizza chains popping up, were all toppings are included, you will pay for each and every item. It is all to easy to end up with a 10' over $20.  I have tried a few of their entrees, and I am I'm not a fan. I personally will just stick with their Pizza, which they are great at. The flavor of their crust sets them apart.  Keep an eye out on Groupon. They will usually have a Groupon available that's good at all Charlotte locations."}
{"text":"Lame. Lame. Lame. Seriously, for the love of all things pizza, stay away from this place. Service is bad in the restaurant, as it's young kids waiting on you. Delivery is incredibly slow and will come warm if you're lucky with evidence of being thrown in the car. Anything fried is WAY too greasy. Meatballs and sausage are tasty but overall Librettos is inconsistent. It's sad, The two real non chain options in Ballantyne are mediocre at best. Seems this small business is struggling and the minimal portion control overpricing tactics are in full swing."}
{"text":"I ordered takeout from here a few days ago and was very pleased! I can't speak for their pizza  because I ordered a salad and my husband ordered a sub but we both very much enjoyed our meals.  There was a little hiccup with delivery but the customer service from the store to fix the issue was great - the gentleman I spoke with was super friendly and helpful. We will definitely order from here again!"}
{"text":"I love their pizza. A lot of New Yorkers seem to prefer Lorenzo's pizza, but I prefer Librettos. I order delivery frequently. In one two week period I ordered delivery from them at least 3 times. My normal order is a medium pizza that's half cheese/half pepperoni. I also get a side order of fries. I've checked every pizza place in Ballantyne, and Libretto's is the only one with fries on the menu. (That delivers)   I've been to Italy, and my good friends are Italian and own a pizza shop, so I think I'm a decent judge of good pizza. This pizza is delicious! I'm really shocked at the reviews on here. I have lived in Ballantyne over 5 years, and I've eaten Libretto's many, MANY times and I've never been disappointed. We've only dined in there once, but I believe we got pasta. The cannoli is also fabulous, and even when getting them through delivery they arrive displayed so nicely!    Great menu! Great food! I'll definitely continue to eat my body weight's worth of their pizza!"}
{"text":"At pizza fest-have to come out-$12 ticket gets you 3 slices, a t-shirt, sunglasses, and a beer!   All sponsored Abita beer ( abita.com) from Louisiana. Great 0izza-12 choices in toppings-buffalo chicken and white are fabulous.   Casual, great parking lot."}
{"text":"I'm a fat kid at heart and eat at a lot of different places so believe me when I say, best pizza I've had in Charlotte so far."}
{"text":"Ooooo the bianca pizza... best piece of pie on the menu. Made with ricotta, melted mozzarella (I believe) and just a touch of oregano, the simplicity makes the flavors come alive. I like hitting up Libretto's after a night at Strike City or drinks at one of the bars. While I don't frequent EpiCentre all that often, I always look forward to ending my night with a single slice... and I highly appreciate that I can get the bianca as a single slice and not the whole pizza. That's primo customer service right there.  And who loves their garlic knots? This girl... nice and buttery with a good blend of spices. Not overpowering and a perfect side option to my single slice habit. And the best part of their EpiCentre location? They are open til 4am on the weekends. You may have to stand in quite the long line after the complex shuts down at 2am but hey, it's 2am food, which is usually always worth the wait.  Looking forward to trying out the new location off Woodlawn Road!"}
{"text":"There are oven-baked pizzas and then there are oven-baked pizzas.  Now-a-days everybody's making it. So it's nothing new but it is good. So when you don't know where to go in center city, don't know what to eat, just go to Epicentre and it's there. Literally, it's there on the first floor. Can't miss it. Oh, yeah, That might be the best thing about them. Location, location, location."}
{"text":"Great pizza. Great service too. The calamari and the alfredo was good too. But the pizza was definitely the best. Hence Libretto's \"Pizza\" I guess. The mozzarella on the Tuscany was really good. Dried tomato was also good. But my favorite was the dough. It was thin, chewy and just right."}
{"text":"Good pizza, hot and plenty fresh toppings. Order was ready within time frame given. Friendly service phoning in order and picking up. Being a first time customer that matters. We will return!"}
{"text":"Best pizza in charlotte!!! This is the closest you will get not Jersey/NY style pizza in charlotte....great food, good prices, good staff...The actual ship their ingredients from up north to maintain the authenticity!!!!"}
{"text":"Terrible service, terrible pizza. It took us over an hour to get a pizza. We sat at a table and ordered, the waitress' (Natalie) excuse was that they had multiple delivery orders before ours. People dining in the restaurant and spending money on drinks should be a priority or at least be told during the wait period what is going on. No one came by to check on us or let us know that they were having issues until after 50 minutes of waiting. And they did not comp anything after all of our trouble. Once the pizza finally came out, It was undercooked and soggy. They clearly took It out of the oven early because they knew how long It had been. Don't waste your time or money here, I would eat at Papa Johns before I came back."}
{"text":"This is a most authentic italian restaurant and pizza place. I have had a few different dishes and all have been top notch. You probably cannot go wrong with anything on the menu."}
{"text":"The only reason that I'm rating you with two is because your delivery service was good but I'm sorry.  Your food is bland! Your sauce is bland and your cheese is bland.    What a totally disappointing experience with your \"Homemade Tira Misu\".  It is NOT the Italian dessert Tiramisu.  Just your poor version using cream cheese and cream, instead of Mascarpone cheese for the filling; bad quality coffee, which is supposed to be the key component of this dessert and not even dusted with real cocoa!??? I have never tasted bland Tiramisu before!   Well, maybe how you named your dessert is intentional. Don't pay for this people!!!"}
{"text":"I was working uptown this week so decided to place a delivery order. Delivery was slow even though we ordered at 3pm. Pizza came cold and undercooked with hardly any toppings. I did enjoy the Sicilian chopped salad. Today we decided to try again. When I called I told the guy what happened on Thursday and said I wanted the pizza cooked well done and extra toppings. AGAIN, delivery was slow and pizza undercooked and cold. This time I called to let them know and was not offered any sort of compensation. They didn't even offer to remake the order. I won't be ordering again."}
{"text":"I hafta say, it was pretty damn good!! The regular pizza and the margharita pizza were very close to New York style that I'm used to. It was thin and sauce was Delish. It came a little cold, but nothing that a blast in the toaster  oven couldn't fix, made the crust crispy too! The salad was big and full of tomatoes, green olives, shredded carrots, red onion. Could've used more dressing for such a big salad, so I had to make my own. Which, btw is better than any pre-made. Garlic knots were ok, could've been baked longer. Otherwise, I'm happy with everything and will definitely order again."}
{"text":"We picked Librettos for a quick snack at Epicenter while visiting friends in Charlotte. We both got slices and thought the pizza was great. Not the best ever but defiantly good.  Staff was friendly and the place was clean.  They also have a full menu if everyone isn't in the mood for pizza.  Would totally come here again."}
{"text":"I attended a Yelp event here a few weeks ago and enjoyed myself so I decided to give it another try on a Thursday afternoon. Hung out at the bar and had a few beers. Nice selection. The bartender was friendly and conversational. I ordered a pizza to go. Tried one of the Sicilian style pies. Good grief...it must have weight 4 lbs. It was huge!! Pretty tasty, a bit too much sauce for my liking. Still a really good experience. I look forward to a return."}
{"text":"I have no idea what these people are talking about. Everytime I come the food is very good.  I started off with there pizza which was good.  I then came back and tried the chicken parm and that was excellent (had to add a little salt, but that is better than food being too salty, which is easy to do with Italian food because of the sauce and cheese). I am from NY and a true marinara sauce is suppose to be slightly runny (sauces that you buy in the grocery stores \"ie non runny\" sauce are NOT AUTHENTIC). The only negative thing; I wish they did not put pizza in the title because they are so much MORE!o See my 2 favorite employees Doug and Aaron!"}
{"text":"For a pizza place attached to a bowling alley it's pretty damn good. I've had their pizza before while bowling and it was really good, but this time we went for a sit down dinner. Overall the food was really good. It didn't blow me away but I have no complaints. It was also relatively inexpensive compared to some of the other places in town we have been for Italian food. The service is not their strong point, but if you're looking for some good relatively inexpensive Italian food it's a great choice!"}
{"text":"Tonight I ordered delivery through Yelp for librettos pizza. As a business traveler, my needs are fairly simple: food that's fast, hot, reasonably priced and brought to my room by a polite person. All those criteria were met this evening. I ordered a calzone (with sausage spinach and kalamata olives), along with some broccoli and tiramisu. The food was flavorful and delicious, while not too greasy or oily.  My only gripe would be in the notes section when ordering I asked to have the broccoli well done and black olives in the calzone, but I can understand how that would be an easy miss.  Thanks for the good service and great food!"}
{"text":"Libretto's has some good pizza.  Great for lunch on workdays or lazy weekends in Uptown.  Service is fast and prices are mostly reasonable.  So why the low star rating?  Vapiano a block over outclasses Libretto's in all aspects.  If Libretto's existed in a vacuum it would easily be 3 stars, maybe 3.5."}
{"text":"Went here for lunch today and was disappointed with my experience. I ordered the Sicilian salad and it was alright. I would have imagined there would have been kalamata  olives but instead there were green olives. The dressing was a tad bit spicy. My friend ordered the mozzarella frittes and zucchini frites. The mozzarella were delicious! The first order of zucchini frittes were cold, so they sent them back. Received the second batch and they were way over-cooked (see picture). Overall, I wasn't impressed. Two stars for service and cleanliness. Won't be returning. The waitress did comp out the zucchini."}
{"text":"This is one place I loved going too since moving to CLT 5 years ago until last week when my family came down for the Hornets vs Celtics game. Like any event in the Epicenter it can get packed really fast and we knew that walking in. When my brother and sister in law walked in they said that the establishment was unprofessional and didn't look like a team because there were no uniforms and ppl looked as if they were just pulled off the street THIS IS TRUE but I told them it was a great spots. We went on to order from a nice gentleman with excellent customer service then moved down the line to the cashier who's attitude was from hell. She was a young Caucasian woman with tattoos and when paying for our order looked irritated and took our money with the upmost rudest display of behavior. I then got back in line because we needed to order drinks and she then proceeded to throw my receipt at my me to sign and snatch it back when done. A young woman behind me realized her behavior and said just like myself I love their food and atmosphere but I won't be coming back. I can say the food was good like always but until they get a handle on presentation and customer service during crunch hours they will continue to lose valuable customers. I used to drive uptown, park, and just buy a slice and read 2-3 Times a week but I guess I'm now on the hunt for a new pizza spot."}
{"text":"My husband & I popped by this pizzeria for a quick slice today. I ordered a Margherita slice & he got a slice of cheese. I was impressed by the crunch in my pizza & the flavor was good. I wasn't sure how fresh it was because it was heated & the sauce came out a little dry. The cheese slice was very good though. For $9 with 2 drinks, the price was just right."}
{"text":"This place has obvious virtues. It's in the middle of downtown Charlotte, takes eat24 orders (not a popular thing thereabouts), and it offers some nice pizza toppings and a whole wheat crust. But it was decidedly below my (admittedly high) standards for pizza.  The pizza I got was filling, but the sauce and cheese kind of bland. The peppers and mushrooms I added seemed kind of undercooked (odd, since I specifically checked a box for \"well-done\") and didn't add as much as I'd hoped.  Moreover, it took a solid half hour to get a pizza ready for pickup, and during the half of that time I spent in the store waiting, the people there were oddly apathetic and no one seemed like they wanted to be there. If you're desperate for a bite in the area, I suppose it's fine, but to compare this place to authentic NYC pizza (as their marketing does) is really quite insulting to New York."}
{"text":"Not sure if it's new ownership or management, but I'm never coming back here. The products and customer  service have been horrible the last few visits. Used to be a good pizza spot."}
{"text":"The food was ok. Kind of bland. I had to really go to town with the pepper flakes, parm, and salt to give the pizzas any flavor. We had a pizza bianco and it could have been great with a little garlic and salt. We also had a pizza with ham spinach and tomatoes and it was also bland and very watery. The staff was kind of slow and the whole time we were there, the staff was complaining and cussing because someone quit and the management staff didn't communicate this with the staff. Understandable to be upset but do it in private."}
{"text":"Food was great and reasonably priced. We had pizza and wings. The server was super nice, but we had to ask for a lot.  Will definitely be going to again."}
{"text":"WOW.. I swear that I reviewed this place already.. Maybe I reviewed it in my dreams because after I ate this pizza I thought I was in heaven.  Seriously!!  Best pizza in all of Charlotte! Scouts honor.. Each slice was large and perfectly melty and crispy at the same time (That right.. I said Melty and Crispy).  I am a huge pepperoni fan and I am salivating right now thinking about a slice.  If you are uptown, this is a must stop!  It is right in the Epicentre on the ground floor.  Price per slice is a little pricey (around $3) but it is certainly worth every penny.  Enjoy!  -Ian M."}
{"text":"Probably the best pizza in Charlotte.  Salads are really good, pasta entrees are generally excellent.  Very good wings and cheese steak.  Fun atmosphere in the bar area and good service if you want to eat there - especially nice when the big garage doors are open to the patio.  My only gripe is that they aren't open later."}
{"text":"Giving 2 stars is sad because the food is really good but service just continues to go downhill. Went in for lunch today with a couple of coworkers and the cashier was very rude and seemed put out that we ordered from the menu instead of just getting slices. Orders came out at all different times with salads and entrees coming out within a couple of minutes of each other. Two people walked up to the counter at separate times to get drink refills with the same size cup and one was told they don't offer refills on that drink size  (one that comes with the daily special ) and the other got a refill and was not told the same. The one that didn't have an issue got a Coke refill and the other was tea...seriously you don't give refills on tea?!? Do you know how cheap tea is to make?!? Unsweet. ..not even the expense of sugar. The refill was finally given but the whole incident just bizarre.  Best bet...get a slice to go and don't expect friendly service."}
{"text":"I think they forgot to finish my pizza...  Crust was good NY-style, cheese and sauce was alright, but the Margerhita I ordered lacked anything else (tomatoes, basil??).  I was surprised when I opened the box - I seriously thought they didn't finish it!  For the time it took to get delivery, plus the price - I'm  on the fence about this place. Still trying other options around uptown."}
{"text":"My lunch experience was wonderful! The salad and pasta combo was a large portion and courtesy of takeaway box made for 2 meals.  There was one server and she bust her hump getting everyone what they needed. I ordered the penne a la vodka, it was a bit tangy but still creamy and incredibly savory. Next time I will try the pizza..."}
{"text":"I have ordered from the Ballantyne location several times, and for the most part I am always satisfied. I have only dined in twice, both the service and food were fast and friendly. I usually order delivery and On a few occasions, (not many) my order was incorrect (something not delivered or wrong). But what sets them apart from many other places is their management. They always make it right, he takes ownership and fix the issues. I am a consumer that can love something but if I am not treated right my business and money will go elsewhere. So with good food and service I will always be a customer. This is what you call getting right! If you are looking for good New York style pizza, this is definitely the spot."}
{"text":"Walked in, grabbed a table and was promptly greeted. As I had never been there, they explained the menu. I ended up ordering a slice of pepperoni pizza and a water. The pizza came quickly. The pizza wasn't bad but it wasn't great either. Just sorta a piece of pizza. Not life changing. But for $2.75 I can't complain! It's loud inside."}
{"text":"Went tonight for $3 beers and $2 slices. We stumbled upon trivia which was great. The pizza was decent, but nothing special. My Kentucky mule was pretty good as well. I'll be back for the nice bar and cheap food, but it's nothing to write home about."}
{"text":"What a delicious meal on a rainy cold day working at home. The cheese was perfectly creamy and salty, and that crust had that great fire smoked favor to it. Hits the spot.   Delivery was early. That's always winning!"}
{"text":"This place is a hit or miss.. I've ordered the calzones several times and on more than one occasion the dough wasn't cooked thoroughly, so I ended up eating the filling and throwing out the breading. Another time, I ordered a side of pasta and a side of broccoli and the portion was excellent and made a meal of it. A second time, I ordered the same 2 sides since I was so pleased the first time and received really small portions and not the greatest quality the 2nd time around. Whenever my co-workers order from here, i'm a little bit weary and usually pass on their offer. I refuse to pay good, hard earned money for something that may or may not satisfy my appetite."}
{"text":"I ordered the Chicken Parmigiana Pizza.  Delivery was on time, but the pizza was over priced, delivered ice cold and utterly disgusting!  My boyfriend and I were both hungry, but still couldn't eat much of it.    We both agreed it is inedible, and a $21.00 pie will go in the garbage.  I tried putting it in the microwave, but that seemed to make it worse.  It wasn't breaded chicken on the pizza, but bits of what tasted like a flavorless chew, and there was hardly any cheese on it.    To their credit, the order taker was very pleasant.  They got the order correct and their cannoli was delicious."}
{"text":"The white pizza is the best thing on the menu besides the sicilian chopped salad (without olives yuck!!). I typically go for lunch, the slices are hit or miss.. sometimes better than others, sometimes over cooked more than other times. Service is spotty... two times I asked for no olives, had olives both times... another visit ordered garlic knots and never received... still keep going back for the white pizza. Ordered out and had delivered last weekend cheese pizza/pepperoni and it was really good. I have not tried any non-pizza items yet besdies the salad."}
{"text":"I ordered a bunch of food from this place via Postmates. The app said the delivery was going to take 30 ish minutes. An hour later my postmate delivery person called me from the restaurant and said they didn't have my order and that they had cancelled my order. The restaurant did not communicate this. They didn't contact me or Postmates about cancelling my order and I waited an entire hour to find this out. After working a 12 hour day at a festival it is pretty needless to say I was frustrated about this. I wouldn't recommend trying to get food from this place. Clearly, they do not care or pay attention to detail which makes me think it's very bad idea to eat in or order out from this location."}
{"text":"This establishment posts on their door that they are open until 3 am Friday nights, yet when we showed up at 1:45 am, they were closed and refused to serve us because they had been\"slow\" that night. If you're going to advertise a certain time, you should 100% honor that time.  I have a video of the establishment and workers i side not coming to the door, but the app won't let me post it. Hope this review helps. Never go at night."}
{"text":"Stopped as part of a Food De Tour and enjoyed the pizza. Wish is was crispy but it was still tasty.  Everyone seemed to enjoy it"}
{"text":"Very poor.  Not much taste to the pizza.  Bad crust.  Super soggy. My schweatty scrotum after a mountain bike ride in mid-July likely has a more palatable texture and aroma. Even with a Groupon this was not worth it.  I should have been paid to ingest this excrement. Never coming back."}
{"text":"It was good but not great.  Decent price, good location, good service, nice atmosphere but the food was average at best.  Overall disappointed because the food is the most important part."}
{"text":"Do not come to this location at the epicenter. The \"security\" they have is by far the worst I have come across. How do you have a neon sign that reads bright as day \"open\" but refuse to let someone in UNLESS they are a somewhat attractive woman with little to no clothing on. I've been coming to this location for years and have never experienced just behavior and customer service. I will NEVER spend another dime at this location and I advise you to do the same. It is bottom of the barrel. Go somewhere else.   Since I'm unable to comment on your input, Mike, I'll update my review. I was NOT involved in any altercation in the epicenter nor have I ever been. I'll assume this is your way of making your staff and establishment look better? Whatever the case is, you're wrong."}
{"text":"This pizza is ok - not bad, not great, just ok, when compared with most pizza places. I was first disappointed in the fact that they don't have an option for a healthier wheat crust option.  Then, we ordered a margherita pizza, and they cheaped out by not using real tomatoes, and just put dollops of tomato sauce where the tomatos should be!  For the $10 price tag on a small pizza with 4 slices - really good for 1-2 people, you can definitely do better elsewhere - such as Brixx."}
{"text":"So I'm visiting from out of town live on the west coast at my hotel and want a descent pizza. First thing hit yelp looking at reviews came across a lot of pretty good ones but on weekdays were closed at 9 pm Librettos is open till 11 pm I'm in!!!!  So I call ask if they deliver and yes they do, perfect. I order a large with my favorite toppings pepperoni, sausage (they have sweet or spicy) I got spicy, and bell peppers (theirs are red and green roasted) but I liked it. So I give them the address to the hotel.  20 min later pizza showed up hot and ready. Most places where I live in California take like 45 min so this was a plus. Pizza was great !!!!  Also when they delivered the pizza they brought paper plates and napkins. Guess they thought since I was staying in a hotel I might need them. And yup I did   Will for sure call them again next time in town"}
{"text":"Libretto, Libretto, Libretto...what is happening here buddy?  This particular location is just...hmmmm...how do I put it?  Disappointing.  It just doesn't have the same feel as the other locations.  It felt more grimy for some reason.  They were busy on Friday night, no doubt but they weren't slammed!  They were full.  However, it took about an hour to get our food.  One person only ordered a bowl of broccoli.  The waitress was nice enough to apologize and she even took off some of the price on our bill but what the heck was going on!??  Our white pizza was pretty good but our side of meatballs came out cold.  Pretty much ice cold.  Waters were never refilled and the kitchen just seemed totally disheveled.    I have always enjoyed Libretto's at every yelp event but going to the actual epicenter location was beyond disappointing.  I hope it was just an off night but it may be that they need to make a few adjustments."}
{"text":"What a disappointing visit, based on the service. I am frequent customer at their Park Road location and although the servers may be on the slow side they are above and beyond the Ballantyne staff, including the Manager. I arrived shortly after 12:00 and looking forward to the house salad, something I crave on a weekly basis and a good slice of pepperoni & mushroom pizza. Unlike the Park Road location you order at the counter here and they deliver your food to you. Upon placing my order I said I would be sitting outside. I waited over 20 minutes and walked inside and my slide was sitting there. Needless to say it was cold once delivered. I had a drink that sat empty for over 10 minutes so I, needless to say, walked inside to ask for a refill and was ignored by the server and the manager for over 10 minutes. By the time I got back outside the pizza was cold and I was very disappointed with the entire visit. I walked inside asked for a to go cup, which the Manager wasn't very thrilled about doing, and left. Needless to say, Libretto's does not have the greatest pizza, but I do enjoy the salads, but I will NOT be back to this location. So disappointing."}
{"text":"After visiting a few times and enjoying pizza by the slice, salads and whole pizzas, everything has been great.  The pizza has a great crust and the consistency of the food is one of the best I have seen in years.  I think the service, at times, can be a lttle rude/short, but overall a nice spot to check out for a quick lunch or a stop on a weekend for a pizza a drinks. I look forward to my next visit."}
{"text":"First time ordering. Made the mistake of ordering half pepperoni and then also selecting half pepperoni.  They called me with in a minute to confirm my order and if it was a mistake so that's a huge plus for me here.  We ordered the 18\" pepperoni and a 14\" basic cheese.  Both were very good NY style pizzas."}
{"text":"Very nice server. Definitely. The rest not so much. Food average at best. Ambiance? There really wasn't any. Was hot. No airflow. Musty smell. Wine poor quality (something you'd buy at Target for $5.99 for the big bottle) and at $8 a glass way overpriced. I will be surprised if this place is still open in three months."}
{"text":"It's a pizza joint - granted the cheese pizza (by the slice) was looking a little under baked during my recent visit AND my slice of margherita pizza was also nothing to write home about - I suppose my biggest gripe was service related.  I was there for a late lunch on a Saturday afternoon at about 2:30pm. Not exactly what one would considered \"peak\" hours. The place was empty, we ordered, ate and left. Then I ran into car issue in a parking garage, and of course as Murphy's Law had it (and its consistent plot against me), my phone was deader than dead. I crossed the street, went back to the restaurant, and kindly asked if I may please charge my phone. The \"host\" aka doorman passed the bucket to the \"man in charge.\" \"Man in charge\" then flat out told me NO due to management policy.  Look - I understand if it was 2am on a Friday/Saturday night, the place was packed with semi-drunk people, then of course they couldn't accomodate everyone's dead phone. However, it was 3pm on a Saturday, the place was virtually empty, and I JUST ate there. All I was needing was enough charge to get help for my car. Sadly I have had no problem charging my phone when I patronize a restaurant or bar in ANY CITY domestically or internationally. And here I was, in the middle of Queen City, a place we pride ourselves on \"Southern Hospitality,\" shame on you Libretto's.  So if you want a slice of subpar pizza uptown, help yourself. I personally prefer to spend my money at places where they can understand there are situations that may not fit \"Management Policy\" but is acceptable to extend a helping hand."}
{"text":"Went to Librettos yesterday for lunch with my roommate. Food was AMAZING. Authentic New York style pizza and Italian cuisine. We loved it an will definitely be visiting their new location on Park and Woodlawn next month."}
{"text":"really? This place doesn't make delivery meals until everyone in the restaurant is served. Why say you offer delivery then? Mind you, I only want a couple of veg sides and some soup - but they don't know that - BECAUSE THEY DON'T BOTHER TO ASK. The idiot answering the phone just assumes I want a fucking pizza calzone celebration or something else that will take an inordinate amount of time from their paying customers in the place. Wait...I would be paying too...hmmm...maybe they don't realize that? Dumbshits..."}
{"text":"Good pizza, open late but disappointed that they couldn't do wings or anything else late. Would definitely go back."}
{"text":"False advertisement have a menu on the wall outside staying everything but when u get in line only thing u can buy is pizza . I am very disappointed I won't be back"}
{"text":"I've lived in the area for six years. Not sure how long this restaurant had been here in Ballantyne, but finally tried it out last night. My husband and I ordered take out.  The food was good. I would like shine kind of sauce on the pasta. We ordered Chicken Marsala. And the sauce of the marsala. was good but the pasta could use a dressing. I would definitely go back and try the other items on the menu. The garlic knots write absolutely delicious. What a difference from having fresh garlic used to powder or seasoning as some other restaurants do.   I walked I to pick up our order and the place was smaller and not what I expected. Its relaxed and there's a bar that's nice for drink with friends or a date. I didn't find the bar area to be too loud as mentioned in another review. I would return. Maybe a date night why my husband soon."}
{"text":"I love this place!!!  I've eaten here alone twice on business trips and can't say enough great things. The staff is friendly but not sickening sweet, and the environment is perfect for a girl who normally feels weird eating by herself. The pizza is absolutely fantastic, and this is coming from someone who just at Lombardi's pizza in NYC less than a week ago. This crust is on the thin side and baked to perfection. The toppings are extremely fresh. I highly recommend the portobello mushrooms and kalamata olives. They also serve beer and wine. They are conveniently located in the Epicenter downtown which I love since I never rent a car in Charlotte. They offer both indoor and outdoor seating. My goal is to eat here every single time I get a chance to go to Charlotte. It's that good!!!"}
{"text":"Ordered a pizza here at 1:30 am. The told me it would be ready in 20 minutes. Upon trying to pick the pizza up, I was lost. Yelp/Apple/Google maps will not get you here. This place is located inside the Epicentre which means you need to physically walk into the Epicentre and get it. Its located next to the CVS on the ground floor, you wont miss it. This place is always extremely busy with a long wait. However if you order by phone you can skip straight to the front and pay. The pizza flavor was wonderful but the crust did not rise that much. The price was a bit pricey at 26 dollars with a large pizza and 3 toppings. Overall its a decent pizzaria and I would come back if i was in the area. Cheers!"}
{"text":"I expected better from Liberetto's but, ended up for unsatisfied than anything. We ordered a couple of pizzas here about a year back while we were partying it up at Howl at the Moon. Pizza was good but, was not worth the $40 spent.   Now fast forward to last week, we've been thinking about getting Liberettos since they had a cheese pizza deal that day for $11. I've never walked in for pick up before, but I was kind of grossed out.. The pizzas in the display glass, the single slices for order, were so nasty and dry! It looked like they were just chilling outside for the last 6 hours. I would never buy those slices, go with a full pizza to ensure freshness if you really want to try Liberetto's. I only ate a slice, I wasn't pleased.   If you want awesome NY style pizza, try Benny Pennello's next to the Heist Brewery.. wayyy better quality and prices there. Cheers!"}
{"text":"I usually really like Libretto's Pizza and this time was no different but the service lacked a lot to be desired. Most of the time we order the pizza to go and have always had good results. This time we stopped in to eat before going to a Disney show at TWC, we had 11 total in our party and the first 3 arrived before the rest and got us a table. So when we arrived with the rest of the group we already had a table but , it was right by the door. No big deal but we kept getting napkins flying off the table every time the door was opened. We all ordered at the same time and nothing fancy. two pizzas, two salads, two orders of Garlic knots, a sandwich, and 3 kids meal baskets. it took over 45 min. to get the piazza and the restaurant was not that busy. The beer was warm and we had to ask for a cold glass twice before it arrived. Overall it was good food but the experance suffered by the poor service."}
{"text":"I ordered the NY pizza with meatballs which was delish and the crust was perfect. It's the first place that I found that has the pizza I am use to having in NY which I've been missing since moving here. Free delivery was great."}
{"text":"My family has been going to this place since it first opened and we love it! It is not your authentic Italian feel, nor is it a nice quiet dinner. But it is good food and a friendly staff.   The white pizza is amazing (sorry to the other reviewer that did not like it). A quick call on the way home from work will ensure it is ready for you when you arrive to take home. The staff is very friendly and quick to respond to any need you may have.   Try the penne palermo. It is my standard if I am not in a pizza mood. The sausage and penne are topped with freshly cut mozzarella (delicious!)"}
{"text":"At first this place reminded me of NJ pizza But over and over I keep getting disappointed. Tonight we ordered wings ( frozen thrown into the fryer) mozzarella sticks ( cold pieces of rectangular hard cheese) and a large pie, 1/2 plain 1/2 sausage, mushroom and onion.  The onions were raw thrown on top, I think I may have counted 4 bits of mushrooms total and it was over loaded by slices of sausage ( not ground what is what Were use to in NJ) and the overall crust was soggy! and all this was almost 50.00!!!!! Seriously!!!  I wanted to like this place, but this is my last time ordering from them or going to the restaurant."}
{"text":"Yes, I know it's Christmas. Yes, I know that there are Christmas Parties all over the place so when we wen to Libretto's we found that we had to sit in the bar (which is fine) because the dining area was being used for a party. But when you eat in the bar the food comes as if you were eating in the bar. No bread with dinner, appetizers coming out with the for (yes, these are not a big deal, but they are really nice for dinner.) It was just a very odd experience. The calamari wasn't done, the soup was wrong, the grilled shrimp added to the pasta was not added and then brought later at full price. I am so sorry but these simple things do add up."}
{"text":"For delivery this place is great. The chicken Parma pizza is awesome."}
{"text":"Maybe I should have checked the reviews first and picked their most popular items, but we decided to give this place a try ( mainly because we could order through PayPal).  First off, the staff was nice. They checked on us and updated us on the status of our order. It looked as though the pizza was really good so I really regret not getting that instead. The garlic knots that we got were delicious!  As for our food, my fiancé ordered the shrimp scampi and I ordered the Rigatoni al Verde. Aside from the fact that both of our dishes are in desperate need of seasoning ( salt, pepper, garlic...SOMETHING), they were swimming in broth that I had to strain out. Unseasoned broth, at that. His scampi pretty much just looked like they threw some spaghetti in the container, sautéed some diced tomato and shrimp and tossed it on top. No garlic, parsley, white wine, butter. Nothing. My rigatoni, broccoli and chicken were all over cooked and not seasoned. The description says that there's garlic in it but I didn't see or taste any.  I'm so disappointed that I wasted my money on food that resembles a hospital cafeteria's version of \"Italian food.\"   We may come back for the pizza, but we're steering clear of the pasta.  The two stars are for the service...and the garlic knots."}
{"text":"This isn't the dirty martini talking, it's me, P, I mean Pourina. I've had many opportunities to frequent Librettos, ahem both of me; The \"don't feed after midnight\" Gremlin and soft spoken, professional Gizmo on weekdays.   While the Gremlin devours just about anything after midnight, Librettos seems to be the most frequent haven for the calamity, mischief, and ruckus lurking after a nauseating (and it's not 'cause of the drinks) good time at Suite. In this current state, the beast in me would have given it a full five stars, but I'm a horrible drunk texter/yelper. So lets wait until I no longer mix up my Os with my Ss.   Black out, wake up a 12 hours later and I've returned my my normal self...I think.  Why am I naked? Wait, did I have Librettos last night? Cuz I'm craving pizza.   Returning to Librettos during the day is a battle in itself. Not only does the rational me not want to pay for parking at the Epicentre, but paying for parking to have a cheap lunch of $3 sliced pizza? That makes a whole lot of sense. I must still have some Gremlin lurking in me. I must still be drunk.   During the daylight hours it looks strangely familiar, yet as foreign as my native country. To my surprise Librettos has waitresses. Servers and hostesses? Really? You mean, I don't order at the counter and wait for my pie? (Which for the record is FASTER than sitting down and having a waitress take your order of sliced pizza). Yep, I'm still drunk.   I haven't and won't order anything else from the menu, but I can assure you, the pizza here will satisfy any monster.   Gizmo's tip: Heat up cold Libretto's pizza on a big skillet to recreate that crispy hot crust (if it fits). Just don't do it in your Gremlin state, you might hurt yourself."}
{"text":"We had a weekday lunch with two adults and two kids, one being a toddler.  The server was super nice, especially with the kids.  Our son is a talker and she was very patient with him.  My husband and the kids had slices and all three enjoyed them.  The slices were very big, more than enough for the kids, while my husband had 2, just to try 2 toppings.  I had a taste of the pepperoni slices and it was really good.  Plenty of cheese and sauce but not sloppy.  I had the salad and hero lunch.  Caeser salad was good, just how you'd want a small salad to be.  Dressing just right, greens not wilty or nasty and a good size.  For the sandwich I had the eggplant parm hero.  So good!  Lightly breaded eggplant slices (and plenty of them) just right sauce and cheese and good bread.  They did a steady business on walk in slice sales!   I would definitely eat here again."}
{"text":"We enjoy popping in here for Pizza. Small spot, but good solid pizza. If you are looking for a nice, small spot to grab a relatively inexpensive meal, this is a great little place."}
{"text":"Piss poor experience. I was seated and nobody came by to serve me. I've never been ignored at a restaurant before.  I waited 15 minutes."}
{"text":"Had a very disappointing experience with the EpiCenter location. Placed order at 4:30PM and received an email confirmation. After an hour and fifteen minutes of waiting I called to check on status of order. The associate who answered the phone informed me that the order was out for delivery. After an additional hour of waiting I called again, this time I was placed on hold only to be hung up on minutes later. The third call I asked to speak to the manager. He looked up my order and said they received it through their online service but that it was not printed out and therefore the order was never made. He assured me he would get it in system immediately and expedite it. Another hour has passed and no order has been delivered. In summary, this is the worse customer service experience I have had. The food is average at best but certain never worth a 4 hour wait. Save yourself some time and order from some place else."}
{"text":"Had dinner here the other night.  It was a Friday... so I expected this place to have a crowd, but apparently we lucked out and it wasn't all that busy.  Was looking to carb-up on pasta and definitely got my fix in.  Our server was nice enough, but there were a couple times where we were looking for her.  Not a big deal, but I would see it as an issue if we were in a rush - and I could understand if the place was slammed, but we were surrounded by empty tables.  Ordered the stuffed mushrooms - wasn't disappointed here.  Pre-entree salads weren't overly dressed and our entrees were definitely ginormous portion-sized.  I cut it in half and took a box home for another meal.  Whoops - almost forgot.  Penne alla vodka with grilled chicken.  Hard to mess up, but it was decent.  Overall, I would say this place was okay.  I would probably come back for the casual atmosphere and the \"non-crowd\" factor - a great option for dinner if you are craving some Italian.  I'm sure there are other, more popular, Italian spots in the area that would steal your attention away from Libretto's."}
{"text":"Great pizza! I've had Libretto's Lasagna before but just recently had their pizza.  They are definitely one of the better pizza places in town (and I'm a pizza snob).  Lots of toppings, great sauce, dough is cooked well and golden brown.  Reminds me of pizza places up north!   Oh, did I mention their lasagna is really good here too?"}
{"text":"I stopped in here for lunch the day after Thanksgiving.  I was greeted immediately and opted to sit at the bar.  The bar is off to the left side.  It overlooks a large outdoor seating area and has 2 garage doors that can be opened when the weather is warmer.    The bartender was pleasant and knowledgeable.  I asked what kind of local drafts they had and they actually had quite a selection from OMB, NoDa, Triple C and Birdsong.    For the menu, they have several lunch specials a decent prices. I went with a slice of pizza and a salad with their house dressing.   The dressing was interesting.  It was a spicy balsamic vinagrette.  The salad was in a small bowl and was basically a punch of fluffed up greens with shaved parm on top.  It would have been easier to eat and more presentable on a small salad plate.  The pizza slice was large and tasted decent.  I wish it came with more sauce though.  Overall, decent place.  I enjoyed sitting at the bar.  Pizza is decent - not the best but certainly better than many other places.  I will come back here once in a while."}
{"text":"Worst, most bland pizza *ever* - we couldn't have been more disappointed.  In a competitive market like this,  find another pizza place ~"}
{"text":"Didn't really get to see about waiter service because apparently they close at 11 not 10 and but they let us order food to-go and even let us take an extra pepperoni pizza they were just going to throw away. They were extremely friendly for a to-go order though :) Monday special large cheese pizza and garlic knots $10.95!!!!"}
{"text":"UPDATE: After my last review Mike (owner) reached out to me to address the issues we had been having with Libretto's delivery service and asked that we give them another try.  I was skeptical and at first was not interested, however Mike reached back out a few months later letting me know the offer to make it right was still on the table. I'm glad I took him up on it - Libretto's is still, in my opinion, the best pizza delivery option in Charlotte when they get the actual 'delivery' portion right.  Our latest order arrived on time (actually a little earlier than we expected), was correct and was still hot. I hope this is a sign for the future!  As of now we are customers again."}
{"text":"Strolled in and took a seat at the bar... the rest was history!   Libretto's gave me the perfect hometown feel with a good beer and some wings to close out my day. John (bartender) was super sweet and made sure I was made aware of the kitchen preparing to close so I could get my order in! Man oh man... honey chipotle wings are my new favorite from this place. And since it's not too far from me, they ALWAYS offer a special of some sort and the food was good... you'll catch me at the bar (or outside, how bout dat! Lol)."}
{"text":"Libretto's is a good choice for an uptown slice.  They use quality ingredients, the crust is appropriately thin and crispy, toppings are top notch and, there is a nice variety vs. the usual, cheese or pepperoni at some places.  One thing that gives them the edge on Fuel is that they actually place there slices on the oven floor to heat up vs on a tray running through a conveyor belt oven contraption.  The result is a much crisper crust when you get to the biting.  Really, I'd give 4 stars for the food but the 3 comes from the fact that you get the stink eye from some of the team when you order a couple slices and then sit at a table to eat it.  I would get it if the joint was packed but, when there are 8 empty tables around you and nobody waiting, what's the big deal?  One guy behind the counter seems particularly  grumpy on certain days.  Hungover perhaps?  He kind of has the face I get when in that state.  He is balanced out however by the woman with the braided pony tail.  She has the kindest eyes and warmest smile I've seen in a while and its appreciated."}
