{"text":"I could eat lunch here everyday for the rest of my life, and I am probably well on my way to doing just that. I was not sure to just review the carts individually, but like the Madison Farmers Market, I believe the whole collection of vendors is part of the experience. 

The food carts are all placed on the space between the Library and the University Bookstore. Lunch in an outdoor setting and fantastic people watching, occasionally even music. One of the best days I had last summer was accidentally coming across a mariachi band while hunting for lunch.

And I never tire of the food. I can sample a new meal each day without trouble. By the time I go through everything available, a new cart is usually up and running and testing out the waters.

The longest lines are always at Buraka, Jamerica, and Sukhothai (when they are there). Which is fine, because I can get lunch quickly at my favorites the Local Stanley or FIB's. FIB's used to serve a meatball sandwich with balls the size of oranges. They've reduced them to the size of golf balls, which makes lunch slightly disappointing but is probably better for my arteries.

Be warned, currently the Library Mall has gaping hole across most of it where water main work is being done. And campus construction projects always last a long time, making a crowded space far more crowded."}
{"text":"I'm a big fan of FIB'S - Fine Italian Beef.  The food is great and the cart brings back memories of time spent in Chicago.  The meatball sub is the best I've ever had and a fellow worker, who's a professed chili hot dog expert says that FIB'S chili dog is the best she's had.

I recently found out that the owner of the cart donates to local homeless shelters quite often.  Wonderful !"}
{"text":"The new Library Mall isn't all that different from when I was a student, but I'm excited for all the kids who finally know what the mystery object under the metal cone is - it's a fountain! Classes of UW students have graduated without ever seeing it, and when the weather warms up they can finally enjoy food cart heaven with a lovely water feature view. 

Lighting is significantly brighter at night now, and the little standing tables they've installed are great for when you want to enjoy your food cart fare without having to balance it on your own lap. 

In the evenings you might happen across a drum circle, fire dancers, or passionate students gathering for their cause of choice. It's a convenient way to cut through campus, connecting the Memorial Union to Memorial Library and out through to the southeast dorms and State Street. If you've spent any significant amount of time on campus, you've also likely spent a significant amount of time walking through library mall. Looking forward to the grass regrowing as the lawn is a nice spot for catching some midday sunshine!"}
{"text":"The newly renovated library mall area is a great space for people to hang out and enjoy entertainment, sit during a food cart meal or just to people watch. Most days, there's a large selection of food carts lining the side of the mall area. The city takes a lot of care in sourcing the carts that occupy certain areas in Madison. This provides patrons with lots of variety to choose from. Every person in your group could have a different cultural food experience. The food cart food in Madison is really top notch. The sourcing of the ingredients and the care put into the food is apparent. Sometimes the lines get a bit long. But with some patience, I'm sure you'll be impressed by the offerings available. This is a great way to sample many types of foods too. Two of my favorites are the fresh spring rolls (ginormous!) and the fruit smoothies! The library mall space is quite large and is great for musical events. There's lots of places for people to casually take in the music and the beautiful surroundings. The buildings are a mix of old and new and give you a glimpse into the age of the campus, but also foreshadows where campus is going."}
{"text":"Fun places abound in Madison, Wisconsin and this is one of them. Unfortunately, the day I was here was out of season ant a holiday, so no food trucks. Normally it's loaded with choices and a great place to grab a bite to eat and hang with friends.

In the summer it's known as one of the largest open market spaces in America."}
{"text":"Very beautiful area with 8+ food trucks during the lunch rush and lots of benches to enjoy your food on! Surrounded by lovely gothic architecture to look at and tall trees providing shade....it can be a really serene place to relax. Of course sometimes there are events going on here and a random hardcore religious advocate shouting at the crowd."}
{"text":"Such a great place to get a variety of food at an affordable price.  It's a great atmosphere, especially in the summer.  There's so much great ethnic food.  I would recommend Caracas Empanadas, Banzo, and the Korean Taco food stand.  Their used to be a Healthy Mexican Food truck but haven't seen it recently.  However, if it's around thru have great tamales."}
