{"text":"Unfortunately, this location is now closed as is the one at Bovaird and Hwy 10.  The space is cleared and signage is removed.  The closest Lick's is way down at Eglinton and Hwy 10 in Mississauga."}
{"text":"Since I've begun my Burgasm tour, I've had a few people recommend Licks to me, as an apparent Fast Food Frontrunner for ecstacy on a bun goodness, so I finally got to check them out.  The place is standard fast food territory. Clean interior, polite staff, and slightly higher than the norm prices.  I opted for a single \"Homeburger\" without cheese, and was rather alarmed to see how quickly it was prepared for me. Surely the supposed top dog in the Fast Food world would have taken additional time to cook my burger to perfection, no? Anyone? Bueller?  Having enough of speculation, I broke the burger free from its wrapper-encasement, and was very pleased with how it looked. A nice, large, and fresh sesame-seed bun, and the patty was no slouch in the thickness department.  Perfectly cooked! I'm not really sure what kind of stuff Licks puts on their burgers, but it gave it an unidentifiable...zing. I'm not sure if it works during consumption, but it certainly makes for a great aftertaste.   Not the best burger I've had on the tour by a longshot, but it was not the victim of overhype, and ended up being a very tasty burger. I will most definitely return to tinker further with this fast food gem."}
{"text":"For a fast food burger Lick's kills.  The veggie burger is one of the best around.  The portions are huge and the restaurant is very clean."}
{"text":"I thought only Harvey's could provide me with my soy-veggie-grilled-burger-in-a-non-BBQ-season fix but hey apparently there are other options!!!!  The nature burger is AWESOME have had it twice now with the tsaziki (sp?) and feta sauce (boo that you have to pay .99 extra for that) but its sooo worth it.  Both fries and onion rings are a good option to get in a combo. I did try their poutine once, however, I was saddened by the fact that despite how delicious it was, they used shredded mozza/cheddar chese instead of real cheese curds. Hence the minus 1 star  Overall, don't order the poutine, order the burger you won't be disappointed. Pricey? yes but I'd rather pay $10 than $8 and get a bigger & better burger =)"}
