{"text":"Great little pizza joint! Great location, very friendly staff? I highly recommend it!"}
{"text":"They always have great deals on pizza. I usually get 2 slices and a drink for  $5 for lunch. I'm not a big cheese pizza person but I get theirs. The sauce actually is very flavorful, unlike retail chains. The slices are massive as well. It's by far the best new York style pizza I've had outside of new york. Definitely check them out, it's worth it."}
{"text":"The Wife and I ate at Life of Pie and were very pleased. The garlic knots and the large pie were scrumptious! Recommended and will be back."}
{"text":"Just had the Pizza Soup. It was DEVINE!! Tasted just like a supreme pizza. Fresh veggies, sausage, and pepperoni. Was served with two fresh garlic knots. They weren't loaded with garlic either! I drive by this place everyday after work and have always wanted to try it. Definitely glad that I did. Prices are reasonable and fair. Employees are friendly and overall just a great atmosphere."}
{"text":"Pizza that hit the spot. Very friendly staff and fresh pizza. They had a lunch special of 2 slices of pizza and a drink for only $5+tax which was a good deal. Parking is kind of difficult because it's downtown and most spots on the street are taken.  This space used to be occupied by a hotdog joint but Life of Pie beats the heck out of here."}
{"text":"I think this is an excellent pizza place. The inside is a little tight but this is more of a take out type of joint. Service is always friendly and professional. If you have to wait they'll have nextlix on and when we went they even let us pick what we wanted to watch, which I thought was pretty cool.

The pizza is damn good. My wife is funny about where she gets her pizza but loves this place. I've had it 3 or 4 times and have never been disappointed. 

I'd recommend it and I will be back."}
{"text":"The Pizza is awesome! Prepare to bring extra patience though, we walked in just before what seemed to become a packed house, and it seems like we were the last to get our pizza. This could be for several reasons like call in's or complexity of our pizza order, but I have become accustomed to first in first out. Saying that, I will say this was the best pizza that I have found in Gaston County. Just be prepared with patience and a willingness to change your order if they are out of ham."}
{"text":"Good homemade flavorful crust, not to thin.  White sauce is creamy and lots of options.  Cute casual atmosphere and the owner is very friendly and passoniate about preparing good quality pies.  Nice find in downtown Gastonia."}
{"text":"This is the most amazing pizza I've ever had
All ingredients are fresh every day 
Prices are great"}
{"text":"One star is too high of a mark for this place. Nasty and bland for pizza. Inside not very clean and sanitation rating was barely an A."}
{"text":"I had such high hopes for this place.  It looked like a pizza store in would find in little Italy so I was excited to try it out.  They have a very relaxed environment which is at the expense of efficiency, which to some may not be a problem at all as long as you are prepared for that.  It doesn't look like they would be okay with call in orders.  No website but they use squire for credit card processing.  

Ultimately it's about the food, right?  The Food was just OK, I have never been to Italy but I spent many years in NYC and this is not NYC pizza, the sauce was more like a paste with no seasoning to I could taste.  I had a Stromboli and it was just OK.  Not likely to visit again but as they get better hopefully I would love to try them again."}
{"text":"Pizza is way too greasy and they are very rude last time I went in with my 3 daughters and ask what kind of pizza do you have they told me to look on the board I then stated I couldn't see bc I don't have any glasses they still didn't tell me what kina of pizza just looked at me as if I'm stupid or sum so I would never come back in this dump and the pizza is not even all that for the attitude the pizza is so greasy it goes thru the white paper and the box papa johns or lil Caesar is wayyyy better I don't get why ppl want to have jobs and be all rude like I rather make my own pizza FOR MY KIDS THEN TO BE MISTREATED IN FRONT OF MY KIDS"}
{"text":"Have been there a few times.   About 1/2 the time the pizza is cold when I get home.   This time I told them what time I would be there so the pizza would be done and hot about the time I got there.    They made it ahead of time and put it in the red carrier.  Cold when I got home.    Called and told them about it.   They did not care that I was unhappy and it was my fault.

I would advise to go to a small business that appreciates your being a customer."}
{"text":"I'm usually a large supporter of local businesses, however, my recent take-out visit disappointed me.  I'm glad that LoPP takes creative spins on classic Italian favorites, but they seemed to fall short. The sun dried tomato paste upon my cheese pizza was not only salty, but it took some getting used to.  The top of this pizza pie was overly toasted, while the bottom was under toasted.  In addition, my pepperoni calzone was HUGE in size, its dough also seemed a bit under cooked and its inside was a bit too greasy.  In the end, I'm not sure either item agreed with me.  I look forward to LoPP again, perhaps in-person for a better experience."}
{"text":"I drove by this place several times. It looks cute. I called in a carry out order for one...the phone experience should have sent me running...but I placed my order. Stromboli.....comes with only cheese. What?  Never heard of this but paid extra to give this place a shot. Stromboli here equals a rolled up pizza crust....bad.  Your dipping sauce is enough for a tenth of what you're served. Overall waste of money.  Don't go."}
{"text":"Best pizza in town!
Self made dough!
Very recommendable and nice young chef as well."}
{"text":"This was our first visit to this place and the pizza was awesome!  The owner was there and he was super nice and he went out of his way to make sure we enjoyed the pizza and our time there.  We will definitely be back again!"}
{"text":"Clearly all the reviews are from locals who have never had decent pizza outside of Gastonia. Way too greasy. My husband tried the philly slice and he refused to finish it. Mush on top of mush with no flavor. For the sake of this place I hope we caught it on a down day."}
{"text":"A quick intro to my love of pizza. I ran a pizza blog for years where I traveled & wrote articles on pizza places, worked at an award winning pizza place in Ogden, Utah, sold pizza ovens, and really just fucking love pizza. 

I had been eyeing this place for awhile, locally owned spots are normally better than chains. So today I had limited time, and knew that the pizza someone brought in last week, looked like some bomb ass pizza, so I ran over.

I was acknowledged right away by both employees. It's super small on the inside so if they didn't it would have been slightly awkward. They were friendly, and busy making pies. I waited for them to finish as I looked over the menu. 

The atmosphere was casual. Some cool sayings on the wall. A small fridge with canned beverages, waters, and Capri sun for the kids. 

Beware,  there is limited seating in the dining area. However, there are some seats outside too. 

Like I said, I needed something quick so I asked if there was pre-made slices. The girl pointed to two pizzas sitting above a toppings bar. They both looked well done, so I picked the lesser cooked option. She told me I could put any toppings on it, which was cool but I didn't wanna add any extra time to this adventure so I just took the cheese. 

 My pizza was popped in some sort of heating device that really over did it. 

After about 5 minutes of waiting, and watching a delicious looking pizza being eaten by a family dining in, I was handed a small box with my slice in it. 
 
Now, I appreciate the point of this box, however, I see this as a wasted expense for the owner. I would have been happy to have it on a paper plate. That's how slices have normally been given to me. Just saying, save your boxes!! I felt kinda bad using it on one slice. 

I got to my car, dining area, and got out of my terrible parallel parking job, and chowed down on my slice.

Also, prices aren't bad 5 bucks for a slice and a can isn't bad at all. 

The reason for three stars, which I will hopefully be changing soon, because I will go back, is that my pizza was over cooked to start, and then over over cooked & given to me. 

The crust was thin, and kinda greasy, but still good.  I couldn't really taste any sauce, the flavor of cheese, & burnt over powered everything else. No fear, red pepper flakes & Parmesan packets churched it up real nice. Overall it was one of the better overcooked slices of pizza that I've tried. 

I think I came at an off time, and happened to get two pizzas I would have prolly not served, or at least not re-heated as much. I don't know how they cook the pizzas, but if it's done on brick it could have made them a little darker.

Either way I'll be back to give them another chance."}
{"text":"Great spot for lunch with outside dining. 5 bucks for two large slices and beverage!  I go at least once a week and haven't been disappointed"}
{"text":"Reminds me of being in Asheville or Portland.   Has an artsy kitchy atmosphere that's fun and hip.   Pizza was very affordable.  I got 2 slices and a drink for $5!  And these aren't puny slices, they are like face size slices!  Pizza was packed full of flavor and cooked to perfection. The staff was friendly and helpful. This place is packed full of personality!!"}
{"text":"IT IS AMAZING!! best pizza around and very very affordable. We stop here on the way home from kings mountain for pizza."}
{"text":"Cute quint place, great food, great service, the room has a lot of character to it! Supports local artists! In a fun part of town."}
{"text":"Delicious thin-crust pizza along the lines of Luigi's in Charlotte.  Good stuff!"}
{"text":"The pizza was good! We took it home and I bet it would have been 'great'  if we had it while we were there but the inside is small and quiet. We will definitely be back!"}
{"text":"This cute little pizza place in downtown Gastonia offers surprisingly filling thin crust pies and friendly service! You can order a whole pie, calzone or stromboli with a variety of toppings or choose from their slices available for a quick meal. Several salads and garlic knots are also on the menu, though I personally felt the knots could have been more garlicky but that's just how I like them. Vegetarian choices are easy to come by, as tends to be the case in pizza places, but vegans will have a more difficult time; if you're actually gluten-free because of medical necessity and not just voluntarily gluten-special, a place that will have flour particles everywhere probably isn't the place for a safe meal anyway. Life of Pie is small but manages not to feel cramped, the staff are warm and helpful, and the music was great - definitely a place I'd try again next time!"}
{"text":"Just got a large pizza from there and omg is it good! Sinfully good! The staff was also super friendly and the atmosphere is very nice as well! A must try on my list of \"to die for\" !"}
{"text":"After just one trip here I told my husband this is our new to-go pizza place. The service was excellent with the owner helping me through the menu. The atmosphere is very unique with local art and the TV inside is hooked up to Netflix (which is definitely a plus). Even though it was a Friday night it was quiet with not a lot of people sitting down to eat. There was a lot of foot traffic though with people ordering take out. The pizza was more of a thin crust, but not crispy, more of the chewy style. I was very satisfied with the entire experience and can't see any other chain pizza place being able to compare."}
