{"text":"The vegan scene here in Pittsburgh is awesome; I'm really glad that Liliput Coffee and Cafe is near the Pitt campus! Here, I had tempeh for the first time. Totally recommend the Reuben! A little sweet and smoky, I would totally get it again. Paired with the salty tortilla chips, I really enjoyed this meal for dinner. On other occasions I've gotten some Onion Maiden sweets without having to make the drive to Onion Maiden (so convenient and always delicious). Their onion and walnut vegan scones are a MUST if you see them out on the counter! Worth every penny.

4 stars instead of 5 because sometimes the cashiers are absent from the front and I will see people waiting 5 minutes just to be seen. One time, the only cashier present went outside to smoke. If it weren't for the awesome flavors and good prices, I'm not sure that new customers would stay. Since I've seen both the types of cashiers, slow versus quick, I'm still willing to come back. Excellent place and have already recommended to many friends. 4 stars."}
{"text":"Going here for lunch on a pretty regular basis. Recently I've been indulging in a split salad of lentil and kale; DELICIOUS. Pairing it up with a Mindcure (fizz coffee, 2 shots espresso and cream) and I'm in lunchtime heaven. Going to start heading there for breakfast more often. I've had the breakfast burrito and it is HUGE. And extremely tasty. This is easily becoming a staple cafe for me."}
{"text":"Call before you go - once I tried to come here and they had decided to close at 3pm randomly. I was sad, because I'd been looking forward to it. My other attempts were successful, though!

The drink menu has a lot of variety. My favorite is the golden milk, which they do better than most places (it's a super trendy item). My least favorite was this apple cider vinegar tea drink - it had lemon-black tea, vinegar, and a dose of cayenne pepper. I love sour stuff, but that was heartburn in a mug. I could not finish it.

Food-wise I am still exploring the menu. The highlight for me right now is the tempeh reuben - they do a really good sauerkraut and thousand island - I didn't miss the corned beef at all.

I've never had a problem getting a table to do some work. I'll definitely be back again soon."}
{"text":"Cafe Liliput reminds me of those vegetairan friend's parties I used to attend and took a vegetarian dish to. But those people never brought a meat dish to my parties.

Food is decent and unique.

Coffee is good too, but If you want a decent pastry to go with that coffee, you'll have to bring it yourself. The in-house pastries are made by a vegan bakery who doesn't understand why butter is important."}
{"text":"This is a lovely breakaway from the original Lili Cafe in nearby Polish Hill, with a lot of the same tasty, creative, vegetarian/vegan-friendly food. My personal favorite is the breakfast burrito. Grab coffee, breakfast, lunch, or even a light dinner--it's perfect for anything. And alongside the delicious food is local artwork and beautiful plants, making Liliput the perfect place to relax and fuel up."}
{"text":"My first time! Thankfully a friend familiar with Liliput drove as I definitely would not have been able to find my way there from Pitt's campus! They have a small private parking lot across the street though, so that is very helpful. 

It is a cute little cafe with a good variety of veg options. Some items had the option for regular cheese or vegan cheese. I got the avocado tempeh sandwich. It was very good, came served with pickles and tortilla chips. My friend commented on how hungry I must have been because I ate every last bite, haha! The sandwich was very good and I must say that I do not have a vegan diet 100% of the time. So I can definitely see non veg's enjoying any of the meals from here. 

Did not get 5 stars because my avocado sandwich barely had any avocado on it. And the two staff members were not very welcoming. 

They did have awesome BLM bracelets for sale, however, so that earns them another point, just not a Yelp point..... 

Will definitely go back!"}
{"text":"This is honestly everything I've been looking for. Great for breakfast and lunch, good coffee, good prices, and plenty of seating if I wanted to do some work. The food is absolutely delicious with everything vegan+vegetarian friendly! Their tempeh is so tasty and on point. Good atmosphere and cool people at an unexpected but convenient location with plenty of parking nearby. I'll be back often!!"}
{"text":"I've actually been in Pittsburgh Filmmakers so many times but I never realized that there was a legit cafe with legit food in there... I thought they just did hot drinks!! I came here today anticipating trying their veggie Banh Mi but unfortunately they were all out. But I tried their lox sandwich, which was suuuuper delicious! It's a pretty decent size and it's super flavorful and fresh, comes with a side of tortilla chips and a pickle.

They also have assorted baked goods sitting on the counter by the register and I couldn't help but notice the delicious looking hand pie that they had put... I'm not exactly sure what was in it but it was super delicious and I do not regret my impulse purchase at all.

Honestly, the food here has me super impressed! It's really good... I'll be stopping by here more often to try more of the things on their menu. I had to physically stop myself from buying all the scones they had out. It all is so pretty. The service was really good and they were really polite and patient with me while I decided what I wanted!"}
{"text":"Liliput is a great addition to Oakland! They offer a nice variety of breakfast/lunch options and my personal fave is the Tempeh Reuben with vegan cheese. They make the sandwich fresh and hot, and the price is just right. I'm also partial to the Black Bean Chili, filling and cruelty-free. Liliput offers a full coffee menu, as well as a variety of teas. 

Located in the lobby of Filmmakers, it's a bit of walk from the central part of Pitt's campus, but parking there is fairly easy whether on the street or in their private lot. There is a good amount of seating, but it can fill up quick during busy times. I typically get my food to-go.

I'm glad Liliput made a home here. I've even been known to stop here twice in one day, for lunch and also to grab a light dinner."}
