{"text":"AMAZING  atmosphere. Great staff. And best of all very good sheesha. If you're looking for a great chill place to relax with friends and have snacks drinks and a good smoke, LimeLite is a must try."}
{"text":"We just got back after a amazing evening at the Limelight cafe.The food was better than average.The service a bit on the slow side,but the place was packed so that could be the reason for slight delay in getting our order.They had a live band who were great in interaction with their audience.Later in the evening,there was a belly dancer amusing the crowd.All in all,a great evening and I will ask everyone to check them out.Don't forget the Shisha."}
{"text":"Found this hidden gem the other day. The ambience is great. The space is open and spread out. We walked in at around 7:30pm and were the only ones in there. We seated ourselves and someone had come to our table to greet us within the minute with menus. The menu had quite a few interesting selections and wasn't over done. We ordered the Burger, steak and kabab roll. For drinks we got a mint lemonade and strawberry daiquiri(mocktails) the mint lemonade was good and refreshing. We've had them at other places but this one was different and different in a good way. Then came out the food. The Kabab roll was on point! They had the kabab wrapped in a paratha (layered roti) instead of the naan. The kabab roll was a smaller snack serving but the taste was phenomenal. It had the right kick of spice and was not over done with condiments. Next the Angus Beef steak which was accompanied with caramelized onions and cream of mushroom sauce. The steak was done medium well as per order and was cooked right. It was seasoned right and we loved the cream of mushroom sauce! No it wasn't from a can it was definitely made in house. Overall loved the food the ambience. People started to trickle in at 8:30. The server did tell us that it gets busy after 9pm. Oh yes they have sheesha as well. Our sheesha was packed well and the house special AA special we got was real good!!! We'll definitely be going back again soon."}
{"text":"His place is awesome. Amazing atmosphere and nice to chill and hang out. Great music and sometimes Live entertainment"}
{"text":"Excellent Service and Food! Very friendly staff! Great place to hang out with your family or friends!"}
{"text":"The location may not be great because its a little out of nowhere, but its still worth going. 

The ambiance was great, uniquely decorated, you can tell some thought went into planning it. They have a stage with live music and also weekly karaoke! I would suggest calling ahead to find out when these things happen because i cant remember right now but they do get quite busy.

For food I had the steak which was reasonably priced and also flavorful. I wouldn't say its the best steak iv had but again this isn't a steakhouse so for what it is it was really good. It came with this mushroom sauce which was sooo tasty. 

Also had the kabab rolls which were inspired from pakistan and had so much flavor and kick i just loved it going to go back for some. 

They have a good selection of drinks as well. and the sheesha was smooth and good!"}
{"text":"Amazing food excellent service. Very relaxing atmosphere . If your looking for a place to relax with your friends limelite is the place for you"}
{"text":"Amazing food. Great service a very relaxing atmosphere. Usually I don't write review but this Resturant really deserves 5 stars! Hope they keep there standard the same."}
{"text":"This is amazing place for hookah lovers! They carry modern hookahs, premium Fumari shisha and coco coals. Food is very good and reasonably priced. Service is grear and owner personally greated us which was a nice touch. I just worry that this place will be packed once the rumor spreads about this place ;)"}
{"text":"Came here multiple times, I don't smoke Shisha so this review is just on the food, customer service is slow, on busy nights they have some rule that you can't have just shisha without a meal and need to spend a min. $ per person which is weird
Nachos: Chips were chewy and cheese was not melted
Funtastic Feast: Everything was mediocre except chicken fritters and samosas
Pasta with Rose Sauce: OMG so awful i couldn't eve finish it
Burger: passable
Desserts are just okay, a little pricey for what you get

The only thing that blew me away was the STEAK ($27), it was unexpectedly tender and the sauce it came with was amazing!!

I heard of this place from Halal websites, when I went they said they were halal and their website says \"We provide 100% halal meats\""}
{"text":"Great Shisha, amazing food and wonderful service. 
The server we got was super nice and checked up on us many times through our visit. He made sure the Shisha was just perfect for us. The food was great and definitely the best ribs I've ever had!
Suggested this place to numerous family and friends who come to Limelite every weekend now!
Looking forward to visiting their new location!"}
{"text":"Amazing service, very nice workers. Hands down best shisha lounge I've been to. Definitely recommend"}
{"text":"Amazing food , excellent service , friendly atmosphere . I ordered beef burger and my friend got steak , absolutely loved the food . Don't forget  to take a look at the desserts !!!! Brownie explosion is highly recommended ."}
{"text":"Great service. We were 20+ people. All food and drinks were amazing. The roll kabab and beef roll were the best"}
{"text":"Went there for the first time today due to a recommendation from a friend. By far the best shisha lounge I have been to, with the best burger and fries combo I've had locally. I live in the Willowdale area and therefore have a bunch of options when it comes to shisha, but decide to go a bit out of my way to check this place out. Shisha was reasonably priced and all of our flavours tasted awesome. Service was really good (servers constantly checked up on us and made sure everything was fine). The place looked really nice/clean and they had a bowl of free charcoal. Would really recommend the place."}
