{"text":"A tiny little shop in the corner of the plaza. Makes amazing baozi with a variety of stuffings! They also have Northern Chinese style congee and soy milk to wash it down with. We drive over an hour there for them sometimes. On most weekends, you might also be able to get liangpi if you get there early enough."}
{"text":"Simple and Easy, this is the restaurant in the nut shell, this place has been around for ages. and they do 2 things well, Buns and chili oil beef cold dish. The Chili oil for the beef cold dish is perhaps the best thing here. it is flavorful and not too spicy, and feels perfect with the beef. The Buns are fairly big size, and will be a good lunch for most people. The fried bun on the other hand is not very good, it is definitely not one expects when they order it, and i would say stick to the steamed bun. the Pickled cabbage pork bun and spicy beef bun are recommended."}
{"text":"Driving into the plaza around 4:30pm or so, I felt snack craving or maybe the Night Market @Metro was warping my brain.  Lots of selection but as for SMALL portion snackin', I looked at Lin's Chinese Bun knowing that it should be affordable snackin'.  I walked in to this 5-6 table mini-shop to see 2 tables of patrons but to my surprise they were eating anything but Chinese BUN.  They were having what looks to be Northern Chinese appetizer items(Soy/Chili Marinated Meats) as I walked up to the counter/cashier where they had a whole tray of Braised/Stewed Pork Hocks.  I stood beside the beverage fridge and asked for 3 BEEF Buns, then I realize MANDARIN only when she spoke back.  At least I can read the menu so I tried again and ordered the Pork & Napa Cabbage Bun(Ju Ro Bai Cai) instead.  I will learn the Mandarin Menus by end of this Summer!  Most Buns were $0.89 each and she charged me $2.65 as I took it to-go and ate as I went.  One bite and it was JUICY and well flavoured with lots of Napa Cabbage bits for that crunch.  The Bun dough itself was not soggy at all from the interior juice.  They were just slightly smaller than my palm and it came out from the kitchen in just under a minute.  3.5 *Stars* I like the Cabbage!"}
{"text":"If you just want to eat and don't care too much about decor this place delivers. Food for two people came out to about $15 for 5 buns, soup, and chicken. I get the sour cabbage and pork buns, always tastes good. They don't speak english here and they close before 10PM I think so it isn't good for late night eating."}
{"text":"Knowing my love for vegetarian buns, my mom told me that i would find this place satisfactory. She was right, it satiated me..but it did not wow me....well the chinese name of the place did, as it's a pun that also means \"forest of buns\" teehee.  They have daily specials for various types of buns, but my only interest was the egg and leek bun. We got a pack of 6, my mom paid for it, and we left. The leek bun did not have rice noodle inside, and they probably could have used more stuffing. The bun itself was well made and the flavour of the stuff was wonderful. It would have been a four star if they didnt cheap out on the stuffing. Maybe I'll come back and try again, but i might just go to TnT and eat their vegetarian buns instead."}
{"text":"Giving 5 stars because this place is so cool.   Yes, the decor is not great, and yes it is a dumpy (a dive is a good phrase), but do not let that dissuade you.   I cannot say for sure, bu I am sure the three people there are there all day and night.   While English is a t a premium their food is so very tasty.    We go there all the time and get a bunch of not that much.    Just try the buns off the menu (there are English translations to describe ingredients), and I've found all the flavors very good.   Of course, do not leave without getting some red bean buns to take on the road."}
{"text":"Been here fore years! love this plae, for their tofu pudding the best in scarborough. makes me feel like home back in china. their sides are nice too, they ahve hnice aunty's workign there  and are all very friendly. The service is fast and never not happy. the buns are yummy, they have seasonal specials like lamb buns!! so good but only winter months and cold noodle. The thing I do not like about this place is space... there is barely any space, people whom buy take out can come ad go but those whom want to stay in must find a corner or are in the way  ( they are very busy in the mornings). Additionally, the cost off buns and other dishes have gone up greatly! a regualr everyday bun is $1.39 each.... other bun places are still at $0.89 or  $0.99, It is getting more expensive. other than that nothign much changes in this shop!   GOOD FOOD, GOOD SERVICE, Price bothers me at time b/c comparision to other shops.   IT's not a whole in the wall or a hidden gem but it's pretty good ."}
