{"text":"Some of the best pizza I've had, certainly tops in the south hills.  The gnocchi and rav's are also pretty top notch.  Basically anything I've eaten there that involves the red sauce is spectacular...it is the heart of any Italian restaurant.  I can't say enough good things about the food and try to make it here at least once a week."}
{"text":"Don't ever go to this restaurant. The owner is rude and ignorant and totally unprofessional. If she was actually employed there she would be fired. In fact she should fire herself. If it was an employee who did the following that employee would have been fired, by the owner.  We had a party of 7 and were the first 3 to arrive at 5:30 PM. No reservations allowed on weekends we were told. At 5:45 PM three of us returned and were asked if we had reservations. When I told the woman that we were told only 15 minutes ago that you didn't take reservations on weekends we were seated immediately, but very rudely, actually throwing the menus on the table. When we waited for the rest of our party for 40 minutes we found that our party was sitting in the lobby for 30 minutes becauses \"no one will be seated unless the whole party is present.\" The 3 of us were already seated and waiting for the other 4. When I complained to the person who said she was the manager and later found out was actually the owner,about how our party was treated. She said \"what do you want me to do, bend over?\" All I wanted to do was complain but I was so astonished and mad at her unprofessional and rude attitude toward me, a customer, I returned to the table. The rest of our party saw how agitated I was and upon hearing the encounter all decided to leave.   The owner woman later refused to confront us when we were leaving sending a \"manager\" instead. We were told about this place being unfriendly, later by other people. The staff said the owner does this all the time and were extremely apologetic for their boss', and the owner's, rudeness.   We paid and tipped the waitress for our bread sticks and drinks upon leaving. We felt really sorry for the waitress who was especially apologetic to us, unlike her boss and owner. We will never eat here again and we will tell everyone about the owner's rudeness. One person in our party has a business and said if he treated his customers like this he wouldn't have a business soon. I wouldn't be surprised if this restaurant went out of business soon. Don't go there ever."}
{"text":"I disagree with John R. This restaurant is locally owned and the food made to order. The owner is friendly and even went so far as to buy cookies from my daughter's girl scout troop and to let her kitchen staff know about it so they could come to our table to box some as well.  They accommodate my wife's food allergies and make changes to dishes for her. It is quieter, less busy, and the food is much better than the chains. The brick-oven pizza is among the best I've had.   This is not a 5-star restaurant, but it is a nice Italian themed family restaurant with many menu choices."}
