{"text":"My wife, children and I live around the corner from this pub. We went there at 5:30 p.m. the other day to grab dinner before going to a 7:00 p.m. show at my older daughter's school.  This was our first visit to the Lion and Dragon.  After sitting on the patio for five minutes and having the waitress walk past us twice, an Asian man (the Manager?) asked if we'd been helped. We told him we would like menus.  To make a long story short....  Half an hour later we had each received one drink (my draft was warm, as was my wife's cider) and there was no sign of the food we'd ordered. Not once did the waitress check in with us.  My wife went inside to ask when our food would be ready and was told it would be \"only\" ten minutes. After the ten minutes had passed I informed one of the waitresses (not ours -- our waitress was nowhere to be found) that we had to leave, and she seemed genuinely annoyed that we weren't being patient.  So, after forty-five minutes....  Warm drinks, appalling service and no food from a pub that wasn't particularly busy when we got there.  I don't care how close-to-home this place is. I won't go there again."}
{"text":"They've tried, and it's not a bad effort at an English pub, but it's not quite there.  The washrooms should be labelled 'toilets,'  there were no beers on hand-pull (unless I missed them) and I haven't been in a pub with a black ceiling since they banned smoking 5 or 6 years ago.   other than that, they did a good job. Wood panelling, grubby furniture and a menu printed on an inkjet.   Food was overpriced and nothing particularly special. Our waitress shouted at us and all the customers as she didn't seem to know how to speak normally. It was a bit intimidating.   On the plus side, I did enjoy my steak and kidney pie, even though the pie was actually a square of pastry balanced on top of the filling.   We were lucky enough to finish before the karaoke started..."}
{"text":"As far as a local pub goes, the Lion and Dragon definitely is a fair place to wet your whistle, id go as far as to say it's a spot for local regulars to grab a pint or two after work before heading home. Just not a spot you'd wants hang out in for an excessively long time.   The pub is hidden away inside the courtyard of an older plaza - the looks of which appear to be almost old world European in likeness. You really can't miss this plaza as you drive east on Hwy 2 (Kingston road) just look for the antique looking black and white plaza.   Having only An entirely non- craft beer offering was disappointing, however I feel good craft options might be lost on the regulars here as they appear to be a hard Labatt bar with no other options available. The server informed me they used to serve Beaus but not anymore.   We went today for old times sake, as it was the favorite spot for wings of a late family member. Between the three of us we had a French dip sandwich, a nacho steak sandwich and a \"perfect for one\" wing combo. My French dip was \"ok\" the gravy made the difference here because the beef was very dry. The wings definitely lived up to their reputation as sizable and meaty with a good batter on them.   If I'm in the area is come back for wings and beer but definitely nothing else. It's familiar and cozy so that's the appeal for me. Otherwise not worth seeking out.   Eatcrest Out"}
{"text":"I come here regularly Tuesday Nights for the wings and they never fail to deliver amazing food. Medium and Honey Garlic sauces are divine. The fries are also delicious, you will never be disappointed with them and they serve a lot even on its own.   The Panini's here surprised me as well, they are never pressed down to a flat board, done just right and they don't skimp on the amount of stuff that's packed into it.   Servers here are excellent and if you come here often they know exactly what you want off by heart. It's a small pub so if you come on a day like wing night id suggest reserving ahead of time as it gets crowded fast also on hockey nights."}
{"text":"The Lion and Dragon is a complete disappointment. I have been there a number of times and the bar staff is rude and undisciplined. They can be quite obnoxious and are solely self-absorbed. The bar itself is poorly constructed and the washroom is a shared mens/womens and is quite unsitely. The food prices are way above what they should be for an establishment of that sort."}
{"text":"Tried it for the first time today based on the reviews I've seen on Yelp and Foursquare.    My first impression as I entered was, \"Wow, this place is small!\" And it was. There were extension cords hanging from the ceiling, conjuring up images of a fire trap.   I ordered the Dragons Fire wings and a a Diet Coke. The latter was flat and watery. The wings were huge and flavourful. It was a true hot, compared to the vinegar laden hot wings at other restaurants. My order also came with fries, and they too were good.  Service was good, but slow. I'm not sure if I'll go again."}
