{"text":"Before visiting this location I was yet to have a good experience with Little Caesars. 

Ordered a regular and one of the new deep dish pizzas. It took about 15 minutes to prepare both. Customer service was great. 

Pizza was an 8/10 for the price. The deep dish pizza was especially good. 

Will definately be back sometime."}
{"text":"So most of us have actually visited a Little Caesars once or twice in our lives....

This particular location never seems to have enough pizza when two or more people walk in the store...but they always seem to have a plethora of wings on hand, which they try and sell. 

*side note* PLEASE DO NOT BUY THE WINGS.

Generally having eaten at several Little Caesars over the years it takes about 5 minutes to make 1 pizza if it falls under the 'hot and ready' category. Crazy bread takes 7-10 minutes.

For inquiring minds, Hot n' Ready along with the cheap price is the reason why Little Caesars has survived over the years considering the intense competition in the pizza market. 

Moving along, I waited for 10 minutes for someone else's pizza to be made even before placing my order (and I did try to place an order)...sad part is that all I wanted was some crazy bread, AND there were 4 people behind me. 

I just didn't have that type of time to waste yesterday, so i told the cashier to forget it and walked out, 2 others followed me...

The focus of Little Caesar's is really the fact you aren't waiting 10-20 minutes for a pizza and that there is already pizza available when you walk in..today that concept failed...miserably.

You may ask what's the reason for the 3 stars? I chose to be kind based on other experiences at other locations, cause at 5 bucks you really can't go wrong with a 6 slice pizza, or 6 bucks for crazy bread."}
{"text":"Came in at about 40 minutes before closing on a weekday felt that a deep deep dish pizza should sate my appetite just coming off work. But I noticed something...
Aside the fact there was 3 people waiting for there order it took the only 2 employees a short while to clear the place but the cashier was 15 years old!! 
 
 He and a seemingly same aged woman were holding down the place like pro's! Not even I did that good when I had my first job at the one at applewood plaza when I was 16. So told them keep up the great work and about that it earns a lot of respect. 
 Btw the food was delicious!"}
{"text":"Little Caesars are pretty funny.  So far the last 3 or 4 locations I've been to never have \"hot and ready\" pizzas on hand.    In general I like little Caesars.  It reminds me of my university days.  Also their crazy bread is addictive which I'm sure they are happy to sell since it's probably a pretty high margin item for them.  I digress, this place looks a bit abandoned to be quite frank but when the pizza is done it's in line with the rest of the chain.  Live on crazy bread.  Yum"}
