{"text":"I have been there several times in the past four months and have never been disappointed with the food, craft beers or the service . The Wednesday special of pierogi's and kielbasi  is superb. The burgers  and sweet potato fries can't be beat. Certainly far above your typical bar food.  It certainly deserves a visit if you have not yet been there."}
{"text":"This is such a great little brewery in Mentor, Ohio. Yes, it is a little hard to find. Look for the sign for billiards right by a major fast food restaurant. It is not right on Mentor Avenue. You actually have to go down a little hill. How far down? All the way down.  You can book a time to brew beer. Food was awesome!  Beer selection-  they typically have several different styles on tap.  Food - the menu is small, but everything is prepared fresh.   Service- every time I have been in there, they have been extremely hospitable.   Entertainment- they have a small stage and have live music. Check their schedule."}
{"text":"Ordered a pint of Winter Storm and it was most good. However my friend almost couldn't get a sample because they ran out if 5oz glasses and service was kinda slow, otherwise it would've been a 5."}
{"text":"I am very familiar this this venue as i was there for the opening of Club 9 ball in the fall of 1996 or 7.  Then I watched it degrade into Q's 21 and ultimately close like every other Mentor night spot.  Well Little Mountain Brewery is really nice inside.  I took my dad there on a Friday around 6 o clock and we were the only ones there.  Very nice inside and the waitress was so nice.  I was severely disappointed that they didnt have any of their IPA's on tap but there were many other brew to choose from.   I came back the next saturday and they had the 9 tail IPA on tap!!! Of course i got it but unfortunately it did not taste like an IPA at all.  What the Heck??? It was good , yes but it may as well been a pale ale.  Super disappointing.    The band was good and i liked the atmosphere but the beer was just not up to par.  Damn, i was wanting to worship the IPA but that didn't happen.   Ultimately i will go back again and take my dad because its close/convenient  and i haAen't tried the food yet but i will never go back myself or with friends because the IPS stinks.    Maybe the Rye IPA is better but who knows when that will be on tap."}
{"text":"Awesome brewery!!!  awesome staff and great hidden gem. Good beer and wine. It would be great if they had a sign on the street so that people would know the location."}
{"text":"Although hard to find, we will definitely be back. Beer choices are many and delish. Good choices for the not so refined beer drinker and the heavy stout drinker. The food is so reasonable priced, that you really can bring the whole family. The pizza's are very good. John and Debbie showcase new and upcoming local talent which is great. This is a good lunch and or dinner spot. A great find and now on our list of must go to spots. I can this place filling up fast on the weekends! Better become a regular to secure your place at the bar!"}
{"text":"Stopped in last week after finding directions on Yelp. I'm not a fan of craft beers but I tried the Octoberfest and loved it. They give you a basket of flavored popcorn which is a nice touch. The popcorn made me thirsty so it made me drink more. We ordered a pizza which was good. I'm sure we will be back to try other foods. I liked that the bar wasn't loud even with a band playing. It's a little hard to find but it's worth it once you're there."}
{"text":"Tried to go there to watch the Browns game, but they are not open even though Yelp says they are."}
{"text":"I have tried going here twice now, and both times they were closed even though it was during regular business hours. The building is a pain to get to and there are no signs. Don't bother wasting your time here."}
{"text":"Hard to find, I had to call and ask after driving up and down Mentor Ave a couple of times, they really need a sign on the road somewhere since you cannot see the building from the road.  Small menu, but both the food and beer were great.  My husband got the pizza and I got the quesadilla special, and both were very good.  I thought they beer selection was very good, and definitely want to come back again, especially in the summer to try their summer brews.  We came for the band, but we'll be back!"}
{"text":"My Cabernet tasted like sangria. SANGRIA!   I just can't get over that.   So it was replaced with the only other red option, a Shiraz. It was better but not above mediocre.   SANGRIA!   Then again it was only $5 a glass.   There was live music and decent food. I really want to like this place. But I wouldn't come back."}
{"text":"Great atmosphere! Great beer & food! Great staff! It's a gem for sure. The only recommendation I can give is get a street side sign, it's a little hard to find, but well worth the search! Keep up the good work!"}
{"text":"Had been given a 10 dollar off groupon voucher, and decided to pay a visit...  Open mic nite thurs, lil loud, lil talent... Ordered pale ale, very underwhelming...didn't even bother with a second, tasted like someone's first home brew.  Ordered artichoke dip, and buffalo chicken wrap, which were brought out the same time unfortunately.  Food was decent, nothing impressive... Probably won't visit again..."}
{"text":"Drove from the west side to see a band play here on a Friday night. Got there an hour before the band and it wasn't quite busy. It got progressively busier as the night went on.   Beer - The reason I assume anyone comes here. It is a brewery. It appears they only server their own beer. I am completely fine with that. That's how a brewery should be. The selection, based on styles, was pretty good. They ran out of the light lager and one other beer. The beer is served in a glass shaped liked a soda can. I'm not sure if it's pint sized. There are appropriate glassware styles for craft beer. It's not a one-stop-shop sort of thing. It seemed trashy to me. May as well have given me a mason jar. All four styles of beer I tried were under carbonated. I believe that is intentional. The beers were also not cold.   Food - Had the wings and fries. Both quite good. Know in advance you get the full wing (wing and drum). They are fried super crispy which I love. I'd ask they get a hotter sauce. Just a suggestion.  Service - HORRIBLE is an understatement. I can only speak to this one visit. I don't know if its the band that drew the crowd or if Friday evenings are typically this busy. The sole bartender was getting killed. She could not keep up at all with the service. She was in charge of pouring beers, cleaning her own glasses, and getting food from the kitchen and serving it. All the while what appeared like owner/manager/whatever where just standing around enjoying themselves. It took us at least 45 minutes to get our order of wings and fries. At one point I waited almost 20 minutes to get a beer. So she brought out our wings. No fries. We could see they were done. So maybe 10 minutes later owner/manager/whatever brought them over to her and asked her who they belonged to. She said she had no idea. Our order slip was right in front of us. Maybe had she not been overwhelmed or maybe if 45 minutes or so hadn't passed she wouldn't have forgot. Ridiculous.  On the plus side, owner/manager/whatever gave me a beer on the house because I told him about the long wait to get all of our food delivered. He stated wings take a long time to fry. I fry wings at home. 15 minutes tops. Yes, I was not the only customer. So is the kitchen to small, understaffed?  I will not go back here simply because the beer wasn't up to par. If the beer was good I'd go back at an off-peak time in hopes of getting better service. My only suggestion is to go at your own risk."}
{"text":"Hard to find if you are just traveling down the road, but if you know where you are going, you can find it.  I am from the south, but for me it was warm inside.  I bought there flights and due to the warm building the beer got warm real quick, if I remember, I wasn't even halfway through the flight of beer when the rest were warm.  Guy behind the bar was nice and the owner ended up being there while we where there and we had a nice talk about beers and other things.  A couple of fixes here and there and this place will be great."}
{"text":"Newly opened and a little hard to find, but worth the effort.  On Mentor Ave.  just west of Wendy's.  Very clean and friendly.  Nice selection of beers made on site along with in house wines.  Special \"hop\" corn served with a beverage purchase.  Daily food specials along with menu items.  The wings looked awesome.  Pizza too.  Very friendly staff.  Live music on Saturday night.  Definitely coming back for another visit."}
{"text":"The atmosphere and food are excellent. The menu is limited but the items we had were great.  My wife and I had the cod and my son had on of their pizzas.   We also had the fried pickles.   Everything was great.  The beer was just ok.  I need to go back and try some different ones because they have a large selection.   I will definitely be back"}
{"text":"Yes, it is hard to find as it is off Mentor Rd., behind the main strip mall. However, the food by Chef Sotkovsky is out of this world. You will never be disappointed if he is at the stove!  I had the Belgium Wit and it was light and full of subtle flavors. Will have to try the others on future visits, but If this is an example of what's brewing at LMBC there won't be many people leaving unfulfilled. They have 12 taps going from lager through chocolate stout.  Something for all pallettes.  Give them a try and you will be happy you did."}
{"text":"This place seriously needs a HUGE sign so that it isn't so hard to find. As I have written before, I am a foodie from Philly. I am spoiled with amazing chefs and places to grab a bite here in Philadelphia, Pa. So when I travel and find a place worth a Philly grade review, I make sure it gets done. I actually went to Little Mountain Brewing Co. back in 2014, but it left such an impression that its brochure has lingered in my pile of papers since and hasn't moved until I remembered to write a detailed review. Heres my take on LMBC-  Their atmosphere was a little loud as the band played with a very Stevie Nicks like voice coming from the stage. It was soothing and enjoyable. The wait staff knew we weren't from around there (they must have regulars, which shows loyalty), and made sure to allow us to get into our own comfort zone by sampling their on site drafts and wine selection. I had developed an allergy to wine a few years ago after a run with Lyme disease, but this wine gave me no such headache, redness and was so smooth to drink. I especially LOVED the cabernet. It DID NOT taste like sangria to me, and believe me, I have had plenty of different wines as well as sangria around the world. My husband loved the different types of homemade beer and we shared the fries and a pizza, both which had high Philly quality type flavors. Absolutely worth stopping by and trying out. We loved it!"}
{"text":"The sausage hoagie, beer and fries were good. No need to order fries as come with sandwiches  My daughter had buffalo chicken pizza which was also good The winter storm ale is very low in bitterness But   strong"}
{"text":"A hidden gem!!! :) What an awesome place to have a beer and a burger! Pizza is awesome too! We will be back. This is a must go to place if you're in the area or feel like traveling out. They use meat from the local butchers too! One of their brewmasters (coughRobbycough) is a stud and really knows what he's doing! Come check him and his beer out!"}
{"text":"I live right around the corner from this joint and stumbled upon it on Yelp. If it wasn't for Yelp I would have never knew this place existed, considering they have no signage on Mentor Ave.  Friday night 8pm we decided to go for a few beers. After zigging and zagging up and down driveways we finally found the place. As many other posts stated it was dark. Everything was dark...... Including the building. It was closed! Yes, closed in a Friday night at 8pm. Despite the web page saying they are open until 12am it was closed. I won't give it another try."}
{"text":"Hard to find- but we walked into a party, great band just warming up. Small menu, but good choices, and specials  But the beer is what it's all about. The ipa isn't quite as hoppy as I'm used too, and had a hint of sour, but my own fault. I should have gotten a sampler.  To go with the bangin popcorn on the bar"}
{"text":"Husband charged me with choosing a place to eat today.  I chose poorly.  While the server was nice, he had difficulty multitasking within the 3 small groups that were there.  Food was horrific (pierogi's), and by that I mean it taste like it was just delivered from a GSF truck and thrown in a cast iron skillet.  Should have ordered the pizza, which looked amazing.   Wit Beer was room temperature and had no dimension.    Restroom had no paper towels, both faucets were missing the hot handle insert and the light in the hallway leading to the restrooms was not on (burnt out maybe?).    Minor issues independently,  however putting all of these misses together painted a picture for us of an establishment that we will not return to, nor recommend to others."}
{"text":"I'm shocked this place has so many 4 and 5 star reviews.  We came to the Little Mountain Brewing Company to meet with coworkers and have some drinks.  We had a hard time locating the building.  It's back behind a Wendy's (can't access their parking lot from the Wendy's), but had to drive in and out of parking lots to find the right one.  There's no sign at the street telling you where to enter.  The parking lot is nearly completely dark.  There's a single light at the far corner of the building that doesn't illuminate much.  It looks really dodgy.  We could only see the \"OPEN\" sign through the window.  After parking, we could finally see they have a sign on the front of the building (that doesn't face Mentor Ave), but the light above that sign is out.  We walked in and got blasted with the smell of burning fryer grease.  There was a cloud of it hanging in the bar.  I realized later the fan I could see through the pass in the kitchen was actually pointed out of the kitchen toward the dining room.  You could see thick smoke in the kitchen, which tells me their ventilation hood system isn't working.  That makes the place a fire hazard as well as a health hazard for everyone working in there.  My jacket still smells like burning fryer grease.  Even the salt and pepper shakers had a coating of grease on them.  There's a picture someone took of the inside of the place, and it looks smokey inside.  That would be the fryer grease floating in the air.  They don't serve any alcohol that they don't produce.  That means you can't get anything in a bottle, no domestics or imports, nor can you get a mixed drink.  They don't have any liquor!  They have a row of tappers, all of which had black marker on them at one time, but it's all been wiped away.  They only had 4 beers available.  The wife and I ordered their \"Light Lager\", which came out flat and room temperature.  I took 1 sip and didn't touch it after.  We ordered the spinach and artichoke dip, as well as their BBQ pizza.  The dip was fine, but the chips were soggy and stale.  The pizza tasted bad.  When I tried picking off the chicken, I could tell it had been freezer burned.  The tops of the tables had nails in the center to hold down the laminate.  Yes, the place is really that bad.  I felt bad for the employees.  We paid for what we ordered and left.  We won't be back."}
{"text":"Really good good pizza is so good anf there giant chicken wings with maple bbq was good I like winter storm beer"}
