{"text":"As I'm writing this, I already know a lot of people are going to disagree with me. After all, the arrival of littlefish in the Junction has definitely been well received. The neighbourhood has been waiting an awfully long time for a cool, hipster-worthy brunch spot. Unfortunately, the arrival of littlefish hasn't completely filled that void just yet. They still have a few kinks to work out, but don't give up on them yet. I won't, but only because I really want to love it.

Ok. First off, this is a pretty cool restaurant. Besides the obviously brilliant name, littlefish is a great little place to grab weekend brunch. It's small, only about 8 tables or so, but that just makes it all-the-more cozier and comfortable. It's a long, narrow space filled with exposed red brick and shiny metal airducts. The daily specials, scrawled and displayed on a suspended chalkboard, are imaginative, original, and well-thought-out.

The brunch menu is pretty much what you'd expect to see. They have everything from French toast and eggs benedict to pancakes and crepes. Best of all, they seem to make everything from scratch with good ingredients.

The staff goes out of their way to be friendly and to make sure you have everything you need to feel comfortable. Constantly being checked on, I never found myself without a full cup of hot coffee, but I suppose that's sort of expected in a place that only seats about 30 people.

The thing that's not expected in a place this size is the ridiculous wait time for food. When I was there, it seemed as though everyone in the whole place waited 45 minutes to an hour for their orders to arrive; I know I definitely did. If they were understaffed, I couldn't understand it; there were at least 5 people in the exposed kitchen, none of them seeming to be moving with any sense of urgency. Definitely not understaffed here. The whole place seemed to be in a state of organized chaos. The front counter was covered with papers and dishes, and the visible part of the kitchen was overcrowded with food containers and crowded counterspaces. Organized chaos, but just barely contained.

People rave about the food here, but I really don't see it. My eggs benny was, meh, ok, but they certainly weren't anything to get excited about. They were warm but not hot, and the side of potatoes was mostly burned. My daughter had their now 'Internet famous' French toast. With burned edges on an overcrowded plate, they were even less than meh.

Make no mistake though, this place was busy. Newcomers are put on a couch to wait until a table vacates, but they are offered coffee. If you're planning on getting a table on the weekend, be prepared to wait. So why so busy? Personally, I think a lot of it has to do with the neighbourhood's lack of options. I'd be willing to bet that although littlefish may be doing well in the Junction, had they been on a more brunch heavy area, like West Queen West, they may not be doing as well as they are now.

So would I go back to littlefish? Sure. I'd like to give them another chance. I think the whole neighbourhood would. After all, the Junction needs a place like littlefish as much as littlefish needs a neighbourhood like the Junction."}
{"text":"Solid brunch spot! Small, so lines up happen on the weekends. Menu is small-ish but good variety to suit everyone! Staff was friendly, decor was nice. Definitely worth the wait!"}
{"text":"This little breakfast spot is one of our faves in the Junction.  Their daily specials are very tasty and their menu has some great spins on yummy breakfast fare.

The service can be somewhat slow during its busy hours, but the atmosphere is cozy, so it's a joy to just sip on a java, chat and wait for the food to come. 

Best to go as a couple, as there is little seating for larger groups."}
{"text":"NO OUTSIDE DRINKS I was told the minute I walked in... Okay I get that, but I offered to buy a coffee and a smoothie if I could just finish my coffee. 

NOPE

Then a bunch of muttering from the staff that rules are rules... but if your business is so hurting that outside drinks are what makes you fail, you don't deserve customers.

NOTE I've seen the same complaint from other customers on here. 

I got a rule for you: Listen to your Customers. They don't want their coffee snatched when they come to spend money.

PS food is mediocre and overpriced, hours stink and service is painfully slow. So many better options around..."}
{"text":"I had the scramble and it was excellent, too often scrambled eggs are dried out horrors, not here. And the sausage was excellent!

Fair price as well"}
{"text":"Almost don't want to write the review for fear of little fish getting too busy!!
My absolute best brunch/lunch find in the junction after living in the area for 1 year. 
Start with a nice and proper fresh juice, good coffee then get into the food. 
They cater to gluten free and the bread is excellent. 
My fav is Jens choice. Avo, tomato, bacon, lettuce and 2 eggs on a sandwich. 
But the pancakes, French toast and Scramwich! All superb. 
Please don't get too busy!! They are small but cute and excellent."}
{"text":"Small place, but great food, and good service. Might see a wait time due to popularity, but servers try to accommodate as much as possible."}
{"text":"It was just ok.  Nothing to really complain about, but nothing exceptional either.  The cappuccino was great, as was the tea selection.  The scramble of the day was tasty enough - but I did find a few eggshells in mine.  The pancakes my husband ordered were so-so.  Mitzi's pancakes are way better.  It was a little pricey for what you got in my opinion.  The service was good - we had to wait a while for a table and the coffee/tea was on the house as a result.  Classy touch.

I liked the decor and the atmosphere, and given this is so close to my house I'll probably be back to give it another shot."}
{"text":"I WILL NOT BE RETURNING HERE!

Littlefish was one of my favourite spots to go with my husband... and we have brought many friends there since they have opened. I always thought the food and service was great until today....

Our breakfast started out great. We were served by our usual female waitress, I ordered my usual B.L.A.T (bacon, lettuce, avocado and tomato) and my husband ordered the regular breakfast. I was very pleased that the waitress remembered that I usually order soy milk with my coffee. It's nice being recognized as a repeat customer. Things like this are what make my husband and I want to return.

Our order arrived and everything was fine except my avocado was totally brown. Initially I accepted this and thought it was just overripe and took a bite of it. It tasted off, rotten and foul. Not a big deal right? I'll just let the waitress know and get another one.  I let her know that it didn't taste quite right and her usual bubbly demeanor disappeared, and without any eye contact, she just grabbed my plate and yelled at the kitchen in a very annoyed tone, \"Could I get a greener avocado!\"  I'm sorry, but if my food is rotten, don't they need to know? I didn't want a greener avocado, I wanted a fresh one that wouldn't make me sick.  She then came back and plopped another plate in front of me with another slice of avocado that was placed faced down.  Again, no acknowledgement that they just served me rotten food. Whatever, at least I got fresh piece right? Wrong! I turned the avocado over and they gave me yet another frickin brown piece of garbage. I decided that this was not a battle that I was going to win, nor did I want to deal with someone who already seemed very pissed off at me that I complained. When our place was cleared, it was obvious that the two big brown pieces of avocado were not eaten and AGAIN it was completely ignored. To me this is the sign of ultimate poor service. This was such a minor problem that could have been handled in a more friendly and professional manner. I sure wasn't expecting the reaction that I got from our usual friendly waitress.

This experience was VERY disappointing and I am not usually one to complain on these websites, but I'm sick of people who give shitty service! I would just like to let the waitress know that one little problem that could so easily have been solved can cause you to lose a customer and anymore recommendations to friends. A bitchy attitude does nothing for your business. I also feel for the guy in the other post who just wanted his bacon cooked more. Is this really to much to ask for?"}
{"text":"\"So here's how it works,\" our waiter exclaimed.

\"You pick one item from each column, we combine them, and provide you with an amazing, self-designed smoothie.\"

\"How fabulous!\" I thought. \"I love smoothies. At home we blend just about EVERYTHING! OK, I'll give this a try.\"

Hmm.. Did I want cow's milk or soy? Balkan style or low fat vanilla yogurt? Orange juice or apple? Blueberry, strawberry, banana or mango?

I settled on regular milk, vanilla yogurt, orange juice (as I was told the smoothie would need a base) and blueberry. 

Perhaps it was my selection of ingredients (though my brunch companions fared no better), but my smoothie was AWFUL. Oh dear god it tasted like blueberry flavored milk... which, I realized, it pretty much was!

At home, we've been blending EVERYTHING so when the option of a smoothie presents itself, well..... it's pretty hard to resist, and actually pretty hard to ruin, but Littlefish managed to mess up three. The soy milk-balkan yogurt-banana smoothie was even worse. Perhaps milk and yogurt just don't go. 

The food wasn't great either. Huevos rancheros tasted artificial and though spicy beans were a focal point of the menu description, they only slightly glazed the inside of the wrap. A tiny piece of canteloupe lay alongside.

I left feeling hungry."}
{"text":"Great food. Great setting.Great service.what more do you want ? Try the blackened fish with the tastey chips ! Well worth the visit!
Graeme"}
{"text":"Little Fish is one of our local go-to brunch places. Their menu is comfortable with a little fancy thrown in. Sometime the daily Scramble can be a miss, but pancakes are always good. Amazing americanos too. I like it."}
{"text":"Little Fish had a great run, I hope they are reopening in some form or another. The owner was obviously very hands-on,  he maintained a high quality and varied menu. The scrambles man, the scrambles.... so good. 
The music and aesthetic personality of little fish made such a pleasant environment to be in.  What an original and delicious place, miss it already. Also the staff were real neighborhood favourites, they did a great job."}
{"text":"Arrived at little fish at 11:30 on Sunday and had to wait about 25 minutes for a table. Menu looked great and after waiting a while for a table my friend and I were quite hungry. Our coffee orders came quickly and my cappuccino was quite tasty. I expected the same of my meal but I was quite disappointed. It took over 45 minutes for food to arrive! I had the eggs Benedict, it was anemic and marginal at best.The eggs and potatoes blended in to the color of the plate and it didn't look appetizing at all. There wasn't a piece of fruit or garnish on the plate to park it up a little bit. Potatoes were very plain and burnt with an odd onion here and there, and although they called the hollandaise \"lemony\" in the menu description, it was overpoweringly acidic and not tasty. definitely disappointing for the price paid. my friend had the huevos burrito and it was okay, but nothing special. A man at the table next to us had received his order of beautiful looking blueberry pancakes and incredible looking bacon earlier, I wish I had ordered that instead. We also ordered the cheese blintzes with \"fried leeks\". The flavor combination was so unappetizing that my friend and I couldn't even finish one of the three crepes, we kept wondering what the awful taste was coming from... Was it the buckwheat crêpe? Was it the filling? Turns out it was the tiny pieces of fried leeks that were fibrous and inedible and definitely not a flavor that anyone wants in a delicious cheese blintz. I hate to be a party pooper here because I really wanted this place to be fantastic and I certainly upheld my end of the bargain paying more than $50 for two person breakfast, waiting 20 minutes for a table, and waiting almost an hour for our food to arrive... But unfortunately this is another case of a place that looks hip and is always busy due to lack of other alternatives, with a beautiful sounding menu that just doesn't deliver. And I'm not sure why the restaurant is equipped with only one cook, one busser, and one waitress at their busiest time of the week. Upon closer examination the kitchen looked very messy and unappealing. The server and busser  were really nice, so the two stars come from good coffee and nice staff but with bad food long wait times and an extremely noisy atmosphere, I couldn't give it more than a 2 out of 5 stars."}
{"text":"I love Littlefish and try to get there as often as I can. My favourite item is the daily scramble. How they get the eggs so soft and melt in your mouth, I don't know. I've been trying to recreate it at home with no success. And the combination of ingredients is always interesting and delicious.

Other items are great too and I really like the coffee. The service is always friendly and prompt and they're great about always making sure your coffee is topped up.

I think the atmosphere is great too. A nice mix of couples and families and people of all ages. You always feel welcome there.

If I had to improve anything, I'd say maybe expand the menu a little and maybe the prices are just a tad high. But if you take the prices at Littlefish combined with their quality and compare them to the other offerings on that strip of Dundas, you quickly forget about the prices because there's just nothing else that compares."}
{"text":"Littlefish is such a charming little café with exposed brick walls, cool tunes, friendly staff and most of all good eats.

I stopped in this past Sunday by chance with my Dad as our original brunch destination was now a brunch buffet place = way too much food. 
Littlefish, our Plan B restaurant, was excellent!

Because it is a small place, we had to wait on a couch at the rear of the resto for about 15 minutes to get a table.
 
We were seated in what our whimsical waitress called the \"Jamaican vacation\" table near the front window. I wasn't complaining because it's so damn cold outside. 

She quickly brought us two large glasses of water and within about 10 minutes our brunch was served. I tried the poached eggs with smoked salmon served on a buckwheat crepe. Yummm. The hollaidaise sauce was perfectly lemoney. 
My dad tried the daily special dish - scrambled eggs with Hungarian sausage and veggies, toast and a wedge of watermelon.

I'll def. be returning to Littlefish with my hubby."}
{"text":"Little Fish has a lot going for it. Besides being the nicest breakfast restaurant in the Junction, they have an amazing staff, comfortable seating and a relaxed, pleasing atmosphere...on the weekdays. Weekends this place gets mad jammed and the babies ratio the adults 2 to 1.  

Food: very nice basic breakfast with eggs and either bacon or homemade sausage, homefries and a wide range of breads for toast, pancakes (with bacon!! or banana), french toast, daily scramble, benedicts on weekends, good selection of sandwiches for lunch. 

Great prices, very reasonable.

I'm giving Little Fish 3 stars because although it is good, its not often great and it is so close to great I wish they would take it a little further. Both the espresso based and drip coffees leave something to be desired. There are really no good options on this menu for healthy eating. I hate that the one thing that is touted as healthy is called 'the skinny bitch' - and that it has outdated health options like cottage cheese and dry toast. What about just a nice fruit/granola dish? Or any fruit at all. There is no fruit offered here (except tomato) which seems crazy to me for a breakfast place. There may have been an orange garnish? The vegetarian option is either and avocado or tomato...but I find that the avocado just isn't right with the textures of their meals and the tomato in winter was...well a tomato in winter. Maybe in summer it would be a better side. They also don't vary their menu except for a daily scramble which usually includes meat and cheese. It would be great to see a little more variation in the menu, a few more interesting options for vegetarians/healthy eating and I'd love to see some fruit offered! I get that this isn't being marketed as a health resto and that there are other options in the hood, but it would just be such an easy and remarkably appreciated improvement to this nice breakfast place."}
{"text":"I don't know where to start my review. Came with my husband for brunch and had to wait 20 min for a table. More than enough time to see how the kitchen runs. Service is slow and food didn't come at a regular pace.
The fridge at the back exposes a number of \"no name\" brand containers where allegedly dairy products are stored; from margarine to creams. I suspected those were used as containers. I was able to confirm it wasn't real dairy when my \"buttermilk\" pancakes arrived with some edible oil topping instead of butter. Couldn't taste the buttermilk flavor either and the blueberries weren't bleeding which made me think we're frozen no name brand blueberries.
I have to say this happened 50 min later because as I mentioned before service was very slow and mediocre not even asking how we liked our food. Hubby attempted to eat eggs with an \"hollandaise\" sauce that had a vinegary after taste. He then tried to eat the homemade fries, lukewarm and cooked only on one side with so called caramelized onions. 
Wanted to try a place with good reviews on this side of the city but this is not the place to go. In case my review isn't clear, I do not plan to come back to this place that cuts corners and their only good reviews are for the exposed brick wall."}
{"text":"Good food. My son picked this place. He was very excited to try buttermilk bacon pancakes. Got to say they were very Elvis good lol. 
I had the scramble eggs with pear ham and Camembert with some fennel bread. Unique and awesome.  Fun little  place, very tight seating but very quick turnovers. It's about the food, not the ambiance. It's decor is simple. Service was good for what they do. I definitely thinks it's a good place to try. A bit  of a trek to the junction though. 
I only give positive reviews because I will only review places I like. I would never bash a place just because. Most places that are bad will eventually close down. However, I always love to give positive suggestions. Especially to places that got most of it right. 
For Little Fish I would say its probably a good idea to have a professional look at you exhaust system. We all walked out of there with a smile on our face  until we realized we smelled like the restaurant. That nasty smell lingers all day. Specially for my spouse  who just had her hair done. All in all I say my son picked a good place."}
{"text":"I've been to Littlefish twice so far.  The first time I got a 2 eggs with sausage combo, and the 2nd time I got the eggs benny.

The food here tastes healthy and fresh.  The hollandaise sauce on the benny had a nice lemony taste to it and it's a welcome change considering some place's poached eggs taste like vinegar.

Portions are big, imho, and both times I had items on the plate that I couldn't finish.

Prices could be a couple of dollars lower (It's $14 for a two-egg, peameal bacon benny and homefries) but considering that it's in a more low traffic area, it seems reasonable for a neighbourhood that's slowly but surely gentrifying.

Wait staff is super friendly! No complaints there.

Would def. return whenever I feel like heading into the Junction."}
{"text":"The Good

1. They make an amazing cappuccino
2. Cute atmosphere
3. Their scramble specials are tasty (but do not come with homefries and therefore are pricy)

The Bad:

1. The standard breakfast of two eggs and bacon is pricy at $7, expecially since the home fries arent that great and there is no fruit or garnish on the plate.

The Conclusion:

I'd go again."}
{"text":"We went early for breakfast and it was super delicious.  Price is slightly high but quality, taste & service were so good I didn't mind paying that bill.  I'd go again for sure! Must be tried."}
{"text":"Omg... The chicken sandwich. Sometimes with avocado, sometimes without. I can't comment on anything else because that's all I ever had. But once you taste the brioche bread, you are done looking at the menu again. 
Super friendly service. You can preorder over the phone so the food is ready when you get there. Great if you need to go back to work quickly. Wish they were open at the beginning of the week though."}
{"text":"Quaint little spot in the junction. 

Notable menu item: Smoothie. 

Step 1) Pick one of four milks
Step 2) Pick one of two yogurts 
Step 3) Pick one of four juices
Step 4) Pick one of 6 fruits (or espresso)

According to my calculations, there are 192 versions of smoothies to get here (not including flavor shots). This is a gift and a curse, as some make for awful tasting drinks. Like my chocolate milk/low fat yogurt/grapefruit juice/espresso blend. Big fail there. I was just testing the theory though. The regular smoothies at the table were very nice.

To eat had the \"Jen's Choice\" which is a BLT+Avacado+2 Fried eggs. It was good, but way too tall to fit in my mouth and a little too bready. 

If you're in the area, this place is an OK choice. Maybe 20% too expensive."}
{"text":"This is our neighborhood brunch spot, we go weekly and know the staff my name. The weekend scramble (changes every week) is always delicious. You also can't go wrong with Huevos or my other fave \"Jens choice\" which is a ridiculous and fresh egg, avocado, tomato and bacon sandwich. The staff, Julia and Brandon are lovely and fast considering how packed and busy it always is. I'd say it's the best spot for what we like in that area."}
{"text":"Absolutely loved this place. 

My husband and I came with a friend for brunch on a Satruday around 12:30, I had called the day before to see if they take reservations and they assured me that the wait shouldn't be longer than 10 mins, they were right, we only had to wait 10/15 mins on the comfy sofa before we were seated.

The menu is simple but varied, we were all more than happy with what we got, the coffee refills are free and frequent and the pricing is really reasonable. The service was great, attentive but not intrusive. Everyone who worked there seemed really happy which I always take as a sign of a well-run business. 

The decor is rustic but cozy and the music is great. We'll be returning for sure!"}
{"text":"Love this place for brunch-probably the best in the city for me.
Sometimes gets busy and theres a bit of a wait but worth it
great service, great coffee
Done right!"}
{"text":"I'm all about checking out new brunch joints and ones that are within walking distance of my apartment when Saturday morning (okay, afternoon) hangovers serve as major TTC deterrents are even better. So myself and four like-minded Junction-ites made the trek to this adorable resto and given its small size, and the fact that it was already 2 in the afternoon, we had to take the only table that could accommodate our party - and proceeded to have one sweaty breakfast.

Now normally I would give my left foot for even a hint of warmth on a breezy February afternoon, compounded by the fact that my apartment doubles as a meat locker in the winter, but without any curtains and sitting in direct sunlight, we all ended up cooking like ants under a magnifying glass. Luckily, I always wear layers, but who wants to eat brunch in a tank top (and a ratty one at that since I didn't anticipate it making an appearance), mopping sweat from one's brow? That was, of course, no fault of the restaurant, but I'd recommend waiting for another table, or going with less people, lest you spend brunch fanning yourself.

Now, maybe it's time to move on the food, shall we? I ordered the egg scramble/messy wannabe omelette special of the day which had leeks, fresh thyme and gruyere cheese though I opted for no black forest ham and was offered lovely roma tomatoes it its place. My other brunch buddies went for the French toast, which was delicious and sweet and mostly reminded me of a cinnamon bun, standard breakfast of 2 eggs, bacon/sausage, potatoes and toast and the unfortunately named Blat (bacon, lettuce, avocado and tomato) and all enjoyed their choices, especially when it came to the homemade sausage patties that I declined to sample.

My egg scramble was nice and I appreciated the use of leeks instead of a slew of too-thick onions which seem to worm their way into perfectly decent breakfast items, and the use of a sharp cheese like gruyere instead of your typical swiss or feta. Having said that, there was no 'wow' factor in the food or presentation or, though I hate to say it, service. 

Our affable waiter was friendly and fairly attentive but always forgot one thing when he returned to our table, whether it was water, milk for coffee or a cloth to wipe off the random mountain of sugar that was on our table when we sat down. A simple, quickie table wipe should be automatic and certainly happen before orders are taken and though I was mostly unbothered by it, I understood when my frustrated friend took matters into her own hands and swept the sugar into her empty espresso cup since we weren't sure if our waiter would ever get to it. I'm going to assume these are rookie mistakes but as far as brunches go, while it wasn't wholly disappointing, I didn't leave feeling terribly satisfied and for about $15, I should at least be rubbing my belly in post-grazing appreciation.

Luckily, there's always next weekend."}
{"text":"I went here last weekend with a friend and it was pretty good. 
I gave Littlefish 4/5 because I really enjoyed their french toast with blueberries.  It was my first time going here and I had heard that they have pretty good buttermilk pancakes, but I had already had pancakes the day before. I ended up choosing the French toast with eggs and bacon, while my friend got their special scrambled Eggs and pancakes.   I have to be honest, I haven't had French toast in ages, but from what my taste buds can recall, this was really good and my friend agreed!  We were actually surprised that they aren't known for their French toast. 
The pancakes were fine. They tasted good but nothing extraordinary.  But that wasn't where they lost points. They lost points for their coffee. I am sorry, but it wasn't the greatest. It was a little too bitter and no amount of milk, cream or sugar could improve it's flavour. 
All in all, Littlefish is a nice low key Sunday brunch place. 

It is a cute spot in the neighbour."}
{"text":"My new favourite weekend breakfast spot. Creative, delicious dishes, great coffee and great service!"}
{"text":"Endroit chaleureux et bon accueil. Les plats sont copieux. Idéal pour un brunch dominical."}
{"text":"I'm going to make this short, because honestly this place isn't even worth the time I'm taking to write this review. Husband and I waited outside for 15 - 20 minutes and then seated in front. Awkward bench seating at two wobbly tables pushed together. Server was very friendly and coffee was great....that's about where our enjoyable experience ends. Waited quite a while for such a small place. Got the wild blueberry pancakes that had no flavor and were tough, over-mixed, and overcooked. Husband ordered the typical, nothing fancy breakfast - brown on the outside and way to soft on the inside scrambled eggs, way over peppered and tough sausage (they make it there, which would be great if they actually tasted good), home fries burnt and inedible. He couldn't stomach any of it and sent it back with another server and I ate one of the four pancakes. It was bad enough that the food was your typical over-hyped yupster garbage, but what really pissed me off was that our previously friendly server didn't even come to see us when the other server brought the food back and obviously informed her of our dissatisfaction. I still left her a tip because I'm not an asshole, but she did nothing to earn it. Needless to say, we won't be back and we'll make sure to tell our friends."}
{"text":"I'm starting to REALLY love the junction! The coffee, the restaurants, the food, the stores. What a perfectly wonderful neighbourhood! Having some friends in the area has increased my exploration of this Dundas neighbourhood 10 fold this past month.

My most recent discovery was Littlefish; a tiny breakfast/brunch spot a few doors down from 3030 and Locamotive on the north side of Dundas W. They've got a couple of the coolest staff working the front of house and a team of experts in the kitchen.

Breakfast/brunch is one thing, but what they're serving up is some next level grub. My brunch mate and I were having a difficult time choosing what to eat and decided to share a couple of items. Our first selection was the \"Jen's choice\" which was a BLT with avocado and 2 fried eggs on top. The second choice was a fattening delicious take on eggs Benedict - their take? Put fresh made hollandaise on top of poached eggs which are sitting on a layer of freshly made pierogies, mushrooms and sauteed onions. Yep, Pierogies and eggs for breakfast! Killer!

Aside from the eats their latte, bottomless drip coffee and the freshly squeezed orange juice was all tops in my books. 

Only drawback is it's a tad more expensive than your average breakfast spot ($37 for all we had) but with quality ingredients and amazing concoctions like they're cooking out the food is worth the price, and the wait!

Eatcrest Out!"}
{"text":"Littlefish was a great find in the Junction. I'm not often in this part of town so I'm glad I read the Yelp reviews before coming here. The French Toast are definately worth trying (they do taste like cinamon buns!).

I ordered a coffee with French toast and a side of bacon. All very delicious but save your money on the bacon. 3 slices for $3 is not worth it. Go to the grocery store and get a pack for $4 instead.

The staff is very accomodating and the service was quick. I would definately come back for brunch anytime."}
{"text":"Service was horrible - waited almost 20 mins for waiter to take our order and then he never asked how it was after he brought it. 
Food was OK - I had the chicken club sandwich which was okay, the chicken was kind of gross and way too salty but everything else in the sandwich made up for it. 

Also no side came with the order, not even a small salad or anything. Wasn't impressed. Prob won't go again."}
{"text":"Tiny burst of yumminess! You may have to wait in line a while, but it's worth the wait! Reasonably priced, this little eatery in the Junction is worth a visit. Amazing french toast, lattes, cider and sweet delights. 
My favourite was the Stinky Frenchman!"}
{"text":"My friends and I attempted to go here for a late breakfast after running some errands in the morning. We all had picked up some coffee from Starbucks and though my partner and I had finished ours, our friend who was driving still had a full cup. 

When we entered the restaurant there was only one other table that was occupied. No one came to seat us so we just took a seat and asked for menus. This is where our experience got really shitty really fast. The server gave us our menus then promptly informed us we couldn't have outside drinks in the restaurant. Fine, I get that. He asked to clear them from the table and my friend explained she had a full coffee, and asked if they could hold it at the back or put it in another cup for her. The server said no, and at that point told her she could either go outside or throw it out. We all felt this was unreasonable and pretty rude, so we left and got sandwiches down the street at Locomotive. It was great and no one kicked us out over a cup of coffee. :)

I would have loved to give this place a try but I don't see myself ever going back after that experience."}
{"text":"We found this little gem while wandering through the Junction area in search of food.  

It is very small, seats maybe 30 at any point.  Quiet and pleasant ambiance, local art is always on the walls and music playing softly in the background, pleasant but not intrusive.

The food is really good, and they are great about accommodating special requests.

The menu is limited but very tasty. The have a daily soup which is hearty and yummy. The breakfast menu goes on all day and includes these wonderfully light pancakes that always make we wish I had a larger appetite! 

They make a super nice chili. Perfect for the freezing weather we've been having.

My better half loves their coffee, and it must be good because he's a coffee-aholic!

They make diabolical cakes and cookies which are lined up at eye level, easily seen from your table, and hard to resist after your meal.

The service is great. The usual person is Julia and she remembers stuff about customers,  what they like and what they often order. She always comes over to make sure you have everything you need, and to make sure you are enjoying your meal. Very nice person.

Our fave lunch place when we go to the Junction."}
{"text":"We eat here every Saturday morning. Friendly server Julia keep us smiling and they don't break the bank. I like the eggs breakfast because it's fresh and not oily. One star off for reheating bacon in the deep fryer, yuck!"}
{"text":"Closed Monday and Tuesday  - but open on the weekends! I finally got a chance to come here on an early Saturday morning. It's small, but the wait wasn't too long and with good company it goes a lot faster. 

The menu had tons of good things on it, and it was supplemented by the brunch menu which has some yummy looking Eggs Benny that I wanted to try all of them. 

We both got the Eggs Benny with Perogies. Covered in the lemony hollendaise sauce (it was good), two perfectly poached eggs sat on top of perogies. But they weren't filled with anything but some potato, but it was really good. All the flavours come together. 

At the front when you pay, there is a bowl of fresh bacon cinnamon sugar donut, so incredibly tempting and one day I will be back for one of these. 

Service was quick and good, but not the type of place you want to sit to have a good long convo with other waiting patrons staring down your back. Although I never felt rushed at all. 

I'll be back for sure!"}
{"text":"What a great find!

After a relaxed Sunday noon workout, the man and I were hungry, and very ready for a solid lunch.  We are new to the area, and decided to go up to the Junction instead of continuing on Bloor West.

(Un)fortunately, the restaurant that we actually wanted to try was closed on Sundays.  Discouraged, we turned around and made our way East on Dundas.  I noticed a couple eating by the window and at the last second realized that it was a restaurant.

We looked at the menu and it was The Stinky Frenchman that caught my eye.  

Since it was almost 2pm, there was no wait time.  Booonus! 

Much to my dismay, they were out of The Frenchman, but I opted for The Skinny B*tch, and added a side of peameal bacon, and of course had my coffee.  The Man had something that had crepes in it, only because they were out of crepes, he substituted them for home-made crumpets.  I stole some, and yes, it was delicious.  It was thicker than I expected, but delicious.  And I chose caraway toast.  I was very impressed with their selection of \"breads\" as sides.  White, whole wheat, caraway, muesli, crumpet, and I forget what else, but as impressed.

The eggs were cooked just right (not too hard, not overly runny), the avocado was creamy, the coffees were decent...but it was the dessert that won my heart!  Man had a lemon fillo pastry tart topped with blueberries, I had their heirloom purple-carrot cake, with cream cheese icing.  If you aren't hungry, please, at least get the cake!!

All in all, a great food experience, cute casual decor with exposed brick walls, high ceilings, and very friendly, attentive staff with a cute sense of fashion!

Recommend and will come again."}
{"text":"Dropped by Littlefish today on the recommendation of a fellow yelper and I have to say I wasn't disappointed with the spread!

My friend was in from out of town and we were looking for some decent brunchy vegetarian options that were filling AND tasty, not always an easy find in the city, oh did I mention we didn't want to spend more than about $10 a pop?

So as I was saying.

I went in, convinced I was going to purchase the French Toast with fruit compote and creme fraiche ($8) but my eyes wandered, just for a moment to the savoury BLAT (the Jill's Choice) which also included two fried eggs in the middle of the bacon-y/avocado-y goodness. (also $8) and my mind was set.

That plus the bottomless coffee ($2.25) called for a very filling meal. The sandwich came on my choice of rye bread and was impressively stacked, I jokingly complained that I couldn't get my mouth over it and was ribbed by our server into bucking-up and accepting the mess that would spill over as part of the experience. She was right, I gave in and never looked back. 

I especially loved that the BLAT(with egg) had a good amount of bacon on the TOP and the BOTTOM of the egg heap, there's nothing worse than a place that skimps the 'B' in a BL/A/T. 

My friend chose the Mac'n'Cheese which was still sizzling by the time it landed on our table, gooey cheesy noodles covered in a crunchy-cheese topping. She was pretty ecstatic. We dug in, and everything was alright.

Service was great, we got lots of water and coffee refills and the restaurant (1pm on a Tuesday) was really relaxed and helped with the 'brunchy' atmosphere, giving us enough time to digest before we left, our wallets and bellies happy.

EDIT: Have now eaten the French Toast, was redonkulously delicious and left nary a crumb, the cinnamon maple syrup was also basically spooned off the plate into my mouth. YUM."}
{"text":"This is a beautiful little spot for some sammies, all day breakfast or lemonaide and coffees. The menu is very thoughtful, so for a twist on some classics Littlefish is perfect. 

The sams are served with no sides (a pickle would be nice :) )but are a full meal in themselves. 

The triple decker grilled cheese had some Gorgonzola and sauteed pear on the top deck which really made the sandwich phenomenal! I highly recommend it! (7$)

If you ask, they also have a really nice hot sauce that is made in TO. Went perfectly with both items. 

Will be back! Enjoy!"}
{"text":"Some of the best blueberry pancakes in town. They were definitely made from scratch and came with maple syrup. Just amazing. I scarfed them down so fast. The coffee was good too. They put a candy dish of cane sugar at every table and I was able to get soy to add, which for me is the perfect cup. The baked goods looked scrumptious so I took a green tea cupcake to-go. My only complaint was it was cold, especially when it's a cloudy cool day outside. The A/C was unnecessary. But I'm an open window girl even on the hottest days."}
{"text":"Visiting one of my favorite cities on earth and wanted to start the weekend off with a catch up session with one of my favorite people and delicious grub. Unfortunately we were a little too eager and got to Littlefish at 8:42 on Sat morning but they open at 9. We were starving and cold (ok fine, only I was cold) but thankfully Crema across the street was open and warm. We grabbed some tea, gabbed, and at 9:05 trekked back to Littlefish, tea in hand. No signage indicating 'no outside drinks'. Regardless of the tea - I need coffee with my brekkie so no loss to the restaurant. Well we were asked politely to leave or throw out the tea if we wanted to stay by the waitress. When it was explained that this weak Californian couldn't handle 18 minutes in the cold which is why we got the tea and could they please make an exception? Pretty please? We were told no. Which would have been fine except the owner then rudely and under his breath muttered...this is a restaurant not a food court. Wow! No love for visiting Americans!! I have to deal with Trump at home and this grump in Canada. No thanks. And now we are warm and happy at Café Cranberries (which does have the appropriate signage!!) Review of food to follow!"}
{"text":"Yet another great addition to the neighbourhood. Great portion, tasty food. A little small, but that's part of the charm. We will go back!"}
{"text":"I will NEVER go to Littlefish again!
Never seen such rudeness.

Always liked going for their Huevos or Benedict. Went with the family on Family Day for brunch. 

On Family Day the place was predictably very busy. Strange too then that they only had one waiter handling the entire floor.

We were seated such that my back was to the kitchen, my wife & daughter facing back towards the kitchen)
All 3 of us ordered. For a change I thought I'd try the pancakes, since I read such raves about them. I also ordered a side of 'crispy bacon' along with my main. 
They even call it 'crispy bacon' on their menu.

Our food came, but my bacon was rubbery, fatty and undercooked.
I flagged the very busy waiter to let him know I couldn't eat it, and asked if he could bring a smaller plate to take the bacon back & have it cooked more until its crispy.
Instead he took my entire plate

A few minutes later my plate returned, with the bacon slightly cooked more - 2 pieces were more done than the other 2, which were still fatty & underdone (I'll post a photo). And they were sitting in a puddle of bacon grease on my plate.

I tried to turn to flag him again, but he had made his way back towards the kitchen and was not looking back into the dining room.
Seeing that he was busy, I got up and walked back with my plate, to ask again if it could be cooked more. He took my plate. I went back to my seat.

What happened next completely shocked me!
The cook/owner (the man with the horn-rimmed glasses) brought my plate back out, slammed it down on the table in front of me and said brusquely and rather loudly \"I can't cook it any more!!\" And he stomped back to the kitchen.
As I turned to look at him, still in shock, he would look up repeatedly shoot me glares from back in his kitchen.

I hadn't complained up to that point, merely asking twice if they could just cook the bacon more. As I said, I was in shock, and enraged at this guy's attitude. My wife &  daughter were also shocked.
I finally started to eat the pancakes, and they frankly were crap. My worst pancakes at home are better than these.

I will NOT be returning to Littlefish. Ever!
There are far too many good choices in The Junction/Ronces/BloorWest to have to deal with a #$% like this.

Happy Family Day!"}
{"text":"Absolutely adored this hidden gem located in the junction. A simple, clean place with attentive and friendly service, marvellous food, and a very inviting atmosphere. I went here with three of my girlfriends for brunch and we each ordered something very different, but were all quite pleased. I had the huevos wrap, which contained black beans, scrambled eggs, jack cheese and topped with salsa, sour cream, and incredible guacamole. It also came with a side of fresh pineapple. It was amazing! The coffee was awesome and the refills were free and plentiful. This establishment is bright and features rotating art, a touch I always appreciate and look for in a cafe. It is a tiny little place and we had to wait about 15 minutes to get a table for four, but we sat on a comfy little couch while we waited--a nice change from the usual. I will definitely return to Littlefish and I look forward to trying new things on the menu. Highly recommended!"}
{"text":"I've been here a few times now for brunch, but can't bring myself to get anything but the eggs and sausages. They make the sausages themselves and they taste like awesome. My friend got a BLAT + Egg sandwich that looked pretty damn good; she really enjoyed it. They have a good selection of brunch items. The cafe itself it quite nice, though there isn't much seating. If you show up at an odd time you can expect to wait a while. Unlike many brunch places i've tried, this one made me want to come back for more. It's definitely worth checking out."}
{"text":"I think I have pretty much the same thing to say as others here already have. The food is pretty decent, they have some pretty creative dishes and they all seem pretty tasty. Serving sizes seemed a little small but our server warned us of that so at leas they were honest. If you are really hungry and grumpy in the morning before having a coffee and some food you probably shouldn't go here. You will be waiting about an hour. The wait didn't really bother me but I don't know if I will be coming back."}
{"text":"There are a gazillion places to have brunch in Toronto and this is one of them. The difference here is that Littlefish is better than most all of them.

Why? Like the rest of the brunch bunch, Littlefish has the requisite French toast, eggs Benedict and other favourites. It is also priced at about the same price point as all the rest. Like many, the restaurant is a neat space that feels comfortable.

Littlefish stands out in four ways:

1. The service is excellent. Even though the staff seem like very cool people, there is no attitude. They are warm, welcoming, and on the ball.
2. The French toast is just a bit better than the rest. Maybe it is the toasty taste of the seeds on the bread, or the fact that they actually give you enough syrup without having to ask for it. I also found the potatoes to be cooked better than anywhere else, even though everyone serves them.
3. The coffee here is better than most. It is dark and strong.
4. Portions are slightly bigger than other places. I can't say how many times I have walked away from a 20$ brunch hungry. Not here.

I cannot wait to come back."}
{"text":"All I am going to say is \"black miso marinated pork\" at the last supper club - OMG!  I fell in love."}
{"text":"I love this place!

The ambiance is very inviting and cozy, and even though the place is pretty small I've never had to wait more than 10-15 minutes for a table. Plus they have a comfy couch to sit on while you wait, so the time passes quickly! 

The staff are wonderful - super friendly and attentive. Their menu is pretty small but offers a variety, and everything I've tried there has been delicious. I highly recommend the crumpets - they come with some amazing lemon curd spread, whipped cream and jam. Sooo yummy. The coffee is great too, as are the smoothies (although they are a bit expensive). 

Definitely the best spot for brunch in the Junction, and probably one of my favourite brunch places in the city!"}
{"text":"was in the neighborhood and needed breakfast...

service was quick and friendly..
wife had the french toast and mexican spiced hot chocolate (she enjoyed both alot)
I had the breakfast special of the day (seemed like an omelette with bacon, cheese, lots of goodie veggies) and a double americano ... (my meal was good but nothing specifically memorable)

We didn't have to wait but the lineup that formed after we came in seemed to move quite fast..

Both of us enjoyed ourselves and plan to be back sometime..."}
{"text":"Service is terrible and will not recommend this to friends or go back.  We waited 30mins to get a table and ordered brunch.  People who came after us were getting served food which we found odd so we waited another 30mins before finally asking the waiter what was going on with our order.  His response \"well it takes a long time to make French Toast in the oven\" - 3 tables seemed to get French Toast pretty quickly and 2 of them came in after we got seated.  
Worst service we've seen in a long time."}
{"text":"I want to love this place! I do! The menu is a nice twist on brunchy things, without being bananas... The coffee is pretty good... And the food is totally decent (not revolutionary, but stuff like the breakfast perogi is enough of a treat). You don't always need to be creative to be tasty. The area is also in need of brunch spots, so it's a welcome attempt! 

But I hate to say, my experiences here don't seem to match the majority. I found the service staff pretty pretentious (and I've seen pretty grumpy when someone asks for anything even slightly modifying), slow (and with it being a tiny place, that means tables turnover at a glacial pace), and they have a brutal system (or lack thereof) for keeping track of the line. Places like this benefit so much from the tech of texting people when a table opens up... Or even keeping a list of some kind."}
{"text":"A cute little breakfast place if you don't want anything too fancy and just feel like a basic breakfast. The quality is good though and it's cooked with heart. 
The homemade breakfast sausages are famous and quite deserving of it."}
{"text":"Excited to get a seat for brunch after a couple of failed attempts.  
Staff were absolutely lovely and attentive.  My date and I both ordered the Junction 40, a sauerkraut and poached egg covered pierogi dish, smothered in a lemony hollandaise sauce.  We also split a Three Way (insert inappropriate joke here), which was warm buttermilk biscuits served with lemon curd, jam and whipped cream.  Both main and starter were great, but make sure you have the biscuits warm!
Will definitely be back."}
{"text":"This place is a lot better than I expected. Very nice and cozy spot. My price was well composed and the coffee was exceptionally good. The staff was very friendly and attentive."}
{"text":"I love going to Littlefish. It's a nice, little, casual yet hip brunch spot that's a quick walk from my house. I'm always happy with my brunch, be it breakfast-burritoesque Huevos, the bacon-filled buttermilk pancakes or the Jen's Choice - a bacon, lettuce, tomato, avocado AND fried egg sandwich. The desserts are always good, but I rarely have room in my belly to indulge after a filling meal and bottomless coffee.

Littlefish does have a pretty short card. That can be especially frustrating considering that once I finally figure out how to poach an egg there isn't much on their menu I can't do myself at home. I keep finding myself looking for something new on the menu (beyond the scramble of the day), something that stands out, isn't too expensive and isn't something that I could have done with basic ingredients at home."}
{"text":"VIBE 
Littlefish is really relaxed and as cliche as it sounds, quaint. Our server was delightful. She even had on a flowered dress. Very Portlandia in Toronto (in a good way. There were no putting of birds on things). 

I ATE
I had the eggs benny. The eggs were cooked to perfection, its hollandiase oozing over copious amounts of salmon and a bed of spinach. It comes with crepes instead  of an english muffin so I made mini sandwiches out of them. It was a good, hearty brunch served with some fresh OJ. 

OBLIGATORY CATCHY REMARK 
It's called littlefish but they do give you lots of fish. They really don't skimp on the salmon here. Hear Ye! Hear Ye!"}
{"text":"I want to love littlefish, it's in the Junction, across from Crema coffee, it's cute and inviting, but...I can't love littlefish. Having brunch twice at littlefish has been disappointing. The service is fine, once you get a table, but the food is lacklustre. There are signs that they are trying hard - making their own bread for the eggs benny and forming their own sausage patties - but the food is not-that-good and it's too bad because the Junction really needs a great brunch spot."}
{"text":"I felt super left out during Doppleganger week on Facebook, because frankly there are no celebrities that look like me (and vice versa). I am betting however that my waiter from Littlefish didn't have any problems identifying his... he is a dead ringer for Iron & Wine's Sam Beam!

All kidding aside \"Sam\" was a great waiter and I thoroughly enjoyed my brunch. I got the Huevos Rancheros ($12); it contains cheese and egg melted together inside a rolled tortilla and smothered with sour cream, guacamole and salsa. 

I finished my awesome meal with a yummy cupcake that was a little bit on the dry side, but still good."}
{"text":"Our go-to brunch spot in the Junction. We love the cozy atmosphere (exposed brick, cakes and cookies on display throughout), and the waitress is always so cheerful. My fiancé loves the bacon pancakes (pancakes infused with bits of bacon, topped with maple syrup - it is honestly heavenly. A must try). I usually get the eggs benny or the omelette (feature flavours are different each time). The coffee is perfectly strong. Come here early (ie. 10-10:30am) if you want to avoid waiting for a table on weekends."}
{"text":"Littlefish is our go-to brunch spot close to home, and is where we bring all of our out of town visitors. 
The food here is fantastic. And fresh. Always. 
My go-to is Jenn's choice, but I've also had the daily scramble and the pancakes (get them with bacon!). You will not be disappointed with their fresh squeezed juices. Every option seems to be based off of a simple dish, but done with a bit of a twist. The lemony-hollondaise has a zing to it that I haven't found elsewhere.
We did try the homemade sausage on our last visit, but unfortunately it was served cold.
The atmosphere is great - not too big, and not too loud. Make sure you bring a jacket if you use the bathroom downstairs in the winter - it's freezing down there!
Overall, Littlefish is awesome - and we'll definitely be back soon!"}
{"text":"A simple interior that is reminiscent of a cafeteria with pastel colours and accents, the space is functional but not warm.  This is overcome by the quality of the food.

I really love the Huevos which comes wrapped in a toasted tortilla shell.  It is a perfect balance of cheese and eggs with salsa and avocado on top.  I've never seen Huevos served like a burrito but it works. The tuna melt is also excellent.  Overall, it is a great addition to the Junction and very solid brunch spot on the west side of the city"}
