{"text":"This place is tremendous.  Great food and fun concept.  The fries are outstanding!  Service was fast and very friendly.  This might be my new favorite burger spot in town!"}
{"text":"Service was great but the burger had an overwhelming pepper crust to it. The burger was juicy but the peppery taste took over the flavor of the meat. The truffle fries tasted like chemicals so if I go back I would opt for plain."}
{"text":"Very nice burger joint!  I highly recommend stopping by and giving it a try.  The burgers may seem small, but they make up for it in height.  The fries are also yummy."}
{"text":"Small burgers with medium size taste.    Truffle fries were good.  My medium burger was grilled beyond well done and the veggie burger lacks taste. They have two custom sauces which are fine but nothing to get excited about.  They're fairly new so hopefully the kinks will be smoothed out."}
{"text":"I liked the size of the burger.  However the burger tasted bland and dry.  The fries were good. Ketchup was good.  I might try it again but not anytime soon."}
{"text":"In the age, where everyone gets online to complain about everything.  I want to praise these employees. The food is excellent. The service is excellent. Good job Little Big Burger!"}
{"text":"I like this spot! It seems like I waited forever for the restaurant to open. I initially thought that I would need two burgers because looking at the pictures of the burgers they appear to be small. After eating one burger I was full. I had the beef cheeseburger (cheddar) with truffle fries. The burger was tasty and juicy.  The restaurant was busy but everyone was extremely friendly."}
{"text":"Great spot to get a cheap but good quality burger. My wife and I loved the brioche bun and the fries were great especially dipped in their special catsup and fry sauce. You can tell the burgers were good quality and made to order. It does take a bit longer to make so don't go there if you're in a rush"}
{"text":"Pretty good little burger joint. Got my order to go (sorry no pictures), regular burger for me, bacon cheeseburger for the wife and fries to split. All in all pretty yummy. Perfectly cooked juicy patty, maybe could use a bit more seasoning, nice toasty bun. They call the fries truffle fries so I'm assuming they give a little drizzle of truffle oil on top before they serve them. They were quite good but I feel like they could have used another 30 seconds in the fryer to be the perfect level of crispy. They're definitely worth a visit."}
{"text":"This was my first time eating here, as it has only been open for two weeks now... The burgers are good and not overwhelming, gets you full without being overstuffed... The truffle fries however, were way over-hyped, imho they were good but didn't live up to how they're advertised... The only desert on the menu is a root beer float, I didn't try it, but I thought that was worth noting...   Nothing on the menu is over $5, so easy on the pocket...  I took a star away and am giving it only 4 for 2 reasons... 1.) The music is WAY too loud, could barely carry a conversation... 2.) The wait was about 15ish minutes after ordering, not long, but too long to call it fast food...  Other than that, homerun place for burgers and fries!!"}
{"text":"Burgers are great! Cooked to order.  Fries are huge...could easily be split between two adults or three kids.  Catchup is great..but was too spicey for the kiddos. More of an adult menu for sure.  All in all it was very good."}
{"text":"Didn't know what to expect...walked and it reminded me of another burger joint...similar motif.  The difference became clear with the truffle oil on the fries, the ketchup-with a yummy kick, the tiny bun and the perfectly cooked thick burger. I'll be back!"}
{"text":"This place is alright, it's more like little burger and overpriced. Wouldn't be my top choice, I give these guys a 3 star compared to five guys. They need to make their burgers larger or lower their prices. Also it takes way tooooooo long to order."}
{"text":"The name says it all...those burgers are quite little. However, they are packed with flavor and are very delicious. I ordered mine the way they make it, medium, so there was pink in the middle. I like my red meat medium, especially if I'm getting it from a restaurant that has quality food. Simply put, the burger was great! And yes, I had them put the goat cheese on there and it just all came together nicely. I also ordered the truffle fries. I will admit that I wasn't as impressed with the \"fry sauce\" as others have stated. It was just ok, nothing special. But the fries were crispy.  Overall, I would suggest you try this place. If you are famished, or just plain greedy (like me), I don't know how full you'll feel. I will say that they give you a substantial amount of fries to make up for the \"Little\" of the burger.   In addition, everyone who I encountered on my visit were extremely nice and that's equally as important."}
{"text":"I dropped by on Saturday evening for the soft opening and to my surprise, they were sold out!  My son and I came back today and ordered takeout.  He had a plain cheeseburger, and I had the burger with lettuce, onions, pickles, and swiss.  The burgers are small, thick and a 1/4lb, full of flavor, and served on a soft bun.  The truffle fries are freaking amazing....again I say amazing!  Together the burger and fries are an awesome duo, full of incredible flavor and I simply loved the experience.  I like my burgers cooked well, and I assumed they would be since no one asked, however they were not and according to the website they cook the burgers medium unless requested otherwise.....personally I  would have liked to know that being my first experience, but other than that I enjoyed the meal and it was very filling."}
{"text":"Nice, simple menu. Clean establishment. The fries were good, the burger was decent.  Like some of the other reviews noted, I was still a bit hungry after. .  It tastes better and is cheaper than five guys!"}
{"text":"Great burgers and fries, if a tad over salted but a super easy to recommend place for takeout but I feel the counter people leave much to be desired in terms of manners and polish...just a bit too crude for a business that's looking for a foothold in the neighborhood.  Again food-wise, great flavorful but slightly greasy fare with enough going on options-wise to keep you coming back as kids just love the size of these things...perfect handful."}
{"text":"Stopped here with the family. Not overly impressed to spend $40 for 4 plates of uninspired food. Seems like a bad knock off of 5 guys."}
{"text":"Very intriguing new spot in the developing Highland Creek shopping center near Publix. After passing by several times while grocery shopping, I finally had to give it a chance.  The restaurant has a location on the street that most business owners would kill for. Good food and good service will secure this restaurant's future for decades. The inside is very, very minimalist. That's not a bad thing either, just imagine your typical Chipotle design and go one level further on the bare bones. I like it, easy to navigate and efficient for staff.  While I was in line I quickly realized that l they don't offer as many toppings as most burger joints. Three people in front of me, and I heard the cashier politely say \"we don't have that\" or \"we don't serve those on our burger\" many times. Tomato? Nope... Mustard? They have tiny packets but none on the line. In total, they do have: Lettuce, Onions, Ketchup, and Pickles. Many other common burger accompaniments aren't served here. It's a bold move, and the burgers better be able to speak for themselves. Let's try it!  Ordered two burgers, one for me and one for a friend, and an order of Truffle Fries, to-go. You can view some of the pictures and see that really all they have on the menu is burger, fries, soda, and root beer. When they called my order I started walking out and did the mandatory test of a couple of fries on the drive home, was a little disappointed that they were just slightly above warm, which means they'd be cold by the time I got them home.  Sure enough, cold-ish fries. No worries, quick 10 seconds in the microwave and we're good to go. The fries, weren't my thing. The truffle fries should instead be called truffle OIL fries, big difference. All I get is the crude flavor and aroma of olive oil, and nothing more. The texture was pretty good but didn't overcome the flavor profile.  The burger was better than I expected. The patty definitely stands out on its own, very well in fact. It's well seasoned and a perfect medium well (you can specify your doneness if you'd like). I wasn't a big fan of the finely shredded lettuce that just ended up falling out everywhere. The cheddar cheese was sharp and complimented the patty seasoning. The only issue I had with it was for nearly five bucks a pop, it was a pretty tiny burger. If it were any smaller I'd consider it a slider. The patty definitely had some girth, but the burger itself was so minuscule compared to what I expected.  The beef saved this trip from being a let down, but I expected something more impressive from a place that just does a handful of offerings. I hate to say it but this place actually made me realize more how Five Guys can justify the price for their huge burgers. L.B.B. needs to step it up or that corner location will be hard to justify in a shopping center that'll be a focal point by mid-2018."}
{"text":"Small restaurant in a shopping area next to a large apartment complex, everything new and shiny and very clean!  Great burgers and large portion of fries that were excellent.  They also serve canned beer from local breweries, which is a nice touch!"}
{"text":"Great burger and fries. I'm a BIG fan of the 1/4 or 1/3 pound burger, as I don't need a 1/2 pounder. You can't get a double here because it'd be way too high to push into almost anyone's mouth.  We were met at the door and the concept was explained so we'd know what to expect. It's a non-mashed burger, so it sits quite high, but that helps it to have a great juicy flavor, with a fresh bun and good toppings. Burgers are made to order, but don't take too long. The fries are also very good, and a serving at $2.75 was plenty for the 2 of us.  Simple selection, but hey, you're here for some kind of burger, so head in and enjoy it. Really neat concept - hope it takes off in NC."}
{"text":"My burger wasn't cooked all the way, the middle was completely raw and my fries were cold. Nasty!"}
{"text":"I'm originally from Portland, Oregon so when I heard one of my favorite fast casual places from back home was headed out to Charlotte I couldn't wait!  If you're looking for a place that offers 8 million burger toppings, a menu that's a mile long or place that serves a giant tasteless well done burger this isn't the place for you.  But if you're looking for a place that cooks \"a just enough to fill you up sized-burger\", medium-medium rare with lots of flavor and simple toppings this is the perfect fit.  I hope LBB can continue with their simple menu without anything fancy and that folks from CLT will appreciate it and keep coming back.  My only suggestion is that they need to establish an additional location out of the suburbs and closer in to the city (cough, cough...Noda).  But I'll drive anywhere for those truffle fries and fry sauce."}
{"text":"My wife and I had been talking about checking out Little Big Burger ever since she saw it on Charlotte Agenda. We could not decide on any of our old faithfuls last night, so we struck out to try the new burger place.   Not an extensive menu, but doesn't need to be - hamburger, cheeseburger, or veggieburger. Boom, done. They do offer different types of cheese, and all burgers some with lettuce, chopped red onions, and pickles. I went with the cheeseburger (pepper jack) all the way and an order of truffle fries. Delicious. They also offer Camden's Catsup, which I was not familiar with, but it is a delicious escape from your everyday Heinz offering (crushed red pepper adds a little \"nip\" to the flavor).  They have fountain drinks as well as a few different local craft beers to drink, and also a root beer float! Will definitely be returning for a quick, casual dinner in the future at a great price for a better burger!"}
{"text":"This is my second time visiting and I very much enjoy this place. Burgers are cooked just like I prefer and they are not too big. The truffle fries have a distinct taste that I have grown to enjoy. Most importantly the customer service is great."}
{"text":"We love this place! We live near by so we pick up dinner here a couple times a month. The burgers and fries are always fresh and hot. Prices are great and the truffle fries are delicious!!"}
{"text":"The burgers are small but great and the fry sauce...YASSSS! Friendly staff made this five stars for me!"}
{"text":"The burger was small but amazing and filling. I was pleasantly surprised by how satisfied we all were with the burger. They give you a ton of fries to accompany your burger if you go with a combo. Will definitely go back."}
{"text":"Made the drive out from central Charlotte on opening day to wait in a line for a free burger. The name provides an accurate expectation, as you aren't going to get a burger that will inspire a nap with the volume, but the flavor, juiciness, and experience was just right. Fast casual experience is dialed in, even as they just opened, and I appreciated the open floorplan and plenty of natural light. While I can't say that the truffle fries really blew me away, the scene-stealer was absolutely the Portland's famous Camden's blue label catsup! Don't get me wrong, I liked the fry sauce too, but there is a reason they sell bottle of the catsup to take home. Stocking stuffers for this year...check!   A short menu and craft beer on the way, I'm sure this place will be a favorite for families who live on the north side of town. Definitely want to go back to try their veggie burger."}
{"text":"(actually 3.5 stars)  This burger place is pretty interesting to me. It prides itself on crafting burgers based on a \"special\" recipe out of Oregon which means tomatoes are not part of their toppings list. They make the burgers to-order and are in the form of sliders, not your typical burger size/style.  I find the size of their burgers to be perfect and just right considering the thickness of the meat. For sauces, they serve a premium \"catsup\" that's much richer than your typical ketchup and a orangeish-hued fry sauce. In lieu of them offering tomatoes, they do slather on the catsup on the hamburgers.  What's interesting to me about this place is that their menu is very small. There's the hamburger which comes standard with lettuce, pickles, red onion, mayo, and a veggie burger. They offer truffle fries as their only side (I believe you can ask for them to be made without the truffle oil but don't hold me to that), root beer floats, sodas, and beer as drink options.  The fries are very shoestring (I prefer a thicker cut fry), doused in truffle oil and sea salt. I don't find them that particularly great but I have ordered them both times I've visited. One portion of the fries is big enough to share between two people.  I tried their special turkey burger during the month of November and I was a BIG FAN of that. I think it would be a good idea if they added a turkey burger to their regular rotation."}
{"text":"First time eating here and I'm impressed! Simple menu for easy ordering. The burger is surprisingly filling and extremely juicy. The truffle fries tasted great with the fry sauce. It reminded my girlfriend of In-N-Out with better fries. Definitely coming back to try the root beer float."}
{"text":"When you're craving a burger you expect to grab that burger with two hands. Unfortunately at Little big burger, you won't need two hands at all because it's actually a slider.   The burger wasn't a bad burger, but it's ridiculously tiny! For a minute I thought I ordered from the children's menu. Their fries are very good and I'd say they're shareable. I'm not a fan of fast food being A LA CARTE, but that seems to be the \"in\" thing.   Their prices are around 4-6 bucks for a burger and about 2-3 bucks for fries and another 2$ for a drink. I doubt I'll return."}
{"text":"Pretty tasty new little burger spot (haha) in the Prosperity Church Road area. You can smell the good smells before you walk in . The burgers are small , but chunky and full of flavor. I actually haven't had an opportunity to try the beef burger. The day I went they had a special for the month of November ( see attached photo for details). I was very pleased, I could tell they formed the turkey meat there , versus used a frozen pre-cut patty. All of the ingredients they used to dress this month's special made for an exceptional turkey burger.   I wasn't too crazy about truffle fries, it may have been too much truffle oil and sea salt on the batch I got, but overall the experience was good ."}
{"text":"Sorry LBB, but this concept was lost on me. When you walk in you're hit with a casual environment that is very similar to a \"Five Guys.\" The menu on the wall is simple so decisions were easily made. I had a hamburger on a lettuce wrap with an order of truffle fries.  Calling it a lettuce \"wrap\" is generous to say the least. The burger was placed on one single piece of romaine and put into the little burger bag. There was not enough lettuce to wrap and hold a burger or the toppings.  The burger itself tasted great and was seasoned well, but didn't make me excited to go back. The concept seems to be \"little\" 1/4lb burgers. Personally, I would rather go to another sit down venue, pay double, and eat a normal size entree.  All in all, the truffle fries were VERY good, but there wasn't enough at this restaurant to entice me to make it a regular spot."}
{"text":"Came to try it out  and it's pretty good for the price and burger was tasty but he truffle fries are kinda a waste because you don't really taste the truffle and it was way too salty ."}
{"text":"The name describes it all. Fairly \"small\" burger but tons of flavor. Not a huge fan of the fries, I haven't acquired the taste for them yet. I think that the oil they're fried in gives them a slightly different taste. But overall I would definitely recommend. Perfect pricing, as well!"}
{"text":"I'd actually give it a 4.5, but service bumps it to a 5. Only small complaint is the bun is a bit thick and dense for the burger.  Very short and simple menu. Burgers, fries, fountain soda, floats and craft beer. That's it. Good selection of local craft beer.  Burger perfect at medium and cooked to order. Fries thin, little crunch and perfectly salted. Staff very friendly and personal."}
{"text":"I'm a fan. This place is clean and well organized. They have a veggie burger although I prefer the meat. The prices of the burgers don't bother me when I consider how good they taste. Plus they are 1/4 lbs. which is bigger than what you get at the other major burger chains like Five Guys. It sure does look small because the patty is smaller in diameter but thicker which then calls for a smaller bun size. Isn't that good? Less bread, more meat? Also the truffle fries are the bomb as long as you like truffle oil and they're a generous portion. Beers are a little on the expensive side, but it's not a big deal really. I like supporting small businesses so I will still get them if I feel like getting a drink. The menu is pretty simple and small, which could be a good or bad thing depending on how you see it. Yes, there's not much for someone who doesn't want a burger but at the same time a smaller menu ensures better quality. Bathrooms are clean and spacious and both men's and women's have changing stations."}
{"text":"This isn't your ordinary McDonald's burger, thank god! The menu at little big burger is straight forward and À la carte. There are plenty of toppings to choose from that are fresh picked and diced in front of you. There is no guessing game when it comes to quality as everything is cooked in the open kitchen and grill right in front of you. Don't expect to go hungry when you leave. The price point fits the ingredients and portion sizes of every item on the menu. I personally loved the fries, but could do without the fry sauce (personal decision, my gf loved the sauce). To me the un-topped fries were plenty for my taste buds."}
{"text":"We saw the menu on the side of the restaurant recently and were surprised to see such a boldly featured veggie burger! We had to try it!  The burger comes with a long list of toppings - cheese is extra and sorry vegans but the burger is only vegetarian friendly.  We ordered one each as well as a single order of truffle fries.  The cook/cashier seemed surprised by this - maybe because we are large but once we got the side it was more than enough for two unless you're just a major fry fiend.  The burger was shockingly good!  It held together nicely (a sure sign of a vegetarian burger over a vegan one) and the taste was great!  No extra forced smokiness, no signs of it being JUST a black bean burger or falafel burger like most restaurants.  Truthfully it was one of the best veggie burgers I've eaten!  The tables are nicely laid out and both the ketchup and the fry sauce are something special.  Towards the end of the meal, the truffle part of the truffle fries came on a little strong but I personally would rather things be assertive than bland so kudos!  All around positive experience from service to food to location and all!"}
{"text":"Not for me.  My mom tried this burger at the Moo and Brew event in Charlotte earlier this year.  She said the burger was very good and she and I went for lunch today.  I ordered the cheese burger with cheddar minus pickles and catsup.  This place doesn't have tomatoes and substitutes with catsup instead.  I'm glad I skipped the catsup; it is on the spicy side.  I also requested my burger to be well done instead of the usual medium, but my mom's burger was fully cooked.  The bun was great and on the smaller size.  Think of the burgers here being quarter pound sliders.  For some reason, I didn't feel psychologically excited about the burger, even though it is bigger (in weight) from its competitor, Five Guys.  Despite being a well done burger, it was juicy.  That's the only thing going for it.  I didn't find the meat to have any flavor, though that may be my fault in the way I requested it to be cooked.  I bit into my burger and it had pickles.  And it didn't have onion.  Despite the receipt being correct, my burger was not.  The fact that my burger was wrong, and I like accuracy, didn't help improve my first visit impression of this place.  The truffle fries tasted like rancid olive oil.  I would order them without the truffle oil next time."}
{"text":"I really wanted to like this place because it's so close to my home. However I didn't have a great experience. Wife and I ordered two cheese burgers and truffle fries. Bit into the burgers and they were completely raw in the center. Brought them to the counter and the manager apologized and put two more on the grill for me. He used the opportunity to train his staff right there. The fries were okay. All in all, i thought the portions and quality were lower than 5 Guys while at the same price. I think i'll wait a while before giving this place another try."}
{"text":"I came here for the first time for lunch.  It was day 4 of being open.  The staff was really friendly, welcoming, and helpful in explaining the menu.  It is a fairly simple menu and easily to follow.  The cheeseburger comes with onion, pickle, ketchup, and choice of cheese.  I chose goat.  I asked for my burger medium well, because it comes medium by default.  It was still not done enough for me, so I would get well next time. It's a small burger that fills you up.  It has a good flavor and the bun was a little sweet which I enjoyed.   The truffle oil fries were delicious.  They are cut thin and very crisp.  They have ketchup, which is different than the normal ketchup and a little on the spicy side-I liked it! They also have fry sauce which reminds me of an aioli sauce....kind of, not bad.   I'm glad I work nearby and will be back soon."}
{"text":"I don't know how I haven't tried this before, it was so good! From the moment you enter to the second you leave it's nothing but excellent customer service. The gentleman taking our order was so helpful and patient as we decided what we wanted. I ended up getting a cheeseburger and added goat cheese, bacon and a fried egg. The fries are truffle fries and had such a delicious taste and were cooked just long enough. I will definitely be returning to eat here in the future."}
{"text":"I stopped by this place after work out of curiosity because it was new and had a \"hip\" appeal. The menu is simple, and everything is a la cart. I'll give it  to them, their little burgers are packed with big flavor. But at a quarter pound of meat and tiny buns, it left me feeling still hungry, and with higher prices I couldn't see buying another burger. Maybe next time I'll also get the fries."}
{"text":"The sauces were great and the fries were crispy with a unique taste. The burger was a little dry. It took a long time to get our food even though it wasn't that busy on a Saturday."}
{"text":"Burger was cooked perfectly. The right temperature is everything and they definitely hit the mark for me I'll be have lunch/ dinner here more often. And the service was polite and fast they kept a smile the whole time."}
{"text":"Call me a Little Disappointed.   Friendliness-Great. One of the owners was there working hard. Counter help and the cooks seemed to be happy.   Cleanliness-Great. Everything was fresh and new.   Music/Ambience/Decor-I'm all for simplicity but the space dwarfs the few pieces of \"art\" on the wall. Music was modern but way too loud. I couldn't communicate with my inner voices over Taylor Swift's song.   Food-Disappointed. The burger, even though It's a 1/4 pounder it presents as a slider. The ratio of cheese to patty was less than desired or expected. I asked for medium well but was cooked way beyond that. Due to the size of the burger patty the ratio of toppings wasn't quite there. You have to add some extra condiments if you desire. Bun was decent but overwhelmed the meat. Took 15 minutes even though we were the only order at the time. I'm sure this will improve but may not be the best scenario for a quick lunch. It's not like the burger was horrible. It just was disappointing. I'm a grown ass adult and want to eat like one. Not some baby slider.   The fries, which were touted online and previous reviews as the greatest fries on earth were nothing more than frozen fries with a little bit of flavoring. Not impressed. They do give a decent sized portion so one side should feed two.   The homemade \"catsup\" and \"fry sauce. In my humble opinion. Why mess with ketchup unless you have a superior product?  You fall into either two camps. Either you're a \"Heinz\" person or something else. Unfortunately the homemade catsup fell well short of this benchmark. The \"fry sauce\", well it's a 1000 island chili sauce hybrid minus the sweet relish."}
{"text":"Checked this place out, and I really enjoyed my burger!   The décor is simple and clean, more of a \"fast casual\" than a tavern, but that's ok.  They had a nice selection of craft beers and the usual sodas and soft drinks.   I asked for medium rare, and it was perfectly cooked, a very good start for a burger. The toppings were fresh and the bun was fresh and tasty. I got the truffle fries which were excellent, and I enjoyed their \"fry sauce.\"  High quality meat and expertly prepared, a very solid burger place!"}
{"text":"I've been wanting to try this since I saw that it opened and boy am I glad that I finally did.   The staff was super friendly. They have a pretty simple menu, but it doesn't need to be anything more. I got a double cheese burger with goat cheese, bacon, and a fried egg on a lettuce wrap. My husband got the same thing but with pepper jack cheese instead. We both liked the goat cheese more.   The burgers were amazing. They were seasoned great and tasted incredible. I ordered mine medium and I did think it was a little over cooked and I thought the same thing about my husband's medium rare. All of the sauce and condiments seemed to fall to the bottom, but I think that's just the nature of the lettuce wrap. I also asked for no pickles and they put pickles on mine but not my husband's. It was easily fixable though. Both the catsup and fry sauce were amazing as well.   I definitely thought that people exaggerate how small the burgers are. They're really thick and not much smaller around than other burgers.   All in all the food was delicious and we will definitely be back!"}
{"text":"Little Big Burger packs a big, strong punch!   I came here for a quick lunch with my boyfriend. When we walked in, it was empty so I was able to see how large the dining area truly is.  The menu is very short and simple. Me and the boyfriend ordered a cheeseburger with bacon added. I got mine wrapped in lettuce, which is a great option!  When I first saw the burger, I was disappointed. The size was a combination between a slider and a full size burger. Once I took a bite, all my worries disappeared. The meat was very filling. It was also juicy. It was cooked to perfection (medium well) and I loved that it had the \"fresh off the grill\" flavor. The price is spot on with their competition.  Overall, I would definitely return. The only downside is that I wish they offered other sides except fries."}
{"text":"We have visited the new Little Big Burger at the intersection of Prosperity Church Road and Ridge Road 3 times and have been pleased with the food and service. The burgers were good quality ground beef (sirloin, maybe?) and cooked to order.  The burgers appear to be a little smaller than those at other places, but they're pretty thick. Depending on how hungry you are, one might satisfy you, but we tried two apiece when we were very hungry. They were somewhat greasy, so we used extra napkins to soak it up before taking a bite. Flavorful! We didn't try the fries because we're trying to cut back on calories. The staff was friendly and got our orders right, as anyone should. The dining rooms and bathrooms were clean. It's a good place for adults and kids and you can get out in a hurry. Thumbs up."}
{"text":"Boodle and I tried Little Big Burger last night for the first time. It's been on our list, as we live pretty close. We are always excited about non-chains that pop up in the area.  They have a really simple menu, which I appreciate. We were greeted immediately when we came in. A member of the staff explained the meaning behind the name -- \"little\" because their fresh, brioche buns are smaller than most buns, and \"big\" because they don't flatten the fresh beef. I'm diggin' it.  I ordered a cheese burger with swiss. The burger comes with lettuce, pickles, onions, and maybe something else? I didn't get pickles because I don't really like pickles. Boodle and I each ordered truffle fries, but we easily could have shared one order.  The burger was cooked medium, which was great for me! You can choose how you'd like your burger cooked. The meat was really fresh, and the bun was delicious. I will definitely be going back to Little Big Burger.   I highly recommend this place if you need something quick and inexpensive but don't want to settle for low quality food."}
{"text":"I finally checked out this new place in the neighborhood. I am giving it a high rating because of the energy of the greeter at the door. I love when people are passionate about their businesses. It's a neat model - they are looking to make this a franchise in the future. I don't eat hamburgers; therefore, I had the veggie burger. It's a simple menu, so that was my only option. They said the cheese is what made the sandwich, so I will need to try it with something besides cheddar. I wasn't a big fan of their fry sauce. I thought it covered the truffle flavor, but enjoyed the fries. Definitely try the truffle fries, but it's better to share because of their size."}
{"text":"I am so excited to have this new restaurant join the prosperity community!  Came in with a party of 4 on a Sunday afternoon. The place sits in a corner space with lots of windows. It was nicely lit with natural sunlight. It is a sit yourself dining area and you order at the register.  They have an open kitchen and there were many hands busy at work.  First off, the menu is small just as the burgers are small.  So keep that in mind.  It's not a huge elaborate menu with a ton of options and the burgers are not gigantic and overstuffed as many burgers tend to be these days.  However, I found that refreshing!  I didn't agonize over a ton of options as my indecisive self usually does.  I ordered a hamburger just how it comes (lettuce, onions, pickles and catsup) and an order of truffle fries. My husband ordered the cheeseburger and one of the other members in my party of 4 doctored up her cheeseburger adding blue cheese, bacon and mayo. We all ordered truffles fries.  I can only speak in details about my meal and it was 5 stars for me. While it was simple and small, the flavors of the beef were very good. My burger was well seasoned and cooked well throughout but not dry at all.  It had a pleasant slight crunch on the exterior of the patty as if it had been pan fried but it was juicy with every bite. The brioche type buns were warm and toasty. The toppings were not abundant but just enough to satisfy. The whole thing came together perfectly.  Now, the order of truffle fries are huge!  Like an extra large if you think of chain restaurant fries. They are thinly cut and crisp.  The truffle oil flavors are mild but do shine.  Fries were awesome!   The menu does include a veggie burger which I intend on trying next. Will update my review once I've done so."}
{"text":"Good burger, brioche buns are yummy, but felt like there was something lacking in the flavor department.  The only sauce on the burger is their \"catsup\" which is somewhere between ketchup and a bland barbecue sauce.  Got one burger wrapped in lettuce but it was so drenched in the catsup that I couldn't pick it up to eat it.  Had to resort to a knife and fork.  Also tried their special turkey burger with cranberry catsup and Brie cheese.  Meat was seasoned well but couldn't find any of the previously described flavors.  Truffle fries were good, but without regular ketchup, the kids were a bit put off.  Fry sauce is ok given lack of other options.  Would eat there again, it's just not good enough to be a regular spot.  I'd rather pay a little extra and go to Bad Daddy's down the road."}
{"text":"OK,  first visit today.  Got there about 11:10 to avoid the crowd.  Ordered the Cheeseburger with everything and chèvre cheese, fries and a drink.  Came to a little over $10 so not to bad on prices. Took about ten minutes to get my order even though place was pretty empty , but that's OK because everything's cooked to order.  First the truffle fries.  Best fries I've ever had and the fry sauce is awesome.  You get a huge amount , more than enough for two people.  Burger was cooked perfectly and actually bigger than I was expecting.  Bigger than a slider but slightly smaller than a regular burger.  The patty itself is actually very thick, its exactly like in the pictures.  No lie, it may have been the best burger I've ever had, awesome.  Only negative, they had the background music turned up way too loud. Other than that I've give this place ten stars if I could.  Update. Second visit today. They corrected the sound issue.  And they are now selling beer"}
