{"text":"Best Caribbean food I've had yet. The prices are cheap and I have never been disappointed. The poutine is the BEST I've had in the city. A lot of bang for your buck."}
{"text":"For the price not bad. However chicken quality did not taste fresh. I had to jerk chicken with the rice and beans. Rice and beans was very good but jerk chicken seasoning tasted terrible. I've had better at Ritz which is minimal quality."}
{"text":"Worst food I have ever eaten. The so-called jerk chicken is loaded with salt and MSG, and the jerk sauce is sickly sweet. I will have to dispose of mine. I wouldn't even give it to my dog. Those chickens died for nothing! At least it was cheap, but it wasn't even worth what I paid. I don't get why this place has 5 stars on Yelp. That's total BS. Excuse me while I scrape the MSG off my tongue, and nurse my MSG headache."}
{"text":"Worst place you go there your going to the bathroom right after plus they never have food a hour b4 closing time"}
{"text":"For the price you can't complain. Its very cheap. The jerk chicken was good. My one complaint was the rice was a bit off... I buy it for the jerk chicken so it is what it is. Definitely check it out!"}
{"text":"We stopped in today and I had Jerk Chicken for the first time in my life, and it was excellent. A 3-piece chicken meal with rice for $6 can't be beat!"}
{"text":"I just had their Friday special which is fried fish with steamed rice for $4.50. The fish was okay. Very small piece and lots of bones. What disappointed me the most was the BBQ chicken I ordered. The chicken was hard and dry. Only one piece was edible. I shouldn't have to chew on a chicken leg like it's beef jerky. The vegetables were also very over cooked and bland. The rice and peas were just OK. This place used to have good food. I don't know what happened. I wasted my money here today. I should have just gotten Popeyes next door."}
{"text":"good price and good food. 3 peices of jerk chicken, rice&peas, jerk sauce and veggies 5$"}
{"text":"I was intrigued by the sign that said that this restaurant offered Khmer and Caribbean food.  I have never really eaten Cambodian food, but figured I would give it a shot.

I got the medium Jerk chicken with Fried rice and steamed veggies.  It was not the best take out I have ever had, but certainly had good flavor (except the steamed veggies were begging for mercy a little bit).  Living Well is worth a shot if you are in the area and the price is right.

Very limited seating at a bar against the window.  Expect to carry out."}
{"text":"Didn't taste like jerk chicken for me. It was more like chicken with barbecue sauce. Major disappointment."}
{"text":"My go-to spot for a quick meal when I'm craving fried chicken. I always get the fried chicken mini-meal with rice & beans and extra red sauce. All that for only $3.50! There's larger options if you're more famished but the mini-meal is more than enough for me as the rice really fills me up. There's little to no seating so I usually get take out. Service is quick and friendly."}
{"text":"Ok I had to go here gain a few more times o justify my review. The food here is delicious don't be fooled with the location! The food here is fresh because of the high traffic. It's very affordable great food for lunch I usually swing by Tuesdays (expect line ups) their special is 2 pcs of friends chicken for $2.50 I usually pair it up with white rice with  peas Extra $1 and coleslaw salad extra $1. The food is very good I keep going here the only reason I didn't give a full 5 stars is the service could be better the girl there with the big pink weave if you see her don't bother ordering she too busy flirting with the inhouse chef. If you have special request like type of sauce or type of chicken they will most likely get this wrong they never got it right for me and because I'm in rush I don't check it there that's my fault wrong every order. It's fine to me as food is good but be sure to double check if taking out!! It's too small to dine in 4 chairs I recall."}
{"text":"Quick and delicious food, jerk chicken is delicious. The food is all takeout, no space to really eat inside. But nothing to complain about"}
{"text":"My fave on the go spot! Food is delicious! I go anytime any day and the food will always be on point! Service is quick and thorough! This place is always busy because the food is amazing and also well priced but it never feels like I have been waiting for a long time because the staffs work quick!"}
{"text":"My Order: Jerk Chicken w/ Rice & Peas and Jerk Sauce (mega-size) 

Pros: 
- HOLY DELICIOUS. Sweet & spicy? God, I need to eat Caribbean food more often
- Some of their deals are insane. $20.99 for 10 pc chicken, 2 bowls of rice, coleslaw & water? How is that not cheaper than fast food... 
- Parking galore 

Cons: 
- It is attached to the jane/finch mall...

I was sad to see that I wasn't able to check in...only to realize that Yelp doesn't have this business listed?! It is truly a diamond in the rough."}
{"text":"I have only discovered this treasure, because my sister knew about this secret lovepot through her co-workers.

The menu is quite extensive, so of course I went with the cliche - JERK CHICKEN & RICE.

Let me tell you this is the best delicious spiced flavoured Jerk chicken that I have ever had.

It has a delicious sweet and spicy flavour that is absolutely unreal. 

I am still craving it - I ordered a large quantity and thankfully they only do take out, so it was easy to take home. 


I can't wait to go back!! omg - droool."}
{"text":"I love Living Well! Everytime I walk past the restaurant the aromas of the food just draws me in and I end up ordering the Jerk Chicken. I've also ordered oxtail, fish and curry goat in other occasions and I was impressed. I love how the meat is well cleaned . Their prices are inexpensive. I also love how its always busy. Good vibes!"}
{"text":"The food / price ration use to be great but as the business grew, sadly their service and quality got worse. They give you less while charging more now. The taste is great but the service is still lacking."}
{"text":"Giving the two stars based on what could have been. Showed up and there was no jerk left, so I was relegated to the last few pieces of fried chicken with rice and peas. Didn't get any slaw or veg either, just a little too much red sauce. I'll probably have to give the place another chance, but a little disappointing."}
{"text":"I had high hopes for Living Well, but I was really disappointed in my experience this afternoon. The food wasn't particularly bad, it was just unremarkable. The rice and peas was a little dry and flavourless, the coleslaw had too much mayo and was a bit watery and the jerk felt really uninspired. Less jerk chicken, and more like a sweet and spicy glazed chicken that lacked any character. That being said, you can count on generous portions if that's a silver lining?"}
{"text":"Very busy establishment but I can honestly see why...the food is amazingly cheap & good quality. I ordered a mega jerk chicken meal ($9) & it can easily be shared between two people. The jerk chicken meal also comes with rice & veggies & it all tasted out of this world...would 100% be returning to try more dishes."}
{"text":"The only place I know to get Cambodian & Caribbean food at one place, the best combination to me. This is the epitome of a \"hood spot\" classic meals for dirt cheap. The meals are also quite big and filling considering the price. Most jerk places will cost you at least $8 for a small meal. Here you can get a large and a drink for less than that. My only complaint is minor, sometimes the rice is off to me. Not that its stale or bad, but I think they just use a different type of rice that I'm not accustomed to. It's all good though, everything else is bless. I've been to the Jane-finch, rexdale locations often, the one on eglinton just once, although I think that one might be of different ownership. Regardless, probably the best value for your buck if you love Jamaican and/or Cambodian food. You can't find that anywhere else!!"}
{"text":"Got today's special (mini chicken curry) with rice and peas and as always it hits the spot and taste fresh and the ingredients are all great. Love this spot"}
