{"text":"My go to place for beer excellent selection. Plenty of good times to be had here. The one bad point. I'm apart of the beer tour for winking lizard. The beers don't cross over from Lizardville & winking lizard."}
{"text":"If you like the Lizard, this will be like a weekend cruise vacation for you, you will love it. Make no mistake, this is a Lizard. Really bad service culture with irritating quips by 20 something servers when you ask where your food or drink is after a very long wait. Very mediocre food, only combined with mystery overpriced liquor and beer you have not heard of. Grow up, give up on this fad lizard thing and patronize locally owned establishments that want you back and show you their appreciation for ypur patronage every time you visit with service and higher quality."}
{"text":"I wish I could remember the gentleman's name that helped me a few days ago, however I went in to pick up some local Ohio brews to take to family in Michigan and he was very helpful. I'm a huge IPA and Pale Ale fan, but the recipients of this beer are not, he helped me find a few beers, let me sample a Draft which I purchased a growler of but was never pushy. His knowledge and patience was greatly appreciated."}
{"text":"The best bar in Cleveland!  The whiskey and beer selection is amazing!  I am always amazed at the servers ability to pick out the best beers for me, no matter how strange the style is.  Great selection, great service!!!"}
{"text":"I stumbled over Lizardville a year ago and have returned many times since. 

The highlight of the place is the beer selection, both as a rotating tap and the around 500 bottles they have in the store (aka right where you are sitting).

The food is very good, the desert waffle is worth the price of admission alone.

Price wise, the food and most drinks are well priced, but if you start to venture into the premium whiskeys and beer you're going to rack up a tab quickly. DO NOT just order a beer without looking at the price. What you think would be $3-4 could end up being $15-20; for me that's ok, but I have heard some people complain about this.

This along with Melt are two of the locations I take any visitor to Cleveland."}
{"text":"I travel to Cleveland every other week and lizardville is always a must for an evening.  Was there last week and they change the food menu, now it's just a nice bar with bad bar food like winking lizard.  Will have to find a new place, sorry for those who never had a chance to go there when the food was great, really added to the nice whisky selection"}
{"text":"Best beer and whiskey selection around. Very alcohol-educated staff, also very friendly and chill. Food is also excellent, but not as good as Redbreast 15 on a distilled ice puck. Beautiful."}
{"text":"Absolutely great beer selection. Great whiskey at many price ranges. Pick your beer and they chill it for you. Only problem I saw, EXTREME beer snobs. It gets really annoying after a minute. Take some friends(and a bunch of money) and have fun finding new things."}
{"text":"Wow... If you're in Bedford you have to stop here for a great selection of craft beers. I'm not a whiskey drinker, but if you are, they also have an immense whiskey selection as well. If you like craft beer or whiskey you won't be disappointed!"}
{"text":"How does that saying go?  Objects in motion tend to stay in motion?  Well, the object would be the housemade seasoned potato chips and the motion would be the nonstop picking up and shoving said chips into my mouth.  Damn they are good.  Lizardville is a beer and whiskey lovers dream come true.  It is technically a retail shop that decided they had too much of a good thing going not to expand it into a bar/restaurant experience.  There is a bar inside and outside with barrels and chairs.  Pick any beer you want and they will chill it in 3 to 4 minutes.  Or peruse the binder full of whiskeys.  The food menu is small but delicious.  Standouts include the beer cheese dip (hello stick-to-yer-ribs) which is flat out delicious.  Margherita pizza was good, not great.  We enjoyed the outside seating and TVs.  Of course who can leave without custom picking your own brews to take home?  Grab a wooden carrier and off you go.  I cannot wait for this place to open a location in Downtown Cleveland.  Bravo!"}
{"text":"We stopped in a few months ago to pick out a few random beers to bring home. If we didn't live over an hour away, I sure that our livers would be petrified by now. The beer selection is awesome and the bartenders are wonderful! Less than twenty minutes in the store and it were as if I had known this guy forever. He had me laughing so hard my cheeks hurt!!!! We always make a point to stop in whenever we are near Bedford heights! Dinner next door at the restaurant is always amazing!"}
{"text":"An all-around good gastropub experience, and then some.  A limited but delicious menu, bottled and draft beers exclusively from microbrews, flights of whiskey...let's repeat that, shall we...FLIGHTS OF WHISKEY.  And unusual whiskies on tap, hundreds of them, for your drinking pleasure.  Also cigars, but I haven't indulged yet.

Go get: today's mead or cider on tap/by the glass (because where else do you have that option?), whatever your server recommends off the beer list, the Shrimp Potstickers or the Langostino Lobster pizza for seafood, or some Chicken or Beef sliders, and one or those whiskey flights so you can finally understand the goddarn difference between bourbon, rye, and different styles of Scotch (and so forth).

Downsides/Warnings: Sometimes service can be a bit slow and it's small.  Also, the parking lot, shared with the neighboring Winking Lizard, is not enough room on some Fridays/Saturdays.  Lastly, if you are vegan, you'd better like fries--that limited menu might make it hard for people with other dietary exclusions.  Fingers crossed that they add a bean burger or something for you guys."}
{"text":"Obviously they have an awesome beer selection. Love that you can make your own six pack or pick one off the shelf to enjoy after they quickly chill.

Monday and Tuesdays they have their mini sandwiches on special for $2.25. I ordered the mini fish, chicken, and Black Angus burgers with fries. The fish mini could have used some tartar sauce but was delicious. Chicken and burger were very good as well. Eat them!"}
{"text":"Food is good but the service is SO SLOW. Took 10 mins for anyone to notice I had walked in and sat down. Waiter seemed to forget about us. Then the food took forever to come out. And it wasn't even that busy. Don't go hungry.

Arrived at 8. 9:20pm, still waiting on dinner. Wrote this review at the table."}
{"text":"Service was substandard.  Bartender was unfriendly and not very knowledgeable about the beers on tap - like she was bothered if you asked a question.  Beer selection was pedestrian for a place that brands itself as a specialty beer place.  No free tastes for tap beers want to charge for a five ounce pour as a taste.  Who needs this place"}
{"text":"Kind of a cool place, but every bartender there thinks they're some kind of rockstar.

[ 2018 UPDATE ]

I've been here a couple times recently and here is my constructive criticism. 

- There are certain rules for opening and chilling beers, which is not a problem, but there isn't anything posted that states the policy. And I've never heard a bartender explaining to anyone the policies. It's just assumed that everyone knows what to do. 

- They have a bunch of beers and whiskey available and they put this huge binder in front of you. Took me 5 minutes to realize 99% of the binder is whiskey and they have their eight or so drafts listed on the first page. Why do I need this huge binder sitting in front of me the whole time?

- You would think a place like this would have top notch bartenders. I was there last week on the patio side of the bar. After waiting 10 minutes I had to get up and find someone to order a drink. Now they know I'm here, so a bartender has to show up eventually to see if I want a second correct? One of the guys with a \"man bun\" comes over to our side... all flustered because they had more than their normal regulars there. He talks to the two regulars he knows and then leaves without seeing if anyone on that side of the bar needed anything. Totally amazing, since it appears to be the same crew the few times I've gone there. Who manages this place? Explain to your bartenders that everyone is not a regular and the more liquids you sell, the better. Bartenders need to totally step up their game.

Just my 2 cents."}
{"text":"If you like whiskey or whisky, you won't be disappointed. 
Has a patio in the back to enjoy a drink and a cigar in the summer."}
{"text":"I frequent this location more than the Rocky River location, even though I live in Rocky River.  It is because I work In Mayfield, and we like to go here after work.  Both locations are awesome.  I digress...

This was my first Lizardville, and this is where we started our love affair.  The staff rocks out loud.  The food is usually excellent; I've only had a few things that I thought were just \"OK\".  The beer cheese dip is incredible, and the cheese and sausage board is equally delicious.  

This is heaven for beer lovers, whisky lovers and good food lovers. Enjoy!"}
{"text":"Beer heaven.  Located right next door to the Bedford Heights Winking Lizard, this place is a gem.  The store offers over 400 beers from around the world and well over 100 whiskeys.  Not sure if you'll like something?  No problem!  This isn't your neighborhood liquor store - you can sit down at their bar and have a taste!  They will chill anything in the store in minutes and the staff is excellent at making recommendations if you want to try something new.  They will also fill growlers (no matter the brand) and have a small menu to help sop up the alcohol you'll undoubtedly imbibe.

Oh.  And the prices are unbeatable.

The only downside is that they don't have a huge amount of seating - a small bar & a couple tables inside.  In good weather there's seating on the patio.  And the menu is small - just enough to keep you from trouble.  But then again, if you get hungry you can always walk over to the Winking Lizard next door...

The \"downsides\" are more than made up for by the great service, amazing selection and the ambiance.  You might find that it's impossible to just run in, grab a 6-pack and leave."}
{"text":"Best bar in town .. No one has the depth of single malts ... Love the service ... Smart and friendly"}
{"text":"We were in the area visiting family and really wanted to check out either a brewery or a cool tap room. Lizardville came up as a suggestion. Honestly, when I first heard the name, I thought maybe it was a Mexican restaurant. Is that weird? I'm not sure why I thought that. 

Anyway....what a cool place! The first thing that I noticed was the yummy smell. I am not sure what it was that smelled so good. It wasn't beer. It almost smelled like a bakery. The walls are lined with beer. They are all categorized by style. You choose what you like, they stick it in the chiller (or whatever it's called), and you have a cold beer in about 5 minutes. They have a decent tap list. I fully admit that the beer snob shines with tap lists. There wasn't anything on the list that I had to get. My goal was to drink beer that I haven't had or can't get in MI. It wasn't a huge tap list, but had good variety. Their whiskey list is massive. I'm not into whiskey so I didn't try any of it. 

We sat outside on the patio. They have a nice outdoor fireplace. It was kind of weird that people could smoke cigarettes and cigars out there. Staff was attentive and nice. 

The prices are reasonable. I didn't see the tab, but it appears that they sell the beer for the same price it is if you were to buy it to go. That's another great part of this place! You can buy any of the bottles on the wall to go! We didn't get any, but it was a great option, especially after the liquor and beer stores close. 

We will definitely stop in again during our next visit!"}
{"text":"Amazing selection of whiskies and beers! Not sure what you want? Ask Krista. Helpful staff makes this an incredible experience."}
{"text":"Amazing place. As someone who loves sour beer and loves whiskey, I felt like I was in heaven. Really great atmosphere as the lighting is dim and it feels cozy. The only reason this is a 4 star and not a 5 star is because the menu is small... That being said, it is a whiskey and beer place and they are great at that so I can't complain. Check it out!"}
{"text":"I absolutely love the vibe and ambiance of this hidden gem, especially the patio :) the selection of beer is absolutely incredible!! Joel is knowledgable, funny and definitely one of the best bartenders I've met today. Wings were delicious for a night cap too. Can't wait to come back with good friends soon!!"}
{"text":"This place is good place to go if you're a craft micro brew beer geek. I'm from San Diego so it's in my calendar blood. I like how the website lists the beers they have. Don't be surprised if some are sold out. The guys were incredibly nice to me and very helpful in getting my list of beers

There's literally 500 different beers. I didn't event get to the whiskey! 

Bells two hearted IPA was awesome. They explained it's not West coast style so I wasn't taken aback by the taste. And they have Southern Tier Oat which my friend said is out of print! 

Anyways this place really stuck a nice vibe for my brief stay in Ohio."}
{"text":"I am a huge fan of winking lizard, and beer. Went here with friends hearing rave reviews. I will give them credit for a great selection of bottles, and alright food, but the guy helping us was not friendly, and downright insulting. I had to yell my food order to him and when I asked him to come closer he asked if I had something embarrassing to say. Their Belgium waffles are good but nothing special...my food was overdone and dry...chicken and waffles. Black bean burger excellent, if a bit too spicy. Go for the take out beer, not the service or menu diversity or quality of preparation."}
{"text":"This place is so cool. Just do yourself a favor and go sit at the bar. They have a head spinning amount of scotch, whiskey, and rare beers. Awesome. The staff is super friendly, knowledgable, and helpful."}
{"text":"Several months and countless visits later, still a solid 5-star review.

The food menu is fitting - slightly refined yet comforting bar food. Beer Cheese Dip served w/ Soft Pretzels + Garlic Crostini, Flatbreads, Mini Black Angus + Bratwurst Burgers, etc. Everything I've sampled has been delicious - especially the Beer Cheese Dip, as I cannot imagine anything better to compliment a pint (or three). . .

Lizardville expanded a couple months ago, adding a side room with a handful of tables as well as cleverly rearranging the retail register to a more accessible location. Throughout these colder months, they enclosed the patio with plastic lining so those that would like to enjoy cigars with their beverage of choice, can.

Something worth noting: Lizardville strongly enforces a 21 and over policy.  This means that no babies, no kids, no teenagers, no one under 21 are allowed (unless it's simply for a quick beer run). No exceptions. I learned this the hard way when attempting to have a late lunch with my sister and her 8 month old last weekend - they were nice about it and we just ended up walking next door to the Winking Lizard.

So, basically - if you have not yet gone to Lizardville, GO. Just be sure to get a babysitter."}
{"text":"This is probably my favorite Lizardville location.  As with all Lizardvilles, they have an amazing selection and a very helpful and knowledgeable staff.  I still say a location needs to be downtown right by the casino, with those garage doors that open.  It would fit in perfectly and I would frequent that location more than any other.  It's a very unique place too so it would create some buzz with locals AND tourists."}
{"text":"If you're a beer lover (not me), this place will be like heaven to you! It's pretty much a beer grocery store + restaurant + bar. Once you walk in the restaurant, you have 2 ways of ordering your beer: ordering it on draft by the bar or shopping for the beer you like and having the restaurant chill it for a couple minutes for you (or bring it home!). 

I love the idea that you walk into a store with thousands of beer selections (all types from all country), pick up the 1 (or 2 or however many) beer you'd like to try for the night, and walk to the back of the bar to hand the cashier your beer of choice. He will then chill it for you for about 5 minutes and then hand it to you to drink it on the spot. You are also able to SHOP for your beer and bring them home!

The only criticism I have is that I came here on a Friday night (maybe not so smart) and waited about an hour and 20mins on the waiting list just to get a table to sit down and eat my dinner there. Luckily, Winking Lizard was right next door so we drank our beer at Lizardville and then continued to Winking Lizard for a plain bar food dinner. 

I'll definitely have to come back here again to try their restaurant food (which I heard it great!)

But Beer Lovers, experience beer heaven here at Lizardville!"}
{"text":"Ahhhhh Lizardvile, I have mixed emotions about you ditching the brew pub menu and going with a paired down Winking Lizard  menu. And you know what I think all in all it was the right move. More things to choose from and all those fantastic daily deals won me over albeit it took some time.

So essentially on this block you have a strip bar and 2 lizards to choose from. 

We were going to meet at the Winking one, on a Thursday night.  There was like a frigging 25 minute wait. I mean place was jammed, kids running around, people shoving popcorn down their pie holes, carry out food flying around, shit I was about to have a nervous breakdown down.
 Do you like apples BTW? Then it came to me, I slowed my breathing down, I started to zen out; what if there was a place, that did not have screaming children, nor a 25 minute wait, had great selection of beer, bourbon,  reasonably priced decent food, 10k less televisions,  where one can actually have a decent conversation and it is located near by, like right next door. The only drawback I can think of is that it's a total dude ranch, and that is not always a bad thing. Well that pipe dream is a reality, thank you Lizardvile. HOW DO YOU LIKE THEM APPLES?"}
{"text":"So to start - don't confuse it with the parent/owner lizard next door! ;-)

Nice place - bar and high tops + low tops... decent, mildly eclectic food selection and... wait for it... SIGNIFICANT drink selection.  They have this incredible beer chiller that allows you to pick anything off the shelf and have it cold in 5 minutes or less B-)

The staff is great - they'll help you walk through the 800+ beers and find something that you should try.  And smoking patio with cover and heat lamps out back! ;-)"}
{"text":"Brilliant!  A beer store that sells a cornucopia of brews, and, AND you can drink them there.  From the momoent I set foot inside Lizardville, I fell in love and started plotting ways to steel this idea-of-all-ideas and bring it home to Nor Cal. 

If the shear amount of breweries and brews does not blow your mind, the extensive knoweldge of the taff surely will.  Lizardville is the only thing that could entice me to live in Ohio.

Oh yeah, they have whiskey there too."}
{"text":"The best spot to go to on the east side for incredible selection of brews and whiskey. Laid back atmosphere, nice patio, and a really knowledgable staff.  Oh, and all the food is very good, but the breaded wings (sauce on the side) are unreal. Love this place!"}
{"text":"Off the hook selection of beers and whisky! Can't be beat! Book a private party with Sean and enjoy! Yes bourbon and cigars are in order on the patio!"}
{"text":"As a craft beer lover this place is awesome! They have hundreds of bottled and canned beers to choose from including things that are rare and hard to get. The staff member I talked with was super knowledgable and gave me some great suggestions of new beers to try. 

When I arrived the kitchen was closing, but next time I'd love to try some of their food. Can't wait to go back!"}
{"text":"One of my favorite places in Cleveland!! I'm obsessed!! I love the whole concept. The food is so good, and if you're a beer aficionado, this is the place for you. They have an insane beer selection, and you get to pick what you want off the wall and they chill it for you. They also always have local beers on tap. Plus a killer whiskey selection, and cigar menu.... it's ridiculous. The meat and cheese board is huge, and delicious. The belgian waffle is one of the greatest indulgences ever! The flatbreads are tasty as well. If you're in the CLE, you gotta get here!"}
{"text":"I went here with a friend of mine yesterday.  I had seen this place but never actually went in.  Well, I love a cigar every now and then so we thought we would try it.  We ordered wings, drinks, and cigars.  Well, they brought me my friend's wings and told me they were mine.  Like I said I had never been there so I took the man at his word.  I started eating the wings.  Well, when the rest of the wings didn't come out we told the bartender.  He looks in the computer then looks at me and very nasty says \"those are HIS wings\" then walks away before I have a chance to respond.  He then comes back with my wings and fries and puts them down.  Then my friend says \"I still don't have my wings.\"  By then the guy who dropped off the wings is there so I start to explain.  The bartender then says \"your kinda eating his wings sooo...\". I was livid however I didn't want to ruin the night and the manager did try to smooth it over (which got them an extra star).  We dealt with another bartender for the rest of the night.

Service is IMPORTANT to me.  Much more important than even food and ambience.  I will not go back."}
{"text":"A little out of the way for me, by a colleague and I went here after work... I am just getting into the Whiskey game, and i am always intimidated by places that dont list the price of a pour... Well this place gives you a book of their offerings and what a single and double pour would costs... I am much more adventurous when this happens. We each had 2 long pours and a beer. We also ordered a pizza, which was small by comparison but tasted good.. I forget the prices as i did not order but i want to say it was in the 8-10 range which for me is a bit high for the size but right for the taste.. I also like the fact that they have a cigar lounge outside, it was too cold last night for one, but the next nice day we have you will find me on their lounge with a cigar and a drink!"}
{"text":"What happened to the flat breads? Where are the sliders? How about the awesome meat and cheese board?
Gone. All gone. They now offer burgers and wings and a few salads - basically they took 40% of the lame Winking Lizard menu and they call it the Lizardville menu. Weak. 
If I wanted to eat at the Winking Lizard, I would walk across the parking lot and eat at the Winking Lizard. I used to like Lizardville because it was different. Now the menu is not at all special. I'm concerned that the great whiskey list might be the next to get cut. Then there would be no reason for the place to exist."}
{"text":"Took my beer snob family members here in an attempt to entertain them.  Homerun!  The food, beer, and whiskey are all amazing.  Food: Amazing soft pretzel...its huge! The wings are great.  I highly recommend the barbeque sauce.  Now I'm not a desert kind of guy, but the waffles were incredible!  Had a whiskey sampler, it was great.  If you like beer, this has to be the best place ever.  The service was top notch.  All the guys helped us out frequently.  We never felt that we were _waiting_ for the waiter.  Before we knew it, we had spent 3 hours at this place because we kept wanting to try more food/beer/whiskey.  It's nice to have a place in our area where the employees and the owner have such an obvious passion for what they are doing.  I can't wait to go back just for the food alone!"}
{"text":"This is my favorite place to go for a night out with the girls or just to chill after a long day. The staff is amazing and always have awesome suggestions. I literally can tell them a flavor (ie...coffee &chocolate or lavender and chamomile) I mean any flavor I feel like tasting and they consistently suggest or make beverages to satisfy that craving. Beer selection is amazing and the food.....the food is prepared to perfection. Best black bean veggie burger In town and I am not a vegetarian. Don't even get me started on rib night. I absolutely love this place."}
{"text":"I went to the Bedford Hts Lizardville last night with high hopes.  And the beer certainly delivered.  Great selection on tap, great selection on the wall of beer.  The food, however, was a nightmare.  

I think Lizardville had better reanalyze their kitchen staff, as part of our meal was completely inedible.  I NEVER send food back, but my girlfriend got the chicken and waffles, and the chicken was so lukewarm, dry, and chewy that I wonder if they had made it and then forgotten about it on a shelf for 45 minutes.  The waffle was burnt, and rock hard.  I couldn't believe it, it was the worst meal I have seen served in a restaurant in years.  Then I and 2 of my friends ordered the Bourbon BBQ Burger, which came back completely over cooked and with a negligible amount of BBQ sauce on it.  I had to use the table BBQ sauce, which of course is NOT the bourbon BBQ sauce.  

I will certainly go back to Lizardville for the beer . . .  but only after I've made sure to eat first."}
{"text":"Cool. A taster selection paradise. A friend raved about her fave new place, so off we went to try it out one weekend.

I compare this to La Cave du Vin...just not as fancy and dark. Like La Cave du Vin, Lizardville has selection of brews and they are so neatly organized around the place- from fruits to IPAs to whatever you want, you got it. I asked for a coffee flavored brew, and the guy took out 4 of them to show me- I chose my favorite brand Hitachino and got the coffee flavored one. Oh was it ever so good. They also have a wide selection of whiskey for the old refined gentlemen who like that stuff...but it's definitely a super wide selection.

I kind of wish this wasn't so far out in the suburbs, because it's actual a great place to go. The service was a little slow, but they were very nice- after telling you what kind of brew would be good, they take the bottle from you and stick it in a chiller...and then bring it out for you. And they're super cool people who work here.

Check it out if you haven't yet- these are the things you won't see in bigger cities...."}
{"text":"Service it tops. Super knowledgeable staff and very friendly. Selection of beers and alcohol is extensive and the staff can help you find anything to match your taste. Did a whiskey flight chased with a Trappiste Rochfort and enjoyed every drop."}
{"text":"I was really excited to try Lizardville, and they didn't disappoint. I'm a fairly regular visitor to The Winking Lizard location next door, and am a big fan of everything about that place. So, Lizardville seemed a logical place to try next.

In terms of booze, the selection here is second to none. La cave du vin was Cleveland's reigning king of beer selection until Lizardville came to town, and when you add the insane amounts of scotch, whiskey, and bourbon they carry here, it's not even close. In my inaugural visit here, I had a Rochefort 8 beer and a Talisker scotch. I had never had either before, and they were both excellent.

I'd describe the food as high-class bar food. We partook in a margherita pizza, a sausage and cheese board, chicken wings, and angus beef sliders with havarti cheese. The highlights were definitely the sausage and cheese board, and the sliders. While the Winking Lizard next door makes some of the best wings on the planet, the wings here are breaded, fried and not nearly as good as the non-breaded variety at The Winking Lizard. They should stick to what they know, if you ask me.

The service was a little spotty and they seemed to be rather understaffed. It wasn't horribly busy, but there were a fair amount of people in both the bar and dining room, so the two or three servers present weren't nearly enough.

Other than that, though, this is a great place for a leisurely happy hour with high-class booze, and some pretty good cuisine."}
{"text":"Well this went from five stars to two stars to one star. This is a depressing shell of a once amazing bar/restaurant. This once stand out is nothing more than an Applebee's with a different name. Terrible food of very low quality that is incredibly overpriced. Not only have the terrible menu changes affected me re writing this review but the atmosphere is just bad now. I visited on a Saturday evening between 7:30-9pm there were 4 others in the entire place. Everything is just bad now. There's never the usual crowd the great wait staff is gone and the music is fitting for a funeral. Don't waste your time visiting or eating. Pick up some beer and go somewhere there is life. 

OH. MY. GOD. WHAT HAPPENED LIZARDVILLE?!?!!!The unique menu is gone, all gone! The breaded wings, charcuterie boards, flat breads, and saddest of all the seasoned frites with garlic aioli are gone! Now this is just a winking lizard overflow with craft beers and whiskey. I do not go to winking lizard for a reason. And now lizardville is just going to be a place to pick up a few craft beers from time to time. Truly sad this went from being my absolute favorite location for a bite to eat and a few drinks to a place I don't ever care to eat at or hang out at again. 


My absolute favorite place in the entire area. I have never had a bad experience and my boyfriend and I typically go every other week. The breaded wings are phenomenal and the seasoned frites with garlic aioli are the greatest bar food I've ever had. They always hit the nail on the head with their bi weekly specials and the prices are very reasonable with good portion sizes. 
The staff is one of my favorite parts of the place! They are incredibly knowledgeable and never steer you in the wrong direction on food beer or whisky. The atmosphere and mood is always welcoming and fun. 
This is an excellent place for craft beer drinkers, whisky lovers, and anyone wanting to try something new. There is absolutely something for everyone and if you're unsure the staff can help you find something you love. Great for small groups, a date night, birthday, and everything in between! I cannot say enough good things about lizardville"}
{"text":"Excellent place for a quiet evening out. Amazing beer and whiskey choices. Very helpful bartender. The mini burgers were great too!"}
{"text":"I love Lizardville. They have an amazing selection of beers and whiskeys. When they first opened, the menu only had appetizer-type bar foods, now they have more of a full menu with flatbreads, sandwiches, desserts, etc. 
The last time I went we tried a bunch of selections from the menu. Chicken sliders, mushroom flatbread, etc. I forget exactly what we ordered but it was all fantastic. We also had the belgian waffle for dessert which I definitely recommend. It comes with ice cream and chocolate shavings. What could be better?"}
{"text":"Great Bar in a lame area.  Incredible beer selection and a knowledgeable staff makes this bar one of if not the best bar on the east side.  If you are overwhelmed just ask for Jason. He is a beer genius and a great conversationalist.  I now live in Colorado and I wish I could find a bar like lizardville here."}
{"text":"It has been 2 years since I reviewed Lizardville and I am still giving them a 5 for what they are......a unique beer and whiskey bar that now offers a menu of well prepared food.....definitely a step above their big brother, The Winking Lizard for about the same amount of money. Go Lizardville!"}
