{"text":"I really really wanted to like this place considering it's right below our apartment. Typical bar food. Nothing to brag about. I ordered a mojito and it was the worst mixed drink I've ever had. Don't have a drink as your \"special\" if your bartenders don't know how to make it. They were busy for the Final Four games and I think a little overwhelmed with the amount of customers. That was our first visit...last week we visited AGAIN to give it a shot expecting they had some time to figure it out after being new...nope! We sat at the high top bar and waited for 15 min until we decided to leave. Multiple waiters/waitresses walked past us without acknowledging us. We even within those 15 min went up to the main bar to grab our own menus. Needless to say we won't be coming back! Super disappointed by the service of this place. Don't waste your time!"}
{"text":"Food was average bar type food, as expected. Service was very slow but it was a game day, it was packed. I'll give them the benefit of the doubt there. Ordered a vodka soda, was served a dirty glass like it had been a bloody mary previous. It literally had chunks floating around I'm not sure how you miss that but the server was quick to replace it. That was the only quick instance. We had to grab another server to grab our server so we could order our food. It was a good atmosphere, not such a collegey game day feel, had a little more class but same caliber food and drink. I'd maybe return if others wanted to go but it's certainly not on my priority list."}
{"text":"I would recommend going here only if you don't plan on eating anything...  as a sports bar it kind of works, as a restaurant... not even close.  I was saving this review until I had a chance to visit LJ's a few times.  In terms of a place to get food, have a beer and watch a sporting this is one of the few in the neighborhood.  And I really really wanted to like it.  It is rather plain on the inside (no idea what is going on with the seating area near the restrooms), but the real problem I have with LJs is the food... the food ranges from okay (burgers) / boring (every fried app) to down right gross (wraps and the Rachel sandwich).  Skip the food!  Also, don't really get the whole 8NP thing on the menu and shirts of the staff.  It stands for 8 N. Paterson but almost comes off as an alternative name for the bar/restaurant.  LJs has potential but I fear that they have missed the mark and the audience, 25-35 crowd living in the area, who have disposable income and want a cool place to hang out, have a drink with friends and get some GOOD bar food.  Also, this place has nothing to keep you their after your game is over.  Where is the shuffleboard table, the big buck hunter or the golden tee?!  They have the space to have some activities.  My advice - Grab food before or after visiting if you need to meet friends at LJs."}
{"text":"Came here to watch the Sweet 16 playoffs...took 20 to get in the door due to the game and didn't get a table until 7 minutes left in the game...that being said; drinks were inconsistently poured (Kettle 1 on the rocks) and the menu is nothing more than cheap fried bar food. I was hoping for a better class of dinning given the type of customer that would frequent this place.  I will give this place another try as I'm sure game night was a bit much for a new bar."}
{"text":"Pre game dinner before the East HS game at Breese.  Was surprised that it wasnt't crowded at 6pm on a Friday, but nice for us to easily grab a table.  Quick service and fast delivery of drinks.  Recomendation on fish fry by neighboring table, and patty melt by server. Meals came quickly.  Patty melt was quickly half gone and fries were enjoyed. \"Too many\" fries, but not worth taking home.  The fish fry was amazing. A lot of food.  5-6 thin pieces of perch, potatos au gratin(friday only), slaw and bread.  Wow,wow,wow.  Not sure about the low rated reviews, as our meal, service and experience were great.  Very friendly staff.  Great service and attention overall. Looking forward to the next home fb game. Go Eastside!"}
{"text":"the space is lovely. i really liked watching a game there, the food was SO BAD. i would have forgiven the bland cheap food if it was half the price i paid. Im pretty sure i could have walked next door to festival and bought the makings of a better french dip for like 5 bucks. my bf had a chicken sandwich that clearly was mad with a frozen chicken strip. I would forgive how boring it was if each sandwich was not 12 bucks... Go for drinks and a game only!"}
{"text":"Very neat sports bar atmosphere. Many many tvs, two rows of bars with surrounding tables. Service still working out the kinks which is to be expected since it is so new.  For an appetizer we got the buffalo wings which were odd. They were not tossed in buffalo sauce and were very heavily fried and greasy. Next time we will try the non breaded wings. For an entree I got the Tuna melt with a cup of soup. My dining partner got a patty melt. Both were fine. The cheese was not melted on my tuna melt which was disappointing. Cheese curds were yummy.  In terms of the bar atmosphere, they have drink specials during march madness which seem fair. They have an extensive wine list which is surprising given it is a sports bar.  Overall, good place to watch a game, food is mediocre and overpriced. However, the staff is extremely friendly and there was a nice community feel among patrons, so I will be back. Hopefully they will work the kinks out of their food as they recently opened."}
{"text":"Professional and extremely accommodating staff.  Food was excellent. We had fish fry and loved it."}
{"text":"I want to like this place but, when you call and order an order of sweet potato fries and you get something that is mediocre not even cooked all the way and are charged $5.22 it's very disappointing. That is a good thing that the bartender is nice."}
{"text":"Been here a couple of times, and it's a great place to watch a game. Madison needed something exactly like this closer to the square: An upscale sports bar with wall to wall TVs, large beer selection,  and local owners. This reminds me of the serious sports bars one can find in a bigger city, with easy parking, classy decor and stiff cocktails.  Just met LJ for the first time when we stopped in, and he grew up in Madison, and has been working in the restaurant industry his entire life. And it shows."}
{"text":"Well normally I would give a decent review as I did enjoy my Tuna melt, but unfortunately all goes down hill when the waitress adds money to your bill. YES!!!! stealing from customers is not cool at all. I got a Tuna melt and 1(beer) cider, My bill came to $15 and some change, I used my card to pay for my meal and scratch out the tip as I always tip with cash and I even write it on the tip line. I just looked at my account today and I have $20.77 taken out from LJ's. Which makes no sense as I did not approve of that at all. This is a dissapointment and I will make sure to pass this along to everyone I know, I work hard for my money and to have it stolen from me like that really hurts."}
{"text":"Great to see this neighborhood build up!  Beautiful place and who wouldn't like a beer b4 hitting up the grocery store!  (Next to Festival Foods.)  Staff is friendly and food is delicious."}
{"text":"We called same day for a group of 30 plus. Not only did they accommodate us, sent over 3 servers to take orders and deliver drinks in a orderly fashion. Great atmosphere, large and open but not loud. Bar food menu with less grease and quality food, we were able to find healthier options and kids meals came with a free ice cream! Multiple TVs and were open to requests on stations. As a sports group we do this often and most places do not handle this well. I would definitely recommend this place!"}
{"text":"Congratulations to Johnny for opening his own restaurant!  We loved seeing you at Esquire and now look forward to seeing you here!  LJ's is located in the new Galaxie development just a few blocks east of the Capitol with easy access and parking.  Everything is fresh and new.  TVs fill the walls above the main bar running various games as one would expect in a sports bar.  There were plenty of seating options for families and sports fans alike.  The menu can be described as a step above bar food.  They have the standard burgers, fries and cheese curds that you would expect, but also salads and a Friday night fish fry.  I felt as though the menu represented items that could be easily prepared in the kitchen versus more complex items so they could keep the kitchen moving.    The night we were there, there was a variety of clientele from the after work group, to families and older couples.  A great location to stop in just for a drink or dinner.  We'll be back!"}
{"text":"Not sure what LJ's is trying to become. When walking in we were not treated by a hostess or told that we were responsible for finding a table. Upon getting a table we waited 10-15 minutes to be taken care of by the wait staff. We then waited almost an hour for our food which was underwhelming to say the least. I would love to see LJ's expand their draft list, differentiate their menu, and solidify their restaurant workflow."}
{"text":"Service was OK.  Food was mediocre.  Large container of coleslaw sitting on cart with no refrigeration was visible in kitchen - wait staff serving from the container."}
{"text":"Thursday is the new Friday right?   First visit was looking forward to.  Place rather empty.  Cool looking place but service at bar slow and not real inspired.  Sports Bar TVs all set up high so be ready for neck ache the next day.  Why do they do that?! No good reason to return - parking is a pain."}
{"text":"Review for 7pm dinner-  Pros:  - Great ambiance in a spacious, well designed space - Good server - Decent beer selection  Cons: - Played hip hop with a TON of bass in bad blown out speakers. It completely ruined the atmosphere - Food was mediocre, burger came with no garnish or pickle or anything, just plain. Absolutely no seasonings in the burger - just tasted like ground beef. All served on cheap, plastic plates.  - No attention to detail and there seems to be a disconnect with their customer. When we ate dinner here, literally over half of the patrons had gray hair, but the food, music and vibe they put out was like a shitty college bar.   I was very excited to finally give this place a try - I share its initials (LJS) after all - but was very underwhelmed. I think the owners could learn a lot from their clientele in terms of stepping up their food game and toning down the loud bass (or get better speakers) and college-y vibe."}
{"text":"Nice space and a few outside tables just next to breeds Stevens. Service was prompt and helpful. Had the BBQ pork slider basket--3sliders with slaw and crinkle cut fries. The buns was soft but with a crisp crust. Flavor for the BBQ was ok--more like sloppy joes than BBQ but tasty. Fries were perfectly fine but rather uninspired predictable fare. The Malbec was disappointing--too much like vinegar and too thin on the palate. Prices are reasonable, especially given the space and service. Not much for dessert options which was probably for the best for my waistline!  We'd come back but not make a special trip."}
{"text":"Great food, but terrible service! Had to switch servers because he was so slow and confused. He messed up our orders and was running around everywhere. Still learning which is understandable but still sucked. Expected more since I went to Esquire Club so much."}
{"text":"Fish was outstanding and service was quick and efficient. I will likely go here in the future instead of Esquire. The accuracy and quality of service is far superior here. Highly recommend this place!"}
