{"text":"Cozy little spot on queen west with amazing thin crust pizzas, prefectly done pasta, and delicious wine. The tomatoe sauce used on the pizza really stood out it was so yummy we ate every bit of it! Came here on a Saturday night before heading out to a party on King west, its a nice alternative to enjoy some great food and wine instead of the crowded and overly priced king west. They take reservation too so even more off a reason to come back."}
{"text":"We dined at this place tonight. The food was great. We ordered Lucifer spicy pizza and Tagliatelle Bolognese. I really loved the pizza, and the pasta was tasty too. Their fried calamari was so delicious. If you want to order some wine, Capato Sangiovese is a good choice. The server was so gracious and polite. He stopped by our table couple of time and helped us so nicely to select our meal. I would definitely recommend this restaurant."}
{"text":"Not sure what the raving reviews are about - maybe tasteless folks? Not sure.  Waiter: Saw an item online that had pancetta and it wasn't in store. He goes on to say \"if you're looking for another veggie dish, I suggest...\" - since when was pancetta considered a vegetarian dish?  Food: I had something similar to the Lucifero. The pizza was tasteless, bland, and simply unappetizing.  Girlfriend had the Carbonara and it was too salty. Never had a carbonara that wouldn't wrap around a fork.  Beer: The beer here is over priced. The same beers are sold at a cheaper price in Yorkville.  Also, I've never been to an Italian restaurant that doesn't serve bread while you wait for food. Personally, I don't care for the bread but for those that do, you now know.  Lo Zingaro - hire some new chefs, revamp your menu, and bring in knowledgeable waiters. Doesn't look good when a 30-year old skater-boy dude talks like a teen and doesn't know his stuff.  Would NOT recommend."}
{"text":"AMAZING!!! Everything about this place is incredible!! The service is great and the food is on another level!!! The pizza's rival the ones we had in Rome!! A must try!!"}
{"text":"Went to Lo Zingaro after a long day of work. The only expectation I had was to fill my stomach with carbs. Turned out, this is an amazing place.  The manager demonstrated excellent knowledge of his field, and gave us an extensive introduction into Italian pizza. In addition, the pasta I had was perfectly cooked: al dente pasta with a superb texture and a bolognese sauce that is tasty, but not overwhelming.  The service was prompt and friendly, but, to be fair, the amount of customers was manageable. Great place for great food."}
{"text":"Great spot, with particularly great service. I believe it was an owner who served us, and she was great - telling us which dishes are made from scratch, and just overall super friendly. The fresh fettuccine was really good. I will be back for the pizza"}
{"text":"prosciuto crudo!!! on top of my pizza! wow! authentic italian resto indeed!  the cuatro formaggio pizza is one of my favorite here.  great food!"}
{"text":"I chose this for my bday dinner because  I like things low key. I have been here quite a few times and have always had a blast! The pizzas are Amazing....Thin crusted and lovely flavours! Fantastic pasta and the mushroom balls are deadly!  But the reason why chose and love this place was the staff.....they have ALWAYS been so  much a part of the dining experience there.  But this was NOT the case on a cold Saturday night......something has changed! there were only 3 other tables....Saturday night 7 pm......hummmmm.....don't get me wrong the fud is still great but the server just didn't have the warmth/pizzaz  that I loved about this place. The food...We got the 2 calamari apps, one fried, one grilled and the mushrooms balls. The mushroom risotto ( amazing), sausage pizza, a pasta dish and a huge stuffed pizza folded over with meat on top! Oh and a bottle of wine and drinks of course! Food always seems to take a while to get out but it IS worth it!!! When it came round to desert, we had a wee chat with the waiter.....as best we could do to his distinct lack of personality...and after me blurting out it was my bday, desserts were offered! The Pannacotta was FABULOUS as was the tiramisu! We got a round of limoncello......it was the last dribble of the bottle of the homemade stuff...a bit too sweet for my liking but still yummy! When the bill arrived, I was a wee but shocked to see that all the desserts and limoncello -except for mine- were on the bill. Now, I'm not saying that we should not have been charged for what we got but...... the other times I've been I've felt like I was back in Rome in a tiny restaurant, with the warmth of Italian hospitality. On all my previous visits, we were given wee samples of food and drinks that just MADE the place special. The staff really made a great effort to make you feel welcome. Well, it seems that that has been lost in the coldness of Toronto. If you are up for some delish food downtown, hit this place up! Your belly will be very happy.....just don't tell your wallet you want to try EVERYTHING!"}
{"text":"I was expecting a lot from this place, especially the pizza, after reading about the reviews. However, the \"fresh\" tagliatelle was mediocre as it didn't taste like hand made pasta and the funghi pizza was just cheese and button mushrooms. You'd think funghi pizza would have either a lot of mushrooms or a large variety of mushrooms. I'd rather spend $2-3 more and get a pasta and pizza at Terroni where the taste is way better. The appetizer, I'd have to say though, was amazing. We got the Suppli (mushroom risotto balls) and it was delish! To be honest, I don't think I'll be coming back, but it was a good experience."}
{"text":"Amazing pizza and very friendly staff!  Reasonably priced by Toronto standards.   Highly recommend for a date night on Queen West."}
{"text":"3.5/5! Love the ambiance. Reminds me of Adrienne's in NY. I've had better pizza in Toronto but its still great thin-crust. I recommend the Pecorella spicy pizza."}
{"text":"Went here for dinner over the weekend. It got pretty busy after 8pm.  I thought the food was okay enough to return here to give it another shot and but I was not that impressed by the flavours of the two dishes we had. If I could give a half star I'd give it a 3.5.  I had the vegetarian pizza on white sauce. I liked the thin crust and the ingredients were really fresh, although a bit bland. I typically don't prefer salty food or anything but it was a bit too bland.    The bolognese pasta was definitely just okay. I've had much better fresh pasta before.  This place is conveniently located for me so I think that I'd return given all the positive reviews and see if there are other dishes that would be yummy. The charcuterie board that another customer ordered looked awesome."}
{"text":"Found this hidden gem while looking for a place that had an available table for 5 on a busy Friday night.  There's not a lot of selection so if you're not into pizza or pasta, this place may not be for you.  If you're willing to try something new,  you've got to try their Tronchetti. OMG... I'm only 5\" and I'm ashamed to admit that I finished it by myself (and didn't offer a slice to my friends to try)."}
{"text":"Food: 3.5/5 Service: 4/5  9 of us headed out for our friend's birthday dinner. We had reservations, and had amazing seats right by where all the action was taking place. The pizza station!  Only one person, Lorenzo, mans the pizza counter. You can see him tossing dough, strewing ingredients, and tossing the pies into the oven. Dinner and show kind of deal!  The majority of our party ordered pizzas. I had the Parmigiana: Pork Sausage, Grilled Eggplant, Fiore di Latte, Parmigiano Reggiano, and Black Pepper. I got to sample my friends' Vegeteriana and Bufalina pizzas.   The base of the pizzas were wafer thin; crispy in some parts, chewy in others. The one thing that we found inconsistent though was the level of doneness. Some of the pieces were on the cusp of being, dare I say it, burnt. Unlike Libretto's signature charred crusts, these bases don't have enough substance to pull that off.  The Bufalina was my favourite of them all. Nice acidity from the tomatoes, and salinity from the olives to cut through the rich Mozzarella di Bufala.  The Rice Balls (Suppli) were okay. They were super cheesy on the interior, but the flavour of the mushrooms and ham were lost.  Let me just say, apart from the long wait time for our food (for which the staff apologized profusely), we were very impressed with the service. The birthday boy was congratulated on his big day at least 4 times by the owner/gentleman overseeing our table. Moreover, we brought our own cake, for which there was no cake slicing fee. Very hospitable!"}
{"text":"Lo Zingaro is an affordable, nicely decorated little Italian Restaurant, perfect for a night out with your special someone or a couple of friends.  This place has a beautiful long fireplace situated at the back of the restaurant that gives you a feeling of being warm and cozy, and helps to melt the stress of a busy work day away.  The food was delicious and perfectly satisfying, delicately seasoned, yet full of flavor that made your taste buds sing, every scrumptious bit of food left me wanting more and more."}
{"text":"My husband and I went here last night.  The restaurant was clean and cozy and the staff was wonderful and very welcoming.  I am not sure why there wasnt a line up out the door.  The food here is FANTASTIC!  We went to Italy not long ago and since have been searching for delicious Roman and Neapolitan style dishes in the downtown-ish area (without having to venture out to Woodbridge) ...and Lo Zingaro did not disappoint.  We had the Suppli, Margarita pizza, Gnocchi and Tiramisu.  Everything was delicious.  The food made me feel like I was sitting in Rome enjoying delicious Italian food.  There was no craziness to the dishes...just simple yet flavourful.  I highly recommend this place over the pretentious overdone restaurants in the downtown area!"}
{"text":"This place is definitely a hidden gem as some others have said! My dad came in to town to visit and we went here when I first moved to the city, and now whenever he comes to visit we usually eat here! I always start with arugula salad (insalata di rucola) and order Margherita pizza as my main and they are both very good. The tagliatelle bolognese is also really delicious (although smaller portion size). The staff is always the same people and they are super friendly and welcoming every time we've come in! Definitely check this place out if you're in the area!"}
{"text":"This is as Italian as it gets. Just tried their pizzas and it was not like anything I had before. Thin crust and delicious, homemade toppings. Also, make sure you get the suppli. Awesome service, authentic food, authentic staff, and overall one of those places you'd want to tell people about."}
{"text":"Solid drinks and food at a good price. Great service too  What we had: Drinks: the lo zingaro fizz / negroni (they did not hold back on the alcohol) Starter: arugula salad; truthfully this could have used a bit more dressing to balance out the bitterness of the arugula Mains: Lucifero pizza and fresh fettuccine with lamb sausage. Both were flavorful and every last bite was savored.  Total bill was around $80 after tax and tip for 2   Service was super fast.  Was it the best meal i've ever had? No, but for what you get and the price, it's definitely somewhere i would keep in my usual repetoire of go-to places.   Best part? Despite warranting it, the pretentious level was 0. Guess the king west crowd doesn't travel that far north...thankfully.  Overall, great for a date night!"}
{"text":"I was really looking forward to this place based on the reviews, but am really disappointed.  Our server took our order first, then warned us that it would be a long wait due to the big party in the back.  It's a little thing, but if he told us before we ordered, maybe we wouldn't have felt as obliged to stay.  Anyhow, we were ignored for the entire hour and change that we waited until our appetizers arrived.  At one point our waters were empty and I had to go up to my server to ask him for a refill.  A lady from another table came up to the server at the same time, and commiserated with me.  If it's going to be a long wait, at least come by to check that everything is OK, or provide some bread or something.  On to the food -- after over an hour, the appetizers arrived.  We got the Calamari Fritti and Caprese salad.  Both were pretty good, but we were so hungry at that point anything would have tasted good.  The mains we got were the Fresh Fettuccine ai Funghi with  Homemade Lamb Sausage, Wild Mixed Mushrooms in a Light Cream Sauce, and the Frutto Di Mare Pizza with Calamari, Mussels, Clams & Shrimp.  My date had the fettuccine, and it was good but she was disappointed with the 3 tiny pieces of sausage she got.  My pizza was very sad looking.  It was very, very sparsely topped with seafood.  There was 1 shrimp cut in half to look like 2, maybe 3 pieces of calamari and 6 pieces of clams/mussels.  My date commented that it looked more like a pizza with tomato sauce than a seafood pizza.  For $21 I expected more.  I was super unhappy with it, but was so hungry that I ate it anyway.  At no point did a server come by to ask us how everything was, or do anything to make us feel better about the long wait.  A comped drink or dessert would have gone a long way and made us feel less miserable about our date night."}
{"text":"Wow! Where to begin... Lo Zingaro deserves every praise they get. Food - check, Service - check, Ambiance - check... They were all spot on! Add great company to the list and it was Incredible!  The food was A-Flippin-Mazin! Charcuterie platter, insalata, suppli, pizzas, fresh fettucine with lamb sausage were all flavourful.  Even the green olives that were part of the charcuterie was memorable! And I'm not usually a fan of green olives. Ending with a bit of dolce, the Tiramisu was perfectly balanced.  We were well taken care of by the staff.  My glass was always filled even when I'm too busy enjoying the food or conversations.  We were never rushed out when we finished. Something I never imagined I would see outside of Europe.  Bravo Lo Zingaro! Solid 5 Stars.  Extra Twinkling Stars to Jenny N. for organizing a fabulous UYE and with surprise door prizes?! Hells Yeah! ;) Grazie mille, Jenny!"}
{"text":"Recently dined at Lo Zingaro for a friends birthday. Nice ambience but do not get a table by the front door (at least during the colder months). Every time the door opened we could feel the gust of chilly air come in.   As for food, we ordered the Fresh Fettucini with lamb and the Seafood Risotto. I definitely recommend the fettucini. The risotto was good but nothing out of the ordinary. For desserts the tiramisu was amazing!   Service was good but slow. It took a while for our orders to get taken, our glasses refilled, and our meals to arrive. I noticed there was another birthday party so maybe they were just very busy that night."}
{"text":"This is a perfect place to come, casually or romantically, with a group of friends or that special someone. For tonight it was a group of friends! The easy on the eyes lighting and rich wood decorated interior sets an ambiance for a nice relaxing evening, but the stretch fireplace in the rear seating area, complete with cantina, can make the evening feel like your own personal space has been set up just for you and whomever. We started off with a nice antipasto plate(olives, cheeses, spiced beans, sausage, beets and pesto flat bread), followed by arugula salad w. parmesan and vinegarette dressing, pasta w. lamb sausage and a light tomato sauce,thin crust pizza(lightly sauced w. spinach& the other with prosciutto as well). And for dessert, of course tiramisu with a cappucino if you wish! The drink and wine selection is good and reasonable just like the entire evenings price. If you're looking for a great Italian restaurant, with a good atmosphere, friendly staff and traditional taste of what feels like to be at home with the family you have to come and enjoy Lo Zingaro, you won't regret it."}
{"text":"Well, there was a tiny crack in the window beside out table with a slight fresh cool breeze coming in from Queen St. and its accompanying mayhem on the typical Saturday night. I said it, the only downside to a recent visit to Lo Zingaro. Excellent everything, from service as soon as we walked in the door, to the wine selection and choice, price, pacing, a fantastic basic Italian menu, this is the type of Toronto-Italian restaurant to bring your friends when you need to be guaranteed of your event going smoothly. Highly recommended!"}
{"text":"Tried this place using our Teambuy coupon.  Would definitely eat there again.  Price friendly.  Ambience: nicer than what I was expecting.  Music in the back, but it's soft jazz, so it's not overpowering.  It's nice when we don't have to talk over loud music.  Drinks: I had Peroni on tap for the first time; only had it bottled before.  Very light beer.  Tastier by tap, of course.  Threw in a lime wedge, and there we go.  Mmmm.  Wife had a glass of Italian red.  Also good.  Deep fried calamari: Nice.  Fancy salt and a lemon wedge provided.  Spritz the lemon, spread salt, and eat with hands.... winning formula.  Nicely done.  Tagliatelle bolognese: It's a beef & pork mix, and the sauce was fantastic.  Definitely reminiscent of our trip to Italy.  However, the noodles: disappointing.  They were tough for what they were.  Maybe underdone?  Or just not the right mix?  Not sure, but the noodles fell flat.  Crudo Bufala Pizza: Good.  The crust was thin, with a slight tinge of black from underneath.  I'd eat it again.  Just behind the guys from Libretto and Queen Margerita.  But not far."}
{"text":"Overall a nice atmosphere; we were running late and called to let them know and they held our reservation with no issue (Sat night party of 2).  We ordered the Arugula Salad, Risotto Balls and Calamari to start.  Unfortunately they ran out of the latter 2 (we did have a 8:00 seating) and the Salad was very simple (a little too simple for me); the arugula was dressed with cheese (which had great flavor) and dressing.  My Finance had the pizza which folks on yelp beamed of but we disagreed.  It was okay but not worth the price; it lacked flavor.  I had the fresh fettuccine; similar to the other reviews on here the lamb sausage was awesome but the rest of it was a bit bland.  We also had the tiramisu which was very good; a tad liquidity but overall the flavor was spot on."}
{"text":"This pizza joint has a lot of buzz going on the foodie forum so I was looking forward to my visit here. Reservation was easy as they do have opentable though not needed as the place was empty when we walked in.  The first impression was a nice clean interior though a bit too modern for a pizza joint. The two part seating area is separated and there is a lot of seating in he back. Washrooms are clean. Ah well I would rather discuss food then the interior. The menu is limited if you don't eat pork as someone already mentioned.  Anyway I had already looked at the menu before hand so wanted to try the Pecorella (the house made lamb sausage sounded tempting) and my partner in crime went for the benchmark Margherita. The beer list is stale, wine list decent so I went for the a glass of Chianti.  The service is decent though way too laid back. Pizza looked decent and arrived promptly. First the benchmark IMO Margherita hmm decent but not the best in town. Nice thin crust and neutral sauce. A bit sparse on the basil leaves though. The lamb sausage pizza was quite good  (the spiced goat cheese gives it a nice kick) so if you like your food hot this is a nice version to try.  I would say 3 stars as its not quite best pizza in town.  I appreciated the chef paying us a visit after the meal to check whether the food was to our liking (0.5 star bump for that)"}
{"text":"Wait so you are telling me this is an italian pace with sushi on the main menu?  Something is not right..."}
{"text":"I've been a huge lover and supporter of Lo Zingaro for a few years now. i even threw a UYE event here last spring.  The last few times I've been, the service has really gone downhill. The food is still great, but it seems to take forever to get to the table. On numerous occasions, I've had to check with the server that the food is coming. I work in a restaurant, so I know when it's time to worry that the kitchen isn't making your food.  For a long time, Lo Zingaro was very busy and the service seemed great. But the new front of house staff are a bit robotic and not at all warm. Being someone who's always been such a strong supporter of Lo Zingaro, I'm not saying that I expect loads of free stuff. But I do expect to be treated as a guest who has done a lot to make sure that people come here. The latest waiter we had asked us to make sure to spread the word since we liked the food so much and they want more people in the door.  I mentioned that I had already written three five star reviews and also hosted a Yelp dinner there for 20 people. He seemed unphased by this support.  I'll probably still come back, because the food is great and one of the cooks remembered us from the UYE event and came out to say hello. But this server had no idea how to treat loyal guests when they come in on a slow Saturday night celebrating a special occasion."}
{"text":"Why can't we live closer to this place!. We were greeted by a very warm, funny female bartender who made us feel welcomed right from the start. The décor of this place is really chic and inviting, with two seating areas.  We chose to sit in the back which was more intimate and close to the kitchen and pizza making guy.  The guy making the pizzas was quite entertaining and you can tell he actually enjoys what he's doing, and most importantly for the customer, he makes wicked pizza.  The sauce is incredibly fresh and tasty, same with the cheese.  Everything about the pizza(Quattro stagioni) was perfect and we definitely recommend it.  As for the mains, I had the bucatini  and was blown away.  The pasta is made fresh in house and you can really taste the difference but the sauce and spicy pepperoni like meat in the dish sent it over the top.  Girl neans had tagliatelle with meat sauce and rosemary which was equally delicious.  Aside from the amazing food what really makes this place is the personalities of the people working.  They were all genuinely nice, funny, and normal(no fakeness, no sucking up) it was like being served by friends.  This place is hands down one of the best places we've been to anywhere in the city or in the world.  I can't say enough good things about it."}
{"text":"Great pizza done in the Roman style!  Server was very entertaining and crafted a cocktail as well.  We ordered a veggie pizza and a pizza margharita, that's the best I've had in a long, long time."}
{"text":"This place is usually pretty empty (which always scares me away) but it was actually really good.   We started with rice balls and then had fettucini with mushroom and lamb, along with pizza with speck and brie.  The wine was delicious and we had a perfect seat by the window.  Better food than Cibo around the corner. We will be back."}
{"text":"Amazing and authentic Italian food!   As soon as you enter the place you'll get captivated by its decoration, and its friendly staff. The prices are good for the quality of food you'd get.   I've been there a couple of times and I would personally recommend the soup of the day with pizza. I don't remember the name of the pizza at the moment, but I do remember it had pork sausage, mozzarella cheese, and other kinds of cheese haha. I had tiramisu as dessert and it was exquisite! It is a must!!  The servers, as I mentioned at the beginning, are really friendly and helpful at all times.  It is worth giving it a try!"}
{"text":"Delicious, great service, a little pricey for portions, but food is good. Wine list over $35 per bottle on average."}
{"text":"I tal' ian you that this is da best Italian food I've ever had, the best.    There was a wonderful event thrown by fellow Yelper Jenny N (who is an awesome host) and the restaurant gave our entire party of 25 the entire back room.  The atmosphere here isn't cookie cutter modern and chic but rather an upscale homey type of feel.  You can sit down, enjoy a conversation without feeling overwhelmed by loud music.    In terms of food, everything ranged from okay to great but my two favourite things were the suppli and the spicy lamb pasta.  The suppli has pork and cheese in it and was deep fried.  It was like a high end falafel with cheese and I LOVE falafels!  I also thought the pasta was amazingly tasty.  I've never had true hand made Italian pasta and boy what a difference it is from the store bought pasta.  Verdict:  Seriously, you are still reading this when I said it was the best in the first line? Just go."}
{"text":"So I really wanted to take a picture of the pizza but I was so hungry and the pizza was so light and tasty, totally forgot :) I got the Crudo e Bufala.  Their menu is really simple and easy to choose and that's a good sign because they know what they are good at. The place is also super chick and cool... a great addition to Queen West and just a 5min walk from work. I just wish they were open for lunch other than Fridays!  The staff are also great to chat with and take pride in their place and food. Next time will try to spend sometime at the bar as well, looks like they've got some fancy cocktails. Anyways good to have a pizzeria in the neighbourhood. We shall be back."}
{"text":"We visited this restaurant during a group outing on our final night in Toronto.  I'd never particularly heard of it, but my gf's friend read the reviews and made the reservations.  It was definitely a hit.    Initially, there was a bit of a wait because there was another large group before ours who lingered for a while, but all was well once they packed to leave.  The staff turned the tables around very quickly and didn't hesitate to accommodate us, though we requested an extra table.  My gf and I shared the Insalata di Rucola (a salad made with arugala, shaved parmesean, and a balsamic vinaigrette), as well as the Ortolana pizza (with crushed tomatoes, grilled asparagus, baby spinach, red onions and goat cheese).  I was a little iffy about the pizza because I wasn't too thrilled of the idea of asparagus as a topping.  However, it was honestly the most delicious pizza I've tasted.  The ingredients were noticeably fresh, seasoned and cooked well and the flavors melded perfectly together.  By dessert, I was pretty stuffed, but the group shared the  pannacotta and the tiramisu.  Though I didn't personally have any, my gf and her friends couldn't get enough."}
{"text":"Thanks to Jenny N., I found myself at Lo Zingaro last night for a UYE. Right on Queen Street West, you're surrounded by a number of cool restaurants and coffee shops. You can easily get yourself here by TTC, but my pal and I found out that there's free street parking available as well. We tried a little bit of everything on the menu - the pizza here is delicious ! Thin crust with the perfect amount of cheese and tomato sauce on the pie. I can't wait to come back and try it! We also had the arancini balls with mushroom risotto inside; once again, another winner. Service was excellent.  Good for: Pizza, Italian, Drinks"}
{"text":"My husband, friend and I decided to eat here because we were running a 15k the following day and Italian food is the perfect fuel for us. The decor is nice, colors/artwork on the walls and music are relaxing. The menu is small who's is great. We ordered the calamari to start and it was delicious (marinara sauce was very flavorful). For the main course I ordered the mushroom risotto with parmesan (I love cheese) and it hit the spot. My husband ordered wine with his meal and the bartender was very knowledgable re: taste and had good recommendations. My friend ordered the seafood pasta which was also delicious, the sauce has a mild kick to it (she also added a bit of fresh black pepper). The service was great, our waitress was very helpful and chatted with us (we were playing guess where she is from and my friend guessed right because of her accent). The portions were perfect because it was just enough to fill us all up while leaving room for desert. I don have much of a sweet tooth and went with the homemade pannacotta which was small enough for me. My husband and friend ordered the homemade tiramisu which was good but too sweet for me. We would definitely  go back when we are in Toronto again!"}
{"text":"I visited this place with two friends and had an awesome dinner. The pizza (Margherita) was phenomenal but light (very thin crust); the butternut squash soup my friends ordered tasted like they had prepared it just prior to it being served; the gelato was DELISH... the staff were so kind and attentive (perhaps a few too many \"How is everything?\" visits making it feel a bit disruptive, but the intention was good). Definitely recommend this place (very reasonably priced as well."}
{"text":"This is just amazing authentic !! The chef is awesome. Very Italian, very Peroni, very reasonable prices, great service"}
{"text":"I recently stopped by Lo Zingaro to pick up a Pizza to go, and all I gotta say is that it was awesome.     Friendly staff, and I look forward to going back and having a  proper dine in experience.    It was pretty quite for a Saturday night, but then again so was the rest of Queen St. West..  go figure.   Nice. quiet background music, so ideal for conversation....."}
{"text":"Wanted to try this restaurant since it's near to where I live.  It looked to me like a family-run business and that's usually good news.  We started with the arancini and I must say they were quite tasty. They were cooked perfectly and the light tomato sauce was savory.  Then we ordered a white pizza and a lamb sausage pasta. While the pizza was good, the pasta was just too salty, probably because of the salt already present in the sausage. Unfortunate, because the pasta was freshly made. After one bite, we notified the manager, which promptly offered to replace it.   She also offered to take care of the dessert, which was gelato from Dolce. Overall, not bad but not spectacular.  Unfortunately, the good service couldn't make up completely for the pasta."}
{"text":"Had a 730pm Saturday reservation- waited 20 minutes to get seated. Once seated, it took 20 minutes to place our drink orders and another 20 minutes to place our food orders.   45min after placing food orders, our appetizers are nowhere to be seen. No bread either. I asked the waiter to check on our order and a few minutes later, he brought out our mains. He gave us a strange, incomprehensible story about how our appetizers went missing. They did nothing to make up for the mistake and really bad service. We were so disgusted at the rude service & went elsewhere for dessert.   I've been here 3 times - 1st time was great, 2nd was average, 3rd was this. What a disaster - I won't be going back to Lo Zingaro.   The pizza was good but with service like that, I'd rather endure the long wait at better known pizza establishments in the area."}
{"text":"The amazing Jenny did a UYE here, Die Wheat Belly. This is a great, local restaurant! But before we dive into the food, let's talk about the layout, service and the hostess, shall we?  When you enter, you are taken in by the large L shaped bar and several tables against the wall and next to the windows. To my great surprise, there is another room, past the bathrooms, and this is where we had our UYE. This room is private and overlooks the open kitchen. There is a fake electrical fireplace in the textured wall; it even has a cute open block with firewood to add to the mood!  The service was fantastic! The servers and manager took great care of us. Food was never missing.  The hostess, Jenny. is incredible. Did you know she brought door prizes? SHE BROUGHT DOOR PRIZES!  I've never been to an UYE where the hostess cared that much about me! Jenny made everyone feel welcomed and special.   The food was exquisite. We had charcuterie board, pizza, arugula salad, lamb sausage pasta, more pizza and tiramisu.  The charcuterie included warm green olives which was a novel approach to adding to the flavours. Because they were warm and green. They did not come from UNICO jar. I'm sure they come from someplace similar, but it was this great attention to detail that made the flavours stand out.  The pizza was delicious: thin sliced, thin layer of tomatoe sauce. I loved the arugula pizza but that's because I love arugula.  Finally, conversations.  A good time was had by all!"}
{"text":"It's nice. But that's just my experience.   I came here at 4:30pm on a weekday so it was completely empty.. I feel that this restaurant would have an amazing atmosphere if there's a lot of people as they have these large windows at the front of the restaurant. Oh well.  Our servers were lovely and very attentive. Unfortunately, I didn't capture their names, but the dishes they recommended were quite nice.   1. Tagliere di Salumi e Formaggi (20): House Cured Salumi and Cheese Platter - Essentially, this was kind of like a charcuterie, but with just salami. I'm always a sucker for charcuteries (as I realized like wine and cheeses... more wine though), so it went very nicely with my drinks. However, it didn't exactly pop for me...  2. Fresh Fettuccine (17): Homemade Lamb Sausage / Baby Spinach / Roasted Red Peppers / Pecorino Romano - I'm not a huge fan of pasta, but this dish was quite good. My favourite part was a lamb sausage.   The drinks are nothing too special, I had gotten the Apple Martini.. but the just decided to stick to white wine ...  Apparently, Lo Zingaro get lots of good reviews for it's thin pizza which I had not had the chance to try. But it wasn't bad!"}
{"text":"Kinda disappointed. Service was good but the place was empty on a weekday.  Calamari Fritti: the calamari was kinda greasy. The tomato sauce was really good though  Margheritona: didn't really like the cheese or the ingredients on this. Didn't really enjoy it.  Antipasto della casa: this was really good. Enjoyed all the meats and cheeses. Yum  Overall service was excellent but food was just okay to me. I enjoyed gusto and buca more."}
{"text":"Attended my first UYE here and found it well worth it. Everything seemed fresh and delicious. The pizza, pasta, salad, arancini balls, tiramisu etc. were all equal or better than what I've had in the past from similar Italian restaurants. There is a full-bar. I ordered an ice tea and it was infused with fresh lemon and something else that I can't put my finger on.  I was also very appreciative that they print how much to add to your total if you want to leave a 15, 18, or 20% tip. I hate having to do the math after a drink or two.  Overall, nice décor, attentive servers, and excellent food. Would recommend for people who are looking to try somewhere new."}
{"text":"I came to this cute little Italian place courtesy of their great Yelp reviews.  After eliminating the $$$$ Italian restaurant closest us to us, we decided to give the more modest Lo Zingaro ($$) a try ;)  Like the eponymous gypsies*, we were willing to travel where necessary.    The AMBIANCE:  This is a cute place.  It wasn't crowded and we took the cozy little front window nook that Jenny N. mentioned in her review.  The restaurant is warm, and there's a direct line of sight back to the kitchen and its pizza oven with staff hard at work.  I find it a real bonus that the washrooms are on the ground floor...yay for a handicapped accessible restaurant.  The FOOD: My friend and I decided to share a couple different main courses.  We had a rather good tagliatelle ($15) featuring homemade pasta and a nice rich bolognese.  The real star though was the Roman style (thin-crust) pizza we had.  It's not on their online menu, so I can't remember the name, but it had a lovely spicy housemade lamb sausage that nicely complimented the rich fior di latte that topped the pizza.  The crust was expertly cooked to a crisp, but not burned.     I made a face when my friend ordered dessert, as I normally find tiramisu to be one of the most boring desserts--one that has typically sat in the refrigerator for way too long.   Instead, I was delighted to find it was one of the very best tiramisu I've ever had.  This one, which I have to point out easily serves 2 people, had a delightfully fresh and light cream in between the savoiardi.  Instead of becoming a muddled mess like most versions of this dessert, the components each stood out on their own and played off each other in a most astonishing way.   The food gets a very strong 4 1/2 stars.  To accompany our Italian feast, we each had a glass of wine.  This was my only complaint, the wine pours were definitely on the small side (I believe less than the standard 5 oz) and both of us found the different wines to be rather weak-bodied.  I'm left with the impression that the wine list is slightly on the weaker side.  3 stars for the beverages  The SERVICE:  It's nice to see an Italian restaurant run by Italians.  The server was super friendly and attentive and even let us draw her into an interesting political conversation.  We had a great time chatting with her about Italy.  It was also quite notable that the chef came to check on us not once but twice.  Both the server and the chef were so genuine in their inquiries about the food, that I was confident in knowing that they would fix any problems without hesitation.  It's great to see a restaurant that both stands behind their product and cares.  5 stars for the service!  OVERALL, I wouldn't hesitate to recommend this restaurant.  The pasta was fairly good, the pizza was great, and the tiramisu was outstanding...all complemented with excellent service in a comfortable environment.  It's also pretty good value...dinner with a main, 1/2 a dessert, and a drink was $40/person.  Not something I would call cheap, but perfectly reasonable for a restaurant in Canada that is taking Italian food seriously.    *In case you were curious about the name, Lo Zingaro means gypsies in Italian...maybe a reference to the owners finding themselves transported from the warmth of Italy to this frozen land."}
{"text":"They do great thin crust pizza. But be warned, nearly all their pizzas with eat involve pork!  Too much. Nothing with chicken, very little with beef/lamb, and few vegetarian pizzas. But it does seem very authentic italian food. Didn't appear to be vegetarian pizzas with tomato bases :(    Had the lamb based pizza and vegetarian.  Had the calamari too, which came with a very flavourful tomato dipping sauce - quite nice."}
{"text":"Came for Saturday night dinner. The staff was very friendly. The appetizers were delicious (the spring salad and the calamari). The fried calamari was a perfect texture (read: not rubbery). For main entrées we ordered pizza, the fresh tagliatelle, and the fresh fettuccine. The pizza was phenomenal: crisp, light, and full of flavor. The two pasta dishes were not your run of the mill spaghetti. Many of their ingredients are made fresh in house including but not limited to the noodles and the sausage. The noodles were quite substantial and I was glad that we were all sharing plates because after a few bites, I was ready for a different dish. Overall I'd say their appetizers and pizzas are the highlight."}
{"text":"Went with a deal voucher, it was worth it, the weekend dinner special is only $15 for a pizza/pasta with a drink. Good service."}
{"text":"I'm torn on writing a review because I don't want this place to get slammed and make me wait longer. But here goes.   Incredible. Best pizza I've had in the city. We had a big group and got a table pretty quickly, and were quickly tended to with drinks and app recos. We all got pizzas and were all stoked. On top of the great food, the manager Daniel made it all even better with great service and conversation. Will definitely go back."}
{"text":"This place was my favourite Italian restaurant..I ordered tagletelle bolonaise and the dish took a nose dive. The pasta was under cooked and some parts were still stuck together. I would never go back again. I later learned they have a different chef. How could they let that dish out of the kitchen? The prices increased dramatically as well. I expect perfection when I'm paying $19 for pasta. They also don't serve fresh pasta anymore. I'll be going to Terroni or kit kat to get my pasta fix. Sad but I don't see them being successful in the future. Saturday night and the place is empty. Please bring back the old chef..."}
{"text":"I'm (still) a fan after a handful of visits. I typically come here for their amazing thin crust pizza (margharita) and a glass of wine. The pizza is amazing. Reminds me of Italy.   Their wine menu is nothing to write home about. In fact I was just discussing it with my friend that they should up their wine selection a notch. It's not cheap by the glass or bottle but very mediocre quality. I get that drinks are where a restaurant makes most of their money but this is very much the place where the ambiance invites you in for a drink and you'll end up sticking around to eat. For that to keep functioning, the wine needs to and should be good.   Food is reasonably priced and well worth it.   Towards the weekend it's best to make reservations as they do get busy and it is a small restaurant. They are closed Sundays and Mondays."}
{"text":"Fantastic service, great food, great atmosphere. I highly recommend it.   The food was very tasty and well presented. Not really fast coming out, but we had a reasonable amount of chat time. Not too long. The waiter was great. Very accommodating, very friendly and very polite. Relaxed atmosphere with an upscale feel.   I can't imagine anyone being disappointed."}
{"text":"We ate here last night (Saturday) and I was worried about not having a reservation. We arrived around 7pm and it was quite empty-maybe two other table and a person seated at the bar. Service was, as mentioned in other reviews, not warm or attentive. The place got a bit busier as our meal went on but not to the point of having overwhelmed servers-I noticed a couple flag down the waiter to order after having been sat for probably 20 minutes.  Now the food.....was amazing! We started with the mushroom rice balls and arugula salad. Then split a lamb and mushroom pasta, and the Ortolano pizza. It was all fantastic-although the pizza definitely took last place....and I love pizza. Fresh ingredients, good portion size and a reasonably priced menu. After my husband paid-which he had to go to the bar to do so. He was unsure if he had tipped properly or at all. When he went back to get his receipt to check the waiter was very snarky and told him it was in the garbage-so basically too bad. Verifying my statement this morning-no tip on charge. Maybe that's where the attitude came from...and I really don't feel bad about the mix up. We would of left cash if he had been able to help us out."}
{"text":"Great restaurant. It has a nice atmosphere, is small and nice lighting. (I don't like bright restaurants). We shared the Insalata di Rucola to start and it was a good size and tasted great. For the main course my girlfriend had the Tagliatelle pasta dish and I had the Campagnola pizza. The pizza was amazing and the pasta was good. The service was great and most of the pasta is home made which is nice. We also had 2 Negronis to start and they were really well made. Overall it was a great food and service experience. I'm going back for sure."}
{"text":"I can't even describe how frustrating it was to wander around a city packed with so much to do and not have access to wireless in order to use Yelp to find it! Luckily I ducked into this unassuming pizza place one early Saturday evening and ended up spending almost the entire night there thanks to its friendly bartender, delicious cocktails, and tasty food!   A girlfriend and I posted up at the bar intending to kill just a little time with some drinks before a show down the street, and started chatting up the bartender, who was new to town as well and a chatty cathy (in a good way). He made us different cocktails and even fun shots that by the end of the night we were open to trying, and before we knew it hours had passed!  The place is good for more than just drunk fun at the bar, though. There are tables for sitting and lots on the food menu to choose from. The pizza was the best thing we tried, and the most disappointing was probably the calamari.   Anyway, it was a totally unexpected highlight of the trip and I can't recommend this place enough for its stellar service!"}
{"text":"I had the seafood risotto and it literally was the best risotto I had in my life! The flavors of the sauce was very in tune with the seafood on the dish (shrimps and scallops). The sauce had a creamy taste to it, which brought out the quality seafood flavors. Some improvements to the dish would be increasing the portion by a bit, and if the shrimp's shells has been removed to facilitate the eating.  The location and atmosphere of Lo Zingaro was also very nice and pretty conveniently located on Queen Street West (just a modest walk from Osgoode station). I would definitely recommend coming here for lunch or dinner with a small party of guests."}
{"text":"4-4.5*  Definitely a pleasant surprise, better than I anticipated!  I was looking for an Italian restaurant that served pizza, wasn't $$$ with snooty 'tude to boot, had great reviews, and I stumbled upon Lo Zingaro.  And I'm soo glad that I decided on this restaurant...even though there aren't a heck of a lot of reviews.  Atmosphere and décor was modern, intimate, and quiet for a Saturday night on Queen West.  Restaurant has a dozen or so tables + bar, but only a handful were occupied.  So not sure why this place was quieter than I expected, but it worked out. :)  Menu is a do-able size, consisting of Antipasto (Apps), Pastas, & Pizzas.  I ordered Insalata Caprese ($14), and 2 pizzas, Pecorella ($18), the classic, Margherita ($13), & Tiramisu ($8) for dessert.  I also ordered a Negroni which was more a martini than a sweeter cocktail.  No biggie, I drank it anyway!  The Caprese was saltier in some spots than others, but was beautifully presented and fresh tasting!  Loved the buffalo moz.  And although the Pecorella sounds and is fancier, I like the more simpler Margherita better.  Pizzas are a fair portion and I was only able to eat only half, above my app.  Crust was thin and it was not overdone or soggy (esp. towards the middle) at all like other places!  Staff were chill and seemed genuinely happy to work there.  All of the staff checked in throughout various stages of our meal.  Loved the non-pretentiousness of the entire place.  The food was great, but the service was even better!"}
{"text":"We chose Lo Zingaro for our restaurant of choice because it was near our Airbnb, the prices were decent, and the photos looked delicious. We arrived 30 minutes after it opened and there was lots of seating available but not empty. I loved the atmosphere in here. Nice music and decor. The heavy curtains that hang over the door really help keep the cold out when people enter.   I ordered the gnocchi and my boyfriend ordered a pizza. The gnocchi was so unbelievably soft and smooth. It's crazy how they were actually maintaining their shape. Great texture and the sauce was very nice.   I tried some of my boyfriends pizza and the crust is fantastic. The crushed tomato sauce was also very good. The only thing is he wished their was more meat throughout the pizza instead of just a few spots.   We ended our meal with tiramisu. It came in a bowl and we devoured it in maybe 2 minutes. It tasted wonderful. My boyfriend had a little espresso shot as well.  Service was decent except when I asked the waiter what he would prefer over 2 dishes, he didnt really have a true answer, just that their gnocchi is better than Gordon Ramsey's restaurants in Vegas. This is okay I guess, he just didn't seem confident.    I'll gladly come here again. Unfortauntely I'm not in Toronto too often but I would suggest coming here if you want a great spot to eat!"}
{"text":"Came here on two separate occasions: once for a dinner with a couple of friends and a second time more recently for a large birthday party with around 15 other people.  The food was overall really good. I'm no expert but when it comes to Italian food I find that all restaurants do it the same - pizzas and pastas that are pretty meh. Lo Zingaro is one of the better places though, and their food just seems to have more flavor and weight. I got the seafood risotto the first time and the fresh fettuccine the second time. I would really recommend the risotto - it comes out looking pretty small but really fills you up.  Service was good, even with the larger groups they really took the time to explain the menu options and go over the wine choices. During the birthday however our waiter did try to sell desserts and coffee pretty hard to everyone which was kinda weird but not a big deal.  Overall I would definitely come here again, since the prices aren't to bad it makes for a good go-to Italian place on Queen street"}
{"text":"Service was a bit wanting, and food was good but in a neighborhood with other 'good' Italian options. Might be back, but won't go out of my way."}
{"text":"A little disappointing visit despite the raving review. First the lady working there was storming through the restaurant the whole night on her heels on hardwood floor, making very loud annoying noise, which we happens to be sitting along the walkway.   Upon sitting in, we place the order, Parmigiana Pizza and Risotto ai frutti di mare (seafood risotto). We didn't feel like antipasto, but I have never been an Italian restaurant that doesn't serve bread. And we never seen anyone notice the missing bread, despite the numerous people asking us how the food is.   When the food is finally served (BTW, we didn't see the bread throughout the night), the risotto served is actually Risotto di Funghi, pork belly risotto. While its not what we ordered, we just went with it.  First, the pizza was good. The crust and tomato paste is done right. Nothing to complaint except the chunk of sausage is a bit scare (which I only see 8 small piece in total). We enjoyed the pizza overall.  Now the risotto, after we started with it, we actually regret not asking for our seafood risotto, as the dish was done too salty to our taste. And the rice is undercook. The dish leaves a lot to be desired.  We had tiramisu as dessert. Not the typical one you see everyday, but a very different style. I would recommend trying it.  Maybe if I order something else it would be fine, but judging from what we had I would give it a 2 star."}
{"text":"Absolutely worth popping in.  The best part is their thin crust libretto-esque crust is much crispier.  Might be the lighter cheese or something else. But this is what makes it.  Cut one triangle off the end of the piece and the rest is held without folding.  Ok fine you think topping and sauce are important too? Yeah they got you covered with homemade sausage and more.  Wide variety of white za's.  Out."}
{"text":"Best pizza we've had in a long time.  We had the seafood risotto and margheratino pizza with homemade sausage.  Very fresh seafood in the risotto and pizza was light and full of flavor.  Could really taste the basil and sausage with a light,not overpowering tomato sauce on the perfect thin crust.  Service was great, atmosphere was cozy and prices were reasonable.  Will definitely come again to try the other pizzas and pastas."}
{"text":"Wonderful food.  Great Pizza.  The best white pizza since Yonkers in 1992. Service was outstanding - very attentive.  Super helpful with the menu.  Great recommendations on drinks, portion sizes.  Very accommodating with kids.  Everyone had a great time and we really enjoyed our dinner. Thanks for a nice evening.  Visiting from Chicago - so we know good food.  Thanks!!!!"}
{"text":"3.5 Star  Lo Zingaro serves a good Roman Style Pizza which has this super thin and crispy crust. It might be one of the first time I have one of this in Toronto and I really enjoyed that. Great if you don't want to go into a carb comma after eating a pizza.  We shared:  Crudo e Bufala -  Crushed San Marzano Tomatoes / Mozzarella di Bufala / Proscutto Crudo di Parma / Arugula / Shaved Parmigian  Margherita - Crushed San Marzano Tomatoes / Fresh Basil / Extra Virgin Olive Oil / Fior di Latte  Love Crudo e Bufala as I love Prosciutto but Margherita would be much better with a few more basil leaves.  Lo Zingaro also have great house made pasta. Fresh Fettuccine with Homemade Lamb Sausage / Baby Spinach / Roasted Red Peppers / Pecorino Romano was delicious.  We also shared some appetizers:  Tagliere di Salumi e Formaggi - Cheese and Prosciutto Suppli - Mushroom Rice Balls Stuffed with Fior di Latte & Italian Ham / Spicy Tomato Sauce Insalata di Rucola - Arugula / Shaved Parmigiano Reggiano / Aged Balsamic / Extra Virgin Olive Oil  Thanks Jenny N for organizing and Lo Zingaro for hosting us.    I definitely would be back again for some more Roman Style Pizza!"}
{"text":"An excellent place for Neapolitan style pizza. The pizza is simple and light. They use San Marzano tomatoes and the sauce is good. They charge $13 for a margherita which is about standard for the style. The service was excellent and the atmosphere was great. I enjoyed sitting at a table with the cool breeze blowing in while observing the Queen St nightlife. Lo Zingaro is definitely a better option than the many NY style places up and down the street."}
{"text":"We dined at Lo Zingaro in November. This place has bar far one of the BEST PIZZAS in the city. The chef takes great pride in his pizza dough and came out to discuss the intricacies of making the right dough depending on the climate and humidity. He was very gracious and knowledgeable. I had a Margherita pizza which was perfectly done. My friends were swooning over the Maple truffle pork ribs - but as a veg I didn't try them.  I can't recommend this place enough."}
{"text":"Good pizza, good drinks, cool atmosphere...no complaints...  Only reason it didn't get a 5 is because I wasn't \"blown away\"...still a solid Italian place downtown..."}
