{"text":"Quelle déception. Notre table réservée pour une soirée spéciale St Patrick (annoncée sur leur site et leur page Facebook) n'a pas été prête avant un bon 45 minutes. Le DJ n'avait aucune musique traditionnelle irlandaise et n'était même pas au courant qu'il s'agissait d'une soirée spéciale pour la St-Patrick. Tout ce que le serveur a pu nous dire c'est qu'il y aurait peut-être un joueur de mandoline pour une petite demi-heure vers minuit. On appelle ça de la publicité mensongère. C'est la première et la dernière fois de ma vie que je mets les pieds ici et je ne serai pas le seul. De plus à 8$ le verre de Guinness c'est pas donné...
Méfiez vous de la fausse publicité pratiquée ici. Les clients n'aiment pas qu'on se foute de leur gueule."}
{"text":"J'ai été un jeudi 5à7. De plus, soir de match. Il n'y avait pas beaucoup de monde (et alors...) Mais au courant de la soirée ça c'est rempli. Il y avait un dj, alors de la bonne musique durant les pauses du match. Beaucoup de spéciaux sur les drinks. Ce bar est parfait pour manger des mix Indiens-Québecois...! Bref, j'ai bien aimé pour un 5à7 :)"}
{"text":"Meh. Musique générique beaucoup trop forte remixée sur un beat de reggeaton de dompe. Aucun spécial sur les drinks. La crowd se compose principalement de gars qui semblent ne jamais avoir vu une fille de leur vie. La place est beaucoup trop petite et il est difficile (impossible) d'y circuler, puisqu'un génie quelconque a cru bon de foutre la \"piste de danse\" en plein centre du seul espace ouvert pour discuter, en plus d'être le passage pour se rendre aux toilettes. Aussi, les tables sont en plein milieu du bar pour qu'on ne puisse absolument pas s'assoir tranquille à boire un verre sans se faire bumper toutes les 2 secondes. À part de ça, le staff était ben smatt. À éviter."}
{"text":"Horrible service. Terrible experience.
Went out of our way while on vacation to visit Lobby Bar for an oyster party. 
Our orders were taken as we sat at the bar and then we waited and waited and waited _ while everyone around us (people that arrived after us PS by the way) received their food.
If you are not a local don't bother going there."}
{"text":"I went here for a sugar shack dinner. The food was fatty and sweet, which was expected and great! The food seemed to keep on coming and unending. Not to mention the maple taffy at the bar."}
{"text":"J'y suis allée avec un ami dans l'optique de ne pas me faire chier ce soir là... On s'est tout de même fait chier. Samedi soir, personne dans le bar. Le DJ mélangeait les sons n'importe comment, je suis d'accord tu peux passer de tout mais pas en passant du Hip Hop à la Salsa et du Reggaeton à l'électro. On a pris quelques verres, j'ai pas trop aimé mon cocktail mais il y a un barman qui fait des cocktails avec des fruits, lui c'est le must, mais malheureusement il n'était pas là ce soir là :( On est parti bien avant 3h. Soirée finie dans un McDo c'était bien mieux."}
