{"text":"Local 1794 is a great little restaurant and bar in East Toronto. I visited there a few Fridays ago in the late evening with a larger group and ordered the Wild Boar Pizza ($18.00) and Poutine ($9.00). The pizza was delicious. The crust was exactly what I liked - thin enough to not overwhelm the toppings but thick enough to support the toppings. The toppings were generous and tasted great. The poutine was quite large and tasted pretty standard. There was also the option to add pulled pork or butter chicken to the poutine, which I regretted not trying. I liked that the table had large glass bottles of water so you could top up your own glass rather than constantly waiting for a server to do so. The dining area inside was cozy but comfortable, with a mix of industrial and rustic modern décor. Almost one whole wall was adorned with shelves of wine with the bar squaring most of it off. There was a television by the bar playing a black and white movie. It was a tad strange it was not showing sports-related programming but perhaps this was considered the charm of the venue or quite simply, there were no sports programming worth showing. There is a small patio in the front of the restaurant opening directly into the indoor dining area since the wall/garage had been lifted, which really added to the open flow and ambience of the restaurant. We had a few different servers help us and aside from being diligent in terms of ensuring we had full bottles of water, the service could be interpreted as slightly lacking. However, considering the challenges of serving larger groups, I was satisfied with the service and had no legitimate complaints. All things considered, I would likely visit Local 1794 again if I were in the area."}
{"text":"I have yet to eat a disappointing meal here, and I've visited a few different times. The duck leg confit is a highlight, with crispy skin and tender meat served over creamy beans. Also the burger is outstanding -- they won't go the Allen's route and cook it medium rare, but they do top it with an addictive chipotle mayo and lovely bacon. Basically everything we've tried here has been delightful, with no missteps. Also, every single time we've visited, they've had Turner Classic Movies playing above the bar. For this alone, I would keep coming back. In fact they're lucky I'm not in every day, just ordering endless cups of coffee and watching television."}
{"text":"From the minute we arrived I had the sinking feeling that it wouldn't live up to the hype. A dinning room decor that is trying to hard and a feeling of a airport lounge should have made me turn around but I figured I should give it a try. After all it is on a lonely stretch of road and I didn't have a backup. While we had lots of back and forth with the waitress about the burger and how it had to be medium well that turned out to be a red herring and hardly the worst part of the meal. The caesar was drowned in dressing and because the lettuce is grilled and therefore slightly wilted it could hardly stand up to the heavy handed chef. The poutine with pulled pork was in fact inedible as they seem to have forgotten (if they ever knew) what bbq sauce is all about (flavor) and decided to add more sugar than anything else. After several days of great eating in Toronto Local 1794 was a total disappointment. I would suggest if it's between leftovers or Local 1794, stay home."}
{"text":"I'm not one to write a review namely because I've never dined at an establishment where I've truly enjoyed each item ordered.  I'm a seasoned vegetarian and admittedly give this place tops marks all around. From the service, to the ambiance, food, and management... This place is a new gem to the Toronto landscape. The owner, Harry, happened to be on site and personally came over to ensure that all was to my liking.  I'm looking forward to dining here again soon. Will definitely will bringing my vegetarian family and meat eating friends here too. Two thumbs up, Local 1794."}
{"text":"Great beer selection. Pizzas are good. I've had a couple of items off their menu and it's been hit or miss. Wings are OK, one time they were undercooked and had to send them back. Same thing goes for the burger. They have recently redone their menu though so perhaps the food has improved."}
{"text":"Visited again a couple of weeks ago.  The new restaurant glitches were completely ironed out. Had the calamari that was delicious and obviously fresh. The pizza again ( how could you not with the beautiful wood burning oven) and my husband had the burger. All of the food was excellent. We sat at the bar as it was very crowded. The service was excellent and we were never rushed, even with the number of people waiting to eat. I am so pleased that this is in our neighbourhood, but I would also travel out of my way to eat here. Excellent food, service and prices. Exactly what you want for a great night out."}
{"text":"This was my second time visiting Local 1794, the first time was a few weeks ago and my partner and I both had pizzas. They were pretty delicious, and piqued our interest. This time around he tried the smoked half chicken dinner, and I had the heirloom caprese, we split the calamari. It was a really excellent meal; crispy squid, ripe tomatoes with slightly sweet balsamic reduction, juicy chicken and really good fries with house made ketchup. Looking forward to trying some of their cocktails, but we seem to get sucked in by the McAuslan Cream Ale on draught. A great neighbourhood joint, hoping to come back regularly."}
{"text":"Had the wild boar pizza which was very good. Similar flavour profile to the duck confit pizza at pizzeria libretto. The fish tacos were also very good, fresh and nice smokey flavour to them. Their ice coffee was just right. Not too sweet. Will go back again."}
{"text":"I went with a couple of girlfriends the other day and we all enjoyed the meal.    I'm on the vegetarian/vegan train so I can't speak for everything but Friend #1 ordered a Caesar and the pizza with boar.   it looked great, she raved about both.  Friend #2 ordered the steak frites and upgraded to poutine.  they came out in separate plates but she didn't seem to mind - the dish the poutine was served in was about the size of my forearm.   She ordered her steak medium said it was closer to medium rare.  it looked fine to me but I wasn't eating it.    there weren't a lot of options for me on the menu and to be fair I didn't ask if I could get anything special so I ordered the large kale and quinoa salad with candied pecans and blueberries (I held the feta) and while it was tasty, visually it needs the white of the feta.  it was a dingy looking salad, green (kale), brown (quinoa) and purple/black (blueberries) but delicious.  I also ordered the vegetarian meatballs.    they're $10 for four which is a bit steep but they're delicious and I've been thinking about them since.  In a blind taste test you could easily think you were eating meat.  they were hearty and didn't fall apart when you cut into them and the tomato sauce was bold and a little spicy without being spicy.    GET. THE. (BLEEEEEP!). VEGETARIAN. MEATBALLS."}
{"text":"I had the \"Local\" breakfast and it was horrible.  I cannot find one nice thing to say about this breakfast.  My eggs were overcooked. The \"house made\" bacon was inedible.  It was just awful and for $13.00 it shouldn't have been.  Will not go back!"}
{"text":"This restaurant is a Gem. My boyfriend and I have been here 3 times. The food is great, ambience is nice and waitresses are friendly. We ordered Vegetarian Meatballs and Eggplant, Arugula Pizza during our two separate visits once for lunch and once for dinner. We came here on Friday night once, the restaurant was very busy but we were able to find a spot at the patio. We ordered Salmon Fillet for myself and Butternut Squash for my boyfriend and we were not disappointed."}
{"text":"Lovely decor, lots of attention to detail. Staff friendly and well presented. Shared 3 appetizers. Crab cakes which where excellent, fish tacos also excellent and calamari which was very good. The mains where good but not great. Two of us had the Angus burger and two the pulled pork. The burger was good but a wee bit dry. Pulled pork I tried was good but the sauce was a little over powering.   Overall it was good and we'd go back. Lots of good craft brews to choose from and a casual vibe . welcome addition to the Danforth."}
{"text":"In a word: overpriced. One of the first times I went there I had the fish tacos, which unfortunately I didn't realize featured orange roughy, which is a very poor quality seafood for such an \"upscale\" restaurant. I barely touched my meal, which the server didn't notice or bother to ask about. Another time I had their trout special and it was pretty tasteless, yet cost $25+.   A new item on their menu is their heirloom caprese salad. For $14, you literally get maybe five quarter-inch Bocconcini cheese balls and 10 cherry tomato halves. Ridiculous! This shouldn't even be $10! Also, be careful for hidden charges, if you don't ask they will charge you for any and every change/alteration. I asked for salad instead of fries with a steak and was charged $5 (on top of the $21 for a 5oz. steak), which the server failed to mention.   To be fair, Local's steak and pizzas never disappoint in terms of tastiness and portion size. Their fries are great too.  Bottom line: you have to be a very discerning customer here and ask questions about all items and be prepared to spend $90+ for a modest meal for a couple.  I want to like this place because it's in my neighbourhood, but I just can't accept spending so much money on sub-standard food with such small portions. People in the neighbourhood are better off going to The Wren or Morgans On The Danforth if they want to get their money's worth."}
{"text":"First, we made a reservation online a week before the planned date. They called us up a few hours before to say that the resturant was closed for a film shoot. Mildly annoying, but okay.  When we did go, however, one of us was throwing up in the bathroom within minutes of eating the food. She had been totally fine before. On top of that, the steak and fries I got consisted of three tiny strips of meat the size of my index finger. Three bites of meat for THIRTY DOLLARS  Would not reccomend this place to anyone. Not unless they like throwing up or paying the same about for dinner for two at a regular place for three bites of meat and a pound of frozen fries you could get at a fish and chips spot"}
{"text":"Good fun, great food Peri Peri is the highlight! Great service! Price was also good. Close to everything and easy off from transport."}
{"text":"Been back a handful of times and explored the menu and I really love this place.  Although it has a great atmosphere on weekends, it's also very family friendly (there are as many families as there are couples - and it just ... works.  The food is great as is the service."}
{"text":"We have gone to Local 1794 on numerous occasions since it opened and have enjoyed the food all times, except this time there didn't seem to be the same attention to detail with the food.  We also had an extremely bad experience (not the first time) with service.  We didn't have reservations so sat at the bar and the bartender just does not have the experience that it takes to serve the size of the bar that they have.  Forgot to get my partner's beer and never asked us how the food was until the end.  We had to ask someone else about there not being bacon with the cesar salad.  If this had been the first time this had happened we would ignore it and just say that it was a one-time thing, but it's at least twice now.  They need to get an experienced bartender and have at least two good people behind the bar.  The place was full on a Thursday night but won't be for long if they continue this way."}
{"text":"I am so glad this little gem is in our neighborhood. It's a cute spot with booths, tables and bar. They even have outdoor seating.   We were promptly seated at the front beside the wine display. My only issue was the light from the booth was annoying. We attempted to cover it. If you can dim that it would be fantastic. (Hence the 4 star otherwise I'd give you 5).   Our server was attentive and super nice. We ordered the Cesar salad - tasty  and a piZza each. - well done.   A great selection of craft beer and wine.   We are coming back."}
{"text":"So, the far East End is coming alive! Great menu, great design, over active but very attentive serving staff. Definitely a keeper! Menu limited but diverse. Food quality excellent and locally sourced. Will be a regular, I suspect."}
{"text":"Fantastic craft beer selection. Their pizzas are among the best in the city.Friendly staff and excellent service."}
{"text":"I've been here twice now within the past month or so (once for Father's Day once with my entire family for dinner). First occasion I had the kale salad, I mean really nothing to write home about. It could have used more toppings and less kale. My husband and dad had the wild boar pizza and the pork platter with poutine. They both RAVED about the pizza!!! I heard about it for days afterwards. Based on this good experience we went back for dinner again a few weeks later. My dad had the lamb pasta, him and my husband again shared the pizza. My husband had the butternut squash gnocchi, Me and my sister had a burger, my aunt had the chicken and Brie pizza. My dad said the pasta lacked lamb - very little meat was given. My burger was quite dry although the fries were super delicious. My husband really enjoyed the gnocchi. The Cesar I ordered was delicious and super spicy, kudos on that. Overall, I haven't had the best experience with MY food but the rest of my family has been very happy. 3 stars."}
{"text":"Awesome food, beer and service.... glad we found it. Pasta, fish tacos, steak.. yummy I tasted all"}
{"text":"Had dinner here April 29th, 2016. Since I'm gluten free, choices were small. I had the quinoa kale salad with added grilled chicken. But they had a tasty gluten free lager,  Lakefront New Grist on the menu that I tried; I'd highly recommend it. Husband had the burger with fries combo that he greatly enjoyed. I'd have given a 5, but my salad wasn't well dressed, having almost no dressing. The place was extremely busy and noisy so I didn't get much of a chance to attract waitstaff to address issue. Nevertheless a welcome addition to this side of Danforth."}
{"text":"When you choose an establishment to ring in the new year, the opportunity to be able to hear your friends is important. And food that looks and tastes great is paramount.  But having staff who actually want to be there, even if it's New Year's Eve is the pièce de resistance. We were here until 2am on New Year's Eve and it was hardly noticeable. The atmosphere is warm and inviting. The high backed booths were like little nooks for each little mini party. Our group sat at the high-tops in the front; protected from the elements by a thick curtain. The wine list is quite extensive with selections from around the world. In review of the menu, I wish I had more of an appetite. I had an appetizer of the surf and turf. At first glance, the requested medium rare of the roast beef slice looked like it hadn't been achieved. But when I sliced into the beef itself, which was only about half an inch thick, I realized the centre, the sliver from the slice was actually medium rare. Wow! How'd they do that? I was impressed. The grilled shrimp was juicy, and a perfect accompaniment to the taste of roast beef. And the decorative balsamic reduction complimented the flavours. The food was inspired and I will now have to return with a larger appetite.  The lovely atmosphere of a restaurant is enhanced by friendly and courteous waitstaff. And what a treat to be delivered a complimentary glass of sparkling wine and then a shot of a fruity concoction afterwards to toast the New Years.   We welcome you to the neighbourhood Local 1794, and hope you stay awhile!"}
{"text":"Absent service, greasy fish and chips. Sat for half an hour with an empty glass. The place is packed, so they're doing something right, but I've got no desire to come back and find out what that is."}
{"text":"Excellent craft beer selection and great vibe. A nice place for up to 6 friends to a booth. The food is awesome - ordered the burger and fries which really hit the spot. The seats really need reupholstering because every single one of them is cracked vinyl and that can feel gross to sit on. The service is lovely and they take reservations."}
{"text":"SO glad I was in the area and got the chance to finally check out Local 1794! We stopped in for dinner on Thursday night and were surprised by how busy it was! Luckily, it didn't take long to get seated and put our orders in.   I decided on the Wood-Fired Fungi pizza. Creamy sauce, Portobello, Cremini, Shiitake, Truffle oil and Fior di Latte. It was delicious! Lots of mushrooms, good garlicky flavour, nice chewy crust and the truffle oil made the mushrooms taste richer and meatier. A dash of hot oil and this pizza sang!   I wasn't sure if the pizza would be big enough for two hungry people to share, so I also ordered a side of hand-cut fries. They were excellent! As you c an see from the photo I posted, the fries were golden-y brown, crisp on the outside and soft in the inside... just the way I like them! I would have loved them in a poutine but sadly Local 1794's gravy is beef-based. I am hoping Management will see this review and consider offering a mushroom-based option!!!    All in all, we left very full and very happy and we'll will be back!"}
{"text":"Service was good.  Young but engaging. The crowd was mixed... 20's on up Atmosphere was up beat and the decor very nice. Ordered a beer... To start.  Ordered the braised Lamb Shank.  I found the lamb a bit on the dry side and minimal flavours, as was the mash potatoes. It came with, or should I say, garnished with two \"sprigs\" of broccoli, a slice of carrot and a slice of pepper.    The whole thing would have better if the food hadn't been below room temperature.... I mean the whole meal was tepid at best.  I followed it up with a chocolate cake which I was told was \"rich\"... I grew up in the era of Just Desserts... I've had much better from a boxed chocolate cake from a supermarket.  Would I go again... Probably not... Unless I heard something had changed."}
{"text":"I live down the street, and this is quickly becoming a favourite gastropub of ours. We've been three times and they never disappoint. Service is excellent, food is even better, and they have a generous selection of beers - what more could you want?   My favourites on the menu include the calamari, the macaroni and cheese, and the wild boar pizza. I love comfort food and they have the best mac and cheese I've ever had - creamy, cheesy, and left me comfortably full but not over the top.   Definitely worth a visit!"}
{"text":"The food here was fantastic. The ribs I got were amazing! The grilled Caesar salad is not to be missed either. The gnocci was great too, we also had gluten alergy with us and she loved her pizza. The wild boar pizza was also outstanding. Great place, cool decor and very attentive staff. Amazing spot all around"}
{"text":"2015 Summer. Great ambience, good food, great menu, excellent beer menu. Will be back.   2015 Winter . Same great ambience...I didn't notice how Hipster it was last time I was here...a bit cliche as far as that went but if I judge it on the food alone, the portions are generous and the quality was there. We didn't have the best waitress ever - maybe a bad night or too many tables but the experience wasn't what it was the first time...3 stars for the second trip."}
{"text":"Went for dinner on a Thursday night with my husband, after a few of the appetizers and salads caught my eye on the menu online when we were deciding where to go. Definitely a good choice - the staff was very friendly and upbeat, I really liked the decor and vibe, and they had a great drink menu. I tried The Capone and very much enjoyed it, as I like bitters. We split the calamari appetizer which was delicious, and then I had the Caprese salad and my husband had the Boar Pizza, both of which were good but not outstanding.  The only element of the restaurant I did not enjoy was the TV in the back against the wall, which seems out of place for the type of restaurant it is.   I'll definitely be returning as there were a number of items on the menu I would still like to try, and I really enjoyed the atmosphere."}
{"text":"Hey Local 1794, I am glad to say you do know how to host a great live jazz show! I went here on a \"first Wednesday live jazz\" night and I was honestly surprised with your set up. Great band, cozy ambiance, and timely and friendly service! Nice taps and sweet potato fries too! Local 1794 is such a treat for us East Yorkers. I know what I will be doing every first Wednesdays of the month"}
{"text":"We found this place on Yelp when my sister and I needed a late-night meal and drinks. Nice, clean establishment with great service. Our server was just the right amount of attentiveness, while not interrupting our conversation. Nice selection of wines and cocktails. Their late-night menu was limited, but definitely sufficient. We had the nachos with pulled pork and they were delicious. Nice neighbourhood on Danforth & we'll definitely be back."}
{"text":"My boyfriend and I wanted some late night eats and stumbled upon this gem. The atmosphere is upscale but cozy, dimly little with nice big booths and a long bar. Low key reggae tunes set the tone for a relaxing experience.  Our bartender / server Krysta was great! She recommended an amazing red wine and the vegan meatballs and we also grabbed the charcuterie board. The food was delicious and the servings were generous. A great value for $10-$13 apps.   We will definitely be hitting up this spot again. Bravo!"}
{"text":"The atmosphere is lovely, the open front on a warm day was beautiful, but most of all our bartender Sabrina was incredible. It was quiet when we came in. We weren't sure what we wanted to drink so she asked us for our favourite liquors, how strong we liked our cocktails and what flavour profile we wanted (sweet, salty, sour or bitter) and she just mixed us up customized cocktails (apparently all standards that she gave us the names of so that we could order again if we came back and had a different bartender, including mine a \"john collins\" which was the favourite of the group). She was fun and helpful and offered suggestions for non-tourist trap activities to do in the city (we were entertaining a guest from NYC) and even recommended appetizers that she thought would go well with our drink when we said we were hungry! (She was right.) Sabrina was the highlight of my friend's first night in Toronto. I will definitely bring visitors and clients here again-- if only to try another one of her \"James Franco\" shooters."}
{"text":"I absolutely love this place. The staff are super friendly and it's one of the few spots along the Danforth where you can sit at the bar and enjoy a great dinner and not feel as though you would have preferred a table. The staff really goes out of their way to make you feel part of it all. The ambiance is lovely and the food is fantastic!"}
{"text":"First time I came here I didn't really have much in terms of expectations, but interior and ambience took me back when sat down at the bar. The staff is always super nice and quick, and usually find myself Shazaming the music.  They have a great beer selection for a decent price. My favourites are the Mac n Cheese, Seafood Linguini (lots of seafood) and Calamari. The poutine is great value if you want something small to eat."}
{"text":"Loved this place, the atmosphere, the service, the food...all great. And nice to have a place thats walkable. We had the delicious calamari (incredibly tender), and fish tacos to start. Then the grilled caesar (a touch boring), and the arugula and eggplant pizza (was excellent). Will definitely be back."}
{"text":"Came here with a friend for brunch. I ordered the jerk chicken wings and waffle, which we both decided was just so-so because it was dense and the flavours didn't mesh well. Not a repeat order. My friend got the sweet potatoe and smoked salmon quiche, which was delicious.  Good selection of craft beers. Very relaxed and clean atmosphere. I want to come back for dinner time and enjoy more of the beers with some buds.  Server was friendly and efficient. They also have a little patio for the summer."}
{"text":"I just moved to the East York area 4 days ago, and I've already been to Local 1794 twice!    I called ahead to book reservations, since the reviews online are so good, and they're always busy I wanted to be sure they would have a table available for us!    The food was fantastic, but keep in mind that the place is a bit up-scale. Don't come in expecting nachos or chicken strips.  When asked, the server said that nachos are available on the \"late night menu\" which is only after 11pm, and would not accommodate my request at 9:30pm when I asked to order some.   The only other negative experience was when I  ordered extra dipping sauce, and the server told us \"you can ask me for more once you're done the one you have\". We both felt that this was condescending and we were being treated like we're 4 years old by being told we need to finish what we have before we can have more. Because the server got busy, we ran out of dipping sauce and by the time she brought more (the wrong kind) 20 minutes later, all of our food was cold, so we just got everything to go. It seems like a small/petty thing, but this one small thing sorta ruined the whole evening - all over a side of chipotle mayo :(   That being said, I still recommend this place and give 4 stars based on the manager's apology to me, and the food/service was otherwise perfect!"}
{"text":"Fantastic. I've been here a few times and sampled much of the menu. Everything is well prepared and delicious. I really love the vegetarian meatballs.   Staff are pleasant. Service is quick and thorough.  Aurally comfortable (haven't been there with the patio door closed yet.)  Enjoy!"}
{"text":"Great food and service! Super cute. We got the calamari, fish tacos and mac and cheese and wow, so good! This place is pub food but classier. And def recommend the raspberry lemonade!"}
{"text":"The waitress was very friendly. The charcuterie board was good and boar pizza was delicious. The Calamari was not a fan for me since it was very bland. I was hoping for some spices or a twist.   Overall good food and good service."}
{"text":"My boyfriend and I have been here too many times that I have lost count. I LOVE THIS PLACE. The waiting staff is friendly and the service is fast. The food is also phenomenal. My favs are the Baja fish tacos, Thai mussels, calamari, salmon and the Cali steak. Definitely a must try. I suggest making reservations because this place is generally packed on a Friday and Saturday night."}
{"text":"I expected a lot from Local 1794 based on the Yelp reviews, but we were disappointed. The highlight of our dinner was undoubtedly the pork-topped poutine - the best we had on our tour of the Ontario region. We also really enjoyed the kale salad. But nothing else stood out.  We tried a few different cocktails and were underwhelmed. The burger was nothing special, nor was the boar sausage pizza, despite sounding really interesting.  Admittedly, our experience was particularly marred by the ridiculously slow bar service, which was totally out of synch with the food service.  We didn't get our first drinks until we were finishing our appetizers, and our second drinks came as we were finishing our meal. Our waiter said this was a highly unusual circumstance due to an absent bartender, which I buy, but it didn't lessen our overall disappointment that things didn't measure up to our expectations. We left without trying dessert, which is a highly unusual call for our 15-year-old son. In a word, meh."}
{"text":"Both my guest and I had pizza and although it was made w/ fresh ingredients and tasted 'OK', it was entirely unexceptional and unworthy of a repeat visit. If the east end wasn't crying out for GOOD food, this place would not survive based upon what I ate. Good service / boring food."}
{"text":"I came here with a friend to kill some time and what a gem. This place is new, clean, service is wonderful, and the food and drinks are great!! They're pretty popular with reservations so making one is definitely recommended. The atmosphere is ambient with soft, dim lighting and casual music playing (to match the overall quieter environment). Great selection of Canadian/Italian food, as well as many beers, wines, and spirits. I personally had the house burger and a couple wheat beers and I was in heaven. And what was even more surprising was when I went to wash my hands, the bathrooms were very clean, and dare I say they smelled pleasant.  I noticed a lot of families with young kids (less than 1 y.o.) so it's a good place for families as well. They offer tables, bar, and roomy booths down the length of the place.  You gotta check this place out, you won't be disappointed."}
{"text":"Came here for dinner with my friends. The food was okay but the beer list was gooodddd. The place is big and the decoration looks great. Nice place to sit and chill with friends. Definitely come back again for the drinks."}
{"text":"First time here and I really enjoyed it. Relaxing ambiance, very comfortable as well, music wasn't too loud, dim lighting, no complaints there.   Both our waitress and the bartender were awesome -- super attentive and friendly.   As for the food, we started off with the calamari which had a very rubbery taste (I guess because it didn't look like it was battered). I've definitely had better calamari and wouldn't get that again from here. For my main dish I got the fish tacos which I must say I found very bland. There was too much on the tortilla to even wrap it up like a taco and the tortilla itself was extremely thin so it kept ripping. My boyfriend got the Local Burger with fries which he said was a decent burger. I loved how it was a large portion of fries they served with the burger that also tasted great.   Although I didn't like my food that much, I loved the service and would like to return to try something else."}
{"text":"Inadvertently picked St Patrick's Day to make the first visit to Local 1794. Restaurant was packed and had to wait at the bar for a short time for table. They have an excellent selection of on tap beers including a couple of less familiar breweries. Staff was very attentive and gracious in the face of the green hatted revellers that filled the space. Interesting selection on the menu but decided to go with evenings themed 3 course dinner. All entrees and starters were fresh and excellent. Desserts were decadent.  Visually the restaurant is filled with photos and murals of Toronto from the early 20th century. Two video screens playing silver screen classic films add to the theme. Sat on a high table with comfortable chairs.There are comfy booths here that are hopefully open for the next visit. Would definitely recommend ."}
{"text":"This place is pretty good. I had the wild boar sausage pizza which was really good, and the jerk chicken wings which were pretty bad - the flavour was sour and not at all like the jerk chicken I've had at other restaurants/people's homes. If I was in the area and looking for somewhere elegant to catch up with a friend or take a date, then I would recommend coming here. Nice ambiance."}
{"text":"There a very few places in Toronto with such exceptional service and fairly prices food as local, I've become a regular"}
{"text":"Disappointing. Caesar salad was very good as was $33 steak, but the burger was small and tasteless and pulled pork sandwich was messy but not very good while fries were soggy. Beer and cider reasonably priced in a noisy venue."}
{"text":"Easily the best restaurant on Danforth! Food is amazing, service is fantastic and beer selection is abundant and ever changing. The specials here are so great. Recently tried the carrot cheesecake and it was practically life chaining. Love coming here and trying to make it more often!!!"}
{"text":"This fine establishment does not dissapoint.  Visiting on a busy Saturday night, they were unable to accomodate our reservation request however we called in before leaving and they were able to hold a table for a short time.  The food was great!! Calamari is amazing and I ususally don't care for it.  The burger was spot on and the fries were to die for.  The atmosphere was vibrant and the drinks were great but drink service was a tad slow.  It took a very long time to get the waiters attention so we could order our drinks.  This is a nice little gem in our neigherboud and I will continue to frequent it!"}
{"text":"A nice local pub that I'm sure is hopping on the weekends and in particular on the summer.  It has a quaint little patio that invites great opportunities for people watching over a few pints of craft brew.  They get a star for the smoked/braised/grilled ribs over a bed of hand cut fries.  I make my own ribs and rarely order them out but couldn't resist as I watch a half rack walk by me.  They lose a star because the poutine was bland and under-seasoned.  Just a tip for restauranteurs, when people order poutine, they're not concerned about their sodium or caloric intake.  Go big on both!    Kudos to the attentive server who noticed that my wife left her earrings on the table and chased us out onto the street for about half a block to catch up with us.  Honesty is a virtue.  We'll be back for sure."}
{"text":"stopped in for a quick dinner and was very pleased with the special of the day and their selection of beer on tap."}
{"text":"I'm giving this review 5 stars despite the spotty service because the chef made me a delicious off-menu vegan entree. I'd asked about this when I made the reservation since there was no main that I could eat aside from a salad and it was clear some thought went into it. The service was friendly, but inexperienced."}
{"text":"I live near by this place and thought it was time to check it out. I called to make a reservation, lucky I did as the place is very busy. Right from the beginning when I walked in the door the staff were very friendly from the host to the bartender and my waitress (Jazzy).  The food was great except maybe the Apple Crisp dessert seemed very sweet to my liking. The restaurant looked great inside and this is definitely a place I will eat at again."}
{"text":"The smoked chicken was excellent, tender, juicy and perfectly cooked. We shared a pizza and the kale and quinoa salad to start. Next up the four of us shared calamari, vegetarian meatballs, sweet potato fries, the half chicken and another order of the salad because it was so good. The service was very good as well as the tunes, craft beer and upbeat atmosphere."}
{"text":"I love this restaurant.  I only ever write reviews if I love or hate a place. I've been here twice before today, once for dinner and once for brunch. I decided to take my husband and son there today but we got there before it opened. While we were peering in the door looking for the hours, someone opened the door to say they would be open in 10 minutes. I asked if we could come in because my son was asleep in his stroller and it was snowing. They let us come in before it opened and we sat at a table. In exactly 10 minutes they came over and took our order. The food was amazing and the extra service they gave us made a huge difference. I'm likely going to be a regular."}
{"text":"The wings are so delicious and the mac and cheese is yummy and HUGE!"}
{"text":"Hidden gem bit not a secret to locals.  Busy during dinner times so may have to wait. A pint of beer from huge sl Election abd Bbq chicken is a winner."}
{"text":"What a welcome addition to the neighbourhood. High energy restaurant with very solid food, great wine beer and cocktails and a hip vibe. As a local I have waited for a long time for something like this show up. Reservations are a must for Thursday-Saturday."}
{"text":"I imagine all the suits coming here after work catching up over wine and food. On Wednesday night, my friend and I visited as non-suits and got one of the last tables to experience the mystery that is Local 1794.  It's very trendy both outside and inside. They have a small little patio that opens up into the restaurant, which has hanging dozens of low hanging light fixtures from the ceiling and a decked out bar.  She had the veggie meatballs (yay) and fish tacos (nay). I had the burger (nothing to write home about). Important: the fries were fat instead of skinny.  The food came pretty slowly and service wasn't that great either, but I forgive them because it was so packed on a weekday. There are a lot of other restaurants I'd like to try in the area before coming back here, but I'm glad I satisfied my curiosity about this hippity happening place."}
{"text":"Local 1794 has real quality food in a pleasant atmosphere tucked away on the eastern edge of the Danforth past Coxwell Station.  The high point was the food itself, but the strong service, pleasant venue, and respectable drink lists backed it up.  The FOOD:  First of all, I have to say portions are good and sizes are reasonable.  Two rather hungry guys split 3 dishes and had a pretty tough time finishing them. ~~Calamari  ($11) was by far the highlight of the night.  You could tell that sometime that very day, someone had cut up a very fresh squid, dredged it a beautiful buttermilk batter, and subsequently fried it to perfection.  The habanero aioli (it's not too spicy) is a wonderful accompaniment.  Perhaps the best calamari I've ever had. ~~Charcuterie Board ($16 for 2 persons): a nice assortment of meats and cheeses including some delicious prosciutto.  An unusual addition was fruit, in our case apples and strawberries.  Very nice portions, really appetizer size for 3-4 people.  The only downside is the server didn't tell us what any of the components were when it was dropped off...just left to make an educated guess.   ~~Wild Boar Pizza ($17): a very nice pizza from toppings to crust.  The gaminess of the wild boar is complemented by the deep flavors of house-smoked bacon and the creaminess of fior di latte.  The crust is perfectly finished to a delicious crisp in their wood-burning oven.  Beats the pants off Pizzeria Libretto.  The SERVICE: We sat at the bar and were served by a very friendly young Australian woman.  She was busy, but we never felt neglected.  A nice touch was seeing her top up my friend's Guinness after it had settled and she didn't think she had filled it enough.  Classy.  The ATMOSPHERE: Trendy but also homely (and I mean that the way the Irish use the word).  The red and white checkerboard chair backs recall a casual diner, while the booths are intimate.  Noise level was a pleasant buzz that felt busy but did not require shouting.  I really don't get why they have 2 TV's...this isn't really a sports bar, and I just find they detract.    The DRINKS:  They have something like 23 taps, which is definitely impressive and guarantees that you'll find something to your taste.  Unfortunately, I think they're playing it just a little bit too safe.  Mostly Ontario beer including real craft beer like Great Lakes and the macro beers pretending to be craft like Mill Street.  If they brought in a beer expert, they could really expand the range and compete with the better beer selections of places like Bar Hop or the Only Cafe.    On the cocktail side, they could also use a little rethinking of the menu. They have a well-stocked bar, but the listed cocktails seem to completely avoid the classics and the homemade creations tend to veer towards the sweet side.  Plenty of room to grow here.  Decent wine list, although I was in a beer mood.  OVERALL, I'm quite impressed with this place.  It has great food, a good vibe, and potential to improve, especially on the beverage side.  It's further east than I've ever gone out for dinner on the Danforth, but I look forward to a few extra stops on the TTC to come back."}
{"text":"Great spot! Another great addition for the \"east of Greenwood\" area of Toronto.  Great service, wonderful menu prepared with expertise, clean, cool, tasteful and inventive decor. Well trained staff, polite. Nice clientele. Good wine, spirit and beer selection. Polished glasses. Comfortable bar seats, large tables as well as booths. Priced exactly right for this area.  Really enjoyed it! Large TV at the bar that we could watch the game while eating our fabulous meal! Note: this is not a sports bar!    Will absolutely be back!"}
{"text":"Ordered the Thai style mussels, and it was tasty and fresh. But the smoked chicken was dry and the fries was mediocre. Given the price level, I would only say that this place is okay but not a really worth going place."}
{"text":"So -- this new find is in my 'hood, and glad I am it is!  But folks -- the word is out -- busy busy --- so if you want to get in especially on a weekend, I do recommend you think about making a reservation.  Love this place already.  We met friends there and we tried: - the Smoked Chicken Wings (jerk style) - oh yes -- we will be having lots more of these in future - the charcuterie board ---- Yum yum - Then we had the Burger -- the Petite Steak Frites and the Cioppino  All the mains were fab and the frites were perfect -- nice and crunchy with the skin on fries - Lots of drink offerings -- good selection of wines, and some cool microbrewery beers and innovative cocktails.  Huge bar area and actually a fair bit of seating. Lots of street parking to be had.  I am not sure I agree with the $$ rating for price though - because depending on what you have, the range could be more up to $$$.  So if you stick with pizzas, 'wiches, then you are on the $$, but if you go with stuff like the cioppino, steak etc -- think more the $$$ range.  Enjoy!"}
{"text":"This place is my local! Amazing food, awesome staff, wish they had a few more bourbon options but it doesn't stop me from coming back! Mac & cheese amazing!!!"}
{"text":"Cute place in Danforth and Coxwell area!  It has a nice patio to sit, which is also dog friendly!   We had tried the wild boar pizza - which was very good! Definitely want to try the other items on the menu!  Friendly service. Definitely will be back here more often since it is so close to us!"}
{"text":"Great taps, great food. Went for a friend's birthday and hadn't ever heard of this place. It's kind of in no-man's land as far a bars & restaurants go on the Danforth. What a surprise! The place was packed, great tap selection and the mussels and poutine were very good. It's a perfect local and even worth a trip if you don't live just down the street. I'd go back for sure."}
{"text":"Our go-to after a long work week on a Friday evening. Their service is always fantastic. My wife is sensitive to gluten and they have always been extremely accommodating and helpful. The craft beer selection is one of the best in the east end and there is a constant rotation of different taps. The food is all around awesome. You really can't go wrong. Recommended: 1/2 chicken dinner, ceasar salad, steak and frites, the wings, the burger and the pizzas. The pastas are ok but not great. The ambiance is a classy gastropub - great energy and generally mature crowd. Family friendly too."}
{"text":"Best gal and I had a great time during our visit. Servers, bartenders and management alike were gratious and warm. New regular spot!"}
{"text":"Hands down a great place to check out! Yummy food, affordable prices, cool atmosphere and great staff! Would definitely come back and recommend it to anyone I know! I came with my friends and my friend actually suggested it to us! I got the Mac and cheese and it was pretty damn good!"}
{"text":"I stopped in after going to the tool library across the street. Only been here once but the beer selection was great and the butter chicken poutine was amazing. Staff was friendly and helpful."}
{"text":"I came here to have dinner with my mother and aunt who were visiting and staying in the East-End. I hadn't been here before so I was going blindly, save for the few Yelp reviews I read before calling the restaurant to make a last-minute reservation. Actually, in my 15 years or so, I don't think I'd been east of Coxwell! Anyway...  I didn't find the menu particularly innovative,the food was good (tasted as expected - no surprises good/bad) but their service was top-notch.  I had the fish tacos and the kale and quinoa salad.  The fish tacos alright, if a little bland - I felt something was missing - a little spice maybe? I prefer grilled fish tacos but as these ere friend, they were light and crispy.  The quinoa salad was also good--a little too acidic for my liking and not a lot of quinoa, but in general, it tasted good and I was satisfied.  My mom and aunt split the calamari and a pizza special they had.  My aunt, who loves calamari, said it was the best she had every tasted (and asked me to make sure I added her comment in this review!)  The service though, was very very good. Our server was welcoming, friendly, knowledgeable and very accommodating when my mom couldn't decide on a beer - bringing her multiple samples to try. My mom's not usually high-maintenance but I think she liked the attention!   Contrary to what another reviewer stated - their patio is NOT \"dog friendly.\" You cannot bring your dog onto the patio and its design which fences the patio in with thick wooded boards, does not allow you to tie your dog up to sit on the outside. I'm glad I checked with the restaurant first when making my reservation otherwise I would have brought my dog and be SOL when I arrived.  There were a number of tables seated when I arrived too, which tells me this is a neighborhood gem.  The beer selection is good and the menu is diverse enough to appease every palate.    I would return."}
{"text":"Definitely trendy with very nice decor. The food was pretty good, but unfortunately nothing to write home about. My boyfriend and I ordered the wild boar pizza and the poutine to share, and both were 3.5-4 stars out of 5. A nice place, but I'm not sure that we'll be back!"}
{"text":"I've eaten out a LOT since I came to Toronto for a week and this was probably my favorite place. From the atmosphere and clientele to the food and the service.. everything was top notch. Best experience at a restaurant my entire trip.  Luckily we arrived a little bit early as there were people but not a lot. That soon changed because after maybe 15 minutes the place was packed and people were waiting outside for a table.. and it was on a Wednesday night! That goes to show you how much of a gem this place was. We were seated and our server, I believe whose name was Patricia, greeted us and for the remainder of our evening was nothing but a delight. Was extremely attentive, on point when it came to what we asked for and an all around pleasure to have as a server.   I was browsing their menu and it was just the right size. My friends ordered their Charcuterie Board and Fish Tacos. I tried the Charcuterie board and I was amazed by everything. It was quite large and could easily feed four people as a starter. I didn't try the Fish Tacos but everyone else was raving about it so I assume it was great.   Now I never ever say this.. but I will say it this one time. I don't usually eat meats other than the staples of pork, chicken and beef.. not because I don't want to but because I've never been able to. When I was looking at the entrees I came across the Caveman Game Board which was described as \"Wild boar smoked sausage, smoked venison and elk biftekia\". I've never had any of those meats and I decided to get it just to see if I'd like it. BEST DECISION I'VE EVER MADE AT A RESTAURANT. The dish was absolutely fantastic. Everything was cooked to perfection. The white and orange carrots were cooked perfectly and the potatoes were delicious. The star of the show for me was the wild boar sausage. That thing should be illegal it was so addicting. The venison and elk were scrumptious! I kicked myself for not trying any of these meats before! I devoured the whole thing and I wasn't even that hungry. For 27 dollars you will get a very satisfying meal out of it. It was beautifully presented too (see picture for reference).   For dessert, I had their bread pudding. It was good but not the best I've ever had. I personally found it to be a little harder than most but that doesn't mean it didn't do the job of being delicious and ending a great meal. The manager Victor was also another great aspect of the restaurant. He came by our table numerous times and had such a pleasant demeanor. He was friendly, attentive and genuinely seemed to care that we had the best experience we could have and he did a great job. I can now see why this place was packed on a Wednesday night. What a gem of a restaurant."}
{"text":"Great first impression :)  Long awaited gastro pub hits east end Danforth!  Hallelujah!  We went tonight with a few friends and family for dinner.  They have 24 beers on tap along with a large wine selection, but most importantly they have delicious food.  We ordered a few appetizers to share including the crab cakes, charcuterie board, margherita pizza and wild boar pizza and Mac and cheese.  Everything was great and the pizza came from a wood fired oven which makes it very tasty (almost the same level as queen margherita pizza, and libretto, but not quite there).  All the ingredients tasted fresh and flavourful with some creative flair, like the Apple slaw that came with the crab cakes, or the caper berries (yes we googled it) with the charcuterie board.  We ordered the wild mushroom risotto, gemelli, ny striploin,and kale salad.  When we went the power went out twice but things were fixed within 20 minutes.  I think it affected the cooking as the ny striploin we ordered was a bit overcooked.  The waiter also mistakenly added the game board to our order, but remembered and took it off our bill right away, but let us keep the food and take it home (common sense).  So an A+ for service!  I will be coming back, especially when I read something about kiddie happy hours.  They know their market!"}
{"text":"IMO this is the best menu and consistently on the Danforth. I live east of this resto, so it's a bit of a trek, but I do it...again and again despite lots of choice east of here.   Favs- the menu is extensive, maybe too much so; but don't change, we love you.  Go. Now. Guaranteed you will like, maybe even love."}
{"text":"Disclaimer: limited menu exploration given that we only had apps and old fashioned's  Stopped in on a Friday evening. Weather was perfect and we sat near the front overlooking the patio. No trouble with seating, a few customers but not busy at this time of night (10pm)  Greeted by a friendly server and advised to pick a table of our choosing.  The ambience is very inviting. It's a narrow, long restaurant dominated by a bar running most of the length of the restaurant with ample bar stool seating (20 plus seats I'd guess). Drop down dim lighting, a well stocked bar with a reasonable wine selection on display and a natural brick finish on the side of the bar adorned with various historical black and white photos of old Toronto and danforth provided a pleasing, relaxing ambience.  Drinks:  Standard old fashioned: better side of average, not overly sweetened, they don't have single cubes. Wife tried a \"local canadian smoked bacon old fashioned\" 2.25 oz variation made with Bulleit bourbon, grand marnier, maple syrup and black walnut and angostura bitters garnished with an orange zest and twice smoked bacon. ($14). Both were easy on the palate and I didn't have a clear favorite although the wife preferred the standard old fashioned. For better form would suggest they invest in the single cubes.  Apps: Surf&Turf: a 5oz flat iron served medium rare at the chefs suggestion. This was tasty, fairly juicy, and seasoned quite well. Chimichurri on the side proved the perfect accompaniment, as was the sweet potato crisps. In addition the two grilled tiger shrimp and chipotle aioli were excellent. This $18 dollar appetizer was perfectly sized, tasty, and provided a variety of flavours and welcome contrast between the texture of the steak and the shrimp. A definite recommendation.  We followed this up with the chicken wings due to our appetites being whetted by the surf and turf. This was an unexpected pleasure. The wings are a pound (10 wings), and come with a choice of made in house BBQ, Jerk, or hot sauce ( the hot sauce is franks hot sauce). Pro tip: get the wings plain and ask for the bbq and the jerk on the side. The combination works well and you'll need the bbq to take breaks from the jerk sauce.   A piece about the jerk sauce: I've found that many restaurants serve jerk dishes that taste like they were seasoned by a marinade that you can buy at your local grocery store: not enough heat, too sweetened, and the wrong viscosity and after taste. I spoke with our server and he mentioned that previously the jerk sauce was an off the shelf variety. Here's the rub (see what I did there?): the sous chef is Jamaican, and he was NOT pleased with the off the shelf marinade. Accordingly he prepares his own jerk seasoning made of thyme, sugars, Scott bonnet peppers, and molasses. In short: an absolute winner! Lots of heat, perfect after taste, and went perfectly with the wings.  The take home: inviting low key ambience, friendly service, and the food was an absolute triumph. Would repeat 10/10."}
{"text":"A shared charcuterie plate and a shared pizza made a great meal for two. The former was attractively and thoughtfully composed, including among other interesting touches house pickled fennel, and the pizza featured three kinds of wild board meat on a crust that was thin but not floppy. An excellent selection of draft beers and a good selection of wines by the glass offer appropriate accompaniments. Service was friendly and helpful; our pizza arrived with perfect timing just as we finished the charcuterie. The atmosphere was lively, as you might expect from a room with a long bar and a (muted) ball game on TV, but not obtrusive. The pretty space gains a bit of extra seating with a small sidewalk patio."}
{"text":"4/5??? Are you kidding me?  The grilled Caesar alone pushes this place past that!  Great servers... very nice decor and soundtrack... and great food! Warm. Friendly.   I'm a single late 50s guy that loves a good Caesar and I walk past a BUNCH of places to go here once every couple weeks."}
{"text":"I love this neighborhood gem. It's such a nice vibe, good food and the staff is friendly."}
{"text":"It's pretty rare to find any decent dining options east of Coxwell on the Danforth. In a stretch where feasting is limited to McDonald's or some grimey wino bar serving petrified chicken wings eck! Thank goodness Local 1794 has come around to stir things up and gentrify the local tastebuds.  It's a cozy place not much on size with a handful of booths some tables littered about, and a lengthy bar so don't be surprised to find the Local a packed house on a Saturday night.  This particular Saturday we were seated at the bar which was perfect as my husband got to oogle and  marvel at the uniquely curated selection of interesting taps. Who says sitting at the bar's a bad thing, we got to sample a surprisingly tasty peanut butter and jelly flavoured stout from Sawdust Brewery in Portland which was pretty ace.  Our appetizer of crabcakes with an apple celery slaw was l accompanied with a lovely piquant aioli garnished with a crisp and briney caper berry which added a nice juicy crunch. My meal consisted of the Wild Mushroom Risotto and usually I'm not a great fan of risotto dishes, but this,*THIS* was a beautifully executed risotto! Gorgeously buttery creamy and a little nutty flavoured and cooked to a perfect texture. This is how all risotto should aspire to taste, absolutely divine!  True to his Neanderthalist carnivorous tendancies my hubby ordered the Caveman's Game Board and with all that grunting and lip smacking I can only assume his baser appetite was well satiated by the meat-tastic gaminess of his meal.  Overall I'd say that Local has brought some well curated flavour to a neighbourhood in desperate need of gastronomical upheaval  I give it 3.75 stars"}
{"text":"Burgers was good and the fries were good. They were not exceptional. Very good craft beer selection and nice ambiance. It was mid afternoon and not busy but the first thing I hear from the waitress is \"Do you have a reservation because all of these tables are booked for 6pm.\" It was 3pm. Perhaps that made me knock it down a star, but I wasn't feeling the service we got. The price was a bit steep too."}
{"text":"Being here in a busy Friday night, the waitresses and waiters are amazing! They're not only efficient, friendly but also pleasantly helpful. Beer always helps as a thirst quencher to kick start the night! I decided to order pasta, as it's always my safe to go to food whereas my friend had a classic burger. Not only were the portions I'm good size, not the taste is delicious. The pasta was not too crazy creamy, but it had great decent spinach and smoked chicken which goes well with the cream base pasta. The only thing missing is a dash of pepper. If you're around this neighbourhood and think this is yet your another local pub. Think again, food is delicious, waiters and waitresses gives you amazing services ( remember it's a busy Friday night) it's a secret place that people around this neighbourhood don't want you to know about. I heard the pizzas are yummy too and dessert menu changes. Try it, to know it."}
{"text":"This place was such a nice surprise! I've been trying to find a nice, reasonable restaurant on the Danforth that would please my picky parents. I thought the menu was a bit safe when I saw it online, but it had several vegetarian options for my stepmum and a few interesting plates for my more adventurous dad.  The service was. Out. Standing! They servers were attentive, friendly, accommodating and cheerful. The room was comfortable, and I thought the outlet at each booth was a nice touch for those who needed to charge their devices or computers. The music was Motown covers of top 40 songs, which was fantastic as it appealed to everyone regardless of age. And it seemed like the sort of place that could be open at all hours, in the good sense. I can easily see this place having great plates for breakfast, lunch and dinner. My only gripe is that they don't offer half litres for wine - there's a choice of two glass sizes or a bottle. But that's the worst thing I can say about the place.  My stepmum went with the vegetarian meatballs and ended up ordering a kale and quinoa salad after, as the app sized dish wasn't large enough (which she was advised of when she ordered by the server), dad got the mushroom risotto and I had the steak. Everything was cooked really well and came out beautifully plated.   Once I ate I realized why the menu read 'simple' - it's all familiar but perfectly cooked dishes. It's exactly the sort of place every neighbourhood needs. Regardless of age, this place had something for you, whether it's a fresh salad or an adventurous Boar pizza. I'm so impressed I think I'll be heading there for brunch on the weekend to see what else they can cook!"}
{"text":"Excellent local gem.  Great atmosphere and lots of beer on tap.  Had the crab cakes with apple/celeriac slaw and wild boar pizza.  Both were very nicely done and flavorful.  The pizza crust was thin, just enough char, and chewy (in a good way).  My friend had the caprese tower and chicken dinner and she said they were both excellent.  Service was friendly and attentive.  I will definitely be back for the pizza and to try some other menu items."}
{"text":"this is episode...nah...no one here would get it.  anyways, one of the restaurants on my \"bucket list\" to visit was this one, again promoted by BLOGTO this place came to light, I was fascinated by the décor and the menu options that were available. lets start with the name...which is utterly genius! local to the area, and 1794, the numbered address of the building(in correlation to the danforth avenue)I got off the subway at coxwell and honestly couldn't wait to sit down and eat, after a walk that felt like forever(five minutes) I was finally sitting down looking at this gorgeous menu. full disclosure, ALOT of yummy things are on this page and available for eating, to the point where you almost have a tiny bout of depression, because your stomach is only so big. the staff here were absolutely top notch, I sat down reading the menu and the waitress instantly came over with a glass of water filled with ice well, she promptly asked me if I wanted more water, which I responded with a yes, and she came back with a \"ikea korken\" bottle filled with cold water. back to the menu, I was on a bit of a budget, and settled on a couple of things, I couldn't help the ambience and the awesome music that was playing, as I watched people just talk and enjoy the setting. my app's came to my table, very hot and very fresh, some of the best calamari I've had in recent years, definitely far from subpar, the piri piri shrimp was also dynamite, proper flavor and balance with the heat, a perfect seafood starter, even with the order that I place, I wanted maybe two more pieces of each. I also had a poutine to start, as an absolute poutine fiend, I can tell you that this is no standard poutine, awesome gravy rich and full of flavor, awesome curds that are so fresh they squeak between the teeth, and last but not least the potatoes, perfect cut that has done a ballad with proper oils when fried, and light even though its a starch, just beautiful, blissful, and dare I say orgasmic. time for the main course, the star of the hour, and the Canadian MVP down to the foundation of Canadian cuisine, mac and cheese. I will not lie to you, this plate of cheesy noodle goodness arrived to my table with 3 feet of steam/heat coming off of it...very VERY impressed with this, I feel personally this doesn't happen very often when I go to restaurants that food is that cold. I cannot stress about the service, the quality of food, and just everything from start to finish, was fantastic. this experience was more then just a transaction between me and them, I felt like family coming in here with the attention I received from the waitress, and saw the equal attention being given to all of the eaters in the establishment.  one of my new favorites in Toronto, I wish I was local to the area, I see nothing but the best for this place in the future. I can't wait to continue to eat here.   IF I COULD GIVE IT MORE THEN FIVE, I WOULD OVER AND OVER AGAIN."}
