{"text":"Great locally sourced farm to table food! We had the fried green tomatoes and fried dill pickles as appetizers - both were excellent. Not over battered and fantastic fresh chow chow accompanied the tomatoes. Entrees consisted of the Hangar steak cooked to a perfect medium rare and wild mushroom ravioli. Both were outstanding and it's obvious that care is given in preparation and presentation. We also enjoyed a few of their fresh cocktails. Again...outstanding. We also appreciated the spot on service. Brennan did an exceptional job serving us! 

So nice to see a small business that supports our local farmers and uses fresh, \"clean\" ingredients on the menu. 
For the reviewer that said it's pricey - it's very reasonably price based on the quality and portions. This is not for the consumer that can't appreciate the value of a professionally prepared meal with top notch ingredients. It's refreshing to see a place of the caliber open in Concord. 

Will definitely be back to try something different!"}
{"text":"went on new years eve at the last minute, didn't even know it was there. there was a table available so they sat us quickly. the shrimp and grits was awesome one of the best I have had anywhere and the clam chowder great as well. I will definitely be back. they even offered us free dessert which we declined because we were too full. we talked to the chef and owner as well, very personable."}
{"text":"Atmosphere check, service check, food check. Love the farm to table concept too. The  Brussel sprouts were great, crispy, soft inside, sweet and salty from the bacon. Perfect! The entrees took some time to arrive, but the generous appetizer portion held us over and we enjoyed  our adult beverages, the wine pour was generous and reasonably priced. The entrees were good, but the dessert was another food feast.  Rhubarb strawberry bread pudding , yummy!! I don't usually get dessert but was so glad we did.   We're looking forward to trying a weeknight dinner of small plates at the bar."}
{"text":"Thank goodness Concord has opened an establishment that believes in fresh, local ingredients! This place is really good with lots of appetizers, salads, small plates and dinners to choose from on the menu. The server was extremely attentive (Brennan) and the timing of our drinks, appetizers and main course was spot on. The cocktails also use fresh produce and herbs and were delightful. We are mostly organic and love to see local farms being supported. The price point aligned with the quality of the food. If someone is interested in quality over hormone infused meat, then no further explanation is needed. If a customer is looking for cheap, low quality grub, this will not be their place."}
{"text":"We have been looking forward to trying Local 25 since it opened, and I have to say we were not disappointed. The drinks were really tasty, the peach bourbon smash was the best but the Tennessee Honey Bear and Salty Chihuahua were good as well. 

The food came out quickly, and was presented really nicely. The Barking Pig was cooked perfectly and I liked the way the grit cake, spinach, and pork shank complimented each other. The Citrus Chicken was really tasty, although the collard greens won the show for me. The homemade meatloaf, was amazing as well. It had so much flavor, and apparently is pretty popular and sells out quick. 

Overall, I am really happy a restaurant like this made it's way to downtown Concord. The food doesn't disappoint, the atmosphere is nice, and the employees are friendly. I for one can't wait to make my way back to Local 25!"}
{"text":"What a great place.  We ordered the peach mash and the honey bear drinks... they were both wonderful. And OMG the Brussel sprouts to die for.  Our entrees were the Pork chop and the ribeye both cooked to perfection. Dessert was perfect.  Absolutely no complaints can't wait to dine there again and try other items ."}
{"text":"My wife and I just ate here... we are still sitting at the table.
The food is wonderful!
We had the fried Brussels sprouts as an appetizer. Brussels sprouts fried with pork belly strips, goat cheese, and red beet strips. Omg... so good!
I had the veggie tacos. I wouldn't normally have veggie tacos, but it's lent and Wednesday and I can't eat meat. I'm a veggie taco convert! I'll be back for these soon!
My wife had a burger. A half pound of deliciousness.
I also had a side of Brussels and beets. Ok, I love Brussel sprouts. Don't judge me!
If you live in Concord, you must try this place, you will be glad you did. If you don't live here and you come to the restaurant, you may find yourself searching the real estate listings so you can come here often. After all... it is \"Local\"!"}
{"text":"I absolutely love this place. Today was my first time eating here, and the food was amazing. Crab cake sliders, excellent. Customer service was great, friendly atmosphere."}
{"text":"We love this place! The menu is always slightly changing and it never disappoints. Everything is so fresh and local. The waiters are always extremely kind and the entire atmosphere is laid back. The bourbon cocktails are amazing, the bartender makes them perfectly! It continues to be our favorite place for date night. I could go on and on about this place but you should experience it for yourself!"}
{"text":"This restaurant is just what Concord needs!!!! The food was phenomenal! We rarely splurge on ordering a 3 course meal when dining out, but I am glad we did! It's a bit pricier than your typical downtown Concord restaurant, but the food quality is superb! The chef even came out to our table to ask us our thoughts on the dessert. We will definitely be returning. 

Side note: Do yourself a favor and order Brussel sprouts as an appetizer. You won't be disappointed."}
{"text":"Please update your operating hrs. Showed up at 9:45pm and place was closing at 10pm instead of 11pm as listed on here"}
{"text":"Brussel sprouts appetizer was amazing.  Friendly attentive staff.     Great location highly recommended!!"}
{"text":"Just had lunch with a friend and we were very impressed. This is a farm to fork dining experience.
 I had the country fried steak with green beans and pork belly collard greens. The steak was lightly breaded and crisp, with just enough creamy white gravy to enhance the flavor without masking it. The green beans were fresh with a nice crunch.  But the star in my opinion was the pork belly Collards. OMG! On my next visit, I may just have 3 orders of them."}
{"text":"Went for early Mother's Day Dinner on a Friday night. It was not busy for some reason. The Brussels Sprouts appetizer is a MUST order. My Mother-in-law had the crab cakes, Father-in-law had the Pork Tenderloin, Sister-in-law had the Paella, my husband and I both ordered the Ribs special. Everything was amazing! The ribs were advertised as a \"half rack\" but there was more meat on 1 \"half rack\" than any other full rack of ribs I've had anywhere else. Having the leftovers today for lunch and still delicious! Highly recommend."}
{"text":"This is a rather recent addition to the downtown strolling district of Concord, and a welcomed one I might add. The curbside signage indicating the luncheon special of the day was blackened ribeye sandwich was ample enough to lure my taste buds inside for a further exploration. I must admit, upon my waitress bringing my hunk of the sandwich to me, I was not disappointed. 
A healthy portion of ribeye steak, generously adorned with blacken seasonings, grilled to perfection for me, and overly garnished with grilled onions and peppers, was enough to generate flashbacks to warmer days at beachfront locations in the tropical isle of Jamaica. Now, if I could have only had a red stripe beer to wash it down, my illusion would have been nearly complete.
This restaurant is ideally located near the Concord main library and across from the under-renovation concord hotel. You'll find this staff warm and friendly, and anxious to fill you with there goodies. Unfortunately, my stomach was on overload after the sandwich, so I'll have to return to try their desserts, as they looked delicious. Welcome to Concord, this is a great new stop."}
{"text":"Excellent food and great wine selection at a reasonable price! Best meal per dollar that I've had in quite awhile."}
{"text":"Second time I have eaten there.  First time was for lunch and the food was fresh and delicious.  Last night five us had dinner and we have no complaints at all.  The brussel sprout appetizer was crunch on the outside, bacon creamy on the inside.  I had the pork chop and potatoes and it was fabulous.  My husband had the salmon special and loved it.  Two friends had the vegetable plate and were very happy.  Another had the fried chicken plate.  The mixed drinks were not watered down.  For two beers, one gin and tonic, the pork chop and the salmon the bill was $62.00.  Service was great...piano playing a little loud, but apparently he was asked to tone it down a bit and he did.

We will go back again and again if the food remains this good."}
{"text":"This is a great place to come for lunch where else can you get a gourmet lunch for $10 dollars love the new menu"}
{"text":"Our experience was very good and just what we wanted! We celebrated our anniversary here one evening and loved the food!

I had the crab cakes and shrimp and grits. My husband had the veggie tacos. We each ordered two Pot de Creme chocolate desserts but they were so rich we should have just split one!

Portions was great, food was served very hot which I love, and we got our food fast.

Great service from the bartender (?) I think he was pulling double duty. 

I would definitely eat here again and hope to soon!

Tip: Call for a reservation on the weekends as they can fill up quickly. Not required but a good idea."}
{"text":"I am always excited to find a new restaurant in downtown Concord within walking distance from my workplace. Local 25 did not disappoint! I have been there twice and both times had a very enjoyable meal.

The desserts are not to be missed! We had the key lime pie and cobbler a la mode. All desserts are made in-house, and were generous portions. This is definitely a place you could go for drinks and dessert. The ambience is welcoming and the service met expectations.

Both times I chose a roasted beet salad. The first time I ordered the salad it was a layer of creamy goat cheese topped with succulent, flavorful yellow beets, with mixed greens and goat cheese crumbles drizzled with a lemon vinaigrette. Delicious. The second-time the salad was not as delicious, but still good, so I took a star for inconsistency.

Local 25 has all the makings of a downtown classic, and I think it will have the longevity too. All new restaurants have kinks, but with food this good I just know Local 25 will be a success!"}
{"text":"Was looking forward to trying this place, very disappointed. First air conditioner was dripping, had to move tables. Fried chicken was burnt, no seasoning on green beans, way too much vinegar on undercooked black-eyed peas. Wish them luck, maybe a new chef would help."}
{"text":"What a disappointment. We walked in at 12:30 and out at 1:10 without eating. Our food never came. I understand that they're new. I understand that they were short one waitress today. I understand that four owners were at the bar taking up my waiters time. But how does all of that affect the ability of the kitchen staff to put food on a plate and send it to a customer?  I really hate that I drove 20 minutes each way to try this restaurant because their menu sounded good. I hope that the next restaurant in this spot provides better service."}
{"text":"Food was delicious! I had the chicken and jalapeño bacon tacos. Amazing! My kids had a burger and loved it! The restaurant is beautiful and we really enjoyed sitting outside. Service was awesome and we will definitely be back soon!"}
{"text":"Five stars all the way. The food was absolutely delicious, service was great, the waitress and managers were friendly. They change the menu based on the season as well. We will definitely go back."}
{"text":"We thoroughly enjoyed our entrees and dining experience. We ordered the beef stew, beet salad with shrimp, roasted chicken over mashed potatoes and green beans and pot dè crème. The beef stew was a small portion but delicious.The chicken dish, on the other hand, was a hearty size, and the shrimp and dressing on my beet salad were yummy. We will definitely return."}
{"text":"Great menu!  Specials are even better.   I am looking forward to going back to see what else they are serving.   Service is good and the bar menu even better!  I am looking forward to going back again."}
{"text":"Enjoyed a fabulous Easter Sunday Brunch today.  This is a wonderful new place in historic downtown Concord not the be missed!  Make sure to try the Brussels sprouts!  I've been here a few times and it is always great."}
{"text":"I was excited to finally have some restaurant options without driving to Salisbury or Charlotte. Very very pricey- with that I expect great service and excellent fare. I am unsure if ala carte will work in Concord. The wait from appetizer to entree was very long. Fresh bread would have made a difference. Service and food was fair. Like the farm to table concept."}
{"text":"Great to see this type of dining in Concord.  Really has a Charlotte feel with some great modern twist.  Everything I have experienced has been terrific.  To the roasted Brussels, the pork shank, and the blue ribeye.  Great drink selection as well.  Staff is courteous and friendly."}
{"text":"Didnt even know about this place until recently . my1st time....got small plates. brussel sprouts, crab cakes,  and wedge salad . Everything was delicious!We got to set outside which was nice."}
{"text":"I was anticipating the opening of this restaurant. Happy to have it in Concord but it fell short of my hopes. 

Food: Hit and miss. I got the fried chicken and I won't order it again. it was a dry breast served burnt with gravy on top. the mac and cheese was really good, collard greens were on the right track but had a dry, leathery mouthfeel. A friend got the shrimp and grits that were great and their burger seemed good. Their fries are akin to popeyes fries (beer battered and seasoned) which are not my thing but my friends liked them.  

Atmosphere: Kind of dark with dark woods and eclectic style- if I had to describe it, its like an industrial modern English smoking room that Two Gals from down the street opened as a dinner place. 

Will go back there again. Glad its in Concord."}
{"text":"Enjoyed lunch here on a little downtown Concord exploration day.  The staff were so nice especially once learning my friend and I were visiting from out of town.  We had the fried Brussels sprouts which were amazing!!!  We also had the crab cake sliders with fries which was delicious.  The only dish we didn't love was the chicken bacon tacos which were really heavy and messy and greasy.  But that might just be personal preference.  All in all, this place is definitely one I recommend!  They have been in business for one year exactly they told us.  I hope they continue to make it in downtown Concord for years to come!"}
{"text":"Great spot. We live close to downtown and been coming at least once a week now that they changed their menu. Great staff and food...you will not leave disappointed!"}
{"text":"This is probably my favorite restaurant in downtown concord! If you're looking for a date night out or more upscale feel, this is your place! A little pricier but worth every penny! Large portion sizes and food is seasonal, so everything is always fresh! Lunch has some cheaper options if you're wanting to try it out! Great spot!"}
{"text":"HELLO CONCORD! Had family visiting and was looking for a place to go to dinner near my house, we almost went to another restaurant I hadn't tried in downtown, but luckily I'm a yelper and discovered that this place is open! 

Arrived around 5:30pm and there were no other patrons, but the place did fill up nicely shortly after we ordered.  Our waiter was extremely friendly and was able to bring samples of a couple wines when we couldn't decide (P.S. they have an awesome wine tapping system at the bar that you can see from every table).  We decided to order a couple things and share - starting with the beet salad which was AMAZING (no joke), yummy tossed salad with beets and pickled onion and goat cheese.  Not sure what the dressing was, but it didn't matter because it was delicious! 

Next we split the Shrimp & Grits and the Pistachio Trout.  I'm not a fan of grits normally, but no lie, I will go back anytime to eat theirs! The sauce was perfectly spicy and the grits were a great texture.  As for the Pistachio Trout, we swapped the horseradish potatoes for the garlic mashed potatoes and were not disappointed one bit!  The fish had so much flavor and I was very impressed with the entire dish.  Plating is beautiful too! I will definitely be back again very soon (probably next week)!"}
{"text":"We had a great experience. We had the pimento burger, meatloaf, southern fried chicken, truffle fries, and fried brussel sprouts.  Great flavor and presentation on all of them.  Server recommended the jalapeño ranch dip for the fries..... awesome.  We would have tried the dessert but we were all stuffed.  

Really feel bad for the one star reviewers, seems like opening week was a little rough on staff and kitchen.  I highly recommend this place and am very happy downtown Concord has a place like this.  We will definitely be back."}
{"text":"We're used to traveling to Davidson or Charlotte to find great small restaurants.  Come. Try everything. We did and we couldn't have left happier. Or more full."}
{"text":"A wonderful gem in the middle of town only begins to describe Local 25. Yes all the other reviews are right, the food here is outstanding. I would describe the food we had as comfort food--the kind of meal that becomes a new memory because of how the food was prepared. The gunnies stew and chicken pot pie were delicious, both had  complex flavors and were some of the best I've had.    When in the area we will return."}
{"text":"Wow!!! Didn't know what to expect other that what other reviewers said. The food was outstanding, everything. Chef Daniel does a remarkable job. We had the clam chowder, that my Long Island wife approved and said was great and I must concur. The BLTA, who doesn't like pork with a fried green tomato. Then when we couldn't consume any more, there was Chef with his \"mistake\". It was sweet gooey goodness of delectableness and this cornbread muffin thingy that screamed for some good ole New Orleans red beans and rice. Do yourself a favor and try this place. I don't think you'll regret it."}
