{"text":"A sports bar in a strip mall deep in the 'burbs.  It's better inside than you would expect, with a nice old bar and lots of beers to drink that aren't Miller, Miller Lite or Bud.  I have been here a couple of times for food and a beer.  If you go earlier in the day (lunch time to about 8 pm) the crowd tends to be older, which is fine by me, I'm older. The staff are nice and the food is decent.  I was a little disappointed that the Lake Erie Perch came breaded rather than beer battered as I would expect from a joint full of beer.  Fries and cole slaw were good and the home made donuts for dessert were REALLY good.  Not a foodie place but if you are in the neighborhood and need to eat, it's a good place."}
{"text":"The chicken sandwich wasn't very good.  It was soggy and we had to wait a long time for our food.  The waitress was to busy talking on her phone to go back to the kitchen and check on our food."}
{"text":"TERRIBLE SERVICE! It is a shame. I really enjoy the food and atmosphere but the service there is terrible EVERY time. This place has lost the service of me and my co workers."}
{"text":"Great place! Music is a little loud if you're trying to have conversation, but the food is superb! We had the Reuben loco dip (not sure on the name) for an appetizer and it was hot and delicious! Many of us had corned beef in our entrees and it was really good. Fish fry was crispy and fresh! Mac & cheese was a little bland. Bacado salad was tasty too. Would definitely come back for the food! Kelsey was super friendly and a great server!"}
{"text":"The portabella wrap was amazingly delicious! Yes I say portabella not portobello. I had mine with out the  cheese. I just sampled the side of fries and wished I hadn't. Crunchy and delicious is what they were! So I handed them off to my partner in crime before I ate them all. With tribe game playing it was pretty decent and better then average bar food."}
{"text":"Tucked away in a strip mall the bar was packed for an Ohio state game. The Corned Beef with homemade potato chips was excellent and top quality. The french fries and fish tacos were above average frozen restaurant fair. The service was good for the patron/staff ratio. The drinks were reasonably priced."}
{"text":"Yay! I'm a fan.. I'm loca for loco. It is a Saturday afternoon/evening and the pickings are slim. However, with a group I had a great time. Shots, shots, shots, shots, everybody. Bud light lime, don't mind if I do.   Nommmm time; tacos and hangover burger. \"I would order it everyday if I could.\" My BFF's words verbatim, referring to the burger. I really enjoyed their soft tacos with sriracha sauce, the spicier the better. Try the corn and bean salsa with hot sauce and chips, yummo. Great bar food, right on service and good times."}
{"text":"Barmaid did not know how to make a frozen margarita and work the machine. This is a Mexican. Themed bar and they used to have top notch margaritas. The nachos were cold and yucky topped with unmelted shredded cheese. Pretty disappointed in this trip."}
{"text":"To say I hang with people who have a sense of irony is an understatement. Hence, our evening out to Loco Leprechaun, the \"Irish Cantina\" in Westlake (in a strip mall, obviously). My friend Bobo and I were tossing ideas of where to meet up back and forth when it popped into my head. I could barely contain my excitement before saying the words \"it's both Mexican AND Irish.\" Stupid and amazing all at the same time. But, we were both hungry and actually wanted food we'd like. Was it a good night to let our love of all things warped guide our decisions? After some quick research I found the cantina's menu and saw it had potential. It was like this weird Mexican/Irish fusion that took all the foods you love to nibble on when you're drunk and mixed them up. One stand out: Reuben Nachos.   The actual restaurant felt warehousey and sterile, not like a pub or cantina. It felt more like a storefront in a strip mall with murals of Leprechauns wearing sombreros painted by a Kent Stater busing tables over the summer. We also found little cards on all the tables telling us to \"ice your friends.\" The slogan, accompanied by photos of hambones drinking Smirnoff Ice, had recently entered our world, but we weren't sure exactly what it meant. Luckily, fellow yelper Matt M. arrived to explain it. Basically, hambones make other hambones drink Smirnoff Ice to humiliate each other when in public. Loco Leprechaun is that sort of place. Yeah.   The food is tasty and seemed fresh. While the atmosphere is void of soul, the food isn't. I dug the tacos with cabbage and the Reuben nachos."}
{"text":"Used to be great food and fun. Absolutely awful experience. Slow service, wrong food, forgotten orders. Apparently the owner was out of town. They actually ran out of pasta. After a $100+ check that was worth much less no accommodation was made. Very dissatisfied. Do go here."}
{"text":"Had a really good dinner despite the waitress forgetting one of the entress. highly recommend they add a beer menu. they have a great beer selection but the bar and wait staff are not knowledgeable enough about the types of beers to be helpful."}
{"text":"Good beer selection. Food solid way more than \" bar food\". Daily Specials & more highly recommend."}
{"text":"I reviewed this place positively 1.5 years ago, but it has changed.  I was a regular, now I am done.  It's principal.  Two of us ordered burgers, it took 45 minutes to receive, and the place was 1/2 empty.  One burger cam with a sauce that I specifically ordered without it.   When the check came, they charged $10 for the burger, my menu said the price was $8.95.   The waitress was magnificent, truly wonderful, but brand new.  I questioned her, she went to the manager in charge and told us \"The price went up.\"   They then told me they corrected the price with a marker in some menus, but maybe missed a few.  They would not budge.  A regular customer who comes maybe 10-15 times a year, pissed for $1 and principal.   I paid the bill and thanked the waitress, but told her we'd never return, it's based on principal.  As we were leaving the manager was going outside probably for a cigarette.  I brought this up, She told me that was right about the menus.   She also told me the cook was taken to the hospital and they had put the bar back in to cook so that is why it took so long to make burgers and he got the one wrong.     She finally offered to refund the cost of that burger.   I never wanted a refund of $10, I just wanted them to be accountable and honest up front and just take $1 off and charge what the menu said the price really was.   Go elsewhere, play it safe.  Unless you want a bus boy cooking your food who has probably not been trained in proper food safety techniques, and then get overcharged by someone who can care less.   I was a regular, now for $1 I am done."}
{"text":"\"You know what we need?\" someone said.  \"A corned beef quesadilla.\"    In other countries, they would have been laughed off the border and into the ocean.  But this is AMERICA, baby!  We dream big.  Who wants chicken paprikash nachos?  We do!  And so the Loco Leprechaun was born - a Frankenstein-like conglomeration of two disparate menus mashed together.    Every time I walk in here I want to raise my arms and shout, \"IT'S ALIVE!\"    Interestingly enough, the corned beef quesadilla is the only thing I would actively tell you to avoid on the menu.  (The corned beef is really lame, little flabby strips that are more like bologna - try Corky and Lenny's for a much better local sample.)    But everything here is made fresh, by an actual chef (not a fry cook), and the attention to detail shows.    The chicken paprikash nachos feature piping-hot nachos and real white-meat chicken chunks underneath a delectable slathering of spicy, tasty sauce.  The doughnuts at the end are freshly-made, drizzled with Baileys cream sauce an brown sugar, still warm, and they melt in your mouth.    The atmosphere?  Well, if you're not into sports it's more of a takeout joint.  There's a huge row of bingo/keno/something chairs in the center, and the screens are huge and constantly tuned to beefy men in uniforms knocking balls around.  That may actually be a draw for you, and if it is, I can vouch that the customers are very friendly, as are the waitresses.    In short, it's a sports bar with solid food and a strangely experimental menu, and I'm always happy to go back."}
{"text":"I had to wait in the neighborhood. I never get to north Olmsted too often, popped in. love the open air frontage. I was here at lunch. the staff and chef Joe were very friendly.  I had a pizza, a little cold but tasty. my son had the rubin wrap.. said it was awesome. had the rubin dip as well, hot and tasty with rye bread toasts...  they have 5.00 lunch choices.. the menue does need redone. I'm not sure what its like after dark, but a great lunch choice. I'm sure it gets missed being on Walter and Center ridge in the small plaza...open and light. i'll come back."}
{"text":"Loco, what happened?  You've gone down the toilet and I used to like you so. (cue the sad music and a tear on my cheek)  The handsome man and I went last Sunday post-church for a marg. and some mex.  The place was a ghost-town! (of course we were there at 11:30am on a Sunday!)  In place of the old tables / high tops were 4 rows of CPUs!  WTF?  Why do you have 20 CPUs in your bar?  Gaming!  Yes, but they don't work and no, Loco doesn't have a gambling license.   The bartender informed us that the owner thought this was a good idea, but they just sit there because they don't work.  BRILLIANT!  Did I mention that they're at the front of house so they occupy the lovely windows that open up in the summer.  Poor  choice Loco.  The menus were dirty and now sported black sharpie Xs over the items, I assume, they don't carry any longer.  (Can we say TACKY?  Add that to the CPU zoo and we're on a roll).  The chips & salsa were eh...the guac. was definitely \"Holy Guacamole\" which, while I do purchase that brand, was not something I'd expect to get in a \"restaurant\".  I ordered tacos and the man got a burrito.  Bleh.  Nothing fancy, and it was food.  Loco, I'm no longer Loco for you.  I think I'll skip you from now on."}
{"text":"Only went there once, but food was good, and fries were wonderful.  Not too sure what batter was used in addition to the potato, but it was an excellent combo.  I would recommend this place to anyone needing a lunchtime meal!"}
{"text":"Really great perch and perogi. We have tried a lot of fish fries and Loco Leprechaun rates up there. It was a pleasant surprise. The perogis are fresh, from Slavic Village.  The perch was seasoned well. The price was very reasonable. We will be back again. I hope they keep this special past lent."}
{"text":"Thanks to Phil and Mike for making things right!!! That's a great way to run a business!! Thanks and I appreciate it..."}
{"text":"Had a great fish Fry on Friday . Fish was very good and served hot. Good service even though they were busy.  Def would change the fries though. Fries would be much better fresh cut."}
{"text":"I've been to the Loco Leprachaun at least 10 different times since I live nearby. The happy hour appetizers are priced very fairly if you are looking for some cheap bar food. If you are up for something a bit different, try the corned beef quesadillas- they are pretty good. The boneless wings come in a good sized portion but they never have enough sauce on them and the \"spicy\" sauces are not spicy at all.   Typically, service is fairly slow. I've never sat at the bar but I think this may be a better way to go because I think that many of the waiters/waitresses fail to see their customers sitting at the opposite side of the room.   Overall, a decent place to go if you live nearby and want some good happy hour specials."}
{"text":"Not sure what the heck happened to this place. It used to be really good about 3-4 years ago. Change in ownership? Management?  I dont know. Our server was really good but the food? When you hear someone behind you complain that their corned beef smells funny when you just ordered....that is not good. My food was fine. My friends though ordered mozerella \"moons\" which were actually sticks. They came out and they were freezing cold. Like the cheese was not melted. The potato skins looked like they were about 5 days old.  And how about just redoing the menu instead of crossing things off with a black marker???  Such a shame. Completely went downhill........"}
{"text":"Game 7, World Series. 68 years. I decided to join some friends at this place for the game. Every commercial break they played the same ridiculous songs and when the game came back on TV they continued to play the songs long after the chants of complaints continuously were heard. We asked to speak to the bald owner on testosterone replacement therapy, he acted as if he would take care of it but didn't. Imagine this.. game 7 World Series in Cleveland and a Cleveland bar doesn't care that you came to watch the game there and spend your money there. This place is a joke and I should've known better with a name like the Loco Leprechaun. The owner had a remote in his pocket and played games all night with his patrons. He told my wife he was a Cubs fan and fuck everyone else. Patrons left so they could watch and listen to the game elsewhere. I can make better nachos and cheese whiz at home anyways. I wouldn't go back here if my friends volleyball team were sponsored by them and they were giving out free beer."}
{"text":"Come here occasionally the bartenders really need to cut some of these women off when there disgusting drunk! People need to be safe on the road!"}
{"text":"Good place to hangout, I like this location a lot compared to Lakewood. It's a fun dive bar but a good place to meet friends and have a pitcher or two.  Atmosphere is cool, good music...I'm not too sure on their drink specials, but I know they sometimes hand out coupons for drinks, so it can't hurt to ask for some!  Loco is definitely a place where you will find this little leprechaun ;)"}
{"text":"\"Look at this coupon,\" our friend Bec said, gazing at the local area calendar on our wall.  \"'Loco Leprechaun. an Irish Cantina?' That can't be right!\"  Immediately, we determined that such a place required investigation - with a name like that, the entertainment factor alone was worth the price of dinner.  Loco Leprechaun is located in an unassuming strip mall along Center Ridge Road, just west of Walter Street and easy to miss if you're not paying attention.  But it is a hidden treasure of novelty and fun.  It's set up with more focus on bar than restaurant, so there are only seven booths at standard height, plus a lot of high, round tables with stools.  We were there on a week night and had no trouble getting seated in a booth.  The menu arrived quickly, but had to be perused slowly.  The restaurant doesn't take its Irish/Mexican theme too seriously in the menu, but it also doesn't hesitate to mix in a broad and eclectic mix of foods from assorted cultures in ways that your average Joe would never contemplate.  Take, for example, the chicken paprikash nachos.  By myself, I would never have dreamed of ordering something that sounded like such a culinary train wreck.  But Ferrett, intrepid adventurer into whatever he's never had before, did.  And astoundingly enough, they were absolutely delicious.    While pasta isn't food I associate with either Ireland or Mexico, the menu features a number of pasta dishes that were quite good.  It also takes its \"let's play with cuisines\" attitude to rice bowls, and features a Reuben rice bowl and a chicken paprikash one - the next time I go I will have the paprikash rice bowl because their paprikash is some of the best I've had in town.  For dessert, we had the home made doughnuts with Bailey's Irish Cream glaze.  The doughnuts were much like New Orleans beignet, fluffy and hot, but rolled in cinnamon sugar instead of powdered, and the glaze was delicious.  The order comes with a generous 7 or 8 donuts - to our initial horror, since we had ordered to batches for our table of four.  But somehow when it came time to pack up the leftovers, only about 5 were left between the two orders.    The beer selection is okay, but the drinks menu is nothing particularly special, being an assortment of 'tini specialties.   The atmosphere is of the sports bar variety, with several large plasma TVs throughout the bar, and it is a bit noisy.    Our service was fantastic.  When we expressed curiosity about a drink called Leprechaun juice, our waitress actually brought us free samples - about a half a glass per couple - for us to try.    Loco Leprechaun offers a mix of traditional comfort foods with unexpected twists in a casual atmosphere.  Definitely fun for an evening when you aren't taking yourself very seriously."}
{"text":"I was here for game 6 and game 7 of the World Series. Corned beef reuben was  excellent! Numerous large tvs with surround sound. I also loved the energy level of the crowd and that they were playing Wild Thing and Cleveland Rocks during the commercials. I will definitely be back to watch Cavs games."}
{"text":"Loco Leprechaun? An Irish-Mexican Cantina? How exactly does one fuse together two cuisines so different? Just the idea of a place so odd was intriguing. If anything, it'd be a decent place to meet friends for cheap drinks.   Loco Leprechaun, tucked away in an unassuming strip-mall in Westlake looked no different from any other sports bar I've ever been to. A wide open space surrounded by plasma TV's, high-top tables and booths along the walls. The menu was kind of disappointing too. There were a few Irish and a few Mexican dishes, but no interesting fusion between the two cuisines as the restaurant title and slogan might suggest. For the most part, the menu was basically your typical everyday Americanized bar food. Nothing new or inspiring here. (And no, Chicken Paprikash Nachos doesn't count. Paprikash is neither Irish or Mexican. It's Hungarian for chrissakes and it being on the menu makes little sense.)   At each table, they proudly advertise the sale of Smirnoff Ice and encourage the potential douche clientèle to partake in the retarded \"Bros Icing Bros\" game. For further explanation, see here: http://deadspin.com/5557348/the-awful-epitome-of-brahsomeness-bros-icing-bros    Now, I know the title: Loco Leprechaun doesn't exactly spew class, but in no way was I prepared for the onslaught of humiliation and insult that our party would soon endure....  Getting blasted with farts. Smelly, gut wrenching, make you want to dry heave, lose your appetite type of gassy ass-explosions! You see, our party of 4 sat at a booth. Downstream of the high-tops. This one particular high-top with a middle aged fellow was sitting within shooting distance. His trigger happy ass was at the same height as our faces. I had the unfortunate pleasure of being on the end of the booth and the first to smell the onslaught. But a strong nose wasn't the only sense needed to tip off the perpetrator. This guy's farts were so rip-roaringly loud, it was almost as if he didn't care. Either that or we were being Punk'd. Unfortunately Ashton Kutcher never popped out from behind the curtains.    Now, I will admit, the fart was funny. The first one or two times. The third, fourth and fifth time though, I was getting a little pissed and worried. Does this guy have no regard for human life? Is there something terribly wrong with his bowels? Should he seek medical attention? Clearly YES, to all of the above!   Now, I know patrons alone shouldn't be the main cause for a bad review, and the food was passable (perhaps too much so as our loose boweled friend evidenced), but this place just seems to attract filthy swine. And for that reason, I'll most likely have to stay far away next time I find myself in Westlake."}
{"text":"I would rather have a hot fudge enima than ever have to step foot in here again.  Irish and Mexican go together as well as Crisco and sunbathing....sounds like a good idea but ends badly.  Went on a Saturday and one girl was tending bar and the whole restaurant.  She was nice but we had to wait for everything.  Food was just bad bar food.  Nothing worth even recomending.  Sat in the corner by a random empty glass case.  Bar itself is a nice copy of Great Lakes bar but the rest of the place looks jumbled and cheap.  Ill eat my shepards pie tacos elsewhere."}
{"text":"This place is awesome! Great beer and food specials all the time. The staff there is nice and always helpful to make sure you're taken care of. The tables are fluffy people friendly which is nice. Tables and floors are clean and tables are not sticky. The drinks are good and never watered down. Can't stand going into a bar and ordering and getting watered down drinks. This place is not like that at all. Ordered tacos here. They have fish tacos. They're my dads favorite. Their basic taco is great. They're not stingy on the toppings or meat on them either. Wings are great. I got an order and they were over cooked and they brought new ones out no questions or headaches! This place aims to please. Burgers are fantastic as well. Juicy and big! They cook them to your liking. There is plenty of parking. There is extra parking across the street of need be. The front windows open up and turn into a patio setting kinda so Air gets in there and it's not so hot and stuffy on busy nights. My only issue with this place is that it's packed on weekends and packed with college kids! But not like they're going to kick people out because they're annoying. I have seen them throw people out because they were drunk or caused problems. They don't tolerate drama there. This place should really relocate and be bigger because too small to handle all the people!! But, that just means they're the best"}
{"text":"I'm definitely a fan of this bar and grill. It's a fun atmosphere with a good selection of beers and domestics are always cheap (especially by the pitcher). We tend to go Sundays after Softball and always have a great time. The glass front of the building opens to allow an outdoor feel and we'll occasionally get a puppy to pet and play with.   The food is very affordable, the menu is creative, and the portions are generous. The bar staff are attentive and friendly. The seating, particularly the limited number of high-tops, is the only thing I would improve. Give the place a try, but understand it's a bar first (with a bit of a divey feel) with some imaginative menu options (try the Reuben nachos)."}
{"text":"The first time I was here was on the weekend. Nothing but newly 21-year-olds as far as the eye could see. Ok, I get it, it's the weekend. Maybe it will be better during the week.   The second time was a Monday (today). Surprisingly, there was a full bar at 7pm. They must be doing something right. This time the crowd was much older. I ordered the white pizza & chips with dip. While it was not terrible, this was not \"pizza\". It was a round, thin flatbread with a thick layer of white cheese. No oil, sauce or spices. Yeah, yeah.. This is a bar.. I shouldn't have expected a real pizza. The chips & dip also weren't terrible but they're the same basic chips you could order at any bar. Same with the dip.  Since I was sitting at a table, I had a server. I had empty glasses & plates for at least 30 minutes. Eventually I had to ask the bartender for a beer. Instead of him just pouring me one, he said \"I'll send your server over.\" Ok, make me wait some more, that makes sense.   Overall, not impressed & will not be returning.. Unless I - for some reason - randomly become friends with a bunch of 21-year-olds in Westlake."}
{"text":"I went to loco other night food was terrible and service by the red head bartender was the worst....the kitchen manager was the only reason i got any kind of seevice she actually noticed i was a customer...wont be going back"}
{"text":"Intetesting menu. Some mexican, some Irish food. The mozzarella sticks were good.  I got the loco wrap and it was good. The black bean salsa that i chose as my side was not that good. Tasted stale somehow like it had been around awhile. My husband had the hotdog and se said it was good. Our waitress was nice snd the service was good. I will come back and try other things on the menu"}
{"text":"Had a fantastic time here. Came in for a late night meal with my husband and daughter and chose the Loco Leprechaun because not much else was open. We were worried because of the mashup/fusion of Mexican and Irish didn't originally seem appealing. We were definitely wrong. It is a quaint little bar/restaurant in a small strip mall beside a local pizza joint. There weren't many customers there and we didn't expect a lot since it was late at night and the middle of the week. We sat down and immediately the bartender came over with menus and the specials of the day, handwritten on a small sheet. We thought, uh oh, but were pleasantly surprised and ate our words. He came straight away with the drinks we ordered and took our dinner order. We got the mussels (deliciously buttery), wings in spicy garlic sauce (garlicky, wet, huge and filling), a couple orders of fries (hot, yummy and crispy) and a shrimp poboy (so yummy and filling, my daughter could only eat half). We received our drinks quick, got refills super fast on soda, were brought extra napkins and our silverware and extra mini plates and the condiments basket before the food came out. The food came out piping hot and so good. We got our fill with plenty to snack on later. I will definitely be coming back every time we're on this side of town. We even had a little confusion with what the mussels are cooked with and the cook came out from the kitchen to give us reassurance and a breakdown of what it's cooked in. I love this place and will bring all my friends out!!"}
{"text":"When we were there, some time ago, the food was really good but it was loud in there!  Couldn't talk to our table mates so we haven't been back."}
{"text":"Local leprechaun had the best dinner I've ever had at a bar it was absolutely amazing the environment was amazing I had a wonderful time the staff was amazing took wonderful care of us and I will be back again"}
{"text":"So, I go to this place with my cousin and friend. My cousin had a purple shirt on too, that will come into play later on... The food was disgusting and drinks were weak and pricy. If I'm wrong, it wont be the first or last time but, it may be a gay bar? My friend suggested and \"she\"is a female. I payed it no mind until I put everything together. As soon as we sat two guys approach the bar and start talon aloud with/to my cousin about how he wishes he was in shape like an NFL player on tv, guys outweigh females and looked questionable? Like I said it doesnt bother me either way, im just curious. Id like to know so I can make fun of my cousin for taking us there, btw, now you know why I commented on his purple shirt... Mexican and Irish!!????"}
{"text":"Very fun place, it's a mix between Mexican bar food & Irish bar food. The food was great, menu was reasonably priced and the craft Beer selection was decent, at least they offered some top rated craft beers  the Burger was tasty that I ordered and my Fiancées corned beef sandwich was delicious, definitely a fun place to check out."}
