{"text":"My husband and I live two and a half hours away from this place.  We saw it and decided to stop.  I had a cheese omelet and some biscuits and gravy. They were very good.  What was amazing was the pancakes.  The menu warns they are big, but when my husband got his, they were overflowing on the plate.  They were massive for just two pancakes.  Overall, the staff was great and the food was good.  Definitely want to come back - especially to try the lunch/dinner."}
{"text":"My husband and I have eaten here quite a few times. Their breakfast menu is awesome. The chicken fried steak is the best I've had and my husband swears by their pancakes. The fried cornmeal is also very good.  Dinner has more variety and their specials are wonderful.   Very homecooked feel, great flavor, great staff."}
{"text":"i love the fried chicken! The service was ok, our server was a thin blonde who didnt know much about the menu. But all was well at the end. I had some great food and good laughs."}
{"text":"No wow factor here.  Below average coffee. Country sausage was good and like the hash browns. Did a great job on the basted eggs.  It is a safe place to eat."}
{"text":"Pretty good food. Homemade biscuits and gravy. Bacon, however, was thin and floppy. Nice, helpful server and cozy atmosphere. Bathrooms were very small but clean! An extra star in my book!"}
{"text":"they have actually moved to downtown Argos.  I have been there twice. both times I enjoyed my breakfast.  I had a waffle and was amazed how hot it  was when it arrived.  and then I had an omelet. it was really good too.  I like their coffee. staff is friendly.  my regular place now!"}
{"text":"My husband had the meatloaf sandwich w/ mashed potatoes, he said the meal was very good, I had the beef brisket, it was also very good. The staff is very friendly and service was also very good. I nice little find off the HWY."}
{"text":"I go for breakfast every chance I get. Log House sampler is great. The blueberry pancakes are also one of my favorites. My son enjoys the donuts and giant cinnamon roll. The staff knows all of their regular and what they order, almost before they sit down. It is a great place with a wonderful atmosphere. New location is 168 S. Michigan St. in Argos. They have moved downtown. They are now only open for breakfast and lunch."}
{"text":"I was really hungry for meatloaf or some good country cooking.  Been though here for breakfast but can in for dinner.  I saw the special \"Chicken Fried Steak\" .  Hmmn sounds good to me.  I ordered and the waitress if it is good and she  said \"I don't eat that.\"   I get my chicken fried steak and it is a fried  boneless chicken breast with gravy.  Now as far as I know, at least in this country, Chicken Fried Steak is steak, not chicken.  I ask the waitress, is chicken? She said, \"I just serve it,  I don't know what it is or how it's made.\"  I said will you please ask the cook.  She returned to the table and said \"they said it's chicken and that's how they always make it.   I will say this. It was damn good \"Chicken Fried Chicken\", no steak. So why called it steak and serve chicken???"}
{"text":"Heartland style food in a rural setting. Their breakfast is beautiful, though it's fairly typical to hear at least one person parrot-grunting Rush Limbaugh political commentary loudly. That's not the restaurant's fault, though."}
{"text":"When walking in it smelled very musty, came for breakfast and it was greasy, it did not meet my expectations.  Bacon was greasy, potatoes were dry over cooked."}
{"text":"The log house is a great restaurant good food good value your plate is always full.  If you're in Argos this restaurant is a must stop! Pat and Robin the owners are awesome!"}
