{"text":"I recently moved to the area and my landlords recommended this spot as one of their favourite places for both Lolita's ambiance and food.  My partner was in town and we wanted a nice meal together... We weren't dissatisfied.  The  hip / intimate / rustic decor made for a romantic ambiance (that's a lot of adjectives!).  We shared a small entree of warm spinach salad w Parmesan cheese, the seafood platter for two, a French martini, and finally an Irish coffee and creme brûlée for 75 with tax and tip.  All items were quite tasty.  Will visit again but there are plenty of other places to try first!"}
{"text":"I visited Lolita's a couple of years ago; sadly the service did not parallel the lovely food. I live in the area and was excited to try this inviting looking resto lounge. How perfect then when a \"groupon\"-type of deal came up! 

Took a good friend to sample the wares. Once we informed our server (the owner/manager nonetheless!!) that we had a deal voucher, her tone with us did a complete turnaround. She basically ignored us even though we were spending more than just the deal. She was pretentious and unpleasant. 

Now when I pass by although I crave the delicious menu, I simply refuse to give them my business."}
{"text":"Intimate atmoshphere - great spot for dates, dinner with a friend or group outings. Lots of great cocktails and sharing platters."}
{"text":"The customer service is excellent. This is a cozy and quiet environment, not suitable for kids. The booths are tiny and not great for 4 people, better suited for two, especially if you are on the large size. Calamari is delicious. Excellent range of options, so everyone will like something. The price for main courses is 20-35 dollars, so not cheap but not crazy expensive. We had the sharing platter which was delicious and a great choice for an apple for 4 people.  Overall, I would recommend it! Enjoy!"}
{"text":"Great atmosphere. Good for romance or nice dinners with friends. 

They have lots of options on menu and some nice wines to choose from. 

We've been here 5-6 times. The last time was to enjoy dessert and drinks on the front patio. It's always in the discussion for us when considering where we'd like to go when hitting the Danforth."}
{"text":"We live in the neighbourhood, and for years, Lolita's Lust has been a personal favourite. The vibe is very laid back, and the service is as well. Don't get me wrong, the service is perfect, just friendly as opposed to formal, which is what we like. The cocktail menu is extensive and creative. The food menu is great, and does not change much often because so many of their dishes have become signature dishes that no one wants to see replaced. Tonight we came for drinks and appetizers, and to sit on the patio and people-watch at Taste of the Danforth. We shared the roasted peppers and feta, which were REALLY great, and the Mediterranean platter, a nice assortment of pita, dips and olives. Lolita's is great whether you need to recharge your batteries after a hard day, or you are heading out for a special occasion. It's just a REALLY good restaurant."}
{"text":"My wonderful friend asked me to be her date for her late Xmas party at Lolita's Lust. I will be honest, when I heard the name of this place I thought it was some strip club, I was so wrong. Located in the heart of Danforth it's such a classy dim lighted place to relax and socialize. On Friday, parking was hard to find but my friend and I got off at Chester Station and we were a 5 minute walk away. Once we arrived, our party was upstairs in a private room which was decorated with awesome paintings and a cute, stacked bar. The bartender was so sweet and engaging and she stirred up a Cosmo martini and the flue buster cocktail, both drinks were right on! My friend ordered the Holiday cocktail and I ended up finishing her drink because it was so good. We also had shots of lemon drops and the bartender explained how they use fresh lemon juice and not the sugary powdered stuff. I believe that it's not all about what's in your plate, the beverage is equally important and to have hand crafted, organic/natural ingredients, makes a really big difference. Once everyone arrived we made our way to a beautiful table set up and picked our choice of white or red wine.  To start we had complimentary bread with olive butter, it was very addicting. For my appetizer I had the beets salad, it was fresh and light. Now for my main, it was between the beef and the lamb,. Whoever knows me well, knows that would be a no brainer.. I would go for the beef but earlier in the day I had a burger, so I convinced myself to try the lamb.  The food arrived very fast  and the presentation and big portion size was amazing. The lamb was moist and fell off the bone, smothered with some mashed and au jus. I actually had a hard time finishing it because it was a lot of meat but I can't complain. Along the way, the server and bartender came by to make sure our wine glasses were topped and our food was up to our liking. For dessert I had the flour less chocolate cake, it was okay, I felt like it was too heavy and dry. Overall a great dining experience with great people and a great restaurant :)"}
{"text":"After seeing the name I had to give it a shot :)
I've been to Lolita's a few times now and would go back. The menu has some neat selections on it. My personal favorite which I've had twice is the lemon zest crepes filled with spinach and goat cheese then covered in a butter sauce. It's delicious.

The restaurant has that family run feel to it (not sure if it is). The staff isn't normally smiling so I can only assume they're family :)

The sides are all sharing style so it's good for dates, give you a chance to awkwardly both go for the same dish then laugh it off and get a little closer in the process.

The restaurant is small and only has a couple tables for groups of more than 4 so I'd recommend it more as a date type place than a place to bring a group."}
{"text":"First off, the name is a riot (joke from my friend: Oh, is that a new bar to go and pick up 12 year olds? ... come on, it's funny.) I went here with my sister before Libretto (on the Danforth) on a Friday night- we were early for our table and so there was a bit of a wait. We decided to go to Lolita's lust to grab a drink and pass the time. Gosh, I was almost disappointed when we got the call that our table was ready at Libretto. It's a bit premature giving Lolita's lust 4 stars, but I loved the time I spent in there! 

First impressions:  Great soul tunes playing. Candlelit and intimate groovy vibe. I love how they have their wine menu organized- in a very sensory way- by tastes, flavours and smelling notes. My friend went for food on my recommendation another evening and said that everything was excellent. As for my experience, I enjoyed my (giant) Caesar, the space and the staff (we chatted with the girl running the music and bartender). This would be an ideal place to come with a close friend or partner to unwind after a long week- I can't wait to check it out again."}
{"text":"Never eaten here, but, as far as nice places to drink in, this place ranks at the top.  Great interior and excellent service, whether at the bar or a table.  Prices are typical, eight doubles was 100 bucks with a generous tip."}
{"text":"If you're looking for a place to get drunk - this might be your place - but you better have plenty of cash on you.  $13 for a Martini?  I would expect it maybe at the Four Seasons, or Pravda, but not from a joint like this on the Danforth.  Ouch!  And the cocktail wasn't even good.

The bartender was very nice, but we basically left after 1 drink because at these prices, all of us would've been home by 10PM."}
{"text":"Terrible experience and very weak menu. Not a lot of options, service was not very friendly. Been to a lot of restaurants on the Danforth that are a thousand times better than this place. Not a lot of unique dishes let alone dishes to choose from, maybe go there for a drink if you want to get ripped off but stay away from the \"dining experience\"."}
{"text":"Came here on a Thursday night. Staff was beyond helpful! They were out of the wine i wanted so they brought out 3 alternatives for me to taste AND threw in a free dessert wine. Awesome recomendations. The resturaunt is very dark and sexy... Great music too. Great experience."}
{"text":"If you didn't know that this was a restaurant from the name, you probably would think this  was some type of fundie selling XXX rated adult store on the Danforth. Well this place can lead to such expenditures, but in the meantime enjoy an intimate setting at a great local spot. 

The food was pretty good. But when a restaurant becomes too good for its own good they start to jack up the prices a bit too much! Caesar Salads at $8, and other appetizers up to $21! Main courses start at $15 - and that's for a Burger! So be prepared to pull out the Black Amex if you want to experience this restaurant to its fullest!
I had the seared Salmon with Beet jus, which was very good. I also managed to enjoy the cheesecake for desert with an espresso. 
You pay for the experience, which was a great one on one destination for myself and guest. 
I tried, but unfortunately it didn't get me into the fundies later that evening!"}
{"text":"This was a major disappointment. We went on a Friday night and the restaurant was empty. The staff were talking loudly among each other the whole time we ate, and it was impossible to feel comfortable. I really disliked the food. Our grilled calamari appetizer was burnt, and the beet salad was overpriced and bland. The main course was equally awful. The chicken had a tough, chewy texture, and my pasta was way over cooked. For a meal that cost so much and was so dissatisfying, I think the restaurant deserves less than one star."}
{"text":"Can't believe I've been living on the Danforth for 6+ years and hadn't been here until last week. Delicious, boozy cocktails, cozy and warm atmosphere, and good share plates. I will definitely be back."}
{"text":"My husband and I had a date night here about a month ago. We always pass by this restaurant and we were so glad we tried it out. It is much bigger than it looks, keeps going and going into little private nooks. The drinks were nice and the risotto was amazing. I think the owner served us; she had great recommendations and seemed really humble. Would come back to try some other items on the menu forsure!"}
{"text":"This is a cute intimate place on the Danforth.  Has great options for sharing platters - we got the Mediterranean platter, the capriccio, the calamari and the kale salad.  All were great!  The drinks were lovely as well.  They also have a private back room if you want a more intimate setting.  Prices are fairly typical.  Great place to just chill and socialize!"}
{"text":"Good food, fantastic drinks and sweet vibe. Staff is very friendly and it has this homey feel to it. The upstairs area is excellent for private gatherings and don't leave without trying the vodka lemonade."}
{"text":"Very nice place with a great atmosphere.  Cozy and romantic, excellent for Valentine's Day! The service is very good as well, and the owner came personally to check on us and gave us some free dessert for waiting a bit more.  I would definitely not bring kids to this restaurant (if you didn't get the hint from the name).

I had the chicken and my girlfriend had the fish.  They were both good, though, of course, we've had better (Canoe, I have to keep mentioning it). 

Overall, an amazing atmosphere for a date or an intimate night out or just to chill with some drinks and appys."}
{"text":"The food was good but not excellent or something I'd have to come back for again. The portion was skimpy on the meat and the meal was pricey for what you got. Lots of dishes have cheese in them. The menu is not particularly mediterranean. The manager had poor manners, but the wait staff were very nice, warm and welcoming. 
The decor and ambience in the back room is old and dated, like nothing has been done since they opened. It had a slightly dank smell when I walked in. It's quite dark and decorated with dusty wine bottles, mish-mash furniture, and bare floors.  The light fixtures are old, the windows are dirty and the service desk is far too close to where we were seated, I was constantly bumping the waiter. Not much of an ambience per se. The restaurant was mostly full in the front area but empty in the back where we were seated @ 7pm on a Thursday night in mid July."}
{"text":"Sure, it's a restaurant... but ignore the overpriced food and you'll find one of the best places to have a drink in the east end.

Exposed brick galore.  LED signs flashing non-subliminal messages.   Great design.  Interesting people everywhere.   Once the dinner crowd clears out, everyone dances!  

A place where they actually say thank you when you leave."}
{"text":"Excellent!! Finally made it in after walking by many times and  now we'll definitely add to our list of places to come back to! The Ahi Tuna was fabulous, short rib appetizers delicious, lamb shank melted off the bone and service was really nice. Great recommendations from the staff and helpful when we couldn't decide because everything sounded fabulous. Lovely evening."}
{"text":"My favorite on The Danforth.  Great place for a date and one of the best martinis in Toronto. Intimate and classy but not pretentious.  The food is always awesome and if you do have any issue, they take care of it right away.  The servers are always super friendly and on the ball.  I've also been a couple times after work and is a great place to just sit, have a drink and decompress. Definitely worth a visit. 

Fabulous grilled calamari!"}
