{"text":"This restaurant is probably one of the best Italian restaurants I have ever gone to. When I first entered the manager comes up and says if it isnt on the menu then tell me and we'll make what you want fresh right now. If you are in Montreal then you have to go here."}
{"text":"Absolutely horrible.  The staff were friendly, the wait was ridiculous.  Waited 10 minutes to be seated, ordered lasagna, the feast, escargot &, a caeser salad.  The salad and escargot took about 20 minutes.  We had to wait an hour and 25 mins for the lasagna and the feast. I understand pasta takes time to cook. But an hour and 25 mins was absolutely unacceptable!!!!!!!!!!! The food was also not very good.  The feast was way too salty &, I could only taste cheese for the lasagna.. Would not recommend."}
{"text":"Nice restaurent but a bit overpriced for the quality of food. Had a really disapointing ceaser's salad and good canellonis with meat sauce. Overall was good, but I think their prices are too high for the food they serve."}
{"text":"I love this restaurant.  Growing up in the restaurant business I am a fussy customer but this restaurant gets it right.  It is a small, contemporary Italian restaurant that serves fresh ingredients (no ready made sauces like you get at those chain stores).  They take care and pride in their work.  The food is always amazing, the service is always good, the prices are reasonable and the portions are large.  It's a BYOW with an SAQ at the corner.  I love the zucchini fritts,  the calamari and the mussels.  They make great soups and real tasty salads with unique ingredients.  For main course I usually order their Gamberi (shrimp) - love them all or the Risotto alla Pescatore.  My husband loves their Spaghetti Bolognes and Linguini ai Fruitti di Mare.  It's a great place - you got to try it."}
{"text":"Seriously awesome.  In town for family vaca and we have a couple picky eaters.  They had something for everyone and that something was great in each case.  Great service (Eva); great atmosphere; just great all around.  Desert was awesome too.  Also, when I couldn't get a mobile signal to get Uber, Eva the waitress hooked us up with a cab within 3 minutes."}
{"text":"I can see why people would become regulars here. Relying on Yelp served us well. We loved the location, just off the main street at the corner of the building. Lovely  dark, orange and red ambience on walking in and we were served immediately to our seat.  We ordered the minestrone zuppa, pasta fruitti del mare and pasta carbonara for dinner. All three were excellent choices. The zuppa was very flavourful without being overpowering. The seafood pasta was full of seafood aroma and the carbonara was chokeful of bacon and cream. Perhaps we had smaller appetites, but with a soup, a dinner roll and the pasta, we were stuffed and had to leave a significant amount of pasta unfinished.  The ambience is excellent, an air of peace and quiet permeates the small restaurant. This is a place for quiet conversation which is occasionally interrupted by clangs of cookware from the chef as the kitchen is just a few tables away. If you take a table by the window, the view is lovely during winter, looking out at snow-covered pavements."}
{"text":"On y mange bien, mon assiette terre et mère c'était excellent. Un apporté votre vin avec une bonne SAQ tout prêt. Cela fait une belle carte des vins à bon prix. Le service excellent. Petit défaut, les tables trop collé. Ça permet un contact avec les autres tables, dépend de votre besoin vouloir communiqué ou non."}
{"text":"We had a great vegetarian dinner at this place. The owner suggested some nice \"not on the menu\" items. They used high quality, fresh veggies and made us some nice linguini with grilled veggies. He made very nice salad and manicotti too. Manicotti was great with just the right amount of filling and fresh tasting sauce. We also had bruchetta which was just ok.  Make sure u can find street parking - Free after 8pm. Also beware that \"not on the menu\" items can be pricey."}
{"text":"C'est un des resto BYOW (Bring your wine) de montréal. J'aime bien le concept ammener le vin que tu souhaites boire pas mal comme idée. Alors je me suis fais une petit rouge, un Grave de 2002 (que j'avais ramené dans mes bagages) avec une scalopina. Service correct, la viande délicieuse, de bonnes pâtes et des prix dans la moyenne du quartier (le plateau est un peu cher, normal c'est le quartier des français) 16,95 $ le plat Essayer le tiramisu maison, il est énorme, l'un des meilleurs que j'ai mangé.."}
{"text":"Had dinner at the Academie on the corner of St Denis and Duluth on Fri and would have missed Lombardi's right next door had I not checked Yelp for where to go for Sat dinner. What a wonderful Sat evening in Montreal! My wife and I and another couple were seated within minutes at 7:30pm,without a reservation, enthusiastically by Stan, whom I presume is the owner/manager. As I had read in other reviews he indicated he would be happy to customize any dinner if he could. Bottom line the service was first rate.  One special was lobster filled ravioli, to die for per my friend. I had shrimp Fra Diavolo and it was excellent and filling. An appetizer (called entree there) was not necessary. Bought a bottle of wine across the street to accompany the meal. All four dinners were superb.  Now price. Main courses averaged $20-$25. Can't beat that in a major metropolitan city.  Oh, and the music was not intrusive as I read elsewhere. Windows to the street were open and the slight breeze made it very comfortable. I highly recommend you try Lombardi's. I haven't had as pleasant an experience in the North End of Boston, 26 miles from my home."}
{"text":"This place is great!  Four of us were looking for nice-but-casual BYO dining, and found a gem here.  Great pasta, and no corkage fee; what more could anyone want in life?.  I had linguine with hot pepper-cognac-rose sauce.  Very attentive staff.  Our bill took a while to come, but we were enjoying our wine and conversation, and didn't mind.   I docked it one star for ambiance.  They've almost got it right -- it's clean, has nice lighting, and isn't overly loud -- but the art is positively hideous (the kind of stuff you'd find in a dentist's waiting room).  Also, like another reviewer mentioned, the music is an awful sort of electro-adult contemporary.  Where's the accordion at?!"}
{"text":"I decided to check this place out with my girlfriend tonight due to the good reviews. I have to say that the food was great,The service was friendly andi will go back. Don't expect table cloths and naps but for the price of the main dishes you really can't go wrong. The quality is there. Please keep in mind that my family also owns a BYOB in Lachine so I you can take my word for it that it is a nice meal...."}
{"text":"Le meilleure restaurant italien sur la rue Duluth. Plats savoureux, portion généreuse, on apporte notre vin et facture plus que raisonnable. Bravo!"}
{"text":"Petit, intime, simple, Lombardi est un excellent restaurant italien!  Pâtes fraîches de très bonne qualité et grand choix de menu  De plus, c'est un apportez votre vin!  Définitivement à essayer"}
{"text":"Un restaurant \"italien\" avec des proverbes écrits au mur à l'envers et plein de fautes !!!  Des assiettes appétissantes mais au premier de coup de fourchettes se révèlent écurantes !!!  Un des rares restaurants de la rue Duluth à éviter !!!"}
{"text":"The best italian restaurant i've tried so far. The food was amazing, the service, the ambiance(went in the summer) and the music, and it's great because it's a byow."}
{"text":"I loooove this Italian BYOB. Theyll make you anything you want so long as they have the ingredients (and they do). I'm particularly fond of the penne primavera with olive oil & garlic sauce. It's not on the menu but it should be: it's incredible!"}
{"text":"My wife and I were very pleased with this Italian BYOB. It has a pleasant atmosphere, and the service was prompt. We went on a Saturday night at 8:30 pm, were seated right away, and after we ordered our appetizer was out within 5 minutes or so. We ordered the calamari, and it was delicious. Our entrees arrived soon thereafter, and we were both impressed with the meal. We are not Italian, but we've been to some great Italian places in Boston and NYC, and this place can compete with them. The price is very fair given the high quality of the food.  As noted, visit the SAQ (liquor store) just up the street and grab a bottle of wine before you go to eat."}
{"text":"Un petit restaurant parfait pour manger de bonnes pates !  En plus d'être un apportez votre vin, ce restaurant vous charmera je vous le garantie. À commencer par les petits pains à l'ail avant le repas. (ils sont divin)   Vous devez aussi essayer les escargot à l'ail ils sont excellent.  Pour finir, le service est très bon, le m. qui nous servait était clairement l'homme le plus gentil de la planète haha"}
{"text":"I ate here on a whim while visiting Montreal with my partner. The food was good (portions were huge and made great leftovers) - but we were so impressed by the kind and attentive service. The man who I'm assuming is the owner/manager seems to treat every customer like a good friend and was very accommodating when we had to leave in a bit of a rush. Very homey and cozy atmosphere, would go back!"}
{"text":"Was in the area for work and one of my friends brought me here for dinner.  We were seated immediately and service was pretty good.  If you're used to the Italian restaurants in the States, this is different than what you're used to.  The menu and food is different but really good.  The portions are big.  So if you're not used to eating large meals, it's better to share.  Since I hadn't been here, my friend ordered our meal to share.  We got the Salmon dish with pasta on the side (gravy sauce).  Even though I had been ill for couple of days, the scent of the food was a teaser and I ended up eating few bites.  I just wish I was feeling better so I could eat more.  It's not the most romantic spot but it's clean and comfortable.  They allow you to bring your own vino which is cool and a good way to drink exactly what you want and save $$.  Next time I'm here, I'm coming back for sure.  Looking forward to trying other things on the menu and sharing it with my husband."}
{"text":"Very average - my pasta was cold,the steaks were ok but very small but the service was what really let it down.the waiter was exasperated by simple questions and when one of our party didn't get a bread roll (as they had no side plate) and requested one it was unceremoniously dumped on the table,minus a plate.i won't be back."}
{"text":"Visting Montreal (Le Plateau Mont Royal area) for a few weeks with my family (husband and 2 teenagers).  After one week in Montreal we were tired of walking around to find a restaurant that looked good to go into... there is an enormous amount of gyros, burgers, pizza and meals that all seem to come with french fries or poutine.  YELP - you saved us!  The reviews of this restaurant looked promising - and after eating there tonight, we wished we had found this restaurant sooner.  What a great menu of well-prepared Italian food.  We had the Paste ai Fruitti del Mare (pasta w/ seafood), Fettuccine alla Gigi (pasta w/ garlic, mushrooms, shallots, prosciutto and rose sauce), Fettuccine Alfredo, and Moules Assiette (meal of mussels marinara).  The mussels were perfectly prepared (and a huge portion), the seafood in the pasta dish was plentiful, and the pasta was fresh and amazing.  We don't drink, but I can see where bringing your own wine in this city is a big plus.  The prices were terrific, especially for the portion sizes.  Our server was a young girl who was extremely friendly helping us with the menu that is written in French only... make some suggestions and describing them in English.  The atmosphere is wonderful - an upstairs and downstairs (they fill the downstairs first before opening the upstairs) with open air seating on the inside and since they are just off the busy road of Saint Denis, the noise level and 'exhaust' from the main road is quite a bit better than those restaurants on the main road.  Frank Sinatra music was playing as we ate and even my kids were impressed with the atmosphere and food.  Perfect place for families, couples and even if you are eating solo."}
{"text":"In love with this place! At first you walk in and think ... Small, cozy. Met the owner and he was hilarious! Asked him for recommendations and just hearing his vivid descriptions makes you want the whole menu.   Started with delicious zucchini Frits and Brie fondue. So delicious and unique.  Then went on to ravioli and tortellini.    Any pasta is worth it. It's all fresh made so you can't to wrong.   The dessert ... What can I say I couldn't think it could get better and it did!!! The creamiest tastiest tiramisu.    In such a bliss for the savory scrumptious dinner."}
{"text":"I have to say that I was very unimpressed with my meal at Lombardi Restaurant. We dined there with family on a quiet Wednesday evening and I'm not sure if they were understaffed but it was a calamity of errors from the get go. We ordered simple appetizers (fried calamari and garlic bread) that took forever to arrive at the table and when the garlic bead did arrive one order was burnt and crunchy and tasted barely of garlic. The calamari was average.   Our second course (we ordered pasta and chicken parmigiana) took quite a while to arrive yet again - there were only a few tables seated in the dining room so it's not like it was a busy evening. A drink at our table was forgotten and it just seemed like the attention to detail was missing. And this became even more evident when it was obvious that the chicken parmigiana entree was completely forgotten as in they forgot to make it. We all basically finished our meals and then it arrived. Seriously. And when the bill arrived there was absolutely no compensation offered for this oversight. We were with family and didn't want to make a scene or question such poor service but it left a bad taste in our mouth regarding Lombardi.   In conclusion, the food was average and the service was just very haphazard. Definitely an off night here and I will not return."}
{"text":"Visited for our 40th Anniversary, LOVED LOMBARDI. Will celebrate our 50th there in June,  2018."}
{"text":"This place specializes in pasta. They have a vast selection and it's pretty much all good. The staff is always friendly and attentive. The decor is a little weird. It's a little layed out like an office building, but it works. But most important of all this is a bring your own wine restaurant. If you're looking for pasta in this neighborhood this is probably your best option."}
{"text":"Très bon lieu. Soupe excellente... Grands choix de plats (pas de pizza) et belle présentation. La salle du bas est tamisée, le restaurant est très chaleureux. Service remarquable."}
{"text":"When we arrived and were about to sit down, a fellow approaches me and says; \"if it's not on the menu, let me know what you want and we'll make it for you.\"  And I thought to myself, \"I feel like I'm in Brooklyn.\"  We checked the reviews out regarding this place and were pleasantly surprised. I found it hard to decide what to eat. I checked out everyone's plate around me and everything looked fantastic.  We had the bruschetta, spaghetti alla bolognese scaloppine de vitello ramazotti.  Everything was excellent, however I will say that the bolognese had somewhat of an off taste, hence the 3 stars rather than 4.  Definitely a winner and must-eat if in Montreal."}
{"text":"This three star rating comes as an average between the food (4 stars) and the service and ambience (2 stars.) We ordered the bruschetta as an appetizer and weren't disappointed. The bread was crispy and the tomatoes were fresh and sweet. For an entree, the Fra Diavolo was deliciously creamy, the spice wasn't overwhelming, and the pasta was al dente. The Penne Romanoff was creamy with the right amount of green onions and peppercorns for spice.  The byob was a nice touch and wine was offered when ours ran out. The ambiance was a cross between a college bar and a romantic restaurant - two things that surprisingly don't mix. The elbow to elbow seating and loud music took away from the romantic lighting and feel of a restaurant. Service was at best slow, with the lone waitress struggling to keep up with the rambunctious Friday-night crowd. Initial service was slow, but was overshadowed by a 30 minute wait to get the bill at the end of our meal. If you're not in a hurry and not looking to impress that special someone, we recommend you stop in at Lombardi's!"}
{"text":"This place is a really special restaurant.  I went there 3 times in my one and a half week stay this summer and I loved each and every visit.  We ordered pasta every time.  The portions are enough for 2 people so if you want to do take out for 2 you can even go with one pasta order.    The seafood was extremely fresh and they used tons so in the pasta- very delicious.  The sauces were extremely well made.  I am a self- taught chef and I can appreciate the different aromas and flavours they use.  I don't understand why the place isn't always packed like the one next door.  Lastly the prices are unbelievably low for the quality.  Living in Buenos Aires for two years taught me that price doesn't mean much when it comes to good food."}
{"text":"Loved the ambiance, the friendly staff, and the food was delicious. Lots of variety in the menu, and you can bring your own wine. The restaurant is located in a location that is accessible by public transportation and by car. If you are driving, a parking spot can be difficult to find."}
{"text":"Un bon restaurant de pâtes situé tout près de la rue St-Denis ! C'est un apportez votre vin en plus !!   Les repas sont copieux alors ne prenez pas d'entrée si vous avez un petit appétit! Sinon, je vous conseille les escargots à l'ail; c'est telllllleeeeement bon ! Les mets principaux sont pas mal tous bons (ceux que j'ai goûtés), la sauce à la viande reste ma préférée!   Le service est courtois et rapide et les prix sont très raisonnables! Un bon restau à essayer pour les soirs de semaines où ça ne vous tente pas de cuisiner !!"}
{"text":"Pour une première pour moi définitivement je retournerais si l'occasion ce présente.  Les gens de la place très courtois et joviale. Authentique pour leur plat et frais de très bonne portion et copieuse. Apportez votre vin et le.service impeccable. Très ambiance pauser ou romantique. Merci encore au gérant pour son humeur festive et amical."}
{"text":"Nice BYOW Italian in the Plateau. No reservations after 6pm. We came here 9pm on a Friday, and there were two couples in front of us. About a 15min wait, though it wasn't so bad.   Two floors. Upstairs much rowdier. We opted to sit downstairs. The man at the door, who I believe was the owner, took to us very quickly and became very friendly. He sat us at a 4 seat table and said \"Just pretend you're 3\" :)..  Then after looking through the menu, he came over and offered recommendations of dishes that aren't on there, but that he could make. We opted for two ravioli dishes, one with goat cheese and one with lobster, both with pink vodka sauce. And we got two starters, just bruschetta and a mixed salad.  He personally made the order for us, and told the waiters to take care of us, after which they were very prompt. This was surprisingly nice!  We drank our wine, starters came, both were good. Followed by the main courses, which were also excellent. A really nice experience over all.   Only thing is, this place gets a little bit too busy. Had we sat upstairs jammed between others, or not been attended to by the owner, I am not so sure the experience would have been the same. He has his eye on us all night and was suer kind. But then again, he didn't know we were going to write a review, so perhaps that is the way he treats clients, which is just amazing. But I did see others who were not being equally attended to.  Also, the music could change. It's 50% really nice soothing tracks, but 50% upbeat techno, which had to stop, but it wasn't a big deal. Again louder upstairs.  Overall, a really nice experience. We spent 2hrs here drinking and eating slowly. Would definitely return after trying out some other Italian eats in the city. And now I feel like we \"know the owner.\""}
{"text":"First, I know the owner and he became a family friend. So, yes my review might not be extra neutral.  It is one of the best bring your own wine restaurant in Montreal. Food is quite good and price are low.   Only downside is that it can be quite busy sometimes."}
{"text":"Tip: Google maps will lead you to the corner of Rue St Denis and Ave Duluth. It's actually 100 feet east, on Ave Duluth. The restaurant on the corner is also an Italian restaurant that has a name that also starts with the letter L, and I initially went to the wrong restaurant because of this.  Anyways, when you actually get to the right restaurant, they have 2 floors for dining. My server was brand new, so every time we had a question, she had to ask and get help.  Place looked semi-fancy with the white clothes and place settings, but people were dining here with casual clothing.   Not much on the menu, and I wasn't specially awed with my spaghetti, but it gave me my required nutrients, so I guess I was satisfied with that."}
{"text":"Lombardi gets rave reviews on Yelp and across the web in general. I have to say, I don't really get it. Don't get me wrong, I thought the service was great. We were greeted at the door and seated immediately. The owner very helpfully explained that they didn't have a liquor license but that we could purchase wine at the SAQ store down the road. So far, so good. I ordered the melon and ham as a starter. The melon was ripe and tasty and worked well with the salty proscuitto but I didn't understand why it was served on a bed of mixed salad. The salad was completely unseasoned (not even a drizzle of olive oil), making it dry and pretty tasteless. Also the starter was served in a bowl making it quite difficult to eat since the melon and prosciutto needed to be cut (they were served in slices). My main was on the same level and pretty good. I ordered the linguine al vongole and was a bit surprised to see that the clams had been blended into the tomato sauce rather than served whole on top of the pasta as is customary. But hey, like I said, the food was pretty good. What was not so good was the price...! Not good value for money at all. Too bad, if it were more reasonably priced I would certainly give it another shot."}
{"text":"Approximate food and approximate service (actually am hesitant whether I should be using \"bad\" instead of \"approximate\" here). Pretty much sums up all of the 3 times I set foot at Lombardi...   If you want Italian food and/or a place where you can gather with a group of friends, you can do so much better... find yourself a nice (and good!) Italian restaurant. Not here. NB. You might have better luck if you're not on Duluth."}
{"text":"I chose this restaurant because of the great reviews and I was really disappointed. I ordered \"pasta alle vongole\" and received a very cheap version of this dish with the clams not served whole. We all ordered different pasta dishes but they looked the same basically and none of us were happy with our food. On the positive side the service was very good, we didn't have to book a table, and it wasn't expensive. But overall, you shouldn't expect to eat real quality italian dishes at this place..."}
{"text":"I had been wanting to try this restaurant for some time based on the many positive reviews, sadly, my experience did not reflect the experiences of so many others. First let me start with the service, it was extremely busy that evening, so there was some slack to be cut for that reason. The next table of five commanded the attention of the waitress and the owner as he sat there for quite some time as service languished in the surrounding tables. Finally when the order was placed there was and additional wait, again that can be excused because of the demands placed on the kitchen that evening. I ordered Trio Vitello, veal three ways with the chef\"s choice of sauces, unfortunately, I was totally underwhelmed as it lacked flavor and in no way mirrored my dining experiences over the years in other Montreal Italian restaurants. At the conclusion of the meal, I was asked about dessert but passed as I did not want to prolong and already unsatisfactory and unpleasant experience. I would in the future return to that area but would dine across the street at Eduardo's where I had a positively wonderful experience, for now Lombardi's is off the list."}
{"text":"My wife and I ate here last night. We found this place on Yelp and decided to give it a try. It is located on a quiet street and we sat on the ground level. This is a BYOW which is really nice. We started with the bruschetta which we were not thrilled with, just seemed like something was missing so was very bland. I order Shrimp fra diavolo with penne arriabiata on the side. The shrimp was cooked to perfection and the penne was perfect. The sauces on both were very good. My wife ordered gnocchi and she was not happy with it. So all in all the we were mixed and thus we rated it three stars."}
{"text":"In a weekend spent in Montreal, Lombardi was hands down the best venue we visited. The manager/owner (I'm guessing) greeted us at the door and after learning that we were visiting from Boston, promptly cleared a window table and gave us personalized service our entire stay.    This is a BYOB restaurant, and there are 2 liquor stores across the street. We started with prosciutto served with crostinis, along with our Italian red wine. After asking for a seafood recommendation, he offered a Diavolo dish with shrimp, scallops, and muscles, that wasn't on the menu, and it was fantastic.   My only wish is that we dined here our first night, and came back the next, as it was the only experience that weekend with friendly service, affordable food, and great food."}
{"text":"Food is excellent but the service isn't all that great. If you're starving, this is probably not the place to go to for dinner. If you are not in a rush, this place is pretty good. It's BYOB. There's a liquor store right next to this place as well in case you forget to bring something to drink."}
