{"text":"Their hours say that they close at 10pm Friday -Sunday  ... I called around 9pm on a Saturday to make sure they will be still open , girl picked up & said they will be open until 10pm .... When I called I was right around the corner & the open sign was still on & two girl employees where standing in front of the counter & saw me.. The door was locked & they saw me try to open the door & they laughed & left me outside!!  I even waited 5 minutes for them but never came to the door!   Wings are great but i will NEVER come to this location again !!!!!"}
{"text":"So it's false advertisement!!! No five dollar off on the 50 hot wings family deal when you check in with Yelp. The girls didn't even know. One of the girls said it was some kind of promotion were they hand out a ticket on certain dates. Sounded like all that was made up since she didn't even know the dates. Maybe they should update their Yelp account. Very disappointed!"}
{"text":"Small place, in a strip mall, never know it's here unless you had been here or knew what to look for!
Menu is definitely Long Wong's .. friendly staff.  Place is extremely small!! But stop by & check them out ..."}
{"text":"Small hard \"chicken wings\" and shitty service. If you're into that kind of thing then this is the plans for you. They should hire more mature staff that actually know how to cook and not have have their nieces or nephews \"working\" the place."}
{"text":"Locals call it a hole in the wall but the place have its own charm . it's not a fancy place but the vibe there is chill and nice the people that work there are bilingual so it's easy for everyone. The mild buffalo wings are good but the lemon pepper let me down you need to ask for extra seasoning other way they taste plain."}
{"text":"Just arrived and they did not accept the $5 coupon listed on Yelp. Girl claimed she didn't know that the coupon was on the website"}
{"text":"I came across this place craving wings, as I walk in I see a cashier with a what do you want face. She did not greeted us. I look at the menu (on the wall)to see what can I have I ask cashier what she recommendes she carelessly with a smirk on her  face say I dont know....wtf... you work here and you dont know what is good what kind of service is that. I totally ignore her ok its 6 of  us at home just give me a  mini bucket of suicide wings.  The flavor on wings were ok, good flavor thats why I give a one  star cause if it to customer service ill give no star. They seriously need to get rid of her."}
{"text":"illlllkkkk! 
This place is horrible!
Overpriced, ($1.50 to pour a different sauce on the little dry ones) lazy customer service (no receipt or napkins offered)  and awful food!
I thought I'd give this place a second chance and I realize I was right the first time.
I had the wings (medium & suicide) they were little dried out & shriveled up, I also
had the sampler (zucchini mushroom and onion rings) all I can say is unflavorful.
My mother had the turkey club with bacon, she said it was OK.
I will not be returning!"}
{"text":"Never disappointed. Always delicious. Best wings in Arizona. LOVE this place! salad, zucchini, the ranch dressing, its all amazing. we come so often we have received at the very least 10 free dozen hot wings with our punch card. BEST HOT WINGS!"}
{"text":"Okay, so I'm realllyyyyy freaking picky when it comes to my wings. I don't do Hooters wings. I don't do Buffalo Wild Wings. I don't do Pizza Hut wings. I think I've only had one dozen wings that I went kind of nuts over... and that was yesterday at Long Wong's.

Luckily, one of my girlfriends knew how ridiculous I am when it comes to wings but insisted we check this place out. Ghetto area. The girl at the counter wore black lipliner. The customers looked like they just got out of prison...

HOWEVER! The wings were out of this world. Saucy, full of flavor, and cheap. Extra veggies, extra ranch... no charge. We ate so many wings + chili cheese fries, and I felt like a heffer when we were done. SUCCESS!"}
{"text":"I love this place! Its a little hole in the wall that serves all types of food. You can have wings, or pizza, or burgers, or sandwiches....the list goes on. Service was quick and food was amazing. When everyone wants something different we always go here! Love this place!"}
{"text":"Wings are good, but the hotdog was terrible. Stick to the wings and you'll be okay. Place is kinda  a dump IMO, definitely need to invest profits back into the building."}
{"text":"Definitely 100% delicious.
Even my family that I had a great of place when we were going home and talking about how great the service and the wings here at Long Wong's Hot Wings. Absolutely the right place when you want to have a dinner with your family.
A must try."}
{"text":"Long Wongs has the most amazing wings! They are crispy and saucy. My husband and I went with two friends that recommend Long Wongs to us. We got wings and pizza. I didn't like the pizza but the wings are definitely worth the 5 stars. When you go into any Long Wong restaurant you may think it looks not so nice but the wings are worth it. We got the suicide and the hot. The suicide are very hot like the kinda of hot that your nose turns red and water but the have good taste. The hot are very hot as well not as hot as the suicide but close. We really enjoyed are wings! I don't think I will be getting wings anywhere eles."}
{"text":"Worst customer service ever I ordered two dozen wings today November 6 at 3:45 PM I asked for six wings to be plain because of my one year-old son they told me I was not allowed to do that I had to order 50 or more wings that's ridiculous this is not a kid friendly location at all I will never come here again I even asked to speak with the manager and she told me she wouldn't do it either unless I ordered over 50 wings do not go to this hole in the wall place if you have kids they're not kid friendly too bad there is not a zero star rating because that's what this deserves *O*"}
{"text":"This place probably isn't the typical Long Wongs. It's not in the best neighborhood and had a sign at the counter that said \"this isn't Burger King. You don't get it your way. You get it our way.\" I ordered fish and chips which the menu wall said was batter dipped. I was served beaded fish sticks...(no kidding), like we had in the 70's but they're served with a side of wing sauce. I didn't try that combo though. My husband had wings and said they were average. Fries were pretty limp. Booths were dirty and uncomfortable. I don't know how yelp decided this was a Chinese place. It's everything but."}
{"text":"This place is kinda over priced. The food is moderately okay not incredible and certainly not worth what your charged. I've been here three or four times. I have gotten wings and salads. The salads are large but for 10 bucks not worth it. Plus they cut stuff odd. Like a tomato into monsterus bites. The wings are dry and lack basic flavor. Honest I'm really not impressed enough to say I would be back again. But not displeased enough to say I would never be back.  I would neither recommend nor avoid this place.  

Overall it's kinda like the president , you just accept it and go about your day."}
{"text":"I don't know if this location is just one of all the others or not. I would assume so by all the \"Best of Phoenix\" stuff on the walls and just like all the rest, this one is in a seedy location and nowhere near clean by any standard. In fact, I'm sure if I saw the Kitchen area I would never eat at another Long Wongs, but I digress. Back to the review.

I learned today that you can say \"Heaven and Hell\" another way by using \"Chili Cheese Fries\". Why Heaven and Hell you ask? Heaven because of the way they taste and Hell for the mess and calorie count they must surely contain. I was even dumb enough to order a burger to go with these \"Hells Angels\" but all I could muster from it was one lowly bite. Just enough so I could say \"MMMMMmmmmm\" before it went cold. Well at least I know whats for dinner tonight now.  

TIP- There's no sign on the road (YET) so look for the Mobil Car Wash on Indian School. Its behind there."}
{"text":"The wait was super long and the the tables were all dirty. We asked the waitress to please clean one and she took forever . There  was trash under tables and no one bother to clean. They were not super busy but they are super lazy .  I like the food but won't go back because of customer service and dirtiness . I Would rate food higher but I won't because of the above reasons . I hope the owner reads this and makes some changes ."}
