{"text":"This is now a Roberto's Taco and no longer Los Burritos.

The food is still good though! The entire place has been remodeled and its pretty much brand new. I always get the same thing. Carne Asada Fries, Carne Asada Burrito, and Menudo!"}
{"text":"I've tried pretty much all of their burrito varieties. For the most part, they are the standard burritos you'd find anywhere. Pollo, carne asada, chorizo etc. They're DAMN GOOD though! As expected of a place named \"The Burritos\"! The Green and Orange are AWESOME. Be sure to try it since they add some great kick!

My favorite burrito is the CHILE RELLENO BURRITO. Even though I love meat, this thing blows the other burritos away! You could say it is a vegetarian burrito. HOWEVER IT HAS A GIANT CHILE PEPPER INSIDE IT!!! It basically goes from one end of the burrito to the other.

Chuck Norris himself can't beat that -  even with his Roundhouse Kick.

You must try it once!"}
{"text":"A co-worker and I ordered food for delivery and were pleasantly surprised with the quality and freshness.  Lunch was great with big proportions and fast delivery!"}
{"text":"I order delivery from this place all the time and I am always satisfied! If you like spicy guacamole, just ask for it! Little secret the delivery guy told me. I love the pork burrito the best. Fast delivery and food tastes hot and fresh. I would recommend this place!"}
{"text":"Granted I've only had dishes with the grilled chicken; HOWEVER, it's THE BEST grilled chicken  in town. They have 2 kinds of salsa - one that comes with their chips and another that comes with their tacos- both are great but the one that comes with tacos is amazing! (I'm very particular about my salsas). Great place that everyone needs to try! Love Love Love Los Burritos!"}
{"text":"Best Mexican food. The salsa is incredible and the breakfast burrito (chorizo with potatoes) was amazing. Fantastic service."}
{"text":"Heavenly Mexican food that delivers to my house. Super legit. 

Don't feel like being funny or witty right now, this is pure information delivery so that you can eat here tomorrow."}
{"text":"Dirty... Floors, tables, waste cans. Salsa bar was watered down and tasteless. Cashier was handling the food with her bare hands--patting the burrito shells on the grill and transferring the cooked food to the trays...seriously, this is a health violation. The food was good, but could have been better. I am not overly sensitive, but this was too much."}
{"text":"Located in a very run-down strip mall, if you're going to go you have to be prepared for the hole-in-the-wall place that this is. When I was there, there was only one employee in the place (Noon on a Thursday). And they had no customers. The guy was nice, took my order and cooked it up. Food was fine, but I won't likely go back."}
{"text":"Read the reviews and thought to give it a try...

Pros: This little restaurant captures the Mexico vibe and puts it on Thomas Rd.  And we know, as they say a \"whole in the wall\" restaurant can turn out to be the best! The carne asada was made fresh to order, the beans were amazing and the salsa is authentic and \"home made\" fresh daily. Fernando and Ben are great hosts! Definitely will be back to try another dish! 

Cons: they could work on their Spanish Rice...a true Mexican staple food. Get that right and my son will be  regular patron."}
{"text":"This was the worse food i have ever had. I ordered Cheese enchiladas and  have no idea what was in the middle. the place stunk and it was very hot inside. The staff was pleasant and nice but the food was horrible. would not go back again."}
{"text":"I stumbled on this place while driving by. I had an awesome chile relleno burrito. I haven't seen this since I was in Mexico. It was very tasty. The place is set up like a down home Chipotle in that you can see everything and choose your burrito fillings. The restaurant is very authentic and the staff are friendly."}
{"text":"First visit was so,so.  But then I tried the carne asada quesadilla....delicious!  Good customer service as well!"}
{"text":"This was my first but definitely not goin to be my last time orderin for here!!!. The chicken burrito was great and so was the chkn quesadilla. I asked for the beans and rice to be on the side and it was done! The delivery was quick and accurate, the driver didn't get lost! Lol I would definitely recommend this place for food!!! I will be back for more!!"}
{"text":"It's a clean, little place. The people are nice and friendly, and the food was reasonably good and well priced. I thought the burrito was very decent and so was the taco supreme. Can't think of anything negative to say about the place considering it's a cheap neighborhood restaurant."}
{"text":"Found this place on yelp and saw good reviews so decided to give it a try. I called in for delivery and ordered 3 tacos, a side of chips & salsa and a mango. The delivery was fast and the food was delicious! I absolutely loved the tacos and the salsa. Will definitely  be eating at this place again!"}
{"text":"Originally from Cali and now living on the East Coast, I crave delicious Mexican food. I eagerly await my annual trip out West! I was passing through Phoenix and read about this place. Well, Los Burritos did not disappoint! I ordered a carne asada burrito and a flan and my dad had huevos rancheros. First off, Fernando, the owner came out to welcome us. Him and his son run the place. He cooks everything fresh and right then, so he is able to easily add or change up your order to your liking. The food is simply delicious. The seasoning on the carne was perfect and the meat was tender. The flan was so good my dad had to get one for himself. The huevos rancheros were fantastic too with a flavorful sauce. Fernando came over to chat with us and you really get the sense that he is passionate about making you feel welcome and providing you a flavorful and delicious meal. The atmosphere could certainly use a little updating touch, but please don't let that stop you from eating here. It is the true \"hole in the wall\" find. The one you tell all your friends about if they want some delic Mexican grub. I can't wait to return next year! Do your tummy a favor and go support this family run spot..."}
{"text":"I am really picky about my mexican food because I know what real mexican food tastes like and Los Burritos delivers. Their quesadilla and their burrito de carne azada were delicious. I've also stopped in for breakfast and I've had eggs with chorizo and also eggs and chilaquiles and I've never been disappointed. Great family run business"}
{"text":"My fiancé and I were starving. Neither of us had eaten anything all day. So when he gave me the I don't feel like cooking let's order something look after getting home one night, I knew we were in trouble due to the fact that all there was to order near us was pizza. So, I opened yelp and stumbled on this gem. Their menu is diverse, and reasonably priced. My fiancé had the three enchiladas plate and I had a bean rice and cheese burrito. He ate his so fast that I know it was good, although all he could manage to say was \"Spicy.\" My bean rice and cheese burrito was excellent. Especially when I added a little bit of their Pico. The only thing Los Burritos can work on is their delivery time. I felt that waiting forty five minutes was a little long.  I give these guys four stars."}
{"text":"Everything is cooked to order, takes a couple mins, but we'll worth it. Owner and his family are extremely nice and take pride in their food. It's very addicting, and I can't stop coming back for more."}
{"text":"Great customer service, is the first thing I have to say! My wife and Are visiting from Washington. we had the carne asada tacos and burrito. The ingredients are fresh, meat isn't chewy. The only downside is that the rice served with the taco plate was a bit more moist then I would prefer. A diamond in the rough. I would and will visit this location again."}
{"text":"Stay away from this place if you want to get sick. This place is a filthy,disgusting hole in the wall. The place was dirty,dusty and filthy stain up the walls. And the bathroom was grosser than any place in Mexico I have been. Food was gross and chips and salsa came out of a bag. I have never seen a restaurant this filthy in Phoenix."}
{"text":"ooooooooooooomg

so freaking good its ridiculous. 

forget any other place that ends in \"erto's\" unless its 3am.

i have never stopped eating to write a review. but this is incredible. this place can be missed very quickly as you drive by, but look for it across from fry's.

the family staff is awesome. very nice. and cute to boot.

i tried the carne quesadilla. aaaaaaand i'm in love. highly suggest it.

new website is: www.phoenixlosburritos.com"}
{"text":"i just finished eating a burrito from this spot. i dumped out nearly all of the chicken... if the saying, 'you are what you eat' is true then i am so fuckckin nasty."}
{"text":"After eating here I never eat filibertos, Juliobertos at all, really well ran family business... Food is made too perfection

I always order the nachos every time I go there & it never lets me down.... One thing more this place delivers food to your door... What more do you want"}
{"text":"Tried their breakfast burrito and I really enjoyed it.  It tasted a lot fresher then going to a filibertos.  Unfortunately my hubby didn't get beef in his rolled tacos like he had ordered he got chicken. I would def go back."}
{"text":"Los Burritos... Simply delicious. A hidden gem to say the least! I walked into the small restaurant with colorful window art of Mexican food. I was greeted and served by a wonderful staff. I ordered a burrito expecting the usual taste of a burrito, however when I began to eat I was hit with a wave of childhood memories and flavors. Los Burritos is TRUE Mexican food made with authenticity and care. The meat is carefully prepared to an unbelievable quality and the recipes used are the same ones that would be used for a family dinner. I highly recommend Los Burritos."}
{"text":"Great Food! Fast and Friendly personell. Very small and hidden on 30th Pl and Thomas."}
{"text":"Based on the reviews we were excited to eat here.  It's in a sketchy strip mall, I probably would have passed on this place if it was dark.  
The inside is tiny and seems not dirty, but not clean.  The gentleman taking our order was very nice.  He was interested in how we found out about them.  
We ordered and then waited and waited and waited.  I guess it's good the owners kids were watching the disney channel so my kids didn't get antsy. After a good 25 minutes wait (at least we know it's freshly made) we got our food. The kids mini burritos were just that,  mini and the 8 year old wanted more food.  But I certainly wasn't going to order another and wait and wait.  I got a chicken taco that was boring,  I could have made it at home,  and a vampiro that was the best thing I ate here and it was just okay.  My husband had Carne asada tacos and was not impressed as the reviews that brought us here implied we would be.  We also ordered chips and salsa, which was the most disappointing part of the meal.  I'm pretty sure they were bagged chips (the broken bottom of the bag chips at that) and store bought salsa.  
After the meal though was the worst.  My 4 year old daughter needed to use the restroom.   It was marked out of order, but one of the owners sons just came out.....and when a 4 year olds gotta go, well she's gotta go! Yuck! It was so dirty!  The floors were filthy and the toilet had a string hanging out where the handle should be to flush it. This is actually why I changed my original 3 star rating to 2.  
Over all,  not impressed at all.  Actually quite disappointed. We won't be going back there again."}
{"text":"Found this place really close to home thanks to yelp.  I've been looking for a.New favorite burrito joint - and this is it.  Awesome steak burrito - make sure you get the salsa.  It's homemade!  Family owned and very friendly."}
{"text":"I got delivery and will say they were really quick. The chicken nachos had plenty of really quality chicken, highly recommend. The asada burrito was a little on the bland side of things."}
{"text":"I thought I finally had found a decent Mexican restaurant in my new neighborhood but this place is seriously bland and makes me miss Mexican food in the mission. 

I tried the super burrito and my man had the soft tacos both were so mild with no real flavor. 

Maybe I'll try something else soon but for now Los Burritos, 2 stars."}
{"text":"Great Mexican food, cheap, fast and free delivery. Never had a bad experience."}
{"text":"This is a really friendly family owned business. I do not go out to eat Mexican food because I can usually go to my parents for the good stuff but this place really impressed me. I tested their authenticity by ordering the chilaquiles en chile rojo. They passed with flying colors!!!!"}
{"text":"Went their a few days ago, I luv luv luv Mexican food and all I can say about this place is I'll be their 1 or 2 times a week from now on."}
{"text":"Delivery time was quick. Unfortunately, I ordered the carne asada fries and the fries were almost raw. It was so disgusting. The chicken quesadilla was OK. The guacamole was lacking flavor. I will never order from them again."}
{"text":"So delicious and the owner and his son couldn't be more delightful.  While it clearly is a dive atmosphere, the food is of a very fine quality.  I had the enchiladas which were delicious and, in particular, the pureed beans were especially good.  My daughter had her go to bean and cheese burrito which again was done flawlessly.  This is a great little restaurant with friendly and talented service."}
{"text":"Taco Night- Tuesdays all you can eat 6.00$ / 6:00-9:00 Pm Chicken or Beef. This gets you an extra star. Tex-Mex spot in the area. I stopped after a day of working in the area. I'll be back. It's got that Subway sammich style you request what goes in. They have a unique spin with some of the options. i.e. you can add Rice, beans, or Potatoes (cooked W/ chorizo) to your burrito. It seems to be a family run operation and they are all very nice & friendly. The order was super quick. The interior is crisp and clean. I Would've stayed. Especially since you can refill your Horchata."}
{"text":"After a nice cardio class at the gym, we just had to get some protein to replenish our energy.  Roland wanted Mexican food, even though I wanted to go home and eat an Asian Pear and a banana.  He was just too hungry and decided to go to Los Burritos, which is right across the street.  The place is quite small, will several booths.  The food are all on display, kinda like what you would see at the buffet.  This is what we ordered:

-Chips and salsa ($2:50): Decent, but I am used to other places giving free chips and salsa...O well.  

-Shredded beef plate, which includes eggs, potatoes, refried beans, corn tortilla ($6:50): They were all room temperature, except for the eggs.

-Side of guacamole ($.50)-I thought this was cheap.  I used the chips that came with the chips and salsa and dip it in this small side of guacamole.

-Pork Tamale ($2)-This tamale was pretty big compared to all other tamales that I have seen.  It tastes a bit different too.  By that, it is the flavor of the maiz.   It has like a couscous texture, and a bit saltier than the other tamales that I have eaten.  This was our favorite actually.  Different, but in a good way.  

We only finish 3/4 of the food.  Roland's eyes were too hungry compared to his belly.  I just got out of the gym so I didn't want to stuff myself.  Everything tasted decent, but will only come here for convenience."}
{"text":"I went there for the nachos, that Karen recommended.  They were alright, but I also got the CRUNCHY TACO Now that was BOMDIGITY!  
I just moved in the Silverado area, and I'm glad I looked it up on line to see what the reviews were.
I will be going to Taco Tuesdays!"}
{"text":"Deliciousness delivered right to my door! I had a carne asada taco and a shredded chicken vampiro w/ a side of Mexican corn (you know, the corn on the cob slathered in cotija cheese). It was all fabulous, incredibly seasoned and delicious, plus the delivery driver was sweet as pie. This is the real deal."}
{"text":"Satisfied! I found my lil piece of mexican food heaven and it's delivered to my door. Best carne asada torta I've had in the states. Seriously the bread was the best. Seems most tortas I've had in AZ are stuffed to the max and fall apart...not here. For dessert I had mango with chili n limon YUM."}
{"text":"I ordered the carne asada nachos and they were just incredible. I go their every chance I get and I would recommend it to anybody and everybody that wants to have a genuine Mexican meal."}
{"text":"Great food an tons of it on the cheap. Drunk in Vegas? Best hang over food EVER!"}
{"text":"We tried this modest, but clean and friendly taco shop and would recommend for quality and prompt eats reasonably priced. No wait service but attentive staff. Definitely going back. Food very fresh and well prepared, flavors authentic, heat/spice you can add for this \"real food for real people place."}
{"text":"Los Burritos has excellent Mexican food. It's authentic, great tasting, and at a reasonable price. 

This family run businesses will deliver tasty food every time without fail. So far I've ordered the burrito de carne asada and the burrito de pollo, each have been great! Just realize that they typically come with rice and beans in them, ask if you don't want them added in there . 

They definitely take pride in the place, it's nice to see pictures of the family inside the restaurant itself. Definitely recommend this place!"}
{"text":"Hidden gem in the Arcadia area. If you are looking for authentic Mexican food in Phoenix you have to check out Los Burritos. Everything is prepared fresh and made to order. Family owned and operated, everyone is extremely friendly! Great find! Don't miss out!"}
{"text":"Came for business from DC and was looking for great Mexican food.  We were welcomed by the owner and his two sons. The place is unpretentious but those can be the hidden gems.  This sure was!!

Extremely friendly family and the food was made to order. Started with carne asada nachos and it was spectacular. Then ate chorizo con papas burrito and the chorizo was delicious!!  Not greasy and very tasty. 

Great food, nice owner. What else can you ask for.  Definitely recommend and I will come back next time I'm in Phoenix."}
{"text":"Amazing customer service and some of the best carne asada I've had in the valley (not fatty like lots of other places). Great little hole-in-the-wall spot, nothing fancy, but they certainly know what they're doing. Also, they deliver!"}
{"text":"Loved this place, especially the all-you-can-eat Taco Tuesday.  Unfortunately this location closed down, apparently.  The location in Silverado Ranch is still up and running, I believe.  But if you're in the North part of town and need something tasty, I recommend Alfonsos which is right up the street."}
{"text":"OMG let me just say three words, Carne Asada NACHOS! They are bombdotcom!  I love walking into this place, the employees are nice and are willing to take my order.  They have great deals going on like three tacos and a drink for $7.25, or stuff like that but I usually stick to the nachos!  I literally have to have this every other week.  My friend suggested this for me a while back, and I wasn't too impressed until I added the spicy mayo sauce.  It's like a mexican version of the yum, yum sauce = AMAZING!  I love how my nachos are still crisp even with all the toppings on top, and the vegetables are fresh! Once you're there get a stamp card, the lady was so generous that she gave me four stamps.  Get 7, and you get a free burrito."}
{"text":"The real deal, for sure. Super friendly family. If you are from out of town like me, buy more than you can eat, so you can taste more things. Don't pass up the unique and super tasty chili rellenos. Nothing here disappoints."}
{"text":"There's a legendary Mexican food place in San Jose called La Victoria that is known for their addictive orange sauce. I had it once while visiting NorCal and have been craving it ever since. Fast forward a couple years later when I'm in town visiting Vegas and I'm brought to this Mexican food place called Los Burritos. I'm advised to try their Orange Sauce. Much to my surprise, they carry an exact duplicate of La Victoria's famouse orange sauce! I explain my excitement to the very friendly owner and she says that not only does she know the owner of La Victoria, but that they grew up in the same town in Mexico. What a truly surreal experience. Not only do they have thus addictive sauce but their food and service is great as well."}
{"text":"i walked out of the gym on silverado ranch, and for some reason i was craving a burrito. I jumped on yelp and there was los burritos! i was sad cuz it wasn't tue from reading jerry h. review. 

My brother and i got the 3 pack with 2 burritos and a drink for 6.95 and an extra drink. It was tasty too, I dropped it a star cuz my horchata was not sweet at all it tastied like there was no sugar at all in the machine! 

Food was great, service was great, the horchata wasn't but it was great nevertheless. I will be back again soon. Thanks Yelp!"}
{"text":"They deliver quick and tasty Mexican food. Enough said.

But to say a little more, their food is done the right way. Chicken could be slightly more flavorful, which is why they didn't receive 5 stars. The location is a hole in the wall- the owners 2 little brothers were sitting in front playing when we went to get our takeout. Family owned place and serves good food!

Their salsa is fresh and amazing. Will definitely get their food again."}
{"text":"Great breakfast and chips and salsa/guacamole. The chorizo burrito is great and their prices are reasonable"}
{"text":"A Mexican food place that delivers!!!  The owner was very attentive and interested in providing excellent service and food.  He is a personable guy willing to share his stories of where the recipes originated in his family.  I ordered the chiles rellenos burrito which was served in a homemade type tortilla -- just spicy enough.  This is really authentic Mexican food."}
{"text":"Dear everyone in Arcadia lite:

There's an unfortunate shortage of food delivery in our neck of the woods.  For all those times you're too tired to hop in the car, or sincerely just too hammered to leave the friendly confines of your living room; the food gods created Los burritos.

Food: 5 stars. You can taste the authenticity in their regular salsa. Wasn't made for gringo's.
Atmosphere: my living rooms awesome thank you for asking.
Service: 5 stars. Got to my house in under 20.

In short, these guys provide a great service to our residents. Next time you stumble home from Little Woody's hungry you'll thank me.

Sincerely,
Yelp User Cam"}
{"text":"As much as I loved this place it closed down.  RIP Los Burritos.  However, I did see I was bought out by another Mexican join.  Need to check it out some time"}
{"text":"LOVE THIS PLACE! The owner is always behind the counter cooking my food fresh ready to order. And they deliver for free no delivery charge! Even though I tip anyways. And once again the owner delivers my food somtimes in a hair net haha.The food is the best most authenic quick mexican food I've had in this area and I haven't found anything that compares. I'm from Chicago and i personally feel the Mexican food is awful out here.. maybe its the desert or cheap products. Anyways the fresh gauc and salsa mmmmyum but some reason they don't make their chips or even have good corn chips. That is the only reason I took it down to 4 star. They look like fritos! I hate those, I just use different chips from the mexican market I buy at home to eat the delicious salsa. Ill recommend they should at least have better chips. Also the interior has little atmosphere,  but with a little work they could decorate. The walls are white , some pictures up of family, you can see through the kitchen and hear everything. Not the best place to eat at but I enjoy there company and good food so atmosphere is not a priority when I visit. I've eatn the tacos all the meats offered are great..the carne asada is the best, but my go to is the chicken grilled burrito...so good. My boyfriend LOVES the chili relleno burrito, gets it almost everytime.all in all one of my favorites and I'm having it for lunch now ;)"}
{"text":"Super friendly staff and tasty food!!! I ordered the carne Asada plate and while I waited the owner came out and chatted with me. I just think that is so nice! When I'm back in Phoenix again I'll definitely stop in to try some of their other dishes. Oh and good prices too."}
{"text":"Order took over an hour to arrive and the food was cold and inedible. Ordered three tacos dorados and got their version - which is basically rolled tortillas with some meat inside. For this they bill you over 8 dollars. I could have made it so much better myself at home. Contacted the place to let them know and all I got was: \"Our reviews are perfect\" and other comments that contradicted my experience. They didn't listen and hardly allowed me to explain. They have no concept of proper Customer Service. I will never order from this place again and strongly advise anybody else from doing so. You will be VERY disappointed. Trust me on this."}
