{"text":"Clean restaurant with sufficient amount of seating as long as you don't come during lunch time when the line is almost out the door. The food is great and the price is fair."}
{"text":"I love this place I used to come about 2 to 3 times a week before I went on a juicing diet and the service is great they all knew my order and would start making it as soon as they saw me :)"}
{"text":"Yummy yummy yummy! A family favorite of ours... amazing Mexican classics and tasty homemade tortillas. You can't go wrong!"}
{"text":"I have eaten at this place just about every other week!  It is consistently great!  Fresh and ready to go when you get there to pick it up.  They are friendly and very efficient.  Love this place!!!!  Thank you!"}
{"text":"So happy to have a good taqueria near my house! Been here a couple times, I'm from northern California where California burritos are rare, so I was glad to see that on the menu. French fries were a little soggy though. Good prices and portions. Will definitely be coming here often."}
{"text":"This place looked promising from the reviews. We got the carnitas tacos and they were terrible. The meat was cold, tough and chewy. The tortillas were soggy. We also got the carne asada borrito. It also was cold and the meat chewy and bland. The green and red salsa was runny and flavorless. I think I would rather eat at Taco Bell."}
{"text":"This is very close to our house and is good for the price and location. I have tried a varitey of things on the menu, but all in all I would say its a step above the bertos but nothing you should rush out to get. My favorite items are a simple bean and cheese wtih sour cream and tomatoes adddes, and their carne asada. nuf said."}
{"text":"Their food is garbage. Last time I went I tried the cheese enchiladas. Corn tortilla filled with shredded jack cheese smothered with a bland sauce. It's run by Mexican's that can't cook Mexican food? I won't be back anytime soon."}
{"text":"I really liked this place. We had the cheese enchiladas & fries with guacamole. Both dishes were excellent. The food really tastes fresh. It was a good portion for the price too. I was really glad they had hot sauces available.... It was a good touch. Highly recommend for a quick and yummy bite."}
{"text":"Great food and good prices. They are always busy so plan to wait a little especially around dinner time. Best place in Chandler for breakfast burritos!"}
{"text":"Best breakfast burritos around.  Huge & $4.  Can't beat that.  I get the bacon & add avocado.   The California chicken is amazing too.  My kids love the quesadillas. They use real authentic tortillas (probably have lard in them) but they are soon yuum. I always take tons of their hot sauces home & use them all week.   The red sauce is the best!  It's a taco shop but cheap & good. Not greasy like filibertos & Armando's"}
{"text":"I stated eating at the Los Favoritos in Chandler about 7 years ago. Since that time, I have visited just about every restaurant in the valley and have found them to be consistently good. As with any chain, every once and a while you will get a bad meal but overall I cannot recommend a better place to get a breakfast burrito anytime of the day! Yes, they do serve other food but I have limited myself to the rolled tacos and breakfast burritos which, by the way, are big enough to squelch my hunger most of the day. I recommend the chorizzo, but your tastes may vary."}
{"text":"Wow, really yelp reviwers? I did not like their food or service."}
{"text":"Service was slow as heck. And trust me I've been to heck before. Took about 20 min after ordering to get food and all I ordered were two beef tacos. Food quality was sorta redeeming though. Also closed half the restaurant because they wanted to leave early so it was impossible to find seating."}
{"text":"Alright, So I do get the bean tostada. Its good. The red sauce IS warm, but it adds a nice flavor. 

On my first visit with my lovely wife, I tried to rolled tacos aka taquitos. They were a tad bit greasy and a little tough. 

We enjoy the place, just the right amount of food when you need something small!"}
{"text":"Hands down the best California carne asada you can buy! Even better enchilada style. Great carne asada fries. Great customer service and very friendly attitudes. One of my favorite Mexican food joints."}
{"text":"Great place. I have truly enjoyed everything I've eaten here and have been back many times. The only thing I don't care for too much is the service sometimes but other than that the rest gets all the stars. 
Carne Asda burritos are awesome as well as the tacos and rolled tacos. Haven't had anything here I don't like yet and will go back."}
{"text":"I have been told by several friends that I should try this place. I love Mexican food, do I was really exited.  However, after eating here I can say...If you like processed low quality ingredients... This is your restaurant. I believe all their good has either been frozen or comes in a bag. I know you got to keep your food costs down, but c 'mon.  My wife couldn't finish her food and she only ordered 1 taco. Their chips and guac isn't even made with real avocados. It's made from a pulps bag that you squeeze out. No bueno!"}
{"text":"I seriously love Los Fav's- I eat there at least three times a week, usually at the Ellsworth and Main location but I've been to McQueen. Their beans are exceptional, especially when compared to Filiberto's. Another positive is that they ALWAYS get my order right, unlike the Filiberto's just down the road. My mom and I always get sides of guac and it always impresses. We usually call in and pick up so I don't have much to say about the \"dining in\" experience, but it's clean (but not in that \"smells-like-Pine-Sol-and-ammonia\" way) and pretty much looks like your standard taco shop."}
{"text":"Great food overall. 

I usually get the Sausage or Chorizo breakfast burrito which both are pretty good. However, I still love Filibertos burritos more because they are bigger and tastier. But if you're down in south chandler, this is the place to go.

They are pretty quick here with making your food. Filibertos usually takes a while to make the food so this is where Los Faves shines."}
{"text":"If there was an award for best breakfast burritos in the world, these guys win!"}
{"text":"Forget the rest, they're busy for a reason, I just gotta learn to speak Spanish (they speak English, but it might seem more authentic if I can order in Spanish)."}
{"text":"Since my last review 3 years ago, I'm sad to report that along with the name change to Papa Chevo's, the quality here has declined as well.  While the fare from the days of yore had an appealing freshness and the flavorings for the meat were always good, it's all just buried in salt now; disappointing as we were happy regulars for many years."}
{"text":"Been coming here for years, love this place. My usual is the chorizo breakfast burrito and sometimes the California burrito. One thing that I notice is how they don't overly drench the food with oil making it greasy, like many other Mexican restaurants. Overall thumbs up, my go-to Mexican joint."}
{"text":"All other locations of Los Favoritos are great, but this is by far the worst tasting food of all their locations that I have been to"}
{"text":"It was just okay.  Hubby got the super nachos(carne asada), I got the carne asada taco meal, my son got a cheeseburger, and my daughter a cheese quesadilla.  The carne asada was bland but asa taco, it was good.  The nachos were not very good.  The shredded cheese taste like it was mostly processed.  My son only ate a few bites of his cheeseburger and my daughters quesadilla consisted of a four tortilla, shredded cheese, and butter.  It was very bland.  We brought the quesadilla and cheeseburger home for the dog."}
{"text":"I didn't have a life changing experience like most people claim with my burro (rice, bean, & cheese) but I appreciate the fact that the hot carrots I ordered were actually hot and not watered down. I also ordered an horchata and the cashier handed me an empty cup and apparently I had to fill up my own ice then hand it back to her so she can fill it up? Thought that was a little weird."}
{"text":"Their breakfast burritos are SO GOOD that our teenagers who attend nearby Saguaro High will leave the house early so they can eat here!  It's a small place in an aging neighborhood, but their food and prices can't be beat. Clean, quality, delicious!"}
{"text":"The Mexican food here reminds me of what I would find when I lived in San Diego. I love it! The carne asada burrito is delish. I've gone there a few times for a breakfast burrito and those don't disappoint either. The place is clean, service is good and, most importantly, the food is great."}
{"text":"For cheap reliable Mexican food, definitely the best place around in Scottsdale."}
{"text":"Los Fav's is so good the grocery store next to it goes out of business. The carna asada is way better then fili b's. Get the carne asada quesadilla with la creama."}
{"text":"They have all of the standard Mexican food options: tacos, burritos, enchiladas, tostadas, etc. But, for a counter service place, You can do better for yourself at several other places in town."}
{"text":"Lunch!  Always good and yummy! The best green chili outside of homemade. The staff has always been friendly. Service is fast!  Try it!"}
{"text":"1st time here, was recommended by one of the customers. from dallas, TX on business: time was around 6:30 pm.. 1) area is super clean, impressed 2) service is slow, even with a few ppl 3) no music in area, hey its latin food, right, lol Now the food: the tortillas are packaged, meat (carne asada, no flavor), pico the gallo, too much onions, beans are canned. tostada was humm passable, shredded meat, ok..  only reasons for 2 stars is the area is clean and the shrimp cocktail.. very good shimp cocktail.. i only wish i ate that 1st..    but if this is what arizona has as a (good) taco place, well allrightie then..."}
{"text":"This is my favorite taco shop in the valley. Food is delicious, place is clean, and the staff is amazing! Best taco sauce in the valley. I recommend the chorizo burrito(not greasy at all) , sopas and the carne asada burro"}
{"text":"You know all the fancy pictures with numbers by them to help you order what you want?  Well I guess they don't rely on those or understand what a Chimichanga should be.  I ordered #15 which shows a deep fried burrito (known as a Chimichanga) and received two deep fried tacos instead.  My order was to go, so my bad for not looking.  However, the gal at the register said my Chimichanga was ready, so clearly they knew that's what I ordered.  I'll give him a high mark for their rice and refried beans, which were excellent."}
{"text":"Good service. The daughter works the front and she is nice and works hard to make sure the restaurant runs well and is clean. 
The food is really good for AZ/MEX. Cheap. Carne Asada burrito is very good. Also, the beans are authentic. One of the best breakfast burritos around. 
Now, some people knock the location and decor. Well, I don't eat either one so I'l leave that to other raters ( my friends say I can eat a lounge chair in less than a minute). 
Nice people and quick to get your order out. Recommended by this mexican food aficionado."}
{"text":"I've been to Los Favoritos two times now.  I think their food is very good, but noticed that 2/2 times the beans & rice were cold.  Being that I am in the restaurant industry, the beans not being kept at the correct temp is a food safety issue - bacteria can multiply very quickly when not kept hot.  I did bring it to their attention, but not sure that they will do anything about it.  Other than that, I really like the flavor of the food, and it it much better than other places for fast food Mexican.  I hope they get the temp issue resolved quickly so I can continue to make it a regular visit!"}
{"text":"I absolutely love the breakfast burritos. Especially the ham egg and cheese with potato it never disappoints. The only drawback is the three sauce maximum on to go orders. I love me some red sauce!!"}
{"text":"It was decent, not as good as most of the burrito/taco shops that I usually go to."}
{"text":"I could live off of the following burritos: carne California, bacon breakfast, bean & cheese."}
{"text":"I love having Los Favs in the neighborhood! I love getting a burrito before they close at 11pm and then heading over to Tallyho to eat it with a drink. They have the best breakfast burritos in the area! I would go here any day over Fili's on Indian Bend for their burritos. And that red sauce is so good! (Not a fan of the green.) I got a platter with their sopes, which I didn't love because they were crunchy, but their burritos are 5 stars for sure."}
{"text":"I'm from Hawaii, & by far this place takes the lead in Mexican food that I've tried..."}
{"text":"Food was good but got a damn toothpick in my rolled taco meat. Not happy about it glad I bit into it."}
{"text":"One word, Awesome!  For a small hole in the wall taco shop they have some of the best burritos around.  Its my favorite \"secret\" spot lol, if you stop anywhere to find yourself a new mexican place, stop here!  Don't expect gourmet but expect great low cost meixcana food!"}
{"text":"Normally I have a good experience, but today I got two sausages breakfast burritos with wheat tortillas. Upon getting home I realized both tortillas were covered with mold. When I confronted the \"manager\" he mentioned that he had seen some with mold on them but continued to use them anyway. I was disgusted beyond belief."}
{"text":"Way better than Fili B's.  I love the carne asada fries with a side tortilla and making my own monster burrito out of it, covered with red and green sauce and let it sit for a quick minute to soak in all that flavor.  Son gets the beef taco and cheese enchilada plate, which is also very good.  Sometimes I'll get the Chile Relleno plate with a side tortilla and make a burrito out of that.  Only if I'm eating it at home though, as I like to add two over easy eggs inside the Chile Relleno burrito.  If you have never had an over easy egg with your Chile Relleno or on top of your enchiladas, TRY IT!!"}
{"text":"They are very rude. The lady that works at the register is very disrespectful and they food is nasty I would not recommend to nobody stay far away from them. If you ever want Mexican food do not go there you will regret it."}
{"text":"I've been here twice;  the second time was a second chance.  This would be a great \"authentic' mexican food restaurant.........if it was located in Kentucky..  No ill will to Kentucky, but they wouldn't know the difference between authentic mexican food and taco bell.  Hence, my review.  The salsa is completely watered down with no flavor.  Nachos, which should be pretty easy to authenticate....were taco bell-is with watery guacamole.  It was so disappointing, that I threw my food in the trash and went to Rienda's."}
{"text":"Been eating here since I was 5, inconsistently but None the less I am 16 now. Awesome place with delicious food that has great variety. Friendly staff and an overall clean environment with very little wait for food

My suggestions:
Carne Asada fries
Carne Asada California burrito
Pollo Asada burrito 
And to top it off some Jamaica juice"}
{"text":"Frickin love this place. Come here at least once a week. This plays is far superior to filibertos. Carne Asada is tops on my list. Wether it's in a burrito, on my nachos, or on fries..the carne Asada is the bomb!  My oldest son likes the bacon breakfast burrito regardless of the time of day. My youngest likes the quesedilla or bean/cheese burrito. Try this place. You won't be disappointed."}
{"text":"Can't say enough good stuff about this place. Clean, delicious, awesome people, always quality food. It's not really a sit down place but for to go mex food it's the best I've had.  We call this place the Taco Palace. 

Carne asada burritos and rolled tacos are amazing."}
{"text":"Great breakfast burritos! Not really a sit down place mainly for carry out. We frequent it for breakfast pickups. The enchiladas and rolled tacos are popular with my kids as well."}
{"text":"Best little mexican place in town - cheap prices, good size portions, very tasty."}
{"text":"Breakfast burritos are absolutely amazing. I grab them a few times a week on the way to work. The green hot sauce is absolutely perfect for me! Food comes out fast and fresh even when it's busy."}
{"text":"Other than work and home...this is my most frequent destination. Service is quick when I need to be. Food is alway delicious (although I dont branch out with my selections). I've gotten a number of co-workers addicted to Los Favs!"}
{"text":"While the food is really good; the service was absolutely the most abhorrent.

NEVER HAVE I NOR MY GIRLFRIEND BEEN TREATED LIKE SUCH WORTHLESS CUSTOMERS. NEVER!  

We arrived at 9:15am and at 10:00 am we had not received our order.  When I asked for a refund, no apology nor even an explanation was given.  No concern to recover business was offered.  The guy at the register did lean over and tell the guy that the order was waiting for about an hour.  He still had the audacity to ask if I still wanted my order.  ARE YOU KIDDING ME???? HOW ABOUT; NO!!! I WANTED IT BACK WHEN I ORDERD IT. 
 
What really strikes me is that they were so willing and content to give me back my money, it was the strangest thing I had ever seen, I have never been anywhere where a business is so happy to refund your money.  Usually, a business is trying to get the money not give it back."}
{"text":"This place is usually my jam.... Went tonight and got food to go.  Bean and cheese burrito tasted like fish. So disgusting, I couldn't even eat it. I called and was told the beans were just made and didn't taste fishy. If they're lucky I'll give them one more try... But most likely I won't go back (after years of patronizing the business), I'm so grossed out."}
{"text":"They have to best breakfast burros in town. The price is right and the service is oustanding. Not to mention the dining area is always clean and they are open late for those late night cravings!"}
{"text":"I love this place!  The food is great for the money.  I usually get the Carne Asada chips, but they have a lot of items on their menu which are also equally as good.  Cheap, fast-served Mexican food that tastes good!  Portions are large and very filling!
I guess another great plus, for me anyway, is that a semi truck can fit into the parking lot - I am a local truck driver and this place rocks!  There used to be a grocery store or something next to it, but has been closed down for a long time, the parking lot is great for large vehicles!"}
{"text":"The worst food poisoning ever!  My co-worker and I went to this place this past Friday to eat a burro. We both got sick!"}
{"text":"This is one of my favorite taco shops in the area... their breakfast burritos are silly good. 

They're no longer crazy cheap like years past, but still totally worth it. Feeling hung over? Try the flying saucer with beans and jalapeños and boom... right as rain."}
{"text":"I won't say this is my absolute favorite as the dishes they serve are pretty tex mex. No lengua here. BUT, the do have menudo every Saturday and Sunday that is an absolute winner in my book.

THE PLACE: it's in a strip mall, right between a bar and a cross fit gym. Makes me laugh every time. Plenty of parking, as it is a good size strip mall with a Basha's and a Walgreens. Place is clean, nothing fancy at all and kinda divey.

THE SERVICE: Fair and quick.

THE FOOD: My hubby loves the Cali Burrito, my daughter enjoys the Fish Burrito. They also serve breakfast all day. I especially love the Menudo on weekends, or if not that, then a Fish Taco plate. Did I mention the menudo is really good? I dare say, better than Carolina's -- that sometimes is all hominy."}
{"text":"Great Mexican food on a budget... They did change there name so make sure you look for it close. I had the nachos and the carna asada burrito way more food the I needed! I dined in and the staff was very nice!"}
{"text":"Love this place.  I go once a week. It is the best of the \"fast\" Mexican food restaurants.  You will never go to X-bertos again. And to comment on the other reviewer, I have been here well over 20 times.  Never once had cold beans."}
{"text":"I don't know if there is a better Taco / Burrito spot in Scottsdale.  This town is made up of 95% chain / franchised restaurants and the ones that are hole in the wall mom / pop shops are too.... well, Americanized.

I can't speak for Authentic Mexican food because I haven't been to Mexico, closest I've been was in California and this restaurant has come close to the burritos I would get from there.

Service is nice and friendly, food always comes out quick and well prepared.  I'm not expecting something that looks like Chipotle or Taco Bell, so I don't mind the mess inside of the burrito.  The taste is great, nothing fancy or similar to what is served around here.

The surroundings of Los Favoritos is a clean and friendly lot.  They reside in a friendly neighborhood amongst other good businesses.  The experience is always a good one as I've been here four times already, all at different hours and they have always been consistent."}
{"text":"Love this place! Went for my first time and fell in love with their California Carne Asada burrito, absolutely phenomenal. Also their Carne Asada fries are extremely delicious. Way better than Filibertos or Amados fries. I go all the time!"}
{"text":"They always get my order wrong or over-charge me. Something goes wrong every time I go to this place. After giving them a third, fourth, and fifth chance I've decided I'm definitely never returning."}
{"text":"This place has one of the best Breakfast Burritos in the entire Valley. I've lived in Scottsdale my entire life and never heard of this place until a few weeks ago. I'll knowingly make myself late for work and classes just to pick up a bacon or chorizo  breakfast burrito. I live 30 minutes away from this place and I will pass 50 other Mexican restaurants on the drive, but after one bite, It's absolutely worth going out of my way for. I'm a huge fan of Mexican food and many times a restaurant's food can feel \"half-assed\" but that is NOT the case here. You really can tell that there's some love put into Los Favs' food, no wonder they have so many regular customers. I'll be going here for the rest of my life."}
{"text":"The fact that this is only a 4 star rating is APPALLING AND OFFENSIVE. I've recently moved to Austin, TX and there is no Mexican to be found as delicious as Los Favs. If we come back and visit AZ, it's a must stop to get my fix. #3 & an horchata is the go-to. Shredded beef and homemade shells and the enchilada sauce omg I have dreams about it. Love love love this food and am hoping that they'll just open up a sister store in Atx. They'd honestly do really good there! Please guys?"}
{"text":"Didn't get a breakfast burrito but my food was ok. Didn't like the rice at all, tasted bland and a little weird. I didn't like how my plate looked a little slapped together."}
{"text":"This is the best chorizo breakfast burrito I've found in the south Gilbert area. The chorizo is fresh, not greasy and the burritos are excellent."}
{"text":"Close to our hotel we thought we'd give it a try. I got the carne asada quesadillas, my son got the carne asada fries and my wife got the taco plate. Nice portions at a reasonable price and the food was great. I would recommend."}
{"text":"The breakfast burritos here are always great, never disappointing. My sister likes the beef tacos she says they are amazing. I do have a friend that says the chicken tacos were very boring, but I give 5 stars just for the fact the breakfast burritos are always on point!"}
{"text":"I truly hope that the employees of this location and the owners of Los Favoritos read this review, but more importantly, take appropriate action. I really want to like this place. It's convenient to my house and the few dishes I've tried are pretty good for a chain mexican restaurant. I will say this is the only location I've been to but honestly, I'm afraid to visit others after the service we've received here on every single visit without fail. 

That being said, the customer service is without a doubt the worst my wife and I have ever experienced in a restaurant. We have both worked in the food service industry and know the importance of good customer service. Not only that, it's EVERY visit! And it wasn't just to us. As I sat once waiting for my order to come out, I witnessed the guy at the cashier  give every customer the same terrible service, time after time. It's more than just lack of service - it's a general lack of manners and common decency. Either he's just rude or he's too cool for school...a little of both I think. 

The front of the house staff are like zombies. Usually when you greet someone with a 'hello' or 'how are ya?' you get a response and a smile. Not here. The same goes for phone orders, there is a complete lack of professionalism and courteousness. I once walked in and said 'Hi. Do you guys have machaca burritos?\" After not greeting me back, the young man hit a key on the register without breaking his eye contact with me. 'What else do you want?\" he then said. ??!! I guess that's was a yes, and I guess I just ordered it! I could go on with the stories of unprofessionalism and all around rude, anti-social behavior but I won't. Most of these negative experiences have been with a young man and a young woman and on the weekends.

Owners - do something about this. Your average food alone cannot keep you in business for long with customer service like this."}
{"text":"Found a broken toothpick inside my rolled taco. Not kidding. Started chewing something hard and sure as Hell it was a toothpick. I ate here for years but will never come back. I'm lucky I didn't swallow it. don't take your chances with their obvious disregard for safety and preparation. Will likely consult a lawyer."}
{"text":"Customer Service Sucks!
When we ordered there was only 1 customer ahead of us, after we ordered there was a line of about 8 people.  It was taking a bit longer than normal even though she was handing out what we ordered to other customer.  When I asked her about my order, she gave me attitude and snapped at me.  We waited over 15 minutes for our order and not once could she muster up an apology.Pretty sad when it was my FIRST and LAST time in this taco shop.  Between her and the 2 cooks they did not get our order, OK no problem just apologize and get on with it, she refused.Her customer service skills suck big time.Would I recommend the place, yes... food is good but I would not recommend when she is taking orders to visit the place."}
{"text":"We went here based on Yelp reviews...bad decision. The cashier was rude, food was bland, and found hair in TWO  of the four dishes we had ordered. 

Cost was $40 for two cheese enchiladas, two potato and egg burritos, one carne asada burrito, one side of beans, chips and four small sodas.

 When we ordered, we didn't realize they didn't provide chips- no biggie, just went back up to the register and ordered some. Then, when I asked for salsa, the cashier looks at me funny and says I have to order that separate from the chips. Really? After her attitude with the chip \"situation\", we didn't bother mentioning the hair in the food. 

Bottom line- don't waste your time or money here."}
{"text":"Los Favs is by far my most favorite taco shop in the valley. Best flour tortillas! I eat here almost every Sunday. I always get the carne asada burrito and my mate gets the California burrito...and their freshly squeezed orange fountain drink. No other taco shop has comparable flour tortillas...they taste very fresh"}
{"text":"Not sure what the crazy lady below is talking about. I have been to this place multiple times as it is super close to my home. I usually get the rolled tacos or carne asada burrito. They are all pretty awesome, better than filly-bs. I never checked the bathrooms as the previous poster, but get real, sometimes things run out, deal with it. The food is good and thats all that counts. She probably had personal issues and noticed there was no TP after the fact so wanted to blast the food. I don't post reviews unless it counts, and this place does not deserve that negative review. If you get the guacamole and it is runny, send me a message and I will pick up your lunch via paypal, cause she is full of it."}
{"text":"Everyone giving this place bad reviews obviously has no idea what food should taste like. Everything I've ever had from this place has been fresh, delicious, and super cheap! It's basically my go-to for Mexican, now. I'm really glad I found this place."}
{"text":"Great homestyle Mexican food.  Great takeout alternative to burgers in the great culinary void that is South Gilbert.  Better than the surrounding locations (not sure why but this one is always better)."}
{"text":"As a hungry paddler fresh off of a full day of racing and heading blindly into another, I was ready to eat just about anything as long as it was fast.

The wait at another restaurant was excruciatingly unbearable so me and a few guys drove off to this restaurant one of us randomly looked up.

The restaurant was deceptively large considering the additional dining room adjacent to the kitchen/cashier. Now,  we didn't know anything about portions but I figured I couldn't go wrong with a chicken burrito. There were actually quite a few options for chicken burritos with different fixings but the lady at the register was very helpful when I was making the big decision. 

I ordered a standard chicken burrito and wasn't disappointed with the portion at all. It wasn't excruciatingly large, but it was filling all the same. I got through 1/4 of the burrito and noticed that something was off. The burrito was really salty. It was something I could only attribute to the lack of fresh salsa, but I'm sure there's more to the mystery.

The food was good, but the saltiness was just a little too overwhelming so I don't think I'll be calling this place one of my favorites."}
{"text":"I am a new fan of Los Favoritos Taco Shop. I am a student at Basha High School. Every other day I go into this place for lunch. The first time I drove by, it looked like they were close because no one was there. Next day I walked in and to my surprise they were open. I guess not many people like having Mexican food for lunch. I usually order a California burrito. I am a big Mtn Dew fan, and i was very happy to see that this drink was at the machine. It was great food, a lot better than something simple like Taco Bell!"}
{"text":"Consistent good cheap Mexican food. Everything is always good beans, rice, chips, rolled tacos, tacos, churros, horchata and  breakfast burritos. I call for pick up and they never mess up an order. Friendly people working there, convenient and delicious!"}
{"text":"Bean tostada and hot carrots are my go to here. Very good and fresh stuff. Clean environment, good staff. Reminds me of what Filbertos used to taste like before they got lazy."}
{"text":"They have one closer to the west side of chandler!! Got our usual carne asada fries!  Had a medium Horchata to quench the thirst! Super excited to have a better option on the west side of Chandler for some muy rico comida mexicana! Now once they have late night hours like the other locations, will be even better!"}
{"text":"My boyfriend and I shared the jumbo burrito, it was delicious! Definitely worth the wait. This was also my first time here. My sister in law had the supreme quesadilla and it was massive! We were all surprised. Will definitely come here again."}
{"text":"Favorite Mexican fast food! It's cheaper, cleaner and so much tastier than other places I've been! We come here very often!"}
{"text":"Good food, good people! My whole family has been coming here for weekend breakfast burritos for years. Definitely better then some other places and you don't have to feel guilty eating here because it's not open 24hrs lol. (College logic) idk why I keep moving so far away from them but I come in almost every time I visit Gilbert!"}
{"text":"I have friends that rave about this place is will say I love the fact that all guacamole can be added to everything! The cheese enchiladas were very good and I love me some rice. They had a nice set uo that was clean and they gave me both kinds of salsa without a hassle. I was alone lol. I preferred the red. It was very flavorful."}
{"text":"So much better than any of the beto's or berto's type restaurants, they have quality food here!"}
{"text":"So, tonight was my first time eating here. Driving away from the restaurant as I type this! My fiancé came here for lunch today with a buddy and then took me out for dinner! He loves the super nachos! And orders the extra nacho cheese on it! I wanted street tacos and got just that! I ordered a number 21, removed the onions and guac after I received my order because I'm dumb and didn't think to say take it off. But anyway. I was curious about the grilled chile peppers and I had to pay $.32 which I thought was dumb until she brought it out! Oh my god!! It was like 3 cut in half! Hot and freshly grilled! Absolutely delicious! It had me sweating and crying! If a chile can't do that, I don't want it! First time coming and definitely coming back!!"}
{"text":"This spot is always a last-minute dinner option for my fam. It's location is convenient and they whip up their menu options quickly. Average food taste, service, and prices, so I'd say this place is A-Okay."}
{"text":"Pretty darn good! I went on a Sunday afternoon and the place was spotless. I was promptly greeted by the cashier behind the counter. They have a picture menu to make the ordering process easier. I had the machaca plate for about $7 it was freshly made and served with a warm tortilla. The beans and rice were okay but were easily elevated with salsa. I'll be back here soon to sample the rest of the menu."}
{"text":"Good food. I like their carne asada. Service could be better. I have had them mess my order up a lot but unfortunately I don't notice till I get home sometimes. I just wish they would pay attention to detail more on the orders."}
{"text":"I came in with my buddy, I wasn't very hungry so I just ordered a Cheeseburger (at a Mexican restaurant right?) was pretty good. My buddy ordered a Chimichanga and it looked amazing, fresh quality ingredients in both of our foods. 

So good food. 

There was a mistake with my order, they had given me a Quesodilla with bacon instead of a Cheeseburger with bacon. I ended up asking for a box as I was just gonna save it all for breakfast, and went to re-order my Cheeseburger and told her I was more than happy to pay. They had still given me the Cheeseburger on the house. 

Food and service like this will bring me back. 

A huge thank you to Nancy. People like her can make all the difference."}
{"text":"My fav go to for fast, authentic Mexican.  Love the chorizo breakfast burrito and the super nachos are great too!  Its fast and always good!"}
{"text":"I've been here more than 20 times and the experience is always good.  If you want breakfast burritos for dinner - no problem.  Just ask.  If you want the stuff in the tortilla on a plate and have them HOLD the tortilla - just ask.  It will be done.  All beans and no rice - done.   All rice and no beans - done.  Whatever - they just roll with it - \"yeah we can do that\".  

Stand back and watch the family working with big pots of food and a flattop sizzling with seasoned meats and you know you're getting real food - freshly prepared - from recipes that have been around for a long time.  

I've never had a bad meal here.  It's priced right, fresh, quick, and the people running the place smile, say hello and genuinely seem like they want you to have a good experience.  That's not always the case these days.  So I will keep going back."}
{"text":"Definitely a regular here. This was a great quick stop for any situation, here I would recommend any of the breakfast burritos that are available all day, and also the carne asada burrito is superb, if you aren't as hungry go with the rolled tacos, great filler that comes with some bomb guacamole. This place never disappoints. In my opinion this location on chandler heights and gilbert has better slightly better tortillas than its partner papa chevos on queen creek and Val vista, but both are still very satisfying."}
{"text":"Not even going to lie. I'm only giving this place a 4 because of one item on their menu and it's  their absolutely magnificent breakfast burritos. Now I'm no stranger to breakfast burritos but damn these are good. I can't say much else is great, but from what I've heard its good affordable food (except for those heavenly breakfast burritos). Also, their green sauce is tasty as well."}
{"text":"Comments of \"Los\" have been rampant throughout my school and I would always hear about their breakfast burritos, beverages, and tacos. At first, I was confused why there would be food at \"Lowes,\" but when I realized the food came from a Mexican restaurant, I became curious. Obviously the food was good because many students were willing to ditch class to get their burrito fix for lunch, but I had to try it out for myself. 

I went with a few friends to survey the place out. The fast food restaurant was small, but it was perfect for our gathering. The convenience of the location on a main road and near a local shopping market gave the place many regular customers. When you walk in, the first thing that comes to view is the large painting of a cartoon Mexican man, which appeared to be the logo. The overall close quarters and decor added to the warm charm it exuded. 

The menu appealed to different people with different tastes, as there were vegetable, fish, chicken, and beef options. I decided to go with the \"Carne Asada Burrito,\" which a friend had recommended to me earlier that day. The service was a little slow because of the lack of employees, but that could be disregarded because once I took a bite of the burrito, I was hooked. I had the opportunity to try it with a green sauce that the worker suggested and it enhanced the eating experience. 

Although Mexican food is not a favorite of mine, I was surprised at the fresh quality because it was a fast food restaurant; Los Favoritos even beat out Rubios', another premier Mexican restaurant. I hope to become a regular and next time, treat my family to the burritos. The price is not too costly and is a fantastic place to take your family, friends, etc. I can almost guarantee that the food will have you returning for more."}
{"text":"Breakfast burritos are awesome. But you may be visiting the porcelain thrown more than you want to afterwards. Hidden location forces you to compete for parking with a far more popular bar next door. Staff is pleasant but they don't normally make me feel warm and fuzzy."}
{"text":"The food was just okay, I have had much better from many taco joints.  I am rather bummed because this place is not far from where I live.  

My sister and I ordered chicken, carnitas, and carne asada tacos to share.  The carne asada was the best of the 3, but nothing to write home to mom about.  The carnitas was overcooked and crispy/burnt/dry.  The chicken taco was pretty good, but again nothing exciting.  The sauces (green and red salsa) were not very spicy and rather blah.  I can say the service was very fast and the prices were cheap.  Most of the tables were not cleaned off in the restaurant.  Also, we ordered everything without guacamole and that seems to be their claim to fame, so maybe we are a bit biased and missing out on the key ingredient.  

I will be back if I am in desperate need of a taco nearby, but I will hopefully find a better place before that desperate moment occurs."}
{"text":"Outstanding Mexican, local gem. Chorizo breakfast burro is BOMB. Machaca bfast burro if you're looking for a lighter option. These are probably the best breakfast burritos I've ever had - so tasty. Fam loves the carne asada, also lengua tacos - delish. Menudo available on weekends ftw!

Super friendly staff, fast service, great price. Highly recommend."}
{"text":"This is my Spot!

Great hole in the wall style Mexican joint with great food!

better then Filberto's by far!!"}
{"text":"I love los favs!!! Always the bomb! I eat there like 3 or 4 times a week!"}
{"text":"WORST LOCATION EVER! I am never one to write bad reviews but after time and time again of crappy service I felt that this review was needed. I love Favs don't get me wrong. I go there quite often and I have been to almost every location too, but with that being said, I have NEVER got the same service I get here at any other location. 1. They are RUDE, VERY rude. 2. They are greedy, VERY greedy. 3. A to go order take longer than a sit down order and it can be something as simple as a quesadilla. I have waited 15 minutes on an order before. 4. They seldom get an order correct. Given that I work down the street they lost a very valuable customer. I went from going 1-2 times a week to deciding to never go back again. I sure hope this location changes the way they are ran or I don't see them lasting very long."}
{"text":"This location has really improved.  Spotlessly clean and service is excellent! Orders come out fast and if eating in, be sure and ask for squeeze bottles of salsa.  Red is \"hot\" and green is not.  Lots of good menu items to choose from including \"vegetarian \"."}
{"text":"Basing these 5 stars on One visit and one carne Asada burrito combination plate, but because this was the first carne Asada burrito I've had in I can't remember how long that didn't have fat and gristle in it, I'm rating it a 5! The meat tasted great, and included avocado and pico de gallo. Beans were good and even the rice was above average. I'll definitely visit again. 
Small strip mall location, but very clean and reasonably priced."}
{"text":"I love this place.  Ever since they opened up by my high school, the food has been awesome.  I get the same thing every time I go, which is the Carne Asada California burrito with red sauce.  The Chorizo breakfast burrito is also very good.  I just wish that they sold the red sauce in bottles because it is the best sauce I have ever had."}
{"text":"One of the best breakfast burrito ever. Really good taco shop food. Everything is very good."}
{"text":"I ordered the carne asada fries... Disgusting... The fries were fried last month and the rest was cold... I got a quesadilla for my step daughter and they gave me a cheese burrito... Don't waste your money drive 5 more min and go to filibertos. Sad but true"}
{"text":"The customer service was good. The lady behind the counter was very nice. Unfortunately we were not too fond of the food. I ordered the enchilada plate which wasn't bad actually but I've had better. My kids got the taquito plate to share. They ate maybe half of one each. They were pretty bland and definitely lacked flavor so I didn't blame them for not eating them. Maybe I set my expectations too high since it had pretty good reviews..."}
{"text":"I ordered a bunch of stuff, quality is cheaper and worse than Filibertos. I had to give my chicken tacos to my dog. I've never seen such dry chicken, i almost choked."}
{"text":"Always fantastic!! My go-to's are the rolled tacos and breakfast burritos. Carne asada fries are awesome and a guilty pleasure. Also really like their cheese enchiladas combo meal."}
{"text":"Delicious carne asada California burrito.  Found this place via Yelp and my fellow Yelpers did not steer me wrong"}
{"text":"I was pretty excited to try this place because of the reviews but I was firstly turned off because they don't have a kids menu. My husband ordered the jumbo burrito with Carne Asada. The meet was a bit bland and not much flavor. The salsa they give you also wasn't very good. It looks like they got Pico de Gallo and put red and green salsa on it. While I got the green Chile plate. My food was good. But the smell of the place just takes your appetite away."}
{"text":"Really good tacos, it's been a tad inconsistent though.... sometimes the tacos are AMAZING, then other times they are just good. Overall really tasty for the price."}
{"text":"Love authentic Mexican food. This is not! I stopped by a couple of days ago and my son and I ordered the carne asada burrito. meat was very dry and flavorless. The service was okay and should probably given it a 1 1/2 star but it was not available.
Sorry but this is not authentic."}
{"text":"Great food! Good service, it does get busy at times.  My two faves are the chirizo breakfast burrito and definitely try the horchata!"}
{"text":"Decent place to get quick mexican food.
Breakfast burritos are the best thing there. The rest is ok not bad but not that great either.

Salsa are decent, no salsa bar."}
{"text":"Burritos are getting smaller and smaller. So sad because we've been going to los favs around town the past few years. One of the tackiest things now is they limit the hot sauce to 3 per burrito.  How cheap can you guys be? Wife and I laughed so hard that you are trying to limit the sauces. Its simply the cost of doing business.  If people abuse then make it a limit of 8 per item so u don't have to dump a bunch for no reason. Next thing you will do is take all the spoons napkins and salt/pepper and place them behind the counter....can I have some napkins?  Umm no sir those are 20cents each....next thing will be 75 cents for each debit card transaction.....our family will not return.  Thanks so much!"}
{"text":"Bean & Cheese Buritos at Los Favoritos are delicious."}
{"text":"This is one of those places that was a staple of the ASU student diet when I went there in 2011.I came from Los Angeles, born and raised on at least 3 different styles of taco, and this place's asada street taco was just what I needed when homesick. 

I have since moved to North Scottsdale, but having a weekly taco requirement, I used any and all excuses to eat Los Favs in Tempe when I would visit friends. You would too- have you ever heard of another place where GUACAMOLE is standard on a street taco? I thought not. 

The Scottsdale location delivers everything I loved about the Tempe location, but it has been way less crowded every time I have visited. I have never been unhappy with my meal here- from tamales to street tacos, everything is perfect. Kind of reminds me of the places I grew up on at home!"}
{"text":"This place is great! I got the carne asada California and added bean and sour cream. It was a great burrito! Filibertos does not compare to this place. Go and find out for yourself. I dare you!"}
{"text":"Today was my first time here, and I'm sorry I didn't read the tips and reviews first. I think I would have ordered one of their famous burritos. Instead I ordered two fish tacos. I'm not a fan of breaded and deep fat fried fish ..... brought me back to the days of semi-soggy fish sticks that my older sister used to make because that's all she knew how to cook. However, I am thankful that I ordered the chips and salsa. The salsa was amazing. I look forward to giving this place another try because it's very conveniently located for me and I love authentic Mexican fare. Worth a second chance for sure!!"}
{"text":"This place used to be better. Bigger portions at a better price...and more tasty. Sadly it has lower quality than it used to. I wouldnt mind paying more if they kept the same quality. Oh well, now I eat there maybe twice a year."}
{"text":"I had a chimichanga and asked for shrimp instead of beef. It was $3 extra. The lady at the counter told me it was expensive, but it was worth it and what I'd pay for the same thing in Hawaii would be significantly more. I'm home now and can't stop thinking about my next trip to az  so I can come back to this place. It was a huge meal. Guacamole on one side and sour cream on the other. SO GOOD."}
{"text":"Had some success with the most basic of items - the breakfast burrito. Mine just had potatoes, eggs and cheese, so it was hard to screw this up, but it also tasted good. I can suggest a side order of pico de gallo for about a buck which was fresh and full of onions and tomatoes. The green sauce has a better bite than the red sauce. The guy taking orders was funny as he only takes his earbuds off right when you order, but then puts them right back on. If you need a safe choice, get this item."}
{"text":"Just came from eating at Los Favoritos tonite. First time eating there in the evening. I've eaten there many times during the day. I ordered the same thing I get at lunch. ...two chicken tacos. Tonite the chicken was not fresh and I ordered chips and guac. It was a diluted version of a true guacamole.  Neither my husband nor I felt good afterwards. Day chef is far better."}
{"text":"Nice customer service and employees. A little dirty that's the only reason I'm not giving them 5 stars. Food and prices are great. 

Thank god its close to the house."}
{"text":"Frequent Los/Papa Chevos customer. Somebody fudged up the last batch of green sauce at this location. Was basically green vinegar water with little/no taste. Fix the green sauce please :)"}
{"text":"Great fast clean taco shop!

I have been coming here for years when I just want greasy carbs! They are always fast, to the the point and very delicious!

Sometimes it does get crowded but the wait is never too long. Everyone in the neighborhood is a fan I swear! 

Much much better than any Filiberto's!! Or any bertos' !!"}
{"text":"Yum!!! The fish taco was not fresh and flakey but the green enchilada,  beef taco and carne asada fries wee delish...bonus was the great hotchata...we will be back!"}
{"text":"This place definitely has the best breakfast burritos in the area. They're cheap, authentic, and pretty much always on point. I've tried their bacon breakfast burrito (which is stuffed with a load of bacon, eggs, cheese, and potatoes) which runs for about $5 and will keep you stuffed until dinner time. 

Their little complementary hot sauces are kinda bland. You have the choice between red or green, and they're both pretty watery and aren't spicy at all. You might as well just eat your food without the hot sauce so you don't contaminate the good stuff. 

The workers have always been friendly when I've gone, and your food is usually done within about 5 minutes or so unless the place is packed. I love Mexican food, and this is definitely the place to go when you want to stay in the area but have some tasty food nearby. I don't know much about their other food items, but the breakfast burritos are sure to please."}
{"text":"I have been driving to chandler this entire time now i have found a closer one. Thank you lord!! This place is great for breakfast I usually do the Machca burrito and add potatoes or I got with tacos.  I pretty much have started working down the menu and haven't been disappointed beats filbertos any day."}
{"text":"Love love love this place! Everything is amazing and more people should stop in! Breakfast burritos with or without potatoes is always tasty and fresh. Green salsa is perfect!!!
Carne Asada fries are the perfect late night treat!"}
{"text":"This is my breakfast stop. 
I am a huge fan of their country burrito, I always add sour cream to it. 

When it's lunch time or a late night craving, I almost always go for the rolled tacos. Extra guac and sour cream. 

The only reason I'm dropping a star is due to the fact they can be incredibly slow. I've waited as long as 20 minutes for my burrito in the morning, and it wasn't even that busy. At least the food is always consistent and tasty, even if it takes a bit longer than it should."}
{"text":"Hot sauce is amazing. The cashiers have always been nice and the food is great. I've been to a few of their other locations and while the food is consistently good between locations, the service here is excellent. It's also really clean, which I think everyone appreciates! They seem to be cleaning every time I come by...."}
{"text":"I just moved here from St. Louis. This was the best breakfast burrito I think I've ever had. It tastes like a rainbow in your mouth. No exaggerations. You have to eat one no question. 

-Amazed midwestern guy"}
{"text":"Love this place had a burrito and rice and beans. Going back soon to try out their tacos."}
{"text":"Nobody speaks English well enough to get the order right. The pico De gallo is all onions with one or two flex of tomato and cilantro. Everything is made very cheap with no quality ingredients.  There wasn't a customer in the place but every table was dirty. Makes me wonder about the cleanliness. My advice...go elsewhere."}
{"text":"Just had that the taquitos and they were delicious. I I had the shredded beef taco plate the other day and it as well was delicious AZ weather rice and beans"}
{"text":"This was my very first visit ever, boy was it delicious! I got enchiladas and hot carrots, I can't even remember the last time I was able to order hot carrots!! I took it to go because frankly I was tired and wanted to take my shoes off, but had I stayed, I'd have been super pleased with my visit. The restaurant was very clean. The staff was friendly and attentive. I'll not only recommend, but I'll be back with friends!"}
{"text":"I always order the California Carne Asada burrito for breakfast, lunch, or dinner.  Don't bother calling because they are always busy and they take care of the customer that are there first so just grab the car key and drive.  Very friendly staff but just like I mentioned, very busy.  Prepare to wait for about 10 min or maybe just a little more but the food that you'll get is very good and very affordable.  Don't forget to order the guacamole and chips and maybe an orange Fanta to top it off."}
{"text":"I absolutely love this place! I live down the street and come here constantly. I'm definitely a regular and they know me whenever I come in. I usually order the Carne Asada burrito, the bacon breakfast burrito, and the bean and cheese burrito. They're the best with the salsa Verde they have! I've also had their menudo which is house made and amazing but only made on the weekends. Try it if you get the chance! I've also have had the supreme qusadilla which is very good too. Only very few times have my tortilla on my burrito be a little crispier than I wanted or only getting a few salsas when I wanted more but other than that I go to this place whenever I'm hungry and looking to get full off $5!"}
{"text":"This has become my favorite Los Favs in the valley,  mostly because it's big,  and very clean.  

The restrooms were accessible and the tables left a lot of space,  you didn't need to sit in your neighbors lap. 

I would have brought my grandma here if I knew about it sooner,  she had a little buggy and wouldn't have felt cramped in here at all.  

The food was delicious and was made to order,  it was hot and tasted fresh,  well my hot carrots were cold, but that is the proper way to eat them.  

Hub gets a burrito or tamales.  
I change my mind frequently,  I like that they have a zillion options."}
{"text":"Very similar to Filibertos in price and quality. Good with mass quantity. The place is small, and pretty simple."}
{"text":"This is the best place anywhere for breakfast burritos! & they are super cheap too! It's a win win!"}
{"text":"We ordered 2 beef tacos and 1 chicken taco.  All 3 were cold and soggy.  The beef were all lettuce and cheese and very little beef.  The chicken was slightly better with more chicken.
We also had one burrito supreme.  It was ice cold soggy and very little beef. It seemed like it was mostly a cold soggy flour tortia with mostly lettuce and cheese.  Overall a bad experience."}
{"text":"Los Favoritos is one of the best Mexican restaurants I have visited.  The quality of the food, customer service, and cleanliness is excellent.  Their menu is very similar to other taco shops in the valley, but the quality of the ingredients is much higher.  The toritllas are fantastic, their hot sauces are excellent, and nothing harnesses the power of a green pepper like their Machaca burrito.  All of their breakfast burritos are very tasty, and it's a great place is to visit in the mornings before work.  They open at 6AM and close at midnight, and even have flat screen TVs to entertain their customers.  It's a must try for anyone who is a fan of Mexican food.  I now understand why it's called Los Favoritos."}
{"text":"Love this unassuming Mexican spot! Nachos are the best and can last you for two meals. Plus it's close to my office for easy carry out. Carne asada is to die for! Just wish they served Coke products and I'd be there everyday!"}
{"text":"First time at Los Favritos for lunch today. Arrived at 3:00 PM on a Saturday and had the place to ourselves. There was WWF on tv, not exactly a digestive fit but whatever. 

My wife and I each ordered the #5 combo: two shredded beef tacos. They come with beans and rice. 

The beans were awful, right out of a can with zero flavor. I'll skip those next time. The rice was okay. 

My wife enjoyed her tacos but mine were very, very oily. It wasn't beef juice, it was oil from frying the shells. I had a size able pool of oil on my plate which killed my appetite. I also wish they had better liquid offerings. 

These guys are trying to upstage Filiberto's but will need to try a lot harder. Not even close. 

I had the burrito at another Favritos years ago and it was very good so I'll go that route next time I visit."}
{"text":"Los favs is always a good time. Short wait time, Love the California carne asada! The sauces are the highlight, between the green and red is a toss up. Good prices, will be back as soon as possible (:"}
{"text":"Best burrito shop in the area. Amazing breakfast burritos and an awesome shrimp burrito. 
I have yet to have something bad here ever."}
{"text":"I ordered the Burrito Supreme \"beef' and the Enchilada sauce was OVER SALTED.  Prices are decent....but there is no open salsa bar, so they nickle and dime you on condiments. Carrots and Jalapeno bag cost me $1.50."}
{"text":"Food: I have been eating here since the 8th grade. This place is definitely a guilty pleasure. I generally get the carne asada burrito or the California burrito, both are great. Furthermore, these burritos are about 5 dollars and are HUGE; you will always get your moneys worth here! Since I have started eating here the quality, food, and service have stayed the same. I actually am Hispanic and I personally find their tortillas to be amazing. If you're looking for gourmet Mexican this is not for you! However, if you're looking for better quality fast food Mexican this is awesome. It is about the same price as Filibertos but WORLDS BETTER! (Quality from location to location is always great)

Service: It is primarily Hispanics working here and for someone who is not Hispanic it can be difficult to understand them from time to time, but they are always friendly. This being said the food is authentic and I Have yet to have an incorrect order in 8 years.

Location: Its the strangest thing I have began to notice that the majority of Los Favoritos are located in Bashas plazas. The location is nothing fancy its just a hole in the wall, but worth going to. There is not much seating, but take out is always an option."}
{"text":"OK I guess. I don't see why there is so many people driving around with Los favs stickers...its not that great!"}
{"text":"Yummy! Food is great, venue ... not so much. It definitely looks like a hole in the wall in the middle of a strip mall. Food is delicious and the place doesn't look super nice. But again, when you go to get food, you mostly only care about the food.

I love love love their tortillas here. It's warm and doesn't taste like it's out of a plastic bag that you'd get from costco. The carne asada is also very good here, great quality. I ordered the Carne Asada California which is simply a carne asada burrito with fries in there. I also had some of my friend's carne asada fries. Both were really delicious, but I'm a fan of thicker fries when it comes to carne asada fries (in the burrito, I like it thinner). So really no complaints on the food. It's cheap. And if you are REALLY hungry, they have a Jumbo Burrito which is half carnitas and half carne asada for 8 dollars. Such a steal because it actually is.... really huge. Salsa was also very good, flavorful and had a nice kick to it. Staff is friendly, no complaints there. 

I wasn't a big fan of the venue at all. It's beat up, the dining room and furnishing are all really dull and the bathroom has graffiti all over the walls and is dimly lit. They have a couple of old video games and some old pool table there, too. Seriously needs a make over.

So come here and take it to go. Eat it at home or somewhere else where you can actually enjoy the surroundings."}
{"text":"After visiting some shops next door, we had a random craving for Mexican food at 9:30 in the morning.  We were gonna go to one of our favorite's, Julia's, but decided to also give his one a try.  We got Los Favorito's carne asada taco.  IT IS HEAVEN IN YOUR MOUTH.  The meat is so perfectly savory and quite a bit for a small taco.  The guacamole and veggies add a perfect mix of soft and crunchy.  The green sauce was delicious.  It has a kick but not so much as to leave you in need of water like the red sauce.  And the staff were friendly and great!  

Visit this location at least once before you die, and your taste buds will thank you."}
{"text":"Love this place. My favorite taco shop. This is a busy local stop for good reason. I moved into a nearby apartment in Gilbert when I first came to the valley to be close to work until we found a house. I was so happy to find a taco shop that served great lengua burritos! Also, the weekend menudo at this location is some of the best I've found in the area."}
{"text":"Best menudo in town! Never had bad food and the service is always quick and efficient."}
{"text":"This was our first time here and I'd give it 3.5 stars, because despite the food being pretty good, the service wasn't great, and the restaurant itself was grungy.   I don't care how busy a place gets, the tables and soda soda fountain need to be wiped down between customers."}
{"text":"Great Food. This is the first time that we eat here but it won't be the last. We usually eat at other similar places and we spend more money there for the same amount of food, the prices here are lower."}
{"text":"This place is so bad on getting orders correct.  Not sure why I keep coming back here.  Ordered 3 burritos, drive home, 1 mile away.  All 3 burritos were wrong and the food was cold.  I have to say, I am done with this place.  Alfonzo's on Gilbert and Queen Creek, gets orders correct, food is hot, better pricing and the burritos are bigger."}
{"text":"Los Favoritos is an amazing no frills taco shop! The food is always consistantly good and the staff is usually decent. Love the Chicken California. The menu and prices are very similar to Filibertos, however the place is a million times cleaner and I feel safe eating here. Grab a burrito here, you won't regret it!"}
{"text":"LOVE this place. It's a little hole in the wall, but the service is fast, the food is hot and flavorful, and the place seemed really clean.

The chicken tacos are very juicy.  I wasn't the biggest fan of the quesadilla, but my daughter loved it."}
{"text":"How is this place not more popular?  Loved it!  I grew up on the border of Mexico and as one of the only white girls in town I loved sleeping over at friends houses.  My mom was a horrible cook and my friend's moms, we will just say they knew their way around their kitchens.  There were always fresh tortillas and a pot of beans on their stoves.  I begged my friends to feed me nearly every day.  Mexican food is always better than my mom's famous dinner of Kraft Mac and cheese.  By the time I was a teenager my palate had developed and I was a mexican food snob.  

Surprisingly, border food is hard to find in Phoenix.  Sure, there are a crap load of filibertos and you can't shake a stick without hitting a Mexican food restaurant.  But a place that tastes like you just drove passed customs, now that's hard to find.  

This place hits the spot.  I got the carnitas (marinated pork) it was crispy on the outside and juicy inside.  Delicious!  My New Mexico raised partner went for the green chili pork and he really liked it.  

But my favorite part was the Hispanic \"mom\" who came out and greeted us when we walked in.  Her broken english and her sweet demeanor took me back to my childhood.  I felt like I was visiting her home.  And the cleanliness of the place far surpassed any restaurant I have EVER been to.  The floors were spotless, and so were the tables and bathrooms.  I would have gladly eaten my carnitas off of any surface in the place.  I may or may not have picked up a piece of pork that fell on the bare table and ate it.  

We were visiting this part of town so I won't be back immediately, but I will definitely come back.  So for those of you who don't want to eat the cafeteria food when you visit Ikea, come visit this place.  It will kick those Swedish meatballs in the, well, balls."}
{"text":"This is my go to taco shop. I have only ever had burritos here but they are amazing and consistent. I get the same thing every time but I know the rest of the menu is good because it's a favorite of my coworkers too."}
{"text":"Very authentic! My family loves this place! We've always taken it to go. Great food. I love their burritos and their taco salad. It's huge! Definitely 2 meals worth!"}
{"text":"I have been coming here for years, and I have always had good experiences. But, lately the customer service is lacking. I called twice before I came and there was no answer. I always try to place my order early because weekends tend to be busy. Well when I got there, there were 3 young adults standing at the counter joking around. Not one of them could answer the phone? And then I was standing there and not one of them said anything to me. I moved closer to the counter and the young girl came to the register."}
{"text":"This is the definition of kitchen nightmare! I had to beg my sister to come here with me and I wish I hadn't. The cooks were outside smoking and the lady working the register had to go outside to tell them to come back inside to do their job. They should be shut down for health regulations. I will never go back. 
Go to Fiesta Burrito instead!! Sooo much better!

I literally downloaded the Yelp app just to write this review because how much I loathe this location now."}
{"text":"Best breakfast burritos around!! Make sure to order extra egg because for some reason they scrimp on the eggs.   Love Los Favs!!"}
{"text":"Food was pretty good!    I got the chili relleno and cheese enchilada combo.    Prices were good.     I didn't love the chili as it wasn't soft and fully cooked.    It was a bit tough.    But flavor was good.     Loved the beans and rice.    

Daughter had a breakfast burrito and liked it.   

Only bummer was that they didn't have fresh brewed ice tea, only sodas.   

Overall it was tasty and I'll probably go back and try something different."}
{"text":"Best torta sandwich I've ever had!!

Staff isn't very friendly, but the food is really good.

Been back multiple times......YUM"}
{"text":"Wow great and fresh !! One of the best burritos I have ever eat..price will kill any competition especially because they are quick and great service.. all the way from Dallas in this spectacular city !! U guys rock!!"}
{"text":"I have been here many times for business, i usally stop in the am and get about 15 breakfast burritos for a clientele office that iam going to visit. beat if you call ahead for orders expecially large ones.  i personally havnt eaten their food until yesterday but my cliental rave about the burritos that I bring in.  i stopped to get mom a sausage burrito with egg cheese, and tried to go with a potato beans and rice for myself.. made it a point to say a few times no cheese or egg.   line was long and as usally took a little while (expected) got home took a bit and CHEESE gahh... i dont live far so if iam going to pay something like $7for a burrito i wanna eat it... it was even busier and I figured a hassle..  the lady that took the original order took it when and talked to the back and I had a new burrito in 5 min or less. ;). yay!     burrito was very good and their salsa was too...  a little pricy on something, a bit if a wait to get your food but worth giving it a go"}
{"text":"Are here today ordered some carne asada fries and there was a rock in my food. Like legit a rock."}
{"text":"This is my favorite place to eat in the world!!! Several times a week in fact. Always amazing and fresh. This particular location is better than the others for some reason. Could use better air conditioning and more cheese on their rolled tacos. That's about it! Love this place!!!"}
{"text":"It's pretty good. Authentic and good but kinda bland at times. A little bit stingy about their sauce. I think my friends hyped it too much for me. But they have decent breakfast burritos"}
{"text":"Great place. Not greasy like other Mexican fast food places. People are very friendly. I go there 2 times a week."}
{"text":"Smaller location than the one I'm used to on Chandler and Dobson... but AWESOME just like the other one. 

REALLY enjoy going there for breakfast and paying $3.95 for a chorizo burrito that keeps me full long past lunch. I don't normally go for chorizo at a lot of places because I think there's some low-quality stuff, but this is a must have.

Lunches are also good... definitely try to hit their special (...which seems to always be the three rolled tacos, rice and beans???) because you get a meal and a drink for $5. Can't beat it. Lots of other, more expensive places around (Moreno's, El Palacio, etc.), but I'll take this one just about every time."}
{"text":"My boyfriend & I were looking for a good Mexican restaurant to eat & we found this place. Let me tell you, it's DELICIOUS & is real Mexican food great service & is recommended"}
{"text":"Breakfast burrito. 
We have made it a Dang! Fine Rentals tradition to eat them before event load in shifts. They are soooo good !"}
{"text":"The food is good. We always get one of the following: bean & cheese burrito, California carne asada burrito, and carne asada fries. Only once have I had an issue with quality of food.
However, the staff has a serious attitude problem. I dread going in when there is \"the woman\" at the register. She always has a scowl on her face and treats us like were are the dirt beneath her feet and she's doing us a favor by taking our order. It definitely takes their rating down in my mind."}
{"text":"The food is delicious here! Its one of the better Mexican fast/sit down places. The burritos are to die for and the staff does their job efficiently. It seems like every time I go in there there's always someone cleaning too. The price is not bad for the food you get. It's great take out. Its a place suitable for a family."}
{"text":"This is a dependable place with fast service and tasty food for a quick pick up dinner!"}
{"text":"If you want fancy high end Mexican food (that isn't very authentic) don't eat here.  If you want homestyle Mexican food that isn't fast food (a la Filberto's) then this is the place you have been looking for.  They have a number of locations and all of them seem pretty consistent.

The breakfast burritos are fantastic but everything on the menu is good.  This particular location doesn't have a lot of seating, but the take out service is good.  Looking for a meal to bring home.  Los Favs has you covered."}
{"text":"Today I stopped there for the first time. I had some tacos, including the shrimp tacos and the Carne Asada. They were simply awesome. I know, that I will be a regular in that restaurant."}
{"text":"One thing I forgot to mention - although the food was barely \"OK\", their hot sauce was quite delicious.  Very flavorful and good heat to it.  Yum.  Now if only their food was good enough to put the hot sauce on..."}
{"text":"Good tacos. I'm a picky Mexican food eater and I don't mind their food. Nothing GREAT but I wouldn't complain. The prices are pretty cheap considering the quality, freshness and authenticity of the food

I've heard many rumors that they always barely pass their health codes. Uh oh!"}
{"text":"Always super clean! The food is always delicious and made in a timely manner. The staff is always really awesome."}
{"text":"Über Bomb.  This place has 3 things going for it. Consistency, Consistency, Consistency. If you like fresh authentic, then this is the place for you."}
{"text":"This should be 2 1/2 stars. Dirty inside ... ALL TABLES WERE DIRTY..she did come and wipe one table down right off on to the bench seat and floor and it wasn't just a little bit of food. Not sure why only one table. The  same lady took our order and was not overly friendly. When you pay they ask for a tip really for what they don't serve you it's like a McDonald's ok maybe not McDonald's wipes there tables down. I will say the breakfast burrito was not to bad.."}
{"text":"Food is average, service is poor to mediocre and the wait time is outrages 40 minutes for carne asada nachos.... no bueno!!!"}
{"text":"Inexpensive delicious food. Can't beat los for mexican food"}
{"text":"Love stopping in Los Favs. Their burritos are delicious, they're open late (a huge plus since I don't finish closing up our restaurant until late), the staff is super friendly, and they remember my order every time I stop in. Their kitchen is immaculately clean too!"}
{"text":"My family loves Los.  We have been coming here for years.  The food is good and affordable.  In all the years we have been ordering from them, they have never gotten our order wrong.  It is always exactly the way we order it.  You can't say that about many places these days.  My only gripe with then is that when they are busy, they never answer their phones.  Not only is that not great service, they are giving money away by not being able to take orders.  Not a great business model if you ask me.  Other than that, we are definitely fans."}
{"text":"Hahaha!  So.  how can you have too much bacon. . . On a burrito titled 'bacon burrito'??  
Just commenting on another review that inspired me to get what I got:
-bean and cheese burrito
-bean and cheese burrito with bacon
-cheese quesadilla
Perfect. And fried for free.  FREE. Fili's is $1.50.  Lol. 
Great food, perfect service, and bacon."}
{"text":"Best Mexican food!  Love the breakfast burritos. Also love the carne asada fries!
Always friendly! Love supporting local businesses."}
{"text":"Excellent!  Inexpensive and hot fresh food. Worth the price by far."}
{"text":"A local spot in Chandler for some decent quality Mexican food. Really great carne tacos as well as burritos. My significant other had ordered Carne Asada Fries and they were delicious! 

Quick service, friendly staff and helped with any questions we possibly had or needed answered. Will visit again sometime when in the area!"}
{"text":"I've been lunching at this location for a little over a year since it is so close to my work and I cannot applaud this business enough.  The chicken tacos are amazing, the carne asada burrito is delicious and the quesadillas are amazing.  You cannot go wrong with anything on the menu.  Even the fish tacos and the ground beef tacos are amazing.  I cannot stop thinking about the chicken tacos and because of this I have them at least once a week.  I've even visited another Los Favs in Chandler and it couldn't hold a candle to this one.  Best Mexican food I've eaten in Arizona, period."}
{"text":"Yummy enchiladas. I like this restaurant. I prefer to take out though because the dining room doesnt have a comfortable ambience. Delicious, quick, Mexican food though."}
{"text":"Didn't even taste the food the smell when we walked in was so bad I had to run out and vomit it like literally smelled like farts in there if I ever hear that they fix the smell I would be willing to try is but as of now I'm sorry I can't dine and smell horse fart at the same time"}
{"text":":( A million sad faces for me.  My husband was out of town, so that was an opportunity for me to stop by on a whim.  I was convinced I would love it, and maybe  I would have had Los Favoritos had a working stove, or hell, even a microwave.  Everything was cold, except the beans oddly enough.  Maybe they had a little campfire going to keep those warm.

The taco shell was saturated in enchilada sauce because they failed to employ the necessary lettuce barrier between the two.  And it was chewy, like it had been fried some time ago.  The taco meat was cold.  The cheese enchilada was cold.  It had the consistency of once having been melted, but since re-solidified.  And the rice, well, I don't even remember.

I don't get it.  It was off hours, and there was only one other table in there.  The only thing I can think of was that the food had been made earlier and never served.  Maybe they were waiting for a take-out order to pass it off.  Only giving a second star because...I don't even know why.  I just don't want to relive the disappointment any longer."}
{"text":"Great little place, made even better by the recent addition of Lengua to the menu. The California style burritos are a staple (regular burritos with french fries) and all their portions are hefty. I particularly like the Carne Asada fries (fries smothered in carne asada, guac, cheese, and sour cream). 

Service is solid, but nothing to write home about. Food comes up quick, which is nice. Place is busy around lunch to late afternoon, but never packed to the point where you're waiting more than 10 minutes for your food. 

One of the best items on the menu is definitely their Chorizo Breakfast Burrito. I have at least one every week; big hefty burrito stuffed with egg, chorizo, and hash browns. A must-try!"}
{"text":"Went to pick up a phone order and a customer waiting asked about his phone order as he was waiting 30 minutes it was sitting on the counter ready the entire time he was waiting there which he said to the female employees there . Who laughed at him after he left mocking him immitating his complaining . He was white . They did the same thing to me my order was on the counter ready when I got there they made me wait I finally asked when people after I arrived and paid were getting their food ahead me . I asked for my food and I was given a dirty look the female kept saying you ordered a number six in a very mean voice yes I said I'm number 27 (I am also white .) I am NEVER going back !!! RACIST !!!"}
{"text":"Not very good.  Three of us ate here at dinner time. It was fast and inexpensive, but not very good.  I had a chicken taco plate and it was ok but made my stomach hurt later. The two with me both ordered cheese enchiladas and both were unhappy. They both complained that the enchiladas were cold in the middle. Not acceptable. Also, the salsa was right out of the fridge so it made the food even colder. I'm guessing that breakfast burrito everyone raves about must be the only really good thing on the menu. I'll never know. We won't be going back. I've decided I don't like eating my mexican food on styrofoam plates so will steer clear of these mediocre taco shops."}
{"text":"I've searched for the best menudo for 10 years in Phoenix since moving to AZ.... best menudo in AZ. Get a large amount for 7$. Steak burritos too"}
{"text":"Decent enough El Cheapo Mex.. we grab dinner from time to time and its not great by any stretch of the imagination however in a pinch it'll do. The carne asada burrito is pretty good.. decent meat quality with good salty meaty flavor and plenty of pico de gallo.. good times! 

This has to be one of the lamest Yelps Ive written to date.. gawd, I'm so uninspired these days! I need some hot sauce splashed in my eye to make me hot and spicy again!"}
{"text":"This is my favorite place ever. Breakfast burritos are the best thing ever!!! I literally eat here many times since it is close to work, I wish it was close to my house id eat there all the time!"}
{"text":"I can't get over how fresh the food is here. The couple of times I've been so far everything I've ordered has never disappointed. The menu has a large enough variety and the pricing is very reasonable for what you get. If you haven't been you should definitely give Los Favoritos a chance!"}
{"text":"Otherwise known as Papa Chevos! They are owned by the same people and the menu is the same. We go here pretty often because they have yummy food at a good price. My personal favorite are the tacos with green sauce. The cashiers is pretty friendly. The interior is small and clean with traditional Mexican decorations. It is located in the Basha's parking lot. I would definitely recommend this place if you're looking for quick, cheap Mexican food!"}
{"text":"Best breakfast burritos in town! Always busy in the morning but the quality of food never changes."}
{"text":"Let me first state that the food is rather authentic and delicious. But the staff has ruined the experience for the third time now. The woman behind the counter is really rude. No customer service skills at all. If they get the order wrong wouldn't you expect them to correct it or at the very least apologize? Nope, not here.... What would otherwise be a weekly visit has become a 86'd location for me because of poor service. I can and do cook, I go out to eat because it's faster and convenient, but when you are disrespectful to my girlfriend, and then start complaining in Spanish to you co workers you lose all respect for me. By the way, I may be a 6ft tall red head, but hablo español muy bien. And my girlfriend is a native speaker. Ignorance will not be tolerated."}
{"text":"This is my least favorite los favs to go to. Yeah the food is good, as with any of them, but my problem is, at any other Los Favs I can get a half pint of salsa. They do charge extra for it, which I don't have a problem with because it's delicious. Every time I come to this one, they insist they don't sell their salsa and you can only get  about 2 of  their tiny salsas. And I know, because my wife and I ask every time, and every time they say no. One, being able to do that will increase your sales on something that is incredibly inexpensive to make. Two, that means your restaurants are not consistent across the board which definitely impacts your credibility. Come on guys, I just want to Pay for more salsa!"}
{"text":"I wanted to like this place but the last two times I went here the food was blah. We've tried the super nachos, carne asada fries and the rolled taquitos. Everything tastes bland and wasn't much flavor to the food. I've seen other reviews about the service but the times I've been, they were good."}
{"text":"My 1st time here at my daughters request. Ordered breakfast burrito with chorizo and potatoes and it was so yummy.  Their red hot sauce is amazing.  We dined in and the restaurant is clean and very well maintained.

Definitely will be back as the gal at the register was super nice and helpful with my 1st visit.  Many regulars as she was talking to most patrons."}
{"text":"California carne asada burro! Nom nom nom nom. I eat here at least once/wk and the people are nice, the prices are fantastic and if they delivered to local businesses they'd get 5/5. They seem to have a staff that operates on a higher level than most fast food places & I haven't gone wrong w/ tacos and other burritos here either."}
{"text":"This place has some of the best breakfast burritos in Arizona! Two of my favorites are the Machaca breakfast burro and the California Carne Asada. This place is AMAZING!"}
{"text":"High quality for short order mexican food, very clean. I wish their hot sauces had a little more flavor."}
{"text":"Awesome little place! Been searching for a great place to get a breakfast burrito. Stopped in a got a ham burrito and was not disappointed. Great Prices and good food. Will go back to try California Carne Asada."}
{"text":"Out of all the taco shop but I've been through all over the country this one has one of the best flavor carne asada for their burritos and their sauces are right where they should be I definitely recommend it over any other place especially Filiberto's"}
{"text":"Paid for carne asada quesadillas - no carne asada in the quesadillas. Guy didn't seem like he cared to talk to us or address us. Go to the other places nearby."}
{"text":"This is an amazing restaurant with amazing staff and even better food! I have yet to find another place that has such tender and moist meats and vast choices. If you're in the mood for delicious and tasty Mexican food, this is your place."}
{"text":"Love their breakfast burritos.   Large portions small prices
  Great customer service."}
{"text":"Every time I go here they mess up my order. I always so no beans, just rice and they never listen. Today I got the rolled tacos and there was a broken toothpick in the first bite I took. I go because it's close to work but I think this will be my last visit. They are no where as good as the other locations around the valley. Disappointed!!

Update, some of my coworkers ate there yesterday and got food poisoning from the shredded beef tacos. 8/29/17. That's it, none of us will ever go back."}
{"text":"Taquitos and guac are yummy!  It's been a bit of addiction in the past ;)

My husband likes the chorizo breakfast burro, we used to walk the dog by and he'd grab his burro.

My daughter always gets the red enchilada."}
{"text":"Ask for the SUPER burrito its about two feet long and will fill up two hero's for sure."}
{"text":"Love the breakfast burritos - it has become a Saturday morning tradition in our house. We also pick up lunch or dinner from time to time. The people are nice and the food is good. I am not looking for anything other than what it is and I like it what it is! I would LOVE it if they delivered. :)"}
{"text":"I've been here a few times over the past few years and I am never disappointed. Usually I call ahead of time to place and order and just swing by and pick it up. They are not so accurate with estimated times your food is ready though. You can order one item or the whole menu and they always say it will be ready in 10 minutes. 

My favorites here are the chicken enchilladas and the quesadilla. I've never tried their burritios. The place is not too big and it can probably only seat about 12-16 people. So be  aware you may need to do carry out."}
{"text":"The reason for the poor review is because of the customer service. The food is rather decent but every time that I have been in, the service has been abysmal. Whenever I place a phone order, for pick up, I'm almost always placed on hold after five or six rings. The employees seem less than thrilled to have their jobs and it reflects in the service. Whoever helps me, over the phone and in the store is always rude. For a place that serves customers, the customer service is terrible. Not to mention, I've been given the wrong order before. I don't think I'll be going back after tonight."}
{"text":"Great spot for a quick delicious bite. The chicken is boiled and super tender when done. Burritos are bangin' as well as the hard and soft tacos. No frills, in and out. Great workday lunch stop."}
{"text":"Did a call in order, only have 30 minutes for lunch. Ordered a Carda Asada burrito, the girl on the phone said 10 minutes. So I go in 10 minutes, I wait in line for 10 minutes (20 minutes left on lunch break). Get to the front of the line, I say hello- I have a pickup order, the girl says for? I say a carda asada burrito.. and she said no, we have none since this morning all out. So I ask her I called in an order, why did you take it and not let me know if you were out of product. She doesn't say anything or apologize.. super rude."}
{"text":"Order off the menu, its amazing if you do. If you ask for ANYTHING out of the ordinary, like no cheese (because your allergic) or guacamole CHECK CHECK CHECK before you leave, I hate sending things back, but with allergies it can't be helped.  I went back several dozen times (various times for dinner (My guy loves it), everything if ordered exactly as the menu was always good and everyone was always really happy, except those with special requests. I wouldnt have returned after the second time if my guy and his friends didnt love it, it was almost always my food they messed up or something that one of our friends was okay with having messed up. I think that the fact that there was always a language barrier (YES, always) makes it harder. So, great food. But I no longer go, and havent in more than a year because my guy had the same bad experience that I did, repeatedly. (They did get my order right, 3 times out of approximately 28-30 visits. Also the cashier would check and on 4 other occasions made the cook fix the screw up, but the other food got cold while I waited at their insistance because it wasnt done correctly to begin with.)

~~~EDIT~~~
Went last week after ages of not having been. everything I GOT was right, I had her check before I left. Though I was shorted 2 chicken tacos. I would have noticed but there were two wrapped tortillas for other meals and I thought they were the tacos. 

Its a disappointment. The food is so good, why can't they EVER get my food right."}
{"text":"I am so disappointed with this place. I have come here for years because their breakfast burritos are the best in town. Over the last year they have progressively gotten worse in their service and quality of food. Today I waited 45 minutes for two burritos before I walked out. They are so disorganized. To make it worse, the staff behind the counter didn't even care about the poor service they were providing. This place is in need of a serious of a management makeover."}
{"text":"Where can I start. Breakfast burritos are some of the best in town. Green chile and red chile burritos. Great fast and friendly service. The Nachos are great especially the ones with the meat on top. I go here atleast 3-4 times a week."}
{"text":"I love Los Favoritos. I come here often and the food is consistently excellent. I don't remember ever having a burrito I didn't enjoy. I usually get the same thing but everything I've had has been delicious. Great customer service and fast too. There isn't ever really a long wait. The dining area is clean and neat and the tables are always wiped off quickly after someone leaves. Plenty of seating for the guests. I would definitely recommend it. 

The salsa that they give you is awesome too. Just an FYI. :)"}
{"text":"I don't know what the negative reviews are talking about.  We stopped in today and had enchiladas and burritos and they were good.  Both things and sodas were $12. You can't expect gourmet for that price.  For the price you pay, the quality is appropriate.  We enjoyed it and will go back next time eye in the mid for a fast, cheap meal."}
{"text":"Have eaten here many times but this time very unpleasant. Staff is in back chatting extremely loud and the female has a very loud laugh. They should be less noisy and more available to the customers. This on 6/23 at 2:30 pm"}
{"text":"After taking a spin class, we were starving and we see Los Favoritos! I ordered carne asada and adobada tacos with chips and salsa. The restaurant is small, but we didn't mind too much. 

The tacos were a generous portion and satisfied me. The salsa they gave us was really good - it tasted homemade and it wasn't your typical tomatoes, cilantro, red onion like mix. I really enjoyed it. 

The bill was inexpensive: around $15."}
{"text":"Great Mexican food.  Very inexpensive and didn't have to wait long! Will definitely be back!"}
{"text":"Terrible service again. They can't get the orders right. I ordered one bacon breakfast burrito and huevos rancheros, no cheese. I received a chorizo breakfast burrito. The huevos rancheros order had cheese on everything including the rice and beans and no sauce on the huevos, only diced onions and tomatoes. From now on I'm going to drive the extra two miles to PAPA CHEVOS on Alma School & Queen Creek...same menu and great consistent service!!"}
{"text":"5,4,3.  If I wrote the review 6 months ago, I would have given 5 stars.  Since then, their portions have been reduced.  The breakfast burritos used to be mammoth, now they are smaller than the other taco shops."}
{"text":"Good burritos. Really good fish tacos. Good service. Food is consistent. Great to take home food but not a sit down for dinner place. If you are looking for good to go.... this place is good."}
{"text":"Every time I eat here the food is bad... I keep trying other things because I love Mexican food and this is right by my house by the bean and cheese burritos taste awful, the breakfast burritos (my favorite breakfast food) tastes worse :( this will be the last time I ever waste my time or money here...."}
{"text":"Place has the best breakfast burritos! Everything ingredient they use is fresh and prepared fresh daily."}
{"text":"Sometimes the food is great and other times it's just ok. Not the greatest breakfast burrito in my opinion."}
{"text":"Awesome food . Awesome service , bettttttter then burrito express for sure ! Give them a try ,"}
{"text":"Had a shredded beef burrito and carne asada tacos.  Husband liked the burrito, I didn't. There were peppers and onion inside. Don't know if sour cream or guacamole was an option but it wasn't included. I liked the carne asada tacos, my
Husband did not. They have pico de gallo on it, tasted fresh for me. He didn't like pico. I was happy w the rice, seemed fresh. The salsa was good. The green one was hotter. I always base my Mexican food on the quality of salsa. 

So, 3 stars for me. Not terrible, not memorable. I'll try looking at other Mexican choices."}
{"text":"Other Taco Shops in AZ should come here and take notes.
 
Lived in AZ my entire life and I can say without a doubt that Los Favs is the best Burrito/Taco shop in the state. 

Caifornia Burrito? Amazing.
Starts with the Tortilla which is always warm and soft, then you get the arne and I am not sure is it is actual carne because it taste like Unicorn Meat. And like the artists they are Los Favs puts French Fries in the Cali Burro not just a slump of Mashed potatoes like some other places in town topped of with melted cheese and Pico to complete to masterpiece.

Green Souce is awesome."}
{"text":"This place has your typical, standard affair of Mexican food, but they execute admirably well. If you are used to authentic Mexican fast food joints like Filiberto's, you know exactly what you are getting to. They have a wide variety of options to choose from like tortas, tacos, burritos, and enchiladas, but I always go for a carne asada quesadilla and an ice cold orange Jarritos. There is something so simple yet magical about this quesadilla: the ooey, gooey cheesy goodness, the perfectly-seasoned, plentiful steak, and the soft, toasty tortilla. Washing it down with Jarritos is the perfect cherry on top. Now, I'm definitely more of a burrito guy, but I can't help ordering the quesadilla when I come to Los Favs. Also, this location is also one of the better ones as it is relatively new and close to the suburbs.

Overall, it's cheap, fast, and tasty. What more could you want?"}
{"text":"First time here. Was in the mood for authentic street tacos. My husband and I bought ordered one taco each just to try the flavors. I had chicken and he had fish. Both weren't good at all. Both tacos has roasted green bell peppers and the juices weren't drained very well. They had lettuce and pico de gallo with unmelted cheese. They both were very tasteless. We won't be returning"}
{"text":"Carne asada burrito r, 5 rolled tacos or a torta and your solid. 

Great Mexican food at an affordable prices two thumbs up."}
{"text":"This place is just becoming awful to buy from. I work for a company that makes huge orders from here. The last few times have been very bad in the experience. They take too long on our orders and have forgot MY order twice now. Might have to look at other avenues now. This is just ridiculous."}
{"text":"UPDATE

Changing from 1 Star to 3.  My daughter brought me a  Carnitas Burrito from the restaurant.  Quality has returned, I do not know about the service so that is why I only upgraded to 3 stars.  

Cold food, no flavor and lousy service have turned a good restaurant into a poor one.  I will not be back, especially after I was told they would not fix the burrito.  Stay away folks"}
{"text":"My favorite Taco shop. I love this place! Convenient, inexpensive and deliscious. Highly recommend the Machaca Breakfast Burrito, carne asada tacos and hubby loves the ground beef tacos. If you like hot, spicy food, try the shrimp diablo! Don't forget to ask for their salsas...esp the \"brown\" (medium heat)"}
{"text":"Good Mexican food, great price.  I am a fan of the Carne Asada burrito and the Guac is pretty good.  Customer service isn't wonderful by any means, but the place is clean and the price is great on the pocket book.  My one burrito with rice and beans was enough for dinner and lunch the next day! Yummy."}
{"text":"Delicious Mexican food!  Beware of the salsa!  Es muy picante, but delicious!  The chips are so crispy and fresh and their meats are also cooked to perfection! :)"}
{"text":"The burritos are amazing.  I especially like the breakfast burritos, they never disappoint. The only thing that is stopping me from giving them a 5 star rating is how long it takes for you to get your food."}
{"text":"I've only been here once but I really loved  the breakfast burrito. Make sure you go with an appetite the servings are pretty big.  They look like they do a pretty good business."}
{"text":"Looooove love this place. Forget about Filiberto's or any other place ending in ertos - this place is the real deal. 

My favorites are the chorizo burrito, machaca plate, and the menudo. You won't get better-tasting menudo anywhere else in the valley, and for the price. Beware, it's only served on the weekends and it runs out quickly. 

The cooks and staff are super friendly, especially José and Esmeralda. Definitely my go-to destination for casual Mexican food :)"}
{"text":"Overall, decent food when they get your order correct 50% of the time. Double check every item and quantities so you don't get home to find out it's screwed up. 

Asked tonight for some type of a credit on the $7 of two Carne Asada tacos from last Sun and the same 16yo boy who took our order last week said he could only do something within 24 hours. 

Sorry, you just aren't that convenient for me to run back over the next day."}
{"text":"I was visiting my friends in Tempe and we were searching for a quick lunch at an authentic taco shop. I saw all the positive reviews and decided that this place would be the best. WRONG. I don't know what's wrong with these people, because this was some of the WORST food I've ever had in my life. For me, it tasted worse than Taco Bell. We would have been better off going there! By the time I got home, I was in intestinal distress, my friends felt queasy and we were all disappointed. 

I ordered come guac and chips. It was just disgusting canned guac that was all runny and that absurd bright green color. My carne asada burrito was better, but not by much. 

My Official Bathroom Test: Total failure. There was no TP and I had to use paper towels. The floor was dirty and the sink was leaking. AWFUL. 

I was very disappointed with this place. I can't believe it was rated so high!"}
{"text":"I normally like Los Favs. I've had good experiences at the Tempe and Mesa locations.  This location was awful today.  

Not sure if they're trying to get rid of their overstock of yellow lettuce, but they should probably just throw it out instead of burying people's meals in it. 

I came here for cheese enchiladas.  They're not difficult to make. I've made them before.  They generally require the cheese inside them to be melted, otherwise, it's just a cheese roll-up. I think their cook missed the memo on that.  I would have asked them to throw them in the microwave for me, but they were covered in yellow lettuce! So, yeah. 2 orders of room temperature, unmelted cheese roll-ups, trash. What a freaking waste of money.  

I would have mentioned it to the cashier, but she was already annoyed with having to do her job. 

Terrible food, terrible customer service. Probably the first and last time ill ever say this,  but I should have gone to Filiberto's."}
{"text":"UPDATE: Great menu, friendly service - has potential!

Recommended, but with caveats (read on...)

Food:
On my second visit I ordered the Carne Asada Burrito, Enchilada Style. Once again, the burrito was flavorful, but like last time the beef was a bit too chewy for my taste. I prefer something more tender, so I won't be having the Carne Asada in the future. Even so, I look forward to trying other menu items.

Cost:
Good value, $7.49 with tax.

Service: 
Fast and friendly.

Overall:
I've decided to avoid the beef, but I'm still hoping to find menu items I like."}
{"text":"There must be new management because the place is MUCH cleaner then it's been in the past. I avoided it for those reasons for several months but have been back recently and was happy with the food. I agree with the reviewer who said he prefers to eat at home. I almost never eat there. Never occurred to me that I could bring it into Tally Ho!"}
{"text":"Real Mexican food.  Amazing taste. The price is more than fair. Big plates. Most definitely coming back!"}
{"text":"This place was always our go-to.. but the last three times we have gone there they have given us the wrong order. If you eat red meat.. it isn't a big deal. But our family doesn't and our kids have never had red meat... so when it's in your food.. it's an issue."}
{"text":"Great place fill those cravings for taco shop style Mexican food. Can't go wrong with their rolled tacos, beans and rice #18 combo. Especially for picky eater kids. My kids love their rice. Breakfast burritos are great, well portioned and better priced than Filibertos."}
{"text":"Good reliable Mexican take out.  Good burritos, which is about all I've ordered so far.  I hear they have awesome breakfast burritos, so it is on my list of things to do on a Saturday morning.   Overall, it meets the #1 priority on the Friday night take out list.......affordable..."}
{"text":"Posted hours say 11:45pm.... guys closed shortly after 11pm.  Two customers came and went."}
{"text":"Yum! It's great food and it's cheap. The chimichanga was good (though I'm not a fan of the peppers and onions inside). The tamales were good. The cheese enchilada was okay, I wish the cheese had melted better. The breakfast burritos were AWESOME!

It's just a little hole in the wall, I usually get the food to go. But it's fast and cheap and good."}
{"text":"Don't even get my started. Pepes is life. I've been eating here since high school I swear my life on it."}
{"text":"The best breakfast burrito period, this is the best Los favs in phx."}
{"text":"Really great tacos and cheap. One of the tacos in my order was wrong, but I think it was because it was special order. The sauces you have to ask for, so don't forget!"}
{"text":"Delicious burritos, but the salsa needs improvement in quality of flavor. Great overall experience, and would definitely go back."}
{"text":"I was excited to try the food here and was disappointed....I ordered two shredded beef tacos with rice and beans. I paid 11 bucks not including a drink. My food was cold the cheese wouldn't even melt on my beans. Even the worker was very stand of ish towards me. Sad to say I won't be coming back."}
{"text":"One of my favorite places to eat. They are open really late (and super early) and the food is always good. I highly recommend the breakfast burritos! Yum!"}
{"text":"Not a fan. Got the tamales, very bland. A lot like all the other average mexican restaurants. I'll have to try a breakfast burrito next time."}
{"text":"Got carne Asada fries and a bean and cheese burrito for my babies. Fries weren't hot BUT the food was good. The burrito was really good. Would go again."}
{"text":"Breakfast burritos awesome
Carne Asada tacos awesome
Fish tacos awesome
Clean and friendly place to eat that's awesome"}
{"text":"So I know it's the night after Christmas but come on! 3 orders to go and 2 were wrong and not good. 1st was a #9 combo which is a Machaca Plate instead we received a Tamale Plate? 2nd Carne Asada Fries with Fresh Jalapeños and well done Fries NOPE, pickled jalapeños and cold soggy fries. It's amazing that no one read the order or confirmed it before bagging it to go."}
{"text":"Came in from out of town for some breakfast burritos. They were very tasty & fresh. The tortillas were delicious, fresh and warm. And the guac was perfect!"}
{"text":"Came here last week to pick up something for my lunch date with my husband at his work.  We normally order out for both of us at an Asian place, or I'll get Subway for myself, but wanted something different.  Had a craving for chili relleno burrito.  Ordered one of these to go and it wasn't too bad.  However, definitely something you can NOT eat while driving.  It was very messy as there was a red sauce that just went everywhere.  Glad I wasn't wearing white.

Maybe less sauce in the burritos.  But it tasted alright.  

It seemed like a place for all types of people.  I was actually surprised there were several other Asian people in there besides me ordering.  

Though there were many orders ahead of me, it really didn't take too long.  The place seemed clean.  Not a big place.  Would I come again?  Possibly, but I'd get something else to see if other things taste alright."}
{"text":"One star for cleanliness and staff.
Food was, to put it politely, tasteless.
The chicken enchiladas lacked chicken and were stuffed with more green bell peppers then anything else. Sauce was a watery tomato base, gross! 
Carne asada fries, bland.
Chili Rojo was dry and chewy.
Disappointed and won't be back."}
{"text":"Super inexpensive but good Mexican food. Easy to eat there or take out. Very fast. The best horchata! Loved it. Nice to have places like this in the neighborhood."}
{"text":"I moved down the street from Los Favoritos and thought I would give it a try. Since that first time I have been back at least 20 times. 
The food is authentic, consistent, and totally affordable. They have given me the correct order every single time and the people that work there are so nice. 
Because I figure I am biased at this point, I have brought at least 10 people here to eat. They all love it. 

Good stuff and the green sauce is yummy!"}
{"text":"really good. A little hole in the wall. I thought $7 was a little much for a california burrito with the size it was but it's worth it and delicious."}
{"text":"The line and wait was way too long and carne adovada burrito was not very good. Meat was fried and tasted more like chunks of chorizo. I prefer it more in a roasted and shredded or chunk form with red chili like they make carne adovada burritos in NM."}
{"text":"The best 'tos. Surly staff, greasy Meximerican fast food that is always hot and crispy. Kicks the menudo out of Filiberto's."}
{"text":"Okay so this place is more like 3.5 stars. Maybe four, I may update later on. I think the food is somewhere on the border of mediocre and pretty good. I would go back, more than once, but mostly just because it is convenient. But I must say, the Shrimp Diablo great. Not only is it a pretty bad a** name for shrimp, but it is a great spicy flavor and they give you tortillas to make shrimp burritos I guess."}
{"text":"It's very rare that a place truly impresses me. This place knocked it out of the park. Just stopped in today for takeout on a recommendation from a friend. First of all, the place is so dang clean that you could eat off the floor. Very impressed by that! I ordered a chorizo breakfast burrito and rice and beans. PHENOMENAL. Fresh authentic Mexican food. Not greasy. High quality. Prices are completely fair for the quality of the food. I will definitely return to this place and bring friends with me."}
{"text":"This is what my wife FB'd...  So disappointed  Chris got me a chimichanga and specifically asked for none of the good stuff lol you know the cheese and sour cream. Well I ate 1/4 of it then went to take a bite and realized  the rest of the chimi had beans smothered in cheese. Ugh praying I didn't eat any. Praying Dalton doesn't get sick from it.

That's why I give it a single star....My wife cannot have Dairy. This is Just being lazy! I should have learned the last time they messed up my order.... I will officially stop going here and I suggest the same."}
{"text":"Called to place a pick up order for 4 tacos, the total was $16 and change, tacos shouldn't cost that much, you need to lower your prices"}
{"text":"I've been to two other Los Favoritos locations and have always had a breakfast burrito, which is excellent.  Today I went with the carne asada fries and they were delicious.  It's a ton of food, I was only able to eat about half of it.  There's a ton of cheese and sour cream on top, which I loved.  The fries were crispy and I like that they put pico de gallo on the fries as well.  I think I found a new favorite here."}
{"text":"This is my second time to visit this restaurant! The food was a bomb! I tried the fish tacos first and it was amazing flavor! Second time I come to try the carnitas which is shredded roasted pork with flour tortilla aside. I am in love with the green sauce! This sauce is no spicy at all which is my favorite. I couldn't ask for more because the serving time for food was super fast. I don't have to wait for long time to get the food. I highly recommended everyone to come to this place! Enjoy it guys!"}
{"text":"Food is pretty good. Its kind of a late night teen hang out spot. 

This one chick that works there is really rude. She never smiles, never even says hello when you walk in, and I kind of think shes a bit racist? I am white.. never once is has she been nice to me. But my bff is of Mexican decent.. and shes always supper sweet to her. if you come in often, you know exactly who I'm talking. She should not be working in a place where you have to be face to face with people. Rude person."}
{"text":"This store hours say open until midnight. Tonight I called 3 times at 11:30 to order ahead but no one answered. I was at the restaurant at 11:40. There were customers inside but the door was locked. The cook and lady at the front just looked at me when I was trying to open the door. Poor customer service. It's a shame because I come here often. Wont be back."}
{"text":"If I could give less than 1 star I would.  I just left this location (4850 S Gilbert Rd # 8, Chandler, AZ 85249 ) for the second time this evening after a wrong order  and I have never ever been treated this way from any other restaurant and claimed that I the customer was wrong.  This was the first time I visited this location.  I have visited others in the past.  I ordered dinner tonight on the way there for pick up.  Actually my wife did as we were driving so I was sitting there next to her.  She ordeeed my Carne Asade Fries just the Carne Asade, fries and cheese only.  After I picked it up and drove all the way home I realized it had all the other stuff still on it.  I called back to say I was just there and I was coming back and she stated to me on the phone that my wife didn't specify.  When I got there she stated again that my wife didn't specify no quac or sour cream or anything.  I said yes she did as I was sitting right next to her when she called in the order.  I said I am sorry but you are wrong.  She then said that they will make me a new one but I will have to pay for it.  I said I wasn't going to pay for a mistake that wasn't mine.  I said if that is how you are going to treat your ciustomers then fine I will walk out that door and never be back.  She then went and talked to the manager and then came back and said they they will remake but I will have to pay half.  I then again stated I am not paying.  Back and forth we went and then again she went to talk to the manager.  Which I assume there was a manager since that person never did come out and speak to me.  When does a manager never come out and handle customer issues?   Then the lady came back out and said that the manager just said to give me my money back.  I realize that I got my money back but why is it ok to give me my money back but not make the order correct and just remake the order??  So instead of remaking my order and making me happy to which I may visit that location again now you lost money for the first order that I returned that wasn't right and then your out the same amount again by giving my money back.  Instead of making the order again which would be cheaper for you than giving my money back.  I have never been treated in such a way from an establishment to where they talked down to me in that way.  Also I have never ever had any issue somewhere where the manager doesn't come out and greet the customer and make things right.  I will never ever visit this location ever again because of this."}
{"text":"I went here on a Sunday night there were the only Los favs near me open past 8pm. Yeah I know I'm pregnant ? Anyways they were great! Los favs is already an amazing Mexican spot but the customer service here was exceeding, it was clean & they were quick. I'd rather go out of my way to this location then the one 5 mins from my home."}
{"text":"One of the best mexican food joints ever. Steak and egg breakfast burrito with potatoes and guac is legit tops. I would honestly eat anything on their menu without complaint."}
{"text":"Could I be more of a fat kid? I'm rating one of my favorite breakfast burrito places. I didn't even know \"breakfast burrito\" was a food group until the past year. Arizona, you are glorious.

Boyfriend and I love to call in our orders and head out to pick up a HEFTY bag of tastiness. My staple is the potato, egg and cheese, add peppers and onion. They don't skimp on tiny ramekinitos of red and green sauce. These suckers are HUGE. Just call it a wash on yor diet and enjoy. The tortilla is light and flaky and just...dumb, OK?! Melty cheddar oozes throughout the ingredients without being gloppy. It's beyond.

I love that we've NEVER had an order mix up, which is better than I can say for almost every other bfast burrito joint I've haunted. Los Favs, your name is so correct!"}
{"text":"This place is really really delicious. Really really. The best Mexican food I've eaten so far in USA. There's a franchise near my school and that is where I usually get delicious Mexican food. This place is no different. Usually, I get a Chicken California Burrito (potato, chicken, onions, maybe other vegetables, I don't know, I just eat) w/ guacamole or a normal chicken burrito (chicken, rice, vegetables). But today, I ate Los Favs for breakfast and I got the Machaca breakfast burrito, which is just a collection of meats and eggs and cheese wrapped in a flour tortilla. Sooooo delicious. I recommend anyone go out of their way to eat Los Favrito's Taco Shop. If I could, I'd probably eat here like 5 times a day everyday for the rest of my life. It's that good. So go and find a location now and eat it."}
{"text":"Good, quick food. Especially enjoy the breakfast burritos on a lazy weekend. Right down the street so its convenient and its been clean every time Ive visited. Will be back!"}
{"text":"Visiting from Omaha, Nebraska and just had to find a good breakfast burrito before I left! I certainly was not disappointed!!! Picked up a chorizo breakfast burrito and WOW! Very delicious!! Fast and friendly service as well, thank you!!!"}
{"text":"I was in the area this afternoon and wanted a quick nibble...

I knew there wouldn't be much around to eat so I hopped on Yelp to find something 

Los Fav and Subway were the only two things around... I wasn't sure if this was the same business as the Los Favs on Broadway near ASU main so I decided to check it out 

The lady that helped me with my order was very nice and knowledgable of the menu... Great enthusiasm! 

I walked in a looked at the menu, same business, so I ordered the daily special which consisted of (3) rolled tacos and a side of rice and beans

I like how they have the red and green sauce in the squeezy tubes... 

For $4 it was a good amount of food and it was yummy 

If I am ever in the area again, which I highly doubt, I will stop by... 

:)"}
{"text":"Yuck
I eat at the location in Apache junction and Queen creek 
This place was more expensive and my to go order was completely wrong 
The tortilla tasted like the cleaning solution the use to mop the floor with
Yuck"}
{"text":"Unbelievably good! Fresh ingredients, great service, and awesome prices (where else can you get a side order two massive chicken or shredded beef enchiladas for less than $6?). The carne asada is ridiculously good(try the carne asada nachos and tacos).  If you like enchiladas, Los' cannot be beat as they are packed with meat, onions and peppers.  What seals the deal for me is the quality of their re-fried beans and rice(when ordering a combo).  Highly recommended over any other Mexican food options in the Chandler/Gilbert area."}
{"text":"Los is always the place I stop at first when I come home. It's absolutely the best. My favorite is either the sausage breakfast burrito or the California burrito. Whatever you pick, you can't go wrong!!! 10/10"}
{"text":"This is in my neighborhood. Great spot for authentic Mexican food. The service is fast. They are always nice. The food is good and what's best is that it's not expensive it's very affordable. I go all the time and would probably go more if Mexican food was healthy lol. Either way it's on my list when I indulge and I'll be back."}
{"text":"Growing up in Tucson I know good Mexican food places. This is just as good if not better then anything (fast food) down south. Always good, quick and cheap."}
{"text":"Overall, a great place for a quick meal. I've tried the fish tacos, carnitas burrito, breakfast tacos, and my husband usually gets the bean tostada. The food is solidly tasty and fresh, and the service is quick and friendly. The tables could be kept a little cleaner, but otherwise, a great place!"}
{"text":"Great food low cost the beef burito is great and the adabada taco is awsome you have to try it"}
{"text":"So I had previously visited this favs location many, many times over the years since it is close to my home and never had an issue. 

On Sat afternoon 9/9/16 I went and ordered a carne asada burrito and chips, cheese & guacamole. So I'm standing there waiting for my order, the girl that originally took the order is now sitting in the dining area and eating. No big deal, but I hear my number called. So I look in the bag and they had just put the chips in a paper stand up bag obviously with no cheese and/or guacamole. Every other time I have EVER ordered chips, cheese, & guacamole it comes in its own square styrofoam container for the same price I had been charged and had already paid.

I then tell the girl handing me the incorrect order, Carla, that I ordered and was charged for chips, cheese, & guacamole, not just chips. She says something in Spanish to the cooks and then takes the bag of chips out of my to go bag I was originally given and I do not see what happens. She comes back with a styrofoam container and says \"ok chips & guacamole\" I specifically ask if there is cheese like I had originally ordered and she specifically says \"yes, cheese\". I get home, open the styrofoam container and no cheese. At this point I'm already home and don't feel like wasting anymore of my day so I call them to tell them that they had messed up my order TWICE. I get told oh you will have chips cheese & guac in your name just stop by any time. Ok, not ideal but whatever.

So I go there tonite, AGAIN I get no cheese. Before I leave I point out there is no cheese. They tell me to give back the order I just received and I gladly do so. They then give me a \"new\" order which supposedly has cheese & guac but it looks the same. You be the judge. My girlfriend now feeling bad for me and my ordeal calls and is told \"well what do you want me to do?\" We say nevermind, I guess it's too late. I will NEVER go back."}
{"text":"I ordered a burrito with steak, potatoes, & cheese & one order of THREE rolled tacos with guacamole on the side. First, they charged me for FIVE rolled tacos, instead of the THREE, & they added pico to my burrito. -.- not impressed. The tacos were lacking meat, the melted cheese instantly slid off when I picked it up & the guacamole had no flavor. The lady even repeated my order back to me, TWICE.. After having to tell her my order THREE times. I think something is up with their phone lines, whenever I call they say that I \"sound far away\" but I don't have this problem with other restaurants in the area. Prefer burrito express, & willing to make that drive even though they're further down the road.. they always get my order right. 2 stars for being a convenient location."}
{"text":"Good mexican food at an unbeatable price.  The decor is what you would expect in this price range and sometimes the place smells funky to me but the kitchen always looks super clean.  The fish tacos, vegetarian burrito and the cheese enchiladas are excellent!"}
{"text":"Great breakfast burritos. Super nachos. Carne Asada. All delicious. Small venue, not enough seats"}
{"text":"We have been to this location on multiple occasions and have yet to be disappointed! Today Anna took our order. She was so patient, polite and kind! Her customer service was wonderful! This restaurant is ALWAYS spotless!! Food is always very good!! We'll be back soon!!"}
{"text":"It's as yummy and fresh as the \"sand through the hourglass \" , .... You NEVER KNOW WHAT YOUR GOING TO GET MEAL WISE OR ATTITUDE!  When it's great, it's GREAT! When it's bad, it's disappointing and I feel cheated.  So step up and be consistent!!!!! Only then can I give a true thumbs up! But, leaning that way."}
{"text":"No-nonsense cheap Mexican (Tex-Mex) food.  It's a tiny neighborhood joint but the food is pretty reliable for what it is.  The tacos and burritos are better than the tortas, which are undistinguished.  

Definitely the best $5 Mexican food in this part of town, which is probably why it's almost always busy."}
{"text":"Menudo and I'm not talking about the group folks. It is muy muy delicioso. If they had a frequent flyer program I would be part of it...yazzzz. Menudo is not for the faint of heart. I luvs me some Menudo. I even have my kiddo loving it. We try to hit up Los Favs on Sats to share a bowl as neither one of us can finish the whole thing by ourselves. I tried  to venture out and try another popular place's menudo in phx but it did not even come close! I'll stick to what I know. I will fight somebody for the last bowl of it! I would recommend you call ahead of time to make sure there is some left as they sell out really fast. Go early or go hommmmmeee.

We also really like the chorizo breakfast burrito. It is full of flavor. Yummmm. Service is always wonderful. 

So needless to say I won't be venturing out again, at least not for my menudo."}
{"text":"The breakfast burritos are very good.  Everything else I've tried hasn't been as good as the Filoberto's on Arizona Ave and Ocotillo."}
{"text":"I have found that this little taco shop has the best fish tacos and burritos in the area. Would recommend for those who enjoy tacos and breakfast burritos!"}
{"text":"The lady was friendly and they were def busy. But the breakfast burrito i had was just ok. It tasted all one flavor. It was sausage egg potatoes cheese. But was just blah."}
{"text":"I just love, love the Al Pastor here!!  I've had other proteins there and they are all good. They do not disappoint with there food. Taco Tuesday is very busy and they only have 3 choices for that day but I'm ok with that since one is the choices is Al Pastor."}
{"text":"This place is close to home.  The food always taste good and you can get in and out really quick.  Love the beef taco meal."}
{"text":"I go here all the time it is absolutly awsome! California burrito has to be the best thing on the menu."}
{"text":"Got a ham and egg breakfast burrito from here. I didn't go in or even order it so I can't grade the service. A friend picked it up for me do this review is doily rated on the food alone. The burrito seemed fresh and it smelled good. It was a little dry compaired to filbertos. Meaning there was no sour cream or salsa. It just had pico. All and all I would pick it over any other fast food chain around here."}
{"text":"The best shrimp cocktail I've ever had. Prices are very affordable. The rolled tacos were not good at all. My husband had a california burrito and was not impressed, it didn't even have french fries in it. I probably would not eat from here again."}
{"text":"I drove by Los Favoritos and turned back around once I saw so many customers inside.  I ordered a breakfast burrito with just potatoes, eggs, and cheese.  It was wonderful.  It was $4.35 but mostly tortilla.  The filling was minced smaller than most places which was really nice.  The green and red salsas were the best - get plenty of those.  Definitely recommend \"Los Favs.\""}
{"text":"Great fast Mexican food at great prices. We've been coming multiple times a week for various family members here since it opened and always enjoyed it. 

It's not fancy, it's just a good, small restaurant. Lunch and dinner can be busy but they handle the orders quickly."}
{"text":"Los Favoritos (Favorites)  no es mi favoritos.

Mi favorito es: http://www.yelp.com/biz/el-ranchero-chandler

I did find it to be perfectly serviceable, reasonable and quick.  

I tried a breakfast burrito but also sampled the shrimp diablo and a chimichanga.

I volvería."}
{"text":"I generally go to Filibertos for a quick carne asada fix. Not that I believe that it is the only good place to go, there is a bit of tradition and a slight addiction dating back to my youth that brings me back to Filibertos. That said, I tried Los Favoritos on a recommendation from a friend that said that it was the new Filibertos.

I thought it was good. It has a different taste, but it was still good. I think I prefer that tortillas at Filibertos, but the carne asada itself was a toss-up between the two. Having had fresh carne asada at Mexican picnics, I recognize that neither are true carne asada, but it serves it's purpose.

I did appreciate the cleanliness of Los Favoritos over Filibertos. I don't think I have ever been to a Filibertos and not felt like there was probably a health code violation or two occurring. That won't stop me from eating there, but it always gets the voice in the back of my head talking.

It is important for me to add here that I don't just simply order the carne asada burrito. I make it my own anywhere I order it. I like mine with the meat, cheese, beans, rice, and sour cream all wrapped up in the burrito. It's the only way to eat it if you ask me."}
{"text":"This place has great food and great prices.
A nice change from the typical Scottsdale fair and not your typical \"hole in the wall\" restaurant. 
It is clean, the staff is friendly, always the same guys there.
The menu is large, serving both traditional Mexican food as well as Burgers and fries and combinations of both.
The portions are big and the prices are small.
Everything tastes fresh and great.
FYI- The place is packed at lunch time with high school kids. There is usually a place to sit, but for whatever reason (the food, perhaps?), it seems to be the new daytime hangout."}
{"text":"Customer service was excellent. My company chose this place over the usual filibertos for our meeting breakfast. The Burritos were very good but a lot smaller than filibertos and a little more exspensive. Was given a lot of salsa for my 16 burritos which was nice. Filebertos got kinda nasty about the amount I was taking (2 per burrito). Quality and service out weighs quanity and price. We will be back..thank you."}
{"text":"This is my favorite taco shop! I usually get the chile relleno burrito. Flour tortillas are fresh and delicious. Staff is friendly. Everybody I take here enjoys it."}
{"text":"Nothing fancy but very good tacos.  I had 1 adovada, 1 carne asada, and 1 carnitas.  Meat was very moist and tasty and the tortillas hada nice fresh taste.  My son had a chicken taco and my wife had a chicken quesadilla.  My only complaint is that we were charged $1 for a tiny side of salsa."}
{"text":"Los Favoritos has been my GO-TO place for breakfast burritos for years, but this new location has made it a lunch favorite too.

The restaurant itself is simple inside. A dozen tables and an ordering counter make-up the dining area. The staff is super friendly. As for the food, it is consistently good. My group usually gets some combination of the rolled tacos, carne asada fries, California carne burrito, and beef taco w/ enchilada combo. They always come out fast, with your choice of red or green sauce (both are super tasty).

Like I said before, the star of the show has to be the breakfast burrito. Nothing can beat the warm tortilla loaded with bacon, eggs, potatoes, and cheese. For the money, there is not a better value in town."}
{"text":"I love you and all the food you make. If you could hand craft my child I would let you. There is nothing else in the world that matters when you sink your teeth into a bacon burrito. If hitler was given a California burrito a lot of lives would have been saved."}
{"text":"I've been looking for a replacement for my favorite family mexian place in Colorado. I've finally found it. Los Favoritos is AMAZING. Great food, and easy ordering/pick up. I am be addicted to the enchilada sauce."}
{"text":"My family visits this location too much I think. Last time we were in, the cashier remembered all of our orders. My brother's order is strange, so she always remembers that one - Bean and cheese w/ guacamole and potatoes. They are always friendly when we go and the price is great."}
{"text":"The food is fantastic for the budget Mexican category. This favorite (or favorito) is in my neighborhood and is a regular stop. I prefer not to eat there (unless you get turned on by fluorescent lights and beat up furnishings). No, I prefer to eat my Favoritos at home. I have heard that some folks take their meal next door to the Tally Ho (a dive bar) and enjoy their tacos with a cold Corona! Crazy!

Nachos covered with cheese and Jalapeos for only $2! Tacos and tostadas of perfection. They also have a mini salsa bar with several dimensions of heat and flavor."}
{"text":"Best chorizo and carne asada burritos around. They always hit the spot.  My only complaint for all the los locations would be that sometimes you get dry tortilla"}
{"text":"Our favorite local burrito shop! We love the California Chicken burrito with Horchata, or try the Carne Asada with Hot sauce! Great for a quick bite always yummy and pricing is fair."}
{"text":"This is literally my favorite Taco Shop it really saddens me that I'm writing 3 stars. The quality of food is amazing. They have the real Fresca cream not the fake white people kind their green salsa is out of this world and their beans oh my God I could eat a whole Court myself they're so good and flavorful. Know for the bad is the the quantity I feel that you get for what you pay. If I'm paying $6 for a bean cheese and egg burrito I expect it to be a fat ass burrito. Prices have gone up and quantity/portions  has gone down"}
{"text":"Good mexican fast food, filaberto's doesn't even compare"}
{"text":"Living in Seattle makes me live this place so much more. It's my first stop when I get off the plane and almost every meal in between!"}
{"text":"I am a new fan of Los Favoritos Taco Shop. I am a contractor doing work at the TruHit gym nextdoor. Everyday I pop into this place for lunch. The first time I walked by, they had chairs up on the bar like they were closed. Next day I walked in and to my Suprise they were open. I guess they stack the chairs unless they get slammed busy. I usually order beef tacos and beens. I am an Arnold Palmer drinker so I love that they always have Iced Tea and Lemonade on tap. Great food! Much better than other \"bertos\" chains out there."}
{"text":"It's near my work so I frequent the spot..the food is delicious and the people are nice! Definitely somewhere I can recommend"}
{"text":"Best bacon breakfast burrito ever! I've tried going to other places that are closer to me but nothing compared to Los Favs! And their hot sauce is amazing but super hot just a heads up ;)"}
{"text":"I'm not even sure why I'm giving 1 star....I guess because they are open...somehow......

Decided to try a new place on National Taco Day......would have been better off going to Taco bell.    Whomever would make this their favorite must be a relative........

The place is filthy......the food is bad.....the service.....well, there was someone there to take your money.

I got a burrito (chili verde) and a taco (carne asada).  

Taco first:   was that actually meat?  It had the texture of slightly moist cap'n' crunch cereal with the occasional piece of gravel or gristle.....little or no flavor to the meat (?).    The vegetables were at least fresh and the corn tortilla was probably from a giant bag from costco.  

Burrito:  inside the large tortilla was a mess of mush which presented a challenge  to identify what I was actually eating.   There appeared to be little cubes of pork(?).....the total lack of flavor made it difficult to determine.  

A waste of time.....a waste of money.     Go somewhere for food where they actually care about what they are serving........Los Favoritos  should rename the place LEAST FAVORITO.....just awful."}
{"text":"Great for breakfast, lunch or dinner. Breakfast burritos are a top notch, as well as the carne asada fries (be prepared for beast mode if going solo). Not feeling a burrito? The delux hamburger is amazing! Los favs is the best! Way better than the near by filis b's."}
{"text":"Food ok, service very slow. Cashier rude and acts like she doesn't like her job.  Los Favoritos is a good chain for Mexican food.  This branch needs some changes in personnel.  I would not return to this location!"}
{"text":"Found out about this place recently from Yelp and decided to check ti out. So far i've tried 6 items on the menu and the best so far is the Carne Asada Tacos and Chicken  Enchilada they are the bomb! . The salsa is so fresh you can taste everything."}
{"text":"Local run taco shop, fantastic food, clean restaurant and the employees are always so nice and friendly. Its also conveniently located for me so I love it. I try not to have Mexican food too often but when I crave it I love coming here."}
{"text":"Um, yea.... Amazing food! I love this place and have been multiple times in the same week."}
{"text":"This is the low key taco spot! Based on prices, never had high expectations. It's not gourmet by any means. I don't even eat Mexican food. I have a sausage breakfast burrito every time I go, and I think it's pretty good. Decent, quick food for cheap! I go all the time for breakfast, and for under $5 it sure beats McDonalds!!"}
{"text":"I've never found a better Carne Asada burrito than at Los Favs!! We love it so much we came a few times a week when they first opened and started getting recognized by the staff... Whoops! But it's just THAT good! The shredded beef tostada is amazing as well, and so is a bean and cheese burrito with red enchilada sauce added inside. Perfecto."}
{"text":"I've made may way through many of the bertos and other Mexican spots over the past couple of years and this place is definitely a keeper. 

Another divey taco place. It's got a small inside (maybe 6 tables, and a few chairs at counter space) and isn't anything special but boy is it good, I always come back for the food. Their burritos are delicious, as are their rolled tacos, rice and beans, and nachos. I've never had bad food from here, never had a mediocre meal even. Decent price and you get to fill up. 

Their employees aren't super chatty but they get you your food relatively fast. Good lunch spot, and it's always busy with people grabbing to go orders anytime I am here."}
{"text":"Gotta get the california or the carne burrito anything else is uncivilized.  The one on chandler and Dobson has better red sauce for some reason the red sauce at the Gilbert and chandler heights location is weird."}
{"text":"Solid 4 stars.  3 very satisfied hombres here.  Breakfast burritos were perfect.  Authentic mexican food, nothing fancy but very good. Place is clean, service prompt. Good quick stop."}
{"text":"This spot is definitely delicious. It's hard to find authentic places that don't use pork lard and/or provide vegetarian options. I have so many food allergies I thought I couldn't eat Mexican food anymore... until I got to los faves as we call it. 

I love the horchata served here and order a shrimp burrito for my entree. The green chili sauce is life! I would not skip on that. 

They are friendly and clean. Even the bathroom is tidy. Food comes out quick and soft drinks are fountain. My one con is that they have Pepsi products over coke."}
{"text":"The worst service! I asked for my food for dine in they gave it to go... not a big deal. I ordered a horchata asked for it twice and was then given an empty cup when I told her I ordered a horchata she told me to fill it up around the corner... no horchata around the corner... I got a soda and left because I was frustrated from dealing with an incompetent staff. I eat at the Chandler and Dobson location often and never have this issue but the three times I have been to this location it has been horrible service every time!!!"}
{"text":"Damn you Los Favoritos! 

Ever since my Saturday bean burrito I haven't \"been right\".
IIIf you know what I mean..annnd
I.think.that.you.do. 

Even if there was a negative star rating, I would still give them one star.
For the weight loss.

I should have learned my lesson with the chicken 3 years ago."}
{"text":"Was going to anther taco shop when we stumbled upon this gem. Portion size was great! Carne asade had great Flavor! Hard to find great mexican food here in az... this is one step closers to that quest."}
{"text":"I usually have a good experience at this Los Favs.  I generally order a shredded beef taco and a bean and cheese burrito.  The customer service is good.  I like to order it to go, and take home or take back to work and eat it.  It's not fancy, but I know what I like there and it's reliable."}
{"text":"I am a big fan of Los and their burritos, but honestly, this location is subpar at best. The woman who works the counter is consistently short and rude to customers; I've never seen her smile or tell someone to have a nice day/enjoy their food, etc., but I've heard her slap down trays of food several times. 

Tonight, I went in at 11:40pm. I understand that this location closes at 11:45 on Sundays and that it's annoying to get last minute customers, but I was appalled at the customer service. She flat out refused to serve the people ahead of me in line, and when I started to order, she told me that they couldn't make anything but tacos because they had already turned off and started cleaning their grills BEFORE CLOSING. \"No burritos, no nothing.\" 
I'm honestly surprised that more people have not complained about this employee or the level of customer service she gives. I will not be returning to this Los Fav's."}
{"text":"I've been coming to los favoritos for years! I can't get enough of their California burrito (I add beans). Their food is very consistent and very flavorful compared to other mexican taco shops. I will be coming back again."}
{"text":"I had their menudo and carne asada plate that came with flour tortillas. Menudo was no bueno. It was a little spicy and super salty. I added a bunch of lime and it didn't help at all. I couldn't enjoy it , so I threw it all away instead. The carne asada had no flavor which was odd. One dish was super salty and the other didn't have any flavor. Nothing tasted good. The food didn't seem authentic. I mean it is Chandler, there aren't a lot of authentic mexican food places around here. I only go to South Phoenix for that considering that't where I grew up eating authentic mexican food. Plus this place was a little overpriced, I paid $25 for 2 dishes. I thought this place would be at least decent but I thought wrong. I guess my search for good mexican food around Chandler/Gilbert area must go on still. I would have to pass when it comes to this place."}
{"text":"Pretty good, kinda like a taco truck restaurant without the great grub.  If I go back I'd get the tacos and leave it at that."}
{"text":"Best California Carne Asada burrito in town! I used to go to Burrito Express, now I go to both lol. Mostly here though. Came here for the first time, only got a carne asada burrito, came back a few weeks later to try the California Carne Asada, AMAZING. Also the Carne Asada Fries, wayyyy better than Filibertos or Amados. Once a week type place!"}
{"text":"I have been coming here since I was a child and it is the most amazing food ever and I wish I could eat it every single day of my life but I can't and I'm sad. But 10/10 go here and get a burrito because they are amazing."}
{"text":"Love the burritos but don't call on and order from here. We waited on the phone for 12 minutes and actually made it to the restaurant and the phone was just sitting there.  The cashier said oops sorry. Nothing for our time we had to order in the restaurant and wait, just what I was hoping to avoid."}
{"text":"This is the worst place ever. Been here twice every single time the mess up my order and then I try and get it fixed, but then they rush it and the food just sucks. I am sorry I like to give restaurants the benefit of the doubt but this place is just terrible."}
{"text":"This place is right on spot!!  Tacos, tostadas and the tamales were delicious!! First time here thanks to yelp reviewers!! It certainly is a place to eat if your in the areas."}
{"text":"Stopped by for a shrimp burrito.  Place was empty which wasn't surprising for a Sunday night.  Not the warmest greeting but my burrito was done in less than 4 minutes.  Good size and a decent amount of shrimp, registered a 7.4 on my heat scale which was a bit more than I expected but good nonetheless.  $9.35 for a burrito and coke might make me think twice about coming back though."}
{"text":"Best breakfast burritos by a long shot!! If there's a weekend we don't pick up breakfast burritos here it's probably because we're out of town! Great value but more importantly incredible food. Grab and go is all we've done but there are tables to eat at- have tried bacon, ham as well as machaca (sp?) burritos. Don't ask me to chose between liking the red or green salsa better bc I love them both!!!"}
{"text":"This was my first time here, my hubby was here before and raved about it to me. This time he said it didn't taste so great and I didn't think it was good at all. I went right before lunch rush it wasn't very busy and the food came quickly. My burrito didn't taste like my meat was seasoned at all and wasn't very big for the price. That would be my only complaint."}
{"text":"For my one and only visit, I got a breakfast burrito: it seemed all the ingredients were placed together in a Cuisinart, because every bit of sausage, potato, cheese, etc. was the same size -- kind of like a stock filling made well in advance.  Flavor was, hmmm, just okay: I couldn't really discern the sausage or potatoes.  Red sauce (not salsa, it was just liquid) was okay, but the green sauce definitely improved on the flavor profile.  Best part of the burrito was the tortilla--soft and warm.  An hour after eating?  Two runs to the restroom . . . don't think I'll be back.

Cheers!
RS"}
{"text":"I'd consider myself a cheese enchilada snob, and I completely enjoy the cheese enchiladas at this Los Favs! The place isn't fancy in the slightest and it gets crazy busy during weekday lunch time, so it's definitely a \"grab your Styrofoam container and go\" kind of joint."}
{"text":"Boo Los Favs

I've been hitting this location infrequently for many years. I was never impressed with the customer service but the food was decent and the prices decent. 

This morning was the last straw. I ordered a bean burrito, no cheese, on a wheat tortilla. $3 & change. What I received was the smallest burrito I've ever seen at a local non-chain place. This was Taco Bell small. 

I didn't say anything since the two lads running the place already seemed like they weren't interested in offering any more than bare minimum. 

The funny / ironic thing is that I watched the cook make two breakfast burritos ahead of my mini-rito bursting with carne in addition to eggs and whatever else. I mean gut busting size. That carne is far more expensive than my beans that were applied to the tortilla like a thin layer of paint being sprayed on a new McMansion. I guess they are more interested in slinging meat than beans. 

Meh. Los Favs is now in the dung heap with Filibertos. I'm sure I'll be healthier for it. 

(Side note, I have complete respect and admiration for those in the restaurant industry. It's a tough biz. I ALWAYS try to be kind and understanding that it's tough)"}
{"text":"My absolute favorite taco shop. My brother and his high school friends got me hooked. It is a weird location, totally unexpected for good Mexican food. Filiberto's is a mile north, but this is definitely the place to go. New and definitely does not look authentic, but anything with steak is delicious! The only con is that it is not open 24/7.

In short: Great Mexican food at a cheap price. Best taco shop in town."}
{"text":"I stopped in because I searched Yelp for \"carne asada fries\" and this was the closest place to my hotel.

It's not much to look at from the outside.  And really, it's not much to look at on the inside.  But we're not shooting an HGTV episode here.  I'm here for the food.

I ordered up an order of the carne asada fries along with a mexican coke.  I sat down in one of the booths to wait for my food.  The guy called out my order in short time and I went up to grab my food.

Full Disclosure:  This is only my second time trying carne asada fries.  I first them in San Diego a few months ago and just loved them.  So now I'm on the lookout for them whenever I'm west of the Mississippi.

I liked these fries.  The ingredients were a little cheaper than what I had out in SD, but it was still pretty dang tasty.  If you put french fries, guac, steak, and cheese on a plate, I'm a happy man.  The serving size was huge and I ended up taking some of it back to my hotel.

If I'm back in town, I'll definitely try to make it back!"}
{"text":"Come here multiple times a month for our Mexican food fix. Always consistently great. Beans,  rice,  guacamole all good. Love the Carne asada as it's not loaded with salt like others can do.  Really tasty."}
{"text":"I love this place, but this particular location is my least favorite.  The cook staff and cashier are younger and have a don't care attitude and are very unfriendly and emotionless; they are like robots.  The food is still great, but this location is very frugal with their rice and bean portions that come with the combination.  I'm always left wondering where is the rest is.  If you like rice and beans with your combo I would suggest ordering a side of each ."}
{"text":"Not impressed with their food service cleanliness of the restaurant and the overall experience. Got their supreme burrito which should have been a wet Red Burrito filled with shredded beef, green bell peppers, refried beans. It literally had one or two ounces of actual meat the rest was just beans and green peppers. Plus the flavor was seriously lacking. Will not be going back. I asked them about the preparation and all you could say is sometimes it has meat sometimes it doesn't. Very lame excuse. Many other excellent options in the vicinity that I would go to. Maybe even Taco Bell and I hate Taco Bell."}
{"text":"Excellent food and the restaurant is spotlessly clean. I have no idea what the reviewer who gave them 1 star and said negative things about the cleanliness of the restaurant is talking about. Check them out if you're looking for a Mexican food fix. I think you'll definitely be pleased."}
{"text":"They tacos aren't normal mexican taqueria tacos, they are SUPERSIZED! Its a great deal for the price, we had the fish tacos and the carne asada. The fish were battered well and fried to a crisp. The carne asada is chopped finer than what you'd normally expect for a taqueria taco, but it's marinated well. The carne asada also comes with gaucamole, the smoother (a little runny) kind. I prefer the chunky fresh stuff, so I would recommend asking for it on the side rather than on the taco."}
{"text":"Maybe I just came on a bad day but the service of this place was about as rude as you can get. No acknowledgment of your presence what so ever. Just give me your order and shut up kind of attitude. I will never come back.  Aside from service, the food was not very good either."}
{"text":"This is one of my favorite places to go for a quick bite for lunch when I'm craving Mexican. The carne asada burrito is to die for and their fries are great as well. My son's really like their quesadillas as well."}
{"text":"This place is the shit. They've got some bomb ass food. It's not the fanciest, but for a taco shop, it's damn good"}
{"text":"This place is awesome!  Go here all the time and carry as well. Love the tacos and churros."}
{"text":"I'm glad there's one close to the house now and they are quick. Food is amazing everything I have ever ordered has been good."}
{"text":"Best Mexican food around. I teach at a local high school & we come here often to get good food. I love their Carne Asada burrito and the main cashier knows my order so he punches it right up. Their red hot sauce is really good, too. This is good for eat in (but not a lot of seats) or take out."}
{"text":"Great food. Excellent flavor. Always fast and a good place to go. The burritos are big, and the tacos are good. The sopes are great just a little messy"}
