{"text":"Awesome breakfasts - great food! can't wait to go back to this place when i visit Phoenix. Drive through was friendly and prices and portions excellent ! don't miss this one"}
{"text":"I wish I could give this place 0 stars. They had a deal on the menu for 12 tacos for $10 but when I ordered 6 tacos I somehow got charged $18. And as if that wasn't bad enough, the tacos weren't even good. $18 for some meat and lettuce. I will not be back."}
{"text":"04/06/2018 @ 7:15PM: Very disrespectful staff. Immature girl in the drive through straight out said \"No\" and laughed when I asked if she could add pico de gallo to my order. Proceeded to mumble something else when I asked \"what?\" And then she didn't take my order. I backed out of there and left, I dont trust someone who isnt serious preparing my food."}
{"text":"We love this place. We've probably been here a million times. Cuz we live literally one minute no exaggeration. The only thing we ever get is carne asada fries which are soooooo bomb. We like em extra crispy. We did have issues with incorrect orders in the past due to miscommunications but if you just voice your issue to them they'll accommodate.   We also use to come here when they were juliobertos and they're almost the same thing. The only difference is the prices, which have raised in the past year by like 50 cents to a dollar."}
{"text":"Great chicken enchiladas, huge portion and lots of rice and beans for a reasonable price."}
{"text":"Love this place! Great food.. Love the chicken chimi's. We come once or twice a week. Huge plate of food. Highly recommend it!!"}
{"text":"This place is pretty affordable and delicious. They give you a lot of food you never thought they would.its comfortable and decent.I'll definitely  be coming back to this location.thanks for the experience."}
{"text":"My daughter and I were running errands and decided to pull over and look up some Mexican food on yelp. We found this place with 3 good reviews and it saw very close to where we were. We went through the drive through at 3:30pm and no one else in front or behind us. Since we we super hungry and it was our first time we wanted a few minutes to look over their menu. We were pressured to order and I even mentioned we will just need a min and that no one else was behind us. We were still getting rushed to order so we ordere two carne asada burritos and two drinks. Our total bill came to $17.77. We get our food and drinks and we both agreed our burrito's were cold, very dry, and the meat looked spongy. As I was chewing I bit down on something hard and it ended up being a piece of avocado skin. As I took another bite something else wasn't right, I spit out the food and found that I was chewing on a price tag sticker. I was done eating after that! We were hoping for a juicy carne asada burrito bursting with flavor. We won't be returning."}
