{"text":"Very good food and super nice people.  Clean and hospitable.  The tortillas are homemade with lots of fillings.   Taco truck is currently located on corner of Deer Valley Road and Hwy 60 during the day and at 15445 N Greasewood Street in Surprise in the evening.  The day location is great for that area because there is just no place else up there to stop for lunch.  Thanks!"}
{"text":"La comida de los 3 tacos del rey son super deliciosos vengan a probarlos tienen una buena variedad decarnes  y lo mejor las tortillas echas a mano"}
{"text":"I went for the first time today and was very satisfied. First off the customer service makes you feel right at home. You order at the window and then take a seat. While you wait you can sip your Mexican Coke and snack on the roasted peanuts set on the table. If you choose to dine there, your food is brought out along with 3 different salsas. All 3 salsas are amazing! We ordered al Pastor tacos and we loved the flavor of the meat. It was also very tender and went great with the handmade corn tortillas! If you're not a fan of onion and cilantro be sure to mention that when you place your order. Once we were done eating we decided to order dessert. They have a few options but we went with the Plantains. They were served warm, drizzled with lechera, strawberry syrup and confetti sprinkles. This place made our night!  PS: they have a punch card!!"}
{"text":"Ever wonder what a true authentic street taco experience is like south of the border? This taco truck is also located on El Mirage Rd and Northern during the day, on the side of the road... don't let that deter you. The food is by far the best I've had on the Northwest Valley! The corn and flour tortillas are handmade and they have a large selection of meats to choose from. The owner is very friendly and goes out of his way to make customers happy. I will no longer have to go out of my way to the Central Phoenix area to have authentic street tacos!"}
{"text":"You might want to change the hours on Yelp, they are not correct. I just stopped there a few minutes ago and it's 4 p.m. and they were open. Now for my review, those were two of the best little tacos I've ever had! The cilantro and onion were perfect the steak and chicken tacos were juicy and Delicious! Oh and the red sauce, amazing. I also peeked inside of the taco truck and it looked clean and well-kept meaning the chances of my food being sanitary was high :-) if you are ever on the way somewhere and you pass this little stand you have to stop! I will definitely be back the next time I take a trip to American Furniture Warehouse as it is on the way."}
{"text":"Decided to one day finally stop to give it a try, it was throughout the day so that's when they're located in northern and I LOVED their food! It's authentic Mexican food, nothing compared to the restaurants around the area, the owner was friendly and they've punch cards for frequent customers that after so many times going you get $8 off your meal! Best food truck out in this area."}
{"text":"See the truck every day and decided to stop. Aside from a select few places this place has some of the best carne asada ! Will return shortly. Shop small."}
{"text":"This taco trailer doesn't jump out at you. My dad and i decided to give it a try. Good establishment. Shade, tables, napkins, chairs, music, everything you need to be comfortable to stay and eat or take it to go. The food was really good. Breakfast burritos (chorizo and egg and beans with pico) the beans were really tasty. Their red and green sauce was also really good. I'd stop by again if i saw them on the road."}
