{"text":"Oh. My. Goodness.  Since I'm vegetarian, I can only get a bean and cheese burrito (yes, I know the beans are made of lard).  But I still love this place!

+ Prices are cheap!  Good, cheap Mexican food always sounds good to me.

- Location.  Kind of hidden, hard to find.

+ Horchata.  Yes, mmm, horchata.  It's really, really good here.

+ Better than Filly B's by far.  Just the right amount of beans and cheese in a warm but moist tortilla.  Heaven in a wrapper."}
{"text":"If the staff isn't over flooded with orders the food and service is fine. If they are busy they ignore call in orders and the burritos kinda of suffer."}
{"text":"Los Favs is my go-to spot for when I'm craving quick Mexican food. The food comes out within 5-10 minutes. I always get the Bacon Breakfast Burrito ($5) or the Carne Asada California ($6). The Carne Asada Fries are also a great option. The portions on the food is a good amount. I can barely finish a whole burrito and often have a little bit left over. Don't forget to try their sauces! The red sauce is definitely my favorite out of the two because it has more kick to it. Overall, Los Favs is a great option for when you don't want to break the bank on some delicious Mexican food."}
{"text":"I love this place!!! Lots of space and cheap, TASTY Mexican food. Not much more than that needs to be said."}
{"text":"Really SLOW service. They might have been killing the pig to make my chorizo burrito."}
{"text":"Was in the neighborhood and in the mood for fish tacos. This place is for students but you know it's legit cos the working class Latinos are mixed in the bunch and the qhole staff speaks Spanish first. Anyway, the tacos were big enough and piled high. The red salsa is hot enough, not sure the green has anything in it. Fresh pico with cilantro.2 tacos and beans for $8.75."}
{"text":"One of my favorite taco shops. Food is consistantly good and prices are very reasonable. The staff is plesant, helpful and fast."}
{"text":"The best mexican food ever!

This place is really cheap for the type of food on your plate. There burritos are huge! but my favorite is their chicken enchilada, everything works so perfectly and the sauce is just the finishing touches. The tacos are also something to die for. 

I would really recommend this place to any wanting good mexican food. This place is really legit compared to others around the area. Prob the only mexican food in the area that doesn't make you take a mean sh!t after."}
{"text":"My favorite thing are the shrimp tacos. I think they are $2.50 and quite delicious. The location is right around the corner from my apartment so my boyfriend and I frequent the place. My boyfriend likes the breakfast burrito and the super burrito, which is like 2 feet long, but it still has a lot of filling inside."}
{"text":"Okay for starters I'd give this place 0 stars if that was an option. This was hands down the worst Los Favs I've ever been to and let me explain why... 
So for starters I went to get a drink and wait for my ride which took about 20 minutes and I wanted to pass time so I went to claw machine. I got there and a bear was dangling off the claw so I was happy and put a dollar into the machine for two turns and played. It didn't fall after repeatedly hitting the side and I never got my second try. I went and asked for 50 cents for the second try and one of the workers rudely told me they don't have the keys for the machine, I understood because they never saw me put a dollar in and I get it so I asked for change for a 20 and she told she only had a dollar in her drawer and pulled the last dollar to show me. Right after I asked for the change she took the tip money from my view and went to the back and came back with a empty jar assuming I was going to steal the money! I sat down and kept drinking my lemonade still waiting for my ride and two customers after that whole tip money incident had a 20 and she gave him change from the second drawer. This highly upset me, and I felt like I wasn't treated equally. After this she threatened me that if I don't order food that she will call the cops on me. So I told her she can call, for the fact that I did nothing wrong. A few minutes later she changes her story and said she's calling her manager instead! So my ride came and told me to get them a bean burrito so I go up the counter because not only did I want to order I wanted to get this rude and unfair workers name. Before I can even walk up to the counter to order she took off her name tag and put it in her pocket! She refused to give me her or her managers name. If she didn't want me knowing her name, she shouldn't treat customers so disrespectfully. While I was at the counter trying to order she didn't want to take me as a serious paying customers and insisted that the customers in back of me go in front of me! Not the way the business should be runned. Stay away from this Los Favs! 

I'm not trying to be the bad guy here, I just don't think this is how a business should handle their customers."}
{"text":"It's really good americanized mexican food. I get bean cheese and rice burritos and it is always good without fail. They also have great horchata."}
{"text":"Breakfasts burritos are awesome! Can be very busy during the day. Clean establishment fairly priced, and good food."}
{"text":"Sitting in here right now! The girls who work the register are always so rude and unfriendly. I love their food or I would never come here for that reason. They never answer their phone for carry-out orders when I call, but always seem to be on the phone when I'm in the store! I don't know if they don't think customer service isn't important or they don't care but they should seriously consider being nicer to their customers. Especially ones who come often."}
{"text":"Got the lengua burrito and a horchata. They were a little slow on the service, but granted I came in a large group and they seemed somewhat overwhelmed. The lengua was nice and soft, but I kind of wished it came with beans and rice inside the burrito. The lady also only gave me one container of each salsa (red and green) and wouldn't give me more, which would have been nice to have with the rest of my burrito. Horchata was pretty good though."}
{"text":"If you're looking for authentic, keep driving.  I've never had anything here that remotely wowed me, and I've tried their chain several times.  I should have realized this was going to happen too, when everyone who recommended it thought Filliberto's is good.  Just because you see the red and green sauces in the little plastic ketchup bottles that remind you of your last trip to San Diego doesn't mean it's authentic.  It's good for white suburbanites, I'll give them that much, but then again, so is San Diego.  One word: gringo."}
{"text":"Love the breakfast burritos.  Favorites are the chorizo breakfast burrito and the bacon breakfast burrito.  They aren't gigantic like some other places, they are a manageble size and quite tasty, with seasoned potatoes, cheese and eggs along with the meat.  You can call and order ahead, too!  These are my favorite breakfast burritos by far, flavor, price and size, and I go out of my way to still go here even after my office location moved and it's not convenient anymore."}
{"text":"Eaten here a few times, everything has been great, no complaints. The chimichangas are really good, they put beef, green bell, onion, cheese, guac, sour cream, and beans. I love those things. Cashier is really nice and always smiles at me : )"}
{"text":"By far the best breakfast burrito I've tried in my 21 1/2ish years I have been on this planet!

And I am a tough judge. I generally only eat breakfast if it's really worth it. No time to cook before school can only mean limp boring toast or cereal. I'd rather skip straight to the coffee.

When I have time to make something, breakfast burritos are at the top of my list! I'm a pretty good cook, but nothing I could ever make would compare to Favoritos.

I used to order the ham&cheese burrito and have since mixed in the chorizo burrito. They are great! Filled with eggs, meat, potatoes, onions and a great blend of spices all wrapped up in a doughy tortilla.  They also will give me as much hot sauce as I need, which is usually a couple tubs. 

I would go far more often if I lived closer! I still pretend I am a regular."}
{"text":"I love this place! The carne asada is amazing and flavorful. Everything I've tried here is great. I've worked a bunch in Sonora and Baja Californa Norte, and this is the closest I could find to roadside tacos in Tempe."}
{"text":"Food was good. Girl taking order didn't pay attention to order and screwed it up. Cook yelled at her. 
Fire that chick and it will be a 4"}
{"text":"This place is close to my work and often we order burritos for breakfast, I normally call the night before to place my order but when I get there the next morning it's not ready or the pull in about 45 minutes later then what is advertised as their hours. The manager/ cook is very rude and unprofessional, he was talking crap about me in Spanish little did he know that I understood everything he was saying about me so when it was time to finally get my order I reply back \" Muchas Gracias \""}
{"text":"Overall, los favoritos is a pretty good spot for some fast tacos at an affordable price.

The chicken taco has an interesting flavor and texture with the crispy shell and the onion and green pepper mixed in with the shredded chicken. I would order this again.

Carne asada is pretty standard, guac is smooth and has a good flavor."}
{"text":"In a city overrun by mexican fast food, one taco shop must have the huevos to stand above the rest...  Their hours aren't as friendly to the late night crowd as say, FIliberto's, nor is their kitchen as fast, but Los Favoritos' food blows them away.  Food is cheap, and the lack of decor means you end up staring at other patrons, but Los Favoritos is always clean and the people taking your order are friendly enough.  For fast mexcian food, Los Favoritos is as good as it gets."}
{"text":"My boyfriend for months has tried getting me to enjoy Filiberto's, but I just can't stomach it. I've tried numerous items on their menu and all have left weird tastes in my mouth. But one night we decided to give Los Fav's a go and I have fallen in love since! I've tried their breakfast burritos, their nachos, their carne asada fries, a lot of different items! I love all of them. I'm a way too picky eater but they make it so easy for me. Just the other day I called ahead and the young lady who was working took my order over the phone and it was ready at the exact time I walked in the door to pick it up. They are always so nice and friendly and quick too! I love this place, I'm a new regular!"}
{"text":"The breakfast burrito was amazing! The girl at the counter was friendly, kind & helpful! I enjoyed the food and experience!"}
{"text":"I don't know everything about this place.... but what I do know is that they have the most killer burrito and it's only 4 bucks. Did I mention it's the size of an infant!

Seriously, I have lived in the Southwest for 4 years and this is by far the best breakfast burrito I have ever had. Heck if you come here you might even want to try out lunch or dinner. 

Inside is a little retro/old school with minimal furnishings, tables and chairs but sit down and eat it. Or if you don't like the inside just take to go and eat it at home."}
{"text":"This is hands down the best burrito in the East Valley! Fav's is always consistent and their prices are excellent! My standard meal is a California Carne Asada burrito, it comes with the most tender carne asada I've ever had. Also, their green and red sauce is a step above the competition, and they have great mexican rice, it comes with peas and carrots! Guac is exceptional, and they also have really tasty breakfast burritos that are available all day. Five stars for being consistent, clean and for having pleasant and professional employees! One more thing is that they close at midnight except for Sunday when they close at 10. Bummer but still the best!"}
{"text":"Nice . Tried cheese enchildas with rice and beans. Quite different from other Mexican restuarants have tried so far. Had vegetarian options.."}
{"text":"Food is ok...little pricey for what you get... Only reason I go is because it's super close to where I live..I always get a not so good vibe from any of the girls at the front. No smiles and they all appear to hate there job! Smile...at least!!!!!"}
{"text":"Really good food, especially for a taqueria. Great breakfast burros, taquitos, and my favorite...surprisingly fantastic chiles rellenos. Definitely worth a visit, especially for tasty, quick, and inexpensive Mexican food."}
{"text":"Pretty good breakfast burritos, the carne asada and chorizo are the only ones i've tried. The salsa isnt very flavorful. Much better than Fillibertos."}
{"text":"I've come here a couple times now and the quality of service and food has steadily declined. Had the famed breakfast burrito finally. It was charred beyond recognition and when I went to return it and I was treated horribly by the girl in the front.  Not coming again. 

This is no longer my favorite taco shop."}
{"text":"WOW the reviews were not lying! I just killed their breakfast burrito. Honestly I think its the best I have ever had! Also I paid $4 bucks for this amazing burrito."}
{"text":"Horrible. Raw tortillas and cold food"}
{"text":"The best breakfast burritos EVER!! I used to be an avid Filibertos fan but ever since I went to Los Favoritos Taco Shop, I have never went back to Filibertos! Me and my wife have been going here for years I love their chorizo
 breakfast burrito, and my wife gets a shredded chicken bean and rice burrito she loves it, I love it. Nice quick fix in the morning or even in the afternoon if you're into breakfast for dinner, we are! All in all, a great place to eat, great prices!! Good job guys!!"}
{"text":"This is a good quick on the run taco shop.  Tucked back in a shopping center.  The place is smaller.  The tacos are decent and my kids love the burritos."}
{"text":"Just found Los Fav even though I've been living in Tempe for a few years. OMG! Gem of a taco shop. This place can get busy but they are fast! We usually call our order in and it takes about 10-15 minutes on average. Very authentic Mexican food. You can look in back and see everything being prepared from scratch. The service is always great and you can't beat the prices! I haven't had anything I don't like yet. Both their red and green hot sauce is fantastic! Spicy but not too spicy and they both have great flavor, not a flat chile flavor like some places. They have the best Vegetarian burrito! Simple but oh-so-good! Rice, beans, pico, guac, lettuce all wrapped in a giant tortilla...you can add cheese too! They have fresh tortilla chips for dirt cheap, very good with the hot sauce. 75 cents for a small bag and $1 for a large...yes... that cheap! Good enchiladas, quesadillas, etc...You can get a huge dinner for two for less than $10 and I mean, a lot of food! This is the perfect little taco shop. The kind you can roll out of bed to, in your pjs, after any kind of night and know you're taste buds will be taken care of. Definitely recommend."}
{"text":"This place is bomb! The food is delicious and affordable."}
{"text":"The food is on par with Filberto's but this restaurant STINKS - literally! Their oversized street style tacos are actually pretty good, but the SMELL of this restaurant is a nauseating unholy combination of burning cooking oil, disinfectant and insecticide that could kill anyone's appetite. And to top it off, a big horsefly died at my table while I was eating. Disgusting!"}
{"text":"Picked up the carne asada fries here.  First time I have ever had this Mexican fast food delicacy.  They were pretty good!  The portion is very large, they use shredded cheese (not nacho cheese sauce), and the ground beef is seasoned, though it's a bit chewy/fatty with some gristle occasionally.  The fries were hot and crispy.  Dining companion got the chimichanga combo and said it was good.  I've only been to the Chandler location before, so it's good to know this Tempe location is okay too.  The atmosphere is pretty nonexistent, and there aren't even any booths (but there are a claw machine, Pac-Man, and sticker coin machines) but that's okay.  The food is what's important!  I did notice that the prices are much higher than I remember the prices the Chandler one had a few years ago.

Stomach was a little \"ugh, that was greasy\" feeling after, but could've been much worse.  Debating between two and three stars and going to go with three for their hours and order accuracy (I've had to get my order redone multiple times at Los Tacquitos so I was very happy it was correct the first time here)."}
{"text":"I've been coming here for several months thanks to the suggestion of you fellow yelpers! All I get is the breakfast burrito w no meat (potato, egg &cheese), so I can't speak to their other menu items.  The breakfast burrito is delicious. Rarely can I go a week without having one. It has the right amount of salt and spices and the tortilla is fresh and slightly flaky.  Prompt, friendly service."}
{"text":"Best deal here you may ask yourself? The carne asada burrito special place. Inside this deliciously wrapped tortilla shell is the carne asada steak, pico, and guac. Absolutely heaven with every bite accompanied by their green or red hot sauce. Sides that come on the plate also include Mexican rice and refried beans. Both spectacular and delicious!!!!!! Ask for limes too when ordering. Fair prices all around"}
{"text":"for semi-sketch super authentic mexican food, it doesnt get any better"}
{"text":"I have had almost one of everything off of their menu and have yet to be disappointed!  The staff is very very nice, and the food is great.  One of my favorites is the shredded beef torta!!!"}
{"text":"They always give you tons of food for a decent price...tons of food for $10!  But I feel like whenever I come here I wait at least 10-15 mins to get my food even when I'm the only one here. That's the only negative thing I have to say otherwise I love this place"}
{"text":"This is the best taco shop ever! I work and live near by and stop by here ALL the time for lunch. I love there carne asada tacos, cheese quesadillas, rolled tacos, and bean and cheese burritos. Pretty much anything here is awesome."}
{"text":"ZERO STARS!!!  FOOD POISONING!!   STEER CLEAR!!  I am missing work because these lazy careless workers mishandled my food - which leads to food borne illness.  I used to go to the Los favs in Chandler and it was good back in the day but every time I've come to the tempe one something seems slightly off.  Never again!   I'll forever stay away from all Los favs from now on as a result of this experience.  If you want to be violently ill, please go to Los favs.  If you value your health and wellbeing go elsewhere"}
{"text":"Yo, los Favs does not fuck around when it comes to their red sauce. Holy hell is it spicy, and I eat spicy most days of my life. I was all sad I only got 2 salsas with my chorizo burrito, but that was the perfect amount because you don't need to drench your food in hot sauce like you will most places. Definitely better than Filiberto's or a lot of other small taco shops. I've worked my through most of their menu at this point.

++Chorizo burrito is excellent, especially when they get the meat/potato/egg ratio perfect 
+Their tortillas are amazing
+Enchilada sauce is flavorful
-Beans are too salty in a bean & cheese burro
-Tacos, while delicious, are pretty greasy and the shell often falls apart before you even take a bite

Service isn't always the fastest, but the dude at the counter early in the morning always kills it. The younger girl that works in the morning is super sweet."}
{"text":"I have been to this little taco shop a couple. Both times I have been highly satisfied with the food. It can take a minute to make since the place can get busy, especially at lunch time. However the food is worth the wait! It's cheap, filling, and tasty! It's also nice that the place is open early so that you can get your breakfast burritos, but also open late so that if you are craving a burrito you can still get one!"}
{"text":"Cheap. Tasty. Good carne asada. Hot red and green sauce upon request. I love their rolled tacos with guacamole, smothering in before mentioned hot sauce plus a horchata. Extremely ugly interior with a lonely claw machine in the corner plus an always amusing clientele set."}
{"text":"Best Mexican food in the area. Cheap but not where you will get stomach pains for two days. Great price for the quality. The veggie burrito is delicious. Perfect amount of guacamole, cilantro and cheese. It is made just perfect. Go when its not too busy, because it comes out better. :)"}
{"text":"Everything here is good. I'm from LA and ww have bomb Mexican fast food. Los Favoritos is filling the void in my life. I am used to Albertos, out here it is called Fillibertos, and this annihilates them all."}
{"text":"My fiancé was eating here. Ate half his burrito before he looked at it. The entire inside was laced with hair. This place needs to be shut down."}
{"text":"Great cheap mexican food. Not greasy and made fresh. California burrito and super nachos are excellent."}
{"text":"I was recommended to stop here before heading back to CA. They have the most delicious breakfast burritos. I got the machaca and had them add beans. One of the best I've had. The beans are amazing. My husband got the egg and potato, which he loved. The service was great and very fast. I will be back the next time I'm in AZ."}
{"text":"Good food at a good price, especially for college kids. The breakfast burritos are always on point, along with the carne asada fries. But they take forever and leave you on hold if you try to call in an order ahead."}
{"text":"I really like this place. 
I have had their fish tacos, chiladas, tacos, chicken burrito, Carne asada, quesadilla,  breakfast burritos, salsas. And nothing is bad. I mean really, they are pretty damn tasty. 

I love their breakfast burritos. They actually have good flavor! The decor isn't special but they do a good job of keeping the place clean. Good spot to get some tasty food. :-)"}
{"text":"Been getting burritos here for over 8 years now - friendly staff and excellent affordable food. We rotate between their chili relleno, chili verde, shrimp, carne asada, fish and chorizo."}
{"text":"I love this place for its cost and food!
I order the Taco Salad with Ground Beef instead of Shredded beef and it is always delicious.
I also enjoyed their Carne Asada Fries.  My co-worker enjoyed a massive burrito,  I definitely recommend trying them out.  They also are open late which is a plus."}
{"text":"I'm giving this place a 5 based only on their delicious breakfast burritos! They're also very speedy too."}
{"text":"BEST BREAKFAST BURRITOS EVER!!!!! They take phone orders which is amazing if you just want to pick up"}
{"text":"Why is it so hard to deep fry your frozen rolled tacos to a crispy finish so I can enjoy a crunchy experience the whole way through? Only the ends seem to ever be crispy at any Valley taco shop. The middle remains a soft mushy mess of frustration time and time again. After I eat your lousy rolled tacos, I can never go back because if you can't accomplish that feat, then the rest of your food will likely fall in line. The six rolled taco combo was also kinda cheap-ass. They only put guac on the things, no sour cream, lettuce or anything. Let's also throw in the fact that you must pay for the hot carrots and your lack of a salsa bar is ignorant in 2013. Oh, yeah, the cheese quesadilla was the only redeeming item I purchased. After four green beers, usually most Mexican food tastes good, but this meal was a glaring exception."}
{"text":"I've only ever had the carne asada quesadilla and churros, but they are damn good."}
{"text":"Good food at a great price! Sopes are superb! One of my favorite restaurants! If you want good food and a quick pace without sacrificing taste this is the place!! There is a reason they are across the valley!!"}
{"text":"Oh, Los Favoritos, you are breaking my heart! This has been a go-to spot for me when in the mood for crunchy tacos. They've always been very friendly, and the food has been good. Lately, though, things have been going downhill. Last night, my tacos barely had any meat in them, and everything was over salted. The beans were especially, inhumanely over salted. I mean, to the point where they were inedible. My request for \"no cheese\" is usually not a problem, but on this occasion, my chicken taco had cheese kind of hidden between the meat and lettuce. It was a very disappointing experience. Since I had ordered to-go, I couldn't really get this corrected. They've recently remodeled the dining room with nice looking booths, so I suggest trying this place, and I will again, but eat in so you can have them fix anything that might come out wrong."}
{"text":"Tried this place out just yesterday, and sure it took us a little while to get there since it's a little hidden but once we got there it was all good. The cashier was very nice, and pleasant. The food.. . .it was average. I ordered the carne asada tacos combo, beans okay, rice good, tacos were a little on the bigger side and single tortilla ( and well say whatever but I'd rather the traditional smaller tacos with double tortilla), but hey not too many complaints about size either. I was also somewhat upset the sauces offered were not a bit hot, I certainly like to add some spiciness which Mexican food is associated with, but not possible here. So I guess above all the place is a very standard place for mexican food, the store its self is a little . . .well ugly, but food is decent, and service was fine."}
{"text":"LOVE THIS PLACE! For a chain, the food has stayed pretty authentic. Lately, I've been calling in my order and arriving about 10 minutes later and the food is ready. The prices are very cheap and the food is fresh. I get the rolled tacos or the California carne Asada burrito every time. I recommend the chips and guac and the horchata as well."}
{"text":"I went there after reading the Yelp reviews and because it was only a few minutes away from my families condo! I had the Carnitas and Fish taco one day and a Chorizo breakfast burrito the other day. All were really yummy and the ladies working there were very nice! If you're in the area it's worth a try and it's cheap. They also serve the breakfast burritos all day, a plus!"}
{"text":"Best Carne Asada Fries EVER.

The end

Just go and order them and thank me later."}
{"text":"These burritos are on a whole other level. I don't know how they do it... But I sure do love it. Burrito Heaven. 
Especially Cali Carne Asada Burrito!!!
O_o"}
{"text":"Best mexican food everrrrrr.  Seriously.  Not as greasy and more authentic than Fiibertos.  Fast and friendly service, great prices, and it's always clean.  The decor in the dining room is pretty hilarious, but all the more character it adds I guess. 
My favorite part is the vegetarian options.  Try a veggie burrito with added potatoes (they're not actually just potatoes but more like tiny french fries), put a little red AND green sauce in it, and get ready for heaven."}
{"text":"Maybe this was an off day for Los Favoritos... but whatever the case I won't be giving it a second chance. Because of all the raving reviews for their breakfast burritos we decided to try them. I have never had a burrito more gross than the one I ate this morning. Stale tortilla, greasy potatoes, bland flavor. Everything was bland; the salsa, guacamole, beans. We were both so disappointed. It was like eating a flavorless brick.  The customer service was subpar as well. The lady at the front counter was rude to us and wouldn't even offer a smile or greeting. 

Again, maybe this was an off day but I was sorely disappointed. I want a burrito with flavor, freshness and excellent salsa. Phoenix, help me out- where does this exist??"}
{"text":"Excellent breakfast burritos and the restaurant is very clean too. Some mexican food restaurants leave you smelling like grease from the kitchen, not here. The green salsa was perfect on the breakfast burritos. We will definitely be back when we are in town again!"}
{"text":"My boyfriend & I love Los Favs! We go there weekly & the gal who takes our order remembers us each week! We regularly order a variety of meat in crispy & soft tacos, the chorizo breakfast burrito is delish & the rolled tacos are also good. We always order carry out & the food is hot & yummy when we get home. Definitely recommend!"}
{"text":"I love this place. It's cheap and it's yummy. I tried beef/chicken/fish tacos and burritos and none of them let me down. My favorite is the carne asada burrito. It's big enough to fill you up and very delicious."}
{"text":"Decent fish tacos. Ask for extra hot sauce, they use the tiniest cups ever."}
{"text":"I like this place. Food is yummy. Ground beef options, which I like (not all taco shops have ground beef options, BION)

I'm a frequent repeat customer, which says a lot considering Mexican food is not even in my top 5 favorite foods!"}
{"text":"Decently priced and quality. I tried  the chicken burrito with chips and salsa. Everything was super fresh. Even the chips were fried fresh. Very happy with my meal"}
{"text":"Delicious! I've been going there for seven years and it has always been amazing. California burrito, breakfast burrito, jumbo burrito or carniasada fries it does not matter it is all good and the family that owns it is awesome as well!"}
{"text":"I don't know why this place has a decent rating. The food was so flavorless to me, it was like fat on fat with zero spice. I know a lot of guys that eat the carne asada fries, but their burros and such were not exactly amazing."}
{"text":"Without a doubt the best cheap Mexican food in Tempe. They have way more quality than filibertos and are the same price of not cheaper. Their burritos are fresh. Their breakfast burritos are JH just under $5 and the bacon version is large and bomb!"}
{"text":"Best Mexican food joint in the area, especially when you consider their prices. I've been coming here at least twice a month for the past two years and the cooks in the back deliver a consistent product in regards to both texture and taste."}
{"text":"Los Favoritos is a great place to swing by and pick up some tacos. Their menu has a lot of options all at a decent price. I believe there are a couple locations around the valley so that is good to know! Once you order, they are pretty quick to prepare your food. I love their carne asada taco, it is just the best!"}
{"text":"Los faves Tempe will forever remain one of the local GOATs around these parts of town. Just about everything here is the bees knees. 95% of the time i stick with their line of gourmet breakfast burritos. From bacon, to their ham, to even the chorizo, these are some of the better breakfast burritos in the valley. The only issue with faves after about 5 years of venturing here are the burrito sizes (I'M LOOKING AT YOU, COOKS IN THE BACK). Most of the time i'm guaranteed a pretty thick sized burrito, but every once in a while ill come in and pay 5$ for a glorified taquito. That's a no-no when it comes to keeping your burrito savvy customers satisfied... If faves served some infant sized burritos like some of the other places around town, this would be the best taco shop in the land.

Nonetheless if you have never been here, definitely come in and give it a try. Just avoid Saturday mornings, some of the longest waits/lines in burrito eating history have occured at los faves on a Saturday morning. Apparently the local college crowd has the same hungover breakfast burrito urge that i get on these weekend mornings..."}
{"text":"My experience at Los Favoritos Taco Shop was a positive one. Normally I try to stay away from small sized Mexican restaurants because the food usually isn't all that great and a little on the greasy side. Places such as Filiberto's or any other restaurant in Phoenix ending in \"Berto's\" are usually the restaurants I avoid because of how my stomach feels after eating one of their burritos. 

I was craving a breakfast burrito one Saturday morning and I decided to use Yelp to search for a restaurant in my area. The first restaurant that showed up was Los Favoritos so I decided to give it a try seeing how the numerous reviews gave the restaurant a good rating. My favorite burrito to order at any kind of Mexican restaurant is a good old fashioned breakfast burrito with ham, cheese, and potatoes. So I ordered the ham breakfast burrito which I think at Los Favoritos their specialty is in fact the breakfast burritos, I could be wrong. 

The wait was not long at all and I could hardly wait to start eating my burrito when it was handed to me. Of course you have to try both of the sauces, which were your typical red and green. The burrito was sooo good, I've ordered burritos from everywhere around Phoenix and this breakfast burrito was among the best. The burrito was far from greasy, you know when you're eating a greasy burrito when the grease pools down from your hand into the wrapper but this wasn't the case. The ham was moist and chunky, the eggs were, you know, eggs, and the potatoes were crunchy. They reminded me of hash browns which I thought was really good because it gave the burrito a different texture. The sauces made the burrito even more tasty and moist but they weren't as spicy as I'd like them to be. 

Overall, I give Los Favoritos Taco Shop 4 stars out of 5. The next time I go I'll make sure to order something different than a breakfast burrito. But this place does not disappoint if you're looking for inexpensive, Mexican fast food."}
{"text":"Breakfast burrito  and even the regular burritos. This place is consistent and delicious. And the girls who work the front are always nice and helpful!"}
{"text":"We had the bacon breakfast burritos: Yum! The bacon was crispy, the tortilla tasted homemade and the ratio of bacon to potato to cheese was perfect. These are the best breakfast burritos we've had in a while."}
{"text":"Jumbo burrito is booombbb. Everywhere I go and get carne asada anything,  the carne asada comes out chewy or nervy, it grosses me out, but this place actually had good carne asada In their burro. 
 Horchata is good too"}
{"text":"I LOVE the breakfast burritos here, especially with bacon. Haven't tries the lunch dishes yet, but I will eventually!"}
{"text":"I went to Los Favs this afternoon. Although I've been here countless times since I've moved, today showed me exactly how much I love this place. 

For a completely unnecessary reason the cashier was being talked down upon by a unfriendly gentlemen customer. Instead of retaliating, she kindly handled him his refill and went about her workday. This takes a truly amazing person to not give in when others are pushing you. When I stepped up to give me order she was nothing but friendly to me. That alone in my books is enough to keep me coming back time and time again.

Aside from the customer service, the food is always delicious, generously portioned and speedy. I make it a point take all of my out-of-town friends here when they visit. Highly recommend. If I could give more than five stars, I would."}
{"text":"I go to the one in Scottsdale all the time and it's easy a 5-star. This one, the food is good still but the customer service and atmosphere are terrible! The cashier told me to go get my own ice for my Jamaca drink even though she has to fill it up. She couldn't walk 5 steps?! On top of that she was flat rude during the entire process."}
{"text":"Stopped by for two red chili burritos around 1pm on a Saturday.  They were out of red so I ordered green. As I waited and saw a few small groups of customers after me receive there order before me I asked for my order and the cook says \"it takes a few minutes for the chili to boil\" 45 mins after ordering I got my order. TWO RICE BURRITOS WITH SPOONFULL OF GREEN CHILI! Never again!"}
{"text":"I came here last night after craving carne asada all day.  So I hopped on over here after work and almost missed it because it's tucked away and it's super small.  The burrito did not disappoint.  Carne asada was perfectly seasoned, tortilla warm and slightly toasted, guacamole and pico de gallo with just enough kick... I admit that I'm drooling just a little bit right now as a write this.  If it came with a little rice inside I would have given this place 4 stars."}
{"text":"I love this place!  They have an extensive menu, but will also throw whatever you can think up into a breakfast burrito.  Chorizo, carne asada, bacon, and egg? No problem.  This is my go to spot for hangover food."}
{"text":"So after living in Tempe for 5 years, I finally decided to drop in and check the place out. Total dive restaurant, but usually I have found, the dive restaurants usually have some of the best food. I have come here for breakfast now many times, their burritos are huge and flavorful. My only gripe is they use french fries for the potatoes in the burritos. If they made their own home fries in the burrito, I would dub them the perfect breakfast burrito. I have yet to try the lunch/dinner entrees, maybe one day!"}
{"text":"Did not enjoy this at all. Meat had decent flavoring, but my chicken quesadilla was almost entirely onion and there was hardly any meat. Definitely not satisfactory. The carne asada fries are okay, but we will not be going back."}
{"text":"Not very good!!!  My breakfast sausage burrito was too salty and dry.  My mom's chicken enchiladas meal was bad!  It was more of a fajita than a enchilada.  There was green bell peppers in the enchilada!!!  Who puts green bell peppers???!!!  The beans were spoiled!  They were sour!  The only good thing was the rice for my mom's meal.  This was my first time and last time I'll be going there!"}
{"text":"I ordered 20 burritos for pick up early in the morning for my staff meeting and they were ready right on time. I also asked if they could please be cut in half's and they were able to accommodate me with the order. When I arrived this morning at 645 to pick them up they were ready and nicely packed to go. However I should have checked the bags because there was not enough salsa or enough napkins that were packed. The staff was nice, but I felt a little rushed and like they really didn't want me there. I have a feeling they were short staffed, but I will be going back because the breakfast burritos overall were delicious and all my teammates really liked them as well."}
{"text":"I woke up with the largest craving in the world for a green chili burrito. I went to \"Los Fav's\" as we tempe folk call it and conveyed my enthusiasm to the girl at the register. 

All I wanted was a green chili burrito, with chicken instead of pork. 

Instead, I was given a plain chicken burrito with flavorless mexican rice. I cannot convey the amount of disappointment I felt at that moment. In fact, I was so disappointed, that I threw away the burrito after about three bites and told my roommates that I had just experienced the worst tasting burrito that I have ever had in my life. Then, my roommate suggested dousing the burrito in hot sauce to the point where I could only taste the stinging sensation of the red sauce. I concurred, that just about anything would be better than tasting the poor excuse for food that I had been given but it was too late for that. By this time I had lost my appetite. 

I was stuck in some sort of appetite \"limbo-land\" where I had not eaten more than three bites of food, but yet I had no desire to eat anything more. I could not even muster myself to make a peanut butter and jelly sandwich to try and salvage my sunday morning.

Instead-- I decided to write this review. I wrote this review not to bash the lady at the register for messing up my order, but raise awareness and hopefully to deter others from making the same mistake that I did.

AMERICA."}
{"text":"So this place was open late and we swung through for a burro and some nachos. Everything was pretty standard and comparable to a Filiberto's or a Roliberto's or one of those 'berto's taco shops.

Everything was pretty basic and standard, had a nice garlic flavor in the beans, but maybe nachos isn't the thing to get. They were just bad. Poorly proportioned and the cheese was just a cold glob shook on the sides. The chips were all soggy in the center and there were hardly any toppings. 

I might give it another try, but probably not. I guess it's better than 'berto's!

Can't expect much from a place like this I suppose but hey, it's a good spot for a bean burro!"}
{"text":"Great place for quick, no frills Mexican. It's not too greasy, but is greasy enough to hit the spot. Service time is prompt and food is a good value."}
{"text":"Tip:  You can choose any meat for the Jumbo Burrito, which is a whopping ~20-24 inches long.  For ~$9, it comes with meat, Mexican rice, cheese, pinto beans, and some guacamole that is not all that bad.

I chose Pollo Asada for my Jumbo Burrito and wasn't all impressed with it.  The chicken wasn't that flavorful, and even though I hadn't eaten a full meal all day I was only able to finish barely half of it.  I planned on saving it for the next day, but I ended up not even finishing it because the flavor was so bland.

I would recommend Carne Asada Jumbo Burrito, since a lot of my friends got the that for their Jumbo Burrito and gladly finished it. 

Service:  I came with a large group (~20 people), so the wait is kind of long. Probably shorter with less people."}
{"text":"Terrible sauce, canned enchilada sauce and a serious lack of flavor about sums it up.

I always drink the salsa from a Mexican food place to judge what kind of flavoring they have going on but I assume this was something that came out of a jar or can? My enchiladas came with the cheese inside completely cold and was not melted at all. 

*Cheap prices
*Convenient location
*Gets very crowded and loud with little area to sit down

If you can make it, Moreno's in Chandler is one of the best as well as La Tolteca in downtown Phoenix."}
{"text":"I love breakfast burritos and someone suggested this place.

The burrito I had was okay, It was good size for a good price. 

I liked the chorizo, but did not care for the tortillas"}
{"text":"Yeah there's like 10 of us in here. No one has food. We've all been waiting for 30 minutes. Not a single person in here has their food."}
{"text":"As a current chandler resident for the past 3.5 years I have grown quite fond of Los favoritos for some time for a few reasons.  One being the red salsa which is not watery like Disgusting Filly B's. Any secondly their carne asada is a whole hell of a lot better most of the time than Filly B's as well. But for Some Bizarre reason this Los Favs doesn't quite make par for me as far as taste tests go compared to the Chandler Location. There is this strong salty taste every time I have had their carne asada fries and I highly doubt they salt their french fries then load on more salty stuff. Then they just kind of dab the sour cream on one side and guacamole on another.  Now I know this sounds like I am just being over critical and picky as can be I am just extremely used to the pizzaz and way of doing things at the other location.  I will be trying their burritos next time so I can see how those turn out, a little nervous but I will give them one more shot."}
{"text":"Great little mexican food place. Food is fresh and tasty and is a serious step above many other places in Tempe."}
{"text":"Los Favs is an amazing cheap Mexican place. I go there more than I should. The girls that work the register are all very kind and I have never once had an order that came out incorrectly. The carne asada burrito and carne nachos supreme are my favorites. Their breakfast burritos are the best I've had (I'm a ham fan) and their tacos are also delicious. A great place for anyone looking for inexpensive Mexican food that tastes authentic."}
{"text":"This is an easy drive from our house and it's quick to grab dinner here when we don't have anything to eat at home.  I love the taste of the refried beans and the green and red salsas (although they are a little spicy!)  You get a lot of food for the money.  They also have aguas frescas here FYI."}
{"text":"If you are a carb person, come here to try their flour tortillas. The tortillas are extremely QQ (what Taiwanese people call soft and chewy). To really take full advantage of their amazing tortillas I'd either order a burrito or their special combos which comes with a warm tortilla. 

Go for the meat in the burritos. We ordered a fish, which was delicious, but it was a bit more breading than I wanted. Unfortunately, they were out of the adobada, so we ordered the carnitas taco instead. This was a good choice on our part. Very fresh and meaty. Much better than the fish. I wish we ordered this as a burrito instead of the taco.

For the combination plate, I tried the #8 chorizo plate. The mixture of eggs and potatoes was delicious, but there wasn't much chorizo. The tortilla that comes with the combo is even more delicious than the one they use to wrap the burrito, probably because they warm it up for you. I can't get over how QQ that tortilla was.

If I lived here, would definitely frequent this place often for lunch. And everything is so cheap and in large quantities!"}
{"text":"Los favs is my go to late night snack spot. It's cheap but delicious with good quality ingredients. The green sauce is great on everything! My favorite thing to get here is the breakfast burrito. The cashiers at the front are always so sweet and friendly. The only downside is the atmosphere; it looks a little shabby but don't let that fool you, the food is great!"}
{"text":"Meh, throughly mediocre and kind of overpriced compared to their competition. Portion sizes are smaller than average and their prices are higher than average. The food is always good but I don't think they care to compete because of their location / proximity to asu."}
{"text":"Oh my goodness!!!!! How could I have forgotten to review Los Favs?!?!?!?!? This is the absolute BEST little taco shop in the Tempe/Phoenix area. I cannot explain it, but they make the most wonderful food. It doesn't taste like every other Mexican food joint; it is legit!!!! The customer service is 100% on game every time. 
Some of the top choices include the Carne Asada Fries (you can have them make this into a burrito for you too), vegetarian burrito, super nachos, and they have the BEST cheeseburgers. I don't know what it is, but they are just pure yumminess. You cannot go wrong with any of the breakfast burritos either. I just moved to Oregon and this place is one of things I miss most about AZ. Enjoy!!!!!!"}
{"text":"Bean are a little too salty and it takes them forever but everything else is pretty good! They also don't give enough hot sauce even when you ask for extra, they hand you one single one.."}
{"text":"First off, we walked in and the place reeked.  It was an absolutely gross smell.  Nothing else around open so we went ahead and ordered a couple of  two cheese enchilada meals.  Imagine getting your tastebuds ready for oooey gooey melty cheese enchiladas and getting them home and finding two tortillas filled with shredded cheese that was unmelted, and with unmelted cheese on top.  No way to heat them up because we're moving.  All because the cook was too lazy to put them in another container, heat them up and then put them into the styrofoam containers.  Why can't anyone just do their jobs anymore????"}
{"text":"Excellent Mexican food. My sister and I came here for dinner after moving all her dorm stuff in. We were so hungry and wanted something fast but not fast food. The service was great and the food came out quickly. Definitely will be coming back!"}
{"text":"Carne Asada Burrito or Bean and Cheese Burrito is where it's at. I moved away from Arizona four years ago and I still think about eating those burritos. One day I will reunite with my first loves!"}
{"text":"The beef tacos were delicious! Their red sauce is excellent as well. I ordered two plates. The two beef tacos with rice and beans and the carne asada plate. Beans were good. The rice was a strange orange color but okay. The carne asada was meat in square shape and fried. I do not recommend this item. It's was over fried and had hardly any flavor other than the oil it was fried in and the fatty pieces of meat. However, I would still come here for tacos. :)"}
{"text":"I love this place, I would go here every day if I could. It's not cheap, it's inexpensive . Which is a difference in taste. Burrito supreme for 5.75$? Yes please."}
{"text":"This place is THE BEST. Their food is amazing especially on a Saturday or Sunday morning ;) I always get the ham and cheese and potato breakfast burrito and it's absolutely delicious. They also have good agua de horchata. I've also been to the Gilbert Los Favs and it's equally good. And they have Cruisin USA in the back!"}
{"text":"Authentic Mexican street tacos with guacamole for cheap. This place is far better than surrounding area Filbertos. Will be going back for more!"}
{"text":"Typical Mexican fast food place. Got the carne asada fries to go and they were really good - tons of meat with guacamole, cheese and sour creme. It was a to-go box full of fries and toppings for under $8 and it filled me up, which isn't easy!"}
{"text":"For the past 8 years, I've been going to this specific location los favs .  It seems there is one employee specifically that for the last 13 times I've been there, has \"forgot\" to put my order in. That's providing you call for 2 hours before someone decides to answer and place a pickup order. 

I wait an average of 15 minutes every time once there even after they tell me my order would be ready to pick up at a specific time. Business can get busy so I understand, but every time I've gone there and tried to call in, there are a handful of people or less. 

Tonight I decided to wait 25 minutes after I called to show up and get my order. Again I sit waiting for another 15 minutes after I've paid and both the customer that ordered a large order in line in front of me got their food, as well as the customers that came in 5 minutes after I showed up and placed an order. 

I had asked the cashier there if she forgot my order again (as she has many times before) and she says no, there were orders in front of me. 

The orders in front of me were placed almost a half hour AFTER mine and still got their food before I did. The order was simple. 2 bean burritos and a tamale. 45 minutes of waiting with no real line and 3 employees on staff?

Because of tonight I will never visit this location again and I do not recommend you ever plan on calling in orders and getting through, let alone getting them on time."}
{"text":"Service was amazing! I wish I took pics of my food I got the #16 and it was piled high with ingredients. A little bit of a wait to eventually taste heaven. It's breakfast burrito my fiancé had was the bacon breakfast and it was packed full of bacon. Also their green salsa is amazing for a nice flavor but not spicy at all and the red has a nice flavor medium heat super amazing their pico was awesome on both meals"}
{"text":"I always get the breakfast burrito with bacon and it is delicious !!!!  For the price you get a nice size burrito and the service has always been great !!!! I would recommend going here."}
{"text":"Now don't let my profile picture fool you, I am not, in the traditional sense, a Mexican. Shocking, I know. But, I do know my Mexican food, and Los Favoritos is awesome! Wonderful in fact. Delicious, cheap, clean and delicious.

  This morning I got a bacon breakfast burrito with beans inside, and if you don't know, their breakfast burritos are their bread and butter, the money maker, and they never disappoint. The only problem you may ever have is the bacon being a little salty, and even then the always incredible hot sauce (or salsa, whatever) is there to save the day. The carne asada is very good, seasoned well and almost always very tender, the beans, which are cooked with wonderful, wonderful lard, are always just firm enough, never just a pile of mush, never watery, the chicken is juicy and tender, I just can't say enough about it. The only negative I have is that one of the counter girls is a bit rude, and there is a military service recruitment center right next door, so at times you may be bothered a little by them, but come on, they're serving our country, so it can be forgiven. 

  Los Favoritos is the best fast Mexican restaurant that I have discovered so far. Do yourself a favor and give them a visit, at either location (Tempe, Chandler) and tell them Kevin sent you, they'll probably just look at you funny, but why not?"}
{"text":"Stopped going here after getting numerous egg shells in my burritos..."}
{"text":"So I phoned in a order for a machaca plate... It wasn't ready when I got there and it was subpar... People told me it was good... Liars"}
{"text":"The go-to spot for breakfast burritos in Tempe. Bacon breakfast burrito is one of the best in town (crispy bacon!). Call ahead on the weekends to avoid lines, sometimes it takes awhile to get your food if they are busy."}
{"text":"Been meaning to write a review for years . . . we eat here at least 3-4 times/month.  The BEST tacos.  Ever.  And, yes, my wife is from D.F. and we travel EXTENSIVELY throughout Mexico (on the economy, not the tourist spots) and after the first two attempts we NEVER ate tacos anywhere in Mexico again because they are NOT AS GOOD AS LOS FAVS.  That's the bottom line.  Every time we return from Mexico we immediately drive directly from the airport to Los Favs for tacos.

As to the other reviews:  what is a \"raw taco?\"  Are you saying they didn't cook the meat they put inside it?  Sorry, but that is not to be believed . . . dipstick.  If the food was cold you should have asked them to put it in the microwave for 30 seconds.

Salsa is \"not good?\"  Why?  Because it's fresh and has no preservatives?  Their salsa is equivalent to/better than some of the best we've found all over Mexico . . . dipstick.

\"Rolled tacos\" are actually \"flautas.\"  So not sure where the nomenclature came from, but I have had them here and they are pretty damn good.  Better than many I've had in el D.F., Michoacan, and Chiapas.

Can't comment about the other menu items because we haven't partaken.  But they appear to be packed to the gills at all hours with people ordering burritos (which, by the way, are NOT Mexican food) so they must be doing something right on that end.

If you want the best tacos in the Valley (better than those we've found in Mexico and in all the other United States of America) go to Los Favs in Tempe!"}
{"text":"I was craving Mexican food really badly and I sent my bf to go get me some chicken enchiladas. At the first bite I thought it was EXTREMELY SALTY. Like horrible, but I ate it anyway to not waste food...BUT THEN I FOUND A CHICKEN BONE in my mouth. God only knows if I happened to miss any other bones as I was eating. Later that night I also got sick from eating this crap. What if I had fed this to my child? That bone would be a CHOKING HAZARD. Do not eat here! It's terrible!"}
{"text":"Hands-down the best bacon burrito I've ever had in my life. I would give them five stars except for the fact that every single time I call in takeout orders I still have to wait at least 15 minutes on arrival. The crunchy chicken tacos are really good too. 
But nothing comes close to these bacon burritos, at all locations ( Tempe and Scottsdale are my favs)"}
{"text":"If your looking for Americanized Mexican food, go elsewhere. For real Mexican food that is very good and priced right, this is your place. No frills, no gaudy decorations, no Mariachi band, just very good mexican food."}
{"text":"When it comes to fast food Mexican There is so many Berto choices but over the years I've ended up at Los Favs Both locations have amazing quality and consistency They need to bring back the Red Chile though!"}
{"text":"Best burritos ever. Very clean. Brenda who was taking orders was very polite. Love me some bacon breakfast burritos :)"}
{"text":"I did a take out order, I got the carne asada tacos plate with rice and beans. It only came with 2 small street tacos so for the 8$ I paid I was really not happy or impressed. But I also ordered a chorizo torta and that was the actual treat. I would definitely  so back and order the tortas. I'll skip the tacos plates for now."}
{"text":"Out of all the locations, this is tacos down the best one! Breakfast burritos are prime, but the tamales, tostadas, tacos, and tortas are excellent. Made to order and not expensive at all. Authentic AF!"}
{"text":"After trying various menu items, my favorites are still the breakfast burritos (Either with bacon if you are in a meaty mood, or the bean with added potato), the shrimp diablo burrito (Piquant and spicy!), and surprisingly, the veggie burrito, which is a flavorful and filling mix of veggies, beans, and rice. As for the salsas, I like it, as people say from New Mexico, \"Christmas-style\", putting both red and green salsas on my burritos!"}
{"text":"I love mexican food. Be it upscale, street food, or even tex mex. This place was not good...even if given the choice to be in any category.

The beans and rice were pretty bland, nothing special. I ordered carnitas and it was pretty terrible. It was not recognizable as meat, just dry greasy bits. It was clear that it was cooked, then reheated on a flat top with a ton of oil. Not to mention the fact that they did not trim the meat very well before cooking because there was a lot of gristle. The only good part was the tortilla."}
{"text":"Always great food, but the new younger cashier is so rude it's ridiculous. She has no concept of customer service and a horrible attitude."}
{"text":"This is my go to place when I need a decent burro at a great price.  Friendly fast service."}
{"text":"I live next door to this place so I eat there from time to time. Everything is overly deep fried, I get horrid heart burn after I eat there. The chips and salsa are really good though, had a good fresh taste to it and solid hotness. I'd stay away from the tacos though, they were horrible, reminded me of a taco bell hard taco, very plain and generic. Their hot sauces were watered down to the point that it was noticeable and not very hot or tasty. The rice and beans are also sub par in my opinion. I guess for a small taco shop this place is nothing more then OK, but their are better options with in a few miles."}
{"text":"I really wanted street tacos and I didn't think that I had been to Los Favoritos before so I stopped here on my way home a few nights ago. I walked in and the person at the counter was taking a call so I patiently waited for a few minutes. I had a change of pace and decided to get a burrito instead of tacos with some horchata. Waited not too long and I got my order. Once I got home and started eating, I realized that I didn't think that I had been there before because it's pretty forgettable. Maybe I'm not getting the right thing? But I can think of a few places that are better for the price."}
{"text":"I've been a few times and I can't say that I've ever been blown away by it. Granted, I typically am only ever here right before they close up (10pm for a taco shop? Lame.), but there are other taquerias that I definitely get more excited about.

I still enjoy coming here and love the burritos, but I would recommend giving some other taco shops a shot before swearing your allegiance to Los Favs."}
{"text":"Los Favies, man. Where to begin. I called to order a burrito to go, and the woman was like \"hold on a sec\" so she puts the phone down on the counter. And I'm waiting. And waiting. And finally realize she isn't gonna pick that phone up so I get in my car and drive down there (only 3 or 4 min drive) while I'm still on hold. So I get there with my phone to my ear, she says \"what u want\" I'm like \"uhhh Idk you can answer that phone\" and point to the phone on the counter. She picks it up \"Los Favorito's what's your order\" and I shit you not, right in front of her I reply \"chorizo breakfast burrito\" she says ok and hangs up. Looks at me and asks me if I am ready to order. CAN YOU BELIEVE THIS GIRL THAT OBLIVIOUS I go \"nothing. I just ordered. I was the one on the phone that you had me on hold for 20 minutes\" she just turned around. I love the food here but shit I will probs never come back unless I know someone more competent is working the counter."}
{"text":"Put it this way, if I was on death row my last meal would be a Los Favs ham breakfast burrito with guac.  Yeah. It's that good.  I eat at this place like 5 times every week and have for years, no lie.  The staff are awesome too, Jaun's the man."}
{"text":"Great breakfast burritos for a good, inexpensive price. Best authentic Mexican food north of border for inexpensive price. The chorizo breakfast burrito is very good, try some of their green (medium) and red (hot) sauce to spice it up as needed."}
{"text":"Where do I even begin with this amazing place?! I have been a loyal Los Faves customer ever since the first bite I took of the chorizo breakfast burrito which has since changed my life. The chorizo burrito has become a very close ally of mine for too hungover mornings. It saves me every time I eat it. I have a couple times tried other burritos or meals, like the enchiladas and quesadillas and have never been disappointed. Each out of state visitor I have is automatically taken here to experience the spice of real Mexican food. I have never had a visitor do anything less than rave about this place. It is now within walking distance of my apartment, which is a real shame...for my diet. I love Los Faves and if you live in Tempe and haven't tried it out you are really doing yourself a disservice. Los Faves or Die."}
{"text":"Waited 30 minutes for a burrito. With no lines and four people working. They forgot my order. Avoid this place at all cost if you want quality service"}
{"text":"I'm a regular at Los Favs but this location is not as good as the Chandler/Gilbert/Ahwatukee locations. If the address was any of those locations I'd easily get 5 Stars. I feel like this place is a bit dirtier and smellier than the other locations and the overall quality just isn't as good. Don't get me wrong though, I still love me some Los Favs!"}
{"text":"Have you ever been really drunk off a small amount? Say... one drink? And you feel just absolutely horrible and want to die? Nahh.... me either.

BUT... just in case this DOES happen and you are at, say, The Clubhouse watching a show, you can scoot your bum over to Los Favoritos and have your life saved!

Yummmm does not begin to describe the food. 10x that of any ____bertos. I mean that. (Sorry Julio).

They even put french fries inside Dallas G's burrito. I have never seen him so happy. Ever.

Plus, when I said I was vegan and gf the chick said, well, get a bean taco! Do you know how long it usually takes to explain to someone that I just want a bean taco. No meat. No cheese. Just a bean taco. That's right. Just beans. So major kudos to her for grasping the concept that there are freaks like me in the world who don't eat animal products.

I used to eat their breakfast burritos as well. Their potatoes are fabulous.

Stop what you are doing and go now."}
{"text":"Yummy quick and authentic easy Mexican food- no fancies and no flares-- just good food!! Dinner, drive in, and dives sort of place!! I get the tacos!"}
{"text":"I had the chorizo breakfast burrito

Was the saving grace that could cover some of the stink from past experiences.
However their combo plates are pretty average as in Filiberto's in a dining hall setting average."}
{"text":"I have eaten here quite a few times and had them cater breakfast. They are consistently good. I usually don't like rice but they make it well. Light and fluffy. The plates are generous. Tacos full of flavor. Chimichanga was large and full of shredded beef. My husband loved it. The chips are fresh and the salsa really hot. I'm excited for my next time."}
{"text":"The food was good and it came out fast (like 3 minutes). I got the ham breakfast burrito. 

I now sit here in pain, feeling sick, 4 hours later. It's the only thing I've eaten today so I'm about %90 sure I got food poisoning from this location. The cook probably didn't wash his hands. 

The only reason I'm giving 2 stars is because the food tastes good."}
{"text":"This place has terrible customer service.  Anytime we try to call an order in ahead of time they NEVER answer the phones.  We also came here around 8 one night thinking they were closing at midnight since that is what they post their hours to be... wrong... I guess they close whenever they want to because the doors were locked and the employees just stood there staring at us when we tried to open the door. What's he point of owning your own business if you don't care about the customers who fund your business."}
{"text":"Oh sweat baby Jesus. This is my favorite fast mexican spot in AZ. I would never step into a Filibertos ever again because of Los Favs. I used to live in the apartments located next to this plaza and decided to give it a shot since it smelled so good. Carne Asada Fries are what I recommend with lots of green and red sauce. DO IT, DO IT NOW!! Oh and if you're around for breakfast, do the chorizo plate...you will not be disappointed."}
{"text":"Their carne asada fries aren't quite as good as filibertos' but their 3 rolled tacos w/guac I would argue is better and a very affordable quick meal. I haven't had any bad experiences with the cashiers. Also the decor is tacky and hilarious. Their hot sauce is green versus the red ones from filly b's and you can get em to go. They are really tasty=bonus points

I think I'll knock off one star because of the perpetually creepy dudes hanging out around the place outside and lack of close streetlights"}
{"text":"They do have excellent Mexican but beware... for example...
Captain: all systems go ready when you are
Pilot: you sure you don't want to use both exits it'd be more...
Captain: don't be a fool, that would be way too much..
Pilot: too late 

Very greasy very delicious But you need a strong stomach"}
{"text":"Ugh. No. The place was cheap, I'll give it that. The food came out after a reasonable wait and the portion size was decent. But the food itself didn't taste like anything. Just super-bland. Also, the place could use some air-conditioning."}
{"text":"It was pretty much your run of the mill fast food Mexican joint minus the drive through. A bit better than filibertos but they charge you for everything. 

The beans are vegan safe which is a plus and the burrito was a good size. 

The red sauce had virtually no flavor, as a matter of fact it was sort of bitter like maybe it had gone bad? 

Probably a bit over rated in my opinion but I would come back again."}
{"text":"Definitely one of the best spots in Tempe for a breakfast burrito! Not the fastest but definitely worth the wait, plus they're cooking your food so if you can't wait a few minutes for a hot meal hit a fast food chain. Must try!"}
{"text":"BEST relleno I've ever had! 
Great prices and decently fast.

Chorizo burrito is wonderful as well"}
{"text":"They Closed over an hour in advance. Family left disappointed. We had just got there and began walking to door when a couple walked out and a little worker quickly ran to door and locked it."}
{"text":"Really disappointed with this place recently.  I used to go to the one in Gilbert all the time when I lived/worked out there and was happy to find this location when I moved to Tempe, but the past 2-3 times I've gone I've been really let down.  Like other reviewers have noted, the staff here is far from friendly, but that doesn't play a role in my review.  The food always outweighs the service in a place like this, but my bacon breakfast burrito I ordered this morning had about 90% potatoes and was super greasy.  If it was my first time going there I would never give them another chance.  Having said that, after being let down the past few times I doubt I'm going to go back.  Maybe they changed cooks in the back or something but the food is nowhere near as good as it used to be"}
{"text":"Hair in food, cold tortillas and powdered drinks. This is NOT right. And the staff is rude, the plaza is very ghetto and sketchy at night, plus eating there is a risk with their very outdated, dirty tables. Too many other choices, so I will never return."}
{"text":"Food is 5 stars. Just breaks my heart when I get off work at 11pm and they say they are open til midnight on yelp and even on their door. Yet they close shop early frequently. My favorite late night snack. I always race there and usually meet a closed shop. Sad and unreliable."}
{"text":"Everybody giving this place an above average rating has a seriously down syndrome poverty palate.

Ughs Smh their rice is just awful, no spice, just an old oil flavor and unwanted corn and peas mixed in.
Guac is spread thin and watered down to the point it's runny and might as well be tomatillo sauce.

Beans are liquefied brown sauce. But hey it's cheap and at least the staff was nice. 
This place also really needs to serve beer. 

Blah I hope I don't trick myself into coming here again."}
{"text":"I eat at Los religiously, it's my go to for a burrito at almost any hour. Tonight, I headed to this location because the one near me closes at 11pm, but when I arrived at 11:35 (after driving out of my way), they had already closed. Super disappointed that they advertise their hours as staying open until midnight.... but I guess lesson learned. Don't try to eat here late!"}
{"text":"It's not that great here. They give you tiny portions of meat. There's definitely better places in the area."}
{"text":"Nasty. Absolutely some of worst food I've ever eaten. No joke. This is pretty much Taco Bell. Icky. They put bagged cheese on every dish including chips and guac? We threw over half our food away because I felt sick eating it. Seriously there are FAR better authentic taco shops close by that are fantastic. 

However the customer service was friendly and quick."}
{"text":"on numerous occasions i(and my coworkers) have come here to fry and pick up breakfast burros yet no one is there.. at 6:30,7,7:30, 8 AM... yeah probably should open when you say you open"}
{"text":"So far 3 times I've tried to go to this location they have been closed at lunch time with a sign on the door on weekdays. Don't bother if you are trying to go here on a work lunch with limited time."}
{"text":"Los favs is awesome but this one serves the lowest quality breakfast burritos in my opinions. The last one i got had burnt bacon, a super greasy tortilla, and a small portion:/"}
{"text":"Horchata is delish! Familiar faces is nice. Pretty good veggie burrito, bomb breakfast burrito, seriously good. Decent prices, but their guacamole could use some work."}
{"text":"I don't know why this place has such a high rating. I understand that it's cheap fast food, but there is so much good/authentic/cheap mexican food in the tempe-mesa area-- why eat here? Food had no flavor/spice, I paid $8 for tacos with bland ground beef and pico de gallo on mission tortillas that were cold and chewy like rubber. The refried beans were definitely from a can. The guacamole was bland and watery. I will say that the horchata was really good. I'm just pissed that I got such mediocre mexican food so close to the border."}
{"text":"I love Favoritos,  mainly for their bean and cheese burros,  which have creamy beans and taste amazing with their red and green sauce.  We also love their shrimp tacos, which are comparable to the kind we get in Pacific beach.  The price is decent and they are always quick."}
{"text":"Wow!!!! Shitty service! 

I ordered #1... was so excited to try their enchilada sauce. They gave me #2 and refused to correct it. 

Never again"}
{"text":"Los Favoritos goes above and beyond what a typical taco shop should do. Every plate combination I've come across is not only delicious but extremely affordable. They keep the place clean, they are always kind, and they work with all kinds of requests. I highly recommend deep frying or getting an enchilada (wet) style burrito with green sauce. Best casual sonoran mexican restaurant in the Tempe area by far."}
{"text":"I'm tired of the guessing game with this place. The food is great but they never open on time or bother answering their phone for to go orders. They claim to open at 6am, it's 7:05 and the doors are locked."}
{"text":"Tasty and deals for quick Mexican food in Tempe! Hearty breakfast burritos and the burritos are massive! Excited to explore some other items on the menu, you'll like this place!"}
{"text":"This is the best Los Favs in Arizona if not the entire world. Now im going to keep typing because Yelp won't let me post without doing so. But really you can stop reading because there is no real subtance left in this review because I used all my brainpower to formulate the first sentence which is a very good one if I may say so myself."}
{"text":"Best breakfast burritos in Tempe.  The only other place I ever go is Texanos, but in the breakfast burrito category, I think Favs has them beat.  Everything is well priced and tastes great.  They even have a pool table and some video games now!  Def check out their nachos too!  They are not to pass up!"}
