{"text":"I had the shrimp tostada with avocado and a watermelon agua fresca - both were fantastic! The shrimp was super fresh and had the perfect amount of pico de gallo mixed in. The avocado was perfectly ripe and the tostada was fresh and crispy. The watermelon agua was so tasty and refreshing. I can't wait to try the shrimp ceviche next time.   Highly recommend!!!"}
{"text":"very good tacos , every week or two weeks here, i like much the carne asada fries you want the tasty , all its good but sometimes need wait in line ,i wish it would drive true"}
{"text":"Awesome carne asada tacos and shrimp cocktail!  We hit this place every time were in town and love it, so try it out for good food at a simple place."}
{"text":"Idk when You tell me its $45 for 5 tacos and 2 drinks you better be that good which I really didnt think so. So I would say its a no go"}
{"text":"A bit overpriced. Hidden charges not listed on the menu but will appear on the receipt. I ordered 4 tacos and a burrito. The cashier asked you want everything ? I said yes. But never said it's $1.85 extra per each item! Then I noticed on the receipt they added . $1.85 x5 for saying yes everything. They put the standard dash of salsa, sour cream without asking me if I want sour cream on Mexican food. Guacamole on the tacos was more than the meat. The burrito had nothing extra on it that would warrant an extra 1.85 on top of the burrito cost. A big disappointment . Does not taste better than Taco Bell and about 5 times higher. Save your money stick to Roberto's Las Vegas"}
{"text":"My co-workers just brought back two tacos for me. They were awesome. Looking forward to seeing the entire menu from inside !!!"}
{"text":"Why this place has 4 stars is beyond me. We had a horrible experience from start to finish.  The speaker at the drive thru is useless cuz u can barely understand the broken English through the crackling speaker.   She got our order completely wrong! No surprise there!   $3 for a taco? Try $4.50 when they add guacamole with out your knowledge.   Nothing about this place is authentic. Bottled salsa and pre packages tortillas. Flavorless meat and guacamole.   Trust me and pass on this trash!!!!"}
{"text":"Best Carne Asada burrito I have ever had. And I have traveled from Santa Maria to Zihuatanejo.  I think it would be my last meal, if I could so choose.   Great management and staff also. Enjoy."}
{"text":"Mark Stoermer, The Killers' bassist, said in an interview that this was one of his favorite Mexican restaurants in Las Vegas. He said, \"It's so authentic, it's completely run by Spanish-speaking Mexicans. It reminds me of the taquerias in San Francisco and Los Angeles.\" If you need a cheap and delicious meal with a TK stamp of approval, go here! More info: http://thesponge-dani.blogspot.com/2011/10/victims-pilgrimage-killers-fans-guide.html"}
{"text":"I ordered the steak burrito with extra meat, cheese, sour cream, and pico.  The burrito was super skinny, especially for 9 bucks. My order just sat in the window for about 5 min and no one called me. wasnt offered any salsa with my burrito either.  Wont be back."}
{"text":"Fantastic food at a great price. Carne asada taco with everything on it.. you will not be disappointed"}
{"text":"I love these tacos! The carne asada is the best one I've ever had. It has a nice grilled flavor. All the tacos here are great so it depends what kind of mood I'm in.   They use flour tortillas and are bigger than your typical street taco corn tortillas, so they're slightly more expensive. Two tacos here = about 3 or 4 tacos at El Gordo, so they're about the same price.    The red salsa is also a must, It's different than most places, it's seedless and has a nice hint of garlic. Everything I've tried here has been great, and the Ceviche is very refreshing on a hot day.  Another plus for Los Tacos is that ordering here is much easier than Tacos El Gordo for non Spanish speaking gringos.  My favorite bites from Los Tacos so far have been the carne asada tacos with everything on it."}
{"text":"DAMN!  The tacos with everything here are by far the best tacos I have ever tried in my life.  They pack on the meat of your choice, cheese, beans, guacamole, sour cream, cilantro and onion......With just 2 tacos and I was completely full.  Not knowing how massive these tacos would be, I ordered two asada, one al pastor, and one carnitas.  I was only able to eat one asada and one al pastor.  I ended up having to ask the cook to wrap the other two tacos to go.  At dinner time I warmed up the other asada and carnitas taco and despite reheating, they were still pretty damn good.  This is a place you MUST try."}
{"text":"The best tacos i have tried.... I ordered carne asada tacos and carne asada nachos.... The taste was great... You could taste the freshness of their food!"}
{"text":"I came to this place because TACOS EL GORDO was packed!  My family and I didn't want to wait in line. This place is crazy expensive, the meat has no flavor at all, they put sour cream in your tacos that's not a taco?! When I ordered mine I asked for no sour cream or beans in my Taco and Then come to look at my receipt and they charged me extra for \"extra meat\" that I didn't even ask for. Another family was here they said the same thing and got charge the same amount as us. Never coming to this place again. Super disappointment"}
{"text":"Great authentic-fast Mexican food. This place is close to my work and I come here a few times a month. But, recent experiences have changed my opinion. Firstly, they got rid of their grilled chicken...ok not that big of deal. Then they started to get stingy with their hot sauces when in the drive-thru.... their hot sauces are in containers at each table in the restaurant....how can they limit the hot sauce???? CASH ONLY DISCLAIMER!!! They now only take cash, because merchant fees are too expensive! Seriously!!? You have a drive thru...and your cash only! This place is not that special for me to go to bank for."}
{"text":"The Carnita's are to die for! Fast food but yummy! Got into town HUNGRY, the first few places were blocked by construction and traffic. Wasn't looking for fast food, we were NOT disappointed by the food! Hit the spot, hot, fast and spot on! Pork was tender and not stringy or too spicy.... But spicy enough!"}
{"text":"Delicious tacos. Had the carne asado tacos. Nice portion. Fast service. Very busy. They don't keep up with the traffic. A little dirty."}
{"text":"Food was fresh & delicious. Owner was friendly and down to earth. Portions were large and filling.  Definitely coming back!"}
{"text":"My bro recently moved to LV and has been lookin for some taco spots. Well on one of our little adventures we stumbled upon this place, and let me tell ya it was a good find! The tacos are great with everything on them! I had 1 carne asada taco, and one chorizo taco... mmmmm 2 thumbs up : )"}
{"text":"Great food. I love their carne asada tacos! The price can be a little better but they do give you plenty of food."}
{"text":"Had the Tostada de Fish Ceviche! The best tostada I've ever had. You have to get it with avocado which makes it that much more awesome!!!"}
{"text":"1. They do not answer their number. 2. They sell a \"vegetarian\" burrito ... but mine had a piece of beef in it. Was also soggy. Made me sick. Not a clean or responsible business."}
{"text":"Everything at Los Tacos is good.  The carne asada  burrito is one of the best burritos I've ever had.  Everything is really fresh tasting and soo satisfying.  I love Los Tacos!   It's one of the best Mexican places in town."}
{"text":"Not worth it. They all suck there. Employees acting like they're working for free. Just go to a restaurant. Its as expensive."}
{"text":"Not the typical street taco - but that's why it's good. Pricey but worth it, two tacos are huge and more than enough. I usually get the junior burrito, half the price and still very filling."}
{"text":"The owner that works the register is just AMAZING!!! Fantastic customer service. Their tacos are out of this world. If you havent already try the carnitas tacos. Everything there is just awesome."}
{"text":"Let me preface this by saying the tacos here are good. They really are. I  don't think they are the best tacos ever, but are solid.  It seems to be be a bit pricey, e.g., $3 for one taco.  The portions are big and at least for the tacos, wrapped in two tortillas.  They also give you a lot of meat, so I usually order one taco and make two with the extra tortilla and meat.  My experience has been that the carne asada is the best, the chicken can be a little dry sometimes.     The aguas frescas are a must.  My favorite is mango.  It takes just like ... mango!  In all seriousness, I think Los Tacos has the best agua frescas in town.  They actually taste like the fruit, instead of water with a hint of fruit flavor."}
{"text":"So much awesome for so little cost. Every time my parents come to town, we eat here nearly every day. Delicious meats, but chorizo burrito \"with everything\" is my favorite. Also love their fruit drinks - watermelon is unbelievable, strawberry equally lovely. And last but not least, must exclaim the awesomeness of the FREE tomatillo salsa on every table."}
{"text":"Excellent ceviche and Carne asada tacos.  We are not locals and were on the hunt for better tacos than we find back home. Success! and the owner brought us a seafood cocktail - also delicious."}
{"text":"I used to go to this Los Tacos at least once a week when I worked in the area because it's just such great food.  Their shredded chicken and carne asada is awesome.  Also, get a plain cheese quesadilla harina and put salsa and green sauce on top.  OH MAN, SO GOOD!  Completely unrelated to the food, they do keep it very cold so grab a sweater or jacket."}
{"text":"I cannot say enough good things about Los Tacos. There is nothing like walking in and the manager recognizes you even if it has been a few months. Their food is fantastic, fresh cooked and the green sauce is out of this world. Their salsa is incredible. Every time I go I buy a carne asada taco con todo.....it rocks and never disappointing. If you have not gone here you are missing out on real food. It gets really busy around the noon hour and also only takes cash :)"}
{"text":"Like someone else said, \"Hands down the best carne asada tacos in town.\"  If we lived closer to Los Tacos, we would be in serious trouble.  But we still make the cross-town trek monthly to eat their carne asada tacos.  I order mine loaded, with everything - comes with beans, cheese, pico, and guac.  Their homemade hot sauce is killer and perhaps the best in town.  You must ask for it at the counter.  It's not too spicy, but wonderfully flavorful.  Honestly, we've eaten here about 25 times and have not strayed from our favorite, carne asada tacos.  One taco is pretty large with double corn tortilla.  Two tacos will leave you feeling full and needing a nap!  The side order of rice and beans is good as well.  You can not go wrong with this place.  A must eat for any taco lover."}
{"text":"Wow.  Unadulterated pure tacos.  Had carne asada and Al pastor.  Both very tasty.  Atmosphere was busy and fun.  Place is fairly run down but it sorta added to the atmosphere.  Will be eating here again the next time I cone through Vegas.  Yum."}
{"text":"The tacos were delicious but I found that for the price it wasn't worth it. I spent around 11.50 and it was for two tacos and a drink. Don't get me wrong It was loaded with meat and toppings but going in with the mindset that it was around the same pricing area of tacos el gordo I was sadly mistaken. All in all a good taco place."}
{"text":"High prices go even higher ordering \"everything\".  Larger size but taste below average.  Nicer surroundings than El Gordo but El Gordo gives out free toppings.  Fooled me once but nevermore."}
{"text":"Last time we had tacos we went to El Gordo, and it was good.. this time El Gordo was packed, so we walked across the parking lot to Los Tacos. It was equally good, not packed and was fast. Don't believe the hype for El Gordo, try Los Tacos!"}
{"text":"I've been living in Vegas 3 years now and this taqueria is by far the best when it comes to burritos!!! Being from San Francisco where we are notorious for having the best burritos in the country I have high standards when it comes to burritos! Finally  a taste of Frisco in the desert....."}
{"text":"i didn't really expect much from this place since it seems like a chain or something. surprisingly, my cabeza burrito tasted really authentic and delicious! what i love about their burrito is that they only put meat and beans (guac, salsa & sour cream if you want everything) - no rice! so it's like a protein explosion in your mouth! haha"}
{"text":"Went to this place after arriving at Tacos el Gordo and seeing a loooooong line (it was understandable since it was noon on a Sunday).  Had high hopes with the reviews I had seen on Yelp.  Let me tell you, HUGE disappointment.  I ordered a carne asada taco (3.50) with avocado (1.00) and no beans (1.00, yes i had to pay a dollar to have beans excluded from my taco!!!).  Overall, taco had no flavor. Tortillas were nothing special, Pico de Gallo was bland and the taco does not come with cilantro or onion.  The ONLY reason I gave them 2 stars is because the quality of the carne asada was good (no yucky fatty pieces) and the avocado was freshly made without any filler (some places add tomato or sour cream to make the avocado go further).  I also got a plain cheese quesadilla (maize/corn) and that was garbage.  Tortilla was drenched in oil and you can tell they use the cheapest quality cheese.  Quesadilla was so bad it is not worth another word from me.  There were people in my group that said the lengua and chorizo tacos were pretty good so I would try those instead if that is your forté."}
{"text":"I'd like to rate this place more highly because I received such friendly service.  Admittedly I had high expectations to the myriad rave reviews, both here and in the local press. I was underwhelmed. It was solid, but nothing special.  I'd always prefer Cafe Rio, which just screams flavor, to this joint."}
{"text":"By far the best freshest Mexican food I've ate for a long time it can be a lil pricey but well worth it once you taste the freshness plus the foods cooked right in front of you I've been eating here probably 11 years now bomb place"}
{"text":"Love the food, I have never had a bad order! I wish they'd get the order correct more often. When you have a picky eater, there is no fixing a burrito with EVERYTHING on it and you don't know it's made wrong until the person bites into the burrito...  I'm not the picky eater in the bunch, but I think that the kitchen here works at a fast pace and either emits or includes an unwanted topping here or there because of the fast pace... hey, it happens no matter which drive thru you pull into.  Both the red and green sauce are tasty, as are the chicken, carnitas , and carne asada in tacos/burritos/quesadillas. The plain cheese quesadilla is pretty full of flavor. The food is never cold, and the service is pretty good as well.   For those that like to split their portions, everything heats up well at home."}
{"text":"We frequent the Los Tacos on W. Sahara on our lunchbreak.  The tacos come plain and there is an extra charge for the cheese, etc.  However, the prices are still reasonable.  I bit into my chicken taco yesterday and the meat was so moist it dripped juices.  It was not grease, but chicken broth.  The pico de gallo salsa is really good too. I love going here for lunch. My co-worker said her steak taco was awesome too.  The music was a little too loud for me though."}
{"text":"carne asada taco is the item to get here! make sure to order it \"con todo\" with everything. taco de pollo is a close second."}
{"text":"I was visiting Vegas from Dubai along with my wife, mom n brother. The time we step in the restaurant, the smell of food made us more hungry and the food was delicious. We met the owner too. He is a nice and humble man. Great hospitality frm the staff. It just made our day."}
{"text":"Best place I ate in Vegas hands down! Also friendliest people ever! Not exactly sure what I ordered bc I mentioned I was out of town and homeboy kept bringing out things for me to try-but it was all delicious. Probably my fave was the tomato sauce served in a glass with ceviche in."}
{"text":"Me gusts. Me Gustav. Me gusta. Been in town a week. Went because of yelp review. Had carne asada tacos. The flavor was delisioso. Highly recommended."}
{"text":"So Los Tacos is amazing.  Never have been to one ever until this year's Cinco.  Visited the one on West Sahara.  The cook gave us a carne asada taco on the house to sample-  It is nothing short of amazing.  My boyfriend and I got 2 lengua tacos with everything- it's a must because you'd be missing out on a whole lot of goodness if you don't, and 2 carne asada tacos.  The asada tacos are so effing good because it's grilled and not fattening.  This place is a must visit at least twice a week.  Sooooooo good, clean, fresh and courteous service! Freaking amazing."}
{"text":"Went through the drive thru to order a double shrimp and oyster cocktail. Price on menu says \"1100\". Lady tells me my total is 15 and some change. I nicely question and she asks me to drive to the window. This is fine, as it was hard to hear her on the speaker as it was. I pull up and she informs me that it was incorrect on their menu. I asked why haven't they changed it... And of course she does not know. So she informs the owner/manager and he literally does that ah whatever hand gesture to shun me/it. I have no problem paying for cocktail from here, because I have had one before and they are amazing... I just despise rude costumer service."}
{"text":"finally, someone gets it. pinto's in the burrito, end of review. jk. this place is tight because they know what they're doing. all of their ingredients are top notch (i think they can afford to keep it that way because they're so busy (and i think they're so busy because the food is the so friggen' good (and i think the food is so friggen' good because all of their ingredients are top notch))). i've had all kinds of good food here, including burritos, tacos, nachos and quesadillas with most of their different meats. today, i got a veggie burrito. this is probably a controversial opinion but i think they might be the only place in town that has their shit together burrito-wise and i'm begging you to prove me wrong. it comes wrapped in foil, tightly i might add, tasty tortilla, and they use pinto beans instead of the bs refrieds i keep being subjected to all over vegas. they don't put rice in there and usually i'm a big rice guy, especially when i go veggie but you know what? i didn't miss it. their veggie burrito contains a good ratio of beans, cheese, sour cream guacamole and pico de gallo. they hook you up with a dixie of red salsa and they have a squeeze bottle of green on all the tables, they're both awesome but i think i like the red best. chips and salsa is an extra $2 but i think it's worth it if you're going to share them with one or two people. the salsa is pico de gallo. yo, i'm going to go eat there again right now!"}
{"text":"Best tacos in town hands down and worth the extra money. Trust me customer service is on point and very clean family restaurant. Carne asada tacos are the best I've ever had get em loaded with homemade salsa, sour cream and guacamole. Wish I had one by my house."}
{"text":"Authentic feel inside.  Cashier was very outgoing, and suggested the steak burrito, which I took him up on.  Though I've had larger and meatier burritos this one hit the spot and came out in less than a minute to boot.  Meat was lean and the extras were very fresh.  Next time I go back I'll maybe try the shrimp.  Pros:  amiable staff (and cute cook) and fresh well made food. Cons:  none really, except the burrito size.  Oh, and $2 for chips."}
{"text":"Order the carne asada taco with cheese, beans, sour cream and guacamole. Chips and salsa are a must.  The salsa is like a pico and not spicy at all.  Very refreshing with the salty, crispy chips. I've tried the strawberry and watermelon aguas fresca and they are both very good without being overly sweet."}
{"text":"this is my favorite mexican fast food in las vegas...I recommend the steak quesadilla with everything.....at first your like \"$8 dollars?\"  but once you eat 1 quesadilla (all you need is one to fill up).... your body trembles and your tatse buds go crazy!  you just want to come back over and over....feel like mexican food ?  go to los tacos right in front of the swap meet!"}
{"text":"Los tacos has the best tacos in vegas for my taste. Is not just a regular taco, every taco is a meal. You have to use both hands to handle.the waffle shape taco!!!!the shrimp cocktail is very good. The service is excellent and evryone is so helpful. I visit los tacos very often and family that visit from out of state love this place too."}
{"text":"ive been going there since the mid 90'sbut today i had a bad expereince the lady charged me a $1.00 over what i normanly pay for a carne asada burrito when i questioned her she said that was not so in a mean way and a dirty look her english was very bad"}
{"text":"Flame! Food was delicious and the people were chill. Food came out quick and it was fresh"}
{"text":"Consistant, fresh food. Limited menu and a bit pricey but always satisfying."}
{"text":"Best in Las Vegas. The food is absolutely incredible and the staff is so nice. They just make you feel so welcome. With customer service and quality food like this, they are unstoppable."}
{"text":"Authentic, great quality and excellent flavors. The tacos are amazing and if you get one with everything, one taco is enough! They are huge! Their signature green salsa is the best and compliments their food perfectly. Their aguas frescas (fruit waters) are refreshing and flavorful, not too sweet. I've never had a bad experience and my Friends, Family, Co-workers and I enjoy eating here when we are on this side of town."}
{"text":"You know I have been coming to this location now for atleast 2 years. They have always been overpriced in my opinion. I just went back today and found the prices just went up! Good food but your gonna go broke if u r hungry. Ridiculous to charge so much for tacos. I will never be back. Who charges an extra $1 for asada for a 3.50 asada taco?! Don't even think about adding cheese, crema, avocado, you'll need a small personal loan!"}
{"text":"I met a friend for lunch here. There was a line but not surprising the good food they have here. Line went pretty fast, hard working people. Ordered the carne asada burrito with everything. Came in again with family and ordered the quesadilla with guacamole. Amazing!!! I'm going to order everything from the menu."}
{"text":"When I get a taco craving, I'll hit this up after I get off work. Love there carne asada. Recently I ventured and tried there al pastor... Mmmm, my new favorite. I like it exactly how they make it, do not add any of the extras they offer. Oh and I like there green sauce. Next time I'm going to try an al pastor burrito!"}
{"text":"Simply Amazing. The Seafood Cocktail is fresh and delicious. Chock full of everything. I'd highly recommend grazing the entire menu, because everything here is just plain good.  Usually very crowded, and loud, but the low prices make up for it. They need a location in the South though. Otherwise, two thumbs way up high"}
{"text":"Damn these tacos are pretty good!!!!! Every time i come to vegas ibstop by for tacos de buche and un quesadilla de asada!!!! Hits the spot all the time!!!!"}
{"text":"Tacos de asada and tacos de pollo tasted really good. Highly recommend this place if you're craving Mexican food not too far away from the strip. On top of that, the people there were super nice! Really good customer service. Thanks guys!"}
{"text":"Never disappoints been coming to the original spot in San Francisco since a child hiw excited was I when I found out they have a sister restaurant in VEGAS! More than most but well worth it. Get the secret cripy tacos any meat and blow your mind and taste buds away"}
{"text":"I absolutely love this place! I get the chicken burrito with everything additional inside. It is amazing and I love their guacamole sauce they have in the bottles on the table. Yum!! I just wish there was one closer to me! The only two are in older vegas. You guys need more locations!"}
{"text":"Ordered a bean, cheese and rice burrito and they gave me a bean and cheese.  I don't speak Spanish,  I shouldn't have to, but it seems they only employ Spanish speakers. I'll go to tacos El Gordo from now on. This is the 3rd time, I'm done. Called to complain and couldn't understand a word they said. I won't be back and I wouldn't recommend. Learn to speak English."}
{"text":"I try to love Los Tacos, I really do.  It's always packed, which is generally a good sign. But....why is it always packed?  To me, it's kind of \"meh.\"  The Good: They're great because they have so many options.  Seafood, chicken, burritos, chips and salsa -- awesome if you're not in the mood for a street-taco-centric meal (aka Tacos El Gordo).    The \"Meh:\" . . . the meat they're cookin' up, at least in my experience, is dry, dry, dry.  I recently ordered the beef combo plate (which comes with 4 corn tortillas, a hefty serving of carne asada, rice, refried beans, lettuce, tomato, avocado, and limes) and was really disappointed. The rice, the beans, the meat, all \"blah.\" The burritos and tacos, however, tend to be better because they're smothered in guacamole and sour cream.  I've never ordered the seafood primarily because the restaurant is a tad dirty and hot.  If you're daring enough, let me know if I'm missing out (or if you got food poisoning)!"}
{"text":"This place is Excellent food is delicious. The only problem  is the carne asada meat is cut thick and squares."}
{"text":"I didn't eat here, but I'm giving them 5 stars for customer service. My car caught on fire on the street next to their drive through window. They quickly gave me a fire extinguisher through the window, although it was unfortunately too late.   The fire department came, and I was just sobbing and stranded on the corner in 110* weather. One of their staff came out and put her arm around me, brought me in and offered me food and drink, a place to sit. I was too upset eat--but it did smell delicious. It was just very kind and, in my opinion, more than worthy of 5 customer service stars! Thank you so much!!!!!  Several people outside did stop and ask if I needed help, gave me some water--thanks to them too if they read this.   Good humans here"}
{"text":"Food is good. They add an extra 50¢-$1 on each additional thing you want on your food with out telling you. Adds up to be a pretty expensive meal. I would be okay with the price if they let me know before I see it on my receipt."}
{"text":"Definitely one of the best places here in Vegas. I moved here from the Bay Area, CA. The flavor and quantity is very good. Love their carnitas burrito and their street tacos."}
{"text":"Hands down THEE BEST CARNAE ASADA TORTA in town...   That should be enough for you to run to LOS TACOS."}
{"text":"Don't just drive past this place! Yes, it looks like your average fast-food-joint-converted-into-Mexican-taco-stand. From the outside.  Go in and you are first greeted by the staff who smile and say hi as they bustle through their food prep (they're also filling drive-thru orders). And you look around--the place has charm. They've put in their own furniture--kind of modified benches/tables that feel like a comfier upgraded fast food set-up. There's some decor, the place has a feel, maybe even some plants. Your senses tell you this is NOT just a taco joint or fast food.  And take a look into the kitchen, which is all open for you to check out. It's shiny, clean and fresh-looking. You're excited about what will come out of there.  I had told my friends that, according to Yelp, the tacos were huge. The guy behind the counter was fixing one up. He saw us staring and held it up for us. He saw the awe in our faces. He smiled and said, 'Half pound of meat.\"   We got a variety of tacos in our party  (each of us only needed one). It comes half wrapped in paper like an In&Out burger, and it's good that it does. It's thick and full of juicy stuff piling out the back. I chose the carne asada--pretty awesome. My friends liked the agua frescas, too.  I wish I had a taco joint like this near where I live. I'd make it my regular go-to. The food is lightning fast, but I'd even be tempted to hang out a little."}
{"text":"Love love this place. The tacos are huge and filling. I only get one tacos and a ceviche tostada. So good and fresh. Quality food."}
{"text":"Great spot, I will be back for more.   The food is messy bit what great taco isnt.  My only problem is I didn't know how big the tacos would be and I am so full I don't want to leave.   Will be back many more times."}
{"text":"The management is awesome and helpful. Accept the girl preparing the food, she's not so nice. The food is as authentic as it gets and absolutely delicious. Way worth the long drive we took to eat here."}
{"text":"Best tacos in town! I crave them on a daily. I know the owner personally and he is a very honest, humble, respectable family man. Chicken tacos with beans, cheese, and sour cream is to DIE for. Savory, full of flavor, worth every penny."}
{"text":"OUTSTANDING!!! This place has the MOST delicious food. The carne asada tacos with everything (cheese, sour cream, and guacamole) are phenomenal! The ingredients are so fresh, the meat has a nice grilled smokiness to it, and the green chile sauce (always served on the side) tops it all off perfectly! The staff is very friendly and the place is always clean (at least the one in Sahara is)."}
{"text":"Why is it so hard to find good Mexican food in Vegas?  I come from SoCal so I guess I'm spoiled.  Los Tacos is soooo good, it's worth the drive all the way from Henderson.  Tacos are great, burritos are great, carnitas is superb, love their watermelon drinks, and don't forget to get an extra large container of pico de gallo to take home.  The best ever!"}
{"text":"Great flavors! They have options for grilled or boiled chicken! Tacos are filling! Quesadilla is cheesy with a crispy fried tortilla! Good choice for fast food!"}
{"text":"What can I say that has not already been stated?  This place serves up some of the freshest Mexican food in Las Vegas.  When I say fresh, I mean crisp lettuce, firm avacodo's, ripe tomatoes, perfectly cooked meats...and the list goes on.  The portions out of this joint are the things that make Weight Watchers cringe.  For what you pay, you get an ass-load of food.  One Carne Asada Taco is about a pound of beef, before all the other items.  I don't eat here often, but when I do I am usually very hungry and I got a real craving for some authentic, fresh Mexican food.  on Apetit!"}
{"text":"Los Tacos has a fast-food feel. They offer carne asada, carnitas, al pastor, pollo, head and tongue. Tacos are $3 each, they are a bit bigger than those at Tacos El Gordo and other taco shops. Just watch it when you say yes to everything (pico, bean, cheese, sour cream and guacamole). It's an extra $1.50. Each of our tacos were $4.50.  Carnitas were a strong favorite. Al Pastor was a weak rendition, very disappointing. Carne Asada was pretty good with everything, however, not worth $4.50."}
{"text":"This is my 2nd time here at Los Tacos and it was always a pleasing one. The tacos is very delicious although it was a little bit expensive for a regular size tacos. They do serve fresh juice straight from the fruit itself. My favorite is the pineapple juice and it was very good and refreshing.  Restaurant is always clean and great with customer service."}
{"text":"Food is great but they take forever to serve you! You can easily be waiting in the drive through line for 20 minutes. It's ridiculous they haven't figured out some better. This makes me reconsider coming back."}
{"text":"Why haven't I tried this place sooner! One day I had a craving for elote (Mexican style corn) and I thought this place would have it.  My BF and I went thru the drive thru and they unfortunately didn't have it but, the owner of the place asked if I had eaten there before. I responded that I hadn't and he gave me this delicious mango drink and told me if I came back he would treat us to lunch. I mean, who does that? He is the reason I returned just to see what the place was about.   We returned and ordered Carne asada nachos, a buche taco, lengua tacos, a pastor taco, watermelon juice, and mango juice.  I don't recall seeing the Carne asada nachos on the menu but when we asked, the same gentleman told us he could make it. Everything was fricken delicious!   We eat lengua tacos a lot and this has to be the best hands down. The reason is because they cook two batches a day to keep it fresh. At other taco places the meat sits there all day and night (eh hem Tacos Mexico), and soaks up the oil and just gets old. At Los Tacos, It just tastes so much cleaner without all that old grease and doesn't even need sauce.   The Carne asada nachos had guacamole and salsa piled high and we finished every bite.  It was so good, the owner noticed I was dancing in my seat while eating (I didn't realize I was doing that)   Love this place! And it's so close to home... The people that work here are amazing which makes it even better than 5 stars."}
{"text":"Buyers BEWARE!! The tacos really are good. They come with beans and cheese in addition to the meat, but they will CHARGE YOU EXTRA: $1 for no beans, then she'll ask if you want everything on it and they'll add an additional $1.85! All of a sudden your taco ends up costing you $6.35!! Yet the nachos were only $3.50. Weird. Over all the food was really good. I just didn't appreciate the extra charges."}
{"text":"Los Tacos is one of the best taco places in the valley. The actual restaurant is a bit on the junky side but those are usually the best places and this one is. Price is a bit high but you really do get what you pay for. Carne asada burrito and tacos are my favorite. You will not be disappointed."}
{"text":"Man I love this place, be sure to get the chicken tacos with guacamole and pour some extra hit sauce on ( house made ).  Tacos are huge and 2 typically fills me up.  I always grab lunch here when I am in town- about 20 min from the strip in traffic but worth the trip if you have a car."}
{"text":"I only found this place because of yelp. I wasn't full after eating lunch so I went out to get a second helping and found this place. I got the lengua burrito with all the toppings. The service is friendly and the atmosphere is reminiscent of SoCal Mexican eateries, so it was great to feel like I'm back home. What I liked was that the burrito was well-portioned, and I usually eat a lot in one sitting. It's far from home, but I would recommend the trip for anyone looking for good Mexican food at a fair price. And the food is definitely comparable to the Mexican eateries in LA."}
{"text":"This is my go-to spot for Mexican shrimp cocktail, burritos, and tacos when I'm too lazy to cook my own.  The meats are well-seasoned, salsa always tastes fresh, and the chips are the best I've ever had. The aguas frescas are refreshing and not too sweet. Prices are very fair for the quality."}
{"text":"My favorite taqueria in Las Vegas.   Authentic and delicious.   The boiled chicken tacos, el dorado with guac, sour cream and cheese are the best I have ever had.   Shrimp cocktail is a hidden gemm .  Ask about the chorizo/refried bean dip (secret menu item)"}
{"text":"Absolutely amazing tacos.  These tacos are truly supreme.  I feel that they Los Tacos has the best tasting carne asada in all of Las Vegas.  They are not as fast as other taco shops, but I guess you can't rush taco perfection...."}
{"text":"spent 47 dollars on 2 burritos 2 tacos and a quesadilla , never again no flavor for that price."}
{"text":"By far the best Mexican food in Vegas!  The carne asada tacos with everything are a must.  And their ceviche is RIDICULOUS!!  Everything is made fresh.  Haven't tried anything I don't like!"}
{"text":"Tacos here and amazing! The area is a little questionable but dont let that detour you. The food will make up for it. I get the tacos with everything on them its an additional 1.50 but way worth it. Tacos with everything cost about $5 each and i eat about 3 so its pretty pricey. Be sure to squeeze the green sauce in the tubes all over the tacos or burritos youll thank me later. I keep going back regardless of the price because its that good!"}
{"text":"Cada vez que cómo aqui les quiero dar la oportunidad de convencerme de nuevo que vale la pena, especialmente con lo caro que esta todo.Siento decirlo pero no ha pasado. Los tacos de azada estan buenos y las quesadillas pero porque tan caro? Y te cobran extra por todo! Cai gordo. Los burritos de lengua estan talludos. La lengua no tiene sabor y parece que en veces hasta que  esta hervida en vez de al vapor. Recomiendo los cocteles de camarón esos si estan ricos. Pero todo el Menu esta caro. Quieren lengua o al pastor o cabeza o tripa buena? Mejor caminen unos cuantos pies y llegenle a Tacos el Gordo."}
{"text":"Looking for good authentic Mexican food when you're on the go?  This is the place!  Awesome carne asada and chips & salsa!  A simple, no-frills joint that's all about the food."}
{"text":"I love this place. Food is fresh and fast. Its just a little expensive for a taco. I spend almost $5 for a single taco. It's delicious but it's burning a hole in my wallet everytime I go."}
{"text":"So I walk in and order 3 carne asada tacos, 2 carne asada burritos with everything and 3 drinks. Total price 33.51. I asked the cashier to repeat the total, because I taught it was wrong, so she did and it was correct 33.51 was the total.  So I looked at the reciept and found out why it was so expensive. Tacos are 3.00 each, burritos are 4.50 each. What they don't tell you is that if you want your tacos and burritos with everything it's going to cost you an extra 1.50 for each taco and burrito, so instead of paying 3.00 for a taco your actually paying 4.50 for one taco and 6.00 for a burrito. Burrito not worth the price. The taco was very good, but not for 4.50. As for being the best as I read some of the reviews, not really.  I live in Los Angeles and I've had way better tacos and burritos for much less.  I would never go back to this place.  Way over priced."}
{"text":"Hands down the best tacos I've had here!! Customer service is great with friendly staff! I will be returning for sure!!"}
{"text":"Los Tacos does carne asada right.  Their burritos and tacos are out of this world delicious. In fact, I haven't met their equal anywhere I've been. Their fresh fruit drinks are also super yummy and refreshing."}
{"text":"The best shrimp cocktails in Las Vegas !! I come here just for the shrimp cocktail . The staff is great also ."}
{"text":"If you don't like these tacos, you're smoking crack. My family from San Diego who are taco snobs had their jaws dropped by the freshness of this food. The only downside to this place is it's location. Kinda shady area but not too bad."}
{"text":"Best carne asada in the world. Steak quesadilla is amazing, Carne asada burrito is amazing get it with everything on it, arroz y frijoles is not the same as rice and beans, also amazing.  That crema."}
{"text":"One of my favorite places in Vegas. Love the food and the people. I wish there was one in summerlin but I will drive over here for their food anytime!  I always bring visitors for out of town here. It's always a hit."}
{"text":"The al pastor is no Bueno. In my opinion it might taste better if it was sliced off the stick. It wasn't horrible but it would definitely not be my first choice. The asada was good, nothing out of the ordinary. Beans were however delicious, de la olla.  Staff was friendly and we were able to get samples after asking. Nothing compared to Tacos el Gordo however. Mini tacos are 1.99, so I don't mind paying the extra cents to get better tasting tacos."}
{"text":"The BEST carne asada tacos and burritos!  The meat is good quality and seasoned well and the portions are generous.  I have yet to have a bad meal here! My husband loves the al pastor burritos and chips and salsa.  The jr. burrito is probably the size of an average burrito- so the regular size will more than fill you up.  I have seen some reviews that complain about the location or the building- yes, it is an old building not far from downtown, but I think it adds to the charm and is better than a cookie-cutter fast food joint.  Add the guacamole and sour cream- so worth it!"}
{"text":"Alright, don't tell anyone but this IS the best take-out Mexican in Las Vegas. It's just a little bit more expensive but totally worth it every time."}
{"text":"This is my second time eating here and was as happy as the first.  Friendly staff, very clean, great food.  I like the carne asada taco.  I only ordered one with some chips that we shared. The first time I had ordered two tacos (carne asada and lengua) and it was a bit much.  My husband likes the lengua taco, he had two.  We love the green sauce on the table.   Reasonably priced, generous portions, delicious food.  I'm excited to try something else on the menu next time."}
{"text":"First thing's first. Great tacos! I've had them once at their other location and figured I'd bring my family to try them here since it's a lot closer. We ordered separately, my order and the kids were fine until it got to my sister's and my mom's order. My mom ordered for her tacos to have everything. Did they come out like that? Nope. So we went and told the cashier that we had ordered them \"con todo\" yet because the cashier didn't actually charge them like that she wanted to charge extra to exchange the tacos. An ordered they messed up. I've worked customer service my whole life I know how things work. Said no. Then the cashier can't recall her name but you can't miss her she has hickeys all over her neck and lashes full of glue it looks like it's been weeks since she last took them off. Anyway, since she did not just want to take care of us, the customers for something she was at fault for, we asked for our money back for those tacos. They were 6 tacos in total that we're suppose to be getting our money back. This girl comes back with okay you'll get your $4 dollars refunded and wanted us to act like we were okay with it. Absolutely fucking not! Each taco mind you is $3.50 plus $1.00-1.85 per taco depending if you asked for just meat or \"con todo\"(yes you'll get charged 3.50 PLUS another dollar for getting just the meat) I asked to speak to the manager, but of course she wasn't there on a Saturday. Yeah okay! The hickey girl had to get on the phone with someone for us to finally get our full money back. It's ridiculous, when it could've just been solved by taking care of your customer and adding the extra stuff that we had asked for. We didn't even want the money back we just wanted the order right. Like I said great tacos, but no matter how good they are, none of our family will ever be coming back to their restaurant. They lack basic customer service."}
{"text":"All I can say is I love Los tacos. Every time I go I get a junior chicken burrito (because the regular size is huge and I never finish it) and we split some chips and salsa. They have amazing finely diced salsa and their salsa verde at the tables is the best."}
{"text":"I have been coming to this place for about 7 years, back when it had a different name. All I can say is WOW!! this place is absolutely incredible. I am a native to vegas and have tried just about every mexican restaurant in town and this place beats them all.  I am a meat lover at heart, but when I come here all I order are their veggie tacos and burritos. I have tried other things on the menu and have never been disappointed. Everything is just so fresh. This place is always busy with a line of people, but I never mind the wait, its part of the experience. Ok im done now, go to los tacos."}
{"text":"I can't tell you how much I love the carne Asada tacos with everything! I order mine crispy and they are religious to me!"}
{"text":"This place is good, but not THAT good. I feel like finding great Mexican food places came so much easier in Southern California. Like a few others stated, it's a little pricey. For $18, I got two carne asada tacos and a shrimp tostada, with avocados and sour cream. Again, they were good. Just not OMG-this-is-phenomenal-over-the-top good (like say a Taco Mesa or Caliente in Costa Mesa, or Pinches Tacos in L.A.).  I feel like the yelpers here have overrated this place. I would have been ok if the tab came out to around $12; $18 is a little over the top for what it was. I think I could cook up something comparable in my own kitchen."}
{"text":"The food is great.  Favorites: tacos carnitas and mariscos! The tacos are good both ways. Regular or \"crispy\" with cheese. Add avocado.  Shrimp cocktail, always fresh and super yum....no crackers. Just chips. Chips here are bomb.   Some might find it \"pricey\" and I'd tend to agree.I find it to be true in all restaurants these days. Opperating costs are huge.  The extra few bucks, in Los Tacos case, for me, is justified by knowing that I am going to leave happy everytime. Having  go-to spot feels good."}
{"text":"When I'm around West Sahara, and feeling like tacos, this is a dependable go to. Carne asada plate is fantastic. Salsa is flavorful and portions are worth the dime. My friend also swears by their burritos."}
{"text":"One of the best taco spots in Vegas. The meat taste fresh and juicy I got al pastor, boyfriend got carne asada and said \"it taste like it was fresh out off the grill.\""}
{"text":"The food here is really good. This place is probably one of the best taco shops in Las Vegas. All the ingredients are super flavorful. Definitely not bland at all. The atmosphere is pretty standard for a taco shop not great not bad. I would of gave five stars based on how good the food is but I still think they are a little pricy for what your are getting. Four tacos can set you back $27 easily."}
{"text":"Good grub, cheap prices, mom and pop feel.  Not far from the Strip on Sahara.  I was at the Rio, so maybe a 5 minute drive away?  Loaded carne asado taco for $3.  I really enjoyed the cheese quesadilla (and the chef even added free carnitas pork for me).  Very friendly establishment.  Will visit every time I'm in Vegas."}
{"text":"Fantastic carne asada burritos as well as al pastor.  We were in town for three days at a  conference and went out there twice because the food is so good.  The price is great (for vegas) and the food is amazing.  Friendly service and great experience.  Compares very well to the Mexican food in San Diego."}
{"text":"The Tacos are Everything! ! I was craving Carne Asada tacos and got exactly what I wanted & more,  They aren't stingy with the ingredients. $3.50 a taco may seem like a lot but worth every penny! I promise you will not be disappointed! They have a homemade green salsa that is a must! Seriously I am so glad they are a 30 minute drive from me cause I would be there everyday lol...."}
{"text":"I am a fan of their vegetarian, whole bean burritos and scrumptious cheese quesadillas. The also have these fun fruit drinks with actual pieces of fruit in them. Of course, I also love that they are right around the corner. Viva Los Tacos!"}
{"text":"I travel to Vegas every three weeks, you get tired of all the chain restaurants, and sometimes you just want some great Mexican food.  Boy, did I ever.  This place is clean, very friendly, and excellent food.  I would highly recommend this hidden gem."}
{"text":"Why can't this chain take over Roberto's???  A big thumbs up.  I got the junior burrito with beans, rice, carne asada, and pico de gallo.  Ahhhh all the great memories of going to the taco trucks in California flooded back.  $3 bucks. That's a great deal.  The place may be fast food, but it's authentic. I wish they had more locations."}
{"text":"Such a disappointment. The tacos were overpriced, the carnitas were so dry, and the carne asada was cooked like steak in big chunks and tasted awful. I hated the food. They overcharge everything. Even the avocado was slivers for $1.00. No authentic salsa and the fish was cooked like Machaca. The same fish on the taco was the same they used for my tostada de ceviche. This Mexican food couldn't even fool white people! Don't waste your money."}
{"text":"Reducing one star due to the constantly shrinking size of the tacos! The price is still the same, but what used to be a huge taco is now near street taco size."}
{"text":"Love this place, but reducing to three stars because the portion size of the taco \"with everything\" (cheese, sour cream and avocado) has shrunk! The price is the same, but the taco is almost the size of a street taco now."}
{"text":"Chorizo tacos WIN!  Everybody reviews the Carne Asada, but the secret family recipe chorizo stole my love.  The owner was there, very friendly, told me  a great story about his father and their other restaraunt in San Franciso.  Ask him!   I go back every time I'm in Vegas."}
{"text":"Los Tacos is a great local taqueria with at least two locations. For fast tacos and burritos this place is great. The price is a little higher than some might expect, but my experience with this location has been consistent for years. The only time I had issues with them is when they weren't taking credit or debit cards and it seemed on again- off again. But that's apparently resolved so the chowing is ON! I love their veggie tacos, shrimp tacos, and veggie burritos!"}
{"text":"I was immediately blown away upon arrival. I was craving tacos, and the place that I had my Groupon deal with was close. Being the yellow that I am I yelped, then called to make sure that Los tacos was opened. I then drove here and pulled up in their drive thru. Daniel the owner asked me to pull up so he could help me since it was my 1st time here. I pulled up and asked for tacos. Not only did he give 4 different meat samples to me and my boyfriend, he gave us like 6 agua frescas samples. My heart was set on the Mango pineapple... We were provided the best customer service ever, and he even have me the address to his dad restaurant in San FranciscoI can't wait to try it when I vacation out there in a couple of months... This place is the best.. I'll be back everytime I'm in Vegas... Thanks Daniel"}
{"text":"Delicious food, goodly-sized portions.  I usually have a carne asada burrito with everything and homemade chips and salsa.  Always pleased with the food quality and speed of preparation."}
{"text":"Great food, prices are bad, the reason I said this is that if you order a taco with out beans or with out something else they will charge you extra. They charge extra for removing toppings!"}
{"text":"This place was busy but still quick.  At about ten dollars per person, you can fill up on delicious tacos for less. Two tacos are enough for an average person and three will definitely fill you up.  Reminded me of the taco trucks in California.  Get your authentic tacos here! Lengua, Al Pastor and Carne Asada were all quite good."}
{"text":"Maybe the trick here is not to use the drive-thru. I thought it would be wildly convenient, but it took 15 minutes to get my simple order, without apology or explanation. Menu is straight forward: tacos and burritos with all of the expected meats, small seafood selection and some quesadillas, and that's about it.   Staff may or may not speak English so bust out your best high school Spanish. While you wait in the drive-thru, enjoy watching the staff make their own meals or snacks and eat them, then return to work without using gloves or washing their hands. As you wait for your own order, forgotten by the cashier.  Lengua junior burrito is well-sized but literally consists of just lengua and cheese. Probably a better option than ordering several separate tacos, if you're going to get them with all the same meat. The lengua itself was soft and flavorful and delicious, but the taste got boring after half of the burrito. Alas, I had not been given any salsas, dios mio!  Ceviche tostadas is two crispy shells and a small-looking portion of fish in a Styrofoam cup with avocado slices. Fish was fresh and had good flavor- simply seasoned with sal, pepino, y limon, but it really worked, especially with the creaminess of the avocado."}
{"text":"This place was recommended by a friend and we loved it!  Ordered 1 beef head taco, 1 tongue taco & 3 chicken tacos.  3 Carnita burrito & 1 tongue butrito. Also ordered 3 small rice & beans.  Totaled $57!  It was great I could feed 5 people with damn good food- tender meat & great flavors.   tip: watch out for the add ons.  Tacos & burritos general just come with meat & tortilla.  If you want cheese, avacado or sour cream it is $1 extra.  Same with beans..It would be extra.  Also keep in mind, when you order side of beans/rice to go...It comes in small Drink cups and the beans will spill.   Taco $3 each..add sour cream & avocado $1... total $4 for each taco. You have to order 2 since one would not be enough.  It is good but I would say that is not one $ sign prices."}
{"text":"I have been to this location twice now and had a great experience both times.  Both times I have ordered the Carne Asada burrito with sour cream, cheese and avocado.  The Carne Asada is moist, tasty and I have yet to get a fatty piece.  Ina edition to the burrito I get a side of beens and rice. The beans are without a doubt the best that I have tasted without it being someone's family recipe.  Lunch can get very busy but they turn and burn on the orders and it comes out fast."}
{"text":"The kitchen is laid out so the line is in front and visible to you while you wait for your food. I got a chicken burrito bowl and loved it. The chicken was grilled and seasoned perfectly. The rice and beans were delicious and everything tasted very fresh."}
{"text":"If you are looking for delicious street tacos, this is the place! Only downfall is they charge a lot per topping. The chicken tacos are extremely delicious and all of their ingredients are fresh! Amazing place and gets pretty busy, which results in the place getting pretty messy and tables being dirty. However, THEY HAVE A DRIVE-THRU!"}
{"text":"This is my 1st time here. We are visiting from LA.the guy at the register recommended a few items and gave me samples! I orderrd the carnitas burrito with everything on it (beans, sour cream, carnitas, Avocado) and it was grilled. YUM! I also had a pineapple juice...delish! My husband had a Carne asada taco with everything and he LOVED it! We will definitely come back!   I miss this place already! Lol This beats any if the \"tourist\" spots on the strip!"}
{"text":"Amazing! Had the asada Jr. burrito $4.25 (a good size for a junior) and it was to die for!!! The asada was perfect... tender, nice grilled flavor, and plentiful. The Peruvian beans also had a wonderful flavor. Topped my burrito off with the spicy salsa verda, fresh of course and a watermelon aguas frescas. So fresh and tasty! Last but not least, the kindness and service by the employees was very refreshing. They even offered us tastes of the chicken and beans when we were trying to decide what to order."}
{"text":"My new favorite place!!!! Tacos were amazing with just onions and cilantro even! Huge portion of chips and salsa (pico). Staff very friendly!!! So happy my friend recommended this place! I had been looking for a good taco place. Robertos, etc were not cutting it... The flavor of the carne asada alone is great and they give you a huge portion of steak!!! Happy happy happy!!! Now if we could get a los tacos on the south west side it would be heaven!!! :)"}
{"text":"I really enjoy street tacos but this place is one of the few restaurants that captures that street flavor.   When they say carne asada it acutally is asada, grilled over a real fire and not a flat top.   Order their tacos with the works, yes its a little pricey at $3.50 per taco but this is the way to go.  Its two full size tortillas with cheese in the middle that they warm up on the flat grill until the cheese melts and they then fill it with whole beans your choice of meat topped with real guacamole and sour cream  1-2 tacos are normally enough and I usually enjoy their asada or lengua or both :).   Also enjoy their agua frescas made with real ingredients and in the summer their incredibly good seafood cocktails!"}
{"text":"Delicious.  I love their carnitas burrito. They always have friendly service.  It is always a treat when I am on this side of town."}
{"text":"Friendly service and delicious food.  LT can get busy during lunch time but no worries the grill blazes and the chow is served quickly."}
{"text":"This was a stop on a taco trek UYE and I was glad because I always see it, but never go because Tacos El Gordo is next door. This place is pricey! I was shocked at the prices for being a fast food place with a drive-thru. The tacos are $3 each and that is before toppings. If you want cheese, avocado and sour cream it will cost you $5 per taco. The tacos tasted somewhat OK but some of my asada meat was cooked crispy and it seemed the tacos were filled with more salsa and junk then meat. It was a hot damn mess to eat. I just don't like getting ripped off when the taco doesn't even taste authentic and the tacos are overpriced. If you see the picture of my 2 tacos you will think it looks good but are you willing to pay $10 plus tax for them? After buying a drink my total was almost $14. Like I said it didn't taste bad but it wasn't anything close to Tacos El Gordo which is in the same parking lot and right next door! Just go to El Gordo trust me!"}
{"text":"Beware of the con todo here!!! The very unfriendly worker asked me if I wanted it with everything and I of course said yes not knowing that it was three dollars more for sour cream and cheese on my tacos. The staff is very rude there and horrible to deal with.  The pastor is very good and does not need to be drenched in sour cream so I would  like to try it again on its own, but the carne A is horrible, just flap meat grilled and chopped with no seasoning, not even salt. Not good, not good!"}
{"text":"My favorite taco place in Vegas! I have been going here for a while now. I usually tell all my friends to give them a try, and they end up loving them and wanting to go back! The owner is super rad, and he was nice enough to give us complimentary chips and salsa! Recommend it!"}
{"text":"This place has really set the bar for good mexican food... I get a tear in my eye when i think about their quesadillas... They fry the tortilla!! The green sauce is awesome as well!! When ever i go out of town, i try to find a mexican restaurant like los tacos. VIVA LOS TACOS!!"}
{"text":"Sometimes, it's hard to write a review because you have to talk about food. Right now, I am so fucking full, that I have no choice but to write this review with a full stomach, and a happy heart.  My coworker suggested this place for our Work Family Dinner, and we all obliged.  From the outside, it looks like your typical hole in the wall Mexican/Taco joint, but when you walk in, you are surrounded by a clean habitat for the most bomb-ass Mexican food ever.  I ordered one taco (cabeza...brain for you weaklings), and one quesadilla (chicken). Both were perfect.  The taco, perfectly cooked on fresh tortillas, surrounded by onions, and guac. The quesadilla was PERFECT!! Chicken that melted off the fork, and so much flavor, it was as if the chicken was born in the sauce and spices it was cooked in.  Will I come back? Hell yes. Will I feel bad about it later? Probably, but who cares. YOLO. hahaha   Hint...be adventurous, and not a food wuss. Don't ask for things \"healthy\" or say eww just because the menu items have cabeza, buche or lengua. Man up, and be the adventurous person you claim you are. Otherwise....you are a poser. And no one wants to be a poser."}
{"text":"Food is good!  Shrips cocktails they doing it LAST...  So, expect delays, like a 15 minutes.  Your friends could be done with there food and you just get yours...((("}
{"text":"In Vegas for the weekend, we were starving, saw Los Tacos we had to hit it!!! Off the bat food looked amazing. The owner took our order and took the time to tell us how the food was prepared. He let us try carnitas samples which were amazing. Everything was great!!! Food and customer service. If I was a local this would be my spot!!! Thanks from the Suavecito Guys."}
{"text":"Saw this gem listed in the desert companion magazine on cheap eats in vegas, this issue has been priceless in finding great spots and reassuring myself I know good food by seeing some of my favorites already listed.   1 Taco for 3.00?! really?          I can get 39 cent tacos at del taco!   These are some serious tacos with some great ingredients and they are big. I've ordered the carne asada and the chicken tacos on two separate occasions. Both are great but the carne asada is my winner.  Here's a tip, they ask you i f you want cheese, guacamole and sour cream, each one of those is an 'add-on' and they come with a price. Your 3.00 taco can turn into $4-5 for it, without it they still hold themselves perfectly fine. The first time I had it without, the second I had it with!   This place offers a drive thru, the staff is friendly and the service is not too slow."}
{"text":"Los Tacos has the best meats, and flavors.  They understand subtlety and they know better than to cook bland meat and throw it into a tortilla with pico de gallo and call it a taco or burrito. Their carne asada is well seasoned and made to be tender and easy to consume, the best example of this is their torta with everything.   The only gripe is they don't have more locations."}
{"text":"Good tacos. A bit on the pricey side for tacos ($3.50 ea) but they give good portions but still a bit much for tacos IMHO. Chorizo taco was excellent. Shrimp Ceviche tostada is good as well. Would come again."}
{"text":"I came here yesterday with my boys, mom and sister. No one was dining in. It looked clean inside which was good. But the highchairs... I hate cleaning and disenfecting them. Theirs felt somewhat sticky. So that was a minus 1.  I ordered a jr. Burrito carne asada because I didn't know what the size would be. I've had way better burritos elsewhere AND for cheaper. The meat was horrible. I mean they charge for every ingredient you add to your order. So a taco will come out to $5 if you order cheese and avocado. No, no, no thank you. My first and last time."}
{"text":"My favorite taco shop in Vegas. Shrimp tacos, chicken tacos, fish ceviche, carnitas burritos, shrimp cocktail are all fantastic. The watermelon juice is incredible. Everything is fresh and tasty. Love that they have a drive through as well, easy to grab on the run. When my daughter was younger the manager would see us walk in the door and throw some shrimp on the grill for her. Love the customer service."}
{"text":"My standard order: carnitas tacos don't forget the sour cream, guac, cheese upgrade ($1.50, a must).  The shrimp, octopus, oyster cocktail with chips. SO YUMMY. SO FRESH. My husband likes the al pastor tacos, with upgrade of course. My cousin likes the burrito with rice (complimentary) plus the upgrade of course ($)  The Sahara location is their second location. I prefer the first location's carne asada it is top notch. This location's carne asada is missing the special spark. That's why I stick with carnitas at the Sahara location.  Tip: this place is like In n Out, when the lines long, you are probably better of going through drive thru!"}
{"text":"I am definitely a fan.  Their tacos are big and very tasty.  I really love the steak and the al pastor tacos.  Their meat tastes so good and this is hard to find at most taco shops here in Las Vegas.  With 2 tacos you are good and the tacos are served with beans, cheese, 2 corn tortillas, and if you want at an extra cost, sour cream and guacamole.  It's one of my favorite taco shop in town They also have fruit juices that are very good, the mango is delicious."}
{"text":"When you arrive in Vegas, this should be your first meal. It's hard to find the once famous Vegas deal of $2.99 all-you-can eat buffet. Inexpensive stuff your face deals have been replaced by trendy restaurants \"run\" by chef's with TV shows.   So now, the best deal in Vegas is Los Tacos. The best Mexican food you can find served by friendly staff at a great price.  On second thought, this should be the last place you eat before you leave Vegas. Make sure you save $5 for a couple of great tacos!"}
{"text":"This place is amazing! BEST chicken tacos and guacamole!"}
{"text":"The food here is the best the tacos comes with guacamole,picadillo, choice of meat and sour cream soft tortilla over a crunchy tortilla is so good. The tostada de camarones is good with lots of flavor. The employees are super nice very good service. When we come here to vegas this is our MUST!! Stop :-)"}
{"text":"Looks were definitely deceiving about this place, but it's done more harm than good to judge a book by its cover - especially in this town. I went in not having much else to go off of but a recommendation from a friend.   Their menu is rather simple, but it's got all the bases covered. Standard tacos, burritos, and quite a bit more with an impressive selection of aguas frescas. I ordered the carne asada tacos, and got to try a bit of my friend's shrimp cocktail. Oh my god, yes.   The ingredients were fresh and colorful, the carne asada was probably some of the  best I've had in a good while, and the presentation was just right. The burritos also looked amazing, but I didn't get to try that. The portions are also pretty great!  The aguas frescas they had were pretty fantastic, too. I got the strawberry first, and then another watermelon one for the road. Considering it's barely spring as I'm writing this, they tasted very nice! I would have expected they wouldn't taste very good because of the lack of availability of fresh fruit, but I was wrong again!  Overall, completely worth it. The price is a little higher than most places, but there's some real quality work put into this place. Hopefully to become my go-to mexican place ^_^"}
{"text":"Hands down the best Tacos in Vegas.   Their Carne Asada Tacos are full of flavor and on top of the great food, the staff is amazing!    I look forward to my next visit"}
{"text":"Great small taco shop. The have all the traditional meats, to make tacos, burritos, quesadillas, and nachos.   Fresh salsa and Guacamole made daily. There is a bunch of different Aguas Frescas I had the watermelon agua.  The feel of the restaurant is that of a fast food shop, whit several ladies getting the orders done in a flash, I had three items and it was done in no time."}
{"text":"Get the chorizo burrito- grilled. So amazing. The owner when we walked in gave us tons of stuff to sample, all of which was amazing. The shrimp cocktail was superb. They have fresh squeezed juices too- watermelon, mango, pineapple, etc. I'll be going back every time I'm in Vegas!"}
{"text":"This place has the best tacos I have ever had. Get the carne asada with everything you will not be disappointed. Be prepared to spend some money though. Tacos with everything are around $7 well worth it!"}
{"text":"Had Carne Asada tacos and meat was barley warm. Also got two burritos and they were super small. Definitely won't be back"}
{"text":"Adoro sus tacos de ceviche y mi esposo los de carne asada. En bebidas el agua de tamarindo, en mi país le dicen jugo de tamarindo. ¡Delicioso!"}
{"text":"A MUST when in Vegas! Fully loaded tacos, a bit pricey but hella worth it though!"}
{"text":"Excellent tacos and freshly prepared tostadas, not premixed. The salsa wasn't too spicy and the aguas frescas weren't cheap fountain drinks. A bit pricey for a taco joint, but worth it."}
{"text":"This place never disappoints! The carnitas tacos are just AMAZING!! And the Carne Asada Taco is da bomb too!! We just ate 4 tacos, a side of sour cream and got 2 agua frescas watermelon and strawberry (new fave) for just $20 total!"}
{"text":"OH MY GOD!!! Their carne asada burrito!!! I think I could eat that EVERY SINGLE DAY!"}
{"text":"D E L I C I O U S!!!  The carne asada is the best in town!    The homemade chips and salsa are so good.   This place is consistently delicious."}
{"text":"Never coming back to this place food was bad and over price they ask you do you want everything on your tacos if you said yes they charge extra for sour cream cheese and guacamole but they don't tell is a charge I ask for a refill they don't do refills bad costumer service and food is not good"}
{"text":"This place is amazing! I had the carne asada tacos with rice and beans and I could not have been happier.  At first I thought the place was a little expensive but after seeing the size of the tacos I thought the prices were fitting. Packed with meat and guacamole, I did not want them to end, lol and the beans were the bomb!"}
{"text":"This is by far the absolute best place in Las Vegas to get burritos and tacos!!! They have the freshest food! Best red sauce!!!! For sure 5 stars"}
{"text":"So basically, for what this place is, it's amazing. It's clean inside, the staff is friendly, and most importantly... The food is awesome. The menu is small and simple, but it's simple done well. I'm hard to impress, and I was truly blown away by this place."}
{"text":"This place always hits the spot! The burritos are so tasty as the in-house made green sauce is amazing; a must-have each and every visit.   In addition, the staff are super friendly and remember frequent fliers."}
{"text":"What a dump. I thought my friends were taking me a decent Mexican place to get a late dinner. Uh uh. Los Tacos was run down, grimy and full of graffiti on the bathroom walls.  The food was ok. They have a pretty limited menu. Just the basics of Mexican food. I had a carne asada burrito, some rice (which was hard), some beans and a soft drink. I spent over $9 on all of that! Not worth it, but I was hungry.  One big plus was the nice people. They were helpful and got us what we needed when asked. They didn't seem to mind that we were the only ones there and went ahead and blasted their ranchero music from the juke box. It was funny actually."}
{"text":"The Carne Asada is King here! Hands down Number 1. Cashier is extremely friendly and helpful."}
{"text":"My uber laid back boyfriend has two stipulations when we are in Vegas.  Wait no, it's really just one. We absolutely have to get tacos from Los Tacos, no matter what. Hungry or not. Even if we wake up late and it delays us further from hitting the road back home. Los Tacos is his favorite taco spot of all time.   There's nothing particularly special about these tacos. Cheese, beans, salsa, sour cream, and guac. Simplicity, that's what makes their tacos so great. Tacos made with really good ingredients. We ordered 3 each because we were pretty hungry. They came out to $25, which sounded a tad high. I had forgotten how huge they were. I got full off of one. So I ate two.   Tacos are stuffed with flavorful pinto beans. They make a separate batch of beans for vegetarian dishes, which I appreciated. A layer of cheese is first melted onto the two stacked tortillas before the taco is assembled (tortilla, cheese, tortilla, cheese) The guacamole is one ingredient: avocado. And they give you a generous dollop of it. I drench the taco in that green sauce, which gives me a small window to finish it...it's a good thing my boyfriend didn't bring me here on our first date."}
{"text":"Been here before. Didnt recognize anyone. It has been a while. Started in drive thru. Girl messed up my order. Told it to her twice. I could tell she wasnt listening. Half way home discovered it wasnt the right burrito. Went back and inside. She didnt seem apologetic. I myself had to explain to cook, just a beans rice n cheese burrito. No meat. Git home and no cheese!!! I am done here at this place."}
{"text":"Drove past this place for a while before I decided to try it out for lunch and I wasn't disappointed when I did. The carne asda is fresh, tender and perfectly cooked. The burritos are amazing and the green salsa is like crack. Friendly staff, great atmosphere, and great food. New favorite lunch spot!"}
{"text":"I spent a lot of my time eating, making and finding good Tacos. Los Tacos is a magical place, but every time I tell my friends \"you need to go to Los Tacos\" I get some push back that Tacos El Gordo across the street is better. My wife and I put that to the test and went to both tonight. Check my review for Tacos El Gordo too.  Los Tacos. The delicious tacos at Los Tacos. I will start by saying these are not normal street tacos. If you're expecting two bite tacos where the meat and tortilla are the star this isn't it. These tacos are about twice the size of a street taco (which is why they are more expensive) and loaded with goodness.   Los Tacos does something special, while heating the tortillas they melt Monterrey jack cheese on the tortilla to make a base for the rest of the ingredients. The melted jack cheese on the tortilla is a special step that just makes their tacos so delicious. On top of that they give a small layer of pinto beans, a good helping of meat and a huge dollop of really good Guac. They don't skimp on any ingredient as the build a taco that is stuffed to the brim.   The only reason I gave them a 4 instead of a 5 is because they use a pretty average cut of meat. Could be juicier if they went with a different cut.  Also side tip: If you get a burrito ask them to grill it. Game changer. Cook there told my brother about it and it just steps the whole burrito game up."}
{"text":"This place has to be one of the best taco places in town they are very good at what they do and the tacos are always filled with tons of meat. My friend recommended this place to me so I tried it and I totally love it. this place can hold its ground among any of the other greats in Las Vegas as you can tell by other reviews and the pictures seen and posted. Give them a try and you will absolutely be back for more. They never disappoint!"}
{"text":"I love Los Tacos particularly this location! Yes it is a bit pricey but you definitely are paying for the quality of the food here. It is not comparable to any other taco place in town because they do not serve street tacos like all the other places. I have not once said I did not like something from here. From the burritos, tacos, tortas and their cocktails OMG amazing!"}
{"text":"This is going to sound like hyperbole, but out of all of my dining in Vegas during the past week's trip, Los Tacos is right up there with happiest memories. So delicious. So simple. So fresh. I had the Taco Cabeza (beef head, fellow gringos), Mrs. H. had Carnitas Burrito (she was not going to be talked into the tongue), both were awesome. The shared shrimp cocktail deserves special mention, bathed in juicy tomato salsa, avocado, red onion, lime and cilantro.   I had zero problem with the price, factoring in the quality, freshness, and quantity. If I were looking for a taco under a buck, I'd just go to Taco Bell. Staff was friendly, helpful, and yes, English was provided. Los Tacos, you're not exactly near the airport, but next time I'm in town you're very likely my first stop off the plane!"}
{"text":"Competition surrounds this place but because of the high reviews and raving remarks of the fellow yelpers, I went here..  For a place like this, considering the location, $3.00 a taco seemed a bit steep. Then I saw some tacos being served in front of me.. Oh, they are not those skimpy little tacos, actually pretty big (piled with meat).   I ordered 2 Carne Asada Tacos with 'everything' (includes their pico de gallo, beans, cheese, sour cream and guacamole). I thought, beans that wasn't typical in a taco i'm used to.. Well, bring it on!!   Then I experimented with 1 Cabeza Taco because I was convinced by a couple feedback I read and then the cashier sealed the deal. She recommended to have it with just cliantro and onion, so I tried it. Damn, it tasted like the meat was marinated for a year. It looked like beef brisket/finely shredded. It honestly was a Life Changing Experience! Enough Said!..  2 Tacos were enough for me but I left the Cabeza for last and had to taste it, just one bite. My plans of saving the rest for later went out the window after that first bite! Yes, I finished it but was stuffed to the rim."}
{"text":"had forgotten how expensive this place is.. & come on after paying almost $5 for one \"asada\" quesadilla de maiz, I would expect some freaken meat!! I pay for the quality and here obviously I over paid."}
{"text":"I was very impressed with the tacos. The best I have had in Las Vegas. However VERY Pricey. The first time I tried this place I went to the drive through. Prices showed on the banner for a taco was $2.50 so I thought ok not bad I have heard good things about the food here, so I ordered 2 Carne Asada tacos . The cashier asks, \"would you like everything on it\" I reply \"Yes\". So she tells me \"that will be $9.90\" I think to myself there has to be a mistake, maybe she heard me wrong, $10 bucks for 2 tacos that's crazy!. So I pull up, I pay, she gives me my receipt. I was charged an extra $1.50 per taco for the everything on each one, the sour cream, salsa, and guacamole. I paid it, but I totally think that is a total rip off. Especially since they do not post that extra charge on their drive thru banner. Not being very honest if you ask me. 4 stars for the food, but 2 stars for the prices and bad advertising."}
{"text":"I've been going here for quite awhile, and have always loved the food! They have my favorite rice, hands down. So much flavor, it's addictive.   Tacos are absolutely amazing, plenty of meat, the chicken is nice and juicy. Just be careful when they ask if you want cheese, sour cream, and avocado; they fail to mention each of these is an additional cost, which makes for a very expensive taco. But still, so good.  Burritos are very filling, I'm usually good with a junior size!  Only thing I've ever been disappointed in here is the quesadillas. Extremely oily, and not much flavor. Other than that, this place is well worth the money, and much less of a wait than Tacos el Gordo next to it.   On a side note, the owner is a very nice guy, we always go trick-or-treating at his house for Halloween, he goes all out for the kids! :)"}
{"text":"Came here bc our taco hang out was filled to capacity and the line was out to the wa zoo!!!   We ordered the pastor taco!  It was horrible!   Been it was so late, we opted for the traditional quesadilla (what can go wrong with a simple tortilla and cheese)  and the California burrito."}
{"text":"After watching an episode of \"Hairy Bikers\" on H2 where they are introduced to Barbacoa (cow head) tacos, I had the opportunity to try them also today for lunch here!   I was able to order a large burrito with a combination of tongue and head meat and was it delicious!!  While these were two separate meat items on the menu, I was able to combine them into the burrito when I asked the gentleman taking my order who I understood to be the owner of the place.  He seemed impressed than someone who was not Hispanic (I'm Asian) was ordering this type of meats.  He told me this combo was one of his favorites and I soon found out why!  It's my new favorite burrito or taco filling!!     The meat was juicy and tender, and not bit off tasting or gristly like when I ordered the Carne Asada tacos next door at Tacos El Gordo, whose tacos I also love.    If you do not think of the source of the meat, you would never know by the taste!  My two tablemates were a little grossed out, but they don't know what they were missing"}
{"text":"Best quesadillas ever. The fruit drinks are very fresh. This is my most visited restaurant in Las Vegas. Definitely 5 stars for me."}
{"text":"I love love Love their tacos. Only place I'll have lengua tacos. The chips n salsa r to die - just fresh tomato salsa n tons of green onion n cilantro. Chips r real too - not the healthy fake kind. The carne asada is fire n tastes fire grilled! Love that. The salsa verde is so bomb too-spicy n just fire. Clean dining at this location too."}
{"text":"This restaurant serves excellent authentic Mexican food. We had the tacos and quesadillas which were outstanding. It was not too busy and it was a short wait."}
{"text":"Can never pass up their carne asada tacos!!! Would eat here every day... If only it was closer to my house! But, it's completely worth the drive!"}
{"text":"Excellent stop during our visit to Las Vegas. This place will not disappoint. No matter a burrito, asada tacos, or a quesadilla, all the food is good. Fresh salsa and homemade chips top it all off. You will leave happy and FULL.   Definitely a must try for all those who are picky about your Mexican food. I'm a little picky since I grew up on San Antonio Mexican food, but this place is GOOD."}
{"text":"I've had a lot of tacos in my travels around the country and this has to be on the top five!!  Tacos are huge and having just one fills you up. Tacos come with choice of meat, cheese, beans, guacamole, pico, and sour cream. So worth the $6.00 everything is fresh and so tasty. The restaurant is clean. Deff the #1 taco spot in Vegas!"}
{"text":"The most authentic Mexican food in Vegas, I couldn't even wait to get back on the road before one of their delicious tacos was in my FACE. Hands down. No argument. No contest. BEST other than going to the homeland yourself. And they have a DRIVE THROUGH!! I was in HEAVEN.   Tip: cash only drive-through, but they also take debit cards!"}
{"text":"Was hoping to check out Tacos El Gordo based on Yelp review, but the line was out the door. Decided to check out here (right next door in the same shopping center) and was glad we did. The food was excellent and the prices were reasonable. Recommend this wholeheartedly."}
{"text":"Here on vacation this is where I began to love taco's ... I highly recommend this place...."}
{"text":"So bomb. I get the carne asada tacos, with guacamole, sour cream & cheese, and they're delicious! Really filling too. That carne asada is on point, and I appreciate the generous serving of guacamole.  One of my favorite tacos ever!   Also, I tried the carnitas, and didn't like it as much as the carne asada... one day, I will be brave and try some of their other menu options.  The horchata is good too!"}
{"text":"What a fucking joke their drive thru is.... I drive up to order my food and nothing. Yelled out hello hello nothing so I assume they were taking orders from the window thinking their microphone was broken, I pulled up to the window and tried to get someone's attention to tell them that I had not ordered, I literally waited 10 minutes and I tried to flag down someone inside and finally I made eye contact with her and she just turned away, waited 5 more minutes then finally someone came to hand me the food for the person behind me at the drive thru I told her that I had not placed my order and she just said \"what do you want?\" Really????? Customer service a big fat fucking zero."}
{"text":"We went to Los Tacos after reading the reviews on here. DAAAAAAANG  you all were right!!! The chicken burrito and tacos were so delicious. The meat and toppings were so fresh and tasty. I can't wait to go back and try some other things on the menu."}
{"text":"I know this joint is called Los Tacos but in my book they're called Los Burritos!  I have only tried their tacos once, which were pretty good but I always come for the burritos, I think you get more bang for your buck that way. I'm one of those people who tries something the first time and continually orders the same thing on each visit, I'm weird like that, I won't order anything else and don't even want to try anything else.  The meat is always seasoned just right, juicy and soft. Guacamole and cheese will cost you a bit extra but to me it's worth it. There's no way you could ever go wrong with guacamole and cheese. I think life would be better if all the dishes on earth had both.   When dining in you get your food pretty fast. Drive through could be very slow, specially during lunch rush hour so I won't hold them against that. It's totally understandable. This will always be my go to burrito place, on average I spend a little less than $10 on lunch here including a drink, their agua de pina is oh so thirst quenching, I la la love it! Give them a try, I dare you!"}
{"text":"Favorite taco shop in town. Love the carne tacos with everything on it and green sauce. Best thing ever ! You will crave this place regularly. It's a bit expensive but it's super fresh which makes up for the price."}
{"text":"For the most part I like this place. I thought it was going to be like an over priced Roberto's, but the food was really good. Portions are large as they should be for the prices. Tacos are massive and include meat, but any additional toppings are extra. The tacos are $3.50 base price, so if you add any toppings you're looking at $5 for a taco! Burritos are $6 and include meat, rice and beans, but additional toppings are also extra. I spent $23 on nachos, a carne asada burrito, a quesadilla and a medium drink.  We ordered al pastor nachos- which aren't on the menu. Now that I am looking at the menu again, I realize nachos are not on there at all, so ask for them. They were pretty damn good. The tortilla chips were a touch too salty, but not a deal breaker. They were fried fresh so they were still hot. The nachos had a generous amount of meat, cheese, guacamole and grilled onions, as well as sour cream and pico on the side per our request. It was only $10 and was enough for 3 of us to share. The burrito was good, but nothing to write home about. I added some salsa that was on the table and it kicked it up a notch. My friend got a cheese quesadilla for $2 and it looked pretty good, but he was still hungry afterwards. I would come back for the nachos, but I think I will stick to other less expensive places for my taco fix.  Note- They are open 10-10 7 days a week. A bit surprising they aren't open until later, especially on weekends."}
{"text":"Tacos were a 4/10. Why? They put beans in your taco. Beans don't go in tacos! Cheese don't go into street tacos. They use white possibly store bought tortillas.  What turned me off the most was not one stove/burner. was on! All of their meats were pre-cooked who knows when! Staff was friendly but we walked across the parking lot from the very busy place across the way to eat some decent tacos. Big let down. We walked across the parking lot & am in line as I write this review"}
{"text":"Even though Los Tacos is one of my favorite taco stands in Las Vegas. I went there today at 8:10pm, waited at the drive thru menu for 10min. Thought maybe it was broke. Drove up to the window, 6 employees were standing behind the counter. I honked the horn several times and tried to waive them down. They ignored me like I didn't exist. This wasn't the first time I arrived before 9pm which is the time that's posted that they close and they closed early. They could of at least had the decency to tell me they were closed, don't ignore me when you know I'm there. Now I see why Tacos El Gordos next store remains busy. It's not just the quality of food, it's also the appreciation and respect of your loyal customers!"}
{"text":"Had a carne asada burrito.. Way too many beans,small, no meat, no sauce variety.. Workers spaced out. Not impressed for $8.. Geez"}
{"text":"I ate at Los Tacos today at the recommendation of a buddy. I had tacos, one chicken and one carne asada. The tacos were amazing. The price is a little high for a fast food type of outfit (I paid about $12 for the two tacos, rice and beans), but it was well worth it."}
{"text":"The tacos itself were good but they are wayyyy overpriced. To start they are $3.5 but to add the cheeze, cream and guacamole it was an additional $3. It's a small taco shop and they are charging $7 for one taco. Insane! Won't be back. Pollo Mobile and Taco y Taco will be main spot"}
{"text":"So hungry one evening and my gf mentioning tacos, I yelped for the nearest place for a log.    I came upon Los Tacos on the way home.  Dropped in and ordered myself a carne asada burrito with everything.  Quite an expensive log, but I guess it was quite worth it.  I watched as my log was being made.  I guess they had a new employee attempt to make it.  He may have put too much carne asada since they weighted my log before putting it into a bag for me.  Regardless, I was so hungry that it was excellent.  Meat was so tender and the hot sauce that came with it was perfect.    Overrall, it was good.  Just not the price.  $8? Dang.."}
{"text":"Best taco place EVER!!! The quality of food is definitely worth the price! We live in Southern California and come to Vegas about 10 times per year and this place never goes without a visit! You won't be disappointed!"}
{"text":"I found the place to be very average. Not bad, not great. I had a carnitas burrito that was everything you would expect. Every item is extra. Guacamole, cheese, sour cream. The burrito cost 6 bucks and was a little on the small side. Overall the experience was slightly disappointing based on the reviews. I would eat here again...if I had to. No salsa bar, no side chips, no nothing, unless you order and pay for it."}
{"text":"This place was my childhood so like I've said before my opinion on this place might be a little bit bias, but I do wanna say I've never been to this location before and it is was better, the other location is sorta sketchy and attracted homeless looking people(not trying to be mean) but this location is more put together and clean. The workers look like they know what there doing, and the food was given to us fairly quick, even though when they call out the food it's kinda hard to understand them. But there food is good we just got rice and beans, chips and salsa, carne asada torta, al pastor torta and a carne asada quesadilla. We did ask for our tortas to be extra toasted because if not they will get soggy and they sorted toasted them but not much so my last couple bites of the torta were falling apart. Over all I like this place and do recommend it to anyone!"}
{"text":"I hold this place near and dear to my heart but only because as a child I was always brought here by my parents, so it has that kind of sentimental value to me, but that aside and being an adult now coming to this location its a little sketchy outside, and the inside has not changed since I can remember ( 15 years ago) so it's pretty old looking... vintage?. There food was delicious though, there tacos are jammed packed with goodness but don't recommend getting because it's so expensive and a little misleading, on the sign it says each taco is 3.50 and when you order it they ask you if your okay with everything, I said sure why not and they charge you an additional 1.50 for that so basically 1 taco equals $5 which is a pretty steep price for that other then that the torta is bomb I would recommend getting it extra toasted and the rice and bean plater was delicious I recommend this place if your looking for good Mexican food ( must try there shrimp cocktail) but it is quite pricey for what you get and the location."}
{"text":"Overall the actual taco was delicious,  I had the carne asada.no pico -The add on guac and sour cream yummy! I didn't like the chips or what they gave me as salsa (just pico de gallo) 2$ for that!?  I will visit again,  and hope they can gain more points."}
{"text":"Pretty darn good tacos.  While they warm your tortillas on the flat top they add cheese rather than having it on top of the meat.  The salsas were good, lengua (tongue) was awesome.  I would come back here."}
{"text":"My boyfriend and I came here on a whim based off the yelp reviews and we were not disappointed. As we hesitated to order, the owner guessed that it was our first time and basically broke down everything to us alongside three handfuls of samples. Everything here was fresh which explains the prices. To top off the food was some amazing customer service all around including some evidently great management. Ill be sure to return for the aguas frescas and to try their ceviche!"}
{"text":"I've driven by this place so many times it is rediculos, so close to my house... Let me just say tonight I found our new location for Tacos. Oh My Goodness the AL Pastor tacos were amazing and the Asada burrito was excellent as well. The danger is now knowing what is right next door. Very good!"}
{"text":"Those of you from Southern California know what I mean when we start talking about amazing Mexican food. You can't really get that here especially from the SW Vegas. Now I have heard that north Vegas has some good Mexican food but who really wants to travel that far? Los Tacos is my to go place when I get tacos al pastor. For all al pastor fans must understand this isn't the traditional al pastor on the stick slowly roasting with the flavorings slowly dripping down. It's just the stove top grilling with small pieces of pineapples.  Service is good. Now do expect a bit of a wait at the drive thru. This is not Taco Bell or Del Taco. The wait just means that my food is just that much fresher. Don't even think about going to Robert's or some other place. Just head to Los Tacos if you're in the SW."}
{"text":"Best Mexican food I've ever eaten. I'm not exposed to much authentic Mexican, so this really took the cake for me. Chips and salsa were sooo plentiful, not salty, super fresh and so cheap--$2!   My husband ordered the taco plate ($9) that came with pork, rice, beans, a generous stack of corn tortillas to wrap your own, lettuce, tomatoes, limes, and two big slices of avocado. He was really happy.   I had the vegetarian burrito ($5.95) with added avocado (85 cents), which had to much cheese for my taste, but I ate it all anyway because it was so dang goooood. I put a big dollop of salsa and hot sauce (in the green bottle at each table) on each wonderful bite.   We will be coming back here for sure. A couple next to us were each scooping a salsa-looking cold soup out of these giant mugs--I want to try that next time. Not sure what to ask for, but they made it look delicious and refreshing."}
{"text":"Fresh ingredients, fast service, okay prices. Meat was cooked just right, not to over done and not to chewy, with good flavor."}
{"text":"This place has the best carne asada tacos and burritos in town. I order my carne asada without sour cream...and always with fresh cilantro, guacamole and queso blanco. There isn't a messy sauce bar, but delicious verde sauce in squeeze bottles. The food is relatively cheap and the meat is seasoned...unlike at Roberto's.   This is amazing food for a cheap price. Check them out if you haven't yet already!"}
{"text":"Can't beat the tacos. Anytime I have friends in town I drive all the way here from near the M resort to eat here. I have tried the chicken tacos, carne asada tacos, the rice and beans and the chips and salsa. Everything is bomb! The avocado and cheese toppings add up so be weary. I just get my tacos \"plain\" with just beans and pico and two tacos has me stuffed!"}
{"text":"Let's just say,.... if you're going to do something,.. do it right. That being said, Asada taco...everything on it. End of story. Don't ask what's on it, just order it verbatim. If this is your first time coming here, thank me later. I'll go ahead and say, not many black people frequent this place based on my visits thus far. That's nor complaint or compliment, but I thought it mentionable because on roughly 90% of my Dine in's, I'm given that \"What are YOU doing in here\" type of reception. Not necessarily by the staff, but sometimes so as well. Again,... nor complaint or compliment, but the unyielding truth is that there are some readers/yelpers that would even at times prefer a lesser if not nonexistent black presence. Regardless, back to the review... it was a sad time when they raised the prices on the tacos, because to some $5 per taco was alarming enough already.  Then they went up closer to $6 but I've never tasted a taco more worthy of my coin. Way to f'n go LosTacos, I'm not even from the west coast or southwest, but this place has set the standard for tacos hands down. I even tried to replicate the recipe at home and my kids loved it."}
{"text":"So ****ing good.  I eat here all the time and its always good.  I've never had my food be bad here.  The Carne asada is unreal good (not a huge fan of their al pastor though I will say).  The shrimp tostadas are always delicious...covered with large chunks of shrimp that's never once been fishy or gross, they are excellent.  The tacos are super tasty.  Overall it's excellent.  The only knock is that for a taco place, it's expensive but you get what you pay for.  Well worth it in my opinion."}
{"text":"I don't know how this place gets such good reviews: I tried this place today and 1.) the girl taking my order through the drive through had a terrible attitude and have me a face like I was crazy, said nothing while taking payment and giving me good even though I was quite cheery with her. 2.) the food (a carnitas Torta) was super greasy, I can feel it in my stomach now (disgusting) 3.) the entire Torta was cold; meat, jalapeño, bread... Just all of it cold as if it had been sitting out for an hour or so. I took three bites and threw it away, fearful for what sort of illness I may get from consuming food that has been sitting out (mostly worried about the meat). Don't come here, go somewhere else just not here."}
{"text":"Los Tacos is delish! Seriously the best! My mouth waters for it many days after I've had it. I mean it is right now thinking about it!   I've only had the tacos and I've had beef and chicken. I'll probably get the pork next to try it. I get it with everything, sour cream, salsa, and cheese, for and extra $1.50. Making it almost a $5.00 taco! But it's worth it and way better then any $10.00 fast food meal! The only other food I've tried are the chips and salsa and they are pretty average. The BF gets a carne asada burrito with everything and it's amazing as well.   I get the Strawberry Drink, it's awesome! Nice and refreshing!   Try this place you won't be disappointed! Be ready to order they move fast and you can feel pressured to order before you you really decided what you wanted!"}
{"text":"I went in to try their tacos. I ordered a chicken Taco $3.50 and they asked if i wanted sour cream and guac. i said yes my total was $5.95 ?? The taco was good but price was out of range."}
{"text":"This place is Amazing! The food is great. We ordered tacos (which are 1/2lb of meat and other ingredients), burritos, quesadilla, and shrimp cocktail. The service was outstanding from the moment that we walked in. The owner was very welcoming and with this being our first time here he offered us a few items to sample while we waited for our food. I highly recommend this place because of the quality of ingredients and the service. Next time I'm in Las Vegas I will make sure to stop by. *Must try their shrimp Cocktail."}
{"text":"Love these tacos!! Even though you can get tacos anywhere these ones are the best. The quality of the tacos are unique  you get two tacos in portions wise! There Buche tacos are delicious, the Asada so juicy and must try the flour quesadilla"}
{"text":"I went to Los Tacos for lunch about a month ago. I had a carne asada and an al pastor taco along with chips and salsa. I got everything on the tacos so they were kind of expensive for tacos ($4.50 each) but they were worth it...some of the best tacos in town."}
{"text":"As promised, the second time around:  Muuuuch better! I got a carne asada taco, plus chips & salsa. I somehow ended up with everything on my taco (I was trying to avoid all the dairy, as it contributes significantly to my ass looking like a golfball), but of course, all the extras made it even more delicious. Seriously good carne asada.   The salsa with the chips still leaves some spice to be desired, but that fresh tomato flavor is great!  I'll be giving Los Tacos a permanent slot on my work lunch rotation :)"}
{"text":"This is by far my favorite taco shop in town. The ingredients always seem fresh and I've always had friendly service. Let's just say that the generous toppings, flavor combinations and textures just do it for me. Ive only had the tacos; I just can't not have them.   You order at the counter and they bring it over so if you are in the mood for fast-casual Mexican, I'd say give Los Tacos a try. I am 40 minutes away and yes, I'll make that drive."}
{"text":"First of all, I refuse to give any Mexican restaurants or taquerias 5 stars when they do not make their own tortillas. I am starting to realize that many restaurants out here in Las Vegas -do not. That being said- the carne asada burrito I put down yesterday was pretty close to perfect. The steak itself was cooked perfectly and was so freakin' flavorful. I was pleasantly surprised to see whole pinto beans inside of my burrito instead of standard re fried beans. The green salsa was OK- not great. In my opinion, spending $9.24 on a burrito and a drink was a few dollars too much. I like the fact that this place offers a drive thru, and will come back to try some other menu items. Bottom line, this place is a solid choice for fast authentic Mexican food despite being a little pricey."}
{"text":"***Update***  I decided to give this place a second try since a friend kept raving about their food. The menu prices on the website are incorrect. The menu prices at the restaurant are higher. The tacos come here with beans. One taco is double the size of your typical taco. The cashier asked me what toppings I wanted. I asked for onions and cilantro. She said there's onions and cilantro in the pico. Um, OK. I've never heard of that before in a simple carne asada taco. Also, I asked for no beans. There's a $1 charge to remove the beans. WTF? It's not even mixed in together.   They nickel and dime you for every topping. My two carne asada tacos and shrimp tostada came out to a whopping $16.22! If I ordered a drink, it would have been close to $20. I can understand if I was at a fancy Mexican restaurant but these prices are excessive for a casual Mexican place. The food wasn't good enough to justify the price. There was barely any seasoning with my meat and without my cilantro and onions, it wasn't the same. Also, I wasn't pleased with the paper thin slices of avocado. I can find better tasting tacos in L.A. for a lot less.   So again, the cashier wasn't very friendly. The menus are not clear nor descriptive. Where are these toppings on the menu? Outrageous prices for mediocre tacos. No thanks. This place made me miss L.A. a lot."}
{"text":"My fave spot for Mexican food! Love the chicken tacos, carne asada burrito, and carnitas quesadilla. A little pricey when you get all the toppings (quac, sour cream, etc), but well worth it. Meat is always fresh and made to order."}
{"text":"In line forever and then get there finial and she can't swipe the card because their machine don't work!!!"}
{"text":"I drive out of my way for Los Tacos. There are many kinds of tacos, and I appreciate most of them, but I know Los Tacos' tacos hit the spot when I'm in the mood; Carne asada con todo."}
{"text":"TASTY food. Seasoned well. Friendly staff. Big portions! We visited from Texas today and will definitely come back on our next trip."}
{"text":"This place was recommended to us because we were raving about Tacos El Gordo. Someone said, the Tacos here were better, so we had to test out their subjective review for ourselves.  We ordered 2 asada tacos, 1 carnitas taco, 1 shrimp ceviche tostada, and a horchata. Tacos had everything in it, including beans. My first time having tacos with beans. All of the food we bought were really good. Although I can't compare it with my favorite taco joint in the city because I feel like Tacos El Gordo takes a slight win with authenticity, street style Tacos; Los Tacos was great in its own homemade-style-authenticity category."}
{"text":"Prices are way to pricey. Ordered a taco and they charge for everything on it. 5 dollars for a taco is too much. There salsa didn't have any flavor what so ever. Will never return there again"}
{"text":"Sorry Bert P. and Mr. Larios ... although I appreciate Mr. Larios intention of a nice lunch, this place is a run-down, expensive-for-what-it-is run-of-the-mill \"Mexican place.\"  Looking around I don't think the clientele would really know what good Mexican is.  Perhaps it's authentic to some.  All one needs to know about Mexican in the context of what this place is trying to be is found in the Los Feliz section of Los Angeles and its name is Yucas and they have a James Beard Award.  The torta I had at \"Los Runs the day after\" was made from something other than beef I suspect.  An old whipped donkey perhaps?  I hasten to think what else it could have been.  No only that but the beef-like-substance was friggin' grey.  The guacamole seemed as though whomever made it \"got bored\" and just left it lumpy, sour and without much flavour.  This place is probably best left to the locals who think this place is amazing.    If you want to try a true icon of the genre, come to Los Angeles and check out Yuca's."}
{"text":"Had to try after reading all the reviews. I ordered just one carne asada taco and added cheese & guacamole with a small drink (just to try). The total did surprised me at $7.03, just a tad expensive for 1 taco and a small drink. The taste was good, but definitely not worth it, unless you got that kind of scratch."}
{"text":"This is my absolute favorite taco shop in the valley. I have been coming here for over 15 years and it is always fabulous. The carne asada burrito is the best thing on the menu. And the chips and salsa is a must. Highly recommend."}
{"text":"OMG, how have i lived here 12 years and never been to Los Tacos????  Went with a friend after a day at the pool. I wanted Tacos and she wanted Shrimp Cocktail. I jumped on Yelp, TADA! Los Tacos. We arrived around 6pm, completely empty. The Staff were GREAT! They made recommendations since neither of us had been. I had carne asada and the al pastor Tacos. She had the large Cocktail and Aqua Sandia. She said it was the BEST she has ever had. I must say both tacos were great but I did like the pastor the most. The cashier was correct in saying that 2 tacos are huge. We had chips and salsa, just have to order it, $2.00. They also have salsa, pico and fab guac!  I will be taking my hubby there this weekend, he loves Shrimp Cocktail.... Just wish they were open later!!!!!"}
{"text":"Not exactly \"Woohoo! As good as it gets!\" but it's certainly a \"Yay! I'm a fan.\"  My boyfriend's co worker was the one that recommended this place so on a late, lazy afternoon we decide to go and try it out.  The cashier was friendly and her customer service was amazing. We were pretty picky on what we want/didn't want on our tacos and she accomadated our order without acting like we were a bother to her. Menu was small and simple which was not a problem at all. You got your tacos, burritos, quesadillas, spanish rice, chips and salsa, nachos, and seafood plates.  My boyfriend and I got 3 carne asada  tacos, a side of chips and salsa and two drinks. Our total came out to be about $17. Kinda pricey for just tacos, small basket of chips and drinks.  Although the tacos were DELISH!!!! It looked like a gourmet taco with all the fixins'. You can choose to have beans, sour cream, avocados or cheese. The carne asada meat....let me tell you: the way its marinated and cooked, it reminded me of my Cali summertime BBQs at a mexican family get-together. (i know im not mexican but i've been invited to my mexican friends family get-togethers wayyy back in the days okay!?) The meat tasted fresh, there weren't any fat and it wasn't dried either. I didn't even need to put any lemon or salsa because it was packed with yummy goodness like my favorite: gucamole.  We will definitely be coming back to this place."}
{"text":"I have been going to the location on Charleston since I was eight! Amazing and convenient food is served here people. Their seafood cocktails are literally some of the best I've had. I usually get the quesadillas and add beans with carne asada. For their regular tacos I definitely enjoy the carne asada,  their lengua (at times its salty tho), el pastor, and chicken ( all with avocado and cream too!) Their green sauce is such a good additional topping as well!  Their drinks are awesome too, horchata, jamaica, and ive tried the mango too which is awesome. Check it out!"}
{"text":"This is one of my favorite places to eat at has very well cook food as well as very good service my favorite food off the menu is the burrito of steak highly recommended add sour cream"}
{"text":"Very very good food my favorite place in town to eat a burrito sour cream is on point all the meat is well cooked as well as the tortilla"}
{"text":"It's Friday night and tacos El Gordo has a line that goes around outside !!! I couldn't wait decided to yelp something off the strip and we are glad we did !!! Tacos are huge !!! Stuffed with your choice of meat some pinto beans a delicious amount of guacamole and sour cream and they don't charge extra for it"}
{"text":"Don't forget tacos el Gordo are across the street! If you aren't lazy to go in, then go there! Only reason I came during my lunch time was because Los tacos has drive thru, soooo slow, so make sure you have time, but very convenient! Moving on, the reason I can't rate higher than 2 stars is the ridiculous way they charge you. Ask for no beans on anything & be prepared to pay a dollar extra per item, and no they won't inform you of this! I found out by looking at my receipt and other reviews! According to others, the reason they do this is because they put more meat...ummm what if I don't want that extra meat! I said no beans, not extra meat! Put the same amount of meat you would if it had beans and we will call it a day! The tacos arent even the best...im pretty sure they use los arcos tortillas, that seem microwaved? 2 stars for having a drive thru and for their pineapple agua fresca.i do love that agua!!"}
{"text":"Best carne Asada tacos in town!! Omg so good! Why can't I make tacos like these?! They are filled with everything and just the right amount of it! One taco is enough for me but I try to finish two sometimes . Mmmmmm mm. Five stars"}
{"text":"I went to the new location on Sahara.   I ordered a al pastor burrito con todos(with everything).  First of all, I am not a fan of their beans.  Runny and not nice and creamy.  The al pastor was not even noticeable in the burrito.  I couldn't really taste it.  Also, everything should include rice.  If there was rice in there, I didn't see or taste it.    The menu is kind of small also and they only have green salsa on the table.  I will be sticking with the Mariani's market down the street when I'm on that side of town.    Better prices and flavor."}
{"text":"Omg this food is freaking great...I would eat 30000000000004 burrittos every day ever uber duper good"}
{"text":"Goodbye hubby, I'm leaving you to run off with the lengua tacos from Los Tacos.  And I think I'll have an affair with their shrimp tostadas as well.  Tee hee.  The space is comfortable, air-conditioned with benches and a pretty outdoor patio with \"bar chairs\".  There are 2 TVs showing Mexican channels.  Their tacos are about 1-2 dollars more than Tacos El Gordo (depending if you want the works) but man... are they worth it!!!    Hubby had the carne asada plate which comes with beans, rice, tortillas, and vegetables.  He was happy with this, it was a substantial piece of meat, but I do wish it had more oil.  The salsa was good, as well as their nacho chips., then I had their shrimp tostada with avocado ($4.00) but man oh man it was soooo good!  And very filling.  I also tried their Al Pastor and Lengua tacos.  The Al Pastor meat is not as heavily seasoned as I'm accustomed too in other taco shops, and they serve their version with beans.  This was ok.  But the lengua taco.. that was mind blowing!!!  It had HUGE chunks of extremely tender and savory lengua (beef tongue) that is prepared and cooked well because it does not have a very strong gamey taste/smell like in other taco joints.   If you have not tried beef tongue, this is the perfect introduction for you.  The owner said they make the lengua batch fresh every day and never serve leftovers.  I'm remembering that lengua and forgetting my husband again.  Hehe.  Can't wait to go back!!!"}
{"text":"This place is like a million times better than tacos el gordo when it comes to the tacos BUT its pretty expensive and its ugly inside. Also if you go through the drive thru there is a 3 in 4 chance your order will be wrong"}
{"text":"awesome carne asada quesadilla, very flavorful.... Sour cream,guacamole, and salsa with the quesadilla makes it even better. Would come back to Los Tacos in a heart beat."}
{"text":"Yum!  We actually ran into this place by accident, we had intended on going to Tacos El Gordo right next door but the lines were insane, all the way to the back of the store.  We opted for this place as it had decent reviews and relatively no wait.  The prices are decent, about $2-3/taco and they're DELISH (with a large scoop of guac, a big plus for me). They had a decent sized menu consisting of tacos, burritos, plates, and more.  Also an abundant amount of seating and very casual environment.  Food came out a little slow and the pick up process was a little confusing, but otherwise good food for the price you pay!"}
{"text":"Best pico de gallo in Las Vegas by far. I can't get enough of this place. It's kind of a local secret. My boss took me there for the first time a few years back and I was instantly hooked. I highly recommend when your in Vegas to check this place out. You won't be disappointed ."}
{"text":"From 7/21/15   Los Tacos is located on West Sahara Ave. Their menu is pretty simple tacos, quesadillas, burritos, etc.  I ordered the Carne asda quesadilla, and it was hella good! I was skeptical because of the menu being so skimpy, but their food is quality, not quantity so you can't beat that."}
{"text":"The line was too long at the Mexican restaurant across the way, so we settled here and they lady charged us $3.00 to take off beans on a taco! Like who in the world CHARGES to not put something on the taco! I could understand adding something would charge, but not asking for no beans! Never again will I eat here!"}
{"text":"As AUTHENTIC as you can imagine!   Carne Asada is a MUST, either the taco or burrito.  Burrito's are stuffed with choice of meat, beans, pico de gallo salsa, guacamole and/or sour cream (pay extra.)  I would hold off next time on the guac/sour cream, but I just wanted to enjoy the burrito simple style.  What did I know, it was my first time. But will return.  In addition, I had the carnitas tacos, served up right with cliantro & limes and extra salsa, which was on the tables.   I'll be back as it was PACKED & need that taste of 'little Mexico' every now & again."}
{"text":"Great food.   Little sit down place with great atmosphere and good music playing with great staff.   The food is always really good.   I have coming here for 10 years and I do love the carne asada burrito.   Best carne asada in town.  They are a Little bit more expensive than the usual fast food Mexican spot but I think it is worth the drive and price.   I usually get the carne asada burrito and a chicken taco and chips and salsa and it comes out to about $20.   The owner is really nice and really cares about his food and place of business and he seems to take pride in Los Tacos.    It is a great fast food Mexican spot you will come back time and time again."}
{"text":"Went to lunch on a Friday afternoon here. Since I have been to Tacos El Gordo so many times I wanted to give these guys another try since the first time was the Taco Trek UYE months ago (Thanks Nelson Q!).  I was pretty hungry so I was thinking the standard Carne Asada Burrito would fill me up based on the tacos I got last time. If you  refer to my pic, the burrito was not all that big. In fact, if you don't tell them you want it with everything (which is cheese, guacamole, and sour cream for an extra 1.50), all that's in there is just the meat and beans. So for 5.75 you get a tiny burrito. Add the 1.50 just so you can a little more stuffing in it. I paid a total of 7.84 with tax. Now I don't know about you guys, but lots of other places would give you a huge burrito for that price. So yes, I was a bit disappointed.  While I was eating, I noticed a majority of the patrons were Caucasian. Weird. If you go to Tacos El Gordo, its mainly Mexicans. So what am I missing? Are you telling me that Los Tacos is more of an Americanized establishment? Don't get me wrong. To me there's nothing wrong with that. It just didn't look right.   Some other things I noticed: They don't have a salsa bar. They do have salsa verde in squeeze bottles on just about every table. I guess you have to ask them for other sauces on the side if you don't like the green sauce which I thought is pretty good.  Next couple of visits I will try the Shrimp Ceviche Tostada because I saw somebody order it and scarf it down. I was so tempted to interrupt their first bite just so I can ask to take a picture of it. LOL."}
{"text":"I stopped in for lunch and the place was filled with white, car-salesman-looking guys. That should tell you something right there. The food itself isn't that bad (at least some of it), but it's pricey. $3.00 for a taco. If you want sour cream or guacamole that's going to cost you extra.   I ordered one carne asada taco, one al pastor taco, a cheese quesadilla, and a pineapple fruit drink. I tend to like my food on the mild side, so when I think something is bland, that means it's totally devoid of flavor. That was the case with their carne asada. It was hardly seasoned, if at all. The al pastor was much better. Tender pieces of pork with a little bit of a kick to them. Both tacos were large and overflowing w/ meat, onions and cilantro. Definitely enough to fill an average person up.  For the quesadilla you have the option of either a corn tortilla or flour tortilla. I went with the flour and the outside of it was perfectly crispy and flaky.  The pineapple drink was delicious as well.  It was $11.46 for the lunch, which seems incredibly expensive considering I could eat across the street at Los Parados for cheaper and get better food.   On the bright side, Los Tacos is very clean and has a drive thru."}
{"text":"My favorite Mexican place ever!!! We try and stop here whenever we are going from Utah to California! The fully loaded Tacos are incredible! My husband loves the burritos.. Everything that comes out looks incredible and it doesn't look like you can go wrong with whatever you order!"}
{"text":"Tacos are good but they out lots of guacamole. ths the only downside i found. the place is your average taqueria. Staff is friendly. Not my favorite taco place, though!n"}
{"text":"Came here after a good game of golf (actually it wasn't so good for me, but that's another story):  Pros:   * Really clean interior / dining area   * Incredibly tasty Shrimp Tostadas   * they have Agua de Frescas!   * clean restrooms (one person at a time)  Cons:   * The Agua de Fresca wasn't too refreshing.   * Salsa was mediocre    Tips:   * If you are looking for silverware (or in this case it would be plasticware), it's to the back of the restaurant (assuming you are at the cashier's and facing the cashier register)   *  The bathroom has a padlock, but they always leave it unlocked  I'm big on tacos and I must say, I'm a fan of Los Tacos.  They have some really good Tostadas and they have a pretty good selection of meet, including some of my favs:  Lengua (Tongue) and Cabeza ( Beef's Head). Aside from Tostadas and the typical burritos/tacos, they also have Tortas.  The portions are pretty good and the price isn't the greatest, but it is far from being an expensive eat.  The tacos are overstuffed and looked amazing (my cousin ordered one).  The burritos were long and thinner than say a burrito at Roberto's, but the taste packed a punch for sure!  They have green salsa at every table (except the one I sat at.. ha, I had to snatch one off of a vacant table by mine), but it's far from being spicy.  Thank god my burrito came with a few chiles.  For a typical taco joint, I must say they take more time to assure they have a nice little presentation.  Sure the burrito was wrapped in foil, but next to it in the plastic basket lined with white paper was a small edible garnishment constructed of a few crunchy tortilla chips and a house salsa concoction.  The salsa itself had a weird taste, but nonetheless, I thought it was nice to see Los Tacos takes time to up the ante when it comes to presentation.  The Agua de Fresca here was not up to par in my opinion.  I'm a big fan of Melon (cantelope), which they had; but it was way too think.  I'll stick to Cardena's for my Melon fix.  Overall, they place was pretty good and I could definitely see myself coming again.  I came hungry and left full and satisfied.  Misison accomplished!"}
{"text":"Terrific taco place. A little pricey as far as they go, but you won't mind when you are clutching these delectable little pillows of goodness.  It's fresh, it's smart, and filling. It's even a little classy for a taco shop.  If you are not a taco aficionado, but want to see what the fuss is all about, you definitely should check out this place, just to get a baseline on what the taco scene is like."}
{"text":"I just love this location :-) The food is great but the service is even better! For me nothing beats a casual enviroment, great food and workers with personality :-) Try the fish cerviche tostadas....I'm kinda addicted to them ;-)"}
{"text":"It was great :-) I love the fact they put fresh avocado on the food"}
{"text":"Recommended for a quick, budget lunch with larger-sized tacos. Bought 2 chicken tacos that did not disappoint, felt satisfied with the flavor, and filled me up. Definitely a solid Vegas taco shop, be sure to try it out."}
{"text":"My family thinks I'm nuts to cruise in  this area at night for a good taco,  Often I'll tell them, the naughtier the neighborhood, better the food.    Unfortunately, Los Tacos is located next to Taco El Gordo, and Pepe's Taco is just down the street from them.      The employees are pretty quick in getting food to you, but if you can't Espanol, you better go inside and order.   Speaking English isn't one of their strongest suit.     The restaurant is very clean, and the Carne Asada reminds me of Rosarita Beach Mexican restaurant (in Henderson) recipe, which is very good; but the downfall for me about this restaurant is their price for extras on a taco.     I took my friend with me, and we ordered  four tacos with everything, a couple of soda which came up at 22.00 plus tax.    I was a little taken back at the price, until I realize everything is extra 1.50 a taco.   Oh well, I thank god, the sports book gods were nice to me that weekend, and it didn't matter.    The Tacos are very good, but I didn't like the extra beans inside of the tacos.      I have to say the namesake for this place is larger than Taco El Gordo (which is shares the same parking lot), but for the price, I think feel it's a better deal a  stone throw away."}
{"text":"Great place for tacos and they are delicious. Yes they're a little pricier than normal tacos but they are well worth it. They come with cheese melted in the tortilla choice if meat, cream, guacamole, beans, salsa you can pick and choose what you want on them."}
{"text":"This place is a hidden Gem on Sahara. Tacos are just as good as tacos el gordo. Highly recommend this place if you are in the mood for some tasty tacos:"}
{"text":"He ordered tacos. I ordered a burrito. Delicious!! The house made sauces were excellent. Stopped here before we drove out of town. Glad we did. Authentic, indeed! Happened to eat here on October 4th, taco day!"}
{"text":"This place is so delicious  I love the service everyone is very friendly and if you ask for recommendations they have so good ones. The food taste very authentic but it is a little pricey for tacos. Prepare yourself to have some yummy Mexican food the salsa and chips is also really good."}
{"text":"If you are looking for good Mexican food you have to go to los tacos. They have some bomb everything. Tacos,burritos, sea food. They are a little pricier but they are totally worth it."}
{"text":"It's clear that the majority of Las Vegans have still not discovered the joy of Mexican food from Los Tacos.  If they had, if they had tasted the joy of a Los Tacos carne asada burrito, they would have chased Taco Bell and Roberto's out of town--out into the desert wastelands where people might not mind the dregs of Mexican food.  Los Tacos is playing at a whole other level than Roberto's, Taco Bell and the other Mexican food chains around Vegas.  Quite simply, there isn't a better cheap burrito in town.  It's probably because Los Tacos operates under the \"radical\" notion that fresh ingredients make better food.  Fresh salsa, fresh guacamole, fresh cilantro.  And the steak for the carne asada dishes?  It's tender, seasoned, wonderful.  Simple, quick and delicious."}
{"text":"The Jr. Beef Tongue ~ Lengua Burrito is so good especially when you order it with everything which consist of sour cream, guacamole, cheese.. just remember it cost extra $1.50, but so worth it. Also pair it with a Agua Fresca and your set."}
{"text":"Really tasty food with generous portion size.  The wait can be awhile, so just go early, bring a friend, and get some quality time in while you are waiting for your food."}
{"text":"Went to Los Tacos with my eCommerce/Interactive Marketing team.  I always have higher standards for taqueria joints because of my fiance.(Mexican family = FANTASTIC Mexican food)  Although I am partial to the tacos that his abuela and mama makes, I do have to admit that these were some pretty good darn tacos.  I could taste the guacamole and the crema.  Mmmm mmm mmm!  The carne asada had a very good grill/char flavor and the Al Pastor?  Oh man!  Delish!  Did I mention that although the tacos start off at $3.00 (not including guac, crema or cheese)- the tacos are HUGE.  A bottle of their green sauce (verde) is at every table.  Napkin holders at every table as well.  Why?  Because these tacos are so huge, you'll have to just grab a hold of them and dive right in.  Wipe your fingers and lips later!  Grab a fork to get the remnants that drop to the bottom of your little tray.  Everyone I went with had the chicken tacos.  I'll have to try that next time and bring the fiance down."}
{"text":"Greasy, cheesy, and not enough salsa. $6 for a taco \"con todo\" (with onions and a bit of cilantro). Physically filling. But unsatisfying in every other way."}
{"text":"my all time favorite taco place.. everrr  lengua lengua lengua  my first experience with los tacos was at my friend's graduation.. you can hire them to bring out a cart and grill and they make tacos for everyone!!!  my favorite if you haven't noticed already is the lengua taco with everything.. you gotta make sure you add everything.. (its worth the extra 1.50)  el pastor seems to be a general favorite among my friends as  well but i haven't had a chance to try it yet  the tacos are big.. i actually get full off of 1.. but i've seen people eat 2-3.. maybe 1.5 would be the perfect amount so maybe you can find a buddy and share a third one..  their fruit drinks are delicious.. all of the flavors strawberry, watermelon, pineapple, horchata.. mmm.. usually i order water when i eat but here i always buy a fruit drink."}
{"text":"This is my favorite taco spot in the city! They have THE best asada tacos in all of the land. It's juicy, perfectly seasoned and has a wonderful charbroiled taste. Get your tacos with everything and then add the extras they offer and you will not be disappointed. This location is a great size especially since it's always busy but they make your food really fast so that's a plus! The only reason I didn't make this 5 stars was because they don't tell you it's extra to add \"everything\" or \"con todo.\" It would be nice if they let you know that each taco \"with everything\" is going to cost you almost an extra $2 per taco. I didn't see it advertised anywhere. Our order of 5 tacos went up almost $10 because we got it \"with everything.\" Also the times we have gone to get food the staff isn't very friendly and I never get a smile from them. Honestly though aside from the price and the service, the food here is sooooo good!"}
{"text":"Tacos are really good. I've had the chicken and steak. But both times I've went I've been shorted 2-3 tacos each visit and it really pisses me off because they always charge me for those tacos. I trust the company to make sure my order is right. Probably the last time I'll ever go to this place. Very upset. I would recommend anyone going here be sure to check the order."}
{"text":"Great tacos and well worth the cost.  We come to Vegas twice a year and always stop here.  I highly recommend the carnitas with all the extras. Sooo delicious!!!"}
{"text":"This is one of my favorite places to grab a Carne asada burrito. Yum yum! I usually get the junior burrito with everything on it. It's the prefect size. The fruit juices are super good too! Try the watermelon. Also, their tacos are bigger than normal so start of with one or two. You can always order more. And if you're in there during the day, say hi to Daniel (owner), he's awesome! :)"}
{"text":"I don't know what happened to this place.  I used to eat here at least once a week and LOVED their food.  They recently raised their prices and seemingly lowered the food quality.  The junior carne asada burrito was always my go to....a good sized burrito for $3.  I'd order it without beans and it cost me an extra .60.  Since when do places charge to take things OFF?!  Oh wait....okay, .60, I'll deal with it.  NOW they are charging $4.25 for the same burrito and a DOLLAR to NOT have beans in it.  What the fuck?  My junior carne asada burrito w/just meat n cheese was almost $7 the other day (because of course cheese is extra too...as is sour cream, avacado, etc.).  It was lacking in the meat department and had a huge glob of cheese.  So disappointing.  :("}
{"text":"I like to consider myself kind of a big deal in the taco community.  Well if big deal status is conferred on those who spend half of their disposable income on a particular product.  Having established my credentials as such, I have to say I was highly disappointed by Los Tacos.    The visit started so well.  The staff was friendly and I love being able to see them make the food right in front of you.  From there it started to slide. I saw on the board they had tacos, burritos etc...standard taco shop fare.  Then next to it they have their different type of meats.  I saw tacos were $3.00 so I assumed that covered any type of meat so I ordered two with a soda.  The gal asked if I wanted everything on them and I said sure and then she said that'll be $11.64.  I did a double take on a scale that hasnt been seen since Cousin Larry on the 1980's show \"Perfect Strangers.\"  I asked how it could be that much if tacos were $3.00 and she replied if you get them with everything it becomes close to $5.00.  I downgraded my order to one thinking this must be a pretty big taco for $5.00.    Well the taco came and needless to say I haven't been this disappointed in size since Pam Anderson had her latest surgery.  I couldnt believe the size to cost, and the additional surcharge for the privilege of guacamole, sour cream and cheese.  The overall taco (I got the al pastor marinated pork) tasted just ok, but certainly it was nothing to write home about.    There is so much taco greatness in the world, it'll be hard to get me to come back here.  I mean I will eventually because I always feel a place is worth a second shot and it wasnt terrible, just disappointing (isn't that what my dad said to me when he was made at me as a kid?).  Back onto my business class seat on the taco train...."}
{"text":"It's lent, so, no meat. went to los tacos for dinner. got 2 bean and cheese burritos, added lettuce and rice. it was super simple but so good. and that green sauce is the business. I went to bed feeling great. just what I needed after being hung over all day. coke products!!!!"}
{"text":"My coworker and I were returning from the east side of town at lunch time and we're trying to decide where to eat. When we saw the Los Tacos sign, I remember when this place was a Weinerschnitzel. Since I hadn't been there, it would give me something to yelp about.  I had a carne asada burrito. Most of the places have packages of chopped beef they throw on the griddle to cook it, this meat had charring on it and tasted like charbroiled steak, this burrito was delicious, very good.   There were a few beans in the burrito, but not many, they certainly weren't using beans as filler, like so many places have decided to do. Some places put so much rice and beans in the burritos, the meat gets lost. I prefer a meat burrito, just meat with cheese, guacamole or salsa, with rice and beans on the side.  The size was medium, not too big, not too small. Some places make things larger, because some people equate quantity to value. A lot of mediocre, is still mediocre. I suppose it depends on why you're eating. If you're taking a break, to relax and enjoy the food, quality means more. If you don't know when you'll have your next meal, your primary goal is to store calories, then quantity would mean more.  If you like the carne asada burritos at Roberto's (which I do), you'll love the carne asada burritos at Los Tacos.   I will definitely go there again and recommend it to anyone."}
{"text":"Came here after seeing how full Tacos El Gordo was. Ordered a chicken torta and it was delicious. It had lots of avocado (which I loved!). Their aguas are good too. Only thing was the tacos come with cheese and sour cream which I thought was a bit different."}
{"text":"'Rito only review!!  Tough one to call here. Needed a quick bit and out of nowhere come Los Tacos. Checked out the menu and the $3 tacos really sent me for a loop, so I went for a burrito (I don't know why I even tried NOT to eat one). 5$ and change nets you a 'rito, but it's only meat and beans. Guac, sour cream and cheese will run you an extra $1.50. If you can turn down that magical combo of toppings, you're a better man than I. End total was $7 and change. The 'rito result was mixed. It had just below average girth and solid length, which I think would make most people happy (although the rumor is women enjoy....). Anyway, it was solid. The al pastor wasn't the greatest, but honestly if you peep my pic, you can see that even below average meat was masked by the toppings. It was a good 'rito. Not great. Not 5-star.  3.5 star with a bump bc it had a drive thru. I'll go taco diving next time and report back... Wait...."}
{"text":"What we call $4 tacos at 74th street Baptist church, we call a sinny-sin-sin...   $3 is the most I would ever pay for a taco.... so how did I end up paying $4 each for 3 here? Oh, the toppings are extra. Yep, extra on top of an already overpriced 'co. Lord knows how they figure out what's what. $.15 here, $.35 there, $.07 around the corner, $.27 for a bag...   This whole experience was a mess. I tried to get all three tacos without sour cream and 2/3 ended up with it, my veggie taco ended up being carnitas (and $4), it took 12 min at the window to get my food, the wrong salsa was in the bag, oh, and the tacos were $4 each. Three tacos shouldn't cost more than 2 burritos.   The three stars is bc naturally they were delicious. -2 for the price and wack job service (even for a drive through). Next time, I'm headed to Tacos El Gordo."}
{"text":"I was told by a reputable source that Los Tacos were the best tacos in the US. I won't go that far, but they are damn tasty. Living in SoCal I'm used to an abundance of decent to good Mexican. These tacos were fresh, and more like a burrito stuffed into two soft taco shells than an actual taco. I had the carne asada and although I had two pieces of grizzly meat, I also had a pile of fresh guac, sour cream, and some cheese. I held off on the beans, but you can have them for the same $3 a taco price. My biggest problem with the tacos was the lack of flavor and spice. The salsa was bland and the meat lightly seasoned. Low on salt, which I heartily appreciated since too often bad meat is hidden by salt, but a little more cilantro and lime marinade or a peppier salsa would have made this an amazing taco instead of just a very good one.  The location I went to is grungy but authentic. I really enjoyed listening to the latino rap while staring at the mariachi mural on the wall. The cashier looked like a dude who just wanted to be part of Entourage...not a guy working the cashier window at a taco stand in Las Vegas. Sometimes life IS better than fiction."}
{"text":"Not for vegetarians - pretty run down place. Would have been ok if the food was good but it wasn't. Salsa was too sour and the beans were bland. Horshetta was good and hence one star. Avoid."}
{"text":"I would spend more and go somewhere better. The Price isn't that cheap, took a while to get my food, and to be honest a general chipotle probably would've been more enjoyable for me. Granted l- I'm pescatarian so more veggies are more my style. Hate how they charge extra for guac and other sides"}
{"text":"I live this place. A bit pricey but very good food! I recommend the carne asada taco with everything, and the shrimp cocktail."}
{"text":"The shrimp ceviche is made to order which means that the flavors might not be as developed as one would like.  My favorite item is the carne asada quesadilla. It is MONSTROUS. The bout of pleasure and guilt I experience is intense."}
{"text":"Shrimp tacos are legit! Love the flavour and this place is delicious if your craving tacos for cheap."}
{"text":"Easily top 5 taco spots in LV, but extremely overpriced.  3 tacos with guac for $15. No drinks Thats why they are nicknamed \"Baller Tacos\"!"}
{"text":"bomb...com !!! best around for burritos and tacos super fresh!!! i love this place!! its the best in town/ THE WORLD :)"}
{"text":"OMG...reviews won't do this place justice...you just have to try and experience this place.  The location on Sahara was formerly a Taco Bell (very obvious architectural structure) but inside was gutted and very open and friendly....AND BUSY! This was the lunch crowd and many business/office folk have also discovered this place.   The staff works feverishly to get the order out in a timely matter, and the wait is minimal.    The menu is typical Mexican cuisine, but the portions are huge.  The Carne Asada Taco has an incredible flavor...one that I have never tasted before and the shrimp cocktail in a beer mug was sweet, spicy and flavorful.  Their fruit waters (strawberry, cantaloupe, mango and pineapple), are also the perfect touch to this menu (although I could have enjoyed a good sangrais or mojito!).  If you are looking for a quick grab and go that will leave you full, this is a place you need to check out!"}
{"text":"I eat at Los tacos 3 times a week.  It's by far the best steak and chicken you can get.   Everything is always fresh and I love their watermelon juice ."}
{"text":"Wow! These tacos are so yummy! I want to try other menu items, but I want the tacos too! You MUST eat here!!!"}
{"text":"You Must try the shrimp cocktail.  Al pastor taco is good and carne asada jr burrito is a winner!  Food is made to order and always fresh.  There's a taco place next door (Gordo) but it sucks and this place is a good hidden taco spot with some nice ladies running the front. We always stop here when we are  on that side of town."}
{"text":"Short on atmosphere but big on the tacos. Service was friendly and fast. I live cross town and have no qualms about driving 30 minutes for good bite. Start with the carne asada taco. I've been told that's what they're known for."}
{"text":"Amazing tacos!  They grill their meat on an open flame and it definitely makes a difference.  Their asada is my favorite!  They are a little pricy, but they are worth every penny."}
{"text":"To start off this review, my family and I are not locals. We live in California, but we take family vacations to Las Vegas every year as a sort of family tradition, and about 4-5 years ago we were looking for some place new to try out and we were led to here. I don't remember if it was by Yelp or what, but oh my god I am so glad we found this place! We LOVE IT! The food is delicious and now it's part of the tradition to have dinner here at least one night during our stay."}
{"text":"First, if you still eat at Taco Bell, I strongly encourage you to please stop.  Go here instead!  Really!  Your couple bucks are better spent on a taco at Los Tacos.  Their food is real stuff!  Thanks to bff Elaine, this was her addiction on the way to her old work.  I know I've been her friend since forever.  I would never discourage her away from this addiction.  I can see why she can't stay away.  What's super neat and handy is how they wrap their tacos like a handle to allow for easy consumption.  Also, how much love is in one taco.  They're not flat tacos okay.  Mmmm with added avocado and Pico de Gallo - a must!  Burritos too are no joke.  What in the world was I thinking trying to have a burrito and taco?!  That's called force feeding thy self cuz of the overactive hunger hormone ghrelin.  If we could only lock ghrelin in a box...  So between horchata and jamaica, which would you pick?  Their jamaica was actually good and not too sour.  I think I should suggest they serve tequila shots in them though; optional of course!"}
{"text":"When you walk out of a restaurant laughing and giggling and smiling about the experience that you just had; then you know you are in the right place. Los Tacos gave me that experience. Simply a family run restaurant making food and drink to perfection. Thank you.   ~ The Cal Poly Kids"}
{"text":"I originally went to Tacos El Gordo based on the Yelp reviews, but realized they only serve pork and beef.  So, I went to this place across the parking lot and am so glad I did.  I ordered the chicken tacos and they were amazing - super tasty chicken with just the right amount of beans and cheese with lots and lots of good tasting guacamole.  If you like guacamole, this taco is the one for you.  Not sure if it's common, but the guy behind the counter also offered me sauteed onions and they were a great add to the tacos."}
{"text":"Los Tacos is HELLA BOMB!   Yes, the tacos are a bit expensive, but you're gettin' your money's worth. Melted cheese in-between two corn tortillas, topped with savory pinto beans, rice like grandma used to make, your choice of meat (my favorite is cabeza) , sour cream, guacamole, and a simple but tradtional pico de gallo. Los Tacos does not mess around!   Sure, they aren't your traditional tacos, but they sure are tasty."}
{"text":"Oh yeah.  Great flavor.  Spectacular presentation. Good value (READ cheap and good sized portions)."}
{"text":"overly hyped! pricey ! beef taco was good but for me chicken was a disaster. it had a raw uncooked smell ! also, i asked for guac for all my 3 tacos which means i paid $1 extra fir each taco. they put cream in my 2 tacos which costs 50 cents. Dont know if ot was intensional or just a mistake. if you are graduating from taco bell this is a good upgrade but if you are familiar with authentic flavourful mexican tacos, dont waste your money here. there are better options in downtown."}
{"text":"The food is good, but the portion is quite small for the price and for the place being a fast food mexican. I like their lengua, so I usually get that in a burrito or the plate. The burrito starts pretty cheap at $6. However, as a lot of other reviewers has mentioned, they charge for everything (cheese, sour cream, guacamole) and they charge $1 extra for lengua, so when I order a lengua burrito con todo, it now ends up being a $10 burrito (con todo = with everything is a $2.85 extra charge). I could've paid less at chipotle and gotten more food."}
{"text":"The best tacos in town!!! Fast servise , very kind manager!! The carne asada tacos are awesome!!"}
{"text":"My co-worker had been raving about Los Tacos for a few weeks, so I said, hey, let's go.  I had a carne asada taco and we split a quesadilla.  For the taco... great meat!  No fat, cartilage, nothing chewy - just good, easy to eat, on point carne.  I was pleasantly surprised.  The rest of the taco was fine and I especially liked the big glob of mashed avocado tucked into the tortilla.  The quesadilla was cheesy, a bit crispy, all together very yum.  The green sauce mentioned in other reviews was a bit hot for me so I used it sparingly.  My co-worker, by comparison, took a bath in it.  I'd definitely go back to Los Tacos."}
{"text":"Please update the prices on your website. I thought you charged me double for my food and was about to call you to complain."}
{"text":"think i may have found one of the best mexican joints in viva las vegas. thanks to a friend, this evening i was introduced to a delicious veggie burrito! =)   first impression?: clean, BUSY!, flippin cheap, simple, and aroma that will make your stomach growl as soon as that front door meets your hand.   my hearty burrito was only $3.25ish... and freaking DE-lish!   last impression?: full, satisfied, and thinking about my next visit.   guess what? there's a drive-thru! =)"}
{"text":"Los tacos some of the best tacos in Las Vegas. Some people might say they're a little pricey but the tacos start at $3.50 if you get it with everything on it ( avocado, sour cream and pico de gallo) it goes up to like $5.50, so I can see how some people might think it's pricey but the food is so delicious and worth it.  The carne asada is quality steak very little fat, delicious.  The El pastor marinated pork serve with a little onions, delicious.  The chicken tacos all white meat, delicious. The ceviche is, delicious, its served in a regular  mug or large mug if you eat it in house.  The beans & rice is you guessed it, delicious.  I guess the key word here is Los Tacos is delicious.  The green salsa is out of this world (delicious) I usually buy a big cup, the family and me keep it in a bottle at home we put it on almost anything.  I guess what im trying to say is, If you want some good tacos Los Tacos is DELICIOUS!"}
{"text":"These are probably the best tacos I've ever had. The cheese add on made them really good, they are really big as well. 2 tacos made me pretty full.   Very good, will come back."}
{"text":"This is one of my absolute favorite taco shops. I wish there was one closer to my house, although it would really effect my waistline. The tacos are huge. I highly recommend getting them fully loaded... Price usually works out to be about $5 with everything, but it's worth it. A  I love the green sauce... I love to smother my taco with it. I've also tried the ceviche, and it was pretty good. I also love the corn quesadilla with carne asada.   I love the ease of the drive thru."}
{"text":"Well.... I have to admit I decided to come here because I was already tired and frazzled and Tacos El Gordo hasn't had a drive-thru window since soon after they opened. Gee, you'd think the last thing a fast food place would want is to cut off their fat, lazy customer base- just who is the \"El Gordo\" they purport to be catering to, anyway?  So, I saw the neon drive-thru sign beckoning to me from the darkness of the west end of the parking lot and honed in like a cruise missile. Unfortunately, it was so dark that I didn't see the curb and in my haste managed to slam my car up onto the island. No biggie, I'm sure the undercarriage benefited from a little barnacle scraping, but when I finally managed to maneuver into position at the ordering station, I was hit with a blast of Spanish-accented static.   Yes, the system crashed the same time I did. (No connection). I figured it might be for the better, since their English is almost as limited as my Spanish and I could at least point and gesture in person. Nonetheless, I was growing increasingly unhappy.  Got some carnitas tacos, a quesadilla on a corn tortilla (MY-EEEZ!), and a burrito for the Anaconda. This required intense negotiation and the services of three volunteer interpreters, but I got my bag and headed home.  Until now, I always thought that the basic ingredient of carnitas was pork. Apparently, it's salt. How bad was it? I didn't eat it, if that tells you anything. And if you knew me, that would tell you everything.  In their favor, they were friendly and tried hard, and I can't hold it against a Mexican establishment in a Mexican neighborhood that caters mostly to a Mexican clientele for speaking mostly Mexican.  Their tacos were $3 as opposed to TEG's at $2, but they had more than twice as much meat. Too bad it wasn't edible. And if you agree to \"with everything\", that means cheese and sour cream and guacamole, (in other words, the parts that make life worth living), it will increase the cost by a buck and a half each! Whaaaat? Since when is cheese an extra on a taco? And the burrito was ok but smaller than you usually get for the price.  It was a bad experience, but maybe I'll try them again when we're both having a better day."}
{"text":"Delicious tacos! I've had these twice already, the office I work at is always ordering tacos from different places but I think we've found the new favorite!   They don't typically take phone orders especially for 10 people but they did for us which I thought was nice of them.   I have tried the asada, chicken & pastor. I have to say the asada is my favorite. They're full of flavor and they are huge with great portions! I add guacamole, cheese & sour cream (extra $$)   I would stick to their tacos (considering they're known for that) my coworkers have tried their sea food and they're not as in love with this place as I am.   Good food. Good service. Fair price"}
{"text":"I came here for lunch once and was not disappointed. It is cheap Mexican food and downright yummy! They also give generous portions so you can take it home and re-live the yummy-ness :)"}
{"text":"This place was fantastic. My friend and I stood there and looked at the menu for a while. The cashier asked if we wanted to try any of the meets. My eyes lit up with excitement and the cook instantly started filling sample cups with each of the 4 meets. Smart idea!! They were all sooooo good! The tacos were perfection. Get them fully loaded with guac, pico and cheese. I will definitely be going back."}
{"text":"Best Carne Asada Quesidillas EVER! Must get it with Avacados. You'll thank me later!!"}
{"text":"very disappointed with our last visit to Los Tacos. Burritos and tacos are delicious; however, I have a hard time justifying $31.00 for a drink and four tacos with everything. Cashier do not disclose additional items are additional."}
{"text":"I have been here many times, definitely a great place for Tacos and Burritos. Make sure you order \"everything\" on your Tacos or Burritos. This will add cheese, sour cream and guacamole.  I enjoy the quesadillas as well on flour of course."}
{"text":"So good!! We stopped by in our way home from a long weekend in Vegas, craving a breakfast burrito. While they don't have breakfast burritos on the menu, they were happy to make one for my boyfriend. He got an egg, chorizo, cheese, and bacon burrito. Super healthy. I got the chicken burrito, with guacamole and pico. The burritos were huge, super tasty, and definitely hit the spot! Both the green and red salsas were spicy, garlicky, and fantastic!"}
{"text":"Love their tacos, but get ready for a 15min wait in the Drive thru. Ridiculous!! Message for owner, you should get a drive thru cook person to get things running a little faster. You are losing many customers that way.   Plus it's ridiculous to pay $1 for NO beans, $1 for aguacate, and .50 for no cheese? Get ready to pay $6.49 for one (1) taco."}
{"text":"The food is just amazing. A little over price in my opinion. Oh and registers need to be more specific in regards add-on pricing."}
{"text":"Great customer service!  I ordered an item that they don't  usually serve and they were more than happy to make it happen.   Thank you for making a hungry tummy happy."}
{"text":"Worst drive thru service, the food is good but we lasted in the drive thru window for over 40 mins, the kids were getting impatient"}
{"text":"If you seriously want to catch a good laugh this is the place.  Ordered a Asada burrito with no beans substitute for rice. She said no beans it's a dollar extra I asked why she said because we add more meat! Are you kidding me you are replacing the beans for rice so what extra meat are you putting? Anyways didn't feel like arguing. When I see my burrito all it consisted of was literally beef and rice! Seriously an $8 something burrito no cilantro nor onions? Wasn't good at all so plain no flavor even with the salsa.  This place needs to get there stuff together with the big competitor to the side & this kind of quality. No no"}
{"text":"I love it. The meat is very hight quality. Tacos are big so be aware how many you order because they come with double tortilla. The place is always clean, staff very friendly."}
{"text":"Great food and love coming here, but everytime I come and  Adrianna takes our order she gets it wrong! Then to top it off argues with me that I said it wrong even though everybody else always gets it right!  Mental note of Adrianna is taking orders RUN or Give your order in Spanish !"}
{"text":"This place is a little over priced but the tacos and burritos are amazing.   Highlights: -Al pastor tacos -flower quesadilla (asada)"}
{"text":"If you've ever eaten good Mexican food in your life you would know this place is NOT the spot. I have no idea how it's the highest rated option on yelp.  1 burrito, 2 tacos, & a drink costs $19.73. That's already a no. Then you're like... okay it's Vegas, of course it'll cost a little more, whatever. 5 minutes later, you get your food and it tastes like nothing. Nothing.  I'm from LA so I have decent expectations for Mexican food and this was almost disrespectful. No flavor and the meat was cold. The watermelon drink was good.  Bottom line: this place is one very small step above Taco Bell. If you're from LA or SD, any taco truck you might go to is better than this."}
{"text":"I ordered the large shrimp cocktail (to go) and 3 tacos (lengua, barbacoa, and tripa) to eat there and the tacos were alright. However, that night when my hubby ate the shrimp cocktail, he asked me how far is Los Tacos.  I said 2.9 miles, and he asked if I can go back tomorrow and get some more because it is \"da bomb.\"  I did just that after I had a taste of the shrimp cocktail.  It was just bursting with flavor, reminds me of this michelada that I had in H-Town without a Mexican beer.    I would go back and order the seafood cocktail over and over again.  Now I have also tried the lengua burrito and it is pretty good.  What I am not a fan of is their raw oysters...No Bueno.  It was just tasteless and full of suspicion.  But the seafood cocktail...yum  yum.  The strawberry juice is very tasty as well."}
{"text":"We stopped by Los Tacos for a quick bite to eat before checking into our hotel.   The lady at the register was friendly and helpful, while we were trying to figure out how much food to order.   The portion sizes here are HUGE! I ordered two tacos and was only able to finish one so I gave the other one to my friend. In my personal opinion, I thought the carne asada was cut too big that it was a bit difficult for me to eat it. The quality of the meat was very good though and I love that there is a generous portion of avocados on the tacos. The tortillas they used for the tacos are the ones that they sell at the super markets so I would say it could have been better. Overall I thought the food was A-OK."}
{"text":"I love this place and come here for lunch at least once a week.  I can eat here everyday and not be tired of the flavor.  The large and spacious seating area is a big plus.    I usually get the carne asada tacos and beef tongue (Lengua) tacos.  Today I discovered their amazing carnita (pork).  I will definitely get the carnita quesadilla next time (add guacamole and salsa).  You can ask for a sample of the meat.    I wish this place is closer to my house!!!"}
{"text":"So I went to Los Tacos for the 1st time yesterday, I was really, really hoping for something better, especially for the price.  I ordered 2 carne asada tacos with everything and at 4.50 a pop I would have rather gone to an acutal sit down restaurant.  Now the tacos are big but the carne asada did not taste well at all! I was so hoping for this to be amazing. But sadly I will have to pass on Los Tacos."}
{"text":"This place is the bomb.  A locals favorite. Do not let the neighborhood scare you, the trashy bathrooms and the staff sometimes have difficulty with English.  WHO CARES!  The food makes up for it.  Some of the best Tacos on the planet!!!!"}
{"text":"The most authentic mexican food around.  The carne asada is amazing and their guacamole is always fresh.  I do feel completely gross and unhealthy after leaving but that's why Los Tacos is an occasional treat.   The staff is bilingual so you don't have to speak spanish to order with confidence like some places around town.. *cough* Robertos *cough*.   Love this place!"}
{"text":"I LOVE Mexican food. These tacos are A-May-Zing! One taco does me just fine as the helpings are large. The carne-asada are to die for. The meat is juicy and tender and the whopping helpings of sour cream and guacamole make this taco one of the best I've ever had. Not too greasy and quick to our table. Yum!"}
{"text":"Great Mexican fast food. Super clean restaurant. I recommend the marinated pork burrito."}
{"text":"YELP 365 CHALLENGE 2014-(211/365) \"The Long Overdue Update\"  Los Tacos still gets my vote for top taco when it comes to Carne Asada. If you haven't already, their Seafood Cocktails are among some of the tastiest in town, IMO. One of the few spots that do carne asada over an open flame? Now that's what I'm talkin' 'bout!  Any seafood lover would love any of their seafood cocktails which could contain shrimp, octopus, oysters, or even a combination of all three! Very tasty, filling, and worth every penny!  They still have two locations(Sahara and E Charleston) so if you haven't been, and are still wanting to try Los Tacos, Their Carne Asada Tacos (con todo!) Seafood Cocktails, and Mango Agua Fresca is a winning combination!  ALOHA!!!   Shaka Meter:  \uuu/  \uuu/  \uuu/  \uuu/  \uuu/  5"}
{"text":"Best tacos in town by far.....Carne asada grilled on an open flame, not a flat top grill, these tacos are DOUBLE the size of  all the other taquerias around town, so you'd probably fill up after just two tacos. Whole beans, not refried, cheese melted between your tortillas, so you're actually getting a quesadilla and a taco rolled into one....It's always better with all the extras(guacamole, sour cream, cheese) However, if you get the lengua, its best enjoyed simply with onions, cilantro, salt , and a squeeze of lime. They also have seafood cocktails that are to die for, full with oysters, shrimp, and octopus...There is no alcohol here, but their Agua Frescas are the BOMB! My favorite is their mango, and it ain't from concentrate! give them a try and you won't be dissappointed....ALOHA!!!  *Also Check out their new Sahara location!"}
{"text":"Good, tasty, and authentic. This ain't Robertos or Pepes, we're talking a quality taco for a decent price. My favorite taco spot in Vegas, wish they'd open more. Oh and the green sauce? Pure awesomeness!"}
{"text":"I will give a 3 stars because the good was good. I paid for extra avocado and did not get what I paid for."}
{"text":"They literally charge for every addition. I've had way better tacos at a way lower price. We went here because the line at Gordo was long. We should've waited in line. Coming here was a big mistake. Avoid this place!!!"}
{"text":"So yummy. I love the carne asada tacos here. They are especially good loaded with all of the add ons. I am gluten free and have never had an issue eating here.   They are maybe a bit expensive, but so delicious that I think they're worth it. One taco is usually enough for me (but I don't eat a ton). I definitely recommend Los Tacos if you want authentic, delicious food.   Side note: their drive through needs an update, and is very slow. Eating in is much faster!"}
{"text":"Los Tacos is my favorite spot for Mexican fast food. My mom and I have been coming to this place for a long time (remember when they were called La Taqueria?)  The tacos are pricey, and it's true they charge for the extras (sour cream, avocado and such). So yes, you can get your tacos cheaper elsewhere. But after trying El Gordo, Pepe's and other places, I think Los Tacos still has the most delicious food.  My favorite is the junior burrito with chicken, and chips & salsa. The portions are generous, everything is made fresh, and the food comes out quickly even when they're busy.  My only gripe is the nickel-and-diming with the extras. Get this straightened out and I'm sure you'll get more 5 stars. I guess I can understand charging for the extras, but why charge me to remove the beans?? Does it require extra effort to exclude the beans from a taco or burrito? C'mon now...  My latest visit I finally tried the champurrado, es muy rico   I definitely recommend ordering the tasty hot drink on a cold night! Until next time"}
{"text":"Excellent carne asada and al pastor. Carne asada has a really nice grill flavor. Tortillas are great. Table green sauce great."}
{"text":"My co-workers and I did a less formal version of a \"battle of the tacos\" between Los Tacos and Tacos el Gordo.  Here's the basic run down:  The tacos are bigger here and they cost more that Tacos el Gordo too. At $3.00 a taco WITHOUT the works on it. To have all the extra add ons it would be an additional $2 each. Here, I only had to purchase 2 tacos versus 4 at Tacos el Gordo (which ultimately comes out the same anyway). I don't know what kind of tortilla TeG uses, but I was disappointed to see that LT doesn't make their tacos. It was definitely store bought.  The taco breakdown:  LENGUA: I do like the lengua here. A lot \"saltier\" and \"full of flavor\" than TeG. You also get a bigger portion too. I personally like the lengua here more.  AL PASTOR: Also very good (i guess comparable to the ADOBADO i tried in TeG, but only because their both marinated pork). Super good, tender pork, and bold with a slightly sweet taste to it.   Definitely a good off the strip location to go to if Tacos el Gordo is too overwhelming for you since it is on he strip and they have lines on top of lines.  My co-worker got a TORTA, and if you're wondering what that is, it's basically a sandwich version of everything else in a toasted fresh-like roll. It looks pretty good! If you are looking for something less messy and complicated other than a burrito...I'd say go for it. I've never tried this version before, and I'd like to come back to experience it."}
{"text":"Really good food and fresh Fresco drinks they have a variety of good flavors like watermelon and strawberry. I would suggest eating one of the Quesadillas very fresh great meat and great guacamole. The only downside is the dinning room not the nicest place to eat. Overall great food not coming here for the ambiance but highly suggested."}
{"text":"Absolutely outstanding service from the male dayshift cashier! He absolutely deserves a raise - otherwise I'll hire him as a salesman for my company! I ordered the veggie tacos and he volunteered all of the options available to me without me even asking. Asked if I'd like rice, peppers and onions, and lettuce added to my veggie taco. Was wonderful and pleasant without seeming desperate for a tip (which of course I gave him). Great staffing Los Tacos!! I'll be back to see him!"}
{"text":"El taco aoenas regrese ayer a long beach muy buen servisio la muchacha muy amable ya kiero regresar kiero un burrito dorrado en la plancha fuy tres dias seguidos se los reco miendo saludos de long beach"}
{"text":"This is by far the best taco place in Vegas. If u go early the tacos will be fantastic! The aguas frescas are delicious...rice and beans are excellent and the carne adasa by far is the best! You won't regret u ate here!"}
{"text":"I come here for their shrimp cocktail which is the BEST in town! I've tried other places in Vegas, even in Arizona and Utah and I am always coming back to Los Tacos. Unfortunately, their other food selections is only meh, but the shrimp cocktail is SO GOOD that it makes up for it."}
{"text":"Food is excellent, the service is lack-luster. It's a typical hole-in-the-wall place. Great Mexican food, but the inside looks like an old fast food joint with how the seating and service is set up, almost like a Del Taco. It's hard to enjoy good food when the environment is uncomfortable I.e bad seating, bad guest service, lack of comfortability. Enjoy the food but it could use a remodel or a whole new location."}
{"text":"Don't get me wrong. I love love Mexican food I'll eat anything!! But the meat here is so disgusting!! How do people eat. The garlic taste is so strong that all you taste is garlic. NASTY."}
{"text":"Things started off a little slow trying to give my order. But that's pretty normal for your first time somewhere. Then they messed up my order and I almost didn't say anything. But I did and they fixed it no problem. So that's the service.   The food? Amazing. Just a really really solid taco. Really fresh. I thought it was a little pricey but after seeing what I get I'm ok with it. I definitely ordered way too much food. Next experience I will be even better I'm sure."}
{"text":"Best Mexican Food ever!!! The ladies behind the counter are beautiful and sweet! The restaurant is clean and smells good. Better than El Gordos ... I cant wait to come back! #authenticaf"}
{"text":"If you're up for paying $7 a taco and leave hungry, this is your spot. The tortillas are not hand made tortillas which would still not justify price. Avocado  is $1 extra even though you're already paying $7 per taco. The taco is regular size (not street tacos). The carne asada is tasty but still not worth the price. The red salsa and the pico de gallo was fresh but they lacked variation in salsas. Their customer service was awful- the cashier had a hard time breaking down my bill. 4 carne asada tacos and one soda $29."}
{"text":"The worst place to go to...if u want a quesadilla that costs $2.00 and is the size of one bite and is so greasy it slips out of your hands and leaves you with oily lips then go...but i warn you it costs $3.50 for a basic taco and the craziest part is if you dont want beans on it they charge you $1.00 to remove the beans! You read that right they charge $1.00 to remove beans....never coming back in my life."}
{"text":"Quick summary. They charge you to remove food, charge you to breath, and charge to you  live.  The food is okay but boy do they love to charge you for anything and everything. If you want to remove beans from your burrito, they'll charge you an extra dollar. How does that make sense? They dont even tell you the extra charges.  The $6 burrito only has meat and beans, if you dont want a dry ass burrito youll pay $3 more. They should atleast let us know. With tacos they'll ask you if you want it with everything and if you say yes, they'll almost double the price of the taco which is already almost 4 bucks a piece. So if you want tacos with more than just meat and a tortilla be prepared chuck your wallet at the cashier. After we looked at our receipts all we saw was extra charges eveerywhere. I understand if you want guac or something it's always extra every restaurant you go, but they actually tell you about it. But seriously they charged us to remove a food item from our burrito, they didn't mention it or even tell us why. If they atleast say \"hey this stuff im adding to you order is more $, is that ok?\" We wouldn't be so upset. So all in all we paid almost $45-$50 for 3 waters, two tacos, a small burrito, small torta, and half assed nachos. If want better tasting food walk across to Tacos El Gordo, great staff bomb food."}
{"text":"The food is superb at Los Tacos.   Always fresh and good quality.   Better yet...the owner is involved on a day to day operational basis & prides himself on outstanding customer service.  Try this place...you'll be a regular."}
{"text":"We stumbled across this place one sunny afternoon on our way to run errands. Since I'm still fairly new to this city I like trying different places, finding suitable replacements for my old stomping grounds in LA.  Anyhow this place looked like it was fairly new the bunch of men behind the counter looked like they were still working on fine tuning the registers. The cashier seemed nervous and distracted.  Needless to say she got my order wrong, when confronted didn't apologize or offer to correct it. The gentle man behind the counter stepped in and quickly apologized and offered to let me have the incorrect item as a comp. Okay problem fixed no worries right? Wrong...  the cook threw it away but no worries I didn't care the gesture was all that matters. And that wasn't the only problem upon a close look at the receipt we discovered we were charged for every additional topping so our three dollar taco was more like five dollars and our five dollar burrito was closer to eight dollars and there was the wait.... over 20 minutes with only one person ahead of us. But I do have to say the food was good so flavorful and authentic .The food deserves five stars but unfortunately service matters to me when I rate a restaurant. I will be back for the food but I really hope they work on thier customer service, clear up the pricing and ticket times...this is a FAST food restaurant after all."}
{"text":"Now, this was a pleasant surprise!  I've driven by this taco place a thousand times and never once did I think I would try them.  \"Yeah, yeah, yeah.  One of them places\", I told myself when I saw it the first time.    Rewind few months back:  A friend mentioned about going on a social lunch at Los Tacos on Charleston but it never materialized.  There was never a follow up so it died a natural death.  Forward to July 11, 2014:  I forgot my lunch at home so I had to eat out.  I didn't have breakfast so I was beyond starvation and  I decided to hit  the very first restaurant or fastfood I would see on my way out, good or bad, costly or cheap.  As I was heading towards Sahara from CSN on Las Verdes, the blue Los Tacos sign was so bright and vibrant in the Las Vegas sun and was the first food place I saw.   I walked in to a packed and somewhat loud restaurant with the aroma of the grilled meat welcoming me in.  There was a long line of people waiting to order, and waiting for their orders.  As I stood in line, I was trying to figure out how to order and what to order.  The people ahead of me looked like they're all returning customers because the line moved so fast and the people knew what to get while I was still looking around, like a  true green neophyte, and checking out what the people who were already seated were eating.  Before I knew it, I was in front of the cashier who greeted me with a friendly smile.  He handed me small servings of lengua and red sauce for me to try and me liked it.  I ordered a lengua taco and carne asada taco sin frijoles.  I don't know if it was the missed breakfast and starvation, but boy, they were good.  So, I went back in line and ordered Al Pastor Burrito and salsa/chips.  Suffice to say, they satisfied me to a T, and I was a happy camper.    The lengua was seasoned and cooked just right and didn't have that weird \"it's not really meat\" aftertaste.  It was proportionately topped with chopped cebollas and cilantro.  And with their homemade salsa verde, it sure was a winner!    Granted the price here is a bit higher than most, if not all, taco places BUT darn, its all worth it.  I've tried Tacos El Gordo when it was still on the strip.  They're cheaper (but not by much) and very good too but their servings would make you cry and scream at the men behind their counter for more.  I could easily chow down 6 El Gordo tacos even if i wasn't hungry, and still looked famish.  So, if you do the \"serving portion to cost\" ratio, it will end up pretty much the same, except Los Tacos will fill (and satisfy) you.  'nuff said.    Disclaimer:  My review was not, in any way, shape or form, influenced by the free shirt given to me by the cashier.  I swear!"}
{"text":"The best tacos in Las Vegas. Chicken tacos are amazing. I hit this spot with co-workers often. It's crazy busy at noon."}
{"text":"Some of the best tacos ever.... I have never had lengua as tender as theirs. Try their frescas, super delish"}
{"text":"I have a taco obsession and I loveee their tacos! It's difficult to find lengua tacos that aren't chewy or greasy and these are perfect. They are pricey but they aren't tiny street tacos, they're a good size and always stuffed to the max."}
{"text":"The food here is quite delicious. Everything is fresh and flavorful and very well priced. Drive thru is an added plus."}
{"text":"I needed lunch that could be made quickly, since I'm a student.  When I walked up to the cashier, I asked for his \"best burrito\".  It turns out that he was the owner and he made me something \"off the menu\" and it was delicious.  The meat inside was carnitas."}
{"text":"Never disappointed!   I have been coming here for years (since it was La Taqueria) whenever I have to go to any of the downtown government offices/ court.  The food quality is very consistent and fresh.  I love the Carne Asada, carnitas, and chicken in a burrito or tacos.  They have authentic chips fried in house and very fresh pico.   The absolutely best is the green sauce they have at every table.  I put it on everything!"}
{"text":"Don't be fooled. The burrito is NOT $4.25 as it says on the posted menu, it is $6.00....the jr. burrito is $4.25, not the regular one. And its not a very large. I can't imagine how tiny the jr. burrito is....probably more like an egg roll.  Mariana's, the Hispanic grocery store, has much better and less expensive burritos at their food counter.  I won't be returning to Los Tacos."}
{"text":"Freaking amazing.  How do they make their burritos taste so delicious? And the green sauce at every table.  Love it! Fast, polite and so good."}
{"text":"Why would anyone ever go to Taco Bell, when there is a Los Tacos!!!    I have been to a lot of taco restaurants with big names and expensively priced dishes.  Los Tacos may look like a fast food restaurant, but it is better than most of the pricey americanized Mexican restaurants in town.    In one word: Authentic  Restaurant is clean, nice looking, the outside grounds are very nice and well kept.  The servers are very nice.  The drive through works great.  Everything hand made, per order and real, fresh ingredients.  Salsa's are fabulous, so many kinds.  Veggie Tacos A+.  Chips & Salsa A+  Mmmmmmm!"}
{"text":"had mixed feelings when i read the yelp reviews but now after this experience, I can honestly say that I was really disappointed.   at first looking over the menu, the pricing on the add-ons threw me off a little bit. then when we were called up, the cashier already seemed annoyed with us. she spoke a blend of Spanglish (spanish/English) to us and confused my other half. luckily I was able to catch the translation and started ordering.   I ordered the carne asada and carnitas tacos. I asked for no beans on them and she told me it would be an extra $1 charge for no beans. wait, WHAT?! since when does asking for one less topping COST you something? she told me they add more meat in subsitutition of no beans.. well what if I don't want extra meat? I had no energy left in me to argue with the miserable woman so I just said it's no big deal and to just give me the beans.  my other half ordered a burrito and the cashier asked him if he wanted cheese, avocado and sour cream which is listed on the menu at $1.50 extra for all 3 add-ons combined. he said yes, but asked if they could simply put the sour cream on the side. instead of charging him the $1.50, she charged him an additional $.50 for asking for sour cream on the side. we racked up a solid $17 for two tacos and one burrito. this started to become a sick joke until she tried to upsell us on \"bottled water\" for $.75 which was actually water poured from a jug into a Styrofoam cup instead of the water from the fountain/tap. NO THANKS.   unlike tacos El Gordo, there is no pepper/lime bar. with how unhappy all the workers looked, I didn't even bother asking them. the quality of the food was mediocre. I'd rather walk 20 steps across the street for way better quality and better service. it's safe to say that we will not be returning."}
{"text":"Walked in at about 2pm after a long previous night. I ordered the coctel with octopus. It was superb. This was on point, the avocado and cilantro made it really fresh. It's not a seafood place, but they do serve it and they're good at it. Service is good, nice location. Would recommend. Will return"}
{"text":"Yeah, maybe I'm too spoiled. It was good and fresh, and clean, but I want even my local taquerias to have some character and some sort of ambiance, even if it's divy. The food wasn't amazing, but I'd eat here in a pinch, without a complaint. Maybe a whine, pretentious and mewling, but not a full on complaint.   Yelp in LV isn't like in the bay area or the northwest. Peops are so happy to not be lambasted and bombarded by the commercialization around the strip, that anything prepared by actual people instead of employees filling a role seems amazing. My first inclination was that this was a great find - a cheap 4 star joint. Upon returning home though, I realized that this place wouldn't really work if there was anything better around.   Las Vegas has cool people living there - so friendly! So earnest! -  they deserve cool spots that are local, delicious, and inspired."}
{"text":"Went there at about 9 p.m. to get some lengua, they didn't have lengua and then on top of that their service was so slow that it took me damn near 50 minutes to get out of the drive-thru . Won't ever come back."}
{"text":"Estábamos en los tacos el gordo , pero esta muy lleno de jente. Decidimos vinir aquí . Pero que mala decisión. Nos dieron la orden equivocada . Y nose hacieron pagar más para que no se dieran la orden correcta. No se . No vengan aquí ..la comida no está tan buena como otros lugares . Y menos los empleados.  Te ofrecen con todo en el burrito y no te de cien que son $2 más.  We were on the tacos El Gordo , but is very full of people . We decided to come here . But that bad decision. We got the wrong order. And they made us  pay more for the correct order . Do not come here ..the food is not as good as other places . And either are the  employees. They offer everything in the burrito and dont tell you it's $2 up charge ...we should have waited at TACOS EL GORDO"}
{"text":"the food is good but too pricy they lady (Alicia) just charged for all the extras without asking if we wanted them.. she charged us extra for meat and we didn't ask for extra meat we asked her why she charge us that she said because the tortilla is small and it going to look like a little bit of meat makes no sense.. lady does not belong at cashier"}
{"text":"Ever since our UYE Taco Trek in February, I've been planning to come back for one of their seafood cocktails.  Last night, I left the main group of Yelp folks on the Trek #2 and I came here for my seafood cocktail.  I was going to get the mixed seafood, octopus, oysters, and shrimp but I had a language problem last night with the nice senora at the register.  I ended up with a shrimp only cocktail but it was everything I wanted!  I got their small size which is called medium for some reason.  There is no small!  The preparer takes a good sized mug and she puts two and a half ice cream scoops of medium sized shrimp in the mug.  Then she adds some pico, an avocado diced in small pieces and fills the entire mug with a tangy tomato sauce.  The pico is fresh cubed tomato, celery, and onions.  With this beautiful mug, you get a basket of chips with a half lime for your cocktail.  Also, the required hot sauce, in this case, Tapatio is put on the pick up counter next to the mug and the chips.  OK, you never have to twist my arm when it comes to hot sauce.  I ate the cocktail in what could have been record time.  What wonderful flavors!  Now I know what I'll do when I get the urge again.  There's another Los Tacos on West Sahara, much closer to me.  I'll go there and get the mixed seafood, large this time, and I'll make a stop somewhere else, El Pollo Loco perhaps, for my gringa wife.  Sylvia and Nelson, the cocktail was as good as you promised it would be!  Gracias, amigos!"}
{"text":"Love their food! Great chips, tacos and burritos! Watermelon juice is excellent!"}
{"text":"Tacos are the best here especially \"con todo\". It is a bit pricey but totally worth it."}
{"text":"Most expensive tacos ever. I asked for no beans in my tacos and they charged me EXTRA! Two tacos and some chips for $12. The carne asada was really good but their quesadillas are greasy. EVERYTHING comes with beans. I like beans but not in everything."}
{"text":"Los Tacos is my favorite taco spot hands down. I always get tacos or a burrito. The prices are a little more but the servings reflect the price for sure. Their meats are superior to every other taco place.   Their stand outs are their lengua and their carnitas. Their carne asada is also delicious."}
{"text":"No frills, crazy good.  It's take-out/fast-food mexican but don't let that fool you, this place is special. Best taco/burrito in Vegas, and yes, I've been to Taco y Taco, I've been to El Gordo, I've been to Pepes, Tacos Mexico, Tacos N' Beer, El Dorado, and so on... Asada is my fav.  Cons - Not open very late... or very early (maybe that's for the better)."}
{"text":"Have you ever had a particular food that you crave over and over again, no matter where you live or visit?  Mine is a particular quesadilla that I used to get at Gordo's in SF.  When I moved to Las Vegas in 2004, I have been on that search for a quesadilla just like Gordo's and I've finally found it at Los Tacos!!!  This is not just a regular quesadilla that you can get anywhere, this particular quesadilla is made with a flour tortilla on the grill, when its all golden on the outside and gooey cheesy on the inside and they put carnitas, guacamole, sour cream, salsa, rice and hot sauce inside...it is yummy in my tummy goodness!!  Oh, why oh why, have I not ever found Los Tacos before???  I had to make so many trips back to SF to get my oh so favorite Gordo's quesadilla cause I thought no one else could make it like them!  And I've tried! I've made the request to so many places out in Vegas, only to be let down every time....  Thank you Los Tacos for bringing my hometown so much closer to me, cause now every bite of your carnitas quesadilla, I can close my eyes and be in heaven!!  Oh- and their ceviche is pretty darn good too, but, I can't even think about that now that I know where I can go when I crave MY quesadilla!!!"}
{"text":"This place never seems to disappoint... If you are a pork lover the carnitas are a MUST! I like to order the  carnitas junior burrito because it is a perfect combo of pork beans and cheese.... The carne asada taco with everything is pretty hard to beat too! Today we tried the carnitas quesadilla for the first time and I think we found another favorite! This place is a must try!!"}
{"text":"Hands down the best Mexican food I have eaten in Vegas since I moved here over 2 years ago. I ordered the carne asada taco (no guac or sour cream for me), cheese quesadilla and chips & salsa. The quesadilla was so cheesy and gooey... Omg it was so simple but so incredible. The carne asada tacos were perfect. The seasoning of the meat was spot on, the cheese was melty on the inside, the beans were soft not overly wet... It was an incredible taco. Even the chips and salsa were amazing! The salsa was their pico de gallo and it tasted so fresh and sweet, not damp and sour like so many places tends to. I really do not like pico de gallo under most circumstances, but I was all but licking my plate to get every bite. The only down side of the experience was the price - at over $15 for my few items, I was just pleased that the food lived up to the hype. If you haven't eaten here, do it. Do it now!!!"}
{"text":"This taco place is one of my favorite tacos places to go here in Vegas. It's pretty pricey for tacos but they're big so you don't need to buy as many as you normally would"}
{"text":"I enjoyed our agua frescos, chips with  fresh salsa and tacos. Tacos are definitely overpriced. I think it's silly they charge for sour cream and lettuce on tacos. Solid tacos just be prepared to spend more than most taco shops. Juices really good."}
{"text":"The cashier was sweet but the food and quality was horrible!! Just paid 30 dollars for 3 tacos and one carne Asada nachos!!! Them nachos were made with no positive attitude looked like 5 year old preped it  too dam expensive for the quantity and quality!!!"}
{"text":"Best Mexican in Vegas!! I always get the carne asada quesadilla with the works: guac, sour cream, and cilantro. Best meal outside of heaven! The place is kind of a hole in the wall; I don't think they even have any air conditioning. They must in the summer though. But they have lots of fans to keep things cool. The fruit juices are also surprisingly good! I always plan on stopping by, even if I'm just passing through Vegas--it's that good!"}
{"text":"added the lengua taco to the tried list today -- wow -- so delicious...  don't know what Gabriel is talking about fried fish -- their fish is only served as cocktails or on the half shell (oysters) -- no fish tacos -- nothing fried.  And the cashier always speaks english -- she has to since she runs the drive thru, too --   Yes, there aren't that many white folk -- but that's fine with me -- Took my 72 year old white mother for tongue and pastor tacos -- and to share a shrimp cocktail, with watermelon juice --   tears, people, tears, it was so good...   I keep looking for flaws, but there just aren't any."}
{"text":"Oooops Jump the gun on this one. Be CONSISTENT if you want to continue to grow. The staff is only good when the owner is there :("}
{"text":"Amazing!! I've visited twice and on my 2nd trip I got it right!!! The tacos with cheese are delicious...they melt the cheese on the tortillas as they grill them before adding your favorite delicious meat. I also added a regular flour cheese crisp to my order and it was SOOOOO GOOD! I may add some meats to my cheese crisp next time."}
{"text":"Best Tortas in town. Also the quesadillas are excellent!! The drinks aren't expensive and refills on fountain drinks are free! The fresh fruit drinks refills are not free!! The only thing bad I can say about this place is the limited seating."}
{"text":"I give it a bad rating because of the customer service. I placed a pretty big order and the amount came to almost $60! I asked to look at the receipt and removed the two burritos which according to them dropped it down to around $35...so two burritos cost almost $30? Right... so I get my food, I double check it and they still forgot half the order but didn't charge me for it! I had to pay even more than what I thought I was already having to pay which was already a stupid price. I finally get home after being hangry eat the now soggy food because I had to wait for the part of it. I look at the receipt and realize they charged me for the burritos not the tacos. My order should have cost me $22 and some change. The charged me $38 in total. So not only is my food soggy and cold, not only did they get my order wrong, they over charged me!! I am not happy about the customer service or the food. Not to mention the girl at the window was holding my bag and couldn't figure out what to do next...you open the window and you hand it to me. Very disappointed with this place!"}
{"text":"Food is good but the workers and management are sheisty. For example $6.25 is way too much for a burrito that only comes with meat and beans. I've eaten so much Mexican food in my life and I've never seen a burrito that didn't include Pico, rice, veggies or cheese.....So they basically sell you a half filled burrito then charge you extra to make it complete. Next time I'm hitting up the taco truck on Lindell and Flamingo like I know I should've..... where I get a real burrito for 6 bucks that's off the chain...P.S....... I talk about the workers because they're never consistent and always have a different story. One day we went and ate it was all good then we came back another time and got the exact same thing but the price was different......wtf"}
{"text":"If you're a fan of avocado...you better make a point of going here for lunch!  That by far was my favorite part!  I had the quesadilla and my mom had tacos.  Both were loaded with meat, cheese and avocado!  All the good stuff.  Cheap prices...$3.00 for a taco.  Little bit more than Del Taco or Taco Bell.  This is \"fast food\" but it tastes more home made. Not a fan of the music...Mexican mariachi.  We just ended up sitting outside so it wasn't a big deal. Pretty tasty...I'm sure we'll be back."}
{"text":"I wanted tacos today, Real Mexican tacos they did not let me down. Fresh ingredients awesome food, employees were so kind and super clean. I Love it."}
{"text":"Los Tacos could be a fast food place to some but not to me. I consider places like Mickey D's and B-king to be fast food and the main reason is because most of their \"food\" is mechanically processed and frozen... and that's the definition of fast [unhealthy] food.  LT on the other hand does have a drive-thur but they are not fast and their food in my experience has always been very fresh. I usually get 2 chicken tacos that come in a corn tortilla which includes beans and I add avocado and skip the cheese. This little meal is about $7 and you can't go wrong with that.  I ordered this yesterday and I still had a 10 minute drive home and was wowed at the fact that when I got home my meal was still hot enough that I didn't need to reheat... Yay!  In a nutshell I like this LT location because they are faster than the one on Charleston near bruce and they've never miss up on my order. Hooray for Los Tacos all the way around!"}
{"text":"I'd come back to Vegas just to have an asada taco from here. This seriously ruined LA taco places for me."}
{"text":"This is more of a $$ in my opinion. The combo plate is a lot of food and is priced well compared to everything else. The tacos are $3.50 each. If you go in with an appetite, you're going to spend quite a bit. The place is inviting and appeared clean, although I could not say the same about the restroom. My family and I aren't compelled nor deterred from going back."}
{"text":"Have been going to this place for years. I even brings friends who are visiting from out of town, and when we get there they always give me that same look...like \"why would you bring me here\". Then we have the carne asada tacos with everything., and after that it's like a drug, they always ask me to take them back there. The tacos are GREAT!!"}
{"text":"Really guys! Stopped today for lunch quick through drive -thru. Busy so I get up to speaker to see sign cash only. Now cars behind me so I have to wait 20 minutes in line for no food! Put the sign up at drive thru entrance next time. Totally ruined my day when I have to go back to work with no food because my time was wasted stuck in the line with no way to exit!"}
{"text":"This place is a joke! First of the service sucked and when we ordered, the cashier didn't explain how their ridiculous system works. They charged us $1.89 for sour cream and guacamole and if you order a taco and ask for a plain taco they charge you an extra damn dollar for not having beans on your damn taco!?! Really?! Who eats tacos, with beans in their tacos?! Eww!! Don't waste your time, we wasted 30 minutes of our precious time, just to get a refund. Plus the tacos are small and they add the beans to make them look decent for 3.50! Not even King tacos are that expensive! Eww!!!"}
{"text":"I love Los Tacos' burritos and green sauce!!!! So delicious. The quesadillas are delicious also. The staff is very hard working and diligent during their lunch rush. Would definitely recommend."}
{"text":"Los Tacos serve THE best carne asada tacos in town. Hands down. Top-quality beef that you could really eat on your own, but don't because the extras are what make a taco.   They have a wird pricing system where depending on what you add or take off, they will charge you diferrent. Say you want it without beans, they will put more meat in there thus charge you more. Other than that there's not much ele to say other than these are the best carne asada tacos in town"}
{"text":"I really have no idea why I was so calm about my last visit.  I should have added like, 12 exclamation points for how good the food was.  I had forgotten to add that we ordered the large shrimp cocktail; it was to-die-for.  The cost: $13.25 and the shrimp were large and plentiful, we did not mind the cost.  We're going back to Vegas in 2 weeks and definitely plan to return."}
{"text":"Excellent food. Good service. The food is always fresh and excellent quality and great prices. I highly recommend!"}
{"text":"Perhaps I made the mistake of ordering burritos when the drive-through person had said they were known for their tacos. After all, what good is a restaurant named Los Tacos, if you can't master the tacos, right?   It was one of those days that I wanted a fat burrito.  Cool thing is they can pan fry your burrito so that it gets crispy. However, the order was a bit more work for drive-through than expected.   The standard carne asada burrito comes with beans, pico de gallo, and rice. I paid extra to add the triple mixing of sour cream, guacamole, and cheese.   I'm not used to ordering a burrito that doesn't come with what I would think are the basics.   Even with the additions, I'd give this burrito 2 stars. Decent, but far from good.   I'll be back to give the tacos a shot in the future, but maybe not for a while with the choice of plenty other tacos available.   The convenience of a drive-through is a definite plus.  My burrito cost about $8.50, and I've had far better paying $5.50-$6.00 at some hole-in-the-wall places in California."}
{"text":"On the way home from Arizona we just had to stop here for lunch. Once again the food and service were outstanding! These tacos are something else, I don't even have words for them other than wler&j%bg=qoyve$#o%cniaeb*j/mgva. I could eat these everyday for the rest of my life. Anyway, Daniel (manager/owner) provided amazing service once again by being very friendly, providing meat samples, giving advice, and giving us a free small cup of shrimp cocktail! I found out on this visit that this is a family business and the Daniel's dad started the business in SF. The location in SF is called La Taqueria. SF is 8 hours away though, Vegas is 4 hours so this is still my closest location. But I still want to plan an SF trip since I haven't been there, now I have more reasons to go. Fingers still crossed a location in LA will happen one day! Anxious to go to here again and it's only been three days since my last visit...."}
{"text":"I come here all the time. Seriously crave this stuff. Workers are super friendly! It's First Friday & PACKED but workers still kept a smile on & made me a burrito with LOVE. Best taco place in town! You pay for the quality of the food, so it's totally worth it. Try it out if you haven't already & thank me later"}
{"text":"Pretty good. I got a carne asada burrito with sour cream, cheese, guacamole, beans and pico de Gallo. I forgot to ask for hot salsa in the burrito at the counter but there was some salsa verde on the tables. The burrito seemed a bit petite, which was fine for me since I'm small, but heard a man behind me saying his burrito was small haha. There's a drive thru too if you don't feel going in, but it was nice and clean inside. Not sure if the lights and decorations were just for Christmas or are normally there."}
{"text":"Completely blew my expectation even after seeing 4 1/2 star.  The cashier was extremely friendly and welcoming.  I had the lingua (Tongue) quesadilla with everything on it, which was $5+additional for the avacado (worth it). I also had the lingua torta with everything on it, which was $4.5+additional for avacado.   It was the best quesadilla i've ever had, and also the best torta i've ever had. I highly recommend both of them.   My friend had a taco and burrito. $3 tacos are on the pricey side, but they are filling. Burrito was around $6, it was slightly smaller than i thought it would be, but the taste was also great!"}
{"text":"This is an excellent place for quick Mexican food.  The staff is super friendly, they will let you try food first if you ask what something is. We ordered Carne Asada Tacos, Carnitas Tacos, and Chicken Tacos.  The Carne Asada tacos were excellent.  They are grilled and have a nice flame grilled taste. The seafood \"Coctel\" was awesome - I wish I would have ordered a double! My 2 year old ate a whole plate of rice and beans.  Their beans are simple and delicious. My wife had us go back the next day for their Strawberry Horchata! Price is definitely fair - the tacos are BIG.  We went their for the first time on Monday and have been back 2x's since. We eat Mexican food regularly, and this is a MUST."}
{"text":"Came here after El Gordo Tacos was too packed to wait, and what a great surprise.  TACOS ARE HUGE!! Even the hungriest customer would be FULL with just 2 tacos.  Yummy burritos!  Loved the tacos de carne asada with guacamole, creama and cheese and they were soooooo yummy!! Small place, so seating is limited on weekends."}
{"text":"Food is really good ... Service was great ..found this place on YELP.. Driving back to Cali from Utah... Delicious!! Better than the nasty buffets in Vegas!!!!"}
{"text":"These tacos are pricey , which im ok paying more for good tacos But these were not even good,they were  cold and flavorless , the other location is way better !"}
{"text":"Came here for lunch. This place has the best quesadilla. It's not soggy and it has a crunch like it's fried. Their burritos are a bit or miss. Sometimes they stuff it too much and the whole thing will call apart."}
{"text":"I will forever love this place. If I'm on a deserted island, I need this food with me to survive...nothing else, well, except water."}
{"text":"If I was stranded on a desert island and had one thing to take, it would be food from this establishment.  It's delicious, FRESH, made to order, delicious and, um, delicious."}
{"text":"The vegetarian burrito is good. And the flour quesadillas are huge and greasy with delicious cheese. The chips and salsa are amazing."}
{"text":"yum, YUM, YUM!!!!!!!!! No other was to describe it!!! I swear I have dreams about their tacos at night lol! Most def worth the money!"}
{"text":"Delicious tacos. We found this place on yelp when we were visiting Vegas and it did not disappoint. Friendly, personable owner and unbelievably good food. I had the carne Asada taco with guac, sour cream and cheese, it was my favorite authentic taco I have ever eaten. Seasoned to perfection. My husband and son had the Jr. burritos with carne asada and my daughter a delicious generous size quesadilla. We we're all impressed. The side of rice and beans was 2.00 and so good. Reasonable price for families. Don't miss this place if your in Vegas! For Real!!!"}
{"text":"Would give 5 stars but only giving 4 because the wait time on the drive thru takes a long time especially when there cars in front of you but once I get my quesadilla with Carne asada guacamole sour cream and pico de gallo I actually don't mind it and forget all about it. The food is freakin bomb!!!!!"}
{"text":"Didn't get my fix like everyone else.  While driving by, my tummy encouraged me to stop by to fuel the soul. It was pretty busy too which made me even more eager to try their food. I ordered two Pastor tacos and one Carne Asada Burrito with beans and guac which came out to about $20. Yes, the tacos were bigger but the meat came out dry, tough, and were not seasoned well. My Asada Burrito was even more disappointing as I found out majority of it was guac and beans along with about 10 pieces of meat. Quality wise, I was only impressed with their tortillas to be honest.  Back to El Gordo and Don Tortaco I go."}
{"text":"I have been patronizing this place since it opened, their tacos, burritos and fresh aquas are simply the best, once you have tried this place you will never fo anywhere else. A little on the pricey side, but hey....worth every nickel."}
{"text":"Food was decent - sort-of. Got the good-looking el pastor quesadilla (yelp pics made it look irresistible). Unfortunately, it was SOOOO greasy! Orange grease running everywhere, and while it was cut in half, the second half was, like, too much of the same thing. Probably better to share - was just too much grease. Had a hard time getting a spot of their red hot sauce (there is no salsa bar). Girl behind the counter kept pointing to the bottle of Tapatio. I said, \"No, don't you have some homemade red sauce?\" She said, \"Red Sauce?\" and pointed again at Tapatio. Sheesh. Finally after five times, she got it. Ohhh, red sauce. Oy, it wasn't worth the fight. Roberto's is so much better.    The most annoying part was there were so many flies in the joint - was fighting them off the entire meal. Then some crazy yelling-screaming-rap tune came on, of course, insanely loud, and I was just like, ok, this is totally sucking right now. I guess other people complained 'bout the music because after a few minutes, the manager killed it.  Los Tacos, done. Can cross it off the list now, doubt I'll be back. Flies...grease... ick."}
{"text":"So I like to review places a couple times. Usually if I've had a good experience two or three times I simply allow my reviews to stand as is. Therefore I had to give Los Tacos another review based on my most recent experience.  Once again I went through the drive-thru. I will offer this information: in the drive-thru they can't see you and by that I mean you will most likely be greeted in Spanish (even if you don't know a lick of it). But no worries, I placed my order in English and there was no problem. I decided I wanted to try the carne asada taco and carnitas taco. I have heard the carne asada is superb here.  Here are the pluses: the tacos are BIG and very filling. However, I was disappointed in both of the meats. First off the carnitas were very, very fatty. I kept getting big globs of fat, not just little pieces here and there. The carne asada was better, but salty. Very salty. The salt was overpowering the natural flavor of the meat.  I've kind of had mediocre experiences at Los Tacos while my experiences at Tacos El Gordo have rated higher. Since they're both in the same parking lot I think my business is going to go to El Gordo from here on out.   Oh, but I will give them this awesome plus: their beans are perfectly cooked and tasty and not refried beans! A very refreshing difference from the refried variety."}
{"text":"I love their tacos here. The unique way they make them with the guac and créeme thrown in is super yummy. The only downside is I'm not sure it's worth the surcharge when tacos el gordo are across the street. Nonetheless, I come here often because of the drive through. The al pastor and carne asada are my favorite. Try the pina water too. Don't forget to ask for green and red sauce."}
{"text":"Los Tacos is a popular Mexican fast food restaurant with East side and West side locations. I have been eating here ever since I found out about it early last year because it is good, cheap, and refreshing in that there are actually some healthy options. They even have freshly shucked oysters, which simultaneously grossed me out and intrigued me on my first visit. Judging by how crowded the place was, I could tell they had the turnover necessary to serve fresh seafood, but I chose shrimp instead (on a later visit I had the oysters, which were certainly fresh but of too large a variety for me to enjoy without copious amounts of hot sauce).  Although I always eat some of what my husband gets each time we go, I stick with what I had that first time, the tostada di camaron (shrimp tostada, $4.24), because it is as delicious as it is light. It consists of a freshly fried corn tortilla (that's the tostada) topped with fresh shrimp ceviche and their finely chopped house pico (I add sliced avocado for an additional $0.85 because it is always perfectly ripe and adds a creamy component). It is served with a juicy lime that I squeeze until only the pulp remains, and I like to top it all off with a few dashes of hot sauce to give it a kick. It is satisfying and unchanging, like everything else on the menu, but unique because it's hard to believe you're in a fast food place.   The burritos are probably the best thing you can get if you want something more filling, which you can have stuffed with either pork (al pastor), steak (asada), shredded chicken (pollo), or beef head (cabeza). The cabeza is actually really flavorful but it is also rich and somewhat of an acquired taste. We tried it once and enjoyed it but have not ordered it since. This time my husband opted for two chicken soft tacos ($3/each), which were also great but messy. Their chicken is incredibly tender and they go through the extra step of grilling the inner corn tortilla of each taco before stuffing it which gives it a nice toasty flavor and melts the cheese (traditional tacos come with two corn tortillas because the idea is that you pick up the inner tortilla and eat it first, allowing the filling that escapes from it to fall onto the second tortilla so you can have another taco). You can opt to add extras such as sour cream (crema), salsa, cheese, but each one will cost you $0.45. You can also add avocado ($0.85) or rice and beans ($2). They ask you if you want everything when you order ($1.50), but if you agree know that this just includes cheese, avocado, and sour cream. These little extras can add up and make your meal not quite so frugal, and it's a little frustrating they charge $0.75 for a cup of water, but you'll still be able to enjoy a great meal for a good price.  PS. If you're not too hungry they offer jr. burritos as well."}
{"text":"Came to try this place after craving for some tacos (the real stuff no hard shell nonsense). After reading about this place recently from other Yelpers and its not too far away I decided to try it out. Inside a remodeled Wienerschnitzel it has cleaned up nicely and my order didn't take too long. I ordered a carne asada and a carnitas taco and apparently ordered it with all the toppings that includes pinto beans,guacamole, sour cream, cheese and pico.  Which was a shame cause the guacamole and sour cream covered up all the taste and the beans were the runny kind but were seasoned well. So each one cost about $5 bucks apiece in which i think is too much but it is a large taco, but I would rather have the smaller \"Street\" style tacos. Keep it simple and flavorful, next time no extras for me."}
{"text":"You have got to try the carne asada quesadilla, I like the flour tortilla with everything on it.  It is absolutely fabulous!!!"}
{"text":"This place was good. And it was very cheap too. It has a fast food vibe, but takes just a little longer than BK or McDs.   The tacos were tasty...a lot of choices, but I got the pork carnitas with sour cream. I asked for the pico on the side, but they forgot it.  There was a good green sauce at the table, so I didn't need it.   I would come again for some quick tacos at a low price."}
{"text":"My absolute favorite place to fufill my taco cravings. My personal favorite is their vegetarian tacos (minus sour cream, extra red hot sauce, add jalepenos). I'm not a big meat eater but their carne asada is delicious and moist. They offer plenty of agua fresca flavors  which pairs well with their food. Service is always friendly and efficient. As expected, it can get crowded during lunch hours but I think it's worth it. Unfortunately, all their locations are in the north end of the valley. The complete opposite of where I live. Ugh. But maybe that's a good thing or else I would weigh 20 pounds more."}
{"text":"This is a place we always go to for lunch. It usually very busy but worth it. Try the Carne Asada taco with everything or the Taco el Pastor. Another great favorite is the quesadilla. You must must must get the tortilla chips and salsa.  tortilla chips are made in house and they are crunchy and salty and delicious and the salsa is made in house every day and it's fantastic."}
{"text":"way too expensive. 5 tacos with everything for two people is almost$30 ...  woth the price.  Best tacos in vegas. Jist like they do in mexico"}
{"text":"My bf has had to hear me go on and on about my Santiagos in Denver.  Finally he found a place that is a close contender.  Carne Asada was YUMMY!!!! Didn't really care for the carnitas, tasted too much of fat.  They have bottles of a delicious Salsa Verse to top off your grub.  The fruit drinks are awesome.  I liked the Pinneapple and the fella swears the Watermelon is like taking a bit out of melon."}
{"text":"We are in Las Vegas from Lake Havasu City, Arizona for just two days & nites & know how to avoid the expensive & useless restaurants.  The Los Tacos sign stood out from the zip down Charleston & we popped a 'U'ie to give it a try.  We are astounded by the size of a 'junior' beef burrito!  We will try the Sahara location next trip!  Great beef burritos & the bride loves the bean burrito!  Great value, great service, clean place!  We recommend that in spite of order counter & drive through options, this is NOT really fast food but very good food!"}
{"text":"UPDATE!   In a very unsurprising move, I just dove in here for a quick bite earlier. You know what? It's still flippin good!  That is all."}
{"text":"Man, I love tacos. I do. They're so good, basic, and most of the time they're a great bargain. I love tacos more when I have to drive and hunt and search for the best tacos in town. It makes the tacos that much better.   Los Tacos is consistently one of my favorite places in Las Vegas for Mexican food. It's good, their menu is pretty varied, and the guys there really know their stuff.   As stated in Bella C's post, this place is in the same lot as Tacos El Gordo, so you've got options here. Los Tacos is a more premium-ish place than Tacos El Gordo, and their meat shows it. The meat is more tender, delicious, and is fully complemented by their delicious toppings. (El Gordo is a lot more no-frills!)  I personally come here and always order the carne asada burrito with a drink. The prices are a little higher than Tacos El Gordo, but they're still pretty good. When they ask you what you want on your burrito, and you say \"everything,\" that adds like $2 to that item. They charge you for the guac and stuff, which seems dumb to me. It's not my favorite pricing scheme."}
{"text":"This is the clear winner in Vegas for taco joints! Everything we had was spectacular, but the Carne Asada tacos took the prize!!  Get a Sandia! It will make you want to take back all the bad things you did as a kid! It's that good.  Beats Abeulas and I did not think that was possible."}
{"text":"This place is awesome! We came here for the first time after not being able to eat at our first choice, let me tell you I'm glad it happened! We were greeted by a very  friendly, very muscled up guy who took our order. After ordering he told us we ordered too much food. Remember, we've never been here. He made his recommendation and we filled his advice! He was right!  We ordered the lengua, cabeza, and the al pastor along with some chips and salsa. The salsa was so fresh and delicious and the chips were crispy and warm. The tacos....holy guacamole they were amazing!! I've become quite the taco connisour and these are top of the top!  The guy who took our order not only checked to make sure our food was good, he knew we were first timers,  he came back to the table to talk to us and treat us like family!  I highly recommend this place! We will definitely be back and look forward to trying everything on the menu!"}
{"text":"This place is one of my all-time favorites! The lenuga is my favorite. The prices are higher because the portions are huge. Each taco compares in size to a small burrito."}
{"text":"I'm SOOOOO sad that we do not live close to any of their locations anymore!!!! But that definitely does not stop us from coming in to get our Mexican-food fix!!! We have had all sorts of tacos in many different places (cities, states, etc.) and my bf and I STILL cannot find a place that beats Los Tacos. It's literally mind-boggling how good they are. Their service is another aspect of this place that we love. It's always so genuine and I swear, there has been a handful of times where we have gotten something for free. Be it free chips and salsa, free \"extra quesadilla they accidentally made\" or free taco that they feel like they need to give us because they made us wait a whole four minutes for our order in the drive through. All of the out of town folk that we have taken to this place are all literally floored and they come from places that are heavily populated with awesome Mexican-fare, so you know this place is DELICIOUS!"}
{"text":"This place hardly disappoints. Today, I was especially happy. I went on my lunch with my mind on the cóctel de camarón (shrimp cocktail/cold soup). Ordered through the drive thru, got my food, glanced in the bag and saw a spoon I was good to go.   Pulled out and on my way when I realized I didn't ask for Tapatío! DOH! *palm to face* When I got to my destination, I saw a nicely wrapped half lime, bag with chips (did NOT skimp on the chips!) and crackers, plenty of napkins, spoon..... AND a container FULL of Tapatío!!! OMG I was so happy I had to write a review. Lady at the drive thru was very nice as well and my cóctel was heavenly!"}
{"text":"A Los Tacos carne asada burrito (no crema, no queso, with aguacate) is my silver bullet against any hangover. When ordering, be sure to request a side of cebollitas; it's a charred mix of green onions, fiery serranos and mild but flavorful white-ish pepper things -- No idea what they are. Just eat em! I judge all the fools at the Del Taco a couple buildings down so hard."}
{"text":"I absolutely loved the food here. We had the, shrimp cocktail, which had a ton of shrimp,  1 carne Asada, 1 carnitas, 1 buche, 1 Cabezas tacos, the pricing was kinda weird,  but the food was outstanding!  Very fresh ingredients, all the meats were tender and everything had tremendous flavor!  You can't compare this place to Taco El Gordo, two completely different type of tacos, both very good in their own right. I will go back here again!  Seriously some of the best Mexican food, I've had in Vegas!"}
{"text":"Very delish fish tacos. Green salas was spicy too! Tacos had lots of fish. Cheese and sour cream is extra though. Also, be sure to tell them to double bag of its a to-go order."}
{"text":"Very good sized tacos! They are 3 dollars with any meat and extra 1.50 for crema, cheese and guacamole! I love, love avocados so I was very happy when I saw a lot of guacamole on them! I also ordered the mango agua fresca and I though it was pretty good considering that It was only 2 bucks for real fruit! The only bad thing is that they were pretty busy at lunch time so we had to wait a while, on top of that they forgot to make my bfs order so we had to wait even longer .. Overall a good Mexican food in a clean and pleasant restaurant!"}
{"text":"Worst tacos, burritos, and quesadillas there carne asada meat tastes like fucking burger meat. I would've made better burritos than this bs. $35 of pure waste."}
{"text":"This is hands down the best taco place I've been to in Las Vegas.  Got recommended to come here for lunch with some coworkers and little did I know, I fell in love with the.......COW HEAD TACOOOOO (CABEEEZAAA).  I originally tried the carne asada taco with everything on it at first, actually thought it was amazing.  Then the cowhead taco came along and I've never had carne asada ever since.  The meat is just so soft and tasty.  It has a really strong beef flavor to it which i love but many people think otherwise.   So I recommend getting 1 carne asada taco, and if you're feeling adventurous try the cabeza.  But do not get anymore than 2 tacos or you'll be stuffed in pain.  The Jr. burrito isnt bad but sometimes the tortilla isn't soft and hardens.  The quesadilla is quite large so be aware."}
{"text":"The absolute best tacos I've ever had. The portion is huge, and the meat is so flavorful! It's so good it makes you want to barf out the tacos you just ate so you could eat more tacos."}
{"text":"I never thought I would like beans in a taco but Omg their tacos are tdf! I tried the carne asada and didn't think they could be better but the carnitas and el pastor are amazing! Tacos are huge and the green sauce on the table, so good! Agua Fresca is the best we've had in awhile!  Our go to spot anytime we go through Vegas! Wish there was one closer to home!"}
{"text":"I'm going to miss this place when I move up to Summerlin. I cannot get enough of the shrimp cocktail. The guys working the register are always friendly. I've had burritos, tacos, quesadillas, and much more and it's all fantastic."}
{"text":"This is the original location. All the food here is super yummy, even the seafood! The servings are big but it can get a little pricey if you want extra stuff like avocado and whipped cream. Los Tacos is one of the VERY few Mexican eateries that actually serve quality meals."}
{"text":"We were driving by charleston blvd and was hungry, looking for somewhere to get food. We were gonna go to tacos el gordo, i have been there once only and remembered the time me and friends spent on the line but that didnt matter before..  But i was so hungry i dont have the patience to stand in loooong lines to get my food. So we went to los tacos which is right beside. We ordered at the drive thru. Saw the sign burrito $6. Tacos are 3.50. so i ordered carne asada and lengua tacos. My bf ordered carne asada burrito.. And my son ordered the cheese quesadilla which is $2 and a pineapple juice $2. When we came up the window, the lady said total is 25 and some change. I was like how did it came up to 25??? Were we blind and didnt see the signs correctly??? The lady noticed i was trying to do the math (i was seating in the back seat with my window closed) so she recapped what we ordered and in the end she said we wanted everything on our tacos and burrito, it's 1.75 extra for each. I was like wtf. Never heard of that before. so what does my tacos and burrito include if i dont pay the extra for everything???? I was hungry so i was like fck it. Took 15mind on the drive thru. We noticed the kitchen is soooo crowded and only one man is doing the work. I guess he's the chef? When we got our food, ummm! Sooooo gooood!!!! I first noticed the guacamole on my first bite...so fresh!! My bf liked the burrito too. Better than robertos he said. But for the price we paid for that burrito, it was like only half the size of robertos. SO he would still rather order his burrito at robertos....lol as far as quesadilla, EW! Too much oil! Drenching in oil! I took it out the plastic bag and the oil leaked from the foil onto my legs!! Ugh! It was hot and messy. But my son ate it anyway.  Food is excellent. Small portions and too pricey. And ive read other reviews that they keep bringin up their prices.... Yikes! We really liked their food but I hope we dont have to pay 6 dollars for one taco with everything the next time we come back."}
{"text":"Signature seafood cocktail, soft tacos with an almost complete selection of meats (pastor, barbacoa, asada, carnitas, beef, etc), rice and beans served in a casserole, burritos, tortas, and the requisite fried fish selection, this place has everything that a hole-in-the-wall Mexican joint should.  Always a good sign, I'm one of only two or three white people eating there every time I go.  Practice your Spanish before you enter.  Most employees don't speak the gringo.  Jukebox playing Mexican music. A drive-thru.  Holla! I love this place.  It only gets three stars, though, because we have to leave room up top for the truly fine Mexican restaurants.  Maya in NYC being one of them."}
{"text":"Unethical business practice. We ordered guacamole and sour cream \"on the side\" but we were charged separately for each side item as \"extra\". Added $4 to our $22.70 bill.   Food was mediocre. Won't be back!"}
{"text":"I love \"Carne Asada Burritto with everything\"! It is very delicious and would like to eat once a week maybe more. This Burrito is the best in my life so far. Do not forget to eat with Green sauce and Red sauce(chill).Try to eat burrito with both sauce!"}
{"text":"Excellent food! The staff are great and the good is always fresh. We have been going there for 5 years and not one complaint from any of our lunch group. We would go there every day if we could. It is definitely a good spot to eat."}
{"text":"The carne asada burrito was decent but the chicken quesadilla was great...large portions and the price wasn't to bad either....service was great"}
{"text":"Came here for lunch and decided I wanted a carne asada torta. I choose to go through the the drive thru. The wait was long but you would expect this going in since it's so popular. The lady was very nice and she asked if I wanted green or red salsas. The food was delicious. Lots of guacamole and cheese. The mango agua was delicous! Drank it all while I waited. I would come back here for another torta next time."}
{"text":"This place is a little different than your typical Mexican food joint. I say that because the tacos are actually pretty big. They're not like your usual tacos that you need like 8 of them to get filled up, here you're good with just one or two.   Their quesadillas are amazing though. There's a semi-thin layer of cheese and it's cooked on a flat top so it is extra crispy. And every table has a bottle of green salsa, which is not too spicy, but if you do want spicy you can just ask for it at the counter.  Other items on the menu include burritos, tortas, sopes, and much more. And of course can't forget your jamaica, horchata, and tamarindo"}
{"text":"Eh.  Mediocre tacos, mediocre service.  The food here is just really bland.  After driving all the way from LA through rain and snow for an all-out taco extravaganza with the Vegas locals, this was a major bummer.  Asada: Whatever.  I've had much better at the taco trucks in LA. Chicken tacos: Not so good. The chicken really lacked any flavor. Prices: Suprise! They appear low, but they don't tell you it's like $1.50 extra to put toppings on each taco.  They let you figure it out for yourself when you look at your receipt.  Not cool. Service: Slow.  It wasn't crowded at all (bc all the people who know better are across the parking lot at Tacos El Gordo) but it still took a looooonnnnng time to get our 3 tacos.  The tacos here are big, so just 1 or 2 will fill you up.  But there are much yummier places to eat without spending much cash (like right across the parking lot, for starters)."}
{"text":"Cheap place off the strip. Reminds me a lot of restaurants in the mission, food is really delicious. Definitely recommend!"}
{"text":"Thinking about a place that serves brain and tongue literally makes me cringe. But thinking about their carne asada tacos just makes me want to eat. I had a carne asada and the al pastor. Both were great, but the carne asada kicked its ass. The tacos here are presented here really nicely!   As great as the tacos are, there is always something to complain about. This place doesn't have chips and salsa!!! Major bummer. Also, this place is tricky. It's $6 for a taco!!!! The menu says $3.50 but when they ask you if you want everything on it and you say yes, its an extra $2.50 or so. I wish they would include it INTO the price of the taco so there are no surprises.  Like i said, these tacos are bomb, so its worth it."}
{"text":"If you are looking for really delicious great tasting Mexican food like tacos, burritos ,or burritos the perfect place for that is Los Tacos. Its right off the strip and it was a little hidden taqueria that is a piece of heaven in a taco form."}
{"text":"Best torta I have had in my life, and the strawberry and the melon Agua frescas were amazing. I am coming back every time I am in Vegas.  The burritos were okay, better than most, but the fact that they have drive through and the tortas were legendary, I can't wait to come back. I'm only leaving this review so I remember where it is"}
{"text":"All I can say is Wow! My boyfriend and I came across this place and I am so happy. Lets talk green sauce, this place has the absolute best green sauce I have ever tasted! I essentially wiped our table clean of the bottle! It paired so well with our met plate, which I would totally recommend! Now I don't like refried beans..... But I could not stop eating them! Will definitely be back again! And again! And again! Great food for such an outstanding bargain!"}
{"text":"The food is ok. I really liked my carne asada taco, but not the adobada one. The adobada had a lot of chopped pineapple and tasted more like a pineapple taco. To add to that, the white corn tortillas were not good at all. In my opinion, you can't have a good taco without a decent tortilla!  I didn't mind paying 4 dollars for a taco since they were served well. The one thing that did upset me was the they charged $.30 per taco to hold the beans (we paid for a large party so the $.30 per taco really added up!). I am used to being charged for adding toppings, but to charge me for taking stuff off, now that's just crazy! Thanks to your miser ways, we won't be going back anytime soon.  I prefer Tacos El Gordo anyway, which is right next door. Where you can customize your tacos and don't get nickled and dimed for getting what you like."}
{"text":"LOVE these tacos!  I had one pork taco and a quesadilla and was full.  Their tacos have wonderful flavor and are on my top list of taco stops.  Can't wait to come back and try other items on the menu."}
{"text":"Have to echo other posts, carne asada torta was great. Lot of food for not a lot of cash. Green sauce adds the right amount of heat, nicely counterbalanced by the sweet of a horchata. Place is homey, staff is friendly, and a special shout out to whoever is cleaning the place, this joint is immaculate!"}
{"text":"We love Los Tacos. We used to get the steak tacos with everything on them, but have recently switched to the burrito, as it is both cheaper and more food than two tacos.  I've had most of the meats, and would recommend the steak over any of the others, as it is more flavorful and better seasoned.  The only down side is that it's a  little pricey for what you get, especially if you add avocado (even though they are VERY generous with the amount of avocado they put on the tacos)."}
{"text":"Got the carne asada Jr. Burrito, it was dank! Although, it does suck to pay extra for things that are supposed to be included already. But besides that, Los Tacos was a party in my mouth."}
{"text":"Best burritos in town. Great for a quick lunch if you can catch them before or after a rush."}
{"text":"Not your run of the mill mexican joint. In the surrounding area, there must be at least 20 craptastic, dirty, and downright disgusting mexican joints. This one DOES NOT fit in that category. Don't be turned off by the location (high Hispanic population) - this place is GOOD. The inside is actually CLEAN and the food is outstanding. Try a carnitas quesadilla...or for the seafood lover have the Cocteles (cocktail). DELICIOUS!!"}
{"text":"Yummy!!  So good, go there for sure!  We like everything from the burritos to the quesadilla's... I always get the rice and beans with chips and salsa and am always happy."}
{"text":"BEST tacos de lengua! A little more then average price but best quality so well worth it! Always happy with my meal here :)"}
{"text":"This isn't a fancy..  It's real Mexican food made to order. There's a drive thru also. I got the shrimp tacos. They were very fresh but the price jumped from 3.50 per taco to about $7 when I added guacamole and sour cream. I don't feel it was worth it. I also ordered a melon agua fresca.. Holy diabetes!! So much sugar I had a hard time drinking it."}
{"text":"Awesome carne asada and great carnitas too!"}
{"text":"When in Vegas this is a must stop! Awesome food and impeccable service. The owner is extremely personable. We'll definitely make this a regular stop on our Vegas trips."}
{"text":"Had a pork and Carne asada taco. Pork was ok. Carne was amazing. Had a BBQ smoky flavor. $3 plus $1.50 to add cheese sour cream and avocado so kinda pricy for a taco but so good. I asked for lime and they cut me up some fresh ones on the spot. The shrimp cocktail looks really good and I will try it next time. This place looks like a hole in the wall and really is but good food."}
{"text":"Better than Robertos. The food portions may not be as big as robertos, but the quality is amazing. Also, their salsa verde has more kick and flavor to it. Plus the food isn't as greasy. It's a bit of a drive for me and there's always traffic where it's located at. But it is definitely worth it."}
{"text":"I don't know how this place has 4 stars. Ok the tacos are decent but they are soooo overpriced. Don't be fooled by the pics with all the Guac and sour cream. Those people paid 2 bucks more for the add on bringing a taco to 5 bucks. Yes five bucks is not that much for food but I'm use to delicious dollar tacos!!  Granted these were slightly bigger than normal street tacos, they still aren't worth it to me. And this place puts beans on their street tacos. Maybe it's to make the taco look even bigger. And if you ask can I have the beans on the side cause I don't know if I will like it or not... They said they will charge you for a side of beans.....   This place has NO salsa bar, no condiment bar, not even a lime!  I tried the carne asada, which is not great, the al pastor, better with more flavor and my friend's lengua. The lengua was nice and tender but my favorite is still the al pastor.  They also only have flour tortillas.   Will not be coming to this place ever again."}
{"text":"Up until the past two times coming here I've had nothing but good experiences and great food. But no joke the last two times I've been there make me not want to come back. First instance was a week ago when I ordered a fish burrito and a shrimp taco like I've always done. As they gave me the food I asked for a plastic bag and when she went to give me bag my fish burrito fell onto the floor in the drive thru. So they said oh we'll replace that no problem. She comes back and tells me that they don't have any more fish for the night and that they can instead make me something else I told her I am a Pescatarian and I don't eat meat, seafood only. So she says how about a shrimp burrito and I said that's too much shrimp more then I would want in one meal and she says hold on. They give the food and tell me here you go don't worry about it. I didn't that much shrimp but she didn't get the hint that I wanted a refund for the burrito. So I go home and did not enjoy that much shrimp in one meal. Strike one. The second time something happened was today when I ordered the same thing again. I usually like this place so I had high hopes that a communication error was a one time thing. So I ordered the usual \"fish burrito, shrimp taco\" at this point the lady at the window tells me \"beef taco?\" I said no it's camarron. And she says oh ok camarron. Then I tell her FISH burrito. She says \"steak burrito?\" I replied, \"NO, FISH burrito FISH!\" She then says ok. I pay for the food, drive all the way home and what do I get a nice fat bite into a beef burrito. I spit my food out and called right away. The lady remembers me and tells me to come back in tonmorow because they're closed. I don't even have an appetite anymore and I'm honestly pissed Im dealing with this. I did not get full off of one shrimp taco and I threw the rest of the  beef burrito in the fridge so I can waste my gas to come back and show them I didn't eat it so they will give me a refund. I like the food here usually but atleast hire people who can understand orders so your brand image won't get tarnished. I love the food it's delicious but for something to keep happening twice in a row is ridiculous. Please get it together los tacos, one more strike and I won't eat here ever again. First and last time Im ever giving a place to eat this many chances..   Ever since yesterday someone sent a message to me that works there saying I shouldn't complain and I should eat somewhere else. This is Yelp you should be ashamed of yourselves to let your brand slip to have complaints. Not my fault I had a bad experience."}
{"text":"Love the carne asada tacos! They're the best in town, in my opinion."}
{"text":"I ordered a simple chicken quesadilla and what I got was a greasy wet mess. It turns out its very difficult to make a tortilla crispy when it's swimming in oil on a stove. The overall quality of the food is poor and it's over priced as well. A sorry excuse for a quesadilla, cold beans and flavorless rice came to $10.68. It won't break the bank, but when you consider its $7 for two small tacos or over $10 for a simple quesadilla, it's definitely not worth it in my book. Needless to say I'm never coming here again."}
{"text":"Update  Well probably under new management..... Shrimp coctail not as good as before., OVER PRICED food now, tacos still ok.  Young Kid prepping food CHEWING GUM...??? DISGUSTING!!!. There is something called \"FOOD PREPARATION CERTIFICATION\" .....maybe they never heard about it"}
{"text":"Actually is a great food a love it the cookers are friendly the girl that is on the register is rude and the way she look at people it's like she is making me a favor I'm not geting the food for free and I love to get a good customer service is the most important thing for me people need to train them stuff to have a great customer service I guess this place is not good at it ..... It's sad Cuz the food is good!... Her name is Nereyda I think."}
{"text":"Yelpers did a taco crawl and this is our stop number 2.   Since the carne asada seems to be the most popular item, the BF and I decided that to try that out. You can get the basic with just some meat, onions, cilantro,pico or you can do \"with everything\" which is avocado and crema which is $1.50 more. There was some beans in there and I'm not sure if that is something that comes basic or part of the \"with everything\" since it's my first time. Overall this was tasty, loaded full and big of a taco so I didn't feel that it was a rip off at $4.50  for one. I love the double tortilla with crispy cheese between as it lends another texture to the whole bit. That's definitely something that sets this apart is there is a lot of flavors and texture play. The green salsa bottles on the table look a bit suspect, but its garlicky and zesty good so I'll risk food borne illness and squeeze some onto the melange.  Apparently the seafood cocktail is great here, but it looks huge so we got a tosada de ceviche fish instead.  I was wondering why it was taking a bit, but it looked like from where I was sitting she was mixing it up fresh and cutting up the avocado? It was pretty good as far as ceviches go.   Overall pretty good. I would go again and glad there are a few locations around town in case I want a unique taco.  (Yelp 100 Challenge 43/100)"}
{"text":"This restaurant has decent tasting food. I like their tacos because they melt their cheese onto the tortilla before putting on all the topping :) really enjoy that. Other than that just like any other taco shop. Not bad. I liked it."}
{"text":"Best tacos I have ever had in Vegas. This place is fully packed during lunch. I specially enjoy the beef tongue tacos here. I go there whenever I get a chance."}
{"text":"The best overpriced tacos you will ever have :) but man are they overpriced. Taco stands in LA will taste better and be cheaper but for what the proportions are you can't really complain.  Try the veggie tacos! She can't eat meat and I tried them not expecting much (I'm not big on vegetarian food) but they are actually not bad"}
{"text":"Wow!  What amazing food.  I wish this little taco place on E. Charleston were closer to my home.  The food is made fresh to order, and while not fancy, it's absolutely amazing food.  Highly recommend."}
{"text":"Food is not bad but terrible customer service! You would think that for a fast food type of restaurant that charges $20 for a taco they would be friendlier!"}
{"text":"I've had this placed bookmarked after a few visits to Vegas.  I finally decided to check it out.  I had ordered the (Carne Asada) Nachos which were pretty good but my wife had ordered the Shrimp Ceviche and tostada.  I seriously don't recall when the last time I had a Ceviche this good.  I miss this place already and it's only been 3 days since my visit.  I can't wait to go back and try out the Carnitas."}
{"text":"Cleanest bathroom I have ever been in in a Mexican joint like this. Can almost eat off the toilet seat. I give them five stars for that alone. Had grilled chicken burrito. The tastes were amazing. Only problem is that it was too small. I could have ate two of them."}
{"text":"Worst tacos I ever had! I ordered 2 fish tacos and 2 shrimp tacos. They cost $19 plus changes. They came out a big disappointment: the tacos came it couple strains of lettuce, onion, spoonful of shrimp/fish. And that was it!!! No sauce, no taste at all. What a ripoff and bad cooking!!!"}
{"text":"Thank heavens they have a drive thru. This is another one of those delicious, cheap and authentic places you may crave from time to time. Unlike El Gordo next door I can just pull up and get something here without the fuss of going inside and waiting in the lines to make my order, which is ideal later in the evening. The tortas are really tasty but it doesn't seem you can go wrong."}
{"text":"I never thought I would find a taco I loved more than the al pastor at Tacos El Gordo.  I was wrong.  The minute I bit into my carne asada taco (with extra hot sauce, sour cream, guacamole, and cheese), I was in love.  The carne asada was tender and flavorful.  One taco was PLENTY.  The thing is absolutely massive.  We also ordered a side of rice and beans (and an al pastor taco for my fiancé).  We had MORE THAN ENOUGH, and every bit of it was delicious.  The beans are to-die-for.    We loved it so much, we went two days in a row for lunch.  Do I feel guilty for splurging on such a high-calorie meal?  Sure.  Was it worth it?  Heck yes."}
{"text":"AMAZING.. I spoke with the owner who originates from San Francisco. His father owns La Taqueria in the Mission and he use's the same recipes as his dad's restaurant in S.F.  If you want to try the most delicious carnita's burrito ever..come here to Los Tacos. the meat is tender, the beans, have a nice salty flavor, and the rice is perfect. add all three main ingredients together with some cheese and a flour tortilla..heaven. I have had a lot of carnita's burrito's in my time..but this has to be, hand's down the best I have EVER eaten. If your from the bay area and your looking for a mission style burrito, look no further. Los Tocos has you covered. so good..."}
{"text":"They are the best tacos in Vegas super clean the food is price good the location is great of the strip the employees are super curtious and every time I come to Vegas I  here no better place to spent your money well worth it the tacks with pico de gallo and sour cream with avocado are excellent"}
{"text":"Went through the drive through. Ordered two carne asada burritos and two carne asada tacos, all with everything, and two sodas.  Noting that the cashier asked if I wanted everything.  I was not told there was an extra charge and the menu says $6 for a burrito and $3.50 for a taco, which at that price I would assume would include more than just beans and meat.  Most places include sour cream and cheese with no additional price, asking if you want everything because some people do not want the sour cream and cheese.  I was surprised when the total came to $31 so I asked the cashier why it was so much. It was explained to me that the price on the drive through menu is for just a plain burrito without the sour cream, cheese, guacamole.  When I got home, I reviewed the receipt. $1.98 per burrito and per taco for the \"extras\"; for an additional charge of approximately $8.  If I am paying that much for \"extras\" I would expect the quantity to be generous; instead there was not even enough cheese to be identified as having been added.  The sour cream and guacamole were there, however, after a few bites it was just the meat and beans.  Although the product was okay, it was not outstanding and was not worth the price that I was charged. This is a fast food restaurant, charging sit down restaurant prices.  Next time if I want to pay $31 for two for lunch I will go to a sit down restaurant.  At least then I will get rice and beans, chips and salsa, and unlimited refills on my drinks."}
{"text":"I was a bit upset that my friends were taking me to eat tacos in Vegas. I'm from Los Angeles. We have the best taco spots around. However, these tacos are a bit different. They are very very good. They put beans in their tacos. Kind of weird to me. But it worked. I would come back to this place. Good stuff."}
{"text":"Conclusion:   Bypass everything else and go here. Don't waste your time, it's a no-brainer.  If it was a little closer to work I would come here every other day at least (I wouldn't say that about any other place)  Rundown: -Neighborhood is sketchy (no offense) -DRIVE-THRU!!! -Phenomenal Food -A little pricey for random mexican place but worth every penny -Phenomenal Food -Not near the strip -Not for the tourista -Cost/Benefit skewed far towards benefit  Detail/Context:   Moved to Vegas recently and showed up here with my buddy at the insistence of a local (we came by the day before but it was closed around 10PM)  We walked in and ordered instantly (lucky?)    2xCarne asada burritos and a carne quesadilla, OMG the flavor was perfect, the ingredients were fresh and the meat was cooked and seasoned perfectly.  We were sad we couldn't eat more.    I can't wait to go back"}
{"text":"Los Tacos is a great place to stop at for fairly authentic Mexican fast food.  I consider them to be a less greasy version of Roberto's.  I'm a huge fan of the lengua and cabeza burritos.  The meat is always super tender and flavorful."}
{"text":"Super good (and cheap) burritos. Quick fast service at lunch time (but depending on the day of the week there can be a long line). The food is really fresh and always consistant. One of my favorite lunch time spots."}
{"text":"So i like coming to get tacos here because they taste so good, but it's the same thing every time I come. It's never really busy but their service is very very slow.   When we got there we went through the drive thru cause it was empty and there was a couple people inside and decide it would be faster going drive thru. Anyway they took my order fast and we ordered 5 tacos. Got to the window and she charged us quickly and repeated the order of 5 tacos to us. Then the waiting game began. They did this last time to but I assumed they were busy. This time they weren't. It took 20 minutes for us to get out incorrect order of 4 tacos.   Called Tony the manager and never once did he apologize. He said you have a receipt number. I said no and I wasn't going back either I just wanted to let you know what should be corrected for next time. And TONY never apologized or anything. So there won't be a next time.    So yes tacos are good, but expect to wait very long for your small order and know that the service sucks and these people work with no sense of urgency. One girl was moving fast, but everyone else was moving very slow and holding conversations. Good managing TONY. Your amazing. Being very sarcastic.   LONG WAITS. HORRIBLE service."}
{"text":"asada burrito with good flavor, meat is tender & better flavor than tacos el gordo, too small now for the $8.49... I wish they were bigger for the price.  $6.00 for burrito + $1.85 con todo= $8.49 with tax.(.64) reallyyy? the employees are like I wish I worked some where else. sad & unhappy faces from the workers."}
{"text":"In a previous review, I mentioned the promise of the PLATOS, aka the combination plate. If you are disheartened by the cost of a taco at Los Tacos, try the PLATOS. You get meat, tortillas and a side salad of garnishes. Sometimes they will let you split the meat. My husband and I are able to share it, and we each get 4 tacos. That's right, a total of 8! Granted, they are not the size of your standard Los Tacos offering, but we're definitely full."}
{"text":"Taco Hunt: It should be a video game because nothing is quite as fun as hunting for the best taco in town. Of course, the video game would be quite frustrating without the real deal taco as a reward. My suggestion is to create your own real life video game and venture out around town to find that taco. We did this one night. We started at the taco cart on Sahara, which you should definitely try one night when it stops raining! However, we ended up at Los Tacos based on the recommendation of a hometown boy who knows his tacos.  We confirmed that he does indeed know his tacos, as the tacos at Los Tacos are top notch. Generous is an understatement when describing the pile of goodness they put on your tortillas. Lengua was tender and flavorful and so was the chicken. They double up the tortilla and put cheese between the two tortillas. Strong call Los Tacos. Beans are delicious.   We arrived late so we had to choose and eat swiftly, but despite our lateness, the staff was very friendly.  Judging by the crowd, I would say the local consensus is that this IS the best, most authentic taco in town."}
{"text":"Came to las vegas for a 3 day weekend that included the best ufc main card ever ufc 189 and the ultimate fighter finale...woke up craving tacos after a very awesome hot n very heavy night; -)  we actually were gonna go to tacos el Gordo but saw the ridiculous line...for tacos. No thanks I'll gladly pay with cash but not with time. My beautiful curvy gf suggested we go next door. I'm learning to not second guess her and do what her beautiful mouth says. I had 4 tacos. 2 buche and 2 carnitas she had 2 carnitas and 2 asada. She couldn't finish the asada tacos. But because she was full. The tacos were amazing. Juicy and full of flavor. Awesome horchata and Jamaica. I would have given 5 stars but the workers kept staring at my lovely gf's yummy triple d's and the layout is awkward. U pay right next to where u wait for ur food so u crowd one area fast. Also it's pretty pricy for street tacos. 8 tacos and 2 regular drinks over $45"}
{"text":"Best quesadilla I've had in my life! Their meat was also exceptionally good; well-seasoned. I wish people in Nashville knew what carne asada was."}
{"text":"We found ourselves in desperate need of food after the Pagan Pride festival on Saturday, and in the area to pay a bill. I'll admit. We wanted to go to Tacos el Gordo, but it was WAY too busy, and we were WAY too hangry to wait.  We ordered: 1 Al pastor taco 1 chorizo taco 1 carne asada taco  1 shrimp torta.  So...the food was good.  Definitely not the best tacos I've had, that title still remains with Taco y Taco.  The chorizo was by far the best taco.  They are normal sized street tacos, and they are absolutely packed with meat, and toppings.   The torta was awesome. COVERED in shrimp.  Most place will skimp and give you more salsa or toppings than shrimp, but this was perfection.  The reason for the 3 stars instead of 4 is honestly the fact that they upcharge for toppings.    Tacos START at $3.50, and then you add 50 cents for each topping:  cheese, crema, and avocado.  $4.50 per taco for me is a little spendy.  Sorry.  It just is.  And they don't tell you about the upcharge.  They just ask what toppings you want, and then you see the extra 50 cents on your receipt.    Service was strange.  The girl who rang us up was short with us.  Not overly rude, but definitely not friendly either.    So...while the food was good, I probably won't come out here again.  I'd rather drive a bit further to Taco y Taco and get more for my money and better flavors."}
{"text":"Los Tacos was very much worth the price I paid for tacos.  The quality of meat, salsa, pico, and guac was excellent ! However the burritos weren't as good as I had expected, the beans are mediocre and the size is reasonable. But I suppose thats why its called Los Tacos, not Los Burritos :b I highly recommend the Lengua Tacos con TODO!! (minus the sour cream)"}
{"text":"I am Mexican and I freaking love this place! AMAZING! My usual is the jr burrito with everything (pico, guac and sour cream +1.50) they have quesadillas with your choice of meat too. Don't forget the green sauce and horchata."}
{"text":"After reading such great reviews we decided to visit Los Tacos.  Their portions are huge but the Customer Service was really awful, the cashier was extremely rude.  The food was good, but with such bad customer service I will not go back."}
{"text":"Best tasting tacos in town! They make sure your tacos are fully loaded. The meat is marinated to perfection and very juicy. Every bite can get very messy but I don't mind since every bite is delicious!"}
{"text":"This will be my new MUST every time I visit Vegas.  We tried the ceviche, beef taco, chicken taco, pork taco.  I think the best one was the beef taco.  Spring for the extra charge of getting them loaded!"}
{"text":"Burrito as big as your thigh! Could be thicker, but I'm spoiled because of SF's El Farolito... Definitely stop by Los Tacos if you want a good taco or burrito and are in the hood; Not really worth the trip if you're not. Veggie burrito didn't come with rice, but the beans were really good."}
{"text":"They do not accept credit cards.  I think this is ridiculous and a huge inconvenience to customers. I will not be returning."}
{"text":"Wife and I went to try it out after visiting Vegas and reading the reviews on here. Well needless to say this spot was the bomb. We ended up eating here the three days in the row that we were visiting for. The Campechana  (shrimp cocktail ) was excellent. The tacos were really good as well. The burritos could of been a bit bigger but nonetheless it was good. The fella at the register was cool as can be and this was overall a good place to eat away from the pricey strip."}
{"text":"Love this place, but only for the horchata and tacos. I've tried a few of their other items, such as their ceviche and burritos, but I wasn't as impressed as I was with their tacos. You really can't go wrong. My favorite are their lengua tacos. I love the flavor of them, and they're not chintzy on the onions, meat and cilantro. The price is a little high for the tacos and I usually get about 3. So.. In all, I end up paying about $13-$15? Yeah, that sounds about right. Anyways, highly recommend them for their tacos. If you want anything else, well... Have fun."}
{"text":"8.85 for one burrito, and the customer service was horrible!! Food is good, but I will never think it's ok to pay 8.85 for a medium sized burrito.  I've been a guest for years, however the continue to raise their prices, if you ask for anything on the side they actually charge you more.  When tacos el gordo opened next door, I thought Los tacos would come around and price their food competitively.... nope, they responded by raising t heir prices!!!    You can tell the business is suffering, drove to Tacos El gordo, this is my #1 place to go to, but damn... it was packed to the max, so I went to Los tacos, there was a family in the dining area and NO LINE to order... it was empty.  Then when they told me my total was 8.85 for one Cabeza burrito, no drink or sides, I turned around and walked out... no wonder it's empty.    Good food, bad customer service, SUPER EXPENSIVE.... nope, they've lost a customer"}
{"text":"This is still the best place for quick mexican food. Its a little pricey ( 8 bucks for 1 quesadilla) but its worth it. They recently opened tacos el gordo next door. But as far as quality, los tacos edges out its competitors. Carne asada and homemade guacamole sets it off!"}
{"text":"Their tacos are some of the best I've tried; however, this is the third time we get horrible service from the same lady cashier , who seems to be having a really bad day and manages to spoil mine with her attitude and bad service every time. Next time I may think twice before coming in to this place"}
{"text":"Are you kidding me? If you want authentic Mexican food- GO HERE! They have the best tacos and burritos. This place is so packed all the time, expect to wait. It is a fast food restaurant with plenty of seating. This is a hidden gem for Las Vegas. Recently discovered it and crave it all the time."}
{"text":"Delicious! My friends took me out for dinner and I was impressed :) The Carne Asada and the Pastor quesadillas were yummy and so was the carne torta. I would definitely come back with some friends for a bite to eat."}
{"text":"Stop number two was my second favorite of the night. The lengua tacos came with large chunks of tongue. Ask for only onions, cilantro, and limes because anything else would be too much. The line moves fast and a massive crew is on the line to pump out the orders in a timely manner.  Charleston is the place to be for good tacos. I was not disappointed in this pit stop either. In fact, the last stop was my least favorite and it gets the most love."}
{"text":"Terrible , no flavor .. to expensive for what you get I'd rather spend more to get better ,, oh and NO CHEESE !! All they serve for cheese is sliced American cheese ?!?!?? What kinda of Mexican restaurant serves American cheese on tacos ?? 1st time last time never again"}
{"text":"I can't even begin to explain how amazing this place is! The service was great! The tacos were to die for!!! My friend and I wanted to eat good tacos and coming from Good ol' Texas we know good tacos and expect a lot. We tried tacos el Gordo the previous day and where completely disappointed so we looked for a different place to give Vegas tacos a try. Thank god we found this place. I have never had tacos as delicious as these. The guy cashing out gave us so many samples just to make sure we liked what we were about to order! I can't wait to go buy some more tacos before my long trip home!"}
{"text":"walking in to this place you smell all the carne asada cooking on the grill nothing like fresh cooked meat not like other places where they reheat it I was worried i wasnt going to find a burrito/taco place coming from san francisco i had 100's to chose from and i got nervous when everyone said robertos was the place to go.  Anyways LOS TACOS ROCKS  the tacos are loaded meat beans cheese and avocado and the burritos are awesome always hit the spot place is packed during lunch i usually hit up the drive though feel like its a little faster they have a lot of stuff on the menu definitely worth checking out"}
{"text":"Cheap and Yummie!  I go the carnitas and it was almost as good as Border Grille's. Close 2nd!  It's fast and inexpensive."}
{"text":"This place is amazing. I live in Dallas so anytime I come in, this is where I head. Price is a little higher than the surrounding joints, but the food is better. Also, they are larger portions than the rest. If your looking for cheap food in price and quality, this place isnt for you.    Try the shrimp cotail and the steak tacos."}
{"text":"Love this place.  My favorite Mexican dive in Vegas.  The staff is always super attentive, friendly and polite. Very inexpensive and delish Mexican food. The Ceviche Fish Tostada is excellent !"}
{"text":"This is, without a doubt, the best Mexican food in town. The atmosphere is simple, much like any Roberto's or other small venue. The staff is so friendly and knowledgeable and that's just the beginning. The food is amazing. Something as simple as a cheese quesadilla is deletable and the tacos are overstuffed with fresh ingredients in generous quantities. Two tacos here will satisfy a hefty appetite. I can't say enough about this place, but then again, I suppose our Friday night ritual of driving from Henderson to here without fail says it all. Go get some!"}
{"text":"The prices for tacos are high.  You'll end up spending almost $20 for 3 tacos and a drink.  In that case rather go to a real restaurant"}
{"text":"Best taco place to eat and the employees and manager are awesome.  I've recommended people to come to this place because they are that good."}
{"text":"I love the chicken tacos! I love their beans! You don't see Peruvian beans served too often in restaurants and you don't see beans added in tacos in many places either."}
{"text":"I love their carne asada burrito con todos! The con todos makes it super creamy. The flavor is just amazing. I've been a big fan of their food since early 2000s. One of my coworkers introduced me to this place one day when I asked him where I can get a delicious burrito. The size of the burrito seems to have gotten smaller. I used to have trouble finishing it. But still, I think they are one of the best in town. I recommend using a generous amount of their green (verde) sauce.  I could probably use half a bottle on my burrito. So if they run out, you can blame me. I also like their shrimp & fish ceviche tostadas. There are other locations in town but I feel like this original location is the best."}
{"text":"We wanted to go to our usual Taqueria restaurant, but they were no longer there.  I searched on Yelp and found a few options.  We were going to go to Tacos El Gordo, but the place was packed and my hubby wanted a burrito not just tacos.  We walked across the way to Los Tacos which had different options to choose from like burritos, tacos, quesadilla, chips & salsa.  I had two tacos - the carne asada and chicken, and their tacos are huge compared to the street tacos.  You can order the taco with everything - meat, beans, cheese, guacamole, sour cream, salsa, or add what you want, but they charge per topping.  The tacos were good and very filling.  My hubby had the carne asada burrito, and thought it was too small and salty.  My daughter had the chicken quesadilla.  For drinks we had the melon juice and mango juice - the melon juice was good, but the mango juice was too sweet."}
{"text":"OMG a great hot spot. If you're in Vegas & want a GOOD taco. This is the place!  Tacos are reg size tortillas. You can make 2 tacos out of 1.  I also had a tostada de camaron with avocado .......Very good.  Salsa at table is also very good on ANYTHING.  Prices are a lil high for your average taco but  soooooo worth every penny. I'll be stopping by when I come back to Vegas"}
{"text":"The other place was packed so we went here.  This is your basic quick serve taqueria.  The service was pretty good.  Prices cheap.  The tacos are a little different and I can say I liked the style.  The tacos start with the tortilla on the grill with jack cheese.  Then the taco is made with the warm tortilla and the cheese.  I had the carnitas, lingua, and chorizo. the meat is topped with guacamole, salsa and sour cream.  The tacos are huge.  I usually eat 3 or 4 tacos at other places but 2 of these tacos was plenty.    5 tacos and 2 drinks (they charged me for water) came to $26.  That was a little steep for tacos.  I kinda feel like I was overcharged but I just paid.  Trying to discuss the prices of my order would have been to much trouble with the language barrier.  Other than that - I like the cheese and sour cream on the tacos."}
{"text":"Last time i took the kids here we loved it. This time was terrible. Food was expensive. Not worth it at all. My kids can eat almost anything and they didn't like it at all. 22 dollars for crap. 3 dollar quesadillas ok fine.  5 dollar burrito. add 1 dollar for beans. How you gonna charge me extra for what you add to my burrito.i don't want no damn beans in my burrito. .50 for cheese. .50 cents for sour creme ok. They nickle and  dime you to death. $2 chips and salsa. they gave me old ass chips and a bottle of hot sauce. Are you serious. Never again. I have no problem paying extra for good food. Just not crap."}
{"text":"We drove up to the drive-thru at 9:59. Lights were still on and we drove from very far away to come here. While waiting for someone to take our order, the lights were shut off on us and they closed. If someone gets there before the place closes, they should be fair and take the order."}
{"text":"Mexicans in town like to complain that Los Tacos is not authentic, they don't make their own tortillas etc, and maybe they're right...but the food is really good nonetheless. I have not found a better carnitas taco. I get it with everything and it's great. In fact everything I've sampled has been excellent. Somebody else posted that they didn't like beans on their taco...then don't order it with beans! Duh!! Opinions vary widely when it comes to tacos but you should definitely give this place a try and make up your own mind."}
{"text":"What a find.  We were looking for Tacos near the Westgate. Really great food. I had a tongue burrito. Was excellent. Have to come back next time in Vegas."}
{"text":"Ok the only reason I didn't give this place 5 stars is because of their outrageous prices, don't get me wrong I'm one to pay high prices for food that is well worth it but buying food at this place makes me feel like I'm getting robbed. I order the carne asada tacos ($3) with guacamole , cheese, and sour cream which cost an additional  ($1.50) and I always ask for no beans which is an additional ($1) wait what?!?!? $1 to not add beans!!! So all in all I'm paying $5.50 for ONE taco. Their food is DELICIOUS! but the way they charge for every single addition is just a rip off."}
{"text":"My go to place for fast food Mexican.  The boiled chicken tacos and burritos, cerviche, tortas, fresh add ons are always delicious.  The Sahara location is as good now as the Charleston one.  Not cheap but portions are big and service is fast for made to order."}
{"text":"This is a must stop when you are in Vegas. Fresh food on every item. Full of flavor but not saturated in cheese, sauce, sour cream etc. fresh fruit drinks are the bomb and not full of sugar."}
{"text":"We come here every time we go out to vegas and there's times I crave it so much at home. I would literally drive the 4 hours just to eat these. Mm I wish I was there now. These are literally the best tacos I've ever had in my life and that is saying something."}
{"text":"One of the best tacos you'll find. I really should explore the menu more...I never get past the tacos.  No phone-in orders."}
{"text":"One of the best burritos I've ever had.  A friend had talked me into going to Island Style next door and I went with some hesitation.  The food was not good and I was starving.  When we left I saw Los Tacos, looked it up on Yelp, and decided to go.  Jackpot!  I had just found one of my new favorites in Las Vegas.    I walked in and was a little confused on the menu.  It doesn't really specify what comes with burritos, tacos, etc.  I added guacamole, sour cream, and cheese to my Al Pastor burrito.  Absolute heaven!  Even better with the sauce on the tables.  Chips and salsa were about average.  Nothing special there, but that's not the focus in this place.   I'm going back for Tacos later this week!    Thanks for the great meal Los Tacos!"}
{"text":"Los Tacos is authentic mexican food!!!  loved love love it:) Fab late night snack!"}
{"text":"This is my favorite new place for Tacos. I'd read a positive review about it in a local publication, but then a friend of mine mentioned it - so I figured I'd give it a shot. I ordered the Carne Asada Taco. I dont know what I was expecting, but this is unlike any other taco I've ever had. It's huge. Initially, I wasn't sure about beans on my taco, but I thought I would try it the way they make it and then decide. Suprisingly, I like the beans.  And the Carne Asada? Most delicious I've ever had. Ever. I found myself tempted to drive back for dinner later that day, if it wasn't so far I may have actually done it.  I've been back two or three times since, each time just as good. On my second trip, I tried the Quesadilla Harina con Carne Asada, which was also very good. Reminds me a lot of these Quesa Tacos I had from a street stand in Mexico."}
{"text":"My favorite taco shop. Great flavor. My favorite is the crunchy carne asada taco and a watermelon juice - yum!"}
{"text":"I very much prefer the tacos from here, than that of the competitors that happen to be in the same parking lot.   Tacos here are always good, but some times are a bit spotty of the level of guacamole the put on each taco. For the most part the flavor is good, is you get the al pastor taco or even the beef lengua. But don't forget to get green salsa for your tacos, which in my opinion is the best salsa that they have there.   Price here is pretty decent in my opinion, however I have also learned that the total can climb pretty fast when ordering carelessly."}
{"text":"My mom has been bringing me to Los Tacos since I can remember. Now that I am older I have remained loyal! They only use the best and the freshest ingredients. People might argue that it is overpriced but I disagree, you are paying for quality and their portions are more than enough! Very full filling! I definitely will say that it is very close to a home cook meal!"}
{"text":"My hispanic friend brought me here the other day for dinner. I never crave tacos but when I do eat tacos I'm always game for carne asada. Wow... talk about how big their tacos are?! I ordered 3 and ended up only being able to finish 2.5. Also got their watermelon juice. I'm a fan and would come back here again if I'm in the city craving carne asadas.  Parking not a problem."}
{"text":"If you're in the area must go...I'm from soCal and we have so many good taco places..but this place in Vegas it's pretty damn good!!! A must try"}
{"text":"This was my original go to Mexican food stop. I've been coming to this location for years! Not everybody knows how to make good lengua, but Los Tacos has it down to a science. The agua frescas are all amazing and the food never disappoints."}
{"text":"Carne Asada burrito was excellent! Visited this restaurant while visiting from California after reading all the good reviews. They definitely deserve them! I will certainly eat here on future visits!"}
{"text":"I've seen the future... the bright light that welcomes you to Taco Heaven. And YOU TOO can find it at Los Tacos.   Los Tacos has been an institution in my family for as long as I can remember. Carne asada tacos for everyone!! Not that I'm hating on the chicken, carnitas or lengua... but the carne asada is just so DARN GOOD.   Truth be told, you're cheating yourself if you haven't experienced Los Tacos. Stop reading this review and just go! Go to Taco Heaven and experience the euphoria. Then come back & thank me.   P.S. The green hot sauce on the table has super powers and you'll end up wanting to steal the whole bottle... brace yourself."}
{"text":"This place isn't bad! I came by because the line at Tacos El Gordo was insane. Bought a Pastor Torta to hold me and my group over a little, and no complaints! The meat was nice and tender. I'd definitely come back for the Torta. I don't know about the tacos however, $3.50 for a street taco that comes with pico de gallo. I passed on it.   I recommend trying out the Pastor Torta. It was like $5.96 after tax."}
{"text":"One star because the service is AWFUL. Go next door to tacos el Gordo instead, unless you don't mind waiting 25 mins in the drive thru"}
{"text":"I love the food. This place is awesome.   The only reason I didn't give it 5 stars is that I don't like being nickled and dimed to death. C'mon, just give me the toppings without a surcharge!!"}
{"text":"I have been coming to Los Tacos for the last 8 years, and since my first bite of a carne taco with everything on it, I've been hooked! Whenever, I'm in town or my friends visit I make sure to take them! My current favorite on menu is a vegetarian burrito with everything on it with chips and salsa with a medium horchata.  But for me the loyalty towards this restaurant goes further than it being just a place to grab a quick bite. A little over a year ago, a dear friend of mine got into a horrible car accident. (She was part of a group of my friends/coworkers that regularly went there). The Los Tacos answered to the tragedy by donating towards her treatment. They didn't have to but they did and that kindness is something I always remember when I go there (or any location of there's ).   The staff is very friendly and in my eight years going have only had one negative experience (I blame my friend for that one lol.)   Just keep in mind lunchtime is super busy!"}
{"text":"I absolutely love this place!!!  I've been going to the one on E. Charleston for years when it's name was La Tequeria, and now this place on Sahara is exactly the same!!  LOVE LOVE LOVE it!!! The Shrimp Cocktails are DELICIOUS!!!"}
{"text":"This was the best taco I've had in my life. I'm not exaggerating...I wanted to hug those men and women working hard after I ate. Thank you for making food with LOVE!"}
{"text":"I can't believe they charge you for basic stuff they put on a burrito. They even charge for jalepeños.. not only that, they don't even have a salsa bar.. we came in right before closing time and it seemed like everyone had a sour attitude. Maybe because they wanted to take the last 30mins of their shift easy who knows. the food was okay. Just didn't appreciate the poor attitudes. I thought it was strange they were spraying cleaning products next to the stove area where the food was being cooked prepared."}
{"text":"My girlfriend recommended this place to me and I'm really glad she did! Don't be discouraged by their modest exterior, this place makes great food! I think some of the extras may be a bit overpriced, but if you like those sorts of things then go for it! Their tacos and quesadillas are among the best I've had since moving to Vegas from New York ten plus years ago. We'll be back!"}
{"text":"The food here is delicious! But the service and sense of urgency really lacks. We went thru drive and waited for almost 20 minutes to get our food. Please improve your service."}
{"text":"Ok this is my favorite place to eat tacos in Vegas and I'm Mexican American so this is real talk! Atmosphere is casual and fast food like and like most great taco shops it's in an older neighborhood (more hoods than neighbors though). Way worth the drive but the one on Sahara is owned by the same family. The owner was nice enough to comp my cousin and I a shrimp cocktail aka Mariscos, so we could experience the love. No complaints, I could have got caught up in a driveby and it still would have been worth the tacos and mariscos."}
{"text":"Super super good watermelon drink and the best steak quesadilla in Las Vegas!!! Everything is amazing here!!!"}
{"text":"This is THE place for carne asada burritos and get it loaded.  You'll discover the reason for the long lunch lines after biting into one.    Everything is fresh and juicy, seriously, keep the burrito wrapped up until the last bite or you'll be wearing it.  I haven't tried anything else for fear of it not being as good as the burrito.  I like that they offer a junior burrito size which is typically filling for lunch.  Personally, I've never been for dinner but have heard various complaints from others about the food during this time.  So, go at lunch time, the food is the freshest and unless you like waiting for your food and a place to sit, get there before noon."}
{"text":"In Veags for the weekend and was looking for a casual spot for lunch. Thanks to yelp we found Los Tacos off Sahara. We stopped in before heading back to CA. The menu is super simple but don't let that discourage you. There is one cashier where you place your order and you pick up your food when they call your number.   They have great tacos and tostadas! We tried the carne asada, al pastor, and a tostada de camaron. I love my mexican food and this was comfort on a plate with great flavor. Will totally come back again."}
{"text":"I LOVE this place!!! Not only is it fresh but the quality of the food and the FLAVOR is astonishing. There is absolutely no doubt in my mind this is the BEST place for tacos and their Mexican food.  I agree with some people mentioning it's pricey but seriously, it's reasonable. I mean, you want quality food then you pay for quality food. For instance, it's like Mortan's Steakhouse, if you order a rib eye steak, you going to pay at least $100 at Mortan's for one. But the quality and flavor is there and thats what keeps you coming back for more. There are so many cheapsakes out there that rather eat crapy food for cheap and complain about this place, instead of comparing the quality of food to other places and realizing that this place is actually reasonable.  Also, the variety of the food they offer is exceptional. Always FRESH!! Made for the vegetarian, the meat lover, the kids, and of course for you and me.  Furthermore, the customer service here is phenomenal. I happened to meet the owners wife(and mother of his children) and not only is she appealing and charming, she was extremely delightful, young and reverent. I haven't seen her recently (which I hope she comes back soon) but it's ALWAYS a pleasure to walk in and see her there smiling lovely. Her helpfulness is gratifying and you can see how it rubs off on the other employees. It's great to know that this is a family owned business working together. The relaxed, at home ambiance of the restaurant is always captivating. I recommend this place immensely. You can NOT go wrong by coming here and eating."}
{"text":"08/24/2011- 9:00 pm  1 Veggie taco (not very filling) -3.5/5 ( very fresh beans, that was good) 1 Chicken quesadilla( very filling)-3/5 because it was too oily 2 Mango juice-3/5 1 Chips and Salsa-4/5  Ambience- very casual, as you would expect from a fast food joint.  Wait time- very less  Total with tax- $14.32 for two people."}
{"text":"My first experience with Los Tacos was definitley a good one. So good that I will definitely be back.   Not only do they have the best burritos, but the salsa is the best in city. One bite, and i was sold! A step up from Roberto's would be an understatement, so just do yourself a favor, get down and support Los Tacos.....you'll be happy you did."}
{"text":"Best authentic Mexican food.  Shrimp cocktail is to die for.  Place is hopping by 10am and it's not a breakfast place.  If you in Vegas definitely worth f Going of the strip grid and heading to Los Tacos.  Guacamole is real avocado not that cheap calavo"}
{"text":"I love me some Los Tacos. Hands down best pico de gallo. My go to is the chicken burrito con todo. I have them add pico de gallo inside my burrito as well. Perfection. The chicken tacos are also great when you want something (a little) lighter.  Service is friendly and quick (when you order inside). These employees are always hustling and this location tends to be consistently busy. But I will say, the drive thru is insane. Even if you're the only car in the drive thru, be prepared for a LONG wait time. So you're better off getting out of the car and going inside to order.   This is a solid spot. Always come here at least a couple times a month, unless I'm trying to eat clean. Be sure to try the watermelon drink as well, so refreshing! Also, they charge for EVERYTHING. So add ons add up real quick!"}
{"text":"This place is sooooo good. Tacos are fantastic. I order them with everything on them, I think it's a few bucks extra but totally worth it. Pricing is decent, closer to a sit down restaurant pricing than fast food pricing."}
{"text":"The best tacos in town.  DELICIOUS (don't forget to add guacamole and cheese) and hearty.  If you've ever had the famous tacos of La Taqueria in the Mission area of San Francisco, these are a similar style."}
{"text":"After this spot I'm going to hate Mexican food. I ordered the Plato which included one meat I chose chicken, rice, refined beans ( disgusting ) and a side salad. Everything was just pure wrong except for my pinapple drink.  I do not recommend this place to no one, unless you want to have some disgusting Mexican food than you are more than welcome."}
