{"text":"I've been coming to this spot since 2000 (well, with a 9 year gap) and I still like it! For $18 it has a totally decent vegetarian menu that gets you a veggie soup, spring rolls, and an entree. The soup - a little bowl of clear broth soup with lots of veggies and mushrooms. Very healthy tasting in a good way! The spring rolls - really good! Montreal has awesome spring rolls, but these are better than you'd get in most other cities in a random restaurant. They have fried tofu and mint and all the good stuff. The entree - by now you are kind of full, but I can vouch for the tofu with pineapple and the crispy friend noodles and veggies. Both are good, and you will be more than stuffed.  As everyone mentions, it's BYO. I had absolutely no problems with service and it's a small, clean space."}
{"text":"Food is ok - a bit too salty though. Server forgot about us at the beginning, but finally saw/remembered us and was very apologetic, so I won't ding major points for that.   Very reasonable prices, and BYOW....   But in general? Meh. I've experienced better."}
{"text":"Great Authentic chinese food!  This is not the 'Canadian-version' of chinese food but the real thing, and is very good. The roasted chickens are great, the meat savory with ginger and spices. The soup is great with handmade noodles and the dunplings are also very tasty.   Prices are low and great too!  I would agree ambiance wise, its a little sketchy, but I can ignore it for some good soup!!"}
{"text":"very fresh ingredients... well prepared and presented..sit outside and enjoy the breeze from Duluth rustle your hair while you savoir the delicious food!"}
{"text":"I lived in western China, and I miss having authentic Chinese food. (Not Cantonese style Chinese food...) I was SO happy to find that the dishes at the Blue Lotus are amazingly accurate. The food is excellent! If you want to know what real Chinese food is like, come here and give your taste buds a gift. We were in visiting Montreal for a week, and went back to the restaurant twice! It's so worth your time. Dishes we ordered: yu xiang qie zi (eggplant), si ji dou (green beans), yu xiang rou si (pork), hui guo rou (bacon like pork), he nan yang rou mian (HeNan style noodles with lamb). The broth in the lamb noodle soup will make you swoon. Go! Now!"}
{"text":"Have ordered  some chicken and beef taking home, the prices are quite low, and the foods are quite Delicious."}
{"text":"I don't know what's up with all the hate! :)  I've been here several times (with groups ranging from 4 to around 15 people) and I like it! It's a BYOB, and the prices are quite reasonable (less than $15/person). The decor on the covered terrace is cutesy/kitsch, with little plastic flowers on the walls and ceiling, but the interior dining area is a little more formal, though still casual.    The grilled meat (I tried chicken and beef) was flavourful and moist, with a nice combination of sweet and spice. Granted, there was some sneaky business with the battered shrimp (it was cut in half, with each side battered.. ah HAH! I'm on to you....) but it was good, regardless. The vegetables in the soup were crisp and fresh.  The salad is one of typical greens, tomato and onion, with julienned carrots and beet, but the sauce (also used with the imperial rolls) is tangy, sweet and delicious. I can't comment on the other options - I've only had the grilled meat combos. All in all, it's a nice little place."}
{"text":"I was there with my family (my parents in law, my wife and my two sons). The foods are authentic, the owner, Mr. Wu is already with smile. It is really a nice place for family."}
{"text":"Good noodles: check Perfectly cooked roasted chicken: check Hygiene: ehhhhh....  Come over if you are looking to enjoy the food only, as you will be disappointed by the decor and the hygiene of the place. Also, they only have styrofoam cups if you want to drink anything.  The noodles were handmade and tasted great, the broth was okay and I wish I got more lamb in my soup. The Daokou roasted chicken was really well cooked and the meat just falls off the bones really easily, it is moist and tasted amazing.  They claim that their chicken need lots of time to cook, so they roast them in the morning and then reheat them in the microwave prior to serving. That's complete BS. In China, you always get the Daokou roasted chicken cooked fresh. It is usually cooked for several hours and then finished in the oven just prior to serving, not using the microwave."}
{"text":"took an hour and a half and was seriously cooling down when it arrived. The flavours were absolutely there but it was overshadowed by too much uncooked whole pieces of garlic. Plus I was super butt hurt about how long it took to come and being a shitty temperature when it arrived. I'll probably still order it again but not for a long time when I've forgotten what a frustrating experience it was."}
{"text":"I love Chinese food (\"real\" or western). And having lived in San Francisco, I'm always looking for a great Chinese restaurant. I really wanted to like this place for a multitude of reasons. And while it may satisfy some homesick cravings for those fresh off the boat, the food wasn't good enough for a second chance.   Although you CAN dine in, don't. The staff are indeed really nice, but this place is dingy, way overlit with one of the most disgusting bathrooms I've seen in Canada. So if you decide to eat the food here, take it out.  Some of the dishes (bok choi shanghi style aka with lots of garlic and the pork w/ green onion dumplings) were delicious. The double-cooked pork was popular and might be good, too, but we didn't get it.  The lamb soup? Seriously? No way. Maybe I'm missing something but little fatty pieces of overcooked, tasteless lamb in a huge bowl of thick, pasty noodles and seaweed? It actually tasted like Chinese grocery stores smell.   Place is cheap, however (all under $10 with the dumplings being 20 for $7.50).   This one could fall down onto the one-star side of the fence if i weren't for the staff and dumplings, which were hand-made by a lady sitting in the dining room stuffing them with chopsticks.   Rating Scale: 1 Star: Avoid the town in which this place is located just to be safe.   2 Star: With so many great places to choose from, why risk this one? 3 Star: I'll try it again or consume here in a pinch. 4 Star: I go here regularly if financially and/or calorically feasible. 5 Star: I look forward to taking my wife or friends here."}
{"text":"It's true that the place isn't the best looking but I rarely mind as Chinese food is worth going to any location, no matter its look! I had high hopes for this place. I lived in Vancouver for 6 years and had Chinese expats who brought me to a few authentic restaurants over the years. I'm not an expert, but I have an understanding of how the food should taste. Unfortunately for us yesterday, the food felt a little burnt and sweet and sour flavours were overwhelming the dishes, I couldn't find the balance. We ordered three vegetarian plates: beans, eggplants and cabbages. Eggplants were the best of all three. Otherwise, they have good portions and price is very affordable, especially if you're eating vegetarian. Staff is very kind and I wish them the best. Perhaps their meat plates are better? You'll have to try!"}
{"text":"If you like authentic Chinese food... Sorry, AUTHENTIC Chinese food, this place is an excellent choice. Cheap, yes, no frills, yes, but honest-to-goodness, REAL Chinese food. Recommended by Chinese peeps - the newly immigrated sort. It's not in Verdun for nothing!"}
{"text":"Dumpling wise they are very juicy and it's probably the only place to get dumplings around here. Butttt I didn't enjoy the general Tao. The sauce they used was very sweet and I think they put to much starch in the sauce.  Won ton soup wasn't very good broth tasted like water and I hate that they don't give little soya sauce packets or those lovely little crunchy noodles. Won't be ordering that again.  Besides the fact that it's a whole in the water literally it's really easy to pass because it doesn't stand out at all On verdun."}
{"text":"My second here and it does not disappoint. Had the lamb and noodle soup which was tasty and nourishing. Also had dumplings in the past and they were plenty full and cheap.. If in Verdun and you crave mainland China food this is the place"}
{"text":"Authentic Chinese food. Flavor of North China. I am from South China but I am familiar with the taste of the north too. The lamb soup (with noodle)is excellent and is what you must try."}
{"text":"If you're looking for a really nice place to go for dinner, this isn't it but if you're looking for addictive homestyle Chinese food, this is the place to go!  I've finally found delicious authentic Chinese.  The staff is helpful and friendly. The restaurant really leaves something to be desired but the food more than makes for it."}
{"text":"Very plain food. I've been a couple times, usually as a result of other Duluth restaurants being full. I might go again under those circumstances, but never as a first option. Don't expect much!"}
{"text":"This place pretty much ruined my night. Our food took an hour to come out, which, alone would be unacceptable. But the fact that we got no updates as we waited, couldn't get water refilled or wine bottles open is completely bullshit. So I'm calling bullshit. Step up your game lotus bleu  Oh, and the food was mediocre."}
{"text":"COME HERE FOR FOOD.  What it may lack in looks, it more than makes up for in flavor and authenticity! It's the best Northern Chinese food I've had in the city."}
{"text":"Fantastic authentic Chinese food!!!  One place that I come regularly. We usually order the noodles, the chicken and the cucumber appetizer. MUST TRY!!!"}
{"text":"BYOB restaurant that was a very nice meal. They have indoor and (semi)outdoor seating for a couple of groups. They did have an eerily low ceiling in their basement bathrooms that was off-putting, but a lovely place overall."}
{"text":"One of my favorite places to eat. Homemade noodles in a savoury lamb broth, so satisfying. Its the real deal! And definitely must try the sweet and spicy \"hand pulled\" cabbage!"}
{"text":"We have walked by the restaurant a number one f times and to be honest it is very unimpressive but....  Ordered delivery on a holiday Monday using online ordering. Food came early and hot , a good start.  Our order consisted of green beans & minced pork, house special porc belly dish, dumplings and rice. Food was excellent. If you are expecting \" North American\" Chinese food don't order from here. I am not a connoisseur of Chinese food but this was delicious and more authentic Chinese.  My girlfriend loved the beans, I thought the dumplings were exceptional. The food is on the spicy and salty side so I suggest ordering plain rice as a side.  We will definitely be ordering from here again. So happy to have discovered this place."}
{"text":"Review by  SnackHappy on Chowhound:  Fantastic Big Flat Lamb Noodle Soup in Verdun   \"\"I didn't even know what it was before I tasted it, but I knew there and then that I'd been missing it all my life. I'm talking about Henan Hui Mian: braised broad noodles with lamb from Henan province in China. NYC chowhounds know it as \"Fantastic Big Flat Lamb Noodle Soup\" and fantastic is a pretty good descriptor for the one I had as well. The first bite I took of this famous Chinese snack had me floating off my chair. I was elated and it just got better as I inevitably made my way to the bottom of the bowl. This savoury lamb broth with its fresh hand-pulled broad noodles and its perfectly seasoned pieces of lamb meat packs a muttony punch. The soup also contains bean thread noodle, daylily, long thin slivers of seaweed, cilantro, a few leaves of bok choy and the occasional wolfberry. You can add to it some Changkiang vinegar and a condiment made up of dried chilli flakes in oil with sesame seeds, something I highly recommend. This is one serious life-affirming bowl of soup.  Where can one find this bowl of lamby goodness? At Lotus Bleu Restaurant in Verdun. It's a hole-in-the-wall, mom and pop kind of place with very sparse décor and harsh neon lighting. It's anything but upscale and that's just fine with me. What really counts is that he food is yummy and the people there are incredibly friendly and helpful.   And if all the place served were just the Life-Affirming Lamb Noodle Soup, that would be great in itself. But wait, there's more! Daoko chicken is also a famous Henan dish. The preparation involves basting the chicken with a honey-water solution, deep-frying it and then braising it with a bunch of aromatic spices. The result is a fragrant and tasty bird with soft yielding meat and delicious almost completely de-fatted skin. The chicken is sold by weight as is the stewed beef which is sliced thin and served with a dressing of herbs and crushed red pepper.  You thought that's all there was to this place? Think again! They make dumplings. Damn fine dumplings. The lamb and Chinese cabbage ones are crazy good. There's also a hot pork and rice noodle soup that, while it doesn't hold a candle to the Life-Affirming Lamb Noodle Soup, is still pretty darn good, too. My sister couldn't stop eating the Chinese cabbage with hot and sour sauce we had ordered one evening even if she was already full, and I really can't blame her.  The menu also features some Sichuan favourites like \"Boiled sliced fish in the Szechuan special spicy sauce\" and \"Home-style double sautéed pork slice\" (twice-cooked pork) as well as a bunch of other seemingly out-of-place items such as Thai-style stir-fried noodles or rice. On top of that the food is dirt cheap. You can walk out of there full to the gills for about $10 per person. I've been three times at different hours and the place is never full. The patrons are almost all Chinese and almost all there for the lamb soup and the chicken. There are also a lot of people getting take-away chicken. Don't miss this place. It's a keeper.\"\"  OK, my turn. I have been at this restaurant 3 times now and agree with absolutely everything that SnackHappy says, especially about that Lamb Noodle  Soup. I'm almost looking forward to winter just so I can go and slurp up that soupy goodness on those cold, abominable days we have in January and February!  Another dish worthy of mention is the Home-style double sautéed pork slice\" (twice-cooked pork). Imagine super-thick cut pieces of bacon, spiced up and sizzled up with spices and cooked with delectable pieces of stir-fried sauted onions, and green and red peppers. (drool...)  Yes, this place is a dive, a real hole-in-the-wall, no table service, you have to get up and pick up your own bowls and utensils. No drinks, except for the water cooler and syrofoam cups, so go next door to the depanneur and pick up your drinks beforehand.   Dirt cheap, huge portions, fantastic dishes, and the family that run the place are very, very nice and friendly folks.  Hurray for Verdun for scoring another foodie hit!"}
