{"text":"Meilleur Smokes Meat à St-Sauveur"}
{"text":"Cute and cozy atmosphere to get smoked meat and poutine. The Coleslaw portions were pretty small. I would definitely come back here...the meal was good but not excellent."}
{"text":"Location: In the heart of St. Sauveur. The restaurant is on the corner of a parking lot and a main street and thus, very busy. Expect curious drivers to check out your food as they wait to exit the parking lot.   Food: The smoked meat was good - I asked for lean and that's exactly what I got. The fries were crispy and not at all greasy - definitely a hit for me. I opted for the lunch special, which included a smoked meat sandwich, fries and a drink. It was supposed to be $9.99.  This is where we talk about service.  Service: First, the waitress wasn't what I would call friendly, and we had to wait about 10 minutes before she came over to the table. No smiles. When I looked at the menu, I targeted the specials because I had an idea of what I wanted - so I didn't read the menu from front to back. When the waitress asked me if I wanted coleslaw and a pickle, I said sure, why not? Since she didn't inform me that there was a surcharge for these items, I incorrectly assumed that they were included because hey guess what? 99% of smoked meat joints include slaw and a pickle. Regardless of whether or not it was noted in the menu, it's her responsibility to advise patrons of surcharges, isn't it? How many people peruse an entire menu when they go in to a restaurant knowing what they want?  Now, I could have been OK with it when I found out about the extra charges at the cash, right before paying - were it not for the waitress' spectacularly sh*tty attitude. She's lucky I was in Zen mode because she would've been in for one hell of a tongue lashing otherwise. Basically, it's my fault I didn't know there was a surcharge. Yeah, of course it is. Because I'm sure this hasn't happened to anyone else. So in addition to receiving rude and unprofessional service, I was charged an extra $3.50 for a tiny portion of slaw and one pickle.   Oh, and when I go out, I particularly enjoy it when the wait staff drags heavy metal chairs and tables across the floor while I'm trying to eat.  Who needs music?  Despite the fact that I did enjoy the meal, the service alone makes it such that I won't go back. There are plenty of other places where I an eat and get ripped off at the same time."}
{"text":"Did not enjoy this place at all, too small, terrible unfriendly service. Good smoke meat and great fries, pricey. I do not recommend this place at all!"}
{"text":"What really bothered me about this place is that they have a lunch special for $12.95 which included a jumbo smoked meat sandwich, french fries, a drink and a half a pickle. This special ends at 2:00 pm and because I sat don at 2:10 pm I was told I would have to order a la carte ( each item individually). This ended up costing me $ 17.50 for what I would call so so smoked meat. They charge $3.25 for french fries that were good but the portion was incredibly small, I could have gone to Labelle Province and had the same meal for half the price. I feel very ripped off!!"}
{"text":"Yuk! Lesters smoked meat! Salty, greasy, chemical smoke taste! Awful!"}
