{"text":"My son and i got up Sunday and agreed we both wanted mac n cheese. We pulled up about 4 minutes before they opened at noon. When they opened we went in and were greeted by a young lady wearing a Chicago Bears shirt. She turned out to have all the hospitality and charm of a honey badger with a hang over. It honestly felt as though we were not wanted there. The food was fairly standard...nothing special. The mac n cheese we were craving was good at first but then just kinda became blah and gummy. The corner tv blaring way too loud was the only bright spot of the visit."}
{"text":"LOVE this place.  The spicy fried chicken and catfish are delicious, the fresh made sides are equally so, especially the fried okra. I haven't tried the Peach Cobbler yet, because if it's as good as the chicken I may end up there every day.  The  food is SO much better than other fast food chicken options.  The location is clean and the staff is friendly.  The truest mark of their customer service was when I asked for a one piece thigh combo. The thighs they had were on the small side, so they gave me 2.  I go to the Location In Arcadia, on Thomas and 40th St, in between the theater and Walmart.  If you like chicken, check this place out!"}
{"text":"The food was just OK. The mac and cheese was dry and had no flavor. I won't be back"}
{"text":"Back in March, I Ordered to go. I ordered the Value Pac #5 that comes with 8 pcs. (2 each) + 6 Rolls, Fries or Rice and a large coleslaw. Instead of 8 pcs (2each) I received 9 pieces, 1 breast, 2 wings, 3 legs, 3 thighs, the rolls were hard on the outside, the coleslaw was too sweet, the rice was good. The wings were huge, makes me think they purchase factory farm chickens instead of local farm chickens. The coating of the chicken tasted like it had been under the hot lamp for hours. The Cajun flavor itself was good however the coating was like a separate entity to the chicken. I would not go there again."}
{"text":"Very good Fish at reasonable prices! Next time will try the chicken and maybe a donut or two! Staff was very courteous and helpful with the choices they offered!  Definitely will go back here!"}
{"text":"This place serves the best hot wings I've ever had. Hawaain volcano and 4hourse men of the apocalypse are my favorite sauces. My onion rings were perfect golden texture and delicious. Everything was made to order and the staff was really nice!"}
{"text":"It appears the LFC is closed. Last few times I have been by, it has been dark..Sad to see it go.. When it was good, it was really good....just a shame that they were so inconsistent."}
{"text":"I have eaten here several times and if I had written this review a few weeks ago it would have been a bit better. But we went for dinner last night it seems things are changing...and not for the better. The guys who used to work behind the counter were fun and friendly but they have been replaced by a new woman who looks, and acts, like she hates the world. While the food was a tasty as every the portions are getting much smaller. That really isn't that bad, it was still enough for a full dinner so I can't complain too much. But what truly topped it off was, as we were sitting there, this new woman behind the counter came out with paper signs proclaiming \"No Refills\" from the beverages (soda, tea, etc). I personally find that to be one of the most ridiculous things around. There is no way that refills are negatively impacting your sales as the cost of a soda is in the cup itself and not the drink. I feel like it gives the entire place a sense of \"you're lucky to be here.\" as opposed to the fun, family style it had before. I'm seriously disappointed and will definitely be rethinking before I go back again."}
{"text":"Tried this place for lunch with a co-worker.  Good fried chicken with nice flavor and crispness.  Would have rated 5 stars but the chicken portions were a little smallish.  I read the reviews about bad service but I can honestly say that our service experience was pretty good.  Definitely gong back!"}
{"text":"I'm all about supporting locally owned businesses.  Louisiana Fried Chicken is one of them.  Located adjacent to South Mountain Community College, a Maricopa colleague of mine mentioned this place as an option for lunch.  (She also mentioned that her brother works there.).  From her mentioned of \"fried chicken\", it enabled my craving for it for lunch.    And it did not disappoint.  The chicken was flavorful, along with the rice and roll as sides (you can choose either rice or fries).  The best thing I noticed was that unlike your other fried chicken choices (i.e. chains such as Church's and KFC), the chicken was not too greasy.  I appreciate this from a viewpoint of someone who tries to eat healthily, yet allows herself the occasional indulgence.  Well, I didn't feel like I indulged (that much), and more importantly, I didn't feel sick/nauseated afterwards like I normally do when I eat greasy, fried chicken.    Louisiana Fried Chicken is a must for all you southern cooking lovers.  Plus, the prices are affordable.  Definitely, a quality fast food option."}
{"text":"I want to say that everytime I have brought my family there, the food has been great. The person behild the counter hs been great. One matter when we have gone he has always had a smile on his face and always willing to make it right. If you want something fresh he has no problem making it.  Becuase of his attititute we will always go there in stead of the other places we have gone.  We are from New Orleans and the chicken is the bomb here.  Make sure you keep the person behind the counter there.  He has the big smile with one tooth messing...."}
{"text":"Best fried chicken so far in the Phoenix area... Great customer service, you can't go wrong."}
{"text":"I was here a couple of weeks ago, I have suddenly been on a fried chicken excursion of late. Anyways, the place is tiny, just two small tables on the inside and some on the outside. I had the chicken and waffles, one of my favorite combo. I saw the roll in the bags as someone else had mention. That is really poor, a place name Louisiana should have their own in house made biscuits. Back to my meal, first the chicken is nice and crispy, has a good skin of crust on it, the spices are mild if barely noticeable, kind of weak actually no kick at all. For this I am expecting some spices: salty, sweet, hot, tangy, but it wasn't  there except like I said very mild. The chicken was moist and held its juices well. The chicken was okay but actually weaker and less flavorful than popeye's spicy chicken. The waffle was actually a surprise. They made a belgium waffle with deep squares(not the typical southern waffle) and it was nice and crisp on the outside and chewy on the inside. A hint of sweetness but not too much but could be use to eat by itself with the chicken without the syrup. With the syrup it was very good.    Now there really are not many options here with exception of some shrimp and some sides. The chicken is so-so but the waffle made up for it. Is it the best I have tasted, no not reallyt but it was decent enough that I would come back and try it again and also I will have to come back and try some of the other sides except the pre-made roll."}
{"text":"I've been here twice and although the food and prices were good (employee discount), I've had two very opposite experiences in terms of the customer service.  The first time I went, there was a guy working the counter.  He was friendly and joking with us, and even handed me a large soda even though I paid for a small one.  A cool cat.  I got the 3pc chicken meal with a soda and a side of mashed potatoes, which was just enough food to make me full and not ship me off to food coma land.  I went back today with a co-worker, and there was a black lady working the counter.  We will call her Angry Female Employee (AFE) for the rest of this story.  My co-worker ordered but forgot to give cash (our employee discount is only for cash transactions), and AFE proceeded to tell him so in a cold, i-hate-this-job-and-everything-that-comes-with-it-including-you kind of voice.  I ordered chicken strips and a small soda, and she didn't say a word, mumble a sound or make an effort to smile.  Whatever.  Now, this place has limited seating for customers.  2 tables inside and I believe 2-3 tables outside.  One couple was occupying one of the inside tables, and AFE set up shop on the other table.  I was like ok, maybe she'll move when our food comes out, because...you know, we're like the customers (right?).  Nope.  My co-worker, not knowing what to do, sits outside for a while eating his food, while I'm still inside waiting for my food.  My food comes out and I'm thinking to myself...great, now I'm going to cause a scene because she'll either A) not want to move and tell me to leave (they have one of those \"we reserve the right to refuse service to anyone\" signs plastered right by the cash register - lol), or B) give me a cold stare to strike fear in my veins before she moves.  A black lady walks in, and AFE gets up from the table.  I proceed to take it and motion my co-worker to come inside.  Yes, I am implying that she moved because of the new customer that had just walked in.  We continue to eat, and a group of three older black dudes come in, and AFE's demeanor turns a 180.  She is laughing and having the time of her life taking these guys' orders.  She brings their food out from the kitchen, whereas she had us come to the counter and literally pushed our food to us.  In summary, the food is pretty good, the prices are great (average without the employee discount), the food comes out pretty quick, and the customer service is definitely very YMMV."}
{"text":"This is my second time coming here for some chicken. My first trip was really good and the chicken was fresh and hot. This time around I ordered the 10 piece leg and tigh for $10 and this was going to be a 15 minute wait because they are cooking it to order which I love. This may just be my new fried chicken spot."}
{"text":"Went here for takeout chicken today. Was VERY happy with the freshly fried chicken. I watched them take it out of the fryer and put it into my box. Even though I live a ways away it was still too hot to eat when I got home. Excellent seasoning, this is some of the best fried chicken I have ever had from a restaurant. AS other people have mentioned it is a tiny place so don't come here with a big group and expect to eat in but it's awesome for takeout.  It's a bit of a drive for me but I will definitely be back because it's worth it!"}
{"text":"I've been to this location several times and I really do enjoy the food. the chicken is always crunchy and spicy. The fries are seasoned with season salt. The rolls that come with the meal are decent considering they are store bought. The catfish and shrimp appear and taste to have the same spicy batter as the chicken. This place is super small so don't expect to eat here, it's a takeout place. There are  two small tables inside and two outside but I highly doubt you can get a seat. I highly recommend phoning your order ahead of time and then picking it up because it can get crowded and the service can be painfully slow. \"like\" them on Facebook to get insider offers."}
{"text":"The chicken was nice and crispy and hot. I had the mashed potatoes and gravy as a side and it was great. I would recommend this establishment to others. There's so much more food there I need to try, but for now I will still give it a 5."}
{"text":"Inspiring food. Shallow selection, inefficient service and tiny operating space on par with a bathroom, but if the smell pulls you in you'll be up against a crowd hungry for the same thing.   They're worth the hassle and the fact that you'll be shoulder to shoulder with a fire code violating amount of folks at any time, but it'll be worth it. If they could work out their efficiency issues they'd get the five stars from me.  Not a good place to stay and eat, expect to make a to-go order."}
{"text":"The chicken is wonderful, spicy, crispy on the outside perfectly moist on the inside.  Far superior to  other fried chicken chains (you know who they are).  The chicken strips are fantabulous.  The fried okra and dirty rice are good.  Not the fastest place for chicken but what they lack in fast food style  fried chicken speed they more than make up for in flavor."}
{"text":"Honestly! Popeyes, is much better than what I had this evening.  The dirty rice was blah, and the chicken you don't have a choice between mild or spicy.  Needless to say the chicken left my pallet spiced out!   The combo was suppose to include Leg with a thigh or wing.  I got a breast and a leg.  Now to some people that's bonus but I'm not a white meat person.  I love my chicken dark.......  The dinner roll, feels that it came out of the package of a Kings Hawaiian Rolls  compare that to Popeyes, buttermilk biscuits  I'm dissappointed that if you want mac and cheese as your side you have to buy  that side.  It's not an option available for combos.     I'll have to try the mac and cheese next to see if it worth going there for that, but I would prefer my chicken from Popeyes...."}
{"text":"The cons: The place has zero personality inside, there is no decor. The surrounding area isn't the greatest and I think a lively interior and some Zydeco could make all the difference.  The young woman at the counter, as someone else said - was absolutely put out that she had to work, at her job, where she works.   The pros: Chicken is decent. I found this on groupon, so I wasn't too disappointed that it wasn't The Best Chicken I've Ever Had In My Life. Even without groupon the price is affordable and the portions are good. The sides are yummy too. (Mac n cheese and sweet potato pie are what I had.) The groupon I bought came with two visits, so I'll go back a second time. But I can't say I'd go out of my way to return after that."}
{"text":"The two best things at this chicken joint did not include the chicken. The sweet corn nuggets, basically a tiny corn fritter, and the cup of red hot sauce were the show stoppers. I really only like breasts and somehow this dude screwed up my phone order. I just wanted two breasts, but ended up with one breast, a wing, thigh and drumstick. Regardless, the piece I ate was semi-crunchy, but didn't really make any memories for me. If you dipped the chicken in that hot sauce though, it made things much tastier. The roll was a roll and the dirty rice was pretty average with some nuggets of ground beef or sausage running through the rice. The whole meal was only $8, so its a good price, but not a top 10 fried chicken in my book."}
{"text":"I would definitely give them a try. I got the large shrimp po'boy and I was stuffed. The fries were hot and fresh and the sandwich was tasty. I tried my aunt's rice and beans and they were really good unlike what I expected from the other reviews I read. The people were very nice and the lunch prices were good. Dinner is more money but maybe they increase the portion size. I'm not sure. Also they give a 20% military discount on the whole order and my aunt has a military I.d. So that worked out. I'd go again for sure."}
{"text":"Saw this on television, 50% off, all entrees. Got the 8PC with 2 sides. Got coleslaw and rice & gravy. Yum, yum, yum...the breaking a little too spicy for the roommate, but got the hot sauce and I'm in chicken heaven. Will have to go back for fish, shrimp & gumbo. Wish they had greens, but the Mac & cheese and corn nuggets will do also."}
{"text":"I came a while back maybe in November, and was craving some chicken. I knew the name sounded familiar, because I went to a Louisiana Fried Chicken out in California. I knew the menu was gonna be different because they are separately owned franchises. However, the food was still on point.   I got the chicken tenders, fries and a drink REAL SIMPLE.  The chicken was hot and spicy very good, and the service was pretty quick took less than 10 minutes there was a good amount of ppl waiting inside as well as outside chilling outside.   I def would go back here over popeyes or churches!   4 STARS"}
{"text":"Bad news. VERY bad news. A friend sent me a text last week that this location opened. When the only Louisiana Fried Chicken in town was on Baseline, it was far enough to avoid. I had to REALLY be craving fried chicken to get down there. But 40th St. and Thomas?  That's too close! I gained 5 pounds reading the damn text!  I went in today - got a 3 piece combo (comes with 2 small sides, a roll and a drink) for lunch at work today and an 8 piece combo (with 2 large sides and 6 rolls) for the house.  LOVE THIS CHICKEN!!  As the reviewer before me pointed out - these are not huge pieces of chicken. They are average, normal, what size chickens are supposed to be pieces of chicken. And the batter has AMAZING flavor!  The menu board lists all the available sides - some for slightly extra - but all quite tasty. Not just fried chicken! They are also grilling the chicken, and have shrimp and fish options as well.  It's not the cheapest in town, and there are some full service restaurants around that may do the chicken better (I would still choose LoLo's or Tuck Shop for chicken and waffle over LFC's chicken and waffle) - but as far as fast food fried chicken goes - LFC is worlds better than KFC, Popeye's or Church's.  It's fantastic that there's now a Louisiana Fried Chicken so close to my place - but now I have to learn will power - and FAST!  Aside - I am sure this will be changing - but right now, the place is still really new. All the equipment is clean and shiny - and the walls are still bare. Hoping they get some stuff up on the walls. Louisiana stuff, chicken stuff, paintings of fruit...whatever!"}
{"text":"It's pretty good. I'm not sure how much difference there is between this and Popeyes, though? The young woman who took our order was very friendly and knowledgeable. She seemed to be working the hardest.  There was a large quantity of chicken cooked and sitting under a warming lamp. I was concerned I was getting chicken that had been sitting around for a while. She assured me the owner/manager knows when the big rushes of people are and the quantity is made accordingly. She said it is tossed after ten minutes if it isn't sold. I don't think that's true, as it took that long to get our food and we ate there, and never saw any chicken discarded. There was a tall guy cooking, and another guy standing around in the back room doing nothing. Our food say under the warmer for a while until I brought it to their attention we were hungry, and the lazy guy from the back packaged it up. Sides - really liked the Mac and cheese (crumb topping would be nice), okra ok. Cole slaw - too sweet Dirty rice - not exciting  Fish was good, but we weren't asked and would have preferred catfish. Great tartar sauce. Wish the chicken was spicier. We have another Groupon, so we'll go back. It's just OK, though."}
{"text":"I stopped by this morning (saturday) at 0515 to get 2 dozen donuts for my crew, the lights were out even though the shop was supposed to be OPEN.  You're missing out on my business today and most likely any future opertunities for my $$$.  I wonder how many times a week this is happening to your small business. Too bad."}
{"text":"I haven't been in this location, but my roommate brings home family packs quite often.  I haven't sampled much of the menu - but have spent many occasions making a glutton of myself with the chicken, catfish and cole slaw.  The slaw is a standard commercial recipe.  It's fresh and crunchy, but nothing to make it special.  It just happens that I love plain old boring coleslaw, so that's a bonus for me!  The catfish has always been good quality and decent sized pieces - but not whole filets.  The chicken is just what you'd want from fried chicken!  The breading (seems to be same for chicken at catfish) is spot on with great flavor - and they always have a perfect crunch to grease ratio. Hot and fresh or cold from the fridge for breakfast, Lousiana Fried Chicken understands why we love fried chicken and they make it well.  Strange bonus - on day 1 and 2 the overall flavor is enhanced with hot sauce (the best way to eat fried chicken, yo!) - but the spice in the breading has developed so much by the end of day 2 that you really don't need it. The roommate brought home a dozen or so pieces the Friday of Labor Day weekend.  Monday's leftovers had such kick, a beer was required to be able to quench the fire and finish lunch.  And that was with no additional hot sauce.  (Imagine Cajun Chef Justin Wilson tossing in a \"whhhoooooeeee, I gar-un-tee!)"}
{"text":"For the price and quality of the all white meat nuggets you cannot go wrong, plus the peeps there are totally cool and I'm pretty sure they make their own hot sauce in house, which is Bomb Diggity."}
{"text":"The sides are like KFC but a bit more homemade style.  Mac and cheese was good, cole slaw was actually better than KFC and the mashed potatoes and gravy was almost exactly the same.  I like the hawaiin roll that comes with the chicken.  The breading seemed good and the chicken was fried right.  However, I'd opt for more flavor in there.  All in all, definitely not bad, but can't wait to try the fish and shrimp."}
{"text":"The chicken is wonderful. You get quick service with a smile. Sometimes it can be over cooked but just take it back and they will recook u some chicken. The chicken and dirty rice is what I love most. Keep in mind you cant have a large family here the lobby is quite small. Only three tables inside and about 4 chairs. Their are like 2 tables outside so I would  do takeout only when trying to feed 8 to 12 people."}
{"text":"The Short: Southern fried spicy chicken finds a home in the desert.   The Pros: - Quality ingredients. - Just the right level of spice. - Great variety of sides.  - Waffles! - You can't have waffles without warm syrup!   The Cons: - Lack of bargain meal deals. - Service appears disengaged at times.  Spice Level: The chicken's breading contains a subtlety warm paprika based flavor that hits its fiery peak during the aftertaste. Suitable for almost all spice affinities.   ____________________________________________  The Story:  I must admit, I have a soft spot for fried chicken. In a bucket resting on top my stomach (badum tish).   All joking aside, I have been a fan of Louisiana Fried Chicken (LFC) since discovering its now closed location in southern Phoenix years ago. So, like the buffalo herd moving onto greener pastures, the other LFC junkies and I must now venture to the Thomas Road location.   There are some advantages to this. While the new locale can be a bit of a drive for those scattered throughout the Phoenix area, it's an overall nicer venue. That being said, the interior doesn't standout that much from your average fast-food dining room. It's clean but uncomfortable seating is enough to get the job done. Much more than its now deceased Thomas Road brother.   What makes LFC stand out is the food. Everything is expertly crafted in unison. The sweetness of the waffles and syrup complement the spice of the fired chicken and the salty-sweet fries accent the simple flavors of the green beans. Wash it all down with a soda pop and your addicted.   The chicken's breading contains a subtlety warm paprika based flavor that hits its fiery peak during the aftertaste. Suitable for almost all spice affinities. In many ways, this is my favorite aspect of LFC. I often find myself at odds with friends over where to eat due to my love of spicy food. The smoothness of the ingredients in LFC's culinary ventures make this less of an issue.  This isn't a restaurant dedicated to forging an image that matches the connotations associated with the food it serves. It doesn't try to pander to any particular crowd. It's a simple restaurant with a simple goal and because of such can be off-putting to some.   My largest complaint is placed largely with the customer service staff. While adequate a majority of time, they rarely aim to surpass expectations. This continued annoyance is what led to the 4-star rating as apposed to a five.  Overall, it's a quality friend chicken shack in a town that has a tendency to lack this loved American pastime.   Check it out, write a review, and friend me on Yelp!!!"}
{"text":"Alright, I've worked next door to this place for going on five months now and had yet to try anything. That is, until a very nice co-worker of mine was getting lunch and surprised me by getting me a couple of pieces of chicken as well.   Now, Yelp had taken down my last review because it found it wasn't representive of an actual experience. Okay, okay. So I wrote that we've had complaints with this place that when they open up, a sewer smell comes seeping through our vents as well. We aren't the only ones who've complained (Mattress Firm on the end of the plaza sent someone in to us asking if we had the smell issue) and the smell still lingers whenever they open up during the day. However bad the smell was that was keeping me from going over.. well, it wasn't worth it!   This place has really good (though really greasy) chicken. Next time, I plan on trying their tenders & fries, but what I had today was really good (two legs & a thigh). There was a nice spice to it and it was hot and fresh. It came with a roll, which probably came from a package, but I kept dipping it in the hot sauce they gave & thought it was good.   The location is pretty small as mentioned, but it stays pretty busy from the time they open until our office closes at 4pm. So, I'm pretty sure they do good during dinner time too. Very little sitting room, but they do have tables they put outside. We have their menu in our office and  the prices seem a bit on the high end, but it really is good food. Be warned though, you probably shouldn't eat this more than once a week or so.. that is, if you care about your health. haha."}
{"text":"I truly wanted to love this place after all the 5-star reviews on Yelp. One day when we had a hankering for fatty, greasy, football type of food, rather than order from our usual wings place , we opted to try the chicken here. Wings and chicken strips done , 'Louisiana' style ? We thought, 'Why not?' We ordered the wings which were actually good and big! Very saucy , but definitely not the usual, 'buffalo style' one may be used to. My chicken strips, were again, HUGE! Here's the reason I'm giving a two star. These chicken strips tasted as though old oil was used for the frying prep of their cooking. You know that, 'old, sitting around, rancid, been used and fried too many things too many times in this oil', taste ?? That is all I could taste. I did eat a couple of them after I , 'Louisiana'd' them up with my own New Orleans spices. But I ended up tossing the rest. The idea is awesome because there are also donuts here too! Drive thru is a little less than efficient , but I'm assuming that's because everything is made-to-order and that's okay. But that oil taste and the fact that my chicken that I wanted to splurge on so bad ... just missed the mark on taste. Wings -6 out of 10 Chicken Strips 0-10"}
{"text":"Eh...it's ok. The chicken and okra were seasoned good, so that's a plus. My husband does not like the portions; he ordered catfish and he got two lil' flimsy pieces and a soggy roll. One thing I didn't like was that the guy at the register really looked like he didn't want to be there and we were bothering him by ordering food. He may have been upset about the car accident that he'd got in recently (heard his animated story while waiting). The guy that was putting our food together was really nice. I'd suggest larger portions (even if it adds a couple cents) and maybe crack a smile every now and then, geez!"}
{"text":"Fresh fingerling cooked to order. That is the Louisiana way. I'm proud to say Groupon is the reason I stopped in. Being a fan of friend chicken there was no way I could pass on this deal.  I'v had the pleasure of dining here frequently after using my Groupon coupons. My experience has been 4 1/2 stars. I would give 5 stars but every time I have dropped in for a to go order or dined at the restaurant items I came in for where not available. Other then that all has been well.   The establishment is always clean. Even the staff are presentable. There are a variety of items to choose from on the menu. I really like the chicken here. Flavored and seasoned very well. This is not like your traditional KFC it is the real deal. The sides are delicious as well including the waffles. They do have sweet tea that is from a fountain dispenser but it has a great flavor.      There are a couple of TV's for those who want to chill and dine in. Price point of items are very reasonable."}
{"text":"This place is a fast good fried chicken option, much better than the other corporate spots.  Pros: Spicy cajun style breading. Good family combo options.  Grey area: Gravy seems to be out of a bag or from powder. Rice seems to be pre-made too.  Cons: Rolls they give you are kirkland dinner rolls, they just warm them under a heat lamp.  Can't stand bogus rolls, or at least don't let me see you pulling them out of a kirkland package. Also, it seems that their is a moderate probability that if you go in there when it's slow, you might get chicken that has been sunbathing under said heatlamps for hours.  If I need fried chicken, I definitely consider this place; however, it's not the best and it's not the worst.  The value is great and the fixin's adequately fill their role... you be the judge."}
{"text":"Chicken is good, just be specific about what you want. The same goes for the donut, sandwich, and thai tea/smoothie items. On at least half of our visits, a language barrier has been an issue, although we managed to catch it before we walked out the door with our order. They're definitely not \"fast\" food, but reasonable wait times for a local restaurant striving to produce quality results. Don't expect to use the drive through and have your food handed to you like a chain fast-food restaurant. Best advice: just call in your order ahead of time :-)"}
{"text":"I had been hesitant to try this place out because of some bad reviews. So I decided to check it out myself. The fried chicken is really good. The skin is soft and the chicken is juicy. Today's batch fell short, but all the other times I've been here I thought it was excellent.  They pride themselves on their Okra and Mac & Cheese sides. I thought their Okra was just okay. I'm not a Mac & Cheese lover so I go with the mashed potatoes, which are adequate.  I just wished that they get a little bit more creative in their chicken mix. I rather have a choice of legs and thighs like Popeye's offers. I'm stuck with the breast and wing as well when I order a four piece meal. I also like to address a negative review regarding soda refills; Yes, they allow soda refills."}
{"text":"The chicken is great but the service isn't. I loved the old location and the people there were great, but the new people at the new location need customer service training. They don't answer the phone so you can't call ahead, and they never have food ready. Bring back the old crew!"}
{"text":"Food was very fake, rather have popeye's church's. Had onion rings that had minced onion in it, nasty. Mashed potatoes made from powder. Employees asked us how it was and when we lied and said it was good you could hear them chuckling about it like really. Won't be back there again."}
{"text":"Spotted their van near my office recently, and it just sounded good.  So I pull up Yelp, and apparently most others think it's good!  So it made the list of places to visit.  And today we were nearby, so we stopped in.  As the name implies, they have fried chicken.  They have a few other things, like gumbo, but mostly it's fried chicken.  And it was good fried chicken!  The chicken was crisp and not excessively greasy.  So often fried food is cooked so long that the oil penetrates the food.  But not here.  The breading was crisp and not oily, and the meat was moist and tender.  The breading itself has seasoning that gives it a gentle kick (just a bit of spice, but not really \"hot\").  The fried okra they apparently buy, but it was good.  So wherever they buy it does a good job.  Their gumbo was a bit soupier than I like, but it was very flavorful and good.  I prefer thicker, but that's just a texture thing.  It was still very good.  And they include dirty rice with it (which also was good).  Probably the only bummer is their \"rolls\".  They seem like rolls you might buy at the grocery in cellophane bags.  They should probably change those for Southern biscuits.  They'd be a better fit with their cuisine, and probably taste better too.  Seating is limited."}
{"text":"I was in LFC last night and they announced that they will be closing this week.  If you have a Groupon for LFC, you had better use it today or get a refund."}
{"text":"The fish is no doubt crispy and crunchy. Looks good. But there's something about it that seems strange. Almost like it's some type of discounted fish sold on a black market for cheap. I don't know, but it seems strange. People from Louisiana aren't cooking this food. Hmmmmm"}
{"text":"Yummo!   I'm in my happy place right now. This chicken is done right!!!  And granny better watch out cause these waffles put hers out of the running.  Great place. A lot of food for the price.  Would like some gravy to dip my strips in. Keep up the great work my new chicken friends. Almost forgot. The fried okra and mac and cheese are amazing!!!  :-)"}
{"text":"I love the food. It was one of my favorite spots. The location off Thomas, off 40th street. But now there is new people that work that work there, and their customer service is beyond horrible. Because of the one female that works there and the way she treat me and my family, I wont return there. They need to bring back the old crew"}
{"text":"If your on the hunt for some chicken but tired of KFC and church's chicken, this is the place for you. The good  I recently purchase a groupon for 11$ which gave me 2 10$ coupons to use here great deal. I ordered the 4 piece chicken tenders fries and sweet corn balls 8.99 plus tax I also ordered and extra biscuit .50c after my groupon my total came out to .21c great deal I get my order about 15 min later as they make it fresh. Man the taste is so unique seems like they season with a lot of pepper so so good. The fries are great but what really stands out is the sweet corn balls man those rungs are so good. The staff has always been nice although sometimes there is only one person there and I feel bad for him, but he is nice and always helpful. The bad  This place closes every now and then for weird reasons and some very understandable reasons like the ac being out one time they were closed cause they ran out of chicken.  Overall  This place is great especially after the groupon and other discounts you can find a def must try for chicken lovers."}
{"text":"Delicious. As the product of two Louisianians, the glee I felt when I saw the sign so close to my home can only be described as...gleeful. The aroma that hit me as I waltzed gleefully through their door made me swoon. I got so excited that I lost my mind while ordering.   The following is what happened (even though I was only ordering for 2 people...yes, two actual full-grown people, not at all related to the snide euphemism of 'eating for two' that people seem to be throwing around these days when rudely implying that pregnant women shouldn't feel free to pig out every once in a while. Go on preggies, eat whatever you want. I won't judge.)  Anyway, what I heard coming out of my mouth was: #5 Value Pack, all white meat, rolls, 10 piece shrimp, dirty rice, fried okra, macaroni & cheese, lemon cake, and jeebus forgive me for my gluttony, peach cobbler.   Other than the sides and dessert, everything else was made fresh (don't get me wrong, the sides and desserts were fresh, but they weren't made-to-order, per se), so I sat myself down, enjoyed whatever college game was playing on their TVs, and settled in for my takeout.   Once I got it to the car, the smell overwhelmed me and I went...ever so slightly...bat guano crazy attacking the okra. It was perfection. None of those evil, weird, chewy pieces that sometimes show up when ordering from other not-to-be-named places that also serve fried okra with chicken. The shrimp was not my favorite (but to be fair, I'm a little weird about shrimp to where it needs to be cooked ever so slightly more than most places do...it's about the texture people...I know this about myself, so I'm not going to complain), but the chicken stole the show. The prices are reasonable, especially if you go in knowing that this is NOT drive-thru assembly line chicken, it's really really good and fresh."}
{"text":"Nice find. I ordered the two-piece with waffle and \"upgraded\" to white meat. The fried chicken was as good as I've ever eaten. Big, hot & juicy pieces. A nice level of heat & spice without going overboard. The waffle was just kind of \"meh\". My father-in-law chowed down his chicken and enjoyed his fried okra and mashed potatoes. It's a fast-food set-up, but probably took 10-15 minutes to get our food on a Sunday at 6:15. No worries, I'll assume that's because they were cooking to order. Very sweet & polite register operator who was very patient while my 75 year-old FIL tried to understand and navigate the menu. Some typical fast-food mis-steps -- no plastic knives out on the floor to cut the waffle, had to go back ask for that. Forgot to hand me butter & syrup for the waffle, had to go back & ask for that. All in all, though, well done. I'll be back."}
{"text":"just like home. visiting family here in phoenix from SoCal. The best fast food chicken spot in LA. it was on point here as well. we got an 18 peice with fries and side order of jalapeno peppers. that bomb. The skin is crispy and chicken is juicy. fries are well seasoned. if yall aint ever stopped here or have thought about stopping here. just jump at it. the best spot to eat a quick fixin for chicken in AZ.  #flame #fuego #dabomb"}
{"text":"There's a reason why some places are on Check Please Arizona (Lo Lo's) and others are on Groupon.  The sad thing is that I think this place is not far off from being REALLY good.  The interior is nicely designed, but it could really use a good clean.  The girl at the counter was not exactly the friendliest.  I think she has lost her passion for the work.  The food was painfully average.  The chicken could have been crispier on the outside and juicier on the inside.  The waffle was pretty bad.  I think they just put pancake batter in a waffle iron (which is what I think Lo Lo's does too, and it drives me crazy).  The mac and cheese was pretty decent.  The other weird thing is that they have signs outside that mentions all sorts of dishes that they do not mention on the menu indoors.  WTH?  Really though - if they could do the chicken better (it's not rocket science - there are plenty of places across the country that manage to do a decent friend chicken) and tidy up the place a bit, they could be well on their way to having an outstanding place."}
{"text":"I saw the orange sign the other day while in the area and I thought it was worth checking out.  I'm a fan of Cane's down the street and the neighborhood can always use another fried chicken place that isn't KFC.  I would compare the menu to that of Popeye's but you can tell they take a lot more pride in what they are doing.  I didn't feel like messing with the bone so I ordered a 4 piece chicken strip combo that came with two sides and a roll.  I ordered the dirty rice and cole slaw as a side just because I didn't want two starches as my sides.  It only took a few minutes and when they called out my number I was greeted by a steaming order of  perfectly battered chicken strips and two decent size sides.  I'd bet my life on the roll being fresh from a pack of King's Hawaiian Rolls.  The gentleman preparing my meal was even thoughtful enough to put a side of hot sauce (like Louisiana Hot Sauce but maybe a touch thinner) on my tray and asked me if I wanted ranch and bbq.  Well done, I'll give these guys some credit and I hope it sticks around.  It's exactly what I thought it would be when I saw the sign and walked in the door."}
{"text":"This chicken is the bomb! Fresh and juicy! I like mine with gravy on the top. The customer service is very good. I always get a laugh out of the workers."}
{"text":"The chicken was in deed made fresh but it had an odd taste. I can't put my finger on it but needless to say I will not be going back."}
{"text":"I order the chicken and I like the spices in the batter with a little spicy kick. Their food is great though the food takes long. I'm guessing the 2 times I've been here they cook to order sometimes they have chicken available though most of the time they have to cook it."}
{"text":"I work up the street from this new location and had been waiting for an chance to try it. Wow, what a pleasant change of pace. Delicious, spicy breading. The fish will become a weekly staple for me. Next week I will try the shrimp and the corn nuggets. If they are anywhere close to the greatness of the chicken and fish I will have a difficult time deciding without over-ordering. The best fried chicken around this area!"}
{"text":"I have pretty much accepted that I am less cool than my 50-something year old dad and have to get restaurant recommendations from him on the regular. Before something is on Yelp, he somehow knows about it. This was the case with Louisiana Fried Chicken.  I wanted something different for lunch a couple weeks ago (I work in the Arcadia area and one can only eat Chipotle so many days a week), and I remembered my dad had mentioned this place a while back and said it was really good. I drove out to find it and could not. (This is not a dig at their sign placement, location, etc. I am just terrible at finding places when I'm driving.) After getting something crappy and disappointing for lunch, I talked to a coworker who had been there and he told me exactly where to find it (next to Panda Express). I resolved to get me some fried chicken the next day.  I didn't order ahead, just walked in. The girl up front was super friendly and I ordered the breast and wing, with mac and cheese and dirty rice. I must have had a premonition about how good it would be if I ordered mac and cheese, because I am not a mac and cheese fan unless it's made a VERY specific way, and usually fried chicken/soul food places have the only mac and cheese I love. So, I waited for my food, they called my number about 15 minutes later, friendly kitchen guy asked if I wanted hot sauce (not even a hot sauce fan and I said yes), and I was on my way.  I got back to my office and the chicken was REALLY tasty. Perfectly crunchy on the outside and the meat was juicy. Dipped it in the hot sauce and it was delish. The mac and cheese was BOMB. Next time I'll just get one piece of chicken and a tub of mac and cheese. (Public fat kid confession.) Dirty rice was also really good (I stirred in some of the leftover hot sauce...oh yeah. Do it). Overall, a really great experience! Will definitely be back."}
{"text":"I have been a few times with my wife and by myself. I love it. It seems clean and the help is sincere and accommodating. The chicken is good and spicy!"}
{"text":"Take me to the south for some home cooked fried chicken!!  Love this new find.  Chicken is OFF THE HOOK!  It's cheaper than Lo-Lo's and better.   WHAT!! Did I just say that?!  Yes, the chicken is more moist and tender here.  LOVE THE FISH!!  Try it all here.  They have grape soda on tap!  Oh Yeah!!"}
{"text":"This is great local spot that needs to stay open. The chicken is good and the potato salad is sweet. The food comes out quick and spicy. My recommendation would be if you want fried chicken go local instead of KFC because it is worth it."}
{"text":"I tried out Louisiana Chicken after I saw a groupon deal and bought it.  I had passed the restaurant several times, but never made it in.  Much to my surprise to chicken is by far the best I have ever had.  It was crispy piping hot and juicy inside.  The service was very very good also.  I have been there twice and the same man took our order at the counter both times.  His name was \"Q\" and he was very friendly, knowledgeable and had some great suggestions.  Definitely an asset to the company. I would want him working for me, because he is so customer service oriented.  You just don't see that nowadays.  It is the exception and I appreciate it.    Ok here is why I don't give them 5 stars and I mean this as constructive criticism because I really like the place.  I just don't know if I would bring a business associate with me or have a team lunch there.  Here goes.  Water glasses were way too small.  about 4 ounces.  plastic dinnerware was too cheap and flimsy.  the chicken was actually melting the fork. stools and chairs were very uncomfortable.  Tables were cheap and wobbly.  Restaurant was too hot inside.  Turn up the AC.  The décor was nice enough but a little dingy.  Looks like they run the operation a person short so I can't fault the help.  They were very busy.  I did stop by after the lunch rush each day so that could be it too.    To leave this on a positive note.  I would shore up some of these details and I believe the place would attract a lot more people or return business.  I would definitely use them to cater an event.  They offer discounts for volume..  One other thing.  The hot sauce is to die for.  Everyone else must think that because they are having trouble keep the plastic bottles in the store due to theft.  Thanks for the great food and service I will be back."}
{"text":"From New Orleans and I love this place.  I haven't had anything bad yet. Pretty sure I ordered everything on the menu already."}
{"text":"I will run on the treadmill for an hour to indulge in the deliciousness that is Louisiana Fried Chicken. The fried chicken is moist and spicy, I paired it with fried okra and mashed potatoes and gravy. It was probably a 2500 calorie meal and I loved every single bite."}
{"text":"I actually went here yesterday. I have eaten here several times and have loves it. Yesterday we left wondering WTF happened. I wasted $40 on crap.... Literal crap. It started when I ordered. Asked for wings, were out of wings. Ok we can deal w that. Moved on to the next order. I'd like a side of green beans, oh we're out of them, ok mixed veggies, oh we're out of those too. Oh wow!!! Ok so we improvised and ordered different sides. I got fried fish that was chewy and fatty, my sons chicken strips smelled funny and had a bit of a rotten taste, my guy friends fried chicken was raw in the middle. I was annoyed. We didn't eat our food and I wasn't gonna sit there and cause a stink. I let them know directly about our problems and was offered another piece of chicken. Really? What you gave me already was inedible, why would I want more?? And another piece of chicken??? I spent $40 on stuff that went in the garbage can and a empty stomach. I WILL NEVER IN MY LIFE GO BACK TO THIS PLACE. N E V E R ! ! ! I want to know what happened. I used to love this spot. Now it nauseates me. I'm sad and pissed at the same time."}
{"text":"The food here is really good. I am from Georgia, so I was thrilled to find a good chicken and shrimp place in Phoenix.   The problem is the customer service. The employees gather at a table near the soda machine and do not bother to assist in anything. There is so much attitude that it makes you wonder whether they want customers in their shop or not. The manager is nice - but clearly does not know how to control his staff.   I want to like this place, I want to LOVE this place - we host dozens of events a year and I would love to trust them with catering orders, but for now - I will stick with the places that want me as a customer.   Sorry - this is a missed opportunity, the food is great, but we will not be back"}
{"text":"Chicken fried up in a delicious even, spicey coating. Hot and tasty. I haven't tried any of the sides. The hot sauce they offer with the chicken is watery but somehow works perfectly. We had to wait 15 mins for our order which explains why it was still super hot when we got home. This is a good alternative to the other chicken joints. And still good for leftovers the day after."}
{"text":"So I was enjoying a rare shopping day without the kids last weekend and I decided to stop in here for a quick lunch to go, and I'm so glad I did.  The restaurant was spotless and orderly and I encountered the sweetest employee working the register; unfortunately I didn't get her name.  She went out of her way to make my experience pleasant and I really thought she was super cool.    I ordered the 2 piece meal with a soft roll, two sides and a drink ($6.99 +tax).  I selected fried okra and corn nuggets as my sides.  I got a half and half mixture of strawberry and grape Fanta soda from the fountain drink dispenser.  (Don't judge.)  First off I'd like to know how it is that I've been on this Earth for 40 years yet I've never had corn nuggets before?  They were amazing deep fried, batter dipped nuggets of sweet corn...  Delicious!  I'd be back for those corn nuggets ALONE, but the fried chicken, the fried okra and the roll were also phenomenal too!  Fact: the soft roll didn't even make it home with me.  I'll add that my husband, who's a part time, half-assed vegetarian, scarfed down the extra piece of fried chicken that I saved for him too.  When I got home I discovered that *somehow* my two piece order magically morphed into a 3 piece order, allowing my husband an opportunity to taste this delicious chicken too... (Thank you! *wink*)    This chicken is crunchy, spicy and perfectly cooked; it's so good it'll make a half-hearted vegetarian fall off the wagon.   Also, it's worth mentioning that they offer chicken and waffle combination plates, and some of their other sides include dirty rice, rice and gravy, macaroni and cheese and so much more.  And yeah, in case you were wondering they also have seafood gumbo, and fried fish and shrimp too.  And their desserts?  Oh Dear Sweet Lord, they have pecan pie, and sweet potato pie and banana pudding and peach cobbler and even Red Velvet Cake!    Louisiana Fried Chicken, piping hot corn nuggets and banana pudding?!  Why are you even still sitting here reading this review??  Go!  Go now!!  So seriously folks, take a look at the other reviews for this place; you have at least 5 Yelp Elite accounts giving this place high reviews, that should speak for something right there.  If you love flavorful fried chicken and you haven't stopped here yet you really should.  Also, for the owners, if possible, I'd suggest considering adding a sign down on Thomas Road advertising your presence inside the strip mall.  The current over the door marquee sign isn't very easy to see from the main road unless you are heading westbound (you can't see it heading Eastbound) on Thomas and just happen to look up to your left at the *exact right* time.     Good luck!  I'd sincerely love to see you guys succeed so I can continue to enjoy your delicious food!"}
{"text":"Went for lunch and had a rather mediocre experience.  Nothing here stood out as exceptional. I will them a second chance during a future visit and revisit this review.   During my first visit I got two items served to me wrong, I found this hard to believe since I was the only customer in shop during my visit. So errors on orders should not be to an extreme minimum to none.  Since I just wanted to eat, I didn't bring this up to the manager/cashier/cook person manning the entire house.   The chicken strip I ordered were okay, just breaded and not 'cajun' style....or even southern..vert similar to McDonald's old chicken strips...These were good and yes they were chicken strips. The mashed potatoes with gravy was just that....These little corn nugget things were good. I liked those.   Next I'll try the fried chicken......hopefully it isn't greasy."}
{"text":"I've had their fried chicken a few times when my friends got take out, and i really enjoyed it. it has a good flavor/combination of spices and the chicken is juicy.  Luckily, in those previous times, I've never had to pay!  I decided to stop in today because I saw that they also served waffles. I've been trying to find a good chicken and waffles place.  In the past, I really enjoyed Rosco's Chicken and Waffles in southern CA and Big Mama's Chicken and Waffles in Dallas and other places all over. Also, I've been to Lo-Lo's a few times and thought it was ok.  There were def good (the waffle and the sweet tea) and not as good points (the size of the chicken pieces).  Anyways, back to LFC. The woman working was really nice! I enjoyed my chicken as usual. They were good sized pieces of chicken. I did order a waffle, and it was great too! However, I would say the price is a little high.  I paid $8 for 2 pieces of fried chicken and a waffle.  While I would expect that for a sit down restaurant, I feel like it is a little high.  I will definitely return, but probably cannot make a habit of it--for the sake of my wallet and my health!"}
{"text":"Not impressed with the food overall. The breading for chicken had too much herb and not much spice. I enjoyed the fries the most-paprika-based seasoning. Cole slaw was ok. Roll was out of a package like they go to Fryes to get them. Sweet potato pie was ok, again pre-packaged. Restaurant appeared clean and taken care of. Small but steady lunch crowd when I was there. Friendly staff. Good value.  Will I go back? No but I'm glad I tried it."}
{"text":"There are very few foods I crave as comfort food splurges more than Fried Chicken or Pizza.  I had been wanting fried chicken for a few days and Friday afternoon thru Saturday evening are my splurge days.  Wanting to try something new and different ( I usually end up at Churches) I turned to my trusty Yelp app.    I hopped in my car and drove south to a shopping center on Baseline and 20th Street.  It is a small shop with just a few tables for dine-in.  One person was waiting ahead of me and as I placed my order, the fryer timer went off.  The guy who took my order then politely excused himself  and scrambled to the back kitchen area in response to the timer.   Poor guy was the only one here at the store today.  Forced to work the register and the fryers, but he was handling it well.  He was very polite and provided great service.  (4 Stars for service)  I ordered a 10 piece Shrimp and Fries and an 8 piece chicken (only chicken).    My order was prepared right then after ordering.  Makes all the difference in the world when it comes to fried foods.  Taking my order to go, I dug into the fries on the way home (you have to enjoy them while they are hot right?) They were awesome.  The shrimp were intermingled with the hot fries and both had been well seasoned with a spicy cajun salt.  Hot, salty (in a good way) and perfectly spicy.  Once home I enjoyed the shrimp with their spicy southern fried coating (not a thick dry breading).   I would absolutely go back just for the shrimp and fries.  As for the chicken it was just ok.  I didn't find it any better than fried chicken I can get at the grocery deli.  For me I still prefer Churches Chicken but wouldn't rule the chicken out here completely.  (3 Stars for the Chicken)  In the future I would love to try their chicken tenders or nuggets and will absolutely go back for the shrimp."}
{"text":"Really good stuff, although their side selection is limited.   Their fried okra is especially good, because it seemed very fresh, and not like frozen and then fried..."}
{"text":"Sent out to buy lunch for the entire office from Louisiana Chicken only to find out they closed.  Well not exactly closed, the sign on the door that greeted us said they failed to pay their lease.  I saw someone uploaded a picture of their Burglary sign in August but this was definitely not the same sign.  Not sure how the person above me checked in on 9/23 but this location is closed."}
{"text":"I love this place! We have to drive over the mountain to get to it so we do not get there as much as we would like but every time we eat here it is soooo good! There is no other great fried chicken place on this side of the valley. It is spicy and juicy and tender. The sides are good too. Peach cobbler and Sweet potato pie, lemon cake, pecan pie. Can you tell I like sweets? The dirty rice and coleslaw, even the fires are all reallllly good. We took my mom with us this time because she said she was craving some good fried chicken.  Her wish was granted. This is a family owned business and they really care.  Spend your dollars with local companies. More money stays in the state that way. This is one little out of the way place you will love. It is made mostly for To Go orders but we usually eat there while it is fresh since the drive is a bit long from Ahwatukee"}
{"text":"This is true comfort food, incredibly bad for you but tastes great. They need to consider adding something to the menu that won't clog the arteries before getting to the car.   That being said it tastes super but if you spend your calories here you spent them all!!!!"}
{"text":"Let me start by saying very good customer service!  I won a better for wings and being from the place where the chicken wings originated I take my Wings seriously ! Great Flavor,  I had honey BQ and mild, limited flavor choices and the wings are small, that's why the flour breading was recommended to add mass. I'll try the fried chicken meal next for the real test !!! P.S. they have Great donuts for dessert ! Lastly it's in the neighborhood ! Got to LOVE IT! Go checkum out for your self !!!"}
{"text":"I'm no connoisseur to \"southern\" fried chicken but I can only compare it to LoLo's, the more popular chain here.  For me the difference was in the waffle.  If it was crispier, I would have given them 1 more star.  Now, chicken-to-chicken, LoLo is slightly crispier.  Overall, I enjoyed the chicken.  It had a light, thin batter with a fragrant of various spices and herbs.  The meat was not as juicy but was moist enough.    I ordered their 4 piece (thigh, leg, wing, and breast) meal with waffle which came out to approx $10.  It came with 2 sides of syrup and liquid butter.  That's right, liquid butter.    The menu is quite extensive, so one can't be bored with just fried chicken.  I would not mind making a return if I'm in the mood for chicken and waffles."}
{"text":"This little place just opened in a strip mall and you'd probably miss it if you didn't know it was there. Fortunately, I knew thanks to a well-timed coupon arriving in the mail.  The Cajun-inspired fried chicken is juicy with a crispy skin and just-right flavorings. I had coleslaw and mashed potatoes with gravy for sides and they were great. The gravy had just the right kick and the coleslaw was among the best I've ever tasted.  They also carry fried shrimp which I'll be back to try and they have many other sides including fried okra for those with the stomach for such things.  Friendly, helpful, and quick counter service in this to-go-only restaurant. It's small, but it has a big heart. It's part of a chain of restaurants, but this is the only one in Arizona so far. Here's hoping it's not the last!"}
{"text":"VERY clean place and the person behind the counter was very nice and helpful. The chicken is good and the menu has alot going for it. The only reason it's not 5 stars, is that the chicken is good, but not great. But hey, great friend chicken is rare ;)"}
{"text":"Kinda spicy, but not too spicy fried chicken. I saw this last time I was in Phoenix, and am glad I went this time. I also had the rice (I think it was dirty rice) and it was also a bit spicy but not too. I put the hot sauce on the bread for a while, but the spice of all the food started to catch up on me, so I stopped doing that.   I had Coca Cola with a spritzer of Fanta Strawberry. Wow, that strawberry is pretty potent. It really had the taste. Will have to return and try some of the other things."}
{"text":"It saddens me to give such a poor rating because I actually really like the food. It is the customer service, or I guess the lack thereof, that puts my review at one star. I always try to call to place my order which takes several times to get through...EVERY time. I figured out why. A lot of the front of the house staff are wearing ear buds. Back of the house fine; front is unacceptable. I have also been in a few times and my order has been wrong. Whether it is not the type of meat I requested or missing rolls from a dinner package...I don't like when my order is wrong or not ready.   I placed an order another time and was asked if I could be there in 15 minutes when it was 8PM and the door said the place closed at 10PM. This time order wrong AGAIN and they wouldn't fix it because they were \"closing\" due to pest control. I have worked in many restaurants and when they are doing pest control the whole kitchen gets wrapped in plastic and this clearly was not the case.   Finally, last night I placed my order from GrubHub as the restaurant has a stack of their business cards out to take, advertising $5 off your first online order. I go to the restaurant at the time the website said the order was to be ready. The girls behind the register gave me SO much attitude saying they didn't get my order. I told them I placed it 20 minutes ago and already paid online. One finally came back and said the prices online are out of date which I told her was not my problem. Don't advertise to order online then, in my opinion. They FINALLY got my order together and were at this point pretty much throwing things in the bag.   It is such a shame that these people have been given jobs at what was once a great establishment. My very first experiences were so very positive and the owner/s and staff were always so friendly and upsold in a enticing way. I am guessing there has been a change in ownership and definitely management. So sad..."}
