{"text":"Huge portions and great taste! I don't mind paying the price for the quality. Calzone is huge as well. No complaints and always a favorite when we decide to get pizza!"}
{"text":"Great New York style pizza! The Vampire Lover is delicious and does not disappoint for garlic lovers. Highly recommend!"}
{"text":"This pizza is really the best I've had in the area. The location is somewhat obscure and not a lot to look at, but it's more than made up for by the quality and flavor of the product. If you're someone who needs a luxurious pizza take-out environment, look elsewhere, but if you're just looking for a quality, delicious pizza to take home Luca's is the place! My only gripe is not directly related to Luca's, but to the other customers in the admittedly small parking area - seriously, is it totally necessary to double-park me instead of taking a slightly farther away spot? Not cool."}
{"text":"Man I love this place I've ordered here more than 8 times best pizza around! And the owner has been at it for decades! Started with a pizza cart in the Midwest"}
{"text":"Lucas is hands down the best pizza in the area. Do yourself a pizza with ricotta its life changing. Great prices. Even better pizza."}
{"text":"I love Luca's pizza!! It's the best New York style pizza in the area. It's a little pricey, but worth it! I give it 4 stars because I went to pick up the pizza once and one of the employees was being very rude and talking back to the owner. It was really awkward."}
{"text":"Coming from northeast Ohio and being used to the local versions, I am not a big fan of the \"New York Style\" pizza. I don't specifically dislike it, but, like most people, prefer what I ate while growing up. With that out of the way, I found myself in the neighborhood of Luca's Pizza the other day and decided to try them. I made that decision before I realized it was \"New York Style.\"  Viewed from the street, Luca's looks like someone knocked down a house and all that's left standing is the entryway and the kitchen. Intriguing. Almost makes you want to stop just to see what's inside. They offer carryout only. I am not aware if they offer coupons since I am not from their part of town and wouldn't receive their flyers. My GPS lists another name for the establishment so I presume that Luca's has been there for only a few years.  Their small pizza lists as 14 inches and costs $8.99. I had pepperoni added for another $1.50. The pizza measured in at a full 14 inches, with maybe 3/4 to 1 inch of crust around the edge. This style of pizza is known for a very thin crust and Luca's holds to that tradition very well. The bottom was baked to a dark brown without being burnt and was chewy without being hard. Sauce was good and tasty. Cheese was adequate and enough to let you taste it. The best part was the pepperoni. All 27 slices of them were deliciously spicy. I prefer my pepperoni to be cooked longer, probably another five minutes until they become darker and more crisp, but realize that the extra time needed to do so would have turned the crust into cardboard. But their spiciness made up for that.  I was torn between awarding three or four stars to Luca's (again, not the biggest fan of \"New York Style\"). But the following day when I nuked and ate what was left over, I enjoyed the pizza even more. There's something about reheated day-old pizza that tells a different story. Luca's told me that the flavors, the spiciness, the melted cheese and thin crust combined just right to create a fantastic flavorful chewy experience. They earned that fourth star. They next time I order from Luca's I will probably order a larger pizza or save more for the following day."}
{"text":"The only place around to get true New York style Pizza! Big slices, thin crust, and quality dough/ingredients. Unlike other pizza places Luca's large is actually a large pizza, and the XL is enough to feed a small army! I highly recommend the white pizza if you're into that sort of thing (tomatoes, garlic, olive oil, ricotta and mozzarella cheese). My wife and I have tried every pizza shop around, and we prefer Luca's over all of them. Also, check out their website for coupons it will save you a few bucks."}
{"text":"Last night we decided to order a pizza but didn't want to get one from the plethora of chains serving up pies in our area. That's when we remembered passing by a tiny little pizza shop not so long ago named Luca's. It is advertised as New York style pizza and it is as close as you will get to authentic NYC pizza in the area. We ordered the \"Luca\" which is really a margherita pizza with fresh basil, tomatoes, and cheese. It was FABULOUS! It was so good in fact, that we called the pizza place after we ate to tell them how much we enjoyed it. I don't think I will go anywhere else to get my pizza fix (this coming from a girl who was hopelessly devoted to Luigi's)!"}
{"text":"Love this place! I've lived in San Francisco, Phoenix, and Houston and this is one of the best pizzas I've had between all places."}
{"text":"Awesome AUTHENTIC New York Style pizza!  Sauce is on point, and they have the classic \"floppy\" slice!  Best pizza FOR SURE in the area, if not OHIO!  It may be a small place, but it sure comes with big authentic taste!  Not only is the pizza excellent, but the Cheese steak Subs...you HAVE to try one for yourself! Great value too, enough to share! I'm making my way through their menu, and so far I haven't come across anything I wouldn't order again.  Find them. Try them, And you will fall in love too!"}
{"text":"STILL good pizza.  STILL bad service.  Shaking my head."}
{"text":"So far, my favorite pizza in Ohio. Pizza in Ohio is a lot different than pizza in California. It's either pretty thick or is all chain owned. This place is just like home. Delicious thinner pizza with good quality toppings. My bf didn't like that the sauce wasn't too sweet, but he really likes papa johns, so these two are on a completely different level."}
{"text":"Greasy and undercooked.  Really big pizza but quality was poor."}
{"text":"I have now tried it 2x and I can honestly say it pretty good! First time got a medium deluxe. Lots of topping and the pizza was pretty good.   This time I got the Xlarge with pepperoni and we got mild wings. I have to say the wings were really good. Nice taste and just a touch of heat. The pizza is pretty good. Very thin and the Xlarge is really big. My family got a kick out of the huge pieces. They really liked it.   I read some of the salty comments. I could see how people might think it's salty. It does have a salty taste. I didn't think it was too bad. Both times it might be on the cusp of salty. Something they should probably watch.    Overall not too bad. I'd definitely go back. I'd like to try a sandwich next time. See how they are. Maybe a salad.   Worth a try."}
{"text":"Try the Luca's Choice.  Such fresh ingredients, so tasty.  This is pick up/delivery only, so plan ahead."}
{"text":"If you like NY style Pizza, this is gonna be a dream come true. Delicious and could hang with the best of them in Brooklyn!  I'm thrilled to have found this spot. A+"}
{"text":"One of the worst, or maybe the worst pizza I've had in my life. I have no idea why someone may enjoy the pizza here. To be fair, the crust is fine, but what is on top of it is both too cheesy and tasteless. I lived in Philadelphia, and pizza is so good there. All the pizza I've had in Ohio have been really bad, but this one killed my appetite for a long while. The first time in my life I throw my pizza away. I hate to say this about this business because people where nice, but...."}
{"text":"Good New York style pizza. Definitely large and worth the price. Pretty decent topping quality."}
{"text":"This small pizza shop really has good pizza.  Food is take out or delivery only.  There is a charge for using credit cards and a charge if you have the pizza delivered."}
{"text":"Probably the best pizza we've had since we got here (to Stow). But with some difficulties.  First of all, if you go to pick up, PAY ATTENTION! Luca's is so teeny tiny and it's hidden next to a car dealership, so you really have to look for the place. We passed it twice and had to call and ask where the hell they were located before we finally found it.  When we got there.. something happened with our order. I can't even tell you what. Whatever it was, it lead to garlic knots being made instead of a Philly cheese steak sub, and our pizza getting really cold while we had to wait for them to correct the problem. And we didn't even get the knots for free as an apology.  The X-Large pizza is absurdly extra large. The box barely fit in the car and one slice is much, much larger than my head. You totally get what you pay for at this place! Thank goodness, as every other pizza we've had in the area so far has been really weirdly small. It's nice and thin with decent crust and good, genuine pizza toppings. Slightly greasy, but not so much that it ruins it or anything.   This will definitely be our new favorite pizza place, and hopefully next time the order will go well and we'll get it delivered and I can upgrade my rating to a 4. :)"}
{"text":"$1.00 charge to use a credit card, advertised fees of up to $4.00 for delivery and canned mushrooms on the pizza.  The prices are high so I assumed the pizza would be good. To be honest it was less appealing than Papa Johns, won't be back. Way overpriced"}
{"text":"First time I tried this place. Delivery was fast and food was hot. However, there is too much dough in the Stromboli and not enough ingredients. I think half of it was empty dough and at $10 I think I could have done better with my money somewhere else."}
{"text":"This pizza is amazing! Try it, the best around.... hands down no comparison in Summit County!"}
{"text":"Worth another chance... great sauce... good crust. on the pie... just the right balance of chewy and foldable for a NY style.. but the poor garlic knots were over cooked and hard as rocks.  Vampire Lovers pie had a great roasted garlic taste... but the pepperoni was tasteless... over all it was REALLY greasy... seems to be a theme in this area for some reason..  The large is huge... 18 inches... so it was 6 paper towels to mop it up and thankfully I had a cover on my passenger seat for the 5 mile ride home as the box was soaked with grease.  They offer sandwiches and chicken fingers... even a nutella dessert pie... as well as salads and cannoli... so we will give it another try for salad and sandwiches.  No seating... no parking lot... just sort of pull over to the side of the road to pick up... or they offer delivery."}
{"text":"Awesome pizza, you may pay a little more but it's completely worth it for authentic NY style pizza. The quality is evident in every bite from the crust to the sauce and the toppings. Every time I try to venture out and try new pizza around stow/ Hudson this place competes with the best of em. You will not be dissapointed and the pizzas are quite large as well. You seriously can not go wrong here"}
{"text":"Pizza was ok.  Garlic knots were just bread tied in a knot.  I had to add my own garlic and butter.  Also no pizza by the slice.  Coming from ny it was always nice to be able to try a place before getting a pie.  Also a bit pricy for delivery.   Small pizza and small order of knots was 15$ and change.  No toppings."}
{"text":"The pizza was really good and truly is New York style. My only complaint is the estimated times they give you. They said 30 minutes, I get there 35 minutes later and they tell me 10 more minutes and then I end up waiting 15 minutes before I got the pizza. So they said 30 minutes but in reality it was 50. I hate waiting and and I hate when they underestimate the wait. ALWAYS OVERESTIMATE!That way if it's early then that's great. Also, when I was waiting for the pizza there were three other guys in there that looked like they were experiencing the same thing, they were all clearly upset that they were waiting too. And one more thing, I heard some guys in the back talking about how they messed up a delivery and it was super late, and they were just casually joking about it. Like I said the pizza was really good, but you might have to deal with that crap."}
{"text":"Best Pesto Pizza Ever!! Great Dough, Worth the Price and the delivery wait. If I still lived in Stow I would continue to order pizza from them again and again. Oh, and the cannolis are awesome!"}
{"text":"They are kind of like pizza nazis, a little scary depending on who you get. We put up with it because the pizza is good. It's about the closest to NJ pizza I've found. The crust is nice and thin and the sauce isn't sweet. I hate sweet sauce.  I've tried pizza from at least two dozen places within a 20 mile radius of my house and Luca's is the only pizza besides my homemade that I'll eat.  Update: their pizza has been very inconsistent the last few times we've had it. Today I ordered a pepperoni pizza; it had no sauce on it and the worst cheese I've ever had. The cheese was chewy and grainy and the pizza was inedible. I am so disappointed, I gave no idea what happened to the quality of their pizza. I finally have to give up on Luca's. It was just plain awful."}
{"text":"We spent $70 on a lot of pizza for a party.  It was so salty that no one could eat it."}
{"text":"I'm a big supporter of local business, and this is the corner pizza shop I've been yearning for since moving to Stow (a lovely town that is sadly defined by dull franchise restaurants and mediocre fast food chains).   Luca's New York style is incredibly tasty, affordable and authentic. They're also quick and friendly as can be.   The x-large pizza is an impressive 24 inches around. It's a beast and worth ordering just to shock your friends. Definitely check this place out if you dig NY style. It's a real treat!"}
{"text":"I was very disappointed by the food delivered to me which was 25 min late ! The subs at crammed into a styrofoam box on top of a few fries which get soggy from the subs. The steak sub had meat that didn't even cover half the bun. Unfortunately the Italian sub was not much better had very little meat and lots of lettuce."}
{"text":"Luca's is the real deal. This is great take out NY-style pizza, in little ol' Stow, Ohio! None of that greasy sheet pizza here. Their crust is awesome, and they've always cooked our pizzas perfectly. Check their website before you order! They've almost always got coupons up there that can save you a few bucks!"}
{"text":"I ordered a margarita pizza with a side of pesto 45 min later?!?! I got the pizza but no pesto.... I called and they said they were sorry and if I wanted them to bring the side of pesto they would (9:25pm) I of course said yes it's now 10:36pm and guess what....no pesto! They closed at 10pm.... so now I have NO pesto and  A cold ass pizza.   This was my first time eating here and never again will I order from them. I'll keep giving Altieri's my business from now on. There margarita pizza is sooo much better anyways."}
{"text":"Tiny place, BIG pizza with BIG flavor. My family was in town and we wanted something quick and easy for dinner. I'm not a pizza lover by nature but my parents and brother are. Had the Luca's choice and the deluxe. Great prices for the gigantic pizzas we got and we all thought the same thing, \"this is the best pizza I've had in a LONG time.\" Perfectly thin crust, extremely flavorful sauce which wasn't sweet but wasn't spicy and was perfectly seasoned, generous amount of toppings. Friendly service, too. Highly recommend this place! Don't let looks deceive you!"}
{"text":"I seriously LOVE this place! The pizza is so incredibly delicious and the speciality pizzas are phenomenal. I tried the Garlic Knots last weekend and they were great - way better than the typical garlic bread other places have. The pieces are also huge and you definitely get your money's worth! I'm glad I found this place!"}
{"text":"So we just had this pizza and I loved it. It is probably the best thin crust pizza in Cuyahoga falls, maybe that I have ever had. We had the white pizza and it was definitely cheesy and garlicky. There wasn't much of a sauce but if you dip it in their red sauce...it is solid. We also tried their Stromboli and this was was huge and packed. It was greasy and cheesy and everything you want in a Stromboli. The dough was part if what made this so good. It's chewy and wonderful.  Whatever you get form here, get a side of their red sauce, it is the best sauce from a pizza place I have ever had and I look forward to trying a different pizza with it on it.   There are only 2 reasons why this didn't get 5 stars, one the price. We got a medium white pizza and a Stromboli and it was $24. That's pretty steep...but I would pay it again in a heartbeat for the food. Also, the pizza had so much cheese and no sauce that it was almost too much cheese. Almost. It had roasted garlic and homemade ricotta on the pizza. I would rate this ricotta 5 stars ok questions asked, and I even make my own. This was creamy, and just delicious. I have never had ricotta like that and to put it on the white pizza was a perfect combo.   I will absolutely be back here and I look forward to it. By the way, one medium pizza would have been more than enough for dinner for the 2 of us. It was enormous."}
{"text":"Best NY style pizza around. I wish it was cooked just a LITTLE longer, but you can't go wrong with the large slices, thin crust and amazing flavor.  Take-out only!"}
{"text":"Don't let the quaint exterior fool you. Awaiting you in this tiny hut is the best pizza in Stow / C Falls without question, and one of the Best Pizzas in Northeast Ohio. It is a must-try for true pizza lovers. Print out their coupon online for the best value. Take out or delivery only. Don't even bother with chain pizza if you live anywhere close to Luca's - they'll square you away."}
{"text":"My favorite pizza since moving to NE Ohio. Crust is thin and crispy, delicious NY style pizza. Salads are fresh and just as delicious. I recommend Luca's special pizza (like a margarita pizza) and the homemade ranch dressing on the salad. Their cannolis are tasty too!! You cannot go wrong here!! Delivery is always quicker than they predict!!"}
{"text":"Just like NYC pizza. Crust is thin, chewy and yeasty. White pizza is our favorite, the ricotta on it is delicious. Yes, it can be hard to find and it's impossible to park there sometimes, but the best things in life are worth a little inconvenience."}
{"text":"I visited Luca's New York Style Pizza for the first time on a Friday evening. I called in about 30 minutes before they closed and told the woman on the phone that it was my first time and asked if there was anything she highly recommended. We decided on the Spero's Vampire Lover's pizza and she suggested a couple cannolis as well!   When I drove to there I thought my GPS let me down because when I turned onto Darrow Rd all I saw was the car dealership! After turning around I realized that they were the tiny building in front of it. They are definitely easy to miss!  I was a little unsure how I felt about the pizza so I visited again the next weekend and got a custom pizza to make sure I had a good understanding of their food before leaving my review.   On my first visit I was chatting with the owner while my pizza was finishing cooking. I told him that I really like NY style pizza and that I have not found too many places around that make it well. He asked which places I liked and then scoffed at my answer and insinuated that they do not come close to Luca's pizza.  But unfortunately I absolutely do not like this pizza. The sauce has very little flavor, the toppings are sparse and at least some of them come from cans. The first pizza's crust seemed stale, and the middle is so soggy that it does not even get completely cooked.  I will not return again. Both experiences were disappointing and a waste of money.   *Edit* For some reason, people (including some associated with the restaurant) keep messaging me saying thinks like \"the majority of pizzerias use canned...\" or \"I've worked at lots of shops and all used canned...\", etc and even though that was a minor point in my review it kinda shows my point that this place is just like all the rest. And most places are not great. So when you combine the fact that they only strive to be like all the other places and the anecdotal facts that my two meals were not good at all, that is how you reach 2 stars (which Yelp describes as \"Meh, I've had better.\")"}
{"text":"Being from the New York area, I have found most Ohio pizza appalling. This is the best NY-style pizza I have found anywhere in Ohio. The sauce is great. I recommend getting spinach, mushrooms, and broccoli. Prices can be a little steep (for pizza), and the delivery times on weekends can be a bit absurd. They also mess up my order 1/5 of the time, but they are typically apologetic. I highly recommend Luca's.  Also, look for coupons on their website and in the mail!"}
{"text":"Great pizza sauce is a little salty besides that really good will be coming back to try other items."}
{"text":"My son picked up pizza and wings last night our first time trying it. Normally not a big fan of thin pizza but this was perhaps one of the best pizzas I have ever had   It smelled out of this world and tasted better. We also got some wings and they were great as well. We will definitely be stoping there a lot. I am a huge fan"}
{"text":"Excellent delivery-  came earlier than expected, the crust of the pizza is delicious, was my first time ordering from this place and I'm going to become a regular!"}
{"text":"Perfect new york style pizza. I can't get enough! Great prices for huge pizzas. Sandwiches are good too. If you have a problem of any kind with this place it's probably because you are bad at life. Fix yourself and love the pizza!"}
{"text":"Good place. Ordered a large, 3-topping on a Saturday night. Picked it up, was not disappointed. A bit sad they have a $0.75 credit card fee, but it's no deal breaker. I'll bring cash next time.   Luca's called me to make sure I was coming to pick up the pizza when I got stuck in traffic. Pizza was still plenty hot when I got it. Good work."}
