{"text":"Good coffee and delicious croissant. I had a quick stop in on my way to a nearby at gallery so took everything to go, but I'd go back again if I was in this neighbourhood again!"}
{"text":"Service lent. Autrement, l'atmosphère est super!  Très, très décontracté.  Le gérant parle à la fois espagnol, français et anglais.  Service wifi fonctionne bien.  Il m'a clarifié qu'il n'avait pas de pression pour acheter de plus si je voulais travailler, un clarification très apprécié.  J'y reviendrais."}
{"text":"Jolie petite place dans un coin en boom total. J'ai testé quelques sandwiches, ils étaient pas mal. Coup de cur pour le bagel au saumon gravlax, très frais et goûteux. Je l'ai accompagné d'une salade caprese, bien appréciée. Je trouve les prix légèrement élevés, surtout qu'ils sont en face d'un super bon comptoir à sandwiches (traiteur M.A.D.)"}
{"text":"Finally a coffee shop in Griffintown! Beautiful space, bright light and creative vibes. 

I ran an art workshop in Lucci and everyone had an amazing time! Coffee is great!"}
{"text":"I know it's pretty cocky to give a place five stars when all I've tried are one sandwich and an almond milk latte, but Imma do it cause a)'twas the best sandwich of my life and b)I'm feeling super friendly toward the owner, who is basically waiting on me hand and foot and I wish he would give my husband lessons. Also I trekked like 30 minutes to get here because it's not exactly near a particular metro and I got a little lost because I am terrible with directions, so getting to eat after that hike is probably a factor in how high I am eating this place.

Okay, the sandwich: I had this homemade porchetta that's hormone free yadda yadda with this spicy stuff and simply lettuce and tomato and holy moly. I want to try all of their sandwiches, although the gentleman serving me assured me it is their best sandwich. They also will add all their current salads for only $3. I wanted to save room for the gooey tiramisu that I am looking at and still may eat.

The latte: great quality almond milk with none of that chalky aftertaste you get from the cheap stuff, barely needs sugar even though I asked for a double shot of espresso and the owner even offered to top it up with more espresso if it were not strong enough for me.

The bathroom is super clean, the space is bright and simple, and the music low and non-invasive. Perfect for getting a little work done, which is exactly what I'm gonna do now."}
{"text":"What a lovely place! I really enjoy their tartinade of the day on toast. So fresh and yummy. The coffee is also good and co-owner, Marcel, is such a wonderful guy. Will be a regular for sure.

I also love some of the novel projects they're working on. Most notably, they will build a takeout window for cyclists. From there, we'll be able to pick up lunch packages in custom boxes on the go. Perfect for a long ride along the river and canal. This will be done next summer and, as a cyclist who enjoys a picnic between ride segments, I'm totally totally stoked!!! Eagerly looking forward to this ;-)"}
