{"text":"Based on the review of Darren W, the first person to review this restaurant, I visited Lucky Dragon Chinese Restaurant and ordered the same thing he did.   Meh -- I'm not impressed. My meal was the same ordinary, run-of-the-mill Chinese food that could be purchased at any strip mall or hole-in-the-wall Chinese restaurant anywhere in the US.   Not to disparage the owners of this restaurant, who were friendly and hardworking, but in Lawrenceville there are much better places to eat than Lucky Dragon Chinese restaurant."}
{"text":"I did not enjoy this place.  Nothing awful about it, but nothing good either.  Tried a variety of appetizers and main dishes.  Did not like any of the appetizers.  The main dishes were all flavorless.  Go to Green Bamboo instead."}
{"text":"Simple and basic Chinese food. My girlfriend and I ordered the sweet and sour chicken, schezuan beef, chicken fried rice and cheese ragoons. All the food was pretty tasty, no real complaints. Portion size was pretty good and the prices were very reasonable. Nothing super different or unique, but still a good establishment.   The place itself is a typical hole-in-the-wall kind of place. Seems to be run by a family because during my visit there was an older woman, a young woman, and two small children.   The service was quick and efficient. I placed my order and the lady repeated it back to me before making it. I waited approx. 10 minutes and the food was still piping hot when I got it home.   Most certainly a place I will revisit."}
{"text":"I had my hopes set so high for Lucky Dragon.  When I picked up the food I was even so bold as to take a menu with me so it would be easier to order takeout over the phone.  Sadly, when I got home to eat, things just went downhill.  The cheese wontons are a little too sweet for my liking.  The General Tso's chicken didn't have much spice or distinctive flavor to it--kind of boring.  I really didn't like the beef lo mein (what little beef there was).  I also didn't care too much for the cashew chicken.  Bummer..."}
{"text":"I've only ever gotten take out from here while at work.  It serves the purpose of filling the belly until you can make it home to run to the toilet.  Ordering over the phone from here can be an experience...that is if anyone picks up the phone.  Better yet, they pick up and immediately put you on hold without even asking.  I've had the joy of experiencing a little bit of this and that from there.  Usually go for the combination platter.  Just your usual fare that comes with your choice of white or fried rice and an egg roll.  Depending on their promotion if you call in an order over a certain amount, they usually give you something in your order.  Recently it's been a two liter soda; in the past it has been an appetizer portion of fried won tons and 20 oz. sodas.  Word of advice, if you don't have your own utensils at work or wherever you are ordering from, ask for chopsticks, they are more sturdy then the thin plastic fork they'll give you."}
{"text":"Nothing over the top, but consistently good. The service is quick, waited 10 minutes before getting food to take home. Don't expect flashy and over the top amazing, but if you just need a quick meal that you can rely on, this is the place for you."}
{"text":"I'd say this place is average at best. I got takeout and while it satisfied my immediate Chinese food craving, I don't think I'll be back anytime soon. The cheese wontons were too sweet for my liking, the beef lo mein was sadly lacking in beef, and the General Tso's Chicken had no kick to it. But at ~$20 for three dishes (General Tso's, beef lo mein, and cashew chicken) and an order of wontons, I can't complain too much now, can I?"}
{"text":"Note: This is not to be confused with the massage parlor of the same name. You will not get a little somethin'-somethin' here.   Actually, you will get something, something tasty.   A co-worker and Lawrenceville resident (no, he's no yuppie or hipster) told me about this new place, raving about their service and food. So I had to try it, but being that it's a ways down the street from my job, I had to do the pre-shift takeout thing instead of trying to go on my break.   I really had no idea what to get so I went with the Fried Dumplings (8 to an order), a pint of Lobster Fried Rice (they also come in quarts), and their Fried Chinese Donuts (10 to an order).   Now, as I have intimated before, I work with some...characters, colorful personalities with whom I clash. Spidey has arch-enemies. So do I. This cat is one of them.   Remember those old Hostess ads that appeared in Marvel and DC comics during the high 70's and low 80's? If not, here's one of them....  http://www.seanbaby.com/hostess/v2spiderman16.htm  Yeah, I gave The Crank one of my dumplings, and he was my pal for the rest of the day, thanking me profusely, asking me if they were beef or pork.   I'm leaning towards beef. They were very much like the dumplings served at Dormont's Amazing Wok in that the meat is rich, dark, deeply filling, and was wrapped in an artisan's potsticker. I always forget how much I love these apps until I have them again, and Lucky Dragon does them very, very well. Hey, if they turned a toxic, middle-aged co-worker into Alan Alda, they must be goshdarn good.   I've had Beef, Shrimp, and Chicken Fried Rice but never Lobster Fried Rice before, until today.   It wasn't bad at all. My only problem with the dish was that the rice and lobster were slightly on the dry side, but aside from that it was more than edible. I suspect they use langostinos instead of real lobster, but I like langostinos, so I can forgive the swindle.   Besides, a pint was only $4.95. Yeah. The 8 dumplings were $4.25.  10 awesome, freshly-fried little sugar donuts were $3! This is not a hoax or imaginary story!   Blame Cranberry's Dynasty Buffet for getting me hooked on the donuts. This has to be an Americanized thing, at least in part. Wikipedia sort of sets the record straight...  http://en.wikipedia.org/wiki/You_tiao  \"You tiao, you taste marvelous.\" That's what I'm gonna say to each one I wolf down when next I try them. Would that be weird? What an amazingly delectable and simple dessert fried dough can be.   Once again, Lucky Dragon follows a trend with Pittsburgh-area Asian restaurants in that with your meal, you can not only get eggroll, but also a cute kid to dote on. I think she was less than two. The grandmother held her as she waved to me. Heartmelting.   See, I think they use the kids as a marketing gimmick.   I'm glad I stopped in late on this rainy morn. I walked in from the gloom, found sunshine, and walked out with a touch of Heaven in those dumplings.   You should walk in also. Remember this R.E.M. song?  http://www.youtube.com/watch?v=iCQ0vDAbF7s&ob=av2e  That could have been written about the family who runs this restaurant.   I still can't stand R.E.M., but I dig Lucky Dragon."}
