{"text":"Lou's has great service and great food.  Their drinks are strong, but a little pricey for a neighborhood bar location.  Overall, a good place to grab dinner and have a drink."}
{"text":"This is a nice place to hang out as well as get a bite to eat.  The food is much better than your typical bar, and the drinks are generous and reasonably priced.  The service is excellent and if you come often enough, your drink will be served without you even asking for it.  Some of the kinks mentioned in earlier reviews have been worked out and Lou's seems to be happy to be a neighborhood joint where half the people in the place walk to it."}
{"text":"This is a true bar/grill and we liked it.  The zucchini appetizer and the fried dills were fabulous to start with.  I had the veggie wrap and it was really great also, fresh and tasty.  They have a lot of choices on burgers and sandwiches, which all seemed popular as we saw multiple different sandwiches being served adjacent to us.  Prices were average to slightly on the high side, but the food was good, service fast and friendly.  The 20 ounce very cold beers during happy hour really can't be beat!   It is supposed to be a sports bar, but it really does not have that feel, not many tvs, or loud groups. Great place, will be back."}
{"text":"My best friend introduced me to Lucky Lou's for lunch about two months ago and I've been back three times since then. The atmosphere is that of a bar, but don't let this discourage you from checking it out.   The service has always been spot-on. They are prompt with getting the orders in and with refills.  I've had a variety of their lunch sandwiches: California Chicken Wrap (twice; 4 Stars) - very tasty and generous with the chicken.  Turkey BLT (4 Stars) - this is huge and I couldn't finish it, but it was yummy.  Chicken Caesar Wrap (3 Stars) - too much sauce and lettuce, but otherwise good.  Their fries! OM Goodness, their fries! The seasoning that they use on their fries is delicious. It reminds me of Red Robin's seasoning and who knows, it might be the same, but I don't care, it is just SO good.  The prices on their lunch sandwiches are very reasonable - right around $7 which includes a side.  I've never been here at a time when I wanted to have a beer so I don't know about their selection, but I look forward to checking that out sometime.  They have a vast menu at reasonable prices which makes me prefer them over some of the other restaurants in the area."}
{"text":"Neighborhood establishment...been going there for past 4 years...food is excellent as is the service...have tried variety of items on menu...never disappointed. They have Blue Moon on tap and served with orange slice...very happy!"}
{"text":"This a great place, but don't come in on Friday unless your a regular! Waited on the patio for an hour and half to get a set inside, then while sitting at the bar waited another 25 min to get a drink and requested a menu and still waiting! This a great place, but they don't need any new customers, what they need is some competition! This area has to far places for to much business!"}
{"text":"This was the first place my family went when we moved to Mesa in October. We've been going there once a week ever since! Wonderful staff and great atmosphere. We've had Lori as our server almost everytime and we LOVE HER!! The food is great and usually comes out in a timely fashion. The chicken wrap is one of my favorites, and the friday night fish fry is to die for. We love going here and have brought all of our out of town guests here as well!"}
{"text":"Good bar.  Good draft list, reasonable prices. The pierogies are awesome. Lots of TVs if you're into sports."}
{"text":"First, I was told this place has excellent wings and my hopes were up, but the wings ended up being just ok. The burger I had was pretty good and their fries are perfectly crisp and quite tasty. However, where this place falls short is their service. We had 3 different servers for whatever reason and it seemed as if their communication amongst themselves was almost nonexistent. The wait on various items requested was unacceptable. I was even charged for a side of sauce I requested upon receiving my food, yet was delivered near the end of my meal, which made the sauce pretty useless. I was looking forward to coming back to this place to try out their happy hour, but I can't subject myself to such poor service again."}
{"text":"LOCALS LOVE this place! My husband and I have visited both Lucky Lou locations, Mesa & Chandler. We know Lou, the owner. We LOVE the King Creole, best homemade creole sauce ever! It's made daily and when it runs out, it's gone! It's a very authentic creole Louisiana sauce. The appetizer pierogi's are hand made by a Polish guy that delivers them regularly. The fried shrimp app and meal is also very good. Lou's has breakfast for football Sundays. Very good daily happy hour!!! Sports bar & restaurant yet still very family friendly as there are tables separate from the bar area. Lots of TV's for the sports lover and a great place to watch big games!"}
{"text":"Best wings we've ever had. They have an extensive menu including baked brie app, salads, veggie Philly and many other interesting choices. Service is always good. Bartender will suggest drinks if you ask and there is a patio outside as well. I like that the noise level is pretty low most of the time, despite it being a sports bar. There are televisions to watch your game and it's laid back. You seat yourself. Overall, great find that's on our favorites list. my one and only suggestion: ranch is always runny. Please fix the recipe. I love ranch with my wings :)"}
{"text":"I've been going here since they've opened.  Use to go all the time.  Moved away from the area.  Today I stopped in because I was close and couldn't pass up the opportunity.    I had the steak sandwich with Pepper jack cheese and Cole slaw it was delicious!    Service was friendly and fast."}
{"text":"Have heard great things so off I went.  Everyone was correct!!! Went there last Friday to check it out around 7pm.  Based on the amount of cars out front and being the time of year \"Snow Bird Season\" and the time of day I thought I would have to wait. To my surprise there was a table by the door and seats at the bar. The customers were friendly and helpful with menu and specials they have. I  sat at the bar and the staff was super friendly and again helpful and fast. As I was sitting at the bar I noticed there were only 3 cook staff!!!!  Those ladies sure do a GREAT job and put out some great chow to boot!!!  The bar staff was super friendly and fun. Think I found a new place to go and kick back!!!  Oh ya . .the prices were super cheap for the amount of food I got!!!  They also have daily deals so I'll have to check them out also"}
{"text":"Food was good,  service was perfect, and the drinks were faster than anything I've ever seen! This was my second visit.  First with a coworker and this time with my wife.  Not very often we grab a drink and some grub without the kids. So we expect to have a great time when we do.  Thanks for making that come true."}
{"text":"Small Bar with booths and tables (inside and outside).  Good and solid american bar food.  Fish fry on friday's and burger's that are very satisfying.  Lots of fried apps (Fried pickle chips - Yummaybe.. after one or two you're done) and and a decent kids menu.  OK selection of beer on draft.  Red Hook Blonde and 4peaks Kiltlifter were the only micro offerings.. or should I say Macro offerings.  Wish they at least stocked an IPA in bottle or put a decent pale ale on tap.  But, they know their audience in East Mesa and aren't trying to be something they are not.  Don't expect to be blown away, but it is fairly priced well prepared food.  You really can't go wrong and we haven't so we visit here at least 4 -6 times a year.  Recommended."}
{"text":"Everything is from local bakeries and butchers. Great staff and owners.  The ribs are greats and the steak sandwich is the best thing on the menu."}
{"text":"First visit was good. Ribs were great. Fried zucchini appy was fabulous. Good service, although the servers rotated, so we never knew who was going to stop by our table. Second visit: zucchini was soggy, French dip was ok but way over-salted. The biggest issue here is acoustics. It is UN-believably loud (and this was on the restaurant side with the booths, not on the bar side). Sure, I would expect that in a sports bar, but there was a very loud party that were SHOUTING at each other and basically took up the entire room, ruining it for the rest of the diners. This place is not big enough for that type of group, people were getting their checks and leaving. We might give the place another chance for the food, but I would not go there again unless they fixed their noise problem. Get some dividers or acoustic tiles, guys. Seriously."}
{"text":"I've only been to Lou's twice. After the first time, I was excited to have experienced this sports bar. It's nicer than, say, Zipps, nicer food, more comfortable, and smaller. The service was nothing to write home about, though. On my second visit, the service was TERRIBLE!!! I've never been so ignored at a restaurant! Nobody had a smile on their face, nobody asked how we were, and it was like pulling teeth to get another drink. After we received our food, nobody came around for a half an hour, when the busser came to clean the plates, from whom we had to get the check from. We will, however, be returning for a third time, getting a different server, to get a better idea of this place. I'm hoping the short bald guy, with hands in his pockets, walking around the place shuffling his feet will NOT be there next time. I'm sure my visit will be more pleasant and I will update my review then. For now, I feel disappointed."}
{"text":"Great food...blackened chicken sandwich and philly cheesesteak are both great...oh and they have tater tots :)"}
{"text":"This is a nice sports bar that's not dark and dingy.  They have OUTSTANDING food! Try the Chicken Diablo sandwich.....sooooooo goood!  I know it's weird for a sports bar to have shrimp creole, but they have absolutely the best I've ever had.....and I'm from the New Orleans area."}
{"text":"Worst service.... Had to ask for the  extra drink all night, after several pass bys from more than one server.  Very disappointing!"}
{"text":"We love this place, specials every day, a good beer selection, friendly help, and they have pierogi on their appetizer menu.  They are homemade, not Mrs. T's from the freezer section.  Inside is small and it is a sports bar so tV's are on.  They have tables outside, too.  After a few visits, they remember if you want liquor, beer, of just a soda.  They get to be like family if you go in regularly."}
{"text":"What a shit hole, I should have gone jack in the box for better service. Came in for lunch and it was pretty dead.  The 2 waitress working looked like that had a better time talking to themselves and looking at each other Facebook pictures. The blond hair waitress was eating  eating tattor totts off a customers plate and fell to acknowledge us.  This was the 1st  and last time I spend money at this dump. Change the wait staff to people that want to be there."}
{"text":"I will never visit Lucky Lou's again! The wait staff was overwhelmed so service was very slow. One of the appetizer plates given to us looked like it hadn't been washed.The food tasted alright but it gave me food poisoning! Before anyone says \"not Lucky Lou's\" I am certain! I work out regularly and watch my calories, in doing that yesterday 4/27/16 the only thing I had to eat that day was a post workout protien shake. I have these shakes all the time with no issues. I was saving my calories for lucky lou's because I knew we would be eating and drinking. I ate the jalapeño chicken wrap, mozzarella sticks and perogies. I've been in the bathroom no less than once per hour since leaving that place at 10pm last night. It is 2pm 4/28/16 and I still feel terrible. Beware of Lucky Lou's food handling practices.....you've been warned!"}
{"text":"I generally love Lucky Lous but they have been really hit or miss lately. Just got 3 chicken tenders the size of my thumb and they dont appear to be hand battered like normal... whats going on? Used to be amazed by how good these tenders were but this is pretty disappointing."}
{"text":"Disappointed. Met my friend for lunch for her birthday. Food was ok except we asked for ranch dressing and it never made it to the table. The waitress was not very friendly. I asked for the check and the waitress literally threw the bill on the table without a 'Thank you' and walked away. Not impressed and will not return because of the service. I can deal with food that is 'ok' ... but not poor service."}
{"text":"We happened upon this place a few years ago through a restaurant.com deal iirc, and while we typically don't venture quite that far for dinner/drinks (from QC), the deal was good enough to get me to look it up on Yelp and US for reviews and I noticed people mentioning they served perogies? Hailing from northeast PA, this got my attention, and made it worth the trip to give it a try . Apparently these 'loss leader' deals work, because we've been going back roughly once a month since.  Tucked into a random shopping center in NE Mesa, I imagine it's patronage is mostly local, but the vibe is inviting and comfortable. The staff is consistant and attentive (how cool/rare is it to see the same people in a rest/bar over a 2+ year period?). The place always appears very clean, they have a nice mix of big, comfy booths and hightop tables, and have a nice patio. Probably the only negative is a single, uni-sex restroom that obviously creates an uncomfortable queue during busy periods.  The food is always very good. The entrees are mostly sandwich-based, but definitely a step above what would typically be considered bar food. The aforementioned perogies are fantastic and would be downright dangerous to my calorie intake if I lived any closer. The Philly cheesesteak, while not 100% authentic, is close enough to have become a staple. They always have at least 4 outstanding, well-rounded craft beer options and offer 22oz pours as well as pints."}
{"text":"Do not try to bring a large group to this bar! We called a couple days ahead to inquire about reservations (they don't take them) and/or seating for 14 people on a Tuesday afternoon/early evening for dinner and the man who my wife talked to said there would be no problem. They wouldn't be that busy at 4pm. Happy Hour is 3-6. They were very busy and when one of our party arrived and tried to hold our tables 3 guys took over one of the tables and the waitresses could have cared less. So we (our party of 14) gladly left and won't ever return."}
{"text":"You will not find a better local bar. It's a if you walked into Cheers the show. Everyone does remember your name whether it is Robert, Kimmie, Jake, or the beautiful Sam, the service is unmatched. Love the place, the service, and the staff."}
{"text":"Great food. Love the diablo chicken sandwich. Everytime I walk in here everyone is laughing and having fun. I love the atmosphere. Service can be slow. They seem under-staffed"}
{"text":"You seat yourself & hope that someone sees you... Service was so-so and bartender kept flirting with my husband (he is good looking) which I thought was pretty rude. Food is good though."}
{"text":"Great burgers. It's a pretty busy place. I love the patio seating when the weather's right. Their pastrami sandwich and pulled pork sandwiches are definitely worth getting too."}
{"text":"I've been here twice, great decor, cute & really friendly staff, and lots of really nice people to shoot the bull with. I've heard the food is really good too, but haven't tried much of it yet. I did try the french fry basket, it was nice and huge, and the hot wings are good, they use Franks, so if you like reg hot, get the hot. Happy hour specials are a good value too. Will return often."}
{"text":"Food is very bland.  Zips is a half mile away and way better.  Old person neighborhood bar."}
{"text":"We love this place. You can't go wrong with a good burger with guacamole, bacon, and a fried egg! The hard eight. On top of that you won't ever miss a game on all the TVs  they have. Great place!"}
{"text":"This is our new favorite place for game watching. The food is fantastic and there is a wide variety. Love the buffalo chicken sandwich! Prices are reasonable and value is fantastic. I would recommend to anyone."}
{"text":"We just had dinner here and we are completely unimpressed. The burger my husband had was ok. The wings weren't crispy at all and judging by the way some of them were stuck together, they came straight out of the freezer and into the fryer. The macaroni and cheese from their \"Premium Sides\" selections was poorly made right out of a box (i.e., Kraft).  Won't eat here again."}
{"text":"Lucky Lou's is a favorite bar of many Mesa natives where we can come together in a peaceful atmosphere and enjoy each others company. Until this evening I had enjoyed being their patron and I am also local who attends this bar frequently. There was a guy there tonight, who I had only met on this evening, who came to the bar to hang out. When he arrived his motor skills were intact. Once emerging from the bar he was completely incoherent and had no motor skills. I went inside to alert the staff and they insulted me for bringing it to their attention as if I were somehow responsible for him! How could a neighborhood bar, or can I say a place much like a \"Public House\", which would be a compliment, treat their patrons with so little care! Not only were they insultingly rude to me, but they ignored this situation! Lucky for this young man that I was there to tend to him! I am completely offended that the staff would be so rude to me for taking care of one of their fellow patrons! It's hard for me to believe that their staff could be so reckless and destructive to their patrons and their business with their actions! Don't go here if you expect to be treated like a person!"}
{"text":"Great service! Went here for my birthday choice of restaurant and it did not disappoint. We had (keep in mind we table shared) tater tots, cheese sticks (with THE BEST MARINARA), the brie (only complaint, no flavor...B.L.A.N.D. don't order), boneless wings (honey hot awesome), turkey philly with jalapeños, chicken filly, the Diablo chicken sandwich and 1/2 burger. No complaints from anyone, and I am a picky eater. I do have one caveat, the red slaw was just pepper and vinegar based; I exchanged for fries but if you like your slaw like that, enjoy seems to be a favorite.   This place is just great all around, even as busy as they were we had great service, food was hot and good when it came out. I cannot rate this place high enough. Hope they keep up the good food and service!  BTW, the service can be attributed probably to the waitresses being experienced and not right out of high school.  Great job Lucky Lou's!"}
{"text":"Lucky Lous is a cool oasis with the temperatures outside rising. I stopped in for a cold beverage and a delicious buffalo chicken wrap.  Outstanding, (4stars)  This place is a nice locally owned watering hole. Staff is very attentive."}
{"text":"We've only been once so far, so I don't know if I qualify just yet to review Lou's, but I like to let the vegetarians know when I find a bar that actually has some choices for us.  They had a veggie wrap, veggie philly, and veggie burger and some appetizers that were meatless, too.  I had the veggie philly, and it was pretty darn good.  For the meat eaters, there's a lot of burger choices.  All in all, a kickback, friendly bar with tons of options."}
{"text":"We get take out every couple of weeks. We love their food. We haven't had a dish that wasn't delicious.  The food is ready quickly, fairly priced with good portions and the bartender is always friendly, even if they're busy, which seems to be always."}
{"text":"Drink were good bar tender made a specialty drink for my girlfriend. Cockroaches in the bathroom at least they were friendly and helped me wipe."}
{"text":"The food is delicious and the staff are wonderful . Great atmosphere! Best place to spend a few hours. It's my \"Cheers\" bar"}
{"text":"Great food.  Great Staff.  Great atmosphere.  This is definitely more of a middle class, blue collar sports bar, which is exactly why I like it.  Jeans or shorts and T Shirts, and nice friendly customers and staff.  If you're a smoker you can sit on the patio and watch TV.  Be sure to try the Diablo chicken sandwich with jalapeno bottle caps.  Add a cold beer and it doesn't get much better."}
{"text":"We try to make it here a couple of times a month. GREAT FOOD. Awesome \"neighborhood\" place, which is what I like about it the most. Everybody I have taken to Lucky Lou's liked it as well. Hats off to the ladies running the place at lunch time. They get you in and out on a lunch time schedule. Did I mention they have GREAT FOOD?"}
{"text":"Staff was friendly. I had their chicken tenders, asked them if they can make them hot buffalo chicken tenders. They were great! Nice and spicy. Their fries are really good too. Large portion sizes.  I will definitely be going back."}
{"text":"I've driven by this place for 2 yrs & finally gave it a try.  I am so glad I did!!  Burger was delicious, super flavorful & cooked perfectly.  Service was quick & friendly.  Will definitely be back!"}
{"text":"My wife and I like Lucky Lou's. It is usually busy when we are here, but we have never had to wait for a booth. The service is just right. We both like the chicken Diablo sandwich. Tater tots are crisp, mmm. The chicken fried chicken is good too. The atmosphere is comfy. I feel well taken care of on my way home from Lucky Lou's."}
{"text":"Went to Lucky Lou's this Saturday, and it was surprisingly quiet. For a non-steak place, we had a good prime rib dinner with fast and pleasant service. They even welcomed and brought out water for our 120lb dog. We will definitely go back again!"}
{"text":"Pretty disappointed with my meal.  Go there every few months and never had a complaint till tonight.     We saw it was prime rib open faced sandwich and I had it before and it was good.  My husband asked the waiter about the sandwich and he said it was a prime rib on a roll with gravy.and came with mash potatoes for $10.50.   That was perfect husband got that and I got the same except with salad instead of potatoes.   When our meal came out I notice the difference in my prime rib and his.  His was about a quarter of inch thick versus mine was like a steakum.  I wanted to show the waiter but he never came back till we were finished.   When I told him, all he could say was \"we r busy\", which they were, but I saw him talking to a couple for a while.  Then he brought our bill right away and I noticed we were charged extra for the mash potatoes, and I was charged for my salad.  When I asked him about the extra for mash potatoes he went to check and said prices went up and he wasn't aware of it, although their special board reflected the price quoted by waiter.  Overall I was very disappointed, been in there before when busy and still got good service and food.   Even the manager didn't come by our table as in past."}
{"text":"We went to Lucky Lou's for lunch, they have a good selection of draft beers. I ordered the pastrami sandwich the meat was piled high and the pastrami was as tender as you could ask for. Service was good the staff is friendly. We plan to come back for dinner sometime."}
{"text":"Love this place! Food always good and service amazing! Thanks  again for a yummy lunch!"}
{"text":"Went tonight for the first time. Waited 15 mins. For a drink. Appetizer of fried zucchini was to die for. When the meal came my order was incorrect. Took it back to the kitchen, my husband ate his meal then mine came out. It was a pork tenderloin sandwich. Went to put it together and no bottom to the bun. Really? Still left a tip which my husband said I shouldn't. Not sue if we will return. Very sad. Was really looking for somewhere new."}
{"text":"You can't go wrong with catching a game or meeting friends here. Service is very attentive, food is delicious! I highly recommend the steak sandwich! It's my go-to order every time I dine there. Many different brews on tap and multiple TVs to pretty much catch any game! The staff is highly attentive. Even the busperson is constantly clearing your table and removing empty glasses. We've hardly had a dirty table during our stay.  It's a little out of the way for me, yet I find myself visiting this place quite often. And we always have friends join us! Minor issue, is that sometimes the smoke from the patio wafers into the dining area. Really? In this day and age can we just stop with the cancer sticks and provide a smoke free environment? Did I mention that happy hour is until 7 pm? Who does that? Someone who wants your business that's who and this neighborhood gem is a pleaser!"}
{"text":"Before 10 pm, this is a good joint to take my family for good meal. Excellent variety of burgers, sandwiches, and terrific appetizers. I love the fried pickles and jalapeños. Post 10 pm its a good bar to chill--great to watch a game or talk in atmosphere where you don't have to shout."}
{"text":"We tried this place for the 1st time based upon the recommendation of someone we know. The waitress was super friendly and was happy to offer suggestions when she learned it was our 1st trip. We decided to try the shrimp basket, based upon our friends RAVING about it, and I went with a burger based upon the reviews on here. We enjoyed both of them, but my husband commented that she felt the price was a bit high on the shrimp basket for the 6 shrimp. We were enjoying ourselves...until the bar day shift people started counting the cash drawer behind us. We heard a loud conversation on the drawer being short, and conversation on who and when this could have happened. Sitting out on the dining floor doesn't seem to be the best place to have this conversation. The  cincher was hearing the last line of how one of them avoids dairy as it makes them sh*t. SMH. The food was good, but the conversation was a bit of a turn off, and this probably won't be a 1st choice spot for us."}
{"text":"I am not a small town go sit in the Cheers bar and drink kinda girl. This is the place my husband would take the kids for dinner on nights that I had other plans. This went on for about three years. One day, a few months ago, my husband asked if I wanted to meet him for lunch. He was already at  Lucky Lou's when he called me, but because I had already eaten and he had just picked his dad up from the airport, (His dad just flew in from Chicago for a visit) I would meet them and get a little bit of chat time in before we had to pick the kids up from school.  I asked my husband if they served diet coke, because I don't go Anywhere they don't serve diet coke!!! He said they did so I was on my way.    30 minutes later I was hogging down my husband's Philly cheese steak sandwich and fries!!!!! OMG!!! It was amazing!  I could hardly move when I left! The diet coke was delicious too!  I could not believe how friggin delicious that sandwich was!  Ever since that day I get mad if my husband goes there for dinner with the kids on the nights I have other plans. I am addicted to their Philly sandwich and the buffalo chicken sandwich. The fries are Rediculously good!  And every time we go the staff is always so nice and friendly. It really is a lovely Place.  I love you Lucky Lou's! I am truly the lucky one!"}
{"text":"This place is always so welcoming!  Anything they can do to make sure your day is great, they do.  Bean dip is amazing!  Southwest egg rolls are fantastic!  Drinks are always wonderful!  You guys rock! Keep up the good work!"}
{"text":"One of my favorite places in the area.  Large variety of menu options and friendly wait staff.  I especially recommend the Chicken Philly, Chicken Quesadilla, or The Hard Eight with a side of tater tots.  Several lighter salad options also available.   Go during happy hour for drink specials."}
{"text":"Was going their on and off to try the place out  kinda liked the place at first.  Until we got Flat beer and I told the waitress to check the keg.   She ignored me and left us with the flat beer. I asked her again to check the keg,  Me and my wife know our beer.   She mocked me with one of the bartender saying this guy keeps telling us to check the keg. We drank 1/2 of our flat beer and left.  Also some of the regulars are a little over the top. Haven't been back since, that was 2 1/2 years ago from this 3/9/16 update.  We have many places to go to that would have changed our beer out right away and apologized for the flat beer. So I wonder how many customers they have lost being arrogant,  and not trying to help a customer with a little service.  I will do the waitress a favor and not mention her name.  I would be surprised if she is still their,  I'll never know."}
{"text":"A great place to get a drink, and the food is good.  Cathy is gorgeous, and friendly as is the rest of the staff."}
{"text":"Took the family here for the first time. It's in our neighborhood. The service was slow at first but our server was awesome in the long run.   My wife had a good Philly cheese steak, I had the fried cod which was good, and the kids had the pasta from the kids menu.   We had boneless buffalo wings and they were amazing.   We will return, next time without the kids, for a couple cold beers and some more of those delicious wings."}
{"text":"Always enjoy this venue! Disappointed this afternoon when attempted to make a reservation for this Saturday! This web site indicates you take reservations... The person answering the phone says you have never accepted reservations! So discouraged! We MAY attempt to bring our out of town guests without assurance of being able to dine here!"}
{"text":"Came here on a Friday afternoon. My boyfriend ordered hot wings and I got the classic chicken wrap with fries. The environment here is an older crowd. Seemed very masculine. The outside patio area seems outdated and is usually filled with lots of smokers. I felt a bit of that snuck inside. There are lots of tvs and our waitress was nice. Food was okay and service was quick. Nothing amazing but not bad. If you're just grabbing a beer and want typical bar food this will suffice."}
{"text":"Food is just ok. Servers and bartenders are good though. Good location and drinks are poured the way it should be."}
{"text":"I've always wondered about Lucky Lou's. Usually when going for lunch at Yogi's or Culver's. So I've come here for dinner and drinks. First off, they have Summer Shandy on tap. That's a plus. Second - they know how to make a snakebite. Funny thing though - even though they have condiment holders advertising Blue Moon they don't actually have that on top. Maybe they were thinking - Blue Moon makes great condiment holders even if the beer is shite. Who knows? Didn't bother to find out although I bet it makes a great beertime story. So as far as food goes I've had the 911 wings that threatened to be hot. Pssh. Not a contender. Not even close. Should call them the 411 wings. Call 411 and get a better recipe. One item that is worth getting is the pirogies/pierogies/pirogis - however you spell it. It's Polack comfort food and this place makes it right. Sorry Pittsburgh Willy - this place does it better. Juicy bacon and onions on top and sour cream on the side. Clientele - lotsa older couples come here for grub and drink so it feels like a neighborhood pub. Piped in classic rock played each time I was here - no TouchTunes jukebox or anything like that. Pretty much food and grub only - if you want rawdy raucous craziness eat your meal here first and then go to your other place. Lotsa parking in the mall shared with America's Taco Shop, Yogi's, Culver's and Scottrade. Will definitely be back."}
{"text":"This was our first time here and we had a great experience! Fantastic food, quick service and ICE COLD beer!!! We will definitely be back! High quality sports bar with extremely realistic prices!"}
{"text":"My Stepson brought us here, 'cause of the decent food, great value, very friendly staff, fast service, many TVs, pool tables & good friends ... what more could you ask.  Try the grilled Chicken breast with 2 sides (I get double broccoli)... not fancy, just a great value and healthy alternative to the typical bar food found at other places.  We drive from SE Gilbert to go here. As Mikey's brother always said... \"Try it you'll like it!\""}
{"text":"3 stars is A-OK and this place is A-OK, I am not sure I am a fan yet (but my friend is).  We tried this for a Saturday burger and beer stop based on Yelp reviews ( we have a few favorites plus we try new places).      The place isn't quite divey but it looks like a real bar and is decorated in a gambling, Vegas theme.  the bar is nicely decorated.  The place gets a lot of regular locals that come in to drink.  I haven't seen Jager poured before noon before, but that happens here on a Saturday.    The staff were ok, but didn't say anything about specials, and were a little aloof.  One waitress with ample exposed cleavage was complaining about patrons watching here while she worked ?!?!??!    The tap selection is decent.      I had the chicken sandwich  \"the boss\" something or other and my friend had the shrimp.  We both had  the red cabbage slaw and we split some fries.  My sandwich was great, the spicy mustard was good and not too spicy. The chicken was tender and well seasoned.  The bacon was burnt on few of the ends and was unremarkable but the ham was good.    My friend really liked his shrimp and the red cabbage.  I thought the cabbage could have used a bit more flavor but I cleaned my plate.  The fries were crisp with only a slight oil taste.  The prices seem very good. and a bargain for the quality.    We will definitely try this again, and I could see easily boosting it up to 4 stars."}
{"text":"Lous is a neighborhood gem located directly of the freeway. Food is better than you'd expect...it's kind of got a sports bar vibe but not totally...I do wish there were more drink specials and some sort of darts or billiards to really make it more fun on a slow night."}
{"text":"food poisoning from a medium rare hamburger. 'nuff said.  excuse me while i go visit the porcelain god again. ugh."}
{"text":"My husband and I can always count on Lucky Lou's.  It consistently has great food and the wait staff is awesome!  It reminds me of Cheers, everyone knows everyone else and the wait staff remember you, what your favorite drink is and are always warm and friendly.  Did I mention they also have Four Peaks Kiltlifter on tap?    The bar is always full and multiple hightop tables, lots of TV's showing the current sports events.  The decor is 50's Las Vegas theme, with pics of the Rat Pack, and flashing lights and slot machines on the shelves.  Check it out, you won't be disappointed."}
{"text":"Wow.  I'm surprised at the negative reviews.  We have been here about 3 times this year and it is consistently good. The food is good and wine portions are good and the beer is cold.  It can get crowded on Friday for Happy Hour. It is a good neighborhood bar.   And, there is some good people watching. There is another bar at Ray and McClintock called Zipps and it is good, too."}
{"text":"The food here is really amazing for an independent restaurant. The staff at the bar is a 10 out of 10.  I wish they had more locations! You will not be dissatisfied, don't judge them based on the rush at happy hour, they are slammed"}
{"text":"This is one of those places that you walk into and it just feels like a local place. The staff is welcoming, they have a great variety of beer and a nice food selection on the menu. One of my favorite side dishes is the pasta salad, I seriously could just eat a whole bowl of it. Spiral pasta with fresh broccoli, olives, and Italian dressing, it is simple but so tasty.  They have plenty of tv's so you can watch any sports that are being played. There is also patio seating."}
{"text":"A friend ordered food to go and asked for there to be no pork per his religious beliefs and when he got home he opened the boxes and there was a ham sandwich and a grilled chicken sandwich with bacon on top. When he returned to get his money back, they refused.  THIS IS NOT OK."}
{"text":"Awesome burgers cooked to order. I'm talking rare is rare! I suggest the croupier if you can handle the freshly sautéed jalapeños. The salads are great, I've had several from the menu but the Caesar is the best.  The beer is ice cold and the bartenders are quick! Great service and great food!"}
{"text":"Food is not very good and they never change up their menu or soup selection. Employees seem like they don't want to be there and there's a ton of gossip behind the bar for us to hear. Don't think I will ever step foot in there again. my experience wasn't so LUCKY"}
{"text":"Good food. Decent portions.  Somewhat slow for not being that busy.  I love the huge soda cups so we don't have to get a refill every five minutes.  Had great special happy hour prices."}
{"text":"They make damn fine burgers - yes delish bar food - get the broccoli as your side, you will not be disappointed.  The quesadilla is pretty good too.  Strong drinks, good burgers, great service!  Winner in my book."}
{"text":"Friends suggested this casual dining experience, recommending the Veggie Philly sandwich. Super yummy. We've been back several times. Friendly service, always good food."}
{"text":"Great food great staff very relaxing atmosphere very clean. I had the French dip which was very good my wife had some type of chicken sandwich that she loved"}
{"text":"This is such a great little neighborhood spot! I've been here several times since we moved to Mesa and service is always great. Food is great! I haven't had a dish that I didn't like and I've had a variety from their menu. If they forget something or make an error they most definitely make up for it before you leave. That's really all you can ask for!"}
{"text":"We have come here a few times, but we forget about it. We came in recently for dinner. It was loud because it was Friday and happy hour. We didn't mind that too much. I was very impressed with the fried zucchini appetizer. It was huge! We split a large salad and a sandwhich. Both were decent. Service was pretty good- I liked that they had employees running food - it shows great team work, and our food was hot when it came to the table. The one thing that really bugs me is they charge for extra ranch and dressings. We asked for extra ranch for the zucchini (and we needed it) and extra dressing for the salad since we split it. There was no way one small thing of dressing would have come close to being enough for the size of the salad. So I get annoyed when places nickle and dime you to death like that. For goodness sakes- I am spending 10 plus on a meal- ya think you can throw in an extra dressing? Geez!"}
{"text":"The people that work here are all absolutely amazing, we have never had any complaints ever. The food is delicious the service is fast and the beers always cold. They have a great outdoor seating area TVs all over if you haven't visited Lucky Lou's then you sure are missing out. The wife and I come to Lucky Lou's at least once a week whether it be for lunch or to hang out and watch the ball game. Great place ! If you haven't been yet try it today."}
{"text":"Excellent service, excellent food, great locally owned place to eat & bring out of town guests. Great atmosphere. Clean. Staff is cheerful & helpful & knows the menu well. We had an excellent experience, food was great, felt great the next day. Fresh & yummy!"}
{"text":"My husband and I ate at Lucky Lou's last night and the food was great.  The staff let us know that happy hour was still going so we got $3.00 20 ounce beers.  I had a salad and pork tenderloin sandwich and my husband had a shrimp appetizer basket.  Everything was fresh and absolutely delicious.   We met Jake who was very friendly and he took time to answer my husband's questions.   All the staff was great and I highly recommend you give this place a try."}
{"text":"This is our neighborhood spot! We love the cheap happy hour and food specials. Everything I have ate here was amazing. Good ribs.. Love the turkey Philly, and amazing amazing fried chicken and mashed potatoes! Side salad is full and good. But when it comes to chicken wings .. I just don't understand why they can't do two different sauces??? And sometimes the wait staff is super rude about it. I'm a server to so I understand and always nice. But they'll be like Nope sorry one sauce. Why!?!? Bars are known for wings!!! It obviously frustrated wait staff.. Anyways. The guy bartender has always been rude not the nicest, sure Ya his personality im sure. But it's okay. Overall we like this place a lot always come. But the wing thing the owner should fix."}
{"text":"Great burgers!!!  This is our local bar/grill. We eat here a couple times a month. Great food, drinks, & wonderful staff. Its our \"Cheers\". The burgers are great! I highly recommend the one with blue cheese & bacon! Yum. The veggie wrap is very good too. Best part? For a dollar more upgrade to the tater tots! Don't bother with any of the grill chicken dishes tho, unfortunately it's always under seasoned & bland."}
{"text":"Great neighborhood bar, staff is always friendly. The crunchy jalapeño chicken wrap is delish"}
{"text":"This is the best place ever!! Food is always on point! It's like the show\"cheers\" when we walk in the staff knows we're sitting outside and two bloody Mary's spicy! It's home!! Try this place and you won't be disappointed!!"}
{"text":"Remember \"Cheers\"??? Ya know? - the tv show? Well, Imagine walking into a place where everybody knows your name,  right here in Chandler!! I've been here numerous times. Great people, customers and staff. Monday nights Chicken Enchiladas $12, Chips &  Salsa $3. Allie is so cool. I love seeing an employee so excited to tell you how amazing their food is ~ AND IT IS! Who is in that kitchen??? Oh! I'll find out! Everything is HOMEMADE! Kyle and Jen are Superb! They always just know what you need. Even if it's off-menu, they've got your back. There's a motorcycle club that meets here every week on the patio. Amazing group of guys ~ they support cancer & children causes... It is Good to unwind in a place that perpetuates Happy Vibes"}
{"text":"Lucky lou's does pub grub well and their portions are huge. We had burgers and kids meals and salads at our table and everyone was very happy. Again, the portions are gigantic so you might consider sharing. I had the Thai chicken salad and if I did get a salad again, I would definitely get the dressing on the side, as it was a very generous amount of dressing. The atmosphere was more like a sports bar (which, to be fair, I think it is).  They had some beers on tap and several different happy hour times.  Also, our waitress was very patient and helpful!"}
{"text":"I love a good neighborhood bar. I try wings almost everywhere and these are the best wings I have found in the valley!!! Buffalo Wild Wings move over. Lucky Lou's wings are SO good. The burgers are good. The servers are almost all amazing and friendly. They always switch the tvs to a game I want to watch. Love this little spot for sports, great wings, and beer!!"}
{"text":"Another great neighborhood bar and the food is great!  The staff all work as a team so your drink is never empty and service is spot-on."}
{"text":"Great food and service! This was our 1st sit down meal on our road trip through Arizona. We each had a 4 Peaks Kilt Lifter. Really good! We then shared the French dip and the Buffalo chicken sandwich. Everything was delicious! I think the French dip was my favorite, but that was also the 1st thing I ate after a long car ride so I might have been biased. Lol."}
{"text":"I have been going to Lucky Lou's for about 10 years and it is one of my favorite spots. Over the years I have probably eaten most of the menu and it is all good. Favorite items would have to be the turkey and bacon croissant sandwich or the hard 8 burger. Good selection of beer and liquor and a nice selection of rotating seasonal beverages as well.   The staff for the most part is excellent. Robert, Sam, Max and Brian are the go-to crew at night. I rarely even have to ask for a refill and there is already one in front of me.  Not the best spot for sports as there are only a handful of TVs here, but the staff is usually willing to switch a specific game on for you.  This is definitely a 'regular's' spot, go in a few times and they will not forget your name!"}
{"text":"This is one of my favorite local watering wholes the staff is absolutely awesome. The food here is great and they have some sweet happy hour specials even on Saturdays. Thanks lLucky's"}
{"text":"Lou finally put the chicken fried chicken on the menu. Had it with the garlic potatoes and veggies. Great meal. The food here is great for bar food and the staff are great. Never had a bad server. You always feel welcome here. Think if it as a Cheers bar."}
{"text":"Checked out Lucky Lou's for happy hour last night.  I can't say that they have the best happy hour I've seen.  The good beer wasn't on special at all, and their \"domestic\" beers were all pretty much the crap I won't drink.  They also don't have a beer list to offer, so you had to try and remember everything the waiter said.   The service was good, and friendly, and the food was decent, and not too expensive.  One way I judge a happy hour is by how long we are there for, and this never turned in to happy hours.  I'd need a special or something really compelling to go back."}
{"text":"Only Bar close to me open late! I love that and the bartenders are pretty awesome:) also...dog are allowed on the patio! Ayoooo!"}
{"text":"I've been coming here for 8 years since it opened and we were often the only customers. These days it's pretty busy and that's why we no longer dine here here with our family, it's just too hard to find a table at dinner time. That's not a bad problem for them though. The food is good, the beer menu is good and the service is good (unless it's dinner time or happy hour). Whenever we walk in and see Kyle behind the bar though, we know it's going to be a good night."}
{"text":"Good place to hang out with friends and the boyfriend. Ordered me a cheddar burger, medium well, with fries and oh my gosh! Not only did it come out quick but the burger was cooked to MY liking and I loved every bite! ^-^ I have a happy tummy. My boyfriend got the French dip and he annihilated the plate. Overall the place is clean, great service and the atmosphere is very welcoming and chill. Will definitely be back because I live down the road."}
{"text":"Great place for \"girls night out\".  Food is good, like a neighborhood bar! Everyone knows everyone and very friendly!!"}
{"text":"Came here after a day of wild flower hunting in the Superstitions- it was a Wed. so all of us ordered the baby back bbq rib special.  Not especially memorable.  What I did like was the cole slaw made from purple cabbage and vinegar with some black pepper.  No mayo, extremely light, healthy and delicious.  The cole slaw was the saving grace.  This place was so unmemorable to me that I forgot the name of the restaurant and had to do a search for bbq in Chandler.  When I can't remember the name of a restaurant, that tells it all"}
{"text":"Service is terrible. Food is less than edible. Took 15 to get a draft beer, not to mention we had to ask for menus and wait an additional 35 minutes for dinner. Do not come here."}
{"text":"The first time there my wife ordered a pastrami sandwich at the advice of a server. The sandwich came with almost no meat on it. When we complained about it all the waitress had to say was. \"you should have come earlier, they put more meat on earlier in the day.\"   We decided to give it a second try, since the bar has a lively atmosphere. I asked for catsup for my fries and my wife wanted ranch for hers. The catsup never came and they charged us 50 cents for a tiny amount of ranch dressing. You have no particular server at this restaurant.  We never had one server show up at our table more than once.  They won't get a third try.  Sorry guys, get your act together."}
{"text":"my wife and i went here last sunday because in mesa az its a sports bar or nothing every thing as usuall was fine the burger we split was good the beer was cold nice selection of brew on tap then my wife said lets get the sw egg rolls 7.95 $ out comes the 2 egg rolls smaller than the small ones you might get at a chinese restaurant served on a wilted bed of cabbage I dont know if they make them there or buy them pre made me thinks they buy them pre made but seriously 795 how about 495 tops for these mediocre apps ......"}
{"text":"Great food and oustanding customer service!!! The guys here are really awesome and always take care of you!!! They are incredibly dog friendly on the patio!! This is my favorite bar to go to!"}
{"text":"I'm a big fan. I was here last Saturday and had the best Bloody Mary I've had in a long time. I always forget about this place since it's kind of out of the way and not part of a large corner or strip mall area.  It's a nice, well put together sports bar that is clean, and not over the top.  The bartender (I think it was Kesha) and servers have always been friendly and on top of things. The fried pickles are super yummy and the salads are HUGE.  Our food has always come out timely without any issues.  Decor matches which is always nice since most places are hodgepodged together.  I haven't found anything wrong with this place really. Turkey cheese steak is awesome and so is the Pit Boss.  I recommend it as a nice neighborhood sports bar."}
{"text":"The shrimp flat bread was fantastic and so were the hot wings. Sat at the bar for the nba game 4 finals. The place wasn't too busy but the bartender was literally attached to some guy sitting next to us ... gave us menus but didn't offer to take our order once drinks were served , didn't even notice we wanted to place an order until my fiancé had to get her attention. 5 stars for food but the whole other thing going on next to us was just a bit \"eh\""}
{"text":"Pretty decent place. Beer is cold and the service was very good. We sat outside on the patio. Only issue was the patio is for chainsmokers. So if you don't love cigarette smoke this probably isn't the place to go. The smokers were all sitting within a few feet from the door So there was really no way to avoid the smoke."}
{"text":"Gave this place another shot with my wife.  Food was ok, good wings.  The crowd herr is very strange.  There is a very clear group of older aged regulars that make this bar uncomfortable.  My wife and I almost felt unwelcomed and witness people  being asked to move (and leave!) to make room for them. The layout is also strange and isnt very good for large groups.  Theres many other better options within a mile..."}
{"text":"Maybe it's because it's convenient and easy, but I am going to give Lucky Lou's four stars. Would I drive more than a 10 minutes to eat there? Probably not. However, the service is always good and the food is better than average. I especially enjoy their hamburgers, the caesar salad, and the buffalo chicken sandwich. I have also tried their fried pickles and they are worth the calories. However, I would not bother with the other appetizers unless it is happy hour because they are overpriced and underwhelming."}
{"text":"Great food great service! I come here often. I love the selection of appetizers!  I normally get the burger with pulled pork over it. Never had a bad meal. There is a large patio with heaters in the winter and misters in the summer.  It's a great local bar and restaurant!"}
{"text":"Average American bar and grill, food from a bunch of ethnic backgrounds but not made the way I had hoped. Fried pickles are good.  Service was great and non-alcoholic drinks are large.  Small place with a ton of regulars."}
{"text":"Went on Tuesdays for T-bone special and it was fantastic. Very friendly staff with great service."}
{"text":"Amazing place to unwind. Shaina and matt deserve 5 stars just for personality and service.  We love the food and atmosphere. Will go back over and over for food and service"}
{"text":"For most members of my family, picking a restaurant at which to eat is basically like making \"Sophie's Choice.\" So we rolled the dice with Lucky Lou's for lunch. It was a great choice. Service was great, attentive but not intrusive. Food was tasty... I'm not a French fry fan but theirs are delicious! And they have a great beer selection. Highly recommend!"}
{"text":"Great neighborhood bar!!  They have a very diverse menu with extremely reasonable prices.  I have tried quite a few menu items, and have not been disappointed by any of them.  I love that their drinks happy hour runs a little later than most going until 7.  The staff is friendly and knowledgable about everything they serve.  There are a lot of TV's if you want to watch a game, and a fantastic patio for when the weather is nice."}
{"text":"Food is great, staff are friendly, would recommend to anyone. They have good specials daily. Prices are reasonable."}
{"text":"Lucky Lou's is a great restaurant with a fun, laid-back atmosphere.  My family and I come here almost every week and we love Lorie (our waitress we always have). The food is good, depending on what you get. It's not fine dining but it's good. Go for dinner one night and check it out."}
{"text":"Great food and fantastic staff.  Been going there since they opened and love it. Great burgers and chicken sandwiches, if your there on Fridays, the fish fry can't be beat.  I am not much of a salad guy, but the Southwest Chicken Salad is more that enough and is great!!"}
{"text":"Went to the brand new location in Queen Creek (no yelp page for it yet) and had a great time. Waitresses were great and had a great sense of humor as well.  Food was awesome, we had a group of 8 and we will all be back again.  Kind of disappointed I hadn't been to this place sooner!"}
{"text":"First Time here at Lucky Lou's. Pretty decent hidden gem to come to for a quick lunch. Enough TVs for games and they open at 930 on weekends for football. Staff was nice and cool to joke with. Don't try to make any modifications to your meal cause the answer is no. I had the wings and they were decent. Was told they would be grilled but they were fried and finished on the grill. Honey hot was good, parmesan was below average. Overall a great experience. I will return for a game soon. Solid 3 stars."}
{"text":"Absolutely outstanding service and excellent american style food.    Great salads, sandwiches, and burgers."}
{"text":"Went to yelp to find a good fish fry, and we found it!   Excellent food, superior service! We will be back"}
{"text":"I had a great time at this little bar, prices are reasonable and the staff very competent and friendly. They have a full bar and some really tasty craft beer on tap. I was particularly fond of the Hop Knot IPA that came to me in a frosted 22 ounce glass. I really enjoyed my fish and chips and the size of the portion was almost too much. That was definitely not a complaint! They have a great outdoor patio as well."}
{"text":"My wife and I stopped in there today for lunch. After walking in and standing at the hostess stand for two minutes while servers walked by, we had to stop someone to ask if we should just seat ourselves. They said yes, though a sign would have been nice.  We found a booth and sat and talked, watching the staff walk by repeatedly and tend to every other table in the restaurant. We never got a menu or drinks or water. After 10 minutes of being looked over, we got up and walked out. I just don't feel that, if I'm coming to YOUR place of business, I shouldn't have to beg for service."}
{"text":"Great food, very clean bar and AWESOME emoployees!!!   My boyfriend and I love to come here for a cold beer and delicious food. Yes its bar food but its always delicious and cooked just the way we order it. The stafff is always friendly and fast with service and make you feel right at home.   There are so many bars out there these days that dont take pride in their food and only focus on the alcohol side of the business but Lucky Lou's cares about it all!  Love this place, we are regulars and will continue to be!!"}
{"text":"This place is your typical strip mall sports bar with slightly better food.   The restaurant itself was pretty small but there was a decent size outdoor patio. While our server was friendly, he was extremely slow. At the end of our evening we kept waiting for him to come back around to bring checks, however he seemed to have disappeared! At one point, one of the couples we were with just left what they thought they needed to cover their tab and left:(  The food was surprisingly better than normal bar grub. I ordered the philly and my husband ordered the fish fry and both were delicious. Our friend had the buffalo chicken sandwich and it too was good, although she thought it was a tad too spicy. Skip the bean/gauc dip, you could make better at home."}
{"text":"Great place to go, I love the night staff and the food is amazing. Great place to hang out after a long day"}
{"text":"Lived in the area for a while and thought it was time to give this place a try. Menu was typical for a sports bar, burgers, sandwiches and such.  It was a Friday evening so it was full but not over flowing.  Pricing was very resonable, but quality was mediocre  at best.  I wouldn't say avoid going here, just keep expectations realistic.  My 3 star rating is not meant to be negative, just truthful."}
{"text":"My favorite neighborhood bar & grill! Some of the best burgers around & lots of different kinds of beer on tap. Friendly environment & wait staff :)"}
{"text":"wuings seemed to have been frozen for a while the flavor was off, the burgers were good and great happy hour pricing"}
{"text":"The place itself was interesting and Las Vegas themed through out.   Service was a bit slow sometimes so once again another restaraunt i am not blown away by at all as far as our waiter/waitresses. We had gone with a lot of people for a fantasy football draft party type shin-dig. But you would think if a waiter/waitress has a big party they would want to work it to their best effort by making sure everyone is satisfied.  A lot of people were getting annoyed by the waiter forgetting about their drinks or not coming around often enough.  Lets get to the FOOD: i had ordered a turkey burger \"The gobbler\" to be somewhat healthy for the night.  It came out piping hot! awesome.  But...The turkey was bland. my mustard, ketchup, and pickle made it better but nothing Rachel ray mouth watering gurgling noises came out of me at all. I was starving so you would think with me being starving that someone definitely would have heard some sort of a mmmm oh my god yumm of some sort. Nope. None.  Tasted like i could have made the same thing for the same price but made 4 burgers instead even though it wasn't stellar.  My boyfriends buffalo chicken tender sandwich looked more mouthwatering than my plate. The fries were decent enough and i happened to steal off his plate when he wasn't looking.  I had ordered the red cabbage cole slaw which was awesome too especially with the french fries! YUM. Those two things together were awesome! Not too many beers on draft. Disappointed with that for sure.  If we go to this location again with friends i will definitely order something else because everyone elses plate looked more amazingly mouthwatering than mine. :("}
{"text":"A friend recommended this little neighborhood bar down the street from where we live. Russ was our server and he was excellent, recommended customer and personal favorites and provided excellent customer service. Their menu is quite extensive so lots to choose from. I got the steak kabobs and a salad and my boyfriend got the Philly Cheese Steak, both were tasty and hot. They also serve coke products which is always a thumbs up! The was another gal there also assisting Russ and she was really friendly and filled drinks, etc. The place was clean and laid back and at 9pm at night had quite a few people there which was nice to see. Zipps is probably the closest bar similar to this place without the obnoxious staff or loud crowd...needless to say we don't frequent there but we  I will absolutely be going back to LUCKY LOU's... and would recommend this place."}
{"text":"First time here and despite the loud atmosphere the food was exceptional. The shrimp is the best I've ever had. And the wings are the best too (so says my picky husband). So go there. You'll enjoy"}
{"text":"Great local bar / sports bar! Great food, with a different twist & options than at most places!! Great place to hang out with friends for a few drinks or dinner!! Very friendly staff!! it is a must try!!!"}
{"text":"Decided to try it as it's close by and an alternative to my normal place Zipps right around the corner.  Walked in to a customer yelling at the top of his lungs threatening to beat another bar customer up in front of his mother who was ordering food from the bar.  The staff decided that looking at the floor and bussing tables was more important than controlling the atmosphere so we looked around for a few minutes and decided Zipps was a much more mature alternative.  Can't speak to the food, drinks, or service since we left but if you're looking for a place where a bar fight doesn't seem to concern the staff or the customer's too much...this is your place."}
{"text":"First time here...not a great experience at all.. very unorganized and slow.. the girl tend more to the men at the bar then the woman and child sitting in a booth... haven't eaten anything yet because my food still hasn't come out!"}
{"text":"Ok...not once have I walked into Lucky Lou's did everyone in the bar scream MEL!  Yet, it's only been my 4th visit and I live just down the street.  It really is a neighborhood bar and they do have a pretty decent happy hour special.  Staff was very friendly and ready to serve. I really have to think Lucky Lou's, Lucky Lou's to remember to visit this place.  But, I don't get it...it's not my favorite place in the area, the outside view is a parking lot, the food is okay, typically bar food, but next door has great Thai and on the other side is a decent Mexican food joint.   It is in my neighborhood...so I will support this establishment....we need options.  See you next quarter in 2013."}
{"text":"My mission, should I choose to accept it: 1. Find a lunch spot for the baseball team, 2. It must have TVs for football viewing, 3. It must have beer on tap, 4. 9-12 smelly ball players have to be able to just walk in and not be out of place, 5. Must be near Autrey fields and be in Mesa to be logistically neutral for all the guys, and the most important 6. It has to be better than Flickas (someone else's suggestion for dinner the night before.) No pressure or anything.   No problem. Nothing yelp cannot solve! Just drag the map and look for something that sounds like a sports bar, but that has good reviews and appears to have good food. Ah, just the place and only a couple miles away. Perfect.   So, myself and a lot of sweaty baseball players ventured on in. Nobody got lost and it was not crowded at all, so we could all just walk in and sit close enough together in the bar at the tables. A clean place with a nice looking bar and lots of TVs in just about every direction, all with football. Each person sat themselves accordingly.   There seemed to be quite a few beers on tap, I heard no complaints. Those of us not drinking, got cokes and iced teas. The waitress was great. She got all the drinks taken care of, even seconds and refills, and then was back to take the food orders. Some got burgers, others got things less like bar food. We ordered a Philly cheesesteak sandwich, southwestern eggroll appetizer, and a chopped chicken salad. One of the other guys even ordered a Blackened tuna salad. The options seemed like they covered the range of bar food and well beyond.   The food was very good. I loved my salad and the southwestern eggrolls were delicious. Just enough spice to them to make it really good. All of the guys seemed very content with their food and I got the thumbs up for my successful find (filling all requirements.)   The prices are a mid range for bar food. Two non-alcoholic drinks, salad, sandwich and appetizer were around $36 with tax and tip. Not cheap, but not super expensive.   Thanks yelp."}
{"text":"I'll admit upfront that my review is probably a little biased simply due to the excitement of discovering a newly opened bar and grill practically in my back yard.   That being said, it was great to go to lunch today and discover that Lucky Lou's is good! Very good!  If you're from the East Valley, you may already be familiar with Lucky Lou's, this was my first experience though and I am excited to have such a good place near by.  The first thing to hit me walking was the layout and decor. Usually, I'm not the kind of person who really cares one way or another. As long as the place is clean, I'm good. With Lou's though, I was really impressed with the fun atmosphere, theme and design. The bar has a glass top, with different gambling table mats arranged underneath, complete with cards and chips. It's a great touch.  The food was good too. They're on the lower end of the $$ scale. A burger and Guiness cost me about $14. I don't recall seeing anything on the menu more than $15 or $17, but I did notice that everything was offered in a generous portion.  The service was fantastic. Attentive and friendly staff complimented by the manager who gave me a basket of fries on the house to go with my burger and side of pasta salad.  They have happy hour M - F from 3 -6 and Sat,Sun from 12 - 6. In addition, they have $3 drink specials from 9 - close.   I'm sure my excitement has come through clearly for Lucky Lou's. Not just because it's close, but it's a fun atmosphere with good food and good service. Looking forward to many more visits in the future."}
{"text":"This was my first visit to the Phoenix area. Friendly staff, food was good, fair prices. Would visit again."}
{"text":"This is your typical American pub. It seems to have a loyal following, for what it is, but it is not amazing. Not terrible either.   The prices are a little high for burgers and chicken dishes, and the service can be a little slow at times even when it is not incredibly busy. Most of the time I have seen either 1 or 2 people running the front of house.  If you are not in a hurry, and just want to relax for a happy hour in Chandler, then this is not a bad place to try."}
{"text":"A good neighborhood place for a quick beer and decent meal if you can get a seat. Atmosphere, service and food are good. Be sure to take advantage of happy hour. The only thing I don't like is that they charge extra for BBQ and ranch."}
{"text":"Don't let the outside smoking area or the initial bar view put you off at all. This place has top-notch very-friendly service and a solid menu.  The burgers are really yummy and the classic club is a lunchtime favorite!"}
{"text":"Went here with the fiance because its in our neighborhood and wanted to go somewhere other than Zipps.  Seat yourself deal which is fine. All the tables in the place had Blue Moon condiment holders but no Blue Moon. .LAME. Fiance liked that there was PBR and selections from our local favorite Four peaks so I settled for a Shock Top.  Service was decent and I imagine wouldve been beter had there not been an NFL playoff game on.  Food was great. The batter they use for onion rings is freaking delicious. Wings were yummy and my burger was huge! The jalapeno coins and mozzarella sticls were also good.   I'd definitely come back more often if they had Blue Moon on tap!"}
{"text":"LOVE their food!  I have been searching for an amazing turkey wrap and this place has the best turkey I have ever had!!!  My 3 stars are only because if you happen to go when they are busy the service is very sluggish. Also, the space is very small. I wish they would move to a larger location because there are not many tables."}
{"text":"Legit.  Bar food is typically mediocre, but not this place.  Solid menu with some nice healthy options.  The food is fresh and well prepared.  Service is fast and friendly.    Been the Lucky Lou's 3-4 times the past couple of months and I have found the food and service to consistently good."}
{"text":"Lucky Lou's is kind of expensive for the quality of food.  I used a Restaurant.com gift card. I agree with Chris B, this place needs a little fine tuning.  Quick Tip: The desserts were great."}
{"text":"The food was better than average.. Service was fine.. Beer was very overpriced and domestic beers like Sam Adams Boston Lager were included in the \"Imports\" menu for a premium price.  I mean a CAN of Tecate was $4.25. The bar takes up WAY too much space and the weird hostess kept walking around staring at everyone. I found the layout to be awkward and the place lacked the \"fun\" vibe. We ate our meal and left, having no desire to hang out for another round of overpriced drinks."}
{"text":"Went to Lucky Lou's for the first time last night. It was just okay. I am not sure if I would return here in the future. To be honest I just feel like there are so many other good sports bar options in the area that this would not be my first pick. My fiance and I shared a chicken spring roll appetizer which was the best part of the meal. If I were to come back for anything, it would be just beer and apps. They also have perogies on the appetizer menu so that might be enough to bring me back in the future as well.  The entrees were not as great. My fiance had the jalapeno and cheddar burger with fries. The burger was not bad but the flavor of the beef was just okay. I had the Diablo chicken sandwich blackened which was again just okay. The chicken was really kind of bland which I would not have expected for a blackened chicken sandwich.  Overall it really was just an okay experience. Service was good. Prices were a little high for what you get. Meh."}
{"text":"Been here a handful for of times.  First few times service was slow but we LOVE the boneless wings so it keeps us coming back!   We have had great service the last 4 times in and staff is really friendly and helpful.  Go for the boneless wings and a good drink! Yum!"}
{"text":"This place is on point every single time. The bartenders are friendly and attentive. The patrons are not rowdy or annoying at all. The televisions are placed well, and on multiple occasions they have been more than happy to change one to the hockey game for me.  I have ordered several different entrees for dinner here and every single one of them has been stellar!"}
{"text":"Great, if you like loud and congested... Maybe?  I've noted in other reviews that I'm not all that keen on sports bars, but I must say, although not concretely impressed with the first time visited, it's a few steps up that your typical TV-swamped pubs! The beers are good and cold - can't mess that up, but some of their eats fall short. I was especially unenthusiastic with their \"Bottle Caps\" (thinly sliced Jalapeños and batter fried). Really, really cold Draught Blue Moon and a well-chilled Angry Orchard.  I categorize much there other offerings as pretty much standard fare. Seeing some of their eats from afar though, I will be coming back to try some of their other good looking samplings.  Like other similar venues, it's very noisy during peak hours (one of my issues with sports bars). Cozy and crowded inside, smoky and crowded outside.  But if you do like sports bars, this local watering hole is great for some loud drinking and talking. Another bar recommended to the die-hard sports/eats/scream crowd!"}
{"text":"Tonight I had the special - pulled pork quesadilla.  It's the tortilla, pulled pork, green chiles and chess with a garnish of shredded lettuce and chopped tomatoes. It was okay, but I think I prefer chicken or beef over the smokey flavor of pulled pork.  The french fries here are not good. And the burger apparently tasted like one of those patties you purchase in bulk at Costco.    Server wasn't bad. Beer options were okay. I understand the cocktail selection was pretty good because they had some of the most current liquors needed to make one of the latest cocktails."}
{"text":"This is a great little sports bar and restaraunt. The food is excellent and the prices very fair.   The service is also fabulous."}
{"text":"New location on Power Rd in Queen Creek. Went there on a Friday late afternoon.  The server came around to take our drink order and when I asked about happy hr specials, she was not sure but was able to \"find a menu\". She brought this but forgot to bring a food menu, so we waited while she went behind the bar, did a few things and eventually came back with a menu.  This is how the service was the entire time.  We order the pork tenderloin sandwich w Fries and patty melt w Fries.  Apparently our food ticket slipped behind the counter as everyone around us was receiving their food when the server came to us to say our ticket was lost so It would be a little longer.  We then got the food and the grease on the tenderloin sandwich had pooled on the patty and the grease had seeped through the bread on my husbands patty melt. It was the least tasteful sandwich and fries I have experienced in quite a while. The food honestly had no taste.  Our experience wasn't made better by the drunks behind us \"f- -ck\" every sentence and the fact that the tables were so close together I felt like I was sitting at their table.  We went to Lucky Lou's new location as it is close to our house, but for future will make the drive and go elsewhere.   Also, prices were a little higher than most for the sandwiches and beer.  3 beers and 2 meals - over $40  Not impressed"}
{"text":"So ever since moving here to AZ from CA I was hoping to find a local place where the servers/bartenders would know us, and the food and drinks would be legit... DING DING!!! Lucky Lous is awesome... I haven't had anything I wouldn't try again.  Usually share the wings and have some drinks.  Everything is fair priced and the staff cracks me up and is super friendly.   They have a good happy hour from 3-6 and then a drink special every night fro 9-closing.   Oh and they have fried pickles... I like to call them frickles but that's just me.  They are super tasty.  Hot as hell though, make sure you cut them before you get second degree burns on your tongue and lips.  On the wing side of things the Honey Hot ones are delicious but you won't be able to feel your lips after 2 or 3.  My fav is spicy bbq... mmmm"}
{"text":"Tried tonight for first time .Fried zucchini the best I have ever eaten! Had fish fry very good lightly breaded , could substitute sides without a upcharge . Will return"}
{"text":"I love this place.  Good food and good service.  They have great perogi's!  Really hard to find in Arizona but we go back a lot just for the Perogi's."}
{"text":"Every time I come here I ask myself - Why don't I come here more often? It's close to home, food is good, service is good, prices are good, and they're open late. There's also usually a pretty good amount of friendly and lively patrons.  It's not a very big place and I've always felt the overall layout is little quirky.  However, I do like the Las Vegas theme and covered patio area."}
{"text":"I can't comment on the food because I am still currently sitting at the restaurant and I just placed my order but honestly I already want to leave. The server is so rude I am contemplating leaving. They aren't even busy and she is acting like she is so overwhelmed. As soon as my boyfriend sat down he was looking at the menu looking for the drink menu and the server came over and he stated that he has never been here before and was looking for the drink menu and she didn't even point it out to him. She just said \"ok, I'll be back\" and took off. I decided to giver her another chance so I put in my order and handed her the menu and she roughly yanked it out of my hand and walked away. If I didn't already order food, I would just leave."}
{"text":"TV situation is horrible. Small and few. Especially at the bar but equally as bad in the dining areas.   Nice patio but only one TV.   Good service.  Pricey food."}
{"text":"I cannot believe a place that calls itself a sports bar has only 6 TVs in the entire place!  And none of which can you see two of at the same time. There is SO much empty space for two or three times as many TVs.  Friendly service. Lots of locals.  As one of the only \"sports bars\" in the area these guys would make a lot more $$ with more TVs."}
{"text":"Ok so i had to update my previous rating on this place. Lou thanks for responding to my last post really means a lot that you read these and take action so with that in mind here is my update.   I love this place Kyle and Lora are by far my favorite bartenders but you can't forget about Erin love her up beat and always fun attitude. Lou you have a great local bar here and thank you for the ice cold beer and great environment. By the way please bring back or let me know the days you have the potato soup it's freaking amazing."}
{"text":"We love this place. The hamburgers are huge and amazing and their prices are great. They always seem to be busy but we never have to wait for a table."}
{"text":"Very dissatisfied!  I came here because the Hub lost power.  When you walk in the strong bleach smell hits you so hard you can taste it in your beer. They don't split up wing flavors and half the items on the menu they were out of.  Terrible"}
{"text":"5 stars!  Staff is great, friendly and knows my family by name.  We enjoy coming into Lucky Lous for great food and awesome happy hour specials!   Granted there is 3 locations, this is the original and we enjoy it. Shannon, Cathy THANKS!"}
{"text":"Live right around the corner so I've been here a bunch, more recently have ordered from postmates.com and had delivered (thanks to both of you for making that happen!!). When it comes down to it, it's really good bar food. Their hamburgers are sublime, and believe me when I say I'm a harsh judge when it comes to food since I eat out all the time and all over the city. Onion rings, bomb. Fried pickles - I usually only get em when they're chips, but they have the thin sandwich slices fried, really good. A few things on the menu are just ordinary. But really, cool place with good people, just bar food but better than most bar food..."}
{"text":"Great Food, consistent... recommend lunch and the Saturday night Prime Rib."}
{"text":"I'm giving this place a 5 star because of the delicious food and welcoming staff. We are from out of town and so glad to have found this bar/restaurant.  Try it out if your in the area. Well worth it."}
{"text":"First time visitors and LOVED IT!!  Sinatra sandwich was so good!  We also had chicken sandwich and burgers...all super yummy!  Shanah, server/bartender was amazing!  She had great recommendations for us.  Yumm!!!!  Cold beer too!"}
{"text":"Our go to pub for drinks and good food.  Nice relaxed atmosphere with plenty of comfy booths for privacy.  Always good music playing and lots of televisions for sport fans.  Love the burgers and the tots are the best in town!"}
{"text":"Their wings are really good. Nice size and it's really nice that you can order all flats or all drums if you want. They are nice and crispy too.  The King Creole was also really good. Extra spicy just how I like it and packed with flavor.  Why only 3 stars then? Poor service if you want to hang out here. We like to get our food to go to avoid the bad service."}
{"text":"Best fried pickles in town! Great prices, fabulous and friendly staff. Zero complaints."}
{"text":"We went on a Thursday. We were able to seat ourselves. The place was noisy but it is a sports bar. We split the Cubano sandwich with fries and a side of slaw. We both thought the sandwich was very good and plan to go back to try some of their other sandwiches. Their happy hour prices are good. The service was a little inconsistent-very good at first and then not so good at the end. Give it a try."}
{"text":"Needs some fine tuning.  I was impressed with the attentiveness of the service, as I ate a meal here and then moved to another table outside to drink a beer and catch the Suns game on another one of the flatscreens. The person I ordered from even found me and asked if I needed another beer... perfect. Paying up was a little awkward since I couldn't remember who my server was (although the person who took my order was doing double-duty as the bartender and was apparently indisposed when I went to pay). Either way, I got the impression that the staff here really cares and even covers for one another without hesitation to make sure the customers stay happy.  Seems like a decent enough place to go to watch sports on the tube as the bar has several monitors all over the place (including outside on the patio, as I mentioned). The clientele seemed pretty friendly. I wasn't impressed with the food, however. I ordered a western burger, which should've been straightforward enough. The cook brought out the onion rings that were supposed to be on the burger separately, after realizing his mistake in omitting them. I'm glad he followed up and corrected the oversight, but the burger just wasn't tasty. Perhaps some seasoning issues need to be addressed to get the basic burger plate up to par.  I'll probably stop by again and catch a game and a beer here sometime. But I'm not ordering the burger again. Hopefully, the rest of the menu fares better."}
{"text":"I just recently moved to the area but this place is hands down my favorite neighborhood spot. Everyone is friendly, food is good. You can find me here usually once a week. Whether it's happy hour with the buds or date night, it's a good time."}
{"text":"My wife and I have become regulars!  Great food and great service. The Royal Flush burger and the Pastrami are two of our favorites. The onion rings are delicious too. It's everything you want in your neighborhood bar!"}
{"text":"Nice neighborhood Bar and grille. Music is not too loud.  Loved the cheeseburger with jalapeno. Plenty of beers on tap according to my husband!"}
{"text":"The service is good. The wings remind me of when I attempted to make wings at home and failed terribly and the burgers defiantly have that taste of low quality frozen meat. Other items on the menu aren't so bad. All in all it's an \"ok\" place. One other thing \"like most restaurants\" they have adapted to charging $2.50 for a soft drink. It usually cost restaurants 12 cents for a fountain drink."}
{"text":"Fun local environment. Just a touch elegance to bar food.  Staff always aim to please."}
{"text":"A second try.  The place was empty.  The beer selection is weak.  Bud and four peaks.  Nothing special.   It could be great with the patio and the layout.   I wish them better luck."}
{"text":"This is a nice, casual bar with plenty of TV's for sports fans.  The entire staff is very friendly; they take the time to know the regulars and make you feel welcome.  The food is very good (California Chicken Wrap is my favorite and my son can't stay away from the brownie sundae!). It's our favorite \"go to\" place."}
{"text":"We eat at Lucky Lou's very frequently and their food is delicious but really I order 14 chicken wings order of onion rings and I only got one side of ranch I asked for a second side of ranch and I was charged $0.50 really!!! I ordered that much food and you're going to charge me extra for ranch when my 14 chicken wings should have came with two ranches and my onion ring should have came with one side of really!!"}
{"text":"I was informed that on Saturday evening Lucky Lou's servers prime rib.  We went with 2 other couples did not have to wait for a table for 6.  Our waitress was very kind and offered great service as she listened to one guy telling her jokes.  We were severed with quick turnaround. Hardly any wait. That was impressive.  Was told later in the evening they might run out as they cook only so many, which is understandable since it takes a long time to cook prime rib.  I recommend Lucky Lou's & I will be back"}
{"text":"Staff was proud to not acknowledge us. We sat at a table in the bar( a dirty one at that) and waited for close to 10 min before walking out.  When we were leaving we asked the bartender \" Are you proud we are leaving?\"  She smiled and said \"yes\".  I guess if you are not a regular, you are not welcome. If I could have given it zero  stars if that were an option."}
{"text":"Lucky Lou's great happy hour prices and great service.  Katie and Kyle bartenders/servers always happy and provide great service.  Boneless wings amazingly delicious!  Great place!"}
{"text":"While I don't frequent this location often, 1-2 times a month, I always walk away pleased.  The service is friendly and quick, but the food, for this type of restaurant is always good, not matter what I try.  I don't think we as a society say thank you enough, and just wanted you to know I appreciate your business."}
{"text":"Wahh.. Service is very slow fiancé and I waited for 20 minutes to get noticed then finally had to get a waitress. Food was okay had a chicken phily and it was overloaded with to many veggies and was dry. Fiancé had wings and were very fatty. There isn't anything special about the food here. However Booths and tables were very comfortable and clean.Overall this wasn't to bad for a last minute place to eat and watch the Sunday football games, but we will not be back."}
{"text":"Best place to unwind in NE Mesa if you're looking for a pub environment. It has great food. I have never had anything I didn't like there. It's the type of place that has a solid menu that they do well. You could pretty much order anything and you'll enjoy it.  I really love the service. Everyone is constantly working. You don't see any grab-adding by the staff, ever. I mean EVER. when you combine their menu flavors with the staff's service and their low prices, you have the dream place to grab an informal bite to eat.  Patrons are friendly as well. Some seem a bit gruff or have tattoos and such (I don't) but don't pre-judge. I went one time and there were a bunch of dudes with long beards and chains on their wallets, if you know the type. Ended up having a blast and making friends. Last time I was there I was on the patio and some folks asked if they could sit with us because all the tables were taken. They were really cool and then others started coming to our table. Wasn't an issue at all so I had a great time.  Great food and excellent service and customer. Pricing is extremely reasonable."}
{"text":"I have been here twice within a week. It is just a short walk away but I am so glad there is a place close by that offers real food instead of just sandwiches.   The atmosphere was really nice, it is dark inside but the tables are still well lit. When there isn't a sports game playing they usually play nice upbeat music.  The food was very yummy, and surprisingly good, admittedly I was expecting mostly bar food but they have a really nice spread for very little money. The drinks there were also very good and on the cheap.  The wait staff was friendly both times we went, the first time the manager came by and gave us $10 in gift chips for mentioning a 21st birthday coming up (poker chip gift cards). The turn around time for your food is a bit of a wait but they definitely seem to make their food to order, the have enough happening so you are not bored waiting.  This place will definitely be a new hang out joint, can't wait to go back again."}
{"text":"Sunday Mornings / Football / Breakfast / Lunch..  Been here a few times now, 1. Great Service 2. Great (not my #1) wings, but still great. 3. TV's Many Many Tv's with Every game on...  4. Atmosphere, great Patrons each time we have been there.  Only down side, Is I probably should go more often..."}
{"text":"We were looking for something different after a quick stop off at Chandler Mall and found this place.  Despite being tempted by the Spicy Pickle next door, we went ahead with Lucky Lou's.  The place wasn't very crowded and the waitress told us to sear ourselves and she quickly brought menus and got our drinks.  They had Coke instead of Pepsi, so I was happy. We started with this cajun shrimp app.  It was basically jambalaya without the rice.  It came with some toasted bread and was really amazing.  I would have rather just had jambalaya but this was a good starter.  I would order it again in a heartbeat.  It was about $12 though, which seems high for an app but it had about 8 very large shrimp in it so I guess I feel like I got my money's worth. Then I had a burger that was actually topped with pulled pork and cheese.  This was one of the stranger things on the menu so I had to try it.  The burger, by itself, wasn't very good.  It was cooked more medium-well than medium and was pretty flavorless.  The pork, however, was excellent.  There wasn't nearly enough bbq sauce to make the whole thing work though. This place has quite a menu.  Full of sandwiches, burgers, salads, and a few random Louisiana-style meals.  There seems to be something for everyone here but I feel like you may need to micromanage the preparation of the meals.  Everything is just ALMOST there.  If they had added rice to the app it would be been perfect.  If they had spiced up the burger, it would have been perfect.  I just feel like they are almost there.  I might go back, but I think I'll try the pickle place before I go here again."}
{"text":"Finally a great meal in AZ. Great food, fun little local pub in a strip mall. Super friendly staff and good atmosphere. We Had wings and dip and a few beers and everyone in my party left happy and full."}
{"text":"I hope the owner reads this. We just walked out of your place after ordering about $70 worth of food. Why? You ask. The junk service!!!! 9 minutes as we sit there and look at our chilli and sampler appetizer sitting there while the girl walks past it over 4 times continuing to take other orders and make drinks. So the chilli,sampler,kids chicken fingers,turkey blt and turkey wrap is on her. 10/22/15 6:15pm. You should talk to you wannabe server!!!"}
{"text":"K and I had been out on a date night and wanted to get something to eat. I've driven by this place soo many times, it was time to give it a try. Plus, it was late, 10:30, and a lot of places stop serving.  The service here was fine. Nothing outstanding but our server was cordial and made sure we were taken care of.  K ordered some Pierogies ($7.50) to start. She said they were fine. Just what she was looking for.  I ordered the Hot Pastrami ($8.49). Decent sandwich. Nothing special but like the Pierogies, good enough.   There are plenty of TV's to watch and I imagine this place gets full on game days.   Average Service. Average Food. Average Prices. 3 Stars."}
{"text":"I went here last night with a group of friends.  We all agreed that while the food was very good the service was definitely lacking.  I found that the waitress was sarcastic and not accommodating.  We had to ask several times for extra water and she was abrupt about us paying our bill because she wanted to end her shift.  I am undecided as to not I will go back again.  The food was good but not anything I can't get anywhere else."}
{"text":"I found this place on a blog  devoted to Fried Pickles - I know this may sound strange, but I grew up in the South and about the only fried thing I still eat is pickles and I LOVE THEM, I CRAVE THEM, hence taking the time to research a blog about them. ANYWHO.... Lucky Lou's was the closest spot I could find to our home yesterday so my hubs and I stopped in for some pickles and beer. The place was clean, decor tasteful (for a sports bar), the booths were highbacks -which I like, the service was good and the pickles were FANTASTIC! It is a nice neighborhood bar/restaurant , nothing spectacular (except the pickles) but we would go again."}
{"text":"I love the atmosphere, and the food. I also like the service. The staff has been the same for the past year. They love their job and it shows. Just a good low key sports bar. And it's close to a really awesome hair salon."}
{"text":"Pretty good place that is very close to where I live. Eat before you come If possible."}
{"text":"Love Lou's since it opened...never had ordered the spring rolls..sorry Lou I won't again. 2 rolls cut in half for 7.99 a cheeseburger and fries is 7.79..wow..I will always go back cause the food is good and the drinks are stiff..and the bartenders and waitstaff are excellent..but avoid the spring roll value not there"}
{"text":"Those who have read my reviews know I only Yelp when a place is really good or really bad. Giving this place five stars. Very friendly service. The food was amazing especially the french fries. We ate a wide variety ranging from a fish sandwich, Philly cheesesteak, special salad and club sandwich. Everyone enjoyed it. The food was over-the-top delicious, and completely made to order. It was also a really darn good value.This place is a keeper."}
{"text":"I , like Chris R, am excited for the new watering hole next door,but I am not as impressed. The service is average, so is the food and the patrons, because they all seem to know each other already, lack that friendly enthusiasm-more like watching TV at your uncles. I had a chicken sandwich and a couple beers on a Sunday and it was just that-a chicken sandwich and a couple beers on a Sunday! However; I am going back to give it another chance because I can WALK home! ;)"}
{"text":"We love Lucky Lou's! Especially the Chicken Fried Chicken on Thursdays!  This place has great beer and a dog friendly patio which is a great place to hang out and watch a game.  Great place in Chandler"}
{"text":"Greatest staff! Excellent specials. Huge menu. Love this place! My go-to spot. After 10pm domestic specials are a great way to have a few beers on a budget. Wings are amazing as well! Great spot for locals or someone looking for late night food."}
{"text":"Lucky lou's is a tucked away bar and grill. They have pretty good food there and drinks. I'm a big Coors light guy and they didnt have that on tap, also there is no jukebox. those were the 2 downfalls i had. Other then that its a nice place to hang and have some brewjas, we used to go there after shooting. Nice relaxing place. I've never had like a meal there. I've always gotten something small. like quesadilla, or something like that. Pretty good appetizers.. Overall pretty good."}
{"text":"This is our local pub.....service is great, food is great, hubby loves the Hamburgers with jalapeno bottle caps... and I have had several of the dishes with the Chicken Fried Chicken and gravy by far the best I have had. Like the patio can bring your dog, but I don't like the smoking.....We eat there at least 2x a month."}
{"text":"Food was good, which is why Lucky Lou's still gets 3 stars. If you are looking for a tiny crowded bar with an extremely casual, loud and rowdy crowd then perhaps this is the place for you. Just don't be surprised if you are forced to sit in the smoking area outside, which is cramped and sandwiched between a taco shop and Thai fast-food  joint. Service was extremely slow and we found ourselves getting impatient at every phase of the dining experience. I realize this is more of a 'neighborhood bar' kind of place, so if that's what you are looking for then give LL a try. For me, I won't be returning based on the atmosphere and service."}
{"text":"In a word - awful. The place was packed, must be because it's so affordable. You get what you pay for here. The beer selection is inadequate for a bar and the really special \"special\" on Saturday night - prime rib... may have been the worst piece of meat I've ever had. That's what I get for ordering steak in a bar. Yuck. At least our server was friendly."}
{"text":"Chicken wings were nice sized, but the medium sauce tasted more mild. Patty melt was very good.  Overall not bad."}
{"text":"We moved recently and were looking for a place that was close by. I could crawl home from here if I needed to so we decided to give it a go. The place was very busy for a Wednesday afternoon (about 4 pm), which I took to be a good sign. Our server arrived quickly and was very friendly. They had a nice selection of beers on tap and I opted for a local craft brew that I hadn't had before. We just wanted a snack so we stuck with the happy hour menu which wasn't that big. We ordered the Pirogues, not something you see very often... very tasty. I wish their happy hour menu was bigger and that is the reason for 3-stars instead of 4. Their regular menu seemed to be pretty big but that's not what we were there for."}
{"text":"Based off of the burger that I ordered, I would have given this place a 2 star review, however, the saving grace was the cajun shrimp app, which was more like a 4 star dish.  We were starting to get really hungry while making some runs around the Chandler area and we wanted to keep with our trend of always trying something new over the weekend.  That led us here, to Lucky Lou's.  It was pretty empty when we came in, but people trickled in a little bit more as time passed, but still, pretty empty.  Our waitress was friendly and gave us some monstrous Diet Cokes, so she didn't really need to come back often for refills.  We ordered our meal, the Cajun Shrimp app and a burger of some sort for each of us.  The shrimp app, like I said earlier, was quite good.  Like Glenn, I feel like this dish would be much better and more well received if it were labeled as an entree and served with rice.  The sauce was flavorful and slightly spicy and the toast served with it was buttery and yummy.  The burger was a big fail though.  It was tough, overcooked, and lacked any sort of discernible flavor.  The fries were pretty good though!  Eh, I probably won't come back, but mostly due to the location.  I would however, be willing to give them another shot if we were out and about in this area and couldn't find anything else new to try."}
{"text":"Best sports bar in east Mesa. Friendly service, Fourpeaks on tap. Food is always consistant an good. Servers are always upbeat and friendly."}
