{"text":"Love walking here from my office. Had the bulgogi special, which was excellent, the chorizo burritos are awesome, and salads are great too. Never had a bad lunch, and everyone is so friendly! I always feel like I'm a regular."}
{"text":"I LOVE this place!  I always think I know what I am getting and then see the specials and sold!  Never had anything I didn't like and I flippen love Lucy, she as well as everyone else are so sweet.  Lucy greets everyone coming in like good friends and remembers not only faces, but names and even some of your favorites.  In addition to the food .... Oh they have boars-head meat, there is tons of drinks, candy, chips, ice cream, really you can't go wrong here.  I seriously would eat here every day!!!!!"}
{"text":"Most excellent little hide away.  Food is simple, fresh and tasty.  Prices reasonable. Quality very very good.  I just had a grilled chicken sandwich, very good.  Nothing complicated or fancy, but greasy and tasty.  Beautiful location.  Highly Recommend."}
{"text":"Get their Onion bagel with hot pastromi. It is so good i literally get it every day! The staff are excellent and friendly. Lucy, if you go there a few times will greet you by name. Great place, and remember, get their oinion bagel with hot pastromi!"}
{"text":"A co-worker and I were hungry last Thursday and decided to order from Lucy's. We were really happy about everything. We both ordered a breakfast burrito and we were satisfied with the food as well as the price .  We are going back to try the lunch soon!"}
{"text":"All I can say is the chorizo burritos on Friday are life changing. Lucy is a master mind!"}
{"text":"Sad news about Lucy. She remembered every single person that came in by name and put a smile on my face every day. Food is always great, but the people like Lucy and her husband made this place great. This is a big loss! Cancer has taken 2 lives and 2 people are battling it  in my life this year alone. RIP Lucy! #CancerSucks"}
{"text":"Grabbed lunch here. There was inside and outside seating. Service was fast and my order was correct and made well. I would go again. Everyone was nice."}
{"text":"Cute little cafe tucked into an office building.  The service was incredibly quick which was great if you are on a lunch break.   There is a beautiful out door seating area and in the Arizona winter it was a great place to enjoy your meal.  The food was definitely ok nothing fantastic but the service and the setting made it worth the 3 stars."}
{"text":"I went here for breakfast one morning and had a breakfast sandwich that was made to order.  Yummy.    It is tucked into a corporate center so finding it might be a little bit of a challenge.  It is worth the search!"}
{"text":"Working in the same building that Lucy's Cafe is in, it is a convenient place to have breakfast and lunch. Quick & Friendly service. Love that the staff takes the time to learn their customers name, definitely makes you feel welcomed. The food is fresh, and delicious. The only down side is that the prices for a lunch combo is a little pricey. Overall, great place to have a nice sit down lunch and enjoy the pond view."}
{"text":"Decent little lunch spot in an industrial area that doesn't have much else in the way of food, except for the old donuts at the circle k.  the salads are good and of a good portion.  they use boars head brand of lunch meats, which is one of the best quality of lunch meats out there in my opinion.  the coffee was okay. the staff was nice.  it had a nice open seating area both indoors and outdoors."}
{"text":"I love this cafe, its near work and they have a great selection of lunch items and there is a pond outside you can sit at, quick service too...they always have a lunch and breakfast special...always unique and great...i had a roast beef wrap with green chili's on it, was delicious and i had chicken breast sandwich on sour dough with green chili's...and sometimes i get omelettes, its very friendly and they have lots of beverages and different coffees...its a good spot and quick. they have big tables area, couches, magazines, its good spot to wait on someone in the building or take a friend to lunch if you work nearby."}
{"text":"I wouldn't go out of my way to come here for lunch, but if you are in the neighborhood, it just may be the best choice.  They have a good selection of salads and sandwiches, they prepare them well, and it's not too expensive.  Add a nice outdoor seating area and quick service, and Lucy's is an enjoyable place to chow down."}
{"text":"Great little cafe that's super close to my work! I love their breakfast. Pretty cheap ($7 and under) and delicious food. My favorite is the Croissant Sandwiches they offer ($4~). They give you a choice of meat - bacon, sausage and ham. My favorite is the sausage.   The only bad thing is that their breakfast ends pretty early - around 10:30am. And they close around 2pm.   Salad portions are huge, delicious chili and overall a wide selection of food and it's pretty cheap!"}
{"text":"We love this place. friendly service and great food at a reasonable price. When i order they always remember my name. Cant beat that. I would highly recommend."}
{"text":"Those of us in the Fountainhead area couldn't imagine a world without Lucy's cafe. Food is excellent, both in taste and quality. Definitely a step or more above the competition in the area. Great lunch specials, and the salads have always been phenomenal. My all-time favorite is the breakfast burrito. Lucy herself is behind the counter, and she even gave me the phone number so I could call ahead and order before the breakfast menu ends.   Oh! Important to note, Lucy's is where we all go for the best coffee in the area. She brews Starbucks and it's worth paying for instead of drinking what is in the break rooms at work.   Dining area outside her cafe has just been updated (gorgeous) and is suitable for casual business lunches."}
{"text":"Nice surprise! Dropped in to eat here on a business trip because I didn't want to eat at a chain restaurant.  Little hard to find for a first timer because it's inside an office building on the ground floor.  Counter person was pleasant and helpful.  Service was fast.  Had the Asian chicken salad.  Portion was just right.  Veggies were crisp and fresh.  Chicken was warm and moist.  Dressing on the side (which I like.) Basically - a satisfied customer."}
