{"text":"also ich pflichte bei, das die Preise schon etwas erhöht sind schliesslich sind wir immer noch auf dem Lande,, und der Kaffee ist viel zu dünn wir sind ja nicht am Bodensee wo man bis zum Boden gucken kann  vielleicht nimmt sich Frau Lukasch das ein wenig zu Herzen."}
{"text":"Die Bäckerei Lukasch in Grünberg ist mit Abstand die beste Bäckerei weit und breit. Schon zu Schulzeiten verspeisten wir täglich die super leckeren Brötchen und Teilchen, die im Schulkiosk verkauft wurden. Später hatte die Bäckerei am Gießener Bahnhof einen Stand und so musste ich auch nach dem Schulwechsel nicht auf meine Lieblingsbrötchen verzichten. In Grünberg selbst kann man in Marktplatznähe direkt im gemütlichen Cafe ein gutes Frühstück genießen."}
{"text":"Bereits zum 3. Mal bin ich von Frankfurt nach Grünberg gefahren, um mit Freunden beim Schloss-Cafe Lukasch zu frühstücken. Bisher hatte ich das Frühstücksbüffet ausgewählt und war begeistert.  Heute habe ich das norwegische Frühstück ausgesucht. Diese Auswahl war sehr gut. Schon das Brotkörbchen mit einer Auswahl leckerer Brötchen und Brot überzeugte . Einer allein wird das kaum alles essen können!!! Deshalb gab es zum Schluss auch Tüten, um die leckeren Reste für Zuhause einzupacken. Das Rührei und alle anderen Speisen waren wunderbar. Das nächste Mal habe ich die Qual der Wahl, denn alles war super frisch und appetitlich angerichtet. Der Service ist vorbildlich und die Bedienungen sind sehr freundlich und zuvorkommend. Jetzt in der Weihnachtszeit ist alles geschmackvoll geschmückt und das Schönste, man kann fast jede Deko auch erwerben. So habe ich schon einige Einzelteile mitnehmen können. Auf dem ersten Blick mögen die Sitzgelegenheiten vielleicht eng und verwinkelt anmuten, weil es immer voll besetzt ist. Aber es ist einfach heimelig und gemütlich. Ein Ort, den ich als Oase der Besinnung bezeichnen möchte"}
{"text":"Ich kann mich meine Vorrednern in Sachen Preis nicht wirklich anschließen, da die Preise beim Schlosscafé Lukasch auch nicht höher sind, als die bei vielen anderen Bäckereien (Mal abgesehen davon, dass es eben keine große Kette ist). In Sachen Qualität & Geschmack (was natürlich subjektiv ist) finde ich Lukasch jedoch definitiv sehr gut, bis jetzt hab ich für mein Geld immer etwas leckeres bekommen & kann mich daher auch hier nicht beschweren. Dementsprechend kann ich hier auch eine einwandfreie Bewertung abgeben & hoffe, dass ich in Zukunft auch bei meiner Meinung bleiben darf."}
{"text":"Die belegten Brötchen sind der Kracher. Für die Hessenkruste würde ich töten. Nicht billig aber du bist was du isst ;)  Ihr könnt weiter eure chinesischen 8cent TK-Teiglinge essen, ich gehe zum Lukasch. Gute Bäckereien sind schon selten genug geworden also unterstützt das regionale Handwerk und verzichtet auf die 10Cent-Rewedreckweck. Für Metzger gilt im Übrigen das Gleiche.  Das Personal ist für mich als Morgenmuffel schon fast zu gut gelaunt, aber irgendwie entlocken sie einem immer ein Lächeln.  Danke und Gruss"}
{"text":"Das Cafe Lukasch in Grünberg ist wirklich ausgezeichnet. Wir waren vor kurzem zu dritt dort Kuchen essen und wusste ehrlich gesagt nicht, dass die Bäckerei eine so schöne Sitzmöglichkeit im Hinterbereich bietet. Das Ambiete ist gerade in der Weihnachtszeit durch tolle Dekoration( die man auch kaufen kann) sehr ansprechend. Wir haben alle drei ein Stück Torte gegessen und einen Kaffee getrunken. Es war sehr lecker. Außerdem ist die Bedienung sehr nett. Einen gemütlichen Samstag Nachmittag verbring ich also vorzugsweise immer dort ! Sehr zu empfehlen."}
{"text":"Die Preise bei Lukasch sind gelinde gesagt eine Schweinerei. Wo bitte zahlt man für ein stinknormales Käse-Schinken-Croissant schon  2,10 EUR ??? (Ja, wirklich!) Und wenn man sich beim Stand im Herkules an einen der Tische setzen will kostet es 50 Cent Aufpreis einfach nur fürs Hinsetzen!  Oder für ne  kleine Platte Schmierschelkuchen zahlt man 4,50 EUR. Für das Geld krieg  ich in anderen Bäckereien die dreifache Portion und mal ganz ehrlich   so viel besser als woanders ist es da auch nicht. Im Gegenteil, die Qualität  mancher Backwaren schwankt enorm. Erwischt man nen guten Tag kriegt man  da beispielsweise ein ordentliches mit Käse überbackenes Brötchen. Aber  meistens ist da so wenig Käse drauf, dass an der Oberfläche mehr Teig  als Käse zu sehen ist und häufig ist das bisschen Käse dann auch total  angebrannt. Wenn bei uns auf der Arbeit jemand sagt: Das is aber ganz schön Lukasch weiß jeder direkt, dass die Person damit sagen will, dass etwas unverschämt teuer ist :-)  Ob das jetzt zum Lachen oder Heulen ist, bleibt jedem selbst überlassen."}
{"text":"Ich hab mich hier superwohl gefühlt ! Cappu und später Gulaschsuppe lecker. Am Nachbartisch wurde noch gefrühstückt , ich konnte anhaltende Begeisterung vernehmen.  Ein tolles Café in Grünberg."}
{"text":"Die Bäckerei / Cafe Lukasch hat weit und breit definitiv die besten Backwaren. Leider ist das \"Ambiente\" im Innenbereich ist leider etwas in die Jahre gekommen, man kann jedoch bei schönem Wetter auch außen direkt auf der Marktgasse sitzen was recht schön ist. Das Personal ist durchgehend nett und freundlich und auch meist auf Zack. Die Preise haben sich für ein kleines \"Städchen\" wie Grünberg jedoch gewaschen. 4  finde ich jedoch im Vergleich zu anderen Bäckereien übertrieben..."}
