{"text":"The food is Ok but this place is not cracked up to what others say it is. I've been to this place 3 times. The 3rd time i didnt eat due to the fact I wasn't seated by the hostess. Let me make note that the lobby was not crowded. I walked in with my daughter while the hostess saw me. I was standing in the lobby waiting for them to ask me my name to be put on the list. After about 5 min standing there, a couple walked in and the hostess immediately greeted them and sat them. The naive hostess didn't bother to greet me at all. So i asked for the manager. They brought me a lead waitress. I demanded again. I wanted to speak with a manager. A so called manager came out. So called due to the fact he was a temp manager organize the place. he explained that to me. I mean this place can have potential. but that experience just tells me they don't have their priorities straight or they just hire the wrong people. Would never eat there again. It's like they hired teenieboppers with no hospitality for low wages."}
{"text":"We had a Groupon, so we decided to try this place.  Our waiter was attentive and polite.  My husband had the axe burger and said it was very good.  I had the half rack of baby back ribs.  They weren't the worst or best I have ever had.  The portions were huge though.  The food is comparable to say, Shoneys or Denny's, only the portions are a lot bigger.  Don't go here expecting a 4 star meal.  It is a large amount of decent tasting comfort food for a reasonable price."}
{"text":"We have tried this place 3 times. I always give places more than one chance and this morning was the last straw. Not only was the food mediocre but the prices are too steep. Manger said 2minutes, it was 30. Then we got seated and overheard a couple who had been waiting 45minites. In this 10minute time of being seated, no one came by to give water or coffee. We walked out 45min later with no breakfast and are headed else where. Never again."}
{"text":"Food was nasty, menu was short, and everything was over priced. Won't be dining here again. Service was ok though."}
{"text":"okay but not as good as it use to be. The service has went downhill and with many more restaraunts being better priced and better staffed it makes sense to go some where else. They use to have huge cake and great prices but they do not anymore"}
{"text":"Today I ate at lumberjacks I started off with a bowl of chili it came with two generously sized pieces of corn bread whipped butter with a hint of honey and two crackers topped with cheese and white raw onions for my entree I decided to go with the ultimate burger bar you pick your cheese and side as well as how you want your burger cooked then you go to their item bar and select your toppings they had your usual suspects lettuce, tomato, pickles red and white onion, mushrooms and bacon then they also had peppercene peppers, jalapeños, feta, and blue cheese, spinach, black olives, ranch, terriaki sauce, BBQ, and buffalo sauce.

The chili was good nothing special it was like they took a can of hormel chili and just spruced it up a bit the cornbread was decent it was really hard to eat because it was so dry their fries are great and so is there brown gravy the fries are almost like carls jrs curly fries but crispier and not curly their burger is really good it can almost compete with the burgers at Carlos kitchen and that is saying something."}
{"text":"We had a nice Sunday morning breakfast here.  Service was excellent...our server Diane was quick, efficient,  and friendly.

Portions are big.  My wife and I got a Griddle Sampler and the Tostada omelette. 

Griddle had light fluffy pancakes and the banana nut french toast were warm and buttery tasting.

Tostada is very hearty and savory and seemed like more of a lunch entree than breakfast.

We saw a sign that said under new management....nicely done."}
{"text":"Coffee is very good and strong, although they only give you a cup of coffee compared to the jug of coffee they leave at your table at ihop, so they do offer a refill for $4.68. I got the lumber jacks special, it was countrystyle potatoes mixed veggies ham and sausage. It is typically served with country style gravy all over it, but I got it on the side, it was a bit too much for me last time. The place was clean and very spaced out, not too crowded, so I have to say it was very delicious! We will definitely return"}
{"text":"Good for breakfast. Only opened until middle of the afternoon. Their portions are huge. Would suggest sharing them. Service is so so."}
{"text":"1200 Saturday visit- First impression- Decor: torn up upholstery on bench seat, hole in corner window. Overall look is fairly clean. Service - good-- waitress overloud but attentive and responsive- good attitude. Food: meat skillet- asked for no ham, extra sausage- got just bacon. Waitress brought out small dish with sausage crumbles. No seasoning- oil base had stale flavor. Cheese in an unmelted chunk on one side. Husband got 4 egg Jacks omelette--we must be used to Costco sized eggs because the omelette looked very small:) meat filling overcooked, eggs completely  cooked before filling added- cheese in a pile on one corner- no seasoning discernible.  Biscuit was ginormous and ok. $28 for mediocre breakfast meal! Won't return which is too bad - place has great potential but fell short of minimum expectation today."}
{"text":"Nice clean family friendly.  Great food, huge portions.  Excellent staff and service.!"}
{"text":"Went to lumberjacks for breakfast this morning. We've been there before and usually had a good experience. Today not only was the coffee cold the bacon was burnt. Their sausage gravy never has any sausage in it . And we were overcharged for the breakfast we ordered . My husband's English muffins were burnt as well . When I got home I got sick and had food poisoning from the food . We will not go back to this restaurant ever again ."}
{"text":"I know they just opened a day ago but this place is a disaster. Very slow service and the food quality was very iffy."}
{"text":"Pros:
charbroiled burger!
BBQ sauce
Sampler Breakfast Platter & Sausage patty!!
Fresh limited salad bar
Good service
Cons: (I'm picking on details)
Cashier/hostess stand needs a manager to clean up.. Personal items all over back counter"}
{"text":"The restaurant is nice both inside and out.  Parking was sufficient.  But unfortunately if this business is to survive then it needs to raise the bar on their meals.  We ordered the prime rib which the server said was good.  Portion size was good but the end cut wasn't seasoned well, just cooked well and there was no crust on the meat at all.  It looked like it was stewed.  The load of bread was good but that should not be highlight of the meal.   Most of the diners with us complained that the food was bland and the tea was bitter. The lemonade was just above sugar water. We  could have gotten a better meal off a hotel buffet.     I don't know how the breakfast is but the dinner was poor enough not to give it a try."}
{"text":"Excellent breakfast.  Service was outstanding (Felicia)!"}
{"text":"So, I am writing this review to share my experience I had with 3 of your wonderful employees. Yesterday afternoon I was running errands with my friend. We had car issues and were able to get to your parking lot. It was about 108° and we had a 3 hour wait for a tow truck. Delilah opened your doors and offered us a cool place to sit and some water while we waited. She was also with two other gentlemen who frequently came to check on us to make sure we were okay. It was this simple act of kindness and empathy that inspired me to write this review. Thank you."}
{"text":"Worst service ever.  Sat 15 minutes without being acknowledged. ...we were in a hurry.  Told server we were in a hurry and yet he still had time to crack jokes and try and be whitty w our table....Waited 25 minutes and food still not even started yet so we had to have our friends take it to go. Never going back....."}
{"text":"It's like a Southern Breakfast Place - without the Good Food or Charm. Very Very Average Food, Service was average (which has been consistent in the three times I visited (I thought maybe they would get their act together - no not happening) always some minor mistake. Friendly and untrained, the kind you cannot really blame the wait staff - but you can blame management. 
Just go someplace else, for the Price - food quality and wait staff, it's a disaster zone."}
{"text":"Great ambience, I like the traditional style of the restaurant and simplicity of the whole place.

Service - 5. The hostess, Lisette, greeted us with a warm welcome immediately upon entrance. Felicia is wonderful, very friendly and constantly checked up on us. The orders came out in a timely manner, very fresh and everything was perfect!

Food - 4. I ordered the Big Jack's Skillet (seasoned potatoes topped with ham, sausage, bell peppers, mixed onions, cheese and country gravy; I added bacon) and it was absolutely AMAZING! Definitely a homemade taste to the dish, it was extremely filling. I barely had room for my toast. My brother ordered a half stack of flapjacks (half was a wise choice, each flapjack was about 5-6 inches in diameter and 1/2 inch thick) and he had zero complaints.

Overall: 4.5
The prices were good for the portion sizes and it was an enjoyable experience.
The only thing I saw wrong with this restaurant is that there are no flavored creamers, only half and half :(

I will definitely return sooner than later!"}
{"text":"My boyfriend and I just left this restaurant feeling very disrespected. The lady who sat us was very welcoming and right away asked us if we wanted anything to drink. I asked for a water. When she brought me my water I noticed there was something floating atop. My boyfriend fished it out and concluded that it was indeed an ANT. As I looked deeper into my cup of water I noticed there were two more ANTS at the bottom of my cup. We quickly and nicely informed our waitress who was apologetic and embarrassed. She brought me a new water and had said she had notified the manager Andrew (I think that was his name). My boyfriend and I decided to stay and eat there because we were really hungry. We ate our food and still waited for the manager to come talk to us. He NEVER did. My boyfriend and I never expected a free meal nor a discounted meal, just an apology would've been nice. We paid and left, with our minds made up to never return again."}
{"text":"Wow foods great! Huge portions mmmm tasty highly recommended. Mmm"}
{"text":"I have never had a problem with this place, the food comes in big portions and always taste good. The staff is always friendly with us and never gets our order wrong! I would recommend this place to everybody that ever comes to the north side of vegas!!!"}
{"text":"It was my turn to choose a breakfast place, and I opted for somewhere new instead of slow, sugary ol' IHOP. Well, turns out that slow-as-molasses breakfast isn't just for IHOP. The misses ordered a basic skillet and I the biscuits and gravy. We only saw the staff once more in the 45 minutes it took for our food to come out. With cold biscuits. Why does breakfast have to be so slow?"}
{"text":"I've been to this location multiple times and I've had a wonderful experience every time! Our server today, Daisy, was exceptional and very helpful in finding vegetarian friendly substations for certain menu items!"}
{"text":"Should be half or maybe no star. But not the greatness service took a while to get even our drinks. Only ordered 2 burgers and took them like 30 to 40 mins to cook medium burgers????? Get them burnt nasty burgers cold frys. The only thing that was not bad was the drinks. 

Sry for the bad review but just left a bad taste in our mouths. Will try to go back but maybe in a later date."}
{"text":"Decent breakfast. We ordered the chicken fried steak (tons of food) and the pesto eggs Benedict (pesto hollandaise had got flavor and the eggs were perfectly runny).  It was pretty empty, and we were surprised by how fast the good arrived! Our server Robert was friendly and helpful in making final decisions on our order. Nice diner spot for breakfast in North Las Vegas"}
{"text":"Great place for breakfast customer service is awesome thank you Felicia we will be back soon"}
{"text":"Best prime rib I have had in years. Service was good. We will definitely come back next time in Las Vegas."}
{"text":"I have to say I cannot comment on the food because I left before I was able to try it.  My daughter and I were having a wonderful girls day out and we decided to have breakfast.  We had never tried the Lumberjacks...so we said hey why not.  Yes it was a weekend and I know breakfast is a popular meal out on weekends.  BUT we were in the lobby over 5 minutes and not ONE person acknowledged our presence let alone \"I'll be right with you\".  I even asked the cashier if there was a waiting list we needed to get signed up on and was completely ignored...some might say she didn't hear me but she made eye contact and went on to go talk to an off employee dropping something off for yet another employee that saw us and then went to chat.  

So...while I hate to write reviews...I felt the need to let people know that if you are in the market for customer service...AVOID THIS PLACE IT HAS NONE!!!"}
{"text":"So my friends decided to take me to this place they said \"looked really cool\" from the outside as they drove by the other day.  What the heck, I'm up for adventures.  Breakfast it is.  So they picked me up and we drove up to the Lumberjack.  I did remember seeing reviews but didn't remember if they were good or not.  BTW you cant miss the big lumberjack statue in the front. Its pretty cheesy and reminds me something you would see in the 80s. lol

We walked in and the place seemed pretty busy.  Right away we noticed the salad bar in the middle of the restaurant.  I always like salad bars at places so you can pick what you want on your salad.  The bar wasn't stocked for lunch yet...and we were there for breakfast anyway.

The menu was huge.  Sometimes its overwhelming how crazy some menus can get.  Fortunately we were there for breakfast so it wasn't that bad.  I ordered the ham and eggs for my meal.  It was really good and ALOT of food.  I only ate half the meal.  The ham was a bone-in slice about an inch and a half thick.  I'm never really overly impressed with the ham I've had at other places but this one just melted in your mouth.  It was a little fatty but I just cut around it.  Super good and flavorful.  The eggs I ordered were egg beaters and they were -well - eggs.  The toast reminded me of the cheap loaves of bread that you wish you didn't buy at the store.  Thin and stale.  The dish came with potatoes that were good.  She had asked me if I wanted the works on the potatoes (sour cream, cheese and green onion) and I opted for it.  I had in my head that it would come on the side but it was all on top of it.  The toppings I could have done without-it was a little much.  Next time I'm keeping it plain. 

Now the ambiance was nice.  The place seemed new with a log cabin feel-inside and out.  Nicely decorated and seemed pretty clean.  There was a TV kind of in front of me so I kept getting distracted looking over at it.  The server lady was awesome.  Very personable and friendly-joked about me changing my mind a couple times.  Gotta love a server with a personality.  The girl at the front could care less about us.  She was just there to take the money and that was it.  Obviously wasn't too overjoyed to be there. There was a huge chocolate cake in the front glass part that I'm sure every customer drools over.  I think it was like 8 layers and looked amazing. 

Overall its a simple breakfast spot. We all enjoyed our food.  In fact my friends husband raved about the coffee.  I'm not a coffee drinker but he loved it.  It was a nice breakfast adventure.  We definitely will return."}
{"text":"We were told there would be a 15 minute wait but we only waited 10 minutes or less.  This is much preferred to the restaurants that imply a short wait and leave you standing for a half hour or more. I guess you can have a beer while you are waiting since they have an open cooler at the front counter.  But not being beer for breakfast types we didn't explore that.  
The server was polite and helpful and checked back with us frequently to see if we needed more coffee or anything else. 

I had Jack's Omelet which was stuffed with all kinds of tasty breakfast meat chunks.  Sadly, the egg portion was a bit dry, but overall it was pretty good.  The hash browns were cooked just right which seems to be rare in many places.  And they were accommodating by substituting a fruit cup for the bread/biscuit choice to keep the meal gluten free.  My wife had the Santa Fe Skillet which she enjoyed very much.  There was quite a bit to it so she was only able to eat half.  Come hungry or get something you can put in a box. 

The decor was pleasant enough.  It's only nod to the Lumberjack name was the half log paneling.  I would have expected more of a National Park Lodge setting, but that's important only if you are really interested in decor at breakfast time."}
{"text":"Awesome food and service.  Usually very quick to get food (unless restaurant packed).  Huge portions."}
{"text":"Had breakfast here on a Friday morning and came out happy and full.  I don't agree why this place gets such a low rating in yelp considering what you're getting for the money.  We ordered from their weekday breakfast specials menu and got a steak and eggs, and ham and eggs.  As you'll see from the pics I'm posting, they were a good portion size.  They also tasted quite good and reminds me of the good old graveyard specials you can get from various casino cafes in town.  The restaurant was clean and bright, the restroom sparkly clean, and the service was prompt and friendly.  Now I've only been here this one time so perhaps I went in on a good day but I just don't see any red flags here.  I guess you just have to keep things in perspective.  Their breakfast specials we got were $5 or less each and tasted more than it's actual cost.  I would definitely come back."}
{"text":"Your standard I-Hop or Denny's style menu.  The food was good and they serve large portions and the price is a bit much.  I had the biscuits and gravy which came with 2 eggs, hashbrowns and choice of bacon or sausage.  I selected the sausage, which was HORRIBLE!  Next time I will order the bacon.  Overall good and I would eat there again."}
{"text":"Never been to this place before and gotta say I was amazed with how great it was considering all the bad reviews !!! We were greeted and seated immediately and the server got our drinks moments later !!! My husband and I ordered the ultimate burger bar and the waitress walked us up to the bar area to show us how it worked...It was pretty cool that u could pick as much bacon, lettuce ,tomato, sauces, etc u put in a bowl and the cook makes your burger with as much stuff as u picked !!! The burgers were delicious and the fries were pretty great too !!! Not sure why people give such bad reviews for this place cause I for one am a very picky person and not one bad thing can I say about this place !!!"}
{"text":"I go to Lumberjacks for the happy hour prices. Happy hour runs from I believe 2 or 3 pm to 5 pm.The food is good and the bread and butter mix is to die for. I go just for the bread and butter mainly."}
{"text":"Came here just yesterday on a whim, got a table right away, it was quite empty so I thought it wasn't going to be too good (good places are usually packed).Was i wrong! The food is reasonably priced, absolutely delicious and filling and the service was outstanding! The manager here is absolutely charismatic, attentive and just flat out wonderful. Great experience and will definitely return!!"}
{"text":"The prices are fair to above avg. for a new, unknown restaurant in the Vegas market. Decor is plain both in the restaurant and the restroom.  Needs more excitement happening in the restaurant.  Just had a lumberjack video running over and over on the TVs.  Felt like a cafeteria.  Food was good, but nothing to write home about.  The meals that we were served lacked presentation.  Burger and fries on a plate and nothing else.  Silverware was very cheap.  Bathroom soap was cheap stinky kind.  Salad bar was plain.  Have to pay cashier like at IHOP."}
{"text":"We just got back from our first meal there. No it wasn't great food but it was good. I had the chicken fried steak and my wife had the pot roast. She liked the chicken fried steak best and I like the pot roast best. Pretty good swap. Portions were good size but not overly so. The service was fine, quick and friendly without be intrusive. All in all it was a positive experience."}
{"text":"Specializing in hangover-caliber diner food! If your car broke down here and you NEEDED to eat, this place will not let you down! The highlights begin and end at the swell lumberjack statue in front of the building."}
{"text":"Lumberjacks is a family oriented place with a small town vibe. The staff is  friendly and on occasion entertaining. Prices are reasonable for large portions. 

My absolute favorite breakfast item is the Banana Bread French Toast! This is the only place I've known to make French toast out of homemade banana bread. Not to mention it's completely delicious.  Their pancakes are larger than most people's heads and that's not an exaggeration. In my opinion the omelets leave a little to be desired. They are more like egg pitas with filling. At least there is plenty of other options on the menu. 

Lunch/dinner options are reasonable, nothing exceptional in my book but definitely filling. Overall a decent place to grab a bite to eat or share a meal."}
{"text":"SHOULD HAVE JUST WENT TO DENNY'S OR IHOP

Stopped by this morning for breakfast. We were seated right away by the hostess. We sat for 15 minutes and there were no servers in sight. I finally got impatient and went to let the hostess know that no server has come to take our order yet. The hostess had to walk to the back of the restaurant to let the server know that we had been waiting for over 15 minutes.

The server came immediately and apologized. She told us that the other server was on break and she had to cover both sides of the restaurant. A restaurant this size and only 2 servers?!!

I ordered the Chicken Fried Steak w/fruit for my side. It came with 2 eggs which I got over easy and a Strawberry Lemonade to drink. The Chicken Fried Steak was the worst I've ever tasted. Marie Callender's frozen Country Fried Chicken is 10 times better than this. 

My friend ordered the 10oz Sirloin Steak medium rare, B&G(biscuits and gravy), and an Iced Tea to drink. The steak was too tough. She said the gravy tasted like it was made from the powder gravy packets you buy at the grocery store. 

They have their AC on full blast so your food gets cold quick. We didn't even finish half of our food and we declined when our server asked us if we wanted a couple of boxes.

I don't think I'll ever come back to this restaurant."}
{"text":"Great food, kinda pricey but large portions. Worth it. Atmosphere is country and comfortable. Def coming back. Staff was friendly and plentiful with the coffee. Never rushed us once. There county potatoes are mmmmmmmmmmmm"}
{"text":"This place is great even though my first experience was negative one. Our first visit here we had a really long wait and to make a long story short, they lost our ticket. We spoke with the manager and she assured it wouldn't happen again and took the drinks off of our order. Every time since then has been great. Quick service, delicious food, and big servings.  This place has a very \"home\" feel to it."}
{"text":"Place is great food came less than 5 mins, staff is nice... Food big portions!!! Good prices too. Good job to all the staff here keep it up"}
{"text":"I've eaten here quite a few times now, and the food is great. Fast service and great pricing. Never hungry after I leave here. Bring my whole work crew here, and they love it as well."}
{"text":"Went there for a Saturday morning breakfast and had the worst waitress ever, and the food wasn't much better.  Quite frankly, if our waitress hadn't just started employment there 5 minutes before we arrived and received absolutely no training, then there's no excuse for how bad she was.

When we ordered our food, she had to have us point out the item on the menus so she could write down the right item.  She didn't know the menu at all.

After a half hour wait, had to practically tackle the waitress as she was bypassing us yet again to remind her that we were still waiting for our food.  She returned a moment later to ask us what our order was so she could resubmit a ticket for it.  I was shocked, to say the least.

She then showed up with our food a moment later and gave us each the other's order.  We fixed that and started eating, but she kept lingering at our table to explain... repeatedly... until I actually had to ask her to leave so we could eat. I've never had to be that blunt with a waitress before.  

The food.. hubby ordered a Big Jack's Skillet and had asked for extra gravy, which he didn't get.  He said it tasted okay, he was mostly happy just to finally have some food.  My meal was just 2 eggs, hashbrowns & an english muffin - and the only part of the meal that was warm was the english muffin.  The eggs were right on the edge of being cold, I had to eat fast before the last bit of remaining lukewarm heat disappeared.  The hashbrowns were dried out and cold, I barely touched those - but I totally enjoyed my english muffin - it was definitely the best part of my meal.

We asked for our check from the waitress on yet another run-by of hers and she showed up a few moments later with a check that was close to what we had ordered but with the drinks wrong.  She informed us that she had made an error but it was in our favor as the beverages she input were cheaper anyway.  I said \"fine\" and \"whatever\" and she kept carrying on about the $.25 diff she was saving us.  As we were trying to leave the table, she even came over and shoved a menu in my face to prove the price difference, apparently she was expecting me to have shown more gratitude for that quarter and was determined to get it!

Needless to say, when we got to the front counter to pay and they asked how things were, I had a few choice words to say.  They informed the manager and he said our breakfast was free, with the manager seeming truly concerned and wanting a detailed account of the disaster of a waitress we had.  He implored us to please come back again.. but I can guarantee you it won't be for breakfast.  The only reason they get that one star is because of the manager."}
{"text":"My family went for breakfast on Sunday. Our server was Felicia, she was nice and courteous.   I was very disappointed with my breakfast though. When I ask for over medium eggs I expect not to get running almost gross looking eggs with very running whites!!!"}
{"text":"We ordered the bacon and cheese omelette for 8.99, and upgraded on the bread for $1.00 for a pancake instead.  The omelette was large, and stuffed with bacon. There was so much bacon, it overwhemed the rest of the omelette.  The meal came with potatoes, which were not cooked all the way through (thick slices, slightly browned).  The pancake was just fine, but those have never been a favorite for me.  We also ordered off the senior menu, getting a two-egg omelette with cheese and mushrooms for $6.49.  This was the star of the show, as the mushrooms were plentiful and tasty.  There was ample cheese.  The hash browns were just okay, lightly browned, and an improvement on the potato slices in the other dish.  This meal also included a bisquit, that was huge, but didn't seem to be fresh (hard on the outside, cool on the inside).  The coffee was $1.99, and just fine (Boyd's brand).  For anviance, there was the mountain logger look for furniture, and 90's country music being piped in at a moderate to low volume.  I think that I will revisit this place on a weekday, when they have the ham and egg special for 3.99, the chicken fried steak special for $4.99, or the steak and eggs for $5.99.  As for this meal, it was just an okay value for the money, and there are lots of places that do breakfast better for less money in the area."}
{"text":"Breakfast for breakfast.  Breakfast for Dinner.  On this particular day it was breakfast for lunch.  GA had had already conducted a reconnaissance of Lumberjacks and thus it seemed a suitable option to dine.

Upon arrival and a quick check of the menu, I had pretty much already decided on GA's recommendation that I consume the Chicken Fried Steak (CFS) on this day.

I did make a cursory glance at the burger menu having seen a burger bar located at front of the establishment.  I did not pay it much attention after I spied you could \"load\" your house potatoes and/or hash browns..more on that later.

Our initial server was on point, though I cannot remember the name, her friendliness would eventually begin to slide.  Perhaps, she was late for her lunch break.  Thank you's deserve your welcomes.  As I recall, she did not conclude the breakfast/lunch for four transaction.

I ordered the CFS.  The eggs were over easy.  My hash browns were \"loaded.\"  Loaded- cheese, sour cream, and chives.  BAM!  This is a welcome addition to a potato prepared in any style.  Instead of bread, I went with a single flapper jacker.  Somewhat tasty, but lacking in any sort of warm to melt butter, I would eventually have to scrape it off.

Might be back...might not...All in all, a solid three star experience."}
{"text":"I don't plan to come back here. The first time I came after they opened it was real good. The next few times after that including this last week have been terrible. Service is so slow. Our table had to wait 10 minutes just to get drink orders taken after waiting 10 minutes to be seated. The restaurant is big but it was empty with maybe 2 or tables with people so I don't know why the wait was so long.

I ordered the Chili Burger, my wife ordered the Pot Roast Melt, and my friend ordered The Chain Saw. After our food arrived all 3 of us noticed problems with our food. My chili burger was opened faced with just chili and cheese. The burger and onion were missing! How in the hell do you forget to put the burger on a chili BURGER??? The server said it would be 20 minutes for them to remake it. I just said I would eat what was brought to me. My wife ordered the pot roast melt on previous visits and it was okay but this time her pot roast was very crispy. It seemed it was leftovers that they just heated back up at too high of a heat in a pan. The au jus they accompanied her sandwich was extremely salty. I tried a bite and had to spit it back out. My friends sandwich (the chain saw) had roast beef, tomatoes, mushrooms, peppers and bacon. It is supposed to be hot and came out ice cold. Maybe they took the food from the fridge and forgot to put it in the microwave? They brought him a new sandwich 10 minutes later and he said it was okay. We never got our drinks refilled once. I was surprised we had to pay for our meal at all. With the service being so slow and problems with the food I must pass on this place in the future."}
{"text":"This was my first and probably LAST time here.  First off the food is kind of high for being a \"upper Denny's\".  Well we went in about 4pm, there was only one other table with people, otherwise as I said the place was empty (That should have been a sign there).  We were seated fast, and the drinks came fast, we took out time looking at the menu which is on the high side if you ask me (hamburger meat, vegetables and potato for $14) but we saw a small menu that said 2 dinners for $12.99 before 5pm.  I asked the waitress if the meals were bigger in the main menu since the same items were on that one also at a higher price, she said \"No, the portions on the 2 for menu are smaller\"  (I thought that is what I said.)  Anyway we ordered the ground beef \"steak\" I had baked potato and Vegetables, my wife had mashed and vegetables.  Well our waitress went on a break and came back still before we had any food, about 40 minutes later our meal came.  (While we waited a few more people came in)  As we were getting our meal I could hear the waitress telling the people around us they have run out of vegetables and what else would they like.  So I guess we had the \"privilege\" of getting the last of the vegetables.  Now you may think I am kidding but the \"vegetables\" we got were about 2 tablespoons worth.  EACH.  I had 3 small carrots, 2 small cauliflower pieces and 3 HALVED prices of zucchini.  My baked potato was not cooked all the way as it was crunchy, my wife's mashed had big pieces of potato skins in it, also our \"vegetables\" smelled old, like they had been sitting around for hours if not days.  My meat was fine, my wife's was burnt and had gravy on it so you would not see it.  So needless to say at 2 for $12.99 ($14.03 with tax) was about $10 to much.)  Better go next door to Ruby Tuesday or maybe a Denny's."}
{"text":"My husband and I live near by and had paid a few visits to this restaurant. Our experiences were never good. My husband told me that the restaurant was \"Under new ownership\" that maybe we should give it another  try. So on Thursday'11/21/13 we went there for dinner.  I was not expecting too much. The only change visible was the  expanded menu.  The waitress, Kimberly , suggested breakfast. She said the breakfast's were wonderful, so we took her advice. Easy enough, a Denver omelet with diced potatoes and sour dough toast and 2 eggs basted with hash browns, sausage and sour dough toast. Now the place was not busy when we arrived and we noticed a table near by waiting for their food. 25 minutes later the table near us finally received their food, with lots of issues.  Our food was still not in front of us. It took at least 30 minutes for us to receive this simple order. We find out from our waitress, who by the was only 1 of 2 wait staff with the other person acting as management as well, that the cook was new and only had a dishwasher too help him. The food did not come hot, warm would be a better word. The basted eggs cooked through and the toast was not toasted, just warm.  The \"supervisor\"in charge was very apologetic and took the meals off..  I don't know who the manager is, but the staffing schedule was very poor and we will not go back or recommend this place to anyone!"}
{"text":"Came in for breakfast. Good stuff but you better be hungry! Large portions. Saturday morning and seated right away. Prices are good. Like I said, if you are hungry give it a try."}
{"text":"worst french toast I ever had.  It was supposed to be cinnabon flavored but had no taste, everyone elses breakfast was fine but I will never order their french toast.....yuk."}
{"text":"Customer service was friendly and prompt. My only qual was the quality of food, as my bacon and hash browns seemed to be just warm! Nothing really seemed fresh off the grill but still give this place a chance."}
{"text":"First time coming service was great , you get what youbpay for portions are pretty big so come with an empty stomach"}
{"text":"Omg the food here is wonderful. The portions are huge too. I would high recommend this place. It is like home cooking without the mess and dishes to do after. If you live here in Vegas you must come and eat...."}
{"text":"I really love Lumberjacks. My husband and I used to go every Monday as a day date. I can't believe it's the same place after reading the reviews. We've never had anything less than exemplary service with incredible food.The portions are huge and the service is fast."}
{"text":"coffees good, plenty of cream and sugar on the table so you wont have to ask for more.
the full menus available all day minus soups but only because they might not be ready. 

Nice clean place from floor to ceiling. Feels.really big and open. The log cabin feel is great reminds me of little diners up the California coast. 

The food portions are great and the price is good. 10.99 seems to be the average breakfast price. It taste good and flavorful. doesn't have that frozen reheated taste you get else where."}
{"text":"Yuck! Went in for dinner one night and ordered the pot roast. The meat was so severely overcooked that it couldn't be swallowed and the veggies were as hard as a rock. Tasted like they weren't cooked at all. The mozzarella sticks tasted like they used old dirty oil and my husband's steak was over seasoned and disgusting. When we asked for a manager, he refused to come out. Worst dining experience EVER."}
{"text":"Why does this place close every day at 3 pm?   They claim to serve Breakfast, Lunch & Dinner...who eats dinner before 3pm?"}
{"text":"We've had way too many ups and downs with this place and after our last visit this past week, we will not return. Or problem is never really with the waitresses, more the kitchen.  While we were there, they were  surprisingly busy, but we didn't mind. When we ordered, we were told it may take a little longer than normal, fine. I ordered the California wrap with crispy chicken instead of grilled and my husband ordered a burger with potato salad instead of fries. About 35-40 minutes later, our food arrived. He had fries instead of potato salad, easy fix. Mine however was the completely wrong wrap, I received the oriental wrap or something like that. At that point I just told the waitress, but told her I wasn't going to wait another 30 minutes for food so I wouldn't send it back. There was SO much oriental sauce in the wrap that I couldn't eat more than a few bites of it, it was disgusting. After all of this, she only took off 10% ( which was a whole $0.98 off of my wrap). We never leave here satisfied, it's always more problems then not."}
{"text":"Big portions.  I had chicken fried chicken and eggs.. its was really good.
Service was  good.. Coffee worth asking for more. Plenty of tables no waiting for seats.
Next time I have to try the biscuits and gravy."}
{"text":"Under new management and they have turned this place around! The service was quick and pleasant. Our food came out quickly and all correct. My mom was in from out of town so I was nervous about taking her since the service previously wasn't great but we were all pleasantly surprised.

Great job guys!"}
{"text":"Worst service ever! I ordered a simple bowl of oatmeal and raisin bread. It took a good 30 min. The waitress made no acknowledgement about the extended wait. Then the table who was their waiting before me asked was this a usual wait for food,  the waitress gave a a blank stare and through her hands up with no apology or care. I will not be returning and recommend people steer clear of this place. Even if it was not at the waitress fault saying that you are aware the meal was not in a timely fashion is proper customer service."}
{"text":"The first time I went to LumberJacks I ordered the veggie omelette, it was delicious. 
The waitress who took my order could have been a little nicer, she was a bit cold. (Seems like she hated her life)

The second time I went to LumberJacks (about two weeks later). I dined in and order the veggie melt sandwich. It was TERRIBLE!!
1. The bread was so hard, I thought I broke a tooth
2. Hardly any vegetables 
3. Hardly any cheese

The waitress rushed me to eat and was rude. There was only two people in the diner , so I don't know what her problem was. 
I ordered the bread pudding as dessert. It was surprisingly good and the portion was HUGE. 

I think for the most part this restaurant has good food. If they would hire better waitress's and a cook that cared a little more , this place could be fabulous."}
{"text":"Literally the worst restaurant experience of all time. We were seated quickly but our server didn't check on us for 10 minutes. Later another table was seated, within minutes they got their drinks and they got to order. Time passes and we finally get asked to order. I order the chicken fried chicken with hash browns and eggs over medium. My husband's and sister's food comes out and they tell me mine will be right out. They are half way done and still no food. I get my food and both the eggs and potatoes are wrong. She brings it back and fixes the potatoes but the eggs are still wrong. My family is done eating at this point. Meanwhile the table to our left has the same issue and they haven't even gotten their food. They get upset and decide to get their food to go. They were there about 40 minutes. It took forever to get service, no refills, no check ups, no friendliness, the food tasted like a buffet line (literally) and it was expensive! On top of that, I think I got food poisoning! Never going back!"}
{"text":"Run. Don't even bother. Unless your taste buds no longer work. Thank you Tabasco for saving the day. Very bland food and extremely slow service. It's not worth the drive out into the lovely ghetto of Las Vegas. If you want delicious food, go to squeeze in or Zenaidas (closed Monday Tuesday)"}
{"text":"New to Vegas. So happy my family and I found a near by breakfast place. I have no complaints, the food is delicious, the portions are big, the wait is not long, this is a dream compared to service back in California. Definitely our go to place!"}
{"text":"Our first time here, service is laid back, the waitress Felicia is very friendly.  It was not crowded.  Portions are large and delicious.  Hours of operation are 7-3.  I had the Veggie Melt, and onion rings.  Delicious!"}
{"text":"This was my girlfriend and I first time trying  place. The waitress was nice and friendly but the food was not as good as we were hoping for we ordered the pot roast which wasn't half bad and the the chicken fried chicken was nothing special and as for the baked potato it was terrible sent it back once because it was burnt and dry and and the second was just as bad.maybe they were just having a off day might try it again sometime"}
{"text":"Pretty decent food at an average price.  Service can be slow at times.  Average food and prices, worth the stop."}
{"text":"Waited at least 5-7 minutes for someone to come over. When someone finally did, we ordered. The cappuccino that we order looked like it came out of a machine and wasn't fresh. My mom got a Skillet that came out cold, but not being a complainer she just ate it. My omelette was hot, but lacking flavor. My potatoes were cold. I was really let down because someone told me about this.

Definitely won't be back. Bye Felicia"}
{"text":"Lumberjacks has a fantastic atmosphere, good food, and bigger portions. 
Just looking at the restaurant, you catch that country vibe radiating from it. You walk in and the whole building smells faintly like palm trees, adding to the theme. It's really nice. The waitresses are all very considerate and will go out of their way to assist you. The menu is pretty simple, and easy to navigate. Breakfast is served all day, and so is the rest of the menu. 
As for the pricing, all of it is roughly the same price as IHOP, but the catch is that the portions are at least twice the size. I got the French toast combo (4 huge triangles of French toast, 2 eggs, and 2 hot dog sized sausages) and it was less than $10. 
Needless to say, I will be coming here from now on instead of the IHOP counterpart, that's for sure!"}
{"text":"As much as I want to love this place, I can't. Waited a few minutes for someone to approach and seat us.y family and I were seated by a woman who turned out to be our server. She was very sweet and personable. The menu for this place is pretty extensive, to include breakfast and lunch items. We came here sometime around 0930-1030 this week, for breakfast. I ordered an omelet that had the following items: 4 eggs, onions, tomato, bacon, mushrooms... topped with sour cream and half an avocado. Along with my omelet were two pieces of toasted and buttered sourdough and a side of hash browns. The hash browns were 70% soggy and 30% crispy. The bread was ehh, 1 slice was barely toasted. The omelet itself seemed as if the items inside were on the griddle for a little too long. The prices of the meals are nearly comparable to IHOP. I had a taste of my husbands pancakes and they were more on the dry side."}
{"text":"The parking lot is always full so I assumed this place was going to be great. Unfortunately, neither my girlfriend or I enjoyed our meals. I ordered the spinach omelet and she ordered the enchilada omelet, both were completely bland and didn't even look appetizing. The bill came to $30 and was not worth it!"}
{"text":"I tried this restaurant THREE times.  I can confirm they are VERY consistent... consistently AWFUL!  Let me break it down.

ATMOSPHERE:  Empty and freezing.  There is a section in the front on both sides fo the restaurant that has huge AC vents blowing on you.  I love air conditioning, but this was insane.  I admit to being amused watching group after group being seated in this area, complaining, and being moved.  The wait staff would tell the manager who could not figure out the problem.  Also, this place feels empy.  The decoration is sparse.  They have TV's running lumberjack nonsense in loops.  AWFUL

BREAKFAST: Awful.  They have terrible bacon with a nasty aftertaste.  Their eggs are consistently burnt.  They have the most flavorless french toast which MAY have skimmed some eggs...  but I couldn't tell.  It was like eating wet white toast.  YUCK.  How was the coffee?  Well, the waitresses were all bringing in Starbucks.  I think that answers that.

LUNCH/DINNER:  Clean or fix the grill.  Aside from BURNING THE HECK out of my medium burger, the flavor from the grill is nauseating.  

OVERALL:  This place needs a major reset.  The food quality is terrible, the cooks clueless, and the grill NASTY.  I strongly recommend you skip this place.  If you have a serious Lumberjack hunger... check out Denny's.  It's 100 times better."}
{"text":"Super rare when I give 5 stars but this place is super deserving of that. This is about the 3rd time I go & I never have any issue with the food, people & establishment. The portions of food is huge. The price is super cheap for 2. The waiter Cindy was super nice & eager to work! She helped us with everything. This place is better than any other breakfast establishment I've been to."}
{"text":"my husband and I were in the area looking for bfast and decided to opt out on dennys and ihop, and it was for the better! I order cinnabon fremch toast and hubby had biscuits and gravy with sausage patty. It was delicious and not at all salty which we love! med-large portions and coffee came in a large enamel cup. Service was very friendly as well, great job cooks!! We will be back for sure"}
{"text":"Food is decent and the service is sometimes good sometimes not. The coffee isn't very good. The steak and eggs are good. I like the bbq chicken sandwich for lunch."}
{"text":"Gave 1 star before, now I'll give Lumberjack 4 stars. Wait staff are now more friendly and efficient.  Food has drastically improved. Breakfast meals are great with wait staff who now smile and seem happy to be working at Lumberjack. Breakfast choices are varied, quality is good, and quantity is large. Love the \"burger bar\" for lunch. Like the idea of personally selecting what I want on my hand formed burger. It is big burger. We'll be back!!!!"}
{"text":"We are from Chicago and omelette are usually filled with vegetables , meat and cheese all inside . Seems like in Nevada cheese is all outside the mix, why?
Coffee was weak, not the best service"}
{"text":"Place was empty on holiday morning. Should have known. Wife thought coffee was too strong & bitter.  I was ok with it. I got a skillet.  Potatoes could have been cooked longer, gravy thicker with more flavor other than flour,  & over easy eggs were way undercooked. Wife's banana bread french toast was ok.  They gave us the wrong bill. They had a 1 in 4 shot at getting that right & missed.
No thanks. Won't be back. Should have gone to IHOP couple blocks away."}
{"text":"Just ate here for the first time with my husband :)
We have been looking for a nice breakfast place that has a nice atmosphere and good food with a good price and NOW we found our place!
All the people working there were very friendly and smiling. 
The menu has so many choices to pick from and then once you order you can choose from multiple sides etc.
Food came quickly and was delicious! 
I had a Belgium waffle, eggs and bacon. My husband got the corned beef hash with potatoes and green peppers and onions and eggs over easy. 
We both cleared our plates! Yum!

They also offer military discounts which is a plus for all the military people out here.

Great place to take your friends or family when they visit! I'm sure going to!

Will definitely return!!"}
{"text":"Not impressed! My husband and I like eating places we haven't been at. So we are from out of town. We see lumberjack and say let try it   It's someplace new. Yeah thanks no thanks! 
We walked in as a customer is trying to pay was complaining about his service and food ( that should of been the big clue) the person taking his money said oh let me get you waitress.  He left and after a few minutes a mother person came up ( not his waitress ) now take it we are still waiting to be seated. The man makes the same complaint and they take his money and send him on his way. 
Still standing waiting to be seated. You would think this place was packed, due to 4 wait personal on the floor and only 4 tables with customers we will be the 5th. So we get taken to a booth the waitress noticed no utensils and said she would be right back with utensils.  Nope! We looked at our menus for a while then our waitress come up and asked what we would like to drink. She left a few minutes later she is helping her other table ok, we get that. Then after that she comes back our drinks and says oh you have no utensils. She takes our order one of us orders the Tri Tip sandwich she stated to us it comes out medium rare so we said medium is ok. Well well done is more like it! This meal was total lack luster    The atmosphere was like we were bothersome not a paying customer. Would I ever go back No! My coffee tasted like it was from a burnt coffee pot"}
{"text":"We are only visiting town and met my brother and his wife here for lunch.  It is not too far from where he lives in North Vegas.  It's slogan is \"where the big boys eat\" and it does have a pretty good sized menu.  Both my wife and I felt like breakfast for lunch, and they do serve it all day.  I had the chili cheese omelet, which was huge, in keeping with their motto.  It was four eggs, lots of very good chili, made with steak chunks, not hamburger.  It also came with toast and hash browns and I had trouble finishing it all.  My wife had the veggie omelet, which was just as big.  She thought it was OK, which to me is the best you can say about a veggie omelet.  The place could use a little more attention to cleanliness, it was a little grubby around the table.  The service was good, the food plentiful, and prices moderate.  Might go back again, but wouldn't go out of my way to do so."}
{"text":"I really enjoyed my experience at Lumberjack's. From the prompt and attentive friendly service from the staff. To the hearty portions they serve on traditional breakfast dishes. 

I had a traditional Denver omlette which has big chunks of ham, green pepper and onion. The eggs were tin light and fluffy and wrapped around the toppings like a sleeping bag. The country potatoes were great and if you like you could add peppers and onions for an additional charge.  The portion was a fulfilling size. 

The others in my party also enjoyed their dishes. The eggs Benedict and french toast were also very tasty. The food is made fresh to order with Lumberjack portions. 

The decor is something like I would see in my home state of WI. This is not overdone, like a Cracker Barrel with items packed along its walls. 

I plan to go back soon and explore the lunch menu. Full menu is available during operating hours, however they close around 3, so get here early."}
{"text":"I've given this place 3 tries & its the worst. Horribly slow & not helpful service. Cold food & super bland. I'm not a pickey eater but I will never eat here again"}
{"text":"Not too impressed, ordered the hot roast beef sandwich and received a cold sandwich I could make at home. Had two bites and couldn't eat the rest... Just gross..."}
{"text":"My 4 star rating is for their breakfast/brunch.
Get ready for some seriously huge portions. The restaurant is spacious and clean. Everything is themed around lumberjacks so get ready to eat like one - big coffee mugs, gigantic biscuits, heapings of meat! I'm definitely not complaining. 
Lots of variety and breakfast options. They even have a \"smaller portions\" section which is great if you don't want to be wheeled out. Whichever dish you choose, you must spring the extra $1 to get the side of biscuit and gravy. It's a hamburger bun sized biscuit which they cut in half and cover in white gravy and it's my favorite thing. So comforting and delicious. The side is big enough to be a full entrée. Always happy and full which makes this my go-to Sunday brunch joint."}
{"text":"Lumberjacks is a nice substitute for the typical Denny's or IHOP breakfast. The restaurant was clean and well kept; though it did smell like bird poop and dirty rags. The food was decent, but the French toast banana walnut bread was delicious! The service was average. The only interaction between the server and myself was when she took my order, making no attempt to make the experience personable. Overall I'd say give Lumberjacks a try if you're ever craving a different breakfast restaurant."}
{"text":"We made the mistake of coming here and not just eating at the cafe in the casino down the road. We paid more, got worse service, my skillet was burnt, the Buffalo wings my wife got were soggy, my son however, loved his kids burger. 

Our server was sweet but forgetful...won't be back and couldn't recommend coming here."}
{"text":"Breakfast galore I would say.. They are a lumberjack themed place. The first time i came they had a wood cutting competition on the TV, after I've only seen sports. I've only been here a few times but it's pretty basic. I've had the chicken fried steak and the regular steak. The chicken fried steak has a pretty good gravy. I'm totally down to come back for that. The steak I asked for medium but came medium well, my toast came out cold but they gave us an extra biscuit. When I order the steak I decided to get fruit. I always forget it comes with melon and honeydew.. not a huge fan. The waiter was nice and helped us when ordering. My friend wanted to switch some stuff out and they were pretty cool about it. Quick and decent meal in all. At the counter up front they have some big huge chocolate cake. They can box it up on the way out for you to take home and eat on your own. They also carry beer to turn up for Sunday brunch."}
{"text":"We came for breakfast and were very happy with the food and service! Pancakes were absolutely amazing. Hot chocolate was really good as well! Definately recommend."}
{"text":"Lumberjack's Restaurant... don't even bother! I can't urge you enough to stay away from here. Slow wait-staff wearing filthy uniforms. Filthy floor, filthy tables and seating. Tasteless food delived at a snail's pace. I-could-give-a-shit attitude as thick as their mindless skulls. Oohhhh, and the \"salad bar\"... lettuce AND carrots AND cucumbers. No!! Really, it's just too much! You're better off just throwing your money in the gutter."}
{"text":"Good food and large portions.    Had a great dinner here and lunch.  The staff is fantastic and friendly."}
{"text":"Having breakfast at the lumberjack. Its kinda my treat to myself for living the healthy life the rest of the week. I enjoy the ambiance of the place. The service has always been good for me, although typically when Im there on sunday mornings they don't appear to be that busy. The waitresses and server all seem to respond to my needs as quick as possible. I have no complaints with the food at all. I love a good breakfast and they do breakfast well. I've done Denny's and IHOP and frankly while I'm in Vegas, Lumberjacks is my goto breakfast place."}
{"text":"We both had the breakfast. I had the griddle sampler which was huge (beware). The banana bread French toast was rich and decadent. 
The wife had the chicken fried chicken. Which was very tasty. 
We both loves the applewood smoked bacon. 

Overall the meal was very good, service was pleasant, and the restaurant was clean, but the seats were a little worn down.  

I'd come back."}
{"text":"Because it has been a year, and we were hoping this restaurant had done some house cleaning, we decided to try one more time.  Yup, one more time..... The first thing we noticed was a big sign outside that said \"TWO DINNERS FOR $20.00\"  Great, sounds good to me - I can always appreciate a discount for dining in Las Vegas.  Husband ordered the pork loin and I ordered liver and onions.  Both of us went for the salad bar.  Salad bar was good - lots of items to add to the lettuce.  Then our waitress came over and said no more pork loin available, so hubby decided to try the chicken fried steak once again.  BTW, our waitress was GREAT!  She was very sweet and very attentive.  My liver and onions were very good, I must say, so I thought maybe we were on a roll and this restaurant had gotten their act together from our last visit.  Then my husband says, \"This CFS batter has a bad taste to it.\"  Ut oh, not again.  He did think the gravy was ok, but not the batter.  And, by the way, still no veggies are served with their meals.  You have a choice of baked, mashed, or fried potatoes, or vegetables.  If you want veggies on your plate they are going to cost you extra.

Now, here's the kicker.  We both ordered from the \"dinner\" side of the menu, but our check was almost $38.  When we asked the cashier about it she stated it was because of my liver and onions which were not included in the \"dinner\" $20 special.  What?  It was listed under dinners!  She said our waitress should have told us that.  I asked what dinners were included and she said, chicken fried steak, pot roast, some kind of chicken, and it seemed like everything else but my liver and onions.  Oh, BTW, my liver and onions were one of the least expensive items on the menu.

So there you have it!  Definitely going to stay with Joe's Dinner, Sunshine Cafe, and Harvest Cafe (my favorite).  They put this place to shame, and I so wanted Lumberjacks to be something special since I'm from Montana and love the log cabin look with the BIG GUY out front!"}
{"text":"Went here to try something new but place was kinda of dirty, and had a poor smell. Food quality was poor, was disappointed. Nothing was great not even the service."}
{"text":"One weekend, my husband and I decided to visit our family in Vegas. Our family wanted to get together to have a great memorable breakfast and my sister in law picked this place. This place had a great reputation with my father in law, so we decided to give it a shot. When we came here for family breakfast, the experience was less than satisfying and an epic fail ! 

First, the server dropped a steak knife on my husband then she dropped toast on him.  This woman did not even say sorry for her actions. The bottom line here is she could have badly injured my husband with dropping the steak knife tip down. I feel that the waitresses here crumble under pressure ! They are in a hurry and don't take there time serving. What kind of a server doesn't know if the steak is well done or rare?! The wait staff exercised poor skills in serving and customer service. It is apparent that management has neglected to training there employees.

 Second, it is unacceptable to make someone wait 25 minutes for a meal without checking on it.  Everyone was half way into there meals and I hadn't even gotten my food at all! The waitress that took my order didn't even relay my meal to the kitchen and that's why i waited to the longest for my food. She didn't realize it until after the manager went to the kitchen to check on my order. 

Lastly, when my sister in law spoke to the manager on duty about why the service was below par and why I had not gotten my food yet.  His answers were less than acceptable. He had the nerve to say there's a lot of orders and so much pressure on the staff. What kind of lame excuse is that? Too many orders is not an excuse to not serve customers in timely manner and with quality service! If you cant take the heat get out of the restaurant business! 

Dont ever go to this place if you want a good quality meal with your family, especially if you have a big family!"}
{"text":"This was our first time at Lumberjacks. My family and I were very pleased with our experience and loved the service provided. Daisy, our waitress was very sweet and attentive to our experience and needs. Our food was delicious and cooked to our perfection. 

We will be making this our family go to breakfast eatery. Thank you Lumberjack staff!"}
{"text":"It would've been 5 stars,  but service was a little slow.  I had the Griddle Sampler which I thought was excellent.  I love the atmosphere.  The decor is really nice.  My partner had a classic two eggs breakfast and he enjoyed it.  Like I said,  if I didn't have to wait for a refill on my water it would've been a 5 star experience.  Especially because of the fact that it wasn't busy at all."}
{"text":"We use to eat there a lot, but today I was very disappointed, my hot chocolate was like water, I asked for just biscuits they brought biscuits n gravy, well the biscuits was like 1 wk old hard as a rock, I also ordered hash browns, n sausage links they were burnt. Now my husband ordered  the banana French toast Oooh! It had a funny taste mind u i had them before n they were delicious, but today they were gummy, service was ok, we will never go back !"}
{"text":"I have visited this location several times and have introduced it to several friends and fellow Yelpers. The service has always been friendly and the portion sizes have always been generous.

The chicken fried steak comes standard with eggs and choice of potato. You also get your choice of bread, which includes a large biscuit. For a small up charge ($1.00 I believe), you can substitute pancakes or biscuits and gravy. The first time I substituted pancakes I could not believe the portion size. You won't leave hungry that's for sure. 

The Mrs. ordered chicken fried chicken. It is literally chicken fried steak, only with chicken instead of beef. I was pleasantly surprised and may order that for myself the next time. The coffee was fairly decent and the atmosphere is reminiscent of a log cabin. 

I have never had anything other than breakfast here, but they do have a \"burger bar\" that I am eager to try. All in all, Lumberjacks has been consistent and merits a return visit."}
{"text":"After a morning spent in the ER we were famished. We couldn't really agree on what we wanted so the wife and I compromised with Lumberjacks. Boy I'm glad we came here. It was exactly what we needed. Good old fashioned stick to your ribs food. I had the chicken fried steak breakfast and my wife had the tuna melt. We both thoroughly enjoyed our meals. The waitress was nice and attentive. I can't wait to come back and try their pancakes. They looked delicious."}
{"text":"Had I given a review six months ago I would have given a 2.5 or 3 out of five. 

Now, with the fact that it is run under new management the service and food quality are much better and I'll try and go more often. 

My only experience since the new management took over was for Breakfast. I got a Breakfast club and really enjoyed the food. I have had the regular club for lunch here before and gladly the breakfast club lives up to its name. Generous portion of bacon, ham, cheese and eggs.

I also think the wait staff were better this time around. More genuine and attentive. 

All in all I'm happy Lumberjacks new management have taken poor reviews to heart and seem to be addressing the previous downfalls of this restaurant. 

Only odd thing is that this place is closed Sundays. Maybe the new owners deserve some rest too! But I thought the Breakfast service on Sundays would be nice."}
{"text":"Food is amazing! Service is extremely poor. We ordered our food. Mind you it was for three. The couple who came after us by 10 minutes received their food before us. Would never recommend this place to anyone in Vegas!"}
{"text":"If you are looking for a quick reasonably priced place to eat,  this is fine. But be aware that you get what you pay for.  The staff were friendly and accommodating which was nice.  The chicken fried steak was processed and frozen, not fresh. They don't use real butter on the toast so it leaves it kind of watery tasting.  The country potatoes were fabulous but I had to pay extra to have the onions and bell peppers added to them.  Overall it was an ok meal for the price but nothing to brash about."}
{"text":"Ordered breakfast to go this morning. Hostess was friendly. And I was in and out within a few mins.  The food was ok even though one of the orders were completely wrong. The portions are huge. Sausages need to cook longer. But overall ok."}
{"text":"I have had one great experience here and one terrible. I give it 3 stars because I have to be fair to the 1st experience but as well the 2nd. Both of these experiences happened 3 days apart this last week.
The first time I had a \"Pot Roast Melt\" and it cost $8.95. It came with a side a fries.
I thought it was very tasty and would totally order it again.The Pot Roast had a lot of flavor and the bread it was on complimented it well. The service this time was great!

The 2nd time (this last visit) we ended up walking out :( We walked in and got seated right away.
This time we were there for breakfast. We sat there for 30 YES 30 minutes and never got asked for drinks let alone had or order taken. I saw the severs gossiping and laughing among themselves. They were clearing tables and saw us but never actually came to our table to serve us. I have to say about 15 minutes into the 30 minute wait the Hostess  that seated us had a puzzled look on her face when looking at our table and walked over and asked if we had been helped. I said \"no not even a drink order\". She walked away and the other 15 minutes went by. We decided to leave and go somewhere else instead. The Hostess as well the Manager were standing right there at the door and I said \"this is absolutely unacceptable and we wont be back for a long while if at all\". She did say she was sorry but I mean come one why not her or the Manager handle it? Why would they just let money walk right out of the door?

I enjoyed the first visit, but the second was terrible and enough to make me not want to come back. If friends or family want to eat here then I guess I will be wolfgang stuck, but when there are tons of yummy choices right there on Craig Rd I sure hope they don't."}
{"text":"This was my second time at lumberjacks. Me and my parents came expecting a hearty breakfast. They seat us within about 5 minutes and they take our order. For a decaf coffee, it was very strong. I ordered the Timber Melt and it was very delish but the steak was a bit chewy. My father ordered the Meat Lovers and it was very lack luster. My mother ordered Biscuits and Gravy and it was very large. By the time our food had gotten to us it was very cold and it had to be re heated. The service was a little slow but manageable. Overall not such a good expirience. I won't find myself coming back here anytime soon."}
{"text":"Me, my boyfriend and his mom went here for dinner last night.  When we order our food my boyfriend order biscuit and gravy with his dinner he had to wait ten minutes after he ate his omelet. When he finely got the biscuits and gravy, the gravy had no flavor to it and it was like water. The biscuits tasted like it was old."}
{"text":"It was the most painful eating experience I've ever had. I have five kids and I understand that a large group takes a little longer, but this was just a train wreck. After being seated it was about ten minutes before our order was taken. Then more than a half hour before our food came out. The food was burned, dry or cold. Only one of the seven plates was edible. After they took forever to bring the food it was like they were embarrassed by the service, the food or both that they never came back to see how anything was. We didn't get refills or even a glance back to see if we were ok. They brought the check and that's when I got a hold of the manager. I let him see how bad the food was and explained how bad the service was, they did take some money off. I was more than happy to pay for the food, but they refused to take the money. I just hope they don't treat all their customers this way."}
{"text":"Went the other day I got the hot beef open faced. It was good the brown sauce a little salty but they ask how you want it the meat cooked. It was fresh and huge portion. The kids meal on the other hand mac and cheese is nasty. Seriously with all the decent food why would you use kraft or whatever store bought mac n cheese its easy to make.Servers were nice and fast. All in all the food is family restaurant huge portions average typical fam restaurant food and they got 2 for 20 deal just ask what it includes its limited but still good stuff. I would definately go back it a chill restaurant and not a huge corporation you are giving your money to."}
{"text":"excellent service and food.  This was our second visit.  We ordered breakfast of two egg platter.  Portions were good, eggs cooked just as ordered, didn't have to wait long at all."}
{"text":"One of my favorite breakfast spots, if you wanna eat like a lumberjack than this is the place for you. The portions of food they give you are massive! I've been here a couple of times and every time I was unable to eat all of my meal. Service is okay not the greatest but I can't complain due the fact that it gets busy in the morning. The food tastes great nice and hot and you even get a choice of biscuits and gravy as your side bread! The gravy is amazing it has little chunks of sausage all you have to do is put some salt and pepper and your set. The reason I didn't give this place 5 stars is the way you pay for your meal when your done . The waiter/waitress brings the check to your table then you have to bring that check up to the front counter in order to pay. And if it's busy  it can take a while to pay if everyone is try ing to pay at the same time as you. But other than that I recommend this place go go go!"}
{"text":"Decent food. Very large portions as implied by the name. Service is usually satisfactory. I have one major gripe about eating here...the TVs only show a silly lumberjacks DVD on loop. Which, by the third time you're here, is redundant and unimpressive. Other than that, a nice weekend breakfast spot."}
{"text":"My mom said her food was delicious, she had the big johns skillet.. mine was mediocre, I had the breakfast burrito, loaded with fatty gristle-y ham and bacon. It was so chewy I couldn't eat it. I asked for well done potatoes, they were not well done, my bacon was almost well done but not crispy enough for me, however it's a thick cut of bacon so I believe they did the best they could. 

Our server Felicia was ok, all over the place and she forgot my kids drink until we were almost done with our food.. she didn't check to make sure our food was ok otherwise I would have mentioned about the issues with my food immediately, I did tell her about the meat issue with my food later on, I know it's not her fault but hopefully she can tell mgmt so they can fix problem so it doesn't happen again.."}
{"text":"I have been going for breakfast here at least once a month.   We have had great service every time.   The food has been on par every time.   I think the only bad thing we had was potatoes that where over seasoned and they replaced them right a way.    My friend and I decided to try them for an early dinner and was amazed.  during the week they have a 2 for $12 happy hour.   I think the hours are 2-4pm.  I had pork loin.  My friend had the chicken dish.  We loved it!!   The loaf style dinner rolls we wanted to take home!!

So I really enjoy this place and will be eating here again and again."}
{"text":"By far the worst customer service I've personally ever had, So as we walk in we realize it's kinda packed. No big deal right? Wrong, It took us 15 mins to get seated so I thought no big deal. So as we are sitting there waiting for somebody to come take our order I notice nobody around us has their food and had looked like they were there for a while. So finally 15 mins later a waitress comes to take our drink order then that also took about 10 minutes for her to get back. So we get our drinks and then it takes another 20 minutes for the waitress to come back and take our order our food. So we ordered our food and it took 40 minutes before somebody realized that we were clearly upset. So A different employee comes and asks us if were okay and if we needed anything, We tell him that we've been waiting 40 minutes for our food. So he goes and tells the waitress that originally took our order and she walks over to our table very aggressively and clearly upset and tells us very rudely \"No y'all have not been waiting 40 minutes.\" So we explain to her yes we have and told her what time she came and took our order Then she continues on to argue with us, She was very rude and unprofessional. So we give it some more time, Once it hit exactly 1 hour the on-site supervisor came and spoke to us. She was very nice and polite, She told us that she would go back there and handle our food and get it out as soon as possible. But I told her \"No it's ok I'll pay for our drinks and we were going to go somewhere else.\" She didn't make us pay for our drinks, That's about the only positive thing I have to say about this experience. I do not recommend going there. The food is decent but that place has done nothing but go downhill, Very terrible customer service and it wasn't even that busy. I will never return there."}
{"text":"Omg, this place is much better than Cracker Barrel. Have u seen their biscuits? Really impressive, dinery/ country vibe."}
{"text":"I Ordered the soup and salad for lunch. The loaded baked potato soup tasted like old bacon, they were nice and replaced it, with what tasted just like Hormel canned chili. I gave up and picked at the tiny dinner salad instead. The breakfast items my family order seemed much better than my order, but not enough to earn a return trip. There's way too many places in Vegas to eat, so to serve food like this is not a good way to stay in business. Our waiter was nice, but the lady that seated us and took drink orders acted as if she was ready for us to leave, acted like it would cause physical pain to crack a smile. I don't think I would want someone like her, to be the first person you encounter at my establishment."}
{"text":"So as we all know, North Las Vegas is starving for restaurants.  I was so excited to see something new come to our side.  The service was AWESOME.  This crew is amazing and positive and friendly.  The food however was well, just ok.  Compare it to a Dennys or IHOP, just with bigger portions.  Will I go again, probably.  Will I expect to be wowed, probably not."}
{"text":"Service is good.  Food is OK.  Not sure why anyone would plant a giant plastic Paul Bunyan in North Las Vegas or why they would place a lumber themed restaurant in the middle of the desert.  The place reminds me of Dennys or Ihop - definitely a breakfast for dinner kind of place.  Portions seem a little small for a lumberjack if you ask me.  The biscuits and gravy tasted pretty good."}
{"text":"If you're in North Las Vegas driving through Craig Road, you can't miss this place.  It's the wannabe log cabin looking restuarant with a huge Paul Bunyon statue in the front. 

I really tried to like this place, I really did.  Been here twice.  My first experience was the first month this place opened up. My last time was about 3 months ago. 

First of all, both times I've been here I've had less than stellar service.  I mean, how long does it take to bring water to you and silverware?  I could easily overlook poor service if the food was good, but it was just average.  

-Big Redwood Burger:  $15 and it was average at best.  Had it for lunch.  Looked juicy, but it was dry.  I ended up going to Five Guys later that night just to redeem my experience.  

-Country Fried Steak: Actually not too bad.  Forgot what I paid, but it did't taste any different than an IHOP or Denny's.  

Portions are big, but not Hash House big.  You would expect a restuarant named Lumberjack to have overwhelming portions.

I did't want to get into to much with the service, because enough is said on these reviews.  Up to you to try.  Everyone is different.  Just my experience, 0 for 2 at this place."}
{"text":"Lumberjacks takes on a refreshing change in breakfast food!  It's not like your IHOP or Dennys. Service was great and attentive the entire time.

When the food came out, I ordered the breakfast burrito, it was flavorful. The food wasn't very hot though and the hash browns were a bit lukewarm. The fact that the food wasn't hot brought my rating to a 3. If it were hotter I think the flavor would have been even bolder, for an overall better food rating.

Worth a try, and a good experience overall."}
{"text":"This is our second time coming here. We haven't received our food yet but I can say our first visit was better already. It was busy then and service was a lot better. Just waiting to order today was a wait and it is not busy at all. Food just came in a fair amount of time.

Received our meal and our country potatoes were cold on both plates, received one egg instead of two and my pork lion was  tough. This experience wasn't great at all but our first time here was outstanding which is why we came back. Not sure what changed."}
{"text":"LOUSY SERVICE. Had to wait forever for waitress for drink order. Table was not set had to ask for silverware and napkins. When 2 seven year olds are seated extra napkins are a given. This is Server 101 people. When the food is just OK, you better have good service. Second visit second service epic fail. WONT BE BACK.  AVOID ."}
{"text":"Huge portions, friendly staff, i didn't experience any issues like the negative ones on here, i guess sometimes it can be all about the server you get."}
{"text":"Service was bad.  Had to wait 15 minutes to be seated.  Waited another 10 minutes to be waited on.  Waited another 20 for my meal.  Food was poor... cold and sloppy."}
{"text":"Been wanting to try this place out for a while, but saw some sketchy reviews. So glad I came! Service was great, food...EVEN BETTER!! I had the chicken fried steak & OMG! So delicious! You will not leave this place still hungry. The portions are huge! I will most definitely come here again. Even my picky kids were satisfied with their meal."}
{"text":"Banana Bread French toast was good, but should have been cooked longer as it was mushy in the middle. Service was not very good and they weren't even crowded. Our waitress never came back to check on us after bringing us our food. We were done eating when she finally came around and asked if we wanted more coffee-we replied no just the check please. After waiting for over 8 minutes to get the check we got up and went to the counter. I will go back as the menu has lots of great choices I want to try, but will definitely get a different waitress."}
{"text":"I had a great lunch with my partner and nephew.  The portion sizes were quite large and I couldn't  finish my plate, which is weird for me :) Our server though great at making sure my drink was filled for our entire visit, was not very friendly.  Our bill was over $50 and defiantly not worth the service. I would totally return if I felt the servers cared.  I've worked as a server, and if you want to make money, at the very least, you need to be nice :) I promise, you're tips will be bigger :)"}
{"text":"We dined here for breakfast on Valentines Day and there were people already waiting to be seated. The hostess notified us that it would be a 15 minute wait and we only waited about 10 minutes. I thought the food was great. I had the California Omelet and everything tasted great and was hot. Daughter had the Axemans Griddle Sampler which includes eggs, bacon, sausage, 3 mini pancakes, and a slice of french toast and banana walnut french toast. Yeah, she took most of it home. Hubs had the meatlover's scramble with a side of biscuit and country gravy. I appreciated that they had all of the condiments already on the table instead of having to flag down a waitress for every possible thing that I would like to tailor my food to my specifics.

 I broke out my crossword puzzle book and me and the family did that while waiting for our food. It seemed like it came quickly as we were kind of annoyed when it got there. Go figure, we like doing crosswords. I was pleasantly surprised as I hadn't eaten here before even though living in the area for the past 15 years. I will definitely be going back for lunch and dinner to see what they have to offer. Whilst looking over the menu, they have a lot of offerings no matter what you may be in the mood for. I plan to try their chili for lunch and pot roast for dinner soon. They also have various soups, salads, wraps and dinners your grandparents would've been eating in the 50's and 60's. Its worth a visit for an extended family meal. 

I gave four stars because after we finished our meal it took a considerable amount of time for us to get the check. I hate being held hostage with empty plates in front of me after I've finished my meal. I like to get the check and get gone."}
{"text":"I had been to lumberjacks before and it was decent with large portions. I went there for my 4th time and ordered the corned beef hash... it was next level amazing! I've never had better! I now highly recommend the place for that meal. Yum."}
{"text":"My family and I have comes to Lumberjacks a few times. Breakfast is always delicious ! The service isn't the quickest and it's probably do to not have enough servers but they are always very nice."}
{"text":"My friend & I were getting our cars serviced across the street so we came here to get a small bite. Long story short, my friend & I went to the restroom mid breakfast & they thought we were done (which I don't blame). I came out first & saw our table cleared and asked if everything was okay. Our server seemed confused because it looked like we left. She was so apologetic & asked if we wanted to have a fresh batch of food. I was honestly full & so was my friend so we said it was okay. Overall, the service was great because she always checked on us & made sure we were okay. She picked up our check because we weren't quite done and we were so appreciative."}
{"text":"So... I have visited this place twice in the past two weeks. 

The first go, boyfriend and I walk in... We've been here before. We know the food is good. So it was a bit of a surprise when the girl that was supposed to seat us told us there's a wait and there's open tables. We sit down at a bench waiting. It was 9:30 or 10:00 and it wasn't crazy busy. The front girl sits a couple of military men that showed up the moments before us.  The girl stands around, three or four groups of people leave after eating and we waited about 8 minutes. The manager came over grabbed some menus, told us to follow him, tossed the menus on the table and walked away, telling the front girl that there shouldn't be people waiting with open tables. He doesn't tell us that someone will be with us or anything. We sit there at a booth waiting for another 10 minutes before a waitress even acknowledges us. So, obviously we're already frustrated. We decided to leave. And chalk it up to a bad day for service there. 

This time... We walk in we're seated immediately and with a smile. So we think everything is back to normal. And a waitress comes over to take the order from another table right next to us. At this point it's been 7 minutes before she acknowledges us... That's okay, maybe she'll get our drink order or tell us she'll  be right with us and actually do it. No. She says she'll be with us, and walks away. Puts that other order in and hangs out talking to another waitress for a bit and disappears. We wait for a total of 12 minutes.

Normally we have more patience. But I think we were sour from the last time and just expected better from Lumberjacks. 

It's not a one star because I know the food is good... When the service exists. 

Tl;Dr -  bad service, waited too long for service. Left."}
{"text":"Today was our second visit and began well, waitress was a bit slow on the greeting and taking our drink order but we were patient. Diane was very friendly and helpful when we finally ordered (about 10 minutes later)After taking our order she never came back to check on us and we ended up with empty cups. After probably another 10-15 minutes a girl brings our order around, with a promise that my pancakes would be up shortly. 
We were disappointed after waiting to find the food was mediocre everything was luke warm. the bacon was rubbery and my boyfriends pancakes were so cold the butter didn't even melt, my boyfriend ordered country potatoes that were barely cooked. After eating very little of the food and waiting for my pancakes which never arrived, when the waitress finally came back by I asked her to just take the pancakes off and bring us our check. She apologized and said she would, once we got to the cashier we saw that the receipt said \"military discount 10%\" I explained to Tamika(the cashier) that my boyfriend was in fact military but that the pancakes were never taken off, she explained that the military discount was applied for the pancakes. 

She then proceeded to give me attitude and explain that they could no longer give discounts as cashiers. I said I could understand why if this was the service everyone received. She gave me a dirty look and said I was entitled to my opinion. To make matters worse she never apologized and acted as if I were in the wrong. Waiting until we had paid to offer to get her manager.

This was some of the worst customer service I've received. We wont be back."}
{"text":"Food was AMAZING!!!! Service was EXCELLENT! For the first time I was surely impressed."}
{"text":"Came here for another chance on them, much better. Granted nobody was in the restaurant, but the service was much better and food came quick along with drinks. She checked on us periodically. Overall, better experience."}
{"text":"The food had no flavor, I ordered the meat lovers skillet and was a bit disappointed, it was very bland. My drink tasted funny, again with no flavor. The waitress was very friendly which is why I'm giving a 2 star review. The restaurant itself was very dark.."}
{"text":"So far my wife and I have ate at this restaurant twice and love the food. The second time we met the manager and we were pleased to speak to her while we were there eating."}
{"text":"I went to Lumberjacks on Sunday morning around 9:40 and it was not very busy. After our table placed the order, the server told us it should be out relatively quick. Well, he wasn't lying. We had our food in under 10 minutes. I ordered the short stack of pancakes (2) as did my friends, although they also ordered the plate that includes eggs and sausage. The portions are huge and when I say my pancake was the size of a Frisbee, I am not exaggerating! My friends were able to split their plate with eggs and sausage. 

The pancake had a nice crisp on the outside and was fluffy on the inside (which is how I like it because the crisp can hold up to ridiculous amounts of butter and syrup). It was very flavorful and reminded me of the Hoecakes my great aunt used to make. 

The best part was probably our server Josh. He was very friendly and made sure we were well taken care of, which is why I give this place 4 stars instead of 3. Good service is hard to come by in Las Vegas. I will be back!"}
{"text":"Right off the plane and ready to eat some breakfast! 

My father lives in North Las Vegas and this restaurant is right up the road about 10 kinutes away so it was perfect.

We got in pretty early around 7 am and was sat right away, the atmosphere and interior is very woodsy and matches the name of the restaurant to the tee!

There was only 1 server working in the entire restaurant and she had maybe 2 current tables but she was a hustler and moved pretty quick around the restaurant with refills and food delivery.  I was surprised no manager was on the floor assisting.

The menu was fairly large and too much to scan so I went ahead and ordered the special that was posted out front Steak & Eggs for $9. Steal!

When the food was delivered I was very pleased with everything except for my steak. It looked to have been cooked only on one side, I ordered it to be Medium but when I got it and cut it open it was very rare, as if they just flopped it on for a bit and maybe even microwaved it. I was not impressed I decided to just try and eat some of it but could no longer bare it  so I let the server know and she went ahead and requested for a new one. The one thing that I will give them a fail at was instead of changing the entire plate out they cooked the same steak I had already eaten some of and re-cooked it and just added it to the same plate did not change the plate. I noticed it still had blood from the last plate so it was the same plate. 

Will probably give them a try again, my dad really likes the French Toast maybe I'll stick with the regular menu instead of the specials!"}
{"text":"Bread pudding without raisins! Omg, fried with caramel sauce!! I've decided that this is a must order for every time I visit. The food was really great and the service was awesome. I haven't been there for breakfast but the dinner service was great."}
{"text":"Breakfast is the best way to start your day or end your night. .Lumberjacks has an amazing menu,  and their staff are fabulous. I had a skillet which was generous in size for price.Would truly recommend this place."}
{"text":"This place is just, I don't know
Basic and I wouldn't go Babi asked the waitress for grits and she responded \"this is the west not the south\"
Grits are at Dennys IHOP lots of places 
Don't go out ur of your way for this place. It's all the way in nlv 
I was showing a houses to clients in the area. We all weren't happy 
Just a basic place"}
{"text":"Ok first walk in they give us seats but no one came over and ask us anything for bout 10mins then the black lady stop what she was doing and ask if we been help we said no she said ok I'm help u just let her dump the plates which we was like ok as she was take out order white guy walk in they set him down nd 2  waitresses came nd talk to him his food came when ours came which was weird so when we got our food another white guy came and they did the same thing just didn't feel welcome....just wanna thank the black lady Felicia for take time out to help us"}
{"text":"Ok so let's just say the first franchisee ran it to the ground fast. Then they sold it to another franchisee. They couldn't regroup so. The Corporation took Control of it again. Thank you Lumberjacks for making it better. We were your very first customers at this location. Welcome Back. Thank you."}
{"text":"Our favorite breakfast spot! Up until I decided to follow a vegan diet this place was our favorite! I still go with my husband sometimes and watch him devour our favorite country fried steak and eggs. The coffee is always hot. Service is great. Usually busy in the morning. Definitely great food."}
{"text":"Great food at reasonable prices and great customer service, will be retuning for sure"}
{"text":"Best breakfast ever! Every time my wife and get a chance to have an amazing breakfast we choose to place!"}
{"text":"Great breakfast . Huge portions great prices. The staff is very friendly. I have not tried their lunch menu as of yet. But I plan to and will update my review as soon as I do :)"}
{"text":"The responsiveness to customer queries via the LJ website is nil.  Seems to be an eat here if you want but don't bother us otherwise attitude.   Now that Cracker Barrel is down the street and my closer to home Fire Rock is serving very decent breakfast, sadly it's Lumberjacks once inviting destination now very lacking.   
  Once upon a time this place turned out good large quality meals worth driving across town for.  The chicken fried steak w/eggs & biscuits & gravy breakfasts were hot, good and filling.  Their Saturday night prime rib special was always flavorful and tender.  Their burgers were good too. 
   Things have changed.  Now, despite their claims nearly a year ago they were returning to evening dinner service they failed to do so...still closing at 3 pm.  So no prime rib special.  The open faced sandwiches, choice of turkey or roast beef, were always yummy and filling. More recently I found the amount of bread remains large and there's plenty of gravy, but the beef and turkey portions are smaller. Tastes good but less of it.   Last week we visited again, ordering biscuits & gravy and NY Steak & eggs.  The biscuits & gravy half order was plentiful, and good.   But, while the steak was pretty good and reasonably tender, and the scrambled eggs nicely cooked (& I am a stickler for properly light & scrambled eggs).  The hashed browns were cooked but not browned. The steak came on a bed of two biscuits with gravy.  The gravy was flavorful. It was a shame the biscuits were so hard and dry the gravy could not rescue them. It was almost like they were using up day old biscuits in their dishes. Not good.  Were they to begin opening for dinner again we \"might\" try them again but after their breakfast last Saturday morning there's not much to recommend them. I will say I love their larger coffee mugs, the coffee was good, and we had no server problems. The food was pretty timely. 
   It's sad when a restaurant that once provided nothing but satisfying, tasteful fare now scrapes near the bottom of the pan. A closing would not be surprising.  Due to partial satisfaction and the good service I gave 2 stars but that's prohibitive."}
{"text":"I must admit I have not heard the best things about this place. Many people have advised I STAY AWAY! however my Mother has been DYING to try it since we live literally two minutes away and she loves breakfast food. We came on a Saturday night and it was not super slammed but it also wasn't empty. It was a nice mix of people. I immediately noticed their front case that has all these yummy desserts especially the tiny coconut/banana and chocolate crème pies.  Our waitress was prompt and friendly! she even gave me recommendations for what was good. I went with the Prime Rib Sandwich which I expected to be much thinner pieces of meat but it was basically Prime Rib on a roll with French fries and dipping sauce. I was not a huge fan of the roll and the meat was difficult to get in that fashion as it was such a thick piece of meat. I didn't care for it but the fries were good. I would definitely try something else next time around. The rest of my family all went with breakfast. The eggs seemed to be cooked really well but the other items were pretty burnt and the waffle was bland nothing special. Overall we got good service and for the price I enjoyed this place on level of like a Ihop or Dennys just much better Quality of service. Don't go here expecting to be Amazed but over all it is a acceptable place to try out they have good portion sizes and everyone seemed very friendly!"}
{"text":"There are a lot of options to choose from. My order was barely warm and the price was a little more than expected. I don't really see myself heading back."}
{"text":"Two stars for service other than that not worth it. We had Breakfast specials steak and chic fried steak food was under done and the coffee tasted like it was cooked with firewood they said they had 
new cooks I blame management no proper training."}
{"text":"Very friendly staff was nice to see everyone so friendly also they got me a table quickly as I waited for the rest of my group. After a few moments a few people of my party showed up and we placed our order and surprisingly the food was out in like 15 mins very fast for a busy restaurant. The last person showed up as we ate eating he placed his order and kid you not they had his food out in 10 mins. Very good food and fast service I can't complain. Only down fall was I parked. My motorcycle under a tree that needed to be trimmed badly other then I recommend"}
{"text":"I dont usually write reviews but here we go. My first experience tonight at Lumberjack was terrible.Our waitress was really nice and did keep checking on us but I ordered the tritip med rare with a trip the saladbar,the bar was bare , not much to get excited about,then the server told me they didnt have enough tritip,would I like to sub primerib ,a little disappointed but I said yeah ok.When my food came it had the last of the tritip they had on it as well as the primerib the tritip was well cooked and dry tasted bad and the primerib was so dry it looked like canned tuna dry and came apart like the tuna from a can.when the server came by I told her I couldnt eat it,she was very nice and asked if i would like to try the ultimate steak I said very well just make sure its medrare,it came back and it was medrare and tasty but most of it was fat,I gave up on it and ask for a box.My boyfriend had the porkloin that was cooked almost raw,they recooked him another dish and came out fine.My kids did enjoy the chk strips though. I have to say people told me it compared to Dennys and I have no problem with Dennys when I want a late breakfast,but Lumberjacks I'm sorry but just can't do that again. A first impression is everything people.:("}
{"text":"WORST SERVICE EVER!!! Never coming back. Clearly asked for a high chair, and for obvious reasons since my baby is 1. It was never brought, I had to go and hunt one down myself. Sat down and it took over 15 minutes for waiter to bring water. She kept coming back and saying that they were fixing the soda machine... I ordered WATER! Before the water was ever brought she came to take the order and I ordered a waffle and asked if instead of meat I could just get potatoes and she gave me this long story about how she doesn't think they can do it. Over all service sucked and the manager kept walking around looking but wouldn't even approach us or do anything."}
{"text":"never eating here again 
poor service,
if the waitress hates her job then quit no need for horrible customer service 
the food is too pricey for what your getting 
how can you mess up coffee? 
watery coffee oily food my zucchini tasted more like fried fish geeze uncoocked french toast over it not ever recommending this place"}
{"text":"Terra was an amazing waitress. She was very attentive and kind. The food was very good. I got the steak and eggs. The steak was ordered medium rare and was cooked more rare, but it was fabulous!"}
{"text":"This place is understated.  It is an awesome place for breakfast.  A fews of the awesome breakfast items are the bacon omelet, banana bread french toast, pancakes, bacon is always crispy and the coffee good, strong but not bitter.  We have enjoyed eating in and also take out and delivery.  Love their breakfast!!  Lunches were great also."}
{"text":"Items Selected:
Coffee
Jumbo Biscuit with Honey
Griddle Sampler - Flapjacks, French Toast, Banana Bread French Toast, Sunny Side Up Eggs, Applewood
Smoked Bacon
Deep Fried Apple Bread Pudding with Bourbon Cream Sauce and Caramel

Located on Craig Road in North Las Vegas, and part of a small chain featuring the slogan \"Where the Big Boys Eat,\" it was largely on a whim that I decided to visit Lumberjacks Restaurant en route to an early showing of The Avengers at Galaxy Theaters and although the bloated movie was more than a little disappointing the breakfast served amidst log cabin décor was far better than rumors or reviews would have it, even if portions didn't really seem all that large to someone sporting a pretty good appetite despite his deceiving frame.

Cleverly themed, but far less 'branded' than Hash House a Go Go or Black Bear Diner...or any restaurant under the Daniel Boulud banner, to be fair...guests arriving at Lumberjacks are greeted by the large statue of a hirsuit woodsman out front and upon entering by 'yes sir/yes ma'am' service plus a large case of cakes and pies, an \"ultimate burger bar\" with tables flanking it on both sides before an open kitchen to their rear.

Offering options of breakfast, lunch, and dinner with almost the entire menu available throughout regular business hours, it was with little hesitation that I flipped directly to the section labeled griddles and after a few questions about what was featured in the pastry case my order essentially wrote itself, a request to have items sent out as they were ready resulting in two courses served over the course of forty-five minutes during which only inaccessible \"free\" WiFi and having to repeatedly request coffee refills marred an otherwise pleasant stay.

Homey in design, with tables and chairs set peripherally as banquets and booths lined the middle of the room, it was in a sort of alcove that I sat and within only ten minutes of ordering I was in the midst of sugaring my second cup of coffee when my dessert-as-appetizer arrived, the plate described as \"deep fried bread pudding\" proving to be a sort of devilish mashup somewhere between traditional custard soaked brioche and an apple fritter with a crispy golden exterior gilded by glistening caramel plus a sidecar of custard lightly tinged with booze. 

Almost certain that neither my entrée nor a housemade biscuit would trump the bread pudding in decadence, quality, or inspiration it was nonetheless to a large plate of proteins and carbs that I was treated next and although my assumptions would indeed be born out as none but the nutty banana bread with a gently seared exterior was particularly memorable it wasn't as though any of the options was particularly 'bad,' just standard run-of-the-mill breakfast fare served at a good price with both flapjacks and French Toast happy to sop up pure maple syrup ported from home while the large biscuit was piping hot and flaky with ample notes of buttermilk beneath whipped butter and honey, both.

Setting aside the out-of-the-way location and service that was far less attentive than would be expected from a restaurant less than a quarter full, Lumberjacks Restaurant is comparable to spots like The Cracked Egg, Egg Works, Mr. Mama's, Jamms', and several others in terms of price, quality, and portions - the deep fried bread pudding amongst the very finest examples in The Valley, and something I'd suggest justifying the thirty minute trip North."}
{"text":"it's an ok breakfast place. staff was nice.  coffee was ok. nothing that would make me be a regular there. it's silly but one thing that bugged me was the country potatoes.no onions or bell pepers. the girl said it would be extra to get that! usually comes with them."}
{"text":"My family and I came here a few times when it first opened. The food was ok but the service was almost non existent. We had decided not to return because it was so bad. After seeing the sign that it was under new ownership, I decided to give them another try. I'm happy to say that it's like night and day. There's no wait to be seated and the servers are friendly and fast. Their breakfast specials are a steal too.  Will definitely be coming back more often."}
{"text":"Late Review: Tried Lumberjacks for the first time in June and was pleasantly surprised. My breakfast scramble was delicous and my boyfriend enjoyed his sirloin steak and eggs. Order an extra pancake for a dollar because its well worth it. Overall great service, food and prices.  I would've have given them 4 stars but my boyfriends steak had to be sent back twice because it was under cooked, so I was forced to eat alone or let my food get cold while waiting for his.  He's a gentleman so he told me to go ahead and eat but I would've felt weird so I chose to wait."}
{"text":"To sum up this place is hit or miss....actually more of a miss than a hit..Went Sunday morniing (4/19/14)..I counted 15 open seating spots. yet hostness..stated a 25-35 min wait.. We got up and left...so did two couples who had been waiting..I wont be back.................."}
{"text":"Stopped for breakfast on our way back to Salt Lake. The waitress, Julie, was great!  She was so personable and sincere. She let us know of the specials and we both ordered the chicken fried steals. She said they were a smaller version of the big meal. So glad she did because it was huge. I didn't even finish it all. We got the biscuits and they were huge too!  Brought to us at the beginning so we are then with butter and honey while waiting for our food which was there so fast. Excellent, fresh, and fast. Great choice."}
{"text":"Walked in stated my name and party of one. Was told approximately a 10 minute wait. After waiting 20 minutes and seeing 5 parties who had come in after me called before me realized they had never put my name on the waiting list. Just got up and left. Incompetent people working the front"}
{"text":"This location has been something new every month, the last restaurant to try to open, a burrito place, never did.  We saw the construction and starting hearing rumors of \"lumberjacks\" and got excited that perhaps there would be a new place on that side of town to try.

Once it opened, we made it for dinner.  After reading a few reviews, and looking at the menu and some posted pictures, we were truly looking forward to it.

We started off with the combination platter, everything was fried.  We were given one small ramekin of sauce for everything.  I ordered the chicken fried steak dinner with soup, it was chicken noodle as my choice, as the soup of the day had ran out.  

The soup was heart with veggies and thick noodles, not bad tasting, but my chicken fry was just a frozen breaded piece covered with gravy.  The best thing on the plate was the big fat roll, it was warm and the butter melted quickly.

At this point we declined desert.  I don't know if I'd eat dinner here again, but I might come back to try breakfast."}
{"text":"Update - tried for dinner...yum!  Me and my son ordered the turkey dinner - huge portion and got loaded baked potato for only .99 upgrade.  Loaf of bread came with honey butter...fresh and soft...my son loved it!  Wanted to try the chocolate cake but there was no more room!  Oh and dinner came with soup or salad - I had the soup because they had clam chowder...yummy and tasty too!  As long as service improves I'm sure this place will do well (hopefully better than previous sizzlers, and Mexican joint).  So many people compare to Dennys type restaurant...I disagree-I would say it is closer to a Claim Jumper type as portions as huge and food quality is much better than a Denny's or Ihop."}
{"text":"Sadly, I can't say anything good or bad about their food, because I didn't get a chance to try it. My husband and I went to have breakfast at Lumberjacks this past Tuesday. We were the first people to walk in. I remember seeing one side of the room was completely empty, so we felt lucky that we got there before any kind of morning rush. We were greeted by a woman, and she asked us to wait while she rang people up on the register. One ring up, turned into 2 and then 3. As she was ringing these people up, two other couples walked through the door, and we all just stood around like idiots waiting for this woman to ring people up. Finally after the lady rung up a 4th person, she finally acknowledged my husband and I, but after waiting for so long, all she really did was write down our names, then told us to have a seat, and that it would be several minutes. O_O So we sat, and sat, and sat, and I remembered looking over at the empty side of the room and thinking, 'why the heck are we waiting for so long'. Finally, a waitress came out and asked the lady at the front who was next, so the lady at the front handed her the list of names. I was thinking 'cool, finally we get to eat' (we were starving, mind you, and we were also on a tight schedule). The waitress then calls out the couple that came after us, then the couple that came after them, but didn't even call us AT ALL, even though we were the first people to get there and the first people to get our name on the list. wtf?! We were all parties of two, it's not like any of them had any special privileges, so there is no excuse for choosing us last, when we were the ones who came in first. So my husband and I sat there for another few minutes, and decided to just leave. We pretty much waited a total of 10 minutes just to be ignored. This place sucks. And judging from all the other reviews here, we didn't miss out on much."}
{"text":"Can I say Delicious! 
Me and my mom came her for my birthday, breakfast time. The coffee is very robust and fragrant, and come in the manliest mugs. My mom had the Steak and eggs which she said was scrumptious, and I had the Country fried steak with scrambled eggs and toast, let me state that the gravy is the star of the show! Very thick and creamy, with giant chunks of sausage in it. The fried steak was very juicy and savory. For dessert we had the chocolate cake, very moist spongy and decadent. Oh and they a very generous with the portions!

The service was slow that day due to waiter training, but it was incredibly worth it and both waiter were very courteous. I will definitely be coming back, maybe for dinner next time! :)"}
{"text":"We showed up 15 minutes after the sign on the door stated that the restrurent was closed and was given a welcome in and we'll take care of you. Nice!
We had the Jack melt and a dinner salid. The sandwich could have use some avocado but otherwise it was good while the salid dressing was exellent. Overall ill give thid place 3 stars. Not bad."}
{"text":"Had breakfast here. Denver Omelette. It was hearty, full of tasty sausage, bacon and tomatoes, onions. Huge portion staff was great kept my coffee cup filled.  By the way they have this novelty cups nice touch. Like this place nothing special they just do it right."}
{"text":"This is my 2nd time here, it's clear across town from my house but I love it! The service is friendly, it's always been clean and the food is delish! I've only tried the breakfast menu."}
{"text":"Bacon and eggs breakfast is tasty! The bacon is extra thick and the potatoes are a bit crispy which is perfect for me. I order to go which makes the toast get soggy so ask for it dry and add butter later."}
{"text":"Stopped by here for breakfast.

This place is like the offspring of Denny's and Timber's.

It was packed on a Sunday morning.  They had a few empty tables but it seemed to take for ever to get seated.  It was about a 30 minute wait.  I wasn't in a hurry so I was just hangin' out.

I had the chicken fried steak.  It was the type they buy frozen and throw it in the deep fryer... but it was good.  The gravy was boring.  I didn't care for the potatoes.  The potatoes seemed to boiled or steamed and then grilled on the flat top for a few minutes.  

I ordered basted eggs.  HMMM - disappointed.  I admit a nicely basted egg is not easy - but that's the difference between 3 stars and four stars.  My eggs were brown on the bottoms.  I know it seems picky, but I am a stickler when it comes to basted eggs.

The place was clean.  The chicken fried steak was on special so the price was right.  I would go here again though.  It is better than going to Denny's or IHOP."}
{"text":"Slow service and greasy food! Not happy with the quality. I know it's under new management but I don't see a difference. The quality of food is better at Denny's. The food portions are large. The trifecta is great food, great service & Food portions. Lumberjacks needs to work on two. Maybe I'll come back just to see if I was wrong in my assessment. Right now it's a 3 rating the new manager promises a change and I will give him a chance."}
{"text":"Holy cow! I was looking for NFCU by Nellis the other day and saw this 18' tall lumberjack statue in the side of the road. This. Was. Going. To. Happen.

My older brother did not want to take the 20 minute drive to go eat at the greatness that is a place with a lumber jack outside. So I dragged the old man out to the place for Sunday breakfast.

The bacon was awesome. The only thing that could have been better would have been the speed of service. It was a bit slow, but our server was pregnant, which did not mean she could not serve food, in her 8th month of pregnancy, but she was good, just slow.

A gigantic lumberjack is worth 4 stars though"}
{"text":"Huge portions for breakfast.   This is actually a good place to start the day if you need / want a hearty breakfast.   I had the ham and eggs, and my buddy had an omlette.   Both were really good, the service was good and we never saw the bottom of your coffee mugs.  It was easy to get in and out of there with a full belly.   

Good job folks."}
{"text":"The food here is incredible but the service is not the best. My wife and I come here every so often and every time the servers are either stressed or just not friendly. Today our server gave me sooo much anxiety because she was so overwhelmed with her 4 tables, and she made sure to vocalize her stress. Our food ended up being given to another table and she finally realized it after everyone who came in after us received their food first. They put a rush on our food and got it out to us a few minutes later. I had the jack omelette and the wife had the country fried steak. Both were incredible per usual."}
{"text":"Well, there's a new sheriff for comfort food in town, \"where the big boys eat.\"  That's the restaurant's slogan, and for good reason.  Dinner portions here are large and come with an individual bread loaf to pick and tear at, dip in gravy, or spread with the sweet butter provided, as one pleases.  And, my single serving of Chocolate Cake, ordered a la mode, came with TWO large scoops of Vanilla Ice Cream and was humongous enough to feed and satisfy the dessert cravings of my entire party of FOUR.  The cake was moist and was one of those rarities that tasted as good as it looked in the display case.  But I'm getting ahead of myself.  Let's start at the beginning.

When you arrive, you will be greeted in the convenient parking lot in front of the restaurant by a Paul Bunyanesque, ax-wielding lumberjack.  Not to worry!  This greeter is friendly and frozen in painted cement.  Once inside, the restaurant is bright and inviting, although a light over our table was burned out.  There were a few other opening week glitches as well.  Although our server was very friendly and well meaning, it took a long time to order after receiving menus, and I had to request water twice before any arrived.  But by the end of our meal, staffers were replenishing Iced Tea without being asked, and frequently checking on my party's needs.

I was skeptical about the quality and variety of food I would find here after reading one low-rated review.  But I vowed to keep an open mind as I went through the front door, and became a believer as soon as I tasted my cup of Chicken Noodle Soup, which was the soup of the day.  It sported some vegetables and thick noodles, and featured shockingly very hot and tasty broth.  A choice of soup of the day or one trip to the Salad Bar, as well as a choice of potato, rice, or mixed vegetables, come with dinner entrees like my Ground Round Dinner, which was basically a hamburger steak.  But a very good hamburger steak weighing about half a pound, and covered by hot and tasty Brown Gravy!  I was able to order it as I liked.  Although I asked for medium-rare, not too surprisingly the meat was actually cooked medium.  This is still better than the well-done hamburgers one gets at most restaurants nowadays--especially in Clark County where the Health Department really puts down the hammer on doneness of hamburger products.  All was well on the plate, except the temperature of the gravy-covered mound of mashed potatoes was tepid at best.  The mashers were good but should be heated more before being served.  They were less than half as hot as the meat served on the same plate.

Because my wife is a veggie hater, I was able to enjoy the Salad Bar's offerings, too.  As I did, at first I was grumbling to myself about the \"one trip\" rule.  But my mood quickly brightened upon seeing the size of the wooden salad bowls provided.  They were large!  Anyone who has learned how to pack a lot of food into one bowl at a Mongolian Barbecue restaurant will fare just fine here on one Salad Bar visit.  Plus, the entrees and sandwiches are large enough that gluttony is not advisable at the Salad Bar.  One trip should be plenty!

Fresh produce and other Salad Bar offerings were fairly standard, although with a couple of striking omissions.  While there was an abundance of White Mushrooms, strands of beets, large red Grape Tomatoes, pieces of crunchy celery, Red Onion, Black Olives, croutons, shredded cheese, bacon crumbles, something akin to sunflower seeds, and a variety of salad dressings to go with the Iceberg Lettuce provided, missing for me were Potato Salad, Tuna Salad, Garbanzo Beans, pieces of ham, and egg.  Because many of these items can be found at the Garden Salad Bar of Ruby Tuesday just next door, I would not go to Lumberjacks just for its Salad Bar unless it adds some more items.  In fairness though, Lumberjacks also offers several specialty salads that looked interesting.

The homemade bread served with entrees was doughy but light at the same time.  All food I tasted, including a bite of Diane's Chicken Fried Steak, was of higher quality than typical coffee shop fare.  I think Lumberjacks is a winner, and fills a long empty niche for high-quality breakfast and comfort food in North Las Vegas.  I'm already a fan, and look forward to returning soon and trying several more Lumberjacks menu offerings."}
{"text":"In my opinion I think 3 1/2 star rating for our visit would be more accurate.

My Fiance and I wanted to check this place out and try something new so we made the trek over for our dinner before movie.

It is a Friday and dinner time so I was shocked when we are seated and the restaurant was dead.

We were greeted and sat immediately and informed of the special for Friday which is two entrees for $20 meal which includes a trip to the salad bar. We were given a choice of four entrees to select from.

I had been talking about and craving chicken fried steak for a while and was just complaining to my sweetie that I enjoy it however is a pain in the ass to make at home. I mentioned that it is a meal I will order at a restaurant so I don't have to mess with the trouble at home as I find it labor intensive.

Anyhow the server was nice, our food came out on a giant plate and a load of fresh bread. Yes, not a dinner roll it was seriously a loaf of bread on each of our plates! lol

The country gravy, mashed taters and steak was really good and it did taste from scratch as they boast.

My Fiance was surprised and could not get over the fresh loaf of bread on our plates that came with our dinner entrees.

Our meal was a deal with the two for $20.00 special.

It is a bit of a drive as we live in the SW part of town so we may not be back for awhile unless in the neighborhood.

I was even able to get a to go cup with a refill of iced tea for the road which was nice :)

The prices are fair for the generous big portions they serve so come hungry or be prepared to doggie bag it home!"}
{"text":"Wow what a great manager ( Monika ) 
Food was fast,  fresh an hot , reasonable priced for what you get , seen the manager help out a family with a little girl , she had to play Mom for a minute to get the little girl seated , over an above service, 
Felisha was the best server ever plz ask for her when you go in ,"}
{"text":"So disappointed in my experience yesterday. I ordered the Cinnabon French toast breakfast and French vanilla cappuccino. The waitress was all giddy when she brought my cup, she says \"oh you've got some goodies in there\" I was like wtf? So I took a few sips and I was offended immediately with Christmas shaped candy sprinkles? What am I 5 years old lady?! It was annoying as with each sip I had to chew these overly sweetened floaties, these imposters didn't belong in my beverage. I told my waitress and she's like \"You don't like it? A no, I don't like it, it makes the coffee way too sweet. So she brings me a regular cup which was bland, she should have brought me a new cup of what I ordered, needless to say my beverage experience was ruined. 

Then alas my breakfast shows up, and was disappointed yet again with burnt edges on my \"Cinnabon\" French toast, another imposter served to me, that tasted nothing like what is described in the menu. No cinnamon taste or Cinnabon was MIA. 

I got a headache took my Tylenol and paid my check. Probably won't be returning nothing was good here"}
{"text":"This is our new go to breakfast place. The service was great and the food delicious. Bring your appetite the plates are huge!!!"}
{"text":"Husband brought me here to have breakfast with a buddy of his. Atmosphere was nice, not too crowded yet not dead, either. Waitress came over and took our drink order. The table in front of us had just gotten up and left and the waitress gave us (what looked like from my side) the straw that the other table didn't use.  Weirded out, but I didn't complain because it was still wrapped up. But still. Ordered the standard french toast with eggs and bacon. The eggs were supposed to be scrambled well with cheese. Well, they at least got the cheese part right. Portions were huge and typically, I would have no problem finishing my plate but I just couldn't. Major food overload. Aside from that, my drink never got refilled yet the waitress took notice of my husband's cup of joe as well as his buddy's water. We were leaving anyways, but it still would have been nice to ask. I won't blame her entirely because I could have also spoke up. I give the overall service an 8/10. It wasn't busy enough for her to forget it skip simple requests, but then again, I don't know her section. Hosts were nice and sweet. Would I go back? Possibly, but it wouldn't be my first choice within a group of options."}
{"text":"Arrived at lumberjacks at about 1015 am, had to wait a few minutes before we were greeted at the door. Once we were seated the server was nice and the food came out fast. I ordered the Axemans Griddler, my eggs came out over easy although I ordered them medium. To my surprise the bacon was a nice thick cut bacon  instead of a couple of thin slices. The griddler came with French toast, flap jacks, and a Banana Walnut French toast. The Banana Walnut French toast was really good but it seemed as the more bite I took the sweeter it became.  A lot of reviews say Lumberjacks is basic but most breakfast places are. Would I dine here again, sure. Would it be my number one choice, no."}
