{"text":"I had the luna's omelet and my bro had the country skillet, both very good. Very good prices, i will be back! Good customer service also!"}
{"text":"Food is bland. Reminds me of hospital food. chicken soup was a big bowl  but truly had only one small cube of chicken in it. Vegetables have been reheated multiple times resulting in the peas being hard as rocks. Mashed potatoes were \"instant.\"  Coffee is good. Waitress was nice and kept refilling my coffee. I won't go back, however."}
{"text":"Someone recommended Luna's and so earlier today I thought I would give it a try for dinner.  Well, not a good decision.  After reviewing the menu I decided to try something 'safe' so I ordered the meat loaf with mashed potatoes and gravy.  The meat loaf had very little seasoning, if any.  It had an odd taste.  It also appeared to be overcooked around the edges.  There was quite a 'crust' on it.  Overall, not appetizing at all.  The 'mashed' potatoes were quite lumpy.  I had to finish mashing them with the fork.  It appeared they had been mashed quickly, possibly just before they were served.  Again, lack of seasoning, particularly salt.  Not good at all.   I didn't finish either item.  And when I tried to pay my check, there was no one at the register.  I probably stood there about 3 minutes before another customer got in line behind me.  She finally summoned a waiter and asked if we could pay our bills.  The response was, \"I don't know where she is.\"  He then disappeared for a moment and then returned and said \"She will be with you in a minute.\"   Not good customer service.  The whole meal was not very good.  While the price was reasonable, the food didn't live up to the hype that I received.  I don't think I would either recommend this place or go there again.  There are better places with food that is more appetizing.   A real disappointment for sure."}
{"text":"Terrible customer service today! My husband and I came today for breakfast with our 4 kids. We're used to waiting for a table... We waited for 20min and then a local family who new one of the owners came in. 5 people in their party and they went out of their way to push tables together and say them before us. We left! In the past my husband and I have enjoyed the restaurant and always have the same waitress who is good to us. So sad that because of today I won't be back."}
{"text":"I really enjoy Luna's for breakfast. Local restaurant with friendly staff. Food is normally served very fast, and its really good. Location of the place is very comfortable. I recommend to try it if you're in the area."}
{"text":"Can't beat their matzo ball soup and the corned beef!  Have only ever ordered to go, but servers seem friendly."}
{"text":"I have been driving by this restaurant for years and I never stopped in. I wish I never did.  I finally decided to try it and that was a mistake. I ordered the pork roast and it wasn't even warm when it came to my table. Worst restaurant I have been in years."}
{"text":"Horrific food, horrific service. We had a frozen burger and a wilted salad of iceburg lettuce that was way over seasoned. The waitress brought the check before the food and didn't check on us again. Obviously prepared food with shortcuts. I am very disappointed."}
{"text":"Food is always good service is sometimes iffy, but that's ok. They have great sandwiches and soup. Will always come back"}
{"text":"Must have the Luna's Corned Beef sandwich.... Amazing."}
{"text":"will not go back.  went for breakfast & ordered waffles, they were horrible.  not sure how a restaurant could mess up waffles so badly, such a basic food to prepare.  not impressed at all, dont waste your time/money."}
{"text":"Glad we went back a second time -- for all the wrong reasons!  First visit, owner could not have been friendlier, server was attentive & friendly, my AYCE cod dinner came with delicious lentil soup & canned or frozen corn, french fries were good, wife's sandwich was decent if not memorable, kitchen did a good job in getting orders out, restrooms were clean, dining area was orderly.  But the second trip -- had the fried cod dinner again, and there was something N-O-T Q-U-I-T-E R-I-G-H-T about it, tartar sauce wasn't even fully mixed, in place of the corn I had mixed (ugh!) veggies, french fries almost soggy, rice pudding had a liberal dose of cinnamon but it was still thin and tasteless, owner too busy on a personal phone call to say hello.  The good news -- our server was excellent, the kitchen got orders out quickly again, the rest rooms still clean, the dining room still neat and orderly.  the lentil soup was still quite good.  Weren't there for breakfast, but their breakfast menu looks good, with eggs, omelettes, waffles, skillets, etc.   Go east or west on Route 82 for some better options."}
{"text":"Food is terrible... Frozen and canned crap.  We went there for dinner.  The food literally had no taste, the service was slow.  I won't go back there if you paid me.  The people rating this place more than 2 stars are delusional.   I would rather step in front of a bus than eat at this sh@thole again... You've been warned."}
{"text":"This was my first and last time eating at Lunas.  I ordered the hummus appetizer. On the menu it was described as having olives, tomatoes and drizzled with olive oil with pita bread. When it was brought to my table, the hummus was drowning in a very cheap mix of some type of oil with a little bit of olive oil in it, sliced black olives from a can, and 4 thinly sliced hothouse tomatoes. Yuck! I was very hungry so I tried to look past that and ate it. It should have served as a warning to me for the quality of food that was being served, but since it was my first time I was giving the benefit of the doubt. (A mistake I won't make again)  I asked several times what type of lettuce is used on the salads and explained that I have a mild food allergie to iceburg lettuce. After some time I was told it was romaine. Ok... I ordered the seafood salad platter, desribed on the menu as- seafood salad ontop a bed of lettuce, tomato, olives and fresh seasonal fruit.  When it arrived to me I was speechless. (I'm sure the look on my face was enough to let the waitresses know that I was not happy.)  The seafood salad was ontop of a top half of a romaine lettuce leaf (that's right 1 little piece of lettuce) on the left side, the front of the plate was lined with 4 thinly sliced hothouse tomatoes, the back part of the plate had a small amount of cantaloupe, strawberries, and honeydew melon, then smack dab in the middle was a nice hearty helping of canned sliced black olives. The waitress asked what was wrong and I asked to see the menu thinking maybe I read it wrong..... Nope. (another waitress joined in to see what was going on) as I pointed out the bed of lettuce was in fact a measly piece of lettuce and the rest was just a joke.  I explained that this is shameful to even think to serve something like this to a paying customer. Waitress offered to take it back and get me something else but I thought nope I ordered this and I'm just going to make the best of it and know to never order it again. As I begin to eat I first tasted the seafood salad  and it was room temp and very bland at this point I have had enough of this place.  I pushed my plate away and looked for my waitress. After waiting some time I walked up to the register and waited. The meal was taken off and I tipped the waitress as if I had paid because it wasn't her fault that the food was terrible. At no time did any of the 3 guys who where working 1 I know was the manager (I know this because while I was trying to eat my oily hummus I over heard him repremanding a waitress) came over to talk to me.  The waitresses where nice but the food was terrible."}
{"text":"I remember when this place was Farmer Boy back in the late 90s. Always big portions of good food, friendly service, and open 24/7. It has gone through a few name changes since then but has been Luna's for the past several years.   My really good experiences here have outweighed the not so great experiences. I consider it a \"locals\" spot, so it's not five star dining by any stretch. But the portions are still good-sized, and there are generally daily specials for a good price.   I miss the old Farmer Boy restaurant, but I think Luna's is still a good option to consider if you're looking for a good meal for a reasonable price."}
{"text":"Horrible,Tommys was so much better .I got fish.which was over cooked and my husband got fried chicken,which was hard as a rock and came out ten minutes after mine.I ordered salad and got a bowl of lettuce about the size of a cup.The only thing that was good was the drinks."}
{"text":"I used to manage the Lunas when there were 4 of them and we were always complimented on our food and service back then. It's really sad to see all the negative comments now!!"}
{"text":"I walked out of this restaurant yesterday. As I walked in to grab a late breakfast, the hostess / cashier and waitress were haggling over who would take care of me. No greeting from either of them just this back and forth between them about who was going to take care of me so I decided to make the decision for them and leave.. your food is not that good so you should thank anyone that walks through your doors"}
{"text":"Worse than a grade school cafeteria canned food. Only bright spot... it is definitely low salt.  French toast was mushy and nasty.  Coffee smelled burnt... but had no taste. Asked non coffee drinking husband to try and he agreed.  No matter the coupon... not worth the meal."}
{"text":"Stopped in here Mother's Day for breakfast because every other place was packed. Don't usually come here for the same reasons mentioned in other reviews about service, cleanliness, etc. Again, got the same put out attitude from the servers and slimy table top near the kitchen. The big thing that got me this time was as the wife and I sat there waiting for our food, one of the bus boys who was apparently on his break and looked to be one of the owners relatives, reached over our table to grab some ketchup to put on HIS plate of eggs! He was in clear view and in the way of the service traffic. Nobody that worked there said a word to this oaf as he chowed down! We just looked at each other and laughed in disbelieve! Good thing we don't use ketchup on our eggs! The funniest thing was after we got our food the the tide of people that came in behind us must have overwhelmed them! The staff looked horrified like they didn't expect this much overflow on Mother's Day or capable of handling it! Only got one refill of coffee in this panicked frenzy of pisses off staff and patrons! As we left the owner took our money with a smile as if he was oblivious to the chaos going on behind him! Wow! Last time, no more!"}
{"text":"We were struggling to find a breakfast spot this morning in this area because first watch was packed. We ended up here, I've passed it a lot of times. It's not the best up kept place but sometimes they have the best food! Unfortunately this wasn't awesome.   It smelled like burnt toast when we talked in and we got seated at a table right next to the kitchen area with a bunch of tape on our booth seats. I was skeptical already. Menu had a good amount of options though and our waitress was super friendly and offered suggestions so we were hopeful. Also, the wait for food was short with the exception of my pancakes coming out 5 minutes later than the rest of my meal. I got like the typical breakfast platter: eggs which were cooked well, sausage which didn't seem fresh it was like dried out on the edges-I didn't finish those, the potatoes weren't cooked thoroughly they were pretty mushy and then fried in  certain spots, pancakes were good consistency and warm but lacking flavor even with butter and syrup. Bf got the Mexican skillet and they didn't put the peppers in....he was pretty sad cause that's why he ordered it but was too hungry to complain.   We won't be coming back, bummer!"}
{"text":"I have been to Lunas several times.  S friends of mine like it there. I was just there on 9- 18- 16. The food is cold.  I  asked if they had fresh  mushrooms i was told yes and they don't.  I bought 30.00 in bakery there and the lady locks are moldy. I  am from out of town. I hate to go there.  We usually don't but like i said that she and her husband likes it.  They close so early I could not even complain. What restaurant closes at 5pm"}
{"text":"Good comfort food good service and great prices.  Don't let the outside deceive you, it is a nice place on the inside.  They have a great early bird breakfast special, 3 eggs breakfast meat, Hash Browns, toast 3.99"}
{"text":"What happened to Lunas ? It used to be so good. Went there for lunch with my sister and my son. Before we even sat we where asked what we wanted to drink. I should've left then. After seeing the menu I was excited as I used to work for Linas and seen some of my old fav's. My son and I got the chicken BLT and my sister got the southwestern burger. When the food arrived I was like woah what would Gordon Ramsey say lol between my son and I we prob had a pound of bacon. We just picked it off and went on our way. I will say the food was disgusting ! The server didn't check on us for awhile. She asked if we want boxes and we declined .She could've cared less that we left unhappy.  Everything tasted like old oil ! My sisters bun was saturated in grease ! Her veggies where not even cooked. We honestly all feel sick to our stomachs. I will never visit there again."}
{"text":"This place used to be Five Points Deli & Restaurant, I don't know if it was an ownership change or just a name change.  I'm not considering this a full review, since we just stopped in here for dessert and coffee.  I'll have to come back for an actual MEAL, and do more of a review then.  3 of us ordered desserts (2 slices of cake, one of the apple pie).  Received ginormous portions (especially of the cake, 3 of us could split one slice of that).  Everything was tasty, but not made on-premises (I actually think I saw packaging from Sam's in the dessert case on the way out).  Decent value for the money.  This area doesn't have many options if you've got the taste for dessert (other than ice cream) and don't want to whip up some brownies.  Food I saw on other tables all looked pretty good.  Pleasant server, decent \"diner-style\" ambiance.  Pretty extensive menu, especially for breakfast.  Spotless bathroom.  I'll have to swing by here soon.  I think the Corned Beef Hash is calling out to me!"}
{"text":"Our waitress was wonderful! Extremely personable and sweet. Food was delicious! We ordered wings and some specials. Boyfriend said his steak sandwich was a bit over cooked, but my Reuben was yummy! So much meat, although the fries were just okay. I enjoyed the rice pudding. I would return just to see the ladies that were working. Also, split pea soup was amazing! I've never had it but I really enjoyed it."}
{"text":"We love Luna's. We are there every Friday Morning. Breakfast is inexpensive for what you get.  It's the local breakfast place, not a chain with fancy meals and prices"}
{"text":"We used to enjoy Luna's for breakfast.  The last 2 times the food has been bad.  The main reason we won't go back, the last time we were in our waitress went to the wrong table, realized it then cussed. No big deal if my child wasn't with us.  Poor service and lousy food. Great prices though. Hopefully it gets better."}
{"text":"This place was fine for breakfast, the greek scramble was tasty and hearty. Nice owners, very fast (even curt) servers but overall friendly enough. Don't expect gourmet and you won't be disappointed. Decor is about three decades out of date though. Not sure why some reviewers are so down on this place."}
{"text":"I went in for the all you can eat fish fry last friday. I have been going there for years but there has been an owner change. This was the absolute worse fish I have ever had! Totally overcooked with only breading left! I always went for seconds but not this time! I asked for Ice cream for my desert item and was told they were out of all the ice cream but had rice pudding! The waitress also had an attitude- not the same ladies that have been there for years! Via Condios Lunas!! If I want lousy overcooked food I will stay home and cook for myself !"}
{"text":"Food was good. Service was terrible. Waited over 30 minutes for a water. Waitress also messed up our bill and was not attentive."}
{"text":"We stopped to have breakfast since my mom always goes there. The service was ok. The  skillet I was expecting was like at Denny's. Mine came on a cold skillet and mushy potatoes. They were out of rye toast also! How can a breakfast place run out of toast. Run to the store and buy some, right. My mom always gets a mushroom omelet which she loves. So as long as she is happy that is all that matters."}
{"text":"For some reason, even though there were only a few tables with diners, our waitress seated us right by the kitchen. She kept coming over and rushing us to make a decision.  When I say rushing I mean like every minute or so.   Seriously.   The Chicken Noodle Soup looked like glorified boxed soup.  The salad had lettuce that was starting to rust.  Someone must really like onions because there were 7 large slices of red onion on it.  But, here is the best part was the dressing came in a squeeze package like the ones at fast food places.  The meatloaf was horrible but strangely the mashed potatoes were good.  The fried chicken was OK. They make it with honey so chicken is very sweet and not something I'd eat again.  The fries were typical frozen french fries but were OK.    If the food wasn't disappointing enough, all of the servers had bad attitudes and it showed.  We could hear all the talk from the kitchen since we were so close.  It is obvious no one wants to be there.  They don't care about the quality of their food or service. Now we know why the parking lot was almost empty on a Friday night.  We will not be back for another try.   Someone should write to Robert Irvine.  Maybe him and Restaurant Impossible can help.  Or, maybe not."}
{"text":"Found Luna's through Yelp and glad we did. Great service and quality food at low prices. The parking lot was full but we didn't have a long wait. Hubs ordered biscuits and gravy with eggs which he scarfed down. I had a denver omlette bagel sandwich which was delicious. So glad we stopped."}
{"text":"Nice and casual breakfast.  The place was spacious and staff was friendly. Prices were fair and I liked the options on the menu.  My ordered food came fast that I really appreciated. I ate just oat meal with fruits but still enjoyed it.  If I will be in the area I would step in.  Check this place out!"}
{"text":"Inexpensive, fast and decent breakfast. Real cream, real butter. Butter is not ice cold from the fridge... Allowed to do e to room temp so it's easily spreadable.  I was easily able to make a ketogenic friendly breakfast here."}
{"text":"Luna's has always been a destination for solid brunch in the area. The food is always good and fast. I'm not sure why there are negative reviews as the restaurant doesn't try to be anything more than a ma & pa diner. Service can be slow at times (during a rush), but never that bad. Ways to improve would be organic & using local suppliers but I'd imagine that would increase their very low prices."}
{"text":"Gross, dirty, poor service, and crappy food to boot! Will never come back to this garbage \"restaurant\". The waitress was rude and seem annoyed that I brought children to eat with me. The charged me for a glass of water if you can imagine. My sandwich was soggy as were the fries. Avoid this place!"}
{"text":"My wife and I both ordered the rib eye steak dinner for $10.99.  It came with a choice of soup or salad (we chose the salad with a delicious Greek house dressing), giant baked potato and mixed vegetables (out of a can), and free dessert (choice of ice cream or rice pudding - we chose rice pudding and brought it home.  The steaks were slightly over-cooked and not great, but not bad, smothered in onions and mushrooms (out of a can).  The baked potatoes were the highlight of the meal.  Luna's is an old-fashioned kind of restaurant, not very busy on a Saturday night.  Good service (she forgot the dinners rolls, but got them immediately when we asked) and very good value.  We will be back."}
{"text":"Inedible slop. If you've seen those kitchen rescue shows, then the worst of those is this place. Under cooked meat, powdered potatoes, gravy and veggies from a can. I didn't even get a doggie bag despite eating only two bites. I value my pups more than that. Avoid at all cost!"}
{"text":"Had to fuel up before tying up the ends of our daughters wedding, love their breakfast, very inexpensive I've never had a bad meal. Very impressed on how well clean it is, had a very young kid working [bus boy] hard he was very efficient & on time clearing & cleaning off the tables. You would think someone that young wouldn't be working hard & have all those responsibilities, you would think he would've been playing video games. The service was great from our sever very attentive on refills & checking up on us...      Their portions are huge usually I can't finish it all, I tell you this day I ate everything on my plate I guess I was hungry & home fries are one of the best around. I do miss their buffet I guess since they changed owners they stopped offering & they were opened either real late into the weeeeee hours of the morning our 24 hours I can't remember which one... this place is highly recommended..."}
{"text":"Luna's is my favorite local diner!  Growing up in New Jersey, I know diner food, so the fact that I'm a fan of Luna's says a lot. There's never much of a wait, even when the restaurant is packed because the service is fast. My breakfast staple is one of their wraps. The York is the best with eggs, cheese, bacon, sausage and ham. Delicious! My lunch and dinner favorite is the Luna's chicken grill. It's a sandwich with grilled chicken, bacon, mushrooms and mozzarella. Ask about their soup because it's always a great choice. Prices are extremely reasonable, especially considering the portion you receive. I'd definitely recommend Luna's if you're looking for great diner food."}
{"text":"Took the family to Luna's on our weekly dinner outing.  I hadn't noticed that Tommy's was closed until earlier this week.  When we walked in, we were promptly greeted and seated.    There were at least 10 daily specials including all you can eat cod.  I ordered the Mediterranean Dinner Platter, my wife ordered the all you can eat cod, my daughter ordered a BLT sandwich, and my son ordered a grilled cheese sandwich.  All orders except mine were served with fries.  About 20 minutes later, our food was served.  My Mediterranean plate took longer to cook because it had chicken and beef on two skewers.  It was served piping hot and was actually rather tasty!  There were two plates.  One came with seasoned hummus with olive oil, black olives, tomato, and pita bread.  The other had the skewers sitting atop a bed of yellow rice.  The rice was basically flavorless, but the skewers were hot and tasty.  I loved em!  The hummus was yummy and my wife helped me eat it.  I used some of the Frank's Red Hot sauce on my dishes and I really enjoyed my meal.    I tasted my wife's code and it was very good.  The tartar sauce was rich and creamy too.  The fries were kind of plain tasting, however, and I think they were undercooked because they were not crispy.  My daughter polished off her BLT and she really liked it.  My son at most of his grilled cheese and I could see that it had a nice thick layer of cheese in the middle.  He ate most of his fries and side of corn too.  If you want to have a party at Luna's, you can.  They'll cater it on site.  They have a kids menu and the food is very inexpensive.  The flavors are slightly above average.  The service was very good as the waitresses were joking around and laughing with each other.  They seemed happy.  With tip, our weekly dinner out was $43.  We'll be back to try other menu items soon!"}
{"text":"My husband and I were out for a Sunday drive when we spotted this restaurant and decided to stop for dinner.  After a quick visit to the clean restroom, we were greeted and seated immediately.  Three menus appeared...  Daily specials, breakfast menu, and the full menu.  We chose to go to the dinner route.  Our waitress could not have been more helpful.  On her recommendation, we both chose the fried chicken dinner.  It was crunchy, slightly sweet, and oh so good!  It came with potato, rolls, corn, and either soup or salad.  I had the Italian wedding soup which was delicious.... Not heavy on celery taste, although clearly there was celery added.  Dinner comes with a scoop of ice cream for dessert, if you like.  We felt lucky to find this place.  Our waitress was so attentive, never missing a beat.  If we lived closer, we would definitely be back!"}
{"text":"I like this restaurant. I've been coming here since I was in high school. Fun-loving people with a good sense of humor. Food is so good with big portions you can never go wrong with that."}
{"text":"This place has a greasy diner feel but the food is good and they have a pretty diverse menu. Their breakfast skillets are the BEST breakfast Ive ever had. Pretty good matzo ball soup, and fattoush salad."}
{"text":"I had the chicken noodle soup which was the strangest tasting I've ever had. The fish fry was extremely greasy as well. The staff wasn't very friendly and as I was leaving I noticed that all of the bakery in the display case was purchased from WalMart.."}
{"text":"Stopped by for a cheap dinner with the family. Never been. Greeted and seated. Service was good. Glasses stayed full. Our server brought out 4 of 6 dinners.  11 minutes later the other 2 were brought out. So that was weird and annoying My kids respect their parents. So their food sat and got cold waiting on ours. (Despite my instructions to just eat) Dad ordered the scrod dinner. He said it wasn't bad. Salad that came with it looked good. Two sons ordered burgers with fries. They reported the burgers tasted better than Red Robin but not as good as 5 guys. The fries were big and tasty though!  Lol teenaged boys! Other son ordered the shrimp marinara. Decent sized plate of pasta but only 5-6 pieces of little salad shrimp. Hubby ordered the chicken Parmesan. Looked pretty damn good. Serving was huge! Lastly I ordered the country fried steak dinner. Yuck. Wish I would have gotten the chicken parm. The country fried steak was submerged in some nasty, gelatinous brown gravy. It seemed like it wasn't fried hard enough if at all before submerging. Wasn't a fan. Place was clean. Wasn't busy at all. While I appreciate the persistence to keep the place clean it was VERY weird to see one of those white plastic sanitary napkin disposal containers attached to the front of the register stand. I'm so mad at myself for not taking a picture of it.  Update: Today we stopped for lunch since it was a snow day. 3/4 of us had burgers. Not bad. Fries were fabulous like last time! I had the chili cheeseburger. Was tasty but I've had better elsewhere. 4th person had the chicken stir fry. Instant rice but he said otherwise it was tasty. Service was still great. Restaurant still looked clean! I did get that picture though...."}
{"text":"I made a healthy decision to eat healthy had a fruit cup instead of hash browns, to make this choice was charged .50 more. I will not give restaurants my business for not supporting healthy eating buy charging more . ( and what I did get cost less on weekdays )"}
{"text":"This is the worse service and food I have EVER had!  Server could care less that we didn't touch hardly anything. The pickles were delicious!  I would highly suggest skipping this location and drive the extra few miles to go to York and Pearl."}
