{"text":"Good price, big portion. Food is delicious and as good as it can get. Love its authenticity. They might not always close at the time advertised though. We have been disappointed to find them closed a couple of times."}
{"text":"I always come here with my family. Everything is very cheap and taste ok. 

My favourites are
Beef brisket flat rice noodle  in soup
Pan fried turnip cake 
Chinese style chow mien with pork
Hk style milk tea"}
{"text":"Macey's is definitely one of my favourite Chinese restaurants in Mississauga!  

The food portion for the price you are paying is pretty affordable, especially on weekdays before 3pm, their lunch specials can be a hit for many or  a miss for others.  The food quality is always consistent and there is always left overs whenever I eat, so I just package it out in a take-out container and take it home for a late snack/ prepare it for lunch tomorrow! 

However, the con side is that everything is written in Chinese, so when your bill comes, it's all in Chinese, not even a single English written word.  Also, you may want to also double check the bill, I was charged extra money on my bill as some prices on my bill were different from the price listed from the Menu!"}
{"text":"This is my fave noodle house in Mississauga. It's the one noodle house who actually makes quality wontons made of pure shrimp (no pork) and are the size of golf balls! My Italian husband even knows how to order in Chinese bc he has his absolute favourites here! Dough fritter wrapped in rice noodle.... unlike other places, the fritter actually remains crunchy within the rice noodle exterior and is accompanied by a nice peanut sauce. The seafood sweet and sour dip for deep fried wonton is delicious! We're fans of pretty much every noodle dish. 
This is a staple for my family! The last place we eat before going on trips and the first place we go as soon as we get off the plane! Can't go wrong for speed and price! Definitely the congee wong of the west side!"}
{"text":"Writing this as a vegetarian:

The veggie dishes I had were good, this place is a nice homey neighborhood deal. Prices don't kill you, food is good, and is very accommodating of groups. Been coming here for years, food is always good and staff very friendly."}
{"text":"Used to love going here for the baked chicken on rice in white sauce, but their quality and quantity have both gone down."}
{"text":"We have been frequenting Macey's for over 10 years. The quality of food is consistent, the waitresses friendly, and it's generally a good place to go if you want all-around good Chinese food.

I believe the style of food is akin to that in a typical Hong Kong restaurant. You won't find peking duck or shark's fin soup here, but you WILL find congee, noodles, fried rice, and the like.

The service is usually prompt and efficient, but I've been there on Friday nights when it's been really slow. Maybe they need to hire more chefs. The place is definitely pretty packed on weekends!"}
{"text":"This authentic Chinese restaurant is one of those hidden gems you find once in a while. In the past, I usually just drove past this place because it did not appeal to me. It wasn't until a friend of mine suggested that we try this place so we decided to go to this restaurant. The inside was very typical of a Chinese restaurant; plain and simple with multiple tables to seat large groups.

The two times I have been here, I ordered the eggplant congee and the chicken baked rice with black pepper sauce. First, I want to mention that their customer service is fast and efficient! Second, the food was better than expected! I usually don't like congee but this was one of the best congee I've had. What I liked about the congee was that it had lots of flavouring and it wasn't bland at all. For the baked rice, I always enjoy eating baked rice with chicken and the black pepper sauce made it even better. It had a well-balanced amount of flavours so the taste was not repetitive and it kept you wanting more.

I'm definitely coming back here to try out their other dishes!"}
{"text":"You know a place is popular when the place is PACKED on a Sunday night. Our group of 16 took the last two tables.

Because I wasn't too hungry, I just ordered a bowl of Wonton noodles for myself, which was okay. The noodles had that bouncy bite, but the shrimp wonton's could have been better. Not too bad with a hot cup of Horlick though. My other friends had a variety of dishes ranging from those you would normally have at Dim Sum (fried turnip) to regular dinner dishes (fried rice, fried rice and curry, vegetables) to HK cafe dishes (ham and egg, wonton noodles). The menu is certainly extensive and by the looks of the place, the food might be okay to good, but the price is definitely wallet friendly.

What made this place a 3 star was the GREAT SERVICE. We were quite difficult in asking for seperate bills. With our table, the lady was so kind that she decided to re-write everyone's individual bills (because she translated her Chinese bill into English) which took about 15 minutes. That kind of personalized service is something I RARELY see in busy, Asian restaurants. I think our waitress knew some of our friends who were probably regulars...that might have helped the service, but all in all, can't complain.

Great for big groups, relatively inexpensive, and great service."}
{"text":"The food here is good but service is alright. You need to be cautious about your bill. They overcharged me twice. The first time, I didn't really pay attention to the price in the menu but I felt it was a bit more than I thought it was going to be. So the second time, I noted down the price on the menu and when I got my bill. Guess what, it's overcharged than what it says on the menu. I put the cash plus tips for the price I noted down from the menu and headed out, the waitress called and said that I paid less until I corrected her that the bill is overcharged. Overall, this place is good for a quick lunch but just be careful about the bill."}
{"text":"Great authentic Chinese food. We always get the baked seafood on fried rice and the salty & spicy pork. Yum! A bit of a language barrier with the servers, but the food is absolutely delicious. 

Interior of the restaurant needs an update badly. 

Location is convenient, near Square One.

They do take out too."}
{"text":"The food here is a bit confusing - some days its great, some days it's off. But the one thing I've never been to happy with here is how crowded it is. Really really crowded. Like sardines crowded. Like if there's any emergency, I'd be fearing for my life and for my baby's life. 

The speciality dishes here are the winter melon soup and the sticky rice stuffed in a chicken (loh mai gae) - both you need to order in advance when you make a reservation. The first time we had the rice it was delicious - crispy chicken skin with succulent chicken! The second time it was greasy and the chicken was barely there. The owner Mabel is a sweet lady who ensures the guests are happy, but I feel as if this place has grown far too big that the quality has started going downhill. 

Who knows, maybe the next time it'll be great, but then it'll just affirm my belief that it's up and down! What a predicament!"}
{"text":"Really boring and low quality food with bad service. We came in for dinner after decided to try Chinese food. We ordered special congee, sliced chicken noodle, curry chicken rice, satay beef rice noodle. All very discounting.

The special congee has no flavour, taste very boring.
The sliced chicken noodle had too much Monosodium glutamate, frozen chicken tasted like wood piece. 
The curry chicken used starch to mix the flavour, yuck!
The satay beef rice noodle probably the best of 4 terrible dish, no much satay flavour. 

The waitress spilled tea on my daughter's pants and didn't even apologize. Terrible service"}
{"text":"Good congee and good noodle dishes.  Alot of people ordered the lemon tea or HK tea.  4 dined for $35, pretty good I say!"}
{"text":"So maybe my taste has gotten a lot better or a lot worse since I was little but I used to love this place, or it's possible that the food has gotten worse.  Maybe it's because the food has improved in Mississauga too. 

I ordered the egg white with shrimp on rice about two months ago and this was just after they were closed for a while and re-launched (I think).  

What I didn't like about it was that there were egg shells in the food and since my place is about a 10 minute drive, I didn't bother complaining about it, but shells in the food is not acceptable. 

I want to give it another try, but the meal was so horrendous and I'm that scared and I'm not usually a person who is faint of heart for trying food.  

I would give it one star, but it gets the additional star because of my past with them.  I used to like any of their noodle dishes and their beef ho-fun.  

...may give it another try."}
{"text":"Love love love this hole in the wall Chinese place.  Food is consistently good in all the years that I have been going there and the staff are so nice.  They have the best spicy salt fried tofu in mississauga!"}
{"text":"My family and I have been coming here for over 10 years.  We've stayed loyal even with our new healthier eating habits,  but we do come less often.  

To be honest dinner service is the best time to go because the servers then are superb!  They are on the ball,  always smiling and remembers previous guests.  The food comes hot out of the kitchen and they are popular for their large King size bowls of congee. Their food is Hong Kong style,  lots of rice,  noodles soup,  stir fried noodles and crispy snacks.  

For lunches they have lunch specials for around $7. They have great Hong Kong cold and hot teas and coffees. Hot coke and lemon drink is great for a sore throat. Although service during lunch is less stellar,  only 2 people serving. After the owner saw us waving someone down to take our order, she ignored us and didn't pass on the messagetop any servers.  Slightly frustrated...

 They have a mean wonton and I almost never order wonton noodles.  For something new you might want to try their baked rice and spaghetti dishes. It's definitely a Hong Kong dish,  fried rice smothered in tomato sauce and cream sauce.  
I recommend the beef brisket and wonton noodle soup with flat noodles (ho fan). Also the seafood congee and fried rice dishes."}
{"text":"I've been to Macey's many times, and although I haven't tasted a majority of the items on their menu, I can say with confidence that the ones I've tried are definitely worth coming back for. Some of my favourite dishes which I order almost every time I'm there are:

- Beef Hofen in XO Sauce
- any of their congees paired with yiou tiao
- Black Pepper Steak
- Singapore Style Vermicelli
- Chinese Broccoli in Hoisin Sauce
- Milk Pudding (desert)

Their milk pudding is really great. They offer it hot or cold, with or without ginger. But be sure to order it fast and maybe even eat it before your entrées because they tend to run out when it's a busy day. Another one of their specialities is their yiou tiao, or fried dough sticks. They're crispy on the outside and soft on the inside, and eating them with congee is amazing.

The service is also very good. Staff are friendly, although some of them don't speak perfect English. The food comes quickly and it's prepared well. Definitely worth a visit!"}
{"text":"My colleagues and I came to this restaurant very often. The food comes with big portion and the taste is very good considered the price it charges. However, for the comment today, I want to highlight a true story happened today on my colleague. He is an interesting, sociable and lovable Spanish. He keeps telling us how often he eats here and been coming to this restaurant for 20 years! 

Unfortunately, one of the waitresses broke his heart today. We had four people to go there for lunch (this place is always busy during lunch and dinner time), the colleague planned to reserve a table and place an order over the phone. 

Since our lunch break is an hour long, prior to heading to the restaurant, he wanted to place the order so we wouldn't spend too much time on waiting for the food. He made the first call. After the waitress confirmed his information (name, time and how many people coming), she hang up the phone. My colleague thought the phone got cut off, so he made another one to place an order. The same lady answered. After she was told to order dishes, she yell on the phone, 'we are very busy right now, come then order', the phone was hang out again without even getting my colleague reacted.

Again, I have to admit that the food is good based on the fairly reasonable price, and the restaurant is very popular. However, if a restaurant hires a waitress who doesn't even know how to respect others, at least four of us as frequent diners will not go there again. 

Good luck!"}
{"text":"Visited Macey's with three friends on a Friday evening. Surprisingly, though the restaurant was packed there wasn't a wait. My Chinese buddies ordered five dishes, which came out to about $15 each with tax & tip. 

Food came quickly, which is always a bonus. Quality was good, but nothing special. My favourite dish, noodles w/ seafood (Kwung Tung, but I might be wrong) was too crispy and lacked the strong flavour it's known for. 

Definitely a great option for Chinese food, but there are better alternatives in the area as well."}
{"text":"Got take out from here when I was craving hk cafe style food. The portugese chicken rice didn't have much flavour to it and wasn't as coconut-y or curry as I'm used to from other restaurant. The pork chop spaghetti was also underwhelming but ok. The congee was probably the best dish, though lacked the meat / seafood. Overall it's a decent place but not fantastic"}
{"text":"I was craving for the baked pork chop (which is a very well known dish in Hong Kong) and was wondering where I could go to eat some =) I just moved to Mississauga from Scarborough and decided to check out Yelp. I ended up going to Macey's. The first think I noticed was that the air conditioning was cranked up. It was freezing in there! Excited, I ordered the baked pork chop from their regular menu. Overall it was \"okay\". The dish looked over cooked, there was only cheese on half the dish and the sauce, which was the more important element of the dish was too salty (should be sweeter). It wasn't part of the set lunch menu so the bill came up to about $11.00 plus tips. The staff was friendly but the food is just okay. I wouldn't go back again but at least I tried it."}
{"text":"I went in for take-out on a Friday Afternoon at lunch time. I've eaten here before and the food was good. Nothing to brag about. However I have never been treated with any respect in this dirty little place. When I walked in I was hussled out of the way by a server and asked if I was having dine-in or take out. I replied \" take out ma'am\". She pointed at the counter. When I approached the counter I wasn't given any attention at all, rather a menu was slapped in front of me. Mind you it wasn't the lunch menu with the specials on it. I had to politely ask for that one and another server brought that one over to me. I again approached the counter to order and the lady taking my order had just graduated from the University Of Rudeness. It was like I was bothering her with my order. I maintained a smile but when I went to go sit back at a table she told me to go to the back of the Restuarant to wait. I politely told her to kiss my ass please. And sat where I was already seated to wait for my order. I had had it with being treated second class in this dirty little joint. In short, there are better Chinese Restaurants in Mississauga that I can go to with great food and great service. I regret spending my money here and I will never go back. And to be on the safe side, don't dare venture to go into the restroom. You might get eaten or have your parts missing when you retreat. Who knows what's living in there amongst the filth."}
{"text":"Food is not fresh.

We order Cantonese Chow mien and fried Calamari.

Calamari is tasteless.

What a shame."}
{"text":"Food was great.  Mistake we made was we opted to dine in.  I can normally ignore the fact that the dining area was getting dated but there is no excuse for a nasty restroom,"}
{"text":"After a long search for a restaurant with decent baked rice in portuguese sauce, i am proud to say that this one has the best baked rice ever! Even better than the ones in Markham! Other food is very good too!"}
{"text":"Pros:
Pretty extensive menu
Portions are good

Cons:
You won't be amazed by anything

Macey's is your typical Chinese diner if you ask me.  If you're craving Chinese food, this place will get the job done.  It's not flashy and it won't wow you, but it will leave you satisfied.  We were shopping at Square 1 and were looking for a Chinese restaurant near by.  Having a Chatime in the same plaza also helps!

Macey's doesn't look big from the outside but when you walk inside, there's a lot of tables here.  They don't seem to have to many tables that can fit parties of 6 or more though. I counted about 3 of about 30 or so tables that could fit.  Just be wary if you come with a big group.

Macey's has your regular offerings for a Chinese restaurant but it also has items you would find at a HK style cafe as well.  There are some western items as well just to fill out the menu.  All in all, there should be something for everyone here.  We were feeling rice noodles so we ordered two of those to share.  

We ordered beef rice noodles with veggies and another rice noodle with beef and XO sauce.  They were not busy at the time we came so the dishes come out very quickly.  One thing I got to say is the portions here are very good!!  My GF and little one shared their plate and could only really manage a little more than half.  You will get your value here, that's for sure.  The dishes themselves were what you expect, nothing special but nothing bad as well.  

If you're feeling Chinese and in the Mississauga region, this place is a safe choice.  It won't wow you but you know what to expect.  I would recommend this place to people looking for a decent meal with out breaking the bank."}
{"text":"3-3.5*

Macey's is an old school Canto diner and institution in the city.  Shutdowns can't even keep this place closed.  Interior, including the well-worn menus, have remained the same.  Waitresses have been here for decades. 

Food:  The free porky soup was flavourful.  Canto Chow Mein did not arrive piping hot, but all the ingredients were there.  Shrimp was a tad bit off, but edible.  And Portuguese Baked Rice - more like a very coconut milk-based, mild curry - lacked salt, but was fine. 

Service is no fuss and efficient.  Food arrives at lightening speed.  You're in and out for a quick meal.  Show up in your fanciest jogging pants.

This place is for people who don't like change, same old, same old."}
{"text":"Food is always great here. Make sure you try the baked pork chop on rice with tomato sauce, it's the best in the city bar none."}
{"text":"Okay overall, nothing special. Environment isn't the best, food is decent (gets the job done).

It was decently large portions though. Split the 2 dishes (curry beef rice and minced beef vermicelli) between 3 people. Flavour and taste of vermicelli wasn't bad - similar to other HK diner places. Curry beef rice dish wasn't as hot as I preferred, it was served warm (also be careful, it's a tad spicy). The rice that came along with it was quite big though."}
{"text":"Ein kleiner feiner laden, wo man sehr gut Speisen kann. Wird schnell zubereitet, gut organisiert und schmecken tut es ebenfalls. Wer in Mississauga was schnell und gut essen möchte, einfach in dieses Lokal rein! Ist kein Vergleich mit ein paar anderen."}
{"text":"My family has been going to this place for years. It's not a fancy place but it provides consistent solid lunches at affordable prices. The service and food quality is always the same.  Fast, cordial, large portions, freshly made, and true authentic Hong Kong flavours.

We often get Yeung Chow rice, a few noodle dishes, and a big bowl of Juhk (congee). It always comes quickly, fresh, and with good amount of meat and vegetables. The snacks (deep fried bread surrounded by the rice noodle) are tasty and freshly made. I can't complain! Our entire family can be stuffed full for less than $30."}
{"text":"comparing prices to other chinese restaurants in the area this place is about 10-15% higher per dish than the average. But.......portions are MASSIVE! so the value is actually good. really lame looking place but very clean... everything on the menu has treated me well.. i like the chicken fried rice with the shrimp paste in it. i hear the Jook is very good here...The service is excellent. waiters are very tentative and they actually pack your leftovers. i hate it when some restaurants just throw the boxes and bags on the table for you.... they been around for long time and you can expect line ups on any give saturday evening."}
{"text":"Macey's is a small, family-owned establishment located in a plaza just past Mavis, along Burnhamthorpe Road West. The restaurant features Hong Kong cuisine, so don't be alarmed by the menu if you come across club sandwiches, macaroni, or cream of mushroom soup - that's just the western influence creeping in!

As a party of 4, we arrived at around 8:45PM with the dining room filled at ~30% capacity. We were seated immediately, and orders were taken in roughly 5 minutes. I ordered the shrimp dumpling with noodle soup and deep fried stuffed eggplant.

Shrimp dumpling with noodle soup ($6.00): The broth and egg noodles were pretty industry standard based on my experiences at other restaurants, but the shrimp dumplings are what stood out to me. First of all, they're huge, and you get around 4 - 5 of them. Now, take this in: each dumpling is comprised of 5 - 6 shrimps, so in effect, your order actually comes with 20 - 30 shrimps! With that said, you can definitely guarantee your money's worth by ordering this noodle soup dish.

Deep fried stuffed eggplant ($5.50): \"Deep fried 'sandwiched' eggplant\" would probably be a more applicable name for this dish. This snack includes fish cakes sandwiched between slices of eggplant, and is served under a sweet, lacquered soy sauce. Nevertheless, it was super tasty. The outer layer was crispy, the eggplant was soft and buttery, and the fish cakes were nice and firm. I honestly can not recall a recent dish that I've had exhibiting this much textural contrast. The sauce was also a winner. Think of dark soy sauce (i.e. \"a little goes a long, long way\"), except sweeter.

Overall, highly recommended if you're looking for some cheap and tasty Hong Kong-style food. Even better, this restaurant neighbours Chatime and Sugar Marmalade for your post-meal dessert cravings."}
{"text":"I went with my brother and overall, it was a good experience. We ordered the chicken fried rice, calamari and pasta(not sure what it was called) but I can say for sure the fried rice and calamari was amazing! Staff was very friendly and very nice. The cost of the food ranged from 10-12$ for each dish but overall, it was pretty good."}
{"text":"I got the usual black pepper spaghetti with beef and congee and once again it was great. Portions are still pretty good too. Service is curt but fast."}
{"text":"I came back here to try other dishes at the restaurant. Overall, the food was still great!

I ordered the small steel pot rice which is typically not found at other restaurants. It takes half an hour to make the rice but it's worth the wait! The rice was on the mushy side and you must add the accompanied soy sauce if you want the rice to be tastier. Without the soy sauce, the rice will taste plain. 

The fried cuttlefish was good. It was freshly fried and garnished with black pepper salt and diced red and green peppers. 

Ordered the Cantonese chowmein at this restaurant and also had abundance of seafood and vegetables on top. Chow mein had some fried noodles as well. 

All the dishes came out relatively fast and all were delicious. No particular complaints."}
{"text":"Today we decided for take out lunch on Macey's for beef brisket with veg on rice. Today weather is nice to go eating outside to enjoy our lunch But after eating it my tummy starting upset."}
{"text":"This place is a classic Chinese greasy spoon, HK style.  My colleague told me about it, and it's a great place to come for noodles (I love the XO Beef fried noodles).  The service goes at lightning speed, and I don't think I've ever had a bad dish here.  Prices aren't too expensive either.  

However, in classic Chinese greasy spoon style, beware the heavy usage of MSG."}
{"text":"Definitely one of the consistent performers of Cantonese cuisine in Mississauga!

Even if they're a couple of dollars more, there's a reason they've been one of the longest restaurants in town. You can always trust the service and quality of food here. They've earned the trust of many locals - and our loyalty."}
{"text":"Great place for lunch.  We always go for the beef brisket with rice.  Very tasty, lots of gravy and includes Choy sum as part of the meal as well.  Big portion.  

Waitresses are typical Chinese ones, not super friendly and very abrupt, to the point.  Almost feels like they're bored being there but love to conglomerate around the back counter chatting away among themselves.  

One very important thing to note is that they include a free drink for their lunch special, which can be a hot or cold drink.  However the waitresses here do not tell you or ask you what you would like for your drink.  In fact, they actually try to avoid telling you about it, so they don't have to give it to you, which I find very annoying.  The only reason why we found it that it included a drink was because we decided to order a Hong Kong tea to go and the waitress told us that we could not do that.  We didn't understand why until she explained that because you get it free, you have to drink it in the restaurant.  Well!!  Why didn't you tell us earlier then?!  After that, we always made sure to order our free drink the minute you order your lunch.  We also observed that they never remind any of their customers about the free drink.  Yes, I am rather pissed off about this because we missed having our free drinks many times before and feel ripped off!  So sadly, I have to rant about this.  

Anyway, overall their quality and portion of food is tasty and generous.  $8.50 for lunch including the drink but if you order a cold one, it's 50cents on top."}
