{"text":"Best ayce sushi place in Calgary. Service was prompt and servers were friendly enough. Sushi quality is what really surprised me - some of the best I tried in Calgary, with large sashimi pieces. They even had toro on the buffet menu, which really surprised me. The toros were fairly decent in quality as well.

BBQs were pretty decent as well - don't think I'd go there just for BBQ, but it complements the sushi fairly well.

They even have desert included in the ayce, although the desert's are decent at best. (But it's part of the ayce deal!)"}
{"text":"I like it here! What's not to like? All you can eat sushi and bbq!!  I mean, nothing is more satisfying than to know the more you eat the happier you'd get! :)  I'm always a fan of all you can eat sushi - especially after a long day... so that's how we ended up here - a long day after the zoo!  We ate everything, and I mean everything!  Most of it tastes good, and I would say 98% of what was brought to our table we excellent!  The most memorable \"no good\" item I clearly remember is their kimchi... it was just raw garlic taste and nothing else... but, sushi was great and fresh, and the bbq offered lots of choices and was marinated really nicely!  This is a place I'll take hungry friends and family for any meal!"}
{"text":"We gave this place a second chance last night and it was definatley better. The place was hopping this time and the sushi was pretty good. We also had a unlimited supply of Toro, both sushi and sashimi. I still can not get over the cheap seating, a little uncomfortable. The service was excellent and they had run out of nothing. We will be making this our regular sushi place instead of Sushi Ichiban up the street. I'm glad we gave this place a second chance."}
{"text":"I am writing this after standing in the entrance without anyone even saying hi for 20 minutes and when we asked the sushi chef told us \"maybe you should just come back another time\"."}
{"text":"I'm not usually an all you can eat girl.  But my mom wanted to come here for Mother's day because her co-workers were all talking about it.  Actually for someone who never tried sushi like my mom, all you can eat is a great idea.  Macleod Trail Sushi & BBQ has a big enough selection for her to try most common items on a menu, like Salmon & Tuna Sashimi, Agadashi tofu, Rainbow & Dynamite Rolls and more, but not so big that she is overwhelmed.  Also, there is BBQ for more variety.

Each serving is small, so we ordered more than one servings each time so we are not waiting too long for food, but not so much that we couldn't finish.   You can make reservations, which I would recommend on a weekend.  We tried going the Saturday before but we when we called at 6pm, they told us it's full until 8:30.  When we arrived on Sunday at 7pm, there were a few groups of people waiting already.  There was a piece of paper where you can write your name down, but one lady was getting a little worried because she was there first, but people started writing their names on top of her.  We were seated pretty quickly though.

Our food came at different times. A couple of things we ordered on the first order came after we finished everything.  My dad's pop was refilled fairly quickly, but the rest of us never did get our tea cups refilled even though we asked a couple of times."}
{"text":"My brother really wanted my grandma to try sushi, and since Kinjo was too busy to seat six we quickly called Sushi & BBQ and made reservations. First of all: I'm not a really big fan of sushi personally, it's ok, but I don't really crave it. I must say though, some of the sushi I tried I really enjoyed. I've always like the smoked salmon ones, although I wish the salmon bit was larger, and that sour cream and yam choice was a present surprise, along with some of the tuna choices. I'm pretty grateful that their all you can eat menu includes kitchen food, that way I wasn't forced to eat only sushi and raw salmon all night (I do love salmon, ps, but when it's raw I want to throw up). 

The service was pretty decent, I wouldn't say they are the most detail oriented. They frequently walked by without picking up our filled our reorder sheets, or they'd walk past us with water jugs and not fill up our glasses. 

But the atmosphere to this place is pretty cool, no loud music, and your seating is semi private, which makes it a pretty good place to sit with friends and stuff your face with sushi until you throw up."}
{"text":"Seating is very uncomfortable. The Sushi is mediocre. The BBQ is kinda cool, but if I want to cook my own food I'll stay home.   Go across the street to The One Sushi for better food for a tad more money. With much better seating."}
{"text":"Went here for a mid week \"all you can eat\" dinner.

First off - the food. Great. Blow your mind sushi? No. But solid, prepared sushi goodness? Yes. Lots of variety and a pretty extensive menu for all you can eat. No complaints there.

Service was friendly but fairly average. Chef was very friendly as we were leaving.

Here's my issue. It's a hole-in-the-wall, granted. But it is dirty. Lots of dust bunnies on the fixtures and the bathrooms are a bit scary. You don't have to be fancy or douse the place in bleach every week but simply cleaning is pretty easy to do. I can roll with things pretty well but it was a little too grungy for me to love the place."}
{"text":"This place is all you can eat sushi and Korean BBQ. My group order both. I was surprised by the quality of the sushi it was really good compare to other all you can eat places. The Korean BBQ was also good. We recommend to try this place out."}
{"text":"Great all you can eat resto.  There is a circular bbq on table which you can grill Korean style meats.  Excellent quality great staff, great selection and good size resto.   Very clean. One of the best in city!"}
{"text":"I do have some nice photo. Next round it I will try ONE SUSHI JUST across the road from them. I believe it's $14.95 that's really good value for sushi with BBQ. First time here. Service is really good. Great servers. I will come back and try them again. See photos."}
{"text":"YUMMMM great sushi and bbq place in calgary!

i had an awesome experience at this one : ]"}
{"text":"Our regular go to place. Always excellent even though we are sad we can't get coconut or mango ice cream any longer. Lunch is an exceptionally great deal."}
{"text":"My husband and I have been here countless times, together or with friends... we bring everyone who will listen here! 

We used to come by so often the staff all knew who we were the second we walked in. Everyone is incredibly friendly and cares about your experience.

When the other restaurant opened across the street I know this establishment suffered. They were forced to make upgrades and changes to keep on par with the other place! The thing that helps this restaurant stand out? The bbq built right into your table. You order your meat (beef, chicken, lamb, pork, etc) and grill it yourself. It is a lot of fun, and it has helped me learn how to cook meat (which means my husband doesn't have to do ALL the cooking ;) ).

We love it here and will continue to come back."}
{"text":"Food variety is decent. However the food contains high sugar and fat. Also the food can easily causes diarrhea, my whole family is in bathroom for a day"}
{"text":"Delightful dining experience! I was a bit nervous to come here after reading some reviews, but had already made plans and don't regret taking that chance. What I liked most about this restaurant was that for some of the menu choices, you can cook it yourself in a BBQ built right into your table!

All of the staff we interacted with were friendly, patient and accommodating with all of our needs - we were waiting for someone else to join and they had no problem with us taking a table despite their dining time limit.

Though they have a few menus, we opted for the all-you-can-eat option which is affordable and diverse in it's choices. It's nice in that it's really a buffet brought to you - you simply write down how many of everything you want and send the card with the server each time you want more. Food (as well as drink refills) come out super promptly and are well prepared.

The seating was a little uncomfortable in that it was wood benches with simple cushions, and there wasn't a lot of leg room. If you're with the right crowd though, combined with the delicious food, you forget about that pretty quickly.

Overall, very happy, and will be coming back!"}
{"text":"First of all, the service is amazing. I went in with my wife last night for the $25 all you can eat dinner. The Filipino waitress was very nice to us. The sushi was good, nothing outstanding, but solid. I also enjoy to have the korean bbq option. My problem is with their Japanese fried dishes, they are just mediocre. I ordered couple fried dumplings, there were very soft and bland. And the spicy chicken was actually sweet. 
There are over 150 options to choose from on their all you can eat menu. That's a lot for this little restaurant. My suggest to the owner is to remove those mediocre dishes and just leave sushi and korean bbq on the menu, you will have much better reviews from customers and less headache for the kitchen staffs."}
{"text":"McLoed trail Sushi and BBQ serves as an alternative to all-you-can-eat sushi on McLoed trail, where Sushi Ichiban is more widely known. Still when we walked in here on a Friday night, it was relatively packed.

The main difference is that they offer bbq services to go with their all you can eat menu. Their selection menu is a little small but simple. We ordered nearly everything on the menu and found all the food satisfying and neatly prepared:
-The bbq selection was standard but beef, pork, and chicken was available
-Their hot food was ok, it wasn't gross after a while of eating it but they kept coming in super small servings
-Their sushi and sashimi were...decent and filling.  A great way to tell the skill and quality of any Japanese sushi joint is to try their Tamago (egg sushi) and  quality of this sushi to gauge the skill of the Itamae. This location's Tamago lacked the customary colour of yellow and had too much sugar in it, but was still savory and well formed. 

Their service was all right. The waiters who dealt with us were pretty patient, but I found their all-you-can-eat policy policing a little annoying. Our group was a little unsure of how many would be coming to dinner and they would only allow us to eat if no more guests were to arrive at our table (unless they paid the all you can eat price). In our hunger we scrambled to arrange the group, but as usual, I have no control over my numskull friends so we still had late arrivals. One of the chefs, who should be making our food, stood there gawking at us with suspicious stares and poking at our waiters, rather than trusting them to do their job. Maybe next time you can wear a disguise, particularly a smile that hides your scowl, man...

Sorry I don't like tattle-tails. Period.

2/30"}
{"text":"I am really happy they had korean bbq AND sushi. The food was okay, but can't complain since it is AYCE. BUT ... but .... they didn't have any pork belly for bbq. My person and I was really disappointed. 

The service sucks, you NEED to call down or try find a server. There were many times we wanted to order more, ask for things, etc. But it was hard. 

If you're looking for an ok place to eat kbbq and sushi, this is your place."}
{"text":"I have definitely had better sushi but this place gets 4 stars because of the fact that it was really good for all-you-can-eat sushi.

I took my 7 year old niece out for a \"date\" last week and decided to try a new place. I choose this restaurant because she only likes California rolls but can put away 10 to 20 pieces. To my great surprise, she wanted to try the ika karage and some of the Korean BBQ items as well (though I think that was more for the novelty of being 7 and cooking your own food). I tried a bunch of different things with the highlights being:
- Mango crunch roll
- Ika Karage
- Dynamite roll
- tempura

I had to try the oysters but found them really fishy so won't order them again and the gyoza were nothing to write home about.

I especially  liked how the staff   engaged my niece asking her what she wanted to try, what she really liked and giving her ice cream for desert. 

I have a date with my 10 year old niece coming up and I suspect this is where we will go."}
{"text":"A favourite among my staff, we love going here for staff meetings and fun evenings, food is great, service is good, and it's always filling, all you can eat is great but you always eat too much, feel like you need to get your monies worth, and this place is your monies worth, give it a try if you haven't done so."}
{"text":"So, it's not as good as Vancouver sushi, but the quality is pretty decent and there's sashimi included!  The staff are friendly and always welcoming and accommodating.  Pretty good bang for buck -$25 for AYCE."}
{"text":"Great prices, the atmosphere is cute and quirky and the seating is in cute little wooden stalls with little cushions to sit on. Not the most comfortable and the halls are a bit tight to navigate. Bathrooms are also juuust a little questionable. 

HOWEVER; fish you get is always cold, cut well, and super tasty. The wait staff are quick and prompt with food, friendly, and welcoming. As soon as you come in the building the kitchen staff greet you! Very charming and friendly, and for the variety that's on the menu, everything tastes really good. Not to mention they were very accommodating and friendly to our +10 group who came there on a work-dinner, and patient with the chaos. 

I for one enjoy the little wooden stalls, it's such a great atmosphere and cute to be in. 

Points for cute building, good food, friendly kitchen staff, and great value.
Negative points for questionable bathroom, narrow hallways, and that the kitchen staff is some how way more friendly than the wait staff."}
{"text":"I gave this place a second chance. The last encounter left an astringent, bitter taste in the abyss of my mouth. Loud, crowded, poor service...it has improved quite a bit since then.

The food was delicious; fresh, succulent and delivered promptly. The waitresses were sweethearts, and swiftly satisfied any requests for drinks refills. Overall, the customer service was excellent - until the end. 

The waiter delivered an unwelcome, crass remark about how my date and I \"looked like we should be somewhere else\" after the two-hour limit was reached. I think he was attempting to be polite: he *did* say he wasn't attempting to kick us out...just that it \"seemed like we had other plans tonight\". I understand the time constraints, yet we lost track of time because the line to pay was so long, and the waiter told us we were permitted to sit down until the crowd dispersed.

I feel the waiter could have definitely phrased his concern in a more polite fashion (e.g. \"I apologize for the interruption, but I'm afraid this table needs to be cleared for the next guests in line. The restaurant likes to implement a two hour limit in order to help all customers. Thank you for your patience and understanding.\") I felt incredibly offended by his rude behaviour. He was a cheeky punk, too; after his subtle GTFO spiel, he inquired as to how our experience was that evening. I was going to give this place a five, but sadly that rude encounter left my night on a sour note.

To summarize, I say it is a rather pleasant experience when the atmosphere is just right and you 'hit all the green lights', as it were."}
{"text":"The first time I went here it was super busy (it was a Friday night) and we could not even get the attention of the hostess as she was way too busy bringing orders out. We left and decided to return another day hoping it would be better. When we came back another day and finally got a seat, I noticed that the interior isn't the nicest and the place looked a bit dirty so I was kind of skeptical about trying out the food. The sushi was meh, I've had better but it wasn't bad since it was AYCE. I will say though that the Korean BBQ was amazing and I really liked that we got to cook it in front of us. I love their mango milk tea and green tea ice cream. As for the service, it was decent and the staff was really friendly!"}
{"text":"My friends and I were there last Friday for their AYCE. I haven't had AYCE sushi in Calgary for a while now as they cannot compare to the ones I've had in Vancouver. Our server was really nice and quick at bringing our food out, once it started coming. The sashimi was better than the last time we were there so we decided to order a second round. That was the mistake. The grade of the fish seem to be different from the first. The salmon was a different tint of pink and the tuna was a bit rubbery and stringy. Even the agedashi tofu was different from the first batch. It was soggy and falling apart. It's as though they're trying to say, we don't want you to order more. So the lesson is order as much as you can the first round because you'd only be disappointed there onwards."}
{"text":"Came here on impulse the other day as the bf was starving. Felt kind of silly walking around the building trying to find their entrance (as there are multiple doors that don't open). The decor here is really knick knacky, with a sign by their toys stating their thanks for not taking them out of the restaurant. We were sat in the back corner of the restaurant, I strongly advise to bring a jacket or sweater that you don't mind smelling like bbq, as it gets a bit chilly from their ventilation system. 

I was kindly greeted by broken dirty chopsticks as I pulled them out of the package. Totally unappetizing. The buser didn't seem to give much concern when I pointed this out to them. They simply gave me a new pair and walked away (I had the benefit of being able to keep the dirty pair - yay). 

Forward to the food. I enjoyed coming here because there was the choice of korean bbq. The meat came out in good proportions. There was major confusion for us as we didn't know what was being placed in front of us from our order... we played rounds of \"guess the meat\" as we ate. 

We got a good selection of hot food items as well. Their portion sizes are small, but there are lots of items to choose from, so no need to fill up on just one item the first round.I don't see many locations with \"Tempura crab meat\" anymore, so I loaded up on those... so yummy! Their \"Ika Karaage\" was decent, but like many of their other hot dishes, it got gross within five minutes of sitting on the table.  Their hot dishes are simple, no additional garnishes on them at all (i.e. agedashi tofu - seriously just deep fried tofu with a soy based sauce). I highly discourage getting the \"Curry Crispy Chicken\"; it was watery and just gross... seriously off-putting.
 
Last but not least was their \"sushi & sashimi\" selection. I'm sad to report that the restaurant limits one order of sashimi per adult per time. Limited selection of sashimi, but we usually go for the sake anyways. The portion sizes are once again small, theres the occasional piece of sashimi that just looks... weird and different from the others in the set... it tasted fine though... so meh. i typically get the tamago from any sushi place I hit. The tamago here seemed very rubbery, and it was a bright yellow color and tasted very sweet. Not the worst I've tasted, but not what I would expect from a sushi joint.

We were a bit over ambitious when we ordered the \"inside out roll\"s. We ordered seven orders of the rolls our first go around. There were no descriptions listed on the order sheet... so we hoped for the best. What came to us was a beautiful plate of rolls with neon coloured sauces on top of them. We basically did sushi russian roulette with these rolls. I didn't enjoy them at all... in truth they were all quite hard to stomach.

I've never had an occurrence where I've put a mango roll in my mouth and wanted to spit it out right away.... my mouth was coated with the neon yellow sauce which i I took to be mango mayo. Quite unpleasant. As with the other food items, the sushi quickly got gross after sitting on the table for a short period of time. Another nono... never should I get salsa on my rolls... ever. You don't know you've hit rock bottom until you've tasted that.

We ended our night here with a quick round of desserts. The \"mango tapioca milk\" was very thin, and we got random exploding boba in it as well. I have a sweet tooth, but even this was too sweet for me. I'm glad to say I had no complaints about their ice cream though. Theres seven different flavours to choose from; loved their mango ice cream!

Would probably come back again just to fill up on mysterious meat and ice cream..."}
{"text":"Best all you can eat sushi in Calgary for sure! Their rice is usually VERY good, and the cuts of fish for the nigiri are in perfect proportion. Their chef lived and trained in Tokyo so you know it's legit! 
We go semi-regularly for a good feed. SOMETIMES when they get rocked, the service can suffer a bit, but in the end you do get what you order. The yaki-niku (grilled meat, or Korean BBQ as the Japanese call it) is very good. Portions of the meat are a little on the small side, but since it's all you can eat - simply order more!
We LOVE this place, it's a lot of fun to grill your meat at the table and the sushi is always on point."}
{"text":"I can't really fault this place for anything. In fact I could feel like I should give it 3 stars but I have to give it 4 simply because I can't find anything paticularily wrong with the food. 

The menu was pretty for tight, which is always a good sign. Service was good and food was executed well! Everything tasted quite good though nothing really blew me away, which I guess is quite typical of these all you can eat joints. Notice a trend here? I feel like have said \"good\" about 20 times... 

So I guess what I am trying to express here is that this place is kind of average but a little better than average and it's definetly consistent. Even with a full house of people here they seemed to have no problem putting out the food at a \"good\" pace.The servers and kitchen, all carried a calm and relaxed demeanor , this place is definetly well managed from what I can tell.

So if you are wanting some japenese /Korean and you want as much as you can eat this place is certainly appropriate for you to try. It's a good place......


23/30"}
{"text":"Decent food and atmosphere, quick service. The portions for AYCE are not overwhelming so you can make it to almost three full volleys before you decompose. They are sticklers for no latecomers to tables; situated beside the Blind Beggar pub, they must have a history of rowdy patrons taking advantage of free food. I wouldn't necessarily go out of my way to come here again."}
{"text":"I have eaten there 3 times. Last time was the end for me. It was dirty, too dirty too feel like food could be healthy.  Bad sign in a sushi restaurant."}
{"text":"Fantastic price if you come hungry!  I've been here three times now.  The first time I could smell gas through my entire meal, which I didn't like.  There are burners on every table for Korean BBQ, and perhaps mine was left on.

If you can eat a lot, this place is a no-brainer.  The sushi is great, but there are many other options if that doesn't interest you.  I think it's $24--eat 30-40 pieces of sushi, and you're better off here then somewhere that charges à la carte.

I've found the service to be fairly good.  I have had to wait at least 10 minutes every time (Thursday, Friday, and Saturday nights)."}
{"text":"Went on a date with the bf. it was very busy and only waited 10mins to sit. Server was there right away to take our drink order. After we gave or food order( all you can eat) it was brought to use fast. Was very good. I even tried for the first time Korean BBQ. Over all it was a good time n we will be back."}
{"text":"The food here is amazing! It eats like a sushi restaurant that's not all you can eat. Big beautiful slices of sashimi, rolls were delicious. The kitchen items were well prepared.... So you're wondering why only 2 stars? It's because our table was not cleared once throughout our meal, so we kept having to move dishes around to fit new plates. They also kept bringing us food that we did not order. At least 3 times throughout the meal we got stuff we didn't order.
Towards the end of our meal we were all getting full but we wanted a few last items that were our favourites (salmon rose, scallop tempura and udon soup).  When a waiter came by with miso soup for us, we told him that we hadn't ordered miso soup.  20 minutes later none of our food had arrived so we asked where it was; we were told that because we had turned down food that all of our pending orders were cancelled. 
The problem was that we turned away food that we did not order! No one told us that our order had been cancelled, they just left piles and piles of dirty dishes on our table and kept walking past like it was business as usual.
I told the staff that you can't cancel someone's order without telling them, but it fell on deaf ears... We got our bill, paid and left without getting our last order. 
Service like we received tonight makes me wonder how places like this stay in business."}
