{"text":"Caught the Flames game at Mad Rose and our table snacked on poutine, yam fries, and wings. The restaurant was pretty busy and we were lucky to get a high top table with a solid number of TVs to view from. Service was great, our waitress dropped by regularly to check in on us and take drink orders.  However, the food could use improvement. The yam fries were bland and not crispy. While the poutine's gravy was room temperature and the fries resembled McCain's frozen shoestring skinny fries that you'd find at your local grocery store."}
{"text":"My wife and I were in search of a new spot for wings during the week in the nw and were lucky enough to give Mad Rose a shot.  We came around 6pm on Tuesday which is wing night.  Place was about 70% full so we had no trouble finding a table.   We had not been seated more then a minute and our server made welcoming eye contact and promptly brought us menus and explained the specials.  Drinks came fast and the pints are actually 20oz.   This is a rarity I have noticed lately.   We only had wings and they were excellent.  Big in size, hot, crispy and not drowning in sauce which we prefer.    Service remained consistently good through our stay.   We will definitely return."}
{"text":"Good beer - good wine - great food (pizza's are decent).  Nice place to hang out!"}
{"text":"Have been stopping in regularly since opening day as this pub it's right across from our house. Really hits the mark when it comes to the modern pub - a great place to have a drink with friends, a lunchtime meeting, or to watch your favorite sports team at night.   The manager takes great care of the place, the device is good and the food is the most consistent of any resto pub I frequent.   A big plus is that during NFL games they play sound and the specials are always running regardless of what's going on that day.   Give MadRose a shot if you're nearby and I promise you'll enjoy it."}
{"text":"MadRose used to be a favourite of ours. We would routinely order food for pick up, and dine in. When we would dine at the restaurant, it was usually full. However, we took some friends of ours last week to impress them with our knowledge of good places to eat, and were sorely disappointed. None of the food was anywhere near the quality that we had been accustomed. I ordered the Sicilian Penne, and the pasta was almost mush. The sauce was basically tomato paste straight from the can. No one finished their meal.  I should have realized that something had changed when we first entered, and noticed the place was near empty. I thought we just had good luck, but it turns out that everyone else has already learned what we were about to.  I'm really going to miss the food from Mad Rose, too bad they changed."}
{"text":"We've been to the Mad Rose more often than any other pub as of recently and I like the energy even though it is definitely a unique crowd.  The service is always friendly (which goes a long way). The burgers are good, the pizzas are pretty good, and the buffalo chicken wrap is a favourite! It's all simple pub food, but they haven't managed to fuck it up, like a lot of pubs do.   A couple things I wish were different; When playing hockey games on the TV's; I wish the commercials were muted or music came back on at a reasonable volume. I know it's hard to monitor this, and I can handle the hockey noise but it's not fun listening to Swiffer Wet Jet commercials blasting throughout the pub when you're trying to have a conversation - I can do that at home. I wish Mad Rose would also ensure the glassware is rinsed a lot better to avoid that bleach smell....and a little change up with the menu would be nice as it doesn't appear to have changed in a while. But these are minor and don't stop me from coming back.  Mad Rose DOES do beer correctly though.  The major plus of the Mad Rose, and I say this with emphasis, is that the beer is COLD. I mean, it is PERFECT TEMPERATURE COLD and it is never been served flat. This seems to be a very difficult task for most pubs to pull off in this city and I find it very frustrating when a bartender serves me a shitty beer and he can clearly see it's a shitty beer.   The Mad Rose also correctly garnishes beer.  Most pubs think that we don't notice when you order a wheat beer (a belgian white or a hefeweizen) and it doesn't come garnished properly.  Trust me, we notice, and we don't come back.  (I also find it hard to believe that the beer suppliers are okay with pubs not serving their beer how it should be served.)  A message to pubs: Run to the Sobeys next door and buy a god damn orange.   The Mad Rose has the \"neighbourhood pub\" feel with a lot of older folk (please don't start offering blue hair specials!), construction workers and it appears a lot of husbands avoiding their wives. But the energy is fun, and you feel very comfortable here.   Now I want a beer."}
{"text":"Went there for dinner. Sent two drinks back, one glass of wine had gone bad (and had gross looking floating stuff in it) and a beer had dish soap in it. And my pizza took more than half an hour to arrive (it was very good though.) And on top of that, I probably had the least friendly server you can imagine. Gonna give it one more try, but so far very disappointed."}
{"text":"From the outside this looks like your average pub. So not so! The inside is gorgeous and modern. Food and service fantastic. Had calamari for an appetizer and the chicken sandwich for my entree and both were soooo good. The hostess and waitress were so accommodating and nice.Cant wait to go back again. Yum !"}
{"text":"Great place in NW Calgary.  A little tricky to get to but well worth a visit.  The chicken wings on Tuesday nights are 0.25 cent each and are big and tender.  Burger was very good, and almost too big so bring a appetite.  Good service.  Not sure what the other reviewer was talking about....my friend had free coke refills all night.  They have a great beer selection, with lots of B.C beers on tap.  Go early on wing night though as it gets busy."}
{"text":"Clean pub, professional crowd, great service and good food so far! Nothing to complain about! This is what an upscale pub looks and feels like with floor to ceiling windows, darker furniture. Bright but not too bright. I also liked the fact that it is newer.  It has quite an extensive menu - anything you could want, you would likely find it here! Wed is 25% off pizza day. A small veggie (crust fresh, homemade everyday) was $9, cannot beat that with a nice, warm cup of tea for lunch with leftovers to bring home.  Each day of the week has a drink special and a food special. Love that. I also liked the fact that my friend had a refill on her iced tea and was only charged for the 1. Even the washrooms were spotless. Thankfully, I live close by and Mad Rose will serve well on those days where we do not want to cook. I am anxious to return and see what other dishes they serve up well. Plenty of parking in the lot. I think this place will do well."}
{"text":"Ill start off with what I liked. I had a newer sever and I cant remember her name but she was fun, she flirted JUST enough that I could think she thought I was handsome, but not enough for me to get weird and ask her out. The drinks where pretty good, I had a Dark and stormy, the ginger beer was a bit strong, but I cant decided if I love or hate that drink in general so Ill call it good. I really like it here, they WOULD have got 5 stars , but the pizza really didnt do it for me. I was told it was going to be amazing, not even by just the waitress but by a random guy there, and I mean  like the movie \"Logan\" good, but a Pizza. But what I got was \"Xmen days of future past\" good. Like it was good but not super good. For those of you who have touched a boob before: The food is good (Fried pickles where the bomb diggity) Pizza is good but dont set super high standards, itll fall short."}
{"text":"PROS:  Great Food Great Prices Good Service Clean and new inside  CONS:  Not much character  More of a modern open layout - not very cozy, sound isn't blocked Parking lot is always packed (but I guess all these little shopping complexes are like this in our city) Over the phone take-out service isn't very friendly - always put on hold and transferred to 2-3 different people"}
{"text":"Wandered in and found a table off to the side to meet my date. The pub wasn't super busy, but I must have been in stealth mode as they didn't know I was there for about ten minutes.Eventually the saw me and brought me a menu and asked about a drink. Got a water as I expected my date to arrive shortly. When my date did arrive, we waited and eventually I had to walk and find a staff member to serve us.   Deep fried dill pickles were great, as were the salt and pepper wings. Beer was cold. Ended up with a different server as I guess it was slow and they sent the original home. Second server was better, actually checked on us periodically and was more pleasant."}
{"text":"Great atmosphere, Nice staff, Clean and Spacious, Delicious Food and Price is very reasonable! Will definitely be coming back!"}
{"text":"Great neighbourhood bar/pub with good atmosphere and really good food. Lots of big screen tvs for sports and all types of seating - booths, tables, bar, high tops. Pizza and steak sandwich are excellent. Cute waitresses too, if you care about that!"}
{"text":"Great place to chill. Daily specials. Awesome beer. Amazing pizza crust. Good atmosphere and most important...great service."}
{"text":"These guys are fairly new and at first I was very excited for them to join my limited dining selection around my home base.  Maybe that's why I've now been there three times when I'm sure most of my neighbors have yet to notice them... heh.   Biggest peeve of the place is the parking lot.  You can only access it by heading Northbound AND you can only leave by going North.  There isn't a good place to really do a U turn without risking a ticket so it's a pain to either get in or out of that place depending on where you're coming from.   A civil engineer needs a swift kick in the butt for that design. That or I'm totally missing an entrance or teleportation portal there somewhere.  The decor is very nice,  but it seems to be a place for professional NW dwellers to go and drink alone. There are lots of TVs so it's great for sports but it's not too loud for those who couldn't care less.  I don't see a lot of groups/couples and most people are not really there to dine.  In that vein it's a very strange environment to me so far.   I've been here mostly to eat but I like some of their top shelf options in the bar.   They have grey goose cherry noir which I hadn't had before which I quite liked.  My first trip involved delicious veggie lasagna and I decided I was sold on the place.  Unfortunately none of the other dishes I've tried quite lived up to the first time.  Pizza was sold to me as \"award winning\".... but I boxed up 2/3 of it to take home because it wasn't don't anything for me and didn't actually eat my left overs because it was rather underwhelming and bland and I just couldn't bring myself to reheat and eat it.   I'm not sure who's award it won... but it's WAY too expensive for what it is and it's totally boring. Even on the 25% off day,  you can get the same pizza else where for less... or spend about the same for something epic somewhere else.  Either way, pizza is a total pass.  The fettuccine Alfredo was boring too... it's not the jazziest dish in the world but usually there is a taste there beyond the fat in the cream.  I had to pepper it like crazy to be palatable....  again,  you'll find something of this quality at BPs or somewhere that's not going to charge so much.  With those three meals I've kind of burned through the 3 main vegetarian entries and I no longer know what I feel about the place.  Definitely worth the lasagna do over and I love the look of the nachos I saw come out (HUGE so that's a bit frighting but maybe good with a group)   Something that bothers me here is how the nickle and dime you.  Which is one thing I could get over,  but I HATE finding out about it on the bill.    - no free refills on the pop but the server never said anything about that when she offered to bring another  (maybe just a service flaw) and the pop is kinda expensive for no refills - adding things to the meal costs a fortune.  Adding broccoli?  $4!    I could see $4 for a meat.. but broccoli huh? - If you go in on a pizza or pasta night (25% off) the discount doesn't apply to anything you add to the pizza or pasta.   - We got a bit fancy with the bar and required cups of ice with our shots.   The bill for that was an open charge of $1 each... for cups of ice!  I ordered my pop without ice... you think they could have cut me a deal on that - no?  I mostly just want to start ordering things here with random changes to see what they'll surprise me with on the bill.  \"Push all my food to the left side please\" and get like a $2 service fee or something.   Maybe I'll be surprised when I take a second trip to the bathroom and get the explanation \"Well your first trip was free, but all other trips are $3.   You used two paper towels so I should have charged more but I cut you a break\"   Ahh I jest.  Worth a go... but I'm still kind of forming my opinion of the place and will give it some more time."}
{"text":"We regularly visited this neighbourhood pub and enjoyed excellent food and service until the last time we went in (last Friday) & noticed that things had changed immensely. We were told it was a 1 hour wait when within 20 minutes a table came up. The speakers for the hockey and baseball games were so loud that we barely could hear each other talk. The noise never used to be this high. They didn't have the beer I usually enjoy on tap. We found out later the place is under new management and it's pretty obvious. It was not a positive experience like we're used to and I suggest the new owners change the name from \"pub\" to \"bar\" because this is exactly what this place is becoming. We won't be going back and will find another place for our Friday drinks where we can also enjoy subtle background noise/music but hear each other talk!"}
{"text":"This place is legit. Hidden in the corner by the wal mart, you'll most likely drive by it without realising it. They have the best pizza in Calgary. My go to is the bacon cheeseburger pizza. If you go on Wednesdays it's 25% off all pizzas. Definitely worth stopping in if you are in Royal Oak!"}
{"text":"The food here is the best bar food in Calgary. It's so fresh and always hot. Great selections of drinks. I would recommend it to anyone!! My favourite marda loop hangout."}
{"text":"Had the Serloin Hash. 95% potatoes 2 hard center eggs and a few shavings of meat that were very fatty. Service was not very good. Would not recommend."}
{"text":"Friends love this place.  We dropped during lunch and they were short staffed.  The first time was not a great experience, but will give it another try."}
{"text":"Best pub in the NW. I have been to Mad Rose at least once a month for the last two years and have never been disappointed. Service is outstanding and the food is always excellent. The pizza is the best I have ever had in Calgary! The sauce is amazing - tangy and sweet with a bit of a kick! Burgers are massive and juicy! Sandwiches are great too. Friday night fish and chips special is a great deal as well. This hidden gem is no longer a secret."}
{"text":"Classy, relaxed atmosphere. Service is always consistently good. Food is always on point, pizza is award winningly delicious with plaques displayed by the elevator for proof. Probably best pub food around. Large selection of beer and cocktails, prompt bar service. Would recommend."}
{"text":"Good grub and not like other \"Blind\" pubs in the area!  The Manager knows his stuff, walks the floor and engages with clients to make sure everyone is happy. Beer lines are clean and TV's are all over the place. Staff-wise you have friendly, fast and professional servers that know the menu, beers and pairings if you are going the wine route.   It's clean and modern; a place you wouldn't expect with it being located in the main level of an office building. The accessibility is a bit of a pain but in suburbia - thems the breaks.   Try the fish tacos or the pizza - good stuff."}
