{"text":"So the salads are fine, maybe a little over priced, but it's nice to get a salad the way you want it. However they desperately need to figure out their staffing. Came in at 7 pm on a Wednesday and waited 40 min for 2 salads. This after half the line left to when the announced they were out of bread. They only had 3 people working and couldn't handle a decent flow of about 18 people in line."}
{"text":"Nice to have a fresh, healthy work week lunch option!  I love the Doc Holiday salad!  

Only suggestion I have is that the menu should be placed in a couple of locations so people have an idea of what they want before they get to the counter to order.  I've been stuck in line behind people who aren't familiar with the menu and it cuts into my lunch hour."}
{"text":"Fantastic-generous portions of all the things you love in salads. Great menu and flexible on holding an item and doubling another. Kimberly was enjoyable to be helped by with polite service and a welcoming smile and greeting!"}
{"text":"I just went for the first time today. It's a GREAT option for healthy food. 

I had the large TY COBB salad. It was truly massive. The friend I went with got the same and took home 1/2 which was equivalent to the small salad. 

The service was really good. The people were pleasant. We went at 1 and there was no wait and plenty of seating. 

This is 1/4 mi. from my house. I WILL be back!

Tip: you do your own cleanup and recycle."}
{"text":"Just tried the new Mad Greens on Central. Salad was really good. Nice addition to our community."}
{"text":"I had the chicken tortilla soup and my partner had spicy bacon grain bowl. We're both satisfied with the food. Next time we'll try \"make your own\" thing. On top of that, they have an amazing tea selection and fountain drink! They're NON-GMO, gluten free...unique sodas that you can only get from here except the grocery stores. Give it a try. The staff are friendly too!"}
{"text":"I placed my order online and upon pickup I realized it was not what I had intended to order (my fault). The team on duty quickly fixed my salad with no questions asked and did it with smiles on their faces. The service was excellent and with that being said, I will be back!"}
{"text":"I was *so* ready to be annoyed about my $10 Ty Cobb salad with (what looked like) a stingy amount of salad dressing. 

However, the flavors were great and there was a generous amount of ingredients (besides boring lettuce). Apparently those plastic salad containers are deeper than they appear lol. I had bacon and chicken until the very last bite and really felt full for a good 5 hours (a rare feat). As for the dressing, I got bleu cheese. The container looked really tiny. When I got home and poured it on my salad, I saw it was a thinner consistency and covered up the entire salad. 

Overall, I wish it was a couple of dollars cheaper but it was definitely a more satisfying salad."}
{"text":"Disappointing.food with high calories and grand opening special gave 10 shrimp in one salad and only 4 shrimp in the other Ghengis Khan salad.  It was one free with a purchase---both surprising and disappointing!!"}
{"text":"Going to this place for the first time today I was pleasantly surprised. It's a very modern feel as you walk through the front doors. There is indoor and a big outdoor area to eat. You can customize your own salad and pick your toppings or go with one on the menu. They also have thing such as wraps and soups. I got the caeser salad without tomatoes and it was very fresh and yummy. The staff who helped me was also very nice and friendly, also very helpful. The drink choices are also kinda strange but awesome at the same time. I got the lemonade which was delicious. Definitely one of my favorite salad places I will be going to much more often now. A+ for the staff and the whole restaurant in general."}
{"text":"I love having healthy options so close when I want to eat on the go! The service was great and the food was delicious! I will definitely be back!"}
{"text":"This was my first visit to MAD Greens and they really wowed me, not only is the food really great (I got the Siam I Am), but the location is super cute too. And while I'm not usually a soda drinker, they had some blueberry soda that was soooo good! Will definitely be going back very soon."}
{"text":"Love mad greens, when ever I think. Hey I just want a salad... Where do you go? Now you go here. :)"}
{"text":"Nice place - kind of reminds me of Chipotle but for salads - they have salad selections or build your own - there are tons of options to add to your salad - nice juice selection and good teas."}
{"text":"My second time and I like it even more. The salad choice menu seems confusing but once you get through that it's great. Love the Ty Cobb salad with extra mad spice...."}
{"text":"I ordered the Dionysos salad and my son ordered pancho villa. It was a pretty good salad and good size portions however, the price was a little more than expected. The one amazing thing about this place is the drinks. They make their own soda with many different amazing flavors like blueberry soda or prickly pear.  Plus they have many different flavored iced teas.  I am very picky about my ice tea and they have amazing iced tea that would be in my opinion comparable to the ice tea at AJ's.  I might be back in the future but would like to spend my money at another salad place (zupas) that can't be beat."}
{"text":"Mad Greens opened about 3 months ago in my local neighborhood. I'm happy about that because I was growing tired of Zupas, True Foods and Corner Bakery.  About a week ago I received a coupon for BOGO on any salad, sandwich or panini.  So why not give it a try! 

I stopped in today and ordered the Mad Cuban and the Crazy Ivan salad. After reading a few Yelp reviews and seeing pictures of some poorly mad sandwiches I was a little reluctant to order one but the Mad Cuban reached out to my soul. I'm a sucker for a good Cuban. It was delicious!!! The meat was flavorful, so was The sauerkraut. I'd definitely order it again but with more Dijon mustard . I could eat a roasted beets salad everyday, I kinda do lol ... this one is awesome!! Absolutely love the house made croutons and roasted pumpkins. 

There's plenty of add ons for your salads and sandwiches ... plenty!! I will say it's a little pricey because I paid $14 bucks and some change for a BOGO meal (with a coupon) a tea and a delicious cookie. Don't skip the cookie"}
{"text":"I was in the area and wanted to get a juice so I tried out this place. I went in around 10am and it was practically empty so I was helped immediately which was nice. There are only a few juices to choose from so I ordered the green detox. It has a spice in it so I thought that would be good (had other green juices with jalapeños and cayenne). The juice was very bland, did not have much flavor other than their original spice mix, which was indeed spicy. It was a weird consistency because there was a lot of grit from the spices and some pulp. Overall it was not that good. The service was good but I would try another juice bar next time. 

Parking is also a little weird, I had to make a left and drive behind other buildings before seeing this place. Thank goodness for Google maps."}
{"text":"I love this place! Great staff, super clean, awesome food. I'm addicted to their freshly-squeezed juices. Sooo glad to have them in the neighborhood!"}
{"text":"Oh what a place to be. I'd say this is a great place to grab a snacky if your on the go or there for a long stay! And Kimberly Payne was so nice! Five out of five stars for sure I recommend"}
{"text":"I think the overall theme of this place is just meh. The salad was meh. Service was meh. Dining area was meh.

I had the poncho villa salad. Pretty good. Came with quinoa, corn, chicken, and a cilantro lime dressing. This is one of those places that make it in front of you so it's totally customizable. I also liked that they ask how much dressing you prefer (light, medium, heavy). 

Nothing too special but a great place for a quick and healthy lunch break."}
{"text":"We tried Mad Greens last weekend. Price does not reflect the value of food. They do that subway style of ordering which lately everyone has been on that bandwagon ugh (not a fan). Kids box had many dried out crispy old noodles their chicken had a dry bland taste kids did not like anything but edamame.  Also ordered two paninis and both were not good. The chicken in both had a very dry consistency and an almost old taste to it. The Cuban tasted so bland I opened it up and there was zero cheese. Also the ham was weakly folded over and only on one side of the sandwich. They also just piled whatever condiments on both sandwiches and add ons in the middle not spread out. Jeez people make a sandwich so we can taste the ingredients all the way through the sandwich Panera does the same thing which is why we don't go there either! Just feel like they just rush the food through and no one was trained how to make it with any care. One nice thing was I took the sandwich up to show them how it did not have cheese they re made the sandwich but that is what it looked like in the photo only improvement was cheese all the meat now was only on one side of the sandwich ! My husband laughed so hard and said NEVER again will we go back! Waaaaay too many great sandwich places in Phoenix for 8-9$ price point!"}
{"text":"Great customer service and the blueberry soda is great. Thank you to Miguel for being so nice on my first visit. I shall be back (:"}
{"text":"Got there early. There were no lines. Ordered a sandwich and soup. The Cuban sandwich.  There were lots of meat but it was extremely  dry. The chicken was overcooked. The tortilla  soup was very tomato  based with not much flavor. I should  gave ordered  a salad"}
{"text":"This is a most welcome addition to the dining strip of the Camelback area of Central Avenue. The very fresh, mostly locally sourced ingredients make creative (and cleverly named) healthy combinations, a good example of which is the Ty Cobb salad that I ordered. It was an excellent choice: a cornucopia of greens, avocado, tomatoes, bacon, red onion, eggs, and a generous amount of southwestern grilled chicken; I chose blue cheese dressing to go with it.  It was really tasty and I never imagined that a salad could be so filling! This establishment takes its commitment to serve healthy affordable fare in a relaxed and hospitable environment quite seriously.  The staff was very friendly and the place itself is conveniently located with easy parking. The dining areas are spacious with ample indoor as well as patio seating."}
{"text":"First time there on a late Sunday afternoon (around 4pm) and I'm hoping it was just a bad time to go. No one in there and the service was so slow. No utensils and the exterior patio was dirty. There was almost as many staff as customers so not sure why. The food was very good and fresh. Just not a great atmosphere to enjoy. Maybe take out next time if we come back."}
{"text":"This is a great place for a healthy and fast options that are fully customizable! I think the best and most efficient location is in Scottsdale but shout out to awesome employee Miguel who made me like his location so much more! I eat at mad greens way too often, they really are healthy and convenient \"fast food\"!"}
{"text":"I've been to 2 different locations other than this one before and each time was meh, so my expectations were low considering they just opened up.  I was delighted that the staff had their ducks in a row when I was there Thursday afternoon.  Someone immediately came out from the back to help me so I didn't have to wait.  He asked if I wanted the avocado spicy which I didn't know was an option (try it!).  He also showed me the salad before he boxed it up to make sure it was the way I wanted it. Sometimes the avocado gets clumped together so I appreciated this."}
{"text":"I was introduced to Mad Greens when I worked in Northern Scottsdale. I loved that I could make a healthy and delicious lunch decision even when I was eating out. Then I switched jobs to central Phoenix and I missed my go-to salad joint. For a while, I didn't even realize that central Phoenix had a Mad Greens and now that I do, I couldn't be more ecstatic! This Mad Greens is in a great location, close to the some of the best local shops. The staff was very friendly, attentive and accommodating. The restaurant itself was clean and welcoming. The food was as wonderful as ever. You can't beat a place where you can custom order a 'good for you' meal. I know I'll be back again and again."}
{"text":"Mad Greens exceeded my expectations in taste and price. It's just as good as other restaurants in the area and half the price.  I didn't give it 5 stars as I think they should have more than just 4 choices of items to create your own salad."}
{"text":"This was our first time coming to a Mad Greens and we highly recommend it! There are so many different things to choose from along with build your own salad, wraps, and bowls! My friend and I got the Spicy Caesar Wrap and a build your own salad to share. We got half mixed greens, half pasta, grilled citrus chicken, croutons, roasted red peppers, artichoke, tomatoes, avocado, and the cilantro chile lime dressing. I was skeptical about the dressing, but it was actually soooo good. Also, the portions are huge! I think we would've been good just sharing the salad to be honest because the wrap wasn't our fave. The man working was so nice though. The place was really clean and gave off a good vibe. We'll definitely be coming back here!!!"}
{"text":"I had the build your own salad with southwest grilled chicken, cheddar and Monterey Jack cheese, hard-boiled eggs and croutons with ranch dressing. It was delicious! I also had the pink drink which is to die for. It is a prickly pear lemonade. I absolutely love it! The service was great and atmosphere was welcoming."}
{"text":"For being considered a healthy restaurant, this place is delicious! I've gotten a couple of things from here. The caprese wrap has been my favorite! Simple but very flavorful. Light but filling. I recently got the buffalo wrap to be daring since I'm not a fan of blue cheese but it was actually awesome! Got blue cheese on the side just in case I didn't like it. Very clean and the workers were super friendly! Miguel (I think was his name) was awesome! A couple others were there with him Friday night that were awesome as well! (Can't remember names sorry) will be back, can't wait to try more fresh foods :)"}
{"text":"I'm always looking for a good salad and this place has been a good solution to that problem!  I am so glad they are popping up everywhere.  This location is great,  with outside seating and super quick service.  My only complaint is that it can be a little too salty.  I ordered the Ty Cobb and had it medium dressed.  Next time I'll order light dressing, but otherwise fresh, delicious and crunchy!"}
{"text":"3/11 I ordered a Mark Twain half pasta half romaine lettuce with bacon and NO onions. The salad was a good size portion, I think next time I would order a different salad dressing and get spinach instead of romaine. The brownie was less than average, the flavor payoff was NOT worth the calories. 
The salad I would give  3 1/2 stars 
The Peruvian Chocolate brownie 2 stars 
The staff was friendly, helpful and professional."}
{"text":"TIP: GO FOR THE LARGE! It's $1 more and almost twice the size! Fill your body with the rainbow (so you can indulge in one of their desserts)

AMAZING selection of ingredients! Somehow, my salad-hater friends STILL love eating here with me! Maybe it's because they ask how heavy you want your dressing?! 

I feel great about it because they are veg-friendly and can be soy-free! Healthy fats and proteins from avocados and garbanzos.

Their drinks are crave-worthy and taste like old school colas! All natural, cane sugar, and creative flavors (blueberry!).

I am surprised about the negative employee comments...I thought the two people that were there were very helpful and friendly. Offered suggestions, were patient with my son...no complaints!

We live halfway between this location and another. Wouldn't mind going to either one!"}
{"text":"Calling all salad lovers!  This is your place!! I used to have to go to a steakhouse to fill my craving for a salad.  Not anymore thanks to Mad greens.   Salad variety is amazing!  The combinations are delicious.  My favorites are the Don Quixote and the Pancho Villa.   I always add the Mad spice to my salads for a kick.   The staff here are always friendly and greet you in a smile.  They also have fresh veggie and fruit juice options.   The salads and juices are pricey.  Considering the freshness of the salads and juices I believe it's worth the price.  I definitely recommend Mad Greens."}
{"text":"Awesome and tantalizing array of salads. I had the Mad Molly Brown, which was well-balanced with chicken and salad. It was a little more onion than I typically go for but was open to try it. If you like onions, like the infamous Molly Brown, this one is for you. Can't wait to try some of the other options as well. I also grabbed a Green Detox drink as St. Patrick's Day was right around the corner. It was just what the doctor ordered. Excellent!"}
{"text":"Went here for the first time a couple of days ago, My boyfriend loves coming here after working out. I ordered a salad- I don't even know what it was called, it was not good and forgettable. My sister had carrot juice which she loved. I'll be back but not soon, and will make sure not to order that salad."}
{"text":"Our office did an online catering order from Mad Greens and it was amazing! It was very easy to select exactly what we wanted online and the delivery person got here a few minutes before our 15 minute window which was nice. He even set up all the food, took everything out of the bags, and took the trash away when it was set out as well as brought plates, napkins, and forks. And most importantly, the food was DELICIOUS! Everyone loved it and the food went pretty quick. We got some BLT, Ceaser, and Marilyn Monroe wraps, the superfood salad (amazing), and the pasta salad. Very impressed by everything and will definitely order again."}
{"text":"Miguel was amazing. He gave me a great recommendation and was very patient and polite. Plan and simple HE DESERVES A RAISE! 

Oh ya the food was amazing too! I highly recommend"}
{"text":"Decided to check out the new location only to be disappointed. For a Sunday afternoon, they seemed understaffed, however staff found it more important to be chatting with each other rather then cleaning tables left dirty for past patrons.

I can't knock the food as it was very good, if they happened to not be out of one of your chosen ingredients such as the shrimp. My party ordered three beverages and only received one, listening to your patrons goes a long way.

It is a new location so there are some staffing bugs to be worked out, food was great and pricing isn't bad. Hopefully management will get these issues sorted if they wish to remain at this location for any amount of time greater then a few months."}
{"text":"I got the Mighty Aphroditey and it was fresh and delicious. The only negatives I have are it's a little pricey and the format of ordering is very strange. But, the salad was great."}
{"text":"The food is good, but after our meal it felt like we had paid twice as much as we should have and got 1/2 of what we were expecting."}
{"text":"The portions are huuuge and the ingredients are fresh and delicious! But be careful because add ons can make a custom salad expensive."}
{"text":"Okay you guys, I've been trying to eat healthier and this place makes it SO easy to eat amazing healthy food! Ive just had their salads are they amazing! I imagine everything else is just as delicious! I had their southwest bowl and it was everything my Arizona heart desires! Definitely will be back!"}
{"text":"Wow! Fresh ingredients to choose from with lots of options! The staff was very friendly and helpful. Clean and welcoming environment and we came for a light dinner but left quite full. Highly recommend!"}
{"text":"Customer service was great and the staff was very friendly! Had the chicken caeser wrap! Food was delicious and the drinks were tasty. Would definitely recommend to friends as a healthy alternative for lunch!"}
{"text":"I stopped in for the first time to try a new salad an was so excited to see all the vegetarian options not only in salad but power bowl forms!  Loved their teas and natural soda options will definitely be back again soon!"}
{"text":"So happy to have found a new healthy lunch spot! The salads are delicious and HUGE and I love their drink selection- can you say prickly-pear lemonade??  will definitely be coming again."}
{"text":"So yummy! I love all the options and multiple combinations. Thank you Miguel for such great service- especially at closing time! We will be back."}
{"text":"I like Mad Greens. They somehow manage to make salads tasty and refreshing. However, I'm disappointed with the service at this particular location and much prefer going to another location further south. The main problem is that the salad makers here always leave out ingredients, whether it's just croutons, cheese, or meat, and I have to remind them to add these items. 

The last time I came here, I ordered a Crazy Ivan to-go to eat as a late dinner later in the evening. I didn't pay attention to what the salad maker was adding (or not adding) to the salad, paid, and left. When I opened my salad a couple hours later, I was disappointed to find it missing the croutons and chicken. That's 1/3 the ingredients! I couldn't take it back since I not only declined a receipt but the restaurant had been closed for at least an hour. 

That said, this is probably the last time I'm visiting this particular location. I'll drive an extra mile to go to another."}
{"text":"Wait. You can pre-order a salad for pick-up like Starbucks?! Sweet. Okay-okay. 'What am I doing ordering a take-out salad?!' I was asking myself as I drove down to collect. DaYaaaaam! The bowl was huge and fed me and the food lady wife for two days straight. It was delicious, nutritious, and totally worth the journey. I joked I could work this into my weekly grocery shop and still save a few dollars, lol. I was completely take aback and look forward to sampling more culinary delights. Cheers!"}
{"text":"I have always loved mad greens and was so excited when I found out one is now closer to me!
Went to this location for the first time tonight at 8:20 and Miguel and Jamie gave us EXCELLENT customer service and made great salads. 
As I was sitting there eating an Uber eats driver picked up an order and commented \"I'll be back later maybe\" the employee laughed and said \"well maybe not tonight we close in a couple minutes\". 
I felt like such a jerk, I had no clue this location closed at 8:30 and was so apologetic. 
Needless to say it's so fresh to go into a business that still gives you great service even when you show up minutes to close!"}
{"text":"I loved the variety on the menu. I loved that it was all fresh ingredients. The staff was extremely helpful in my ordering. Clean restaurant. I loved the food and all the healthy choices."}
{"text":"Awesome food, friendly service, reasonable prices. Love it that it is so close to where I live.
What I had to eat the Don Quixote salad. It was delicious. A friend of mine had to TyCob."}
{"text":"I love this place, especially the SamIAm with Tofu. I love that you can order online and that they have vegetarian options. They're super punny too! If only they delivered!"}
{"text":"I really like salad, lots of greens, fresh veggies, creamy dressings, croutons or other crunchy toppings and some protein, yum!  Although MAD Greens has all of this and more, the price of a salad or wrap does not match the quality and taste.  Quality food deserves comparable pricing, MAD Greens is not consistent nor worthy of the high price tag for me.  The problem lies in the availability  of a decent (there are some chain spots that try hard) to-go salad outside of Tempe, Scottsdale, or the Biltmore corridor, barely nonexistent.  That being said MAD Greens is one of the better options and I will most likely be back when I need a salad fix on the fly or when I am lazy, which is most of the time (place lazy emoji here)."}
{"text":"Brand new location, so not much traffic just yet. Same great salads and wraps. If you find yourself going out of your way to grab a bite at Mad Greens (and I do). Maybe this location will make it easier for you."}
{"text":"Jimmy, Miguel, and Jose are great! Thoughtful and conscientious. Love this place. Fast and delicious every time I come in! Nom nom nom..."}
{"text":"Remember, this is a 5-star rating for the kind of restaurant that it is. I'm sure that if you paid 3 times as much, you might be able to find a better salad. But even then, maybe not.

In any event a very generously sized salad runs about $10. I had the Crazy Ivan, and the workers happily subbed spinach and kale for the spring mix. The salad was fresh and tasty. The chicken, beets, and cheese were more than adequate. Some places give you skimpy portions and force you to hunt around the greens to find the goodies. Not so here. In every bite I had a wonderful mix of flavors.

I hope that lots of people find this restaurant so that it stays in business. We need more super healthy options in this area."}
{"text":"I have been there twice now. No more however. The staff does not wear hats or hair nets except for the women. Health inspector should give this and F. Doesn't the franchise bother to train new owners on food safety? Apparently not."}
{"text":"This place is wayyyyyy too overpriced. We bought 2 wraps and 3 salads. And everything was half Eaten. The kales they used in my salad was too old, too chewie, I feel like this is what farmers use to feed their cows and such. The wraps, lettuce and dried chicken. Like super dry. I will never come back here, zupas is so much better, u can get a salad and a soup for $8. Verses a $10 for a bowl of salad at mad green that I couldn't even make myself finish"}
{"text":"Stopped in with my daughter today for the first time. We both thoroughly enjoyed our bowls & will gladly come back. She built her own & I chose the Spicy Bacon Bowl- plenty of flavor & just enough spice to enjoy!
I like the amount of variety available with bowls, salads, & wraps!
Also pleasantly surprised to find all natural \"Maine Root\" sodas & freshly brewed teas!"}
{"text":"I love a well crafted chopped salad and this place does not disappoint. The selection of ingredients including protein choices is pretty on point. Now let's talk dressing, for me there is only one. The roasted red pepper vinaigrette stole my taste buds and I have been a loyalist ever since. I first discovered this place in Denver. I would usually go back and forth between here and the salad bar at Ruby Tuesday's. Now that I am back in Phoenix, Ruby Tuesday's is quite a drive, thus making my decision much easier. The portions on these salads are generous and the gluten friendly choices are endless. I'm not a huge fan of this hipster organic soda movement, but \"Pink Drink\" isn't bad. The price does give me pause, and knowing I can hit up In n Out for the same amount if not less of money weighs on my decision."}
{"text":"First time here and I must say what a great experience. I had the Ty Cobb with the SW Chicken and it was amazingly good. The staff also was polite and friendly. I Will definitely be returning"}
{"text":"Was looking for a big serving of chicken and veggies so came to check this place out. I opted to build a salad which came out amazing. Only giving this place 4 stars because I had to ask for 3 servings of chicken in order to get a decent amount. Other than that the salad is amazing. I will be back"}
{"text":"Pretty darn good! I met a group here for a Meetup and had never been before. I ordered the Bacon Grain Bowl, which really was delicious. Brown rice, spinach, bacon bits, dressing, and other veggies. Really was good and worth the $10 I paid for it. 4 stars because even though I was the only one in line, the worker behind the counter could have been friendlier. It felt very forced on his part. I would definitely try this place again, though!"}
{"text":"I have been so excited to try Mad Greens, but I wasn't blown away. I love the concept of quick healthy food, so I will visit again. I ordered the Doc Holiday and it was just okay... nothing really memorable about it. The chicken was very dry, but all the other ingredients were fine. Next time I will try one of the wraps."}
{"text":"My first time I tried Mad Greens was in Utah on the way to going to powder mountain north of Salt Lake and when I saw one near where I was staying I thought it would be nice to try again.
This time I only had a juice but it was great.  It was the Green detox which has greens like kale and celery and cucumbers with some ginger and cayanne pepper.  I'm not sure if they juice the whole peppers but it's pretty spicy.  I normally get their salads and I highly recommend them.  They have a ton of dressing to choose from many are vegan. The greens are always fresh and if you like spice I recommend getting their spicy hummus to go with the salad and top off your salad with their mad spice project spice blend.  They are very flexible to add what you want to your salad and I think it is very reasonable considering the quality.  The humus is fun to take away and have on hand for snacks later in the day.  It also travels well.  Service here is top notch.  The guy who served me knew a lot about the business and how they are expanding.  I wish we had one in CA since we are very much lacking this kind of chipotle style salad place.  I believe there are a couple others in the area so I will definitely be back when in the area when I need my mad greens fix."}
{"text":"This is my new go to now. You can dine or take out. Either or it's so delicious. I got The crazy Ivan, omg it's a MUST. The crazy Ivan has mixed greens, roasted beets, Pumpkin seeds, house made croutons and goat cheese. It comes with chicken but i substitute it for two kinds of tofu. To top it off It comes with Sherry Molasses Vinaigrette dressing. They ask you light, medium or heavy on the dressing. HEAVY for sure. Haha."}
{"text":"Salads are ok, not too tasty and savory, ingredients are not high quality, good portions, but pricey."}
{"text":"I personally think the food at their 7ave location is better but the food here is still really good and the staff is super upbeat and pleasant. Definitely try it if you haven't already."}
{"text":"First time in and was impressed with the service and the food. Had the Poncho Villa salad from the menu and it was a good mix of lettuce, citrus marinated chicken, spicy pumpkin seeds and corn topped off with a creamy cilantro lime dressing. Service was fast and friendly for a decent price."}
{"text":"Woo-hoo!  We got a buy one get one coupin in the mail so we went on down to get a salad.  Love the location on North Central and also the option to call ahead for an order to go.  Nice.  We ate there and had some really good and BIG salads.  They weren't smothered in dressing which is nice.  The Maine sodas are awesome too!  We had a really nice light sinner out on the patio.  Very clean and a very friendly staff.  Ample parking and in a great location.  Always nice to have a nice salad to go optjon up in these parts so it is greatly appreciated."}
{"text":"Made my own salad with the southwest chicken that was so full of flavor. It was delicious ! I was a little disappointed in their vegetable selection because they didn't have a couple of vegetables I like but overall it was such a delicious salad. The flavor was delicious and I smothered in Ranch that is always a blessing.  I also had the hummus and pita bread and that was absolutely delicious I'm definitely going back it's my new favorite salad place yummy yummy yummy!!!"}
{"text":"Overall GREAT food, VERY FRESH & good value! Wished they'd change the name of Gangus Khan salad! I ordered same & afterwards thought, \" I wld. Have NEVER ordered an Adolf Hitler salad.......\""}
