{"text":"Amazing wine selection, extraordinary food that pairs brilliantly and harmoniously with the wines. On top of that, the venue is super comfortable.  Attentive service. 5 stars. As Manhattanite foodie, happy to say the price was extremely reasonable for the quality outing."}
{"text":"We had tentative hopes for this place and it turned out way better than expected. It's surprising this city doesn't have better wine bars but this was definitely our favourite wine bar that we've been to. Amazing selection of wines and food, and we both got two different mystery 3-oz flights that we had lots of fun trying to guess. They even made sure we both got different wines so that there'd be more variety for us to try! We then got the house bread and butter, 3 different cheeses (a cheddar, Gouda, and creamy Brie-like one, all of which were delicious), and split a steak as our main. Really appreciated them splitting up our main into two plates (small things like that go such a long way) and the service was perfect. The only complaint, which warrants one less star, is charging $4 for what tasted like whole wheat sandwich bread (and only 4 slices). It was ok but definitely should be complimentary. Still would come back and looking forward to trying more new wines!"}
{"text":"What an absolutely great find. So glad they opened. I have been there twice. The first time with a group of friends so we ordered a variety of plates. Chicken, lamb, fish and appetizers. It was all so delicious not sure what I liked best. They have an very interesting and extensive wine list with prices to suit everybodies range. One of the better I have come across. It is beautiful inside and the staff was very friendly and knowledgeable. They could not do enough for you. The second time  I went with my husband and he was every bit as impressed as I was. I cannot say enough great things about this place and can hardly wait to go back!"}
{"text":"Finally a wine bar that has an interesting wine list and amazing food. Actually the place is more of a temple dedicated to wine. The team here is wine loving but not stuffy.   Brought my husband here for late night nibbles. Came back for dinner and absolutely died for the flank steak. Only issue is I couldn't decide what to eat and drink. Thankfully the staff helped me.   I sat in the front at the high top. Saw the booths, hope to try them out later.   The reason I live in Torontos west end."}
{"text":"Visited Mad Crush by way of reservation on a Saturday night and it just didn't win us over.  Almost immediately upon sitting down we asked to relocate tables because we were sat next two loud men and couldn't hear our own conversation over them.  Despite there being many empty tables (and having made a reservation for a table...just not one where we would be assaulted by someone's volume...), we were moved to bar seating therefore were already in for a different kind of dining experience than we anticipated.    The wines (two reds) we tried were nice.  For starters, we tried the salted cod and the grilled cheese, followed by the steak and the Piri Piri chicken as mains.  It was all well-made but was definitely something that we could have prepared at home.    Overall, it was a fine experience but nothing worth returning for."}
{"text":"Love this place! The ambience of this place is everything--warm, contemporary, relaxed. The staff are friendly and approachable. We went for Monday when they have 1/2 priced bottles. Thoroughly enjoyed our wine and selection of meats/cheeses. The selection of cocktails and wines is great, although the menu is a bit overwhelming. The place is quite reasonably priced for what you get. Will definitely be returning again... and again."}
{"text":"3/5  Mad crsh wine bar is a lovely ambience place with great wine selection and an actual sommelier onsite ready to help you with long list of wine. Servers are also great. Not as attentive as I wished but still provide a great service whenever he was at our table. Everything here is good except their food. I tried 5 dishes and they are more on unnecessarily sweet side. If that's your kind of food, this place is perfect for you,  but I personally prefer more balanced dishes so I was only able to finish half of food.   Will I come back here?  Maybe if I want to grab a glass of wine before dinner but probably not for the dinner."}
{"text":"As a vegetarian I'm not loving the food offerings. Everything without meat is so dairy heavy I'd be sick for a week if I tried it or its a salad. I need carbs!!! Definitely no vegan options. There was nothing on the menu I wanted to try.   The wine list doesn't have any descriptions so if you aren't familiar with the wines it's hard to know what to order. However that being said, the list seemed pretty standard and also not that big of a selection for 'by the glass'. This is a wine bar.   The staff are very friendly and help you pick wines.  If I was in the hood and needed only wine but didn't want to eat... I might return."}
{"text":"Breakfast. Why not. The wonderful space was grand, peaceful, airy and sunlit from a skylight. Other than a man that made think of Leonard Cohen, a young couple, and the friendly wait and kitchen staff, we were alone. I had the last item, eggs and mushrooms. It was delicious. Prices are reasonable. What a great way to start the day. Did I mention friendly?"}
{"text":"Really nice and knowledgeable staff.  Beautiful decor.  Great wine.  But the food was really not to my liking.  I had the butterfish which I found really past its prime.  Dressing on beet salad was far too acidic.  The gouge res were very dry.  I go out to eat so this place just didn't meet the mark culinary wise."}
