{"text":"Had a great meal with the family. Best Mexican in a long time. Only a dozen or so tables. Go early. Gets a bit loud. Had a kids menu that was well stocked. Watch out for the offered chips and dip, not free. At 2.50, worth it. If you like queso pay the 4 bucks. It was the best. Great place, hope they can keep the food quality over time."}
{"text":"Very good. Not your normal Mexican food. Very modern west coast Mexico food. Very fresh....  Service is a but slow..."}
{"text":"Love it here!!! Empanadas are excellent!!! Happy hour specials are amazing, drinks and food!!!  Visit here often with friends. Great food and service all around."}
{"text":"We ate here on Saturday around 5:30. We got the last table and several groups were waiting when we left.  This was the 4th time we ate here.  I had the Maui Maui tacos, corn and coleslaw. My husband had the filet, mango tacos, corn on the cob and rice. The food was wonderful, the service great and the prices very reasonable."}
{"text":"This was our 3rd visit here. The food is delicious. Portions are good. The atmosphere is quaint and small, which is good and bad. You may have to wait a while to be seated.  My wife always orders the fajitas and has not been disappointed. The last, I had Chile Rellenos; one was steak, one was pork. The pork was excellent. It would have made a terrific pulled pork sandwich too. The steak was very good but there were 2 pieces of gristle that I bit into. That was surprising and disappointing. I wanted to add a single tamale to my meal. The waitress said I couldn't do that. I wish they offered combination meals. I wish you could mix and match 2 or 3 items to create your own meal. But it's not offered. All in all, the food is very good. The price is relatively expensive. We will continue to go there. I recommend that you try out this restaurant. I hope you enjoy it too."}
{"text":"First time here, not from the area but it had some good ratings and my girlfriend and I decided to try it.   So I'm guessing that the place is newer by the reviews. And with any new restaurants, there will be some growing pains. So the staff, our server in particular, wasn't tight. No real sense of urgency, and not especially personable. But honestly, who cares. That comes with time. And with a bit more, I'm sure they will develop.  The decode was ok, hipster enough to be kinda cool, but plain enough to not be to hipster. It leaves something to be desired, but the feel of the restaurant over all is charming. But honestly, who cares. Devote will not stop me from having a culinary experience no matter how much bullshit people talk about we eat with our eyes first... If that's true, the Diablo shrimp will burn out your retinas. And you deserve it.   Bottom line is, the food here is very good. There were mis-steps, but nothing I can't get past. But again, they are new, once they mature a bit, their dishes will as well.   Dishes we ate: Chips and salsa-2/5 chips a little thick and salsa lacked pop. Stuffed jalapeños - 3/5 solid dish, a bit heavy handed but yummy. Tamales with creamed peppers and onions and Mexican corn- 4/5 -highlight of the dinner, delicious but again the green chile sauce needed more acidity pop Shrimp Diablo with rice and guacamole-3/5 very spicy, very authentic, very good. But.. The shrimp were way over cooked, and the rice was good but again, the dish just missed with some depth over all.   So why 4 stars? Because I just liked it, and they will grow and develop. And I gave them the extra star for having the moxy to put some out of the box dishes on the over saturated mediocre Mexican market in Pittsburgh. If this place were in lawrenceville, hipsters would love it for like a whole month. That's five years in non douchey time. Give this place a try. It's worth the dough."}
{"text":"Brand new resturant with appealing modern decor. One of the best Mexican restaurants I've tried in a long time. The margaritas are strong and hand made and yet the alcohol flavor isn't over powering. The fish tacos are good. Wish they weren't fried. I prefer grilled. But there is a grilled option with the Mahi Mahi fish tacos, not the talipia. The sides are portioned very well and there are many side options. The menu is huge. Great selection for vegetarians and fish lovers. I can't wait to come back!"}
{"text":"After living I SoCal for 6 yrs my experience with Mexican food in the Pittsburgh area has been dismal. That is until we found Madero! Love this place! Never had a bad dish there. Good drinks, great tequila selection,  and cold Mexican Coke."}
{"text":"Having previously lived in an area with a heavy Mexican influence, I've since been consistently disappointed with the Mexican fare available in Pittsburgh. Not disappointed anymore!!    We dined at Madero Cantina on Friday night for dinner and we are already looking forward to our next visit. First of all- how refreshing is it to look at a Mexican restaurant's menu and not be bombarded with a long list of numbered combos, all of which you know will be bland and boring and drenched in sauce? The menu offerings at Madero are exciting, unique, and descriptive. This makes it hard to choose! Of course you'll find all your Mexican American mainstays- fajitas, burritos, tacos, enchiladas, and the like. But by reading their description, it's assured that they won't be boring or typical.    The appetizer menu is too exciting to pass up. Ceviche, a variety of inventive dips, etc. We tried the stuffed jalapeños because we couldn't resist the sounds of chorizo and a honey cream drizzle. Wow. Yeah, they were certainly spicy. But the flavors were perfection- so intricate yet balanced. We also tried out the queso dip which was so perfect.    For dinner we selected mahi mahi tacos, because I like to try those everywhere I go. I was pleased that they offered corn tortillas, bonus points for that. The mahi portion was generous and overall the tacos were executed well. Nothing amazing, but certainly above average. My husband ordered the velada, out of sheer curiosity. Wow. First off, the flavors to me seemed Hawaiian-influenced, due to the presence of both pineapple and soy sauce, but perhaps this is also found in some regional Mexican cuisine. No matter- it was amazingly delicious. And beautiful!   The service was great- not too slow, but not crazy fast either. Nice date night pace. It's small and perhaps a bit loud- but the decor and atmosphere is pleasing, calling to mind a beachy modern casual bar. We had maragaritas, which to our surprise were half priced during happy hour.    It's one of those places where you just want to keep going back to sample their food. It is far superior to really any Mexican place I've eaten at in this area."}
{"text":"NICE SURPRISE IN THE BURBS!  Myself and Zombie Lawyer were crazy hungry and decided on this new to me cantina. It was a nice surprise! I had great steak tacos and Mexican street corn.  In a world East of Pittsburgh, with plenty of latin choices, this is great!  I plan to try again!  Muah!"}
{"text":"Some of my favorite Mexican food around. Fair prices and excellent unique margaritas. Not very big though, so I wouldn't take a large group!"}
{"text":"Good food. Service is okay. Seats are uncomfortable. Hard to get a table for 5 people or more. Small place. Nice bar menu."}
{"text":"My best friend and I were heading back to Monroeville when we decided to stop in for dinner. This proved to be a very good decision.  He ordered the empanadas for an appetizer and I had the stuffed jalapeños.  The empanadas were fried to perfection but were not greasy. The flavours were bursting out.  The stuffed jalapeños were the perfect blend of spicy, sweet, meat, and cheese. The tamarindo sauce was amazing.  During tje time between our appetizers and entrees, our server, Claudia,  was very attentive to our drinks.  For our entrees we both had the mango chipotle chicken. The bites of chicken were tender and the mango chipotle sauce was sweet, savory and a hint of spice. The Mexican rice was cooked to absolute perfection.   When Claudia asked if we wanted dessert, we were both to full to go on.  This is definitely a restaurant that we will be more than happy to visit in the future."}
{"text":"This was my second time here and i can't say enough good things about this place. I came here for lunch with my mom and i can't believe this place wasn't more crowded. When we walked in, only one other party was in the restaurant. The restaurant is small and intimate, which is a nice change of pace from other larger places. Right as we were seated, our drink order was taken. For an appetizer, we started with the 'El Trio.' It was a dip trio of salsa, guacamole, and queso. Our app was delivered to us very fast. Oh my gosh... the dips were literally the most delicious and freshest dips I've ever had at a Mexican Resturant. The portions are large, so we could have gotten full on the dips alone. For our entrees, my mom got the fish tacos with a house salad and Mexican style corn (off the cob) as her sides. I got the veggie tacos, Tex-mex style (lettuce, tomato, cheese and sour cream) with a house salad and Elote as my sides. Our food was brought out quickly as well. The portions are definitely generous. Everything was so delicious! The house salads are dressed with their own homemade oil style dressing, which is light and pairs well with the salad. My Elote was ON POINT as it was when i was there previously. I can't say enough good things about Madero. This place is worth the drive out to Murrysville, if you don't live near here.   The best part of this Resturant is that you get to choose your sides. Most Mexican restaurants give you rice and beans as your sides. I'm not a huge fan of rice and i don't like beans (don't judge me! Lol) so i could choose sides that i like. Of course they offer rice (two different kinds) and beans (again two different kinds) if that's your thing!   I hope your mouth is now watering and you're on your way there now! :)"}
{"text":"First time here and it was pretty good. A small place but chic decor, quiet for a Friday night. I get the feeling people don't know it's here. We got fish tacos and enchiladas. Both were good but not spectacular. The prices were reasonable, server was friendly and prompt."}
{"text":"Once again I'm confused by the validity of the 4 and 5 star reviews for this place.  I had madero cantina bookmarked,as the description  of some of their dishes sounded promising that I may have stumbled upon  legitimate and potentially authentic Hispanic food.   So we came here for my birthday with high hopes. But instead we left disappointed and $60 was totally squandered on bland white washed, rust belt style Mexican food.   1.)We started out with one of their insanely overpriced margaritas which was just a silly choice and waste of money from the start (they range in price from$ 11-18) and are not worth even $3.  2.) Opted for the trio of queso, salsa and guacamole ..because of course the authentic corn and mushroom based huitlacoche \"dip\" we wanted was removed from the menu. I'm guessing because no one around here knew what it was or what to make of it because many pittsburghers just aren't that cultured, therefore it probably never got ordered.  3.) Main course was the enchiladas. They were the absolute most ridiculous excuse for enchiladas I have ever encountered. It would be like if Denny's or eat n park suddenly decided to make enchiladas one of their offerings and had one of their high school drop out cooks attempt to prepare Mexican food for the 1st time, with no prior knowledge of Mexican food or spices.   4.) Lastly the temperature. Every last bite of food was barely warm, bordering on cold. At this point I would not have been surprised if the margarita was served warm, everything was just that off. No spice, no heat, no hot sauces on the table, and none in plain sight at other tables.  They only thing I had that was even remotely edible was the Rajas con crema.  The search for palatable Mexican food continues. Sorry Madero Cantina ; la comida no es nada bueno"}
{"text":"This was hands down the best Mexican food I have had in quite a while. I highly recommend this place. It is small however very well worth the wait. Great place with great food."}
{"text":"Atmosphere was great, food was great, service was good, Don Julio Margarita was not very great :/"}
{"text":"I pass this restaurant every day on my way home from work and it always looked intriguing to me.  My boyfriend and I love Mexican food so I figured last Friday we would give it a shot.  They had a wait of about 20 minutes but I'd say we waited no less than 15.  The second we sat down we were waited on for our drinks and the waiter asked if we had ever been there.  We said that we hadn't been and he ran us quickly through the menu.  We got the chips and salsa as an appetizer (duh!) and then we both got the chicken burrito for dinner which was fantastic.  I got mine without guac, which is a sin I know, but my boyfriend said their guac was outstanding.  We were waited on extremely quickly and the food came out really fast.  We didn't feel rushed or anything but they definitely had fantastic service.  We can't wait to go back and try it again!"}
{"text":"Super awesome.  It's a small restaurant, so it's hard to get a seat during busy times (i.e. going the weekend of Cinco de Mayo is a really stupid idea; learn from our mistake).  However, we've gone several other times too, and it never disappoints!  Great queso and delicious tacos.  I'm so glad to have a non-chain Mexican place nearby."}
{"text":"Just ordered take out from this place for the first time. Incredible! The stuffed jalapeños are an instant favorite. Perfectly spicy, topped with real cheese and a real mild meat so it isn't overpowering any of the other toppings."}
{"text":"waited to cool down to review. first service was horrible manager waited on us on a saturday even though place was not that busy. she was incompetent as a waitress. bar order of strawberry daquari was sent back and remade 2nd only slightly better than first. food was average at best. booth not comfortable,no lime as shown in pictures waitres showed no interest or personality until it was time for bill and tip. go to any of the rey aztecas for better food and much better service."}
{"text":"Excellent con queso. Fajitas were good, huge portions!  Plenty for 2!!  Very interesting and different menu for a Mexican restaurant. Several fish choices!!"}
{"text":"Located in a strip mall. It doesn't look like anything special from the outside but on the inside the decor looks modern. As if someone with an artistic sense designed it. We went for lunch and thought it would be busy but it wasn't. The waitress was nice and helpful when asking questions about food. While they had a tempting selection of adult beverages (e.g. Margaritas, beers, liquor) and happy hour, I had to pass because of a meeting after lunch. There's always next time!  I didn't order from the lunch menu because they only offered the fajita combo as a dinner item. It was worth it when it came out on a sizzling platter while others around me stared in awe. I heard other customers questioning why their fajitas didn't come on a sizzling platter. I felt proud! I ordered the steak and shrimp fajitas and came with caramelized onions and peppers. Very flavorful. It came with refried beans, rice, guacamole, sour cream, and cheese. I usually judge Mexican food based on how the refried beans tastes like. It was great! But that's just me. For all I know, it could have came straight out of a can. Washed the food down with Jarritos mandarin orange. This definitely hit the spot.  My lunch buds ordered the cochainita tacos, which is achiote shredded pork with marinated onions. They said it was very good.  It's a little ways for me, but I'd come back next time I'm in the neighborhood."}
{"text":"Mexican in Murrysville?  And outstanding food and service to boot.  I moved away from the area 30 years ago when fast food and pizza places were the only choice besides Dick's Diner.    This place is a treasure and the food authentic.  We had the filet mango tacos and the Veracruzana.  Just wonderful."}
{"text":"I really wanted to like this restaurant. The menu was great. There were so many choices that are not typical of most Mexican restaurants in the area. The food, however, was not good. My kids ordered ground meat tacos and they were so greasy that not one of them ate them. My husband ordered seviche and it had too much of some type of tomato sauce. I ordered the shrimp tacos and the shrimp were overlooked and overall the dish was very bland. We spent $80 and left most of the food on the table.  The guacamole was good, but the chips were a bit thick and greasy."}
{"text":"I'm giving one star over the minimum because I like their queso and the tacos I had were decent, but otherwise I can't recommend this place due to the service.   I went for a late lunch on a Friday with one other person - we started by ordering queso with chorizo, a beer, and a daiquiri. My daiquiri was mostly ice so was difficult to drink. After prompting the waitress for more service, we ordered tacos and asked for one of each type on each of our plates - even though the waitress nodded, the request was not honored - ok, not a huge deal... but then our bill came. There was an extra charge for chorizo in the queso, when there was no mention of such on the menu and the waitress didn't say anything when we ordered. She brought the menu over again as if to prove something, but there was indeed no mention of an extra charge. She said she'd tell the manager, so we waited around for one of them to come back - the manager glanced at us but never came over, and the waitress never returned. Since we wanted to leave and get on with our day, I paid the charge, but went up to the manager on my way out and told him that they really should notify people of extra charges - he just stared at me and didn't respond (that's why I'm writing this review - people deserve to know and I really doubt he plans on telling them). Really disappointed to be treated so disrespectfully at a small business, especially when there were very few other customers there at the time. Another tiny but mentionable thing since we're talking service - they make you box leftovers yourself. I always think that's tacky and takes a restaurant down a notch in my book.   Bottom Line: For an all-around good experience, you're better off going somewhere else!"}
{"text":"Great Queso, suberb salsa, large portions, had enough fajitas left for dinner next day. If I had a negative the chips were the thicker variety. My wifes margarita was flavorful and left her under the table."}
{"text":"My kids said we had to make the drive over to eat her because they loved it, we finally came for lunch.. The rice was undercooked,it was very hard. The salsa, queso and guac was really good.. The chips not so much.. Really hard and thick..Maui Maui tacos were just ok, they are one of my favorite things but the pico was not very tasty, it was very bland. My daughter loved the fajitas, my husband had something with carnitas and wasn't a big fan, I tasted it and it left an aftertaste in my mouth. The corn on the cob was really good, it is corn on the cob rolled in seasoning with some type of mayo, they apparently make it off the cob as well but didn't have any ready.. It was about 25 minutes to get there which isn't bad if the food is really good but we won't go back."}
{"text":"Absolutely, hands down best Mexican around the Murrysville/Monroeville/Delmont/PT area. The guacamole, tacos, enchiladas, margaritas, coronaitas, cilantro rice, potatoes, peppers are all some of our favorites! The queso is our favorite app!"}
{"text":"The tacos were sooo good, but the homemade queso blanco was the best ever! Great little spot with lots of tequila selections!"}
{"text":"Madero Cantina proved to be a really great lunch stop.  They have several types of tacos to choose from, which makes me happy because I love tacos.  I have only been here once but I am excited to come back for dinner.  I ordered two fish tacos.  They came with your standard refried beans and rice like every other Mexican restaurant in the world.  The rice here though actually had some flavor and was cooked well.  Usually I just poke those two side nuisances around with my fork roughing up the edges, but I actually ate a decent amount of the rice.  I still passed on the beans.    My tacos came out and the plate looked lovely.  It's not a huge portion, but good for lunch, however a little pricy about $9.00 for the two tacos.  Maybe I'm just cheap, I accept that.  They came with shredded cabbage, pico de gallo and a creamy chipotle sauce.  The combination of ingredients mixed with the fresh crispy fish was a winner.  I loved the chipotle sauce, a little spice but nothing overwhelming.  Service was also polite and quick.  On my next visit I have to try a Margarita.  They also have happy hour from 4-6, with half off specials."}
{"text":"Hands down the BEST Mexican restaurant in the area!  This place is an instant, local classic that should be frequented often by those looking for fresh food, delicious cocktails, and some Latin flare.   I personally recommend the taco selections as they're can't miss with the wide varieties of proteins to choose from...and the different toppings and sauces, as well.  While chips ain't free, an order with queso is divine and is on par with any establishment of its kind, in terms of price.   Speaking of - the prices are reasonable, too - especially since the portions are spot on...enough to leave you quite full, but not so big you can't finish your plate.    This place is a gem of Mexican joint and will be happily returned to for many more visits!  Great drinks!  Great eats!  Yo quiero Madero!!"}
{"text":"Amazing food to the nth degree (I own a food establishment so I'm rather hard to please) atmosphere too...if you haven't found this place you have got to try it!"}
{"text":"Well, some pill-head boozer old bat decided to waddle over to our booth, lean over us looking like some cartoon villain, and inquire what we were eating.  We told her to get lost and she proceeded to exit, hug a staff member, and then return to her booth.    The lukewarm food that was served to us was bland and way overpriced.  It would have been nice to have a hot meal both in temperature and spice but I guess this crowd can't handle heat.  Queso seemed to have red pepper devoid of any spice but the salvation of the meal was the rajas con crema.  Vegetarian enchiladas were pointless.  We specifically came for the huitlacoche appetizer which was on the website but no longer on the menu, presumably due to its causing fright in the average patron.  The only way this can be anyone's favorite Mexican eatery is the fact that that person has never eaten real Mexican food, and has the palate of a 90 year old frail creature, scared their ass will erupt if they consume the slightest spice."}
{"text":"This place took me on a Mexican journey.  I felt like I was strolling through old Mayan ruins as I was eating my soft tacos, rice, and lime potatoes. The queso and chips to start our meal were clutch. We will be back for sure."}
{"text":"I LOVE this place!!! I cannot get enough of the shrimp tacos! They are so good and flavorful. The prices are very affordable for the portions you receive. The place is small, so depending on the night there might be a bit of a wait but it is worth it."}
{"text":"The best Mexican I've had in the Pittsburgh area except for Las Velas but considering it's the same owner it makes sense. The service was great and the owner made sure we were happy and shared some stories with us about growing up in Mexico.  We will be back. Update...we went back and it was even better! This time we tried the pork tamales and the steak chili relano. The tamales were covered in a delicious tomatillo sauce. Must try the Elote!"}
{"text":"Best Mexican food in the area. A small place that's usually packed because of how good it is, be prepared to wait during normal eating times. Worth every penny."}
{"text":"Impeccable service.  Better than Tex-Mex fare.  The queso and guac are awesome, as were the house made chips.  The chicken & pork fajitas with the two apps was more than enough for the three of us."}
{"text":"I live in NYC and this place compares to the top Mexican restaurants in the city! The fajitas are outstanding and come with every side you need to enjoy all the flavors! Definitely try the strawberry margarita on the rocks. If you're not driving, get the large :)"}
{"text":"Waiter was friendly polite and attentive.  Food. - Meh.   Place is small, lacks ambiance. Everybody will know that you went to the restroom.   the place was busy on a Friday nite.   So maybe I'm being too critical."}
{"text":"Great Mexican restaurant! Try the Strawberry Cucumber Margarita- so delicious!  The Guacamole was fresh and selfish. You can tell this restaurant uses fresh ingredients and only presents the best food!  Definitely will return!!!"}
{"text":"Really liked this place. The menu was very unique (which can go either way depending on what you're in the mood for) and the food was delicious. The service was also great (the manager waited on us). My only caveat is that they don't have hard shell tacos. That may sound silly but that's all I wanted that night and they didn't have any! Good margarita selection. Also loved the fried ice cream."}
{"text":"What a great little restaurant! My husband and I stopped midweek for an early dinner. There were guests at 2 other tables when we arrived.  We started with the homemade chips and fresh salsa. Nice crispy chips, not too salty and delicious fresh salsa.  I also ordered the grilled shrimp tacos. They were very good. Perfectly cooked shrimp with delicious toppings. The best part of the meal was the freshness of all of the ingredients. I usually find Mexican food to be over salted causing everything to taste the same. That is not the case with this scrumptious food! I am so happy to have found this great little restaurant. We will be back."}
{"text":"Great, authentic and fresh! Everything I've had is very tasty and freshly cooked with good ingredients.  My personal favorite is the mahi tacos."}
{"text":"This place is amazing. We came for lunch on a weekend so we had to order from the dinner menu. But the portions were huge. The taste, presentation, and service were all top-notch. I would definitely recommend."}
{"text":"It had been a really, really, (insert many more really's here) long time since the last time my girlfriend or I had gone for a good Mexican meal and we kinda stumbled upon Madero searching for a Mexican restaurant just nearby.  We were seated immediately, we showed up between 5 and 6.  I don't see our appetizer on the menu on their website but it was basically small meat burritos, very good.  I order the Velada which is exactly as the description says, and by \"full\", they mean full.  It was very, very good.  She got the Chilaquiles with sides of lime potatoes and I suggested Poblanos since I do love a good stuffed poblano.  She said the Chilaquiles was very good and I can attest to the nice flavor of the lime potatoes, which are apparently a secret recipe of the owner's mother.  The poblano was not what I expected, sliced and covered in a light sauce.  I wasn't as thrilled with those; good, but I don't know that I would get it again.  Service was very good and pleasant.  Will definitely be coming back."}
{"text":"Great food and wide selection of Tequila. One of my favorite restaurants in the area."}
{"text":"Delicious food, friendly service. Glad to have Madero in Murrysville. Love the tacos al pastor & the margaritas are reasonably priced."}
{"text":"Wait for food is a little longer than usual but boy is it worth it. Would highly recommend their chorizo. This is several steps above Tex Mex places like Patron and El Campesino. Legit food."}
{"text":"I'm originally from Arizona and Mexican food is one of my essential food groups. Madero Cantina is the best Mexican food that I've had in the Greater Pittsburgh area. While not on par with west coast standards, they do have the option for Mexican style vs. Tex Mex style tacos.  Score!!!"}
{"text":"Can I just start by saying that the queso is like crack.. omggggg I give that 5+++ stars alone. Definitely poured the rest of it on my rice.. don't judge, you'll do the same when you go. The signature agave basil margarita was also one of the best I've ever had. These were definitely the highlights. Dinner was great, don't get me wrong.. but the marg and queso blew me out of the water.  Din was the fish tacos, Mexican corn on the cob, and lime cilantro rice. You'll see it in the picture. Delicious. Definitely will be back soon!"}
{"text":"This may be my new favorite mexican place... Fabulous food and margaritas!! Even better than Las Velas itself in downtown Pgh."}
{"text":"I got ceviche and it wasn't good. It was 90% tomatoes and some sort of tomato sauce. There was barely any fish and shrimp and what was there was tiny pieces so you couldn't really taste it. The portion for 12 dollars too was pretty tiny. I did get it 50% because it was during happy hour. I would have been pretty mad if I paid 12 dollars for it. They also served it with saltines which is pretty strange. I was excited to see the owner was from Rivera Maya because I've had some delicious Mexican food and ceviche there before but I was sorely disappointed. I didn't try my parents food but they disliked the nachos and burrito they got. I would like to try it one more time and try something else."}
{"text":"A gem in Murrysville. Seems more authentic than quite a few other places.   Menu options were plentiful. Hubby ordered enchiladas with a beer and I landed on pork tacos with a margarita.  Both of us were happy with our selections."}
{"text":"I have a love hate with this place. I want to love this place but sometimes when I leave it leaves me feeling meh. We have gone here about 10 times in the last few months. What I love about the place: The chips, nice and hot, fresh and are yes a bit thick but I am ok with that. The specialty margaritas are SUPER (albeit a bit pricey, even at happy hour- which specialty margs are not on the happy hour, only traditional), Guacamole this time around seemed more chunky and not \"processed\", the queso is fantastic (but what queso isn't??), Salsa has a nice taste not overly hot. Their chicken/rice soup has wonderful flavor and we have never been disappointed in their pork/pineapple taco plate. The Diablo made with pork also is very spicy and serves two! Fajitas also have nice flavor. There are plenty of options for vegetarians.  The hate: service, we get Juan often and one time he's nice (never overly nice), the next he's mad at the world it seems (and doesn't like to offer happy hour menu). We always seem to spend over $70 and I can't help but wonder what in the heck we ordered for over $70! It's the margaritas! They ARE really good but I have to bring my paycheck if I want to have more than one even on happy hour! Food is not ever really hot (except the soup which I think they put in the bowl right upon picking up the rest of the order that has sat undelivered). Got the enchiladas this time and they were not so good. Salads sound great on the menu but when they come it's very disappointing. Small and scrawny.  I am not going to say we will not go back but only time will tell the next few rounds if we keep it up or if we just give it a rest. I really hope we continue to like it as I was a huge Mad Mex fan and they too have seemed less than par these days. If I don't order anything off the menu anymore, I certainly can fill up on the guac and chips with a margarita (or two if it's payday!).  Cheer up Juan!"}
{"text":"Went for lunch and had a pleasant experience. Got a combo meal that had a taco, burrito, and enchilada alongside beans and rice and it was ready fast. Quality was good, tasty overall. Even had enough to eat that we saved our burritos for later. The fresh chips were awesome and the salsa was on point. Chips and salsa are extra though, not free. Overall a good choice and we should be back since it's very close!"}
{"text":"I decided to stop here today for a quick lunch after an appointment I had right up the road. I have never noticed this restaurant before, and I am on Rt. 22 about 2-3 times a week. I found out about it on Yelp and I am very glad I did! I have a feeling a lot of people do not know about this hidden gem. They should have a sign that's sticks out more to traffic on the highway!   Anyway, I arrived around noon and was the only one in the restaurant. It was a smaller place than I was expecting, but had a very authentic vibe and ambiance to it. I was a little disappointed that meals do not automatically come with chips & salsa, but I guess that is because I am so used to complimentary chips & salsa at other Mexican restaurants around the area.   I decided to go with the lunch portion of the grilled fish (mahi mahi) tacos, which came with the usual Mexican rice and beans. I am not a huge bean fan and was hoping to be able to sub something else for them without an up charge, but that was not an option. I'll eat them, just not the biggest fan. Well let me tell you that when I was finished with my meal, there was not a drop of beans left! They were excellent and something I will never think about subbing out again! The Mexican rice was wonderful as well, very flavorful!   Now to the tacos. My mouth is watering all over again just thinking about them! I currently have this obsession with fish tacos and have been trying to find the best one in the area. The mahi mahi that comes in the tacos at other places is often really dry and/or lacking flavor. Not these ones! The mahi was fresh, moist, and bursting with flavor! Also on the taco was fresh pico, avocado, and some sort of spicy mayo. The only thing I would suggest adding is some shredded cabbage. But they were still excellent! Reasonably priced also for the portion and quality, but again for the price I think chips & salsa should be complimentary :)  Overall I had a pretty good experience. I am looking forward to returning to try the breaded fish tacos and also the enchiladas and queso dip! Looking forward to bringing by boyfriend here as well."}
{"text":"This place was such a great find in Murrysville. Some of my friends had invited me out and since I'm from Murrysville, I'm surprised I didn't know about this place sooner.  I have been to Madero three times already and I am just now writing this review. The food here is amazing. The pollo con arroz is super tasty, chicken, rice veggies everything taste good. We ordered the appetizer of jalapeños stuffed with chorizo and topped with cilantro and cheese. It's my favorite dish besides the ceviche.   The ceviche comes in a bowl and is a mix of different fishes. It almost resembles a seafood salsa stew. I believe it's the best ceviche I've had thus far and I've tried several.   The best part about this place is that it's not  a big place but rather more intimate. They have about 10-12 rectangular tables and several bar seats. One downside is that the floor can become slick and greasy when it starts to get busy from all the kitchen traversing.   I have yet to try dessert here but I am truly looking forward to it. Check this place out!"}
{"text":"The great: The waitress, whom I assume must be a manager or owner, since she kept saying, \"We...\" I love that! After I informed her I was gluten intolerant, she quickly showed me what was the best item on the menu. She also informed me that the only flour on the premises was in the pre-made flour tortillas, and that the huaraches were homemade corn flour tortillas.   The good: The food was pretty good. Not the best I've tasted, but fresh.   The bad: The price was higher than I anticipated. $9.00 for lunch, which didn't include tortilla chips. I guess I've just gotten accustomed to chips and salsa at Mexican restaurants. I wouldn't have even minded a buck. But to pay $2.50 for one person... Just seemed high.   I'll probably be back with hubby, and then I'll get a chance to try the homemade chips and salsa to see if they're worth the extra."}
{"text":"I am soooooo glad I ventured to this place the other weekend. We were there on a Friday night around 8pm, not very busy! My companions raved about this place and go as often as they can. They asked if I liked cilantro and if I liked margaritas... I thought this was a trick question..... but a few minutes later the server came back with the most giant margarita I ever have seen.... and it was full of delicious and amazing cilantro. I mean really, so so so delicious. Like nothing I've ever had. They had a great tequila selection. The ambiance was decorative yet authentic and relaxed.   The chips, salsa, and guac were very tasty! Although I generally prefer a chunkier guac... but let's be honest, as long as the flavor is there I'm going to scarf it down... and that I did!  I am also on the hunt for the most amazing fish tacos so that's always what I order when I visit any Mexican establishment.  This place is definitely in the top 3 so far! Delicious grilled fish (I hate when it's tempura!) with just the right amount of spicy mayo. Generous servings, decent price. The rice and beans were fabulous as well. Definitely authentic cuisine. I absolutely cannot wait to come back here.   Now that I go back and look at the photos I took this really might be my fave Mexican restaurant in the Pittsburgh area thus far."}
{"text":"Love this place. Not the fastest in the world but great food. Small atmosphere, nice people working. I still recommend every time someone ask me where they should try."}
{"text":"We had a very good first experience eating at madero.  We started out with some chips and queso.  It was very fresh and the dip was delicious.  I had enchiladas with lime potatoes and margaritas slaw as my sides.  It was all good.  My wife had an enormous burrito.  My only complaint was that there wasnt too much for the kids and our service was pretty slow.  We'll be back, just maybe next time without the kids."}
{"text":"We enjoyed a wonderful Saturday afternoon lunch. A small place with a great atmosphere. The menu was full of authentic Mexican and Tex-Mex style choices with a great list of sides to pick from...Elote, Lime Potatoes, black beans, rice. The portions are generous and we were stuffed at the end. They also have great options for kids who will stray from the basics of chicken and fries (but they have that too). Would definitely visit again."}
