{"text":"This Madison restaurant is located right in front of the Bell Center, which is a good spot for them. On hockey game nights this place is packed with hockey fans. Like the others fans we were there just before the our special evening! We were lucky, we didn't wait a single minute  when we arrived. We got a table right away. Ok I have to be honest we were there quite early, 2.5 hours, before the game. If you intend to go there like us on a hockey game night or before any special event at the Bell Center, please be there early otherwise you will wait quite a while before been seated.  The ambiance inside was quite good. The decoration was simple but elegant. Food wise the menu was ok. Nothing really fancy except maybe the menu description ;-) They offer various salads, pasta, burgers, chicken, beef, and fish dishes. Price wise it's a bit too pricey for the quality of the meals. Don't get me wrong our meals were good but nothing fancy. I guess the prices are due to the proximity of the Bell Center. It's probably like Christmas for this restaurant every time there is an event accross the street. Worth to mentioned, the wine we had was excellent. I took a red wine called Caldora Ortonese and my father took a red wine called Mondavi. The service was very fast, the waiter was ok but he seemed a bit bored. At the end of our meal we could feel that they were looking forward to see us leave in order to give our table to somebody else. On one hand I understand them but on the other hand, I ate been pushed to leave especialy if I'm still eating or drinking a coffee."}
{"text":"So I went there on Friday for lunch with my colleagues, a few days after they opened. We stayed there a long time: it was a full house. We had to wait 30-40mn for our food. The waiters were very friendly and they always make sure we were good.  The food was great: I had the 10oz ribs with fries. This dish tastes the same at all the Madisons I know."}
{"text":"The food was great but service needs improvements ... we got there and none of the tables had the 2 for 22 special on them, we asked the server if the special was valid he said yes (I guess there is more money in it for them if they don't mention the special).  Then we wanted to substitute the fries for the spinach dip, ok but he didn't bring us nachos with it. we usually go to another madisson but I guess being downtown gives them the right to be snooty."}
{"text":"!!!!!!TO AVOID!!!!!  First of all, as we enter, the host was very rude (and seemed not to like his job). We get seated, and then my husband had to GET UP to ask for menus and water. After getting it, we ask for the 2 for 22$ menu, we were told the boss at this location was not offering it anymore. The 2 for 22$ being the main appeal of the restaurant, we got up and left to go to the Sherbrooke location.    I have been to the sherbrooke location before and still now i have nothing to complain about. A1 service.  What a shame for the Madisons restaurant line."}
{"text":"We went there just before a hockey game and the place was packed obviously but we had a table right away and we ordered and asked them kindly to be fast and we had our food only 7 mins after we ordered and the food was hot so it wasnt food sitting on the shelf for ours great place great staff and really fast service !"}
{"text":"My Mother and I decided to have supper here because it was close to the Adele show that we saw last night. I had seen the menu online and really was in the mood for seafood. We thought the prices were a bit high but I figured we are here in Montreal for a night out, we might as well eat somewhere nice. When we got there, there was already a line (expected) and we were told to wait 20 min. Since we were 2 we got in pretty fast and then we were asked if it was okay to shack up with two complete strangers because the restaurant was super full. Since we are the type to be social and enjoy meeting new people we agreed and shared a booth with another mother/daughter who were also in town to see the Adele concert. That was probably the highlight of the restaurant was meeting these people, because the rest of the time wasn't a very pleasant experience. The waiter kept bumping me every time he needed to serve someone at my table or the next table. He couldn't speak English very well either and I ended up explaining to my mother what the sauce was in English.  My mother and I ordered the clam chowder as a starter. The potatoes were too big in the soup, the clams were not appetizing (stringy) and...it was cold. The entree that my mother and I had were the salad options.....now here was the biggest disappointment. Not only did we pay way too much for a salad, we knew by just looking at the salad that the lettuce/cabbage/carrot combo came from a bag. We had two different salads but the same bag mix. I had the Sushi Grade Yellow fin tuna salad. The Online menu and the menu in the restaurant clearly indicated that there was avocado in the salad.....there was none. So I told the waiter and he said that they had changed the menu and that I was the first person to ask where the avocado was. Ummm it is written on your menu! Change your written menu if you have taken away an ingredient from the dish. So after complaining he came back with a half of an avocado saying that this was the normal amount that they would normally give....in what? my salad?...yeah it was always supposed to have avocado!!!!! Also my salad was 10% tuna steak 5% diced mango and 85% bagged lettuce/cabbage/carrot combo from a $2 bag for 24$!!! sooooooooooooo overpriced for garbage!!!! Never coming back!"}
{"text":"Service is so so but food us great. Le service est couci couca mais la nouriture est très bonne !"}
{"text":"I was in town on business but it was so cold it was something able to walk a block exposed to the elements to get food. So I chose this place it's proximity to my hotel.  Because it is located next to the Bell center everything is overpriced. I found the food to be pretty good despite the prices. Everyone serving food in the restaurant was extremely nice and very pleasant despite the subfreezing temperatures outside."}
{"text":"On a recent trip to Montreal, after eating mostly asian for four days, my gf and I were both craving steak for our final dinner in the city. Having scoped out most of the steak joints in the downtown area, we decided on Madison's, mostly based on the menu. It definitely seemed like the type of steakhouse I know and love. Was not disappointed at all, in fact, pleasantly surprised.   Based on reviews, I was somewhat put off by the mention of \"good for groups\" and \"good for kids\" but all was well in this regard. We arrived early on a sunday evening to a less than half full restaurant and were seated at a nice booth by a window. Our waiter was excellent, polite and attentive. Nice menu with plenty of selections in all categories, including a reasonably priced wine list. My sirloin steak was done to a perfect med-well, crab cake appetizer was very good also. Enjoyed the meal so much, stayed for dessert and coffee.  My only gripe would be the clam chowder, which was thoroughly tasteless. All in all it would be a place to which I would definitely return on future trips to Montreal."}
{"text":"Serves a fantastic salade food is good but not great, high priced small portions, great place before a Habs game."}
{"text":"My 3 stars are exclusively because of one waiter, Tom, I think his name was. He was forgetful, and way too familiar. Acted like he was the best friend of everyone at the table, was touchy, and even put his hand in my mother's purse as a \"joke\".  One of us ordered a 2nd bottle of wine and said he would keep it cool and watch for the glasses to be empty to refill, they were empty for a long time, and by the time we almost finished our meals, there was no point to opening another bottle. He offered a single glass instead, which my friend took him up on, and he never brought it. We asked if they had bread at the beginning of the meal, he said yes, and never brought that either.  The waitress at the bar was fantastic, and the food was very nice, nothing wrong there."}
{"text":"Great service but the food is terrible.  The $24 sirloin steak was chewy and not seared.  The sauce was disgusting.   We were a group of 9 guys for a bachelor party and the only dish that was descent was the ribs which was drenched in BBQ sauce.  We should've known when the place was half empty on a sat nite."}
{"text":"Fancy place with great decor and unprofessional staff. I'm sorry when taking a group picture for customers don't tell them to \"show some love\". No. Came here for dessert with some other elites- the menu was minimal, I ordered an apple crumble pie with vanilla ice cream to share ended up being oatmeal and apples. Really not worth the 8$! However, given it was last call and late night -tiredness hits everyone-im open to  giving this place another try during operating hours."}
{"text":"The food was awful, the waiter was not only among the rudest men I have ever met but overcharged us for a tip and lied about it. The manager had to offer refunds. Would never go back."}
{"text":"The location is fantastic if you want to be near all the hockey action at the Bell Centre. The issue is that the food is barely average, and not good enough for me to come back for more. I would definitely come back for drinks and to watch hockey on the many flat panel displays though."}
{"text":"I don't get all the mediocre or poor reviews for this place. My foodie cousins and I came here recently for dinner and we all had wonderful meals! Plus, our server was lovely!   I know this is a chain (I think there are 14 locations in total), but this site is located across the street from the Centre Bell, and so I think it has a certain unique charm :). There are large screen, wall-mounted tv screens everywhere, so you know this is primarily a sports-oriented steak place. (We were there during the Olympics so we were happy to catch a few Usain Bolt races!).   We were lucky to get a decent parking spot on the street. I can see whereas parking could be a real issue.   I know this place doesn't offer any contemporary food, or fusion cuisines, or fancy-shmancy, hoity-toity pretentious dishes. (Perhaps that may explain the so-so reviews of this restaurant). The menu is large and varied but it offers primarily traditional fare: steaks, salmon, ribs, traditional salads and desserts. This is why I liked this place; there's something to be said for tried-and-true dishes. Plus, I REALLY liked how the steaks came in a lot of different sizes! You don't see that a lot. I can't eat a lot and they offer a 5oz steak. This is SO perfect for me! And all main meals come with steamed vegetables (ours came with broccoli and carrots), with your choice of potatoes. The mashed potatoes were fantastic, and the steamed vegs were exactly what I wanted (no butter, no sauce. Just steamed. You can ask for accompanying sauces if so desired). My cousins had the ribs (which I sorely wanted to taste, they looked so good, but they were eaten with gusto too fast for me to get one!) and a larger steak, with Caesar salads on the side. Everything was cooked perfectly. I have to say, my little 5oz steak packed a flavorful punch: it was perfectly cooked (I asked for medium rare), and wonderfully seasoned and seared. It really was delicious.  Our waitress was very attentive and so nice. We discussed all the horrible construction on the adjacent roads and she admitted, it was really hurting business here and in all the neighboring businesses. (In fact, the place was nearly empty when we were there). This saddened us, as this place - and all the neighboring places - don't deserve to deal with this crap. But such is life in Montreal, I suppose; with all the construction, it really does look like a war zone in areas.  The only downside to our meal here was the dessert situation. My cousins wanted dessert but all the kinds of desserts they wanted were unavailable. Our waiter said they were switching \"vendors\" and as a result, they were having \"issues\" getting some of their more popular desserts. That was a bit of a let-down. Other than this, though, our meals were delicious and I would definitely return here."}
{"text":"This review is pretty late, I should have done it months ago but here it goes..   Went there on a Saturday night, right before the game ended at the bell centre(We skipped out early). It was surprisingly almost empty. We had calamaris as a starter, they were good. I had the prime rib as a main meal, it came out cold and under seasoned. I worked at a steakhouse so I have some idea about steaks. It wasn't bad, I just had to add a lot of salt to it. Had a daiquiri, it wasn't the best.   The bottom line is, I wouldn't go back."}
{"text":"The waiter with curly hair was rude, had no smile and gave me attitude. It took him forever to get me a menu. Unfortunately, I work in the same business and I know that this place has a customer service problem. The place was not busy at all. The hostess should have brought us the menu as she sat us down. Madison on Sherbrooke was great but I don't recommend the one downtown."}
{"text":"Made a reservation for Sunday at 18h. I know it's early but my bff likes to eat early. we get there it's empty which looks  weird to me... I got why there's a piece of paper in the door that says the 2 for 22$ menu is not available in this restaurant. I would of liked to be noticed about this before I got there. There's some alternative but still pretty expensive for the quality, I recommend to got spend some big bucks on a good restaurant in Montreal."}
{"text":"Great atmosphere, a bit overpriced for what you get but by the bell center what does one expect. Wait staff was pleasant enough, food was good( but overpriced) .. All in all its a reliable place to grab a bite before a game.. If you're looking for a cheap bite however.. This is not your place."}
{"text":"I am giving a zero rating for this place the owner is a grade A B****. My steak was a bad cut of meat (my friends steak was good) and instead of comping my bill or a offering a discount the owner of the restaurant who was passing our table acted defensive, patronizing and snatched the plate while I was holding it and trying to explain my situation. Our waiter Frédéric was awesome but the owner's attitude and crazy/awkward behavior was completely unacceptable and unnecessary. She should not be customer facing... Ever."}
{"text":"Nous y sommes aller pour un dessert après un spectacle au Centre Bell, nous avons été très vite pris en charge mais je dois dire que le serveur ne m'a pas parut plaisant du tout puis il était un peu trop tactile à mon goût. Sinon au niveau nourriture, les gâteau était bon mais bien trop sucré à mon gout."}
{"text":"Everything was just Average about this place. I dont know was it because the mood I walked in with or because I just went with the attention of having a good steak or what. Anyways, Madison is conveniently located right on rene levesque and drummond. Its beside the Bell centre so we all can find it easily. I particularly loved the lobster. It was juicy and tender. Service was very courteous and I appreciated the cozy vibe of the restaurant. Overall I believe this is a good place for friends to catch up as its in a spot on location!"}
{"text":"A group of us dropped by for some dessert and coffee after an event at the Bell Center. We were seated very quickly. Madisons is a very nice location with beautiful aesthetics.  There has been a number of prior reviews mentioning staff issues. The cakes/dessert we ordered came quickly, which is great but our waiter was stiff and looked like he was inconvenienced by our group showing up. If this is the case, why open across the street from the Bell Center? Wouldn't you expect groups of people showing up for some post-event grub? How Odd.  I went with the Greek cheesecake with raspberry and I found it really sweet. This may have been a cheesecake at some point but the amount of sugar in it overwhelmed it's purpose. On top of it it was a Greek cheesecake so I'd expect is even less sweeter than the norm. It was still good but way too sweet.  Coffee was the standard resto fare and doesn't need further mentioning.  The price-tag is a bit high but considering the location, I guess that's expected. The overall experience is 2.5 stars rounded down."}
{"text":"The meal was well prepared and tasty but customer service wasn't exceptional. We were a small group of four, last Sunday and the deal 2 for $22 was great. But one of my friends ordered and her meal was supposed to come with a salad that she never got. We asked twice for it, the first time the waiter apologized and said he would go get it and never came back. Excuse me, on a Sunday evening with only 2 tables to serve how can you forget something that you were asked twice? What if there was a crowd of people? I'm telling you, there was only 2 tables, ours and some other family and maybe 3 people at the bar, that day.  But overall the food was affordable warm and good."}
{"text":"I went there with my bf for Valentine's day, luckily we had reservations because this place is a hot spot! That night happened to be extra busy because there was a Bon Jovi concert right next door at the Bell Center.  We arrived before our set time for the reservation and were seated pretty quickly. Service was a bit slow considering how packed the place was although it is to be expected. We ordered cocktails, which were nice and strong, tempura shrimps were deliciously tasty, ribs and filet mignon equally pleasing. Portions are generous, especially if you get fries. My bf was surprised to see he was given an additional 6 ribs to his plate as a bonus.  The only drawback is that they offer an events menu so I'm not sure how extensive the selection of food is or how the prices compare to the regular menu. They also do not serve any bread basket, which is something that sets other steakhouses apart.  Around 8 pm the crowd died down once everyone left to the concert and it became a much nicer ambiance. Madison's is a pretty big restaurant that's shaped like a huge rectangle without many partitions so it's normally loud...  Once we were done eating, it seemed like we had been forgotten. No one had asked if we wanted dessert and when we wanted to leave, we had to chase another waitress down to get our bill.  Madison's is worth another try, because bottom line, the food is good, prices standard. I do want to go back for their 2 for 22$ special from Sunday-Thursday. We'll just have to figure out which day won't be an \"event\" to benefit from that deal, which may be kind of hard as there's always something going on at the Bell Center..."}
{"text":"Went here for a late lunch on Thursday, the day after this resto opened on Drummond downtown.   The music was blaring, I couldn't hear any conversation.   Both myself and my hubby ordered the Madisons Club. Very small. I ordered the steamed veggies as my side and my hubby ordered fries. They put a seasoning on the fries that is tasty. They sprinkled Parmesan cheese on my veggies which was nice, but overall it wasn't good OR bad.   The music was really too loud though and we were not in the bar area."}
{"text":"Here for the Montreal race.  Really nice place on a Thursday night.  Had the salmon and liked it.  Others has the filet and it was very good.  Cheese bread was hot and tasty.  Good service.  Very much an American style steak house.  Service was good and friendly.  Looking for a good steak house in the French dominated city try this place."}
