{"text":"Très décevant! Une entrée de calemars très caoutchouteux, dont la moitié étaient froids avec la panure molle. Pour le repas, nous avons reçu les patates douces (plutôt que régulières) 20 min après l'assiette alors que nous avions pratiquement terminé. Et même si le serveur trouvait cela inacceptable et nous a dit qu'il nous offrirait les patates douces et le café.... la facture ne manquait de rien elle.... le madison est bien, mais allez sur Chomedey pour éviter les déceptions.."}
{"text":"They have a really nice atmosphere and the people who serve the food are very nice and charming.My only complaint is that the service is slow but the food is good.I had the soho chicken breast which was delicious."}
{"text":"Samedi avant le soupe nous arrêtons au bar pour un apéro avant d'aller souper chez des amis. Superbe accueil à la porte par l'hôtesse et le maître d'hôtel.  Même pour un apéro au bar.  Même chose pour ce qui est de la préposée au bar. Détail bizarre, un homme semble manger son lunch au bar dans un contenant en styromousse. Peut être un employés car plusieurs autres employés venaient lui parler. Un peu bizarre même si avant le service. L'autre point négatif est le prix pour un 9 oz de Kim Crawford a 18$.   Ils ont dès spéciaux à 2 pour 22$ et pour 26$ les dimanches soir mais ils semble se reprendre beaucoup sur l'alcool."}
{"text":"New Madison Grill and bar opened in Laval..now they have about 15 locations in Quebec. I am a baby back ribs lover, and at Madison they are very good. The 10oz rack of ribs is at 21$. Now they have a promo for 2 at 22$. The fries are good and the decor nice.. tried the burger and salads, they were ok. They also have a good variety of fish and steaks."}
{"text":"Service was average, the food did not come all at the same time. My fish was ok but lacked flavor."}
{"text":"I haven't been to Madison's in awhile but after my visit I felt this place can be a solid lunch option going forward, particularly for work related lunches. The place is pretty with comfortable seating.    I went with their chicken tenders and it was very good. Fries were good. Price-tag a bit steep but there were cheaper options.  The service was quick and efficient and I would see myself going back here. Nothing negative to note.  Note : 2nd visit service was very slow"}
{"text":"Nice place, good food! Started with the baked brie which was underwhelming, but it's cheese so its still yummy! We didnt enjoy the jam on the side at all! I believe it was fig jam (although I love figs). My chicken was super tender although I expected more from the veggies other than broccoli and carrot for a \"mediterranean style chicken\" plate. My friends filet was delicious."}
