{"text":"Awesome!!! This place is great and the owner Eddie  is amazing!! He makes sure that everyone feels at home. The waiters and waitresses are nothing less than professional and courteous and always with a smile. I will be going there often that's for sure."}
{"text":"The owner here is so incredibly nice, and so is his waitstaff so I have to give him a full 5 stars.

Excellent meal. The steak was perfection, the sides were great and I was full for a reasonable price ($30) which included dessert.

VERY VERY good place to eat if you want steaks done right."}
{"text":"Mediocre at best
I'm not sure that I get 
Why this place is set 
At more than 4 stars not less. 

Yes, the place is classy and nice
And at first, I really wanted to like
The food enough to come again one night
But it wasn't that good, in hindsight.

Other reviews said service was great
But that is a statement I will debate
The waitress' \"friendly\" came off as fake
She threw dirty forks into one of our plates

Though it was visibly an accident
Did not say sorry or make amends
She laughed it off and didn't bend 
To retrieve the other from under my friend.

The menu is varied with plenty of food
But prices are high and quite a bit lewd
Portions are decent I must include 
But quality lacks and is really quite crude.

I ordered the prime rib 14oz to share 
Which came as ordered medium rare
With too much fat I could not bare 
The generic taste lacked love and care

'Shrooms were extra, but worth the price
Fried to perfection without any spice
My favorite part, but they could not entice
Me to return to this place twice. 

-------------------- Installment 7 of poetry reviews

It wasn't terrible. It wasn't great. It was decent but so not worth the price. Coulda spent the same amount at the Keg and had a much more satisfying meal."}
{"text":"On a sunny Monday a trio of our VPs decided to brainstorm. But as with all business meetings, there must be brain food. 

The local Madisons in Saint Constant was our choice for our head tapping and boy, we're we glad it was. 

Seeing as we are ALL watching our health, we were delighted at the beautiful choices in the salad section.

(We still drooled at our neighbours juicy burgers and fries) 

I chose the seared tuna while my coworkers chose salmon. 

I consider myself *fussy* as I consume sushi/ sushi grade fish multiple times a week and it was blown away by not only the large portion but the perfect preparation and gorgeous presentation 

Everything from the quantity of dressing to the fact that I was given the most beautiful avocados I have ever seen ( they had me at avocado). Pow.

Just a note..it is huge. Bring your appetite 

Last but not least this Madisons has a beautiful coffee menu..Nescafe frappé iced..like I was in Spain..but St. Constant.

The owners also make it a point to check on clients and introduce themselves .

Thank you Eddy and Themi. Keep up the wonderful job."}
{"text":"We were at a Hockey tournament in Montreal and needed a place to take our team between games. madisons NY Grill & Bar was perfect. Something for everyone and the kids had no problem with the menu choices. Great staff as well."}
{"text":"I've been to Madison's a few times before, and am always pretty satisfied. I came here on a Wednesday night with my boyfriend for a quick \"date night\" before a hockey game. Because of the god-awful weather, it was pretty empty. One of the main reasons we chose Madison's was because the 2 for 22$ menu. 

Our waitress was very nice; accommodating and friendly. We each started with the house salad with Italian dressing (it is oh so delish), mind you if you ask for a salad with the 2 for 22$, you will be charged an extra 1.50$ as it's soup that is usually served with the promotion. I ordered the Madison's club and my boyfriend had the Madison's burger. Our wait wasn't too long, which was nice because we were both pretty hungry, and wanted to make it home for the hockey game. I love their spin on the club; it's not a double decker, which can sometimes be too filling with all the bread. It's made on large slices of rye bread, with juicy chicken breast, cheese, lettuce, tomato and of course bacon. I had the fries with it and was not disappointed. Madison's does it again; satisfied my hunger without breaking the bank! I will obviously be coming back, and recommend this to anyone looking for some good eats at an affordable price."}
