{"text":"They strive to provide an authentic Madras atmosphere with no real air conditioning and plenty of mosquitoes (presumably because the front door is open). The food is decent but nothing to write home about. Most South Indian restaurants serve a Masala Utthapam made with tomatoes, onions and green chilies. Madras Curry House makes theirs with potato Masala which makes the utthapam really soggy and heavy. It's a pass. The Podi Idli was decent and good to share. 4 idlis are a bit much for one person."}
{"text":"Las crepas/dosas son deliciosas! La mesera hace muy buenas recomendaciones. Sin duda vuelvo. //
The crepes/dosas are delicious! The waitress has very good recommendations. I will definitely come back."}
{"text":"I have eaten dosas at almost every place in town that makes them, and Madras is my #1!!! They always stuff it full, the sauces are delicious, and the service is great. I've tried all of the appetizers at this point and also loved each item. I'm a big fan of Indian food in general, and I have a lot of Indian friends originally from Hyderabad and Tamil Nadu who highly recommended this place (so you know it's good!). If you want some spicy, tasty specialties at decent prices, I recommend Madras."}
{"text":"Food this cheap and tasty should be standard in the world. Seriously, I think crime would be less if we could all eat this well without damaging the wallet.
Clearly, I come from the big city.

I visited while in Montreal for a conference and this place was recommended by my dining companion. I was blown away by the variety and fascinating menu that I am unaccustomed to, as Southern Indian restaurants are not anywhere where I live. I took a chance on something that was so foreign I can't even remember what it is and was pleasantly surprised by the richness of flavor the spice and out feeling it was considering what a inexpensive and small dish it is.

Madras Curry House was so remarkable that I returned the following day with another friend I met at said conference so that she could experience the joy of this place. I look forward to being back in Montreal so that I can try more of what is on the menu and update this review."}
{"text":"Went there recently with friends for dinner. Air conditioning wasn't effective and the staff are still learning the menu items and computer system. Overall the choices we had were good, tasty and well priced. 
Will definitely go back in a few months when things are running smoother."}
{"text":"Best SOUTH Indian restaurant in downtown...

Idly, vada, dosa and chicken biriyani are good. 

Good place for an Indian fine dining in downtown"}
{"text":"This place has a great ambiance of south India with South Indian songs always being played. Restaurant is mostly tidy and neat with quick and friendly Service. Dishes are 3.5/5 for authenticity and 4/5 for taste and presentation. I have tried Masala Dosa which is one of the best takeaways from here and Chicken Kothu which is not really i admired. Only minus point is they add curry leaves generously in almost all dishes which is kinda annoying to me otherwise its a great place for every meal."}
{"text":"We went for lunch and found the food itself was fresh, flavourful and enjoyable. Service was slow however, so you need to be ready to wait. I would go back to try more on the menu but keeping in mind, you should expect to a wait."}
{"text":"Tiga.

Wonderful reprieve from the nuances and hoopla of Montreal albeit Quebec. Ce'st mangre super. 

Delicate service, clean food, very tasty allooo. I ordered Puri Puri - so fun!"}
{"text":"Ordered Gobi Manchurian , Chicken Kothu Parota and Chicken Samosa . Food was tasty but service was horrible. They took a long time to deliver food."}
{"text":"I went with my girlfriend at the time (she's more of an expert in South Indian food than me), and got pleasantly surprised. Since it is called Curry House, I ordered a lamb curry and I forget what she ordered, I think it was some sort of fish curry too, and she said it reminded her of a member of her family's cooking. It was very flavourful, though a bit expensive. Also, be mindful that the rice is extra, I thought I'd be included in the price on the menu, but apparently not, so that was a few bucks over what we expected. The lady running the place was really friendly and a total sweetheart."}
