{"text":"We have been going to Magic Spot for over ten years as it is at the end of our street. MS is awesome for a quick meal whether breakfast, lunch or dinner. We have eaten there for all. They have a great menu and even cook a good steak. It's not fine dining but it is great food, reasonable prices, and the family operating it are great."}
{"text":"Unfortunately a one out of five stars is the minimum I could rate them. Placed the order for myself and my wife within 15 minutes mine was ready and my wife's was forgotten. They mistakenly made the wrong thing for my wife's order and the lady at the register starts yelling at me telling me that I ordered the wrong thing. Although the young man and the older gentleman apologized and moved on I still feel like there was no need to be yelled at because of a mistake made on their end. First and last time there."}
{"text":"Just started coming here two weeks ago and have already been twice. Cheap and cheerful, big portions and the owners are very sweet. Good quality fast food."}
{"text":"There seems to be a problem when paying with a debit card at this restaurant. Even though it read \"approved\" we were told the payment did not go through on their end, when we then went to a bank across the street to withdraw cash it became obvious that the money did come out. We returned and showed the gentleman behind the counter (who I think was the owner, but I may be mistaken) our account payment history on our bank's mobile app. It clearly showed the time the payment was made, the amount and the name of the business. This seemed satisfactory at first. Eventually however, and this is by far the worst part about the whole thing, the employee come back and actually interrupted our meal to show some print out of their internal records - claiming again that our payment did not go through. Needless to say, we lost our appetite. Instead of enjoying the food, my husband went back to the bank, lined up to see a teller and got a hard copy of his statement. I did not appreciate feeling pressured to pay twice nor did I think the situation was handled professionally. We won't be coming back."}
{"text":"This place is great - a Bloor West staple from way, way back in the day. My mom took me there 20 years ago. The burgers - especially the Banquet - are great. The service is excellent - really cute family conducting things. It's still my go-to place for a burger and fries (and gravy!) 20 years later.  I was going to give it 4-stars, but you know what? For what it is - a local burger joint/greek/breakfast place - it's 5 freakin' stars!  Wish they delivered...."}
{"text":"Best chicken souvlaki in the GTA, if you are on this side of the city you don't have to go to the Danforth to get genuine, authentic, Greek food, the original owners have been there since the late 70's and are still cooking!  Great food! Not the best decor but the food is unbeatable!"}
{"text":"Love this place! Excellent food, very reasonable prices. Family run--great service. The Greek salad here is amazing! Also great souvlaki, potatoes and tzatziki."}
{"text":"This is a great spot. Always great food.  Always friendly energetic staff. Real, fresh, honest good food and service.  These guys should proud of the place they've built."}
{"text":"Ordered the gyro on a pita.   The meat was very greasy.  The tomatoes looked like they were cut with a plastic knife and they put shredded lettuce on it which was the first time I've ever seen lettuce in a gyro (it got soggy quickly and became gross)  The fries were your run of the mill frozen generic fries.  Wasn't thrilled and maybe will come back one day if I am craving a hamburger."}
{"text":"Great little spot. Excellent Greek food. Quick and affordable. Had the Slouvaki dinner and a Greek salad. Can't really beat the portion size for $12. Will visit often."}
{"text":"Best damn souvlaki in Toronto! Love the burgers, chicken greeks,  and especially the feta fries.  I have to stop here every time I am in Toronto!!"}
{"text":"This place is great. Not fancy, just good food and good service. Family run, Mom & Pop kind of a place, and you won't leave hungry!"}
{"text":"Best mom-and-pop greasy spoon in the area. A combo of Greek and North American food, made with love, at a reasonable price. Great service. Patio."}
{"text":"I went here because I was in the area, figure hit a burger joint.  This one was the closest to royal York, I had magic burger,  egg could been more runny, wasn't messy enough for a fried egg, patty was good but doubt it was 6 ouzes,  probably will be back"}
{"text":"I had the Chicken Souvlaki dinner. (Typical Greek thing, Chicken, Rice, Potatoes, Salad).    It was kind of plain looking and the taste was bland.  There was a good portion of food for 12$  but it was just missing flavor.    The best part of the meal was the Greek Salad. The veggies were super fresh tasting and they do not cheap out on the feta and olives!  While I was waiting for my food, there were 3 people arguing for the entire time in Greek, I think it was a Father, Mother, Son. That was kind of annoying.  Also, while my chicken was cooking the cook went to the back of the store to unload boxes and do some other work. Then he came back and without washing his hands he started playing with my food to stuff it inside the take out dish.  This is my biggest peeve in a restaurant, when people who didn't wash their hands, touch your food.  I mentioned to him how I thought this was a problem, but he and his wife got upset at me and started arguing in Greek again.. I just took my food and left :S  2 stars because of their pretty good Greek salad."}
{"text":"This little restaurant, located a couple blocks east of Royal York station on a north facing corner, epitomizes the no frills greasy spoon diner vibe. But don't hold that against them, as the prices match that vibe and you can get what seems like some decent food at a decent price. The place is narrow, with the flat top grill and deep fryers right behind the ordering counter.   Burgers run in the $4-$6 range a la carte (pre-tax), but they have combos with fries and drinks for a few bucks more. I had the banquet burger (burger w/ cheese and bacon) and I was definitely happy with it. The bacon had a decent thickness to it, and they certainly didn't skimp on the toppings. It was a bit greasy, but you'd be hard pressed to find a flat top cooked burger that doesn't end up like that. Fries were nothing special but adequate.  Other notables include all day breakfast on offer, in addition to a variety of chicken and pork based sandwich and dinner plate options. They are also liquor licensed with rather reasonable prices for bottled beer ($4-$6), although I didn't get a chance to indulge since I stopped in during a quick lunch break. This isn't exactly the place I'd want to go for drinks but its at least advantageous to know you can have a beer with your dinner if you came here. Service was friendly, and the bathrooms, while obviously dated, were at least clean."}
{"text":"MAGIC SPOT IS THE BEST PLACE TO EAT IN THE KINGSWAY VILLAGE!!!  I can't say enough how much I love this restaurant.  It's cozy, and the owners and employees are so friendly.  The food is perfect, hit-the-spot, home cooked goodness, with no fancy frills or gimmicks.  Just straight up DELICIOUS food made with love and care.  I recommend the all day breakfast made any way you want it, or the banquet burger, but anything you choose from their menu will be the best thing you ate all day.  10/10, 5 stars, A+, Magic Spot is #1!"}
{"text":"Best people, best food. Probably come here 3-5 atleast per month. Will not be dissapointed."}
{"text":"I often order Suvlaki dinner and I am happy with that. Friendly people and staff here."}
{"text":"The spot is filled with regulars, which is always a good sign. The seating reminds me of your typical breakfast diner. Menu is also decently priced.   I ordered the gyros dinner plus pop and it came to about $16 with tax, which is a little bit more than what im used to. Best thing was to probably get the combos to save some money but I wanted rice.  The people behind the counter were very friendly so thats a plus."}
{"text":"Ahem.  FTR .... ummmm...Chris P.  muuuuuhhhhaaaaaaaaaaa.....bring it big boy.  :)    The only real magic happening at this spot is how heavy your wallet feels after eating at this Bloor West Village mainstay. The biggest star the Magic Spot Grill has to offer is that this place, much like Square Boy, is just simply a bargain to eat at. A burger with cheese combo (a monster pile of fries & a can of brand name pop) hoovered a measly $7 bucks out of my wallet.   Magic Spot Grill is your basic Mom&Pop resto owned by a Greek family who are behind the counter. Ok, here comes the part where I date myself. Way back in the day, one of the original SNL skits was the Cheeseburger joint skit with the \"cheeseburger cheeseburger cheeseburger chips\" hilarity going on. This is the Magic Spot Grill and it literally sent me into flashback mode. Peter, the grill man, has tons of banter going on with the customers. You order a steak on a bun and he'll yell out at you \"ya wanna steak on a bun or a bun on a steak!\". When he called me out for the toppings on my burger he squinted his eyes at me and said \"I don't know your face. I haven't seen you here before. This your first time here?\" And then he proceeded to say \"You want cheese on your burger or burger on your cheese?\" followed by an outbreak of laughter from him. I kept wondering when John Belushi and Danny Aykroyd where going to pop up from behind the counter.   The burger is very similar to those I've had at Apache Burgers. The patties aren't the homemade styled patties like Craft Burger but surprisingly have a decent taste and are as large as the bun itself. The bun was one of the freshest I've had in ages at a burger place. There are no 32 toppings to choose from. Toppings are standard, nothing fancy or gourmet about this spot at all. Fries are what they are, frozen McCain styled, but they are plentiful and well cooked. I ate in and my food came on a plate and the burger was left open faced.   Oh by the way there is a Magic Burger on the menu. It is a 6 ounce patty with cheese, a fried egg and topped with a couple of onion rings. Pass the beta blockers please. While I might not venture back in to the MSG (isn't that a funny acronym for this spot :) for a burger I'd definitely consider their all day brekkie (three eggs, a pile of bacon and an even larger pile of home fries) or one of their big fat Greek salads spilling over with feta, spanich onions and olives.   Pics to follow."}
{"text":"Chicken souvlaki is decent, certainly not great. Overload of dressing.  Both visits, years apart, left me with bad aftertaste. Both visits too much second hand smoke, staff smokes at back door, reeks. Plus one guy handling food didn't wash hands. Gross."}
{"text":"Came here for breakfast with the family. Waited for tables to be cleaned. Waited for the menu. Waited for 45 minutes for food. There were four orders and 3 of them were wrong. Breakfast came in pieces, my uncle had finished his breakfast by the time the last order came out. Constantly had to check on food because the server was frantically running around the restaurant and forgot almost everything. Toast was burnt and weomg. Guy rarely came by to check on us. Asked for refills for coffee and only had enough for one. And never cam back to fill the other ones. Food was cold and had hair in it. Most disgusting place I have ever been. Will not come back ever. There weren't many people in the restaurant yet everybody was waiting for service. Soooo terrible!!!"}
{"text":"Friendly staff and service.  All day breakfast menu selections that would sure to satisfy your cravings."}
{"text":"The best Greek Salad in Toronto! The souvlaki is incredible too and the burgers. You basically can't go wrong no matter what here. If you're interested in a delicious Greek twist on a classic try the Greek Poutine! It features Feta instead of traditional cheese curds and it is salty gravy fry Heaven. Magic Spot is a humble spot with very kind and friend owners. Don't worry if you're underwhelmed by the exterior and decor! It's what's inside that counts."}
{"text":"I walked in to order take out and there were 3 people working behind the counter who ignored me and didn't even say hello for 5 minutes.  Finally one of them acknowledged me and took my order. I started to ask a question when another customer came up and interrupted me and then they started talking. When they were finished talking he turned his back on me and finally turned around several minutes later. I ordered chicken souvlaki. When I brought it home the chicken was not good quality and there was no tzatziki sauce. What restaurant does not give tzatziki sauce with chicken souvlaki."}
{"text":"Best souvlaki around this area.  People here are really nice,although it can get loud with the family that owns the place sometimes. (gReeks :D) Prices are decent.  Good place overall."}
