{"text":"Mmmm! Yummmmmy!
My friend and I were going to hit an a la cart but then found this AYCE gem on college! Delicious is the word to describe everything that came out of the kitchen and from the sushi bar. Great service and very friendly! I know it's a little thing but the miso came out nice and hot, not warm like most places. Nothin like a hot served soup on a cool evening. I highly recommend Magic Sushi!"}
{"text":"We love this place!! The staff is great and the sushi is delicious!! Mango Sushi is my favorite!"}
{"text":"this place gets 2 stars for the mere fact that i didn't get food poisoning. i got a lunch special and it was pretty underwhelming. see the salad pictured above. it felt like an insult and a joke. the rest was, uh, just OK. point is that there is 4 other sushi restaurants on the block that do the same or better and i suggest you try one of those first. 
also the place looks like some reject set from Blade Runner"}
{"text":"I got takeout from Magic Sushi from the first time over the weekend. The food was fine and they had the standard sushi restaurant vegetarian options.

However, I could not imagine going here for a sit-down meal, especially during the day. The place barely gets any sunlight (weirdly, they've blocked off one window with a folding screen) and the interior is dark and depressing. They've made it worse by decorating with lots of black."}
{"text":"Sashimi Island is a much better AYCE option. Sushi bon is probably similar but much nicer staff and ambiance. 

Comparable with Sushi D which isn't saying much."}
{"text":"Considered getting delivery from here the other day but SO GLAD I didn't -- Magic Sushi didn't pass their health inspection this week, which is especially worrisome for a sushi place that handles raw fish...

Magic Sushi (650 College St. W.)
Inspected on: February 3, 2015
Inspection finding: Yellow (Conditional)
Number of infractions: 4 (Minor: 1, Significant: 2, Crucial: 1)
Crucial infractions include: Operator fail to ensure food is not contaminated/adulterated."}
{"text":"I went here tonight with a group of 9 people and they were very accommodating. Food came out quick, was fresh and delicious. The beef tataki was awesome. We must of had at least 30 pieces. Mango rolls, green dragon and short ribs were perfect. Considering they just opened they are better than many others in the area."}
