{"text":"One individual here was just awful. He seemed to be the manager/owner - he was the one that took our money. He had zero courtesy or manners. Just absolutely horrible how he was treating some other customers as well. There was a group of about 10 of us from American Family. None of us are going back here."}
{"text":"Best Indian, best takeout I've had in years.  Staff was great to work with and had excellent suggestions.  The Fish Pakora was sublime. Perfectly fried and tender on the inside.  Lamb Madras was amazing as well.  Most importantly, the rice was exactly right and freshly cooked.   Delivery on time, fantastic service, and amazing food. Clearly there is someone in the kitchen who knows South Indian cuisine, as well."}
{"text":"I really like this place because the food is really good. I always get the chicken tikka masala and garlic naan, that is super delicious! Excellent food, great service and reasonable price definitely come back."}
{"text":"I'm not usually a fan of buffets, but Maharajah's lunch buffet was quite enjoyable. I tried small amounts of a variety of dishes and sauces and all were tasty. Their stuffed eggplant special and goat curry were super. The food seemed to be recently made as it was not dried out or overcooked."}
{"text":"I have a love-hate relationship with this place. Let me explain what I meant by that.   Here is a scenario:   You go in hungry and feeling like ready to chow down all the food display. After two plates, you start to slow down but you sill go for your thirds. then, you have to have the dessert. The mango ice cream is calling your name over and over. While you are near mango IC, why not, scoop up some of the pistachio ice cream and hey don't forgot those sweet balls.They are a must. Then, you are really stuffed and can't move. you look around the place and when you think no one is looking, you unbutton your pants and try to get up slowly. Thinking you might explode if you move quicker. You feel really bad that you had eaten all the food that can feed a small village. Then, you hate yourself for eating like a pig. You regret the whole thing ever happens. You go home and feeling sorry for yourself for putting 10 extra pounds in a matter of minutes.   The next day comes and when the food is digested, you crave for Maharaja buffet again. Eh!! Circle of life. Does it sound familiar to you or am I the only one? Hmmmm.........."}
{"text":"This place is not halal. We have spoken to the owner. All the workers say its halal but will never show you the certificate of Halal food. We called the manager n asked him, where do you buy your meat and chicken from because you guys dont have a halal certificate in the restaurant? Manager told us the name n we called them n those people have never heard there name before. Thats why we have STOP going there.  FOOD IS NOT HALAL."}
{"text":"Typical strip mall restaurant. The service was outstanding  and the food was just so-so."}
{"text":"Holy crap that was good!  The Chicken Tikka Masala was amazing!!!! Some of the best that I have ever had. For $14, I did expect to get more chicken. The naan was very good too (nice and soft). My husband got the Tandoori Mixed Grill, which was also good, but the shrimp was very over cooked. This dish was $18 but there was A LOT of meat. Although it did take a while to get, the food was very hot (temperature), which is always a struggle when we order out because how far out we live.  Came with mango sherbet, which wasn't bad (i am not a mango fan but figured I would try it).  We are planning to try it at the restaurant sometime."}
{"text":"Best Indian food in Madison. Interesting, delicious, diverse buffet. Wonderful service. Very attentive and friendly staff."}
{"text":"Spice level for the buffet is not for Indian taste buds. Great food selection though. Clean restrooms and overall attentive staff. Will go again if I am ever in Madison. The reiview is for buffet only we did not try from the menu."}
{"text":"Good food, reasonable price for the lunch buffet and very attentive service. I'll be back."}
{"text":"Some places that offer buffets start to lower their standards, just making the same dishes and slopping it out on a daily basis. Not here. Every time I've been, they offered something a bit new and different and it is all great. I've also come for dinner, ordering off the menu, and been impressed then as well."}
{"text":"Best Indian food in Madison I've had. Not only is the staff extremely humble and nice, the food itself is great. Really good food and loved their soup. They have a large selection of entrees (for buffet), desserts, and appetizers. They even have pani purri!   I would recommend getting the lunch buffet as its reasonably priced and you get to try everything.   Definitely returning again!"}
{"text":"I had the SHAHI PANEER - Chunks of Cheese Sautéed with Ginger, Garlic, Onion & Tomatoes,Garnished with Cashews and Raisins, Cooked in Creamy Sauce. A Royal Vegetarian Delight and the PISHAWARI NAAN - Unleavened White Bread Stuffed with Dry Nuts and Raisins.  I ordered it extra hot.  It had a decent heat level, though not extra hot.  The naan was good too."}
{"text":"Excellent lunch buffet, quick service."}
{"text":"Love this place. Their lunch buffet is great. So is their dinner menu. My partner and I went there for dinner on New Years Eve and for Valentines Day, we had so much fun. It is a relaxed atmosphere and they have great food. I recommend the Tikki Masala."}
{"text":"Well shit, all good things must come to an end and I suppose favorite Indian restaurants are no exception. Maharana, isnt entirely bad ( good service, clean space food entirely worth 2 stars) but absolutely make no mistake, this place is not as good as the place that was here, that rhymes with Maharana. Its very obvious they are cutting corners on ingredients where previous restaurant may not have. Oddly enough we really noticed in the desserts. Rice pudding a little to cloyingly sweet, Gulab oddly metallic flavored. What was offered on the rest of the buffet was good, but again just a little less richly flavored than our party had been accustomed to. I hate to say it, but we will be moving on from our regular stop here. I hear there are a fair amount of Indian restaurants in Madison! I"}
{"text":"I have tried almost all the Indian restaurants around Madison,Wi and I have never found one better than mahrana their food is always fresh and taste delicious. service is awesome nice staff."}
{"text":"An amazing restaurant!  Fantastic food, great service. I forgot my credit card there and they followed our vehicle and returned it!!!!  I pledge my eternal loyalty to this restaurant!"}
{"text":"Great buffet. I love their chicken tika masala and grilled fish. Always a great meal here."}
{"text":"The food here is good. My husband and I are new to Indian food, so I can't speak to its authenticity or how good it is in comparison to other Indian food, but overall we really liked the food here. The chicken tikka masala was particularly delicious, though there were lots of very good options at the buffet. The naan was also good (and needed to cool the mouth every so often).  The service was okay! Nothing good or bad to say there. The inside was really not all that awesome. That was the major part that brought down the experience for us; it looked like it could do with a face-lift."}
{"text":"Let me set the scene... Coming back from the Packers vs Panthers game. The trip is interminable. As we get closer to home we realize we are starving and need to grab take-out or else we will die. My Pakistani guy suggests Maharajah East. There are 3 of us. We order two orders of Samosas, naan, parantha, chicken mougali, and palak paneer.  We swing by, grab the bag and before you know it we are seated at my table unwrapping our treats. This is no easy crowd to please. We taste the crispy samosas which are filled with mashed potatoes and peas. Dipped in tamarind sauce they were downright heavenly. We nod silently in approval. We move on and find each dish to be equally yummy. The palak paneer (creamed spinach and cheese) was quite spicy and the mougali was very similar to tikka masala. Both dishes were quite rich. The naan and paratha were used to wipe up every last bit. As a treat, the restaurant threw in two little servings of mango ice cream. Thank you very much! A great meal to end a great day. Go Pack!"}
{"text":"Our family went to celebrate a birthday with an Indian dinner - there were 6 of us in our happy group.  We have been going to the Maharaja for years, to enjoy the lunch buffets, Valentines Day, birthdays etc.  Tonight the food was good, but the service was an issue.  To start, we could see that the staff had changed.  The service took a long time, even though there were only 5 tables with customers and six wait staff.  The server did not understand English well enough to properly place the order, so there was extra wine for one person.  Also, the glassware and flatware were spotted, with some that needed to be sent back.  The service had really changed for the worse.  The server would clear one dirty plate, then wander off, return five minutes later to get another and so on.  The Manager or owner really needs to train the staff.  They were all working, but seemed unclear as to who was responsible for what duties.  We also ordered ice cream and a special birthday dessert, while very tasty - the service was vey slow, at least 10 minutes from the time the ice cream was ordered to served.  What really put us over the top was when they refused to accept their own $50 Gift Certificate that they sold to me in June towards the $160 bill (not including tip).  It had only been approximately 6 weeks. Apparently, this location has been sold.  The old owners still own the location on Odana Rd (same name), but not this one.  Therefore, they would not accept their own gift certificate and told us, we could use it at Odana Rd.   Interestingly, they still kept the Best of Madison sign on the door for the old ownership,  they will need to take this down.    Again, we were surprised at the business decision about their own gift certificate."}
{"text":"weekend buffet is really good here specialy the maki di roti (corn bread)and punjabi saag.its my favourite.we will be back soon"}
{"text":"Fabulous food! Very clean. Friendly & attentive service. The buffet offered a chance to try many different foods. Amazing variety- especially liked the vegetable pakora & creamy sauce, chicken biryani, and chicken tikka masala! I will be back! Loved, loved this place & the price was reasonable for the selection & quality!"}
{"text":"This place had its awards placed up near the entrance, so they can say they're awesome. But, these awards are outdated. Remember one that was dated back in 2008. No 2010 yet. ha.  Had the Tandoori chicken and the Lamb curry. The lamb curry was awesome, although not enough lamb chunks.  The tandoori was excellent and spicy.  Had a side order of naan too. Delicious! But expect to pay a good amount. Its quite good and the awards don't lie."}
{"text":"Never disappointed. As usual the servers were attentive and the food was delicious. Chicken tikka masala was rich and tender. Get the garlic naan!!  Ordered it for the first time and was won over. Tandor mixed grill medium spice was also a winner. Two huge shrimp and several large pieces of chicken along with vegetables all in a flavorful sauce. Portions were enough to bring home leftovers for another full meal. Mango ice cream was tasty. Topped everything off With a hot hand towel at the end. Another satisfied customer!!"}
{"text":"I went here at the suggestion of several people who told me how great the food was. I admit my experience with Indian cuisine is limited, but for the most part pleasant, so I thought it was worth a try.   The food was outstanding! I ordered Aloo Ghobi. Really flavorful and spicy. I don't know if this is commonplace everywhere, but since I moved up from Texas it's been really difficult to order a dish and be satisfied with the level of heat. Here they asked if I preferred mild or hot, when I said hot, they asked how hot, I said very and they definitely delivered. My husband ordered the tandoori chicken which is a very generaously sized portion. It comes out on what looks like a small griddle, steaming, with peppers and lemon slices. They also brought out a big bowl of white rice along with some Naan bread that we asked for. All in all, it was a very satisfying experience and we will definitely be going back!  Service can be a little slow, but the staff are very attentive and helpful. They're also really good at refilling drinks, I know it seemed like our server kept refilling my glass every time I took a sip."}
{"text":"Wow. So they were open on Thanksgiving which was awesome. However, the food was meh. There were a few vege options, the food tasted mediocre. I would not eat here again if my life depended on it. There is so much better (like Swad). The wall next to our table needed work - the corner was so banged up, the drywall was was coming off. There were mysterious brown stains on the wall next to me, hanging dust lines from the ceiling (have you ever been to First Ave in Minneapolis? Yea, it was like that) and it was just dirty inside. The table cloths under the glass were also stained. Save your money and go elsewhere."}
{"text":"Umm HELLO!! Like Indian food could be any better... Maharana gives every other Indian restaurant in Madison a run for their money. Flavor town, for sure.   (Although, Madison is blessed with many wonderful Indian restaurants. We're lucky! Maharana was just a little extra delicious on this particular day.)   The lunch buffet has a great assortment of vegetarian and meat-full dishes. Paneer saag, chicken tikka masala, goat curry--YUM! I'm not usually a fan of idli, but these were nice and moist, and went well with all the rich sauces. The naan was also nice and buttery. They bring it out to your table and it's not served at the buffet. And to top off a great meal, don't miss the gulab jamun. Best I've had! Wish I could pick a favorite, but it's a hard choice.   My only \"complaint\" would be that the restaurant was a little dark and dreary, but nonetheless, I'll be back."}
{"text":"Have done carry out twice now and both times quality of food has been very good, service has been incredibly friendly and efficient, and each time I've gotten a mango ice cream bonus, which is delicious!    I like that I can order a chicken vindaloo medium hot, and it's delicious and plenty hot to be flavorful.  I ordered hot once and, well, it was hot!  Medium it is for me.  I hate when I order medium or hot and get bland food with little spice, not the case here.  Chicken was tender and plentiful, potatoes perfectly done, sauce was excellent.   I love rice, but hate when it's over or under cooked. The basmati here was perfectly cooked.   What really stands out for me, besides the food, is the friendly staff. Just incredibly nice, attentive, and friendly.  Rarely do I find such truly friendly stride anywhere. I find myself walking out with a smile on my face because of it.    Happy to have this place close by."}
{"text":"Really loved this place! The food was amazing and I will definitely be back. The chicken Tikka masala was awesome! And we got a sort of potato pakora which was a hit!"}
{"text":"Very tasty, delivery is SUPER fast, and always seems to come with free mango ice cream which is pretty stellar. After a decade-long campaign, this is the restaurant that has finally brought my husband around to Indian food."}
{"text":"I ordered the bhindi masala and the garlic naan. They weren't bad.  Not great, and with the lack of wait staff interest, don't think I'll try again in my short time I'm in Madison."}
{"text":"Excellent, varied and tasty buffet; great service.  We would be back. We were there on a Saturday and delighted at both entrees, sauces and desserts."}
{"text":"The staff here make the experience. Since I am not a fan of buffets, I can only tell you about the meals here. DELICIOUS. I don't eat meat, my boyfriend almost only eats meat, we both found things we loved. it was the best! We liked to eat here once a week since it was so amazing."}
{"text":"Not good place to eat Indian food.   Lunch buffet was just okay.   Dinner was bad. We took bhindi(okra) masala and it was very sour and tasteless."}
{"text":"Pretty good lunch buffet, theres alot of vegetarian choices if you stick to a certain kind of diet like myself.  I eat only Halal meat.  I haven't asked if any of the meat on buffet was halal only because I don't want to make a fuss.  I will however call ahead and see if they are serving any Halal meat before I decide to dine for dinner.  Sometimes they have Chicken and Goat but sometimes only goat.    As far as authenticity goes, I can't personally say because I am not south asian.  That being said, a friend of mine who is complains alot that there is no authentic south asian restaurants in Madison.  This how ever does not take away from the tastiness that I have experienced at Maharaja.    They have satisfying dishes that come in satisfying portions.  If you dare to go to the spicy side of the spectrum they are constantly filling your water, which is awesome.  You don't want to be left without water when the burn becomes too much.  You can ask for not so spicy though ;)  The only not so great thing I've ever had here was the Cheese pakora, they kind of seemed like they were pre made (as in frozen) and not fresh. That was the only thing, ever, in all the times I've been to Maharaja.    Both east and west locations have awesome service and tasty main dishes."}
{"text":"I was in town on business and had a free night so I decided to give Maharaja a try. I had the Mulligatawny Soup, Garlic Naan, and the Tandoori Chicken.  The food was really good (awesome Naan!) and the portions were quite large.  The chicken was out-of-this-world and I could not finish it all.   The only negative was the service. I dined on a Tuesday evening at 6:30ish. It took a long time for my waiter to take my order. Though the place seemed relatively full. There were only two waitstaff.  When i arrived, there seemed to be several employees outside smoking. Also, My waiter was not of Indian descent, which is perfectly fine, but he did not speak English, thus my questions about the menu and what he recommended went unanswered. It also took a long time for my food to arrive. From the time I sat down to the time my food arrived was almost an hour.   All-in-all, I would go back again because the food was very good. I would have given 4 stars, save for the awful customer service."}
{"text":"This place was really just okay.  Service was okay. Could have been better but it was decent. I was rather disappointed with the naan. It was super salty and I was pretty close to sending it back but I preserved and finished it. My eggplant dish was good. And there was plenty of rice to go around.  They deliver around Madison, which is a plus."}
{"text":"Pretty decent curries and buffet. I've had their takeout a couple times and the spice level greatly varies. Staff are wonderful."}
{"text":"I had been hearing about Maharaja's from friends for months. One big win for them is that they deliver to Sun Prairie. Sun Prairie peeps, good news for us!   We stopped in a for a mid-week lunch buffet. The food was good, the prices were right on par with other Indian buffets.   On the top of the list for yumminess for me was the breaded fried Paneer cheese and the \"general tso's\" of indian food - tandoori chicken. The cheese had a great texture and what's not to like about cheese! It was tossed in a sweet and spicy sauce. The tandoori chicken was creamy and had a flavor to it that I haven't found before in tandoori chicken. Very flavorful.   Plus, on an extra note, they let my 20 month old eat off the buffet for free. Yes, he only ate grapes and mango ice cream, but hey, he loved it! :) I've been to some buffets that charge for one year and up when they only are going to eat grapes and mango ice cream."}
{"text":"Excellent buffet!!!! A little different yet many traditional items. Vegetarian and on vegetarian food on the menu.  Service was good.  The mango and coconut ice cream on the buffet was especially delicious!!!!"}
{"text":"I have been going to this lunch buffet about once a month for a long time and have always rated it high. Not so much anymore. The last three times things were just average. My main complaint this time is that the food is not hot enough on the buffet line. It was the same the last time I was here and it hasn't improved. I actually mentioned it to the cash register  person but nothing has changed. Some of the things that I really liked are now missing like that potato thing that I don't know the name for that was always there until now. The lentil soup is different  as well. Just doesn't have the same taste. One really irritating thing that happened this time was that I was criticized by a server for using the wrong spoon for the mango ice cream. It was in the ice cream when I got there so someone else had left it there. It was supposed to be in another dessert. The ice cream scoop was there in a bowl of water that looked filthy with the water and ice cream all melted together so I don't blame the previous customer for not using it. Either way the guy should have just moved the errant spoon and not criticized me, a paying customer, for using it. I suppose I am nitpicking but the other Indian places are now a step or two above Maharaja and I don't think I will go back for a while. Something has definitely changed here, at least for the buffet lunch."}
{"text":"When we walked in at 11:55, the place was deserted, but by 12:05 it was packed!  They have a huge variety of dishes that are heavy on Southern Indian fare (like dosas!), and the quality was better than most lunch buffets. Definitely a win."}
{"text":"We visited the Maharaja for dinner last night for the first time in a long time. The food and service completely lives up to my memories and I cannot stop raving about the Malai Kabob. The food was so delicious, it reminded me that definitely need to come here more often!  When our party of two was seated, we were the only people in the restaurant for dinner. Gladly, more people soon arrived after us.   The waiter started us off with complimentary papadam and chutney (I am so sorry if I misspell anything) and we were impressed. Not because this is unusual at an Indian restaurant, but the chutneys definitely stood out! They were more coarse than at some of the other local restaurants and very spicy (which I love).   We also ordered fish pakora, Malai Kabob, and Lamb Chati (I think). Each of the dishes could not have been better. The fish was crispy and well-spiced, and, like I mentioned earlier, the kabob was incredible. I tried it at medium, which is quite hot but doesn't wash out all of the other spices. Definitely a good choice.  All of the waitstaff were very friendly and the dishes were timed well, everything coming out hot after we had finished the previous.  For dessert they gave us each a scoop of ice cream. I don't know if that's what they always do, but it was just the palate cleanser we needed after the hot meal.  It looks like the two-seat bar in back is also a good place to wait for your pick-up order. I had never noticed it before.  I for sure want to come back again soon and hope others do, too!"}
{"text":"Sorry I am indian and as a indian this place blows .. Their aloo parathas are a cop out the just use samosa filling for the stuffing ...  The spicy pickles are from a can, also their vegetable curry is made with frozen vegetables not fresh ... Also I know its not a authentic place when the serve beef...  No authentic place will ever serve beef, they will serve goat, lamb, chicken and every animal except beef... what else, oh yea two of the servers started chewing each other out in the back of the room where EVERYONE could here.... Also they should invest in making \"chaat\" food - street food of india .. they had none of that one the menu!  I will give it 1 star because the garlic naan was good.. Also our waiter was really nice it was some guy who moved here from SD... Save your indian food craving and head down to Chicago"}
{"text":"You'll be treated like royalty at the Maharaja.   I first came upon this place by chance. I was in town for work and noticed that there was an Indian restaurant nearby. After reading the great reviews on Yelp, I knew I had to try it for myself.  I ordered the Chicken TIkka Masala along with Naan bread and a cup of chai. I ordered the food to be Indian hot. The waiter replied, \"I like your confidence!\" It was very tasty and hot just as I like it.   The restaurant was well kept, the staff treat the guests as royalty so the service is wonderful, and the prices are decent for what you're getting.    Don't forget to stop by the Indian grocery that is located next door to this location! It has a large selection of items so that you can make your own Indian dinner at home.  Will I be back the next time I'm in town? Absolutely."}
{"text":"The neighborhood felt a little sketchy, and as a solo diner, my service wasn't very good.  Food was OK though."}
{"text":"I have drove past this place a thousand times, and never realized it was even here.  I didn't discover my deep and passionate love of Nepalese food until moving up to the Twin Cities, but over break my dearest mother suggested we go to the Maharaja on the east side.  \"On the east side?\" I scoffed, foolishly.  \"There is nothing but chain food and malls on the east side!\"  I know this statement fairly well, as we grew up 20 minutes east of the east side of Madison, making a trip downtown quite a hike.  But she assured me that it was in fact  on the east side.  And not on the east side like....Ella's Deli is on the east side.  This thing is on the East Side as in East Towne Mall is on the East Side.  So, reluctantly, I went in.  AND WAS GREETED WITH AWESOME.  This buffet was amazing.  They had a coconut soup which was great, all of the chicken dishes were great, they had a wide variety of veg dishes...I was so stunned and amazed.  Even though I didn't partake, they served strawberry lassi...mmm!  Finished off with some mango ice cream, I couldn't have been more impressed.  Whenever I visit home, I always drag my family along to Maharaja.  Delicious, and a good price.  All the staff are very friendly too!!"}
{"text":"The buffet is ok, but I came back for dinner and the specific items are very good. I had a vegetable korma and a chickpea curry. Samosas were super. Chutney could have been a bit spicyer, but hotness on the food at medium was quite good. Go here for dinner. Yum.   They had as special, 2 entrees, nan, rice and popadom for $20."}
{"text":"Came for dinner at 8:30 on a Friday. Only a couple other tables in the place. Good service, excellent food- we tried the tandoori combination platter and a paneer dish, as well as some nan bread- the garlic nan is fantastic. I would love to go back and try the buffet to try different things. However, there is something to be said for ordering off of the menu, mainly: you actually get some spice! Generally Indian buffets are too bland for me as they don't want to make anything too spicy for someone. All in all, a great place for dinner. The bill was $40 for two of us. They were also playing some really funky Indian dance music."}
{"text":"I brought my granddaughter here for her birthday. She had never tried Indian food before. This experience was wonderful. The service was friendly and helpful for a novice in ordering. we were recommended a less spicy option for the young lady (she is 9) and regretted not getting the medium spice.  I would love to know how they make the Chicken 65 and Tandoori Chicken. Do you share the recipes?"}
{"text":"Drove to Madison to meet up with my brother and his wife to catch a movie on a Saturday night.  Got into town early so that we could grab a bite to eat.  As I don't get it often, I chose Indian food, and picked this place based on the reviews I found on Yelp.  Glad we chose it.  Very friendly staff and the food was excellent.  We had Samosas, the Lamb Madras Curry and the Butter Chicken (my wife's favorite), and a couple orders of Naan.  Both my wife and I ordered our food medium spicy-usually I like mine spicier but knowing I would be sitting through a long movie I thought that discretion was the better part of valor this time around.  At the medium level, there was just a bit of heat to it.  Would have liked it a bit hotter, as it felt more like mild, but again I love hot foods.  Definitely worth checking it out if you find yourself over on the east side of Madison over by I-94."}
{"text":"This was the best Indian food I have ever had and the best service of any restaurant that I have been to! The service is very quick and the restaurant is very clean. The entire decor is nice and the ambiance is very pleasant. A complimentary papadam appetizer with an assortment of chutneys is provided, along with complimentary rice with the meal, and finally some  complimentary mango ice cream at the end of the meal. The tikka masala is one the best that I have ever had and the meal portions are perfectly sized! The staff was polite, attentive, helpful, and warm! Would recommend to anyone passing through or living in the area! I can not rave enough!"}
{"text":"Authentic Indian in Madison, Wisconsin.  Score!"}
{"text":"The lunch buffet from 11:30 to 3pm is crazy delicious!  Weekend buffet is 10 dollars a person.  Try a little bit of this and that, take what you want, leave what you don't.  Great food, good service.  I recently went to their Odana Rd location on the West side for dinner and the food was still very, very good, but the price was nuts!  So stick with the lunch buffet and you will have happy belly and happy wallet."}
{"text":"I've only ordered takeout from this place and every time I've ordered it's been pretty spot on. Plus they always throw in a small dish of Mango ice cream. I'm assuming they do it for everyone? Foods good, ice cream's good. Not a bad place!"}
{"text":"I really do not like the smell of curry powder so this is why it was my first Indian restaurant experience. Went in for lunch buffet and was pleasantly surprised. Food was really good. I liked almost everything I've tried. Tandoori chicken was really really good. Juicy and tender. Naan was really good as well. For desert I enjoyed mango ice cream but other deserts were to sweet for my taste. I will for sure try some more Indian food in the future."}
{"text":"The decor was ok. Nothing special but there were some odd mylar stars and hot air balloons hanging from the ceiling  Came in for dinner and there are two other tables at 8:00 on a Thursday night.  I wonder if people go to bed early around this neighborhood or if this place just isn't that popular.  Coconut soup was weird .  A mix of hot coconut milk that's been watered down and then laden with sweetened baking coconut from a bag.  This was definitely not fresh coconut in any way and I found this soup to be disapointing.     Lamb Saag was about as much lamb as you might expect for a dish costing 12.95. It's uniform liquidey sludge was a little too reminiscent of diarrhea for me and I lost a little of my appetite, though the lamb was tender and cooked well.  The overall dish was very very salty with no special taste.  Just a little spicy, a little Indian, and a little lamb.  They are probably using curry paste from a jar, or there is just not a very imaginative cook in the kitchen because the whole dish was lacking in flavor (besides salt).  A whole cardamom pod was left hidden in the diarrhea sludge, which led to an unpleasant burst of cardamom in one bite.  Rice had clearly been sitting around for awhile and was very dry throughout with crunchy bits and very chewy bits.  I just don't see how this is acceptable to serve someone in a restaurant.  Rice is one of the cheapest ingredients out there.  If the rice has been sitting for too long, throw it out and make more.    I tried the saag with the rice and the oily mess of lamb Saag rehydrated the rice somewhat, and the rice's absorption of the Saag took away some of its saltiness.  Three sauces or chutneys that came with the papadom were not very good at all.   Had to ask to have my water glass filled every single time I finished it. (this is a major pet peeve)"}
{"text":"We did takeout and we ended up with large portions of excellent chicken tikka masala, garlic naan and veggie pakora and they gave us free chai for the road!"}
{"text":"Best Indian buffet I've had in a very long time. The goat curry, chicken biryani, samosas, pakora, and pani puri (!) were all fantastic. Oh, and mango ice cream. Also, they gave our toddler a free mango lassi after she somehow managed to bang her head into the table and had a bit of a meltdown. Good people, great restaurant."}
{"text":"Disclaimer: This review is my experience with their Weekday Lunch Buffet only.   I'm a buffet guy! I love the fact that you get to try so many different things in one sitting and dont have to worry about wasting food in case you didnt like what you ordered! Having said that, I've rarely come across establishments that serve some impeccable buffet spreads! This place, unfortunately, is one of those that does not.  Food : Bordering on Barely Tasty. The spices in some dishes were off like the lamb curry and vegetable rice. The tandoori chicken and goat were decent though. The desserts were HORRIBLE!!! You don't serve stuff like Gajar ka Halwa (Carrot) or Gulab Jamun without knowing exactly what you're doing. The Carrots were stale and you could pick up the taste right off. There was no richness to balance it out as well. The gulab jamun tasted straight out of a can. If I wanted a canned one, Id get one myself from the store, thank you!  Variety : Acceptable as they had 3 Protein and 3-4 Vegetarian mains, along with a bunch of starters.  Service : Prompt, pleasant. No issues there.  Considering the sheer amount of Indian restaurants in the vicinity, Id say skip this one and try some other."}
{"text":"I need to come back and right a glowing review for this place. They're so nice and the food is great and cheap. I order delivery from this place near weekly. So here's your 5 star till I get around to a good long one."}
{"text":"I can't say enough good things about this place!  My husband, son and I go there at least once a month and it is always delicious and they take such good care of you!  Some restaurants look at you when you walk in with a little one and grimace they are always joking with our son and making him, and us, feel very comfortable!  The food is SOOO good - not a bad thing on the menu!  If you're looking for a great Indian meal in a great atmosphere with fantastic staff this is the place!"}
{"text":"Beware the rip off!  Twice now they've altered my signed credit card statement to add money to the tip (which was already 20%).  This last time they added $5, and for a buffet with almost zero table service.  And FYI the food is only mediocre."}
{"text":"This is it - the cream of the crop.    I've lived in the Madison area for the past two years, have visited many of the local Indian buffets, and have found none that equal the Maharaja standard.   Buffet dishes change on a daily basis, but you can always count on their show-stopping chicken tikka masala to be in the mix.  In addition to the standard meat curries and tandoori chicken, they always offer multiple vegetarian dishes and an array of appetizers.    Recommendations:  coconut soup, vegetable korma, malai kofta, baingan bhartha, chicken tikka masala, mango ice cream  The staff is wonderful and always keeps plates of naan a plenty :)  Maharaja is by far one of Madison's best restaurants.  And, you can't beat their lunch buffet deal (under $10).   But diners beware, it is incredibly easy to overeat at this place...forcing one into an almost immediate food coma upon settling the check."}
{"text":"Maharana was one of the first Indian restaurant i had been to.. the food is fine here..not great and not very bad either.. one thing for sure It has really good tandoori chicken.."}
{"text":"Tonight was my first visit to Maharana, although my wife has been to the buffet there multitudinous times over the years.    Wife had the Lamb Masala, I had Chicken Chile Masala.  Maybe I was in an extra good mood because I just purchased my new awesome Rav4, and my elderly mother did not actually burn her house down when she placed her rice grain shoulder wrap in the microwave oven for twenty minutes...but I was completely enchanted.  The Chicken Chile Masala had a pleasant burn, with flavors of fresh ginger and (I think) cardamom.  The portions were generous, but not crazy American generous.  I will have plenty for my dinner tomorrow night.  The mango ice-cream was an unexpected treat which did not fail to delight.  The staff was friendly and the music was infectious.  We will definitely visit Maharana again."}
{"text":"Great food and delicious garlic naan. The help was fantastic. Complimentary mango ice cream was generous. Left stuffed and clean. Hot towel was brought for each guest. Thank you very much."}
{"text":"What a great find! As several others have pointed out, the decor is nothing to write home about - nor even to dwell on it in a Yelp review, but It has always been my contention that if you offer great food at a fair price and are not offering a dining experience, then restaurant cleanliness and an attentive wait staff is a better investment than wood carvings and mood lighting.  We came for lunch and it turned out they had a fantastic buffet! Everything from tandoori chicken to palak aloo. Every dish was so flavorful and authentic. Having spent two years overseas where I associated with several Indians, I know they would have been suitably impressed. The waiter brought naan to the table and was there when our water glasses emptied. He didn't hover but he was attentive.  My lunch partner and I got a kick out of the sign that politely let buffet eaters know we were welcome to the food but would be charged for waste. It should go without saying, but I have been to several all-you-can-eat buffets and have witnessed first hand the amount of leftover food that has to be thrown away because people take too much. Personally I think part of the blame should be placed on the cooks/managers for not putting out a better product, but certainly the customer is largely to blame. Hence, a sign that clearly articulates the Maharaja's expectation of its customers is a good thing. Let's face it, if the food was bad, the customer would be screaming...  Bottom line, Eat here if you love Indian food."}
{"text":"At tha advice of the reviews on yelp, my family decided to try out this restaurant. Excellent food at decent prices.  If you like Indian food, I would highly recommend that you eat here."}
{"text":"I feel compelled to write an additional review for this restaurant because the food I received on my second takeout experience was AWESOME. This time I ordered exclusively vegetarian. To start with the mixed veg appetizer is a great deal. For $8 you get a samosa, 4 spinach pakora, 2 paneer pakora, and 2 other pakora. All of them were excellent, not oily, and curry in the samosa was fresh and tasty.   For dinner we tried the Tandoori paneer and paneer jalfrizi. Both dishes were excellent . The combination of the spices with the vegs and the paneer was out of this world. The quantity was huge and one dish was plenty for two people. We also tried a ginger naan which I have never had before. Careful because it does have a kick to it, but I loved the flavor.   We also received two complementary mango ice creams which were also very good. Perfect quantity cups for each person.   Overall I was extraordinarily pleased with the level of the vegetarian food that we had."}
{"text":"Not that I am any kind of expert on Indian food but the buffet was amazing!! Highly recommend! Friend staff, food was very fresh, good variety and tasted great - not much more to ask for. We'll be back (sooner than later)"}
{"text":"Excellent food. Lots of variety in the buffet.  It expensive. Great flavor. We will be back."}
{"text":"I came here over lunch. I took the buffet option. There was plenty of food in the buffet. It was all good, hot , fresh and hot too spicy hot...I liked it all....The dessert was great! Service at our table with drinks was quick. The ricecream dessert was my favorite."}
{"text":"I have a new found love for Indian food and when I found myself in Madison I had to check this place out. It was most excellently delicious! The staff was very nice and the price for 3 people including 4 drinks and an appetizer was about $75. If you ever find yourself on the East side of Madison, you should really check this place out."}
{"text":"Very good Indian restaurant. good service and yummy food. I got lamb curry and it comes with rice. The rice is not like Chinese rice which is sticky but it's still good with curry on top. Especially I like the garlic naan (like bread). You can either eat it directly or dip in the curry."}
{"text":"The Beef Mango is so good, it's hard for me to want to try anything else. Initially I was hesitant about delivery mostly because I also love their samosas and worried that too much time between the fryer and me would mean certain sogginess. To date, each order has shown up perfect and crispy and delicious. Eat your heart out, pizza."}
{"text":"Maharaja, one of our fav. Indian restaurant to go on weekends in Madison. Love all the food selection, quality is always good, friendly staff and waiters. Some dishes are way to salty. Please cut down on the salt. Thank you."}
{"text":"My husband and I came today with a group of 14 people for their Sunday lunch buffet and I have to say, for the price, excellent service and quality of food, I really recommend this place!  I called ahead and they allowed our group to have a semi-private room away from the restaurant but close to the buffet.  The buffet had all the dishes you would hope for and some unexpected ones as well!  I really enjoyed the chicken tikka, chana masala, samosa and more common dishes...but they also had a goat dish, fish, several biryanis, really nice chutneys, etc.    My only complaint  about this place was that the naan wasn't in a basket with a napkin to keep it warm...it was just plopped on a plate and got cold quickly.  The naan was great and deserves to be kept warm!  The dessert section of the buffet had a ton of variety but the mango ice cream was superb.  Apparently, when you order a meal during the week (even take away!), everyone gets a mango ice cream as well.  The food was excellent but the mango ice cream will bring me back!"}
{"text":"Tired of \"phone-it-in\" lunch buffets, with the same 6 dishes day after day?  Then Maharaja might get you out of your funk.  I've been to their lunch buffet about 5 times, and EVERY time there is a new dish or two that I've never seen before.  Great price on the lunch.  Wonderful dessert selection.  Good variety between meaty and veggie dishes.  Love the goat curry.  If you like Indian food at all, you can't go wrong with a lunch at Maharaja.  (And for facebookers... No, I did NOT eat 4 times tonight.  Just catching up on some restaurants that deserve a good review.)"}
{"text":"My favorite Indian restaurant for lunch on the east side of Madison. Great buffet for those like myself, who can never decide what entree they want, and/or who tend to bug their accompanying partner for \"just a little taste\" of what's on their plate....you can choose a sampling of everything! My favorite here is the Chicken Tikka Masala. It is so good. The flavor is robust and rich. The dosa is amazing as well as the fried cauliflower. The naan, which they keep you well supplied with is amazing. By the time I've finished my food, I'm of course completely stuffed, and I have no business in doing this but, yep, i make my way towards dessert. I choose at least one Gulab Jamun, a bit of mango ice cream, gajar halwa (the wondeful sweet/savory carrot pudding) and kheer (comforting creamy sweet rice pudding). Highly recommend this establishment. Great food, great service, casual but nice decor, and especially for lunch, you get a bang for your buck. Visited the buffet and brought it home via bicycle. Yes, things got a little jumbled around, (as you'll see in my photos) but when ya gotta have some Indian food, you just do what ya gotta do."}
{"text":"Hands down best naan I've had. Like crispy on the edges soft on the inside best I've ever had. I may or may not be basing my star rating based on the Garlic Naan I ordered.  I ordered the Fish Masala. It was pretty standard masala sauce. The fish was just some sort of whitefish. Again, I think it was the naan that complemented this that sealed the deal for me. I wasn't particularly excited about the $14.95 price tag on it, but it was yummy.  The servers were nice. They even brought out a complimentary scoop of mango ice cream for us. That was nice of them. I never turn down ice cream. There is always room for ice cream. Always."}
{"text":"We went for the buffet on a Sunday morning, and are so glad we decided to give it a try!  My husband's favorite is Chicken Tikka Massala - which they had on the buffet.  I'm pretty new to Indian food, but there were so many options and so many things I liked!    The service was amazing!  Our water glasses were constantly full, which is good considering some of the food is really spicy!  We're not from that area, but if we were in the neighborhood, I would consider going there again!"}
{"text":"The buffet was really worth it.  Some of the dishes are wonderfully flavored.  Some are a little bland.  Their mango ice cream is very good, but the mango lassi could do without the whipped cream.  Very attentive staff.  Curry here is not very spicy but has a nice mixture of spices."}
{"text":"Ordered from Maharana through EatStreet a few times and every time it's been prompt delivery with hot and tasty food. Great Indian delivery on the east side of Madison."}
{"text":"Hands down one of the best restaurants I've ever been to in my life. The buffet is simply amazing. I'd eat here everyday if I could. Love the variety of foods. The service is exceptional. Your water glass will never be empty. Everyone is kind and cheerful."}
{"text":"Our first Maharana experience was AMAZING and we will definitely be checking out the restaurant in person!  We ordered delivery and found the menu for Maharana on EatStreet.  Everything we ordered was from the Vegetable menu, there is so many to choose from!  It also arrived 20 minutes ahead of schedule.  Whether it was intentional or not the delivery driver was extremely well dressed & classy as he brought us our food.  To top it all off, as the gentleman was walking away he announced the desert was \"complimentary\".  What a treat to have great food, have it arrived fast, and be kindly presented our food (& desert!).  Thank you so much, Maharana!  We will be eating with you again soon!"}
{"text":"Good food! We usually do take out but we did eat there once. Server was very helpful as I can't eat gluten or dairy, which was very easy there since they had lots of options for me."}
{"text":"I really enjoy the food here... some of the time. The quality of the food here swings from good to bad each time I go there. I have gone both for the lunch buffet and for dinner, and in both experiences this quality lasted. I will admit I enjoy the food here but the inconsistency of the food throws me off."}
