{"text":"This is one of the best Indian restaurants in Calgary. If you're driving by you have to stop in and try this place out. They have really nice sized proportions of food that fills everyone up. 80$ of food will feed 4 hungry people and that's the total cost of delivery and tip. We have ordered food from this restaurant lots of times and it has always been very good. Amazing flavour and good taste of Indian food 5 STARS!!!"}
{"text":"Went here for a work lunch and we all had the buffet. The food was excellent, the vegetarian options were ample, and they even had Khadi (which is a very authentic north Indian home food). The service was excellent and the ambiance was great too. Highly recommend it."}
{"text":"This eatery is excellent. The food is delicious, delivery service fast and courteous, overall 5 stars."}
{"text":"The nan bread is the best in town. Perfect spice combinations, great portions, and excellent service. My favourite East Indian take out in Calgary"}
{"text":"I've only ever had takeout, but will recommend this place nonetheless. The service is great! They fully accommodated a vegan diet and the food always arrives well before their estimate.  It may seem a bit pricey at $50.00 for a three dishes, but the portion sizes usually cover two meals for two people.  Now for the food. Dear god. Delicious. My boyfriend has the phone number under \"Bharta house\"  because that' the first item on each order. Smoky, rich (even without dairy) and sweet. All it's missing is the peas! Other safe bets are the chana masala, which is less mango-y than my favourite, but swims in a nice dark sauce reminiscent of Pakistani chole. The aloo ghobi is another safe bet with the aloo to ghobi ratio a lot more generous than the potato heavy restaurant standards.  Definitely my favourite Indian Restaurant in Calgary- don't let those Moti Mahal sheep lead you to believe otherwise."}
{"text":"I was excited to see Maharajah re-opened in the old Auburn Saloon space. It was always one of my favourite takeout lunch options when it was on McLeod Trail, and a take out container was $10.  While the food was as good as I remembered it, the prices sure weren't.  Their take out is now priced by weight, and my meal, comprised of mainly (inexpensive to make) lentils and (again cheap, but apparently heavy) eggplant curry, some rice, and a tiny portion of butter chicken (3-4 small pieces) clocked in at an astounding $18 and change!   Thanks but no thanks, I'll keep going to Mango Shiva, for $12.95."}
{"text":"Dreadful beyond words. Zero love and no care. Got delivery a month ago and the $65 meal was INEDIBLE.  Dry , rubbery, day- old rice, a dry rock-hard inedible lamb shank ($25 house special rip off FALSLEY advertised as leg of lamb)  that was completey undercooked and dreadful.  In the last month have called 3 times and emailed to ask for my money back. Manager claims no ability to offer compensation as this lies with the owners who obvoiusly dont give a crap and never return calls or emails. Avoid this hole.  I will be there in person soon , during a lunch hour , to get my money back and it will not be pleasant."}
{"text":"Visiting Calgary and stopped by this wonderful Indian restaurant.  Amazing service and food was some of the best I've had.  Am comparing to places in NY, CA and Texas.  This place is first rate and wish they were located near my home. Again outstanding deep flavors."}
{"text":"Little expensive but excellent food,fantastic ambiance. Good service. Good location. I loved their tomato soup very much."}
{"text":"Butter Chicken.  Not sure if I need to say anymore, but their butter chicken is amazing!  I would also recommend the Palak Paneer.  While I am not well versed in the culture of this food, I think it would he hard to say anything distasteful."}
{"text":"I've tried two other Indian places in Calgary and this one by far is my favorite. I docked one star because the garlic naan bread was underwhelming - it was by no means bad, just that I did not (a) taste the garlic and (b) it wasn't anything special. It did have the right structure though - not too thick, not too thin.  I came here for lunch and opted to order off the menu versus eating the buffet. I ordered the veggie samosas, lamb korma, garlic naan, and a \"classic lemonade\" to wash it all down. The samosas were good, you get 3 in an order, and it's delicious with the green sauce that comes with it. The lamb korma, so far, is the best in town that I've had. The sauce was creamy and flavorful, not too thing or watered down.   The special highlight for me though was the \"classic lemonade\" which is made with touches of mint and ginger. I decided to give this lemonade a try because I love mint and I love ginger, but what I didn't expect was for this drink to come out carbonate. IT. WAS. AWESOME. I haven't had a carbonate lemonade since I moved out of Ecuador and it was a wonderful surprise to my lunch. I wish more places had carbonated lemonades or a \"limonada imperial\" as it's known in Ecuador.   Thank you, Maharajah East Indian Restaurant, for actually giving me a pleasant meal as they have been in short supply here since I've been in Calgary. I will be definitely be back."}
{"text":"Being someone of East Indian descent, you know when I give an East Indian restaurant 5 stars it's because the place is AH-MAZING. And truly, that's the ONLY way to describe Maharajah.  I've been going to Maharajah now for almost 6 months and it has quickly become my absolute favourite Indian restaurant in Calgary.  The service is phenomenal. I have NEVER had any qualms about it on any of the multiple occasions I've eaten there. And the food? - you ask. Well, as good as the service!  A couple months ago, Maharajah introduced a dinner buffet on Friday and Saturday nights. The whole meal deal is is available at an insanely economical value of $16.95 per guest. I\"m talkin': Pakore, papads, samose, naan (plain, butter or/and garlic), papri chat, raita, salad, soup, around 4-5 meat dishes (one of which is the best tandoori chicken I have ever had) and around 4-5 veggie dishes (one of which is the best baingan ka bharta I have ever had). Then of course, there's dessert which includes fruit salad, kheer/custard, gajar ka halwa and gulab jamun. If Indian dessert is not your thing, the restaurant also offers vanilla ice cream with delicious mango pulp drizzled on top.  If I haven't convinced you to try this place yet, then I don't know what else I could possibly say. Every time I come here, I feel like I've died and gone to heaven. Yup, it's that good.  Thank you to Maharajah for being one of the greatest Indian restaurants I have ever been to, hands down.  See you there next weekend!"}
{"text":"Very authentic! Love this place, food is great and service is friendly. Highly recommend it."}
{"text":"I love the food here! The Butter Chicken, Saffron Rice and Naan Bread are my favourite from this location.  Fast Service and free delivery for orders over $50. Our family has eaten here maybe five times now and will continue to do so :)"}
{"text":"How odd is it that this restaurant isn't listed on Yelp, I thought this place has been around for a couple of years. Oh well, first to review *raising roof*!!!   Drive up north on McLeod Trail and when you end up in the jean-pocket of downtown, Maharajah will catch the corner of your eye. We ate here recently on a Friday night.   We had the following items:  -Vegetable Pakoras  -Plain & Garlic Naan  -Baingan Bharta  -Butter Chicken  - two other dishes that escaped my memory but were just as delicious  -I had a mango lassi with spices & chai tea.   Great meal that satisfied four hungry machines trudging through the bitter winter. Everything tasted great, the pakoras make great starters and I wonder why pubs don't serve deep fried spiced veggies. The Baingan Bharta was surprisingly good and stood out as dish that can satisfied even those with meat palates. I managed to grab a few pieces of chicken from the butter chicken and lamb and beef from the two mystery curry dishes but with East Indian food, for me it's all about the complex sauce, adequately tasty enough to flavour the Naan and steamed rice.   Dessert...awwww shit son...I never really enjoyed east Indian desserts and always finished my meals with a conversational cup of chai. But the cheese RASGULLAS dumpling desserts were intense! I can't rival it to anything I've eaten in this city, the rasgullas were maybe even better than the plum dumplings I've eaten @ the Austrian club.   Best part about the whole meal was that the prices were very very reasonable. But your tab become expensive if you get carried away when you order second helpings, which was what we did for drinks, bread and dessert."}
{"text":"I went here for the all-you-can-eat buffet at lunch (weekdays only). I usually avoid all-you-can-eat buffets because I eat all I can eat and that's not a good thing as I can really eat. The trays of food were constantly filled up in smaller portions. I saw people coming in and taking the buffet food to go in take-out containers.   Butter chicken, chicken vindaloo, naan, rice, daal, vegetable pakoras, a vegetable dish and dessert rounded out the selection. Lots of creamy, rich dishes that were not spicy. This place would be a good option for groups and those on a tighter lunch schedule. Service was attentive."}
{"text":"Yummy! Big portions, great non generic flavours, and reasonable prices. I ordered the butter chicken - big chunks with a sweet tomatoey sauce with a hint of cilantro. I ordered the lamb biriyani and plain naam. Lots of lamb and great heat to the rice. The bowl of yoghurt help bring down the spicy for my husband. Naan was soft and chewy.  My husband and I ate more than our fill and we had leftovers. $6.00 for delivery. I can't wait to order again."}
{"text":"Oh Maharajah, it used to be across the downtown library and they closed for around 3 years and with no transit that I know of that goes by. So I was deprived of Maharajah for a while.  Lots of things to say about Maharajah, good food service definitely. They are very attentive, kind, efficient. Done with your plate from your lunch buffet? You say yes, it's gone. They ask first that's what's so good about their service. Oh, you need water? Done.  Amazing service.  The place itself is an improvement from their old place by the library. I mean their initial setting was really good to begin with but the new place has more polish to it.  The food is just as good as it used to be. The Gulab Jamun was a great improvement it used to taste like it came from a can. But I tried it last week and it tastes way better.  We had delivery at one time, and it wasn't as impressive as staying in the restaurant. That's why I only had 4 stars out of five. If I could I'd put 4.5 because even 4 is too low.  So yeah, I'm a repeat customer, love the place. And oh! The butter chicken is amazing. My fiancee definitely adores their garlic bread.  I never had a bad experience in the restaurant and I think it's definitely the first place you should try for curries and butter chickens.  It's definitely a good establishment, nice staff, great food and environment. Rarely if ever, disappoints."}
{"text":"Amazing food! Best Indian food we've had in Calgary. My girlfriend and I love Indian food and have tried out several places. This is now our favourite!"}
{"text":"WOW!  This tiny little place makes amazing authentic Indian food.    We had a craving for Indian food and stumbled upon this place because the place we historically bought take-out from turned us away saying they do not do take-out after 5:30 pm, it's their loss.   We stumble upon Maharajah East Indian Restaurant that was very close by, thanks to Yelp.  The food here is flavourful, reasonable priced and best of all they deliver to Aspen Landing too!!  The Vindaloo was hot and delicious as well as all of the other food we ordered.  Everyone loved the food eating more than they normally do, still leaving some leftovers for the next day.  I would recommend that your try this place, one taste and you'll be hooked.  It's our new go to place for Indian food 6/5 stars."}
{"text":"Located in DT, while the older location was nice in a traditional way ( i remember it being a bit more dimmed), this is even more elegant, nicer chandaliers, and better square layout.  Plus having these booth round seating at opposite sides is another option too, esp for an intimate date but I digress.  Having been a butter chicken expert all these years, I decided to try the Tandoori Fish, which was really packed w/ tons of flavours; first the light saltiness of the fish, combined w/ the grilled onions, red/green peppers, and its homemade lentil sauce, this is another healthier alternative somewhat lol.  Cooked on a sizzling iron hot plate, so every bite warm.  Pretty good customer service, constant topping up the water glasses.  Value-wise, it's what you'd expect in a DT setting w/ this type of decor.  Clean, spacious washrooms.  no amex."}
{"text":"Great food! Authentic and flavourful. Ordered extra for leftovers next day. They are only delivery or pick up as 1 small table is all they have. Many different varieties of naan. Kids enjoyed fish pakora. Tandoori was a little too spicy for them but we enjoyed!"}
{"text":"Last night proved to be the beginning of a terrible weekend (weather wise) Me and My buddies were making our regular friday food rounds and discovered a nice sized place called Maharajah east indian restaurant, I have passed by it many times and we decided to live on the edge and go somewhere out of our regular (ever expanding) list of places. It seems to have been in business for quite some time so \"their must be something special about it right??\"   So we stepped in a were immediately greeted by a very kind hostess/waitress who seated us right away. Service wise, a very good first impression, and as usual (by rule of first impressions) it was excellent service for the rest of the night. So what about the food?   First off, or waitress brought us some complimentary fried crispy chips, (i forget what they are called) they were accompanied with some cilantro chutney and mango chutney (very good taste), they did not taste stale( a problem i have encountered before at other east indian places) and had a good amount of aromatic spice flavor in the chip itself, and it was free! always good!.Second, we got a couple appetizers, Veggie pakora and onion baji, (basically deep fried vegetables with a medium flour coating) they were very well seasoned and it was a perfect way whet our appetites for the destruction to come. I noticed that with the vegetable pakora they were more like random sized clusters of vegetable and floury goodness, each cluster was different, this was the first time i had ever seen pakora like this! And I rather liked its rustic charm, and this also came with a bigger batch of the same sauces.  On the to main courses!! We stayed more inside the box of typical  restaurant indian fare. Butter chicken, beef Rogan Josh, and Lamb Goa curry along with a vegetable side of Baingan Barta (roasted egg plant with tomato and onions) and of course Naan bread. Overall all the dishes were quite good, My main complaints are: The beef in the Rogan Josh was dry and had a rough texture to it, the curry sauce was excellent though, it had a nice ALMOST to spicy feel (which I was liking because of the cold outside)  the butter chicken was everything thing you expect but not beyond its call of duty, very average. Everything else was on par, good naan made in a tandoor and the eggplant dish had a creamy texture and was flavored really well. My favorite of the main courses though would have to go to the Lamb Goa curry, very well balanced flavor, rich coconut base.All the yummy spices jamming of each other created a curry which was superb and that stood out from the norm, the lamb itself was tender and tasted like lamb should. Also I have to mention the dessert that I got Ragullas, quite frankly, AMAZING, its the best I have had anyway! in fact so much so I had to order a second one. Three little deep fried milk dough sitting in warm simple syrup laced with coconut and cardamom pod flavor (and some other kind of magic) it really impressed me, and ended my meal on a quite a high note!  The prices were very reasonable (especially comparing to other similar places) and It had a very nice ambience (maybe outdated) but cozy and warm and clean, it was a perfect way to spend a couple of hours with my buddies enjoying a quality meal. part of me really wants me to give it 4 stars but the only reason I cant is because certain dishes were slightly mediocre, and the portions were fair, but not overly generous. I would recommend this place to anyone in the area and tell them GET THE RAGULLAS!!! So so good!"}
{"text":"Moving from South part of Calgary to NW area, and was looking for my new go-to Indian place. This place is a real gem and the owner is a gentleman as a bonus. Will certainly be a frequent visitor *Very limited eating space inside the restaurant, more of a take out place"}
{"text":"This is a small take-out/delivery place but the food was excellent.  Looks like there is also a single table if you want to eat in.  I ordered online.  Really convenient.  Food was ready to pick up at the estimated time (about 30 minutes). Parking out front was easy and the fellow at the front desk was friendly.  All of the dishes we had were great - a little spicier overall than expected, but the sauces were very flavorful and portions very reasonable.  Will definitely be ordering takeout from here again!"}
{"text":"This place didn't impress me at all... The only advantage is that is inside the palliser... So you don't have to go outside in cold days ... And you can arrive there through the +15... The food I would rate it with 3 stars... The desserts are not bad... I'll give them credit for those... The prices are ok... I would prefer to go to other Indian restaurants around if the weather is good..."}
{"text":"Good food, good service but a little on the pricy side. Their menu selection is pretty good."}
{"text":"Yummy Malai Chicken.  We ordered daal tadka,tandoori roti and Malai chicken. It is a perfect place to eat and relax in the middle of downtown Calgary. We also got to use their Wifi. Maharaja you rock"}
{"text":"This restaurant is so good. We are so lucky to have this in our neighbourhood. It is always yummy. Love everything we have tried."}
