{"text":"Very few restaurants offer an experience as warm and wonderful as that of Maialino.    Naturally, to receive a 5-star rating, the food was exceptional.  I highly recommend the Carpaccio di Polpo - thinly sliced octopus on a bed of frisee salad with celery and black olives that is perfectly flavoured.   We also had the Insalata Siciliana, which could have been a typical salad found in so many Italian restos in the city, if not for the excellent combination of fennel and citrus fruits that was, again, perfectly flavoured.  Following appetizers, my husband had the wild boar ragu pasta (which he enjoyed so much the last time,  he ordered again) and being a soup aficionado, I opted for the Zuppa di Lenticchie, from their daily specials.  I can honestly say, it was the best lentil soup I have had (note that I have lentil soup from a variety of fave places once a week!).      Beyond the food, what made Maialino particularly good was the service of not one, but two servers who ensured our plates were cleared promptly and glasses were never empty.  We sat at the very welcoming bar where we could watch the dynamics of the fabulously efficient kitchen and chatted with Chef Roberto, who shared with us his rich culinary background and recommendations based on traditional Sicilian dishes.  He is clearly very passionate about the ingredients he sources and made it a point to ask our opinion of each of the dishes we enjoyed;  so much so that he had an arancini prepared just for us to try.  (Another highly recommended dish).  Though it was already a late (work) night, my husband and I couldn't help staying.  The staff began coming over to personally introduce themselves and we drank limoncello as if we were in a huge family home.  One of the best restaurant experiences we have had."}
{"text":"The best authentic Italian restaurant in the city.   The food and the service was amazing.  Being a little more west means there will no problems with the parking.  I loved it so much I went back two nights in the row."}
{"text":"From the glass of Proseco offered as a welcome to the Limoncello as a farewell, this meal was wonderful.   We ordered primarily from the appetizer menu, finishing up the main part of our meal with a shared bowl of pasta in a wild boar ragu. Included in our varied dishes were octopus (served thinly sliced and marvellously cold), a delicately flavoured arancini, charcuterie cured in-house, a three layered pot of goodness containing parmesan, eggplant and tomato sauce. Lastly, a sous vide porchetta, tender in texture but deep in flavour. All excellent.  The service was very friendly with Roberto, the chef, approaching us from the small but efficient open kitchen, after each dish to ask our opinion. Our server, Claire, is as upbeat a personality as ever was.  All in all, one of the most enjoyable meals we've had in some time."}
{"text":"Had a great meal at Maialino. Went with another couple.   The atmosphere is warm and inviting with a long cozy \"service\" bar that was full of people perched on bar stools gabbing away, eating and drinking.  We had spicy salami with crusty bread brought to our table. We ordered the cold Octopus - which was delish, a collection of soft and hard cheeses along with some other cured meats - amazing, and an arrancini cone - perfectly moist with a crunchy shell.  I had the wild boar pasta - it was fantastic. My husband had the short ribs - they were just as scrumptious.  I am looking forward to returning to this place! A little gem in the heart of Ronceys!"}
{"text":"Very friendly staff, great ambience, good wine, great food and good espresso. it's a winner."}
{"text":"Went to Maialino for dinner last night with 2 of my girlfriends.  I made a reservation for 6:30pm - but being as it was a Tuesday evening, it wasn't that busy there and I probably could have just walked in without a reservation and been seated.  A few other tables around us filled up during the time we were seated (mostly couples).  The server was friendly and knowledgeable about wine and recommended a great choice for us.    We were brought some aged proscuitto and bread sticks (complimentary) as well as some fresh bread and more bread sticks.  We had the rice cones as well as the asparagus and mozzarella starter.  Both were quite good.  2 of us ordered the short ribs for our mains and my other friend ordered a special seafood dish (I can't remember exactly what it was called) but everyone enjoyed the food.  For dessert, 2 of us declined and one of my friends ordered the cannoli. We could see the sous chef (or might have just been another kitchen staff member) prepared the cannoli - there were 2.  When they saw it was for our table for 3 ladies, the chef made sure to add a third one (even though 2 of us hadn't ordered the dessert) and he brought them to our table himself.  It was a nice touch.  We were there for almost 3 hours and it was nice we didn't feel rushed to leave (although there was no wait for tables - so not sure if we may have been encouraged to leave had it been busier)."}
{"text":"Just had dinner for the first time at Maialino I have to say although there are some good things about this place (e.g. wine list) - I could not BELIEVE how hard the bread buns were. They were so hard it was impossible to break or bite into them. In fact I ended up hurting my teeth on them. When I mentioned it I was surprised at how little they cared. Nothing ruins what was to be a nice evening meal as much as having your concerns so coldly dismissed. Also there are very limited options for a vegetarian (one salad and on entree) - and this with no edible bread in sight! Oh well. I hope they get the bread figured out."}
{"text":"Some of the worst service I've experienced in years. We came in as a party of 3 on a Saturday night, no reservations,  and were told there would be a there would be a ten minute wait. Completely understandable! But then ten, turned into twenty, and twenty-five... during which we were entirely ignored by the wait staff (and one particularly rude, balding waiter) as they passed us to serve a large party seated at the front of the restaurant. Like I said, I understand waits on weekends, especially with no reservations, and am a very obliging patron, but when an you are walked by on countless occasions, without a word (\"It'll be another 5 minutes, thanks for your patience!\"), or inkling of hospitality, it's quite uncomfortable. That particular individual also left a very sour taste in my mouth, barking at me later for asking him where the restroom was. That said, decor is bland, and generic, with the exception of the bar which is nice and big. Food was average. The only really exceptional dish was the octopus carpaccio."}
{"text":"Went to Maialino Tuesday for dinner and it blew me away!!!! Its worth the trip to the deep west queen pocket. We have  friends that rave about how good it was so glad we got to try it.   The decor is not over done, yet funky and traditional ...they also have a neat open kitchen with a chefs table great idea. This place just feels like a restaurant in Sicily where the chef and staff talk to you like your firends.  If you interested in any menu items and how there prepared the staff is so knowledgable and the chef will come over an answer any questions. The food!!!!!! So tasty, plated with attention to detail. We had porchetta with lentils amazing rich but not over done a hint of sweet and savory with the carmelized onions, arancini the best in the city even better then my Italian nonna. stuffed full with yummy goodness!!! mains the veal chop godddd....so tender perfectly cooked with an mouth watering side caponata ...sicilian side dish of cooked eggplant and other stuff with like a sweet and sour sauce ...never had it but loved it! my dinner guests had wild boar pasta with truffles not like your usual boring truffle pasta thats over powered its creamy without cream ,,,perfectly truffled so you can still taste the pork and the pasta was the freshest ive ever tasted. We also had the fluke fish kind of braised/steamed wow melt in your mouth...with crisp green beans! Being in the service industry myself i noticed the actions of the two servers in the resto..honestly often times i go out and the service is good but at maialino the service was good but it was warm and i really liked that i felt like my server cared wheather we were enjoying our time....i had to note that. It was a friends aniversary and they brought a small glass of sparkling wine for us to cheers and at the end of dinner they gave these cute little boxes with cookies given to us  with the bill classy touch. oh before i forget!!!!! The cannoli TO DIE FOR!!! we had a few bottles of a siclian white alhabra i think.....fantastic order it!   hope you enjoy maialino as much as we did  caio!!!!"}
{"text":"Went here tonight with 2 friends on a spur of the moment decision.  It was a bit late, 9:00pm, but we were treated fantastically.  Being vegetarians, the two of us were a little intimidated by the meat centric menu.  In the end, we have no problems.  The staff were great, the food was fantastic and the cannoli are some of the best I have ever had.  They change their menu somewhat frequently, so have a look online before you you go but it was a fantastic evening with great Sicilian food."}
{"text":"This is our second visit here.  We were pining for pasta and enjoy their fresh made pastas/noodles, and they are definitely a difference maker.  The Sicilian salad was large enough for us to share.  The Fettucine Bolognese definitely hit the spot and was what we were looking for.  Simple, but very delicious.  We'd come back."}
{"text":"Mutton Dressed as Lamb! We had a group of 7 for dinner last Friday and while the atmosphere was nice the food was very average and extremely overpriced.  We started with a couple of plates of oysters which were nice and fresh but the main dishes left a lot to be desired. The Tuna ($26.00), while nicely cooked was tiny and lacking flavor.  The Ravioli (5 pieces for $18.00) was was dry with what seemed like nothing more than a bruschetta topping.  One nice dish was the short ribs.  A small but flavorful portion for I believe $26.00 We spoke to the owner or manager and voiced our displeasure with the meal.  She said she knows and will be working on it. Dinner for 7 with one bottle of wine and two beers $590.00 plus tip.  We stopped for pizza on the way home."}
{"text":"Another Enoteca in Toronto?  Located in the deep queen west pocket, Maialino Enoteca is great for pig lovers, but they do have a range of other dishes as well. You can have a family style pig roast, which apparently runs out, so if you really want that, book an earlier dinner.  The space is long with some nice wall art of italian/sicilian type phrases, but the communal section up front is by far the nicest.    We ordered the oysters, which our waiter said they were really fresh, but I wasn't impressed.   For appetizers, we tried the selection of cheeses and salami, which I would highly recommend getting. The salami and prosciutto were delicious.    My main of ravioli was great, and the riccotta and sliverred almonds worked well together.  But, my tiramisu just had too much cocoa powder on it, which I find ruins the whole dish. With so many great restaurants in Toronto, Maialino Enoteca will probably not make my list of places I'm dying to go back to this year."}
{"text":"Our standards have really been lowered.  I'm not sure where any of you have travelled in the past but take a trip across the border if you really want to experience great food and amazing service is all about. Ten of us were seated at a great big square block table at the front window of the restaurant! Awesome spot.  Are waiter came around with open bottles of water asking if we wanted flat or sparkling some said flat and some said sparkling and thought nothing of it.  We were given some homemade shaved curded meat as an amuse bouche, lovely.  We all ordered wine, appies and mains. They gave us some lovely bread and oil before we got our meal... so far so good!   Meals...  Ahi Tuna was returned as it was totally cooked through - was ordered rare as it should be. Braised short ribs were extremely fatty and salty.  Seafood ravioli - only 4 on the plate with 3 shrimp and the orange sauce was way to lemony - glad I didn't order that - yuck!  At the end of the meal they gave us a bottle of Lemoncello that provided everyone with about an ounce and a half of the liquor. Here's where it get bad!  There were 7 bills at our table and they added $7.00 on each bill for the WATER! The nerve! They didn't ask if we wanted bread, I'm surprised they didn't charge us for the bread too!  Or the Lemoncello for that matter Sorry but $150 for 2 including a bottle of wine and not a great experience.  I would not go back."}
{"text":"I went there with my husband for a Valentine's Day dinner. It is a small restaurant with a modern touch. We started with Carpaccio di Polpo (octopus salad) recommended by our waitress, it was a little too oily but tasted great. For the main we ordered Porchetta Fatta in Casa to share for two which is priced daily and was $75 that day. We were told it would take around 45 minutes to cook. It took well over an hour. Although the roast was delicious, the rest of the plate was cold by the time they brought it to us. It was very filling and we could not finish the entire meal. The servers were stylish, friendly and super attentive."}
{"text":"The dining experience here was a pleasant surprise.  Seated at the bar, I was able to watch the open kitchen and see the chef in action.  I am unfamiliar with a lot of Italian wines, but the friendly proprietor was able to proved a recommendation that was wonderful.   My date and I couldn't make up our mind as to what to try, so we again relied upon a recommendation from the waitress.  The meal was more of a journey through southern Italy.  Every course was a new and exciting adventure.     If you take one piece of advice, save room for desert.   I can't wait to return!"}
{"text":"It pains me to write this review, but as an honest Yelper, I call 'em as I see 'em. I've been here twice within the past month and had 2 very different experiences.   2nd visit: Came back on a Friday night, party of 5, with a reservation. I was excited to take my DC's here after my pretty good 1st visit. I was late, and 2 of my DC's arrived early. Apparently, they were asked to move tables, so they were given 2 glasses of white wine on the house. Nice. We were seated at the back, along the wall with the black, white and pink graffiti. I had a great view of the open kitchen (more on that later...).  We were disappointed that they were sold out of the suckling pig. However, I don't see that as a bad thing. It means that they get their meat very fresh and order in small quantities, and our server (the same server I had on the 1st visit, an older and very Italian gentleman with cool round glasses!) was quite apologetic.  Between us, we ordered: - Salumi board with mortadella, wild boar salame, and ragusano cheese. - Octopus carpaccio - Seared tuna encrusted with sesame seeds - Ricotta ravioli with fresh tomato sauce and toasted almonds - Pasta special - spaghetti with half a lobster in tomato sauce - Whole red snapper - Tiramisu - Chocolate souffle - Rasberry gelato  The dinner started off great. Our server was very jovial and attentive with water, etc. The place was packed and the atmosphere was fun and lively. Appetizers came quickly, and I especially enjoyed the mortadella. The octopus was also excellent.  Then things went bad. There was a super-long lag (almost an hour?) before our mains came out. Open kitchens are great, but it also allowed us to witness some drama between the staff. I don't know what happened. At first, it just looked like the kitchen staff were stressed out and overwhelmed, as the whole restaurant was full and they were obviously busy. On several occasions, I saw the chef, Roberto, help himself to wine at the bar and he kept drinking through the night. Suddenly, there was yelling (very brief, but loud enough to cause some awkwardness amongst diners) and the chef stormed out to the back of the restaurant, quickly followed by another guy (the manager? he didn't seem like one of the servers). I watched the rest of the kitchen staff look stressed as the chef was gone for a good 15 mins. or so.  The pasta dishes finally came out. I had the ravioli and quite enjoyed the mix of flavours and textures. Had a bite of the tuna, which was delicious. However, they really dropped the ball on the whole red snapper. I saw the fish get brought out of the oven and placed on a plate in parchment paper. I don't know why, but our poor server was left to debone the fish himself (standing at the bar, no less). The fish came out plopped haphazardly on the plate with a few random vegetables. Seriously, the 'plating' was not presentable at all for a reastaurant of this quality. He brought it to our table and clearly improvising, started drizzling olive oil (the same one we used for our bread) over it. [Later, one of my DC's mentioned that it was supposed to come with a sauce, which was missing. She had seen the fish dish at another table and those diners sent it back to the kitchen, which may have precipitated the drama... ]. But my DC's were too polite to complain or make a scene. We were here to celebrate and just wanted to make the most of the evening. The fish was bland and my polite DC's just asked for salt and pepper to give it some flavour. Maybe they wanted to send it back but were worried that we would have to wait another hour if we ordered something else, since the chef at that point was still gone.  The chef and that other guy returned and things were back in order in the kitchen eventually. By the time we ordered desserts and espressos, they were back in the zone. The tiramisu was spot on -- letting the simple freshness of the ingredients speak for itself. I tried the rasberry gelato which is made in-house. It was bursting with flavour. So, at least we ended on a high note. However, I found the kitchen staff's behaviour unprofessional and I only gave the server a huge tip because I felt bad for him having to deal with everything and the bad fish was not his fault. In hectic circumstances, he tried to smile and keep it together admirably. But charging full price ($60) for that fish was really unacceptable. Sending out an incomplete dish and hoping patrons don't notice is just wrong. While the kitchen drama was actually somewhat entertaining, it makes me not want to return, even though I had such a good 1st visit. Maialino Enoteca... when they're ON, they are great, but when they are OFF, watch out."}
{"text":"I was invited to a press dinner here and had more of the menu. Again, opinions are always my own and always honest.  From my first visit, the Fettucine Cinggiale, with wild boar ragu and truffle is still 5 star in my mind. Service, of course, was attentive and felt like home, as always. This time we ate:   (Favourites are starred).   To start:  olive and meat plate; cheese board with jam. If I had to choose, I would get the cheese board.   ***Parmigiana in Vetro - a layered parmigiano mousse with roasted eggplant puree and guegino tomato sauce and olive oil. It comes with a crostini and is served in a mason jar. This was one of my favourite dishes. I liked the layers of flavours and texture. Plus, that parmiagiano was FRESH.   I had the arancini again. This time there was a fancier presentation that came with it. Fig and buffala mozzarella were  accouterments and nice but honestly, I don't think it's worth $8. $6, yes, but not $8.   Ravioli alla Norma Eggplant-filled house-made ravioli, cherry pachino tomato sauce with aged baked Italian ricotta. This was good but not GREAT and not as filling as the fettuccine would be. I think this one hit the mark for a lot of us but it was still fresh. You're getting more bang for your buck with the fettucine by far.   ***Costole di Manzo al Nero D'Avolo  Slow-roasted short ribs, Nero D'Avolo wine sauce, with roasted shallots and potatoes.  This was DELICIOUS and definitely the winner of our meal that night. The rib was falling off the bone and had a maple syrup taste to it. You could tell a lot of care went into this dish and it showed. Bravo! Bravo! It's a bit pricey at $26 but definitely worth the splurge if you can afford it.   Flan di Cioccolato  7 Warm 70% chocolate cake served with salted caramel mousse and peperoncino I liked this dessert and I'm a sucker for chocolate, especially because it's all melted in the middle. Mmmmmmm.   ***BUT The Cannoli is what I couldn't stop coming back to. Do not leave a tray of cannoli out on the table or I will eat all of them! I had three. Chef Roberto whips sweet ricotta cheese flown in from Sicily.  The shell is crunchy and I like the sweetness factor. I don't know anyone else in Toronto who is doing the cannoli thing. Forget gifts for Christmas. Santa needs to bring me some cannoli! And the word \"cannoli\" is really fun to say five times fast.   DRINK: My favourite drink of the night was the 2010 Moscato d'Asti DOCG. I don't think you can get this at the LCBO. Anyways, it tastes like sparkling champagne and I could have easily drank the whole bottle (I think I almost did!).   OBLIGATORY CATCHY REMARK  Maialino means \"little pig,\" which is appropriate for what you'll do here. Buon' Appetito!"}
