{"text":"Great pizza, and the calzones are huge. Relaxed atmosphere; try the jukebox if you want to hear an old hit. Once, they forgot a topping on our order. They not only fixed the mistake, but they threw in a two liter just for our trouble. Also great for takeout or grabbing a slice at lunch time."}
{"text":"Maietta catered our party and they provided wonderfully delicious food at a great price.  The food was delivered promptly and it was an amazing treat.  I would use them again in a heartbeat."}
{"text":"We were wanting to order take-out one night and looked through our folder of coupons to pick a place. After being \"pizza'd out,\" we decided to try Miaetta's due to their $20 deal (wings, hoagie, fries and a soda).   The food was good. Nothing spectacular. The wings were sort of dainty, though I feel they compensated by giving us more than a dozen. The garlic parm sauce was also very light. They could have been a bit more generous. We ordered the Miaetta hoagie which was pretty much like a club. Once again, good but nothing to write home about. I could have made the same sandwich myself. Fries were standard. One thing to add - I found it strange that they only had four sodas to choose from: Pepsi, Mt. Dew, a generic juice and something else.   Considering this place is extremely close to us, I would stop back to try other things on the menu. According to the other reviews on Yelp, their gourmet Italian food is what they're known for. Now we know what to order next time. My boyfriend said the scene on the inside was very old fashioned and homey, so I'd love to check them out again but perhaps dining in rather than take-out. I love nothing more than a good 'ole mom and pops kitchen!"}
{"text":"Maietta restaurant catered my granddaughter's first birthday and I want nothing but the best at a good price.  Just what you get with Maietta.  Everyone raved about the chicken (with a hint of honey) and the marinated mushrooms.  Their customer service is also excellent.  Arrived on time and returned on time to pick up the equipment.  And I love that they are local.  Shop local..."}
{"text":"This place is right up the street. I have never been before, and at this point I never will again. I ordered take out. Lasagna, a child size gnocchi, and chicken and rice soup. I ordered these based on what I found online. Basically good reviews. The lasagna was 5 layers of noodles, meaning noodle on top of noodle, under the 5 layers of noodles..yes, just noodles, was a thin layer of ricotta and another noodle. Nothing between the layers of just noodles, not even sauce. On top was some cheese baked golden brown, deceiving. The menu states meat sauce, 2 little flecks of meat is what I am looking at. I took 2 bites, and I stopped eating it. I went back to the kitchen to check the rest, thinking maybe I just got the end piece and the filling fell out. No. Next I try the gnocchi, chewy is an understatement. They were also hard. Not to confuse the al dente of the lasagna. This dish had one tiny piece of meat visible in the sauce. Smaller than a grain of rice. I didn't even try the chicken and rice soup yet, as I was so disappointed. I have never returned food, or even complained. I was hungry, and disappointed. I just called the place, and the women who answered told me I really should have called last night when I ordered. I picked up at 840p-845p. They close at 10. I should have called last night, because she can't do anything for me now. I don't want you to do anything for me, I wanted to express my opinion (something I never do) on how this food is not even edible. I was told I could call tomorrow when the boss (who I believe may be the cook) is in, but she can't do anything for me. Again, I stated I didn't want anything. I was told no one else ever complained about the lasagna. I said, according to what I found online (however most reviews are older) that is exactly why I ordered it, as I was thinking the same. The women up front were nice last night, today on the phone wasn't exactly the same. I am unsure if she just thought I was trying to get my items for free, or what the case was. I am debating on even heating up the soup but, I guess I should at least give it a try."}
{"text":"Maietta can be hard to catch sight of along a road that bustles with commerce and trafficy, but one would be remissed in their foodie duties for whizzing by in ignorance for superlative Italian can be had here.   Due to inclement weather and some health-related family issues, my birthday observation had been delayed by almost a month. This weekend's snow had me trapped at my parent's place after a friend dropped me off there late the previous night once our concert let out and late-night eats were had.   After calling Maietta Restaurant, a place I'd been itching to try after I learned of its existence mere months ago (again, it's easy to miss), we assumed Dad and I would have to head over in his four-wheel drive white pickup truck to retrieve the food. Surprisingly and heroically, when they were told of our situation, the fine people at Maietta insisted on delivering dinner to us in Brookline, and deliver it on time they did.   The smorgasbord arrived 45 minutes later (as the person on the phone informed us it would be) and was still as hot as it would have been had it come straight from a kitchen window for dine-in.   Minimally-breaded flaps of fried oysters the size of tomato slices oozed with oceanic juice, putting far too many seafood eateries to rest.   A colossal, ideally baked potato steamed when broken with knife and fork.  A creamy cole slaw that managed to be sweet and tangy simultaneously was superior to anything scooped out of a local delicatessen case.   Gnocchi melted in our mouths with little chewing needed and was dressed with a vibrant, opulent, triumphant tomato sauce.   An eggplant parmesan served as a cookbook-perfect example of this Italian staple with its delicate texture, rich flavors, and generous amounts of cheese.   The lasagna, however, would upstage all else with its sublimely al dente pasta sheets, heavenly ricotta filling, and of course, that regal, blood-red, tomato sauce and mozzarella tandem that surely tops the kingliest of pizza pies.   A heartfelt thanks must go out to the fine people running Maietta Restaurant for making my belated natal day celebration special. Foodies may love their trends, but as a certain Huey Lewis and the News hit song from yesteryear declares, \"When they play their music, ooh that modern music, they like it with a lot of style, but it's still that same old back beat rhythm, that really really drives 'em wild!\"  They say the Heart of Down Home Cookin's still beatin', and from what I've eaten, I believe 'em."}
{"text":"The place is a little hole in the wall on Brownsville Rd. One of the few thriving businesses on that stretch, so I'm a fan for that reason alone. I can only attest to the pizza and say that it was alright, not very flavorful or robust. Could use some herbs in their pizza sauce or brush the dough with some garlic."}
{"text":"if i wanted to blow up a spot, this pizza place is in very limited company with Sam's Sun Sandwiches also on Brownsville road.  Extremely tasty pizza dough, the sauce is flavorful and portioned perfectly, the cheese is browned and balanced just like it oughtta be.  I have not had other menu items, so consider this review by the pizza only.  Great prices also,  Be sure and eat your pizza fresh, don't call in the order for delivery, or pick it up late.  Got to eat it fresh on the spot to really appreciate how good this is"}
