{"text":"Delicious sushi, very classy, slightly expensive (depending on the size of your belly), good for dates :)"}
{"text":"Best place for sushi in West Island hands down and probably among the better places of its kind in Montreal. Great sushi menu and their special appetizers are excellent. Try the corail de thon, pétoncles maison and the soleil maiko. Service is usually very good ell given how busy they get. Wait staff is knowledgable and friendly. The restaurant, especially since they renovated is beautiful."}
{"text":"I have been to many sushi places in this great food city of ours, this one is one of my fav sushi places. What they lack in service they more than make up for in food quality.  Beautifully prepared, very tasty, not inexpensive, but good sushi never is. Highly recommend either location, DDO or Outremont. Highly recommend these restaurants, no real bad food here"}
{"text":"Best sushi.  Impeccable service. Good price for quality.  Try kagiyagi sushi, Maiko salad with the incredible dressing, and of course hot sake.  I will recommend over a lot of restaurants.  I heard that they have small issues with take outs, but is ok."}
{"text":"One of the best sushi in Montreal, Maiko never disappoints. They offer great variety of very fresh sushi. Try the sushi pizza as an appetizer, it's fun and yummy! When I go to Maiko, I always enjoy a well chilled German Riesling with my friends or family, it complements the fish deliciously. The lights are dark, the decor is pretty, and trust me, your sushi craving will begin right here."}
{"text":"This was the first time that is was here. I really enjoyed the decor but it was a bit loud as it was very busy. Saying that, the sushi was amazing, the service was great also. I will definitely go back again to this restaurant for their sushi."}
{"text":"Best sushi in Montreal. Great atmosphere. Can get pricey with specialty rolls."}
{"text":"Awesome presentation of good food with excellent service. Somehow I had never been to this place before although it's in my neighbourhood. Will good one back again for sure."}
{"text":"I like this place. Younger crowd, cool atmosphere, has a wall waterfall. Good food and mikes drinks."}
{"text":"This place is fantastic! Service is great, sushi pieces are large, and they are delicious.  The price is not cheap but the quality and presentation make up for the slightly heftier price.  You can tell it is a favorite of the locals as the place is always full, no matter what day it is.  As always you can save a lot of money by going with the chef's special, but for me that is too much of a risk, I like what I like and don't want things that I may not enjoy.  In any case try this restaurant out, I don't think you will regret it."}
{"text":"Yuck! All you can eat sushi has way better quality. No problems with service it was friendly and helpful. Teriyaki too thin and nothing great not bad. Overall to expensive. If you want the same quality go to sushi shop - some sushi shops are better. I think people are fooled into thinking their food tastes good since presentation is nice and they give you warm wash clothes to wash your hands before the meal."}
{"text":"Maiko Sushi is my favourite sushi place in the west-island hands down! The atmosphere is lovely and modern. The sushi is super delicious and fresh. I love the new sushi additions to the menu. Keep up the delicious job!"}
{"text":"Maiko Sushi used to be one of our favourite spots to have modern sushi. The fish was fresh, the presentation inspired, the service between good and excellent, the ambiance welcoming, the servings perfectly sized.   But now, starting with an indifferent to obnoxious reception, continuing with an average to dispirited service, accompanied by an unenthusiastic presentation and just so-so quality of ingredients, we wonder why still so many people make this place crowded like a bus station on the weekends. Perhaps it is the lack of competition on the West Island!?   We won't be adding to the crowd anytime soon anymore, so feel free to take our table for 4 or 6! We'd rather drive into Montréal and give our business to Ichigo Ichie or, if we're in the Toronto area, to Yuzu No Hana."}
{"text":"I have been to this Maiko a couple of times, but I normally go to the one on Bernard. Maiko definitely makes the best sushi in town. I love the service, the food and the atmosphere. It's always fresh and I never had any complaints."}
{"text":"Their sushis are amazing. It's good for a dinner with friends or on a date. They offer good value meal with table d'hôtes. My favourite things on the menu are the sushis and the salmon teriyaki"}
{"text":"Preface: I only eat sushi nigiri and sashimi and consider myself a sushi enthusiast (it is my favorite food).   This was my third time eating at this restaurant. The first two times were great, and all of a sudden everything went to hell in a hand basket.   Let me summarize: 1) I had to ask 3 times to get a miso soup (not a big deal on its own) 2) food took over 45 minutes to come out from the point of us placing the order (apparently because the unagi needed to be cooked...hey, next time bring everything else out first and then the unagi later like every other sushi place does. Maybe that way our sushi won't be room temperature and taste off.) 3) the maguro (tuna) sushi tasted old and overly fishy to the point where my coworker, who loves tuna, had to spit it out into his napkin. I unfortunately swallowed my piece of tuna and now I'm feeling ill writing this review. 4) our waiter did not remove the tuna from our bill even though it cost $7 and our entire bill was $218. He claimed he spoke with his Mgmt and they refused to remove it from the bill. I'm pretty sure that is a lie as almost any manager knows you SHOULD remove something off the bill if someone has to literally spit out into their napkin because it tastes disgusting.  What makes me ultimately write this review is that Maiko did not care about whether we enjoyed our meals and would ever come back. It was the 3rd time I had eaten there in a month, and I was a huge fan. But instead here I am feeling nauseous in bed from that ****ing tuna, writing my first ever negative review.   Eat there with caution--it will either be great or you will literally leave angry and feeling ill."}
{"text":"Very very fresh and fast service. The place was packed for a Monday night, and for good reason. A little pricey but well worth it."}
{"text":"Excellent food, fish is always fresh! Amazing service. Great ambiance but music seems to be a little bit loud! Love their specialties! They are always packed so make sure you call and reserve in advanced! Thank you to Ty & Pat, the best waiters; Thuy, Chef Maiko & all of her team!"}
{"text":"Phenomenal sushi! I really have a hard time going anywhere else now. It's worth the $$$"}
{"text":"Cuisine japonaise par excellence avec de bonnes portions pour la table d'hôte. C'est l'endroit où j'ai mangé les meilleurs sushis et la meilleure soupe miso. C'est un \"apportez votre vin\" alors n'hésitez pas à y aller entre amis!"}
{"text":"There are four different Asian restaurants in this same strip center - one of them is another sushi restaurant behind this one.  I think this might be one of several locations - I am not sure because I do not live in Montreal. I work for a company who is headquartered in the area.  This place was fairly busy for a Tuesday night in the suburbs.  Decor was nice and service was excellent.  They refilled my water often and quickly accommodated our requests for more soy sauce and even what the weather was supposed to be for the next day.  What wasn't that good was the food.  I ate with two co-workers.  I split the $60 \"sushi pour deux\" with one of them and the other guy had a $27 sushi plate.  The $27 was supposed to yield 10 pieces; the $60 was supposed to be for 32 pieces.  I think the chef can't count, because we definitely didn't get 3x more than our coworker.  In addition, the assortment wasn't that spectacular: tuna and salmon sashimi, yellow-tail sushi and the rest of it was rolls.  The rolls were a lot of rice and nothing too memorable.    We had ice cream/sorbet dessert and it was the best part of the meal.  Balls of frozen Lychee, Mango and Raspberry artfully displayed."}
{"text":"The second time I've eaten here, although the first was for lunch. I found the choices to be very few compared to other sushi restaurants and the quality was lacking. I won't be returning here again."}
{"text":"Wow! I truly didn't believe we had this good sushi in the West Island. I had a fantastic meal with my wife and another couple. Incredible sushi, the photos don't do it justice. We also had a rib steak to share which was surprisingly delicious considering it's not a steakhouse. The tempura mushroom fries with the truffle mayo are to die for. Also tried a few specialties like the lobster sushi and a couple others, all delicious. Had multiple drinks, couple bottles of sake and lots of food for just under 300$, for the 4 of us, very fair. This one is solid, stop but without any hesitation!"}
{"text":"Holy shit this place is amazing.  I went here with a few of my cousins and one of their girlfriends and man, we ordered a ton of food. We must've ordered at least 10 different dishes and between the 4 of us, we tore it up.  This is a pretty classy modern spot so make sure you have enough money in the bank before you head on down here to grab an intimate dinner with your significant other or to get late night drinks.  I don't know where to start. The food, drinks, atmosphere, service, everything was awesome. I can't rave enough about this place. I'd go to Montréal just to eat here again.  The food come out in smaller portions so don't go expecting to order one dish be be satisfied. They come out artfully crafted and it's plated with much care and consideration. I felt like a food judge at a fancy restaurant.  From what I understand per my cousin who took us here, it gets really booked up so make sure you have reservations. And the night we went it was a random weekday night and it was already super crowded and it didn't let up even past closing time.  Service was great. The waiters and waitresses were super attentive and helpful with the menu and if they're not busy and if you're willing, they'll chat you up good.  Only thing is the location. It's in a strip mall so you wouldn't think of a place like this would be in this type of location, but it's there.  Btw, please don't be that couple of girlfriends that just order wine and appetizer then sit there for hours on end bitching about men, work, etc. because the tables are close and we could hear everything.  Parking: Big lot Price: 20+ per person Wait: Make reservations"}
{"text":"Nice deco. Friendly staff. We were 3 on a Tue. We had no reservations. Place filled up quickly. This is a premium sushi place with matching pricing. Excellent presentation and quick prep. They have an excellent wine selection. Plenty of parking in the mall. Quite popular with the locals. Reserve on the weekends. It's good very good but a little pricey for me."}
{"text":"Try the entre - Shrimp/Scallops and sweet potato - 'beignets des fruit de met\" - its almost a meal in itself.   all the sushi dishes are very well presented."}
{"text":"Great atmosphere, decent services, and OK Sushi. I've had better. If you are looking for the whole package and don't really care that there is better sushi elsewhere, go and have a great time at Maiko."}
{"text":"The restaurant has been offering great sushi and modern Japanese platers for several years now. For seafood lovers, I will definitely recommend the Maiko Scallops and the Volcano (imitation crab / tobiko)."}
{"text":"This place is as good as it gets for sushi. I've previously visited the Outremont location for dinner (which I heard closed) and that was an expensive yet delicious experience.  This time, I visited the West Island location for lunch. They have great lunch specials, that comes with a soup, salad and dessert.   I got the chef's sushi special (12 pieces of absolutely delicious sushis). The only thing is that the pieces are cut too big for me but I heard you can request that they cut them smaller.   The Maiko salad is excellent and the tiny scoop of vanilla ice cream served at the end made for an excellent meal. For $35 (taxes & tips included), I thought it was worth the price. The restaurant itself is very nice and the the service is great. Will be returning."}
{"text":"My favourite sushi in the West Island. Skip on all your can eat and come here instead. You pay a little more but the quality does not compare. Service is terrific and come here for many family birthdays. Perfect for special occasions or a delicious night out for dinner."}
{"text":"Love this place! Always fresh and delicious! Went here after work with friends and everyone enjoyed their food! Service was great even though the restaurant was busy as usual! Would definitely recommend if you're in the mood for sushi in the West island!!"}
{"text":"Great ambiance but quite slow service. We waited about 65 minutes for our sushi to finally arrive when the place wasn't even full on a weekday. Sushi & Sashimi combo isn't bad but not the best choice of fish."}
{"text":"I love Sushi, I would eat sushi 3-4 times a week and Maiko is my favorite location for Sushi. I have been to both locations west Island and Outremont. Both are very good, amazing service, different options and food is always fresh and just perfect. I highly recommend the specialties, forget the usual spicy salmon, tuna or Kamikaze, just go for their specialties."}
{"text":"Very good experience. Ambiance is lovely, clean and welcoming.  The sushi was delicious, fresh and good presentation.  It is on the expensive side but overall we were not disappointed."}
{"text":"Went for lunch with a few colleagues who had never been and the all loved the food.   The service is great and fast."}
{"text":"Regular customer there as I work close, its always full!! The sushi are delicious n the servers remember what you drink! Make sure u reserve, i didnt once on a Monday night n it was packed. Great ambiance too"}
{"text":"Voici un autre excellent resto à découvrir dans le West-Island. En gros : très bon service. Des makis et des sushis étonnants et uniques en leur genre. Le menu est inventif et proposes beaucoup de sushis qu'on ne trouvent pas ailleurs. L'établissement offre aussi des nouveautés à chaque mois. Belle carte des vins avec un choix correct et intéressant, tant au verre qu'à la bouteille. Le soir de notre dernière visite ici, un petit groupe de musiciens jouait  du jazz live. C'était tout simplement charmant.   Mes deux coups de cur : - le sushi Foie Gras. Il s'agit d'un morceau de foie gras poêlé et couché sur une pièce de riz tiède nappé d'une légère sauce douce.  - le dynamite. Un sushi servi chaud et complètement fris et servi avec une sauce très relevée.   En passant, depuis que je vis dans le West-Island, j'ai remarqué que plusieurs bons restos dans cette partie de l'île se cachent au fond d'un parking de centre d'achat et dont l'extérieur ne paie pas de mine. Le Maiko est un de ceux-là. Ne vous laissez pas décourager et allez-y. La surprise est à l'intérieure."}
{"text":"Français après   I mean to restore a little bit of justice with the average of really bad review they received. Do i personnally think it's worth 3 stars? Nah impossible. 4 is more honnest. The issue I have with reviews is one thing only: People tend to compare to the real thing but I never based it on that. 2 reasons: North American taste and market is by itselt a different sushi tradition. Based on that, the decor of that restaurant is really good. They offer generous portion with good consistency. As for Sauce comment on previous reviews, they are very alright and saved on THE SIDE!  They serve the typical sushi-bar stuff card and the service is great and quick. No complaint on that. The wine list is OK nothing to be wowed about but hey it's a sushi bar. So overall, 20-25 pieces there is A LOTTT. 30 pieces for 2 and we we're increadibly full. 150$ for 2 with one bottle of wine. Not the cheapest option but the portion on the generous side and the consistency of well done sushi meets any standard for what is considered in Montreal a good sushi bar. But I'm a white dude that haven't been in Asia or West Coast of North america (where asian food of all type is known to be up to asian standards).   Je dois restoré le tord fait à la côte de ce sushi bar qui pour moi souffre de mauvaises critiques pour 2 raisons: Les standards américains de nourriture asiatique sont généralement différent que ceux de la côte ouest nord-américaine et de l'Asie. Le fait est qu'a Montréal, on a souvent des puristes qui frappe fort en mettant des mauvaises notes sur les restaurant d'ici. Enfin le fait est que c'est un sushi bar avec des portions très généreuse et une bonne consistance dans la préparation. Je dois dire que le décor de l'extérieur déçoit et celui de l'intérieur est vraiment très bien (surtout pour un restaurant du west island de montréal). Je dois dire que normalement quand je sors dans un sushi-bar, je consomme 20-25 portions mais cette fois-ci, 30 portions à 2 c'était vraiment assez. La liste des vins est Ok mais sans plus, sans non plus être pathétique et le service est amical, rapide et pas du tout agressant. Enfin, le fait est que je ne peux croire que la clientèle locale ne mettra pas une bonne note pour cela car l'Ouest de Montréal est rempli de place qui sont vraiment bof et de franchises qui une fois de plus nous servent des trucs standards, voir ordinaire. Maiko sort du cadre et est très bien."}
{"text":"A hidden gem in the west. I was really surprised, I've always been convinced that to find the best sushi you had to be downtown. Boy was I wrong, I had a last minute craving for sushi so my husband and I decided to try this place. It was absolutely delish. We ordered 4 rolls from the menu then asked the chef to surprise us with two. Super fresh and literally a party in your mouth. 10000% going back and giving the chef complete choice of my next meal."}
{"text":"Always a great pleasure to eat sushi at this amazing place. Maiko sushi is top! Service is wonderful. Quality and Freshness of food are always top of the line. I fully suggest this place!!"}
{"text":"Come here whenever I want good sushi and want to leave satisfied and feeling good about myself. It is a little on the expensive side as far as sushi goes but the decore and the presentation make it worth it. You have to try the kageyagi... honestly I go there mainly for that... heaven... order 1 or two of them and I get my fix, don't really need anything nice. The menu has good variety, if you do not want sushi, there are plenty of other delicious options... like teriyaki or even fondue. Enjoy, you will not be disappointed... and don't forget the kageyagi"}
{"text":"ATMOSPHERE: The restaurant has a very nice modern interior. Everything is clean and the ambiance is very classy.  FOOD: The quality is excellent. All the plates are nicely displayed as well. The sushi is fresh and delicious. I would personally recommend the soft shell crab if you don't mind eating crustacean shells (although you barely notice it). It's delicious! Especially with the sauce it comes with. Their tempura is fantastic as well. It doesn't feel heavy with grease and makes the perfect light appetizer.   PRICE: This is definitely on the expensive side. Don't be surprised when your bill comes! However, it's good for date nights or special occasions.   SERVICE: Service is very good. They provide you with a warm wet napkin before your meal to ensure hygiene which is nice. The staff is super welcoming."}
{"text":"Love this place. Food is amazing.  I always end up getting the 'Maiko' dinner which includes:  Dashi miso soup Maïko salad Sushi or sashimi Tempura shrimps Sirloin steak teriyaki Steamed rice Dessert Japanese Green Tea  Can't wait to go back.  Granted their menu is a little on the pricey side but so worth it."}
{"text":"Don't be confused -- there are two Maiko Sushi restaurants on the Island of Montreal. This one is in the West Island, and the other is in Outremont.  This Maiko is the one I frequent regularly, so I'll review this one.  If you're a sushi connoisseur and are looking for a large variety of the freshest sushi in Montreal, this restaurant is superb! They have an extensive menu of all the classic sushi and sashimi options, as well as some more original and unique concepts. They also have a non-sushi Japanese menu, for those who don't like the idea of raw fish. Their chicken and steak teriyakis are quite delicious.  The ambience is very nice, and the staff is very friendly and accommodating.  A little bit on the pricier side --  I sometimes end up spending $80 - $100 just on myself (which includes a couple of vodkas on the rocks); but I am guilty of over-ordering because I love to have a large selection. Better to go in a group of 3 or 4 and order rolls to share, or just try to limit yourself to 15-20 pieces, not 30-40 like me!"}
{"text":"Had lunch special a couple of weeks back and was impressed.  Great value for the money.  Actually was impressed with the quality and quantity of lunch special.  I highly recommend."}
{"text":"While the food and decor were great, it definitely wasn't worth the price. Staff was not too friendly or helpful. There are better places for Japanese fusion in Montreal"}
