{"text":"Main Sushi is my go to sushi place in Markham; I've tried a few others but I always end up back at Main. Their food is good, I love the spicy chopped scallop sushi, and the bbq beef skewers are great. I always get a spicy tuna, spicy salmon, and dynamite roll and 9 times out of 10 it's delicious. Occasionally it's not quite right (I can't tell you why, just there's sometimes an after taste that's not great) but I think that's true of anywhere you may eat.   I cannot praise the staff enough, they are wonderful. Super friendly, and very fast. The lady who I think must run the place is great.  Honestly, I'll keep coming to Main because of the staff, they're that great.   The prices are reasonable for an a la carte sushi place and I always feel I've gotten my money's worth."}
{"text":"This is my favorite sushi restaurant! I have never been able to find better sushi than this (even as I've travelled)!!"}
{"text":"ALWAYS great service and the food is great.  We will not order from any other Markham Sushi restaurant."}
{"text":"We go weekly and perhaps as a result we are always greeted promptly and given fantastic quality fish.  I strongly recommend it, their sushi pizza is the best in GTA-- and we've eaten those all over."}
{"text":"Visited on Monday night. The restaurant was quiet, only 2 other tables. My wife ordered the Bento box dinner and I ordered the 16pcs sashimi boat. The bento box was average and my boat was a little above average considering we are in the Markham area. Will not likely come back."}
{"text":"I really enjoy the sushi here I have it for take out twice now and both times it's been great. I don't love the look of the inside of the restaurant but the sushi is delicious and the prices are good . Both times I have the avacado yam roll and loved it ."}
{"text":"The Diablo roll is a must try! Good food, relatively small, and sometimes smells a little fishy but overall, it's a good sushi restaurant!"}
{"text":"Main Sushi is located in a former Hungarian restaurant and they have done little to change the decor, but it's a nice sized room that looks very clean and bright and the welcome is warm. The menu is large and prices are competitive with other sushi restaurants in the area. Servings are also large and fresh - sushi pieces are generously sized and can be difficult to eat as a result.  Service is friendly and prompt, daily specials are unique. There are several dinners for two that a variety of plates to your taste - sushi, sashimi, etc. all in all a very pleasant experience."}
{"text":"Went here for lunch today and I am the only customer. Average sushi, nothing special, not much decor, doesn't feel like a Japanese restaurant. The spicy salmon handroll seem small and I don't think they are using the right rice for sushi, it looks like long grain to me."}
{"text":"Even though it's on a busy Main Street, Main Sushi has ample parking in the back.  The restaurant is larger than it looks from the outside, though for all its windows and doors (which all seem like the entrance) the actual entrance is all the way near the back.  The decor is an odd mixture of western style on the outside, asian style on the inside.  The staff are quite friendly, menu is in both English and Chinese.  Quality of food is average but is good for the price you pay.  For the price I expected the sashimi to be thinly sliced, but it turned out to be relatively meaty.  I've also tried the lobster sashimi which is alright.  In comparison, the quality of the sashimi is better than their specialty rolls.  I feel the rolls come apart when I try to pick it up - perhaps just the rolls I tried?  Overall I find this to be a decent spot for a family dinner - lots of options, spacious, and since it's not too busy you won't get kicked out right away after your meal."}
{"text":"Came here for lunch on a Sunday around noon and were the only ones in the restaurant. Both my friend and I ordered the bento box lunch special. The food was mediocre. I've had better... I like the location though because its on Main Street Markham so you can walk around and look at the little shops they have there. Price is good though, $10 for lunch."}
{"text":"3.5 stars. This is the same as recently closed Tsujki Village down the street. Same staff and food. See my review for the Tsujki. I recommend this place - the food is always fresh. Good rolls and Bento box combos. Service is always good. Better than your average AYCE sushi."}
{"text":"Sushi was average. Ordered a sushi party tray for two ($30) which we shared among 3 people, which included 44 pcs (sashimi, rolls and sushi). The rice didn't taste as fresh as I'd expect, and the raw fish was sliced very unevenly (mostly thin pieces, except for one hunk of tuna...they probably forgot to slice this one in half) which made it hard to appreciate the meatiness that I usually enjoy sashimi for. The sushi was fairly small, but the rolls were pretty good. Decor was kind of quaint and staff were friendly, making for a nice dining experience overall. Great for casual dining with friends."}
{"text":"Went on a Monday night and turn out to be the only customer. Staff was friendly but the food? I can only say mediocre at best. I ordered spicy salmon and bbq eel roll. They put too much rice on the spicy salmon roll. Also too much crispy crumbs. You can barely taste the fish. The bbq eel roll was ok. Also ordered green dragon roll. It's okay. The price is not cheap so you expect some quality. My usual sushi place OSAKA is closed on Monday so I decided to give it a try here. Hmm I  don't think I will come back again."}
{"text":"Ordered the bbq eel rice bowl. It's 15 dollars but I only get 6 pieces of eel that's pretty thin and too soft. Not worth the money! Doesn't have anything other than sauce rice and a little bit of eel. I don't understand how they got the good ratings. Be warned! They are over priced and food isn't good. My boy friend ordered beef teriyaki, he ordered medium rare. It's cold and drenched with sauce. It tastes like charcoal and there are pieces with a lot of chewy tendon. The quality is not there to match with the price."}
{"text":"Second visit  Came back for a second visit during lunch time on a Friday and the restaurant was pretty much empty. Initially, my parents would like to try their lunch special, but after seeing that the average price for a bento box is around $12(which includes 3 sushi, 6 maki, a bed of white rice, and salad), it seems like ordering a party tray ($32 for 44 peices of sushi, sashimi and maki) is a better deal for us and you get a more variety of fishes. The quality of the fish is not good. It was a lot worse than the very first experience with them. Also,  the 10% discount for paying in cash is no longer valid. I will probably not come back to this restaurant.   First visit Came here to get a party tray because my parents saw their ad, $30 for 38 pieces of sushi and rolls, with half pound of salmon sashimi (for free). We decided to give it a try since the promotion was very appealing. We were disappointed the moment we saw our party tray. They have only included 10 pieces of salmon sashimi, which I highly doubt that that's half a pound. Nonetheless, the quality of the sushi and rolls were no bad. The price of this party tray is still a steal. Just keep in mind that they are not really giving you half a pound of sashimi for free, it's more like it's already included in the price."}
{"text":"Ummm really not sure why this place got such good reviews. This was one of the worst Japanese food experiences ever! And it's not just because they aren't Japanese. The food was awful. My friend paid extra to have white chicken meat in his chicken teriyaki. Too bad we didn't take pics. It was a small bowl of hard, almost inedible rice topped with stir fried chicken that had the texture of freezer burn.   I had the udon. You don't want it. A boring bowl of noodles with zero flavor.   We left hungry. Should have gone to the burger joint."}
{"text":"Came here for dinner on a Sunday at 7.30 pm. As noted they have many doors and we pretty much tried everyone until we got to the correct one that opens near the back.   The good: We got the special buck a shuck oysters which was a good deal, the oysters were fresh and a good size. Also tried their Uni sushi special for the day - I was pleasantly surprised it didn't have a strong fishy taste and was sweet - again felt fresh. The grilled salmon belly was deliciously fatty and crispy and came out hot. The service was nice and they gave us extra soup and ice cream for no charge.  The ok: The salmon sashimi was what you expect. The hamachi fish sashimi was ok not amazing the fish could have been fattier. The grilled black cod was $10 for 2 pieces, the fish was soft but forgettable.  The not so great: We also got the mango tango roll ($8) it just felt kinda of blah - could have used a little more of everything. The salmon teriyaki set dinner came with miso soup, salad and ice cream. It was unimpressive with store bought sauce poured on top with a few pieces of grilled veggies.  For 3 people with a bottle of sake the bill came to $100 which was pricey for the type of food we had. The place isnt bad but I won't be coming back anytime soon."}
{"text":"6-7 years ago I used to go to Tsukiji Village. It was one of my fav spots for Japanese food in Markham. They moved down the street and changed their name: Main Sushi.  Last week I placed an order via Skip the Dishes. After my experience, they don't even warrant 1 star on here. The 1 star goes to the delivery being on time. Nothing else.  This is what i ordered:  3 orders/6 pieces of salmon sushi 1 order/2 pieces of white tuna sushi 2 orders/4 pieces of shrimp sushi  1 order of deep fried tofu - The texture was horrible! It wasn't crispy at all, and mushy. I tossed it out. Didn't help that they thought that 4 huge pieces should be shoved into a small styrofoam container WITH the container of tempura sauce. Which FYI wasn't closed and had spilled into the container making my tofu soggy & inedible because it was like eating pudding!  1 order/8 pieces of Lobster Dragon Roll - what a joke! Where is the lobster? Small shredded pieces on top mixed with spicy mayo. Avocado inside was over ripe and mushy and the shrimp tempura was cold after requesting it be made fresh.  1 order/8 pieces of Dragon Roll - same problem here where the avocado was mushy and overripe. Cold shrimp tempura.  Big huge problem for me was the packaging and presentation (after the disappointment of the taste)! Seriously? It looks like sushi i picked up at Garden Basket or Loblaw's - tastes worse though. And it cost $68!!! Ummm, no thanks, not ordering from them every again. The only reason i did was because i had $15 credit on my account. After seeing how everything was packaged, presented and tasted, this meal should've cost no more than $30. Total rip off!  No more sushi from them...next!"}
{"text":"Great sushi, and sashimi... octopus sunomono was great.. takoyaki was awesome, just about the same as in osaka japan... definitely will come back!"}
{"text":"Have been here 2 times, so its about time I write a review for this place. Not an AYCE place, therefore my expectations were slightly higher than the average AYCE. This is an A-OK place, nothing remarkable or exceptional. Price is higher obviously. Beef tataki, thick cut sliced. BBQ grilled squid, there was no teriyaki or bbq sauce on it.  We ordered the party tray including sashimi and sushi. The sushi pieces had a nice clean cut, no rice sticking out or anything. sashimi pieces were thicker than anticipated.   Service was slow because they didn't have enough servers. There was approximately 5-8 tables during dinner on a Monday evening with only 2 servers. So service was not attentive.  When we first arrived, had to ask for water, it wasn't serve without asking after sitting down for over 10 mins. Had to call server a few times because I guess they were not use to having 5-8 tables for an evening.  I had a Groupon which I used $60 value and it came off the total price. The weird thing was they literally told us to tip the original price of over $100...seriously, any regular groupon user knows that. Tips actually mean an add-on appreciation for servers being awesome, not a mandatory piece, that was a turn-off for me.   When the service and food and everything is awesome, I have tipped over 30%, so please be more appreciative..."}
{"text":"I'll have to give this place a 2/5 because the food was just... not that good... We ordered the 4 people dinner set and added grilled fishes, rice in broth and yakisoba in addition.  Nothing stood out much - but service was great.  Side note: It's so hard to find the entrance to the restaurant!! There's 10 \"doors\" around the place and every door just says \"Please use another door\" -  They should really specify where's the other door really is... lol several times, people came in saying that they went into Inspire Restaurant thinking it was this place... hahaha"}
{"text":"A clean and spacious place in old main street Markham. The sushi is reasonably priced. The quality is mediocre, but it fits with the price.  Staff is nice. They refilled our tea often and sang happy birthday when they brought out a cake i bought to celebrate my friend's birthday.   A good place to have a bday party as it fits a large group of people."}
{"text":"One of the best soft she'll crab we have had. Very lightly breaded also the salmon head was great value and great flavour salmon belly was also excellent. Salmon sashimi was excellent. Salmon sushi a little small and average presentation. Overall excellent value. Will come back."}
{"text":"Went there once. Would never return. Low grade sushi. Unfortunate that it's the only place on Main Street for sushi."}
{"text":"Excellent sushi spot in Markham. Came with my family and had a set meal for four. It cost about the same as if all four of us went for All You Can Eat sushi, but the quality of this meal was so much better. We even ended up having to pack some of it home.   The meal started off with a green salad and miso soup each. Pretty standard and nothing too noteworthy. Next came the sashimi platter (with lobster sashimi!) and maki rolls. The rolls are slightly better quality than a typical AYCE place, but nothing particularly spectacular. The sashimi was surprisingly fresh. The lobster sashimi was especially noteworthy. It was sweet, fresh, and had a springy texture. Next came the salmon belly. It was roasted to perfection. I rarely eat the skin because i find them to be slimy, but this skin here was deliciously crispy and I ate it all! The chicken skewers came next and were flavourful and well-roasted. The tempura platter came next. The shrimp tempura was beautifully crispy and well fried. The yam tempura, however, was a little soggy and disappointing. Next was a choice of protein, between lamp chops or steak. We chose the lamb and weren't disappointed. It was beautifully roasted to a medium rare. We paid an extra $5 for the lobster soup. There were big chunks of lobster and the soup was very flavourful. Pretty good for $5. The meal also came with pan fried udon, but we were too full and had to take it home. The meal ended with a dessert of mango yogurt. It was small, but everyone was so full at the end that we didn't mind. The mango sauce was bright and just the right amount of tart to cut through our indigestion.   All in all, an excellent meal and great value for money. Much better than AYCE and will definitely return!"}
{"text":"We've been regulars at this place since it was called Tsukiji Sushi.  The food is fresh, the service is warm and attentive and they notice when you start coming in regularly :) Most recently we had the baked oysters and they were delicious! They have a free parking lot around the back (like most of Markham, yay for Markham!) or you can park for free right on Markham Road.  It is spacious and pleasantly decorated, the prices are reasonable and they add new things to the menu to change it up once in a while. We have never had a problem at this restaurant with anything."}
{"text":"Came here for some dinner last night with my sister in law. I've been meaning to try this place for sometime now since I moved into this neighborhood! We ordered their party tray a and also a side of tempura.   The restaurant is quite big and they have lots of seating so good for large groups too. Lots of choices on the menu including teppanyaki, but I don't see actual tables so maybe it's cooked inside and brought out. They have some booth tables and regular tables as well. We sat in the booth so it was quite comfortable! Ambience is nice it's not too loud and we could talk easily without getting distracted by noise from the restaurant.  The tempura was quite good, freshly fried and light on batter. The party tray include a variety of sashimi, sushi and rolls. It was a lot of food for two people (42 pcs for $32) and the fish was quite fresh! We enjoyed the food and we definitely will consider coming back.  The waitress also told me for take out there is a 10% discount.. I do see myself coming here to order some takeout in the near future!"}
{"text":"We came here for Saturday lunch. When we walked in the restaurant, there were barely any customers. The server prompted us to a seat at the booth with our menus. We decided to order the lunch specials which were the Spicy Maki Set (spicy tempera tuna roll & spicy salmon roll) and Salmon Teriyaki Lunch Set.  The miso soup arrived in a timely manner. However, everything just went downhill from here. As more customers arrived, the staffs started to get disoriented. There were customers getting seated but they weren't given any menus. They end up leaving the restaurant because nobody served them.   We soon realized there were ONLY two front staffs operating this store. During this mini rush, they were only serving 6 tables and they were already struggling. Imagine all the tables were full there is no way they can run this restaurant with ONLY two staffs. However, we speculate one of the front staff was actually the chef. He would take an order then disappear in the back.    At this point, we were just too HANGRY! We waited over 30 minutes for our food. We felt like we were being ignored! :( None of the servers came to check on us because they were too busy serving orders out for the other tables. We finally waved down the waitress and asked about our food.    Spicy Maki Rolls: It tasted like takeout sushi, actually worse than takeout sushi. If I wanted takeout sushi I would go to a takeout sushi joint, not here. I found the tempera pieces in the spicy salmon roll were soggy and stale. The \"spicy\" rolls weren't even spicy at all!!! :(   The Salmon Teriyaki lunch set:  The portion size of the salmon was totally unacceptable. The salmon was small and VERY thinly sliced. Not only that but the salmon was overdone. It just became this dry piece of fish. The only saving grace for this dish was the teriyaki sauce. The presentation of salmon teriyaki lunch set was mediocre. They didn't use the space of the bento box properly. They could've easily switched the items up so it doesn't look like there was so much wasted space on this dish. Even better go find another plate to present this dish!   I'll not be returning to this restaurant. Both the food quality and service were unacceptable =.=\""}
{"text":"Got the $8.99 salmon tempura bento box with 5 pieces of sushi rolls, salad, miso soup, 2 pieces of spring rolls and white rice. This is a Chinese run Japanese restaurant. This is evident with the white rice that was served with the bento box. It was just plain Chinese white rice which I eat every day so I would know the difference. Japanese white rice is more sticky like the rice used to make sushi. Also had the uni aka sea urchin which didn't taste very fresh. Overall not too impressed. Nothing stood out about this place. Can get the same bento box anywhere else."}
{"text":"Great place for sushi. Love their spicy miso soup.  Small but cozy place to hang out!"}
{"text":"I have to say, that the service is great!! 5stars for service. Food is... good, wasn't bad. It just doesn't cure my craving for sushi.  I don't get it... sushi looks good!! but after having it, it just seems ok.  It does get busy around 7pm."}
{"text":"We decided to go and try this place last night. It was quite quiet (but it was 8 pm on New Year's Day). The staff were very friendly and explained the specials to us and gave us the time we needed to decide what we wanted to order. They brought us tea which was hot ( had to let it cool off a bit before drinking). We ordered the 32 piece of sashimi along with 2 rolls. The rolls came quickly and were delicious. The sashimi were of good size and fresh. The price is comparable to other sushi places. If you spend 25$ you get a card with a stamp and after 5 stamps you get a free dragon roll. My wife and I both enjoyed Main Sushi (food and friendliness of staff) and will certainly return."}
{"text":"I really like this place. The sushi is fresh and delicious. They deliver, this is the place we order from in Markham every time we have sushi. HIghly recommend ... try the mango tango :)"}
{"text":"We only came here as we had to hurry for the Paintlounge Yelp event. We arrived at 7:10 and got out at 7:30pm :) What a fast dinner thanks to their excellent service. When we got in we told them we had to leave super fast and they said as long as we got our order within 5 mins, it could be done especially since it was not a busy night.   We ordered the NY rolls, Spider rolls, Salmon Sushi Pizza & baked clam. My fav was probably the Salmon sushi pizza. It was one of the best we've ever had. The baked clam looked bigger in the photograph but it was very tasty. Yum! NY rolls were good with a little kick of spice (which I love). I thought I've had better Spider rolls before however. It was not worth the price.   I would definitely come back again esp for lunch."}
{"text":"Good here is tasty and well priced.  Always leave feeling well fed.  Always seems curious that it's not busier here but I guess that is why the service here is so good."}
{"text":"excellent service. They were closing at 10pm. It wasn't busy and they had begun cleaning. we arrived at 9:20. Even so, the service was top notch. Food was prepared fast and tasted great. Server told us to take our time and that there was no rush, but we felt bad anyways and ate quick.  Ordered the salmon lover dinner for 2. Came with 2x miso soups, 2x salads, 6pc salmon sushi, 4pc salmon sashimi, 6pc spicy salmon roll, 6pc salmon avocado roll, 8pc red dragon roll, 2x green tea pudding  server also told us about the watermelon and honeydew drinks that were on special so we ordered 1 of each.  again. everything tasted fresh. good quality ingredients. perfect amount of food for 2 people. the drinks were made with fresh fruit. i personally preferred the watermelon drink a bit more, but both were very good either way."}
{"text":"Main Sushi is located on Main Street Markham... this location used to be a Hungarian Restaurant...   Lunch Special Menu has the usual selections of Sushi, Sashimi and Teriyaki, starting from $6.99 which includes a soup and salad.  Sushi Lunch ($9.99) - The presentation is pleasing... one of the better ones I saw - Fish are quite fresh: Tuna, Salmon, Snapper and White Tuna - California Roll are done nicely too... - The only complain is the shari rice and the portion of rice... they all just taste a little heavy...  Overall a decent sushi joint if you are in the area...  Though the experience might not be really relaxing when the 2 wait staffs sharing gossips loudly in front of me... thanks for sharing!"}
{"text":"You get what you paid for. The prices seems to be decent but not sure where it actually stands in quality. I went there for take out of Party Tray A which includes sushi and sashimi for $32 which seems like a decent deal. But the food  didn't  seem up to par. The salmon sashimi  didn't seem to be that fresh however the salmon sushi seems a little better. The sushi rice was definitely off, it was lacking the rice vinegar so the rice tasted bland.   The good thing is that cash payment you get 10% off and there are more free parking at the back of the building."}
{"text":"Terrible place, terrible food, slow service, extremely slow cooking and serving.  Today is Father's Day and this sushi place has advertisements about \"you can get 10% off on lobsters if you book 1 day ahead\", looks like they are fully prepared for this Sunday.  We came here at 6pm, a lot of ppl coming in, everybody sitting and waiting, at 6:40pm after complaining we got bento box and ramen, not the appetizer! Waitress said I'm sorry but we are too busy with all these customers. 40 mins can't even bring some water boiled precooked edamame.  When we are almost full, here comes soup, edamame and sushi! Excuse me?  Look at the food, I seriously don't understand how such crappy food survived on main st?! Or ppl just don't have too many choices to go?"}
{"text":"I really like this place and I live reeeal close by! I've been here so many times now, including family dinner on my birthday :):):)  ----------Favourite cheapies (6 pieces): Tuna Sushi Roll $3.50  Salmon Sushi Roll $3.50 Spicy Salmon Roll $4.50  ----------Favourite served-in-a-bowl/plate: Cold Soba $5.99 (quite a big plate! Add soy sauce for more flavour) Mixed Seafood Udon $8.99 (I LOVE their soup udon!) Shrimp Scallop Fired Udon $12.99 (it smells amazing and reeally good)  I only order a few dishes here as you know how sushi dinners add up! But I walk out pretty full. Oh and the service is great!  Lunch bento box? Don't bother. Go with sushi rolls and udon! Sashimi boat? Always great :) Thick pieces too. Mango frozen yogurt!!!? I LOVE ITTTT!!! It's like plain pudding + mango sauce and I am in love!"}
