{"text":"price is fair, nice boss, food very trainditional Asia tast!"}
{"text":"It was ok. Small place not so clean but thats not so bad for me. My girlfriend didn't like the food,for me it was ok.nothing special but if you are around the corner give it a try."}
{"text":"That's what a summer night needs... Hot, steamy, boiling bowl of soup. What possessed us to order this was its description in the menu, \"Soup with various lamb organs.\" Tell me, who can say no to that?! As sketchy as it may sound, the soup was incredibly flavorful and aromatic from the bamboo shoots and coriander. What \"organs\" this soup comprised of will be kept a secret until you order it. The fried bits in the picture are the sweetbreads, the heavy flavors of offal was boiled out and the soup was not overly gamey, just enough to know you were eating lamb."}
{"text":"A hidden gem in the Concordia ghetto. The dining atmosphere at this restaurant is of a family owned business. The chef is fairly friendly. The service is fast and the food quality is good. They have excellent selections of noodles and barbecue. Their most popular appetizer is the Chinese Pulled Pork Sandwich; savory in taste and crunchy in texture. Although, the spicy noodles with beef and cucumbers were a little oily at times. You could kindly ask the chef to make it less greasy. I have had the great opportunity to dine here many times throughout the year and would definitely come back for more!"}
{"text":"Pour moi c'est le meilleur restaurent chinois de Montréal! Juste délicieux !!!! les plats qu'on mange ici, on trouve nulle part à Montréal. Une cuisine authentique du nord ouest de la Chine."}
{"text":"As a chinese?I must to say the youpo noodles are very traditional and delicious.I recommend that you can go and have a try. There are a lot of choices on the menu include the chinese pork burger?noodles?dumplings?the skewered meat and fish and the typical chinese cuisine."}
{"text":"Came in off the street with a couple of friends. We had the lamb with pita in soup. What a comforting bowl of loveliness! We also had spicy noodles with cucumber and pork which were perfect and the pork and green onion dumplings. The food was really great and we'll definitely be coming back for more greasy, comforting food."}
{"text":"Beef noodle soup was very bland and not well cooked 
Twice cooked pork ok
Totally empty on Saturday night minus the whole family of the owners 
Wouldn't recommend"}
{"text":"HORRIBLE PLACE. COLD FOOD wtf omg. 
I came here after a business conference. I felt like having lamb skewered and my friend showed me this restaurant near Guy metro. 
We ordered the lamb skewered, taiwan sausage, grilled squid and other small dishes.
Lamb skewered was big disappointment. It breaks my heart to see people sell these kind of things haha.
Cold, not well cooked, tasteless. 
The taiwan sausage was tiny and cold.
The \"grilled\" squid wasn't cooked enough. It had a suspicious gelatinous form. LOL 
We even had to ask them to cut it in half. Horrible service.
Washroom was disgusting. They had shampoo down there and no hand soap for some reason. 
That's sad. 
My friend told me they changed manager/ owner, which explains the horrible food quality.
Avoid at all cost.
We had a good time laughing at this hideous place."}
{"text":"Throughout my years of travel I discerned a pattern when it comes to Chinese food overseas (i.e. not China, its SARs or Taiwan) - it can be divided into several broad categories:

Fully acclimated ersatz joints - the places that serves you Americanized/Canadianized stuff like egg foo-young, chicken chow-mein, moo shu pork or Geneal Tso without an inkling of irony.  Think of the local corner Chinese take-out or Panda Express.  

Fusion joints that serve up a mutated form designed to appeal to hipsters - think Mission Chinese in SF or Nom Wah in NYC.  Overpriced and offering up fares that are whiteboy friendly but disguised with a vaneer of false authenticity.

Homesick Cantonese joints - found in the cores of old school Chinatowns.  Grimy and old, but with an old Cantonese chef who emigrated a long time ago.  Had to make do with local ingredients, but has heart with solid cooking.  Sai Gwan in Montreal and Mee Sum in NYC is like that.  

Joints from new Chinese immigrants - it could be targeting Nouveau Riche tourists in foreign lands (i.e. Beaubourg/Volta in Paris) or where they send their kids to overseas (i.e. Concordia University).  Typically by someone looking to cash in on the homesick or novelty factor.  This is where you see them make questionable menu items (lemon juice + hoisin + sprouts + rice vermicelli = Pad Thai) and sell them to the unsuspecting.   They tend to open mediocre fusion joints that combine mediocre Chinese, bad Japanese, crap Korean, godawful Thai along with bullion cube Vietnamese pho, all under one miserable roof.  Out of all categories this is arguably the worst in terms of quality or value.

Now that we got the Chinese restaurant styles identified, back to the story.  My lady and I wrapped up our day at the Musee d' Beaux Arts, and we got out of the museum especially peckish.  There's a middle eastern bakery nearby, but my wife was adamant about getting beef noodles.  Both of us are not in a mood to go back to Chinatown, there is a Habs game I have tickets for, and we were keen to stay in the area.  Mr. Yelp said this place has 4 stars (should've noticed the low review count and poor quality of write-ups).  My wife figured it was Northern (so is she, culturally speaking), so it should have decent dumplings and noodles...right?

Okay, starting with the dining area - dirty, dim, and in the back, boxes of jujubes stored on the side and newspapers strewn throughout.  Service is typically Chinese, that is cold, brusque, gimme your orders, here's your food, now pay up.  We ordered Liangpi, which is a salad made with mungbean jelly noodles, then boiled dumplings (jiaoji), hot soymilk (Northern staple beverage for cold days) and beef soup noodles.  

Let's start with the soymilk - it should taste fresh, clean, sweet and piping hot.  Imagine our surprise when it came to our table in a water glass rather than a soup bowl or a mug - my wife said she heard the microwave oven in the kitchen being used...briefly.  The result?  Not sweet whatsoever, and the lukewarm temp bought out sour off-notes.  The Liangpi came out - it was dressed in vinegar, flakes of sea salt and red chile-oil, but it does not have much in terms of flavor - not spicy, not salty, nothing discernable.  It was like a bowl of chewy thick-cut gel covered in sour orange oil with cucumber and tofu skin.  

Then the noodles arrived.  Here it's even worse...the noodles tastes limp, mushy and overdone, like it was soaked in the soup for hours.  As for the soup?  Diluted.  No flavor of soy, or savoriness, no hint of beefiness.  The same story goes for the beef - bland.  It felt like someone made a bowl of soup, dumped noodles directly from the boiler without draining, and left it on a counter until someone orders it, then it's warmed up using that same Microwave oven and served to unsuspecting customers...lukewarm.  The dumplings arrived last and were at least acceptable - the skins were thicker than expected but the elements are there...the fillings didn't have any off-taste and were rather serviceable - just pork and chives.  It was just mediocre all around.

So, what do I think of this place?  I think those other 15 reviews were written before the place changed owners/staff and the new guys were just \"winging it\" (i.e. new Chinese immigrant trying to squeeze as much money out before flipping it to someone else), the noodles places in Montreal are even worse than this crap, or they were written by people who just didn't know their Northern cooking  If you want better dumplings, just go to Mie Xiang Yuan (the place on St. Catherine West with the happy dumpling logo), and there are noodles/dumpling joints all over thiz neighborhood, and at least one has to be better.  I cannot think of a single redeeming feature that would lead me to return to this place whatsoever."}
{"text":"I fell in love with Shanxi cuisine on a visit to China and as far as I know, this is the only place in Montreal to find authentic Northern Chinese. The spicy noodles with cucumber and beef provide mouth-numbing delight with each bite, as does the sweet and spicy shredded potato. The pork and coriander burger served on flatbread is enough for a full meal, but why not make it even better with dumplings, meat skewers (squid with spicy cumin!), and more noodles. Don't let the lack of decor scare you off, this place is about good food and nothing more."}
{"text":"The dishes served here are mostly on Shanxi cuisine, a province in Northern China, a region famed for noodles and vinegar. It is a small hole in the wall place, with a few tables and a very barebone decor. The food, however, makes up for it. 

The food is nothing fancy, it's actually the closest thing to a hole in the wall menu. Me and my friend ordered lamb kebabs, some pork and chive gaozi, a bowl of spicy noodles with pork on top, and a stewed pork burger. 

The Lamb kebabs were not grilled on coals, but was delicious and well spiced nonetheless. The Gaozi were boiled, full of juices and goes well with the vinegar. the Noodles, doused with a bit of vinegar, was chewy, full of flavour and of textural contrast. The Stewed pork burger was full of fat, which gave it a great savoury taste, and had a decent contrast with the added cilantro. It needed chili oil tho.

Would go back if I'm near it. Stick to the noodles."}
{"text":"La Maison du Nord was the first place I hit up and it was fantastic. My go to spot back in the day for Northern Chinese food. Think this is the first spot that got me hooked!

Still looks as ghetto and shabby from the outside as I remember but they've done some upgrades. The menu has pictures and the plates are fancy (for Northern Chinese food). So much style going on, Mon was in plate heaven.

Sadly, there were only two of us so we had to settle on three dishes. Would have liked to try their cold noodles along with a couple other tempting dishes. Everything is SO cheap on the menu. Ridiculous.

- Spicy noodles (#10) ($6.99) - spicy noodles with cucumber, beef or pork. The noodles are hand pulled. Long, thin, they seem to go on endlessly. These noodles are seriously legit. Great toothsome bite. You even get a bit of that mouth numbing, tingling sensation. The price is just icing on the cake. So damn cheap and delicious.

- Pan fried lamb and green onion dumplings (#18) ($7.99 small) - a small gets you 10 dumplings. You can choose to get them boiled (cheaper - $6.49 for a small), steamed or pan fried. I like them pan fried as it's the tastiest. Plump, juicy, hot dumpling goodness. The small was more than enough.

- Green onion Chinese pancake (#48) ($2.99) - these aren't your ordinary green onion pancakes. Thick, crispy and delicious. They don't look like much but we couldn't stop eating them. Highly addictive. Bonus that they're not greasy.

Hole in the wall with great food, friendly service and dirt cheap prices. I'll be back again and again. Northern Chinese showcased at it's best."}
{"text":"Very authentic Chinese home made style food originally from North of China. The menu is very limited only few items to choose from not like the crazy long menus on other Chinese restos."}
{"text":"Hole in the wall Chinese cuisine? You bet I'm trying it. 

Maison du Nord may not be fancy, or shiny, but it is producing exceptionally tasty food at reasonable prices. Authentic, filling, and great. Still relatively unknown, and nestled away from the large cluster of Asian restaurants along St Catherine, this is worth the venture. Bring a friend, because you really should try and share more than a single dish.

While the food itself is simple, the flavour is great, and the portions are generous."}
{"text":"Fellow Yelpers, I am glad to announce: I HAVE FINALLY DISCOVERED A HIDDEN GEM. A hole in the wall. You know, the kind of place you want to believe in so much, but have half given up on. The HOGWARTS OF FOOD (am I pushing it?).

Sure, you could ask my mom what she thinks of the place: small, freezing, dubious, terrible washroom, servers are slow, speak neither French nor English, why do we see in the kitchen, are you sure it's clean, this TV's too loud, & hell why is it so empty?

But clearly my mom is missing the point, so you better ask me.

THIS PLACE IS FANTASTIC. From what I have seen in four visits there, it is still pretty much unknown outside the Asian community (& even then... the restaurant is small, but never full). I was referencing Hogwarts at the beginning, & there is a reason for it: what happens in this kitchen can only be described as magic. I have had the crystal & the egg-tomato noodles twice so far, plus the cucumber salad, and they were all impeccable, every time. The chunks of cucumber were deliciously fresh & crunchy, while the dressing was slightly acid, salty, & very spicy. I rarely crave vegetables, but I would go out of my way for this salad.

As for the noodles... Oh, these thick, smooth noodles... I'm scared I'm developing a new obsession. Seriously. I had them again yesterday, as a reward after an exam, & then I dreamt about it last night. The crystal noodles are served cold, thus excellent in summer, but what you need with the arriving of fall is the egg-tomato bowl. Piping hot, a little bit oily, but not greasy, covered with a delicately sweet tomato sauce & pieces of scrambled eggs - the epitome of vegetarian comfort. It is true the interior could benefit from the advice of a designer, but the walls are painted a pretty, warm yellow, & quite frankly... Who cares? The noodles, folks. They're all that matters."}
{"text":"Upon approaching this hole-in-the-wall I was pretty skeptical. There's a lot of so-so Chinese food in the Guy Concordia neighbourhood so I wasn't expecting anything wow-worthy.

As it turns out, the food here is fantastic. I highly recommend the glass noodles dish- it's listed as an app but you could definitely make a meal out of it. Very fresh and very tasty. As other reviewers have mentioned, the food is nothing fancy, but it's definitely worth while, affordable, abundant and delicious. And to their defence, I thought the plating was pretty and charming.

The decor reflects the simplicity of the menu and the service is particularly slow, but I'll definitely be back."}
