{"text":"Relaxing atmosphere, educational chalk based corn diagrams, and air conditioning... what more could you ask for? Well, add to all of that, that the food is delicious. Maizal is a recent addition to the Liberty Village area. They have vegan and gluten-free options in addition to non-vegan/veg ones.  The menu is short and simple. At the moment, the vegan options are: grilled quesadillas sin queso (ask for no cheese/dairy) with either poblano peppers or mushrooms, the sopes with black beans, tlacoyos (bean filled tortillas), and opales (cactus.) All very yummy sounding options. Their tortillas are entirely corn based (and gluten-free) and made fresh every morning. (they also happen to be delicious.)  Other things on the menu I should mention: the horchata. Traditionally milk-less, it's rice based at Maizal, with a cinnamon spice, and perfectly ice cold.   Outdoor patio space is out front on Jefferson, and small but decent. Interior space is ample, but I imagine it's going to be an area lunch time takeout place pleaser, a tasty, healthy meal for under ten dollars. If you sit in like we did, you can read about the history and cultivation of corn on the very aesthetically pleasing chalkboards (and no joke, it really is interesting.) And let me say it again: Air Conditioning.  We each ordered 2 grilled quesadillas sin-queso (no cheese.) We sat sipping on horchata's while we waited and enjoyed the corn diagrams. They arrived, with pico de gallo on shredded lettuce, and a side of refried beans.  One poblano pepper and one mushroom. One bite and I've decided these tortillas are made of tasty magic. That one bite was all tortilla, and it was so rich in maizey-flavour and texturally superior to nearly all other tortillas I've had up until now (so I eat a lot of tacos...)  The fillings for both were great, both hearty and satisfying with rich savory flavours. Add some of the pico and a touch of lettuce and it is perfection. The folks at Maizal are doing exciting things with food, and I'm looking forward to seeing more, and eating much more from them.  p.s. prices are reasonable."}
{"text":"I lived in Mexico City for five years and this is hands down the most authentic Mexican food I've had in Toronto. Their specialty is quesadillas made with fresh corn tortillas, made from ground corn, not maseca (which is a big deal). My favourite is the poblano with cheese and I also like the chicken pibil. The nopal ahogado (baked cactus) is delicious. They make traditional agua de horchata (sweet rice drink) and agua de jamaica (tart hibiscus flower drink) from scratch.   The owners Ivan and Gabriela are more than happy to explain the nixtamal process they use to grind the corn for their tortillas and occasionally hold workshops. They've developed relationships with local corn farmers to get the best product and have done the same with cocoa farmers in Chiapas, Mexico. Definitely try the hot chocolate btw!  I no longer live in the neighbourhood but every time I'm in the area I go to Maizal. It's like a little piece of Mexico City."}
{"text":"I've been to Maizal twice for lunch now and both visits were pleasant and enjoyable experiences.  From the service to the food to the atmosphere, everything about Maizal was great.   On this visit, I ate with a group of four people in total, and we split an order of the Guacamole and the Frijoles as appetizers. Both dishes were served in cups with a generous helping of fresh and crunchy tortilla chips on the side. I really enjoyed both dishes, but my favourite is the Frijoles. Try it!   For my main course, I went with the Meat Lovers quesadilla combo ($15), but I opted for two Tinga Beef quesadillas and one Picadillo quesadilla instead of the Chicken Pibil, which I had tried previously and didn't enjoy as much as the beef quesadillas.  The beef quesadillas are delicious and reasonably priced at $15 for 3. However, if you are hungry, you may want to order an appetizer as well.   If you are in the neighbourhood, stop by for lunch. They have a small patio out front with four tables and plenty of seating inside as well."}
{"text":"I went there today and I've been there a few times. I ordered a simple cheese quesadila only to find hair in it. When I got the quesadila back, I asked her if it was the same one... and it was the same one. I demanded for a new one, no apologies were made. When I went to pay for it... I was expected to pay full price... by the same waitress. Terrible- I'm never eating there again and don't recommend anyone else to."}
{"text":"Honestly some of the best Mexican I've had in a long time. I was initially turned off by the concept of quesadillas but they don't mess around here. They're unlike anything I've ever eaten. Will be back!"}
{"text":"My family and I love this place. For one the service there is always friendly and welcoming, and for me that's important anywhere I go. Secondly, you are paying for quality not quantity. The food here is deliriously good, you'll be wanting more, and although the portions are a bit smaller than what they serve at an American restaurant, you are paying for authenticity and it gives you a chance to order a variety on the menu. The prices are really affordable and the quality can't be beat."}
{"text":"Hands down, best quesadilla I've ever had.  I got the beef with cheese quesadilla with a side of guacamole.  The guac for 1.50$ could have been more generous.... but everything was deeelish.  Friendly service too."}
{"text":"Loved it. After travelling to Mexico and in the U.S. South I have been very disappointed in Toronto Mexican food.  When Sam told us they locally grow and grind their own corn we had to come.  Well worth the trip.  We had several different tacos and Quesadillas. All good. The guacamole was good. The beer was cold. I was happy.    I forgot to try the cactus. Next time!!! :)"}
{"text":"Full disclosure. I've only eaten here once. Today. It was spectacular.  The restaurant is tiny and pretty, and the staff were friendly and welcoming. I had the beef tinga quesadilla. Just one was enough for me, but I have a small appetite.   When my plate arrived it came with a small salad that tasted fresh and light. It took me right back to Oaxaca (maybe a decade or two ago) and the small, bright restaurants I ate in there. The quesadilla itself was a perfect mix of tinga and cheese, and the maize tortilla was absolutely fantastic.   If you want super delicious Mexican food without the blaring music and annoying hipster wait-staff, go to Maizal. You won't be sorry.  Just a small note regarding the listing above - they had margaritas as well as wine and beer.  Can't wait to go back."}
{"text":"This place is great. Small, but very cozy. We were here with 4 of us, and what a treat. Authentic food, with an inviting decor. The service was great and the food was delicious. I definitely recommend if you're looking for good eats in liberty village."}
{"text":"With the influx of Mexican food and taco joints in TO, I felt this place stayed closer to its roots. Great and unique menu options and decor. Guacamole and chips, all tacos were yummy. Unusual drinks. A place I would like to try again."}
{"text":"Amazing food. The tacos dorados are my favorite. The atmosphere is great and staff are super friendly and they remember their regulars (which is very nice and makes you feel appreciated).   Summer patio is a nice place for a warm day meal or drinks. Speaking of drinks wash everything down with the Negro Modelo beer - it's delicious with the food."}
{"text":"The service was quite friendly and the food is delicious. The menu is small but deliberate. Simple, fresh and authentic. Definitely worth the visit and one of the best options in the liberty village area."}
{"text":"I love this mom and pop shop! Found it on Google and decided to try it out with a girlfriend. The food took some time but with great conversation, it didn't bug me. Service was a bit slow since it was busy and there were two staff on. Food was amazing! Had the chorizo tacos and fish tacos. Loved the chorizo! Decor was so in tune with the restaurant. Washrooms were decorated with tile floors with a Latin touch and most importantly, CLEAN! Definitely coming back :)"}
{"text":"Oooooooh damn, schoolbus Russ back at it again with one of them slick reviews. Let's get it on.  *play \"Rica Y Apretadita - El General Con Anayca while reading this review*  Alright wussup y'all I just crept up in the game to inform you about this dope spot.  So I walk in, 3 deep. Clique full of real riders. We know what the deal is. Seating was limited, but very nice and intimate for your boy. Wussup Waitress, gimme them Cecina tacos. 3 of em (that's how many you get in one order). Lemme start with a margarita, cause ya boy hella thirsty from running game all day. I'll also get chips and guac because as always, I stick to my guns and keep it real (playa Del Carmen what up).  Them margaritas? To die for. Me and my hitta appreciated them. Well needed. Well salted. Them chips? Lemme tell you bout them chips. They were made with love, and were crunchy. You know ya boy appreciated them.  Them 3 tacos? Hold up. Lemme tell you, I ate 2 of them so fast I had a stomach ache. I had to lay out, I couldn't get bodied. In this economy? Nah fam. I finished the last taco and moved to my dessert. The brownie? I can't say nuttin about it. U gotta experience it yourself. Moneyyyyyyyy.  Alright yo. I'm writing to you from the table I will soon collect the check at. Payin my duckets folks. I hope you saucy, and keep it real. Pimp don't simp.  - Skoolbus Russ"}
{"text":"Super impressed with this place!! I am already planning on when to go back. Decor is beautiful, someone put a lot of thought and care into putting it together. Staff are super friendly and knowledgable. Food is quality and well thought out. The Frijoles black bean dip was to die for.. must get that, the guac was also great. The cactus salad was delicious.. loved the dressing they had on it. Also had the mushroom quesadilla, delicious flavour. The ingredients speak for themselves here no frills just quality ingredients, cooked well based on traditional ways of cooking. This restaurant is doing it right! Did I mention they grow their own corn and make fresh tortillas on the daily!?!"}
{"text":"Went for lunch and had some of the best tortillas I've had ... ever. Handmade from 100% ground corn and fresh to order to boot, it's what Mexican food should taste like. The establishment allows you to mix and match your quesadillas so you can choose two all meat, all veggie or one of each. I tried the highly recommended Chile Poblano quesadilla as well as the Tinga Beef. Both were deliciously spiced and came with a side of fantastic black beans and salad. Our table shared the black bean dip and guacamole; we decided the black bean dip was the definite winner though both were outstanding. Best part is I was introduced to Chocosol 5 Chili Bullet chocolate, and as a chocophile, it is amongst the best artisanal chocolate I've had. Spicy and dark without either being overpowering. Open for lunch and dinner, you should definitely check this place out."}
{"text":"Amazing food, and the owners such great people! It's been great to watch them flourish since they opened 2 (3?) years ago. The beef tinga quesadillas could be the only thing on the menu and I'd be fine with that because they are freaking awesome. Tacos dorados and guacamole are also excellent. I can't comment on anything else because I can never bring myself to order anything else because those three things are so yummy. However, my veg friends also like the food here, so the veggie options must be good too."}
{"text":"Wonderful Lil gem in Toronto's west side. I love mexican food... it's me absolute favorite.. they make everything in house... including the tortillas and quesadilla shells. The food is simple and tastes very authentic... without the ironic overcharge the core of the city will charge for the same meal! Cute decor and friendly staff! At the end do not forget to try the chili brownie hehehehe Oh and a little dorkish bonus... I love the fact that they support antibiotic free meat suppliers!"}
{"text":"I went to Maizal with a few friends and have not enough great things to say about it. My vegetarian pal was delighted with the options (Nopal- a cactus dish was outrageously good and the black bean with Oaxaca was unlike anything we have tasted). We carnivores were especially thrilled with the Beef Tinga. What makes this place stand out, however, is the wonderful staff. Friendly and welcoming. We look forward to spending much time at Maizal."}
{"text":"The food is fantastic - authentic Quesedillas and tacos made from scratch. Well worth the price. The only issue I have with this place is its odd hours of operation!"}
{"text":"Food - After trying mutiple dishes in multiple categories, it is clear that the food and beverages are kept authentic to the nationality. All dishes are all highly recommended! Specific dishes I would definitely go back for are: half quac half beans appetizer, fish taco and shrimp taco All dishes are well balanced with seasonings and ingredients.  Bit pricey but food quality makes up for it.  If I had to get critical, their drinks are rimmed with extremely potent salt (don't want to say table salt). It ruined the drinks that the salted rims came with.  Sangria is proper! Price, quality, and quantity wise.  TIP! Don't sit near the windows when inside. There seem to be fruit flies coming out of the pots that plants are planted in."}
{"text":"Overall experience: 8.5/10 Food: 8/10 Atmosphere: 7.5/10 Service: 8/10  Maizal is a great spot for a quick-ish lunch if you're in Liberty Village. The fare is authentic Mexican, specifically, quesadillas, where you'll choose from a good variety of fillings.   They have combos where you can try three quesadillas (and pick any variation of meat + veggie), each with a corn tortilla shell that is made fresh.   The mushroom quesadilla is to die for. I found the pork and the poblano pepper one a bit underwhelming.   THE BOTTOM LINE: good, authentic, Mexican quesadillas = an easy lunch choice."}
{"text":"We discovered this place by accident when we first moved to Liberty Village and this is definitely our favourite restaurant! Absolutely amazing food. We have tried almost everything on the menu and it has always tasted great.   Our personal favourite are the chorizo tacos and ground beef quesadillas. You have to also try the Negro Modelo beer.... my husband is not a beer drinker but loves this!"}
{"text":"For a place at liberty village its alright...  I recently started working in the area and I have yet to find my spot.. That being said, i went in when i saw a special that they have which was $11 for fish tacos... decided to try it  The tacos were decent but so small, made with corn flour. 3 tacos of these will not fill you up if your hungry, this is a snack meal and an expensive one for $13 after taxes. Although it comes with a tiny salad but it still not filling.  The service was quick and friendly, the girl told me how amazing the sauce was on fish tacos, but there was not much of it for me to rave about how delicious it was, and I ended up having to find somethings to eat at work to fill myself up :("}
{"text":"A hidden spot in Liberty Village that you'd totally miss unless you knew it was there. The ambiance is amazing and the food is great. While the portions look a little small on the plate, they fill you up. We had the three  quesadilla combo and it was a good amount of food. They could be a bit more generous with the teeny salad and beans on the side. Low cost items that were tasty but really only a mouthful. The service was the only thing a bit off with our experience. Lots of attention when we sat down but then a really long wait for food and a few orders from other tables brought to us by accident. All in all not a bad experience. Hopefully they can works out the small kinks and make this a really great spot."}
{"text":"Total let down. Ordered delivery from this place and everything was so lukewarm when it had arrived. Flavors were boring and so subtle. The bean dip was like play dough. What a shame especially because I live in the area and so I would love to support this place."}
{"text":"An excellent little hidden gem along the west border of Liberty Village. Authentic Mexican with homemade and handmade tortillas. The bean dip, guac, chicken, steak and el pastor tacos were all delicious. The place was quiet on a Saturday and seemed to do a lot of take out. Will definitely be back once the weather is consistent to take advantage of their patio."}
{"text":"We had the quesadillas and they were a bit mediocre. The cactus one was alright. Service was SLOW as f! They completely forgot about us. They should hire more servers if that's the case."}
{"text":"We stopped here after trying to find something to eat. I loved the interior and vibe of the place. I will say that I was unimpressed after I ordered the tostadas. I did not know that it was a cold dish. I also couldn't order what I wanted on it. I asked for peppers and onions on them... I was told no. So i tried it and didnt think it was the best.  Fast forward I decided to try something again I was just gonna leave. I ordered the tacos. I am not a fan of corn tortillas. These were ok and the chicken and vegetables were seasoned and cooked perfectly.   I had a pretty acceptable experience in the end."}
{"text":"My favorite place in Toronto. I love the orchatas, tortillas and the nachos. Everything there is pretty fresh, and their staff are great!"}
{"text":"I like how authentic and none pretentious this place is because I've been rolling my eyes at the influx of hipster \"mexican\" restaurants in the city lately and frankly none of them taste all that great.  Maizal's vibe is great. Bright, colorful and friendly. The menu is small and they have so many items that you would not see in most other \"mexican\" restaurants in Toronto. They grind their own corn and even make their own authentic desserts.  I have tried a few things on the menu and have always been happy with my choice.  The only thing I wish they could improve on is the soggy quesadilla. Somehow the juice from the mushroom or the cheese or whatever filling is in the quesadilla leaks out of the pocket and gets all over the shell. It's a soggy mess from time to time and the texture of course isn't fun when it's soggy."}
{"text":"A nice little spot with great food.   I've been here a number of times and tried most of the menu items as well as a few of the daily specials.  My personal fave so far is the Oaxaca cheese and cactus (yes, cactus) quesadilla.  The service is friendly and the decor is charming."}
{"text":"I have visited Maizal on each of my last three visits to Toronto. I love good corn tortillas, and these are exceptional. I usually order the tinga beef and chicken mole. This is definitely enough food for me, but I always wish I had a little more when I am finished.  The Jamaica (a sort of punch made with hibiscus leaves) is also really good, not too sweet, so the flavor is still interesting. On my last visit I bought some of their prepackaged tortillas to take home, and they were great. On a previous visit I also enjoyed some carne asada tacos. Solid place."}
{"text":"We were walking around liberty village and stumbled upon this little quaint place.   The menu is small but everything is so flavorful.   Worth the visit."}
{"text":"Warm and inviting owner and staff and terrific authentic Mexican food make for a great combination. I was a party of two and the owner made every effort to ensure we didn't have to wait long for a table. It was a busy night since there was a TFC game. That didn't affect service at all tho! We ordered an app of guacamole and chips. The guc tastes homemade. Large chunks of avocado and so fresh. Was very impressed. We were fortunate enough to sit near a couple who were regulars there and noticed what they ordered and inquired since it looked so good. What caught our eye was the chicken sopes. The couple said anything we ordered would be good since they've never been disappointed. I should add one of them was originally from Mexico so they know the real deal food.  We ended up ordering the chicken sopes and chicken tostadas. They came as a duo so we swapped one for one to share. Omg were they good. Nothing was left! The flavour was exceptional! Not to mention, the price point was excellent. I will definitely be back! Have to try the quesadillas :) If you like authentic, fresh food and friendly service, check it out. You won't leave disappointed!"}
{"text":"A little overpriced for the portion size, but pleasant atmosphere and tasty food. We had guacamole and bean dip with tortilla chips to start and 6 different quesadillas which were all tasty.  Service was fairly slow and we had trouble catching our waitresses' eye to get more water or the bill."}
{"text":"We've been to Maizal around 4 times and will be returning many more.  We think of this place as our secret little quesadilla cafe.  The food is so authentic and delicious and everything tastes homemade. The place is small but it makes it romantic and it has a lot of character.  We've tried different items each visit and have always left satisfied.  Try the rice drink if your lucky enough that they have some left."}
{"text":"The Chorizo Tacos and Guacamole were A-mazing, but the Sangria was just so-so."}
{"text":"3.5 stars.  I came here with some friends on a Thursday night. We originally sat out on the patio but there were too many bugs lol, so we moved inside. I ordered the meat lover and chose the fish, chicken and beef. I think out of those three, my favourite would have to be the fish and the chicken. The beef had this unique taste to it, maybe its the seasoning but I didn't like that one too much. This is very much an authentic taco's place, and you can sense that it's very \"homemade\". But this wouldn't be my first choice for tacos unfortunately."}
{"text":"Hit this place up after work one night, as I read it was opening and am a huge taco and quesadilla fan..  We sat outside on the small but cute patio on Jefferson, looking over to the little park.    There was one guy working inside (the owner, didn't get his name), but he was super nice and quick to come out with menus.  They don't have a liquor licence yet so we just had water.  FOOD: My bf ordered the beef tinga quesadilla and I think the chicken one.  I ordered the chicken tacos. We also ordered the beans and cheese dip. It came with home made nachos.  The food came rather quickly, and smelled delicious. We were really excited.  The beef tinga quesadilla was so awesome, and the chicken was delicious too.  The  chicken tacos are rolled up, not like your regular tacos. They had a beautiful salsa with shredded lettuce on top and creme fraiche I believe and we were brought a little dish of salsa verde.  I needed to cut into the tacos as they were covered and would have been too messy to pick up.  The food was delicious, hit the spot and was very fresh.  I can't say enough about the bean dip. It was SO tasty and seemed to have some sort of tomato sauce with cream and cheese mixed into it, so every bite you had a party in your mouth. It was perfectly spiced as well.. didn't need anything.   I am absolutely a fan and would definitely go back and try more options on the menu. The owner said the licence is should be coming any day now.    It's a cute little place, great atmosphere and I highly recommend giving it a try. Oh and they make their own corn tortillas which is WICKED. Check it out!"}
{"text":"Maizal is the ultimate gem. Its small but absolutely gorgeous inside, authentic food, tortillas made in house and so fresh and delicious. I am in love with this spot. The owner is super friendly, knowledgeable and welcoming.  the best Mexican food I've had anywhere, ever, including Mexico. Except for that one abuelita's tomales :)"}
{"text":"I read lots of reviews before going and maybe I just wanted to like it too much. But  I wasn't overwhelmed by it.  We had half beans and guac and beef tacos and cactus salad. The tacos were the winners in this. With some salsa they were tasty. I love guacamole and it was good but I'm not a fan of the really thick heavy chips even though I know they are homemade. The cactus salad is refreshing.  The texture is reminiscent of dill pickles without to fill taste. I want to like it more. It will need a second visit. But it's quaint and the people were friendly."}
{"text":"This adorable Mexican joint is the real deal! If you're bored of the trendy fish taco joints around town, try Maizal. They make their corn tortillas in house and they're delicious and hearty. I love the quesadillas and their mezcals are top notch. Excellent service too, always smiling and eager to please. I had the fish and pork quesadillas and can't wait to try the rest of the menu. 5 stars well deserved amigos!!"}
{"text":"It's a cute place.  Food wise it's ok but nothing spectacular to write about.    We had the quesadilla and tacos and pico de gallo to start.  The tortillas were good.    Decor is super cute.  Nice tapestry - make sure you take a visit to the bathrooms as the decor is really something to look at.  Staff is friendly.  Prices are pretty good.  The ambiance is nice.  Not loud so you can actually have a conversation. Could be a very good date place too!"}
{"text":"This place greatly surpassed my expectations and it could definitely hang in my neighborhood (East Los Angeles ~ 90022). The Cochinita Pibil and Tinga quesadillas were flavor packed and perfect, with amazing tortillas! The horchata had a generous amount of cinnamon and was unquestionably homemade. The Mole quesadilla was spicier than I expected, but my 11 year old daughter braved the heat to finish hers. It reminded me quite a bit of \"Guisados\" in LA, which I Iove!  I definitely recommend this place to anyone in Toronto that wants to taste actual legit Mexican flavors."}
{"text":"I don't really see the big fuss. I had an app code that made the \"Tacos Dorados Pollo\" $6.13 (down from $11.13) and even then it wasn't worth it. It was 3 small crispy fried tacos with some chicken inside. Barely tasted the lettuce or pico de gallo, and it was all fairly dry... and there was like a spoon full of black beans on the side. Woo.  The taste was fine but nothing spectacular, and if I had to pay full price for that? No thanks. It's an hour later and I'm already hungry again. That's supposed to be $11 worth of food? Yet another Liberty Village restaurant where the value is underwhelming.  If you like this place, cool. Personally I won't be returning."}
{"text":"Had the fish tacos on Friday and I knew they would be good.  What I didn't know that they would be some of the best fish tacos I've had in this city.  Batter and fish was light fresh and perfect amount crispy in it's texture.  The sauce was tangy with a nice kick and toppings were fresh and tasty with some pickled turnips.  The taco shell was in-between a soft and hard.  I believe they use a very traditional way of making corn shells and it shows visibily and in taste."}
{"text":"After reading the other reviews I had to put my 2 cents in.   I took 5 friends to Maizal this summer after hearing great things from people in the area. To say we were disappointed wouldnt start to explain how we felt.  We ordered a half dozen different things so everyone could get a taste of something different, except everything tasted exactly the same!  The corn tortillas were not fun to deal with as they crumble in your hands and i would only recommend them to someone who REQUIRED gluten free.  The sangria pitchers looked nice, but were quite watered down.  All 6 of us agreed we would not be returning. Its a shame, as we all love mexican and all live near by."}
{"text":"Finally crossed this place off my hit list, and it was indeed a hit. We stopped in on a Saturday evening and seemed to get in right before the rushes started arriving as we got a seat without any wait, but by the time we were leaving there was a line 3 parties deep waiting for tables. The restaurant is cutely decorated with a very harvest themed interior, which assumably correlates to their home made corn tortillas.  Drink menu has a nicer variety of tequilas and tequila based cocktails, in addition to a few beers on tap (Dos Equis and a couple of Mill Street brands) and a few brands of bottles and cans like Tecate and Negra Modelo, along with a small selection of wines and sangrias. The drinks were admittedly the least impressive part of the meal, but still adequate enough that they did not put a damper on our dining experience.  The food however is fantastic. We started with the spinach salad which had a nice flavour and wasn't as sweet as some of the ingredients listed made it sound it would be. Then we moved on to a variety of quesadillas, which really are the star of the show. The tortillas are delicious and most of what we tried were all excellent, ranking in our tables collective favourite order of: Poblano Pepper & Cheese, Tinga Beef & Cheese, Cactus & Cheese, Fish, and lastly Chicken Mole (the only thing that no one was really enthused about). They are also a good size so you can cut them in half for easier sharing.   The desserts weren't really too impressive, but not by any means disappointing, and at only $2 for a Dulce de Leche Cookie and $3.75 for a Chili Brownie (needed more chili spice) the price was perfectly appropriate and didn't take away from the fact that they weren't up to the high level of the rest of what we ate.   Bonus points for having the coolest bathroom decorating touch I've seen in a while, which is a vintage refrigerator door serving as the bathroom stall door.   So you may have read this review and see my lack of being impressed on the drinks and dessert front and ask how this could deserve a 5 star review? Well, it boils down to reflecting on the only authentic Mexican meal of this caliber that I've had recently was Los Colibris, which would have cost us twice the amount that the total bill came to for this delicious meal. With friendly and attentive service balancing, affordable pricing and tasty food, I can't help but give this place a 5 star review, even if it is a bit more on the generous side than I've been in past reviews."}
{"text":"This place is legit. Authentic decor, authentic food. I had the chorizo tacos and they were yummy. Definitely coming back again for more."}
{"text":"Great selection of quesadillas and other Mexican dishes, including funky drinks."}
{"text":"I love this place, the inside its small and cozy, I really like the decor. They have Mexican items in the menu that you won't find anywhere else like huitlacoche quesadillas or queso Oaxaca, I haven't been in a while because it's far from my area, but whenever I'm around this is a must. The owners are super super nice and always here."}
{"text":"This place has an amazing authentic feel. They make their tortillas from scratch and always taste fresh. Their quesadillas are a staple and they have both meat and vegetarian options. Highly recommend a beer and their guacamole or frijoles. This is one of those unsuspecting hidden gems with surprisingly affordable prices. Need to go here more. Full video reco here: https://youtu.be/_lUud494m0k"}
{"text":"This is the freshest, tastiest all gluten free Mexican food I've ever had in Toronto! We ordered from Just Eat and even though it wasn't hot anymore, it all tasted amazing. I look forward to going to the restaurant to eat sometime soon!"}
{"text":"I was lucky to have been invited to the Yelp event Taco Tuesday at Maizal where I had the opportunity to try some of Maizal's delicious creations. Maizal is a casual restaurant that serves real Mexican food! From tacos, burritos, tortilla chips with salsa and guacamole to churros and everything good made out of corn. Their tacos are delicious as I tried the pork, chicken, fried fish and baked beans tacos. The tortilla shells are freshly made everyday which makes a big difference in taste and texture. They also have drinks that are sweet and refreshing such as the horchata or tamarindo. To finish off the night, we got to try some churros and cake made out of corn. Both were tasty and satisfied the sweet tooth!"}
{"text":"Our favourite neighbourhood place in LV.  Pisco Sours are Amazzzing!  Staff are always smiling and welcoming.  As close to authentic as being on a holiday.   We feel like family even when it's been awhile since our last visit.  We've also been known to go here a couple times in a week, it is that good. Tortillas are incredible.  Chorizo dish almost can not be shared it is so mouthwateringly good!!"}
{"text":"I wanted to like the food But found it to be greasy. And very heavy even for corn tortillas. The portion were small but very  filling. I heard every race how authentic it was but j have travelled extensively in mexico but never seen food like this, tasty and flavourful but I think just not for me"}
{"text":"I now consider this one of my favorite Mexican restaurants in the city.  Located in Liberty Village, away from all the pubs and crowds of people is Maizal (Maiz= Corn).  Serving some traditional Mexican food in a cute, clean, warm environment, this place is popular with locals and those who know their food. Maizal can get busy especially peak times.  They've got a great selection of home made tacos, enchiladas, guacamole, salads, tortillas.  In addition to the portions which were sufficient, their prices are very reasonable.  As well, their staff are extremely warm and friendly and always open to providing recommendations if you're unsure.    Ordering a pint of DOS Equis, I chowed down on their Mixto Combo; Tortillas pork, beef and mushrooms served with salad and re-fried beans on the side. Presentation wise, the dishes were to my standards as was the taste.   Maizal is definitely my Toronto FC Pre-game place as they have other in-house specials I'd like to try come the next time.    Food 4.5/5 Service 4/5 Price 5/5 Overall 4/5"}
{"text":"There are like tons of taco shops around the city, but they all offer up fusion type tacos. This place, it's all about the home style.  I can't say I've been to Mexico, or know what Mexican home style is. But this place has the feel of a mom and pop, decor like that's not only looks like it's handmade, but also educational!  Their tortillas are all corn tortillas and they don't break apart. The Tacos Dorado are the hit here. I've never had this before, rolled chicken taco fried and then sauced up. It was delicious.  And I've never been a fan of quesadillas, but this one while doesn't hit you up with all the gooey-ness of what I'd say I see in a quesadilla, it's light, crispy and stays together with all the goodness inside. My favorite is the Mushroom Epazote, but the Conchita Pibil is also delicious.  There is pretty much only one waitress when I went. She wasn't overly helpful but she did the job. The food came swiftly. She made sure the water was topped up. Explained the two types of salsas.  I'd come back here in a heartbeat."}
{"text":"The chorizo's here are delicious. They're not too cheesy and just the right amount of spice. Ambience is nice also, very pleasant. I also had tried the avocado chicken tacos (Alambre) in an earlier visit but found that it was kinda average, nothing too special. Quesadilla's are good."}
{"text":"After about a month of eying up Maizal as a possible lunch spot in Liberty, I finally made the trip. They're best known for their quesadillas and authentic Mexican cuisine, so of course that's what I ordered up.   I got the fish and the steak for I think 8 or 9 dollars? (crazy reasonable) My order was rung up and sent to the kitchen immediately and came to $11 with tax.   They served it up in a simple to go box with a small salad and some black bean spread, both tasty and nice additions to the meal. The quesadillas were generously sized, fresh and full of flavour. Overall a super tasty lunch worth every penny, definitely not my last visit!"}
{"text":"Cute place, I wish we liked it more! We really wanted to like it a lot, but honestly Maizal is just ok. We started with the 1/2 guac 1/2 frijoles - the guac was very fresh, and we really liked the flavour of the frijoles. But the crema on top of the frijoles didn't taste right - it was very sour, perhaps past it's prime? We scraped it off. The accompanying chips were good, but they aren't made in house. We also ordered a range of quesadillas - both veggie and meaty options. Somehow I thought the quesadillas would be crispier than they were? They were more mushy. They make the tortillas in house, and they have a good flavour, but they are also rather thick and heavy - the overall effect was a heavy, mushy meal, which is just not the best feeling. I really liked the chicken mole, but the heavy tortilla actually took away from the spicy impact of the mole. Jamaica (hibiscus agua fresca) was fine, I've had better elsewhere. So overall, it's a cute place with nice people. The food is ok and there's sweet patio seating. It's worth checking out, and definitely a gem by the standards of this commercial, cheesy neighborhood - but if you are like me, you won't be in a hurry to return."}
{"text":"This is probably the best Mexican food in Toronto.  And I mean real Mexican , not texmex and other American twists and shouts.  And the reviewer spent a few months traveling through Mexico, so he has some idea. :)  The tortillas and fajitas here are THE REAL THING - CORN! No wheat! Nobody in mexico eats wheat tortillas except for some holidays. I come here often and usually have a selection of different tacos, enchilladas and quesadillas.  The meat inside is cooked slowly and amazingly - like in mexico - nothing is rushed, everything tastes right.  This is a great place for a date too, as the ambiance inside is awesome, mexican styled. The owner works at the cash register usually and she is from D.F. (where I spent some time) so we talked about how you can't find a decent Taco de Pastor outside of Mexico :)"}
{"text":"Really nice place. Apparently, they are the only place in Canada that makes tortillas and quesadillas the old fashioned way - grinding corn in a stone grinder on premises. Loved the food, the atmosphere and the service. Beware - it is quality over quantity. The portions aren't big. We had to order another helping. But it's fresh, organic, home made and tastes great. Definitely will be back."}
{"text":"Very sweet and quaint place. Super friendly staff and reasonable prices. Usually about $20 per person. It's pretty crazy that they grow their own corn and process it themselves. I love supporting local businesses and these guys get I think everything locally too. You can taste it in the food it's amazing! It's hard to find authentic tasting Mexican food but this place really hits close to home. The beef tingas are delicious it's my personal favorite. If you get the chance try the horchata too it's a refreshing rice drink that you're gonna remember."}
{"text":"Very authentic, I felt like I was eating at a home, not a restaurant. We called ahead to book a reservation, but they only take resos for groups of 4 or more. We arrived around 6:00 PM on a Friday for dinner and it was pretty empty, but by the time we left around 7:15 PM, it was full and no tables were available (seating is pretty limited). So if you're a group of 3 or less, perhaps be cognizant of the time you plan on coming here.  First, the parking. We couldn't find any lots in the area, so we parked right in front of the restaurant on Jefferson Ave, for $2.25 an hour.  Second, the ambiance. Quaint, with mood music, rustic but still super welcoming. Really casual, homey, and when it's packed, you feel like you're at a Mexican house party.   Third, the food. We ordered: a) guacamole and chips to start (a small for $6.00), b) the fish tacos special (around $11), c) two quesadillas (2 for $10.50), and d) the hibiscus juice to drink.   I have to say that I didn't like the guacamole at first bite. At first, it tasted plain, like it was missing something - until it hit me. It was missing the usual mishmash of random who-knows-what they normally throw into guac at other chain restaurants. At Maizal, this is the real, homestyle, genuine guacamole that could actually be quite good for you - so refreshing. It really grew on me and by the end, I was a fan. The tortillas are also wonderful - grainy, not starchy. According to their decor, they grind the corn for the tortillas EVERY morning (dedication!). The tinga beef was very soft, with a smoky aftertaste. The chicken mole was delicious, and the fish tacos were nice and crispy with mango and other toppings to make things interesting.  Don't come here expecting the over-the-top Mexican fare you might get at other restaurants - that bias was my initial mistake. Instead, realize that this is real, bona fide Mexican homestyle cooking - once you realize that they rely on authenticity over excessive novelty, you will truly appreciate it.  We did find portions a little small for the price, hence taking off a star. Our total with tax and tip was around $40."}
{"text":"Just wow. This is the best Mexican I've had in a looooong while, both in or out of Toronto. For those who've been to Chicago and are familiar with Rick Bayless' restos, this place is on that level. The key thing that sets this place apart is that they make their own tortillas. Yes, yes, everyone does that, you say? No, they MAKE their own tortillas. They grow their own freaking corn, nixtamalize and grind it, and then make dough and go to the press. It's a difference you can taste and see, and it's what makes this place truly excellent. I had the herbivore, which is the three veggie quesadillas on the menu - spinach, mushroom, and poblano. All were beyond delicious. Crunchy and flavourful, with just the right amount of cheese. Bliss. The guacamole and chips were out of this world, and the horchata was a nice sweet treat. I honestly can't wait to go back! Maizal - open a location in the Annex please!!!"}
{"text":"Very authentic Mexican food here! All the tacos I ordered had different types of meats in there and all we're very tender and flavoured just right! The flat bread was very fresh and looks to be hand made. Overall, for about $12 you get a pretty filling lunch! If you're looking for some REAL Mexican tacos, I would recommend this place. But be warned that this is not a place that gives you anything fancy. It's just a real, down to earth kinda place with authentic tacos!"}
{"text":"Visited for the second time yesterday for lunch -- and I can confidently say this is the real deal.  And the real deal is based on fabulous tortillas made with heritage corn that are out of sight.  On my first visit I had chorizo tacos; yesterday we shared a selection that included cactus tacos, cochinata pibil in a quesadilla, and a chicken mole quesadilla.  The last was one of the best moles I've ever had, dark and smoky with more than a hint of chocolate.  Friendly service and relaxed casual ambiance.  They deserve to thrive and do well!"}
{"text":"dainty west end spot vibrant orange, purp, olive corn husk ornaments  it's just so gorgeous like a cornucopia  in restaurant form  three fried fish tacos crisp, meaty tilapia plus the right toppings  colourful, simple tasty, not extravagant unique tortillas  worth coming back to mainly for the ambiance but also the food"}
{"text":"Another friendly recommendation. Really is a little ma' and pa' shop.   COOKIES ARE LITTLE PIECES OF HEAVEN!   Got the guacamole, which was fresh, bright and delicious. Chips were thicker cut and nice and crunchy.   The tacos were more the classic style where there are not a wide variety of toppings (meat, some greens and then some sauces) made with corn tortillas (delicious).   Service was great, she was very accommodating, water was always full and she let us try the Horchata before we ordered one (which are like subtle cinnamon hearts in flavour, fresh and light). The other drinks were good too!"}
{"text":"Sustainably sourced home-made corn tortillas are so tasty! They grind their own maize and owners are super friendly. I've been here several times and the food is excellent, atmosphere is laid back (unlike the pretentious pricey taco joints that have opened on Queen or College). I usually get the meat quesadilla combo. Beef Tinga is the best. Also the Tlacoyo with cactus and I really love their guacamole."}
{"text":"Very cool place that shoots for upscale and trendy.  Good prices, limited menu, smallish portions.  Great service & presentation.  Not the standard Mexican food I was expecting but it was really good.  A nice change, good place for a date or to meet friends.  Nice bar area and small dining area as well as small patio."}
{"text":"Absolutely delicious tacos, best guac I've ever had and nice decor. Highly recommend if you're looking for authentic Mexican food at a very reasonable price!!!"}
{"text":"Very friendly staff. Amazing food!! Best mexican food I've ever had! Would definitely go back any time."}
{"text":"A really amazing place to eat some great Mexican food. It is a nice cozy restaurant with character."}
{"text":"Wonderful little place: great decor, friendly staff, warm atmosphere, and, best, of all, food that is not only authentic but in some respects better than that found in the locale which it replicates (Southern Mexico). We also appreciated the ethical, environmental and/or local sourcing of the ingredients. Definitely going back!"}
{"text":"I'm a bit torn.  Maizal has been on my bookmarks for soo long, but it was either closed (for the entire month of February!) during my last visit OR I just don't find myself in Liberty Village.  After some showings in the area yesterday, I was happy that it was finally open, BUT as I wanted to go home & was by myself, I couldn't dine in.  :(  When I did eat 1 of my Alambra de Pollo taco ($13/3 smallish tacos), stuck in traffic, there was a pool of oil at the bottom of the takeout container.  Flavours were alright, although I probably wouldn't order these particular tacos again because I don't like green peppers and that flavour was quite prominent in this dish...grilled green peppers.  Since I was driving and eating, I didn't have a chance to use the sauce that was provided, but it needed SOMETHING.  Otherwise, flavours were on bland side.  I'd definitely *try* Maizal again, probably just for dine-in as opposed to take-out.  Interior atmosphere was nice and warm and a lot of the patrons were Spanish-speaking.  Tip:  Tacos aren't the best food to eat while driving."}
{"text":"Not very tasteful...I expect tacos to be flavourful. I asked for the hot sauce but even that was nowhere close to being hot and spicy. I ordered the Tacos Dorados (chicken) which was marked as one of the popular dishes but didn't really enjoy it. It was not bad, but nothing special either. Staff was friendly and they were clean and organized."}
{"text":"Hands down the best tacos in the city. Let's be honest, the taco revolution has you eating some really good, tasty and unique styles of tacos. If you're looking for an authentic Mexican taco experience, this is the only place in the city you'll find it. The tortilla is ground and made in house and is unlike any tortilla you will find unless you are in Mexico City. Doin' good. Doin' real good."}
{"text":"This place reminded me of some of the newer healthy restaurants in Mexico... still authentic and tasty but with healthier preparations than the old school way. The food was delicious and well priced and the service was friendly and attentive. The tortillas really were the best I've tasted in Canada."}
{"text":"Great food! Great Service! Kool cozy patio! Will def be a regular here!! Tacos  guacamole  quasadellias yummy!!"}
{"text":"This is real Mexican food, period.  Maizal honours its namesake by elevating the humble tortilla and masa to create really flavourful \"miracles\" on a plate.  No overpriced \"dapper\" chips and guacamole here, rather you'll find the best traditional Mexican food in town, with a more electrifying menu than hipsters places and tacos truly fit for a king.  Don't settle for 7, get all eight quesadillas and enjoy the true \"México lindo y querido\" on your trip around the world. And don't leave without ordering the \"café de olla\", it'll warm you up more than a \"rebozo\" on a cold winter's night."}
{"text":"Authentic Mexican food skillfully prepared. One of my favourite restaurants in Toronto.  Everything is made from scratch in-house, and they take great pride in their process, as they should. The corn tortillas are fantastic and will ruin flour tortillas for you for life. The chorizo-queso tacos are super tasty, along with the house chips, salsa, and guac.  Also, check out the men's bathroom stall if you can."}
{"text":"Best Mexican in King West and probably Toronto. I love the tostadas, aguas and alfajores de dulce de leche. Must go"}
{"text":"Was in the area and read the reviews on yelp, they didn't lie. Tasty tortilla shell, loved that the most. I had the tinga beef, very nice, great flavor. However, the Picadillo was by far my favorite. The beef seasoned nicely and the way the cheese melted in it, scrumptious. The little side of refried beans, dizzam."}
{"text":"Your review helps others learn about great local businesses.  Please don't review this business if you received a freebie for writing this review, or if you're connected in aI really enjoyed my lunch at Maizal. Menu is small, food is fresh and delicious. Maizal grinds their corn and prepares their tortillas in house  Highly recommended! Keep in mind that they close at 7pm and Monday's.ny way to the owner or employees."}
{"text":"Totally over rated. We picked this place after reading all the reviews and we're disappointed with the bland food and watery drinks. Margaritas tasted like juice and we're watery and we generally love margaritas so that was a downer. We ordered beef tinga quesadillas, beef tacos, chicken tacos and chirizo tacos and found the food very bland. The tortillas were flavourless and so were the salsas.   Service was fine but the food was completely sun par. Wouldn't come back :("}
{"text":"This family run restaurant is at one of the location @ liberty village. Quite place with great food and simple ambience. We tried 1/2 guacamole 1/2 frijoles Entradas. Tortilla chips were really great and crispy. Frijoles dip (beans cheese chipotle) was something different and loved a lot. In main course we ordered sopes & chile poblano, Mushroom Ezapote quesadilla. It's amazing to know that they use organic ingredients and are really fresh. There tortilla are out of the world and have never tried something like this. Would recommend this place to try home style Mexican food."}
{"text":"Quesadillas in freshly-made tortillas from freshly-ground corn are the focus. This is authentic home-cooking in a cozy relaxed atmosphere. They score points for working with local farmers to grow a specific type of corn. Top off your meal with the alfajores which aren't overly sweet. This place is a favourite standby."}
{"text":"Great food made by great people served in a great place! I'm glad I finally got to eat here before leaving Toronto. Don't sleep on this spot it is a gem among the liberty village food choices."}
{"text":"I had a lovely time here tonight at Maizal. The server was super nice and friendly and the patio was perfect for the beautiful weather.   We got the guac, frijoles and tortillas to start and it was delicious - the guac was made fresh and the frijoles were warm out of the oven with a cheesy top. I got the Chorizo Tacos which came with a side of black beans, a generous bowl of warm chorizo and cheese, and three corn tortillas. As another yelper said, you can definitely tell the corn tortillas were homemade and taste the corn too.   Will definitely come back to try the fish tacos which are only available on Fridays."}
{"text":"Finally got a chance to try this place after anxiously waiting for them to re-open after their February temporary closure. It's a very small restaurant and they don't take reservations for 2 people, and it was fully packed that night but luckily we got a table right as we got in. It's a very cozy restaurant and well decorated, with cultural drawings and descriptions all over. We started off with their tortilla's chips with guacamole. This consisted of blue corn chips that tasted homemade for sure. They were so good! The texture was firm, the taste of corn stood out, and they weren't greasy at all. My friend and I ended up getting the vegetarian quesadilla's. The way they make their quesadilla's are different from any other place, since their version is basically a larger version of a taco. I definitely prefer this version more as it allowed me to try different options rather than the typical quesadilla's which are so large that you can only order one kind. Also, this way there is more filling inside and less greasiness that would result from cooking it on a skillet. I chose 3 different types: roasted pepper, mushroom, and cactus. I chose to have the first 2 without cheese. This was served with a tiny amount of refried beans (which I wish was a larger serving size) and a small side of salad. My first bit literally got me speechless! The cactus one was amazing! Which may be due to the cheese. But the mushroom one, despite not even containing cheese was the best! I don't know how they made it so flavourful! But the highlight of it all was the tortilla. That fresh corn taste is unbeatable.  This is what you would call an authentic Mexican restaurant. There are no football sized burritos, hard taco shells, and foods doused in cheese!  After this experience I ended up back there the following weekend...it's pretty addictive! So far this would be the best Mexican restaurant I have ever been to. Worth going for sure!"}
{"text":"This is one of the better Mexican places that I've tried. It boasts a nice list of appetizers, drinks (non-alcoholic and alcoholic), quesadillas, and other daily specials. This place might be appreciated by those with dietary restrictions since it has an equal selection of meat quesadillas and veggie ones.  Moreover, they use gluten-free tortillas that are derived from corn.  They taste exceptional, aren't flimsy, and give the food a wholesome taste.  You're also less prone to making a mess when you gobble it up.  Service was exceptional when we came for a late lunch on a weekday. The chicken fajitas were the special and had a subtle flavour.  It was enhanced by the sauces she brought out for us.  Tasted homey and delicious. I also ordered 2 quesadillas - both meat.  They didn't look like the sandwiched ones from other places  I got Tinga beef and Chicken Pibil.  The beef was well-prepared, but I wasn't a fan of the after-taste.  The Chicken Pibil was amazing!  The chicken was so flavourful.  It was also inexpensive - 2 quesadillas for $10 and so filling! Also drank horchata which was very refreshing.  It was made with rice and tasted a lot like an iced chai tea.  To top it all off, it's such a beautiful quaint place with amazing decor.  The walls are lined with chalk images of how they make Mexican food.  Moreover, the women's washroom is beautiful - be sure to check it out!"}
{"text":"Some of the best Mexican food I have eaten in the city. The guacamole, the tacos, and the quesidillas(?) are outstanding and as authentic as you can get in Toronto.  It loses one star because a third of the time that I've gone there, it's been closed. I just don't have flow with their timing, man."}
{"text":"A few friends and I were contemplating an impromptu dinner and were feeling like some Mexican food. Being new the area we figured would try somewhere different from our usual spots. The restaurant itself is cute. Cozy interior and friendly staff. This is where the things I liked about it pretty much end.  The menu itself was quite limited. Between the 5 of us we ended up trying all the veggie casadillas options as well as the sopes and the chorizo, chicken, and pulled pork tacos.   The sopes were by far my favourite part of the meal. Also the cheapest item.  The casadillas were OK not bad but also not good-lacking in flavour and ultimately disappointing. The chorizo was a congealed mass of chorizo and cheese, again lacking in the expected flavour of a caso fondido type of dish.  I also ordered a margarita , which allegedly had 2.5 oz of alcohol in it. Unfortunately however I was unable to taste even a whisper of tequila peaking through the watery juice concoction I was served in its place.  If I had to sum up this dining experience in a word it would be lacklustre. When I left the restaurant I could say with confidence that I could have done better cooking with the random assortment of ingredients currently available in my fridge. Would not recommend."}
{"text":"I came across this restaurant when 3 friends and I were looking for food in Liberty Village. It is located in a quiet neighbourhood.   The place has a very Mexican vibe the moment you walk in. It has a small patio which makes for enjoying the summer that much better.  The server has a tremendous amount of experience and passion with tacos - when recounting the ingredients of the special of the day (happened to be fish tacos) - he closed his eyes and you can see him imagine the flavours. The dedication to great tacos at this joint is something special.   I had the Cecina tacos and they were delicious! The tacos were very soft and blended the taste of the caramelized onions with the steak. The steak was juicy and the a pleasure for the taste buds.   Be prepared - when dining in at the restaurant, you are there for a relaxed meal with no rushing. In and out financial district foodies - slow down, put down your phone, and relax."}
{"text":"The corn tortillas are indeed fabulous. The frijoles as well. The meats are very greasy. However, we sat for 45 minutes without even getting our drinks. Everything we asked for we had to remind our \"server\" at least once, sometimes three times. Absolutely horrific service.  Worst I've experienced in memory."}
{"text":"You don't know Mexican until you've eaten here, (unless you're Mexican of course). Try the poblano, just the right amount of spice with great taste!"}
