{"text":"Great burritos. Delicious tortas. The fajitas are amazing. I really love their tortillas--I think they make them in house. Torticas will always have a special place in my heart but Maize is where I get food when my parents are in town. Also really love the salsa here."}
{"text":"Best addition to Chambana Mexican food life! They need to find a bigger place to accommodate the demand that I anticipate."}
{"text":"Portions are a bit small and prices a little high for a no-frills restaurant.  The carne asada burrito I had was perfectly fine though the steak chunks were small, slightly bland, and few and far between lettuce galore. I'm not sure if there was any kind of rice or pinto or black beans in the burrito. There was, however, a generous amount of sour cream, which I quite liked.  We shared guacamole as a starter. It was a bit mild but still nice and seemed to be made with natural ingredients.   Complimentary chips and salsa are always welcome. The chips are wonderful here."}
{"text":"I've never been here but I've had a dream I was here. In this dream...I was new. I was young. But I was also dead. Always say I love you to those who are closest to you - or else you'll regret it.  2 Stars."}
{"text":"Best Mexican food in town. Very authentic. The steak tacos are amazing.  I recommend this place to anyone."}
{"text":"I don't understand why everyone is ranting and raving about this place. I went solely because of all the fantastic reviews, but I was incredibly disappointed! Is it absolutely terrible? No. Is it the best Mexican food out there? Not even close.  My first time here I ordered 2 carne asada tacos and 1 chicken taco. When I unwrapped my food, I was disappointed to see 3 puney little tacos. They look like tacos you'd order off of some sort of kids meal. Not only were these tacos small but they were dripping in grease! I love my greasy, unhealthy foods as much as the next guy, but these tacos made me feel absolutely disgusting and sick afterwards just from all the grease. It wasn't even worth it because these were the most bland tacos I've ever had. Probably one of the most bland things I've ever tasted period!  I don't understand how meat can be that bland. Even unseasoned meat isn't that flavorless..  I've given this place another try because of all the good reviews. Although the food I ordered on the 2nd and 3rd time had more flavor and were a more acceptable portion size, it had even more grease. My boyfriend couldn't stomach them either. We ended up just throwing the food out.."}
{"text":"My absolute favorite Mexican restaurant in the Champaign-Urbana area (and perhaps of all-time). The ingredients of every entree are fantastically fresh, the food is very quickly served, and the service is fantastic. The menu is extremely simple to navigate, and the ladies who work the register are very kind and helpful. On most days, I eat the veggie burrito here, and I'm always elated to eat it. It's cheaper than Chipotle, and that much tastier!  Do note that the restaurant is extremely small, so seating may be tough to find at peak hours, but it is 100% always worth the wait.  I made it a point to go to this restaurant weekly instead of attending one of my lectures. That was one of the best decisions of my life."}
{"text":"Super awesome, will definitely come back. We both agree this is some of the best Mexican food we have ever had. We got the chicken burrito and chicken chalupas, both were so tasty! We raved about the chips the entire time we were there. They are served with a trio of lime wedges and two different salsas. Ingredients are super fresh, and definitely made to order. Looking forward to the new location with a slightly expanded menu."}
{"text":"Delicious, dirt cheap, and authentic. Very spicy sauces and salsas are delicious"}
{"text":"Maize is just ok. I heard about its feature on Food Network and decided to give it a try. The dining experience is laid back but only if you manage to get a seat. And the food is mediocre at best. I usually get the Torta Ahogada, which is a hit or miss. They really need to work on consistency. Nowadays, I just wait until a trip to Chicago to fulfill my Mexican food cravings."}
{"text":"Great food, at excellent prices. The fish and veggie tacos are wonderful."}
{"text":"I discovered this place a little over a year ago.  I visit champaign for business and I probably eat here more Than locals.  It's hands down my favorite Mexican restaurant in the United States   If you are lucky enough to be within driving distance you should definitely try it out.  Order anything pastor (pork).  I also love the salsa and chips.   I would invest in a location in St. Louis. That's how much I love the place and I believe restaurants are typically a risky investment"}
{"text":"Okay, my credentials: I lived in LA for 5 years, which has probably the best Mexican food in America.  My favorite taco place is Tacos El Gordo in San Diego, which has 559 (559!) yelp reviews and 4.5 stars; I raved about that place 3 years ago before it blew up. I like lengua, sesos, suadero, barbacoa, al pastor, asada, tripas, carnitas, and buche. I like tacos with pickled radishes and carrots served from trucks parked under LA overpasses late at night.  Maize Mexican Grill is seriously legit. Hand rollled tortillas. Huitlacoche. Huaraches. Rib-eye tacos! The fish quesadilla is incredible: it's a hand rolled tortilla filled with cheese and fish, perfectly deep fried with a delicate crispy outside, a soft doughy tortilla inside.  The atmosphere is awesome, too. At once bright and airy, and cozy too. Sit at the counter and you can't help but talk with Armando, the owner, and your fellow diners about the food coming out. It's more of a foodie community than just a restaurant.  Pro-tip: if you have the time, when you get to order tell Armando that you're in his hands and you'll have whatever he decides to send out. Sit at the counter an be ready to be very happy and very full."}
{"text":"BEST TACO PLACE ON CAMPUS. If they delivered, it would probably be the greatest thing to happen to the UIUC area.  But in all seriousness, their meat is great, the tacos are always very well filled, and it comes with free chips."}
{"text":"Maize or what I like to call (Mah-eez) is phenomenal. Good quality, good quantity, good prices, and good service. I use to eat here numerous times a week because of those factors. Honestly, I was not disappointed by a single thing on the menu. If you're hungry, go burrito. If you're low on cash, go quesadilla. If you're looking for something new, go tostadas. One suggestion I would make would be to go at off hours because the line can be quite long."}
{"text":"Absolutely love maize! Their food is delicious! I only wish they had a slightly bigger place- the seating is really crammed. I also wish they delivered. I've always tried some of the non-alcoholic drinks that they keep and they're all worth a shot."}
{"text":"College spot; the menu is not Taco Bell, so if your Spanish is limited (like mine) you better ask questions!"}
{"text":"Best and most authentic Mexican in C-U, some of the best Mexican I've ever had, period. (I love RIck Bayless's places in Chicago, I think he'd approve!)   Love the Tlacoyo, sopes, and quesadillas. Tortillas are freshly made, with masa, not the prepackaged factory made ones. This is almost impossible to find these days, even in Mexico! CU is lucky!  Guac is good.. Queso fundido is fantastic. When asked grilled or fried, ask for fried. Trust me.  Cons: very small, always packed, only counter top/bar stool seating, which is hard if you have kids or want to go with a group."}
{"text":"The food is excellent and authentic.  The issue here is the limited amount of seating and parking."}
{"text":"Great little (and I do mean LITTLE) place in Champaign! I ordered quickly because they were so busy and many people waiting behind me. I wish I would have had more time to peruse the menu. There are about 10 seats in the entire place, so it's better for take out. I had tacos that were great."}
{"text":"Awesome for eat in, and mostly for take out too. Fast, cheap and friendly. When will they open in downtown champaign?"}
{"text":"This place used to be great. Last time I ate there i got a couple burritos, pork and steak.The pork was so greasy that the tortilla was soaked in it and the foil had grease dripping from it. The steak had so much lettuce in it that is all you could taste. So I took alot out to find they hardly put any meat in it. And the reason I will not go back is because after taking a bite of the steak burrito, there was a very long black hair in it.  I have short blonde hair. too bad they are letting this place go."}
{"text":"THE BEST! I've never had a bad meal at Maize. My favorites would have to be their guacamole, chips and salsa, chicken burrito, nachos, and gordita chicharron. Their tacos mexica with melted cheese are also yummy. You really can't go wrong here. While there isn't much seating, their service is fast and seats turn over quickly if you want to wait and eat in. We get take-out 50% of the time and have always found the quality just as good as if we eat in. Try it, you won't be disappointed!"}
{"text":"I have ordered carry out many times before but this was my first time dining in.  Even though it was crowded and busy, our food was prompt.  I went with my mom and we both loved the food.  The complimentary chips and salsa were the best - especially with the side order of rice and beans! One of the few things I will miss about Champaign-Urbana."}
{"text":"It is pretty good for Mexican food in Chambana. The guac leaves a bit to be desired, which is why the 4 stars."}
{"text":"Food was absolutely terrible. It looked like a child made it. We also were missing food as well. Spent $30 worth of food...called them and asked for a refund and they put me on a long hold. Definitely will not be going back. Was my first time going there and will be the last. Luckily after talking to the staff they took care of it. Make sure you check your food at the restaurant before you leave."}
{"text":"I went there three times and I just don't understand why this restaurant has such high rankings. I think the answer is the low standards of college kids. My opinion is that this food just doesn't taste good. The only thing I tried that was ok was a Mexican Taco, but everything else I tried (a couple of burritoes and different tacos) are not appealing at all. Meat is dry and has ligaments in it, not enough veggies, and just weird weird taste."}
{"text":"If you haven't been to Maize, the question is why?  Fantastic food! Quesadillas, volcanes, tacos, tlacoyo, nachos - all so good! It is really mostly a carry out joint, so I don't fault them for limited space at all. Better to start out small, grow a reputation - than look for a big space to begin with."}
{"text":"I've tried nearly everything on the menu and loved all of it! It's right up there, flavor-wise, with any of the fancy Mexican restaurants I've been to. In fact, I prefer it over restaurants like Frontera Grill. I'm not a fan of chicken tacos/burritos/etc usually, but their chicken items are flavorful and I normally get that instead of asada or pork. It's simple and delicious food."}
{"text":"Best Mexican in Champaign, huge affordable menu, very fresh ingredients.  The only minus about this place is the lack of inside seating, it's basically a take out spot.  When they open their spot downtown Champaign I think it will be one of the premier spots in C-U."}
{"text":"Traveling south   On I-57 was looking for a good Mexican restaurant. After reading several reviews about Maize decided we would stop in, the place is located downtown off N Chesnut St.  Was maybe ten minutes east off I 57 via I 74 Really easy to get to. Previous reviews stated the place was small and parking difficult , but I didn't experience that at all. Parked easily in the back of building with clearly marked area for parking also noticed off street parking in front. The restaurant is quaint,clean, and a relaxed atmosphere. The food aMaizing!!! This is authentic Mexican food made with fresh ingredients. Quality is very evident. Homemade tortillas  Reminded me of the kind my Abuela made in Honduras. You are not gonna find enchiladas and Tex-mex food.  Everything a-la-cart which means you can try a little of everything.  My husband and I had tacos, gordita, and sope each with a variety of meats from chicken to pork and steak .  Each item was delicious and fresh.  If you get a chance stop in you won't regret it Wish there was one close to my home in southern IL"}
{"text":"Best Mexican food I have ever had from a restaurant.  Period."}
{"text":"Worst and lazy people to serve you are available.  Just want to waste your time, go and use  their slow service."}
{"text":"Place is great.. Definitely not a place to take a serious date.  I enjoyed eating and the small dining area made it interesting.  My wife and I chowed down on everything.  The guacamole and chips were good and the numerous other items we had were great.  Make sure you go hungry because you will want to try most of the menu.    The staff made some great recommendations and everyone were friendly and hospitable."}
{"text":"The tacos are amazing; a little greasy, but made with fresh and tasty ingredients. They seem pretty authentic, similar to tacos I've had in the Pilsen neighborhood of Chicago."}
{"text":"Came here once with my friends and will definitely come back for more. The tacos are amazing and my favorite is fried chicken quesadilla. Their salsas are delicious and spicy enough for my taste. The place is quite small, so we just ordered take out. And the price is quite certainly right for the quality food they're serving here."}
{"text":"Amazing Mexican food with a very friendly and helpful staff. My favorite restaurant at the University of Illinois!"}
{"text":"If you have read my other reviews, you know that I would just about eat anywhere if the food was good.  Yes, Maize is teeny-tiny and I even get grouchy trying to squeeze in but it is so worth it!  The food is SO cheap and delicious!  I am super picky when it comes to Mexican and I didn't even want to go when my boyfriend suggested it but I am glad we did.  The fish tacos are my ABSOLUTE FAVORITE!  Would definitely recommend to anyone!"}
{"text":"Hands down best Mexican in Champaign. I've loved everything I've eaten there, but I'll warn anyone who goes that the Torta Ahogada is seriously spicy, not for the faint of heart. And, of course, get takeout and enjoy it where no one can judge you."}
{"text":"There is no other place like it. I normally just get takeout because there is limited seating. But the owner knows my name and greets me every time I come in. They always have my order waiting for me. Even give me suggestions of something I ordered the last time so I don't forget.  The food is the best Mexican in town."}
{"text":"The best Mexican in Champaign hands down. Fast, great value, and a good spot to dine in as long as it's not peak hours (it gets cramped fast)."}
{"text":"I absolutely loved it here. The food was so good and it actually tasted like real Mexican food. The rice water was also very good. I would totally recommend this place!! Minus the fact that it's so small in there."}
{"text":"Great guac! Great food! Good prices for authentic Mexican restaurant.  Not too much space for eating, but heightens the authentic vibe.  Would recommend!"}
{"text":"Absolutely delicious food.  Huge portions.  Cheap prices.  The only downside - it's constantly packed with college kids, and the extremely limited space is quickly overflowing with ugg boots and axe body spray.  Get your order to go."}
{"text":"Not only is the food impeccable, but they can also handle a line out the door and half way down the block in a way that is truly impressive. The staff is friendly and willing to make recommendations; the food is inexpensive and lick your fingers delicious. This place does everything right. While we were waiting in line, other customers went out of their way to tell us what their favorites are. This place has serious devotees and after one bite, it's not hard to understand why. Be sure to try the pastor!"}
{"text":"Best Mexican in town, perhaps the best inexpensive Mexican I've had anywhere.  Yes, it's cramped, parking can be difficult, including getting out at the corner -- but it's worth it.  Chips + verde salsa (I think you have to ask for the verde) are great.  Fish tacos are best in town.  Love the chorizo burrito -- so good I'm willing to suffer the upset stomach.  (The price I pay for any chorizo.)  Always friendly even  when it's a little chaotic in there.  Wish they would expand and wouldn't mind having a margarita with my meal.  Hoping."}
{"text":"You don't need me to tell you this place is delicious. What's one more 5 star note?  Pumpkin flour tortillas. Delicious everything. Vegetarian options.  Friendly, quick, affordable, awesome.  A town favorite!"}
{"text":"This place is fabulous. The food is fresh and deliciously seasoned. The prices are very reasonable, especially in comparison to all the other Mexican places in town, and the decor is cheerful and clean.   I would highly recommend the Sope al pastor cooked on el comal (not fried). And the tlacoyo was also delicious. Husband had a burrito al pastor, which he loved. They give you free chips and homemade salsa. We both left feeling full and happy.  The owners are very kind and personable. I will definitely go back again."}
{"text":"SOOOOOOO YUMMY! Clean, Cheap,and fast. only complaint is the building was too small for the large crowds of people that flock there."}
{"text":"Best Mexican in town, and very reasonably priced. I only wish there was more seating! My favorite is the chicken tostada. If you get takeout, be aware that they are VERY generous with the guacamole- it probably serves 2 or 3 people and is priced fairly for that amount."}
{"text":"Amazing & authentic!!!! Hope they get a bigger place soon but that doesn't take away from their excellent food & customer service!"}
{"text":"Not much else to say that others haven't already said.... the food here is spectacular (and not just \"spectacular for central Illinois\" ... I mean actually really good). If you just get the burrito every time, you are really missing out. Yes, it's usually packed, but it's busy for a reason. If you call in for takeout, the food will be ready before you can even get there, so what are you waiting for?!"}
{"text":"Food was amazing. Very authentic and simple. We ordered chicken Tacos, chalupas and quesadilla. Glad they do not put a ton of cheese. Worth a stop on your way to a Campus Tour.  The place is very small and sitting is tight though."}
{"text":"I have had the beef burrito and the amazing melted cheese, and felt both of them are sooooo good!"}
{"text":"The Good: - Very, very good Mexican food. It is absolutely delicious. Though I haven't tried a majority of the food, the chicken and pastor taco mexicas are delicious. The nachos are also very good! - Complimentary chips and salsa! They give two types of salsa, one mild and one hot.  - Most importantly, the food is very fresh! It's always made to order, and comes out hot! - It is very price conscious also!  The Bad: - It is very, very small. Maybe fifteen seats available at the most, and unless you time it perfectly, you probably won't get a seat. However, they do have take out available, if that option works for you.  Overall: Very good Mexican food at a good price. My S.O. and I have been here numerous times, and will certainly be back again."}
{"text":"Let's be clear- the 5 stars is about the food and the service.  This isn't a fancy 5 star restaurant but that's not what the stars mean on Yelp- as we all (should) know!  We moved here from Southern California in August, so it's safe to say we've had our share of excellent traditional Mexican food.  Since our first trip to Maize we go there at least once a week- it's so good.  BE PREPARED: Parking can be a problem and it's almost always packed.  People frequently come in and order for takeout. In our experience, by the time we order a seat almost always clears up.  We have never taken it to go.  If you eat there, you get free (freshly made!) chips and salsa while you wait for your food.  Since it's just the two of us, we have always been lucky.  If you have a big group, I'd suggest ordering it to go and eating at home or having a picnic.  You can call your order in too, which is nice.  The food is always ready super fast, so even if you order to go, you won't wait long.    The staff is extremely kind and happy to answer questions if you're not sure what something is.  I've tried many things on the menu but keep coming back to the tacos- chicken or fish are my fav- because of the RIDICULOUSLY amazing corn tortillas.  So. Good.  Word on the street is that they'll be opening a larger location near the Amtrak in Champaign soon."}
{"text":"I have never been able to get a seat at this establishment, which is pretty frustrating. Before this last time, it had usually been due to the parking situation (there are about 3 parking spots in the front and 4 in the back) or the fact that there was no seating room inside, but today's situation was a bit different. My husband and I were in line trying to figure out what to order when two seats opened up in one of the tiny corners of the restaurant. My husband quickly went to save us the spots as I moved a few inches to the side to let the man behind me order (because I assumed he was ready and we were not). Before the man, who was formerly behind me, even began to speak and/or place his order, one of the employees let us know we could not sit there because we had yet to order and the man who was currently at the cash register was going to sit there. Now, at this point, I became fascinated at the thought that this lady could read the customer's mind. The gentleman had not ordered or even expressed interest in taking the seats, which we were denied. As much as I was annoyed bit the situation at hand, I was and continue to be amazed that this lady could read the customer's mind, and I am still wondering if that man was even interested in sitting there or if he placed the order to go. I will never know, though, because my husband and I decided to leave as we accidentally knocked into about 4 people on our way out (it is very very tight in there) and headed across the street to El Charro, where the service staff is wonderful and they don't rush to yell, \"You cannot sit here!\"  Side note- Definitely not recommended for anyone with children under the age of 6, as the space is not inviting for this demographic, or anyone who does not like to eat in tight quarters."}
{"text":"Great burritos and Chalupas! Lettuce inside was slightly off color but other than that everything was PERFECT"}
{"text":"I ate there for the first time last week, and it was fantastic. I got there early to beat the lines and actually got a seat inside. I really cant think of any criticisms. I can't remember the name of what i ordered, but I do remember that it came on a perfect flour tortilla grilled to perfection. The meat was extremely tasty, and the onions and cilantro made it perfect. Plus, the prices were amazing. I'd recommend them to any of my friends."}
{"text":"Maize has become something of an obsession for me and many of my friends. We love the tacos there and the consensus is that Maize will be the food of Champaign-Urbana that we miss the most when we move away. (This says a lot because it won out over campus bars with sentimental value, downtown bars with good food/alcohol, Papa Dell's and many other venues.)   The place is small, so we tend to call in our order and show up to pick it up. When we've ordered on site, there was usually a line, but the wait was never too long and the food was always worth it.   Our favorite item there is the fish tacos, but we also enjoy the chips and salsa. This is definitely the top Mexican place in my opinion and it is super affordable and tasty."}
{"text":"Maize is the number one Mexican place in the UIUC area. The tacos (especially the fish taco, oddly enough) are fantastic, they really have a knack for making everything about them just right.  As far as their other dishes are concerned, you'll be hard pressed to find something that is unsatisfying. Whenever I show up extremely hungry, I go for the nachos and don't look back. Their guacamole always hits the spot.  I really want to give them 5 stars, but unfortunately the place is just so cramped. Initially, this was a charming feature but now I'm fairly certain that I'd actually have a better time if they were significantly bigger."}
{"text":"My favorite Mexican restaurant in the area. Very tasty, decent prices, and authentic!"}
{"text":"This is my absolute favorite Mexican place!  I've tried close to everything on the menu and it has all been amazingly delicious.  I love the sopes, gorditas, and tacos."}
{"text":"We were on a cross-country roadtrip and needed lunch so we did some on-the-fly Yelping and saw this place. THANK YOU, YELP! This place was fantastic. The small space was packed and there was a line but it moved super fast and we got our food in record time. Everything was fresh and authentic, prices were very fair, and the service was exceptional. Even the gal running the register was sweet and helpful when plenty of other people in her frenzied position in a very popular spot would be surly and condescending. We loved everything about it and were so glad we stopped!"}
{"text":"Love Maize!  The fried pumpkin flour quesadilla is amazing!  The tlacoyo with chorizo is to die for as well!  Small parking lot & always busy.  Order for take out!"}
{"text":"Love the tacos.  And corn shells very authentic.   Nice friendly staff.  Price is great."}
{"text":"Small restaurant and relatively long queue, but they serve at blazing speed! The chorizo burrito is cheap and tasty."}
{"text":"So, so, good. This is the best Mexican place in town and a place we always recommend to anyone visiting. Tortillas are made from scratch there and the pork anything is amazing, but I love a Volcan if you want something cheesy and crispy. My girls love the sopes, and my husband likes the burritos, but really everything here is good. Get take out or go on an off time since the place is very tiny."}
{"text":"This place is absolutely awesome. Great authentic tasting food and they give a good portion as well.. I would Higley recommend the total de Carne asada to anyone who is looking for something delicious!"}
{"text":"Amazing food, super fast to prepare. Although beware at high traffic times during lunch or dinner the line can be long."}
{"text":"Maize was one of my go-to lunch places when I lived in Chambana. I'm from New York, so I'm not exactly an expert on Mexican food, but everything I ever got at Maize was excellent--chalupas, gorditas, tacos, and burritos. (The chalupas especially... maybe I should fly back to Champaign for the weekend...) The people working were friendly and the service was prompt. Maize is, food-wise, one of the best places to eat in Champaign-Urbana.  The only downside of this place is its tininess. There's room inside for about a dozen people sitting elbow to elbow. I always got takeout, and even standing around waiting for my order I always felt like I was in someone's way. The parking lot is proportionately small too, with only four or five spots, so you may not even be able to park at Maize to get takeout. (Fortunately it's within easy walking distance of campus, and the Green bus line goes right by so you might not have to drive.) If this restaurant were to expand and keep the same menu it would be fantastic."}
{"text":"Great food!  A bit on the small and crowded side (okay a slight understatement) - but for takeout it's a perfect location if you can find parking!"}
{"text":"Best Mexican food in America. Seriously, eat here as soon as humanly possible."}
{"text":"This place is tiny, which often leads to tricky parking situations and lines out the door, but don't be dissuaded! Everything I've tried has been fresh and flavorful, and absolutely not drowning in grease (which is often my complaint when it comes to Mexican food, particularly in the midwest). My current favorites are the guacamole, veggie chalupas, and pumpkin flower quesadillla. I'm slowly working my way through the veggie and fish menu as I return and return again, snacking on the complimentary chips and adding delicious warm salsa to all of the selections. Yum!  Lately I've been calling for take-out more often because the logistics of getting to Maize and finding space are not always easy... and so I would love if it could expand a bit and get some better bike / car parking. (Bike rack, please?) But that doesn't seem to be worth knocking off a star -- and other than that, I wouldn't want them to change anything."}
{"text":"Was rather disappointed. If this is considered to be a five star Mexican restaurant in Champaign, I feel very sorry for this college town. We tried the tacos, tortas, rice, beans, guacamole, and horchata. Out of that whole list, the only thing remotely good was the horchata. The food is very bland and taste-less. I would not recommend this place-unless you're devastatingly starving and have no taste buds. To everyone who believes this food is good head into Chicago and try some truly good Mexican food. For this quality I could have gone to taco bell up the street."}
{"text":"Can't believe I haven't reviewed this place yet, but then again, what is there left to say about the best Mexican spot in town?   It's great. Damn near perfect.   The pastor is as tasty as it gets, and the usual stand-by's of steak, chicken, and fish aren't bad either. They also have weird stuff like the huitlacoche quesadilla, which is also delicious. And if you feel like bringin the heat go for a torta ahogada.   Really, just go. Don't expect to find a place to sit, and maybe think about calling ahead if the students are in town, but go."}
{"text":"Best Mexican food in Champaign-Urbana! I love their huaraches and their burritos. Guacamole will never disappoint either. Not much seating at the restaurant, but I order ahead and the order is always ready in 10-15 minutes. Love this place!"}
{"text":"Only once in my life have I ever craved a resturants food all the time. Maize would be the resturant I am talking about. I absolutely love the food!! Every food item I've had has been amazing! So fresh and real! Haha. I come here all the time! The service is great as well.  The servers are always friendly and kind. This place is small and the line is always out the door but it's so worth it!!!!!"}
{"text":"Solid a la carte taco joint. Quick friendly service and good, reasonably priced food. I'll be back."}
{"text":"I was told to stop by Maize since I was in town. I trusted what everyone said and I was not disappointed. The carne was amazing and I loved the guac, lettuce, tortilla, and chips with it. I was surprised that there were so many things. Great Mexican food, beats Chipotle all the way."}
{"text":"In my opinion, this is the best place for Mexican food in Champaign! The fish tacos are my go-to, but each one is kind of small, so if you are hungry, I suggest getting 2 or 3. The prices are amazing considering how much you get. Each meal comes with complimentary chips and two kinds of salsa, one hot and one mild. The chips are delicious, and I think that they are homemade (or at least they taste like they are!). The staff are very friendly, and they will help you navigate the menu if it is your first time. They are also very fast. My whole family had food in front of us in about 3 minutes. It's definitely not the best place to go if you are looking to sit down for a long lunch, because there are very few seats in the place, and not much standing room. There are a few picnic tables outside, which are nice if it is a warm day out. I prefer getting my food to go, but I have sat there a few times, and it has been really nice! Overall, I would recommend this place to anybody coming through town, or to other students who haven't been yet! Absolutely worth it!"}
{"text":"Horrible service and the people are plain rude. They always screw up orders and only care about taking money out of your pockets. And worst of all, they charge extra to make dishes vegetarian. I once asked for a dish to be made vegetarian. They put meat on there and after I asked them to remake it, they charged me double for something that was their mistake. Would NOT recommend this place."}
{"text":"The best and most authentic mexican food in Champaign!"}
{"text":"Delicious food. Tortillas are fresh and made in house. Everything is delicious. The best Mexican in town!"}
{"text":"It really doesn't get better than this when it comes to Mexican in champaign.  From their chorizo burritos and nachos to the tortas and tacos, this place is worth braving that long line that snakes out the door into sub zero temps.  Maize always hits the spot (sadly, even when you occasionally find a bit of bone in the chicken.)"}
{"text":"Great great great! Best taco I have ever had here in champaign Urbana . Strongly recommend."}
{"text":"This place is so good! They found a spot for us even though it was super packed, the service was lovely, they make you feel fantastic. The tacos are as good as they get. Full of flavor and the tortillas are exactly as they're supposed to be."}
{"text":"I have had many things on the menu at Maize and been here multiple times. I realize this is a favorite place on campus but I find some things just not great. The tacos here are not worth getting whatsoever, neither are the sopes. There are many better places to get tacos that are cheaper. The chips are sub par and not very enjoyable.   However the burritos are top notch. I really enjoy many different types of these burritos and this place is worth going to for a burrito. They are large, flavorful and very tasty."}
{"text":"If you've ever been to Maize, you know why it's arguably the best Mexican restaurants in the area. If you haven't been, you must not have been in town long. Their carne asada tacos and chicken burritos are two of my favorites, but I haven't had anything I didn't like. Their chips and salsa portions are generous as well, which is always a plus!"}
{"text":"Kicks chipotle in the butt. I love their steak or chorizo burritos. Favorite burrito place by far."}
{"text":"Fantastic food ! Best mexican food in town. Their gorditas and guaraches are fantastic. The cheese they use is exquisite."}
{"text":"Amazing.  The rest of the Mexican restaurants in Champaign do not even compare to Maize.  I got the Volcanes --- truly one of the best dishes I've consumed in a while!   The good things about Maize:   (1) Maize had fresh ingredients.  The cilantro tasted like it had just been harvested from a garden this morning.  Seriously.  Most of the other Mexican restaurants in the area either do not use cilantro or use barely any at all, so Maize's generous serving of fresh cilantro was a definite plus.  (2) Maize appeared very sanitary and clean.  Some the restaurants on campus are somewhat grungy, but this restaurant seemed very well-kept and clean.  (3) The decor and music put me in a very good mood.  From the outside, Maize may look a bit drab, but once you are inside, it's bright and colorful.   I kind of wish the place were bigger and had more parking, but I don't really think it's a huge deal.  The small size of the restaurant gives it \"character.\""}
{"text":"I ALWAYS order the steak tacos with chips and salsa. The flavor is so good together. I always dip my chip in salsa first chew... Take a bite of my taco and add another chip with salsa! Soooooo good! I also tried their beans and rice not a big fan of refried beans. And the rice was dry and I never tried the chicken. But you will not go wrong with steak tacos and chips. And if you like spicy get the spicy salsa. FYI steak taco with cilantro, tomatoes, onions and cheese. You'll love it!"}
{"text":"This place is doing nothing wrong. well maybe if you're driving and are looking for parking space, then I guess you have some reason grounds to be pissed.  I find this really place fascinating because this is the only place that I can think of where the kitchen is bigger than the seating area.   All said and done, you get good mexican food for good prices. can't mess with that."}
{"text":"Sometimes when something is overhyped, you set yourself up for disappointment.  I wish I had visited Maize before I had heard anything about it, I think my expectations were too high. After reading reviews, it sounds like the prices have gone up since opening and it is not necessarily a bargain.  The parking lot is very small and awkward since it is on the corner of a fairly busy intersection. The staff is super friendly and helpful and will answer any questions you have. If you are short on time, this is a great place to go since the food comes out FAST, unless you have to wait in a huge line to place your order.  I tried a fish taco and a pastor tlacoyo, both are items I have not seen on menus at Mexican restaurants around town. They were both very tasty and authentic. The sauce on the pastor tlacoyo was delicious and I was delighted by the authentic cheese and crema topping.  Chips and salsa were good, but they're not my favorite in town.  I would go back and try their torta and any entree that has squash blossom or huitlacoche."}
{"text":"Just ordered a steak burrito - the tortilla was soggy, the lettuce was turning brown and was obviously old (and they packed in way too much of it), they didn't include any refried beans, the steak was dry and cold. They didn't even include salsa for the chips. Probably my last trip here."}
{"text":"Great Mexican food in the Chambana area. What is particularly wonderful is the freshness of the ingredients used in the food. Burritos and tacos are on the menu of course, but the carne asada and fajita plates are wonderful.  Parking is difficult (there are only a few spots) and at times there may be a long line, takeout service is quick - you can also call ahead and your order will be ready for pick-up when you arrive."}
{"text":"This place reminds me of taco joints in Mexico. They have a small space, but is always crowded because the food speaks for itself! I had the taco pastor which is pork cooked a certain way that it makes your mouth water just thinking about it. Anyway! The food came out super quick for it being such a busy little taco place. I found a seat, one of the workers gave me chips and salsa, and then my meal came. The tortilla was a nice a warm corn tortilla that blanketed tender al pastor along with cilantro and onions. Every bite was amazing as the last. If you're ever in champaign, bring yourself here, it's fantastic! The only bad thing about this place is parking because it is located at the corner of an intersection and the parking lot is tiny!"}
{"text":"I'm so glad this place opened down the street from me! Easily the best of the six Mexican restaurants that line Green St. Fresh ingredients, authentic dishes, low prices and friendly staff. Did I mention the portions are massive?  This isn't the best place to sit down and eat during peak hours, but the decor is eye-catching and the music is soothing. Do yourself a favor and check it out."}
{"text":"I wanted to cry from happiness when I bit into my burrito--it was that good.  This is by far THE BEST food I've had in the Chambana area.  I had the horchata along with my meal as well and it was delish!  Definitely a step up from Chipolte, and a better deal, too.  You get chips and salsa packaged with your meal for free!"}
{"text":"Delicious, fresh mexican dishes.  HOMEMADE tortillas!  Great guacamole.  Best mexican food in CU!  Yes, their location is small, but it is definitely worth the wait!"}
{"text":"How have I not written a review for this place?? Shame on me.   This is one of my favorite restaurants in champaign because it's delicious and affordable. I always get their tlacoyos with pastor and it's the best ever. I'm craving it as I'm writing.   I haven't tried much else since I'm in the tlacoyo phase but will update when I try other things."}
{"text":"I've been there a few times, and the food was above average each time.  Cheap prices and nice people.  However, it is very crowded, as there is very little seating.  Also, they have a tendency to get your order wrong."}
{"text":"Best Mexican restaurant in C-U, hands down. It's small and cramped, and not a great sit-down place. However, the food is fast, delicious, authentic and cheap. Can't ask for much more. Perfect for a quick lunch or dinner."}
{"text":"Stringy chicken that's apparently been sitting in a pot somewhere for hours, no caramelized onions or cheese even though I asked for a taco Mexican style. Maybe it's because the students aren't back from break, but there were three girls behind the counter. And on top of all that, no chips with a one taco order. If I wanted a half-assed snack I would have made it myself. This is a vastly over-rated restaurant only suitable for half-drunk, hungry students."}
{"text":"Fantastic Mexican food. Tiny bustling restaurant with beautiful tiling and vibrant colors. Can be a bit tricky to park when it's busy, but the Green bus takes you right there. Food is delicious, fresh, very inexpensive, and fast. Staff are friendly and bilingual. The huaraches are stellar. Highly recommended."}
{"text":"I don't even like Mexican, but I LOVE this place!  Hands down one of the best places to eat in Champaign.  Unbelievable food and also inexpensive!    Everything on the menu is great, but my absolute favorite is the fried tlacoyo with pastor.  Words cannot describe how yummy it is!  Chips and salsa come with every order, which makes it possible for me to order one tlacoyo and be full for just FOUR DOLLARS!  Simply Amazing.  I love you Maize."}
{"text":"Best Mexican food in Chambana (and anywhere else that I've eaten)! That is all that needs to be said about the food.  The place is tiny with very limited seating and limited parking. If you go during lunch or dinner rush, your best bet is to get food to go or even call ahead and order for pickup.  I recommend the asada burrito, but you really can't go wrong with anything on the menu."}
{"text":"My favorite restaurant in CU  I recommend the volcanes. They're like a tostada but with this nice grilled melted cheese on the tostada shell. My bf (from mx) loves their tortas ahogadas and says he feels like he's back in mexico when we go there.  I love their beautiful tile counter/bar with tiles from mexico. :)"}
{"text":"The most authentic Mexican food in C-U!  Everything is a mano (handmade - none of the prepackaged stuff!).   If you haven't tried their food, you must!  Tiny place with friendly and fast service that just feels like home.  Gotta love free chips and salsa with your meal, too! Seating and parking is limited. Vegetarian friendly."}
{"text":"Second best mexican food I've ever had! The tortillas are the best part, they're home made, just the right texture, flavor, and thickness. YUM!!!!"}
{"text":"Yes, this place is small, but the food is flavorful.  Very fast and affordable.  I'd recommend the steak burrito and chicken flautas.  Why eat fast food (Taco Bell) when you can eat here?"}
{"text":"Finally, a place on green and first that is good! i think i have tried everything on teh menu. This is the most legit mexican food in town. Get the chalupas! It's the best deal. You get 3 chalupas for 4.99 (ish). Other good things to get are tacos and tostadas.  if you get a torta, get ready to bring home leftovers because that thing is huge!  The meat here could use a bit of salt and pepper. also, don't bother to get the fancy steak taco or fish taco because they dont taste that great. otherwise, everything is delicious!"}
{"text":"Best mexican place in town. Amazing food. Everything is super fresh. Great service.  The only bad thing is that there are less than 15 counter seats and no regular tables, so don't count on a romantic atmosphere.  But highly recommend for really good and pretty cheap food!"}
{"text":"Been here over and over again! Best tacos in town and maybe in IL. This place is a much.   The guacamole is superb and you get a large helping.  Staff was friendly (as always).  Prices were fair and make me feel like it's about quality over making bank.  The food is authentic and fresh.   If you just visiting or just in lunch break... Go here."}
{"text":"I lived in California and have visited Mexico several times.  The Maize grill has the most authentic south of the border flavors I have ever encountered in the States.  I had the torta and tried a regular taco, both with Carne asada.  All I can say is that they were absolutely delicious.  Can't wait to go back.  Don't expect any ambiance, though.  There are only about 12 - 15 counter seats available.  The food makes up for it.  And, show up early for lunch, because they have a tendency to fill up rather quickly."}
{"text":"Everything here is fantastic except the food. I like the fact that it is a small venue and there is a few seats for the patrons. The staff here is extremely friendly and kind. The service is fast when there isn't a long wait. The food is terrible. I ate here a few times last week and each time it was disappointing. The meat (steak) was flawed on many levels. It is a poor cut, not carne asada but something cheaper. The burrito here is small and there is very little meat to begin with. I also tried the tacos and they too were bland. The guacamole is alright and the sauces add some flavor. I am not sure why everyone thinks, writes highly of this place. The owner should do justice and actually use descent meat and not rubbish. You are not doing a service to anyone except your bank account. Sad. TBK would be put this place to shame."}
{"text":"Incredibly good and truly authentic Mexican food.  The staff were extremely friendly and helpful.  Best to plan on carry-out since the restaurant is so small, but well worth doing."}
{"text":"It goes without saying that Maize is the best Mexican in CU, BUT there's a reason why I've decided to give them a 3 (Even though the food is 4.5 star).  It's really annoying that they charge you an extra $.50 for a miniature salsa on to-go orders. Keep in mind if you dine in, you get unlimited salsa. Granted, I understand the need to recoup costs on the small (tiny!!!) plastic containers of salsa, but $0.50!?!?! As someone who eats here 3-6 times a month, it's upsetting that they don't value their repeat customers. At least have some type of free extra salsa every 3 order type of program. It's pretty ridiculous to think that ONE TINY salsa container will due a burrito and chips justice.   As much love as Maize gets form the CU community, you'd think they'd find a way to reciprocate. Unfortunately, not quite the case yet."}
{"text":"Great food - very fresh! I've had a variety of many different entrees, and all have been great. I really love the guac and chicken tacos. All of the food is made right on the spot, and is always hot and tasty. The only thing I would recommend would be more seating! I placed an order for carry-out and could barely fit in the door with so many people and the ones who found seats were completely surrounded by customers waiting for their orders. Overall, I would definitely recommend the food and will be back for more."}
{"text":"Only authentic mexican food in Champaign. It is a little cramped, but the food is absolutely incredible. I can't wait for the new one to open up where the cafe luna used to be. If you are looking for great food at an affordable price, look no further than Maize."}
{"text":"My fiance and I never would have heard about Maize if it was not for an article about them written in the DI. This very small, hole-in-the-wall restaurant is truly a hidden gem! The tastefully decorated building is very small and has limited seating, which honestly suits the quiet intimate atmosphere perfectly! (if parking or seating is a problem, you may want to show up during \"off hours\", such as after 1pm or before noon, perhaps? We visited during break when campus was empty and had no issues). The owner was very friendly, chatting with customers and explaining the different items to us and offering his recommendations.  The portions are very inexpensive ($2-4 on average!) and on the small size, so that you may mix-and-match different items. My fiance and I each ordered 2 chicken tacos and then shared 2 quesadillas: one filled with pumpkin blossom and one with huitlacoche. We had never had either filling, and they were AMAZING! The corn tortillas are all homemade, a little thicker than usual and really good. We were also offered free tortilla chips (which were also thicker than normal, perhaps made in-house? Very good!) with two delicious homemade salsas and lime. A delicious and filling meal for two for just over $10, not bad at all!  In short, this place offered some of the best Mexican food I've ever tried/ It is extremely authentic, and much lighter than the more stereotypical heavy refried beans/sour cream/cheddar cheese/oil-drenched Americanized \"Mexican\" fare. We will be returning next week to bring a large order home to my fiance's family in town :)"}
{"text":"Best Mexican food I've ever had anywhere in the states."}
{"text":"Sometime is good but it is too hot place this town and take a long time to grab a food."}
{"text":"I graduated from UIUC in 2013 but almost wish I'd flunked a couple of years just to still be on campus eating Maize 3-4x a week like I used to.  Seriously the best Mexican place ever! I once brought my mom who's a great cook so she could meet the cooks who kept my stomach happy during my college years.  Their fish tacos are second to none! The fish isn't breaded and the tortillas are homemade."}
{"text":"This place is worth every bit of this five star rating. The prices are good and more importantly the food is delicious. The free nachos and salsas make it even better.   You can't really go wrong with whatever you get here whether it's a burrito or fajita--it all tastes authentic and way better than any of the other campus restaurants serving Mexican food. Wait times aren't bad and the staff is friendly as well. If there's a place where you want to be known as a \"regular\", this one's it."}
{"text":"Best Chicken Burrito in CU. Absolutely love this place, just wish they would open up a bigger location!"}
{"text":"I'm on the fence about this place. The complimentary chips were really good but the \"salsa\" if you'd even call it that was about a spoonful and nothing exciting. The food was fresh, crispy, and not heavy or greasy at all. I had a fish taco and a veggie fried huaraches. Both were well prepared but in all honesty very bland. The veggie huaraches has cheese, avocado, beans, lettuce, sour cream and yet was still somehow not very flavorful. A squeeze of lime wedge did help some. Same with the fish taco, bland and heavily reliant on the lime wedge. The horchata was less flavorful than I've had before as well. My dining partner had a pastor burrito with just beans and cheese and he said the same: good, fresh, kinda bland. Overall nothing was \"bad\", but nothing was crave inducing. And considering the price leaned to the \"tad over-priced for what you're getting\" side I'm not sure it'll be on the list of go-to Champaign restaurants. But because everything was so fresh we'll definitely give it another chance before we totally rule it out."}
{"text":"Carne asada is bomb! We tried one of each taco and while they were all great, that was definitely my favorite. Their chips and guacamole are house made and delicious. Authentic Mexican in the middle of Illinois!  Food comes fast and service is great. Not a lot of seating - keep that in mind if bringing a group."}
{"text":"Maize is delicious, nearby, and affordable.  A friend recommended I try this restaurant, and I am a very satisfied customer.  Five stars!"}
{"text":"I've eaten mexican in Chicago. I've eaten mexican in southern California. I've eaten mexican in Texas. I've eaten in Oaxaca mexico. This place is right up there. I'll admit the first time I went I was skeptical. It's way too small, and the chips and salsa leave something to be desired (but, seriously, who cares?). Once the food came I was absolutely convinced by the hype. The al pastor buritto was incredible. The flavors were authentic, the meat was moist and delicious, and everything about that burrito told me that this place was a winner. Every time I have been back since the food has been just as good. Tortas, tacos, burritos, flautas, sopes, you name it; this place has it all and it's all fantastic. I have yet to try something that didn't leave me full, satisfied, and waiting to be hungry again so I could come back.  This place is sensational. The prices are low and the food is first rate. Just, do yourself a favor and order to go. The place simply isn't big enough to house all the hungry maize addicts trying to get their fix."}
{"text":"very good campus food, much better than we had a few years back.  food is a bit on the salty side, but the portion is great. if this were to be compared to the mexican places we had in chicago, i would give it a 4 star just because there are more options in the city. given it is a quick eat between classes and its close location to campus and the food choices around here, this is superb"}
{"text":"I'm changing this review after thinking it over. The food is REALLY good, and they're super nice! Even though the space is small, that's not a reason to take off a star because this place is thee best in Champaign, and closely competing with some great spots in other cities/states as well!"}
{"text":"There is always a lot of hype about how great this restaurant is so I finally decided to check it out. I don't think it quite lives up to the hype, but the food is really good and inexpensive. I would recommend ordering more than one item on the menu though if you are hungry because the portions are kind of small. I tried their Volcan and their Horchata; both were very good. Their chips and salsa are a nice compliment to the meal as well. The two things which could be improved is the parking and the size of the restaurant. The line for Maize is often out the door during regular times while the semester is in session. They really do need a bigger building and parking there is a bit of a nightmare so I would advise that you walk to Maize if you can."}
{"text":"Most authentic Mexican food I have had outside of the SW. (Mas Amigos holds a similar ranking, but they no longer have their brick and mortar)  I would change up their salsa a bit, but nothing beats their tacos."}
{"text":"Everything I have gotten from here has tasted amazing. Maize doesn't have much indoor seating and there aren't many parking spots. They always have a long line. Despite all these cons, you can never go wrong when ordering food here. They handle long lines really well. That have gotten used to long lines. My favorite thing to get here is their torta de milanesa. Their chips are really good; They might be a little greasy for some people but I can't get enough of them. They give you two different types of salsa with your food and both of them are really good. Their menu is simple and easy to understand. They also have your classic Mexican sodas. The prices of all their food is cheep. I would pay more for the quality of the food they provide. I hope that in the future they expand their restaurant because the food, service, and environment is really good. If you don't know what to get you should try their quesadillas."}
{"text":"Best burritos ever! And the nachos and tacos are fantastic as well :)"}
{"text":"There isn't much seating but it's above and beyond any other Mexican food I've gotten in Chambana. I love that it's authentic & it's incredibly affordable."}
{"text":"This place is terrible. Avoid at all costs!*  *Please go away; lines are getting too long."}
{"text":"OMG! I've been to many authentic Mexican places for tacos, in many states, but nothing tops Maize Mexican Grill for tacos. The flavor is so unique from the handmade tortillas to all the ingredients added. I had the tacos Mexica. So delicious, so perfect and so satisfying. YUMMY!!!"}
{"text":"Amazing! Small and great. The food comes out fast and full of flavor. It's cheap and perfect for a quick lunch. We were working in the area and wanted to try it out and was not disappointed!  The carne asada was awesome and so was the chorizo sausage. Put them in anything and it's great.  The fish taco was also amazing.  The two salsas they give with the fresh tortilla chips are perfect in favor and a little heat."}
{"text":"I had heard a lot about Maize before I tried it myself. Everyone who I talked to seemed to have enjoy their meal there, so I was rather excited when I pulled up together with a friend yesterday evening. My first thought was \"Wow, they weren't kidding when they said that it's small.\" It seems like a perfect place to get food to-go and seating is very limited.  I ordered a burrito with pastor and my friend ordered torte with pastor. The food was really well priced and arrived at the speed of light! We had a seat at the counter and ate our meals there. The staff quickly served up our Jarritos (before we sat down even) and chips together with a delicious spicy habanero (I think) sauce. We were both satisfied with the burrito and the torte and enjoyed our dinner at Maize.   Highly recommended if you're looking for a quick, delicious, affordable meal!"}
{"text":"Went here with my boyfriend the other day and he got chicken fajitas and I got steak tacos. No drinks and nothing else totaled up to $23 dollars before the tip.   We sat down in the world's tightest restaurant imaginable and they brought us chips and salsa and water. The water was luke warm just like the salsa. There was enough chips to feed a small baby. As frequent Mexican food goers my boyfriend and I were expecting bottomless chips and salsa that we could smash for 10 minutes before the food came. He asked for another round of chips and salsa and they looked at us like we were nuts.   Then the food came and I looked down at the meat and the first thing I saw was fatty meat that was grey. It was super gross looking. I took a bite and it was pretty delicious. However I had to spend some time picking out the gross fatty pieces.   As for coming back in the future.. not for awhile. My boyfriend and I can get Chipotle burritos with guac for that price so that is what we will most likely do. To be honest, it was disappointing since I thought it was supposed to be one of the best Mexican restaurants in the U.S.."}
{"text":"Good authentic Mexican food. I was a little worried when I pulled up because of how small the place is but it was good. Thank you Yelp for leading me here."}
{"text":"Warning!  This is not a place you go for the atmosphere.  You go there to eat the freshest and most authentic Mexican in town.  Takeout is great, but make sure you have all your items before you leave.  The food is absolutely fantastic and almost all the menu items are very appealing. If you do decide to eat in try to sit at the counter for the best service."}
{"text":"A friend brought me here for lunch while in town for a conference. We had intended to talk about our upcoming presentation but wound up talking and marveling at the delicious food. I had the torta covered in spicy sauce. More accurately, swimming in, not covered. It was amazing. I'm so glad I ordered the horchata too- that sauce was spicy! My friends ate tacos, which I gather were also great because they were gone before I could get a bite. The guac and chips had to be made in house- so, so good.  I had to write a review immediately so that I wouldn't forget this place!"}
{"text":"Maize Mexican Grill is one of those places that has potential to become big but they seem to enjoy themselves in the size they are. This place is located on an intersection and parking is very tricky. It is almost always full of students for two reasons, one is their food quality and two is the prices. I don't think the quantity of food is too much so there is nothing left to take home at the end. Nice and clean location with limited sitting.   They have different menu choices but basically the same food arranged in different way. That doesn't make is less tasty. Actually food is delicious in all forms and I highly recommend you try all of the different forms of your favorite meat or vegetarian dish. They keep this place tidy despite being very busy and having rapid turn over of customers."}
{"text":"Best place to eat on campus by far. Authentic food, lots of taste. If you haven't been there, you are missing out.  The guacamole is incredible. My favorite things to get are sopes and tlacoyo. Get them fried, trust me."}
{"text":"I came here on a Saturday for lunch and it was packed so we took our food to go. By the time I was able to eat my torta ahogada, it had already soaked up all the spicy sauce it was swimming in and was soggy and quickly disintegrating. Normally I'm pretty tolerant to spicy foods but all I could taste was spicy. My friend got 3 fish tacos, which were super tiny. He was still hungry afterwards so he had san other full meal. Overall, it did not live up to all the good reviews I kept reading about on Yelp."}
{"text":"Love this place. Especially the Tlacoyo chicken."}
{"text":"I would certainly not go out of my way to eat here again.  Nor would I stop again if I were driving by.  They do have great reviews on Yelp.  I wanted to be as objective as possible when I wrote this review.  Here is my opinion and it is my own opinion so no haters please.  The chips were way too fat and greasy.  The salsa had a strange flavor but I liked the kick it had.  I ordered a chicken burrito to go.  It came out very quickly which was really good.  But I really found the burrito to be a let down.  It wasn't bad though.  It just was not what I would call great.  Maybe I should have tried something else."}
{"text":"A-MAIZING!!  One of the most wonderful casual restaurants in the CU area. You just have to try it!"}
{"text":"Until this restaurant starts taking seriously the problem of people using the handicapped parking space in front of their business as \"I'm just running in for a second, no big deal,\" I'm not coming here anymore. I've talked to the people who work at this business several times about this but nothing ever seems to change and they don't take it seriously. I'm sitting outside right now looking at a warning sign that a vehicle could be towed and their gigantic handicapped reserved sign for the space but none of that seems to deter the extremely selfish undergraduates who continually park here. I've contacted the city about this and they said that the only way that anything can be done about this is if the business owners themselves do something about it. Calls by patrons to the police are therefore useless. I've attempted to talk to people who park in this parking space and usually the reaction ranges between complete apathy and actual anger and ugliness on the part of the offender. It's mind bending to me that people behave this way, but it's up to the owner and employees of the restaurant to enforce the fact that the handicapped parking space is required by law, is next to the front door because otherwise it would put someone needing to use the yellow lined space next to it in danger if they had to maneuver using a smaller space around the side of the building, and that the yellow lines are not just empty space to use at whim, either. The people who do this are all able-bodied and young. It's obvious that they really don't care, nor do the owners. Imagine it this way: what if anybody of African American heritage had to pay a fee, or found that there was some special password that they had to know in order to enter the establishment, and that otherwise they would have to park 2 blocks away, wait 20 extra minutes for their food, or something along those lines? People would be up in arms because that's obviously racist. But since this concerns the disabled who usually are treated as invisible, the owners and employees of this business seem not to care. This is ableist. When these selfish undergraduates park even for 5 minutes in this space it sends the message to anybody who might be disabled wanting to park in front of the business and enter that their needs are not important because the business is not truly committed to accessibility, and that they are basically not welcome at this establishment. I've been living in Champaign for 4 years and have brought this up continually and nothing has ever been done about it. Horrible."}
{"text":"This is my favorite restaurant in Chambana!!! And it's pretty plain to see that this is a nearly unanimous consensus.   I've been there dozens of time and have had just about every item on the menu -- everything is absolutely delicious! My all-time favorite items are the al pastor torta ahogada and al pastor/carne asada buritto.  Growing up in Colorado I've had plenty of delicious Mexican food and I have to say that this is some of the best Mexican food I've ever had!"}
{"text":"Nope, gave them 3 chances to impress and all three were rubbish!!!"}
{"text":"Best Mexican around.  Might actually be one of the best restaurants around.  Almost everything is done from-scratch and the tiny dining area serves for a cool/different atmosphere."}
{"text":"After south texas, this is as real as it gets when it comes to authentic Mexican food. 1. Tacos are just perfect especially \"AL pastor\".  2. The Carne platter was finger licking good! 3. The tortilla used taste fresh and homemade  4. The veggies especially the avocado is by far the most fresh avocados you can get at a restaurant.  Will visit again and even bring a few people along!"}
{"text":"Maize Mexican Grill is by far the best Mexican food in Champaign-Urbana. It is the only Mexican place that does not taste as if the food just got re-heated in the microwave. While they are not as cheap the other Mexican places in town, the quality by far trumps the cost and quantity you would receive at other places.   I have tried a variety of their items. I really like their fish tacos and veggie burritos. The sopes are very delicious as well. Also, the hot and mild sauces that come with the tortilla chips are very good. As stated in all the other reviews, this place is very small and have limited (3) parking spots, making it very hard to obtain food when you have a craving for it. You can always call in your order for pick-up but there is still the issue of finding parking to go pick you food up. What I would suggest is they get a FOOD TRUCK that is goes around campus town, where they make some real bank. Despite this big negative of space and parking, the food makes for a worthwhile trip."}
{"text":"Mexican food that tastes authentic is hard to find. Maize is a place that is able to achieve this Mexican taste which is not drowned in cheeses or sauces which can ruin Mexican food. The menu is small and not complicated with straight forward Mexican food options. The food is also relatively cheap, for about eight dollars you can get a filling authentic meal. Best of all they make their own masa base, While waiting to order i saw a Mexican lady kneading a huge amount of masa dough for the tortillas, and even saw a man hand making the flautas. With fresh masa as a base of the dishes, it was hard to not order the whole menu to see the different applications of the masa dough  I ordered three items from Maize. The first item I tried was the carne asade burrito. The first thing that I tasted was the juicy steak, it was seasoned well and very juicy. it was not dry and burned as if it had been sitting in a tray just waiting to be reheated multiple times.  The beans, lettuce and the queso fresco help to bring a balance of creaminess, saltiness and crunch to the burrito. The burrito is also a great value at five dollars, it is quite hefty with plenty of juicy steak in it which is always key. I next had the Tlacoyo with chorizo on it. The chorizo was a great highlight. It was not dry and very flavorful. Many places when cooking chorizo overcook so it gets burned. The chorizo also was not overly greasy. The Tlacoyo was stuffed with beans fried and topped with sourcream and a blend of cilantro and onions and chorizo. The Tlacoyo looked like a tostada but with Masa that is fried. he saltiness of the chorizo blended well with the sourcream and onions which made me wish I had ordered more. When you bite into it, you first get a crunchy bite with  the Masa and then chorizo, sourcream and onions melding with it to give you a perfect crunchy bite. For three dollars, it it quite satisfying. The last item I ordered was a chicken huaraches. The huaraches are similar but are not studded with beans. This item was also quite good, the chicken moist and tender. The vegetables on it tasted fresh as the tomatoes were still firm when eating the huaraches. i got the huaraches grilled instead of fried and it made the masa more moist and chewy, almost like a pita. Having the huarache grilled, was a palate cleaner as it had certain freshness of summer food in the winter time.   i think even Anthony  Bourdain would love eating at this place. The food this laces produces looks similar to the food he eats on his shows.  This Mexican places is a small restraint with barely any room to sit, but its simple Mexican flavors will have me coming back to eat."}
{"text":"Awesome food. This little place just sprung up a few months ago, and it looks like it is here to stay (I sure hope so at least). Maize always seems like it is busy, so I decided to try it out. Great food. I like how the burritos are prefect sized - I can eat one without feeling stuffed (unlike a Chipotle burrito, not that that is bad though). Really friendly staff, and a small bag of Chips and salsa comes with every order. The inside is small though, so if you walk in and order, be prepared to wait a little (less than 10 mins though) in a small space!  I used to be an El Charro fan, but since Maize moved in I haven't gone since... and I haven't really missed it either.  Pros: Great food. Decent prices. Friendly staff. Chips and salsa with every order. Orders don't take long (I can call an order in and by the time I walk over it will be ready!)  Cons: Small location, not a whole lot of room to wait around for your order or to sit down and eat. Really busy sometimes."}
{"text":"This is the closest thing to authentic Mexican food you will get in champaign-Urbana. The carne asada tacos are good! Most Mexican restaurants in champaign  have ground beef tacos with some red tomato sauce, but maize has some great tacos! Their menu variety isn't too big but what they do have is pretty good!"}
{"text":"Serious little hole-in-the-wall spot.  They may have seating for a dozen or it may be a little less.  Glad I found them because I had a killer lunch there and it only took about 15 minutes from start to finish.  I walked in for a late lunch but the place was still swamped.  I didn't see a menu board but I did see a sign that instructed me to order at the register before finding a seat.  I asked the guy what was popular and he pointed me towards the Tacos Mexica.  I ordered those and he pointed me towards a nearby seat.  I noticed that the next few people in line behind me ordered in Spanish and took that as a good sign.  Canned soda which translates to no refills but the chips and salsa assortment made up for that.  Their salsas are served in small ramekins, each with a little spoon.  They range from medium to hot and pack a lot of flavor.   The Tacos Mexica are small \"street taco\" style tacos with a twist: they melt cheese on the corn tortillas before adding your choice of meat.  I went for carne asada, chorizo and al pastor.  I knew that I wouldn't make it through all three and the chorizo was the one that I decided to leave after a bite or two as a little chorizo goes a long way.  Of the three, the al pastor was the one that really stood out.  The pork was succulent and just a little bit spicy while the pineapple brought a delicious sweetness to each bite.  The onions added crunch while the fresh cilantro brought everything together."}
{"text":"My brother (Pat E., Elite Yelper, Pancake Lover) suggested we try Maize for lunch instead of our usual SUnday fare (eggs, pancakes). Our stomaches have been programmed to eat brunch style food on Sundays for as long as I remember. I'll be honest, I was a bit nervous going for Mexican, but it turned out to be a great choice!  We arrived around 12:30 on a Sunday afternoon. The restaurant was jam packed, which is not surprising because it's the size of a panic room. There's about 12-15 seats total in the place, and it's definitely crammed. They are actually in the process of opening up a sit down place in the area, and per one of the workers, it's in the final stages of opening.   This was my bro's 2nd time here, so he took the lead. He ordered a ribeye taco, a fish taco, a hultihoche (corn smut) quesadilla, and a steak tlacoyo. The tlacoyo is bascially an open faced taco.  I ordered a steak (carne asada taco), a chorizo taco, a pumpkin flower quesadilla, and a pork (pastor) tlacoyo. We both decided to ask for our sour cream on the side for our tlacoyos, because we like being in control, and we wanted to use the SC for other dishes.  Only one word can describe my meal: A-MAIZE-ING (I'm sure I'm the first person to use this)!  Our food came out promptly. Our drinks were always full, and everything was extremely flavorful, including the salsas that came with our chips (we each had a few).  The tacos were topped with cilantro and onions. Quick note: Everything here is made with corn tortillas (get that white crap outta here!) Also, gluten free, if you swing that way. The carne asada was so good, and they didn't skimp on the portion size either! The chorizo was zesty but not spicy, which I preferred. I was expecting it to be sliced up like a sausage, but it was actually ground chorizo. Either way, the tacos were amazing! My only complaint.... too small! But for 2.25 a taco, a very fair price.  The pastor tlacoyo was the first dish I actually dove into. Topped with cheese, I added my sour cream quite liberally anyways, and I did not regret it! The pork did not have as much flavor as the other meats, but that's not to say it was bad. Still very good!! I added the darker salsa to the tlacoyo, which may have masked the flavor of the pork, but I'm not sure. You have the option of grilled or fried for this dish, and I went with grilled.  Finally, to the quesadilla, my favorite part of the meal. Filled with cheese and pumpkin flower, this was the best tasting dish for me. I also liked how the quesadilla came with lettuce and tomato, which can be placed on top or eaten by itself, which is what I did, along with the lighter salsa. At the end of the meal, I added sour cream to the top, which was amazing!  All in all, our 8 dishes added up to 25 dollars. Very reasonable for the amount of food! If you decide to eat here, yes, it's cramped, but I thought it was a cool experience. I thought it was weird how a group of 3 adults came with a baby, and nestled up in the corner. Not really a great place for kids, let alone babies.  There were plenty of to go orders being placed and picked up while we were there. They are very fast in the kitchen!  Highly recommended! After my last mexican dining experience (Fernando's in Chicago), this was the polar opposite. Great food, service, prices, and memorable, for all the right reasons. I can't wait to head back for my next visit!"}
{"text":"I can't say enough great things about this place.  Employees are nice and very efficient. Food is excellent!  Eat here twice a week most weeks.  Never get tired of it.  Must try if you're in the area!"}
{"text":"This hole-in-the-wall location is perfectly lovely. Believe the hype, people. My Texan friend complained that their tacos weren't spicy enough, but I'm sure you can let them know to up the spice level for you. I love that they make their own corn tortillas (which are gluten-free, friends). They also fry or grill any meat of your choosing. I met the owner once to interview him for Best of CU for Buzz, and he was the sweetest guy from Mexico City. He recommends the authentic fish tacos. I love their pumpkin flower and corn fungus quesadillas and their chicken volcanes, but all their menu items are perfectly delicious. All orders come with a side of chips with two types of lip-smacking salsa.  Rather long wait sometimes, but just go at odd hours or endure the wait. They have an array of authentic Mexican sodas waiting inside as well. Seating is rather fickle and sparse, so get ready to carry out unless you're eating plus one. Enjoy!"}
{"text":"Went here with my girlfriend and the staff was very friendly.  She got the chalupas and I got the fajitas. Both dishes tasted amazing!  I could tell that everything was made in house and the cooks took pride in their food.  The atmosphere was hectic but  that's to be expected because it has very limited seating and most of the patrons do carry out.   One of the girls working said they were opening a dine in location at some point.  Sooner is better as I can't wait to sit down to a good meal from here.  -one star off for limited parking and very limited seating."}
{"text":"HANDS DOWN MY FAVORITE PLACE IN CHAMPAIGN/URBANA.   I have been craving real Mexican food since I've moved out here for school and it definitely fulfills the feeling of real Mexican food. It makes me feel like I'm at home. Good service and fast. I can't wait to visit more times!"}
{"text":"You don't go here for the ambiance or comfortable tables.  It's all about great food at a great price.  We dropped our son off for college and went for lunch.  Wow!  Fresh, tasty, and large portions.  This is a great place."}
{"text":"This place is good. I got a huarache with squash flowers the first time, and a chicken burrito the second. Both times the food was super fresh, and the base for the huarache was home-made I think. A friend mentioned that they forget to add salt...that might be what is missing? Also, I like really hot salsas and theirs are extremely mild. I would say the taco truck at Bradley and Prospect is my first favorite for Mexican food here, and Maize is my second favorite. Then maybe the Mexican grocery on Green is my third favorite."}
{"text":"I enjoy the authenticity of the food, but I think it lacks flavor sometimes. Their chicken isn't always my favorite.   I do think that their service is very good for the amount of traffic that comes in, but don't go in and expect to have a ton of room to stand around. It is quite busy and it is not a big space. They are quite nice, and they do give you chips and salsa with an order over $5."}
{"text":"One of the first things I said about this place when I came here is that it seemed just like a taco stand in Mexico. It's super small with just about 15 bar style seats in the place. All it needs is to be completely outside, and that's as authentic as it gets!  My partner got the tacos al pastor and said they were just as goods as ones we had in Mexico. I opted for the potato flautas and they were pretty good as well. They came on a full plate with rice, beans, pico de gallo, and guac and I'm not gonna lie, it's a lot of food, but its perfect. I wasn't a huge fan of the rice, but I'm really picky when it comes to Mexican rice. I did like the potato chunks in it though.   You get chips and salsa set in front of you almost the minute you sit down (if you're lucky enough to get a seat), the food comes out ridiculously fast, and it's good authentic Mexican food. I will definitely go back whenever I'm in town."}
{"text":"I was really happy when mas amigos opened because im from california and i like tacos  this is The best Mexican food in town by a long shot.  If you're against dairy you're going to have some problems cause pretty much everything is covered in nice fresh cotija crumbly cheese and slightly sour and delicious crema which I love but could be bad for the lactose intolerant."}
{"text":"This place is so small they have less than one table.  But it's worth squeezing in.   In a nutshell, it's the kind of amazing Mexican place that I remember from my youth in California. I never thought I'd find anything like it in the midwest.  After eating at Maize I may never be able to eat at another mexican place in Champaign-Urbana -- they all compare so poorly to this one.  Beware, once you eat here there's no going back!  I have tried the fancier and more exotic fillings on the menu (the pumpkin flower and the mushroom) and the more authentic formats for them (huaraches, taco mexico) and they were all good, but I liked the \"standards\" even better. If I were you, I'd start with the simplest: tacos pastor with cilantro and onions. Amazing!  Just amazing."}
{"text":"TL;DR (out of 5): What is there to say about Maize (Mah-EEze, tyvm) that hasn't been said already?  It's hands down, the most authentic Mexican meat in a corn thing in the Champaign-Urbana area - and I know my Mexican meats ;] Are they super fancy, foo foo, queso this, fajitas that? No - and that's the point.  If you want tacos and horchata, Maize is the place to go.  Just be ready to get friendly with some frat boys or take it to go.  Food: 5 Atmosphere: 4 Price: 4 Service: 5 Decor: 4  I discovered Maize my freshman year of college and was absolutely confused by the place - no place to eat and I ordered a torta ahogada (Mexican sandwich drowned in spicy red sauce).  But since then and for the last 5 years, I don't think I've gone more than 10 days on campus without going to Maize.  Oh the things I could delight on about Maize.  But I'll keep it short(er than usual).  Over the last few years, they've improved their salsas, bettered service (as much as is possible in a tiny hut), and increased prices (Facebook update moment, but of course, people still stick with and love it).  If you don't care about what kind of meat you put in your mouth or if you want your food doused in queso or sizzling or something, go elsewhere.  But if you want quality, authentic, no frills Mexican food, go to Maize.  Taco: $2.75 Taco Mexicana: $3.25 Tostada: $4 Horchata: $1.85  Tips: - on thicker, crunchier bases (tostada, sope), get chorizo or pastor; the juice/flavor will soak into the base and be that much better - try the gordita chicharron; \"pork back\" is basically just bacon; bacon taco? HOW not? - try a quesadilla with zucchini blossoms or huitlacoche, SO good  Oh and house-made corn tortillas and free freshly-fried chips.  None of that Tostito's looking, thin, straight out of the bag kinda' chips.  Leggo."}
{"text":"I have been in Champaign for two years. Having been raised in Los Angeles and lived in West Texas I've had a taste of many types of Mexican foods.   Maize is the real deal. Authentic, flavorful, and addictive. I love this place. It's not for those on a diet or looking for light substitutes--the plates are meaty, and sometimes greasy.   I have tried almost everything on their menu and everything is good. My favorite are the tacos Mexica--it's like a quesadilla taco. Amazing!"}
{"text":"Probably the best Mexican place near campus. Order online or through phone beforehand to skip the wait. Dishes are very authentic and I'll come back once a month at least. Parking spots are limited, as well as dining space."}
{"text":"We tried the chicken and pork burritos. Both meats were salty, like they were shredded and mixed with Campbells soup. You get 2 sauces with your meal. The tomato looking one seems to me like a can of Rotel tomatoes, nothing else, very bland and watery. The brown/yellow sauce is very bitter and kind of an unpleasant color.  I ordered a side of guac, it was tasteless and the bottom of the bowl was full of lettuce so you dont get much. The only reason I can see that it would get high stars is because of the portion sizes, it is right by a college campus and a $6 burrito is huge.   I liked the bottles of cane sugar sodas. I liked the fresh lime wedges with my meal. The chips were good, seemed home made possibly.   I would never go back."}
{"text":"Unusual Mexican food, and not in a good way.  Low in spice and oddly sweet.  I've been twice and ordered different food.  The chips are okay.  The burrito was okay.  However, the Chile relleno special was not at all special.  I couldn't eat half my plate because they put avocado on it and I'm allergic, so I wouldn't be happy even if the rest of the food was good.  The Chile itself was adequate, though the filling seemed to be made with mashed potato (an innovation I didn't care for).  The beans tasted canned and the rice was sweet.  It was served with tortillas that were heavy and bland.  The atmosphere itself is a crowded little counter, so really a take out place."}
{"text":"The constant line of customers out the doors says it all - Maize has the best Mexican food! Every time I stopped by, I had to wait in line because this place is so popular. However, the wait is not too bad since so many people order to go and is totally worth it for the delicious food you will be enjoying after the wait.  The store itself is extremely tiny, so it is always quite crazy inside, with people eating, waiting and squeezing through to grab a seat. They serve free chips with two types of salsa and the food portions are very filling. Tacos seem to be a favorite among the customers but I have tried the burrito and torta which were both great."}
{"text":"The business owners and employees are awesome and fast. The horchata is delish. It's the best mexican in town. Just go there."}
{"text":"Ok, the FIRST time that I ate at this place it was ok.  But let me let you all know something a couple of months ago, I went into this lil box of a restaurant and ordered the 3 steak tacos like I ALWAYS get. Two hours later I was woke out of my sleep in excruciating pain and with PROJECTILE VOMIT!!!! I wound up in Carle Hospitals' emergency room with stomach cramps and nausea!!! They really messed me up! I will NEVVVVA EVVVVA eat at this place again. I really wanted to call a lawyer ANNND THE CU HEALTH DEPT. but I'll just settle for telling ANYONE WHO WILL LISTEN not to eat here UNLESS they're ready to DIE! BOOOOOO!!!"}
{"text":"Best Mexican place around! The pastor burrito is a must. The best al pastor I've ever had. You have to stop here whether you're visiting U of I or passing along 74. Worth the detour for sure! Cheap and phenomenal cusine - always a winning combo."}
{"text":"OMG! I love Maize. My only sadness is that I can't eat wheat and corn right now - making Mexican food hard to stomach. But - the quesadlla with mushrooms and chicken! And the tlacoyo with pastor - the best! They're really fast and friendly. Highly recommend."}
{"text":"This is a small establishment with about 5 parking spots. There are about 16 counter seats.  We ordered Carne Asada and Fish Tacos (around $3 per) which were both tasty and not too greasy. We were recommended another open faced item on fried dough which was great as well. Chips and Salsa were offered as we waited for our tacos. The food was tasty/fresh, service was efficient, and overall a positive experience. Whoever was running the cashier was super patient, had a genuine smile, and was very calm even when it was busy (which seems like the line is always out the door). Can't wait to go back!"}
{"text":"Great little Mexican place, best for take out.  Can't wait until they open the larger restaurant downtown."}
{"text":"One of the best Mexican restaurants I've had on campus. The service is great, fast, and efficient. The quesadillas are some of the best and the tacos are very filling. I love that you get chips and salsa with your order, especially the salsas they serve. One is a little spicy but then the other is not but also has a freshness to it. It's also great to see that there is a vegetarian/vegan menu for those who obviously don't or can't eat meat among other things. Definitely would recommend to lots of friends. Oh! And the prices are definitely not exaggerated. Every bite is worth it."}
{"text":"Tacos were phenomenal. (Got steak and pastor) both seasoned/marinated very well lots of flavor. Tortillas must be made in house or something. They were amazing. Gave the tacos a totally different flavor. Husband got a steak burrito also very good."}
{"text":"I ordered a burrito and the majority of it was lettuce, with barely any steak. At best, the rice, beans, and chips and salsa were average. Not sure why it is almost five stars. Average food, priced high."}
{"text":"Great for take out - ingredients so fresh you'd swear they were grown out back. I'd eat it every day if I could."}
{"text":"Never disappoints, the carne asada burrito is delicious. The service is fast and friendly. You probably should take it to go though, not much seating."}
{"text":"The food was pretty tasty but I feel the portions were really small for Mexican food. I know it's more authentic but I like the more Americanized Mexican food with bigger portions. I eat a lot so I don't know if that's why I don't get full but you can definitely get bigger portions elsewhere."}
{"text":"Just a great place to find a fine authentic meal at. I suggest ordering ahead of time!"}
{"text":"A+ for any Mexican food enthusiast! good for vegetarians too. Their tacos and burritos are my favorite, they also have delicious tortas. Completely authentic food and they also have Jarritos to complement the delicious food."}
{"text":"I have had a lot of tacos, these are probably the best. The exterior leaves much to be desired and seating is nil, but the hassle is well worth the incredible food. I strongly recommend the chorizo sope and the guacamole."}
{"text":"MAIZE IS MUCHO RICO!! okay, I never pull the write-in-all-caps-to-make-a-point thing, but I felt it was necessary here. Maize would be the only exception. since they've opened i eat their food almost exclusively. I've never had something that wasn't short of an orgasmic experience. I feel like a perv eating there cuz the whole time I'm moaning and saying \"this is sooo good!\" And the people are really nice too! Really great customer service. Then environment is legit. and always clean. I've never had to complain about anything ever. and when i say \"agua dehorchata with no ice please\"...get this, they never ever put ice. WAHH? \"Not even once?\" you say--nope, not even once. The only thing is, that the place is rather small so I pick take-out over sit-in most of the time. But they are new and I guess they didn't realize how much success they'd have when they first started out. but I sure hope they expand soon!!"}
{"text":"I expected MUCH more for the 4.5 stars.  Had asada flautas.  Below average at best.  Chips and salsa were average at best.  Sitting area is too small.  Would not return."}
{"text":"Got their asada (steak) burrito for $6.40 and medium horchata for $1.85. They give free chips/salsa for orders over $5."}
{"text":"Doesn't get any better than this in CU. Nothing fancy, nothing pretentious. Fantastic food."}
{"text":"So I've been twice now. The first time was crazy good, but I wanted to wait to write a review, just in case it was a fluke. It wasn't.  I just had the pastor (seasoned pork) burrito. Suddenly you feel like Chipotle is bland. This thing roars with lime and texture and spice. I had the spicy salsa--it's bright yellow and has layers of flavor. And the staff I've encountered are warm and quick to help.  This place looks like a hole in the wall on the corner of 1st and Green--I don't know what they're gonna do, but I hope this place is a permanent addition to Champaign and Campustown."}
{"text":"I ordered some traditional chorizo tacos. Really the best thing in the world. If you want some authentic Mexican food then this is the place."}
{"text":"Great new place. The food was very fresh and light, but incredibly filling. I got a chicken burrito, while my husband got two tacos and a chicken quesadilla (the tacos and quesadilla were small-ish, but made a great meal together).  Will definitely be back again! I think this may become a regular carry-out for us. Too small to go to with a group, but great as a grab-and-go meal.  As for the parking - I recommend using the meters across the street behind Domino's. Waaaaay easier to get in and out of than the tiny parking lot by the restaurant."}
{"text":"Excellent food, excellent value. Favorite Mexican place. Order huaraches with chorizo and you won't be disappointed. My bf likes the corn fungus in a fried quesadilla - I'll pass. Chips are various salsas are also delicious and different. The only downside is that it's small and can be crowded, but it's worth the wait!  To the people comparing this place to El Toro and Dos Reales - really? You've go to be kidding.   The chicken tacos are a little bland, I will say that."}
{"text":"You know you've found a good deal when you see undergrads lined up out the door.  I don't know how this place turns a profit at the prices they charge.  I got two items, both under $3 each, and they gave free chips and salsa (good and spicy salsa at that) with my order.  Their chorizo is excellent and all the ingredients tasted really fresh.  It's impressive seeing the waitstaff team go to work during rush hour, running with the speed, friendliness and efficiency of a championship McDonalds staff."}
{"text":"You know what I really wanted to like this place because of the hype. Decided to try a torta never had one tried it. Well it was awful I will give them another chance but it will be a while."}
{"text":"this is very good food at a great price; the girls behind the counter are very nice and help you with any questions you may have about the menu...if you love cilantro and lime you will be in heaven.  Tiny dining space...but I fit at the counter..yeah"}
{"text":"This place is delicious and the service is quick. Only downsides are that seating is limited and cramped, and also the vegetarian options are less than impressive.  While I was eating meat though, this place was a favorite."}
{"text":"Really good and crowded! Unless you're getting here really early don't plan to eat at the place.  I don't know much about authentic mexican food so take this with a grain of salt but enjoyed the food. I could taste how fresh everything was. It was a good find.   P.S.- lots of construction right now so parking is crazy."}
{"text":"Best Mexican food in Champaign. Great service and price. Usually very busy on the weekend so weekdays are best for speedy service. Love this on campus gem."}
{"text":"Fantastic. I got the chicken flautas which came with rice and beans. They were covered in sour cream and queso fresco and had a side of guacamole and Pico de gallo too. My friend got an Asada burrito I think and she enjoyed it a lot too. Will definitely come back."}
{"text":"Anything you get here is great. Really. I always tend towards the pastor because I am a pork fan, but the chicken or steak are all great too. Whenever someone visits me from out of town, the two places I take them to eat are here and Black Dog.    The only person I have ever known who doesn't like Maize was one of my old roommates... but he also used to put ketchup and cheese on bread and call it a meal, so take that with a grain (or heaping mound) of salt."}
{"text":"Finally, finally, finally after years of trying mediocre fiestas, toros, haciendas, and even chipoltes---there is finally a place in Champaign-Urbana to get delicious tacos. Amazing corn tortillas made daily, fresh ingredients, chile de arbol, and salsa de molcajete  are more than enough reason to support this business.   In addition to the food (I had the fish tacos--a bargain at $2.75 and the most expensive taco on the menu), the staff was super friendly and the 6-stool eatery made for an informal yet enjoyable dining experience. Check it out, you won't be disappointed!"}
{"text":"Yittty bitty!  I celebrated my 37th birthday, here, with my husband, and baby sister!  It was asses-to-elbows at the countertop, but the food was fantastic.  Service was a little slow, but the chips and salsa kept coming, and the company was great, so it didn't much matter.  The long and short of it is this, however-- five years later, and I still haven't been back.  The food was _fine_, but I didn't quite see the reason for all the hype.  I mean, Dos or Escobars... plenty of other fish in the sea.  Still, a fine spot for a quick bite."}
{"text":"Nothing is better than a fish taco from maize! I seriously crave them! You can't go wrong w any of the tacos honestly."}
{"text":"Consistent quality, tasty Mexican food at a reasonable price. One of the best options in town for Mexican."}
{"text":"What this place lacks in size (it's tiny, but in the best way) it makes up for in AMAZING food. Though you might have to wait a while to order-it's definitely a popular place on campus-the food is totally worth it.  You really can't go wrong with anything on the menu, and and you gotta love the homemade chips and salsa. And don't forget the guac, oh the guac! It's a must order.  My advice: make some time and give this wonderful place a chance. You won't be disappointed."}
{"text":"All was very good had the burrito with Kearny Asada and a taco with  pastor both needed more meat but what they gave was very good.  The Home made chips and salsa were the bomb! Very nice wait staff very friendly."}
{"text":"Came to this place for the first time and let me tell you the food was delicious and fast! What sold me was the handmade tortillas can't go wrong with that on a taco. Overall this place is worth it! If you're craving Mexican homemade food"}
{"text":"Does this place even need another raving review?? Yes, of course, because it is that good. I have never had corn tortillas this amazing in my life. I love this restaurant, and I want one of their t-shirts so I can walk around and advertise for them. Fantastic food, can't go wrong with anything on the menu. Go!! Eat at Maize!!"}
{"text":"Just passing through on our way from WI to Indy, we stopped because of the positive yelp reviews and we were trying to make time on our trip.    A few things stand out:  1.). Yes the place is small...however we found seating as soon as we ordered as the turnover was quick +1  2.). The staff was very friendly +1  3.). Chips and salsa were delivered almost instantly (and free) when we sat down and noticed that's the standard here.  The chips were firm and thick, solid combo with the spicy two salsas they served +2  4.).  Prices and food both good, bordering on great! +1 (I had the burrito and a taco americano with chorizo, the burrito was delish and would have been enough by itself )  5.). Speed - we were in and out in 20-30 mins"}
{"text":"Delightfully filling with quality ingredients. Extremely quick service and low price. I HIGHLY recommend eating here!!"}
{"text":"Maize will always be my go to spot in Champaign-Urbana. I have so many memories here. The food here reminds me of the food in Chicago and it has a very homey feeling. It's close to campus. The food is delicious, authentic, and cheap. I always get burritos, tostadas, sopes, tacos, or tortas. It's a small place and gets very packed, but they run the business very efficiently and fast. You will get your food almost immediately."}
{"text":"Best Mexican food at UIUC in my opinion.  It's cheap, tasty, and has good authenticity.  All of the employees are super friendly and good at their jobs--the food is made fresh and comes out as quickly as it can.  It does get really crowded sometimes (it's a small restaurant that seats maybe 15 people) but turnaround time is quick so that's never been much of a problem.  I'd definitely recommend stopping by!"}
{"text":"Delicious authentic Mexican food.  Small area for seating. Restaurant gets crowded around meal times but food never takes longer than 10 minutes to pick up.   Most of their business is carry out and parking is limited.  Awesome for UIUC students."}
{"text":"By far...the best tacos and salsa in the Midwest. There is not a taquiera that can compare in the region. Only comparable taco stands are san loco in Miami Beach and Tacos Locos in Brooklyn. This is a legendary taco stand that should take you way out of your way to try. I would go so far as to say, stay a night in Champaign so you can hit Maize once...or maybe even twice, during your visit!"}
{"text":"Died and gone to Mexican Food Heaven! They must have angels in the kitchen cooking for the food to be as good as it is!  The guacamole is a gift from on high and when you add it to ANY of their dishes-it elevates already perfect food to sublime.  The Devil is in the details and those details include the freshest ingredients, friendly and efficient front staff, great variety on the menu, and the best Mexican food I've ever had in my long lived life-and I am a Mexican food fiend. Now, if I could get them to set up in Atlanta, I really would be in heaven!"}
{"text":"Don't get me wrong, the food here is really good, but I just don't think it's amazing like everyone talks about. The guacamole was awesome, but a little pricey in my opinion. Granted, you get a ton of it. Overall, I thought the food was pretty good but didn't live up to the hype."}
{"text":"Problem 1: This Mexican restaurant did not have melted queso  Problem 2: Very inconsiderate to mistakes made on off menu dish prices.  Problem 3: Doesn't have Chicken, cheese and rice, or normal flavored margaritas- like come on.   It's a no from me."}
{"text":"3 and 1/2 stars Volcan is the bomb- I love the steak volcan but my husband swears by the volcan pastor. We don't live in Urbana anymore but we always make sure we come get their volcan if we are in town. My husband gets volcan pastor, and I get their steak volcan. Both are perfect, along with their chips and salsa - especially the habanero salsa (yellow one). Pro tip- the habanero salsa is very very hot and should be ingested with caution.  I gave only 3 and 1/2 stars because the entrees are not impressive, and seems a little scanty on quantity- given that we are used to huge portions in the usual mexican fare at all other places we have been to. I recommend the volcan- it's cheap, filling, and delicious!"}
{"text":"Authentic and tasty, no question. Enjoyed a burrito con al pastor, which had that lively, slightly sweet flavor. It was excellent and plenty large. The salsa is clearly made in house and is also delicious (and comes with the meal, I might add). As good as Mexican gets in CU. Here's to hoping the steady volume of traffic I've noted driving by (and visiting the once) continues."}
{"text":"I absolutely love this place. Best Mexican food in CU hands down. I order the chips an guacamole to start, and then the chicken fajitas as an entree. The portions are huge and I had enough for 2 meals. The food was so satisfying and delicious. My boyfriend and I got lucky and actually got a seat at the window, but I always carry out. Their horhata is also very delicious, I come here all the time."}
{"text":"Loved the food, begging from Cali it almost felt like I was home in SanPedro or LA getting a good burrito. It's really some so it makes it hard to be comfortable but it makes you get speedy service and eat and go no lingering around."}
{"text":"Great food!  Love the guac and hot salsa.  I wish they could get more parking spaces, and hopefully they get that other location open soon!"}
{"text":"This was a recommendation by a recent U of I graduate. If she learned nothing else in college, she learned where the good places to eat are located.  We got to Maize about 5 minutes before they opened. The staff was eating and the door was still locked. While we waited,  a line began to form. The door opened and the line kept on going all day long. We had tacos, nachos and a burrito. All excellent. Staff was pleasant and helpful. It is not fancy and it is all counter seats, but Maize is a very worthwhile stop.   Limited free parking."}
{"text":"Awesome Mexican food! Would recommend tortas and fish quesidilla for sure. The place is small though, so taking out parcel is suggested."}
{"text":"My favorite food on campus. It's close by my apartment, so I get it all of the time.   My personal favorite is the carne asada, it's easily the best meat they have.   Make sure you ask for mild or hot salsa with your chips, otherwise they give you a random one. If you're like me and you don't like hot salsa, that can be an issue."}
{"text":"Maize, what can I say about you? It was love at first bite.  This is authentic Mexican food in Champaign. The chicken, fish, and ground beef burritos are amazing. The ground beef, chicken, and chorizo tacos are great. The volcano taco is fantastic. Catch my drift? And free chips with any order...what more could you ask for?  Well if you want to get specific, my only complaint would be that the place is small and so is the parking lot (5 spots maybe?). It's always crowded, but always worth the wait. Call and place your order in advance so you can skip the line."}
{"text":"Food here is good! I have tried different items and have always liked it. It's one of the few good Mexican restaurants in the area.   However, the place is just too cramp. There's barely any space to move around and definitely no personal space during busy hours. It's only good for take out."}
{"text":"As good as Mexican food gets in Champaign! I like the al pastor and steak tacos. There torta is also delicious! Oh and the salsas are great! Best horchata in town too!"}
{"text":"Forget campus town, this is my favorite food spot in the entire C-U area. Killer good food at a fair price. The lines do get long, it might take a while to have a couple of seats open up, and you might have to park in a meter lot across the street, but the food is so so worth it. Miss Champaign, and miss Maize!"}
{"text":"This place is top-notch for takeout! The pastor is among the best I've ever had. The seating inside is too cramped for me so dining in isn't great. I like to take my food to a downtown bar to enjoy a beer with my tacos."}
{"text":"There steak taco was good,but I wish that didn't put cabbage in the lettuce because I don't like cabbage. I like there chips and salas.  I wish they low there prices."}
{"text":"This is mexican food like you would find IN Mexico, not here.  And that alone makes it a few notches above everyone else.  There is a lot on the menu i'd like to try, but the tacos mexicano are hard to pass!"}
{"text":"I still love this place, despite the cramped seating area!  I love their chips and salsas.  Their guacamole is great!   I LOVE their fish tacos --- I order them overtime.... and they even made me a fish burrito once as well.... that was also great!   I don't think you can go wrong with anything on the menu here.... yes, the restaurant is small, but it's a real bang for your buck."}
{"text":"Great price for some really good authentic-tasting food"}
{"text":"Tried the queso dip and Asada tacos. Never had queso like this before and didn't really know how to eat it. We ate it with chips and put some into the tacos. It is not gooey enough so I would pass on getting it again. Tiny shop with a handful of seats. Pretty good Mexican food for the area."}
{"text":"By far the best Mexican food I've ever eaten (and I lived in the East Bay for nearly a decade).  It's gotten to the point that I'm seriously considering faking a pregnancy to justify how often and how much I eat at Maize.  When I leave Illinois in the near future, this will be the only thing I miss.  I actually cried the other day thinking about losing it."}
{"text":"With so many other reviews, I'll explain shortly why I like this place:  -(Seemingly) fresh ingredients -Friendly staff that give prompt and thorough service -Delicious Horchata -Light and heavy options"}
{"text":"After reading all the rave reviews I had to check Maize out and finally this past week I had a chance.  I ordered for take-out, knowing that it would probably be packed and when I got there it was indeed filled with people.   I ordered a handful of items for me and my roommate.  I got a rib-eye taco, a chorizotaco, and a pastor taco.  The rib-eye was thinly sliced and was of good quality.  The grilling gave it a little bit of char and was tasty.  I did feel that it was a bit underseasoned and could have used a touch more salt.  The chorizo taco had your standard ground chorizo, but was delicious.  The pastor taco was the best of the three, great flavor and a touch of heat.  As others have mentioned the tortillas are handmade and they're fantastic.  A bit chewier than your typical store bought tortilla and adds an element of texture to their dishes.  My roommate got a fish taco, a carne asada taco, and a grilled chicken quesadilla.  He seemed to enjoy everything as well, but don't have much commentary beyond that.     Definitely a place worth visiting regularly, seeing that their prices are low and the food is great."}
{"text":"One of the best places to eat in Champaign. They have a great value for their food! My favorites are the burritos and the chips are delicious."}
{"text":"I was here a few weeks ago, looking for some lunch between meetings, and we decided that Maize was the perfect fit. It's interesting, local, affordable, and quite possibly the perfect lil' lunch stop in Champaign.  Here's what you need to know: this place is teeny. Tiny. Since I've only been once, I can't say for sure, but my hunch is that during peak hours it can be tough to find a place to sit. There are only a handful of seats in the place to begin with, but with the rush I saw on weekday at lunch, I was darn lucky to grab a few seats at the counter that attaches to the wall, looking out.  Cramped quarters notwithstanding (and truthfully, they sorta add to the charm), there's plenty to like. To my surprise, they actually bring out some chips and salsa, and it's a real plate kind of place. I thought that with its small size, you'd just see things served in paper trays or wrapped in paper. But I like the hospitality of real dishes and the extra nibbles while you wait for your food.  Even though the menu looks familiar--you've got your burritos and tacos and quesadillas--it's not the same ol' Americanized stuff. No, it's got some creativity to it. It's got some food service sensibility to it. Where else can you find squash blossom or huitlacoche quesadillas? Oh, and get the latter. Darn good. I'm not terribly familiar with different regions of Mexico, but the food here struck a chord as being tied more to Mexico, D.F., than say, something more provincial. I'm out on a limb exposing my ignorance, but that's my timid notion.  My burrito was the bizness. Not overly stuffed and the size of an infant, but rather, reasonably portioned, full of flavor, and still plenty of layers so it didn't become monotonous munching. I opted for pastor, but they've got other choices for meat, or you can go meatless.  You can probably go back a few times and it feels interesting. The menu is varied enough to be interesting and enticing, but not to overly wrought so they can't focus. They keep it simple, but save a few tricks for the observant orderer."}
{"text":"I am a taco snob! I am fully aware, but this place absolutely lives up to my expectations. I spent the majority of my 20's in Southern Cali so I've definitely done my research when it comes to tacos. The tortillas are made fresh in the kitchen, the meat is well seasoned and the toppings are perfect! I love the Lomo Mexica (not on the menu) which is basically the grilled cheese rib-eye taco. Yasss honey! The steak, fish, pork and chicken are great too (in that order) I have also tried their sopes which are totally yummy, but the tacos are definitely the main event! Stop by when you have time and patience to deal with the lines and limited seating. If I had to state one downside it would be the chips which are nothing to rave about but hey this place is A1!"}
{"text":"I didnt think that I would find a mexican food place that is this great on my college campus. I have been there many times and havent been disappointed once. The food is great. The service is great, they know everything there is to know about their food and they are great at helping you choose your meal. Service is fast. If you are ever in champaign, Maize is a must."}
{"text":"Very small and cozy place with really nice staff. Food was great and reasonably priced. Good place to stop for a quick bite."}
{"text":"this place is a hidden gem in champaign. arguably the best mexican food in town. salsa is awesome and tortas are just right. i haven't gotten anything that has tasted bad there.  parking is quite difficult during peak hours, but it makes the atmosphere that much better."}
{"text":"Very inexpensive and delicious Mexican food. I had the Vegetarian Taco for lunch, at a mere $2.50, and it was perfect. The line was going out the door, and the seating was limited, but it was a nice day so people could sit outside. I'd imagine they keep the prices low by sticking with a small, cozy space with plenty of character."}
{"text":"Yes, Authentic Mexican food that is oh so affordable. They even have pumpkin flower and huitlacoche tlacoyos. Try them and you won't regret it!"}
{"text":"It's small and quaint, but it's so good! I get the veggie burrito and it's quite large but doesn't over fill me. They also give you tortillas and salsa with every purchase, pretty nice addition. The salsa is definitely on the spicy side but it's great.   It doesn't take long to get your food either, very quick."}
{"text":"Every time I order from here I try and get something different.  Each and every single thing I have had is definitely amazing.  Real authentic mexican food!"}
{"text":"Very good tacos - fish steak and chicken all fantastic. Cute Cosy crowded interior but lots of character. Loved it!"}
{"text":"This place is awesome, I either get the tacos asada or the asada flautas... which are delicious, crunchy, and not drenched in oil! These are the only tacos on campus that I don't have to drench in lime because they are so tasty on their own. Their salsas are great too, with actual heat!"}
{"text":"Seriously loved this place! I went for lunch last week while I was visiting a friend at U of I - so glad she suggested it!   I got chicken tacos and they came with complimentary chips - love that, although I could've used a little more salsa. Since it was free, I can't complain. Tacos were SO GOOD. Very Mexican-street-food kind of tacos. yum yum yum! She got a torta which she said she's had before and loves. This will definitely be a regular place to hit up when I am visiting U of I!  Only downside was that we planned on eating there but it was packed so we ended up getting our food to go. Not a huge deal at all"}
{"text":"This place saved me. I struggled to find a good authentic Mexican restaurant near campus. The burritos and tacos are outstanding, and the presentation - complete with lime wedges and two types of salsa - makes for a wonderful experience. There is not much seating, but if you order and wait a moment you're sure to find a spot at the counter or at the window."}
{"text":"My review is not necessary here. You've read the other 300 reviews which rave about this place, and rightfully so. It's surprising to be able to get such great, quality and authentic Mexican tacos and sopes in my beloved hometown in the corn belt, but here it is, in all its glory. The homemade corn tortillas are wonderful. At the end of the day, all I ever really want is a mouthful of masa and salsa. This place delivers. The only thing wrong with Maize is they haven't opened a second location yet."}
{"text":"Been a fan since they first opened. Generally friendly, fast service--including from the owner. Of course it's probably the best \"Mexican\" in town, although the burritos and tacos (meat) can be a bit on the saltier side. Wonder if they'll ever get a more appealing sign though (and not just a flimsy banner?)"}
{"text":"This place totally lives up to the hype. It's awesome Mexican food and the price can't be beat."}
{"text":"Mexican street food, but phenomenal.  I ordered a huarache and horchata. I meant to order a tlacoyo, but something got lost in the translation; nonetheless, the single huarache was enough to satisfy my lunch needs.  The horchata was, as I recall, more cinnamony than sweet and overall a great drink. The huarache, however; that was something else. It was the best toppings of any taco I've ever had, with nice, crumbly cotija cheese, crunchy lettuce, and well-cooked steak (I think) al pastor. It was served on top of something that resembled a thick, fried tortilla, and the combination of textures and flavors worked very, very well.   The chips went to my wife, who, because the store has about 15 seats total, was on the other side of the restaurant. Nonetheless I was able to try chips with the various salsas, all of which were very good.  This place is a gift to Champaign, and if you're traveling anywhere near town, you owe it to yourself to give it a try."}
{"text":"one word.. TACOS. Maize has the the best tacos in town, in my opinion. The venue is reeeeally small, but that doesn't take away from the food they offer. Their pulled chicken that they have on their tacos is to die for. Writing this review right now is making me want to eat a taco from here, wow.   SO delicious! Plus it's affordable. Highly recommend."}
{"text":"This is a little hidden gem with the best Mexican food in town.  The place is very small and cramped, and there is often a line out the door.  However, the tacos de carne asada (steak tacos) are to die for - made with corn tortillas, cilantro and onions, just the way they are supposed to be.  The burritos are passable, but stick with the tacos if you want rather authentic Mexican food.  The price is not the cheapest compared to say, Dos Reales (another decent Mexican place in town), you do not get any sides and the drinks do not come with refills.  However, it is definitely more authentic.    Dining in at this place might feel rushed since it is so small - best get your food to go."}
{"text":"Excellent food and great staff. Small space to eat, but the chips and salsa make it an ideal place in Champaign!  I had the chicken and carne asada tacos and they were great!"}
{"text":"I'll start by saying I'm a foodie snob; I choose carefully and wisely about food options- and I love my local businesses. I decided on a Friday evening to first give Maize a try- bad decision, floods of people waiting in the rain and a frat party. On Saturday I tried again around late noon, just a small line outside the door. Previously, I thought the task would be getting into Maize and ordering- think again, it's actually finding parking, then maneuvering into a spot or parking stalking. On this occasion I did all the above whilst driving, during rush hour and graduation...All for good reason.   THIS STUFF IS THE BIZNOMB FORRIZEAL, holy guacamole, pass the salsa, slap my momma and sit down- if you're standing up! As soon as I bit into a chip the stress of traffic from the U of I graduation began to fade, even as mini van mom almost took me out in traffic...no worries though. There's Breaking Bad and Breaking Tacos- I prefer the latter, with well seasoned cooked carne asada, fresh guacamole and pico de gallo- the drive home was so delicious! Were there fireworks? Did my foot pop  la Princess Diaries? I believe so. Either way I'm very happy that I'm athletic because this could easily make a chiquita, gordita... Ain't nothing wrong with a little extra topping though.  Bottom line (literally) If you like authentic Mexican food outside of Chicago then vmanos! This restaurant is THE champagne of Champaign and perhaps the Midwest region."}
{"text":"I finally got around to trying this place, and I'm really glad I did. It was the best steak burrito I've had in town, cheap prices, and they had Mexican coke which is delicious.  Just a killer place and has become a regular spot to pick up dinner for me and my lady."}
{"text":"I went here last weekend after trying, unsuccessfully, to get fed at two other places. Apparently everyone else had the same idea we did going to Black Dog at 2:30 on a Saturday; I was saddened, but not really surprised by the prohibitively long line there. Then at Golden Harbor, we stood at the counter for fifteen minutes while countless wait/kitchen staff walked past us without acknowledging us. Disappointed in two of my favorite restaurants, we shuffled off to try Maize. First of all, for such cramped quarters, service was really great. The waitress was prompt and friendly -- even though my standards may have been a bit lowered by circumstance, it was still more than I would expect from a hole-in-the-wall place like this. The food was outstanding. Excellent queso fundido, and the torta ahogada was delicious, if impossible to eat without a fork. I'll definitely be going back, even if I can get service elsewhere!"}
{"text":"it's a great place to go, whether it's for tacos, chips and guac, or simply to tell a mere racist joke in front of other customers to make them uncomfortable. I used to get volcanes 4x a week here, chorizo and al pastor were my favorite. Better than anything else on the menu.  Caution- the salsas are really spicy. The torta ahogada is extremely spicy."}
{"text":"Great quesadillas but need to add more meat to tortas and burritos especially for the prices!"}
{"text":"Great food but not much room for dining in. Definitely a great option for carryout. Service is great. The employees are very friendly. You can't go wrong ordering anything on the menu!"}
{"text":"From 11am to 9 pm, Maize is where I go for my Mexican cravings all year. Maize is a small gem located at the intersection of Green Street and 1st Street on UIUC's campus.   Maize has limited seating with seats for up to about 15 people inside. They have two picnic benches outside that allow people to eat in warm weather. I love eating inside and out because I can see everyone go by on Green Street.   Peak hours are the usual eating hours: 12 and 5:30/6 pm. The line can get so long that it wraps around the building. When you get your receipt, it will have a number printed at the top that they call out if they are busy. The line moves pretty quickly if it is busy and it doesn't seem like a long wait at all.   The menu is simple but extensive. They have items that everyone is familiar with (tacos, burritos, quesidillas) and lesser known items (Gordita, Sope, Huarache). Basically everything at Maize involves some type of tortilla and some type of meat. They factor that differentiates them all is the way they are prepared. The staff is extremely helpful when explaining and giving recommendations. They tell you exactly how it is prepared and how big it is.   My favorite meat to order is the chorizo because not many Mexican restaurants have it and it has a bit of a kick to it! They also have pastor, chicken, and beef. There is a vegetarian option that consists of rice and beans. The chips, guacamole, and salsa are all fresh and are worth every penny. If you eat inside, you can ask for another bowl of chips and they won't mind at all. You also have to ask for silverware if you have take out. They will give you one of the packages with a napkin, fork, and a knife.   Maize has several drink options. You can request a water cup or you can enjoy some sweet Horchata or Jarritos, a Mexican soda.   Maize is as expensive or inexpensive as you would like. One taco with chips can be satisfying and will only be around $4 with tax. But with extras (drink, guac, multiple tacos), the price can add up. Personally, if I know I want guacamole one day, I will order a cheaper item. If I order a burrito, I won't order guac or a drink because the burritos are very filling.  If you don't have time or the money to go to Mexico, Maize is an excellent replacement."}
{"text":"Everyone raves about Maize and it's mostly true. I always get their largest size Horchata and a couple items off the menu. Great variety and taste.   Note that the food is pretty gross when not warm. Like, usually food is okay if it's not hot/warm, but for some reason Maize just doesn't taste anywhere close to as good. This can be a problem if you're ordering takeout and need to walk back to your residence.  Inside is a little cramped, with a bunch of neatly arranged barstools for cozy seating. There are also 2 tables outside for when it's warmer."}
{"text":"Great prices, tasty food and decent service for such a small little building and staff. Bilingual, too, which is great. They were good about bringing chips and a drink while I waited only about 5 minutes for my meal."}
{"text":"There's no wonder this place is the highest rated restaurant in CU. It would still get a 4.5 star in a city with quality mid-range restaurants. The food was great. After living in Mexico City for 2 years, I got pretty attached to my Pastor meat and they do it pretty well. I got a taco and quesadilla al pastor. The flavor is pretty concentrated like I like it, but it was a bit much for my wife (she got a tostada w/ Pastor). The Quesadilla was quite filling, surprisingly. And if you swapped out tortillas it would just be a Gringa. Only suggestion for improvement... add Pina to the Pastor to balance flavors. The carne asada is highly recommended here and by folks in the restaurant and it is actually pretty close to what you'd find on the streets of D.F. In all honesty, if you're visiting and only have one place to visit in town, drop in for some quality Mexican food.  Terrible parking situation. Try to avoid normal busy times cause the restaurant is tiny with limited seating and parking. So, take a stroll to avoid parking issues and take the food to go and head to the park just a street north to wander around the beautiful pond and man-made waterfalls."}
{"text":"So good and so unique. Yes, it's tiny, but that's something cool about it. I've even gone there for a quick casual dinner with my husband and sat on the stools."}
{"text":"I've experienced Maize 3 times now, so I feel like nothing can be chalked up to just bad luck at this point.  I've had the tacos all 3 times. Carne asada. Sadly, just not good (I know, I should've tried something else...). Meat is dry, served in a relatively small soft tortilla with a bed of mostly cilantro and some onions. Rice is a bit dry as well. Chips and salsa are free with every order. Hard to complain about free, but... I'll try. The chips are okay, but the salsa is basically bland tomato water with some tomato chunks. The guac here is good though. 2 tacos cost almost $5; too expensive for me considering I'm still hungry afterwards.  This might be an issue only with takeout though, as the food I received looks different from the images here of food that was dine-in.  Service was great. Everyone I interacted with on the staff was very nice and friendly. Food took just about 2 or 3 minutes from ordering to get to my hands.  Be prepared to get it takeout, as seating is very minimal here, 12-15 people max at any time.  Random fact: 2 of the 3 times I had Maize was at a Yelp tech talk."}
{"text":"This is honestly the best Mexican in C-U. The ingredients are always fresh, staff is incredibly nice, & the price point is super affordable for quality food."}
{"text":"I am adding a couple stars because of the wonderful job they do catering events. They are understanding of your needs, and the payment system is very convenient."}
{"text":"This place has excellent food and service. The people working there are responsive and the service is quick. It is definitely one of the best places to get Mexican food in the area. The food is top-tier, nicely prepared, and authentic. Definitely try the chalupa...fried!  However, the dining area is small so I would suggest going on off hours."}
{"text":"Great food. Fast. All scratch made. The al pastor has great flavor and is unusually moist. Excellent tortillas. Great selection. Crazy busy. If you like mushrooms, take the leap and order the huitlacoche."}
{"text":"This is a great place if you're in the mood for Mexican, but don't have the time or money to go sit down or go to chipotle. It is a lot better if you get to eat it at the restaurant, but to-go will be a good enough fix. It's not the best mexican food ever, but it gets the job done."}
{"text":"This place is amazing!   We were driving through Illinois on our way to Wisconsin and read some positive yelp reviews and decided to try Mexican for lunch!  Yes, it is very small and you need to wait your turn for seating, but the turnover was quick and once we sat down we got our drinks and free chips and salsa immediately (great chips and two sauces).  My husband ordered the carne asada torta ahogada. And it was huge and he said the special spicy sauce was perfect: hot AND tons of flavor. He also ordered the chalupas. There were actually three per plate-it was probably the best shaved pork I've ever had. Either of those dishes alone would have made a substantial size lunch. I ordered the chicken gordita (I think it was supposed to come with beans, but I'm glad it didn't, the chicken was so flavorful and enough on it's own). Lastly (I know we were pigs today!) we had a beef volcane. The volcane was probably our least favorite, but the tortilla it was on, and the cheese it was covered in, were delicious (not soggy at all).  Highly recommend for a low-key, cheap, fun, filling meal!"}
{"text":"The closest taste of Mexico at Urbana-Champaign area. Delicious and reasonable priced!"}
{"text":"Updating my review because ever since Maize temporarily closed the Green St. location and opened up at Chestnut, the food quality has definitely gone down. I've had it 3-4 times in the past 3 months and have gotten really sick every time. Definitely not worth paying for if you can't even enjoy your meal."}
{"text":"I came here for lunch on Friday.  It was pretty quiet- only a couple other people eating.  I had the chicken quesadilla and what was supposed to be a carne asada taco with no onions.  Prices were fairly low and the food came rather quickly.  First off, they messed up my order as the taco wasn't carne asada.  Then when I sent it back and it returned, the meat was carne asada, but was covered in onions.  By this point, I was over it, so I didn't bother to send it back a third time- just didn't eat it.    I was expecting more from this place because of all of the rave reviews.  To be honest, my quesadilla was really oily (on the outside!) and extremely bland. It was missing heat, spice, anything to liven up the taste.    Overall, I wasn't too impressed and doubt I'll be back. It just wasn't all that."}
{"text":"Although a tad far from campus, this place has great classic Mexican dishes. The restaurant itself doesn't have much room to sit so keep that in mind. I always take a steak burrito or tacos to go and eat at my apartment! There isn't much flavor to the meat I'll be honest, but the quality of the ingredients are nice and fresh."}
{"text":"Good hole-in-the-wall style decent Mexican food. It's very small and cozy, just two rows of counter seating facing away from each other with a little aisle in between, but they bring your food to you. I think there is some outdoor seating too. There's a really small parking lot and street parking nearby. I had a big burrito that was only $5, but it was almost entirely lettuce. There was hardly any meat in it and it didn't taste like much. But like I said, $5. My friend had a quesadilla which was good. The chips and salsa and guac are really good, and the staff is really nice!"}
{"text":"Maize is my favorite restaurant ever. The tacos are even better than tacos in Los Angeles. Try the tomatillo salsa. It's heavenly. Unfortunately, I no longer live in Champaign, so I can't eat there every day. Man, what I wouldn't do for that tomatillo recipe.   I LOVE YOU, MAIZE!"}
{"text":"Maize is closer to a fine restaurant than a storefront. This would be one of the top 5 Mexican places in Chicago, even.  Everything is seared to a crust, exactly how it's supposed to be. Masa is pressed to order as sopes, tacos, huerachas, etc. Ingredients are generously applied, almost absurdly so. They have two salsas, and both are excellent complements to their recipes. Prices are low, you can eat like a king for under $10. Food comes out quick, in less than 10 minutes.  Most of all, everything tastes phenomenal. This is a special place and I hope UIUC appreciates it."}
{"text":"Maize is by far my favorite place on campus to get Mexican food! They always give you complimentary chips and salsa to go along with your meal. The portions themselves are very reasonable for the price. Although seating is limited, it's definitely worth the visit!"}
{"text":"I love nearly everything I've tried at Maize, but I find myself nearly always eating my favorite: chicken flautas. They're served with guacamole, rice, beans, and pico de gallo and topped with sour cream and crumbly cheese.   I did find the burrito to be pretty meh and on occasion their service can be lackluster but for the most part I really like coming here.   The new restaurant is great though I miss going to the First St location that will hopefully reopen soon."}
{"text":"Best Mexican food I have ever had in my life! Very authentic. I would find myself eating here several times a week and I never got sick of it. They need to get a bigger restaurant though so more people can dine in."}
{"text":"Maize is my go-to for quality Mexican food in the Champaign area. Aside from the fantastic steak burrito (which I get every time) the atmosphere is vibrant and fun. It's a cozy place with only about 15 seats, but if you get a chance to dine in, the service is awesome and the environment is welcoming. The to-go service is great too; very quick and simple.   Overall, I love this place, and it will always hold a special place in my heart."}
{"text":"If Yelp had a 1/2 star this would get an extra half to a 4.5  While driving through Illinois i had a taste for Mexican food, Jumped on yelp and found this gem. Once i arrived i found the parking to be small, maybe 6  spots? going inside the restaurant is equally is small. with two dinner style bar tops. They have paper menus as you walk in.  I ordered the Steak Burrito while my Fiance ordered the Chicken burrito, we got a bottle of water and a bottle of Coke, before we were fully seated the waitress had chips and salsa waiting for us. a few seconds later the burritos showed up, SUPER FAST! the chips were very good. the Salsa's were good too! The Burrito's were just the right size, and tasted great, they also serve the bottle of Cokes with real Sugar which is awesome. the workers are nice and everything was clean, i'd love to come back if i find myself in this part of Illinois."}
{"text":"This is my favorite Mexican place in town! Steak tacos are to die for! They know me by name and I'm not ashamed :D"}
{"text":"My favorite Mexican food. Food, salsa, and chips are all amazing. Price is amazing. If you eat there you can get unlimited chips. Can't find a better Mexican place than this. I wish they would expand and get a bigger place!"}
{"text":"The fish tacos are amazing but the cheese in the quesadillas is rubbery. The salsa is really good but the chips that come with it are really thick."}
{"text":"To start they handed us 2 different cans of diet pop Diet Pepsi and Diet Coke both were expired. The Pepsi went out of code a week ago while the coke was April 18th. I notified them And they grabbed another one and handed to me and of course it had the same expiration date. They proceeded to pull all the cans out and found that more than 3/4 of them were expired and instead of taking them out they put them all back in and then handed me one that expired the very day I was there June 11.   Apparently the freshest cans of pop that they had expired that day We all ordered the carnet Asada it was $15 and that included a very large piece of carne Asada steak, rice and beans lettuce with red cabbage in it and A half slice of avacado.  The beans were very good and had some white cheese on them, the rice wasn't so good and had chunks of potato in there and a lot of the rice was hard, Not very pleasing to the pallet. All of our stake seemed a bit salty but it was very lean and I found no gristle. The tortillas or homemade corn and delicious they were piping hot, I mean steaming hot even 10 minutes into the meal they were still steaming hot that was a very nice touch.  Of all the pop is $1.25 a kin I was OK with that I wasn't OK with it being expired, the big hit was my son he ordered a Horshata (cinnamon rice water) for $3. He asked for a refill and was told they didn't have any and was charged another three dollars for another one, I am from Chicago and every single place there in the suburbs you get free refills but not here apparently. Coming from Chicago as such a large metropolitan area I am sometimes suspect when I see the reviews and places in smaller towns, and this place is no exception, it may have four stars with a lot of reviews but for what I am used to this is Meh at best.   I will not return, although the meal was not bad there is no value in it and the food was just mediocre aside from the tortillas."}
{"text":"This is my favorite Mexican food place around. Actually it might my favorite place to eat!  The first time I ate here the line was crazy and the place was crowded (not a very large dining-in area) but the second time I ate here it was not bad at all.  Either way, totally worth a little bit of a wait, and the staff here are very friendly people."}
{"text":"LOVE this place! I'm addicted. I could come here everyday. Everything on the menu is pretty cheap and super affordable. Every time I come, there is a huge line out the door, so be prepared to wait. It is definitely well worth the wait! The place is small too, so be ready to fight someone for a seat.   Here's what I've had: -fish tacos (small but good) -tortas (I've tried carne asada, chorizo, and milanesa) -queso fundido with carne asada (melted cheese - really greasy)  Their tortas are the best! They are only around $5 and it's a pretty large portion. Also, each meal comes with free chips and salsa!!"}
{"text":"Wonderful traditional Mexican cuisine.  Ingredients are very fresh with wonderful service for such a small restaurant on campus.  Also fairly priced!"}
{"text":"Looks a little shabby on the outside, fantastic authentic food on the inside.  We arrived shortly before lunch and by the time our food arrived the place was full and had a line out the door.  Delish: talk about flavor!  Portions might appear on the smaller side (which threw me off, eyes bigger than stomach issue) but very filling.  I ended up having to bring half of my food home!  For mushroom lovers: try the huitlacoche!  My brother lives in the area - great find broey!  We'll head back to Maize when we head back to IL for a family visit.  Deep friend quesadillas?  Yeah, I said it.  Crazy...."}
{"text":"Best Mexican food place in champaign. Everyone needs to eat here!! Seriously!! Their tacos are bomb."}
{"text":"In Champaign-Urbana on business and stopped in here after reading the glowing Yelp reviews. It's everything you'd want from a Mexican place, provided you're not looking for a full service sit-down restaurant. My chorizo burrito was excellent (the tortilla alone was incredible!) and I also tried the fried mushroom quesadilla, which was positively dreamy. It's greasy street food, but that's exactly what you want sometimes, and the flavors are authentic. As for service, it's speedy and accommodating -- the place was packed when I realized I'd forgotten to ask for my receipt. I'd placed my order a half hour earlier, yet the employee cheerfully created a new receipt for me... accurately, from memory no less, in the midst of a huge back-up at the counter. From now on, I'll never miss an opportunity to eat here whenever I come to the area. What a gem!"}
{"text":"aaaaahhh-MAIZE-ing!!! And, no... this place is not over-hyped! This little taco shack on the corner of Green & 1st is life changing. Friendly staff that serve up fresh, hot, flavorful food with smiles! Yes, it is tiny and cramped (bar seating for less than 15 people). Yes, the parking lot sucks. Yes, there are times where the line is out the door and around the building. But it is all worth it!!   I'd highly recommend the Volcanes. Grilled cheese taco with your choice of meat... It's like a quesadilla and taco had a tasty love baby. Yummy! I really enjoyed the carne asada, pastor and chorizo. The chips and salsa were delicious, too!   Btw... just found out that they are opening a second location this summer on Chestnut where Luna used to be!  Peace, love & tacos!"}
{"text":"this place is off the hook, its super cheap and the food is awsome. theres definatly no room inside so probably best to carry out"}
{"text":"Really good Mexican restaurant. It is always packed. The food is really authentic. The menu is small but it has a lot of stuff to try out. You can't go wrong with this place."}
{"text":"This is the corner where business comes to die, but I hope this one makes it.   As soon as the pedestrian white walls of Ye Olde Donut & BBQ and, more recently, the late Derald's Diner were washed in the much richer brick red paint, the folks across the street at El Charro got off their asses and re-painted their \"Tortas - Tacos - Burritos\" signs. American capitalism at work.  Seating is limited at Maize and there are no public bathrooms. It is counter service with about ten barstools."}
{"text":"I have dined at Maize's new location on Chestnut Street and have ordered take-out at their Green Street location. I would definitely recommend dining in at the Chestnut Street location, as the food is much better fresh and the experience is all the better! They have much more dining room on Chestnut Street as well!  Their housemade chips and guacamole is delicious, and their tacos are some of the very best in Champaign-Urbana! I would strongly recommend their fish tacos. They never disappoint and everything on the menu is great!"}
{"text":"I decided to try this place to see what the long lines and hype are all about. Maybe I chose the wrong item, but I thought the food was mediocre. It was definitely spicy, that's for sure."}
{"text":"This place is terrible. Coming from southern CA, this does not make the cut for good mexican food. They also make most of their food with lard and don't have any opt out option for vegetarians. Even their chips are smothered in it. Their burrito tasted like a bland hamburger. AND there was a line out the door, I just couldn't believe all these people thought this was good."}
{"text":"Five stars for that guacamole and horchata. Maize is seriously good. Don't expect a great dine-in experience, the place is the size of a shoebox. But anything on their menu is awesome. It's not hard to please college students, and Maize could certainly get by with lower quality food being so close to campus town. Yet and still, they provide authentic Mexican cuisine at great prices."}
{"text":"Maize is a fine addition to the Champaign-Urbana Mexican landscape and is instantly up there with Mas Amigos and El Charro.    Located right across the street from the latter, Maize is another fantastic hole-in-the-wall shop offering mostly authentic Mexican fare.  On the menu: Tlacoyos, Sopes and Huaraches, authentic dishes you will be hard-pressed to find at any other Mexican restaurant in the area.  While we were waiting for our food, other customers raved about the fried quesadillas, another unique menu item.    This was our first visit, so my girlfriend and I each went for some tacos.  Another reviewer mentioned the \"home-made tortillas.\"  Though we didn't ask, the corn tortillas used for our tacos seemed soft, fresh, and thicker than most.  I had tacos al pastor (with cilantro and onions, of course), and I have to admit that they were the best \"al pastor\" in the C-U area, just a notch above the also excellent versions from Mas Amigos and El Charro.  We also tried the rib eye tacos which were a bit more expensive, but well worth the price with thin slices of tender, well-seasoned steak.    Complimentary chips (with Maize's two unique salsas) were included in our carry-out bag and were pretty good but nothing to write home about.    Overall it was a really nice place to stop for lunch.  We got chips, 3 tacos each, and a couple of drinks for about $15.  Plus, the man taking orders was extremely friendly, explaining any items for us and chatting up the other customers dining at the counter.  We will most definitely be back."}
{"text":"Food is tasty, service is great but the seating capacity and parking need to be addressed.   I'm surprised this place hasn't expanded b/c they do have great food. But the dining feels like i'm eating in a packed standing elevator. If you choose to dine in, try to go before peak hours or after.  The price is a bit expensive but worth the money."}
{"text":"Have eaten at Maize several times.  GREAT food, very good prices, ambiance is crowded and very informal.  This is the place to go for GREAT food, and the basic amenities likely help keep the costs low.  It is typically crowded - the limited counter seating is a constraint.  The building looks like it was converted from a gas station to a restaurant, but no matter - the food is GREAT.  Try it, you'll be glad you did."}
{"text":"This place is great. The food is excellent arguably best fish tacos in town in the traditional minimalist protein-onions-cilantro sort of way. Menu is a-la-carte style so they don't have \"meals\" like other places (pro or con depending on personal preference). If you have a large group, do take out. Seating is very limited inside (Maybe 15 seats)."}
{"text":"Inexpensive, fast service, and delicious authentic Mexican food! I got the mixed burrito with chicken and chorizo which was excellent. Each meal comes with free nachos and salsa also! I would recommend to get some extra hot sauce."}
{"text":"Amazing New Mexican Restaurant!  I hadn't heard about Maize, just saw it pop up on First and Green where during my 4 years here on campus I've seen many establishments come and simply disappear. Me and my roommate (all mexican) went to try it highly suspicious that any place around here could actually offer authentic mexican cuisine. Boy were we wrong. This place is great! It does everything right, taco, quesadillas, huaraches, and even tortas. It's the level of authenticity you might expect from a place like Nuevo Leon. I wish they just had more seating and were able to offer a dinner type atmosphere and menu. Great lunch and cheap dinner food. They are missing a lot of dinner items such as  enchiladas, mole, or pozole. However, everything they do do, they do it right. Their salsas are great, their tortillas delicious. Everything has the perfect amount of grease. Seasoning could be better, but it's better that they under salt than over salt. . Definitely try this place out!"}
{"text":"My queso was literally a bag of shredded mozzarella cheese (like Sargento at the grocery store) poured in a skillet and put in the oven. Fish tacos were basically fried cat food. I kept checking to see if they were even fish. My friend got a burrito which was about 40% sour cream and 40% lettuce. The chips and salsa that came with it were fine.  The interior of the restaurant is really small and there is limited seating. Parking is not great, it's hard to get out of the parking lot."}
{"text":"This tiny little joint is worth it. Probably the best tasting Mexican food I've ever had in my life. And that includes Mexican food I've had all over the world, all over the United States, and all over greater Chicagoland.   This isn't necessarily the fanciest joint. And that is an understatement. There's only countertops, no tables. Maybe only 15 stools in the whole place. I took my girlfriend and my kids there, and we were able to find a place to sit together. Watching the place for a good 45 minutes, almost all their sales appeared to be carry out.  But again, let me emphasize the food. It was immaculate. Joy in the mouth. The most wonderful tasting goodness I've had. And I'm not exaggerating. I had a chicken gordita, and a beef gordita, and then some stuff that my daughters ordered. Each thing I tasted was better than the next. I will be eating here every possible chance that I can. I hope that my son continues to flunk his classes at the University of Illinois so I can spend years of joy at this place of hospitality and food nirvana."}
{"text":"Move over, Rick Bayless! This is some of the best Mexican food I have tried in a long time. I've had Maize bookmarked for quite some time, but I never managed to make my way that far down Green Street to check it out. My brother graduated from UIUC last weekend and I knew it was my last chance to try it! It was about a half mile walk to Maize from Alma Mater. We took one look at those long graduation day lines and decided we would much rather enjoy some Mexican food.   There was a crowd of people waiting outside when we arrived and at first I thought that was because all of these people were waiting in line to order. Once I stepped inside, I saw it was because the place was so tiny and there wasn't any room for people to stand around waiting. The actual line to wait for ordering was quite short. Luckily, it seems like a lot of people choose to order carry-out and with good reason. The whole place probably doesn't seat more than 12 and the seating is just countertop. We originally also chose carry-out, but then we were lucky enough to snag some seats, so we decided to dine in.   I ordered the biggest guacamole, which was $7. I also ordered a Vulcane, which was less than $3. Say what? I know the general idea is to eat 2-3 of these little tortillas for a full meal, but I was planning on loading up on chips and guac. The guac = OMG. There was so much! I shared with our group of three and there was still enough leftover to enjoy later in the day. The Vulcane was my favorite, though. It has amazing cheese melted with a toasty crunch to it so you can't fold it up to eat. There was also Spanish rice, onion, shredded lettuce, and avocado. I totally inhaled it.   I was tempted to give Maize four stars because of the cramped space, but I just can't do that. Maize is more about the amazing food than having a relaxing sit-down meal. I strongly recommend you try Maize if you're in the area!"}
{"text":"Fresh and authentic Mexican with some nice vegetarian options. Their new location is great - but usually packed for lunch, so give yourself plenty of time! If there were more varied vegetarian options, I've give this 5+ stars. Unfortunately, rice and beans make up the bulk of their veggie options, although there is a potato flautas dish as well as a veggie fajita option."}
{"text":"First, Maize is very good in the authentic Mexican taqueria tradition. They have a number of grilled or fried items from which to choose, as well as  a couple of good sides like guacamole. On each item, you can choose from the following meats: carne asada, chicken, chorizo, or pastor. My favorite is the flavorful pastor (marinated roast pork). Common co-toppings include a wonderful fresh, salty cheese, salsa fresca, sour cream, and cilantro. A variety of salsa comes with, and each bite of every item is delicious, with or without the salsa, which is very good.   Tacos, burritos, tostadas, tortas, tlacoyos, challupas, quesadillas, gorditas, flautas, and huarches are all available. Honestly, they are variations on a theme, rather than distinctively different. Choose your texture. I'm an especially big fan of the tlacoyos (stuff served on top of a piece of grilled chewy flat bread -- you can get the bread fried, but grilled is better). Some of the items do offer interesting add-ons. For example, you can add pumpkin flowers or or mushrooms to the quesadillas.  Maize is located in a small converted space, with just a few seats around the main counter and a counter that runs immediately behind along the back wall. Seats are counter stools. At busy times, customers who are waiting for food get packed in too, or wait outside. The parking lot is equally small. We prefer to get our food to go, and it is always well worth the trip. Prices are inexpensive for the quality -- an excellent value."}
{"text":"Great food!   We had to wait a little bit for a table, but definitely worth it. Our waitress was busy but attentive.   I was disappointed they didn't have sangria, but the Paloma was a delicious drink.   Food was excellent. Salsas were flavorful and spicy. We had the quest as well which was delicious. I really enjoyed my fajitas, and had enough for left overs.   Great meal. Highly recommended."}
{"text":"OK, I was suspicious that Maize was writing their own reviews, but after a Friday evening visit in October, 2011, I now understand why their growing but new fan base is over-the-top loyal and giddy about the joint.  The atmosphere was intimate, the parking lot was packed, there were no available stools.  We overheard a customer who had been there before gushing to his friends about what to order.  So I get the impression this is one of those start-ups that folks feel strongly about supporting and want to see succeed. Me too. Small portions, but very reasonably priced (most things under $3).  Spend $8 and you will have a full meal.  The free chips are unique because they have dark specks in them and seem drier and crunchier than other Mexican restaurants in this genre. The free salsa is excellent."}
{"text":"If you're in the mood for a burrito but want something more authentic (and less crowded) than Chipotle, Maize is a great choice. My favorite meat is the pastor -- it's got a lot of flavor, and it meshes well with the rest of the ingredients in the burrito. The homemade tortilla chips are good too, though not quite salty enough for my tastes. The red salsa that comes in the takeout bag isn't that good, but the other salsa you get if you dine in is better. Speaking of dining in, don't. There are a total of about 15 seats, and they're so tightly packed together that just getting to one is difficult if you aren't 2D. Just get your food to go and save yourself the trouble."}
{"text":"A staple for students and locals here. BF took me here for Sunday brunch with me complaining the whole way about not wanting to eat \"heavy\" foods this morning after our morning workout. Came in and was astonished by the size of this place - it was TINY. Windows let in a good amount of light, and perhaps the design of the building and the interior layout play a part in the taste of food - theres definitely truth in the opinion that dining in tastes better than eating to go. It's like eating in a little red hut, with tables concentrically placed around the kitchen such that you feel like everyone is eating together, and the staff, atmosphere, and smell of the place makes you know that you're getting extremely fresh food. Be warned, the complimentary nachos and salsa rack are OILY and crispy, but that's because they LITERALLY JUST FRIED THEM. All nachos are made of fried tortilla, so the reason why Maize's nachos are oily is a testament to their freshness (and they are also extra crunchy as a result!). Original steak tacos are $3.95 a piece, and are extremely authentic (think Mexico City), and served on fresh corn tortillas with generous amounts of really flavorful chopped steak seasoned with cilantro, onion, and lime. We also got the chicken flautas, which came with a side of freshly made guac (wonderful lime flavor and not too salty!), rice, salsa, refried beans, and generous amounts of cheese and sour cream. You can tell they use only the amount of oil they need, and don't overdose on oil/butter/cream, resulting in food that was surprisingly light but filling for the amount (could it be contribution of the lime? D:). By the end, both of us were stuffed, but surprisingly not uncomfortable - which has gotta be a first for eating at a mexican restaurant! If you can, eat here (don't take out) - trust me, the food will taste better, fresher, and you'll get the nachos and yummy salsas :)  update: went again and ordered more tacos and their sope (with rice and beans on the side this time) after eating at El Charro and was blown away by how fresh this place is. still 5 stars. Never have a problem with the seating and waiting at this place, maybe Im just lucky?"}
{"text":"Tasty tasty tacos& burritos but expensive/unreasonable guac. Fish tacos or fish burrito with cilantro& onions are highly recommended. They stuff lettuce on the bottom of the small guacamole !!!  Best burritos &Tacos in town but get your horchata/guacamole from El toro on Neil st."}
{"text":"it was super tasty and got to try something different while driving thru town. Staff was friendly and helpful with the menu."}
{"text":"Went today for lunch. Tried to be there to beat the rush and grab a seat. Ordered my food and within five minutes, my chicken burrito came out perfectly. It was one of the better burritos I've had. Staff was good too."}
{"text":"A-Maize-ing. Best burrito in town. Friendly service. Fun, quaint dining. Fantastic prices."}
{"text":"Excellent food. Restaurant is a bit small and it was very crowded. Try the chips and salsa and the carne asada plate, you won't be disappointed!"}
{"text":"Incredible authentic Mexican food, arguably the best in the area. The al pastor meat is unbelievable and easily my go-to. If I'm at Maize, I usually order a sope and torta, which will more than fill me up but I have a hard time choosing just one. The queso fundido is great too but it is excessively cheesy (may or may not be a good or bad thing) and you HAVE to eat it immediately, otherwise it solidifies too much and becomes a chore to consume. Literally all of the other items are great too, you really cannot go wrong here. It's essentially impossible and uncomfortable to dine in this location, so I would take it to go."}
{"text":"Fantastic service in such a small but cozy diner-esque place.  The food was really good, with soft corn tortillas a fresh ingredients.  If you dine in, they also provide fresh homemade salsas and chips.  Food was just a tad underseasoned for me but the fast and friendly yet unobtrusive service definitely more than made up for it.  Check them out!"}
{"text":"Best mexican food around champaign. Not overpriced and they give you chips for takeout as well"}
{"text":"freshly made tortilla chips and some literally smokin' freshly off the stove good habanero salsa when you order.    the space is mostly bar counter service, and shoulder to shoulder.  I came right after noon and it was a constant flow of traffic and to go orders.   seems like everyone who had takeaway orders received chips as well.  orders arrive quickly and the staff is ever so kind and helpful.   food was good and tasteful, though my steak burrito was a little lacking in beef.  not the best i had, but its ok.    also had al pastor which was much better on a fried tortilla.    I'd go back when I'm around again.  well deserving of being best mexican cuisine in CU"}
{"text":"The food here is outstanding for the price. Food is always prepared in a timely fashion and the quality is consistent. The menu has a variety of options.   The only complaint I've had was the line being too long."}
{"text":"The food is really fresh and delicious, but you'll find yourself bumping elbows with your neighbor a lot if you get caught in one of their periodic mealtime rushes. Their kitchen is larger than their dining area. There is also no bike parking here at all, but even that cannot dissuade me from repeatedly patronizing the best Mexican restaurant in town. They are vegetarian-friendly! Try their delicious corn smut!   Maize, if you are reading this: Get some bike parking! Seriously."}
{"text":"3 stars at best. There is always a line, so I was really excited to try this place. Having just returned from Southern California, where they do Mexican food very well, I had heard good things and I had hopes. I got the carne asada burrito, kind of pricy, and it was just fine. Only fine. I felt three quarters of it was lettuce. It was good sized and I took the rest of it home. I smothered it with cheese and extra salsa and sour cream after reheating and it was much better the second time around. I probably won't be returning any time soon."}
{"text":"Maize offers good tex-mex food for the central Illinois area. The service is above average and they try to be as fast as possible. Yes, the space is fairly cramped, but serving up food in such a small spaces saves money and they pass on the savings to the customers.  That said, I think Maize is fairly overrated. The food is typically pretty bland."}
{"text":"Best. Food. In C-U.  I realize that the bar is very low, indeed, but this place ROCKS. You will not believe how delicious it is, or how cheap. Go here now."}
{"text":"Great prices, great speed, and the food is authentic and fresh.  Its a teeny tiny place on Green street, really for a togo order."}
{"text":"Maize always meets my expectations. The staff and food are always great. You can tell they care about their customers and food. Always fresh ingredients. Even though the space is tight, the food and service are great."}
{"text":"Seriously the best mexican food I've ever had. And I've had a TON of authentic mexican, in America and beyond. All you need to know is that this place is legitimately the best mexican food you will ever eat. Personal favorite is steak tacos. UNREAL people. I can't say enough about how much I love Maize!!!!"}
{"text":"Yelp helped me find this place and it was delicious! I had the carne asada and managed to clean my plate. Best Mexican food I have had since leaving Texas. Dining inside was tiny but there was seating available when I got there. Super clean which always makes me happy."}
{"text":"Disappointed in the Mexican food choices in Champaign? El Sombrero, Dos Unrealness, fiesta of mexico!?. You should be disappointed because the food is mostly just reheated.  Ready to level up? Enter Maize. All ingredients are fresh and made on the spot. Seriously you can see the tortilla making presses in the back. I sometimes wonder if they have lettuce and tomato plants back there because it tastes that fresh.  I eat here minimum 3 times a week. Not only is this the best Mexican food in town but probably the best food in town.  Favorite items? Burrito + Avocado, Fish Tacos, Guacamole, Steak Tacos, Tostadas, Chicken Volcanes... seriously tho... everything on the menu is best. Level Up to Maize."}
{"text":"The guacamole. The carne asada gorditas. The pumpkin flower fried quesadilla. All unbelievably good. Every time I eat there I leave full and spend so little money. Keep it up Maize! You are helping change the food scene in CU!"}
{"text":"Great Place. Maize is one of the two restaurants I frequent the most around campus (the other is Bangkok Thai). The steak here is especially good. An updated menu was hard to find online so I've attached photos:"}
{"text":"Came here when they were about to close & they gladly served us. Prices are cheap. Didn't really find anything special about the tacos but maybe cause I'm from Texas & also I got it with the standard corn tortilla. (It is called Maize though so kinda of makes sense. Lol) I think you may be able to ask for flour tortillas though."}
{"text":"Probably the best Mexican food in town to be honest. I have been coming here since it first opened and I haven't gotten sick of it yet! I also love that is on campus where I live so it is a super easy walk for me. Whenever I have visitors I always take them here. The best thing on the menu are the burritos I believe. My favorite is the vegetarian burrito. It comes with rice and avocado slices and the avocado and they're just gives it a great texture and flavor. Also the chips are one of my favorite things. They are fresh and crisp and when salted lightly are just perfect. The two sources that you were provided with are delicious as well. I like mixing the two. This is a great place to come if you are eating alone or if you have friends or even if you just get pick up. The parking situation can be difficult but the service is very quick so there is a high turnover rate of vehicles coming and going. Or like I said if you live on campus it is right on 1st and green so an easy walk for a lot of students. The staff is also very friendly and helpful when you are ordering."}
{"text":"Inexpensive and delicious. Bright cheerful counter with pretty green tiles and helpful servers. The fresh tortillas make everything delicious. Loved the chalupa and the yellow salsa was fresh and unusual. Well worth the two mile drive from the highway for such a pleasant meal."}
{"text":"2 words.  Pastor Volcan.  Every time, all the time.  Location is great as well since six pack & ARC are right down the street, so it becomes a great post-workout meal.  Chips are included, salsa is included if you're eating in (one is a a generic mild tomato salsa, the other a spicier orange salsa... I want to say habanero-based but it's not quite as spicy as habanero would be.  But really, get that pastor volcan.  It will blow your mind for under $3."}
{"text":"This place is probably the only place I would go for Mexican food. It's always good and I never had a bad experience here. Even though they're always packed, you can always order pick up or do carryout! I've eaten there a couple times, but most of the time I would just do carry out because it's faster and I like to enjoy my food at home. I love love love LOVE their horchata! I've never had a horchata better than theirs ever since I tried it. CHEAP AND GOOD FOOD!"}
{"text":"If you have any bad things to say about this restaurant, then you have issues. Everything on their menu is authentic and fantastic. The only down side I can possibly think of is the fact that it's good is too good, and there will always be a line to place your order for food.   But do not let that turn you away! You can always place your order early through phone and pick up your food when you arrive! That's what i do when I am tight on schedule.   I honestly cannot recommend any specific dishes because they are all very good! I usually just ask the cashier what they are in the mood for, and I will take that recommendation.   The restaurant itself is small so there is very little chance that you can actually sit down to eat on site. But if you do, definitely have their chips and salsa. They are worth every second of wait! They also provide some authentic Latino drinks that you do not usually see everywhere else!  The price for the restaurant is definitely reasonable. It may be a little out of students way, but definitely worth the effort, especially if the weather is getting better!"}
{"text":"Wow. I've been hearing good things so I decided to do some firsthand research and I must admit, I was worried about walking into a completely empty restaurant. Well, let's just say that by the time I left, the place was packed and for good reason, this is *literally* the best Mexican food you can get in Champaign-Urbana.   What I would recommend is the Tacos Mexica which are like regular tacos except there's some grilled brown cheese on there. The cheese adds a bit of saltiness, the browned part adds some crunch and the melty part underneath adds a nice creamy texture to the party. The carne asada is salty and has some nice savory bits from the char of the grill while the pastor is spicy and crunchy.  This place is as good as the stuff you'd get at little taquerias on the southside of Chicago so I very highly recommend you stop in."}
{"text":"Ummm... Some of the best Mex I've had East of the Miss.  The corn tortillas per the namesake, are over the top good.  My fish and ribeye tacos were bursting with their simple, \"look at the quality\" ingredients.  The guac was in a word sick-- a pile of goodness that I'll be thinking about the next time I get the munchies!   Friendly counter service And speedy cook times too.  Relo to a place with more elbow room and it's a 5 star one handed jam from the baseline!"}
{"text":"After trying to get in a couple of times we finally managed on a quiet Sunday (just as they opened).  And it was amazing!!  Real authentic flavors and fresh avocados and the correct cheese.  I had the Torta Ahogada and the sauce poured over the top soaks into the bread and is so spicy and warm and satisfying.  The sopes remained mostly crisp enough to cut and pick up and good pickled vege on top!  They have simpler items (less spicy) like burritos - which are a huge portion.  The portions are large enough to bring some back for a late afternoon snack (good for college students).  We will certainly keep trying to come again since it's really hard to get good Mexican food up north."}
{"text":"I am a student at UofI and I've been going to Maize since forever. I'm a regular and most of the time I order the taco Mexican with pork. Their taco is best eat fresh. Also the guacamole is really fresh and tasty. Also try the fried quesadilla. I believe their marinated pork is the best among all meat, but that could be a personal choice. Anyways, Maize is a cheap, fast but most importantly tasty Mexican restaurant."}
{"text":"Amazing tacos, chips, salsa and guacamole in a place the size of a shoebox. Stopped off after reading some good reviews that were completely on point. This place didn't disappoint and next time we roll through town, we will definitely be back."}
{"text":"I think several other people have said this but the pastor burrito is my go to! Chips are always fresh, but be sure to ask for their spicy - it's way better and really not that hot. Would definitely recommend calling a head, as it's a small place that's always packed."}
{"text":"Yes, it's very good food. Yes, they have lots of great choices. Yes, it is authentic mexican food in the middle of Illinois.  But, it's always packed and they are continually raising their prices. It was once extremely cheap and I went there a lot. But now I prefer Huaraches Moroleon for better food, better prices, and a better atmosphere.   Maize is still delicious though."}
{"text":"Best Mexican food in town, bar none. Maize is authentic as it gets unlike other so called Mexican restaraunts in town that serve more watered down American/Mexican food. There is not a bad item on the menu. All reasons why they have won best Mexican food in the C-U three years in a row. Cannot wait for the second Maize to open up in downtown Champaign later this month."}
{"text":"Carne Asada tacos - possibly the best I have ever had.  The homemade tortillas are amazing with the queso fundido as well as with the tacos!  The other yelpers are right that it is a tiny place with just counter seating - but it's worth it!  The staff was extremely friendly as well!  Probably not the best place for kids though as it's a more adult taste."}
{"text":"Love this place! One of the best Mexican grill in town~ everything is delicious with a reasonable price~ I come once a week~"}
{"text":"My favorite Mexican restaurant in town serving up traditional classics rather than gringo versions. There's nothing wrong with some white cheese dip to be sure, but branch out a bit. Excellent guacamole and steak burritos, homemade salsas are killer."}
{"text":"I have gone to Maize for the past three years probably at least once every two weeks. The food is always great, made fast, and is consistent. In addition, there are many vegetarian options which is fantastic for a non-meat eater like me."}
{"text":"For being Champaign, it is definitely one of the best taco places in the area. Tortillas seem homemade and your order comes with free chip and salsa."}
{"text":"It's the best Mexican place in town..IMO of course.  The chips and salsa are fresh and house made.  I usually get the chicken fajitas.  Their presentation is beautiful.  The chicken is flavorful.  My only complaint is that it's just too much food!  lol"}
{"text":"We LOVE MAIZE!! Best mexican food I've ever eaten! We were driving home from New Orleans and made a special stop in Champaign just for some Maize. Their chorizo tacos with cilantro and onion are to die for. They're reasonably priced, incredible delicious, and food is always fresh. We rave about this places to friends and is the first place we take them when in town. The only downside is of course the size. There's virtually 5 parking spots and about 10 seats in the whole thing. This place is never not busy but there's never a line. Best to get this to go or at least when there's not drunk and hungry college kids around. If you're looking for an incredible, authentic mexican place then GO NOW."}
{"text":"Best Mexican food in town! Park somewhere else and walk up for your food though, spaces are limited and it fills up fast. Totally worth the trouble, and a great place to bring visitors."}
{"text":"Maize is making me broke because their food is so good. Their chicken tacos Mexicos are my order of choice each time I go. The chicken is super flavorful and the melted cheese on the tortilla melts my heart. If you go, you cannot leave without trying their Horchata. It is very well made, and pairs really well with the food. Staff is incredibly friendly and fast!"}
{"text":"Food=5 stars Size of restaurant=2 stars, it's tiny!! :( Don't let that scare you though! (Word on the street is that they're moving to a bigger location though? Don't quote me, that's just a rumor I heard)  I've been here twice and each time I've thought the same thing- The food tastes so FRESH.  Especially the guacamole. I live in Normal and I told my fiance that I would drive the 50 minutes to the restaurant just to eat and come home. I love it that much.  Big portions. Decent prices. If you want proper Mexican, go here."}
{"text":"Maize is my favorite place to grab quick, delicious, and legit Mexican food in town. Boy are the tacos mexicas and flautas delicious. They are probably the two items I order the most. Actually, come to think of it, most of their food is amazing. Give it a try!  The space is small so one prepared to get cozy. It's definitely part of the experience."}
{"text":"Everything was tasty.  The salsas are great, very fresh!  We got our order to go, parking is VERY limited which was ok when it was a donut place (you're in and out) but maybe not so great for a restaurant.   Prices are very reasonable, filling food and friendly staff.  My only real complaint is that the vegetarian options are kind of limited.  Sure they list veggie as an option for most items, but don't order it thinking you're going to get a taco or sope or huarache with grilled veggies instead of meat.  You'll basically get the item with NO MEAT, just the toppings listed, even though you pay the same price as one with meat.  I'd love it if they added some grilled veggies so at least it seems like a vegetarian option instead of an afterthought."}
{"text":"This place is popular and small, so be prepared to stand in line.  They make their own corn tortillas so the tacos are worth getting.  The pastor is a bit saucy but still tasty, and the chorizo was properly savory.  Chips and salsa are decent as well.  Next time I will need to remember to add guacamole to the tacos!"}
{"text":"literally. the best mexican restaurant i've ever been to. UNREAL. only place I'll eat burritos from"}
{"text":"I went here with three other teachers on a Wednesday night. To say this place cramped would be THE understatement of the year. The second time I went here I visited with my twin brother. Both trips were FANTASMIC (yep).   It did open us up to hearing a conversation that two of the biggest nerds on Illinois campus were having. It was hilarious because while they were talking about geometry, machines, and other things nerds talk about they were swearing like sailors. So not scientific, bro! \"My flux compactor connected to the tangent...blah\".   The second time I visited, I was treated to a conversation about Ernest Hemingway and \"Old Man and the Sea\". That was good. The lady who was talking about said author also mentioned how much she enjoyed Franklin BBQ in Austin, Texas. She was wearing one of those baby in front backpacks with a baby inside. Folks, in a restaurant this small, there is no point in having children. Get it to go!   I was told that they will be opening up a sister restaurant in the old Cafe Luna location. It was hilarious because the cashier told me that this was the case and I acted like I knew EXACTLY where it was...which I do not! HEHE. It should be open by the end of 2013...they're just waiting on permits. It will also include appetizers and drinks...heck yeah, college!  This place seems authentic; what I mean by authentic is not made from a package. MADE IN HOUSE! As a matter of fact, the grads and undergrads lining up out the door made me realize...THIS IS AUTHENTIC...and their prices are excellent! I ended up paying 10.32 for three items. The second time I went here I got an extra taco and it was a great choice!   Among the simple menu, I decided to go with a fish taco, pumpkin flower quesadilla, and asada tlacoyo. All were fantastic! The workers were very nice and accommodated all my complicated questions (How do you say \"tlacoyo\" and it is all grilled, right?). I love how they have masa...corn based tortillas! So great! Get that white flour sh*t outta here! Those empty carbohydrates...I AIN'T GOT THAT KINDA TIME! My friends ordered some burritos, quesadillas, and some guacamole. IT WAS LIKE AVOCADO HEAVEN!  I've also sampled the ribeye taco and the corn smut tortilla. All the items I've had here are fantastic  The mild AND hot salsas were excellent as well! I had to order mas (Spanish)  I don't always eat Mexican in CU...but when I do...I do Maize. Simply amaizing. Pun entirely intended. I'd would order to go if I come again or just try their sit down (done by the end of the month).  Based on the food (6), service (5), and restaurant experience (4), I have to give Maize a 5 star review. If this place was bigger, I would go every weekend. Actually, I might go every weekend anyway. It has a street food feel to it.   This is one of my top CU area joints! Guy Fieri and Jimmy John (yes, that Jimmy John) have tried this place...which actually led me to find it. I highly recommend!"}
{"text":"Deliciously filling tacos.  I was hesitant to try it but after expressing my gluten \"allergy\" they seemed receptive to my request for the cook to change gloves before making my food.  I've had no issues with gluten contamination with the tacos (corn tortillas) or the chips and salsa.  Its definitely a local favorite and always packed so calling in carry-out is a great option!"}
{"text":"If you ever crave Mexican and you are in the CU area, this is definitely one of the places to try. They serve their food very fast. If you sit in then they bring you chips and sauce.  There's so many choices I usually end up getting two things and being full fast. It's worth the price. I always get a carne asada burrito. The meat tastes good and the tortilla doesn't taste stale. I hardly ever get a bad meal from here. Highly recommend."}
{"text":"Mexican food genies, these dudes work kitchen magic in tiny quarters. If you can get in to one of their ~8 seats, you'll enjoy great food (try a chorizo burrito!) diner style with quick, friendly service. Come by when it's not busy, or order carry out - and good luck parking! You won't be disappointed, especially when you consider what you paid."}
{"text":"Maize has the best Mexican food on campus hands down. Everything I have tried there has been nothing but delicious. The service is fast and friendly, the price is relatively inexpensive, and anything you order comes with chips and salsa, making it a great value! I would recommend ordering to go because of the small size of the restaurant. Would love to see these guys expand into a larger space!"}
{"text":"Excellent place. Always crowdy, but they are very quick in service. I always try a different dish when I go there, and not a single dish has failed my expectation yet :-)"}
{"text":"Best Mexican food I have ever had in my life. Countless times I would wait outside in line for their unbelievable authentic cuisine. Guac is very fresh and they give you a respectable amount. Even though a burrito is slightly more expensive than the Chipotle down the street, the quality and taste you get in return is well worth the extra couple of dollars. Life was made a lot easier for me when I found out I could just call my order in and then pick it up which I would do about twice a week while I was in college. Every time I make a trip back to Champaign this is the first place I go to."}
{"text":"UPDATE: after eating here 10+ times since my initial review, I really like this place. Their tacos are excellent, as are their gorditias."}
{"text":"For the money, this is easily one of the best Mexican places I've ever been to.  For $6 you can get delicious tacos and there is no wait time.  The only problem is there's no where to really eat it inside, but that's not an issue if you're prepared for it!"}
{"text":"LOVE this place. Don't let its small size or hole-in-the-wall style intimidate you. Their steak burritos are the best in town (in my opinion). Great value (burrito and chips are under $6) when weighting portions, price, and quality. And you get fresh, warm, homemade chips and their own unique salsa free with every burrito order. Their service is quick and their staff is friendly.   Townies know to call ahead and order your food if you are going to do takeout. Then when you get there you can just walk right in, pay, and leave! If your in Chambana and havent tried this place you are missing out!"}
{"text":"A strong addition to the relatively unimpressive community of campus restaurants.  Had the flautas and steak tacos.  Almost as good as La Pasadita in Chicago.  Efficient for the small size of the place.  Will return."}
{"text":"I am new to area and was craving Mexican food. I was pleasantly surprised with the food ! It's a small hole-in-the-wall restaurant that is sure to satisfy your Mexican food craving ! Prices are great as wel. I had a carne asada burrito and it was loaded with meat, lettuce, green cabbage, tomato, sour cream and guacamole. Flour tortilla was perfect consistency. We actually found a seat inside !"}
{"text":"Arguably some of the best, well made and most authentic Mexican food you will get in Champaign and maybe even the state.  I'd like to recommend something but with how awesome everything on the menu is, you can't go wrong.  The chalupas are delicious meat pockets, the tostadas expansive and the burritos are a deal at what they charge.  My favorite 1-2 punch is getting a burrito and quesadilla and eating the quesadilla late at night.  Dining in can be kind of a chore as the place seriously fits about twelve people (not comfortably) but their takeout is fast and if you are a lazy repeat customer (like me), phone ordering takes less than a minute.  Add in the politeness of the staff and now you know why I eat here at least once a week..."}
{"text":"Best Mexican in town but no parking. we only go when the students are  gone."}
{"text":"They are one of the best place in town. I really like their chorizo burrito a lot and that is what I usually get. I hear their tacos are great as well. This place gets packed so ordering ahead and doing a take out is advised."}
{"text":"I strongly suggest this place if you love an authentic Mexican restaurant. It is fairly small but if it is to go the wait isn't normally too long. You are normally immediately given chips and three different types of salsa. I really like the hot salsa. There is a mild one as well for the non spicy individual. I normally get their  pastor. Either tacos or fried quesadilla. The fried aspect of it really brings out the flavor in the pastor. I suggest asking for a lime. It goes really well with it. I do wish they had a good cheese dip. That would definitely top it off."}
{"text":"The cheese is the bomb (try a fried quesadilla). But the space and the crowd can get overwhelming during prime dining times. Generally, plan to carry out rather than eat in, but what really matters here is the quality of the food for a very affordable price."}
{"text":"This place is soooo cute and has that homey feel to it. Food tastes authentic and the place looks authentic too! It does get pretty busy at night because -- who doesn't want tacos on a night out?? It's worth it though if you want real Mexican food in this area!"}
{"text":"Went and tried the new location downtown last night. It was a little strange to order our food at the front before we were seated but we went with it. All the servers were new and we heard several of them say it was only their third or second day, which is fine. Food was super delicious and I'm still thinking about the tacos today but the problem was the service.  We had a party of 10, mind you and Since we ordered at the front the waitress had no clue what we ordered and basically had to start new tickets from scratch by asking us what we each had. It was a disaster. Why not use the ticket from the front that was ran to the kitchen- stay with each order to the table and then the waitress can collect them? Or have the waitress collect them before the food is brought out?  We waited for longer than it took to get our food and eat it for the checks. Waitress not fully experienced with the POS had to redo our tickets because the first round of tickets were wrong. It took forever and that's what we get for checking a place out on one of their first weeks open. We will definitely be back but not right away and when everything should be ironed out. They also do take out order as this location so that will come in handy."}
{"text":"Best Mexican food on campus.  I always get the chorizo and fish tacos.  Reasonably priced, and free chips with every order.  The green sauce is awesome.  I hope they can keep it up!"}
{"text":"Finally went to Maize for the first time today after reading a bunch of reviews online. Maize does live up to its hype. For such a small space, the owner did a great job making this place feel warm and inviting. Seating is cramped and very limited, but I guess Maize is one of those hole-in-a-wall neighborhood restaurants that everyone loves. Food was very fresh and authentic, and everything tasted good. The portion was small, so you're going to have to order a couple of things, but price is reasonable for the quality of food. Service was also very friendly too.  Pros: authentic, fresh mexican food. very friendly service.  Cons: limited parking and seating."}
{"text":"Wow... why was this place not around when I was in school?  Finally got to try it and I was surprised how awesome it was.  Guacamole.. very good and chips are thick.  Better than El Toro or whatever is in town.  Pork taco was awesome... love the salsa. Fresh and yum!  Pork Burrito.. huge and delicious.  I did not try the chorizo taco because it was gobbled up before I showed up... I was told it was the best one.  Champaign really does have great food.  The only weird thing.. it closes at 8.  But I guess they don't really need the money... amazing!!!  It does rival places in Los Angeles... true story.  And the reason why I don't have any pics is because I ate it before I could take pics of them.  Haha..."}
{"text":"Maize's food is delicious. Accessibly is what its lacking. Very small joint, parking is less than great. But if you get here when its not crowded which is rarely, it's my favorite taco place in town!"}
{"text":"Maize is in my Top 3 Mexican restaurants in town. There are a few downsides to going there (traffic is rough being on campus and the restaurant is really small with fairly long waits on peak times) but overall it's great. I really like the traditional food that isn't nearly as Americanized as most places, the tacos there are how they should be (meat, cilantro and onion). The chips are thick and although I really like them some people won't since they are heavy. The hot sauce is some of the best around and I really can't recommend Maize highly enough for anyone craving some quality Mexican food!"}
{"text":"I love this place!  I frequently get takeout here for lunch, and sometimes i've even had it twice in one day when my family wanted to have it for dinner on the same day I had it for lunch!   It's best if you call first, because it's a tiny space and in bad weather you might have to stand outside a bit.  My favorite items are the tacos (usually chorizo or pastor), and fried or grilled quesadillas.  I've had the chicken, asada, and fish as well and all are good, but my favorite is the chorizo!   Taco mexica is a taco with browned cheese on the inside, and those are very good as well.   We've had the nachos as a dinner item, but I didn't care for those as much.   Fresh chips and salsa come with your order.  I don't care for the watery tomato salsa at all, but the darker (maybe tamarind?) salsa is great and pretty spicy.  They also have horchata, which is probably from a mix, but the fact that they have it is a plus.  Definitely recommend getting it to go when school is in session and weather is nice, because it's quite crowded at lunch.  Parking is limited, so good luck!"}
{"text":"Maize has the most delicious food in C-U, hands down.  The tlacoyos are my favorite but everything is good.  I've enjoyed everything I've ever ordered.  I only wish they had more locations so that I could eat at them more often."}
{"text":"My boyfriend and I stopped here for a quick lunch on our way out of town after a short two day trip and man were we impressed. I ordered a pastor taco that was delicious and we shared an order of nachos also delicious! The homemade chips stayed crunchy and held up to the very last bite. He ordered a grilled mushroom quesadilla and loved it as well. We are new to town and will certainly make it a habit of coming here often!"}
{"text":"The tacos are so good at this place I don't know how I'm ever going to try anything else on the menu! Taco Mexicana, hands down the best thing ever. I love carne asada even though it's a bit greasy but not in a sickening way. They load these tacos with fresh onions and cilantro so you can taste the stuff for hours to come. Heheh. I love all the salsas they have for the chips as well. It's a causal diner and the service is just right. I will go back again and again until I'm completely tired of the tacos. Maybe only then I'll be able to finally try something else!"}
{"text":"Very delicious.  My sister said: muy deliciouso  My wife said: 5 stars  Good traditional food. Very very small inside. Nice size portions.  Loved it overall, I'll be coming back.   Note: confusing terms in the menu, due to authentic atmosphere, ex: pastor = pork  Try it!   You'll never find a chain this good."}
{"text":"Good place for takeout orders! Super small restaurant - it has just 16 seats that are bar stools at a counter. Food is good and fresh. Like another reviewer said, the guacamole is good but it needs a little lime and salt. Lime wedges come in the 3-section condiment server (along with red salsa and tomatillo salsa) and salt shakers are on the counter, so you can season to your taste. The chicken tostada was good and a nice size. Homemade chips are good, too."}
{"text":"Delicious.  Very authentic and quite good.  We will definitely be back to enjoy their food."}
{"text":"We went to the 2nd location at the train station and loved it! They have wonderful fresh margaritas! Great chips with two different salsas and fresh guacamole. We ordered the gordita chicharron as suggested by our attentive waiter. Wow, good choice! Also tried the chicken taco with a side of rice and beans. So full and content. Can't wait to go back!"}
{"text":"I love this place! Everything I've had here is good. It gets very busy though now, so you have to go on an off time or call ahead if you don't want to wait forever to get your food."}
{"text":"Delicious food! Lovely place! It was amazing. Great service! It is a little bit off of the main green st but it's not that bad. It's totally worth it."}
{"text":"Hard to find for out-of-towners. It's across the street from Dominos on Green St.  Decently fast service - took just under 10 minutes to get 2 tacos and a deep fried quesadilla (say it like Napoleon Dynamite's grandma). The tacos are somewhat authentic w/ cilantro / lime / onion.  They put mayonnaise (interesting) on under the meat on the tortilla, but it was hardly tasted. My big complaint is the tacos and quesadilla were extremely dry.  They have two salsas - an orange and yellow colored salsa.  The salsa tasted good on the chips, but not good enough or complimentary for the entree.  The girl who took everyone's order was very nice so customer service was good.  Lastly, the restaurant only seats 12-14 people (elbow to elbow) so eat out if you wish.   Ultimately I would not eat here again, but if you read other reviews and decide I'm off my rocker, take it to go and buy an extra bottle of water because your mouth will be dry after eating."}
{"text":"Maize is fantastic. The food is reasonably priced and delicious. The only downside is the parking, (park at dominos and walk across the street). Best Mexican food in champaign, hands down."}
{"text":"This place is amazing. Best Mexican on campus, forget El Charro, even on wednesdays. The homemade salsas are amazing. I always have the same order, 3 tacos: chorizo, pastor, carne asada.  My only drawback is a decrease in quality with the high volume. Food amounts can be variable, but their dining room is tiny, and the line always out the door.  I'll be back many times next year in champaign."}
{"text":"Wish they had a bike rack. Food is fantastic but they recently raised prices. Staff is friendly and efficient at getting your order out quickly. They also don't give single diners the complimentary salsa platter anymore, just a single bowl of mild. Better go with friends if you want the lime wedges and spicy salsa. Horchata tastes like it's from a mix, but I don't know of anywhere in town that makes it from scratch either."}
{"text":"My favorite Mexican steak tacos in town! The best place to go for Mexican tacos worth the wait in line :)"}
{"text":"This place is really good.  They need a bathroom, and as far as I know, if there is a seating area, a bathroom is required.    Food is pretty good for carry out for sure.  I'm not suggesting their food makes you use the bathroom, but it would be nice if you could relieve yourself after having a meal."}
{"text":"I've been to Maize twice now and dined in both times. Once I came before the dinner rush so it was easy to get seats, and the second time was during the lunch rush so we had to wait around for people to leave. Love the chips and salsa they give you when you dine in, and the guacamole is bomb. From my two visits, I've decided the tacos are the most authentic I've ever had. So simple, corn tortilla topped with meat, onions, and cilantro, but so, so delicious. The first time, I had a ribeye, fish, and chicken taco. I still remember my first bite of a Maize taco and thinking holy mother this is good! The chicken was blackened and crispy and rich and oh so delicious. I was surprised how much I enjoyed the chicken taco, thinking it'd be the simplest of the three, but it ended up being so flavorful. The ribeye taco was also excellent. I love fish tacos in general, but my gripe with Maize's was that the texture was a tad on the mushy side and it was a little boring compared to the others. Probably will stick the meaty tacos from here on out. The second time, I ordered a ribeye and carne asada taco and a chicken tostada. Both tacos were excellent as expected, and I thoroughly enjoyed the carne asada. Tender and flavorful. I decided to give the tostada a try, and I'm glad I did. Crispy tortilla topped with beans, chicken, salsa, lettuce, and cheese. The chicken was different the second time, not as more like a pulled chicken, which was still delicious, but not the crispy blackened chicken I remember. The tostada was good, however, there was a little too much going on so I plan to stick to tacos in the future. Overall, I am so glad to have Maize on campus. It is cheap, authentic, and delicious. I'll be a loyal customer as long as I'm in the Champaign area!"}
{"text":"I went to Maize for the first time today for lunch; all I can say is AWESOME! Fantastic, authentic, Mexican fare with homemade tortillas, homemade salsa, and flavorful meats and fresh toppings. I loved the chicken, asada, and pastor tacos all equally, and can't wait to go back and try more!"}
{"text":"Service was so slow, the server didn't seem to know what he was doing and the employees were so busy talking and ignoring customers  Not impressed.  All this before the food even arrived"}
{"text":"I stopped in after taking a final exam for their buy 2 tacos get 1 free Hooked deal.  I got a carne asada, a pastor and a chorizo taco.   Out of all these, I would say the pastor was the best. The steak was decent, but not as flavorful as the pastor, and the chorizo was tasty, but in my opinion very very salty and greasy.  I make my own guacamole at home but ran out of chips, so I tried to order an extra side of chips at Maize. I thought the cashier understood what I wanted, but instead she gave me extra cups of salsa, and I didn't realize it until I got home. Oops!  The tacos were still pretty good and I'd say Maize is still one of the best spots for Mexican food at UIUC."}
{"text":"Go with the Steak burrito its delicious and tasty. Chips come complimentary on the side for orders no matter if its dine-in or to-go orders. The rice is delicious flavorful and reminds me of some of my favorite mexican restaurants back in Chicago. Maize is a go to if in the C-U area."}
{"text":"A tiny spot on Green St just before the main part of Campus Town.  All counter space seats, and just a handful at that.  So you either are lucky to get a seat, or take it to go.  Service is friendly and knowledgeable with recommendations.  Food comes out piping hot before you know it.    Huge burritos, tortas, tostadas, flautas, etc, with some tacos and other various Mex offerings.  A torta is more of a pressed sandwich.  The chorizo is great, and the spicy torta is amazeballs.  Swimming in spicy pan drippings.    An excellent spot for anybody, but especially as a lunch spot for students during the school year.  So while the U of I is in session, this place is always packed.  Luckily I am usually up this way during the Christmas break and it is really chill.  One of the better spots in Chambana for a great lunch."}
{"text":"I've only stopped in for carry-out once, so maybe I need to try something else on the menu. I have to assume I'm missing something for this place to be getting such rave reviews. I am a taco fiend and wasn't impressed, especially with the fantastic El Charro being right down the street.   I ordered two of their \"Taco Mexica\" with chicken, because I'd heard good things about their \"grilled cheese taco.\" The chicken was shredded and barely had any taste to it, which docks major points in my book. There was basically no seasoning in the meat at all, which is why El Charro wins the chicken taco contest by a landslide. The grilled cheese taco thing was interesting, but I honestly couldn't taste the cheese much, and I covet my cheese, so again, I didn't love it.    The traditional cilantro and onions topping gave it props in my book, but without tasty meat, what's the point? Maybe their beef is the way to go. They include free chips and salsa with your order, and here again I was disappointed. (I'm such a jerk judging free food, aren't I?) The salsa just wasn't my style. I'm basically obsessed with the tomatoey, cilantro-filled stuff El Toro will dole out for free, and I just can't get into spicy traditional salsa. That's a personal preference, though.   The guacamole looked really good, but it was mighty expensive. It's $5.95 served with chips, and you get a giant saucer of it, but El Toro serves up some great guac at only $3.50. (And of course you get free chips and salsa at El Toro.)  I might go back only to try out their fish tacos and guac, just to give the place one more shot. Good fish tacos is the only thing C-U is missing as far as Mexican food goes."}
{"text":"In being a Mexican I thought my move to central Illinois would lack some serious Mexican food. Wait no more. This place is a top dog when it comes to Mexican food.   I haven't had a thing there that I haven't liked. Try the Horchata with your meal--it's awesome!"}
{"text":"Decent Burritos. Better Taco's. The space is too tight, but I guess if you are on a tight budget, you can easily bump it up to 4 stars."}
{"text":"Great Mexican on campus, but more expensive than the average taco place.  My favorite is the Tacos Mxica, which are $3 each.  I love the hot orange salsa, but the mild salsa is very watery in my opinion."}
{"text":"Overrated. Lots of choices but all seems to taste the same. Very little flavor. Greasy. Have gone a few times in hopes of having a better experience but unfortunately, no."}
{"text":"THE GOOD: It's a cut above your standard mexican food. They serve limes with their dishes and they come hot and fresh. Some different menu items than your typical champaign el toro/terero/etc.  THE BAD:I truly believe this place chose such a small venue to give the illusion of a busy restaurant to generate buzz about their business.   STAY OR GO?: I would not go back to this place. Mexican tastes ALMOST the same everywhere you go in town. Other places in town you get to sit, be served, and relax (and the price is about the same)."}
{"text":"We found the food to be very tasty. The service was fast, and friendly. The atmosphere is heavily lacking though, and the lack of space in the restaurant is a huge drawback since I tend to like to eat at the restaurant instead of getting the food to go. Definitely not for the claustrophobic."}
{"text":"We just had our first visit to their new location. We were there for lunch. Food and service were both great. All the ingredients tasted farm fresh. It is nice that they now have a large location where you can dine in. We will definitely be back."}
{"text":"Tostadas, I'm such a fan of their pastor tostadas. The wait and limited seating make it kind of a pain though. So I suggest calling in and ordering for pick up."}
{"text":"Cinco Estrellas?? That does not do this place justice. This jawn is Heisenberg level Mexican cuisine, at a Los pollos hermanos price point.  Every time I have eaten at maize, the food has been consistently fresh & consistently delicious. The proportions are generous, with no corners cut that I can tell ( except lettuce at the bottom of the guacamole to make it appear as a larger quantity, but that's common practice everywhere)  The only thing this place needs to do is obtain a bigger space or open another location.. It kinda cramps my style"}
{"text":"Coming from CA, we were generally happy with this place except the lack of a truly spicy salsa.  We'll give it another shot soon, though!"}
{"text":"The food is very good. The staff are professional and food is prepared quickly and fresh. I personally enjoy the fish tacos and rib eye tacos, the hand made tortillas really take it to another level. I also like the tostadas with pastor or chorizo, they come with great toppings. And the rice is amazing! Great place for lunch or dinner."}
{"text":"Awesome, fast, cheap.  Great food, quick service.   4/5 because its super, super, SUPER cramped in there!"}
{"text":"Saw all the good reviews but was deterred by small seating area and parking lot, finally went there twice this week. I think the food is quite good but maybe a notch below expectation from the reviews. Very friendly staff and reasonable prices. Will go again."}
{"text":"Maize is good, but the hype has gotten out of hand.  Their burritos are average - I mean, they are above-average for this area, but in general they are just okay. Kind of loosely wrapped, which is disappointing. Chips and salsa are good. Tacos seem fairly standard. Perhaps the issue is that there is so much mediocre Mexican food around. I heard rave reviews about here, and have tried them a couple of times, but they are just good in my opinion. So, this is a local 4 (I'd rather have Huaraches) and if I'm judging it against legit Mexican in other areas of the country, it's probably a 3."}
{"text":"My son graduated this May and we decided to order a variety of menu options and have the food catered. My entire family completely enjoyed the meal. We ordered chips, guacamole, burritos, tacos, quesadillas, tostada-in a variety of meats, rice, beans. Sad we will not be regulars since my son has graduated.  Definitely worth picking up since the eating area is small."}
{"text":"Maize is amazing. Their service is fast and friendly whether you eat in or take out. I have never had to wait for food longer than probably 8 minutes, and this is a place I frequent almost every week.   My favorites are the steak taco mexica, grilled chicken quesadilla and queso fundido (though I must admit it is a ton of cheese so I don't get it often). Their chips are also amazing, and everyone I have taken here absolutely love it."}
{"text":"Everything is delicious on their menu. My go-to is two chorizo or steak sopes. I sometimes get the quesadilla. The tortilla on the quesadilla is thick (just like a sope). Be sure to ask for a specific salsa for your tortilla chips. Beware, any hooked (or similar) coupons might not be valid."}
{"text":"Parking can be crazy, as can the wait. The food is pretty good, but if it is crazy busy, I suggest you try somewhere else. I don't think it is worth waiting that long."}
{"text":"The food here is authentic and tasty, and lives up to its hype as a campus favorite. The biggest seller is the price, which is relatively low compared to other local Mexican grills. Only downsides are the limited size of the menu, and the smaller portions (particularly the chips). Regardless, I go back to Maize whenever I am back home."}
{"text":"The food here is absolutely wonderful.  Probably easily the best Mexican in town and in all of Central Illinois for that matter.  The service staff is nice and has always been helpful.  The only downside has been the small space, so I typically don't dine in and opt to take out."}
{"text":"This place is the best Mexican food I've ever had! Easily the best Mexican food in Champaign.  My only complaint is how small this place is.  They really need to expand and serve alcohol.  Also, since they're so close to campus,  the crowd can be a little unbearable."}
{"text":"I'm from San Diego, CA. We generally have the most authentic Mexican food in that part of the country. Maize is the most authentic you can get in the Midwest. Everything about the food is really good. And the service is quick, friendly and the restaurant is really clean."}
{"text":"Very small place but well worth squeezing in. We had tacos and tostadas both were excellent."}
{"text":"A couple of weeks ago my daughter told me about this very scrumcious taco joint!  Me Being the taco enthusiast that I am, I had to give Maize Mexican Grille a try ! I had the steak tacos \"of course\", horchata, guacamole and pico de gallo. All I can say is delicioso and muchas gracias!!"}
{"text":"Maize is some of the best Mexican food I've had. It definitely lives up to the hype. The menu has so many options that provide a lot of food for good prices. It is always so tough choosing but the workers usually have great recommendations! Ordering ahead is an option especially when it is busy hours but I always seem to forget to do that. The wait is worth it is a small place so do not be surprised. While it is no longer on my walk home from class, I will go out of my way to get Maize."}
{"text":"I travel for a living and have probably eaten at over a hundred Mexican restaurants AND I just got back from Mexico, yet Maize is seriously one of the top 5 Mexican restaurants I've been, maybe even top 3. Wow!   There are 2 hot sauces served with chips, the red one is ok but the more yellow one is UNREAL. Delish! Very unique sauce!!!  Guacamole and chips: A+  They have real Mexican sodas like Jaritos and Coca Cola (made with cane sugar, not high fructose corn syrup as in the US recipe).  The tacos were the best! I'm sure the tortillas are hand made. Yum!   There is very limited seating (less than 20 spots) so it's hard to get in but the wait is well worth it.   Thanks for having such high standards,  Maize; we the (eating) people appreciate it!"}
{"text":"5 Star for great food and flavor / 3 Star for comfort and the process = 4 star average.  We were there 10 min after it opened on a Sunday morning and it was already over half full.  Next in line we had to look over the menu quickly and then place our order.  Fortunately, it didn't matter what we ordered, it was all delicious."}
{"text":"Fantastic hole-in-the-wall authentic Mexican place. Indoor seating is a little cramped but the food is fantastic and fresh. The quac is pricey but excellent. Would definitely recommend"}
{"text":"Had the asada tlycao here very good for afternoon but not too filling. The tlycao comes with a special sour cream and a taco with black beans processed into the taco itself which is quite tasty. The tylcao was good and we got seats so that was a plus. Better though for takeout."}
{"text":"YUM YUM YUM! I would have to say they have the best Mexican food on campus! They have everything from tacos and burritos to flautas and tortas. I can't even put into words how delicious everything thing is. I really wish I could give them 5 stars but can't because of their limited seating areas, such small store space, and limited parking. Really, other than that. It's wonderful :)"}
{"text":"The place is super small. I tried to do take outs everytime I visit. The food is ready literally less than 10 mins after you order. Try their pastor (taco, burrito, etc) it's soo good!! They also have this thing called ghost pepper which is really really spicy and you have to ask for it. My friend bet me $50 to eat it, and I did! It was not spicy - it was painful! Do not attempt!"}
{"text":"The best authentic Mexican food in town. Tacos are good and burritos also good. Parking for about 5 cars and seating for maybe 15 but many people call ahead and just wait outside for their orders to go."}
{"text":"Fantastic!     The tomatillo salsa was so good I could drink it.  Smoke with a spicy tingle at the end.  Guac was fresh and good.   I sampled tacos; asada, pastor, and fish.  Great flavor.  Even the tortilllas were great.  Going back for more !"}
{"text":"Maize is just one of those start-ups you want to see do well and all for good reason. As soon as I step in, I walk into an extremely cramped space full of people(mostly college students). The interior was rather cheerful and clean. There was a strange buzz about the place with everyone either awaiting or devouring their food while engaged in happy conversation with their family and friends. Despite the shoddy exterior and sheer lack of seating pace, there place possess a warm and inviting feel.    The food itself is VERY reasonably priced to start with, which to a college student like me is always a plus. The ingredients were fresh and you could easily tell that the food was made to order. My group was first served the complementary chips and salsa, and the freshness of the salsas just shone through. I ordered a vegetarian Torta Ahogada made spicy. I am a sucker for very spicy food, and my oh my was my palate for once was satisfied on this front. It was flavorful and very filling.   All in all, Maize offers Mexican food in a less cliched and entirely authentic way. It offers not only freshness of ingredients, but also fantastic value. Of course, the place wasn't designed to ever give people a satisfactory seating experience, but the food more than makes up for it.   An A+ from yours truly."}
{"text":"Great Mexican food! Try ALL the tacos. I love their Tequila Drinks. These are great people with truly authentic food!"}
{"text":"This is my go-to stop on the road from Chicago to Kentucky. As in, I'll gladly go out of the way to go to it.  The food is fantastic, authentic, full of flavor, and fast. Anything from tacos to huaraches; all good, all fresh, all the time. I've never been at a time when it wasn't busy!   This is the hidden gem of central Illinois. If you're near C-U and you're even remotely hungry, do yourself a favor and stop to eat here."}
{"text":"If you're looking for authentic Mexican tacos? Go here. Hands down the best tacos in Central Illinois. I grew up in the South Side of Chicago, moved to Bloomington for school and later moved here to Champaign... as one can begin to imagine, finding an authentic mexican joint has been a difficult task.  I also like the fact that there are no actual tables, just bars and stools - reminds me of those good ol taco corner restaurants in my old neighborhood. Skip the other restaurants, and pick some food up here and enjoy it in the comfort of your home if it's too crowded. Definitely worth it!"}
{"text":"It's cheap. But I don't like cheese. The chili sauce is nice."}
{"text":"Great service, great food, great prices. The nachos are the best! Definitely a gem of Champaign."}
{"text":"Great mexican cuisine!  Its simply excellent.  The only neg is that its small, but for good food and great service one has to suffer a bit :-)"}
{"text":"Both locations are great. I'm in love with the food! Amazing service. They make tortillas fresh there so order tacos. Horchata is excellent. I also loved the quesadillas and tortas. I will definitely return!"}
{"text":"Excited to try Maize after looking at the reviews, Orderd a Veggie Burrito and I got a tortilla filled with rice with a couple strands of lettuce. So dissapointed! Everyone else enjoyed their meals but I will not be going back."}
{"text":"There's not much I can add to what other Yelpers have said.  I've tried most of their item combinations:  tacos, gorditas, queso, etc.   You really can't go wrong with anything here."}
{"text":"Food is MUY DELICIOSO!!! Super, super authentic- has a food truck feel, with a diner atmosphere. I absolutely love that the salsa tray comes with fresh lime. My steak taco had a perfect sear with yummy crispy fat. There are framed awards on their wall for good reason. 10 out of 10 reccomend!"}
{"text":"I love Mexican food, but for some reason had never tried food at maize. Finally, today I went to try this place with so many amazing reviews on Yelp. I ordered chicken fajita and guacamole & chips to go. The quantity of chicken fajita was enough for two people. Now, let's talk about the taste: Chicken fajita(6/10): chicken was dry and bland in taste. However, veggies were nicely grilled and rice & beans also tasted fine. Tortillas were soft and warm. Guacamole and chips(6/10): chips were crispy but guacamole was bland. I added a little lime and salt to it after which it tasted fine. It was served on a bed of lettuce which did not make any sense to me. Complimentary salsa tasted really good. Overall, I was not so happy with the food."}
{"text":"I love this place! Try the tlacoyo if you haven't. With a side of rice and beans, you got yourself a meal. The tlacoyo with al pastor is my favorite. The meat is really flavorful. Mmmm. It's topped with cream, cotija cheese, and cilantro. It's delicious!"}
{"text":"I criticized Maize for its torta ahogada, but are people giving this place critical reviews after ordering chicken fajitas? You order Tex Mex (and the driest kind) at a Mexico City taqueria and then you neg rep the eatery and express doubts about the buzz this place gets?  The food is amazing. The final touch of mastery: sweet, soft, diced potatoes in the fluffy rice. Thank you, Maize."}
{"text":"WARNING - this restaurant does not operate in a drug-free zone. That is the only thing that explains why they can serve up Mexican food that tastes so good that it is addictive. If the DEA ever raids the place and prevents them from spicing their food with crack, than their food will start to taste like all of the other places that attempt to serve Mexican food.   We ate a taco, volcanoes (tostadas), huaraches and carne asada. You could not go wrong with anything they served up. The only downside was the lack of parking. Come prepared to wait for a seat in a small crowded diner or bring a blanket to spread out on the ground outside for a picnic lunch. No matter where you eat, the food is worth the trip."}
{"text":"As a Texan I wasn't expecting to find impressive Mexican food in Central Illinois; a friend of mine from LA urged me to try it with the glowing recommendation of \"best burrito ever\".  I went to school at UoI and most of the places are poor Tex-Mex at best, so my expectations were low.  However, this place made me feel that I was visiting our neighbors to the south.   The seating is minimal so you may want to take it to go but should you find a seat you'll be able to watch freshly made food fly out of their kitchen with expediency.  I had a pastor burrito that was sensational, the pork had the perfect amount of spicy without detracting from the other flavors.  Sour cream complimented the vegetables and pork well without adding to much cream and the sides of salsa wear well balanced with a little heat.  The most overwhelming feature for me was the observance of them preparing made from scratch tortillas for each order; light but interestingly hearty these had a fantastic corn flavor which was better than any tortilla I've ever had.  As mentioned before, I'm a Texas Mexican food snob and this place honestly floored me.  I don't come back to my Al ma mater often but next time I do I'll go here."}
{"text":"OK somewhat revising my MEH attitude because I've been to Maize far too many time in the last few months to sleep well with haven given them only 3 stars (or it's all the burritos).  YES - by far the best Mexican in town. Their carne asada leaves me only wanting more. The burrito sans lettuce gives best beef delivery system; or perhaps lines of tacos, cut with a little lime, straight to the face.  NO - this place is not any better than a solid 1/4 of taquerias in Chicago. It's more expensive than them too, but cheaper than driving north. It is not Mexican food reincarnate. But it is, in the end, very delicious.  Skip the lettuce. Get only the spicy salsa. The chips are amazing. Please tell me how to make your asada. If my next review is 5 stars, then they have taught me how to make the asada."}
{"text":"Best Mexican food in Champaign Urbana hands down. Food is always fresh & never disappoints. I would recommend the tacos."}
{"text":"Best AUTHENTIC  Mexican food in CU hands down. Super staff. Very clean. Great variety. Super small place"}
{"text":"Restaurant review: Simply delicious. Yelp was spot on that this location has likely the freshest high quality mexican food that may top the best in the US. It was so busy 30 minutes into opening that we had to take our food to go. There is a wide selection of authentic mexican dishes. I ended up with a selection of tacos (steak, pork, and carnitas). Although they were soggy by the time I got home, the ingredients were so fresh and the flavor was perfect. Not too salty and rich in flavor. The prices are perfect a lot cheaper than Rick Bayless Xoco. I just wish it was easier to find parking or even space to eat in. You get chips and 2 types of salsa for free as well even if you are getting carry out. I was surprised I only got 1 bag even with four entrees. I will have to make sure I ask for more next time. Overall this is probably the best mexican restaurant I have ever been to  Pro: delicious mexican authentic and fresh   Cons: very small parking lot and equally small dining area  Hidden gem: Free salsa and chips"}
{"text":"Let me start by saying the food was awesome.  It was hot, it was flavorful, and after I ordered it was in front of me in under 5 minutes.  The chips and salsa that come with it are also pretty tasty.  The establishment itself is tiny.  we are talking maximum occupancy of 15 kind of tiny for seating, there is the low bar at the counter and the high bar lining the exterior windows and that is all.  Very cramped, makes this place more of a to go only restaurant unless you like feeling like a sardine.  The parking lot was even worse, there are maybe 6 spots to park and 2 are handicap spots.  I got lucky and pulled into one with my tiny Kia Soul that barely squeezed into the spot on the end simultaneously pissing off the other 12 cars trying to figure out how to park at this establishment and not having much luck.  Overall, The food is great, get it to go and walk there if you can because you are not going to find a place to park."}
{"text":"This place is tiny but the food is mighty!  Best Mexican food in town at an amazing value. The only problem is the size of the establishment. I am very excited to try the new downtown location!"}
{"text":"This place is a hidden gem. It looks like an old gas station. Its so tiny. But the food they serve will rock your socks off!! Really best taco's ever, hands down!! Go there!!! parking sucks!! As long as you know that going in it should not frustrate!! Get some!!!!!"}
{"text":"The best Mexican food I have had since L.A. This place makes authentic Mexican food. Those who don't like this place probably complain that it is lacking because it's not like Chipotle or other Americanized-pseudo-Mexican food chains. But that's why Maize is so delicious: it's not another Chipotle. The tacos and chips are freshly made. They don't taste stale. They taste like freshly ground corn, with a hint of lime and salt. The lettuce tastes fresh and crisp. The choice of protein is hearty and fulfilling. All the ingredients come together to create that delicious, authentic Mexican dish. From the burritos to the tacos - everything tastes amazing. Also, I love the portion sizes - they're not too filling. So when you come to eat here - please don't judge this place against Chipotle. This is an entirely new and different Mexican food experience.  Also, the chips. They are freshly made and fried served with a sampling of different sauces. They are amazing! They're so addicting. And they're free when you order a minimum amount of food!"}
{"text":"The food is really expensive. They won't let you have different types of flautas in one order. The steak in the flautas is too big so when you bite into the flauta the whole chunk of meat comes out and you are left with a gross hollow thing. I ordered queso fundito, and it was a solid hard thing, not a dip, yet it came with chips? It was like solid, with the pumpkin flowers sandwiched in the middle. They didn't warn us that the prices had gone up when we ordered ahead on the phone. There's nowhere to park. It has a teeny tiny eating area. It's right on campus, so it's overly crowded all day. The good thing is if you order guacamole you get a TON of it."}
{"text":"Just picked up our order of Volcanes and Tacos Mexicas al pastor.  I've tried the chicken and steak and they are great but if you haven't had the pork, you do not know what you are missing. The pork Volcanes is like nothing I've had anywhere in my life. This is hands down my favorite place for Mexican food and I consider myself somewhat of a connoisseur. I live about an hour away and it has been WAAAAY too long. Waiting to get home to eat tonight is just about killing me! Thank you Maize for doing what you do!  PS - Anybody who gave this place a bad review must have ordered something boring although I can't imagine what that would be...??"}
{"text":"Yummy tacos! I will admit, I have never sat inside and have only ever gotten carry out. I tend to gravitate towards the fish tacos - they're light and clean and tasty! I only ever get traditional toppings on tacos (cilantro, onion, sometimes cheese).  I got the chorizo taco once and felt that it was a bit too greasy/oily. I have also tried a couple other things on the menu such as the tostada, sopa and fried quesadilla.   I didn't find the tostada and sopa to be memorable, but I am a BIG fan of the fried quesadilla. I have gotten it with chicken and another time with steak. However I always add pumpkin flower! I'm not sure if they still offer pumpkin flower - it might be listed on the menu now as zucchini blossom? Definitely look into this. Fried quesadilla is very interesting. It's not exactly reminiscent of an empanada, but it's this dope fried pocket you can cut in half and drool over."}
{"text":"I went here with my best friend a few weeks ago. The menu is small and the location is even smaller. As a U of I alumni, I have seen many businesses come and go through this location. It is nice to finally see a business that is showing signs of sticking around. The food is simple and delicious. The service is fast and friendly. No complaints and I will definitely be back."}
{"text":"Great Mexican food with a great price. They are almost always busy and they have minimal no seating so plan to take out your food. There's a park a few blocks northeast that's perfect to sit and eat at in good weather."}
{"text":"In town from New Hampshire where they are short on authentic Mexican restaurants. My wife and I pushed our way into this tiny place and found seats at the counter. The guacamole was terrific and came in handy later. She played it safe and had a taco, I gambled on the Torta Ahogada with chorizo which the woman behind the counter described as VERY spicy. It was. My eyes were watering before I had eaten a forkful and my lips are still burning. But it was so worth it--like a super hot Mexican French Dip. Only their heavenly guacamole could ease the heat. The two meals with soft drinks and tip came to $25. Yeah. $25. Wow!"}
{"text":"Yes yes yes! All the yes!  Solid, very affordable menu, very authentic, very delicious. You definitely need to try this place!  Definitely get your order to-go. The only downfall of this place is that it's far too small. However, they should be moving to a bigger spot soon and I can't wait!"}
{"text":"Awesome Mexican tacos, with the cheese grilled directly onto the tortilla!  They also have free chips and salsa, and amazing guacamole!    Be sure to try the huitlacoche quesadilla. It looks weird, but trust me you'll love it! Viva huitlacoche!!"}
{"text":"Fantastic food, obviously.  However, it's tiny inside and you could never PLAN to eat there, but you might get lucky if someone happens to be leaving.  It's so small I've often ended up waiting in a short line that goes out the door.  Not much place to park either.  If it were more accessible I'd give it 5 stars."}
{"text":"Absolutely delicious! I had the steak huarache, and loved it. Their horchata is also great (not to sweet). Only downside to this place is the size, however, you can take out. All in all, one of the best Mexican food places in Champaign."}
{"text":"After years and years of trying, I still don't get the hype.  The taste is slightly different from other Mexican restaurants, but to use that difference and brand it as truly \"authentic\"? I like the made-from-scratch aspects of it-- such as the corn tortillas and horchata-- but I'm not willing to wait in line for them. Take the hype with a grain of salt."}
