{"text":"Matty Matheson was the catalyst for our visit, n he did not disappoint. What a great find- had the Porky pizza and it was the climax of my life. Coming back tomorrow."}
{"text":"Reviews point to this as The Second Coming of pizza in Toronto, but, as is often the case, are actually overstated and overrated. The crust is too bready (a waste) and the toppings are decidedly not revolutionarily superior. Staff recommended 3 larges for 5 people - far too much food. At $25 per, a hugely expensive dinner that did not match the hype. My guests were guarded in their opinions, damming with faint praise but would not order because of price. And while $14 for an individual seems more reasonable, sitting down to a comparably-priced version at a restaurant that has some ambiance seems a better option, since eat-in at Maker is basic. Fine if you're only getting a slice, but currently they don't sell slices. I didn't find a delivery charge listed anywhere but if you ask, they'll tell you it's $4. Also they take cash only for delivery. Ordered the Siena Margherita, Dr. Pepperoni and Tropic Thunder. Nice staff though."}
{"text":"I live well within their 5km distance of delivery. We ordered over the phone and were told an hour and a half for delivery. Thats not the best but we were looking for a decent pizza. The delivery guy shows up over two hours late. OVER TWO HOURS?! It's an absolute joke! Maker Pizza - your not even worth my time anymore. I'll take Pizza Hut, Dominos, heck even bloody Pizza Pizza over your horrendous service and mediocre OVER PRICED pizza. If you give me poor service I'm not going to tip you well - so to the delivery guy - no need to be an ass when the pizza is cold and two hours late. To quote Dwight Schrute: \"Why tip someone for a job I'm capable of doing myself? I can deliver food, I can drive a taxi, I can and do cut my own hair. I did, however, tip my urologist. Because I am unable to pulverize my own kidney stones.\""}
{"text":"These pies are so fucking good. Ordered a meatball sandwich & meatball pizza with ubereats, shit was so tasty we ordered another two pies at halftime. GF and I ended up smashing three small pizzas and a sandwich over a couple hours. The chewy sesame seed crust is just unreal."}
{"text":"YUM!!! If you love pizza like I do, this place is a must try. The pizza is absolutely delish. We've ordered from this place twice now for delivery. The first time, we got the Frank's Best (white sauce pizza with goat cheese, honey, rosemary, caramelized onion, etc.) and the Little Deuce Coop (red sauce pizza with roasted chicken, basil, roasted red pepper, red onion, ricotta, etc.). Both times, we got the beet salad with arugula and ricotta.  The salad was good, but nothing out of this world. What *was* out of this world was the pizza. Especially the Frank's Best. The saltiness of the cheese combined with the slight sweetness of the onion and honey was the perfect combination. And even if you're not usually a fan of pizza crust, the chewy sesame seed crust will change your mind. So good.  And now I'm craving pizza again...!"}
{"text":"The pizza was tasty and the location is interesting but the cashier was a very disrespectful person, worst costumer service ever."}
{"text":"I have tried almost every pizza joint in downtown and I have got to say this place has climbed up to the number one spot. The pizza was amazing, very authentic taste from the dough to the sauce and toppings everything was perfect! Will be my go to spot for pizza from now on."}
{"text":"This pizza was insanely delicious.  I had the signature pizza with mushrooms, my husband had the caramelized onion-honey-sesame seed pizza, and my two kids had a cheese pizza.  I ate way more than I had room to eat, but no regrets!  The service was fast and very friendly."}
{"text":"Went in on a Saturday evening and ordered two pizzas, Apocalypse Cow and Tropic Thunder.  Was told it'd be a 45min wait.  Guess that's to be expected on Friday/weekends.  So decided to hang around and watch the going ons.  Noticed they only had 1 oven going so not sure if they're still bringing things up to speed.    Boy are they busy, the phone never stops ringing and the delivery people keep coming and going.  There were others waiting and some had gotten their pizzas already were eating there.  Pizza looked good.  Place was smoky and hopping.    The pizza arrived and we decided to take home rather than eat there as I'm not too far from Makers and had craft beer in the fridge :)  There are some really good pizza placed in Toronto now and I would put Maker among the best of them.  Ingredients are fresh and crust with sesame seeds :)  We really enjoyed the Apocalypse Cow but the Tropic Thunder I thought was a miss.  It was too hot and the salty\sweet and hot didn't do it for me.    I think next time Siena Margherita and something meaty would be better.   I expect the wait times won't be going down.     Tip, if you want dinner at 6pm, order at 4:30pm otherwise you may be left hungry and cranky."}
{"text":"Simply put, best pizza I have ever eaten! The Tropic Thunder pizza was just excellent. I had planned to add some ham to it myself but when it arrived and I had a slice it was so perfect the way it was. I am on the very edge of their generous delivery zone, but even on a Friday night it arrived in just over an hour. A medium is definitely enough for two people and seems a good size for manageable slices. But get larges and have leftovers!"}
{"text":"A very nice hole in the wall , off the beaten tracks of queen street west. Most of the pizza variety looks tasty , I tried the Apocalypse Cow with the roasted  sesame seed crust , this crust with the sesame seeds gives the pizza a whole new taste and takes pizza to another level :-) Sesame seeds are one of the best ingredients for pizza or any type of bread ."}
{"text":"Hands down my favorite pizza in Toronto.  It's also the best customer service."}
{"text":"The bodega sandwich is incredible. Everything missing from the Toronto hoagie scene.   Pizza is fresh and hot. Had the margarita. Spelling? Crust was incredible.   Service was terrific. Very eager to please.   Caprese salad was generously sized.   But the sandwich.  Whoa. Bread was perfect. Amazing chopped pepper topping gives it just the right kick.   Only reason not five stars is ventilation. I woke up stinking like pizza!"}
{"text":"This is the BEST pizza I've ever tasted. I almost don't want to write this review because I kinda want to keep this place a secret all to myself. The pizza is amazing beyond words. The staff take what they are doing very seriously and work like beasts in there. Perfection. Hard to find caring employees in this city. Makers Pizza restored my faith in work ethics in Toronto's food industry. I am a loyal customer. Love love love it!"}
{"text":"Excellent customer service! Asked if they had gluten free pizzas (they do not) and was blown away by the knowledgeability of the rep. Well done Maker pizza"}
{"text":"Pizza is fantastic. Free parking is a novelty downtown. Simple and clean set up where you can eat. Friendly staff who are happy to recommend. Flavour combinations are well balanced and the pizza itself is worth writing home about!"}
{"text":"Came across this hidden treasure from an Amex Food tour deal. Pizza is made to order so, it is a bit of a wait. Would recommend calling in advance even if you are eating there unless you want to wait 15 min. It was worth the wait tho.  The place has a very spacious industrial feel and you can see people making the pizzas! Pizza \"condiments\" such as chili peppers, Parmesan cheese, napkins, plastic forks and knives (and the menu) are spaced around the eating area. Whether you are eating in or taking out, your pizza will come in a pizza box - wish they had an alternative way if you are eating-in to avoid wasting boxes.   They used fresh mozzarella and basil. The pizza I had also had sesame seeds on the crust (genius!). The crust wasn't thick and was chewy in a \"bouncy\" way which reminded me of the pizza I had in Naples over a decade ago! Would absolutely come back here again and would highly recommend this place! Everything from the cheese, to the herbs to the tomato sauce and the crust was FRESH."}
{"text":"I've only been here once, admittedly, but every time I am hungry I still think about how good this place is.  Not necessarily the typical college slice that is so common, but it is really artisan pizza that has flavour combinations that I would have not thought would work, but it does.  Rosemary, honey, and goat cheese?  What an experience.   Probably some of the best pizza I've had in my life, it is just really out of the way in an inconspicuous area in chinatown.  If I lived nearby this place should just start a tab for me.  Everything is made to order, so it's a small wait, but that's how pizza should be served."}
{"text":"Terrible experience! We never even got the food we ordered!   After waiting 2 hours for delivery (they told us it would be an hour and 15 mins), they realized they input our address wrong. They didn't have a phone number for the driver to correct it. How can you not have phone numbers for your staff! We told them to cancel the order. After which we got a call from the driver who accused us of providing the wrong address. I couldn't believe it! I was scared he was going to show up at my door and threaten me.  They left us hungry and infuriated at the complete lack of customer service."}
{"text":"Pizza is great but the constant refusal to take credit cards when placing an order for delivery has gotten to be too much.  Too many other good pizza places to go to without the hassle.  Thanks but no thanks."}
{"text":"All about the pizza, as it should be.  Very high quality ingredients crafted by a group of people that care about what they're doing.    If you're in Toronto and want pizza that would be considered excellent in any city in the world, check this spot out."}
{"text":"Four of us ordered two large pizzas and dined in on a cold Saturday night. When I'm trying a place for the first time, I like to stick to the basics.  My go-to Za is pepperoni, green pepper and mushrooms. Unfortunately, they didn't have any green pepper so we ordered Dr. Pepperoni and Tropic Thunder.   Dr Pepperoni was excellent. Pizza was cooked to perfection with a nice crust that wasn't soggy or overly crispy. They used real Pepperoni and ample cheese . Didn't love the fennel seed oil but it didn't detract from the pizza at all.   Tropic Thunder had an Indian flavour due to the cumin seed but still very good. Sesame seed crust was great, I think Id get that crust on any pie.   It's not really an eat-in place but they do have chili oil, chili flakes and Parmesan cheese and had enough seating.   Word of caution - It got pretty smoky in there so we smelled like BBQ afterwards.   It's in a weird spot with no foot traffic, so I'd probably stick to delivery if you are in their radius. They did not have pizza by the slice for sale.   On the pricey side but I'd definitely eat again. It was excellent."}
{"text":"I started following this place on Instagram and the pictures looked ah-maaazing! I decided to call and place an order today. After being put on hold on and off for about 5 minutes, I was told that I could not order anything custom because they were just too busy. I could also hear someone yelling in the background telling the lady taking my order not to take any custom orders. What is the point of having custom menu options when you cannot fulfill them? To be honest because of the poor customer service experience, I won't be eating from this place."}
{"text":"i saw the ad on yelp and went to Makers Pizza and tried the honey and caramalized onion pizza.It was gooey, thick smothered inn honey difficult to eat and hold and quite frankly a horrible combination of ingredients. One of the worst pizzas I have ever tried and I eat out a lot and Italian is one of my favourites.Definitely will not return and I wouldn't waste my time"}
{"text":"I don't often eat pizza but when I do its Maker! OMG mouth watering, unique ingredients, fast service. The only one little comment is that it isn't thin crust so if you like that well done pizza, stick it in the oven for a few and voila!"}
{"text":"OMG. Best pizza in Toronto. Super tasty, slightly greasy, and extremely delicious. Matheson comes up with unique pizza flavor combinations and I like them all! My favourites are Frank's best and Dr. Pepperoni!   Franks Best is topped with caramelized onion, mozzarella, goats cheese, parm, roasted garlic, honey and a sesame crust. Oh man... so so good. And so filling too. The crust isn't too thick but just right. The honey ads a touch of sweetness and you can't go wrong w a sesame crust!!   Dr. pepperoni is also another favourite of mine. It comes with double pepperoni, mozzarella, fior di latte, Parmesan and toasted fennel oil. The crispy pepperoni with drizzled fennel oil glistens under the light and oozes with fatty goodness with each bite.   This place is to dieeee forrrr. There's a reason why they're always busy with orders whenever I visit. If you're a pizza lover , you Gotta gotta stop by here. It's a little bit on the pricier side (smalls cost $15-23 , mediums cost $23-32, and larges cost $28-38), but so worth it. It's perfect if you go with a group of four to split two smalls or a large! Enjoy!! :)"}
{"text":"The food is good here. I had a bodega sandwich one day for lunch and thoroughly enjoyed it - so much so that I wanted it again the next day along with a pizza to split with my partner. Maker Pizza offers Ubereats as a delivery method and that's where is all fell apart for me. The food came 40 minutes later than promised, was cold and soggy. I WOULD eat here again but pickup only or see if they have their own delivery drivers."}
{"text":"The crust was soggy  plus my delivery guy didn't want to come up to my hotel room then tried to take 40$ for a 28$order and short changed me! Maybe it's better in the resto. Delivery was 4$ plus the 3$ tip I gave him for a soggy pizza with no napkins that took an hour to arrive with a surly delivery guy that tries to take your $."}
{"text":"Love the Dr. Pepperoni pizza. The Napoli Dynamite was pretty good also but the Dr. Pep blows everything else out of the water. Perfect crispiness and delicious meats."}
{"text":"I stopped by Maker Pizza for dinner on a Wednesday night.  About 20-person seating area at this location. It wasn't too busy, just as someone came looking for a seat, one cleared up.  Ordered the Apocalypse Cow, Porky's, an Dr. Pepperoni. All three were delicious. Pepperoni was quite oily, given all the, you know, pepperoni. I think Porky's was my fav of the three."}
{"text":"The pizza at Maker's is great... if you can get it. I try to order twice a week- usually at 10:30 on Thursday, Fridays, and/or Saturdays. The hours on yelp and google say they are open till midnight. They answer the phone... just to tell me that they are done making pizza. I wish I could order earlier, but some people in the hospitality industry actually have to work past 10:00 pm.  I have great respect if they are running out of their products because of high volume... but maybe start prepping more ... or change your hours. Clearly it's time for me to stop bugging them twice a week."}
{"text":"Not sure what happened here. We ordered a pizza on Saturday around 8:17am and we did not get the delivery until 9:56 pm. I am not sure if 1 hour 40 minutes is a normal wait time for so called the best pizza in town, but we definitely not impressed!!!  Okay, now I ate the pizza and I wanna say that yes the pizza is good but I still cannot wrap my head on why such a highly rated pizzeria cannot handle delivery more efficiently ??? Judging by lots of comments here, the speed of delivery and attitude of the staffs really raised my concerns on this place. Please do fix your logistics and customer service. You really don't need to be cocky to be a great pizzeria!"}
{"text":"I've had the Frank's Best (carmelized onion, goat cheese, etc) & the Siena Margherita and both were very good.  The margherita is the perfect simple but delicious pizza for those who don't like their slices loaded with greasy meats.  Delivery has been pretty fast but our last delivery person was a little rude, making us wait so he could confirm that he got an adequate tip.  Price point is high, but the large pizzas are huge and go a long way."}
{"text":"I love their Frank's best pizza. The saltiness of the goat cheese mixed with the sweetness of the honey and caramelized onions make this a delicious treat. It is a bit pricey but one small pizza lasts me for 2 meals so it's not too bad."}
{"text":"This is our favourite pizza joint in the city. Service is always fantastic and their pizza is out of this world. Delivery can take a while because they are always quite busy BUT you will not be disappointed at all. There is a reason why they are so busy...Mmmm!"}
{"text":"I'll start withe service because that's the lasting impression they made on me.  Can you spell S-L-O-W?   I walked in on a Friday night and order 2 smalls, which I was told would be 10-15 mins, to which I was totally surprised to be told it would be that quick.  So I sat down and played on my phone while I waited.  Every few minutes new people would come in to pick up their order, they would told theirs weren't ready yet and it'll be another 5 mins.  6 different customers came in after by the time I left and were all told the same thing about their order being another 5 mins, but really ended up 10+ mins.  2 of the customers were mad, of which 1 and screamed \"how can it NOT be ready by now?!?!\"     As for my order, after my 15 minutes were up I went up and was told it would be....you guessed it, another 5 minutes.  10 minutes later, I went up and was told it would be another 5 minutes.  At around the 34 minute mark, my order was ready for me.   If they knew pizza's would take so long to make, stop telling the customers a target time that could not be made!    On plus side, they at least seem to care about the quality of their product.  The pizza is pretty good, we had the Margherita  and Pepperroni.  Both were a tad on the salty side, particularly the Margherita, but not so much that it was not pleasant to eat.  I also witnessed their refusal to hand over their pizza to one of those food delivery service people because he didn't bring the hot food bag to store the pizza in."}
{"text":"Great pizza but easily the worst service of any food establishment I have been to. Rude is an understatement."}
{"text":"Maker Pizza is for sure our favourite pizza place. My fiancé and I love pizza and in comparison we love Abruzzo and Domino's pan pizza; but after we tried Maker Pizza it has now become my no. 1 choice. Maker Pizza's doe and crust are so good~* it is also the only pizza place that we are open to trying many of their flavours and options; and non disappointed us. However : )    I am not a meat person, and my favourite order with them is Tropical Thunder (no pineapples). It has a great spicy kick to it and I love the crust love the veggies on it! But my fiancé loves their plain cheese or pepperoni pizza~* We highly recommend ordering 5 minutes before you arrive and eat it fresh in the store! its sooooooo much better when hot and fresh!!!!"}
{"text":"Have been twice so far in a week to try out Maker after drooling over their Instagram.  Situated where Pusateri's flower shop used to be it's a bit hidden off the Main Street.  I came both times for lunch and dined in because its most fresh.  First time I tried Return of the MAC since it said it's a dine in.  It's essentially a Big Mac on a pizza and it did taste like it!  It wasn't super photogenic with all the lettuce on top but it tasted good.  It was a bit greasy though.  Next time we came in and we tried the mushroom one and the margarita.  The mushroom was our favourite, topped full of mushrooms and some lemon zest, the flavour was delicious.  The margarita was nice too and simple but my husband commented he likes Libretto's margarita better.  Friendly staff, seating is ok but high bar stools so not small kid friend.  A bit pricier than a normal pizza but they do taste great."}
{"text":"Truly a must try pizza place for any pizza lover in Toronto. Just up on Cameron St near Queen Street West, Maker Pizza really does deliver great tasting pizza.  I ordered the Dr. Pepperoni Medium size pizza. Of course, I go and try the instant classic. It's great size to share for two people. The pizza took around 5 minutes to make as I sat on the stool by the big middle table admiring the decor and the \"Seven Days with No Pizza makes one weak\" sign on the wall.   The pizza came hot and fresh right out of the oven and it was piping hot. The ingredients were fresh and especially the dough. For me, the dough is what makes a pizza great and Maker Pizza provides that. The dough flavour was amazing and texture of the pizza is great. Pepperoni and cheese is also delicious.   Overall, the ambiance and pizza that Maker Pizza makes definitely will make me comeback for more in the future."}
{"text":"Came here late on a Thursday night just before closing to pickup an order I placed around 9:45pm (they close at 10:30pm).  Was expecting tired, disappointed employees for having to rush an order before cleaning up again, but everyone was still upbeat, cheery and friendly!  I ordered the basic Dr. Pepperoni and the pepperoni was perfect. crisp outer ring, greasy pool and subtle chewyness.  The crust and cheese was what stood out to me, as the cheese wasn't overpowering but a perfect compliment to their really nice tomato sauce and the crust was just amazing. I normally fees my crust to my dogs a bit then throw out the rest...but let's just say this crust didnt survive in my compost..  I'm personally not a huge fan of fennel, but the toasted fennel oil actually tastes pretty nice on this pizza!  All-in-all they pass my test when it comes to pizza (which is: you better at least make a good pepperoni) so I'll be def coming here regularly for my pizza fixings. I make a mean margherita myself, so ordering pizza is rare for me."}
{"text":"I live just around the corner i have a mamas pizza in front of me i could walk to but when i get off work I'm exhausted and just want to order something quick. I had makers pizza on my instagram and the pizza looks yummy. I called three times over 4 months time and each time i was told there's a 2 hour wait. Fourth time i called i was told they ran out of dough. I decide to get off my lazy ass and go myself and it was DEFF not worth all the headache. Great customer service thanks ;)."}
{"text":"Boy this place had a lot of hype around it as a well revered writer on a food luver forum endorsed it. Sad to say this didn't live up to the hype. First things first the wait time here are as bad as they get. I am trying to think the only other place that had such a wait for pizza was a Chicago style (pie) place in Berkeley. I understood the wait there as the pie takes its time to bake. Ah well they seem to do a lot of take out business so if it takes that long to process an order it can be overlooked.  However the two pizzas we tried didn't live up to the expectations.  SIENA MARGHERITA: The sauce was not only watery, there was way too much of it. Mundane attempt at this simple ingredient pizza. FRANK'S BEST: I guess I was expecting honey in the dough on this one nope they drizzle it on the sides and top it off with sesame seeds (read you will need a whole bunch of paper towels just to eat through a single slice!) The tastes were kind of lost on this pizza as well. The cutlery they have here is pretty much useless to eat through this kind of pizza. I am leaning towards a 2.5 star rating but due to the wait times I don't think its worth more than a 2 star rating."}
{"text":"Perhaps the most unique pizza I have had. Goat cheese, caramalized onions, sesame seeds and drizzled with honey.  Close to my favourite neighbourhoods in the city.  Need to go back and try one of their sandwiches"}
{"text":"I saw several positive reviews for this place so I was waiting for the opportunity to come check it out.    I was definitely impressed by the pepperoni pizza!  Every bite had pepperoni.  The crust was delicious.  My husband and I ordered a large and it was more than enough for two hungry people!  In fact, the large would probably feed 3-4 people, comfortably.    The service was friendly and welcoming.  It wasn't busy on a Monday night so we didn't have to wait like other reviewers.  There's space if you want to eat on the premises which is convenient.    If you're having a pizza party, impress your guests with a few pies from this joint.  I'm already looking forward to my next visit!    I'm giving Maker Pizza 4 stars only because I want to try some other pizzas before awarding them a solid five.  :)"}
{"text":"How about actually delivering to the address that is within the delivery range? We are not even close to the border of it and I called in and they would not deliver to me. Ridiculous."}
{"text":"Amazing. Dr.Pepperoni and the Napoli Dynamite  Went in on a Monday evening and it was pretty empty inside the store but the delivery service was frequently in and out."}
{"text":"Their instagram account got to us. After weeks of seeing their posts, my boyfriend and I decided to stop by and grab a small pizza and some wings.  We ordered the Dr. Pepperoni pizza, well done, along with the wings. One of the gentlemen manning the pizza oven had a discussion with my bf regarding some of his favourite dessert places. I, on the other hand, quickly scooted off to secure two seats for us as it was starting to get busy. I appreciated the personable and very  friendly pizzaiolo.   Yes, as with a lot of GOOD food, we had to wait for our pizza and wings. If you go to any busy restaurant, you're going to have to wait for your food too. So chill out.  Anyhow, we got the wings first and the smell itself was bloody amazing. We stared at them while salivating, afraid of diving in too quickly and incinerating our mouths off. The pizza came shortly thereafter.  The wings: simply delicious. They're spicy, but it's not that 'flaming mouth' kind of spice that destroys your taste buds for 4 hours. The wings were very flavourful and addicting. We took the wings out of the disposable container that they came in and put them on a plate in an attempt to get them to cool off more quickly. We were soon dipping our wings back into that container to get more of that delectable buffalo sauce.  The pizza: it was like nothing I've ever had before. The pepperoni tasted soooo good. And the cheese...I felt like I was in a pizza commercial as I ate. The 'cheese pull' is outstanding. The fennel oil's flavour is next level. It's almost stupid how good it was. With the wings, a small pizza was sufficient for myself and my boyfriend...though I wouldn't have been mad if there was an extra slice or two. The small pizza was cut into four slices. If you get a small pizza, I recommend asking them to cut it into 6 slices. The slices ended up being kinda big since it was only cut into 4.  As my boyfriend and I ate, we kept looking at each other and shaking our heads like \"it's so ignorant how good this pizza is.\"  Knowing what I know, I would definitely expect to wait a while if I ordered this pizza for home delivery, because the restaurant is busy and the food is amazing.   I saw a couple of reviews stating that the pizza was too greasy. Yes, it's loaded with scrumptious pepperoni and has fennel oil, both of which were exquisite. If I came here to get a tofu kale Wheatgrass salad, then yes, I might be turned off by the \"oiliness\". Relax-you'll live.  To summarize, I've run out of adjectives to describe how much we loved everything that we ate. We will without question be back here, and we will gladly wait a few extra minutes for an epic flavour experience."}
{"text":"Oh let us rejoice! I am so happy this place opened literally across the street. I can jaywalk my way to happiness. My friend has been ranting and raving about their first location as the best pizza in Toronto, so I had to try it for myself. I came in initially on Thursday evening but they were all sold out! I am off most Fridays and decided to come for lunch. I called ahead and a really nice man took my order. He told me it would be ready in 20, and it sure was! Parking can be pretty hectic here as they are located beside Pusateri's, but you could most likely get something in the back. It was pretty busy inside, but seats available if you wanted to dine in. It has this beautiful industrial look, and everything was immaculate. I decided to eat half my pizza inside, as hot pizza is really the best. It was beautiful and greasy, just the way I like it. I ordered the Dr. Pepperoni with pickled jalapeños and extra cheese. I added some chili flakes on top for that extra kick. It was perfect! The crust wasn't too thick, the cheese was gooey, and the pepperoni was delicious. A small is a good size for one person if you want some leftovers for yourself, or even two people if you have a smaller appetite.  Someone was constantly coming around to clean up and check ok the patrons. So nice!  Also, they don't sell slices, so you will need to choose a size. I heated my leftovers for dinner, and still perfect! Next time I'd like to try a different crust and maybe a cheese pizza with some ricotta and mascarpone cheese. Great staff, service, and taste!"}
{"text":"Matty Matheson is a genius, and this pizza place is just out of this world good, I had been wanting to try this pizza for months, but knowing the long wait times in the store (45min.), and the 1 hour and 45 minute to 2 hour wait times for delivery made the decision to try this highly hyped pizza very difficult. Well I finally took the plunge, taking the wait time into consideration i placed my order as early as possible, 2 hours before i would want dinner. That way the delivery would hopefully line up perfectly with when i wanted dinner. They showed up in just under 2hrs. , exactly when i was hoping it would arrive. The delivery person was really nice, i told him this was my first Maker pizza and he gushed about how good it was. So i pretty much ran into my kitchen like a kid, cracked the box open and wow!!! I was expecting the clouds to part and a beam of light from the heavens to shine down on the box like a spotlight, while hearing ever so slightly, angels humming in unison, the pizza well it was gorgeous.   The crust was a perfect depth, not too doughy, not too fluffy. it was thin, crispy and damn delicious. The sauce was REALLY good, light and tasty, not too acidic, definitely fresh made as i'm sure Mr. Matheson would have it no other way. The Pizza I ordered was the Dr. Pepperoni, which was covered beautifully in really very delicious pepperoni that looked like it was sliced in store. what really tied it all together was the amazing cheese blend that they use which is a blend of good Parmesan, Mozzerella and Fior Di Latte which is a tangier version of Mozzarella made with cows milk. And just for some zing and contrast, they threw on some very fresh tatsting toasted fennel seed oil with toasted fennel seeds in it (or maybe they threw it on after). The pizza was freakin dynamite!! i ate as much as i could, and still wanted to taste more, but sadly i had no room left. These pizzas are bigger than usual, actually their medium is 16\" which is pretty much a large at Domino's or really at any pizza conglomerate.    If you are a calorie counter you may want to avoid this place because there is absolutely no regard for people like you when they create these pizza's at Maker. It's all about Flavour and quality here, I honestly don't think i could order from anywhere else again. especially knowing this pizza exists and is available for delivery. It may take a while, but it arrives hot and fresh. Their drivers work their asses off so be nice and tip well if you do end up ordering from here.   My 2 Suggestion's to the shop:  - update your online menu, and include the min. delivery amount (it's not on your site or menu)  - hire more drivers!! :)"}
{"text":"Meh. Not with the 50$ for a medium Dr. Pepperoni and beet salad.  Really doughy crust and toppings like an inch and a half from the edge. I enjoyed the fennel flavour but the seeds should have been more evenly spread across the za.   All dough no show!  I had high hopes for this joint but it pales in comparison to other pizza joints.  I'll stick to my classic Albany pizza in Parkdale.   And an hour for delivery!  This place is all about the hype. Spend your money somewhere else on good pizza!"}
{"text":"Pizza is amazing.... IF you can get it.   The last 3 times I've called to order a pizza they told me they ran out of dough!?! How does a pizza place run out of dough... by 8pm?!?  Before those order attempts, I successfully placed an order for a pizza but my pizza arrived 3 hours after placing my order and when I called Maker- they blamed me for the tardiness of the delivery.   I would recommend their pizza as the flavor is awesome(I give credit where it's due)but their customer service is poor and needs to be improved. Perhaps if more customers voice this, they will do something about it."}
{"text":"This pizza is the truth. I had the Frank's Best and the only disappointment was that my fingers didn't get sticky like the review in BlogTO. Boyfriend got Tropic Thunder and tbh it was so hot that I cried a bit and he had to eat a banana. It's not a bad thing, but as he said, \"That's for someone who REALLY likes hot stuff, not a guy who just wants to order a pizza.\" So one star deducted because we are weak, not Maker. Still ordering it tomorrow for the football game."}
{"text":"Crazy expensive for mediocre results at best. $100 for pizza, wings, and a salad. Salad came with no dressing whatsoever and they did nothing to help compensate or solve the problem, claimed that there certainly is dressing on the salad although there's clearly not. Will not be dining again."}
{"text":"tried to order delivery but was placed on hold with no reply to my attempt to ask a quick question re delivery  no thanks  i can only imagine the lack of attention they pay to the food if that's how a new customer is treated"}
{"text":"Delicious pizza, excellent service!!! We arrived to the pizzeria 3 minutes before closing time, never the less we had our pizzas prepared . Awesome quality!!!"}
{"text":"We're back on the HUNT for Toronto's BEST! Stop #5 of the pizza pie tour: Maker Pizza  This week celebrity chef Matty Matheson makes an appearance with his somewhat new pizza spot. During our last hunt we visited his burger joint. It missed the mark by an unfortunate amount, so though I would have liked to walk into Maker objectively, I was a little salty. In similar fashion to the burger joint, Maker is a long & thin restaurant, but this time with enough stool seating for you to bring a small group. They keep the decor nice and simplistic, with white tables, white walls, black trim, and a pizza box shelf. Keeping it hip on a dime. I like it!  Then came the pizzas. Maker gives you a good amount of variety, half the pies being red, half white. I was up for something different, so I opted for the Little Deuce Coup. This is a red pizza that sports roasted chicken, roasted red pepper, red onion, ricotta, basil, fior dilatte, mozzarella, olive oil, parmesan, and tomato sauce. So did Matty do me right this time...? Thank baby Jesus, yes! Though this wasn't a show stopping pizza, it was a refreshing surprise, highlighted by the perfect amount of lemon zest to give it some tang, but not make it a yellow lollipop. The red onions and roasted pepper were a good combo with the thankfully not dry roasted chicken, and most of all high five to whoever decided to put dollops of ricotta on the pie. I know that that they chose dollops for artistic purposes, but the pie is begging for so much more!!!  At this point, I was plenty happy with myself, but then came the Tropic Thunder. I like tend to reserve 5 star reviews for dishes that make me speechless, but the flavour journey that this beauty took me on requires recognition. This red pizza comes stacked with inspired ingredients: jalapeño, red onion, fior di latte, mozzarella, parmesan, olive oil, tomato sauce, roasted garlic, sesame crust, red chilies, Thai Basil salsa verde, house cumin seed oil, and chili infused pineapple. First off, pineapple calls back to my childhood love for pizza, but then even before you hit it you bite your way through what appears to be purposefully varying \"flavour zones\". Sure you'll get good old fashion tomato sauce & mozzarella, but then take a walk to that spicy kick of the jalapeño, dabble with whatever perfect choice of sausage they have, get slapped in the face by an Indian inspired curry flavour, and then F around with that sesame seed crust! I have to say though, the sesame seed crust came out of nowhere. In no way am I mad at it, plus it was pretty good, but it was just random for me. This pizza was stupid good because of its complexity and how the distinct flavours backed each other up.  Though actually finding Maker Pizza is a bit of a challenge, get your life right and put in the effort to get there! Matty's got a hit with this one, and I'd be happy to go back to try the rest of the menu!"}
{"text":"Two words: GREAT PIZZA. And its best when you eat at their location. If you order for delivery the pizzas are still good but not as good as fresh from the oven since the dough will be a bit softer of course.  This pizza can easily compete with the pizza chains out there."}
{"text":"I had high expectations for this pizza, and found myself disappointed. I didn't think this was exceptional pizza, just mediocre. The crust was excessively salty, and the whole thing was okay or meh  I plan to try a new place next time for pizza, but I would consider ordering from here again."}
{"text":"The best pizza in the city hands down! Just wish I went here more often. My go to is Dr. Pepperoni."}
{"text":"Had The Return of the Mac for lunch today and WOW! This is like the best cheeseburger every. A little bit of a luxury at 24$ but you shouldn't eat these all the time anyway. Brilliant."}
{"text":"Vegetarian review  Definitely one of the best pizza places in Toronto!   We usually order the Tropic Thunder minus pineapples. Delicious!   Just wish they had quicker delivery."}
{"text":"A literal hidden gem in the city. LOVE their pizza.  Be sure to check Maker's social media feeds for off-the-menu specials. The Real Pep God is one of those secret recipes. It's simple but delicious - and the sesame seed crust puts it over the top.  The last 2 times I ordered they quoted me 30-50 minute wait... and then both times my pizza was ready in 15 minutes."}
{"text":"Let's just say I have dreams about this place... amazing dough, fresh toppings and quirky pairings if you check their instagram (tip: found something cool they posted? Show the cashier the picture and have it made fresh) if you're not afraid to try a caramelized crust be prepared to be severely addicted"}
{"text":"I have met my Maker here. The pizza here is fantastic, I shared the Red & White Pesto Pizza and Cool Hand Zucch, and they were so flavourful and delicious. I was full, and yet could not stop eating. The Red & White Pesto pizza was a nice mix of saucy and spicy, and the Cool Hand Zucch was really..cool. The lemon on it is a really nice touch and brings all the flavours together nicely. I also really liked the crust, it was sturdy enough to keep up with the toppings.  The staff here are also super nice and helpful if you ask for suggestions/recommendations :)"}
{"text":"Top notch pies. Apocalypse Cow is my go-to. It's clear they're passionate about their product and do not cut corners. You'll pay more, but I think the premium is worth it here."}
{"text":"Holy mother of god! This was the most delicious pizza I have ingested.  The crust was soft and doughy but crisp at the same time!  My partner and I ordered a large Tropic Thunder. So, so, so delicious. We chomped down on about three slices each, with three left over for the next day. I have died and gone to pizza heaven!   We were a bit weary about all the reviews about bad service. But the service was just fine for us! The guy on the phone was straight forward, yet polite. We got the pizza in under an hour - average wait time. We were surprised that the delivery guy was here early! My partner met the delivery guy and said that he was nice as well. So I dunno, it might have been a hit or miss but we got really good service.  Nonetheless, can't wait til I'm back in Toronto to order this amazing pizza again!"}
{"text":"My partner and I order the tropical thunder last (Sunday) night (as the reviews suggested) for delivery and it was SOOOO. DAMN. DELICIOUS. While we were gobbling down our first slicewe were already discussing the next pie we'd like to try! We ordered a large and could barely finish half the pizza but the leftovers today were also delish!   We were warned that it would be an 1 hr and 15 minutes for delivery but they showed up in less than 45 minutes! It is kind of annoying that it's cash only for delivery but luckily my bank is close by!"}
{"text":"LOVE THE PIZZA here, i have ate a lot of pizza and this is The best pizza in the whole area! worth the wait, the staff are awesome, place is awesome. love the chewy crust and the good ingredients they use."}
{"text":"I usually do not like pizza but the pizza I got from here was sooooooo bomb.   The shop itself is hidden, you have to take a small back road to get to it but you'll see a black wall with the store's name which will guide you to heaven.   My friend ordered a medium Mac Attack (Big Mac pizza) and I was extremely excited because I love Big Macs. The pizza itself was a little pricey and the wait for it was about 10-15 for them to make it fresh. But it was worth it. When we opened the box the lovely smell of a Big Mac overcame us and all we saw was this lettuce covered pizza. The taste of it closely resembles how a Big Mac tastes and I was a little scared of the onions all over thinking it'd be harsh but since they're cut so thin you didn't get the strong taste of onion lingering in your mouth.   In my picture there's two types of pizza but I didn't try my friends because I was so caught up in mine.   Will definitely be coming back with more friends!"}
{"text":"My fiancé and I are from Buffalo, NY and we are diehard pizza lovers. We were here for an overnight birthday celebration and knew we had to try this place. We've seen Matty Matheson post so many pictures, it looked way to good not to stop in. We probably had the best turkey sandwich we have ever eaten in our 28 years of life!!! We also got a small Napoli Dynamite pizza. The food was amazing!  The next time we are in Canada we will be making sure to come back."}
{"text":"Loved their pizza!! Went to their new location in Avenue road and it was amazing even though its a-bit expensive but it's delicious. Already want to go again and get that sooo mushroom!!"}
{"text":"My new favourite pizza spot. Liked it better than Libretto and Qmp. Saw Chef Matty Matheson there, he said he was helping out as consulting chef. Really cool dude took the time to talk to people. Pizza was amazing, not \"well done\" like other places with burnt parts. If your in Chinatown worth it to go by. The area has so many great spots to eat, this will def be a good addition."}
{"text":"The wait to get a pizza at this place is ridiculous. I called for a pick-up order and was told that it was a 2 hour wait. Once I got there it was another 15 minutes before my order was ready. The prices are insane. A small personal size mushroom pizza cost $23. It was good but nothing exceptional. You can easily get the same quality pizza without the horrendous wait and inflated prices at many other pizza places."}
{"text":"I had such high hopes for Maker and for real, they delivered (pun intended).   I know that Toronto has been napoli pizza crazy for years. Pizza Libretto!  Queen Margherita!  But it was never for me. It gets cold too fast. There is no grease. It's floopy. It is sad, flat pizza.   Enter Maker Pizza.   First, the staff were all very nice. The place it very small, which is unfortunate, since the pizza is too good to carry out if you don't actually live nearby.   We ordered a Dr. Pepperoni, as you do, since it's a classic and generally reliable. It was heaven. A light but fluffy crust (not thick, just fluffy) and the pepperoni were properly charred and filled with shots of pizza grease (as they should be). A thick layer of cheese and a surprise: a drizzle of fennel oil?  Genius.   I am an instant fan. 5 our of 5!"}
{"text":"They were not busy when I went so was able to get my pie in 10min. Ordered a pepperoni and holy cow the pizza was salty and oily. Crust did not have enough char for my taste, was a bit bland and had little chew - it had a fluffy soft texture that reminded me of Dominoes.   I don't know what the fuss is all about, but thats Toronto, everything is always overhyped by people with no taste. A great NY pizza should strike a fine balance between crust, sauce and cheese.  This pizza was totally out of balance. The oil and saltiness totally overwhelmed everything else on the pie.  Also, I wish they put more red sauce on it, I could barely taste it so I cannot comment on it.  The saltiness could be specific to the type of pepperoni they used, so I may revise ratings the next time I am there and order a different pie.  The high ratings this place has been getting lately must be fake news...Makers gets a 2.5 stars."}
{"text":"We tried two pizzas, a white and red.  Both were really good and definitely fresh.  I heard really good things about the chicken wings so we tried them as well.  I tend to be very picky when it comes to wings.  The buffalo sauce was really good, spicy and buttery.  The wings were quite big (the size doesn't matter to me), but on the dry side.  If it wasn't for the pizzas being exceptional I would have rated Maker a 3.  However, I will be back to try the wings and pizza again."}
{"text":"just fantastic pizza! very hard pie to beat"}
{"text":"4/5  Hate to admit but I like their pizza. Really hate their size, price tag, shitty printed menu, not so welcoming cashier guy and slow delivery service, but I just love it's perfectly cooked crunch dough with fresh ingredients. These guys are not the best value pizza place in Toronto but they do serve better pizzas than pizza libretto or many other \"famous\" pizzerias around dt Toronto.  If there are more than three ppl to feed, make site to order the largest size."}
{"text":"My friend recommended Maker Pizza so I decided to give it a try. It's worth the hype! I ordered a small Tropic Thunder and small Dr Pepperoni with sesame crust. The sesame crust is EVERYTHING! Makes the crust taste like a chewy Montreal bagel, so good! Of the pizzas I tried the Dr Pepperoni was my favourite, the fennel oil adds a great flavour almost lending an Italian sausage taste. Will definitely return and try more"}
{"text":"I judge a pizza place based on their Margherita pizza. Maker's was OK. The dough is very chewy, which can be nice, but a bit overbearing. The mozzarella seemed to be a pipped soft cheese...? I prefer fresh, virgin mozzarella. The sauce was not memorable. Maybe the creative pizzas are better, but if you can't master a Margherita I remain skeptical.   Side note: they don't sell slices, which was a bit disappointing. They also \"ran out\" of small pizzas at 9 PM on a Friday night. A bit strange for a place that remains open till midnight."}
{"text":"We love Maker Pizza, but they've let us down time and time again now. Tonight was by far the last straw therefore I've decided to write a review.   Tonight, a Friday night, at approx. 8:45 PM we called Maker for a delivery. The employee on the phone told me they were \"out of dough\". I asked if they would be making more and he replied with, \"The dough is made three days in advance and is only available while supplies last\". I told him that was disappointed but accepted it and our conversation ended.  My boyfriend and I couldn't believe this, it was a Friday night at 8:45 and they are open until 12:00 AM. How could they still even be answering the phone if they were completely sold out of the dough? We had our suspicions as we had a previous bad experience where we were told they were they only had small pizzas and when we picked up our order the cooks were seen pulling large pizzas out of the oven. We confronted them and they weren't sure what to say, coming up with once again a false excuse.   Because of this, we were interested to confirm if they really were out of dough. We waited about some time and called back at 10:15 PM from a different phone number. We asked once again for an order of delivery from the EXACT SAME EMPLOYEE, he said, \"Yeah sure, one second\". Once we returned to the phone he accepted our order, however they only has small pizzas...   It is obvious that Maker uses ridiculous excuses to control their incoming orders on busy nights... I am not sure what the reason is behind the small pizza excuse, as maybe it is regarding time or maybe it is about making more money. It's really a shame that such an amazing pizza spot would rather resort to silly excuses, turning away loyal customers instead of being honest and explaining that they have too many orders at the current time. If they had said to us that they could fulfill our order but it would take X amount of time, we would be happy to wait or call back at a less busier time. Instead they have frustrated us and shown they do not value our loyalty or business, this is really too bad as it was our current favourite spot."}
{"text":"Toronto held many unknowns and didn't fail to impress on most of them. I would say that I could have Maker just about 7 days a week. Loved the kind and helpful staff (they charged my cell for me while I ate their delicious pie) and the pizza was fantastic. I admit that I'd overdone food a bit this day, but I still managed to scarf down 4 slices. The plain pie was a great mix of just enough dough, sauce and cheese. A nice chew, crisp crust, great blend of flavors and a subtle sauce. Would visit the pizza Makers there again anytime. Thanks again for a great pre-game meal, saved me from having a dog and a beer at Rogers Centre!"}
{"text":"Really appreciate the design, exterior appearance.  Great logo and pizza box design.  $14.70 for a small pepperoni pizza is Expensive. Little greasy as well. At these prices, most likely a one time visit."}
{"text":"Been waiting patiently...  Truly the best pizza ever! The way good pizza should be, as we have become so used to chain pizza places and mediocre product. Nice change from Libretto's thin Napoli style pizza too. Been there 3x and have always tried something different. Always amazing! It's like they know how to combine the perfect ingredients and amounts... flavours all work harmoniously together, one doesn't over power the other. Love the white pizzas..."}
{"text":"Excellent pizza- they have a good thing going here! The ingredients are good quality and the flavors delicious!   Even with a team of staff forming an assembly line people were waiting but we called ahead to order and it was ready on arrival! Will definitely come back again to try a different pie :)"}
{"text":"Amazing pizza, but could be better prices.   Have heard amazing things about this place from friends all over Toronto, especially at University of Toronto, which is nearby so had to give it a try.  Real Pep God ($15 for small) Super saucey and super flavourful. All red sauce and meaty, great for a cold winter night.  So Mushroom ($23 for a small) All the mushrooms, creaminess and garlic you want on a pizza. A hot make out session might not be the best after this za, but you'll be satisfied with this toasty pie in your mouth.  Really, REALLY good pizza and the wait for 2 was roughly 15 mins. However, $23 for a small size was a bit of a stretch for me.  Overall, good to try. I would come one more time to try Return of the Mac ($24 for small) which is a big Mac om a pizza (oh yeah)."}
{"text":"The guy that worked at the front, he is a white guy in glasses is extremely rude and condescending. You can't use as many toppings as you would like, that's a lie. \"Recommended 3 toppings\" isn't recommended you have to pay extra."}
{"text":"Pizza Pizza Pizza. Problems come and go but Pizza is forever and Maker Pizza will forever be the creator of my favourite pepperoni pizza.   Great location in downtown Toronto, trendy and lofty area to eat and they also deliver in case you are as lazy as I am.   I always get the Dr. Pepperoni which is double pepperoni, mozzarella, fior di latte, parmesan, and toasted fennel oil. Love the combination of flavors, love the saltiness from the pepperoni and it's always a great size. The pizza is a bit on the pricey side but in my opinion, totally worth it.   I have tried the Frank's Best which is caramelized onions, goat cheese, roasted garlic, seat salt honey on a sesame crust. My friends thought it was good but I wasn't a fan.   Go for the Dr. Pepperoni, it really does cure your hunger.   Keep Eating,   Angela"}
{"text":"I got delivery from here the night of my move because it was late and it was the only place open. Totally hooked - I've never had pizza like this in Toronto, nevermind delivery. We ordered two pies - Apocalypse Cow and Frank's Best - and each was cut into four slices which was perfect for two hungry guys who had been moving their worldly possessions all day. The sesame crust is brilliant. Can't wait to try the others."}
{"text":"Maker Pizza is a nice neighborhood spot when you want to elevate your pizza game. The interior is minimalist, yet comfortable, set up with large communal tables. I like eating warm pizza straight from the oven and have been here twice to dine in. Depending on the number of orders, you might have to wait a while for your pizza, but it is worth it. The first is a slice of piping hot goodness. And if you can't finish the pie, rest assure it is still good the next day."}
{"text":"I was recommended to check out this place after complaining to a friend about not being able to find my ideal slice. And this place delivered!  We had a two pizzas, one was the Napoli Dynamite and the other was the So Mushroom. The So Mushroom was an absolute hit with everyone. It was filled with mushrooms, the other flavours created a nice balance and white sauce was the perfect base. The Napoli Dynamite was good also, but more typical to the slices you would find elsewhere. So glad to find this place to get my pizza fix!  They make each pizza fresh, so if you don't want to wait around call in your order ahead of time."}
{"text":"This is just for the wait for the pizza. Called to pick up. Said it would be ready in 30mins. Not happening. Should have went to the other location today. 45 mins later and no small pizza ready for me yet.  I'm hoping taste is the same as my orders on Cameron St.  Fighting the lesser of two evils. I have parking at this location but it's still new, busy, but looks like they are still in training mode.   Don't think they will have a good gauge on order time for a while."}
{"text":"Fabulous pizza!! One of the owners gave us a free sandwich for the wait .. everyone there was so friendly we definitely felt welcome! The food was beyond delicious, I'm a sucker for a good quality gourmet pizza! Consider us completely satisfied! We'll be back!"}
{"text":"I was so excited to try this place, I was visiting Toronto from Vancouver. I was really disheartened when the guy working at the front cashier was so incredibly rude and belittling. I left without trying any pizza"}
{"text":"I had this once at my sister's and I haven't been able to get it out of my head since! The Tropic Thunder was outstanding!"}
{"text":"Definitely amazing pizza! 6 stars if it were possible. Haha Pizza is made and cooked in front of you and made to perfection or its tossed and made again. Definitely will come back alot!"}
{"text":"Definitely one of the better pizzas I've had. I came to find out about this place due to me actually getting lost in downtown. Regardless, I was hungry so I decided to park up and try the place.   I ordered a regular cheese pizza as I wasn't feeling too adventurous with toppings that day, the pizza itself did take some time to make, but I was expecting this as they did look busy. The pizza was quite great, although it was a little greasy; I found it to be enjoyable. One thing I'd say is that this style of pizza making slightly differs from the product you'd find at Pizza Pizza or any other pizza joint you might visit. I'd definitely give this place a try if you're in the area and looking for something different to try."}
{"text":"I've heard of this place from hearing about it through BlogTO and was told through a friend how it's her go to for thin crust pizza. My bf and I were in the area one day and we decided to give the place a try. We weren't feeling for anything too heavy and filling so we opted for one of the vegetarian pizzas. We got the Cool Hand Zucch - WOW! Who knew that a vegetarian pizza could leave us both in awe of it's awesomeness! It was probably the cheese combination that made this pizza over the top delicious - foir de latte, mozzarella, riccota cream - mmmmm  the chili oil gave it a good kick as well and the mint balanced it well! Can't wait to head back and try the other pizzas they have to offer!"}
{"text":"Probably my favourite pie in the city. Their wings are fantastic too.  I'd give them 5 stars but they ALWAYS forget the sesame honey crust.   Doesn't matter if I enter a note on ubereats or remind them over the phone or in person.   Drives me CRAZY cuz that's what really puts their pizza over the top."}
{"text":"One of the best pizzas in the city!   Never have I been to somewhere with such unique pizza flavours - love it!! It's definitely on the pricier side for pizza but you need to treat yourself once in a while right   I tried the Big Mac pizza (dine-in only) and it's super good! Tip: add chilli flakes to make it even better. You definitely need some water with this one too since it's a bit creamy. It really does taste like a Big Mac! If thick crust and Big Mac is your thing, you will LOVE this. It's not the prettiest thing in the world but the quality ingredients, and perfectly baked crust will leave you with no regrets.   It's not the best pizza I've had EVER but it's pretty damn good. 100% going to come back and bring friends.   PS: they have a free parking lot!!"}
{"text":"Best pizza in town!!! Definitely a must try for pizza lovers. Tucked away in a side street, its truly a hidden gem"}
{"text":"i love this place.  Their estimate of when your order will be ready is always way off (for me doing pick at least) but their pizzas are so.  I love the addition of the sesame or parmesean crust and the fennel oil.  We have found that we love the pepperoni and tropic thunder so we have just started sticking to those, but i love them so much.  I think of them daily.  I wish i didn't live outside their delivery zone."}
{"text":"Order this pizza at your next party. Everyone will be happy. One of my favourite pizza places in the city!!"}
{"text":"This has got to be some of the best pizza in the city! I wouldn't really advise dining in though, as seating is limited and it can get pretty busy with the amount of delivery drivers coming in and out. If I lived in the area, I would be ordered takeout/delivery often. On our first visit, the owner was even as nice to give us a credit for a future order, as he felt that one of our pizzas wasn't up to his standards (it was the last small dough of the night). We didn't think there was anything wrong with the pizza, but were amazed with the level of perfection they strive for!"}
{"text":"Anyone who is a pizza lover needs to come to Maker Pizza.   After I heard that Matty Matheson was involved in the creation of these pizzas, I knew I had a make a visit to Maker Pizza. We had the Porkys, it was the pizza that spoke to us after reading the menu three times to make sure it was the one we wanted! It is on the pricier side but it was worth it! The was the right amount of cheese and topping on the pizza. The crust was spot on and the dough is to die for! The only downside in my opinion, was the pork shoulder wasn't that remarkable.   Both of us shared a small pizza which is good for two people, who are not too too hungry. We were only suppose to eat one slice each to head out to meet a friend but the pizza was too good! We ended up finishing the pizza making our poor friend wait for us!  You need to RUN, not walk to Maker pizza! GO!"}
{"text":"Purely based on delivery. This place gets BUSY! The person answering the phone barely has time to take the order but still manages to do so professionally! Time estimates for the delivery is accurate!  As for the pizza, I tend to create my own master pieces! Love the wide topping variety as I was getting bored with most places. Honey mushrooms? Chilli infused pineapple? Pork Sugo? All sound great together. One I really liked to top it all off was the sesame seed crust option! More towards a higher end pricing but worth every penny. 5/5, will be ordering weekly until I get sick of everything."}
{"text":"I had a late lunch today at Maker Pizza.    I love love love pizza and Maker Pizza been on my radar for a while to check it out.  Plus Jeremy Taggart had listed it as a place to check out in \"Toronto in Canadianity: Tales from the True North Strong and Freezing\".  I ordered a Dr. Pepperoni pizza (with no parm).  It was a really good pizza.  It was hot hot hot when it came out of the oven and was served in a box.  It was cheesy and there was lots of pepperoni.  I liked the crust ... it was soft and chewy.  It was greasy and messy as the pizza started to cool down, which I didn't mind ... I just used a lot of napkins.  I'll be back!"}
{"text":"I wanted a pizza with crispy pepperoni. So we immediately ordered a medium (for two people it was a big size).  I got my crispy pepperoni, and the crust was delicious! Probably the best crust I've tasted. The pizza itself was a bit on the salty side. Something my friend loved. The staff are friendly and the atmosphere comfy and modern. This place is a must check out in Toronto!"}
{"text":"An interesting, flavourful, and unique take on pizza! With options like the Big Mac pizza, it's definitely far from authentic, but the dough is slightly salty with a good chew, the toppings are generous, and the flavours are....flavourful! Plus their thick and crispy pepperoni reminds me of Prince St. in NYC."}
{"text":"Little upset that when we got there, there were no gluten free options. We made sure to check on yelp for the gluten free options for pizza. Unfortunate. I suppose they say it's gluten free because they have a \"less gluten\" crust option. Which does no good for people who have celiac."}
{"text":"So I go to order over the phone and the guy tells me my apartment (Avenue Road and Dupont) is not within their delivery area. I ask him if he's sure because, according to THEIR VERY OWN MAP on their website, my place is well within their range. He \"double-checks\" and says, no it's more than 5.5 km which is out of their range. Funny, as Google maps puts it at exactly 4 km by car. If these characters can't comprehend their own website/rules, I'm not sure if I want to eat what they're making! I was eager to give them my money, but they don't seem too eager to take it. He WAS pretty quick to tell me how it would be at least an hour-and-a-half for the delivery and they only take cash though. Great service, guys!"}
{"text":"Was very pleasantly surprised with Maker. A very unique crust that touches of both the traditional crispness and chew of a wood oven pie, and the more North American style hefty crust. The toppings are fresh and tasty, and pizzas range from classic Italian combinations to contemporary hits. We opted for the Cremini mushroom pizza and a Neapolitan pie, and I can't wait to come back and try some others."}
{"text":"Went in to try their eggplant parm sandwich. It's very tasty (way better than the undercooked mess from San Francesco Foods; less fancy and finely-crafted than Indie Alehouse's) and I would come back weekly to get it, if only it didn't come to $20 for the sandwich and a canned soda. Especially since I left still hungry.  I can tell they use good ingredients and put care into each element of it. Can't stomach the price, especially given its utilitarian factory vibe (which otherwise suits it!). Will swing back to try the pizza..."}
{"text":"The food is amazing. Pizza is always great, subs are great, salads are fresh, wings are amazing.   The service is atrocious. Ordered from here probably 20 times or so since they opened and would say 15 of those times we had a bad experience with the service. Only kept ordering because the food is so amazing but had the last straw this past week.   The staff consistently are rude and pretentious on the phone - several times we ordered delivery and gave credit card numbers over the phone - last week a guy told us we couldn't do that and we explained we had in the past and he said and \"if we've REALLY ordered from here so many times we should already know that\". I understand if they changed their policy or if he just didn't know but it was super rude and he started yelling over me on the phone. I would've kept my order and went and got cash had he not been so rude.   Several times I've had my whole pizza squished in the box from careless delivery - I know accidents happen but this happened probably 5 times.   I get that maker is super busy all he time. That's not excuse for rude service. They've lost my business."}
{"text":"The cool hand zuch here is to die for. For a vegetarian pizza, this is hands down one of the best pizzas (both veggie and non veggie) I've ever tried. Add a couple chilli flakes and you won't be disappointed.  Maker is generally a delivery kind of place but they do have some seating there for a casual dining experience. I recommend going in person to enjoy the pizza right out of the oven.  A small is enough to share between two people for under $20 bucks."}
{"text":"I have mixed feelings about this place.   We ordered it at work. It was delicious. Some of the tastiest pizza I've had.   Ordering delivery on a Saturday night was the opposite experience.   I ordered the tropical one with pineapple on it. I was told it would take 1.5 hours to get the pizza and that they only had small pies left. That seemed kind of excessive but I wanted it so I went with it. I had to order more things to bring up the delivery minimum to $30. They charge $4 delivery.   The pizza took 2.5 hours to get to me. That seems pretty unreasonable. It was kind of soggy. The wings were ok; your standard buffalo wings. Nothing memorable.   Basically $40 and 2.5 hours of time to get a mediocre small size pizza and mediocre wings.   I think I ordered the wrong thing, and delivery was definitely a complete failure. I would pick up in-store next time if I have a craving but the last experience didn't leave me with a craving. I'll have to get one of the other pizzas I know are good, and order early enough so they have the size I'm looking for. I know they have some pizzas that taste great so I'll give them another try, but the delivery experience was really quite awful.  The issue here is probably that they aren't experienced or equipped enough to handle their popularity on weekends."}
{"text":"ahhh why is this place so gooooddd theyre crust is unlike any other pizza ive had. We had the tropic thunder pizza and it was so goood. i would have ordered another one cuz i split the small with someone but we wanted to try another place so i didnt. i took off one star because i didnt like the seating it wasnt comfortable   im still gonna be back thoooooo"}
{"text":"Tldr: Delicious, fresh and made-to-order pizza! On the pricier end but worth it! Would 100% recommend!  As a pizza enthusiast, I fell in love with this place. Situated in what felt like no man's land, it was worth the trip to one of the most hipstery pizza joints in Toronto. Maker pizza serves freshly made pizza, and you can see the staff intricately create magic in the form of a pie right before your eyes.   My friend and I visited on a late Sunday afternoon, and this place was still poppin'. There was no menu posted, but rather printed on a pamphlet that you can take home, so you can decide on what pizza you will get the next time you visit (Cause oh you'll be back for sure). On their menu they have a wide range of uniquely crafted pizzas that you can order, and ofc you can build your own. Everything sounded pretty legit, but we had to make a choice so we ended up with the Napoli Dynamite.   Oh boy, this pie was out of this world. With every bite, you could taste the freshness of the ingredients and the passion that inspired the creators who designed this pizza. The flavours just blended so perfectly (with nothing overpowering each other) as the crust, cheese, and toppings performed a symphony for my taste buds. The crust was crisp on the outside, yet fluffy, soft and light on the inside. The creaminess and bouncy texture of the cheese paired with the italian sausage and peppers was just next level. Not gonna lie, probably one of the tastiest pizzas I've ever had.   This location doesn't actually have that much space, so if you're with a larger group I would suggest opting for take-out. Service here was friendly and speedy given the amount of people who were there. Pizzas were made within 15-20 mins of ordering. These pizzas are on the pricier end, but I honestly think it's worth it for a higher quality pie. Would recommend to all pizza lovers out there, and I will definitely be back to try out their selection."}
{"text":"Simply the best. The real pep God secret menu item is to die for. We probably order from here once a month since it opened and wow. Wait times can be long but it's worth it!"}
{"text":"4.5 stars... my favourite pizza north of downtown and worth the wait.  I'm a tough judge of pizza... I dont believe mediocre pizza is good and that I should be just happy to get a slice.  Nope nope nope.  So when I read that Maker Pizza moved midtown, I had to stop by and see if they hype is real.  Oh yes... yes it is.      For starters, this is a serious pizza place... the whole operations had at least 10+ people working.  I was very surprised and impressed when I walked in the doors.  But before I go into the details of the place, I'll let you know that you might be able to call in your order ahead of time.  I think it strongly depends on how busy they are.  I do recommend to call in to figure out how long the wait could be.  Worse case, you can always pop into the stores nearby to pass the time.  About this parking situation, I've got to admit that if you come during the popular time for grocery shopping... it's going to be an utter fustercluck.  It shares the parking lot with Pusateri.  Not trying to judge... but a lot of the clientele park and drive their car like how they drive the carts in the store.  Unaware, extremely slow, blocking your path, doing 25 point turns to get into a spot... just know that it's not pretty.  You could park on the road.  There's paid parking there and sometimes your sanity is worth the $2.50.  About the restaurant, it's more of a take out spot but there are a lot of long tables for you to eat in if you want.  It's clean with a lots of great windows to let in the light.  It's a long space that is more industrial cool with a huge area for prep & pizza making.  I spotted at least 3 dedicated people in prep and it was impressive as I saw them meticulously pick and chop every ingredient to the correct size and quality.  There was also a grill for the chickens and at the time I was there, they had the whole space just filled getting cooked ... it just made the place smell incredible.  In addition to all that, they had their pizza area.  Another 4 or 5 people were there just making pizza constantly.  A lot of take out was being done so it kept everyone moving.  At 4 pm, I didn't have to wait that long... I did call in ahead of time and they got the pizza to me perfectly right on the dot.  I think they were saying the normal wait is 20 minutes from order to getting the pizza into a box.  As for the ingredients ... dear god this was good.  I didnt see a single ingredient get poured out of a plastic bag or bottle.  What I saw was a place that took pride in crafting a great pizza by hand.    Little Deuce Coupe - My first whiff of this pizza made me pay attention... you can smell the smokiness of the lightly charred crust, the savoury great smells of the freshly grilled chicken, and the sharp sweet citrus from the lemon zest that topped the pizza.  In addition to those ingredients, the also had roasted red pepper, red onions, basil, ricotta cream, mozzarella, fior di latte, and Parmesan.  It all worked so well to create a rich flavour that made me eye the 2nd piece of pizza before I finished it first.  That crust... wow.  It's been a while since I've had a crust that was this fluffy on the inside but so well cooked to get a nice brown exterior that had that smokey sweet yeast flavour.  Im just drooling recalling all this.  A large pizza was more than enough for 3 people because they STACK this pizza.  It's generous compared to all other places in Toronto.  4.5/5  Descendent Pizza was a fav... gotta add Maker now to that list.  I'm actually a bit more partial to Maker as it's a bit lighter.  I already spied at least 4 of their white pizza as being my next one to try... Mushroom, Porky's, Frank's, or Tea with Broccolini.  I can't wait to try this place again!"}
{"text":"Super yummy pizza! Small shop, nicely painted interior and exterior wall on the right. Got a small porky and h o l y delicious. Perfectly made crust topped a juicy pork shoulder sugo, mozzarella, marscapone, basil, garlic, grabs Padano, and chili peppers that give it a nice kick without being too spicy. A bit expensive but definitely worth a try"}
{"text":"I've had the chance to try Maker Pizza a couple more times since my last review and I have to say that I enjoyed it a lot more than the first time. Frank's Best, with goat cheese, caramelized onions, honey and sesame seeds on the crust (among other deliciousness), is such a nice combination. It's a little sweet, salty and savoury. The crust is perfectly cooked and I love the texture the sesame seeds provide. The flavour profile is so interesting, and the pizza is really delicious. I think this different kind of flavour profile is worth the price. I also love the Dr. Pepperoni. I'm not sure how I feel about the additional fennel oil topped on an already greasy pizza, but I do love the actual fennel seeds and the pepperoni itself is really nice. I think we'll be ordering Maker a little bit more often after having a chance to taste a few!  Bottom line: pricier pizza, but worth it if you go for some of the unique flavour profiles."}
{"text":"Have to agree with the previous review, the Bodega Sammy is kick ass! The sub sauce along with the sliced peppers really compliments the various meats and the bread is top notch. But wasn't too impressed with the pizza. Found the crust to be way too thick, was very soft and bread like. The pizza also lacks a decent amount of cheese, and the pepperoni has a weird taste, it is more like soppressata. The meatball pizza is solid, but would be much better if they sliced/diced the hot peppers, rather than just throwing down the entire pepper that nobody is going to eat in one bite. However, the tomato sauce is actually very very good. I also find the pizza to be on the expensive side for a delivery/takeout type joint. So overall, I think there is a lot of hype leading to their pizzas selling out. If this was just some random new spot, I doubt people would be flocking to visit this pizza joint. Overpriced and nothing special."}
{"text":"best delivery pie in toronto, maybe the world!  i also got a munch hunch that the bodego is the best sandwich in town.  is it a bit pricy? sure. but as kramer says, why fly a kite in a park when you can just pop a pill, right?"}
{"text":"Had the Frank's Best pizza and it was delicious! Love the goat cheese, honey, and sesame seeds combo. It was sweet, almost like a dessert itself. Definitely very unique pizza, also the price was acceptaable since their personal small size pizza was good enough for two. The place was also very clean and not too big so it was intimate enough for conversations between friends. The cashier, owner and staff were very friendly and courteous. Very happy customer!"}
{"text":"Great pizza. The place is hidden in a corner of a street on Queens and I wouldn't have know about it if it wasn't recommended by a friend. Glad I found it. Pizza choices were awesome. Food was very fresh and well prepared. The place was like a small factory churning out one pizza after the other. The place has a few tables to sit down and eat but it seemed that most of the business was through their delivery. Definitely a must try place."}
{"text":"Maker Pizza is an awesome pie-slinging operation located off the beaten path, just around the corner from Spadina & Queen. Their 'za menu consists of white and red pies that are made with crust imported straight from Italy. It literally feels like a modern industrial factory, with pizzas coming off an assembly line, made to the specs of your order. The result is quite delicious.  Must-try items: Cool Hand Zuch Any pie or sandwich/salad  Delivery is the main focus, as they're equipped with a window along the south facade where driver's can quickly grab orders when they're ready. Service is top notch here, as the staff are friendly when interacting with customers. They're polite, humorous, and laid back, even though they seem to take pizza making very seriously. It's what their brand seems to be all about, and you notice it the moment you walk in. Customers who want to dine in can relax and stuff their faces quite comfortably.  Taste and quality are the highlights, among other things. The prices are worth the experience, and the pizza is great. It's incredibly clean, bright, and inviting here and you'll probably decide that you want to come back sooner than later. For those who want delivery, they plan to cover a 5 km radius. Maker is a hidden downtown pizza gem, without question."}
{"text":"Maker Pizza is dynamite! Move over North of Brooklyn, Queen Margarita, Blaze Pizza, and Pizziolo.   This place is hidden in Chinatown for a reason - only locals know about this. From Cameron House, walk north until you see a pizza shape sign on the east side of the sidewalk.  The pizza toppings are an expert blend of flavours and the zesty notes of lemon are ingenious. We had the Coop and it was sinfully delicious. Smalls give you 4 slices, nice for a snack and just under $20. Go with medium or large if sharing for 2 of more.   Pro tip: order in person, you'll wait 20 mins. Order delivery and you'll wait 1-2 hours."}
{"text":"I have eaten the pizza from here many times and it is amazing. I love the Franks Best pizza which is a white pizza with goat cheese, caramelized onions, drizzled with honey with a sesame crust. It is so damn good...HOWEVER...we ordered a bodega sandwich, and you guys need to figure out how to deliver a sandwich that is not sopping wet when it arrives. It was so soggy that it was inedible which is annoying because it otherwise would have been a really good sandwich. There must be some way for it not to be like that...especially because it is expensive. Maybe if the delivery time was not 1.5 hours then it wouldn't be like that when it gets here. It is a delivery based business so figure it out."}
{"text":"I've given Maker a couple more chances and it's definitely gotten better. The delivery remains atrociously slow (I've never waited less than an hour and it's usually closer to 1.5) and the service is rude, but the biggest flaw before -- the crust/dough -- has been improved. It's a lot lighter now, but still substantial enough to support the weight of the generous serving of cheese/pepperoni above.  FYI, despite their best efforts to fool you when you call, they *do* in fact take credit for delivery. You may even have to insist because all they say is a terse \"Cash on delivery.\" You just need to give the card details to them over the phone."}
{"text":"On a Sunday afternoon, some pals and I grabbed a stack of Maker pies and some vino and spread out our gingham picnic blankets in Trinity Bellwoods Park for a hipster pizza party.  From the white section, we ordered the Cool Hand Zucch and Frank's Best. And a pizza party wouldn't be a party without some classic reds, so we tried the Little Deuce Coop and Dr. Pepperoni. We rounded out our order with a beet salad to make ourselves feel better with all the dough we were about to consume.  All pizzas were fresh and hot with chewy crust that begged to be eaten.  Frank's Best, with its sesame-coated crust, trifecta of cheeses (goat, mozzarella, parmesan), caramelized onions, roasted garlic, rosemary, olive oil and honey really was the best. I'm a fan of more unconventional 'zas and this hit the spot. The savory from the cheese was balanced by the subtle sweetness of honey. Pardon my manners, but I could have consumed the whole thing."}
{"text":"Best pizza in the city, hands down. Wonderful soft, doughy and fluffy crust, and I love the unique topping combinations they have here. I am not one of those people who go for basic pizzas, and I am always most impressed by restaurants that offer creative options without going over the top and sacrificing the cohesiveness of all the flavours.  I've had Tea with Broccolini before (so good, I love egg on my pizza, the broccolini makes it feel somewhat healthy, and the lemon zest is a lovely addition), but the standout pizza for me is hands down *Frank's Best*. It has everything I love in one glorious pie: caramelized onion, goat's cheese, mozzarella, parmesan, roasted garlic, sea salt, sesame crust, and honey. PERFECT blend of savoury and sweet flavours - the sesame crust is so fragrant and again, the texture of the crust is next level. Add in the sea salt and the honey, and you have complexity, and balance. It's also not greasy at all, and given the lightness of the dough, you can easily eat 3 or maybe even 4 pieces and not feel disgusted with yourself.  A medium should definitely be enough for two people. I also recommend ordering delivery because apparently the restaurant is always super busy now (it wasn't when I first went last summer!) and you have to wait forever for a seat."}
{"text":"Being from New York I'm weary about eating Pizza in other states let alone other countries. However Maker did not disappoint.   The guys were really nice and since their produce truck did not bring them pepperoni today we got sausage on our pizza. Really high quality ingredients- comes with a high price tag to match. Not hard to find, right behind the super 8 in Chinatown.   Only thing that brings this from a 5 star to a 4 star review is price- but since the staff told us about how they really care about having the best ingredients, it's easy to assume it's costly to make each pizza."}
{"text":"From the reviews, I take it that this is a delivery place. I stopped by tonight with two friends and we were the only three patrons inside. Apparently with 9 workers it still takes over 30 minutes to get your pizza. Thankfully the pizza was delicious otherwise I would never return."}
{"text":"Sometimes I feel really reassured when I power up my computer, go to get my Yelp on (yes, this is a thing), start a review and...see that THE WORLD is already capturing all my feels.  The short summary is: sure, sure, you gotta pizza' my heart, Maker.  But, to join the chorus, I adore Maker Pizza. I just wish it were slightly better value: less money and/or a little more substantial.   What I can say, though, is: much like the 'cilantro gene', there must be one for people who love pineapple on pizza. I am one of them. And I am glad that Maker Pizza honours this with Tropic Thunder, my fave pizza on their menu. Generally though: their pizzas are extremely well-seasoned, creatively topped, and the crust is the stuff of legend.  I can also say that I have never experienced the poor or gruff service that many reviews detail. I strategically go at 'off' times so that things aren't too bananas and I don't have to wait for either eat-in or carry-out (see, trouble shooting: maybe people have shorter bandwidth during rush hour? Not an excuse, but possibly an explanation). I've never had anything but friendly service, good beats while I wait, and a great selection of soda/pop (take your pick) to lube up the ol' pizza passageways (see: digestive tract).  I like the space, too, capturing the 'industrial-chic' vibe. It's not cozy, and not a place you'll want to hang out for hours, but it's a great place to roll up and chow down.  Yelp note: new location opening *imminently* at Avenue Road / Lawrence!"}
{"text":"Best pizza I've ever had in my life. Thin crust and I get extra meat balls. I like a little spice and those peppers make it. I love it and never had a bad meal at maker."}
{"text":"This place may have ruined my life.   *Insert Dear Lord Meme*  I am a big pizza fan, but being a calorie counting dickhead - it's usually reserved as a treat.  Well unless Im drunk or high - then it is my main source of sustenance.   This place makes it hard. It makes it real hard to say no.   Aside: If anyone can get this pizza delivered and they choose something like Pizza Pizza.  I don't like you. You need to reevaluate your life choices. I wouldn't let you petsit my dog. Get better.   Back to the life ruining pizza from Maker...  I've tried \"The Pep God\" and \"Napoli Dynamite\" - Both incredible.  I'd probably lean towards The Pep God as my favorite, but it's damn close.  You know why The Pep God wins out?  Sesame seeds on pizza crust. What a genius move. You know when you order crap pizza, sometimes at the end of the night your box is filled up with discarded crusts aka \"pizza bones\".  I can guarantee that never happens with The Pep God.   I once ordered it from UberEATS and dude took 19 years to deliver it.  The pizza was cold and congealed.  Ya know what?  It still kicked ass.   Maker keeps it simple.  An amazing crust, a great sauce and a few quality ingredients. When you taste it youll realize thats all you ever needed."}
{"text":"Ordered the So Mushroom and the Napoli Dynamite for pick-up, they estimated about a 45 minute wait, in the end it was about an hour. After your first bite you can tell that the ingredients are fresh and each one is made to order, definitely worth the wait. This spot has to be one of the top places in the city for pizza!"}
{"text":"A truly wonderful delivery pizza. Hands down the finest delivery  pizza I have ever had. The service was also amazing. I hate my pizza on location and they took care us with white gloves. In addition, they fact that they offer parking and delivery sets them apart from the competition."}
{"text":"I finally made it to Maker Pizza and it really is the BEST pizza in all of Toronto! We ordered a small sized Tropic Thunder ($16) and I was rendered speechless after a few bites. Made with 00 Italian flour and going through a 3 day aging process, the handmade sesame honey crust was absolute perfection - thin in the middle and soft, airy and puffy at the edges while still having a slight elastic chew and sweetness to it. It was then covered with a thin layer of the most wonderful tomato sauce which was slightly tangy and sweet. After that, came a layer of stretchy mozzarella, Parmesan and fior de latte, and finally it was topped with generous amounts of pineapple, pickled jalapeño, pickled red onions, roasted garlic, red chilies and salsa verde.  The way the pizza was put together resulted in the most spectacular flavour journey with every bite revealing a new surprise. Upon the first bite, you are hit with the bright sweet flavour from the chili infused pineapple mixed with the sweetness of the tomato sauce and the creaminess of the mozzarella. The second bite hits you with a tangy kick of pickled red onions and slightly spicy pickled jalapeño. After that, you start to notice the more muted flavours of the cumin seed oil and roasted garlic. I never thought I would like Indian spices in my pizza but with this flavour combination, it worked extremely well. If you're worried about the pizza being too spicy, fear not! I am usually the first one to shy away from foods that are considered \"hot\" but I found that the sweetness of the toppings helped to tone down the mild sweet heat from the roasted jalapeño and red chilies so that it never got to too overwhelming. This experience can only be described as a symphony of flavours blending together in the most extraordinary way. RUN! Don't walk and pick one up today!"}
{"text":"Decent Pizza. Crust is thin and the end crusts are medium thickness and chewy good. Just tastey and it makes you even want to finish the crust!  Had the Dr Pepperoni - was delicious - had a whole medium to myself. (Oink Oink). I found the fennel oil a little off-putting because the oil was quite a bit that they drizzle on after the pizza is cooked (I think) and it was making pools of oil in the centre of all the curled pepperoni pieces. Hopefully its a healthy oil? O found the pepperoni generous though it made it over all a pit salty. But it still was good.  I went back and had the apocalypse cow which was just as tastey, more balanced flavor with a tiny kick to it.  Yum Yum. Hits the spot."}
{"text":"Best in the city. Gets delivered fast and super HOT. These guys kill it making pies. Zucchini and Dr Pep and outstanding."}
{"text":"The pizza itself here is pretty great, but I've ordered from here about 5 times and there's ALWAYS something wrong with your order.  The first time the delivery guy didn't bring any change, which left me giving a much bigger tip than I wanted. How is it that they refuse to take credit but don't bring change? I only order through uber eats now to avoid this.  Every time after that the pizza I order is ALWAYS missing one of the toppings it's supposed to include.  I keep ordering from here because it really is the best pizza I've ever had."}
{"text":"I'm in love with the new pizza place around the corner from me!  Place is open concept and clean looking. I also thought the staff was super professional and polite.  Went on a lil pizza challenge and started with the classic.  Dr. Pep. It had nice blistered crust, cheesy goodness, and a lot of pepperoni. I mean the whole pizza was covered. Super greasy but delicious. 3.5/5  Franks best and boy was this the best. I've had it 4 times but the last 3times I brought it to parties because I wanted to share the goodness. Creamy goat cheese, sweet caramelized onion, roasted garlic, rosemary on a sesame crust with a light drizzle of honey. Lil sweet and savoury. 4.5/5  Return of the Mac- I don't even like Big Macs but this was AMAZING. (Dine in only). Crunchy tangy pickles, juicy beef, cheddar and mozzarella, topped with shredded lettuce, onions, and special sauce. 4.5/5  Cool hand zucchini and so mushroom are white pizzas with a ton of flavour.  Very garlicky and yum. 4/5  Napoli dynamite, tropic thunder, apocalypse cow were also good but not my top 3 but worth a try 3.5/5  Red and white pesto was too saucy and cheesy. Prob my least fav. 2.5/5  Next to try is a good old classic sienna margharita and the REUBEN. Need I say more?"}
{"text":"If your looking for a great pizza place this is the place,  they also feature sandwiches and other menu options, try the porkies pizza it's one of my favorites. Place is always busy with take out so that means they are doing a great job.  Keep it up pizza maker."}
