{"text":"I love this place. The ambience is nice and the staff is too. -1 for some staff that barely speaks English and makes it difficult to communicate. I love the sushi, its never not fresh. Some may say that its not the best they ever had but you have to factor in the $$$. 
For the money and quantity, the quality is amazing"}
{"text":"I really like Makimono.
The food is good and the washrooms are clean.
I like the shrimp tempura,the miso soup,the mushroom tempura,and the chicken udon.
The ice cream is good. (especially the mango and the green tea flavor).
The waiters are just average."}
{"text":"Bad management. We had an argument about the contents of our food. We ordered takeout and couldn't eat it because of religious reasons. After speaking to the manager and explaining to her that we can't eat the food she refused to refund our money or replace the food. She also refused to give us her name. Which manager, in the history of managers refuses to give their name to a customer?!?! Soon after a 30 min discussion with her she finally agreed to give us our money back, if we came ourselves to the store to get the refund. 

Be carful what you're dealing with and what exactly you order...Because she won't refund your food."}
{"text":"Have been to this sushi restaurant many times and it is wonderful. Now that they have the iPad way of ordering it's a lot more fun too! Waitresses are friendly and polite and the service is fast and efficient. The food is awesome and the sashimi is really good. The black pepper beef is excellent with the veggie fried rice! I have two young children (3and 9 months) and the waitresses are always considerate with the space we need when seating us( we sometimes have a car seat). We have been on very busy days like Valentine's Day and the service is a till great and fast. Would definitely recommend this place!!!"}
{"text":"Had a reservation for a group of 20 people. In order to book the 20 people we had to preorder our meals 24 hours in advance. 

We arrived and they were 30 minutes late seating us and the entrees were coming out before we were all seated. Soups and salads came out after I had finished my meal. 

I was embarrassed as it was a large family gathering and the restaurant really failed from every aspect of operation at a food service site."}
{"text":"I love spicy salmon roll. Bento set is very good deal come with a lot of food. A lot of choices. Service is ok."}
{"text":"Hi to everybody :) i just try this sushi place today and here is my review:

+ Fast service, not expensive, friendly, looks good ( i like chicken teriyaki)

- avocado and salomon not looks fresh :(
and plates not looks very clean :("}
{"text":"Just tried this place last weekend. The food is great. I love how you can just order what you want on the ipad, its fun to scroll throw things and pick.
Food is 5 stars, but service was very slow so thats the only reason i gave it 4 stars."}
{"text":"I used to think that this place was amazing before having been to any other all you can eat sushi restaurant... Makimono pales in comparison. 

The rolls are mediocre, selection for vegetarians is OK, and I once found a hair on my gyoza. Service is OK also, however our server once made us redo our order form because we \"marked our orders down wrong\" when she never actually told us how to \"mark them down correctly\", and was even then reluctant to give us a new paper to redo it on.

In terms of the take-out menu, it's quite expensive for not-so-high quality items. 

The one thing I like about this place over other all you can eat sushi restaurants is the atmosphere; the place is big and there's some nice booths and rooms that you can sit at. 

Overall, while many people in Pickering love Makimono (as they have never had an alternative), I would suggest checking out some other all you can eat sushi places nearby. Sushi T&T in Ajax is wonderful and not much further (and I believe less expensive)!"}
{"text":"For an all you can, we find this place really good.  The rolls are not over stuffed with rice like some places.   Everything is  fresh tasting and the sashimi is amazing...mind you we only get the salmon and crab. Don't really get anything fried so can't comment on that but we always leave very satisfied."}
{"text":"The food is absolutely amazing, best quality all-you-can-eat sushi in the area. The service isn't always that great but good sushi is worth it."}
{"text":"I love this place. Great fresh food. Service was pretty standard for that type of location. A little on the more pricey side for a buffet but worth it if you got it."}
{"text":"Originally was pretty excited about this place and even more excited when I heard about the all you can eat menu. Unfortunately, the food was pretty mediocre and halfway through the meal I started feeling a bit sick so I asked to take the food I ordered to go. I was then informed that I would be charged 50 cents for every piece of sushi I asked to take to go. Even after telling the waitress I felt really sick, they still insisted on charging me. Overall I thought it was pretty rude and definitely wouldn't go back here."}
{"text":"Food was ok. Nothing special. Quite bland.  And there were bits of something hard in some rolls that we couldn't figure out what they were.  Not terrible food. But I wouldn't come here again."}
{"text":"Took a bit of time to be seated even though the restaurant was fairly empty. Pleasantly surprised, by far the best sushi I have ever had in Quebec/Ontario."}
{"text":"Honestly, I would have given this an easy 5 stars if they had been consistent. Before they moved, they had very good quality food! Loved every bite! but now..... It really hasn't been the best. Food tastes bland, Service is ok but not the best and the price is no longer justified. 
(All you can eat is a big money grab)

I do enjoy the new IPad menu for all you can eat as well as the environment (The new look is very pleasing!), but I'm there for the food and the food just doesn't cut it for me anymore.

As an avid sashimi lover, I order lots of salmon sashimi in 1 time. (Around 30 Pieces)
Every single time i place an 30 piece order, they ignore me and only give me 5 -10 pieces. Unacceptable. 

I've been here plenty of times over the past couple years but sadly they no longer gain my approval. 

I do not recommend this place for sushi. There are plenty of other places nearby which will make you sushi experience a LOT better! 

Save your money and go to a better place than this chain."}
{"text":"We've been here to celebrate my siblings birthday it was indeed a nice ambiance inside,friendly staff but it bother's me when they speak their language in front you it's very unprofessional.So be mindful on that food was ok not that great.I don't feel appetizing at all,too pricey for 4 people and 2 kids $182...instantly..definitely too much."}
{"text":"A closed down Pizza Hut turned in a Japanese Restaurant..  that pretty much says it all.

The enivornment is a mish mash of used furntiture, and the environment seems run down.  The food..  ugh.. 

Everything was coated in this brown sticky sweet sauce..  from the fried foods to the sushi and rolls.  Disgusting!"}
{"text":"I used to be a regular here when it first opened. Was very impressed with the renovations they performed a couple of years ago.  The food has always been good but I've noticed the service has really gone downhill. I'm no longer a regular here."}
{"text":"This was my first and probably my last time eating sushi. We were an unexpected party of 12 and they seated us immediately so they get points for that. We got the all u can eat dinner buffet ($20.99) and proceeded to order. Because our party was so big we spilt the table in half into 2 order sheets. Our half of he table ordered, tempura mushrooms, brocolli, enoki, 2 orders of California rolls, 1 order of spicy crab rolls, 2 orders of beef teriyaki rolls, gozya, black pepper beef and beef udon. Yes all that for one side of the table. Anyhow, no matter the udon never came, nor did the beef teriyaki rolls,which was probably better bcuz the sushi was plenty. While all the normal food was good the sushi was lacking with crummy avocado filler, and get this, cream cheese!!! What sushi has cream cheese in it? The waitresses eyed us down and repetitively told us we had to pay fir the sushi we couldn't eat. Yes we knowwwwww, we got it the first time. It was annoying."}
{"text":"If you are here for sushi, tempura, dim sum, or even some Chinese food, it's a good place with a reasonable price. But DON'T go there for sashimi or any stuff with raw meat and fish on the menu, they are really really NOT fresh,"}
{"text":"A friend and I had gone for dinner, and we ordered quite a bit of food that never showed up. Our glasses were empty for awhile before we flagged someone down to refill them. When we told a server that we had ordered food that never came, she just said \"o...ok\"
The food was ok...nothing exceptional. 
Definitely won't be going back there any time soon."}
{"text":"It's a really delicious all-u-can-eat sushi restaurant!!! JUST go and eat there!!! Went there several times. We have eaten at other sushi places and some downtown had given me a rash / became very itchy... but this restaurant is honestly the best !!!!

It's worth every penny!!!"}
{"text":"Ate here twice for lunch and both times it was the all you can eat. Lots of selection and the food was fresh and very tasty. Servers were always very good. Portions on the All You Can Eat are smaller which is nice since you can try several things. 
I will certainly be back."}
{"text":"I've lunched here multiple times, and I like the food here. Good variety, good ambiance and good location."}
{"text":"I think the rest of the reviews are pretty accurate.
We can it for AYCE on a weekday. We were seated promptly and were given ipads to order. The food we ordered came REALLY FAST and was delicious. The presentation was veautiful. The sushi was great!
The other non sushi items were average. The garlic shrimp and steak were pretty tasteless.

What really killed for us was the waitress. I made a mistake in the order- I ordered 5 salmon sushi when I meant to order 5 salmon sashimi. When the order arrived I apologized and sked if we could change it (I explained that I meant to order something else). The waitress REFUSED to take it back saying it was ordered and we had to eat it. I asked to speak to the manager, at which point she left and took the food with her. She came back 5 minutes later basically SCOLDING us and telling us we cannot order food and refuse it. She proceeded to tell us how this would be the last time it would be done.
This ruined the dinner for us.

The bill was brought to everyone, before we even asked. When I asked for the machine, it took another 15 minutes because she brought the bill to all of us at the same time. Do not see the point of this.

After that wrong order, our waitress did not say ONE WORD to us. The bill, the paying, the leaving was done without a thank you or a good night from her.

We will most likely not be returning to this place. We'd rather spend our money and give it to people who appreciate it, not serve us with the biggest scold. The quality of food at this place can be found elsewhere, where there is better customer service."}
{"text":"This place is one of my go-tos for AYCE in the east end. Everyone I've brought here leaves happy and satisfied. It has tons of options so even if you have a picky eater/non-sushi lover, there will be something for everyone. Their food is pretty consistent and the iPad ordering system is convenient (although they added a weird function that asks servers to confirm your order for the past year or so). Service is fairly good - rarely do they forget your order or leave your glass without a refill. Good fresh tasting sushi, sashimi and other dishes. 

My only real complaint: Definitely bring cash or a credit card because they don't take debit. There is an ATM though, just in case, but it has a steep fee."}
{"text":"I was weary to come back to a Makimono as the location in Ajax gave me food poisoning and they stole my credit card #. But this has redeemed the Makimono name! The deep fried california rolls, edamame beans, and deep fried bananas is now my new favorite meal combo!"}
{"text":"Food taste and presentation was great; however, the service has become extremely slow lately; I go there twice a month. Last time I paid for \"all you can eat\" lunch but after 30-40 min waiting for the order it was time to get back to work. Waitress was apologetic and gave a 10% discount on bill, but I hadn't eaten anything except side dishes! bummer!!  I am not coming back here again."}
{"text":"After reading a bunch of bad reviews, I was a bit scared to try this place out. A few of my friends have been here before and recommended it so I wanted to taste it for myself. The food was excellent! It looked good and tasted great! The server we had was really great too. She refilled our drinks 4 times and was always ready to help when we needed her. The food came out quick and none of our AYCE items were missed. I will definitely come back."}
{"text":"Pretty good selection! They use tablets to take orders which is always fun! The maki rolls are REALLY big- no lie. So make sure you pick the ones your really like first to get an idea of the serving size for your group and then order accordingly.

They have small cakes and fried banana and fried custard for dessert so that was special. They had the usual fanfare so I enjoyed myself! 

If you're too lazy to drive all the way to Markham for sushi then this place is a good spot in the Pickering area!"}
{"text":"Very friendly staff,good fresh food and quick service I just love it and will definitely go again to this place totally recommending"}
{"text":"Hmmmmm, very delicious. Exceeded my expectations. Service was friendly, waitresses were always around to clear plates/take orders. Food was fun and inventive. Pricy but worth it. Definitely will be coming back. #ItIsWhatItIs"}
{"text":"Okay food, for high prices. Service is good but hard to get Wait time for takeout and get to getting someone to serve you needs to be improved."}
{"text":"Good place, food is fresh. Selection is adequate but not huge. Wait staff is pleasant. Menu has a lot of non sushi items as well."}
{"text":"This place is an AYCE Japanese restaurant.Not really \"buffet\" but all you can eat nonetheless . Run by Chinese people, and catering to Chinese CDN tastes for good cheap sushi and Japanese style foods, they do it quite well. If you went downtown and ordered 6 pieces of salmon sushi, you'd drop 6-8 bucks. Here it's 21 bucks. AYCE! Good value, pretty decent quality, and service was good, considering the ordering format can be confusing for newbies and could drive servers nuts. 

Only downside was they don't serve tuna.I'm sure people would pay a premium to eat tuna sushi or sashimi, but alas they dont' . Perils of AYCE gluttony."}
{"text":"Not surprised with the 3 stars.  Surprised that its higher than a 2. 

Cmon. You close at 1030... and cant take a to-go order  at 1015pm? REALLY.. state that on your door and dont waste our time. 

You have your chefs back there.. rolling eyes as we ask for a take out order. ROLLING EYES? do you want someone making your food with this attitude?? Thats all i have to say. 

Customers are the reason you are open.  Keep this up and you will close. 

First impression is huge.

YOU FAIL. 

bye."}
{"text":"Decent all-you-can-eat sushi in Pickering. Be warned that it can take a while to get seated when they are busy, but once you're seated the service is decent. I've said decent twice now. (now 3x)..I think that sums it up."}
{"text":"Nice clean place. Sashimi is good and fresh. Staff are very fast and friendly though we ended up getting some orders we didn't ask for by mistake. Love the ability to order using an iPad. Good selection of food but dessert is a bit of a let down."}
{"text":"Great selection of stuff to choose from. place is clean n spacious. raw fish were fresh! everything tasted fresh n yummy! 
they have Ika(squid) on their sashimi selection which is great cuz those r usually pricy or served in sushi form.( with all that rice u can only eat so many)

kinda feel iffy about the seaweed salad, it tasted good but from the look of it..it looks like they had pre arranged all at once n stacked them one on top of another n stored it. so at one point ur friend's salad bowl was on top of ur seaweed....u can see it compressed n formed. so that didn't look too clean but we ate it n no one got sick...:P

service was alright, better than any typical all u can eat sushi places...not too rushed to serve or take ur plates. except they kept forgetting to bring more wasabi n hot tea ..had to ask 3 times.

the only all u can eat sushi place on my list!

Generally speaking, all-u-can-eat sushi quality is not comparable to regular japanese restaurant quality. But this is as good as it gets for all-u-can-eat sushi. 

Regular japanese restaurant chefs have intricate craftsmanship on cutting of the fish, whereas all-u-can-eat sushi is just sliced up and served. Therefore it's really important to have fish fresh enough to make up for the lack of cutting skill. 

the downside is that its too far from me........we only manage to go there every other month. if it was a 15mins drive away we'd b there every other week!"}
{"text":"No complaints whatsoever!!!  I've been to the one in Woodbridge and this one is just as good if not better. Fresh sashimi and great service. It's only about 4 months old as I write this review. Glad they have the tablet ordering system."}
{"text":"One of the only AYCE places that offers sashimi for lunch, which is exactly why we made the trek there. It's not a huge sashimi selection (and doesn't show on their website menu) but salmon sashimi is good enough for me.

Ordering from the iPad is a bonus, mostly because you can see pics and descriptions of every menu item. However, unlike some other places, a server has to come and confirm your order every time before it gets placed. Probably would be more efficient if this step was eliminated as it is at other AYCEs with iPad ordering. -1 star because some food items didn't arrive near the end, but we were well attended to for the entire meal."}
{"text":"For these poor souls, they might or MIGHT NOT have known that this weekend (last weekend in May) would be so busy.  It's \"Anime North\", the weekend when all anime-lovers gather nation-wide to attend this 3-day event.  Business is guaranteed at like 300%, and I bet you most restaurants meet their 3 month quota in these 3 days.  That's how busy it gets.

Service
Horrible.  We reserved a table for 6, but my cousin also brought her kid along.  Staff didn't even see the kid and sat us at the table.  Instead of suggesting that one of us could be seated at the end of the table, she started accusing us for not giving an accurate number and noted that it was too busy for her to accommodate us.  I understand that the person booking (and it wasn't me) should have been clear to say \"it's actually a party of 6.5\", but there was no need to be so rude.  Worst case scenario, our group would have been more than happy to be separated into 2 tables.  The fact that she gave us attitude was quite a turn-off.  At the end, she gave a sigh of relief and said fine, give you one more table.  Now, what we didn't know was that they also decided to add a service charge.  Usually, servers will notify you about this service charge BEFORE you dine...not when the bill comes through lol.

Anyhow, after 10 minutes of waiting, we were frustrated from the wait.  I raised my hand and asked for service.  Our waitress said she's too busy, told us to wait an extra minute.  3 minutes pass, she comes back to say, I'm still busy, you have to wait longer.   Maybe another 5-10 minutes come by, and she finally gets our order.  The food comes gradually, one by one in 5-10 minute intervals.  In other words, we were not all eating once and it took almost 20 minutes before our last party member was fed LOL.  

Food
Great portions, couldn't even finish my whole bento box.  Quality was average, sushi was pretty 'meh', they weren't packed nicely and seemed a little soft to my liking.  Salad was good.  Miso soup was awful, seemed like they diluted it with lots of water.  Overall, I think the food was okay, probably like a 71% in rating.

My Rating: 6.5/10
What It Really Deserves: 6.0/10

I probably would have given it lower but my friend says I'm always too critical.  Just to let you know, service was like a 3.0/10 LOL."}
{"text":"Good quality food. Fast service. Most AYCE places give you really small portions of the teriyaki dishes or anything that is not sushi or sashimi. 
This place also had dim sum and it was decent.  Definitely worth coming back"}
{"text":"Horrible service....

Do not advertise closing time of 10:30 if you refuse to serve your customers that arrive at 10:15 (5/26/2017). Normally, that's how it works. Businesses take guests until their advertised closing time. If you do not plan to serve your patrons at advertised times, then revise your hours. This gives potential guests false dining hopes.... 

2) We asked if they were still serving and the hostess said only take-out. I was looking at sushi chef and he rolled his eyes and nodded his head like \"wtf.\" 

No wonder it's only a 3 star establishment. Lame, rude and unprofessional to the max. Ohhh, let's not forget lazy!!!!!"}
{"text":"We received a menu from this place in our mailbox so we decided to order some delivery. We were very impressed. The best sushi we have had in Toronto for this price. It was so fresh and very tasty. Would definitely order again and go for their AYCE"}
{"text":"This is my absolute favorite AYCE sushi place.
I used to only go to AYCE sushi places in Markham where they don't even bring your food, especially if you have ordered it more than once. And then this place opened up, and now I can finally have AYCE sushi with good service! Portions are decent. My favorite type of sushi is dynamite roll, and this place does it best. Also they do make changes to the menu every so often and add things to it, which is nice. A favorite addition of mine is the custard balls, they are perfect for dessert. They've also added some apps like dim sum and har gow and little cakes for dessert.
Service is excellent, they often get large parties and the staff always seem very accommodating to big groups. We always receive our food fairly quickly no matter how busy the restaurant gets."}
{"text":"We went there on a Saturday evening and after having eaten there I don't understand all the positive reviews about this place. I have tried quite a few other sushi places in different cities and countries and that also included sushi places that were run by real Japanese sushi chefs so I was fortunate enough to try really authentic and delicious sushi. I never had a good opinion about all you can eat places but we still gave it a try for the sake of trying.

We had a few of their special rolls, nigiri sushi, sashimi and some of the fried stuff and ice cream/pudding. I personally found their rolls tasteless. It didn't taste like anything and the white fish/butterfish sashimi was kinda chewy and the salmon didn't have much taste either. Also, the sushi rolls were not served as presented in the menu. The tropicana roll with mango sauce on it  tasted watery like they had watered down the mango sauce. 
The fried items were not too bad.

Bottom line:
The fried stuff may be ok but I wouldn't go there for their sushi. Someone who has tasted real sushi before won't be satisfied with Makimono's sushi. It has no flavour and not even the soy sauce could cover that. I would almost say its lacking passion. On top of it we paid 75$ with tip for two which could have been a decent meal at a good sushi place. I had trouble getting that stuff down the throat. Not sure why this place is still around.

Not recommendable."}
{"text":"The food is just average: bento boxes pretty good, good gyozas, udon soup not great. The service is soooo slooooow"}
{"text":"I'd give this place a three and a half star. It's close to my house so mainly it's out of convenience. The food is decent. Nothing spectacular but their mango salads and custard bun would be the reason why I came back. Staff and service could use better customer service, a smile or a thank you would be a nice welcoming gesture. 

The actual restaurant looks nicely design and modern. Tablet menu makes it convenient to order."}
{"text":"A group of us came here after work, for a little chill time together.  What a great place for a group to go and have some fun and sample just about everything on the menu.  Everyone had a great time.  We will be back again soon I'm sure.  Everyone had a different favorite item.  From Rock & Roll Shrimp to Scallops to rice, it was all very good and well presented."}
{"text":"Very happy. Found my go to place when I'm in Toronto. Great price for all you can eat and it's made to order so you know it's fresh.

Service was exceptional and very helpful. Especially since the ordering is done from a tablet on each table. 

I'm sure I'll be back shortly."}
{"text":"This is a really good place best I've had in gta service is a little slow but the food is great they even do a great job with the presentation"}
{"text":"Had the Golden California Roll - loved it! The sauces on top made it taste amazing! We ordered it twice but the second time the presentation was off.

Deep Fried Banana was a tad cold and could use some whip creme. We asked for someone and they didn't have any.

Really nice setting inside. Would dress nicely to go there - atleast semi-casual."}
{"text":"We were in the area and decided with AYCE sushi at Makimono. The restaurant is dimly-lit with a dark finish. It looks pretty nice for an intimate dine out. They have a private room in the back that looks like it could seat at least 25 guests. 

It wasn't busy in my opinion when we came by for a late lunch. They didn't have a host at the front so we had to wait for the server to seat us. They sat us in front of where the chef make their sushi. They gave us one tablet/iPad to select our orders which took awhile because we were group of more than 6. Most sushi restaurants would provide us 2 tablets to order from with our party size. After submitting our orders we still had to wait for the server to confirm our orders. Which made us wait more because there seem to be only 2 servers for the whole restaurant. Even with these \"prime seats\" that were so close to the kitchen - we had to wait quite some time. 

I'm curious as to how they wash their dishes because one of our sauce bowl had a dried up piece of seaweed stuck in it. How did they miss that?  

This restaurant has a small selection of sake. We went with the server's recommendation for a jelly sparkling sake which was the cheapest on the menu, priced at $15 for a 6oz can. It was pretty good! I need to find out where to buy this or I have to come back here just to order this. 

The sushi had too much rice. They placed the slice of fish on a pretty big bed of rice. This can make one pretty full from all the rice and there goes the AYCE. The maki rolls were a decent size. I had to ask for ginger slices to cleanse my palate twice and waited probably a total of 20 minutes. My food got cold as I was waiting to cleanse the fishy taste in my mouth. You think they thought I was asking them to bring it at the end of my meal. 

The desserts took quite a while to come out too. By this time we were the last few people left sitting at the restaurant. The lunch crowd that came after us had already gone. Did they even eat? We have no idea. 

This place has room for improvements considering they have many other locations in other cities. If you don't mind the waiting game then come by here if you are near the airport. I wouldn't go out of my way to make a trip here.. well maybe just for the sake. Their sushi is nothing special as you will find your typical ACYE choices here."}
{"text":"Great service, ambience and a wide variety of high quality food. Ordering through an iPad made it easier to pig out lol. I noticed Makimono had more variety in their lunch menu than a lot of other AYCE sushi places in the GTA."}
{"text":"I am not sure what the other Yelp! reviewers ate but I was not impressed. 

I will admit that half way through the meal I started sneezing and reacting to something in the air.  It really killed the mood. 

We started with a mango salad.  What we got was 5 matchstick strips of mango with some purée that was tasteless. 

Next we ordered some chicken fried rice, pad Thai and spring rolls.  The fried rice was a bit greasy.  The spring rolls were crispy and tasty.  The pad Thai was OK

Next we ordered sushi.  That too was hit and miss. The crab sushi was really fake crab which didn't impress me at all.  I tried the chicken cutlet.  Not bad but some of the strips were devoid of chicken. 

My spouse ordered dessert.  Deep fried banana and vanilla ice cream.  The portions were generous.  So the meal ended on a Happy note. 

Addendum: no debit or interac here.  Unless you wish to use the in house ATM and pay a $3.00 charge"}
{"text":"Place was clean and looked very modern.
Service was fast and pleasant.
Sushi looked and tasted fresh.
 Ps. I got a stomach ache and had diareha"}
{"text":"The new ipads are cool, but it seems like an excuse not to talk to you. The miso soup was warm at best, the sashimi was cut too thick to enjoy, the unagi was sub par, and they forgot our tempura twice! On top of all that, my drinking glass was covered in water spots and wasn't cleaned properly, as the head of my beer withered quickly and completely. I've given this place 4 tries, and it feels like its gotten worse every time. I'm done here, and going to edemame just a fee minutes north at the hub at Kingston road."}
{"text":"Expensive $30, but its definitely worth it for a buffet. Menu options are vast, my favourite dish is the shrimp dumpling oh my god. The interior is beautiful, however servers are stern and try to stay out of the way of socializing."}
{"text":"I was referred to this restaurant by the hotel concierge. Great atmosphere, not so pleasant staff! Pretty busy, but the staff was managing very well with help from management. I ordered the shrimp crunch(something like that) and teriyaki chicken meal! Boy, did I go wrong.. The chicken was uncooked (Raw), I was told by management that the chicken had been soaking overnite in marinade and that was the reason the chicken was pink on the inside. I disagreed with her and told her that she could take it away. She told me to taste it. (Hell no)!  So I asked for the check and they offered me a 10 percent discount on an uncooked meal and told me that only a portion of the chicken was pink.. I politely paid the tab, and left! I will be writing the Owners of this establishment as well!! I will NEVER eat there again!"}
{"text":"This place was really quite good when it first opened but the last time I visited the service was horrible! Staff ignored us and acted like it was a chore to work at all. The quality of the food has gone downhill too, unfortunately."}
{"text":"ABSOLUTELY WORST EXPERIENCE!  Staff were condescending and snooty.  Ignored us because we were interrupting their work.

I used to enjoy coming here.  Something has changed since.  I brought my family here on Sunday afternoon.  There were no more than 5-6 tables seated.  

I had to ask 3 different people for a booster seat, despite it not being very busy at all.  

The music that was playing was very offensive, I mean NOT APPROPRIATE in a public space.  Don't get me wrong, I love hip hop and rap and grew up on it, but there are certain tracks you need to confine to your own earbuds.  A rap song came on about \"F*CK THAT P*SSY AND HIT THAT SH*T HARD\".  I notified the manager and she said she would turn the volume down.  She didn't get the hint until I repeated the lyrics to her face.  She then took her time, allowed the music to continue for another minute or two, before going to the back to change the track.  

All was fine for a few minutes when another song came on.  This song shouted the word \"F*CK\" every two beats.  I immediately looked for the manager again.  I found a server and explained, but was ignored.  I asked the server again to change the music, and he ignored me.  So I explained and repeated the lyrics to him and he started complaining to me about how busy he is (he was just fetching drinks as all ordering is done on tablets).  The manager was nowhere to be found.  

I gathered my family and left, but not before the server decided to shout some choice words to me as I was leaving.  I've lived in this city my entire life, and I take my family out to eat every 1-2 weeks.  This tops my list as THE ABSOLUTELY WORST RESTAURANT EXPERIENCE I HAVE EVER HAD.  

I've never been dismissed, demeaned, ignored, and then chastised for it.  It was like the staff felt entitled to a pleasing work experience to be provided by the patron **shrug**??

AVOID THIS PLACE AT ALL COSTS"}
{"text":"Started off decently. Fairly empty, as we went around 4:00pm. We opted for a la carte, as 4:00pm apparently constitutes dinner time here...

Had:

Bento A ($11.50) - pork katsu, rice, 3 gyoza, 3 salmon roll, 3 cucumber roll, 5 piece veggie tempura, served with rice, miso soup and salad.
Everything save for the rolls was average. Decent sized servings, but by no means large portions. The rice in the rolls was definitely not fresh. It was hard and dry and I have a feeling these were left over from their lunch rush. Not cool.

Bento B ($12.50) - salmon terriyaki, fruit (two orange slices), 5 piece veggie + 2 shrimp tempura, 3 salmon roll, 3 cucumber roll, rice, miso soup and salad.
Same as above. Average stuff, save for the rolls (once again, see above), the salmon terriyaki piece (small and dry), and the oranges. Yeah. Issue there. More later.

Coconut shrimp ($6.99) - 6 pieces. Decent sized pieces. Shrimp were a tad chewy. Crisp coconut coating. Extremely scant on the coconut taste. Served with kewpie mayo.

Sashimi appetizer ($8.99) - 9 pieces. I have to hand it to them. They didn't serve me cooked shrimp or imitation crab meat as sashimi. That's honest of them (their description says \"pieces of raw fish\"). Sashimi was also average.

Spider roll ($8.99) - 8 pieces. This was probably the highlight of an otherwise average to sub-par meal. The rice was not hard (I wonder why...). There was lots of soft shell crab. When a Japanese restaurant usually cuts a dynamite roll, they leave the ends of the shrimp hanging out of the ends of the rolls. They did the same with this spider roll. For those who don't know, there is no spider in spider rolls. It's a soft shell crab. The ends of this roll had fairly large chunks of soft shell crab hanging out of it, and I was quite pleased by that. At this price, I'd go ahead and order this one again if I ever came here again, but I don't intend on doing so because...

...while I was enjoying my first piece of spider roll, my father was enjoying his slice of orange (see Bento B above). He suddenly spit it all out onto his place. Yeah. It wasn't because the orange was sour. It was because the orange had a chunk of black rot in it. It was quite gross. I'll post a picture so you guys can see. We informed the waitress, and she took the orange back into the kitchen. A few minutes later, she came back out, told us they checked the orange they had given us and told us they didn't know because there were no indicators on the outside of the orange, then handed us three smaller slices of orange to replace the one with the rot. Um...like we wanted to take that chance again. My brother was so turned off that he stopped eating. Not cool. The three smaller slices of orange were also the extent of the restaurant's apology to us, not that they made a formal apology or anything.

Would I consider coming here again? No. Not at all."}
{"text":"My wife and I came here for our 7th anniversary and it WAS NOT what I expected. The decor was not what is looks like on the website and it felt like the witness was rushing us to finish eating. The restaurant in general just felt bad.

Sitting down at the beginning service was fast and the food came out in less than 10mins. However when my wife found a hair in her sushi, that just killed her mood. The manager was great in trying to accommodate her disgust, being very apologetic STRONGLY insisting that we take another plate or a dish to go aka \"trying to get us to pay for food we don't want.\" After several times of saying no, I intervene to say sure, we will take the dish but 1/2 price. Why did I say that, after this annoying compromise was made, there attitude turned from \"I'm sorry\" to \"I'm done\"...... And so were we.

That was my 1st time eating at this restaurant... Never again."}
{"text":"What is going on Makimono??? I used to love both Ajax and Pickering locations and would go out of my way to eat here. 

   I was just here this past Saturday with a friend and they now have a conditional pass for the health and food inspection. We decided to eat there anyways. We didn't get sick or anything but the food was just bad considering it's pretty much $30 a person for ayce. I feel like the quality of food has gone WAY down over the years.

    Needless to say I will not be back."}
{"text":"Fresh off the press, was here last night.

We arrived at 9:15 PM as Sushi Ya was catering a private event. The restaurant is huge and was empty, just another table with us. But to be fair, it was late on a Tuesday night.

We were told that if we want the all you can eat menu to order by 9:30 PM. I appreciate being informed up front. We did order the all you can eat dinner for $24.99 + taxes per person.

The service was friendly, good and fast. The only thing was, when we told the server that the custard buns were under cooked, she laughed it off. I don;t think she was being rude, just the language barrier.

The food was good, nothing spectacular, but good. Salmon, Butter Fish and Mackerel Sashimi were fresh. The batter for the shrimp teriyaki was spot on. Did not understand why I was served ketchup with deep fried scallops, very strange. The spicy salmon sushi was not very good, it was like eating a salmon mince (!) with rice. As previously mentioned, they apparently have changed vendors for the custard buns and the ones we were served were the size of a toonie and under-cooked. Needless to say, we just had a bite of those.

We are not sure if we would return, we just might to give it another try, however at $24.99 it's not cheap."}
{"text":"I came with a group of 8 people after Anime North convention ended sunday evening; it was a 30 minute wait. 
My seat was wet which i think was wiped with the same cloth they wiped the table... Anyway... the soy sauce container was leaking at the table. We let them know later to replace.

After ordering our meal the first dish to arrive was fried rice, pad thai and then my sushi dish: Rocknroll $7.50+tax.
Everyone else who ordered a bentos, udon and teriyaki had to wait much longer. It took the servers 1.5 hours and our prompting to finally deliver the teriyaki dinner and to top it off, they were rushing us to clear the table after some of us ordered and was eating dessert, despite the fact that we were delayed by their service.

The rolls itself tasted ok but only 5 pieces (although larger than the average roll). No need for sauce. Wasnt that hungry.
The bentos which were about $14 had more value i guess.

So by the end of the meal, they gave us separate bills. They autocharged 15% tip however they charge it on top of tax so it was actually 17% tip. I thoroughly dislike the deception and the fact that the service wasnt that great yet i have have no choice about tip."}
{"text":"Went for AYCE Lunch. This place was great; the food was delicious, the options were more than enough. You order using tablets which is very convenient; the food came fast, and the service was also good. I don't know why the other reviews weren't so good, but I would definitely drive out to this place, just to go."}
{"text":"Spend 30 minutes deciding what to order.  Website says open until 10:30pm. Call at 9 for delivery.  Told they don't deliver past 8:30.

If you advertise that you deliver and you advertise that you close at 10:30pm, and you don't deliver past 8:30pm, THEN YOU CLOSE AT 8:30pm!"}
{"text":"Food is okay but worst service + under trained staff.

- Waited 1 hour for bento lunch and 2 rolls. 
- Asked for extra ginger, gets wasabi instead
- Soup and salad doesn't get served with the bento lunch (had to ask and wait 10 min)
- I see my roll sitting on the sushi counter for 15 minutes, asked for my roll, another waitress (who was not serving me) brings my rolls. 
- Appetizer doesn't come out after we finish our food (1.5 hrs after order is in)
- Did I mention, they didn't give us soy sauce?

I understand it was a busy day due to the convention but it's pretty outrageous how disorganized they were. The food is not bad but the service made everything terrible. Management needs organize and train their staff. This place is not worth anyone's time or money."}
{"text":"Been here several times! This is my go to place for all you can eat sushi in the Durham region! Only thing I would say they probably want to add a little bit more dessert options but other than that the food is pretty good!"}
{"text":"Sushi reasonably good, although pieces tend to be small in comparison to other places I have eaten.  Fish used is fresh but things like the sushi pizza, gyoza and edamame could have been hotter."}
{"text":"Awesome awesome awesome sushi! Very fresh especially for an all you can eat sushi place. Service was a bit slow but the food made up for it"}
{"text":"If I was grading on food quality only, I would give this restaurant 4 stars. However, because this restaurant takes advantage of modern technology and has very kind and well spoken staff, they fully get a 5 out of 5. 

What is also quite exceptional is the presentations of the plates. The food delivery speed is very good, and the coolest part of all of it is that you order from a customized iPad app, written exclusively for this restaurant. 

It's difficult to get a high mark in sushi becuase one is somewhat limited in the possibilities for the plates - it's all the same everywhere. This place is cool, great for a date, decent atmosphere, and it's not too expensive. The sushi is good quality, soft, textural, I love it. Definitely coming back. The wasabi could be hotter."}
{"text":"The food is delicious and the iPad ordering system is marvellous. However, that does not mean that the customer deserves to be denied service. Food comes little by little, and our party had to nibble slowly even though we spent over 200 dollars. The service is truly, terrible. They do not seem understaffed either. Yet empty plates were left on our table and no one came by until near the end, to see how we were doing. Makimono, technology doesn't mean you don't need to do your job!"}
{"text":"Decent selection. Their sushi is good - but not great. There are definitely better places in Pickering to go. It's a decent, convenient option for location and accomodations for large parties though."}
{"text":"Decent AYCE sushi restaurant, but I would place it as more of a quick lunch spot. 

In my opinion, if you've ever been in a downtown Toronto AYCE sushi place (or actually anywhere else...) don't come here for AYCE unless required or seriously craving the AYCE monster inside of you. 

The selection is quite limited. When the restaurant tends to get busy (mainly during lunch) I found that it took much longer than usual for my dish to come out, service was slow, and many of the dishes we ordered were forgotten. I've been to the restaurant more than 5 times these past two months and my experience has been consistent and disappointing. 

For the other times I've been just for the regular menu, it's really not that bad. The sashimi is decent (if you order specifically sashimi...) and the price is a bit more than usual, but not overpriced AND lower quality like the AYCE they offer. 

I would say there's definitely room for improvement in their service, as well as their selection for AYCE (if they are going to keep the same pricing..). 

Personally, I wouldn't come here again."}
{"text":"Consistently enjoyable. AYCE dinner menu is excellent - incredible selection of maki, sashimi, sushi, temaki handrolls, plus the theatrical Green Dragon Roll (among other special 4-piece creations), and favourites like tepanyaki and udon varieties, yakitori (small skewers), gyoza, and yam tempura. Fresh, delicious, plentiful. Atmosphere is elegant and modern, but family friendly. If you're in Durham - perfect. If not yet you're craving authentic Japanese food, Makimono is worth the trip!"}
{"text":"Average sushi. Average service. Did not like that no one cleared the table until the end as i had a baby who was reaching at things that i had no where else to move it to. Wasn't busy. Good if you're in the area"}
{"text":"Selection is good. Clean place. The only problem was when we were there, we had to wait for our food for so long. Seems like the staff was on break or something. Other than that, I enjoyed the food."}
{"text":"I would rate this place a 3.5. Came here for AYCE sushi on a Saturday night at around 8pm. Thankfully there was no line (always a blessing esp when you're starving). The service was good and I didn't have to wait too long for the food to arrive. The sashimi is pretty fresh and I appreciate how they serve it on a bed of ice which I have rarely seen in other ayce sushi restaurants. Highly recommend the baked mussels and mango salad. The Pad Thai was surprisingly not bad (i always order noodles...my weakness).  Just FYI it's one of those restaurants that uses a tablet to order. The price per person was around $27 but they do have the option to do a la carte as well.  I would come back again if I'm ever in the area and have a major sushi craving. Definitely left with a huge food belly. Anyways hope this helps!"}
{"text":"The service here is terrible. When we arrived it required me to ask 2 different people for water, which didnt arriive until after the first round of foos. Over an hour wait for a few rolls that I had to ask where they were. I was then told we are busy that's why such a wait. I was there well before any other tables got sat. Orders placed before they walked in. Manager avoids speaking to me until I go to pay. Offers a 10%discount on a 60$bill which is supposed to happen anyways when paying with Cash. This place is a joke compared to the Woodbridge location. Terrible service, lackluster food. 

Won't be returning."}
{"text":"Went here with my boyfriend last week and was not completely amazed. I went to the one in vaughan and the food there is really good. Service is quick as you order on an ipad rather than through your server. I recommend not ordering everything at once, order it a bit at a time or else you will have so much on your table and if you don't eat the whole plate, you have to pay for it as a separate dish (not as an all you can eat). Food is mediocre at best. I've had better sushi at a grocery store. I miss Sushi Dragon that used to be there, they focused more on food rather than on atmosphere. When I sat down and looked out the window, I saw the thick layer of oil from a child's handprints all over the window. I couldn't even see out the window. I won't be back for a very long time."}
{"text":"Last night was a sushi date night & we are fans of Makimono. We've always had friendly, good service and the food is always good."}
{"text":"Nice place, best in Durham, fresh food with good quality.  Always using all you can eat :)  My favorite shrimp tempura, black peper  beef, unagi sushi  and .... many more :).  Good friendly service. Compare to T&T Sushi  almost the same."}
{"text":"We get that's it's a busy day. But we waited 30 min after our reservation to be seated. And are still waiting now an hour for them to bring us our food. Their are 10 of us and they bring 2 pieces then 10 min latter another 2 pieces. 
We should have ordered pizza to our hotel rooms! This is the slowest worst service ever!! 
They tell the server they sent it all but we didn't get half our order!! Now their starting to re send stuff they already brought us! Never coming here again!!!!"}
{"text":"I love to promote local businesses in my hometown of Ajax, however my experience last weekend at Makimono restaurant was quite disappointing.
Nikki the waitress was rude and indifferent.
Food wise: nobody deserves warm sushi, some of them were falling apart before you could put into your mouth.
Chicken was dried and not fresh.
The other dishes were ok. Not impressed at all.
Definitely my friends and I won't be back."}
{"text":"We've always had a great experience at Makimono in Pickering. The food is yummy, fresh and we leave full and satisfied each time. Their plum wine is superb. There have been a few times when service was slow."}
{"text":"The food is good. And the decor is also very nice. A little pricey though for a dinner on the weekend. They have an all you can eat. And ordering is via iPad so that was quite convenient. Overall a good experience."}
{"text":"Overall a good value. Most of the time the food is fresh and service is decent. 

I enjoy the fact that sashimi is on the lunch menu. Some times I go and just eat a lot of sashimi and get my fill of tuna and salmon. 

The other dishes are great too. Broccoli tempura is one of my favs here. Their deep fried bananas are amazing too. Yummy 

I go here at least twice a month and enjoy it every single time."}
{"text":"I got the Bento Box 4 which came with salmon teriyaki, 3 gyozas (which are vegetarian dumplings), 2 pieces of salmon sushi, 6 california rolls, rice, and shrimp & veggie tempura. I think all meals also come with miso soup and green salad. The portion sizes were huge and the taste was good in my opinion. I liked the salmon teriyaki and they used the right amount of batter for shrimp tempura. Now for the bad part. At the beginning of our dinner, there were plates laid out in front of my group and I and 3/4 were dirty. When the waiter took them away (realizing we weren't doing AYCE) he took the top one to the kitchen and left the rest to be used for another table without realizing they were also dirty. It took awhile to get just the menus and our drink orders in the beginning, but once we had ordered the food the waiter serving us was prompt and friendly. Taste is okay, portion size is great, service and cleanliness could be better."}
{"text":"Food was great! Everything tastes fresh! Great service. I have never been to a place like this and since it was close to our hotel we decided to try it. Order simple California roll, miso soup, salmon roll, tempura shrimp, and calamari."}
{"text":"Makimono is a very nice place for sushi. There are ipads for ordering and a wide selection. There were many vegan options for maki rolls which seems like a good feature of this location as well. I loved the wontons and the deep fried custard buns. The only negative thing I will say is that my friend and I felt kind of uncomfortable. The service staff made us feel kind of uncomfortable. They did not do anything in particular but we felt kind of like we were being stared at??? Lmao idk it was still good though"}
{"text":"went here for lunch with my boyfriend and really enjoyed the food. it took some time after the second round of what I ordered, even though it was only me and another family in the whole restaurant. I feel like they wanted to bring the food slower so we ordered less but this is typical for sushi buffets. I like the options on the menu for lunch but WISH they had more eel options like sashimi or sushi. they only have a eel roll and i couldnt barely taste it. overall 4/5."}
{"text":"Oh Makimono, sometimes you're great and sometimes you're just... not. Tonight you were sub par. I'm not even sure what it actually was, but tonight everything was just tasteless. The sashimi was fresh but oh man, it was butchered. Who the heck was in the kitchen tonight? And the plate it came on had a giant chip out of it. Struck me as odd. Hard times or what? 

Ordering off the iPad is always fun. They have Appetizers, Dim Sum, Entrees, Udon, Rolls, Handrolls, Sushi, Sashimi, Asian Cuisine, and Dessert. 

Fish is fresh. Rolls are decent. The dim sum is delicious and basic if that's what you're craving. The shrimp dishes I had were tasty too. Beef sashimi was great, as were the beef rolls. 

No tuna on the menu - that always bums me out. 

And I didn't have any this time, but this place does have bomb custard buns. If anything, come for those."}
{"text":"A group of 10 of us from work visited Makimono for lunch a few Fridays ago. The concept is very similar to Spoon & Fork on The Queensway, except you're given an iPad to place your orders. TIP #1: if you plan to go with a large group, ask for more than one iPad, otherwise it will take forever.

The ambience is open and airy and it appeared to clean with the exception of sticky floors. I understand that they were busy but the server could have been more attentive. The rolls were fresh but, in my opinion, they used too much rice. TIP #2: ask for lots of wasabi ahead of time because they only give about a  1/2 teaspoon per roll order. We ordered a lot of food but the calamari, short ribs and sushi (salmon) pizza really stood out.

TIP #3: please note that they only accept cash and credit. There is, however, an ATM onsite.

I wouldn't be in such a hurry to return but I also wouldn't oppose if my colleagues suggested going back."}
{"text":"Sushi was well made, place is gorgeous inside, all the food came in a timely matter. They use the iPad system but i found that they had several options other sushi restaurants don't usually have. 

I would recommend you coming to this place if you're in the area and are craving some sushi."}
{"text":"Came here for lunch. Sushi was pretty good. Not the best I've ever had but definitely tasty. They have a bunch of different lunch specials to choose from and they are all reasonably priced. I had two rolls which came with a soup and salad. The only thing that was lacking was the service. I found it inattentive and slow. That being said, I would definitely return."}
{"text":"AWFUL!!!!!! I want to start off by saying my server phoebe was extremely unprofessional,  disrespectful and discriminatory.  I'm extremely saddened  by my experience.  Because we do live in Canada and  being racist to customers who are paying to eat at the restaurant that you work at is extremely alarming. The food was awful as well.  I've ate at a different location(Pickering) and I've never experienced this kind of service.  I definitely won't be returning,  and I'm warning any people of colour  to avoid this restaurant as you will be treated very poorly. I wish I could give this restaurant is ZERO STAR!!!!"}
{"text":"I enjoyed Makimono sushi! The sushi was good and tasted fresh. I'm such a fan of the iPad service. The customer service was alright... Curtis was GREAT! The other servers looked like they hated their job."}
{"text":"I've recently went on a binge of hitting up AYCE places in Toronto, and this was on my list of \"need to try\". It was definitely worth it!

First I'm going to talk about the ordering experience, then I'm going to get into the specific qualities of the food. Feel free to skip the bulk of the review and read the TL;DR at the bottom if you just want fast details!

------------------------
The ordering experience is unique to this AYCE restaurant in Toronto. In a nutshell, you order off of an iPad, which (presumably) submits the order to the chefs to prepare your dishes and have them delivered to the table, with the order status updating on the iPad from \"Submitted\" to \"Ordered\" once it has been acknowledged. While I haven't yet seen another place take advantage of a technology-based ordering platform, it has that cool factor, albeit with much to improve upon. For example, the iPad's \"order status\" doesn't mention \"delivered\", or give any kind of status update outside of \"ordered\" and \"submitted\". This means that you, the diner, don't know what has and hasn't been delivered, which is a huge pitfall, because then how are you supposed to know (or remember) what you still have outstanding? I'm sure the chefs know, but as the diner, you want to be informed, too!

The selection of the food itself, unfortunately, is pretty small. The pictures provided on the menu are the only things you can order, meaning that your variety is set to whatever you're able to see and scroll through. While this definitely makes sense when it comes to availability of food, it doesn't describe anything for the diner - the pictures and the name of the dish are all you get. You can create a \"cart\" and submit that \"cart\" to be \"ordered\", editing at any time before submission, but I feel as if it's a slight to the user that you don't really know what anything is (or looks like, really, since the pictures are really of the \"ideal\" product that no customer ever receives) until you receive it at your table.
--------------------------
Food reviews:

The Korean Beef Short Ribs here are some of the best I've had at any AYCE place, ever. The reason I say this is because I've had short ribs at KBBQ restaurants, and while those restaurants quality either on par or better, it should be definitely noted that this place has well-seasoned, great tasting short ribs.

The sushi/sashimi quality and variety is fairly decent. It's not Omakase, and shouldn't have that expectation, however it's also not in the realm of Kinkaku Izakaya, and shouldn't be mistaken as such. The slices were decently proportioned and consistent with what you would expect of a sushi and sashimi slice size.

The rolls were a little overburdened with rice. I feel they tried to overcompensate the lack of actual contents in the rolls by just adding more rice around it, then trying to make it look bigger from the slice of sashimi that was laid on top (see pictures for details).

The dessert selection was much better than expected. Traditionally, you only ever see the odd deep fried dish and ice cream. This place ran out of the main strawberry blackforest cake I'd wanted, but this mocha mousse was more than enough to satiate me after a hearty meal! 
-------------------------
Overall:

It was an OK price for a decent meal, but I wouldn't recommend this place to any run-of-the-mill sushi lover. It's simply not enough selection (you order off of an iPad, which submits to the main computer to deliver to you).
-------------------------
TL;DR: Hole in the wall AYCE sushi place that's worth trying out, but wouldn't frequent, as it's a little more costly than it's down-the-street neighbour with more variety."}
{"text":"DONT GO HERE! We came to this place thinking it would be as good as the one in pickering, but we got it all wrong and our night became a nightmare. Their servers are extremely rude and have no patience. They try to avoid you in every way. Their sushi was overfilled with cucumber to the point where it almost tastes like water and cant even taste the sushi flavour itself. Anything fried was horrifying, the fried chicken we ordered was so pale.. god knows how old it was and their shrimp tempura tasted like OLD oil. Dont bother coming here, take your money somewhere else."}
{"text":"I am giving this restaurant a four star right away because they had salmon SASHIMI during LUNCH hours!!!!! I love sashimi and when you are avoiding starches sashimi is the perfect alternative to sushi! They had sufficient choices, and a variety of cooked Chinese dishes like General Tao and spicy garlic shrimp. This is nice when you go with company who may not like sushi. 

The sashimi quality was good too, and the service is steady even when it is busy. Most of the stuff is comparable to all the other all you can eat places, however the salmon sashimi at lunch won me over!"}
{"text":"Though the food was good and the atmosphere was nice, the service was terrible.  Though my server the iPad was remarkable at ensuring great order accuracy, the bus boys who answered to the iPad were tremendously rude, perhaps they have become slightly feral with the iPad doing all the interactions.  Wouldn't go to dinner with my worst enemy here."}
{"text":"3.5 stars 

- Female here on business, needed quick dinner. Love sushi. 

-ordered two rolls and a seaweed salad. 
- service was friendly and quick, not similar to other negative reviews.
-Green tea was delicious 
-clean and modern 
-food was yummy, not the best sushi in the world but definitely did the trick for a quick dinner 
-would return."}
{"text":"Pretty good sushi! This place has the option for a la carter or all you can eat which is good. We tried the all you can eat so we can taste test most of it and it was all very tasty! I would come back!"}
{"text":"Makimono is a solid AYCE sushi restaurant in Pickering. 
The atmosphere is great, the service is prompt and it's not too busy on weekday afternoons. They offer the standard AYCE menu, but what sets them apart is their vegetarian options.  They have a great Mango Roll, Yam, Tempura Roll and a couple of other great options.

They get pretty busy on weekends."}
{"text":"My best friend I visited this place with our babies and upon arriving it was so difficult to take our strollers in. There was a step to get in and had to carry strollers in. There was also no option to automatically open the door. We told the lady we were unhappy and no apology was given. 
So we ordered the dynamite roles, veggie pad Thai and shrimp tempura. Food literally came after 5 minutes. so we know it definitely wasn't fresh. Dynamite rolls were pretty good, shrimp tempura tasted good however wasn't freshly fried and the veggie pad Thai had only small pieces of celery and 1 piece of broccoli. That night we both started experienced stomach cramps and felt nauseous. We are definitely not returning back to this place."}
{"text":"My wife and I have come here many times.  Each time the food quality is great, place is clean and the staff are fast.  The salmon sashimi and coconut shrimp are my favourite items.  The rolls are also always a win, especially the dragon roll!  It gets really busy on Friday and Saturday evenings which sometimes lead to them missing a couple of items you ordered.  This is not really a big deal because you can order it again and all of the benefits of this location outweigh that minor negative.  Definitely a top sushi place for Durham."}
{"text":"Love this place! ESP since you can order through the iPad. Convenient ! Food is good and at the right price. Best part is they don't rush u out like most places do. Buffet or a la cart available."}
{"text":"iPad ordering system is efficient. Fish quality (taste, texture) poor compared to a handful of nearby sushi restaurants. Cooked food quality (taste, texture) also poor. There was a single strand of hair inside my green tea ice cream, but I think that's from their supplier because the strand was deep inside the ice cream."}
{"text":"When I was staying at the nearby International Plaza Hotel, wanted something different..and had a craving for asian food

So, I took a walk and stumbled upon this place

It seems pretty large, more of a chinese feel than a japanese feel

Anyway, I ordered a large Kirin beer and the Tonkatsu dinner

It came with rice, salad, miso soup, plus of course the deep fried pork cutlet

It was pretty tasty, but not a stand out 

The waitress suddenly dropped by, and asked for payment..since they were closing soon. I handed her my debit card, but was told they only took cash or credit. But, they did have an atm machine in the lobby

So, I quickly finished my meal, and paid up..

Overall, I felt rushed..and the food wasn't that great"}
{"text":"Makimono actually surprised me. Environment of the restaurant is really good with a nice atmosphere from their design of the restaurant. There is also a variety of selection from their menu. I didn't think I'll like the restaurant going into it but the taste was actually pretty good. The raw fish to rice proportion is nicely done. The rice is not overly big compared to the fish."}
{"text":"I haven't been frequenting this location as much in recent past but came out to meet a friend for dinner last night. I've been favoring Tatemono, since its very close to my new digs and its also got a much wider variety on the menu.

I was surprised to see that Makimono has updated their menu as well! Unfortunately they took one of my very favourites, the cheese wontons, off their list of offerings, replacing it with crab cheese wontons (which for someone who's allergic to crab, isn't a good option - very sad about it!). But they've added a whole whack of stuff and we tried some new stuff along with our old favourites.

The lemon chicken and the sweet and sour chicken balls are identical, just served with different sauces. I have to say the deep fried stuff at THIS location wasn't very good. Not much meat and mostly breading - disappointing but still tasty since I love deep fried anything. We tried a golden california roll which is a deep fried california roll with some spicy sauce and while I quite liked it, my friend didn't really like the addition of deep fried to her favourite roll. 

They've also updated their dessert menu, which has a few cakes on it now. They have a cheesecake, that was good but had a sponge cake base which was odd for me, a strawberry layer cake which was very tasty and a black forest cake that really didn't taste anything like black forest cake. Even though the desserts weren't spectacular, it was nice to have some new options and the portions are small enough you can order a few and try everything.

Having all but written Makimono off in favor of Tatemono, I'll be back but it still won't be my favourite sushi joint in the area."}
{"text":"We order from here every week the past few years. It is our go to sushi place in our area because it has decent variety, good quality and price. Plus, they deliver! We don't go into the restaurant itself much anymore because we just end up eating too much. We usually get the salmon lovers sashimi, dynamite, black dragon and red dragon rolls."}
{"text":"Great sushi, sashimi and beef!! Come here every time I'm in the mood to have all you can eat Japanese food. Great service and not bad prices plus I'm always leaving feeling too full. Great place and recommend this to anyone wanting to eat a lot. Has been renovated a lot and looks very modern now and you use iPads now to order your food which is quite unique in this town."}
{"text":"Great spot! While on our way to Pickering Town Centre we came across this sushi place. We dined during a weekday lunch where they offered AYCE for $16.99/adult.

We were seated right away to a comfortable table. Tables have white paper on them, I'm assuming for easy cleanup. Think Jack Astors minus the crayons. 

You get your own iPad to order with. I love this method, as you get a clear indication of the portions- kinda.

We definitely ordered too much. The maki rolls here are HUUUUUUUGE. Unfortunately they come with 6, not 3 like Tenichi. Better make sure you only order what you really want, because we had a hard time trying to finish all of them.

One thing to note was they offered sashimi during lunch which was great. Not much variety, but it's good if you don't want to eat all the rice.

Other than that, tempura and teppanyaki plates were great! Really enjoyed the salmon teriyaki. There an extensive menu which offers thai, Chinese, and both udon soup or fried udon. 

Would like to see if there are other items during their dinner service!"}
{"text":"Good service! I love the ambience. They use iPad to take the order, it's good and fast service. Servers are polite and friendly! We'll come back again for sure."}
{"text":"Came here on a Friday night for dinner and made reservations for 7pm, we were immediately seated. Other people that were ahead of us- shouldn't have been upset with us. We made reservations ahead of time and our table was ready for us when we got there. TIP: DO make reservations, saves you from waiting on the side for a long time! 

For some reason, there was only one host at the front on a Friday night. That is very odd to me seeing it's the beginning of the weekend and there should be two or three. While the girl was bringing people to their tables, there was no one at the front to keep the line moving. 

The whole place was packed and we counted three servers. We understand that it was busy but they were SUPER short on staff. Our food took forever to come to our tables, we were going to order drinks and the lady walked away after 5 seconds before taking our drinks... Food would come out without the sauce or so slowly. Server said she will bring us the sauce and never did. Another server said he would bring us ginger, never did. It was just super frustrating. 

Our food order was so slow. We did like 5 rounds on the IPAD after waiting and waiting for our food. 20 mins would pass and we would look around to see if our food was coming since it was crossed off on the order details. After 2 hours of non-consistent service, food came 5 minutes before we decided to order our dessert. 

There are many reasons why I would not come back to this location. 

1.) They were short staffed and unorganized - with a huge line up at the front, someone could have cleaned the 8 tables beside us and sat people down. We timed it from the moment the large family left. It was about 23 minutes before someone decided to clean the table and sit 3 groups down.  

2.) The food came too slowly - I swear we should have ordered everything the moment we sat down. --___--

3.) With what we were paying, 29 per person, we were simply receiving the worst experience ever, food quality was par, there was simply no good thing to say about this location. It was not worth what we have paid for. The location in Woodbridge can demolish this place, save yourself the headache and drive to Woodbridge for Makimono! 

4.) Parking was a headache. Too crowded, so packed, just not worth it."}
{"text":"We have gone here many times and the food and service has always be consistent. The quality and speed of service are good. Since it was renovated, things seem busier not no impact to service and quality.

A good place for a sushi buffet fix any time. There are better Sushi places, in the metro area but at a price, so a good deal all around."}
{"text":"This location is a headache. Decided to try this location out and it was a pain getting parking, Saturday evening at 7pm. The parking lot infront of the restaurant is a one way! Be careful you don't get trapped. Eventually found parking across the street. The place is nice, and the floor is kinda slippery. I was wearing Jordan 13s and they kept slipping. Feels like a layer of wax on the floor. 

NOW LETS GET TO THE FOOD!!! Hold up, I wasn't even hungry after waiting 15, 20, 30 minute intervals for our food! At one point there was only 1 server by herself serving, and cleaning. I get it it short staffed, busy night there going to be behind. It was honestly the most ridiculous embarrassment of a restaurant that I've been to. Everything took way to long to get our food. 

Once we got it, it tasted okay but you can tell it's been sitting, they were so busy that the shrimp tempura never came after the 3rd time we ordered and the combined all 3 orders together lol. Even ice cream took over 10 Mins. The sashimi was warm, pretty disgusting, and the ginger... the side dish tasted like dirt, like they pickled it without washing the ginger. Oh man what a night. Our friends found this place hysterical also. 

Never coming back. Probably go to Susuhi Ya Japan across the streeet instead."}
{"text":"Not good - the rice for the sushi was bland and unflavored- the service staff was not friendly - the quality of the food was not good - will not be going back again - what a waste of money"}
{"text":"We came here for take out. We ordered the $29.99 party tray. The service was prompt and friendly. They don't take debit, but they do have an on-site ATM and a TD across the parking lot. Cash take-out has a 10% discount. The food was good. Not bad for the area. Our party tray was good, but the tuna we got, although edible (and by no means stale), could have been a bit fresher. Maybe we just got a bad cut. Other than that the food and the service was enjoyable. Perhaps we will return to try their AYCE menu."}
{"text":"Love the lunch special under $10 for 3 rolls. Soup and salad. Best place in pickering!!"}
{"text":"I recently moved to Pickering and my family loves sushi, so we decided to give this a try. We came for lunch, and absolutely hated it. We waited for approximately 20 minutes before any server came up to us and get us a table. Several servers walked pass us, made eye contact, and ignored us when we walked in. This already put us in a bad mood because it felt like they did not want to serve us. 

When we tried to call for a waiter to ask for some napkins or cold water, they would ignore me again. The wait times for the food you order through the iPad is around 20-30 minutes, which is a bummer. The waitress was also hurrying us to eat, and when she assumed that we were done eating, she just handed us the receipt even though we didn't ask for it yet. 

The food was alright, I really enjoyed the spider sushi roll. However, the customer service was awful.

Although my first experience was bad, I decided to give this place another time with my boyfriend. The same thing happened to us. The workers ignored us so many times even though they made eye contacts with us. I know hate is a strong word, but I hate this place. The environment itself is so negative that I can't even enjoy my food. 

Would definitely not recommend this place to anyone!"}
{"text":"Definitely one of my favourite AYCE sushi places! 

Pros: 
- Friendly staff who are attentive and fast 
- iPad ordering 
- Good portions
- Food is amazing
- Dining area is clean 

Cons: 
- After a certain time, you can't order (so don't go late)
- Washrooms are DIRTY!
- Pretty pricey 

Overall, I would come back, you can't go wrong with an AYCE sushi place, especially when it's near by, has good service and food!"}
{"text":"This is ONLY a review of the restaurant from a drink perspective, as we didn't end up ordering food. I've been to this area several times over the last couple years as I've been going to Anime North for 6 years now, but this restaurant is always packed during the con so I've never been able to stop by. Honestly, I can see it's appeal during the convention as it's close, and it's sushi (and people love their sushi during Anime North!) but the service is slow, despite the restaurant being relatively empty, and the workers weren't exactly friendly. I'd come back during the convention, but honestly based on the other reviews, it's not surprising that their food is subpar and other people have had problems with the service."}
{"text":"Very iffy service 
We enjoyed our first time there so much we brought friends on our next visit. 
Totally disappointed and embarrassed!
Each dish was served with a 5 to ten minute wait between.
Green tea...a cup and a bag !!
When I expressed my displeasure in a polite manner I was met with a shrug."}
{"text":"This place is great. All the food was good for the most part. We ordered a series of courses and tons of sushi. The shrimp tempura was excellent. Most of the rolls we had were great. There a couple of things that lacked in quality to me. It was the sashimi, the salmon was not as fresh as I would have liked. The teriyaki salmon was bland and without the teriyaki sauce I wouldn't have been able to eat it. The beef was good, the seaweed salad was good. The seafood fried rice was good but the scallops are definitely imitation, we could have done without the pink swirl design on it. Otherwise, everything was great. Oh yeah, a tall can of Sapporo is $9.50. Overall, for the amount of food you get, it is a value compared to the price."}
{"text":"I liked the little Japanese restaurant that was here before Makimono. Selection was average but price was not! Weekend dinner price was $35 per person. They also advertise squid sashimi on the menu but did not have in stock.. nothing to write home about..."}
{"text":"I've driven past this location so many times but finally in effort to satisfy my Japanese craving I decided to check this spot out.

Upon entering the hostess kindly greets us and escorts us to a spacious table towards the back of the restaurant beside a wall of what resembles giant chopsticks. It's very modern and streamlined looking restaurant and I love that the table is situated along a cozy banquet.

The waitress places the menu on the table and I notice she only gives us the AYCE menu. I kindly ask her for the a la carte menu because I prefer getting a Bento Box and she returns with one. ***Make sure you ask for the a la carte option if you don't want the AYCE because I think they just assume everyone is here for that***

To drink I order a green tea which comes out it a cute plastic Asian designed pot.
I like that they give me my own pot of tea so I don't have to keep asking for refills.

After grazing the menu I settle on the Bento Box D option which includes:
-miso soup
-salad
-2 pcs shrimp tempura
-5 pcs vegetable tempura
-1 pcs tuna sashimi
-2 pcs salmon sushi
-3 pcs California roll
-3 pcs gyoza
-rice
-Choice of teriyaki salmon, chicken or beef 

Love the salad, its served ice cold with that delicious sweet and tangy dressing and the miso soup comes out piping hot and perfect.
The sushi and sashimi comes out on a separate plate and is all fresh tasting and nicely portioned.
Next comes out the Bento box which is beautifully presented in a large bento box.
The tempura and gyoza are perfectly cooked, very crispy and golden brown.
For the teriyaki I go with the beef option and it's cooked a nice medium in a delicious glaze. However I did find the cut of the beef to be quite tough. It would have been a flawless meal had the beef they chose been of better quality. Perhaps next time I'll try the teriyaki chicken or salmon.

Overall service was really good and attentive, food came out fresh and fast. I would definitely return to try out there other Bentos. The portions here are huge so don't feel obligated to go AYCE ask for the a la carte menu and then decide which route you want go with."}
