{"text":"Outstanding! If you enjoy Thai, you MUST go!  Makong is the best Thai food I have found in Charlotte. The staff was extremely friendly and the service was outstanding, but most importantly the authentic food was extremely flavorful and of top quality. After one visit, I trust that anything the chef makes will be outstanding. Do not miss out on the sticky rice for dessert which comes from the owner's family recipe. North Charlotte has landed a culinary goldmine.  The experience: In speaking with our server, I discovered that the restaurant opened only 5 days prior and is owned by her sister who is following in their father's footsteps with a small, family owned business using their family's traditional recipes.  For dinner we enjoyed the freshly made Po Pia Sod (fresh spring rolls) for an appetizer. The mark of freshness was that the, usually served cold or room temperature, rolls had a little warmth in the middle from the freshly cooked shrimp.  I always test a new Thai restaurant by the Pad Thai and Makong nailed the dish with exquisite seasoning and perfectly textured rice noodles that were still flat, but just a touch thinner than most restaurants which allowed more sauce to be sopped up with each bite - and you will want every bit.  We also order a dish we had never tried elsewhere, Pad Morakot (Peanut Curry) and I can not speak well enough of the dish. The plating was beautiful with fresh spinach on the bottom, curried chicken in the middle, and fresh broccoli around the edge.  In general, this type of dish must be made fresh and delivered to the table promptly to keep the spinach from wilting and Makong delivered it with perfection. The dish was spicy (as ordered to taste) and deliciously, richly sweet. The long grain rice was a great way to scoop every last drop of the curry after shoveling down the scrumptious chicken, spinach, and broccoli.    Finally, in my book, the most important thing I discovered - the mango and sticky rice. You MUST get it here. Sticky rice is one of my favorite desserts and if you have never had it, you really should try it somewhere, even if not at Makong... but if you want the best sticky rice you will possibly ever have - get it at Makong.   The sticky rice was perfectly sweet and gummy; texturally superb. The chef does not rely on soaking the rice with coconut milk, but instead, somehow subtly and perfectly blends coconut milk into the rice. I wish I knew their family recipe, but I also know how much time and love goes into sticky rice so I will let them keep the recipe so long as they continue to make it for me. This recipe capitalized on the starchy, sweetness of this traditional dessert in a way that I can only imagine will wake me up in the night with dreams of this sensational treat.   Thank you Makong was bringing a much needed culinary treat to North Charlotte."}
{"text":"Julia S and I did the Russian roulette with my Citypass coupon book. We agreed on Thai and lo and behold, Makong magically appeared. I have never even heard of it. Not a peep.  Ten minutes away off of WT Harris and Statesville Rd. Jump in my ride and we were on our merry way.   Walk into a clean, modern restaurant, friendly service. Hot tea, spicy ass drunken noodles, ***** five star thai hot made our head's spin. Green curry with fried tofu.  It was a pleasant surprise when restaurants really make it spicy. Yay, very happy on my first date with Makong."}
{"text":"Ah yes, they like the spicy. Me too. We can be friends.  The only thing that set any alarms off for me were carrots - which were everywhere - in large chunks. Soup? Mostly carrot. Curry? Large, faceted pieces floating around like glaciers in an otherwise near-perfect pool of coconut milk and possibly-homemade curry paste (no, I didn't ask - I'll just live in my illusion, kthx).  Lunch here is a friggin' steal. Must be the proximity to the La-Z-Boy store keeping the overhead low. I don't know who frequents this place being as weirdly located as it is but to you, anonymous eater - consider yourself lucky to have semi-trad Thai in your desolate, strip-mall-bedecked 'Hood.  Be emphatic if you crave super-hot. They're a little light-handed with the bird's eyes."}
