{"text":"these guys seemed solid. i had the club sandwich with spinach salad. my friends ordered the steak sandwich and chicken fingers + fries. everything was decent enough.

they had a surprisingly large selection of beers on tap. it got pretty crowded from noon to 1pm - if you are going at that point, definitely make reservations."}
{"text":"Aah, Malcolm's. I'm pretty sure there's not a single person currently working in downtown Calgary that has not ended up at Malcolm's for a beer at some point in their career. With its tacky decor, scantly clad waitresses, and cheap booze and bar food, it's a no-brainer. They also have a decent patio with all glass walls to keep out the din of traffic racing by, so it's even more popular in the summer months. 
Malcolm's has daily happy hour discounts, although the last time I went they were only offering draught beer at 25 cents off - big whoop. 
This place really caters to big crowds of post-work drinkers who may also be hungry, so there are several multi-person appetizer platters on the menu. The size of these platters is unreal - the mound of nachos blocked my view across the table! They offer variety, too - there are fresh veggie platters, nachos, and snack platters filled with wings, egg rolls, potato skins...you name it. 
Another cool thing about Malcolm's is that they have a separate counter in the concourse outside called \"Malcolm's on the Go\", which offers pre-made salads, sandwiches and other portable lunch menu items for the hurried office crowd at lunch."}
{"text":"I'm a fan . . . 

For a business lunch, this place is great. Our server was friendly, offered great suggestions when asked, and the food was quick and tasty. I had the Pecan Salad which was terrific. This appears to be the place to be for a business lunch in downtown Calgary."}
{"text":"All the other reviewers are right about the decor in good ol' Malcolms, its feels like it was last styled at the time of the Calgary Olympics.  The dining room is a large room where seating is almost cafeteria style with a menu that hasn't changed for what looks like a long time.  I ordered the Lunch special which was a beef stroganoff and was promptly informed that they were out of.  This was interesting as we arrived before the lunch rush. I ordered the Kona Burger (hawaiian style with pineapple and teriyaki) and my dining companion ordered the cobb salad.  Service was good albeit a bit disjointed as the food coming out of the kitchen was going to the wrong tables but after we got our meals, the taste was pretty good.  Our total bill was $31 and the waitresses definitely accentuate their assets, which could certainly be viewed as a value add. 

Malcolms won't change your world but it provides a decent, diner style sit down alternative to the food court options in the +15."}
{"text":"Disappointing ... gets worse every time I go and judging from the empty tables at lunch I assume most people are avoiding this sad old pub."}
{"text":"Went here for lunch a few times when I worked nearby. I'll break it down into pros and cons, because the place is pretty bland and made for everybody. And in execution, that usually only appeals to certain people.

Pros:
-Cheap (for the core) food
-Traditional sandwiches and diner grub
-Decent tasting
-Decent patio
-Decent service

The decor reminds me of nothing less than a red lobster circa 1970. It's not bad, it's just not... good either. I always felt like I was walking onto a TV set for some old TV show.

Cons:
-Packed (at lunch)
-Traditional sandwiches and diner grub
-Service can be kind of slow
-Patio is facing office buildings and a busy road
-It... smells a little. This might just be me being a little over sensitive.

If you looked up \"OK\" in the dictionary, there would be a picture of Malcolm's beside it."}
{"text":"I have only been here over the lunch hour, when I am invited by colleagues or friends.  Some people seem to really like it here, I am not one of those people.  The food is bland and boring, I am pretty sure that I would be better off cooking on my own.  However, I will give them credit for carrying local beer (Wild Rose).  One good reason to go for an after work drink."}
