{"text":"Last year I spent sometime in Connecticut and fell in love with steamed burgers ( you've seen them on Diners Drive Inns and Dives, Man vs Food and Burgerland)   I heard they now serve them at Malone's so I went to check it out. 
They do and it was AWESOME.  So much gooey cheese, I love them.  They where juicy and full of flavor.  The texture is great and the big mound of cheese is just fantastic.  The meat was perfectly seasoned.   The bun had a great texture and they service was excellent (I sat at the bar)
The place has a great drinking vibe to it and I was blown away at how affordable it was.  I'm told they are big into live music and I found the owners to be very nice and engaged. 
The burgers are going to be a regular part of my diet and i look forward to coming here for a night out as well.   I strongly recommend this place."}
{"text":"This is one of my favorite local spots! Great bands, food and very clean. Several local taps and a wide variety of drink specials. Always friendly service. To touch on a previous comment by Jason, I totally disagree and think you must have been way cooler in college. Sorry but I take offense to your name calling im a regular there."}
{"text":"\"Madison Park Pub with Rock music on the Jukebox, Pool Tables and plenty of space. (Saturday night live band!) Delicious offering of craft beer and sandwich/grill menu plus daily drink & food specials. Friendly staff and mixed local crowd from age 21 to 60. My sandwich was fresh and tasty despite the late hour.. I'm going back soon."}
{"text":"I mean this in the nicest way possible, this is a redneck, shit kicking bar. Which is fine if you're into that kind of thing. I'm sure I would have spent time here in my college days. They do have really cheap beer specials as well as several local brews.There will no doubt be some loud drunks hanging around and possibly a band that is to loud. With so many great bars in South Charlotte I can't imagine why you would go here, but I guess it fills a niche market. I don't mean to offend anyone (if you like this place), it's just not my style. Cheers!"}
{"text":"Pretty sure this place is CLOSED FOR BUSINESS. I've not seen it open in quite some time."}
{"text":"Well.  Based on the great reviews I walked a mile over here from my hotel.  And it was a whole lot of CLOSED.  Sunday night at 8:20.  Not sure what the deal is.  So.  Be warned!!"}
{"text":"First time customer. I was excited to see Full Service and try out a new bar. I stood at the bar for 15 minutes of which several times no other customers were at the bar and was ignored. There were two points where the bartender leaned against the back wall and stared at me with my credit card in hand."}
