{"text":"Garlic balls and chicken Marsala.     Great food!  Pizzas are good and the prices are cheap."}
{"text":"We all loved this place.  Everything was very good! The portions are huge too.   As in other reviews the garlic knots were amazing.  The stuffed pepper appetizer was the best he ever had, according to my husband.  My youngest loved the pizza.  Their sauce has an excellent flavor.  I highly recommend this place!"}
{"text":"Pizza is pretty good but disappointingly small and pricey for the size. Forget dining there on Friday night. Place is small and you'll wait a long time to be seated."}
{"text":"Great people and great food. I called on a Sunday afternoon for take out and they were closed but offered to make it for me anyways. So awesome."}
{"text":"Not sure what the draw is for this place. Massive amounts of food, sure, but none of it tasty or satisfying. Easily the blandest marinara I've ever tasted, like chunks of unsalted canned tomatoes, basically. Even the calamari was flavorless, as if it was coated in completely unseasoned flour (served with the bland marinara, btw.) We will not be back."}
{"text":"They give you sooo much food.  And the food is unreal, especially for the reasonable cost.  Highly recommend this place!"}
{"text":"Ok, the food is good..nothing spectacular, the sauce is a bit bland,  but they do give HUGE portions of food.  Except for the free garlic balls, which are hit or miss...when they're not overcooked or outright burned, they're pretty good.  The problem is they're almost always at least overcooked and often times burned. The hostess-the wife of the owner-is a rude, condescending, nasty person.  She has never been nice, but one instance takes the cake, and we won't be back.  My elderly mother has to use a walker to get around.  Walking is hard enough, but getting up and down from a sitting position is extremely difficult for her.  We arrived one afternoon and I explained this situation to the Queen B, asking for a little understanding and for her to let us be seated, even though my daughter was meeting us and was a few minutes behind.  Their policy is to not seat your party until everyone arrives, and I totally understand that.  That is what she told me, so we sat down in the waiting area until my daughter arrived, even though only 2 of their tables were occupied.  However...on a visit a few months later (we used to go there OFTEN), I was waiting to pay my bill when a man, I'd say in this thirties and relatively nice looking, came in.  He told the Queen B that he was meeting his brother.  She told him their policy about seating...and he said \"Oh come on, he'll be here shortly and I'll have a beer while i'm waiting\".  To my surprise, THAT was a good enough reason for her to violate her own policy, but my mother's situation was not! She must've thought she had a shot with this much younger man-ha!"}
{"text":"I used to come here many times in past years, but we hadn't been back for some time.  The food used to be really generous and more than enough for the prices.  Also, the quality was very good.  My wife and I just went there this past weekend, and were were shocked at how small the portions were and how the quality of food had gone down hill.  I remember a dinner salad that was really generous, and now it is just a small thing that really disappoints.  The Wedding Soup was to die for previously and came in this monstrous bowl.  My wife and I used to be able to split it and still have some left over.  Now, the \"bowl\" of soup comes in a large coffee cup with three really small meatballs and hardly any noodles.... and where is the taste?  It tasted like warm water.  Lastly, we ordered a side of clams.... these had to be the smallest clams I have seen in my life.  They were less than 1\" and they were not steamed,more like boiled (with no taste left).  The garlic knots... this used to be awesome.... well, the bread we received was burnt on the bottom.  Don't serve bread that is burnt on the bottom. Throw it out and make some that is done properly.  The coffee... seriously, this was really watered down.  Absolutely no taste.  Come on gang, how can you mess up coffee?  We were really disappointed as this used to be the place to go after church on a Saturday evening.  In fact, we were worried that there would be a long wait.  Not anymore... we were seated right away... that should tell you something right there.  I hope the owners read this and pull the place out of the gutter as I would hate to see this place disappear as it used to have really good food at one time."}
{"text":"I just love this place. And have I told you how much I love their eggplant parmesan?! I truly appreciate that they leave it unbreaded, so you can truly enjoy the flavor without all the over abundance of breading. Monday is half price pizza night, yum!! And this is what keeps me coming back time after time after time."}
{"text":"I love Mama Robertos!!! The food is amazing!!! I have always had amazing service even when they are busy."}
{"text":"We went on New Year's Eve night.  I just got off work where I'm also a server and this place wasn't busy at all.  After a week at s busy restaurant it  was nice to have a meal with some friends and we had a great time.  The food was amazing, only thing I can say is maybe a kids meal option?  Service was excellent!"}
{"text":"My favorite local \"go to\" for dining or carry out Italian food.  The chefs are creative and perfect special requests.   Portions are very generous...always providing for lunch the next day. The eggplant appetizer and a side salad are a \"comfort food\" dinner favorite, yet lower carb. I appreciate the freshness of the eggplant- no breading and heavy oil.  Their eggplant is the healthiest that I've ever found in an Italian restaurant.  Most places weigh it down with batter, crumbs and oil.   The pesto torteloni with chicken is delicious.  Their sauce is delicious-slightly sweet and chunky.  Dessert?!  Mama's Cannelloni is Cleveland's best!  The staff always makes you feel welcome and like family.  I love Mama's!"}
{"text":"This will be an unusual review.  I haven't written one like it.  This has to do with the all you can eat fish places that we go to with regularity - Mentor Family Restaurant, Lakeshore Eatery, Mama Roberto's and Manhattan Deli.    The fish tastes great at all of these places and the price is not unreasonable.  All give a good portion on the first plate.  It's thereafter that we have an issue.  One piece every 20 minutes - some a little better, some a little worse.  Those that ask how many you want, take longer.    The management and owners need to take some things into consideration.  For our family, one person gets AYCE and the rest of us order from the menu.  That means 1-4 profit makers in our party of up to five.  We also come in at other times and spend money.    The slow down only serves to make our fish eater stubborn and he isn't afraid to tell the wait staff what he wants, especially when he isn't getting it.  I'm sure the wait staff hate AYCE fish.  Tonight we had a different tactic to the slow down.  They ran out of fish. I have very rarely been at a place that runs out of anything.  I am sure we are not the only ones disappointed in this situation.  Again, I ask that management take some time to rethink how we can make everyone happy.  Copying this to the other restaurants listed.  Don't think I am singling out any one place.  Now I am going in search of other places that do AYCE and hoping for the best."}
{"text":"The calzones are amazing. Many different combinations to choose from when ordering one. The salad is just ok. The rolls are great. We don't go there often but when we do it's for the calzones. Regarding the decor, it's what you would expect. It's also clean. The Rock Hall/Cleveland music artwork on the walls is neat and I have never seen it anywhere else."}
{"text":"Huge portions - HUGE - do the plate sharing with the $2 charge...trust me.   The chicken Marsala and the chicken alfredo were both delicious - the garlic knots good but had sesame seeds on them - that was a little odd...  Service was very attentive and kind.   We took dessert to go - a little pricey at $5 a cannoli but sweet lord were they huge and yummy - oh and filled I'm like 99% sure at time of order.   Would most definitely go back AND recom"}
{"text":"A Mentor institution! I eat here on a pretty regular basis - try the Baked Penns Florentine, trust me. The servers are all great ladies who recognize the regulars and always have a smile. The only problem my friends and I ever had was witnessing one server who made a scene and quit right in the dining room because of the owner's wife. And that was once out of MAAAANY years of visits.  Service is fast and the portions are HUGE. I mean seriously. Love the garlic bread knots they give you, though the quality of them has gone down recently - they're dryer and harder now. Aside from that, their pizza sauce is zesty... their carbonara is creamy and rich... and their canoli is sweet and delicious. And the best part is that the prices are low! Definitely worth a visit!"}
{"text":"Our fav to place when out and about in Mentor. Always consistent and nice portions as well.  Only complaint is they must have changed bacon the use it use to seem made then chopped up now it taste like that bagged crumbled stuff"}
{"text":"I was able to experience true deliciousness at this restaurant. The bread knots are delicious, enjoyed the salad &  homemade Italian dressing, and the calzones are packed full of flavor & ingredients. The sauce is so good & tastes fresh. I definitely will make special trips to visit this restaurant, since it's a 35 minute drive from my house. I will also tell my friends about this place. Great place and the staff are helpful, friendly and attentive."}
{"text":"Tonight was disappointing. Olio e aglio was a 2 dollar up charge. When we questioned this as we had never been charged before the waitress basically called my wife a liar. My wife's salad came with Italian dressing that was pure vinegar."}
{"text":"What happened to my favorite place to eat. It still has the table bread. But the lady at the front was really uptight. I do not know if she is the owner. But she needs to stay home if she is. The waitress was really nice. Wine was ok.  Needs to feature some ones from our local wineries maybe?  The salad was old.  My sauce was really sweet this time.  I do not know what is going on there. But I hope they go back to the old mama roberto's cooking."}
{"text":"Hot bread great portions good service.i would recomend vreal parmesian.huge portion srved salad and side spaghetti Could only eat half of my sething   Very clean nice place to enjoy old time music."}
{"text":"We ate here in September 2014 for a late lunch on a Sunday.  We were greeted and seated in a timely manner. I ordered the Lasagna and it was huge. The meal came with salad and garlic bread. The Lasagna was delicious.  My guy had the Chicken Marsala and he said it was very good.  We took half our meal home and the price is good for the portions."}
{"text":"Wow, I was very impressed.  I've passed this place many times while shopping nearby.  I purchased a gift certificate thru Amazon Local and decided to give this place a try.   This rating is probably closer to 4.5 stars.  I was greeted immediately, and seated on a Saturday evening.   I proceeded to review the menu and decided to try the Fried Cheese as an appetizer and the Shrimp Aglio for my entree.  I was immediately presented with a basket of warm clustered garlic rolls (they were delicous!).  The house salad (included with the entree), arrived within a few minutes and it was GOOD, fresh iceberg lettuce, topped with cherry tomato and loads of fresh mozarrella with a side of their delicious house dressing.   I ate every bit.  The fried cheese arrived, 5 large planks of fresh mozzarella, nicely battered and fried with a side of homemade marinara.  The marinara was filled with chunky tomatoes and had a very nice flavor, just a little bit sweet, just like I like it!   The entree.....where do I begin!!!!    The server brought out a huge bowl of linguine, topped with fresh basil, loads of freshly topped tomato and an ample portion of perfectly cooked shrimp.  I also received a side of freshly grated parmesan without having to request it.   The pasta was piping hot, flavorful and the portion was HUGE.   Everything about this meal was great, the food, service and atmosphere.   I would definitely return!"}
{"text":"Probably the best pizza in Lake County , owner takes major pride in his work, and his staff (mostly family) are great."}
{"text":"Gross Italian food, I would avoid it at all costs. Way better options for Italian in mentor."}
{"text":"Someone call Ramsey. Bland, pasta tastes like pasta water . Big portions of garbage. No flavor in sauces. Really a very disappointing experience as so many people rave about this place. The only decent item are the garlic balls but those were still a bit burnt."}
{"text":"When I say, \"bring your appetite\" what I really mean is bring the appetite of 4-5 people if you come here.   Oh yes, you get that much food. I'm not even sure who could possibly eat 3lbs of pasta in one sitting, but these portions will feed you for days (or a small army.)   This little, hidden gem in Mentor is not a restaurant you'd think was anything special from the looks of the outside. Located in a strip mall, you walk in and this small, family owned restaurant is always (and I mean always) packed. People come for the homemade, family-style, delicious food and, of course, the portions. On a typical night, you'll see just as many people grabbing take out and you will packed into the dinning room.   The kitchen is open and you can see the owners and their children running around, helping their guests. Their walls are covered in caricature drawings of them and at least 20 different \"best of\" awards for their food. The ambiance itself is very casual, and very \"mom 'n pop\". You know, plastic menus, cheesy Italian decor, etc.   Back to the food! This is NOT your gourmet, expensive Italian restaurant. My guess is you'd be better off going somewhere in Little Italy if that's what you're seeking. What Mama Roberto's offers is that handmade, home style Italian food that you'd expect someone's Grandma to make. The side salads are nothing to write home about (read: iceburg mix, tons of cheese, store bought dressing), but everything else is awesome. They're known for their garlic knots, and let me tell you, they're addictive. My favorite is the homemade sauce and their meatballs. The marinara is a little sweeter and chunkier than I normally like, but there's just something about it that makes is divine. The meatballs are made fresh, as well, with tons of parmesan cheese. *Drool* I'd also give their wedding soup a try, just know that you'll most likely need the extra room in your stomach to eat the rest of the feast coming your way.   One pet peeve I have with Mama's is their inability to properly turn tables on busy nights. They get swamped with people and let the tables linger for hours, instead of politely giving them subtle hints to scram. I was so hungry that I seriously considered asking a table to leave, lol. And they don't take reservations. (sadface)  Either way, if you're looking for home-cooked, casual, Italian eats without the high price-tag, this is the place. Just make sure you fast for 4 days ahead of time... or just clear a huge space in your fridge for your leftovers."}
{"text":"Went for a Sunday dinner around 3:00 pm. I ordered the Tour of Italy and she ordered the Meat Ravioli. The lasagna was old and microwaved. The ravioli was not fresh either. Service was good and the salad, pasta, and cutlet were good. The breaded calamari was fresh but on the bland side. Total bill (no alcohol) was $46 plus tip."}
{"text":"Contrary to fair hiring laws, this restaurant will not hire male servers, per the owner. Although I do enjoy the food, I will no longer frequent this establishment and think most others who feel as I, should do the same!"}
{"text":"I had the stuffed shells and my wife ordered the lasagna. We both loved their sauce! Wow. My one regret was loading up on too much bread. Roll out..."}
{"text":"Decent American Italian food with a sh#t ton of cheese on everything. 3 dollar sharing charge, kind of pissed me off. I mean who does that. Garlic rolls were amazing. Salad had so much cheese was average.   Chicken parmesan was  so big we split it and still took  some home. Sauce was a bit sweet but decent, the pasta was uninspiring.Service was efficient."}
{"text":"This place is pretty good the service is super friendly.  It is never really that busy so anytime is a good time to go.  I must warn you though you better be starving when you go cause the portions are ridiculously huge.  This place is also very reasonably priced I went with my girlfriend it cost me 28 for the meals and 7 for a tip only costing me 35."}
{"text":"I heard Mama Roberto's use to be really really good back in the day, but now it's more mediocre-ish.  The inside looked like your average joe pizza joint with checkeredd table cloths and random stuff all over the walls.    My food came out pretty greasy, a little too greasy actually. I'm not too much of a complainer so i sucked it up and ate it anyway.  Don't be too concerned about the prices because the portions are HUGEEE.  Their sauce here? no jaw dropper really.  The pizza on the other hand though is actually pretty damn good lol.    All in all .. Mediocre service, mediocre food, and great pizza.  Nothing's really super fresh, made from scratch type of ordeal. Its kind of a prepared pre hand, deep fry, and serve type place."}
{"text":"We use to order in from here as a child. Now that I'm back in the area we made it a point to stop by after a yoga class next door and grab a late dinner.   Affordable, cozy, and plenty of food.  I just love their calzones"}
{"text":"I'd trade a huge portion for higher quality food any day.  I was dragged against my will to Mama Roberto's for Sunday dinner with my family. If you're looking for good Italian food in Mentor, you'd be better off going to the Olive Garden, honestly. And that ain't saying much.   Yes, my side salad was good. Yes, the greasy garlic balls that are complimentary were good. But my entree? It was huge...but it was almost inedible. I got pasta with spinach, the biggest mushrooms I've ever seen, a red sauce, covered with a half pound of cheese. Individually, any one of those ingredients might have been ok. But together? Not good. I feel like at most restaurants, if something is bland, if you throw cheese on top of it, it'll taste ok. Not here! I don't know what kind of cheese they used, but it couldn't save the dish. I didn't want to insult the person in my family who \"loves\" going there, so I pushed around the food on my plate and picked out the mushrooms and ate them. If it hadn't been for the salad and bread I would have been pretty hungry, though.  I don't venture out east all that often, but I'm sure you can find better pasta just about anywhere else. Skip this place!"}
{"text":"The quality of the walleye fish fry was really disappointing. Fish was not flaky as in prior years and the fries were limp and soggy."}
{"text":"If I'm looking for quick, decent Italian food, Mama Roberto's is one of Mentor's better options. The garlic knots are pretty good, the salad is ok, and the portions are huge. They offer a pretty large menu, so there's something for everyone. Service is usually pretty good,although sometimes standoffish."}
{"text":"It smells so delicious as you enter. The marinara sauce with bread was a great start with a salad. The food is big portions and delicious! (Even the men left with a doggie bag.) The chicken Marsala was delicious! The best. With big mushrooms. The staff is great. I'm very impressed and would go every time I'm in the area. Thanks Rick!"}
{"text":"I've tried this place at least 7 times. Every time I've gone there I soon remember why I don't like coming here. The food is below par and the service leaves a lot of room for improvement. It seems like everything you order comes with a pound of pasta, the problem is it's not that good. If you're looking for basic run of the mill pasta then this place if for you. I can tell they do good busniss because every time I go there or drive by they are busy, maybe it's just me but I'm not a fan of this place and I really need to remember that when me and my girlfriend are out looking for a good place to eat. Overall I'm shocked that the people of Mentor continue to eat here. I'm sure I will continue to give them chance after chance to impress me because I love to support local business and if anything changes I will write a new review."}
{"text":"We have got carry out a couple of times in the last month. We were amazed at the amount of food you get for the price! One meal could actually feed 2 to 3 people. The quality was very good also. We are fans and will be back  soon."}
{"text":"good price for take out Large  Salad (enough for 3). Bread & garlic Nots (very Good) I got Pasta Roberto  and only could eat 1/2 of  main &1/2 of salad. Good red sauce, onions, sausage and mushrooms on pasta Roberto  Will be back"}
{"text":"You get a lot of food for the price, portions are gigantic. But the quality is mediocre, I got the chicken parm and it was pretty plain, lacking flavor.  My girlfried got the calzone, again huge, but still just okay flavor. The bread they bring to the table as before the meal is very good."}
{"text":"Best Italian food I have in a long time. Am here from Honolulu and cannot find Italian food as delicious as this. The cannoli is the best I have had since visiting Italy. By far the best Italian food in Northeast Ohio."}
{"text":"I'm sorry I just don't get the draw of this place. The sauce it the worst I have ever had, like basically they opened a CAN of tomatoes and dumped in on the pasta, no garlic, no spices just canned tomatoes. Went once never again."}
{"text":"Saw this place featured on New Day Cleveland. Decided to come try it out. The service was amazing. Ordered the deluxe pizza and calamari it was awesome. Ended the meal with tiramisu. Definitely coming back here again."}
{"text":"I really don't understand what the other reviews are complaining about.  My wife and I go there frequently it's one of our favorite Italian restaurants in mentor.   Yes the portions are huge and yes there are chunks of tomato in the sauce but  I love chunky homemade sauce.   If you want a smooth pureed sauce go buy a bottle of Prego!  The sauce is the real deal made with genuine San Marzano tomatoes.   On several occasions I have even purchased a quart of sauce to go.  For those that think there's not enough sauce you can always ask for extra.  The pizzas and especially the calzones are to die for.  Yes the decor is typical cheesy Italian restaurant with checkered tablecloths and miscellaneous artwork on the walls but what else would you expect, fine dining?   Try it for yourself before you believe all the naysayers.  If you want a real deal be sure to check out their half price offering on Groupon com"}
{"text":"Great calzones. I am a little disappointed the calzones no longer come with a salad:/.   Bread is addicting and brought to the table warm and fresh.   Best cannoli I have ever had.   I would recommend the toasted ravioli. Amazing !!!  Large portions."}
{"text":"We just moved from Pittsburgh, and this place was recommended by a friend.  It was really good.  The bread is fantastic and the stromboli is sooooo good because of the bread.  Highly recommended!"}
{"text":"If you're planning to bring the family for a full-on Italian American dinner at Mama Roberto's on a Saturday night be prepared to wait. The food is good and everyone here in Mentor knows it. Sure it doesn't look like much from the outside, but the staff at Mama Roberto's is friendly and they keep the warm garlic knots coming. Portions are gigantic so don't feel bad splitting the entrees (or just taking a to-go box with your leftovers). Pizza is good but it's really the pasta entrees that have won my heart. It's hard for me to say no to ordering the penne pasta with broccoli, bacon, olive oil and garlic. Red pepper flakes add a bit of spice."}
{"text":"This restaurant is absolutely amazing. The staff is very friendly. Their pizza and ravoli is delicious. It's a very nice restaurant for the family and gives very good big portions. I would recommend taking leftovers home."}
{"text":"Pretty good don't care about there by policy for plate charge if your splitting meal so for that I brought the rating down."}
{"text":"HUGE portions. Chicken parm - you get two large breaded cutlets for the chicken parmigiana dish and a very generous amount of spaghetti. Spaghetti and meatballs - large portion of pasta with a few meatballs, delicious. The sauce is sweet, but it's homemade and fresh.   I loved the garlic knots/balls and warm Italian bread and butter. We have enough salad for a couple of days. Basically you will leave here with lots of leftovers. Prices are fair for the amount of food you get. I recommend for a casual homemade meal dining in or for takeout.   Oh! and we got a calzone with onion and spinach - ridiculous to think we would be able to eat this, tried a bite and it was definitely good - I recommend if in the area."}
{"text":"WARNING!!!! Do not waste your money on HORRIBLE service. Food is good, but it's not worth it for how badly you will be treated! We wanted to talk to the manager after we sent the waitress back three times and he refused to even come to our table! We have never been treated so poorly! And FYI I wouldn't buy a Groupon for this place! They have several rules that aren't listed on the terms of use!!! It really is sad. How are they still in business treating people so badly?! Ugh.."}
{"text":"This is not the first time I've been here, but will most likely be my last.  First off, the service was nothing short of expected. Our waitress was very attentive and knowledgeable about the menu. That's about where the success story ends....  We ordered an appetizer to start things off. I figured an \"Italian Restaurant\" would most likely have decent Calamari. WRONG. Although I'm aware most places use frozen Calamari, this was possibly the worst I've ever had. Soft, Chewy and served with a side of the worst marinara known to man. It's was almost like they deep fried it half way and plated it. Even sprucing it up with lemon juice, salt and pepper couldn't help this 8 legged sea creature.   Next I enjoyed a salad. Well not really. 2 olives, 1 pepperoncini, 1 grape tomato, a heaping handful of mozzarella, covering a small amount of classic iceberg lettuce. I'm no dietitian, but this was a salad even Rosie O'donnell would have pushed aside.   Time for the main entree. Chicken Parm! How could anyone possibly mess this up? This greasy monstrosity was very upsetting. As limp as a dork on prom night, the chicken was under cooked and slimy. Covered with mozzarella cheese in a terrible attempt to give it some flavor. The side of pasta tasted like it was drained in a colander filled with Dawn soap.   Although I support local independent bussinness, I will not be returning. After reading all of the reviews, I was very upset with the product. Good Luck."}
{"text":"I don't know why people are giving this place such a bad review. We are visiting family in town and came here to eat. Yeah the inside of the restaurant is nothing special , but the staff is super friendly and accommodating. The portions are HUGE seriously.  One dish could feed like three people. I got the Sicilian pizza it was very good. Can tell its made fresh and you can see them preparing it and sticking it in the oven. The pizza sauce was good not great. But the crust was unbelievable. I loved it. My sister for the toasted ravioli with cheese, it was good also. My cousin got the chicken parmesan sandwich and it was amazing and huge !!! The bread they give you the garlic bread is worth it to go there just by itself. Salad was regular nothing special. I would definitely recommend this place. They have huge cannolis awesome and I'm always a sucker for cannolis. Go and eat here , you'll love it !!!"}
{"text":"I seriously will not eat fish, (walleye) anywhere except at this restaurant. The breading is a fine breading, not the greasy beer battered fish you get at other restaurants.  The portions are very good quality for the price. I elected to go with a cup of Italian wedding soup, ($1.00 more) instead of the salad, along with the coleslaw and really great French fries, bread and/or their famous Garlic Ball bread, really sticks to your ribs.  No one in my family likes the same thing, that is why it's such a treat that they all find their own favorite and we can sit down and enjoy our meal! I cherish the concept of an honest to goodness restaurant, not a \"Chain restaurant\"."}
{"text":"Really good Italian food pizzas really good also have calimari in the menu crispy and tasty really good desserts too"}
