{"text":"We had their and empanadas at the Salsa festival on St Clair and they were amazing. Ever since, we waited for them to open the restaurant. We went in today and saw they have a selection of yummy churros some with nutella in them! I had a Mexicano sandwich with fries. Basically it's beef, carmelizes onions, guac and jalap on a bun and it was delicious. On the big side as well. The fries were good but fairly standard. The sandwich was soooo good though. It's a nice small place and I am looking forward to eating my way trough their selection of empanadas. A welcome addition to the St. Clair community!!!"}
{"text":"This place is amazing. Best salsa I've ever had. They make their own bread and they're very liberal with the guacamole. I've had almost every sandwich, the nachos supreme and e fries supreme and I love all of it! The veggie burrito is awesome too, but the sandwiches really are the piece de resistance here."}
{"text":"Alright, so the Chinese have their variety of dumplings in the form of spring rolls, wonton, and egg rolls, the Georgians have khinkali, Indians have samosas, Jamaicans have beef patties, Koreans have mandu, the Polish have pierogies, Japanese have gyoza, Italians have ravioli, Turks have borek, Brazilians have pastel--surely the list could go on forever, but one thing's for sure: if ever there was something we could ALL agree on, it's that meat-filled dough is where its at. In the Latin world, empanadas is how they roll.   My Argentinian friends used to make THE BEST empanadas but then they moved far away and while I miss them too, I cry a little each time I think of their empanadas. I have hunted high and low for decent ones in Toronto and was so excited when I saw that Mama Mia's had opened up on St. Clair West, which made perfect sense as there are already a few Latin American places along that stretch of Corso Italia so it fit right in. I never did drive all the way out to their other location, but imagine my delight when I learned that they weren't too far from me! I had to see for myself that it was true and have been three times now, so I can confirm that it really is there.  The place is almost always empty, but whenever people walk by, they seem curious and more often than not, they'll come in. If not, they'll sheepishly take a piece of churro that are left out front for people to sample. And by the way, I love churros too~  There are quite a few empanada varieties: Mexican, cheese, spicy chicken, chicken, beef, spicy beef, chorizo, I can't remember but I'm pretty sure there was at least one vegetarian option (besides the cheese only), and a few others that aren't your typical fillings for these things. I've generally stuck to the more traditional ones containing beef or chicken and chorizo. They were all pretty good--even better with the self-serve salsa and the verde version. They tasted similar (but not exactly like) to homemade ones. I've only ever had homemade ones made by Argentinians so I can't say how they differ from those of other nationalities as I'm sure they each have their own spin on them, but I do like Mama Mia's--or at least the ones I've tried so far.  They also have a handful of sandwiches like the Argentinian, Mexican, and so on. There isn't a whole lot of variance among them except that one might have a fried egg in it, or chicken instead of beef. The sandwich isn't some colossal monster so if you're really hungry, maybe grab a sandwich and a couple of empanadas to fill up. That's what I do, otherwise I'll share the sandwich and have two empanadas..or something like that. Their Mexican sandwich was pretty good. The bread was about the size of a Weston burger bun and was almost like cocoa bread. I thought I detected some sweetness in it. I also thought it came with fries, but thank the Lord that it didn't because I'd rather fill up on empanadas over fries if I have the choice.   I took a pass on their churros because like their empanadas, they are pre-made and then re-heated and I like my churros hot and fresh. I sampled a piece in the little container by the front counter and it was a little too crunchy for me, though I'm sure they're great fresh--how can you screw up freshly fried dough, after all??  There's loud music blaring all day and the décor is nothing special. Just purple. Service is polite, though depending on who's working, it can get a little hairy. Sometimes you'll be served by someone who barely speaks English but it's all good. Most of the time, they're off in the back so don't expect any table service. You order, then sit and wait for your food to come out. The prices are decent, about $2 per empanada (there's a deal for multi-units) and ~$6 for the sandwiches. Remember, this is not South America so don't expect to score a whole meal with your pocket change! Two sandwiches, four empanadas, and two drinks came out to somewhere between $25 and 30 and we pretty much had to roll ourselves home after."}
{"text":"Great burritos. And quite large, too. Big enough to share.  My fiancee and I also love their churros; we typically order a couple whenever we're walking by.  We love the place."}
{"text":"Ive been to their other location near Islington, so was so happy to see they opened up closer to downtown. Their empanadas are the best. Every bit as good as the ones in Kensington market. Highly recommended."}
{"text":"Grab one of the imported Mexican sodas (Coca-Cola and Fanta with real cane sugar just taste so much better!), and then sit by the open restaurant front on a warm Summer evening and the latin music combined with the cliché crummy interior will take you straight to South America.  The great food just added to the experience. If you love Mexican food but have never had a Churrasco before (wouldn't be too surprising as they don't seem to exist anywhere else in Toronto), go give them a try."}
{"text":"First time here, and I was intrigued by the jalapeno sauce sitting there by the counter.  Purchased a spicy chicken empanada and loved it.  Especially with the jalapeno.  Great noms, its worth the visit if your passing by or in the area.  Also, the churros are great, but addictive!"}
{"text":"Yelps two-star line of \"Meh, I've experienced better\" is the perfect encapsulation of this place.  For a place that touts their true-to-their-roots ethnicity and best-in-Toronto claim, we have been disappointed.  Each time the burritos have been a soupy mess, full of filler like rice and mealy vegetables and light on the meat and beans and cheese.  They're also wrapped too thickly, so that the exterior gets very hot but the interior often remains cold and wet.  This place might be good enough for the high school students nearby but there are better burritos at Gourmet Gringos or other places on St. Clair."}
