{"text":"Love this place. try the brown stew  chicken or my favorite on Wednesdays jerk chicken. she makes goat and oxtail..with cabbage and rice and beans..no better Caribbean food in Pittsburgh!!!!"}
{"text":"Mama Rose is the real deal. I've been to Jamaica 6 times and around the people and culture for many years. If you go during the warm weather, you can outside and enjoy your meal. Otherwise, you just go with take out. It's not fancy, just very authentic and delicious Jamaican food."}
{"text":"Mama Rose sells dinners out of her home. She's located on Mayflower Street off Larimer Avenue in the East End. The food is delicious and affordable. Her oxtail dinners are my personal favorite. The meal includes peas and rice and cabbage. If you love Jamaican food you have to try this. It's fresh, authentic and delicious."}
{"text":"Prices went up but Portion size have gone way down. Plus I've seen mice in the backyard"}
{"text":"I've been going there for years always good food and very polite. It's better than any Jamaican restaurant in this city  by far. I love ma ma rose."}
{"text":"Super friendly, however a bit tough to find (located in the back of someone's home). The environment (kitchen, dining space, wait space) was clean and they appeared to have good hand washing hygiene....giving this info only because the restaurant is located in a home...simply put, good clean place for good food."}
{"text":"You can't beat the quantity, and the flavor of the food is great!!! 7 p.m. is the cut off, which isn't bad for the working class. Trust me, if you like Caribbean food and you're close by, you should try Mama Rose!"}
{"text":"I have been looking for a good Jamaican spot in Pittsburgh for 4 years and today I found it! They have the best oxtails I have ever had! She cooks out of her kitchen so don't expect a usual restaurant."}
{"text":"I was kind of disappointed with the restaurant, given the positive reviews from the other yelpers. We got a take out order for curry chicken and oxtail stew. Unfortunately, the sauteed cabbage that came with the curries had gone bad after just two hours. The odor from the cabbage was so so bad, that the chicken and oxtail stew was completely inedible. Our whole apartment was filled with the stink from the curries. Also, for a business operating out from a house the price is not cheap!!!"}
