{"text":"This place is a new addition to the restaurants on Dufferin near Lawrence.  Since we work in the area, it's always great news to see a new place for dinner.  

Prices are pretty good-all entrees are pretty much under $20.00 except for some of the steaks.  They have a decent selection of daily specials too.  The complimentary bread is good when it's hot.

*Butter chicken is not authentic, but okay.  It's served with naan, but not really.  More like greek pitas.  
*Rib-steak was huge!  Well cooked, perfectly medium rare.  
*Chicken fajitas were a bit greasy, but otherwise quite good.
*Pass on sandwiches, get a steak. 

So try it out!  We don't have that many choices in that area anyhow! I'm going to get a steak next time.  I think it's what they do best."}
{"text":"We originally came here using the $50 coupon for 2 (incredible value) and we also brought our kids. There is something for everybody here, including children. The steaks are always perfectly cooked (and I'm the type who returns a medium steak when it's supposed to be medium-rare) and the appetizers are varied and delicious. The mussels alone can be a full meal, coupled with their incredible free warm garlic loaf (comes with a nice red pepper dip). They also make great french fries, whether regular or sweet, and don't charge you extra for ordering the sweet fries, like many restaurants do. So many steak places serve mediocre fries, it's a crime. Not here. We returned last night craving burgers (and one order of their delicious butter chicken, which could easily rival any Indian restaurant -- and I've tried them all) , and are so glad we did. I ordered the Mediterranean burger, which is huge and includes basil pesto, feta cheese, tzatziki, and all the regular burger toppings on a perfect and soft sesame seed bun. It included fries and terrific cole slaw, and this heaving plate cost all of $8.95. Two family members ordered the regular burger with aged cheddar cheese for a dollar more. One son had pea meal bacon on top (an additional $1.75) and the giant slab put on top of his burger reminded me of the Flintstones opening sequence when Fred orders the ribs! The waitress remembered us from before (and it had been a little while since we had come in) and was sweet, funny, and efficient. I really don't understand why there are some less than stellar reviews online for this restaurant. They are bending over backwards to please, recently adding a weekend brunch at very reasonable prices to their menu. We will definitely be going here for that, and soon. I am a picky restaurant goer who rarely returns unless everything is pretty much right, and everything is pretty much right here. Better, actually."}
{"text":"Bad food , slow service. Not recommended don't waste your time in overpriced drinks and bad food."}
{"text":"Well I gotta say it was one of the hottest nights in Toronto, when I came here.
Well, so far this Summer anyway.

This place is really quite nice in terms of decor, however it does seem a bit out of place on Dufferin Street, which is a pretty industrial area.

I have been here a few times, and the menu is varied, and has some nice choices on it.

I have tried their Taco Salad, which is served in  a nice crispy tortilla shell.

Service varies, depending on staff,  and I would say it's just ok.

They make a super burger here, and the Sweet potato fries, yummy.

One thing that I did not appreciate was the very loud TV;s over the bar competing with the piped in music. I had to ask them to tone it down, so I could enjoy my meal and conversation with my friend.

There were some people sitting at the bar, who chose to swear about every 10 seconds and were drinking and talking rather loudly. That was somewhat annoying too, we would have expected a little better in a Milestone's type of atmosphere.
I got the impression they might be regulars, so this behaviour was overlooked."}
