{"text":"I've been shopping here for a while, but only recently learned that in addition to being a market that sells all kinds of Korean goods, it also doubles as a small restaurant.  This area doesn't seem to have many Korean restaurants, let alone really good Korean restaurants. My friend and I had been looking for a decent Korean restaurant for a long time now, and I can confidently say that this place fits the bill. This place has a rather large menu for a small establishment, and serves up a variety of authentic Korean food. They have a good selection of banchan, which were promptly replenished upon request. I've tried the bibimbap and the soft tofu soup so far, and they have both been outstanding. The bibimbap had great flavor, and their homemade gochujang really brought the whole dish together. The soft tofu soup had a very flavorful broth and was full of seafood. It honestly reminded me of my mom's home cooking. The prices are very reasonable and the portions were perfect. The couple that owns this place was very nice, and they made sure we were satisfied with our experience.  I would highly recommend checking this place out!"}
{"text":"What a hidden treasure!! Found this place by chance just driving past, I love Korean food, what luck! Everything we tried was delicious! They make the kimchi fresh everyday. Bulgogi was so yummy, served with authentic Korean sides and the miso soup was great and the dumplings hot and so crispy! Will be back soon for sure!"}
{"text":"This restaurant is like having someone's Korean mom invite you to their house and cooking you legit authentic food.  Located in a small Asian market and totally looking like a hole in the wall, try your hardest to choose from the wall of amazing entrees. Reminds me of Wonton Gourmet BBQ in Cleveland and helps you feel a little more adventurous to try a new dish. We got the UFO 2 (a combo of Kalbi, sauced rice and dumplings) was tasty and the beef was nicely tender.  We also loved the bone broth soup.  Such a nice mouth feel and deep flavor.  Bulgogi rolls were delicious and a good value.  This is a solid Korean place- if I were closer I'd come here all the time.  Might want to bring some cash- the credit card system doesn't let you tip on the card like most restaurants, instead handling it like a grocery store."}
{"text":"I've been shopping at this Asian market for quite a while - they sell the best kimchi!  I've only eaten her twice but I know I'll be back over and over. The soondubu jigae is SO good, I've had it both times. My fiancé had ramen and loved it. Kimchi pancake is a must have too. We tried the Korean restaurant down the street and were not impressed at all - this place is way better!!"}
{"text":"My girlfriend and I checked this place out yesterday after shopping there for groceries a couple times.  The food is absolutely amazing. The prices are very good and the customer service is beyond exceptional. From what it seems, it's a business run by a korean couple and they seem super happy to serve. We sat there with literally 0 negative or iffy opinions. 10/10 would recommend."}
{"text":"This place is PHENOMENAL!  After reading the 3 other reviews on here and looking at the photos I decided to give this place a shot. The restaurant is more like a tiny eatery located inside of an Asian market. There are 4 small tables and enough chairs for 12 people to enjoy at a time. The server was very nice, she let us look over the menu which included a picture book showing what each dish looked like. My mom came with me and we ordered the seafood pancake, Kalguksoo (seafood noodle bowl) and Bulgoki ramen (beef ramen) along with a lemon ginger tea and a mango passion fruit tea. First off, the tea was LEGIT abs not what I expected: fresh fruit, sweet tasting, and piping hot...delicious especially on a 9* day. The seafood pancake was HUGE and so full of fresh shrimp and squid!  The soups were outstanding as well, we couldn't believe how big the servings were and how tasty the broth was! Everything is made to order, so you do wait a little while, but it was absolutely worth it! I can't wait to go back for some AUTHENTIC Asian cuisine, it is few and far between around here! If you are looking for AMERICANIZED dishes, go elsewhere...THIS IS THE REAL DEAL!"}
