{"text":"I enjoyed a shredded beef chimichanga.  Beef was nice and tender, and the rice was cooked perfectly.  Although the outside gives the appearance of a cantina, the dinning area was very clean and relaxing.  I  enjoyed the decor, and the service was very good. I am definitely coming back."}
{"text":"All Manuel's aren't created equal.  This is the best Mexican food and Manuel's in the valley.  I've been to probably 4 other locations and they just aren't as good.  My wife and I love going here.  Pollo especial is excellent."}
{"text":"Awesome place to eat! Great food, I like mild salsa and theirs is just right for me. They do offer hot sauce for those more daring individuals. The service is always good but I received excellent service from Mariella!!! Even though I was dining alone she didn't ignore me and was very attentive. My drink and chips were never empty!!"}
{"text":"I'm from L.A. born and raised and the Mexican food here in Phoenix is very different from what I'm used to.  The texmex food isn't real Mexican food lol.  This place reminded me of home and my family and real authentic food.  Good job Manuel's.  Our waiter, Miguel, reminded me of my brother in law and was very attentive."}
{"text":"Consistent good food. Prices are good. Been eating here for years, never had any problems. Quick service. Love the chips and salsa!"}
{"text":"Miguel was an excellent waiter loved the food decor. If you have a chance don't pass up an amazing restaurant."}
{"text":"OK, I found this place with my family a couple of months ago.  We have been there about 5 times since then.  It's not fancy, definetly needs an update on the decor.  But-has arguably the best cheese enchilada I have ever had.  Great chips and salsa, great serice, and excellent for a family dinner.  If you want to pig out on chips and salsa, great place to do it."}
{"text":"My family has always lived in the neighborhood, and this is one of our favorite Mexican restaurants to go to. We have been going here since 2006 at least, and all of the servers have been very friendly and always get the job done well. We absolutely love this place and have never been disappointed with any of our food orders."}
{"text":"This place is a community staple for a lot of people who live in the area.  The best thing about Manuel's is that the food is consistently good.  The Green Corn Tamales, in particular are fantastic.  Good service and friendly atmosphere.  This is just a good place to go!"}
{"text":"Love this place!!! The steak fajitas, espinaca queso, and sopapillas amazing!!!  Everything at this restaurant is great, including the service!"}
{"text":"I'm new to Phoenix and I was looking for somewhere close to my house to eat Mexican. I went at about 12:15 during lunchtime. The crowd was not that bad but the service was not very good but the food was great."}
{"text":"Again 4.5 stars for Manuel's!  I love this place.  Great salsa, fresh chips.  The Margarita's are delish and the service has always been good to excellent.  

I sometimes stop in just to buy chips and extra extra salsa to take home and maow down in the privacy of my living room, so no one can see me scarfing down the chips and licking the salsa container clean.

Their food is always hot and fresh tasting, I must admit I've had better, but not by much. Go Go Go and while you are there try all their flavoured margaritas."}
{"text":"Machaca is on point. The tortilla soup is one of the best I've ever had. The presentation of the soup makes it the best. Drinks are strong so be careful there. Good spot for date night or place to go with the kids"}
{"text":"My dad was visiting from NY and we were looking for Mexican, so we tried this place. Overall, I like it. The chips were ok, I like thinner chips, the salsa was ok, again I've had better, but it was good. I had the fish tacos...they are made from grilled cod. I asked if I could get the cod deep fried, but that was not an option. The sauce was a tarter based sauce-which seemed very 'American' to me (disappointing), but I have to say, I liked the tacos. Decent flavor on the fish and I liked the rice and beans. (I am not a huge fan of rice and beans, but these were decent and unlike the rest of the table, my beans were not deep friend, but more like pork-n-beans. My son had a grilled cheese-which was good. My father had the pork carnitas, which he enjoyed. Dave had the carnita enchilada, which also looked picture perfect, but I didn't try. The only hiccup with the entire meal was the waiter brought a Chardonnay, instead of a Cabernet  Sauvignon ... and he didn't know the difference between white and red wines, and he should have really known, given they only have a handful of wines. Otherwise, good service. 

Overall, I enjoyed dinner and would get the tacos again, they were good and filling!"}
{"text":"Blurb for iPhone App: Great Enchiladas, Chips and Salsa made fresh, but beans left something to be desired.  Give it a try nonetheless.

I just wrote the last part because I will be on the Yelp app, and notice that I often start my review with something that is not useful at all... which is that everyone sees when searching on their mobile phones.  So I guess you could say I'm optimizing for mobile.  Ok, now on the full review.  

Took off a star for the beans... they just weren't great.  The person with me had a taco salad, and said they didn't get a lot of meat in it... and the rice was good, but not great.  However, this was balanced by the chips and salsa (which I always eat so much of that I'm not hungry by the time the food shows up) which seemed to be made fresh, not too hot, but with plenty of flavor.  The \"hot\" sauce (hot is entirely objective here) was very good, and I used that for my chips as much as the salsa.  Didn't ask if they had anything hotter, as the true chilehead will think it's pretty mild...

I had a chicken enchelada with green sauce and a cheese with red.. and although I usually like the green better, the red here is great.  One word of advice however - don't step on the scale the next morning, because you are going to stuff yourself while you are here."}
{"text":"We have been to Manuels quite a few times but was really disappointed on our first experience in the bar. We came in and it was about 10 min before we could get menus. Another 10 min go by before we moved to a table to attempt to get service. When we finally got a hold of a waitress walking by, she seemed bothered we asked to have our order taken. Disappointing visit. We will be back because but not in the bar area. Definitely a different level of service  between the two."}
{"text":"This is a nice place to go for your basic cheesy Mexican food.  Definitely a neighborhood joint. Good chips and salsa. Nothing gourmet, just good, hot food."}
{"text":"We just finished dinner at Manuels for a last minute family reuinion.  They were very accomidating to the 20 of us.  Also, at the end of the night my father paid the tab, he did not realize that the gratity was already included.  The staff followed us while we were saying our goodbyes.   He told my dad that he had over paid the tip and allowed him to run the tab again.  We thoght this was very honroable."}
{"text":"I love this place.  We walk here.  Hubby likes it okay, but is right, the servers are kind of characters.  I love the food though.  I had a shredded beef plater that was amazing.  This is traditional mexican food so it's a bit heavy, can be greasy depending on what you order.  I got sick on one of the cheaper margaritas, but the one that has orange juice, a bit pricier, is AMAZING.  Relaxed atmosphere.  Food is good and exactly what you would expect from a traditional mexican restaurant.  Good, yet not phenomenal, but great when you are in the mood for traditional mexican food."}
{"text":"Been coming here for the past couple of years now.  The building is in desperate need of a makeover, but the staff is friendly, the food is consistent and the margaritas are lovely.

Our server Pedro is spot on, personable and on his toes.  The front staff is great too, Ola is welcoming as can be.  The fabulous staff here is what keeps us coming back, keep up the good work guys!

(oh, and do a little redecorating!)"}
{"text":"I give the restu  four stars mostly because of the waitress. Montoya was fabulous.  Food was probably  three stars, but she made it worth coming there. Friendly. Made you feel like she was really happy to see us. She was like this during the whole service. Great job to her. The food was good. Not all of it was the best if I compared to other places, but the waitress definitely  made the difference  worth it."}
{"text":"Haven't had a mexican plate this good in longer than I remember. The Three Amigos and the large Amber Dos Equis in a frosted mug was heaven. Great service too!"}
{"text":"First, I do want to say the service we had was great and our food came out hot and as ordered. This is what earns 4 stars. 

However, if you are looking for authentic Sonoran Mexican food this is not the place. Flavorful and spicy is what I typically expect from Mexican food but it is not to be found here."}
{"text":"I have been going here since the 1980's and it is still the best. Great salsa, great cheese crisps, great everything. I hope it is there at least another 30 years."}
{"text":"Waitress Mariela is not pleasant. Very inconvenient and unprofessional. Would recommend she go back to working at McDonalds."}
{"text":"One word? YUM! This place is great. It's an old family favorite. Service is always friendly and prompt. LOVE the chips and salsa and the pollo fundido. Every Christmas Eve we order party platters and always have a great experience. The decor is nice and we always have a good time."}
{"text":"I have been eating here for the past 15 years or so, and I have never had a bad experience. The food is absolutely amazing; probably the best Mexican food I've ever had. (I have to admit that I don't venture off to many other Mexican restaurants because their food is so good!) My favorite item on the menu is the #1 combo - a red chili burro with a cheese enchilada and beans. Delicious! They will certainly remain a favorite of mine for many years to come :)"}
{"text":"So I used to like this place... But now it sucks! Food is gross. Service sucks. It took 15 minutes to get a drink. Staff do not appreciate regular customers. Too much politics at this place. Bartenders that were basically supported by me, are cold and cannot even say hello. No, thanks! Your food and service are poor!"}
{"text":"We have been going to this Manuel's for 27 years.  They have the best salsa and chips, and green corn tamales I have tasted anywhere.  The staff has always been efficient and friendly.  The bartender \"Eddie,\" has a special place in our hearts and has recently been doing everything for the newly redecorated bar area including serving food and drinks, and even busing all the tables in that area.  Hopefully, we will all continue for another 27 years."}
{"text":"I've eaten at this location many many times, with my brother and my family and have always had lovely food.  Fast forward to a recent change in what I am allowed to eat and not eat, I always find Mexican Food my biggest challenge.  My brother wanted lunch here today and knowing that, I called last night and was given some info, and asked to call back this morning after 11. Which is perfectly acceptable...I spoke to the GM this am and he told me I was able to bring in my own food from home and he would discuss with me my options for next time. Not only did he discuss it with me, even though it was busy, he brought me a sample of food I would be safe with!  I have NEVER had such care and concern towards my eating issues and am so thankful.  The green tomatillo sauce is exceptional and the chicken he brought with two kinds of beans, made my visit there super tasty. I even put my food back in my purse, as his was too good to pass up.  I will most definitely be back and even looking forward to it!  Thank you for making it so easy for me and making that extra effort, it really is appreciated!"}
{"text":"I haven't written a review in a long time, but wanted to make sure I wrote for this restaurant. It was just a casual night where we were in the mood for burros and had other errands too. We went here for convenience but we were completely surprised about the impeccable service, which deserves 5 stars on its own! We were waited on immediately and they made sure to get our order in before a large party. They can read minds too. We were running low on napkins (toddler dining) and they came by with more napkins before we asked. Our chip basket was always full too. Food was your normal Mexican-American and would get 3.75 stars."}
{"text":"Pretty awful. Ordered takeout and was not impressed. The hostess answering the phone was rude as well. Went to pick up the order, two out of the three girls were friendly. I'm assuming the bitchy one took the order. I ordered the grease bowl....I mean chicken enchiladas. It was so greasy it looked more like enchilada soup.  My wife ordered some tacos. She wasn't really impressed either. I've had manuel's before it never was this terrible before.  It's a shame this location sucks so bad seeing as though it is so close to me. Looks like Valle Luna from now on."}
{"text":"Of all of the Manuel's Restaurants in the valley, the restaurant on Cave Creek Road, just north of T-Bird, has he worse chips.  They are 100% tasteless!!   The salsa is great, but, their chips will crack a crown.  A dried leaf or a piece of old vinyl asbestos tile have more flavor.  Service was great as usual.  Don't stay away just because of their tasteless cold chips, just sneak in your own store bought chips to enjoy their great salsa."}
{"text":"Food is really good!! Chimichanga is the best!!! Have been going to this restaurant for many years. Love the takeout option. Usually ready in 10-12 minutes!!! Fast yet high quality and inexpensive."}
{"text":"We went here because Shannon N. said it was the best mexicanfood ever and boy was she right. By far this was the best mexican meal and the best meal we've had in Phoenix area.

The hostess was great reseating us when we didn't like the back room for our group of 6 but she found us a great spot for a great night.

Chicken enchiladas, chicken chimichanga, soft shelled tacos ( ground beef) chili rellenos and 3 baskets of fresh chips and salsa, proved to be one of the best meals since we've been on vacation here in Phoenix!
Shannon was right this will be a favorite of ours for healed to come."}
{"text":"My son and I went here for dinner tonight. He had nachos that were pretty good. I had the 3 amigos enchilada dinner. Enchiladas, beans and rice were ok. Service was decent. I asked for tapatio or the like for my beans and rice, but they do not carry anything like that. Asked for a dinner salad, but they brought all the food at once. I like to have it before my meal when I go out, but if I would have eaten it first my hot food would have gotten cold. I was going to ask about when my salad was coming, but didn't have the opportunity. They are kind of spendy for the so-so quality."}
{"text":"It was ok. The waiter had a hard time understanding English. Ok makes the place feel authentic. I hadn't been here in like 16 years. I wasn't impressed. Thought the tacos were bland. They were nice, quick and efficient though. Place is clean. I am not a Mexican food expert though by any means, so it could just be my taste buds."}
{"text":"New favorite Mexican restaurant. Great food, price and service. Tonights waitress was Montoya and she was excellent. Very attentive and efficient. Made our dining experience very enjoyable. Thank you for your service."}
{"text":"Awesome Everything !!!!!
Enchiladas were delish and the Carnitas were outstanding!    
Also a great Bravo to the staff for your attentiveness and friendliness.
Fantastico.       
So glad we looked you up on YELP!"}
{"text":"Ok, if you like canned chicken, no spices and little flavor, this is your place!

The chicken Tortilla soup was good, and the chips... The salsa and everything else was processed, canned, pre-made garbage!  Fuck this place and it's food!

Miguel was very nice and the bathrooms are clean, but beyond saying hi to a nice waiter or pissing on clean porcelain, don't bother!"}
{"text":"Our server was very overwhelmed so our service was mediocre at best. I was so looking forward to fajitas and was fairly disappointed. There was absolutely no flavoring on the chicken or the steak, no cheese, it was just really plain. I will say the chips and salsa were great but not worth a visit. Overall, very not impressed and would stack this up to the many average mexican restaurants in the valley. Truly nothing special."}
{"text":"Best chips and salsa the side of the border :-)The food is delicious and the service is friendly and the restaurant is clean!"}
{"text":"PROS: Margaritas
            Salsa 

CONS: Cold Food
             Poor Service 
           

I came here with high hopes based solely on the 4+ star rating  and other Yelp reviews. While it was only a Wednesday, I would expect the service to be far better than it was. I sat in the bar as I always do when eating as it affords me the opportunity to conversate with the bartender.  I sat down at the bar and waited for a few minutes (approximately 7 minutes) to be greeted. Lorenzo was the bartender on duty and he did greet us finally. I ordered a margarita and an cheese crisp to start. The margarita was delicious however that's was the only thing tonight that was.

After getting my margarita (20 minutes in) I waited a few more minutes (30 minutes in) and my cheese crisp finally arrived. I had told Lorenzo that I wanted to wait until my cheese crisp came to order food. Well after my cheese crisp came there was no Lorenzo to be found. So I ate my cheese crisp and had to get someone to track down the bartender to order my dinner. Well dinner finally showed up (45 minutes in).
 and it was just how I like it...COLD. I would have sent it back but there was no lorenzo to be found. He finally came back, by this time I had already committed my dinner to leftovers. I ordered a second margarita which again was great, and that's the last time I saw lorenzo all night. (75 minutes in) I was clearly done with my dinner, working on my margarita, and the busser was clearing the chips and salsa dishes. I asked the busser for a box, which he procured for me and then finished clearing the dishes. Now I'm left with my box and half full margarita. The people that work there were busy doing their side work getting ready to close....still no Lorenzo. I finish my margarita and am patiently waiting. I waited from 9:15 to 9:50 for someone to ask how I was, if I needed anything or to bring a bill. At 9:50 I asked the busser where our bartender was to which he replied \"lorenzo cashed out and left\". I was beyond flabbergasted to hear our bartender left without even trying to cash us out or letting us know we would be with another server. So after tracking down this server I was finally able to pay for my meal. 

I will not be back."}
{"text":"The reason I'm giving four stars is because of the waitress there who helped me. I came in for dinner, by myself, and this beautiful young lady was incredibly kind and welcoming. She made me feel very comfortable there. I wish I had asked for her name, but I won't forget the face. I guess you could say that I was feeling overly generous, too, because I tipped her a $20. The food wasn't bad at all, but compared to the chimichangas I've had throughout Arizona, this one is meh. A bit bland, I think. And I was a little surprised they didn't have Horchata. But that's no biggie."}
{"text":"We won't be coming here again. The food is mediocre and the service was extremely slow. The hostesses have very little customer service and both of them came off as very confused about what they were doing- talking about guests and losing track of who had checked in and who hadn't. After we were seated, we ordered 3 meals and an appetizer within 5 minutes. It took over 20 minutes for the appetizer (spinach dip) to arrive and nearly 45 minutes for our entrees. The restaurant was not that busy so we had no idea what was taking so long. While waiting for the food, two employees were walking past us and one was trying to playfully hit the other while the other ducked to avoid the blow. 

When got our bill, we noticed that we had been overcharged for the spinach enchiladas. On the same menu it states that the 2 spinach enchiladas are $12.75 plus we added bacon which says $2 extra. On the bill, it stated we owed $16.75. We asked the waitress who said \"the computer is broken and has been doing that\" and then changed her answer and said it's $2 per enchilada. We asked to see a manager (who never came to our table) but instead the waitress came back about 10 minutes later and told us that the manager fixed the bill. We ended up being there for about 1 hr and 45 minutes, eating mediocre food and watching a lot of unprofessionalism throughout our experience, across various employees. Avoid this restaurant."}
{"text":"Believe it or not I've never been all that impressed with Mexican food in Phoenix. I've eaten at many touted and revered places and been disappointed more than once.   I was always sure there were great places, but couldn't find them.

Manuel's has my hopes back on track.

Our service was very good, the food was tasty and fresh, portions are HUGE (the biggest chicken enchilada I've ever had, it was stuffed thick with delicious pulled chicken) and just a really good dining experience.  But what really stole the show... the chile verde (green chili) burrito.  The chile verde was tender, perfectly spiced, and just awesome.  I can't wait to go back.  Excellent and worth the five stars.

We also had guacamole which was large and very good too.

[I have to add one thing, from the looks of things on the menu the meals looked skimpy.  The waiter told me they offer a pick three combo that's not on the menu.  I went for it, but should have just done the pick two as the portions are WAY bigger than the menu photos lead one to believe.  Oh well the leftovers were great the next day for lunch.]

They do burritos (burros) differently than Midwesterners and folks back East are used to - burritos usually have only a couple ingredients.  They aren't loaded with ingredients like in NY and Chicago."}
{"text":"I'm so sad to write this review. I actually love the food, problem is it's filthy. Service, particularly the hostesses, ghetto not acknowledging you as you arrive and just take off to the table without a word... My husband and I went last week and it stunk so bad and it was so dirty we lost our appetite and left. I used to work at one and have been a fan for over 25 years it makes me sad to see the decline on the one on Cave Creek."}
{"text":"Service was less than impressive. Saw one of the hostess bring in Mexican food from another restaurant, and I mentioned it. Her response was \"the food here makes me want to puke...\" Well, as anyone would be we were super skeptical but still gave it a shot, as she wasn't an honorable looking lady. Wish we would have taken her advice. Veggie burro was just some steamed zucchini and a few random kernels of canned corn, no seasoning or flavor to be found. I had the beef flairs, and it was fine."}
{"text":"Not impressed.  Been going to Mexican restaurants in the valley forever.  First time at Manuel's.  Always heard it was great food.  I got a taco and enchilada.  Those are my go tos. The enchilada was ok, taco was ground beef in what looked like a premade shell.  Their hot sauces were not good. The hotter of the two tasted like bottled taco sauce.  Service was slow too. Sat at the bar which is usually fast.
Nope, won't be back, I'll stick with Valle Luna or Popo's."}
{"text":"Manuel's personifies Mexican food in Phoenix--Nothing amazing, but very satisfying nonetheless.

Manuel's simply has a huge variety of items including the Americanized treats that are cheese crisps and chimichangas, and all are prepared effectively, if not spectacularly.

Is it a Mi Nidito, El Charro, or La Parilla Suiza, three mainstays of the Tucson Mexican food scene? No way, no how. But if you're in Phoenix, alas there isn't much of that caliber to choose from. Manuel's has several locations in Phoenix, so they're convenient, the service is usually pretty good, and the food quality is consistent and generally quite satisfying.

With realistic expectations, a pretty reliable choice for (Phoenix) Mexican food."}
{"text":"Great food.  Best cheese crisp in Phoenix.  They ask if you want it crispy or soft -- no other restaurant I know of asks.  Best chile relleno I've had in Phoenix -- chile relleno is kind of my thing.  Manuel's is battered in straight egg instead of with flour.  Not greasy at all, like the floured ones I've had at lesser restaurants.  This one is delish.

Tasty chips and salsa.  Generous refills on chips, salsa and drinks. Very friendly service no matter when we go.  Best Mexican around.  Just go."}
{"text":"MONTOYA was our waitress this evening and she was AMAZING. Very attentive and personable. Drinks never got empty and food served hot. Best service I have ever had there!"}
{"text":"Not the best Manuel's food wise I've ever been too but atmosphere and staff were wonderful! Right across the street from my apartment!"}
{"text":"First off, let's just get this straight: Manuel's has THE BEST salsa in town. Period. Having said that, the rest of their menu is pretty fantastic, too. We love the pollo especial, fajitas, rolled quesadilla, green tamales - pretty much you name it, we've eaten it there. Becky is our favorite - and super special - server and she always gives us excellent service. Stop in, say hola, and enjoy some fabulosa comida Mexicana."}
{"text":"Service-started off good because we were the only booth in a section of four but once the other three tables were filled, it turned poor.  Took forever to get the bill.  We had an 1 1/2 yr old there with us - she was totally losing it and we sat there waiting until we could flag her down. 

Food-good overall but one major issue.  On the \"to go\" menu, we noticed a con queso dip but it was not on the regular menu.  We asked the waitress if we could order it -she said yes.  I asked \"is it just salsa and cheese.\"  She said yes. 

When it arrived, it was filled with GIANT chunks of onion and green pepper.  It was so spicy!!  It would have been nice to warn us of the spice level. We ate 1/4 of it.  Yuck.  2 inch pieces of veggies heaped in a small amount of cheese is not \"salsa and cheese.\""}
{"text":"We came here this past Sunday, it was awesome! The service was amazing, the food was delicious and came out quickly, and everything was piping hot, just how I like it. I'm sorry, but Carolina's down the road does not measure up. Every time we go there it's a 30+ minute wait and the food is always cold. If you've got 30-60 minutes to wait for food, why not come here and have a nice sit down dinner instead! Can't wait to bring my family back when they come to visit."}
{"text":"Good food, friendly service.    We has taquitos, chicken nachos and enchiladas - all were delicious.  Kids enjoyed their tacos and rice, too."}
{"text":"Eddie in the bar makes this place great.  The food is ok but we come cause we know the people and love the margaritas"}
{"text":"Nice people, and obviously an inter-generational success story but . . . pretty bad, totally gringo-ized food. Light on spices, heavy on grease and goopy sauce. Is this what passes for good Mexican food in Arizona?"}
{"text":"First time here and it was great. Fast, friendly and the food was amazing. Had the street tacos and for dessert I tried the fried ice cream. Yummy!
Will come here again."}
{"text":"Tried this place cause close to home and good yelp reviews... Hard to find good Mexican food in Phoenix , but this place was pretty good .. Good addicting salsa , I got the 3 enchiladas platter , which were all good , good sauces, good rice and beans ... No funny flavors. Good happy hour, friendly service  :) good all around :)  I would def come back here when I'm craving Mexican close to home."}
{"text":"Manuel's has always been a safe, solid choice for Mexican food. It has always done the job. I haven't been in for a couple years so when I went last night, I was pleased that not much has changed.

We started out with the Texas margaritas. They are HUGE. Delicious and worth every cent. But POTENT. I have a high alcohol tolerance, especially when it comes to tequila, but my husband couldn't even finish his because he has a low tolerance for tequila and he was the DD. So I finished his. :)

Salsa and chips were good. Salsa was very fresh tasting. I wish the chips were hotter and crispier. They tasted like the generic chips you buy at the store.

My husband ordered the 3 amigos enchilada plate. He said it was really good. I tasted the spinach enchilada that came with the plate, and I concur that it was really tasty.

I had the chili relleno plate which I'm still scratching my head over. I must have had over a million chili rellenos in my life but never one like this. The chili wasn't dipped in a batter, it was just wrapped in egg. I was disappointed by this dish. I know the that the batter for chili rellenos contains mostly egg, but it's not pure egg. It has a little flour, milk, and sometimes baking powder to make it fluffy. The sauce that covered it wasn't very saucy. It was green chilis and onion basically. The whole thing wasn't terrible, just disappointing. Beans and rice were still delish though.

I am still rounding up to 4 stars because everything else I have had at Manuels has been great. Cheese enchiladas, their gigantic cheese crisps... all delicious and satisfying. And their service is always excellent. I will just avoid the chili relleno from now on."}
{"text":"Yesterday I placed a to go order at this location, not only was the person who answered rude and condescending, we waited over 30 minutes for our order we phoned in. Then the order was incorrect and cold. Also even tho we asked for it, we received zero salsa. When I called to speak to the manager I was told he was too busy to come to the phone and to call back in an hour. I asked a second time and was told the same. I did call back in an hour and spoke to the manager. He couldn't have cared less that we had a less than stellar experience, or that his staff was rude, or that our order was wrong, or that we waited for half an hour. 

I have been eating at this location for over 20 years, and although i no longer live in this neighborhood, take the opportunity to visit when I am near. No more, I get better service at a filiberto's. I will not be visiting this location again."}
{"text":"We came a group of 7 plus a toddler for lunch and they were very accommodating. The servers were good and the food came fast. However, there are plenty of places in Phoenix that you can get better Mexican food.

This place has been here for 30+ years and I have been here a number of times. Though, I have never been very impressed. The decor could use some serious updating as well."}
{"text":"Had the Pollo Especial....delicious! My husband had Carne Asada and it was so moist and tender! Loved loved loved the chips and salsa!!!!"}
{"text":"Horrible! For 5 of us we were seated in a 4 person booth, it was very crowded! The waitress took off for long periods of time and popped up at the end of the meal and asked if we would like anything else...lol yeah to get the hell out of here. 

Horrible experience!"}
{"text":"The best Mexican food I've tried so far in the area. I ordered the Carne Asada meal which came with 8 oz of meat a cheese enchilada and rice and beans. The carne asada was the best I've had. Sometimes it gets dry and chewy at other places, but here it was juicy and the perfect balance of meat and fat. My wife even like it and she doesn't really eat beef. My wife liked her food and had a tostada left for lunch the next day, she said the house margarita was great too. Our 18 month old had a cheese enchilada and rice and beans, her favorite and was very happy. Only negative was it looked like they were short staffed. Our server was running all over the place and forgot a couple things at times but always apologized, looked like more of a staffing issue not his fault. Definitely will be back and we will recommend Manuel's."}
{"text":"Well Manuels  on Cavecreek Road has Lost something.  Complatiency no doubt.  Sodas were flat, service was slow, chips came a very long time after we sat down and finally when the food comes out I notice it wasn't oven fresh.  It was sitting out a while.  When the waiter said \"Hot\" plate I picked it up with my bare hands.  It was barely warm.  Unfortunately I won't be back.  I have given them many chances now.  Its just not the old Manuels of later days.  Do yourself a favor and keeping walking"}
{"text":"I've been here a couple times. I've always had great service and awesome food. Try the blue margarita,  it's delicious,  little spendy but well  worth it. I like this location much better than the Peoria location,  better food and wait staff."}
{"text":"I've been coming here for over 30 years. When I think of home, I think of Manuel's. Traditional Mexican cuisine, unbelievably friendly staff, and the worlds greatest bartender. I highly suggest you make this a regular spot."}
{"text":"Being new to Phoenix, we heavily rely on fellow Yelpers reviews. I have to admit, I'm a bit puzzled with the 4 and 5 star reviews. Here is my take on Manuel's Mexican Restaurant:

Chips & salsa: the chips were crunchy and not at all greasy or salty. They were perfect. The salsa was more like pico de gallo. The waiter asked if we wanted the \"hot\" salsa. I use the term \"hot\" loosely, it was very mild. The consistency and color was more like a mariana sauce. It taste okay, but it was the weirdest salsa I've ever had. I realize not everyone can handle spicy stuff so I won't hold that against them.

Manuel's Taco Platter (me): Instead of going with the steak taco that came with the platter, I switched to a carnito (pulled pork) and chicken fajita. I thought it was strange that it was named the \"Taco Platter\" since a chicken fajita came with it. The pork taco was substantial. It came bare, nothing but meat, but the portion was huge! Pretty good too. The chicken was grilled along with the green peppers and onions. That too was pretty good. My platter came with a side of guac, green chile salsa, sour cream and refried beans. The beans were not that good.

Carne Asada (my hubby): The steak was dry, not like beef jerky dry, but dry nonetheless. His meal came with a side of pico de gallo and a bean soup. I wish the bean soup came with my taco platter because it was delicious. 

I would go back for that bean soup."}
{"text":"Well, I have learned a basic rule about Mexican restaurants, if it's crowded its good (Or it's happy hour). I got nervous right off the bat, I chose this place the parking lot was almost empty and it was about 12:30 or right in the middle of what should be the lunch rush. We were seated right away in a nearly empty restaurant. From there I can say good chips though they say award winning chips and salsa, but the salsa tasted like El Paso out of the jar. The rest of the meal was outstanding. I had the Green Chili con Carne burrito enchilada style lunch special with green chili sauce on top. It was an amazing taste sensation. The beef was not shredded but more like tender stew meat seasoned to perfection and the beans and rice were pretty good too. My wife had the shredded beef taco lunch combo, She said it was good but about average for her. She really liked the chips but was not impressed with the salsa either.  I liked the novelty of the shirts they sell there, but in my circles I couldn't think of a time it would be right to wear it they say \"Excuse me, It's the frijoles\""}
{"text":"I eat here once weekly, and can't get order anything but the Chicken Enchilada with Norteno sauce, as it is a work of art. I have been eating here for around 15 yrs, and have had mostly great food. Occasionally they hire a chef who isn't up to speed, but they quickly right the situation, and get someone superb. The food is authentic, but they do use cheese liberally, so I usually request easy on cheese, and it's great. I have tried other Manuels, but this one is tops so far."}
{"text":"Driving around the Scottsdale area and decided to have a margarita. Yelped Mexican restaurants and Manuel's popped up. The food and margaritas were amazing!! Eddie our server was very attentive and nice. Susan the manager was 
Super cool and answered some questions we had about the surrounding area.
This is a MUST stop for any Mexican food 
Fan!!!"}
{"text":"I've been going here since I was very young, and it's still the best Mexican food for the money in Phoenix.  You won't be wowed by the ambiance, but everything on the menu is good. I highly recommend the green corn tamales.   They're the best I've ever had!"}
{"text":"The atmosphere felt good and customer service was good but i the food was okay i got the machaca dinner plate only ate rice and beans that come with it the meat was flavorless it taste it like if it was old we also got the shredded beef enchiladas and taco that was good . Oh and also we got an appetizer it was mini chimis I think those were good !"}
{"text":"My kids and I go for Mexican food at least once a week.  I always try new places, and have never been here before.  It is your standard Mexican joint...chips, salsa, burritos."}
{"text":"Great enchiladas.  Chips and salsa = good. Salsa is a little sweet and tastes fresh.  Service is superb. Rice and beans do not disappoint."}
{"text":"I love this place. Very friendly environment. Great food. Reasonable prices. Not to mention very fast service. Never had a bad experience out of my frequent visits. Would recommend this place to anyone who loves Mexican food."}
{"text":"This place has been here forever, and for good reason. The food is really great and so are the prices! I ordered the chicken especial and shredded beef taco. It was delicious. The service was fast, but we only saw our server one time through out our meal. We will be coming back again!"}
{"text":"Absolutely disgusting! Had the Chimichanga dinner and it wasn't even deep fried only on the corners. The guacamole tasted sour. Service was horrible, first there was a twenty minute wait for the 5 of us and so we waited. Well 15 minutes after us another party of 6 came thru and asked how long the wait is and they said 20 minutes. The party that came in after us got seated before us. Our waiter came to see us to get our drink orders and to take our food order that took over 50 minutes to get. I will never go back here again! What a nightmare and nothing is authentic about this place!"}
