{"text":"The new place on Gerrard, funny how two sushi restaurants opened at the same time (Manzen and Sushi on Gerrard).  The atmosphere in Sushi on Gerrard looked way too dark so I didn't go try it out yet. Decided to try out this place first

Atmosphere:
The interior of Manzen looks pretty awesome, very nice decor, although kinda small. Manzen I'm told gets a lot of take out orders. Felt nice and warm inside, people are nice and friendly. 

Food: 
High quality, very nicely presented dishes. They mainly serve rolls/sushi/sashimi and there is a lot of variety to those. Mazen's food tastes as good as it looks, very flavorful. Fish tastes fresh, bright vibrant colours to dishes. We got the white fish roll (forgot the name) but man, it was good!  

Service:
They actually have a japanese waitress!, A lot of japanese joints are overrun by chinese people, which is okay but sometimes... doesn't feel authentic just copied over. Friendly service, and two chefs there are also very friendly.

Overall a great new restaurant, will be back!"}
{"text":"Great spot! I'd say they are a cut above most other sushi spots, in terms of quality and overall presentation. I did take out so I can't speak to the service. I tried a combo plate of 8 nigiri sushi and a green dragon roll, as well as some seaweed salad. Everything was good, and while I was picking up my meal I saw the chefs preparing some sushi pizza which also looked amazing. It's a bit strange that two sushi places just opened up right next to each other (Manzen and Sushi on Gerrard), but regardless Manzen is a great addition to the hood. Last thing, the miso soup was nice, I don't like miso, but this one had some nice fresh ingredients in it, maybe bamboo shoots?"}
{"text":"A new find, thanks to a recommendation. They opened in early 2014, the space is brick wall with inlaid dark wood panelling, dub-step musak on the sound system. Youngish crowd. Not licensed but that is a good thing as it keeps the bill to a minimum and the cops off my tail. The food was very good. Plentiful count size and fresh. They have a somewhat limited menu but their focus, which seems to be on Maki rolls is really good and in some cases, inventive. We sampled a variety of Maki rolls including the spider roll, the dynamite roll, the las vegas roll...all of them were excellent with fresh flavours and good textures and contrasts. Friendly service too.
We will return."}
