{"text":"My friends' restaurant and that's the best BBQ Korean restaurant I had in toronto. You should try it."}
{"text":"Went here with some ex coworkers for dinner, great service right at the get go, the quality of meats was pretty great for the Korean bbq so much so that we actually ordered the beef tar tar to try because the meat for the bbq was so great. Atmosphere wise it was pretty loud but it's expected on a busy Friday night.  I would def go back again, with a group of friends."}
{"text":"I just found my new favourite Korean BBQ restaurant and I hope it's here to stay!!! Perfectly marinated and marbled meat cooked over perfectly set temperature (unlike the majority of places that turns the heat too high and meat comes out dry AF). This place is definitely THE BEST out of all Korean BBQ I've tried in Toronto!   Service: Top notch! It was a busy night but the waitress always attended us with a smile. Gave us great recommendations and patiently helped us cook the first round.   Atmosphere: I love the old-school decorations in the restaurant and the wooden walls, makes me feel like I'm back home, warm and cozy.   FOOD: Meats are very well marinated and marbled, reasonably priced. Table top bbq comes with a free soup and I love how to cooktop has slots for cheese  & corn dips!!! Highly recommend the pork belly marinated in wine, and the beef short ribs (must dip in cheese!) the beef ribs literally melts in your mouth!   I always drink Makgeolli (this white rice drink) with Korean bbq, I love how they serve it in a copper pot with bowls, really reminds me of back home (I'm not Korean but had similar experiences growing up in China). Highly recommended!  Seriously one of the best meals I've had in a very long time!!! HIGHLY RECOMMENDED!!!"}
{"text":"Not the best KBBQ experience I've had.   The meat and the sides were tasty, but a few things made this experience 2 stars.   The staff were attentive but overbearing which made the experience feel rushed. They were constantly cooking without asking if we were ready to move on. They didn't provide plates so they hurried us to eat the meat before it burnt. Recklessly, however, was how they mixed raw meat with the vegetables when cooking. For the prices charged, the portions were on the small side especially when charged at $20.  There wasn't one person who looked after the table, which meant that 5 people would be cooking your food (and you know what they say about too many cooks!). One person placed a piece of meat down and another came to change the grill which meant the meat was then put onto a cold grill.  One main reason we went here was because of the eggs and cheesy corn. Unfortunately, they had watered down the eggs so much that they never even cooked, and the cooker wasn't very well designed that the cheese only just melted by the time we left. They even turned the cooker off when the eggs were still raw.   The person we spoke to seemed understanding and apologetic but didn't discount anything on the bill which made us feel like they didn't validate our experience or concerns. We also had to pay at the counter, which no one told us until after we had waited 5 minutes.   Overall a poor experience from a promising restaurant. It's a shame, but hopefully they can improve and encourage a more relaxed atmosphere rather than rushing to get their customers out to make way for the next ones. It would also be great to see them coordinate the cooks a little better so you have one person in charge of your table."}
{"text":"They're food is delicious! Side dishes and everything else taste amazing. We ordered the bbq combo B and there was plenty of food. Not AYCE."}
{"text":"My boyfriend and I went for a late dinner yesterday. For a Tuesday it was still pretty packed but we didn't have to wait for a table. I really liked how the tops of the chairs opened so you could put your coats and bags into them. This prevented them from smelling of meat and smoke when we left.   My boyfriend and I ordered the LA Kalbi and Samgyeopsal with a side of rice. It came with a lot of side dishes, tofu stew and lettuce to make wraps definitely more than enough food for the both of us.  The service was great, our waitress was attentive and helped cook our meat. At the end we even received some Yakult (probiotic drinks) to help digest our food. Would definitely come back again!"}
{"text":"YUMMY!!! That's how I would describe it in one word. This place has amazing korean BBQ. The quality of the meat is top notch and the side dishes were ever flowing. They precook the meat slightly so that the cooking time on our personal barbecue didn't take that long. Weird to me at first since this was a BBQ place but I loved that since it meant that the food could GET IN MA BELLY a lot sooner.   I'd recommend the marinated pork and beef galbi! Don't forget to pair it with yogurt or green grape soju!  The one down side is, this place has a long line (because of its popularity) so be sure to go early or put down your name for a table reservation before strolling down the annex."}
{"text":"WHAT TO TRY?!  The Korean barbecue!!! Opened for a few months, this restaurant has different selections of fresh meat ready to be grilled!  I was amazed to see the side dishes were also very fresh! All the dishes were crunchy and tasted great!!  The raw meat comes neatly presented on a plate before the waitress comes start off the grill. One platter of meat is enough for two ppl! Add a tofu soup to complement your bbq meal!   LAST TIP?!  Stay for the dessert..which is the yakult! Which is the yogurt drink. Not as thick as the regular yop you hv as a yogurt drink but just as tasty!  There are some seats that look like cans. Drop your coats and jackets in there so it's out of your way and your jackets or coats don't absorb the barbecue smoke as much!!"}
