{"text":"This was the first meal we ate when we arrived in Laval and we loved it! The gyros are delicious. The tzatziki sauce is probably some of my favorite...and I've tried gyros in a lot of different places. My only complaint is that the meat was a little dry one of the three times that we ate here. However, the other two times, the meat was cooked perfectly! Crispy on the outside, tender on the inside. And I love their Greek salad and potatoes. A very filling meal for a reasonable price!   The staff here is really nice, too. We wanted to get takeout the first night we ate here and we had five people. We had no idea that there are two doors to Marathon Souvlaki--one side is the sit-down restaurant and one side is the takeout place. We went in the wrong door the first time and the staff kindly and patiently redirected all of us to the takeout side, then recommended meals for all of us. Great service!"}
{"text":"This place is awesome, I've been ordering there since I was a kid and can never get tired of it.  I eat here twice a week! Tzaziki is awesome and their pitas are killer! Highly recommend!"}
{"text":"Havent been in years ,but an old buddy of mine went there last week and reminded me about how and when we used to go out of our way from the 70s and early 80s,and how my brother Angelo would come with me the odd time and just scoff when they first opened it in 1977 , we knew the owner Philippe and his first partners and we knew it would be just so the best, situated across from a Macdonalds in our old stomping grounds.Chomedey Laval ,wow man,. I brought Sherilyn to Marathons in 1981 and she loved me more when we left the restaurant. So that was the trick when she was pissed at me I would bring her Marathons,, and that lasted until Angelo and me and George opened Angelos Cuisine Greque. True story"}
{"text":"The take out spot has quite another story from what I'm reading. This place is a rip-off. 1 souvlaki stick (great taste) slightly under cooked,small plate maybe 4oz. of their famous doner (lots of crunchy bits of meat in my order) entrée of calamari (total of 14 pieces) and two fries. No salads no tzatziki no nothing $44.00, robbery I should have gone for the platters much more food for probably a little more. The pricing make no sense. Maybe the person who took the order should have suggested better choices for the $$. Which shows good faith towards the client. The food was fine nothing special. The doner  was dry. Leo Gets was right you get screwed at the drive thru, in this case the take out counter."}
{"text":"Authentic Greek Food. Pretty much on the same calibre as what you can find on the Danforth in Toronto. Big portion sizes. Service is excellent. All the servers speak good english. We really enjoyed. Will be back the next time we visit Montreal"}
{"text":"I love to dine in Marathon,waiters are friendly food is plenty for what you pay for around 10$ dollars and they keep on bringing garlic bread :)the place is bit small sometimes it gets noisy and crowded.nice place to dine with friends."}
{"text":"It is probably the best Greek good in the area.. You won't go wrong ordering anything there. It is very clean. I really appreciate you can see the kitchen as you walk in. I like seeing how clean and fresh the food is before eating. It is a bit pricy but I think it is worth it."}
{"text":"If you're looking for traditional greek food, then this isn't the place to go to. But the people who go here aren't looking for that and for what they offer, they do it all very well. The gyro pita is amazing, I've probably had hundreds of them."}
{"text":"I love this place! I've been going to marathon for a good 10 years, and the food very is consistent.    It's a casual atmosphere, with pictures of Greece on the walls in the waiting area (more of a waiting hallway). The kitchen is right up front and open - as you walk in you see the orders being pumped out, and the gyro turning.   I usually get the chicken pita plate: a thick pita filled with a generous amount of garlicky tzatziki, marinated chicken (so tender!), tomatoes and onions, a choice of marathon salad (with lettuce, tomatoes, cucumber, kalamata olives, feta etc with a creamy dressing) or a greek salad (only tomatoes, cucumbers, onion, kalamata olives and feta with an olive oil dressing), and potatoes/rice.     A side of extra marathon dressing or tzatziki to dip the potatoes in is a must.. yummm. There are also complimentary baskets of garlic bread - a touch more garlic butter would make me very happy. The service is also very good."}
{"text":"We ate the Spanakopita with Greek salad. The Spanakopita (2) were dark and my wife's Spanakopita were burned. The salad had a chunk of feta cheese, lots of tomatoes, cucumbers and lettuce. Pita was also served. The waiter spoke both English and French and was helpful in answering our questions.Salad was great but not the Spanakopita."}
{"text":"Love this place!  Marathon Souvlaki has been a fixture in the Chomedey, Laval community since the 70's.  Their food is always fresh, expertly prepared authentic Greek cuisine.  This afternoon we had the chicken souvlaki dinner with accompanying marathon salad and rice and fries.  Service is expert and swift, this meal did not disappoint.  I regularly return when in the area.  Would recommend for take out or dine in.  Best Greek food in Chomedey!"}
{"text":"I'm giving a 1 star rating because it should NOT take over 90 minutes to be served your meal when you order at a restaurant!!! 2 people ordering and having to wait and ask, and ask again... first and last time I'll set foot in this restaurant.   Only reason I did not leave is because every 5 minutes I was telling myself, the food gotta be ready soon... was so hungry too..."}
{"text":"Great taste, efficient service (we order often at work and at home from this restaurant, as well as pick up). Never been let down, always tasty and solid portions. Usually take either chicken pitas or doner pitas, fries and salad are tasty as well and the tzatziki is one of the best out there."}
{"text":"This is a great place to eat either on site or take out. We also order often at work and its comes really fast. Portion are good I wish they had tzatziki sauce in their meal especially for take out. Super fast service and they are very friendly so thats a plus. It is a bit pricey for the size meal you get so thats why they didnt get my 5 stars"}
{"text":"So much love for Marathon! Fast delivery, delicious and a great price."}
{"text":"Hyped. Chicken pita is chicken kebabs inside a pita. That just makes it not a pita wrap.  Goat cheese is excellent with salad.   Food not very inspiring. Cost effective not pricy."}
{"text":"Been ordering delivery from Marathons all my life. If they had a VIP badge, my family would have one. Love the food, quick delivery and great price. I order twice a week and only guilt stops me from ordering more.   Highly recommended."}
{"text":"2 Words! DONER PITA!!!!  This is the only place I order this from. The salty, crispy, mixed meat with tzatziki and chewy pita. OMG, so good! Thank God I don't live close by, or I'd be there 4 times a week! Then there is the Marathon Salad, you have to order this with any meal you get. The dressing is perfect. Oh, and of course a side order of Tzatziki to go with the complimentary garlic bread and your fries.  The service is always great and meals are fairly priced. Just go and try it! You won't regret it."}
{"text":"Fantastic lunch. Our waiter was great and so was the service. Price for what you get good value."}
{"text":"Classic Souvlaki, as good as it gets. Cheap, Fast amd Delisious."}
{"text":"Fanfuckingtastic service AND food. Mingia bro, this shits awesome too. The place was packed out the ass, so I'm guessing its pretty popz."}
{"text":"Usually I'm extremely satisfied with their plates, but the last couple of times I've went, not so much. I always get takeout. The food is good, don't get me wrong, but if I'm paying $20 for a plate I expect it to come with a decent amount of food. Barely any rice and a very small amount of gyro meat have left me disappointed time and time again. Their customer service, however, is great. If they upped their portion sizes a tad (or lowered their prices) and included tzatziki in their plates, they would get 5 stars. For now, I don't find it worth the price."}
{"text":"Here it is. The one and only. Where it all started. Marathon souvlaki. I've been eating here for 20 years now. And the biggest compliment that I can them is that the food has been exactly the same for 20 years, probably longer. There's never a surprise. You get what you expect every single time. Best souvlaki in the montreal area. Don't let the amateurs tell you differently. You can take your Marvins, Village Grec, and Arahova and stick em where the sun don't shine because that's where they belong."}
{"text":"Still no tsaziki included with doner plate. Have to pay an extra where as every Greek restaurant in town includes it. Have been a regular here for 20 years. I recently had supper with a friend in December and was shocked at how small the doner plate had become. There was barely 4 Oz of meat. Portions have recently been shrunk and prices have increased"}
{"text":"Prix élevé pour le type de nourriture. Par contre, la qualité des produits ainsi que le goût sont au rendez-vous!"}
{"text":"My sister and I love this place! I always take the chicken gyro during lunch time and enjoyed every bite of it. I am happy with the food, the price and the quick service. The place is always clean and the staff are friendly people. Just love it and have nothing to complain about."}
{"text":"Marathons makes a fine souvlaki but you gotta eat it fresh. I made the mistake of doing take-out once and it just wasn't as good as it is fresh. And you want the meat to be hot to contrast that cool tzaziki sauce.  Marathons is definitely not a place I go to often but it's also not a place I can stay away from for too long before I get a craving.   Just writing this makes me wish I had one right now."}
{"text":"Been coming here for years! Great fresh food, excellent service. Who can resist that Marathon salad????   Not much has changed over the years even the parking is still bad lol but one you get in, it's so worth it!"}
{"text":"I LOVE MARATHONS!! Everything is fantastic. It always tastes the same which equals HEAVENLY... that's all I can say."}
{"text":"Marathon Rocks and I've been eating there for decades.The tzatziki is possibly the best in the city and kills my breath and stays with me for a good 20 hours every single time I eat it. I mean I'll shower the next day and in the shower I'll smell the garlic tzatziki coming out of my pores. Makes me smile every time it happens and is totally worth it. Garlic Rocks!  I've been a vegetarian for a long time and their veggie souvlaki is seriously good and covered in that awesome tzatziki. My pals from back in the day that still eat the meat souvs, say it hasn't changed at all. I used to get the Doner plate back in the day and I can vouch for the smell - hasn't changed in 20 years.  The potatoes are round and ridged and not that good, it's the only thing they should have ditched 20 years ago. Yeah I know that's blasphemy to some of you but history and sentimentality should never trump taste.  Despite the fact that the potatoes suck, Marathon is about the great Souvlaki it serves and the unbelievable tzatziki sauce that bathes it with garlic-orgasmic goodness."}
{"text":"I love it, had a great meal with my family, generous portions , tasty , very well presented and served. The flavours are authentic and well balanced . My kids enjoyed the calamari . I had a pita plate. Very tasty and the salad that came with was fresh and tasty. The server was very welcoming and pleasant. Prices are very reasonable and you get more than what  you pay for. Had a greek beer , oh what a surprise , really good and refreshing .I will definitely come back and i highly recommend it."}
{"text":"One of my favorite places to eat for 20+ years now. Traditional Greek cuisine that hits the spot, especially when you need a boost.  Pros :  - Many different and delicious dishes to try out. My all time favorite is the chicken pita platter with their delicious marathon salad and fries.  - The Tzatziki is fantastic.  - I recommend any lamb dishes they have.  - Service is extremely friendly and quick.  - Take out counter next door is fantastic.    Cons :  - Pick your times well. Going there on a Saturday night at 6-7 PM can be exceedingly frustrating as they are usually full with an hour wait at times. Furthermore, the waiting area gets packed with people and the service has to wade through the crowd of hungry clients. I strongly recommend going there early or late, you won't regret it.  - Sometimes service isn't up to par. Seating arrangements can be better. Why seat people in bunks when they are only 2 when people are waiting with group of 4 or more?  - If you plan to come during prime time, parking is interesting to say the least."}
{"text":"This is not a authentic Greek restaurant , nothing but nothing is tasty, they assume that they have great souvlaki , I say they have Shitty SHITSVLAKI  :) the meat is hard, and never fresh it does not even taste like a pork it's just disgusting , SHITSVLAKI  they serve is preecooked  probably made 1 hr before and waiting to be served , I understand they are busy but that does not mean you have to serve your customers  preecooked  meat, Service sucks they are very slow . And you can never have a decent conversation with your wife or friends cuz everyone is screaming and yelling , not a pleasant restaurant , also the bread is tasteless , round cut So called french fries when they bring it to you table and when it's  still warm it tastes and looks ok , after 5 min it feels  like cardboard and tastes disgusting . Ooo b 4 I forget we had to wait 20 minute right in front of the washrooms and the dishwashing room ( doors are wide open ) but that's fine I understand they are busy , while you wait right  before you eat you have to inhale  that disgusting smell  coming from the dishwashing room and fthe bad smell of the washrooms . Now Iam asking you is that normal ? Some of you might say we'll  they are around for so many years blah blah blah but I say the food is tasteless  I ordered saganaki they probably use the shittiest quality processed cheese it's soooo salty it's disgusting but there signature dish so called souvlaki ( SHITSVLAKI ) does not have any taste what's so ever. Iam never ever going back again , do they care ? I don't think so but I rather spend little more money and eat better quality food  at authentic Greek restaurant."}
{"text":"Good half decent at best and service was beyond terrible when the waiter decides to argue with you over why you ordered your meal before the appetizer"}
