{"text":"Very convenient, fast quick and fresh.  At breakfast, lots of choices on the buffet - fruit, yogurt, cereal, eggs, bacon, ham, potatoes, muffins, scones, pastries, croissants... Also do cooked to order breakfast sandwiches and wraps."}
{"text":"Located on the main level of 393 University Ave  Its main attraction is the self serve hot and cold buffet.  You pay by the weight. Food selection varies daily. The last time I had a stew consisting of potatoes and beef and side of sweet potatoes. It tasted good and was kept warm.   They also have a sandwich bar and a self/serve coffee tea area too.   One deal I'd highlight is the muffins. They are twice the normal size and only $1.25!  Good for breakfast on the go. ;)"}
{"text":"Located on the bottom floor of the court house, this little breakfast/lunch spot is convenient, if nothing else!  There's a buffet style hot lunch and salad bar, as well as a window where you can get a freshly made sandwich. Great little spot for breakfast or lunch on the go. They've also got fruit, instant oatmeal and some other healthy snacks in addition to brownies and other treats.  and they take credit cards, yay!"}
{"text":"The food is decent HOWEVER don't be fooled by the buffet take out. I warned a friend that it is priced by weight. His takeout container ended up costing $16+. Poor guy."}
{"text":"The ladies at the food counter, use their gloves so incorrectly its horrific. They touch bacon and meats and then put their fingers in the veggies, it doesn't make sense. Constantly asking them to change their gloves, then of course you get the \"look\". Most of the time your food will have a smell of meat, when you don't order the meat.  the buffet is Gross, the scrambled eggs are normally brown/black and there's slim pickings, oh also they don't label the food so you never know what it is. For a place in such a busy area, they need to step UP their game. We just all boycotted them here at our office."}
{"text":"In general this ground floor self-serve joint is barely decent. Their bagels are always stale, several of their staff are extremely slow, and their buffet table/salad bar is extremely over priced.  Their hot foods mostly taste bland.  Better options are Kitchen Table over at \"The Atrium\" on Bay and Dundas, or for salads next door at Sushi and Salad which has far better quality food, service and value."}
