{"text":"Fantastic pizza place in the heart of Kensington market. Mare pizza is (at least) a weekly occurrence for me, whether it be an after work snack, lunch, or some post bar food. I have converted all of my housemates to this awesome pizza joint!

A slice ranges from $3.50 to $3.75 and they are very generous with their sizes, sometimes they can be a little old but you can always ask for whichever is the most fresh.

Their whole pizzas are reasonably priced and they place the toppings under the cheese to keep them nice and fresh."}
{"text":"Great ( old school ) pizza made by 
Honest hard working people . My teenage daughters and my  favorite! ...try the veal."}
{"text":"TLDR: great family shop for a quick bite or for a meal to take out. well loved by Kensington locals

i work in Kensington and eat here very often. if you need a quick slice and pop for 5 bucks this is the spot. if you have time try one of their italian sandwiches they are huge and well worth the price. very tasty and the family that runs it are among the nicest you'll meet in kenzo. dont be surprised if you get the boss one day, his lovely wife the next or one of their young but very courteous kids running the shop the next. its a trip seeing a 12 year old command a busy quick stop resto so well haha"}
{"text":"One of the best places I\"ve been to. I'm here at least once a week to get a slice or a large pizza. 
The prices are great and the slices are always fresh!
I always get a whole pepperoni pizza with cheese on top, its great!"}
{"text":"Don't judge a book by its cover.  This is how I feel about Mare Pizzeria.  Doesn't look fancy outside like other places and probably won't attract too many foodies but I had a Hawaiian slice last weekend and was pleasantly surprised.  A very good portion of cheese and ingredients, crust was not dry like other places that also warm up the slices for take out. 

Service was quick and price was fair.  Definitely much better than anything at Pizza Pizza and I would say rivals the fancy Neopolitan style pizzas out there.  

Give it a try and you may be surprised too.  For a few dollars, you've got nothing to lose."}
{"text":"Best authentic pizza and Italian sandwiches in Toronto, hands down. Late night hours for Kensington Market and people out in the town in the west end. Johnny the owner makes the best red sauce which makes the pizza sandwiches and pasta excellent."}
{"text":"Best pizza I had by the slice in a long time. Great crust sauce etc. Place itself isn't fancy.. But fancy isn't the point. Fridge kept drinks on the warm side but it's not a big deal. 

Recommended for those of you on the go at Kensington"}
{"text":"This place is pretty good. Located right on a busy section of Kensington Market. I had a slice of pepperoni. It's not quite as good as Fresca Pizza just up on College St in terms of a good NY style slice, but they are real close together. Prices are normal for the area."}
{"text":"I don't understand what all the fuss is about.  Maybe because its been around for a long time?  The good, you get a very large slice for $3.50, really its like two slices, plus the people who work there are very nice. The bad, taste is mediocre, kind of like pizza pizza.  So if you're looking for something cheap that fills you up maybe this is for you.  If you want really tasty pizza go elsewhere..."}
{"text":"Semi-intoxicated update:
The scene: 34-year old who had two beers on a saturday afternoon weaves in and requests a cheese slice in which she thinks is the politest way she can manage.

The experience: hot from the oven, she carries her piece of delectability home, quietly mumbling to the warm, cheese mass \"you are mine. Shhhh, no one will take you from me.\"

The moment: in her apartment, she picks the cheese slice up with her fingers. She pulls a piece off a triangle, yelling at it because it took all the cheese with it and oh no, it must leave cheese for the others. 

She eats it once piece at a time, revelling in the highly-flavourful sauce and nuanced crust that DOESN'T EVEN NEED DIPPING SAUCE (dipping sauce is the cosmetic surgery of bad pizza). 

Soon finished, she wipes the grease from her hands, fully satiated and dreamy-eyed. She passes out at a reasonable 8pm on a Saturday, with the lingering smell of oregano and tomato playing in her living room."}
{"text":"While exploring Toronto this summer I walked by on a hot day and I was thirsty, ordered two pop and the cashier raised the price on the spot. The menu clearly said $1.00 but she wanted to up charge us, the female cashier must have wanted to pocket the difference and got angry with us when she realized she got caught. Needless to say every time I walk by I recall this story and tell people to stay away from this place... first impressions ruined that's for sure."}
{"text":"Went here with my friends to try some inexpensive pasta. It was a long wait to get our order (longer than the 10-15 min they said it would take). I realize the timing may have been because the pasta had to boil. We split one order of rigatoni, which obviously was not enough to fill us, but it wasn't the portion that disappointed me. The sauce wasn't bad in flavour but it was definitely underwhelming and was a little too thin. We had to add some chilies to give it some kick. I plan on going back but not for this dish. I think this place still has some promise regarding their cheap slices and sandwiches, which I plan on trying next time."}
{"text":"Pretty good place to grab a slice from. The staff is usually really friendly and their slices taste authentic, to me at least. I enjoy their crust, it's usually nice and crispy."}
{"text":"Great pizza. $3.50 for a slice fresh from the oven? Can't beat that. They're constantly making pizzas - constantly!

Besides the slices you can also get whole pizzas to go, and call in to order as well - but really the slices are *such* a good deal it's actually about the same price to get a whole pizza as it is to get multiple slices.

This was my go-to spot when I lived down the street. Need an afternoon snack? Mare. Need a late-night snack? Mare. They're like always open!* 

*always as in until ~2-3am whenever people are done drinking and then done eating"}
{"text":"3.5 stars

Def five stars would be given for what you get. \"One\" slice is around $3.50-3.75, tax included, and it is MASSIVE!

Pizza is really nothing to write home about. The crust is thin-ish but very crispy on the bottom (which also makes it a tad dry). Not a lot of cheese on top. Good distribution of pepperoni.

Would go back if craving pizza."}
{"text":"Great little spot in the market to get a slice of pie. Thick and juicy, these slices aren't a typical mass produced slag that is built to a certain standard. Personality is what sets Mare Pizzeria apart. Instead of a slice, I had a sausage sandwich which was great! They had sliced the sausages down the middle so the halves would sit flat on the bun. Then slathered with sauce, a little cheese, and some kickass hot cooked peppers added here and there, simply a beautiful thing. Check it out if you just need a basic pick-me-up when pounding the pavement thru Kensington."}
{"text":"Came here around 1am on Friday night for some night time munchies. I got 2 slices of pepperoni pizza and it was $3.5. The slices are very decently sized and the pizza was very delicious. Nothing too special compared to other pizzas but it's open late and the proportions for the price are worth it!"}
{"text":"Went there last night..had a pepperoni slice..huge..thin crust and very tasty..my friend had a panzo..pepperoni..mushroom..ham..was made fresh..and was quite good..although the ham was forgotten...would go back"}
{"text":"I haven't had a slice of pizza this good in a long while.  

It was amazing. For around 5 bucks I got a huge couple of slices, garlic sauce , and a drink. 

Great price and friendly service and great table to look out at Kensington market and all the people passing by."}
{"text":"So after ordering and paying, I was told they are out of the veggie slice I purchased. So opt for the deluxe. Not quite sure what they did but the pizza was doughy and gummy especially for a thin crust pizza. Ranks near the bottom for any pizza I've ever eaten."}
{"text":"My fave place to grab a slice while picking up some fresh groceries! And that's saying a lot cause I live beside four pizza places beside my house but it's worth the trip to Kensington! Nice and fresh and piping hot! I wish they delivered!"}
{"text":"Great place if you're hungry and want a quick, cheap and plentiful bite!! Ordered a slice of pepperoni pizza and was actually given two!! (Which I think is standard). The crust is thin and crunchy, just the way I like it. 

There's not a lot of seating, but it's not really needed since Kensington is a great neighbourhood to walk around in. If you're set on staying and eating though, they also have a small ledge on the outside of their shop for eating!"}
{"text":"Be careful, the younger female staff do not wash their hands, have zero food hygiene experience and do not care! They will also try to rip you off, up charge you on bills if you are not paying attention. The owner knows how to make a pizza. The rude kids who work their are useless."}
{"text":"They make one of the best crusts I've ever had, chewy and thin and just right, however, there is hardly any toppings at all, no attempt at a sauce and a micron thickness of cheese. I went several times but gave up, it's only pizza for the kids going to get drunk in the Market area at night. 

I tried a panzerotto and the dough is so thick and uncooked, half way through it I just put in the trash. It was a centimetre thick at least. It was like chewing raw rubber. 

I caught the asian girl behind the counter going all the way downstairs to get dough and touching the walls and doors the handling change and NOT WASHING HER HANDS before she started making the order! I pointed it out to her and she washed  them, I also told the owner. Bet a few minutes later with a different customer, she did it again. Every time I walk by now, I see her serving customers and think of those fingers....

Enough.
I gave them a good try."}
{"text":"Massive NY style slice for under $4. Super fresh and light. Def worth a visit. The owner made it for me himself. Awesome service at all hours"}
{"text":"Tucked away in a little alley-like street, my boyfriend and I pulled up to this cute little place! Packed at 11pm on a Sunday (the day before a holiday), we were pleasantly surprised to find this pizza place open. The reviews on this place were good enough for me to bookmark them, so I had to check it out. With the place being packed, we couldn't order a pie without waiting forever so we ended up getting 6 slices which equaled a pie. IT WAS SO GOOD! Super cheesey and melty. Good prices. When we pulled off the cops were pulling up to get slices. Will be back here for sure !"}
{"text":"One if my favorite pizza places in Toronto. This place reminds me of those small ma and pa pizza places in New york. They make their pizza with live and it tastes amazing. Make sure to get their custom garlic dips :)"}
{"text":"Ordered the cheese pizza slice. Got two slices instead. They were served piping hot. Burned my tongue and roof of the mouth but it was totally worth it. For $3.50, it's a great deal and excellent value for the buck."}
{"text":"Decent slices... They r quick.
3.50.
Kensington market. Best of Toronto.
Needs AC..
Still too short.....??"}
{"text":"I don't want to admit it but I like the cheese pizza here.  

It's a hole in the wall.  Guy takes money and handles pizza...no hand washing in between.

Do you remember that episode of Seinfeld when Jerry wants to know if there are any homes to rent in Tuscany because The Maestro (Bob Cobb) says there are no vacancies.  Jerry doesn't want to rent a home, but he just wants to know if there are any available because he can't see how there are NO homes to rent.  

Jerry:  Are there any homes to rent?

Guy: Si, Si

Jerry: I'm not looking to rent.  I just want to know if there are any available to rent.

Guy: Si, this one!

So while I wasn't looking for a house to rent at Mare Pizza, my inquiry about fresh slices went a little like this.

Me:  Do you have any hot slices coming out of the oven soon?

Guy: (points to sign with different types of slices available)

Me: Do you have any coming out fresh?

Guy: (points to sign again)

Me: I'll just have a cheese slice

Guy opens the oven and reveals a pizza pre sliced with different slices on it.

The short end is:

Pizza was pretty good.  It wasn't dry being in the oven that long so I guess it was fresh.

It actually reminds me of a pizza place in Dufferin Mall when I was a kid (This is before the big food court renovation)."}
{"text":"This place is great! Its exactly what you look for in a pizzeria. Looks like a dive from the outside but this is easily one of the best pizza slices I've had in TO. The price is fantastic, $3.25 for a slice (which is really two huge slices) ... amazing! It is always fresh and full of flavour. Crust is crispy but hot and soft on the inside. Real Italian pizza at a great cost. Definitely recommend and friendly staff"}
{"text":"Bingo! I have been by here a million times. Today I stopped in a had a slice of Hawaiian Pizza and a pop.

First of all, the slice of pizza was a meal in itself. It was not the best pizza I have ever had, yet very good. And it's 3.75 price made it very damn good.

A can of pop was 1$. All taxes included. Lunch under 5$!!! And in Toronto at that.

Service is great. Super friendly.

They have a few seats inside if you are looking to eat here."}
{"text":"Came here on the recommendation of a friend. It is a great spot to grab and go NY style pizza. The prices are cheap, and service is quick. They have daily specials that change, but always include cheese and pepperoni. I got a service (which is actually two slices), or the cheese, green peppers, mushrooms and pepperoni. It was good, pizza crust was chewy and not too thick and the crust was crispy. It wasn't super fresh, and could have been hotter, but otherwise, it was all good :) Sodas can be found in the fridge when you enter place.

What really sets this place apart is the ?owner?/man behind the counter?. He's a super friendly guy, who didn't hassle me for taking forever to pick which kind of pizza I wanted. He's all service with a smile and radiates a genuine kindness."}
{"text":"[LOCATION] - 4/5
This place is located on Baldwin St and Augusta Ave in The Kensington Market. 

[SERVICE] - 3/5
Staff were friendly. No complaints here. 

[DÉCOR] - 3/5 
Small, limited seats, there are bar stools and tables if you want to grab sit down to grab a quick bite. 

[QUALITY] - 3.5/5
Pretty good quality, better than slices from pizza chains. The pizzas have a thin crust and lots of toppings! 

[ORDER] - 3.5/5
Deluxe Pizza Slice - $3.75: thin-crust and huge slice! In terms of taste, nothing blew me away and just tasted like a good ol' pizza. 

[OVERALL] - 3.5/5
I would recommend this place if you want a solid thin-crust pizza. Nothing fancy, but it hits the spot."}
{"text":"Terrible Customer Service:

I asked how long of a wait for Hawaiian. The guy said 7min so I ordered a slice and a pop. 10min later I asked how long and he said not much longer and asked me if I wanted to try a cheese slice.  I said sure thanks and he passes to me.  

I thought, I don't really like cheese pizza, but if it's free why not eat it.  

He then calls Hawaiian about 10min later.  20min vs 7min.  And he tries to charge me for the cheese slice.  

He then refused to give me the slice I paid for.  He finally gave me half of it.  He then said if he gave me the slice I paid for his boss will kill him. 

Well, looks like his boss is the real loser here.  I just moved into the community and I eat out every meal and I'm never going to eat here again."}
{"text":"Not sure why this place doesn't have more reviews... As pretty much the only late-night food joint in the market itself - this place really delivers. I came at 1:30am the other night and my slice was fresh out of the oven! The pizza is great: thin crust, good cheese, not too much sauce, 3.25. I came again the following day for more pizza I was so impressed! I talked to the owner about my great late night experience and he told me that as long as he has customers coming in he keeps making pizzas because, as he says, \"after half an hour the pizza is no good\" wow! So glad to have a pizza joint in the hood that cares about freshness. I'll be back to try their sandwiches! 

This place blows Amatos and fresca out of the water."}
{"text":"Such a cute hole in the wall with epic pizza in Kensington. Super slow service but I would argue it's with it  They only except cash fyi."}
{"text":"Best takeout pizza I've had in a while. Big slices, so much cheese and a great sauce as base. Reasonable prices and the Kensington market setting is perfect for pick up. Call ahead if you're picking up!"}
{"text":"This spot is by far my favourite spot to get a slice of pizza! It is a very small parlour in Kesington Market but a must try. The slices are a good portion and only $3.50! My favourite is the Hawaiian pizza with chilli flakes and chilli oil! Very tasty."}
