{"text":"Went to the meat market next door, saw this place and tried it.

OK'

It's a hole in the wall. It did stink in there, so I wonder if I came in on a bad day.
Food was OK, Once is enough for me. 

Not Bad, just not good enough to go back. It didn't wow me."}
{"text":"The food is good but definitely overpriced for the establishment.  The micheladas are a must!  The servers need a longer course on customer service skills."}
{"text":"Maybe their cooked food is good, but I was disappointed with Agua chile, it wasn't salted, the shrimp were warm and the \"Agua\" part was exactly that \"Agua\"(water) instead of lime juice. Besides that, they don't have camarones a la cucaracha, AND they put mayo on my mother in laws salad instead of ranch."}
{"text":"Not the business.. If your stomach is growling and your hungry for some mariscos that are gonna hit the spot macizo..... Don't go there. Ceviche was decent at best, my shrimp cocktail tasted like it needed life. My girl got some botana that had lobster grilled tilapia shrimp wrapped in bacon shrimped fried in batter and said that all of it was bland.. I don't usually deprive my waiters/waitress of their tips but with this one I had no choice, I left a 3 dollar tip on a 50 something dollar tab. Horrible service and not quite hits the spot food. This is actually the first review I've ever written before this I didn't even have an account with yelp to write reviews I mean I've wanted to write reviews on places even when they were bad, but never did.. This place was so disappointing that I took the time out of my day to download yelp, create an account, confirm the account on my email just to come back to the app to write this long review.. And the only reason I did is because I don't want any other person that knows what a good marisco tastes like to walk in and settle with this place. Hope this was helpful..."}
{"text":"($4) Ceviche Tostada = Relatively fresh (not too fishy), huge portion and can easily be shared

($3) Smoked Marlin Taco = Not my favorite twist on a fish taco

($12) Camaron Chipotle = Creamy chipotle sauce was good in small quantities, but a little rich.  However, the dish was stuffed with 9 or 10 shrimp.

This place certainly is a hole-in-the-wall with unpretentious dishes, but I'd probably come back once more to try out a few other menu items.  This is a unique place to eat mexican dishes that aren't available at 'mexi-merican' restaurants (eg. On The Border).

On a side note:  What the he11 is up with that jukebox?!?!  It is CRAZY LOUD when somebody pays for a song."}
{"text":"do not eat here at all went the saturday 3/2/13 had this big bowl thing that had fire in the middle shaped like a fish started eating looked at one of the shrimps and there was a fly that was stuck in it told them to take it away from me and no one came and said sorry nothing gave me a discount it was so nasty. do not eat there at all!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}
{"text":"The service is awesome but the food not so much. The food is plain compared to most other Mexican places, or my house ha"}
{"text":"Terrible service. Food is too expensive for it to be burnt and over salted. Would not come again."}
{"text":"Low quality seafood! Taste like they took it straight from the ocean onto a plate. No flavor. Worst seafood I have ever tasted"}
{"text":"I got the tostada ceviche and it was ok. The portion was big but it was a little fishy. Portions are big so next time I go I'll make sure I have a bigger appetite. 

I am looking forward to trying more on the menu."}
{"text":"Came here for lunch with the team at work - the seafood was very fresh and tasted great!  I had the seafood ceviche: octopus, oysters, scallops, shrimp, etc...and the 7 Sea soup with tortilla.  The variety of hot sauces was great and I enjoyed the \"habanera\" hot sauce quite a bit - no serious kick here, but spicy enough for most people.  The soup was filled with fresh seafood along with crab legs.  Not convenient to crack the crab legs with a work crowd, but a lot of fun nonetheless.  Some had the shrimp tacos, machaca beef chimichanga, salads, etc...all the food looked very fresh.  Warning: the portions are very large!  As far as atmosphere goes, well, it doesn't have any - it's definitely a \"hole in the wall\".  Will definitely be back for the other dishes."}
{"text":"Visited from CA and wanted some good Mexican food.  Well we found it.  Food was exceptional. Add a fun atmosphere and wonderful service, which means... we'll be heading back here again soon"}
{"text":"We picked a restaurant like a dart on a dartboard.  It had a great atmosphere, not crowded, and the waitress was really friendly and courteous.  Food was good, the shrimp tacos were about a 4, but we were disappointed, or rather spoiled with the shrimp cocktails. The juice was kinda watered down, not a whole lot of flavor, unless you add Tapatio and the free chip salsa to it. We were used to shrimp cocktails from south of the border, so we had a higher expectation. No big deal, we loved the food, the service, and the location."}
{"text":"Authenic, great flavors. Beans are so delicious; grilled bass for fish tacos? yes, please! you'll get a couple of weird looks for being white. Deal with it...others have to deal with it multiple times daily. Their seafood cocktails are not to be beaten. Their fried whole fish looks amazing, and I'll be trying it."}
{"text":"Wow....another great find in an out of the way strip mall. Very extensive menu...mostly seafood, odd, I know, for Phoenix. The food was fresh, unusually flavorful and unusually flavored...not like any Mexican food I've ever had. Big portions, very nice service. I'd go back in a heartbeat."}
{"text":"This resturant was absolutely delish!  We tried their shrimp cocktail that left my taste buds satisfied and had their seafood platter that had fried and grilled fish and shrimp,lobster etc plenty of tortillas and a a plate with rice and veggies.  They also had shrimp with fish rolled in bacon OMG.  My first time and it was great. Thy have a very impressive menu. The service was good and it was very clean.  I'll be back :)"}
{"text":"Omg. This place is really good great service.  It's my first time here in the waitress helped us decide what to get and it was good. My family and I will be coming back."}
{"text":"The food was good, but the service was very poor. We stood at the door for awhile before even being acknowledged. Drinks sat empty on the edge of our table with no refill being offered since we were ignored by every person working. I had to go up to the front to request our check to leave while others had theirs brought to them & the restaurant was not very full. 

Maybe a to-go order is your best bet."}
{"text":"This is the best flavour for money I've had. Anywhere. And my job is traveling. If your in Arizona or even the lower halve of the States then this place is a must. EPIC!"}
{"text":"Food and seevice was just ok. What really threw me off was that the server added the gratuity and we were only a party of 3 adults and 2 kids. I asked her why she did that and she was pretending she didn't know what happened.         La comida y servicio estuvieron mas o menos. Lo que me molesto es que la mesera se agregó la propina y solo éramos 3 adultos y 2 niños. Le pregunte porque hizo eso y pretendio estar confundida.  Eso me parecio bajo y CORRIENTE."}
{"text":"Food was awesome! I highly recommend the shrimp ceviche tostada and a michelada ;) 
Our server was great! I will definitely be back!"}
{"text":"We walked in at 820pm. Party of 10!. I'm sure they gasped...They told us the fryer was already off and no fried food was available. That's the only reason I'm giving them 4 stars. Otherwise, the food was incredibly outstanding. We had shrimp cocktail... awesome! The shrimp ceviche, delicious! And my cousins both ordered the chef specialty fish filet... oh my god that's good. I'm from orange county, California out here for mx vs usa game and yelp hooked me up again!!!! Thiis place is on my must go back places.   Just a little earlier next time"}
{"text":"This was the second time I was there.  Great food at a very reasonable price.  I would skip the nachos but anything seafood is fantastic.  The bacon wrapped shrimp were great.  Everyone around us was having ceviche, I'll get that next time."}
{"text":"I love this place, I have tried several things on the menu and have never had something I didn't like. 

The seafood is fresh, and there are a lot of options for preparation. If you are unfamiliar with something, dive in and try it!

Plus: 
The servers are always friendly. 
Food arrives fast and hot
I have been there a couple dozen times, and there is always something I haven't tried yet.

Minus: 
The music can be REALLY LOUD. Being a nerd, I started the decibel meter app on my phone - it reached 101 decibels at times! I found this on Yahoo Answers: \"100 decibels, equivalent to a chain saw, pneumatic drill, printing plant, jackhammer, speeding express train, some car horns at five meters, farm tractor, riveting machine, some noisy subways [about 20 feet].\" So yeah, the other reviewers are not exaggerating when they say it's loud in there. 

The lighting is super bright fluorescent bulb style.
These 2 things combine to make this not the place for a relaxing dinner after a long day at work. It's more of an adventure, so find something you haven't tried yet, shout out your order and enjoy that michelada!"}
{"text":"eh comido ahi mas k le falta el sabor autentico de Sinaloa. Yo soy De Teacapan Sinaloa y pues yo pienso k le falto ese detalle"}
{"text":"mmmmm, the fish tacos are so delicious, big portion. fish tacos ae the only thing iv'e ordered here. I'll have to try the ceviche next time around. I always come here for my seafood fix. service is good and fast, waitresses are nice. i would reccomend this place."}
{"text":"My girlfriend and I were waiting for her car to be fixed and we made the miserable mistake of taking a sweaty stroll in the 106 degree Phoenix \"dry\" heat.  But, our misery was quickly quinced when we found this cool spot.  We walked in and we were immediately enamored by all the vibrant colors and the family ambiance.  Then a very lovely lady, who was our waitress lucky us, served us.  The food came in a timely manner and we were happy as the cool cucumbers that we ate in our entree.  Well, actually the dish was a little spicy for me, but my girlfriend loved it.  The father/son duo, live music placed the calming cool sound in our ears to cap off our outstanding visit.  I cannot wait to go back!"}
{"text":"Great dinner!   We found this restaurant close to Arizona grand resort and picked it because it sounded authentic.  It was great!  We all loved what we picked and even my teenaged boys couldn't finish all their food.  Definitely worth checking it out.  Our sever was very friendly and helpful and we worked through the language differences well."}
{"text":"Molcajete Barba Roja. Means carnivore's delight in gringo. Serves two. In abundance. So impressed, no kiddin'. The octopus was grilled and perfectly not too chewy. Grilled, HAM wrapped shrimp. What the ef. Why I not think a that? Chicken, steak, rellenos, sweet scallion. Heaven? Yes."}
{"text":"We were intrigued by other collaborators, but really good service and food removed my hesitation.  The menu is just so different than what I am used to.  Seafood-centric they feature meals for two or family style.  But great taste and serving size make this a great value for couples and families."}
{"text":"I've been to this location three times. The service is fine, but that's not the reason why I'm writing this review. The most recent times I came here, I ordered a small shrimp cocktail. Now, they were great. At first, but both times, I've gotten sick. Just be advised the shrimp cocktail will make you sick."}
{"text":"The service wasnt very good. The food was ok, the value was there and the fruit water was pretty good."}
{"text":"When I think of authentic mariscos (mexican seafood), I think about this place. Its not fancy, but its definitely the place to go for ceviche, whole fried fish, shrimp cocktails, 7 mares, and shrimp prepared about a dozen different ways, as well as margaritas & micheladas.  I took my parents here while they were in town & they wanted to come back the very next evening."}
{"text":"The food was ok but the service was really slow. It might have something to do with the time of the day. Maybe it would have been better if someone would have acknowledged that I was there. Maybe next time I'll call my order in. Other than I'll give it one more try and see what comes from it."}
{"text":"Good food, good price, poor service.  Great rice and beans and moist and flakey fish tacos.  Would give this place an extra star if the service was better."}
{"text":"Delicious fish!  Loved this place and the wait staff was friendly and patient. Their menu is pretty large and it can be hard to choose!  We ended up ordering six different dishes (for 6 people) and all of them were so good!  My absolute favorite was the fried whole tilapia dinner plate. Delicious!!"}
{"text":"Was just here not to long ago and it was pretty good. Defiantly a very good hot spot here in the south phx area"}
{"text":"This place is a typical whole in the wall. You would easily pass it without a second thought if you didn't know what it was. It is not to be missed though because the food is amazing. The best octopus I have ever had and, fresh tortillas with a great bean dip, and the bacon wrapped shrimp was quite a taste of its own. As other reviews have stated this place puts the music on excessively loud. The prices are very low for the quality and quantity of food. Deffinetly  a must try if your in the area."}
{"text":"Stopped by today for lunch. Awesome Mexican Food! I gotta say the best Mexican food in Tempe!! Loved the chipotle sauce! It goes good on all every dish. Didn't get a chance to try out their seafoods, but that's gonna be for my next visit.  I hear the margaritas are fantastic here, with an extra tequilla. Will remember to stop by at this place when I visit Tempe next time."}
{"text":"If I could give it no stars I would. Lousy service, the food was hot (oysters, aguachile) which should NOT be hot but on ice. To top it off my waitress decided to give herself a $12.54 tip until I went back and made her give me my money back. Shady business and I will not go back or recommend two thumbs down"}
{"text":"Located in a strip mall with kind of bar type paintings on the windows.  Lots of beer signs.  The people were friendly. But the servers were gathered by the counter gossiping, and not all that attentive.  It wasn't busy or hard to catch their attention, so that was OK.

The Seafood platter tasted like it was fried in old oil. The server assured my husband that the oil is changed every day.  If you've ever worked or owned a restaurant, you KNOW the deep frier oil isn't changed every day.  

Didn't care for the Carne Asada burrito with green sauce.  The meat was cut so small and it was dry.  Kind of pencil eraser in texture.  The green sauce was not like any green sauce I've had before.  Didn't care for it.  Maybe it's authentic and I am accustomed to more Americanized Mexican food, who knows."}
{"text":"As a flavor the BEST!!!!
(Hate the loud music=for that they deserve a 1 star, every time that I go there I'm just praying that nobody plays the loud music....) 
But lets talk about business: food is amazing delicious, when Im hungry I can't stop thinking about their food...mmm"}
{"text":"Please would have received a 5 stars if the services was better but the waitress had a little too much attitude and did not correct and error on our meal. Anyways the food is awesome we had the oyster special half a dozen and a medium size shrimp cocktail both Delish my husband had the Asada plate which he said was pretty good beans were awesome but the meat was a little chewy 
We also tried their shrimp tostada and it was good, just have to eat it as soon as it comes in because the tostada gets soggy. Michelada was good overall I think one of the best MARISCOS places I have been too."}
{"text":"Fish Tacos- awesome. Great service, delicious horchata. Guacamole was great! Love this place"}
{"text":"Sparsely decorated place where the local Spanish-speaking folk go to get seafood in Tempe, AZ.  Food is fantastic at reasonable prices.  Definitely a \"do over\""}
{"text":"Just moved from California and wife was craving a campechana seafood cocktail but had no idea where to go. Once again or fellow yelpersto the rescue. This place place is everything everyone said it was. A little hole in the wall with great food and great service the only reason it didn't get a 5 star was I didn't appreciate them not mentioning they charge for ?rink refills."}
{"text":"Reminds me of Los Angeles style Mexican food.  The seafood items are unique, I especially liked the creamed shrimp with croutons.  The red colored fried head on shrimp are fantastic, eat the shell, legs and all. The oysters were served without any horseradish or any sauce which again is the kind of authentic im not quite used too, but they were fresh and good with salt, pepper, and limes.  The hot sauce, beans, rice, and chips/fried taco shell were frankly pathetic, so I would stay with ordering the seafood.. the fried tilapia was done perfectly.  The service was fantastic even though it was slammed busy. I enjoyed the jukebox on the wall with Mexican music, I chose two songs I had no idea what they were.. the music is ear shattering loud but in the environment it works, I felt like I was on vacation.  A lot of very happy customers, mostly Mexicans.  The fun factor in the restaurant is perfect, it kinda has a nightclub feel.  Would recommend for anybody."}
{"text":"My quesadilla was very delicious ! But one thing I DO NOT RECOMMEND IS THE CARNE ASADA , it tasted like  meat that frozen from 1 month ago"}
{"text":"Nice hole in the wall place. My chicken quesadilla and service were really good, mango margarita wasn't very good though, had a strange taste to it. I'll probably be back"}
{"text":"Horchata is best I've had.  Carne asada and fish tacos are delicious.  I really like their rice and beans.  Not a real fan of the enchiladas.  Overall a great restaurant! Try it!"}
{"text":"Not recommending this place. Bland and weird. I got the chicken taco combo. The beans were watery, the tomatoes whites and the salsa... Oh the salsa. Truly tragic"}
{"text":"Tasty and authentic. Fast service. Close to the airport. We will go back the next time we visit phoenix"}
{"text":"PROS: If you haven't been to Puerto Peñasco (aka Arizona's beach) in a while and are craving the seafood, the good news is you have plenty of options here -- usually I like to add pictures of the menu, but this damn thing had so many pages it was spiral bound. They have food I haven't seen at any other Mexican restaurants in Phoenix from seafood cocktails to red snapper fried whole. The customers were almost all Hispanic so you know it's as close to authentic as you can get in the area. The chipotle sauce is fantastic, and margs are good.

CONS: I think it's way overpriced. ~$20 for most entrees; it looks like a lot of food but it's not actually. There's a lot of interesting presentation to it, with the clay fish furnaces and food sizzling on top.

Now the food? I've been twice now and I have to say it's been underwhelming both times. The fish was dry (we're in a desert, true, but at that price I would expect fresher fish), and the octopus was hard and chewy. Things that were fried were way too heavily breaded, and everything was on the salty side."}
{"text":"This is truly a hidden gem. My boyfriend and I drive for an hour just to get their food. Their shrimp is seasoned perfect. Other seafood places put so much SALT on all of their seafood but this is done just right. Now the beans and rice are the best I've ever had from a restaurant. And I love that they do the little potato slices! They are a very good snack! Anytime I get a chance I take my friends and family to this location."}
{"text":"Now THIS is authentic.. Little Mexico I call it.

I'm not even into tostadas or octopus but my boyfriend made me try his octopus tostada..that was super good and i don't remember what my plate was called but it was some type of cheesy shrimp..shrimp drowned in cheese. I had plenty of chips to eat it with and their cute huge glass of a strawberry smoothie. Try everything on there.. You won't be disappointed! Everything taste so home made and hot as its served!"}
{"text":"Whats better than a michelada and a campechana to kill that hangover!! I was staying in Tempe for a weekend and after looking at the ratings and reviews I had to give it a go.

The staff is very friendly. Loved the mexican music playing from the little jukebox. Affordable and open late. Definitely going again when I'm in Arizona."}
{"text":"Great food. Amazing seri vice. Every time I come here I am pleased with the quality of food and the smiling faces that serve me said food. I've been here at least 10 times and absolutely love it."}
{"text":"Location is sketchy, food was OK, strange and not particularly tasty. Service was great."}
{"text":"Drove by this place a couple times on our Spring Training trip.   Decided to give it a try and was not disappointed.   Food is fantastic, service was also good.  Will make this a regular stop on future visits to Phoenix area."}
{"text":"My husband found this place and liked it so much he ate here 4 times in one week.  I ate there twice with him.

Chips and salsa are good.

Iced tea is not fresh brewed so the second time I just stuck with water.

First trip I ate the cheese enchiladas.  They were not that good but the refried beans were the best I have ever had.  YUM!  I like the way the cheese was under the beans so it stayed hot and melted.

Second trip I got a bean and cheese burrito.  The BEST!  I also got a side of guacamole that was really good!

My husband enjoys the carne asada tacos and the shrimp tacos.  He also likes the rice.

Stuff yourself and leave for less than $10 per person."}
{"text":"Just wanted something different for lunch so I thought I'd take a small risk and swing by here even though I only had 30 minutes. I got the special oyster and regular campechana. Everything was delicious and the service was great and everything came out quick even though I ordered to go. Definitely going to go back this weekend with my family to try some more dishes. I didn't get back to work on time but it was all worth it."}
{"text":"This place is great! Authentic mexican seafood. Diablo shrimp is great! All you can eat chips and salsa.  Don't be put off by location or looks of the place. It's whats on the inside (of your satisfied belly) that counts! :)"}
{"text":"Good food, ceviche is delicious and good portions. Campechana is ok. Asada tacos are delicious. Variety of hot sauces...Fire!!!"}
{"text":"Food is the best but service sucks ass, I will wait for the mariscos (they are the best) but waitresses don't know that people will tip good for good service."}
{"text":"Crowded place, just a few waitresses, we had to wait around 15 minutes to get the waitress attention, the food was just ok, no refills or tortillas were given even they were asked, waitress was nice but she forgot our table; pictures from Yelp made me think this place was really good, but being honest this is nothing memorable, not worth the 30 minutes drive to get there."}
{"text":"Great ceviche!!!!
Fish tacos were fresh and tasty.  
Service was fast and friendly. 
Felt like I was bk in Ensenada on spring break ;)"}
{"text":"When we got in and sat down it took while for us to get service. I got my food and that was the last time I saw the waitress. I had to go to up to register and pay my bill. There was 5 waitress at the register talking and all standing there. I gave it 2 stars only because the tostada de ceviche was good."}
{"text":"Amazing coctels de camaron. really the best maricos place in arizona. and its not even close. chips and salsa are great.  the horchatas are delicious..the carne is mouth watering."}
{"text":"This is a really awesome Mexican food joint with a specialty in seafood.  I've never failed to be impressed by any dish they make.  Some are unique and tasty, like the shrimp in cream sauce soup.  I've never had anything like it, and it's super-creamy and awesome.

They have an appetizer/side that is shrimp inside a chile wrapped with bacon.  Sure, go ahead and read that again, it's as good as it sounds.  The chile isn't very hot so it should be within almost anyone's spice range.

Along with your meal you get a half dozen sauces/salsas to pour on to your taste.  The creamy chipotle sauce is really really good.  Ask for it with your chips, it's that good."}
{"text":"I don't eat any seafood,  but the small non-seafood portion of the menu is SOLID.   

Hard seats and tile tables,    under sea mural on the walls and sports on little TV's here and there make it much more casual than classy - they have beer and tequila and a handful of other spirits.       Many of the meals come with a small simple salad and the complimentary chips/salsa are nice.     

Prices are very nice,  barely higher than Filibertos money.  

 You won't be disappointed here."}
{"text":"Mariscos Sinaloa is awesome.  Their fish tacos and breaded shrimp tacos are amazing ($2.50 each)!  They consist of corn tortillas topped with deep-fried fish or shrimp that is so fresh and light (not heavy or greasy), cabbage, and pico de gallo.  They also have this wonderful orange colored, creamy chipotle-like sauce that is served in a squeeze bottle and is a must for the top of the tacos.  

I also really liked their ceviche tostada (a great deal...huge and $3.99), which had a ton of flavor.  

They also serve each beer with a frosted, salted mug...classy.  And, they serve margaritas (ok), and shots which look amazing.  

My only suggestion is to stay away from the smoked marlin quesadilla, but I don't like smoky stuff, so that could be why it tasted like formadehyde to me (I feel the same way about smoked salmon...sorry).

Anyway, check out this little place, because the food is fantastic!"}
{"text":"Tacos were good, but dining experience was awkward and uncomfortable.  I arrived in Phoenix mid afternoon and was looking for a late lunch. Saw the great reviews and it was close to my hotel, so I drove there to give it a try. I was the only one there. Staff were organizing for the dinner crowd no doubt.  The staff were very friendly.  I ordered a smoked marlin and grilled shrimp taco.  When my order arrived I ate the marlin taco first, which was very good, but could have used less cheese.  When I went to eat the shrimp taco, I noticed it was not shrimp so I flagged the waitress down to let her know the order was wrong. She went away then came back saying that since the taco was already cooked I could not send it back.  I told her I had ordered and wanted a grilled fish taco and she went away, later coming back with a shrimp taco and the fish taco in a box.  When I got the bill three tacos were on it and I had to Flagg her down again to ask for the fish taco I did not order to be removed. The whole situation just was uncomfortable to me. If I lived locally I would give them another chance.  Just could have been such a better experience."}
{"text":"One of the best authentic mexican food restaurants in AZ!! Everything is delicious and rhe portions are amazing!!!"}
{"text":"This is pretty much my second favorite Messican Seafood restaurant in town, behind Mariscos Playa Hermosa. 

I usually have the platter of fried fish pieces - Snapper Chicharrón. 

It comes on a bed of salad, with an order of shrimp-stuffed yellow Anaheim peppers soaking in a soy-sauce-based concoction.  Hard to describe, but easy to LOVE.

As another reviewer said, their little orange, creamy, chipotle-flavored sauce is indeed SUPER DELICIOUS.  It's good on just about anything.

My one minor qualm:  The chips and salsa are not great.  The salsa is watery and thin, with not much flavor.  The chips are forgettable.

If you can get past the sub-par chips and salsa, this place is great."}
{"text":"Delicioso! Do not pass this place up! You will not find this size of oysters in town for this price and this good!! I've been to Mastros ocean club and have been underwhelmed. You're paying for the atmosphere there but you won't be disappointed with the flavors, variety and seafood at Mariscos Sinaloa."}
{"text":"Growing up In SoCal has definitely made me a seafood snob, so after living in the valley of the gun, spun, and sun, I was quite surprised to find a seafood restaurant  with fresh seafood and with these prices right down the street from me.
 I know, I know. How fresh can seafood in AZ be? Not only is the food tasty, but the prices can't be touched by any other restaurant for the amount of \"clean\" seafood. If you've been to a buffet lately, you know what I mean by clean. On top of the prices, the staff is always so friendly that it makes the customer experience that much more memorable.
If you're so hungry that you have trouble choosing an item after perusing through the menu, you can't go wrong with marlin tacos or the the mixta tostadas.

Bon Appeitit !!!"}
{"text":"The food is greAt the reason for 3 stars is because of the service, i came for the first time a few days ago and liked the food so much i came back today but both times the servers took over 5 mins to come greet us and give us menus, there were only about four other tables so its not like they were crazy busy, there were about 5 servers and none took the time to come give us menus, it wasnt til i made eye contact with one of the girls that she came over."}
{"text":"This place is a gem. The food is fantastic, portions are generous, prices are reasonable and they are open later than many restaurants in the area. Even so, it was crowded for a few hours, which tells you its a local favorite for good reason. The service was really great, and the staff were so nice and friendly. I will definitely go there next time I'm in Phoenix and highly recommend it to anyone looking for delicious food at reasonable prices. It is not easy to get seafood right in the desert, but Mariscos Sinaloa has done it!"}
{"text":"Outstanding place, love the atmosphere.  Loud music, lively crowd.  All the food was excellent.  Seafood galore.  I got some kind of variety plate (fish, shrimp, etc)...they served it on a fish shaped clay pot to keep the food hot.  Very cool.  Only bad part was I ate way too much food!"}
{"text":"Came here because  of the good reviews. .. but me and my husband were totally disappointed we both got soggy tostadas. The ceviche had no flavor. Oh and we had our son with us the server didn't  even ask if we wanted a drink  for him. Just bad service and food. First and last time going."}
{"text":"This place always delivers. The Tecate Micheladas are so good....I think they put some kind of tamarind chile in them too.  I haven't ordered a thing on the menu that I wasn't delicious.  I must admit I don't love when they play the banda musica really loud, but it's part of the style if the restaurant. Definitely go!"}
{"text":"Drinks are still on par however the food took a dip in quality these past couple visits. I use to come here a few years back, food was amazing. Gave this spot another shot but it still was a disappointment. Soggy nachos. Ceviche wasn't cooked properly. Runny salsa with your chips. No thanks"}
{"text":"Will it creep you out if I tell you that I think about Mariscos Sinaloa every day? I swear that I wake up wanting their shrimp cocktail. This place is outstanding. The food is amazing. I love their fresh, vibrant seafood cocktails which can include shrimp, octopus, oysters, scallops, you name it. My husband swears by the smoked marlin taco, which is cheesy, smokey and divine. We both crave the crab stuffed shrimp wrapped in bacon. The shrimp in their homemade cream and mushroom sauce is decadent and so delicious. The servers are kind and wonderful and always ready to suggest their favorites. As a sauce freak, this place is heaven for me. Six kinds of hot sauce on the table, plus four squeeze bottles of sauces for your entree for your dipping and mixing pleasure. The oysters are fresh and delicious. The beer is cold and served in icy glasses with salt and lime. Buckets of 5 full size beers for 10 bucks. Oh, and everything is affordably priced? Yes, the banda music is at full volume but you won't even notice it between swigs of your michelada and the jumbo succulent shrimp stuffed into a pepper then wrapped in bacon and dipped into a creamy chipotle sauce. Okay, I'm leaving right now. See you there!"}
{"text":"Holy moly, this place is legit!  Flavorful food, perfectly cooked, and great service.  Ranch-style shrimp swam along side stewed peppers and onions.  The molcajete was the best we've had on a long time with grilled onions, octopus, steak, chicken, and bacon wrapped shrimp.  No joke, don't order if you can't handle spice."}
{"text":"Recently stopped in for lunch and had an excellent meal. Chicken taco, chic enchilada, beans and rice were excellent. Ordered the Ceviche to share and we were very pleased. Seafood is their specialty and I plan on returning for something more daring. Restaurant is bright and comfortable. Service is friendly and efficient. Glad I found you Mariscos Sinaloa."}
{"text":"The food is really good.  I will definitely come back. The food is fresh and delicious.  I had a Red Snapper and it couldn't be better!  Five stars, for sure!  I will recommend this place to everyone I know."}
{"text":"Food is great service is awful! I walked in no one greeted me and I had to ask if I needed to seat myself. I found a booth that had not been cleaned and I asked 3 times if someone can please clean it and bring me a menu. It took them 20 minutes to do this by this time I was irritated. The k my reason I stayed was because I was waiting for my friends to get there. I was hoping I could have a drink by the time they got there but didn't. Finally when we got our menus we ordered our drinks and took even longer to get those and they messed them up, but at this point we just drank them because by the time they brought us the ones we wanted it would be even longer. Then to take our order was another wait. The only thing that did not take long was to bring our food out but from the time I arrived and I actually was able to get my food it was a little over an hour.... The food was good, but because of the service I received i did not enjoy it the way I should have, and even after I received the bill for 3 of us it was over $100... Hmm not worth it to be honest"}
{"text":"Work next to this place and visit it about twice a month. Never disappointed with the food and I like to try new items when I go. They know how to prepare their shrimp dishes. Don't be afraid to try something new here. Dishes are plentiful. This is one place I would go out of my way to eat."}
{"text":"Best service, Reyna greeted us and got all our orders right we had a party of 20 and everything was perfect, we are from California but will definitely come back . Muchas gracias Reyna"}
{"text":"Best kept secret! I have lived 8 miles from here for years!! And never knew about this place. Today is my birthday and I was craving a Mexican Seafood restaurant. So I did a search on Yelp to help me decide where to go. That's how I found Mariscos Sinaloa. My boyfriend and I walked in. We were greeted by the staff. It was seat yourself so I chose a corner booth. A friendly waitress (wish I knew her name, she wore glasses and had a big smile all the time) immediately brought over chips & salsa and took our drink order. When she delivered our drinks I told her it was our first time there. She had a big smile on her face and welcomed us (again). Since a lot of the menu was in Spanish she helped us understand and explained some of the selections on the menu. She did it with enthusiasm which made us feel appreciated as guests. I love queso dip but did not see it on the menu. So I just took a stab at it and asked her if they had queso dip. She said they did but it was not on the menu. I was pleasantly surprised. The queso dip was very good and creamy. My boyfriend ordered the Camerones Baconera. He really enjoyed it. I sampled it and wouldn't mind ordering it for myself next time we come. Big plump shrimp swimming in a creamy, spicy, chipotle type sauce.  I ordered the Molcajetes. OMG!! Entrée big enough for 2. It had grilled octopus, carne asada, bacon wrapped shrimp, grilled green onions, cheese stuffed pepper, and grilled chicken in a spicy sauce sizzling in a hot clay-type pot. I was not disappointed!! I was not able to finish and had to ask for a to-go container. I saw a smile on boyfriend's face when I asked for the to go box. He was probably thinking that he is getting the leftovers....NOPE!! Not this time, My Love, I'm gonna savor this myself tonight!!! We will definitely come back!! Why? The food was delicious but the waitress with the glasses and friendly smile made our experience there FANTASTIC!!"}
{"text":"I really liked the diversity in the menu options! There were a bunch of seafood dishes served in multiple different ways. My cousin got a shrimp dish mixed with a bunch of lime (I forgot its name)...I know this is pretty normal for Mexican food but when I first discovered this dish, I was amazed by the way the shrimp cooks! It was such a novel concept for me! It also helps that shrimp tastes fantastic in lime.

They do offer chips and salsa before our meal. I ordered the Parrillada Mixta. It was served in a funny, huge, fish-shaped platter. The portion is definitely big enough for two people. I particularly liked the grilled octopus. It was the right balance of grilled with moisture. I also tried my friend's octopus dish and that was tasty as well. The carne asada was kind of dry.

The restaurant itself isn't very aesthetically pleasing, but there is a time and place for looks, and this isn't the time for looks. Service was mediocre. If it wasn't for the service, I would give this place a 4. There were a lot of people there and 1-2 servers so it took a while to order food. When the waitress was with us, she was very nice. The waitress actually spilled a whole margarita on one of my friends. She apologized profusely and was apologetic about the situation, but I feel that she could have done more for my friend, like offer her a free drink or give her a percentage off her meal.

They do have alcohol there as well. I wasn't in the drinking mood so I wouldn't be able to attest to their margaritas!"}
{"text":"I came here with my friend for lunch today; we both had wanted to try this place out for some time.  As other reviewers have mentioned before, the music is absolutely way too loud here.  I don't know if the owner reads yelp reviews but they need to change this; I honestly had a hard time hearing our waitress because the music was about 60% too loud.  You've been warned. 

We ordered the shrimp toritos for an appetizer and they were pretty tasty; basically a banana pepper stuffed with shrimp and wrapped in bacon.  I was relieved that the sauce they were served in was not too salty, but I thought that a spicier pepper might have complimented the dish better.  We both put a generous helping of spicy chipotle sauce on them to \"perk em' up\".  We shared the bacanora shrimp and were glad we did so because the serving size was more than generous.  The sauce was really unique and the shrimp was really flavorful; the rice and beans were both bland.  Speaking of bland....the salsa here was a joke, there is no way they make it there (super watery and not spicy at all).  We agreed that we would both come back and try new options because the menu is huge and looks really great.  Our server Heidy was super friendly and perky and was very helpful with recommendations.  Next time I come here I'll make sure to sit as far away from the speaker as possible and hope for the best!"}
{"text":"Sooo good, had the chefs special fish filet, the shrimp and octopus were cooked to perfection as was the fish, sides were delicious and portions were large. Definitely plan on returning and exploring the menu"}
{"text":"If you're a fan of seafood, this place is awesome! This was my first visit here and I was impressed. 

First, this place really doesn't stand out as it's located in a small strip mall and you can pass it if you've never been (like I did). I seen it off the corner of my eye as I was passing it. So, I had to circle the block. 

You walk in and the atmosphere is very inviting and letting you know you just walked into a seafood restaurant. Mexican music playing lightly throughout. The staff is awesome and friendly. 

I was amazed with the menu items. Anything that can be made with seafood was on there. Appetizers, cocktails, main dishes, a la cart, etc. Every plate I seen come out that kitchen was awesome. I had the red snapper Yucatán style. It was delicious and served with salad, rice and some hot tortillas. 

I will definitely be returning here to try other items on the menu that interested me and even for a nice cold shrimp cocktail. That'll come in handy for this Arizona heat. 

If you're a fan of seafood, I recommend this place. Cold beer. Fresh seafood. Keep your eyes open."}
{"text":"The food was great! I had a fish soft taco and a ceviche  tostatada. However the service was awful. The girls are lazy and no personality. I need the waitress and she was no where to be found for 15 min. Great food awful service."}
{"text":"Had a carne asada burrito and some chicken tacos, nothing crazy, but good. Employees were friendly. Will come again"}
{"text":"After reading reviews my boyfriend and I decided to try lunch here, parking lot was pretty full, always a good sign. Inside had a lot of people (another good sign) food was good! I thought it would be \"fishy\" but not at all!!! Definitely will be coming back!!"}
{"text":"This was the worst Mexican food I've ever had. Salsa bland. Carne asada tacos dry and bland. Shrimp cocktail bland. Only good thing was michelada. Won't be coming back."}
{"text":"First time to this establishment and we pretty much ordered the whole menu. Molcajete Barbarroja was excellent and very flavorful and spicy. Ceviche was great, just needed some salt. Also had the Mojarra and it was cooked to perfection. Our server Christina gave is exceptional service and will definitely be back."}
{"text":"This hole in the wall joint serves up some serious Mexican Seafood.  If you are missing your last Rocky Point vacation come here and you will be reminded about how great Mexican seafood tastes.  

The shrimp cocktail and fish dishes all taste good.  This is the best place for Mex Seafood in the Phoenix area, which isn't saying much but hey beggars can't be choosers.  I'm just happy that I live close this gem :)"}
{"text":"Nice little eat-in or take-out restaurant. Order up front then have a seat or take to-go. Bean and cheese burrito is amazing, comes with yummy spicy chipotle sauce. Homemade tortillas yum. I had the shrimp cocktail it was yummy although a couple shrimp were mushy. I ordered chips and salsa but didn't receive it. Checked my receipt and didn't pay for it either. So either they forgot or I was supposed to grab free chips and salsa at the bar on the way out. Hey, it was my first time! Will return for my future lunch breaks."}
{"text":"I came in around 8:30 before closing and they insisted I stay though they were cleaning up.  Had a huge seafood plate that was very fresh.  Wasn't sure what it was called but pointed at the picture.  Pretty good value.  The ladies were nice, maybe not fancy restaurant professional but easy to waive down as they moved around shutting down."}
{"text":"Amazing mexican seafood, most of the waitresses offer good customer service, but one or two will really ignore u during the whole time, if u get lucky and get one of the good waitresses then the whole deal is pretty awesome. Food is always fresh, and music is on point. Our favorite place to go, we frequent it once a week"}
{"text":"This place has the WORST customer service!!!!!!!!! We will never be back. The prices are too high for the quality and flavor of the food. We ordered the Patron Ceviche which was $18.99 and it tasted so fishy, which good ceviche does not, that at the end of our meal the waitress brought us a container to take it home and I told her we didn't like it so we wouldn't need the container. She didn't even offer to take it off the check. We had not even made a dent in it. When I asked them to take half of it off the check she told me she had thrown it away so they couldn't see how much we had eaten. I told her she saw how much we had not eaten or she wouldn't had offered the container. The manager was no better when he stated I had never said anything during the meal and I followed with the fact that shouldn't matter as I was saying something now. I do not suggest going to this place if quality or customer service means anything to you. I'd like to also mention, I don't know the last time I reviewed anything, but this place was so bad that I felt compelled."}
{"text":"Ok when I first got here with my friends I was not impressed.  This is by far not a fine dining restaurant. But then the menu and the food!
Wow definitely impressed good size portions and as authentic as it gets. If you want Mexican style seafood dishes I definitely recommend."}
{"text":"Stopped for a quick be to eat as the parking lot was full, and for good reason, the food and service were very good. 

We asked for a suggestion and ended up with the carna asada and chicken mix with flour tortias. The server checked in with us and left us alone otherwise. Food was hot and had just the right spices.

My favorite part was the chips and salsa. Probably some of the best I ever had.  We will be back."}
{"text":"Not sure what all the hype is about. My food was okay but nothing that I'd go back for. A little pricey and the service wasn't anything to rave about either, unfortunately. No refills on the salsa and chips or drinks. Was with a party of five and we all were bummed that we couldn't back the high ratings Mariscos Sinaloa had received in the past."}
{"text":"I will never eat here again food was cold, I ordered  shrimp tacos and looks like the food was frozen and heated in the microwave. The salsa was horrible. Food is also overpriced."}
{"text":"Wow, always nice to find one of these out-of-the-way places that surprises one with the quality of the food and in addition, the quantity. Based on the other Yelp reviews a friend and I started with the ceviche tostada for $4.99. It was a heaping mound of ceviche comprised of fresh shrimp (small pieces but tasty), finely diced tomato and onion, and lime juice, with additional fresh limes to squeeze on top. For one person, this is, in and of itself, a meal. I could see having this with a beer or an ice tea and calling it a day but I'm not a skinny person eater, so I kept going!

Next I had a combo plate (yes, rice, beans and salad with the main entree) with a shrimp taco and a fish taco. Both tacos were substantial and the seafood was done right, flash fried so it was crispy and not greasy and they give you two  types of sauces, one a chipolte cream and then another hot sauce, which I prefer. They come in squeeze bottles so add as you see fit. There is also a bottle of ranch dressing that one can spritz on the salad, and hey, it was a good salad, fresh dark green lettuce, not just iceberg. The beans and rice are okay but nothing special.

Wait service was friendly and timely and as it was a work day, I had the ice tea. I look forward to coming back when I can  try some additional items, but with an adult beverage, like the mixed grilled seafood plate, that looks amazing!

The only thing that was not all that great was that, as others have mentioned, when someone plays a song on the jukebox, it is loud! If they could drop the volume on that thing by like 25%, it would be perfect but hey, for the quality of the seafood, I'll bring some earplugs and keep eating!

Bottom line, go for the ceviche, stay for the seafood tacos and other delights from ocean waters."}
{"text":"Thoughts had reviewed this before...from San Diego and the hubby is from Mexico...I love Mexican food and know what to look for. This place is the BEST! As soon as we cross the border to AZ I'm craving this place. Everything we have tried is amazing!"}
{"text":"I had a delicious, delicious Michelada, and the molcajete Barbarroja. It was great, savory, and had a bit of everything, even portion wise, which was great for a big eater like me. My wife had the shrimp and octopus spaghetti, which was also great, very creamy and tasty. My biggest complaint is probably that the servers there have a look on their face like someone pissed in their Cheerios. They seriously look like they'd rather be anywhere else. Hence 4 stars and not 5. The tostadas were pretty okay."}
{"text":"HUGE servings, sweet staff and delicious food. I'm very picky and I loved it! Beautiful music too and adorable decor"}
{"text":"i'm happiest when traveling with people who, like me, are down to try unusual hole in the wall places. for our recent trip to arizona, instead of eating at some fancy schmancy restaurant in the city or spending our time at the buffet line at the hotel, we searched yelp for some seafood. and alas, marisos sinaloa! 

first, you start off w free chips and salsa. the beer was cheap and they serve em in chilled mugs with salt and lime. 

i had the bacanora shrimps and it was unlike anything i have tasted before. creamy spicy sauce and delicious shrimp served with rice, papas, and salad. i got hungry right now just thinking about it :(

the bf had the shrimp tacos - delicious, and shrimp burrito - good, but probably too much for him. 

our two other friends got a mojarra frita and the seafood mixed rice veracruz style (?) which tasted like a seafood paella. both were good and hit the spot. 

overall, the food was good, the price was reasonable, and the service was fast and attentive. straight up simple and good."}
{"text":"Seafood in the desert - Actually pretty good!
Before my spring break drive back I stopped at Mariscos Sinaloa.

Some reviewers aren't fans of the fluorescent lights and the jukebox but they didn't detract from my experience. Originally I was in a rush to get going and thought eating here would be a quick in and out. When I saw the free chips arrive though I settled in for sit-down restaurant mode. 

I got the:
Shrimp Ceviche Tostada
Shrimp Taco
Fish Taco

The tostada part was pretty soggy after a mound of ceviche was on top of it but it didn't matter due to those *Free* chips. One portion of ceviche was literally like a half lb of seafood.

The shrimp and fish tacos were pretty good as well though I was eating them while driving in the Phx traffic jam. The creamy chipotle and hot salsa that come with the tacos are winners as well. 

Now if you crave fish tacos you don't have to drive the 350+ miles to San Diego."}
{"text":"This Mexican restaurant is close to my in-laws place so we recommended giving it a try one Sunday after church. We heard this was related to Baja Joe's in Mesa, but it is in fact not. But the menu is almost identical. We have been craving fish tacos, so we ordered the Red Snapper, whole fish,  cooked in garlic.  They have very good quality tortillas I must say. We used the tortillas to make a little burrito with the garlic fish and added the delicious chipotle sauce and habanero hot sauce to give it a good kick. Those were delicious. I must say they could use a reassessment of the salad they serve because they were wilted and just did not look good. The fish was also a bit smaller than I expected considering the price and when compared to Baja Joe's. I also got to try my brother-in-law's shrimp burrito - enchilada style and i must say it was HUGE! Also, they were generous with the perfectly cooked shrimp! My mother-in-law got the carne asada and that was cut pretty thin and wasn't as juicy as I expected, so I don't think I would recommend it. The ambiance of the restaurant is basically as if you walked into Mexico, it compliments the food in my opinion! The service was great, the waitress was very attentive and was very helpful when we had questions, even with a decently packed house. I am definitely planning on coming back for another round, and I'm glad we got to give it a try!"}
{"text":"This restaurant doesn't really have any curb appeal - you'd easily pass it by. But, you should go in! Excellent food, really fresh seafood. Huge portions and friendly service.  We had an octopus and shrimp plate, and a chimichanga, which were both great. We'll definitely go back next time we're in town."}
{"text":"This place is AMAZING! Their ceviche is to die for! They are definitely not stingy when it comes to piling that juicy shrimp on the tostada shell. I usually order two of them and it fills me up. Also, I recommend their delicious michelada to wash your food down. I'm a regular here and I can say every penny is worth it!"}
{"text":"I used to love coming here. I decided to try one more time since it's closest to my house. Last time I came, the Salsa did not taste homemade like it usually does, it was not good.  Today, My shrimp cocktail came without avocado, my culiche wasn't as flavorful, lacked the spice, though it was still good.  My 4 potato slices were too greasy, my chips were crumbs and  next time I'm driving the extra distance to Phoenix or Guadalupe. 3 stars because I love culiche and the shrimp was plentiful in the cocktails."}
{"text":"So disappointing. Food was good as usual but the new wait staff is downright bad. Barely got a greeting and did not once come to check on the table to refill water or chips. Even after asking for water twice we still got none. This used to be my go to spot, I've brought a good hundred people here ever the years but it seems like the recent bad reviews could be start of a bad trend. I would definitely start away for a while to see if they good better staff."}
{"text":"The service is amazing. Our server was super sweet and didn't make my fiance and me feel like complete idiots, even though it was quite obvious that we are some of the whitest people on earth and don't know a thing about what \"authentic\" Mexican food is supposed to taste like (we *just* moved to the valley).

That said, I do know good food, and this food is good (I can't yet speak to its authenticity). Our server recommended starting with a cold seafood cocktail with shrimp, octopus, and oysters. I don't normally like octopus, as I find the texture to be off-putting, but this was delicious. Not rubbery like I've had it at sushi restaurants. The cocktail was more of a soup, kind of like a gazpacho. Our server recommended that we doctor it with some ketchup and tapatio. Perfect. 

My fiance and I shared the Chipotle Shrimp, which came with enough food to split and more to take home. It was also pretty awesome. I like that they served the meal with both flour and corn tortillas. 

Besides our server being sweet and very helpful, I also appreciated that the kitchen split our appetizer and meal into separate bowls/plates at no extra charge. It was a nice gesture. 

Oh yeah! And super fine chips and salsa. 

We will be back for sure."}
{"text":"I fell in love with this place after the first bite!  I love Shrimp and Seafood and wanted to try something new on a Sunday!  I am so very glad I did!"}
{"text":"WOW.  I (along with 3 toddlers) went to this spot last night. I will start off by saying AMAZING. yummy authentic deliciousness. So good, that the husband decided that we will go again tonight for dinner lol.  The only reason why I didn't give five stars because I ordered a shrimp taco without cheese and it came out with cheese. Nonetheless.. I ate it. And, is was pretty darn fantastic. Yummy Yummy and the prices are beyond affordable.  The server was SOO friendly, food was hot and, The tacos were so good that we ordered more later lol. 

Try the Ceviche. 
Marlin Tacos
Fish Tacos
Shrimp Tacos
Guacamole
Decent Margaritas

I did get two refils of the salsa and chips. And, next time I would love to try the Oysters."}
{"text":"The food is good. I am from San Diego so I am used to eating Baja style seafood so I was nervous when I first tried this place. I had a cóctel de camarón and a tostada de ceviche de camarón. I eat that every time. Their food has never disappointed. The service however is horrible. Servers are weeded and rude and service is slow. I went in today to get a to go order and every server ignored me. Finally, one of the ladies was at the cash register and she asked me if I was ready to close out and that's when I told her I wanted to place an order to go. She was closing out another customer and asked another server if she can take my to go order. The server said \"no\" and walked away. By this time, I had already been ignored for 7 minutes. She was embarrassed and was quick to take my order and put it together."}
{"text":"my family ate here after game yesterday my husband had shrimp cocktail mixta and he has been vomiting and diarrhea all night long ...  WTF really ?? horrible"}
{"text":"Such great customer service!! Not to mention the food was fresh, fast and inexpensive for a seafood place.  I had the fisherman's sampler, torritos and chipoltle shrimp and man there was enough food for any army.  The place was packed and I still managed to eat and pay in under an hour.  Five stars in my book!"}
{"text":"They really turned it around yet there ceviche does kind of suck, rest of the food is good! 



My old review game one star

 been begging my boyfriend to take me out to mariscos for quite a while now. So we looked on google maps and yelp reviews thought to give this one a try. Service was very slow, the waitress hardly checked on us, she was busy watching novelas. Which she had blasted pretty loud. A customer next to us complained and her reasoning was the manager wasn't in so she wanted to take advantage. So now to the food. Salsa was very watery, chips were hard, horchata was excellent. Oysters were warm, which grossed me out, and red snappers were over cooked and over seasoned, and came with lettuce? Tortillas seemed raw. Then the bill was over priced $61 for lunch? Yeah we're not coming back!"}
{"text":"We had the mixed ceviche to start.  It was decent...it was a little bland, but it came with a heap of seafood on top of a tostada.

I had the 7 mares soup.  It was delicious!  And their corn tortillas that come with it were delicious too!

My boyfriend had the rice with seafood.  It was pretty good.  He liked the chipotle cream sauce and poured it on the rice.

I love it when we try a place like this on a whim and it works out!"}
{"text":"This place is great. First off as others have said the  music is a bit loud but didn't bother me too much, got used to it after a few minutes.
we started off with the mar y tierra appetizer which consisted of deep fried shrimp wrapped with bacon, butterfly shrimp, diced shrimp, octopus and crane asada.
My entree was a shrimp cocktail which had plenty of shrimp, usually most places will be scarce on the shrimp and load it with vegetables. it was really good.
My wife had Fish a la plancha which came with a side of rice and salad.
all accompanied by fresh chips and salsa.  we ordered horchata to drink which was pretty good.

Overall I will definitely come back here."}
{"text":"I been eating here since it was barely open and every time I go the quality just gets worse, but still have some deserving food"}
{"text":"The best Mexican see food hands down!! We have been many times here and always everything is amazing!! I can't name all the things you should have because they are all amazing!! We love the shrimp ceviche, seafood soup!! Super fresh Oysters, fish plate,!! 
We try to come here ones a week!! They are always busy!! We always asks for Chrissy if she is available!! Do not miss this place out!!"}
{"text":"I came to Mariscos Sinaloa with high expectations because of all the good reviews but unfortunately, I was disappointed. I ordered a shrimp cocktail with agua chile and my expectation was a spicy shrimp cocktail with cooked shrimp but I got a combination of cooked and raw shrimp which I think should have been mentioned in the menu that it would have raw shrimp.Most shrmp cocktails in other restaurants come with cooked shrimp so I think this is reasonable expectation. I didn't like raw shrimp in my cocktail. My sister ordered camarones chapeados dish and it was tasteless and not good. The ceviche tostadas was chewy and taste was bad.Some of the food was good like the breaded fish.the price was expensive especially considering how much of it was left uneaten.It was around $130 for 5 dishes and one appetizer.The Mariscos Chihuahua restaurant chain in Tucson, AZ  has much better quality of food and prices are more reasonable. Not sure if they have those in Phoenix but I bet they do.I'd say it might be a good experience in Mariscos Sinaloa but you have to be really careful with what you order here."}
{"text":"So this restaurant has provided me with a story I am sure I will tell over dinner with new friends for the rest of my life.  so, now it is your turn to hear it...

I walk into Mariscos Sinaloa on a Wednesday afternoon.  I'm busy.  On this side of town and I whip out my Yelp app to see if I've book marked a place to eat in the area.  Yep, I was a mere few feet from this place.  So, I pull my car into teh parking lot and go in for a quick meal.

I order shrimp chipotle and a michalada.  I ALWAYS have the michalada.  So, I'm sitting at my table waiting patiently for my food whilst I read messages on my cell phone.  Suddenly, out of no where I hear a crash and then I instantly feel COLD.  WET and COLD.  Oh yes, a waitress walking by spills an entire tray of waters and beer on me.  I was in complete shock!  Total SHOCK.  I said nothing for what may have seemed like FOREVER as everyone in the resto GASPED to see what my reaction might be.  I quickly check to see if my phone was drenched, it wasn't.  I take a moment to think... did they mess up my nicely coiffed hair?  no, it wasn't... So then I look up and FINALLY break my silence and I tell the waitress..... \"Ok, so I guess I\"ll be taking my food to go\".  They fuss over me and ask if I was ok or hurt and I say no, as I wasn't.  I wasn't even embarrassed by it.  So, I just simply move to the other chair across the table and I reached down and continued to sip on the michalada as I waited for my food.  They comp'ed my order, naturally.  And as I was leaving, the waitress apologized again and I said, \"Accidents happen, NO WORRIES!  I'll be back next week\"  And so, I did go back the next week with my mom.  For me, this water experience has little to do with the rating.  I enjoyed the shrimp chipotle ALOT, except the shrimp seemed to be overcooked.

My mom and I went there on a Sunday.  Packed house.  Oh and the people saying the music is loud in there, are NOT over-exaggerating.  The music was fairly loud.  It comes from a paid juke box, so it won't be like that all the time.

I had the camarones diabla and my mom had the molacajete.  neither of us were crazy about our own dishes.  However, we both liked the other's.  The camarrones diabla was the spiciest that I've ever had any place EVER.  My mother likes spicier food than I and she loved it.  I, on the other hand enjoyed the milder flavor of the molacajete.  But all the meat was  a little over cooked to me.  

All in all, I don't think I'll be running back here.  there's another Mexican Seafood Restaurant that's not too far from there that I like much better than this.  If you are in the area, you may like to try it out."}
