{"text":"Staff was very friendly and welcoming. Made sure we had everything we needed. Food was delicious! They have an awesome menu full of breakfast items and even sushi. Excited to come back and try more!"}
{"text":"Food is good, customer service is lacking, bathrooms need A LOT of work. I don't understand why a lot of restaurants overlook the importance of a nice, clean facilities. Do I want to see the kitchen? Free plentiful parking."}
{"text":"La comida no tiene sabor  Necesita sazón  El sitio es suciio Me dieron utensilios oxidados... Ya pa que le sigo no regreso.,"}
{"text":"The food here is amazing. It's one of those hole in the wall magical finds you are lucky to come across. Everything is amazingly fresh. The only thing I have to complain about is that I am only English speaking and their waitresses are only Spanish speaking so I'm always a little embarrassed and feel like an outsider when I come but once you get past the language barrier the food is worth it and keeps me coming back. FYI the oysters are the freshest I've ever tasted."}
{"text":"Costumer service sucks ! Food had no flavor, my michelada was nothing but Clamato.. best thing about this place was the 10% off .. first & last time eating here"}
{"text":"This place sucks, asked for tequila shots, gave us water!! Wtf!! If I wanted water I'd go home or gas station.. smh...  I'm Mexican not white washed n know what's good... js..."}
{"text":"The food was good we had the tostadas and ceviche, the food was a bit over priced but we needed a place to eat close by. I enjoyed the food and the man singing depressing songs in Spanish karaoke was a bit of a vibe killer. Overall good experience."}
{"text":"There's always a party in this place .. You have to try the food , the servers are very nice and professional . Don't let yourself get fooled by the location"}
{"text":"Highly overpriced. My fiancé and I really enjoy seafood and we love trying new restaurants. Our food was decent, the lemonade was delicious but the wait for our food was long although there was barely anyone there. I was still hungry after finishing my food which was $20 for about 10 grilled shrimp. We are not planning on returning."}
{"text":"Rikisima tostada 3x!!!!! Calló ceviche agua chile pulpo omg!!!! Deliciosa y excelente servicio!!! Ambiente tranquila y muy limpio!!!"}
{"text":"This place gave me food poisoning, the seafood was warm the restaurant stank like sewer. Omg never ever going again . There ain't no mariscos place in AZ like Cali.... my husband got aguachiles super warm and they took forever to bring the food like an hour I got my son carne asada taco it was super dry I got a tostadas de ceviche taste weird and was warm omg disgusting. The pictures look good but they are from the business owner that's why. It's also very expensive. Oh wait and I also got sushi omg it looked like morisqueta they didn't even know how to roll it. Eukkkkkkk"}
{"text":"I ate here once and never again will i eat here. For one the food was overpriced. That wasn't the problem though, the problem to me was that the food had no flavor my husband ordered a caldo and it tasted old like it had been sitting all day. My rice was hard it had no taste. I wanted to go out to eat to distract myself for what i ate i could've just stayed home and made it myself and it would've tasted way better. Also the waitress only went to my table twice. Once, to get the order and to give me the check. She never came to refill our drinks. I will not go back again."}
{"text":"The food was okay, although it didn't sit well with some of our stomachs, but the margaritas and rum and coke were really noticeably watered down. They may have not even added anything to the margaritas, they just tasted like lemonade. The service was horrible, never going back."}
{"text":"I like the fast and convenient location, I usually order for pick up, since during dinner time it gets really loud because of the band they have and it's hard to get the waiters attention or even have a conversation while dinning in. Their price is decent and I get their ceviche which is good since I'm picky, I just wish they wouldn't chop the shrimp up so fine into tiny pieces"}
