{"text":"The rating I gave was for the new place CJ'S Pourhouse! They are new owners. The new owners really care and it shows. Great food and staff! Keep up the great work, I will definitely return!"}
{"text":"Went there to grab a bite to eat and watch the Buckeyes vs. Michigan. Busiest sports day in Ohio. There was not a soul there except my buddy and I. The parking lot is really bad. Needs redone. The menu was boggled and needs redone. They just threw some sheets of paper with typed items. Corrected at times in pen. People seemed nice but the place is unorganized and I imagine won't last very long."}
{"text":"Tried this place 3 times or so.. Food is not so great, place itself is generally dirty and grimy. Not a place I'd recommend."}
{"text":"Went once for late lunch on a Friday. There were 5 or 6 tables. Say at the bar for 20 minutes and no one served me so I left hungry and disappointed.

Went another time with a few friends for dinner and the burgers were kind of soggy but huge and really tasty. Bar tender was not very friendly but that's kind of typical of small east side bar & grills. Price was reasonable, a bit on the high side. There was a cover band. I like cover bands but this one was not well practiced. Make sure to review the bands before you bring them in."}
{"text":"First off I just want to say the bartender who served us was absolutely beautiful!  She would be the only reason I'd ever go back!

Don't know where to begin!  Paprika on the chips??!? No Bueno!  The food was not good. Tasted like everything was heated up from a bag or something. Nothing authentic. The owners got into a huge shouting match in front of everybody which scared my guest to death, since it seem like they were about to fight. The police were called. Lol. 
On a positive note the drinks were great and cheap!  
If you want great Mexican Food then go to El Palenque!
Man was she gorgeous!!!!!"}
{"text":"The whole Italian name but the Obnoxious Mexican them and music are very confusing. The bartender is smoking hot. I was the only one inside so I cannot say the service was bad. Have not got my food yet, but I have eaten here in the past and it's ok/ok-"}
{"text":"Shelly is smoking crack.   The place is jumpin and the bartender girl is super nice today!  Met up with my dude Squirrel and his family on a Saturday nite and had a great time.  Its definitely a bar but it does have a seating area that you dont feel like a creep taking kids too.  Cheap drinks, clean beer lines and a decent selection.  The food is typical italian stuff which to me I still cant figure out why Willowick, Greaselake and Willoughby have so many of the same type Mom and Pop places that all sell the same stuff.  Ok, we get it..you like pizza and meatball heros.  Check out the trivia on Saturdays.  The dude who does it is a riot and if you win the round the bar is SUPER quick with a round of shots for the whole team.  We probably each had 4 shots and they didnt even bat an eye for comping all that liquory goodness.  Plus the jukebox played everything from The Who to Guns N Roses and not that souless country music thats this years version of the Backstreet Boys.."}
{"text":"The place was empty, the parking lot is terrible and the bartender clearly wanted the few customers in the place to leave on what their Facebook page said was ladies night. Won't be going back."}
