{"text":"My daughter and I really enjoy eating here. We tend to order the same thing every time because it's so good. She gets the grilled cheese and tomato soup combo and I get the grilled salmon nicoise salad. They both rock. It's cafeteria style all the way up to the point you pay, then you are served the rest of the way by a waiter who brings you your food and takes care of you. The food is always very fresh and delicious. And by the time we're out of there, it costs no more than eating in the food court but the experience and quality of the food are miles beyond. Highly recommended."}
{"text":"If you give me a good plate/bowl of pasta and an Arnold Palmer, I'll be your best friend.  I love ravioli, and yes, I have had the unfortunate experience of biting into a lovely little packet of goodness and been disgusted, whether it be from the flavor or texture or whatever of the ravioli.  My mom and I had a shopping trip one day recently, and I was already happy because I had bought the most beautiful boots. I have had my day ruined by bad food, so whenever I order food, i go safe, and am rarely sorry. This was no different.   The wild mushroom ravioli was FANTASTIC. The mushrooms were cooked perfectly, and their high water content wasn't an issue. The cream sauce was so amazing, my mom is sitting behind me talking about it now, weeks later. It was memorable.  The service around the dining area was good, and one thing, a tried and true thing, is that if you smile at the waiters, they refill you fast.   I only give it 4  stars because of the seating arrangement, it annoyed me. Somewhat crowded and my table was sticky."}
{"text":"Food - For a lunchtime mall sandwich place this is really was a delicious surprise. I got the roast beef sandwich with a horseradish mayo and some pieces of arugula on a thick fluffy square almost crusty but still easy-to-eat roll with a couple pieces of very mild onion on the outside. I would have liked some mustard. The side salad and all ingredients were really fresh tasting. The only thing I would change is to add a bit of spice - I could barely taste the horseradish and in fact the sandwich had a bit of a sweet taste as did the champagne vinaigrette for the salad. For the usual tastes though these were probably perfect. I had water which was definitely filtered. I'll definitely try more .. the soup of the day a vegetable of some sort, the tomato soup, pizza, the other sandwiches all looked good to me as did the cookies and macaroons at the counter. The children's choices looked good with options like buttered noodles and included a drink.  Service - Oddly you order at the counter then go to a booth. Then a server brings your food and drink. My water was refilled twice and mints were brought with a copy of the bill and a dessert menu. I did forget to tip (as I always put it on my charge) though I will remember next time. There was a short line waiting to order when I left.  Atmosphere - Reminds me of going to the mall Pappans with my grandma when I was little. Tall quiet booths that feel private. A large semi-shaded window to let in natural light. Very ladies-who-lunch (and shop).  Price - for what you get the prices were great - about $10 for the sandwich with side salad. I took half of my sandwich home. I recently got a big salad and cup of soup (Walnut Grove) for $9 plus tip but would take this over that experience any day. Good value."}
{"text":"Food is always fresh and delicious. Love the Nicoise Salmon salad, every time I go back I can't help but order it. Customer service is good, definitely better when not super crowded but I would recommend for sure. The desserts that I have tried here are also very tasty! The macaroon cookie is awesome in my opinion, perfect amount of chocolate, fresh coconut and a slight crunch all the way around the cookie just making it the perfect texture in your mouth.  Just for the record, I'm not big on coconut, but this cookie is so good!"}
{"text":"Way over priced for the quality of the food. Don't bother. Not much more to say but Yelp keeps asking more to write... the whole world is ridiculous."}
{"text":"Love the Nordstrom Cafe fair, but really, what's not to love...fresh hot pizza with a tender dough crust that is much tastier than most pizza places anywhere,fresh entree salads that tempt with incredibly fresh ingredients & flavorful unique dressings! -The absolute best one?.. The fresh red Pear & candied walnut salad with tender greens,incredibly delicious Italian Gorgonzola Blue Cheese- YUM! & a Pear Vinagrette that is tremendously savory! It's my Favorite department in what is a disappointingly SMALL store overall, with fashion offerings so narrow & small as to appear stingy! They've got this area pegged as backwoods \"country\" & that is just stupid! These University towns all over the U.S. have tons of world travellersQ! We KNOW what good clothes are & this ain't it,folks! Which is why We're loyal Saks Fifth Avenue,Neiman Marcus,Bergdorf Goodman,Barneys New York Customers all the way!!!!!!  Where's the vast justly famous well stocked home gift gallery, the sleek clothing collections that tempt one to spend spend spend??? I'm spending-but JUST in the CAFE.  Buon Appettito!"}
{"text":"This place is AWESOME. I work in the area so I frequent this location for lunch quite often. The food is always fresh and delicious and their service is exceptional. The staff is very friendly and can read their customers very well! I would highly recommend this restaurant :)"}
{"text":"This use to be my favorite place to eat. However, within the last year it has gone down hill significantly. While the tomato soup is still great, the quality of the other foods has made me no longer wish to eat here."}
{"text":"This place is really surprising to me. The place has great food and a reasonable price. I always get the Margarita Pizza, it is my favorite Pizza anywhere. The tomato bisque is really nice too."}
{"text":"Nordstrom Cafe is awesome. Where else can you get healthy, presentable, affordable, gourmet cuisine on the run?!   Our favorite is the Tuscan Salmon with Roasted Vegetables (yum!).  Sometimes they serve the salmon with herbs, sometimes pan-seared; both are delicious. The herb roasted vegetables are fresh, perfectly roasted, and filling. A delicious meal. Even better topped off with a Norstrom Chocolate Chip Cookie :)"}
{"text":"I frequent Nordstrom cafe for lunch almost once a week.  Although the food is outstanding, the service is what keeps me loyal.  Each time I go, an employee named Rick recognizes me and immediately takes care of me and my guests like a 5 star dining establishment.  He is attentive and always remembers what we drink etc.  I have never seen such a dedicated employee who clealry cares about his customers and takes the upmost pride in his job,  He always makes our dining experience remarkable.  I highly recomend visiting this wonderful cafe and if you are lucky, Rick will be your server.  He really is a gem!!!!"}
{"text":"Very tasty  paninis and pizzas - always want to try the desserts, but never have room (that's a testament to the food, I guess!). Nice compromise between food court and restaurant when at Ross Park Mall."}
{"text":"My wife and I ate here for lunch over the weekend while doing some shopping and we were pleasantly surprised at how great it was.  The dining room is rather large and very upscale for the price.  The food was great and I loved being able to see a sample dish before ordering.  We have been skipping the food court for years in favor of the other area restaurants but this little spot will be something we try more often now."}
{"text":"i love the tomatoe bisque with crustini here- its just perfect. i really like the atmosphere here : on my day off i like the grab a bowl of soup with crustini and a window booth. i dont usually have to ask for more napkins, crustini, water, etc. that to me is a good sign. this place is a gem. i didnt like the grilled cheese suprisingly. needed more butter. the soup however is to die for."}
{"text":"I love nordstrom cafe because our waiter Dewy Es very fast, friendly,always smile,she's very professional;always offers water,bread etc keeps checking if we need anything else,she makes sure were satisfied with food and drinks,She make customers come back there because Her service is impeccable,she's the best employee there!!!please congratulate Her for been nordstrom best employee!!!"}
{"text":"The best service you can get.  Food is delicious,  fresh and always tasteful. The servers are very courteous and friendly;  they make you feel like you are at home. This is one of the best alternatives for food at Fashion Square."}
{"text":"Great food that is reasonably priced. A must if you are in South Park mall near lunch/dinner time!"}
{"text":"If Cafe Nordstrom existed outside of the mall, I would eat here every single day!  Everything on the menu is AMAZING. My favorite entrees are the salads. I have never had a more difficult time choosing a salad. My favorite is the salmon salad, but they are all good! The soups are just as tasty. The tomato bisque is out f this world and the garlic crouton it comes with is just as delicious. Also, to finish it all off, if you have not had a magic bar they are a must try!  If you haven't eaten at Cafe Nordstrom, skip the food court and do yourself a favor and try it. You will not be disappointed, especially after a long day of shopping."}
{"text":"These reviews seem to be a mix of the Cafe and Coffee Bar, my review is specifically for the Coffee Bar.  The bar is in front of Nordstrom in the mail and is a rip-off of Starbucks, but a marked improvement. Starbucks coffee/espresso has an acidic and burnt flavor. Nordstrom's coffee is smooth and roasty. This is a popular place, the time from the entering the line and receiving your drink is usually 8-10 minutes.  If I'm in any sort of mood for coffee, I can't help but stop."}
{"text":"Great salads and superior attention to details. Husband had the salmon which was perfect. Loved the apple pear salad."}
{"text":"I have consistently dined in Nordstrom Cafes for as long as I can remember.  I have been disappointed as of late as Nordstrom has seemed to follow suit with every other restaurant out there and has changed their recipes to lower their cost of business.  Sandwiches that were once served on ciabatta (or similar) are now made with regular white bread.  The margarita pizza, which was once bursting with flavor is now very mild and bland (did they change the cheese?  Did they change the sauce?  I dunno, but something is different, and I am not the only person who has noticed!).  I have particularly never been a major fan of the Scottsdale location because in the past, the wait staff was a bit curt.  However, after eating there today, it appears to me that some positive changes have been made.  The man at the cash register was very nice - he and his coworker were cracking funny jokes with me.  The woman who served us, Lisa, was outstanding.  She was quick to help (we were there for a birthday party and had a few kids with us), our drinks were never empty and she bent over backward to accommodate our every need.  She is a stellar employee and asset to this cafe - something they have been lacking for a long time.  The food is still decent, it just isn't what it used to be... but that's pretty much anywhere you go these days.  Sad, but true - I am learning this is a consequence of a struggling economy.  This time around, though, the customer service was fantastic.  Thanks for a fun day, Nordstrom!"}
{"text":"Best kept secret Nordstroms has! Well except for the bi-annual women's and children's sale in December  and July.  Men's sales are run at different times of the year.   I digress. Tucked upstairs in a corner, you are greeted by a chalkboard of daily specials, small uncomplicated menu, soup of the day, 2 registers and a dessert case that is not to be missed.   To date, I have tried salads, soups, sandwiches and pasta. All have been fresh and enormously satisfying.   The high end service is friendly but not too stuffy.  After placing your order and paying at the register, you are free to choose a seat where ever you would like: center table or large padded side booth. A server greets you, confirms your order and serves your beverage.   If you are accompanied by children, yes children in the Nordstrom's Cafe, they will be served a healthy snack of fruit & bread while waiting.   Nordstrom gift cards are also \"good\" at the Cafe.   My only regret is that I don't remember it's there unless I am searching for an affordable item or using the nearby Ladies Room.   Don't be fooled by the pricey items just outside of the Cafe. It is actually quite comparable to Panera in price and a 4 star restaurant in quality.  I will definitely go back again and again."}
{"text":"Usually very good.  Today however, not so much.  Understaffed at the food counter.  Marginal food.  Not enough staff in the dining room to take trays,  etc.  Certainly not worth the premium charged for salad and soup."}
{"text":"Came here for lunch and the marketplace definitely held up to the level of service expected in Nordstrom.  Our waitress was very efficient and nice.  We had to wait a few minutes to be seated, but after eating here I understand why many mall goers come here for a nice meal at the mall.  I had the soup of the day, which was a mexican inspired broth chicken soup.  It was delicious!  And I was pleasantly surprised hearing the customers at the next table raving about the soup so much that they were trying to find a similar recipe online for them to make themselves.  The waitress went in back and was able to get a recipe for the soup from the kitchen staff for them.  That is going above and beyond!  They had so many good options that it was hard for me to pick one, but I landed on the classic french dip.  The roast beef was actually not well done, but had nice pink in the middle.  And the baguette was not hard as a rock, like so many french dip breads are since you are meant to dip it in the au jus, it was able to stand up to the dipping but wasn't hurting my mouth with crunchiness.  I truly enjoyed this meal and look forward to coming back for dinner."}
{"text":"I have been to this restaurant quite a few times, however this was my first time going since it has gone from order at the counter and then be seated.  It was a Sunday afternoon and the restaurant was busy but not full.  We had our one year old daughter with us.  I ordered a french dip and my husband a chicken sandwich.  After waiting for 30 minutes our waiter apologized and asked if we wanted some soup- we declined it was a hot day and we just wanted our meals.  I am pretty sure they never put in our order because after another 30 minutes our food still haven't arrived.  We got up and left at that point as our daughter was starting to get fussy- to be expected after sitting patiently for 1 hour!  Such disorganization and poor service I am sad to say that although the food I have had in the past has been good, we will not be returning."}
{"text":"Wandering into the Cafe after a day's shopping, we were surprised by its excellent selection of food at very reasonable prices.  We settled on a pizza, and it was one of the best we'd eaten in Scottsdale, almost on a par with Grazie's Pizzeria and Wine Bar.  We plan to return to he Cafe soon, even if we don't happen to be shopping.  Give it a try; you'll enjoy it."}
{"text":"I just had the grilled shrimp and arugula salad, AGAIN!! Absolutely delicious! Dressing on the side for a no guilt, healthy, delicious and filling lunch or dinner. I am also taking home several desserts. Magic bars, giant macaroons, peach and almond bar (first time for this one) and a few raspberry scones, one of which I am eating while writing this.   Stellar cafe and awesome waitstaff and employees.  Make sure to bring dollar bills so you can tip them accordingly.  Tipping  is optional, but they do a great job of refilling your drink, getting extra napkins and anything else you ask of them.   Enjoy.."}
{"text":"I love this place...try te\he tomato basil soup and the the every single salad is great!  The food is always fresh and tasty!  i love their paninis and pizza too its awesome!  Everything is good!  Of course, they have all the amazing desserts out for you to see so you cannot pass them up.  My favorite is the lemon bar!  The service is always awesome and its great because you can grab greta food while you shop!"}
{"text":"What a lovely find!!  Surprisingly, Located inside NORDSTROM. It's on the second floor off of the escalator in the left hand corner.   I had an Amazing sample of the tomato bisk! - highly recommend!!!! That sample was so good I got a bowl. Really huge by the way!  Day-We is fabulous! She is a cheerful and very pleasant lady who brought out our beverages and meals.    路Cheese pizza- Amazing!!!  路Alfredo tomato penne w/ no chicken- Incredible!!! Next time I might request the spinach raw instead of over cooked wilted. It still tasted good!  路Cesar Salad- Really good!! Delicious dressing! The croutons are a little big. Next time I'll order the dressing on the side because the leaves were a tad wilted. My friend said the parm wafer tasted like feet.   路Kids meal- Unbelievable!!! Really fabulous! Penne Alfredo - Big portion, milk, fresh fruit, raisins, and side of cheese $6 total. Wholly Molly!! What a deal!  Tried the Red Alfredo and it was too spicy."}
{"text":"Great menu, comfortable booths, and kind service.  We had the Chicken Lime Cilantro Salad and the Chicken Alfredo-- both of which were great!  No wait later in the afternoon, a nice quiet escape from the mall crowds.  Located on the second floor of Nordstrom."}
{"text":"Service was outstanding. Food was delicious. Both the GM and Chef stopped at the table to see how we were. It doesn't get much better than that."}
{"text":"Consistently good food.  Only thing better than the food is the wait service.  Yes, one has to order cafeteria style; but servers will check on you throughout the meal."}
{"text":"best salad in pittsburgh, i can't say which one because it's my secret!  best lunch spot  everything i have ever had here is excellent and all lunch companions have also loved nordi's cafe.  okay, the salad is the cilantro lime chicken salad.  grilled corn, lettuce, chicken, toms, roasted toms, cilantro, lime, cheese, and this incredible dressing."}
{"text":"Five stars!  I rarely give such an supreme review but today's meal is exceptional!  The creamy garlic vinaigrette dressing is so tasty!  I scraped the plate clean and asked if this magical salad topping comes in bottles like the others do.  To my dismay, I found out that it only has a shelf life of two days, so they do not sell it. Darn!  I would be paying for it right now, if I could!  The chicken club sandwich came generous with avocados and the maple bacon had a presence that gave just the right balance if sweetness.   Table service was wonderful to boot!  I loved lunch here today!"}
{"text":"We had chicken caesar salad, chicken with angel hair pasta and pizza. Good food and good service. Nordstrom cafe is my go to place."}
{"text":"My friends and I have eaten here several times and will continue to do so in the near and distant future, due to the friendly and fast service and delicious food. It's also fun to people watch, lol.   It was an unexpected surprise to find a cafe in a store at Southpark.    Its surely worth a shot to any newbie!! Give the soups a try... great, now I'm hungry and its 5:02 AM, Jan, 01, 2016."}
{"text":"Always good, I loved their cilantro salad and their creme brule in my opinion the best"}
{"text":"Great place to grab a nice meal that doesn't rob you of every dime!  Easy, quick...and you can grab some shopping too!"}
{"text":"The quality of food is way better than a food court.  But I am really disappointed this is not a Nordstrom's Bistro, especially at this high end fashion mall.  And what is the most disappointing is NO crab bisque soup!  That is like a Nordstrom starring soup in EVERY Nordstrom's I've dined in, Northpark Dallas, San Francisco.  So when I am shopping and spending a lot of money and a lot of time on my feet in pretty much one store, I do not want to have stand in line and point to food, I want to be seated, order taken, and served.    Downstairs Nordys Express is for the prewrapped sandwhiches and salads...Upstairs they need to seriously think about turning this into a bistro."}
{"text":"Our first time dining here, my husband and I didn't really know what to expect. But we learned that you order at the counter, pick a table and a server brings out your food when it's ready. We went with the Soup Du Jour which was a butternut squash soup at the time, a Blue Cheese & Pear Salad and a Cranberry Turkey sandwich. The cafe itself is quite dark and mostly the tables are lit. The atmosphere (and also the food) reminded me of an upscale Panera Bread.   The food was simple, yet well put together. It was what you would expect from a cafe, but a hair fancier than your average cafe. The soup was rich, creamy and even included a garlic toast. The Blue Cheese & Pear Salad was good, but very sweet. Also, they were generous with the blue cheese, which got to be too strong at times. The sandwich tasted fresh and the bread was a bit crunchy on the outside, adding a nice contrast in textures. You really can't go wrong with the combo of turkey and cranberry.  Overall, this may be our stop to grab a bite any time we are in Ross Park Mall. Good, fresh food. Nice experience."}
{"text":"Amazing food!  Amazing SERVICE!  I love Cafe Norsdrom.  The quality of food is A+ and service cannot be beat!"}
{"text":"First time eating here would always pass and would get the incredible smell of the food here.  I ordered the chicken & cheese tortelloni without the tomatoes, my sister got the salmon, my dad the pizza & mushroom pizza and my mom the famous Asian salad. The food was really good the only thing is that the servings are not that big and the prices are pretty high. One other thing is they don't have much of a selection of drinks. Other than that it's was good."}
{"text":"Delicious food... in a mall?!  Oh yes, it can be done.  Thanks to Nordstrom, I have a consistently good spot to lunch anytime I'm at Fashion Square.  Their little cafe on the 3rd level is actually good enough to make the trip to, even if you have no shopping to do.    Their salads are fresh, with loads of tasty toppings.  My favorites are the cilantro shrimp salad with polenta croutons, Chinese chicken salad, and spicy salmon cesaer salad.  Paired with a cup of their famous tomato-basil soup, and I'm completely satisfied.  Their pastries are quite tasty, and I can rarely pass up a slice of their lemon-coconut cake.  You really should go and get a slice.    Next time you are at Fashion Square, don't miss this perfect lunch spot!  **my 100th review!  I think I should go and get a slice of lemon-coconut cake to celebrate!**"}
{"text":"It's pretty good eating here. The salads, soups, entree's and pizza are consistently good and the atmosphere is lovely. Even though they use farmed-raised salmon in their salads and the entree, it is cooked in a way (and with sufficient spices) that it tastes pretty good and isn't fishy.  All of the salads are wonderful, and the pizza is pretty darned good. I love their tomato-basil soup and the sandwiches are yummy. Some of the desserts look better than they actually are, but the brownies are rich and wonderful and the cakes are pretty yummy, too.  Great place to eat when shopping at Scottsdale Fashion Square. In fact, probably the best place to eat while shopping at Scottsdale Fashion Square! My husband really doesn't like it when I drag him along because he thinks \"it's a women's thing\"....FYI."}
{"text":"Nordstrom Cafe is good food during a long day of shopping. The food is good and of course you pay for the convenience and location. Frankly, the food and style of dining is very comparable to dining at Paradise Bakery downstairs."}
{"text":"Everything here is great. I've had the salads (fav is parm crusted chicken). Had the sandwiches and pasta also which are awesome. Soup is good. Haven't had the pizza cause I usually eat that at Pomo, Sauce or Grimaldi's. Anyway, if you are in the mall this is some of the best food there cause food court is awful."}
{"text":"I have been here a number of times and enjoyed it every time. The steak is good but the meal is made by the fresh vegetables and lime cilantro sauce. Surprisingly large seating area with many menu choices. Reasonably priced for what you are getting."}
{"text":"I like grabbing a bite to eat here whenever I make my way to Ross Park Mall. Ordering is quick and easy. Order, pay, and find a seat. It's an upscale fast food cafe, minus the fast food. For a quality food in a pinch, I reccomend eating here. So far I've had the roast beef sandwich, chicken rosa pasta, chicken artichoke pasta, hummus and the risotto. All were good! Oh, they also serve adult beverages. ;)"}
{"text":"Don't get in line if you're not ready to order. I did that and got judgmental stares because I'm indecisive need to look at all my options. This place is casual but offers good quality food. The clientele is noticeably different from that of Johnny Rockets and Panda Express (love Panda btw) downstairs.  I would stay away from the boring sandwiches. The paninis, pizzas, pastas, entrees, and salads all look great. I enjoyed my mushroom and ricotta pizza. Wasn't wowed by the tomato soup. Prices are Nordstrom prices for \"cafe\" food."}
{"text":"This is a favorite place for lunch and pop in dinner or takeaway. However, recent menu changes are a bust. Nicoise Salmon Salad changed and not nearly as good, another at our table had the formerly favorite Chinese Chicken Salad and recipe change again and not good. Another person had a grilled cheese sandwich which was fine but accompanying sandwich was a tiny brown paper bag filled with potato chips which were seasoned with such a strong mix of flavors that no one in our four party table liked and left the tiny bag full. Tomato soup still excellent. Someone came in and should have said, if it's not broke, don't fix it. The restaurant wasn't nearly as crowded as typical for the season. Maybe word is getting around that they wrecked the menu with the changes. So disappointing!"}
{"text":"Nordstrom Cafe located on the second floor of the store in the Scottsdale Fashion Mall has to be the best kept secret in town. The food is consistently fresh tasty and has good presentation.  The process is to walk the cafeteria line of a gourmet place, selecting your soup, salad or entree choice, dessert or fresh fruit if you will coffee, wine and a variety of other beverages. An attendant will help you to your table and bring your food if it is a hot entree, or help get your coffee, wine etc. while your relax from the days shopping.  They provide half salads for a liter appetite.I have gone here for years the food is always good. The carrot cake is one of the best I have ever eaten but the coconut cake is not shabby either.  Next time your shopping at the Scottsdale Mall keep them in mind if your tastebuds want freshly made food with savory flavor."}
{"text":"I enjoyed the salad I had here, though I feel their prices are a bit high. There was a mixup with food, however, and it was given to someone else the first time it was ready, leaving me without food for 20 minutes. This normally would lead me to write a bad review, but the waiter who brought my food out apologized politely and even have me a refund for it."}
{"text":"Delightful bistro nestled inside of Nordstom's at th Fashion SquAre Mall serving locally grown food.  Relaxing environment with booth style seating and tables for larger gatherings.   It was difficult to choose one dish from the oven baked pizza , bbq steak, shrimp pasta   I had the grilled Salmon served with freshly baked zucchini, carrots, corn and  potatoes ."}
{"text":"I love having a late lunch after a successful shopping day. I prefer to come here over the food court since it is so much more relaxing.  The service is so attentive and I can enjoy my meal and rest my tired feet for a bit.  I usually order the Cilantro Lime Chicken, light on the dressing or the Grilled shrimp and arugula salad with sweet corn.  I guess I like all my meals with a little sweetness on them. Today I felt like a grilled cheese and tomato soup. I was splurging since I have lost some weight. They don't offer that choice for adults, but how awesome are they. The let me have the kids meal, with the beverage and the side of fruit. I was in heaven."}
{"text":"I was a little embarrassed to admit to my co-workers that I REALLY wanted to eat lunch at Nordstrom Cafe! To my surprise they were equally as delighted and it was a nicer alternative to the hum drum food court experience.   The cafe is located on the third floor of Nordstrom's right next to the young women's clothing department. I adore Nordstrom Cafe in my hometown of Honolulu and was very happy to see that the quality was right on par. I always order the angel hair pasta with spicy shrimp and it was EXACTLY what I expected. I always request that there be no spice added and they were more than happy to accomodate! Move over McDonald's because Nordie's has got the duplication process down to another level!   (Photo: http://www.yelp.com/biz_photos/cafe-nordstrom-scottsdale?select=8KOO0n8EuWaUWGK_Ha4Z3g#8KOO0n8EuWaUWGK_Ha4Z3g)  Although the restaurant was smaller than I expected, service was wonderful, food was delicious and the only thing which went wrong was they got my friend's order mixed-up. But of course in true Nordstrom Cafe fashion, they apologized profusely and fixed it right away. You are my cafeteria style home away from home Nordstrom Cafe!!!  31 Yelps Challenge: #10/31"}
{"text":"Save your money and go to Paradise Bakery in the food court. Same quality of food for 1/2 the price.  I had the turkey cranberry sandwich and the chicken soup. The sandwich was actually quite bland and the soup wasn't much better. For nearly $20 for a soup and sandwich, I was expecting some wow.  Just cuz it's Nordies doesn't mean it's quality."}
{"text":"My new favorite place for lunch! Excellent healthy food at a reasonable price. The Roma Tomato & Basil soup and the Chinese Chicken Salad are freshly made and amongst the best I've ever tasted!"}
{"text":"I had the misfortune of spending way too much money at Nordstrom's today, but I was fortunate enough to have had an excellent sandwich here so it kinda sorta made up for it.  I had the steak and portobello sandwich and it was extremely good.  It was full of sliced steak, mushrooms and cheese.  The bread was a chibatta I think and it went excellent with the sandwich.  It was very very good and I would order it again.  My wife had the Caprice salad and it looked good as well.  The place is nice, clean and the staff is very friendly.  However, the place is a gigantic ripoff but it is what you'd expect from a cafe in Nordstrom's.  It was almost $30 for a sandwich, salad and a soda.  I would go back though because the sandwich was that good.  Their other stuff looks good as well."}
{"text":"I stopped in one evening on my way home from work trying to find the most healthy option next to preparing my own food because I was too lazy to do so on this particular day.  I ordered the Nicoise salad with salmon.  It was fantastic.  Not too big, but the perfectly sized portion for dinner on the go.  The man at the counter was polite and took good care of me while I waited for my food.  I would definitely go back - my roommate also recommends the chicken tenders and the turkey Panini."}
{"text":"Hungry for lunch and not wanting to walk any further my husband and I decided to give nordstrom cafe a try. They have a self order counter where you give your cashier your order and pay for your meal before choosing a table. The cashier was not welcoming,disinterested and rude. Surprising to me as I have always admired  nordstroms commitment to providing great customer service. After sitting down we were shortly greated by the server. I asked her what the cashiers name was. She said \"Why you don't like her\" I told her she was very unwelcoming and she said we were the third table to complain about her that night. The food was good although I don't know if ill be back if the beginning of my meal starts out so unpleasant."}
{"text":"Nordstrom is a favorite dining spot for me when traveling the US and wanting something reliable and not trying a local place which might disappoint.  Plus there are standard items I love like Roma Tomato Soup with parmegiano crustini.  The Scottsdale Nordstrom has the same high standards in their cafe as the rest of the chain and extremely attentive service.  always a dependable stop for a light casual meal or snack.  They now sell individual 3 piece serving packs of the chocolates they have been selling in larger gift boxes in their cafe's so you can buy triplettes of their chocolate mint chunks or sea salt sprinkled caramels covered with milk or dark.  What a perfect and indulgent dessert alternative when not in the mood for their fantastic regular selections-and their chocolate layer cake is one of the best anywhere!"}
{"text":"I like the food here, everything is fresh and where can you go to get a good cafeteria service???  You grab a tray, tell the staff behind the counter what you want and grab your dessert, then drink and sit down and there are servers to help you put your tray away and replenish your drink if needed.  If you order something that takes longer to prepare, a number is handed to you and the server brings you your food.  Good choices for light meals, tomato basil soup is super yummy, love the Salad Nicoise with Salman, pizza for the kids, creme brulee for dessert!  At the end of the meal, the server gives you a little mint chocolate stick and I guess this is your cue to tip him!  Good customer service so I never hesitate to give them a little tip before I leave..."}
{"text":"Different menu - not so good. Salmon entree was very very dry.   Again so very dry that it was close to inedible. Manager said the salmon was wild caught Ok -farm raised, wild caught -doesn't matter -it is all how it is cooked. Offered to make another piece or substitute shrimp  but we asked to remove from bill. Had ordered two salmon entrees and only one removed. Had penne Bolognese - new recipe with chicken meatballs. Again not so good. Bring back the old menu !!!!"}
{"text":"Great place with very good. Awesome place for lunch. I had the spicy shirt angel hair pasta."}
{"text":"The portions are tiny, costs me a bundle to fill up here but their food is exceptionally great. Their blackened salman Caesar salad is my top pick."}
{"text":"Unless you go to Pita Jungle DON'T go to the food court and come here instead. Favorite: Grilled chicken salad with candied walnuts etc and the best tomato bisque soup."}
{"text":"Excellent Asian chicken salad, cheddar chive biscuit and the biggest coconut macaroon I've ever seen! My friend and I split it and it was delicious!!! Great service too! I would go back and order the same items again because they were soooo good, but there were lots of other offerings that looked just as delicious that I might have to try next time."}
{"text":"Extremely loud. The smoked turkey sandwich bread was dry. Pear salad was good usual."}
{"text":"I love this place. The food display makes you appreciate their culinary skills even more. Tasty and nutritious food, great place to sit with friends and family.  The reason I am giving 4 instead of five stars is yesterday's experience. I took my friend for lunch there and the pesto Panini we ordered to share was dry and had anything inside the bread slices: sundried tomatoes, dried :( chicken, cheese, all toasted with butter BUT pesto. Unless they call pesto a few basil leave slivers. Stop by the desert bar. There are some delicious pear and raspberry bars.   A bit pricey but usually high quality food."}
{"text":"Who knew at the Fashion Square is a very good cafeteria? It's nice that you can see a sample of each platter so you know what to expect.They do pizzas , soups , salads , Sandwiches , pasta and entrees and the most expensive meal is $13.50 for grilled skirt steak .  They say on their menu that they use cage free eggs, organic  local  (when in season) sustainable foods in season produce .   I had their Nicoise Style Salmon Salad . ($12.25) It was delicious. The seasonings were just right , the salmon was cooked nice everything was good. It was great that the salmon and potatoes were warm .   My husband had the Cilantro Lime Chicken salad . He said it was very good but seemed a little light for him so I gave him most of my potatoes , eggs and some salmon .  The only down sides of cafeteria dining were if you are with packages it's hard to hold a tray and if your meal is all cold they hand you your platter and the hot items are ran out to you so you might not get your meals together."}
{"text":"Incredible service, food and location!  My favorite is the warm Asian glazed chicken salad!  Reasonably priced right inside Nordstrom's in the mall.   It was recently remodeled to fit more tables they also sell their salad dressings with are fantastic!  They have a nice sized menu which includes salads, flat breads, pizza etc.  perfect spot for lunch time or light dinner!"}
{"text":"Great snack, lunch, dinner, and dessert options in Nordstrom in a casual and relaxing setting. Great service. Very good salmon, excellent specials, solid caesar salad."}
{"text":"There seem to be reviews here for both the Espresso Bar and the Marketplace Cafe. Mine is for the Marketplace Cafe.   I had a late lunch here and found a very light crowd at this cafeteria style restaurant. The staff was friendly and attentive and the dining area clean and comfortable. While the food was good and I have no major complaints, I couldn't bring myself to give it the four stars so many other had considering I didn't feel any \"wow\" factor.   For my entree I had the Parmesan Crusted Chicken. The chicken was good, perhaps even a bit too crunchy for my particular taste. My only concern is that I never tasted a hint of Parmesan cheese. The salad also consisted of mixed greens, diced tomatoes, bacon, chopped egg, avocado slices, corn and a creamy dressing that brought it all together. For me, the wrong dressing can ruin a salad, but I was very happy with this one. In fact, I believe you can even buy bottles of their dressing at the checkout area.   Although I'm not a big fan of almond flavor, I do like raspberry and ordered the Raspberry Almond Bar for dessert. The portion was ample, though I wished the crust were more flaky than dense, that the center were moister and that there were a greater proportion of raspberry (jam???) to top it off. Not a bad dessert, just no \"wow\" factor I hoped for.   I will say this place is a great alternative to the mall food court. While I'm sure kids are welcome, this is a great place to escape the noise of the food court."}
{"text":"So yeah, I've been a fan of Nordstrom ever since I worked at the Paseo Nuevo Santa Barbara store (#344) over 20 years ago when I was in college. (Yikes!) They are widely known and respected for quality designer merchandise, diverse selection, and unparalleled customer service. But what some people don't realize is that their cafe is pretty amazing as well! Yes - their food!  At the Scottsdale Fashion Square store, the cafe is tucked away on the third floor next to the restrooms. From the sales floor, it looks like it would be pretty small. It is only once you go inside that you realize just how spacious this place is. Ordering is done \"cafeteria style,\" though with the exception of soups and desserts, you don't actually pick up your food at the line - you get a table number and a server brings the food to you. Ok, so it's not a fine dining experience. But that's ok, because the quality and variety of the food more than make up for it. They have a wonderful selection of sandwiches, pastas, salads, and entrees, along with an absolutely decadent array of desserts. They even serve wine if you're so inclined.   On this last visit, my son and I went because he was craving their tomato basil soup. Tomato soup. I think it's worth mentioning that we do not live close to Scottsdale. This Nordstrom location is about 25 minutes away from our house. But in his mind, no one even comes close to making a tomato soup as good as they do at the Nordstrom Cafe. The soup is silky smooth, with a nice deep tomato tartness. It is served with a toasted crostini. My son likes to dip the crostinis in the soup, so we usually order an extra side of bread.   Tip: Ask for more crostinis!! They are so good!  I went with the mushroom ravioli. Seven wonderful pockets stuffed with a chopped/pureed mushroom fill, served with a creamy mushroom/sun-dried tomato sauce and topped with parmesan and fresh basil. At first, I was worried that seven raviolis would not be enough, but after savoring the last bite I had to admit that I was stuffed and completely satisfied.  The service was prompt and attentive and the overall experience was great.  With all the great things that Nordstrom has to offer, it sorta funny that the main reason my son and I drive across town to Fashion Square...is for the food!  Try it - you won't regret it!!  Oh, and the prices were pretty reasonable - our bill was under $20."}
{"text":"Sure beats the stale pizza at Sbarro.  Great place to escape the hustle and din of the mall.  Tough to top the Nicoise Salad."}
{"text":"Excellent service and the best food you will find in the mall. This is top notch quality in terms of ingredients and cuisine. Sounds strange considering it is a Nordstrom cafe, but believe me, you won't be disappointed! I've had many items on the menu, my favorites being the Nicoise salad and the Pesto chicken risotto (which I believe was a special/seasonal item). Definitely give this place a try!"}
{"text":"I only went there at first following a pretty man, I'm a Starbuck's whore. I like my fancy overpriced drinks.  I accidentally ordered a tall muscular man on a stick...later correcting myself to get a tall soy latte. After he left...I realized that my latte was good..almost...dare I say...as good as Starbucks.  I'm only bias at times because I make coffee or a living.  But when I taste good coffee I admit it.  And they are the only place that sells good vegan cookies...my weakness.   Its on the bottom floor of Nordstrom...and no better place I'd say.   Im having another affair with this place..and I'm liking it. Starbucks...my husband, Dunkin's my pool boy, and Nordstrom...my dirty filthy cougar bait!"}
{"text":"Delicious fresh ingredients prepared artfully and quickly. Staff is very attentive and friendly. Always come here and all menu items are fantastic."}
{"text":"When a cold hits and the fuzziness sets in, all I want is soup and grilled cheese. Well, I find some great soup here! They have some of the best tomato basil around and it comes with a nice cheesy piece of bread. This combination is perfect for a cold day or a stuffy nose day!"}
{"text":"I guess this is my to go place with my new daughter in law when I am in town.   This is our second time here and we are never disappointed.  I love the ones in Denver so why would I not like the one here.    This time we both had salads and a cup of tomato basil to share.  Everything was delicious.  The only problem was I had to ask for our chocolate sticks after eating.  That was a fist but we got them and our waiter apologized.  Of course I will be back.  Its Nordstroms."}
{"text":"I have never tried a Nordstrom cafe before so I wasn't sure what to expect but as soon as I walked in I was greeted. The food was great as well. The lemon bars are AMAZING!! I have never had a lemon bar as good as I did today.My server Salvador was always quick and attentive. This was the best service I have received!"}
{"text":"Anytime I go to Nordstrom at Southpark Mall I go to Marketplace Cafe for lunch. After \"shopping til I drop\" this is a wonderful restaurant to eat at. You order at the counter, they give you a number and then you choose your table. Shortly after you've sat down a friendly staff member will bring your beverages and in no time at all your food is brought out. My Gee always orders a Turkey sandwich with cranberry spread and she is in love. I order different items each time I come. Most recently I ordered the Fig and Berry salad with grilled salmon. My salad had figs, blueberries, candied nuts, goat cheese, arugula tossed in a lovely dressing. This salad was one of the best salads I have had in my life! It had the perfect amount of everything, sweet and savory with the berries, figs, goat cheese and salmon. I ate every last bite and I was so delighted at my choice. It filled me up but it wasn't too heavy. An excellent choice for your hunger needs!"}
{"text":"My daughter LOVED her first lunch here, and wanted to treat me this Saturday afternoon.  She ordered the same Chicken Mozzarella on Parmesan ciabatta she had the first time, and I ordered the Cranberry Turkey on multigrain ciabatta.  Both were outstanding!  The bread was perfectly crispy on the outside with a healthy covering of grain on mine and dried Parmesan (yum!) on hers.  Everything tasted fresh, and after trying her sandwich, with the amazing pesto aioli, I couldn't decide which I loved better.  They were completely different, but one just as delicious as the other.  Not to mention the dressing on the side Caesar salad.  It's a bit pricey per sandwich, though, ($9.50 & $9.75), with only a side of a handful of chips, which is why the 4 stars vs. 5.  Great table service too!"}
{"text":"Good flavors. Fresh food. Decent prices. Just wish serving sizes were a bit bigger or that the meals came with a side. We always seem to leave hungry. But still a better option than most of the mall food."}
{"text":"I've heard many good things about Nordstrom Cafe so I thought I'd try it out.  As soon as you enter, you have to order at the register and then pay before sitting yourself at a table.    FOOD:  I had the roast beef with the horseradish aioli sauce, onions, and arugula. It came on a ciabatta bread.  Delicious!  It comes with a side of potato chips.  It was just enough for a quick lunch."}
{"text":"Great Service !!! We needed a place to do a little work and were also going to need lunch. We stopped into Nordstrom Cafe. The service was amazing. Manny set us up in his section and brought us tea while we worked a couple of hours. Then he took our lunch order, after making some recommendations, and brought it to us.  Now that may not sound like much. But this is a cafeteria style place where you line up and order, but for us it was full service. We will be back to the Nordstrom Cafe.  Thanks, Manny."}
{"text":"Okay my first time here and I do not give out 5 stars easily. Even though it's a cafeteria style service, they are quite attentive to you when seated. The food was simply outstanding. If a cafe style place like this can do it, you'd think a full restaurant could as well."}
{"text":"It was a sad day for my wallet when I first discovered Nordstrom Cafe. I worked at Ross Park for almost a month before finally trying the place, and I was instantly hooked. No more mall food court for me.  The roast beef sandwich with horseradish aioli is seriously some good stuff. It comes with a side of chips but what a lot of people don't know is you can actually substitute a side salad with your choice of dressing. Personally, I can't get enough of the cherry balsamic vinaigrette. Perfect combination for lunch. The pizzas are also good and they have a pretty wide selection of salads. Prices are about the same as Panera, but the food definitely puts Panera's to shame.  I usually did take-out and went down to the eBar for a Mexican Mocha and some people watching. What else are malls for?"}
{"text":"I couldn't do it, I couldn't order anything else, I tried, but I had to get the Nicoise.  It was as amazing as ever, I really love this salad.  The hubby had the roasted chicken plate and it was all very yummy.  Seasoned very well."}
{"text":"This place is tucked in the Nordstrom's but it is a little gem.  Everything at looks good and smells good in there! I did get the chicken pasta dish and it was delicious I ate every single bite of it. I was so tempted for dessert but I had to stop myself there. You get in line order what you want pay for it grab your drink and sit down and you will get table side service.  And I love the little chocolates they give you at the end as well."}
{"text":"I've been here a few times now. It's just so upsetting how long of a wait it is on a slow day. It's now been twice that I've had to wait over 20 minutes for a sandwich. It's not anything special that takes long to cook. I'll never understand this. I've worked in a kitchen before and I know there's no reason to take so long to make a sandwich."}
{"text":"This is a standard Marketplace Cafe. That said, food was great and staff was excellent."}
{"text":"This place is a gem. I visited last week and the salad was fabulous not kidding I would love to have one everyday!  Upscale service. They sell the salad dressings they use and they are really inexpensive. I would go back many more times. I bought two dressings and have been using them a lot. My family liked them a lot"}
{"text":"Amazing food and even better service. We loved our lunch here. Especially a big thank you to Leon for making my birthday special!!"}
{"text":"Hey, veggie friends: they will make any salad for you, sans poultry, and knock a bit off the price, without even being asked. That is pretty darn cool. The staple tomato soup is killer, and comes with a warm piece of garlic bread. The desserts? My god. So tempting. So delicious.   The seating isn't bad. It's like a regular restaurant, with nice booths, except you seat yourself after paying first at the cafeteria-style front. A nice man will then hover, refilling your diet Cokes and clearing your plates, and eventually will end your meal with a thank you card and minty chocolates. So nice!   Yes, it costs a little more, but it's a hell of a lot better than getting in a ponytail-pulling fistfight over a table in the food court downstairs. Total yum!"}
{"text":"Our trips to Fashion Square Mall  ALWAYS included lunch at the Nordstrom's Cafe. I say \"trip\" because we lived 45 minutes from this Scottsdale mall so it was a treat for us and well worth it.  The salads are made fresh, the tomato basil soup, the pizza's the salmon, oh my, I could go on and on. I love the kids healthy menu too (crayons).  Great service too. Cafeteria style.  Bonus:  Beer and wine served here!  Grab a tray Stand in line Place your order-(as you walk thru the line at the various stations) Place the number on your tray (they give you one on a stand) Pay for your food Sit anywhere  A friendly waiter comes to your table for refills on ice-tea, etc.  My personal favorite salad is the Parm Chicken Salad-yummy! (see my picture at the Vegas Nordstrom Cafe of it)  Eat here!  BTW: You can buy their signature salad dressings in a package of three or even take home some of the wonderful Tomato Basil Soup in a jar-makes a great gift too.  Oh, and they have a fabulous cookbook too!  Don't leave without one!"}
{"text":"Nordstrom Caf茅 is so underrated. When I've mentioned going here to friends that haven't been before, they're like \"I'm not eating at a department store\". But they have been missing out, the food is so fresh & tasty. I am not a salad person & I LOVE the Salmon Nicoise Salad ($11). It takes a few minutes for it to come out since the salmon is served hot on the salad, but so worth it. Also I always check out the soup of the day, they have tomato basil everyday which is delicious but I normally like to try the other one being served that day. Everything else I've had here has been good --pizza, sandwiches, etc. Strongly recommend when in need of a shopping break :)"}
{"text":"I used to love this place....until I got food poisoning. I know one other person who got sick from eating here too recently...definitely not going back."}
{"text":"So glad I have checked this out. I love going here when I go shopping. The food is very good. The waitstaff is excellent which is surprising since you order at the counter.   Never had a bad time here."}
{"text":"Fantastic option at Fashion Square. Forego all of the mediocre food court and most sit down options at the mall and head to the cafe instead. Tucked away in a quiet corner of the 3rd floor at Nordstrom, the restaurant is a nice respite from the busy mall. Yes, it is cafeteria-style how you order, but don't let that sway you, food is cooked to order. I have yet have to have a bad meal there. I've tried paninis, pizzas, soup, salads and desserts. The tomato bisque is indeed (as many have said before) quite delicious. And you do need to try the desserts. The cookies are to die for and the creme br没l茅e is real treat.   Service too is quite nice, although the frequent visits by the wait staff, asking if you need anything, can become a bit annoying. You won't however have to complain about bad service!   During my last visit I noticed each meal option had a calorie count associated with it on the menu, a helpful ordering tool if calories are something you track.     At the end of the meal the wait staff always leaves you a little chocolate/mint treat. A nice little extra. Definitely one of my favorites in the neighborhood.   PS: It can be busy at times, especially around noon with shoppers, ladies that lunch and mall staff, making the place a little loud."}
{"text":"At last, a \"big-city\" standard- the department store restaurant.  Very stylish, with great food, and pretty inexpensive.  Definitely beats the food court.  Sometimes mobbed at lunch on Saturdays but definitely worth it (plus the bar selection is a plus!)."}
{"text":"Perfect spot for a quick and casual (always delicious) lunch. My mom and I come here for their salads or get them to-go.  I've never had a bad meal here.  A few of my favorites:  Cilantro Lime Chicken Salad Salmon Nicoise Salad Chinese Chicken Salad  I've heard their sandwiches and soups are fantastic too but I'm hooked on the salads.. Love this place!"}
{"text":"The tomato soup is so lovely! This is one of my favorite places while at Ross park mall. Always a great selection of wine and nice quick meals. If you go in the fall or winter what are the tomato soup it is so good. Definitely has an upscale feel for a mall restaurant"}
{"text":"This was my first time eating here but it only took once for me to determine this is by far the best place to eat lunch at Ross Park Mall. You order at the counter and then choose a table. A server brings your drinks and your food to you. It reminds me like Panera except for the fact they bring your food to you directly as opposed to going to a counter to pick it up. I came here with my mom yesterday, a Monday afternoon, since I took the day off from work. Scanning the menu, the roast beef sandwich with horseradish aioli looked the most appealing to me. When I tried to order it, the cashier said they had no roast beef yet (it was 12:15pm) and that it was cooling. Scanning the rest of the menu, I decided to go with the cranberry turkey sandwich. Served on multigrain with havrati cheese and cranberry chutney, this was a good sandwich. The turkey was real roasted turkey which was also nice. It comes with either chips or a salad-I chose the salad with honey balsalmic vinegrette.My mom decided to go with the strawberry balsalmic and goat cheese chicken salad. She said it was quite tasty. Our meal was around $25-no alcohol involved just a water and an iced tea-which is a bit steep for not having actual table service but this was a good lunch spot so if I'm at the mall around lunch in the future, this will probably be my top choice for the meal."}
{"text":"The other Nordstroms I've been to just have the coffee bar but this is a full blown restaurant.  Its a great place to have a nice peaceful quiet lunch when you are out at the mall.  It is as quick as the food court but without having to deal with the crowds/lines.  Yes, of course the prices are higher than the food court but the food is much better and it is still cheaper than the \"sit-down\" restaurant options."}
{"text":"This is an average restaurant inside Nordstrom. I was a bit disappointed because the menu and choices are not constant. No side dishes only chips with the sandwich. Cannot buy chips as a snack, no french fries. Outside that the place is ok.   After giving this place another shot they totally fumbled the ball. I took my 2 sons age 4 and 10 for lunch not wanting to deal with the food court. Just tell me how long does it take to bring out two kids meals. Pasta. In the meantime the two tables in front and back of us have their food 27 minutes later their food comes as they just dropped the plates down no kind words like enjoy she just said \"pasta...Mac... it's hot\" and left. Not returning I got the message you cater to older adults and would rather not have kids here.  Your wish is granted will not return.  Order placed at 1:30 food out at 1:57. Sad"}
{"text":"My trip to the Nordstrom Cafe was like everyone else's I did not know what to expect Walking in, I thought it was a restaurant where you get seated but figure out the stand in line, cafeteria style type which did not bug me at all I found it kinda cool actually Walking down the line, there were soooo many different food options and each one looked amazingly good Kudos for the displays; the let people see what the dish looks like and how big the portions are I opted for the cranberry turkey sandwich and a soda, as well as a Snickerdoodle cookie After paying, you then get seated by a server and your food gets delivered to you Our server, Salvadore, was tremendous The service from him was impeccable He was super nice  My cranberry turkey sandwich was really, really good (I am not exaggerating) It also came with some plain potato chips which were great My Dr Pepper was always filled  and my cookie was heavenly  This cafe really blew my mind, expecially because it's located in the Nordstrom, in the mall I will for sure return to the Nordstrom cafe and I am anxious to try the tomato soup"}
{"text":"I don't think that many people know that Norstrom has a cafe. Not the ebar downstairs that sells water and quick snacks, but an actuall cafe where you could order soups, salads and sandwiches. And it's good, too!  I came here for lunch and didn't know what to expect. The format is a bit off, in that, you place your order at the counter and pay, but then you are seated and a copy of your receipt is put on your table. A server will then come over, bring you whatever it is you ordered to drink, and serve your food. Regardless, I was pleasantly surprised with my experience here.   They offer two soups every day, the first being a tomato basil soup and the second being the soup of the day. I ordered the tomato basil - delicious! It was nice and thick, but not creamy and heavy, it was served piping hot and it completely hit the spot. I also ordered a half a sandwich (which you can do when you pair it with soup). It was turkey breast with a pesto mayo and fresh mozzarella on a soft garlic roll - I could not eat this fast enough, it was so good!   Great service, great food, and a quick experience for those of you who are on the go. Nordstrom definitely did a good job here!"}
{"text":"The Turkey Cranberry sandwich and the Horseradish Roast Beef sandwich are the best!"}
{"text":"I can honestly say that there's nothing better than shopping and having a small bite to eat at the Nordstrom Cafe/Bistro. It's pretty much tradition that Stine H. and I would grab cups of soup and buttered noodles to share whenever strolling through Nordy's so this place brings back many nostalgic memories.  I love the Tomato Bisque and the French Onion soups and the little toast served on the side is crisp and perfect for dunking. This time around I wanted something a little heavier, the Spicy Shrimp Angel Hair Pasta is perfect and you can even half the serving to share. The pasta was perfectly cooked, topped with tangy marinara and big pieces of shrimp! The food is way better than anything you could get in the food court- for obvious reasons. It's just simply delicious.  The atmosphere is pretty quiet, the view and natural light makes it comfortable for eating and the service here is great. From our cashier to our server, they do their best to make your time spent in the cafe as pleasant as possible. I always tip and the little mint chocolates that come with the bill is always a great touch."}
{"text":"Looking for a light but amazing meal? This is your place. I tried this place for the first time before doing some shopping and loved it. We split the shrimp salad and salmon. Holy cow that salad... I would eat that salad everyday if I could and would recommend it to anyone. This is the perfect place in the mall and a must try! It is a bit expensive but you're inside Nordstrom and shouldn't expect anything less."}
{"text":"If you've been in Nordstrom's, you've probably seen this little cafe tucked away in the back.  It took me awhile to finally decide to eat there after seeing it dozens of times.    The cafe is a little more upscale than what you'll find down in the food court, and the menu consists of salad, sandwiches, soup and pasta.  They also have a few really good desserts, including a great cheesecake.    All in all, the food is pretty good and prices are decent for being a cafe in Nordstrom's, but I still think Tomatoes is the best place to eat in the mall."}
{"text":"I love the the Mexican mocha on ice. Very good very good very good! Very very very good!"}
{"text":"I am a die hard Nordstrom customer for life. They have the best customer service and selection by far. They also have the best lunch spot. Even when I am not shopping, I go out of my way to get lunch at Nordstrom Cafe. It is cafeteria style where you walk up and choose what you want to eat, pay, and then they bring your food to your table. They have sandwiches, salads, soups, pastas, pizzas, and desserts. The amazing thing is that they have actual visual display plates of all their menu items daily.  My go-to's are the shrimp and arugula salad  (the polenta croutons are warm and soft and delicious little nuggets of heaven), the tomato bisque soup that comes with a garlic bread crouton for dipping, and their mushroom ravioli."}
{"text":"Chef-created eats + Upscale Cafe = Yummers  Have walked by Nordstrom's Cafe many times thinking, well, it's a cafe.  Co-worker mentioned how much she and her family like it, so thought to give it a try recently while at the mall.  'Lo!  It is good.  Main categories are sandwiches/paninis, salads, larger entrees, and desserts.  My wife and our 10-month-old loved the fish and grilled (and moist!) vegetables.  Our 6-year-old cleaned off her plate of mac and cheese with a side of fruit.  And my experience with the prosciutto and mozzarella sandwich with salad was very good.  Their vinaigrette options are numerous and excellent.  Service was very pleasant both in ordering and the wait staff.  We'll be back."}
{"text":"Fast and convenient, tasty, good price and pretty consistent service (from Seattle to Portland to California to Scottsdale).  We love eating here as much as we love shopping here!"}
{"text":"Cafe Nordstrom is a great place to stop for a coffee or tea when you need a break from the mall rat race.  I picked up a really yummy Pomegranate iced tea there today.  Run, don't walk, to get one of these if you like iced tea.   It was so refreshing on a gawd awfully hot day.  They also had really yummy cupcakes with about an inch of chocolate frosting on top.  So good..their pastries always are."}
{"text":"The Nordstrom Marketplace Cafe' is the perfect respite for weary shoppers, and Nordstrom really does it up right. Next time you are at Scottsdale Fashion Square, consider Cafe' Nordstrom for the stop to make once you drop from shopping! This place puts the food court to shame. The food is fresh and tasty, and the service is prompt and efficient. You order cafeteria style, and a waiter brings your food and attends to your table for the remainder of your meal. The waiter we had, Armando, was excellent and highly attentive, filling our iced teas about 6 times!  It's a bit on the pricey side- but worth it, and still less expensive than other restaurants that flank the mall. The salads are excellent (I recommend Blue Cheese & Pear $9.50, Salad Nicoise with Salmon, $11.75), as are the pasta dishes and panini sandwiches (recommend Santa Fe Chicken Panini, $9.95). But make sure you save room for dessert. My favorite is the Magic bar, $3.25. They even have a kids menu, and there are numerous delectable choices here. You can't go wrong... Best part- it's an escape from ordinary mall food, and the food is so good that maybe you'll end up making a special trip here when not shopping at the mall!"}
{"text":"Good food but line to order a meal is always problematic. Can they do better? Salads are great. Waiters are loud, and servers and cashiers don't care."}
{"text":"I do have a habit to try each Nordstrom cafe at every place! The Scottsdale Nordstrom cafe is the coolest one I have had so far! All of the food has a display section, and we can order that according to that! I got attracted at the beginning with chicken parmigiana! And I ordered that right away. But after I walked through entire display section, I feel regretful because there are so many other good options! Anyway chicken parmigiana is good and tasty! Cream br没l茅e is also fresh and creamy! Service is good! Wine is good too! It is a cool and fun Nordstrom cafe! I really got impressed!"}
{"text":"BJ discovered this cute little cafe on one of our shopping trips.  We have dined here several times and it's a nice change of pace.  I was on a solo shopping trip on Saturday and was in the mood for by favorite salad. Grilled Shrimp & Arugula Salad with corn, grape tomatoes, grilled pieces of cheese and polenta croutons.  I would love to be able to give a description of all the other great meals I eaten here.  But I am a creature of habit.  I always get the same thing.  Service is always extra nice.  My server yesterday had a cute accent and kept my glass full of iced tea.  I really enjoy this spot."}
{"text":"This was my first time eating here and I am highly disappointed. As I was reaching for my fruit I noticed some white specks. I turned the grapes around and the mold was all over my fruit. Absolutely ridiculous. You would think a restaurant in a high end department would take the time to look over their products before serving them. Don't go here unless you want to eat moldy fruit."}
{"text":"We don't eat here because we were shopping at the mall. We shop in the mall because we eat at Nordstrom Caf茅. It is that good!  They deliver delicious food, top notch service and great flavor with such ease that it makes you wonder why most other restaurants don't get it right?. After all, it's still a departmental store, right? Their first priority must be getting their merchandise right, not food. Yet, it's right up there in the list of best places to eat in town.  I realized that when the food is good, your personal preferences take a back seat. When I am here, it's no longer a ravioli versus angel hair debate in my head. I will have both. One this week, the other next. I suggest you try everything on the menu, one after another, and, it's remarkable that the only place I suggest you do that is not even expected to be that good with food!  Don't dismiss the chocolate mints as just another after-meal freebie. Pure melt in the mouth stuff. Perfect finale to any meal at Nordstrom."}
{"text":"It's ok....cute place...decent food...usually busy...decent prices...ok service...very noisy.  Helper service is a bubble off a beem."}
{"text":"Cafe Nordstrom has been saving me from food court doom for years. If you're eating in the mall and you're not eating here, you've made a terrible mistake, my friend.   Everything is consistently delicious and well prepared, standouts include the angel hair pasta, shrimp salad, and tuscan salmon. Do yourself a favor and come home without a Panda Express food baby of guilt and sodium and enjoy some fresh cooked awesome instead."}
{"text":"I have eaten at various Nordstrom cafes in other cities so I am familiar with how they work. Here you order, pay, find a table to sit at and then served your food waiter style. Hence you will be obligated to pay a tip.  There isn't a lot of variety on the menu. My favorites are the cranberry turkey, the vegetable Panini, and the strawberry chicken salad.  Customer service is indeed friendly and food is cooked to order. It does have good Wi-Fi so you can enjoy your meal. Food is good-a little pricy but worth the visit. I usually eat there when I am shopping there but don't go out of my way for it."}
{"text":"This cafe remind of my aunt restaurant in France. Aah.. Home Sweet Home. The cafe has a nice layout, has very antique feeling to it. Great foods! I love their Jambalaya!! oooh sooo good.. And the foods are alway fresh, so you actually taste all of their ingredients! And also its located in Nordstrom, so after I'm done eating I can go shopping! This cafe is a awesome place to stop when your shopping in Nordstrom."}
{"text":"Great food, great service, very pleasant atmosphere. Price point is slightly high for what it is, but it's worth it. I eat the angel hair at least 2-3 times a week for lunch. Delicious and low-cal."}
{"text":"Ate lunch there today. My husband and I shared the turkey sandwich and the pecan crusted chicken salad. Both lacked flavor and no oopmh. For the price I was expecting something more gourmet. However, they did guess I was drinking an Arnold Palmer and refill it correctly."}
{"text":"Ordered the Salmon Entree. Salad/farro was really good, but the salmon was cooked to death and not enough seasoning. What's the point of touting wild salmon if you destroy it like that."}
{"text":"I've been coming here for years and never disappoint. They have the best salads but today I decided to have a pasta dish. The spicy shrimp pasta was really good. My friend had their special pasta primavera and it was really good as well. Not greasy but full of flavor. The vegetables were really fresh. But the best part of coming here is the dessert, cookies. I swear they have the best. Love eating here while shopping at Scottsdale fashion square."}
{"text":"Salmon nicoise salad and turkey chili bean were both excellent. Very helpful friendly attentive staff. All the menu items look very tasty including the sandwiches. I'll be back soon."}
{"text":"Nordstrom Cafe earns every single star. This is not your typical mall food, nor is it fast food. While the prices might be what you'd expect from Nordstrom, the food and service are so worth it. And there is something about nursing a glass of Malbec midday in a department store that feels extremely satisfying. Something like  \"yes, my friend this is the good life. Shall we have a tipsy stroll around the mall then?\"  I somehow always end up hungry around the late morning time frame when they still have so their breakfast/brunch special going and the omelets are always amazing. If I'm not catching their breakfast at the tail end, I go with one of their exquisite salads. A recent special was salmon cakes with spring greens which my hubby ordered and I got the grilled shrimp with corn and arugula. I'm starting to drool now just remembering it. Light, flavorful and not doused with a bottled dressing. Absolutely perfect.   The service is always extremely professional and they work very hard. There is really nothing about this cafe I don't like, except for maybe having to walk by the cute dresses to get there which usually ends in a purchase. *Sigh.*"}
{"text":"This is a nice little spot to grab a meal while at the mall. Food is good and reasonably priced. Much better than the food court! Tomato soup is excellent, sandwich's, pizza, all good."}
{"text":"I love Nordstrom's Cafe . This one isn't as nice as the others I've been too around the country, but the food is really good for an easy reasonably priced lunch. The salads are always good and the soups are to die for. Unfortunately the nutritional facts have been posted on their website and I freaked myself out. I will be back for less guilty meals."}
{"text":"Can not go wrong on anything you order here from salads to pasta to sandwiches and pizzas. the panini sandwiches are healthy, light , tasty. The salads are full of fruit and freshly prepared. The salmon comes with a huge side of veggies that are well prepared.   great service is expected at Nordstroms and they go above and beyond in the restaurant.  Will always consider eating here when in the area with all the intense restaurant competition around because of the food and service."}
{"text":"I'm not sure why I always forget about this place but every time I remember its there, I get excited about going back and do a happy dance! Literally! This past weekend was no exception!  Service at the ordering counter is always great and everything looks so amazing. I usually go for a full salad and get as much of their cherry salad dressing as possible. The stuff is sooooo good. One of the best salad dressings out there and my last visit, I saw full bottles for sale and while I decided to skip it since I'd put it on EVERYTHING, and shouldn't at 110 calories per 2Tbsp, the ingredients list impressed me! A little high in calories but the ingredients were quality and I had no issues with eating it. I opted for half a panini and half salad. The salad was still AMAZING but the panini was a little less than what I expected. It was good, but nothing special. The next time I go back, I'll be going back to my full salad.  Also, there is a waiter here that is exceptional. He anticipates your needs with refills and checks on you once your food arrives.  He is friendly, efficient and while he's a bit hard for me to understand with his accent, he's one of the best waiters I've encountered in all of Phoenix! Great job!"}
