{"text":"Absolutely Gross. I have been numerous times and the experience has been good. Not great. But good. My first lunch Experience today at mark rich was aweful. Wings were overcooked and dried out garbage with an overcooked breading I don't remember ever getting when I am there in the evening. Stromboli was good so you get the second star. Never order the wings again. Don't bother complaining to the staff cuz they will justify their food and not try to correct it or remove it from the bill. I should of purchased wings from the Albertson's across the parking lot. Which I am sure where they bought their ranch dressing and nasty hot sauce."}
{"text":"I want so much to like this place.  However, I have been disappointed each time I've tried it out.  The pizza is meh.  It could be better, could be worse.  I do love the wide selection of menu options.  They even have gluten free pizza.  

I won't go back, though, because of an experience I had when my cousin was in town visiting with her kids.  We ordered two of their biggest pizzas.  It took 45 minutes to get to our house, although we live literally less than a mile away and it was a Wednesday night.  Only one pizza.  We ordered two.  I asked the delivery guy who said the order was only for one.  I called back and asked about the other pizza.  They sent another pizza out, took another 45 minutes, and charged me full price for the second pizza.  I'm not asking for a free pizza but man, we had to wait almost two hours to have enough food for everyone to eat.  It would have been nice to say they were sorry or something.  Overall it was very frustrating and the food isn't good enough to make it worth it."}
{"text":"GIANI'S Pizza is just as good as the previous Mark Riches. Seems some of the same employees are still working here. The food is excellent, I highly recommend this place for quality pizza."}
{"text":"Pizza and spaghetti are delicious, the boss is very kind."}
{"text":"I was really disappointed. I've only been here once and the pizza was soggy which is awful by any standards, let alone for \"New York\" pizza. The two stars is for the waitress who was really nice and all the decorations inside."}
{"text":"Wow!!! This place is amazing! The servers are charismatic and the food has great flavor. The place was too small only because it was so full. Everyone else in Vegas knows about this yummy dining place."}
{"text":"The pizza here is quiet good. The garlic knots are okay, I've tasted better at another pizza place on Craig Rd.  The Cannolis are extremely good but a bit pricey. Their home made ranch dressing is the BOMB!!! OMGosh, can you say garlic??? Very garlicky flavor and ooooh so good!"}
{"text":"Great spot to chow down on carbs in Summerlin. Service is fast and friendly, prices are best in town, and the pizza is delicious!"}
{"text":"The biggest problem that I have with this place is inconsistency.  I remember my first time ordering from there I liked it, but since then it is a mystery box of what you're gonna get."}
{"text":"Let me start by saying that we live very close to this restaurant, and after giving it MANY chances, have finally decided to go out of our way and drive to Ciao Ciao's or Buca Di Beppo for great pizza/food. 

It shocks me that in this type of economy, a restaurant like this would argue with customers and opt for the \"take-it-or-leave-it\" attitude. I mean, they are all friendly and hospitable when you are eating and paying for their mediocre bordering on substandard food, but the minute you decide to speak up about your food they are a completely different establishment! 
That is NO way of doing business and sadly most neighbors around here just choose to eat the \"OK\" menu offerings because it's a convenient stop.
I gave 2 stars because it is clean and appealing until the food comes."}
{"text":"Just had a ridiculous interaction with Linda, the owner, over a $7 Groupon coupon. Sad really. There are so many pizza places; she needs to appreciate it's the little things that keep customers happy"}
{"text":"I live in the area and I typically go to Lino's Pizza. 
I'm sorry to Lino's, I've cheated on you with a cheap whore. 

The staff was friendly and helpful, but the pizza was God-awful.
Bland as shit sauce, garbage cheese, about half a bag of flour on the underside of the crust.
C'mon fellas, if you're going to claim NY, at least give half a damn about your pizza.

Used to be Mark Rich's, now it's Giani's, nothing has changed. Sad really.

With Lino's and Novecento within 2 miles of this place, you can do better.
Next time I want a quick slice, I'll probably just go to the Sam's Club on the other side of the parking lot. Seriously.

I don't like writing bad reviews of businesses with such nice staff.
But it really is the food (pizza at least) that is bad, not the staff."}
{"text":"Love the salads! They have the best ranch ever! I normally order and pickup on the way home a few times a month. The pizza is okay. The crust does not have any flavor. It's better with fewer toppings. The couple times we ordered  a supreme it was soggy. So I stick with the salads :)"}
{"text":"Absolutely horrible since it's not mark rich pizza anymore!  one and a half hours for delivery pizza was cold delivery guy had his boxers hanging out in his pants sagging around his waist customer service is crap and I will never order food from them again don't waste your money because it is horrible!!!"}
{"text":"If you are contemplating eating here- would drive a little down the street and go to Sreets of New York. The service there is also pretty poor but at least the pizza is good.

At Mark Rich's, the pizza itself is gross. The dough tasted like Pillsbury brand and I wonder if they actually make their own dough.  It has no flavor.

This was my second time eating at this location. I got a groupon online and decided to give it another try even though I wasn't thrilled the first time.  They forgot to put pepperoni on our pizza.  When I alerted the waitress to the forgotten pepperoni, she immediately ran in the back without saying anything. She came back out and said \"you're right\". I definitely felt like she should have just apologized right away, not gone in back to check that I had in fact ordered pepperoni. Then, the bill came. Pepperoni was still charged!  I didn't even say anything because we had been sitting there for over an hour and I just wanted to leave.  

For a gross tasteless pizza and 2 soft drinks it was almost $30. I will not be dining here again."}
{"text":"Terrific neighborhood pizzaria. New York style pizza, extended Italian menu for guests who want something else. Selection of desserts including authentic Italian water ice sold by the pint or quart."}
{"text":"This place is pretty solid. I order delivery quite a bit due to my work schedule and they're usually pretty quick and the food is good. Straight up cheese pizza is on point and the pasta that I've had is good too. Plus fried mushrooms are awesome. Some items are better than others (the salads don't seem to tickle my pickle) but for NW pizza joints this place will come through. Recommended."}
{"text":"I would never recommend this place to anyone.  This is twice that I have ordered food from this pizzeria and just received the worst service. From the moment you call to order to picking up the food , it has just been a bad experience.  The lady at the front always seems sad or upset , the rest of the staff never greets or smiles.  No wonder this place us always empty. Good luck in the future but for now you lost this family as customers."}
{"text":"Left very sad, I wanted good pizza, I received limp pizza, I wanted thin and crispy New York style pizza, I got a large portion but it was lukewarm despite the fact that there were only three tables of customers there."}
{"text":"Arrived at 4:30pm with family to get some pizza (and a hot dog for my daughter). 

Server advised the Tuesday special was order an X-Large pizza and get a medium pizza free.  We ordered that special (and a hot dog for my daughter).  
Hot dog came right away. My daughter enjoyed it.

We waited an hour and still no pizzas. Server advised there was a mix up but it would be out soon. After another 20 mins, one pizza comes. But the free medium that was the cheese pizza still wasn't done. My son only eats cheese pizza so he didn't get dinner tonight. Server tries to apologize and offers free deserts all around which we don't want. So she says she'll discount the pizzas. 

Cool. Glad she's trying. I'm fairly laid back in life so it's all good.

We eat. Pizza is ok. Free medium finally comes out in box so we can go now. Server brings bill and turns out the medium pizza isn't actually free. Server states she advised the manager it was her error but wasn't able to correct the bill. She was able to give us my kids' drinks for free.  She continues to apologize and states she will have the manager come talk to us. Sounds fair.

She comes back asking if there's anything else she can try to give us because the manager won't come to talk to us. I laugh. A screw up is one thing - we all have them. But this is just someone that has no concern or respect for the clients that are trying to write their paycheck. 

So I ask what the manager's name is so I could include in my review and potentially bring it up with an owner who wouldn't want employees treating customers this way. 

Her response?  Mark Rich.  

Ah, nevermind then. It's in fact the owner of the place that refuses to talk to his customer and leaves his poor server hanging out there on a limb trying to explain why. When my two young children asked why he wouldn't talk to me, I made the most of the situation by using it as an example of what it means to not have integrity and not be accountable for your own actions and decisions.  

Some people don't deserve to stay in business."}
{"text":"Have no problem with the pizza, or the service. The owner is a major turn off. He planted his large self at our table and proceeded to wax on about himself for most
of the meal, his real estate deals, his money, blah blah. Never once asked any
thing about us, or, even how the food was. Guy is a loser."}
{"text":"Horrible service. Ordered and paid on line at 7:11pm. Didn't get my order until 8:30pm.  When I got there at 7:30 the lady tried to make me pay AGAIN!  Ended up making my husband sick!  2 pieces of cheese cake will not fix this fiasco! Will NEVER order from there again!"}
{"text":"This is a nice local pizza place. The prices and atmosphere are perfect for families. 
Ive dined here for lunch several times with girl friends,enjoying a glass of wine, the salads and pizza. My husband and I popped in for dinner the other night. We enjoyed the Caesar salad, zucchini sticks (my favorite) and  Chicken Marsala. My Husband ordered a small pizza also.  You will enjoy the casual \"family run\" atmosphere. Our server was upbeat and fun, he brought our food to us quickly and we enjoyed watching the pizzas being made.
It is nice to have a place to dine and relax that is not a chain restaurant.  Las Vegas is lucky to have Mark Rich's pizza!"}
{"text":"Sitting here for 1 hour for a take out order of pasta, not an explanation of why it's taking so long, no offer for even a water!  The older lady at the front is nice, but not the sharpest tool in the shed, but it doesn't take a lot of common sense to at least give an explanation of why my order is taking so long and maybe offer me a glass of water, while I wait for 1 hour!
And I'm pretty sure the owner walked right by me couple of times and never acknowledged me and how long I had been sitting there!
This place sucks!!!
Can't wait for Metro pizza to open.  Bye bye Mark Rich!"}
{"text":"Ordered the N.Y. Veggie Pizza Pizza and a Chef Salad. Pizza was just okay, maybe it was a little watery because of the vegetables. Salad was amazing, for some reason our waiter only gave us a tiny amount of dressing so we just asked for me.

Will be trying this place again and re-reviewing in the future."}
{"text":"Ordered a greek salad....iceberg lettuce??? really? The dressing was not good at all, not real greek dressing and the salad was altogether boring. The pizza was not good and cold. The carrot cake looks like they bought it at Albertson's. I am so disappointed."}
{"text":"Don't waste your time.....

I ordered a gluten free pizza and was told it would take 15 mins. That was until they lost my order and it really took 45min. Then the pizza was HORRIBLE! It was soggy, you couldn't even pick it up and it tasted sooooo bad. Save yourself the wasted time and disappointment. If you are looking for good tasting gluten free pizza with an awesome staff check out Pizza Lounge @ Tivoli Village or Sammy's Wood Fire Pizza @ Flamingo & Forte Apache."}
{"text":"Just tried to order a pizza to be delivered and was told it would be at least an hour & a half before they could get it here. Really? 90 minutes for a pizza that might take at the most 10 to 12 mintues or less to cook? Then another hour and 15 minutes to deliver it? I live 5 minutes away. I would be embarassed as the operators of this place. I will go somewhere else."}
{"text":"I think I expected more from this place because its supposed to be \"New York\" pizza and the decor of the restaurant is decorated very New York-ish.  But I guess it is New York style, thin crust, sliced pizzas ready in the display window... but as for the taste, yeah not so much.  

The couple times I ordered pizza from there, the crust was semi burned with black burn spots on the crust and on the bottom.  The cannolis were just OK and smaller than others I've had.  

Maybe I'm just comparing it too much to the \"real thing\" and being biased.  Word of advice:  Less than a mile down the road is Rocco's NY Pizza... definitely go there instead!!!"}
{"text":"So I had the pizza this weekend and it was mediocre at best.  Not likely to order it again.  As I stated above, the subs were good as were the wings but the pizza sauce seems like cheap canned grocery store variety and the cheese was very bland.  Disappointing........."}
{"text":"After being a loyal, weekly customer for over 5 years, you have lost my business forever. Our last order delivered to us was undercooked ravioli and even though I wasn't happy about it, I didn't complain. This week, I open my salad and there is disgusting brown, wilted lettuce under my toppings. This time I call and am told that I need to bring my salad down to them, cause their lettuce is green and crisp. Basically he called me a liar. I told him I was already comfortable at home and he said there was nothing he could do for me. I notice less and less customers rolling in your doors. Wonder why?? Food is going downhill fast and horrible customer service. I hope the loss of my business was worth some lettuce!! Can anyone recommend a good, friendly pizza place??"}
{"text":"You know, this place is really pissing me off.  Because my brother insists on getting pizza from this place for some unknown reason when he's been drinking, I've had to deal with them a few more times, and they have really just made me dislike them even more.  

Incident one:  My brother placed an order for delivery around 8:30pm for a pizza.  Around 9:45pm, they still had not come, so I called them to see why.  The guy said that they were closing, and I said that we had called in a delivery earlier, and his response was, \"I didn't know we had a delivery\", even though I was right there when my bro was ordering.  To add insult to injury after the dude playing dumb, he didn't even apologize.  Yeah.  Nice customer service, ass.  We never got the pizza, needless to say, and I was pretty peeved.

Incident two:  A few weeks later, I was out running some errands and the bro wanted me to pick up some pizza, since I told him I am done with their crappy delivery times.  I went in, and it was kind of busy, so I understood that I had to wait a bit (even though we had called well ahead of time... and were only ordering one medium pizza).  What really pissed me off, though, was that my pizza was actually ready, but had been sitting there pretty much the whole time because the dimwitted cashier didn't bother to look on top of the pizza oven and discover that my pizza was done.  So I sat there for approximately 20 minutes for nothing.

In sum:  I hate this place with the fire of a thousand suns.  :)"}
{"text":"Been here a couple times the food is always great, especially the New York thin crust pizza, but I love the atmosphere. Everyone here is so nice and welcoming every time I've gone. Great place to grab a bite!"}
{"text":"I'll start by saying the pizza is really great here and so is the pasta easily four stars. Ive been here a few times, and everyone was helpful. DO NOT GET the girl server with the forehead bangs she ruined our experience. 

TERRIBLE service. Wow. Came in Saturday with a couple of girlfriends, and our server was absolutely terrible. She took forever to bring us our menus, even longer to get our drinks out. It's not like she was even busy she was just screwing around on her phone at the end of the bar. We finally get her to come to the table and she was abrupt and short with us when answering some of the questions we had about the menu. When the food finally did come she practically slammed the plates down. My girlfriend didn't have silverware and again, we had to flag her down for ten mintues so we could enjoy the meal. Didn't get refills once, she didn't come by to ask how everything was. We weren't even half way through the meal when she dropped off the check, we still had a to go order to place and were thinking about dessert. We were long finished before she came back again and was really rude with us when we told her we needed to place two chicken parm dinners to go and she snachtched up the checkbook so fast. Don't know what her problem was. We asked for her superior but she told us he wasn't available, I'll talk to him next time we go in and he'll get an earful."}
{"text":"I've order from Mark Rich's pizza several times and every time it takes more than an hour to deliver anything. I once waited more then 2 hours for a pizza to be delivered to my house which is less then 10 minutes away.  Not only do they take an unacceptable amount of time to deliver, they deliver cold food. I feel I have given this place more than enough opportunity to deliver hot food in a timely manner and they failed. I will no longer be a customer."}
{"text":"Great neighborhood pizza place.   Love to in for a slice and a few beers.   Wonderful service."}
{"text":"This is a neat pizza place in the Albertson's plaza. They make really decent pie and have dining al fresco. Their staff is friendly and accommodating. My family and I go there once a week. In the summer time, they have live music and dancing. They convert their restaurant into a kind of dance joint with a live band. We really loved it!"}
{"text":"Ordered hot wings and got plain wings in a box with a little bit of hot sauce on top like they weren't even tossed in the sauce or anything. Under side was completely clean which made a weird soggy crunchy feel.

Also only got one \"2 oz\" cup of ranch which was half filled, and for 12 wings that is obviously not enough. 

If im gonna pay 13 dollars for wings Id expect a little more quality food wise. 2 stars. Service was great though."}
{"text":"Ordered some pizza, stromboli, wings and salad.

At first i thought it had a good feel for a pizza place but as i waited for the food to come i noticed that the whole entire place was a hodge-podge of old pics to make me feel as if i were in some old italian eatery....but i wasn't.

I was in a strip mall in suburban Las Vegas.

I was in strip mall getting \"decent\" pizza, an \"ok\" stromboli with a sauce that kinda tasted outa the can, wings that were fried to death and a weak salad.

All of this was fine to me...because you know what they say about pizza...even bad pizza is still good.

UNTIL THE BILL CAME. overpriced for the quality

I guess because this pizza place is in the land of chain restaurant hell means they can fool the average suburbanite into thinking that paying top dollar at a mom and pop place for \"italian food\" is ok.

well i guess you fooled me this time."}
{"text":"This is the best pizza iv ever had. The service is friendly and they serve your beer in a mug so cold it makes little ice crystals of beer on top. Seriously, they make them from scratch right in front of you and it's worth the wait!"}
{"text":"Friendly staff, was greeted while I was looking through the menu for my to go order. The owner was very friendly and was the one helping me out. I ordered the white pizza with sausage and mushroom along with their spaghetti and garlic bread lunch special. My pizza came out with mushroom and onions looked totally raw and uncooked as if they just added it last second. My spaghetti was just noodles with pizza sauce, the garlic bread was good. My previous order was a deep dish pizza which consisted of bread and cheese. Where was the sauce? Where and who taught these people how to make pizza?? They should just call this place a bakery cause the only thing they know how to make right is their garlic bread. They have a nice layout but what a waste when the food sucks"}
{"text":"This is the worst pizza I have ever had. I had to wait an hour and a half after I ordered to receive my food.  the wings were soggy and had absolutely no flavor. The pizza was abysmal. I would never recommend this place and I'm never going back and quite honestly I'm calling in the morning to complain. oh and by the way , the delivery guy was totally high."}
{"text":"The pasta was amazing. Definitely will have to come back and order pizza and ice cream :)"}
{"text":"Now, this is a NY style pizza.
If I have the yearning for an east coast pie, this is my go-to place.
But I really have to want it.
30 minutes for couple of re-heated slices can't be a good mantra. Well, 24 minutes- close enough!"}
{"text":"Service was sketchy until the owners sister came by and helped us.  Way too far to be a regular stop but the food was good and the odd but cool mexican drink options (horchata, jugo de pina, etc) was a nice surprise!"}
{"text":"ok let me start off by saying I grew up in a Pizza family.. we owned a chain of sit down Pizza Parlors in the 70's and 80's in California. I have eaten pizza all over the world. I love Cracker Crust, New York thin and Chicago Stuft Pizzas. I want this place to succeed after all its in my favorite shopping center whenever I vacation at my Vegas home from Bev Hills. I have to admit that at first I would tell you this place had pizza worse than Dominos and Chuck E Cheese.. which I consider the worst on the planet. I even ordered a hot dog once and it was cold.. how do you screw up a hot dog?? Well, I think they got a new cook.. I am happy to report that they must have fired their old cook cause the Pizzas are better than ever. I wanted so much to tell the owners what was going on in their kitchen but didnt have the balls. Now is this the best pizza on the planet.. no... but its good on a cold night to warm your tummy...in this economy everyone needs to support everyone and stop be critics.. would I eat here again? YOU BET!!! as long as they keep the current cook. I would have given them 4 stars but I feel everyone else on here hasnt been too kind.. and they deserve better reviews.. so I gave them 5 to help bring up their score. If you eat here you have to go across the parking lot for dessert at my favorite Yogurt shop.. I LOVE YOGURT! Support Mark Rich's and help support a local guy trying his best to do right by you."}
{"text":"Great place, great food and amazing owners who make you feel as if you are home.... If you want real NY pizza, then this is the place to go to..."}
{"text":"My boyfriend and I were looking for dinner in this area and on a whim chose Giani's. Ordered a pitcher of Sam Adams (the only beer on tap) a side of fries, and a large anchovies mushrooms artichoke and garlic pizza. The beer was a decent deal at $12. Fries were great! I'm sure the topping choice had something to do with it but the pizza was great too. It is NY style crust, thin and foldable. Wait time was fine, service was nice. I would bring my friends here."}
{"text":"I'm originally from New York,and lived in Orlando for the last two years,could not get a decent slice of pizza in Florida .I found this pizzeria when we moved here to Summerlin and it is awesome!! thank you thank you thank you!!"}
{"text":"I hate to say it, but they have gone down hill since the last time I went there. Still better than average, but not a good trend here."}
{"text":"I have been coming here for over a year.  It's not the greatest pizza but it is very good for a I don't feel like cooking let's get pizza"}
{"text":"Good if you want an average pizza and hot/cold italian dishes. I ordered an italian sub. It tasted great...but i got a pile of broken chips with it. I love chips so i was bummed to see a pile of crumbs. I barely ate it :'(  overall it was good but not amazing."}
{"text":"This place is horrible!!!  The food is discussing! Paul the new owner is  terrible! He has no idea how to run a business. Terrible customer service!! Too bad mark sold it. We will never eat here again!!"}
{"text":"SO I have been visiting Mark Rich's for years regularly for their good ol lunch specials.  Where else can you take three people for lunch and the bill comes out to $15.00???  What???  I must say I know how good this place can be and its been a while since I have seen it.  The place always used to be rockin and now you go in and theres hardly anyone there.  Like I said we come for lunch....rarely for dinner so it may just be a lunch thing?  The last time I visited we were the only ones there.  

The service is always pretty good so no real complaints there.  We always order the garlic knots.  Love them.  Love love love.  We usually ask them to do \"light\" on the oil but this time we forgot. Dangit.  It was swimming in oil....and by swimming I mean the poor knots were crying for help.  We ate it anyway as we dabbed as much oil as we could.  For lunch we ordered the pasta lunch.  We always order the penne pasta with pink sauce.  Its not really on the lunch menu but they modify their spaghetti for an additional charge for the pink sauce.  The last couple times the pasta just has zero flavor.  This last time the noodles were mushy, the sauce had no flavor and the garlic bread was burnt.  Well actually I had a burnt piece and a good piece and same for the BF.

This place is just tired.  It needs a new lift or something.  I am so sad to say all this because I have always been a big fan of their pizza and pasta.  Occasionally you would see Mark in there greeting the customers and I havent seen him in years.  Maybe its the new location.  Who knows.  We do always make fun of all the celebrity pictures autographed by someone with the same pen and same writing.  Pretty amusing I must say.  Anyways, I think we will give this place a rest for now and maybe visit for dinner to change it up.  I havent given up on you yet Mark."}
{"text":"Had dinner at this location for the first time last night.  I have been to their other location on Charleston a number of times.  The food was very good and flavorful.  Our waitress was nice but could have been slightly more attentive.  The hostess needs to be better trained.  She sat at the front counter reading a book and playing on her cell phone the majority of the time we were there; not really even making an effort to welcome new guests as they came in."}
{"text":"I gave this establishment another shot this evening.  The food was pretty good although the garlic knots were a bit disappointing.  The cheese was not melted nicely; it would have been great if they had been put under the broiler for a minute before being served.  The pizza was enjoyable as was the pasta dish we ordered.  

They weren't overly busy tonight when we were there but it still took a bit of time to get our entrees and pizza.  Servers were friendly but could have been a bit more on top of things."}
{"text":"Went here with my son. We ordered the New York pizza no toppings just cheese, the way New York pizza is supposed to be. Food was great.  
We will be coming here again. Can't believe I didn't discover this place sooner."}
{"text":"We tried this place for the first time last night for dinner.  We were not even a little disappointed!  i ordered the meat and cheese lasagna and my spouse had a chicken calzone.  Both dishes were excellent.  The sauce on my lasagna was EXCELLENT... one of the best I have ever eaten.  I have to assume the calzone was just as good because I wasn't even offered a single taste!  I was told the crust was light and flakey and it tasted delicious.  Our server was training a new employee so we got plenty of attention.  A+ on service.  The only thing I can suggest they improve is the salad and dressing.  The salad was nothing more than a bowl of iceberg lettuce, two thin slices of tomato and a few Bermuda onion rings.  Visually it missed the mark.  The addition of some color to the bowl in the form of a few shreds of red cabbage, maybe a little shredded carrot , an olive or two, and a few croutons would be a big help.  The Italian dressing I ordered was also a disappointment; much too oily and lacking flavor.  The salad is the only reason I did not give this place five stars.  I will become a regular and can't wait to continue exploring their menu."}
{"text":"Ok. Arrive and there's some ass sitting right by the front door outside smoking a nasty cigarette. Maybe it's me but at my retail store I don't allow people to stand by the door smoking. It isn't nice for other patrons who don't smoke. 
Ok we got the 2/25.00 the broccoli soup was awful. Very out of the can taste. The hubby got tomato,,, that was much tastier. 
Hubby got fettuccine and it was good he said. Good garlic taste. I got the baked manicotti ,,, it wasn't bad but I prefer a more flavorful taste. Just kinda bland so I put pepper flakes all over it.
Then one piece of cheesecake. I didn't try but hubby said, it was def Sara Lee or some other frozen pie. 
Service was fine. Awesome for a Saturday night. 
Very small quaint little business. I just don't think it'll last."}
{"text":"The pizza is amazing! Better than pizza hut, dominos etc. Service is always great too- friendly and efficient. Their menu has a nice variety and prices are affordable!  They even have lunch specials."}
{"text":"Not sure why all the terrible reviews. We went here after Red Rock canyon. Service was good, our waiter was very nice, joked around with us. My husband and I were not expecting good pizza. We have lived in Jersey all our lives and it's hard to find good pizza like that in the west. 
We were pleasantly surprised. Mozzarella sticks were good, pizza was good, spices done right. I'd have to say the best part was the sauce.
Obviously not the best pizza place we've ever been but I think we're a little spoiled on the east coast. Would definitly go again."}
{"text":"The garlic bread is wonderful but the Chrisopher pasta was a major let down.The crab meat is imitation crab meat, they gave me 2 pieces of shrimp and no clams what so ever for 12.99. I felt very ripped off. The manager was very rude and didn't care about my complaint."}
{"text":"Fantastic !
Pizza is fantastic ,
service is Great. 
I grew up in New York eating Italian Food 
Thin crust , lots of topping."}
{"text":"Ate there with my kids last night...

Service was friendly, the atmosphere was very nice but the pizza was so-so...  We ordered the knots with cheese and it took 20 minutes.  The pizzas were medium NY thin style cheese and then a veggie pizza.  It was good but I've had better in other parts of the city.

I still would recommend this place and I'll go back to try other things.

mr"}
{"text":"Buonissimo....se cercate qualcosa di diverso dal centro di las Vegas dove tutto e stranamente perfetto vi consiglio di fare qualche chilometro e starete tranquilli a mangiare un buon piatto.."}
{"text":"One of my close friends and I love this little pizzeria! I think I like the people more than the food though. Don't get me wrong the food is good - but with so many options for truly excellent Italian food, pizza, pasta -  you have to have something else that draws you in to Mark Rich's. I love Ellen and Kristin! They are truly funny, witty, and service oriented. Plus it's close to home. This is just a fun place to enjoy your food when you don't feel like going too far.

My favorite item is the eggplant parmesan with a side salad. I am not elated by the pasta. It is often overcooked or undercooked. The \"Works\" pizza is good. On Tuesday, you can enjoy a free medium cheese pizza when you order a large pizza. Tuesday's used to be my standard time to visit Ellen - but she moved to Wednesday's and now I don't come in as frequently. Kristin only works weekends - and that is usually when I hit the town in search of new restaurants I have bookmarked on my Yelp page. 

I am not crazy about the cannoli's here. They are not made fresh in the restaurant and it shows. However, I love the warm powered sugar dough dessert - I can't do that too often though. I always say I will just have a couple and then... ouch!"}
{"text":"Definitely not a fan. Ordered the chicken fingers and a side of spaghetti. Both of which were quite disappointing. We live in the neighborhood and were really missing our old pizza place, so we settled for this. Really wish we had just made the drive. The pasta was old and the sauce was bland. Very basic tomato sauce. Nothing to write home about. My chicken was dry, but they smothered it in the mild sauce as a distraction. Sorry honey, nothing can cover dry chicken... Garlic bread was way to crispy for our preference as well.

The customer service was great, hence the two stars. Don't really see myself going back again, but you never know, sometimes you get desperate..."}
{"text":"Pizza Hut tastes better. The service was horrible and so was the pizza. Hopefully Metro Pizza will put this place out of business. Blah!"}
{"text":"Lasagna, come here for the lasagna. I always order an extra side of their meat sauce; it's so tasty you will want to add more of it to the lasagna.  For a quick, homemade, neighborhood,Italian meal, this place cannot be beat.... And I am very picky"}
{"text":"just ate here and was served by a good guy  named mike, the food was hood and so was his additude.. because of this, they get 5 stars from me... ty"}
{"text":"Great little pizzeria! The service has always been great when going there, and the food tasted great. Just a little bit pricy."}
{"text":"Excellent pizza!!! Was ready when was supposed too be, and the employees we awesome. I think we found our replacement for north end. The chicken fingers were good too."}
{"text":"I had the Stromboli and it was very good. It took them awhile to cook it, but it was worth the wait."}
{"text":"I'd give Mark Rich's 3.5 stars if Yelp would let me.  It's a good little neighborhood Italian restaurant with decent food, decent service & decent prices.  Especially with a Restaurant.com coupon.  Very relaxed atmosphere - me, my guy and 2 of my daughters enjoyed salad, garlic knots with marinara, pizza and eggplant for approximately $30.  When you want Italian, don't feel like cooking or getting dressed up, Mark Rich's is a fine alternative."}
{"text":"Pizza is good. Service is good. They are pretty on top of everyone. They also have outdoor seating which is nice. The garlic knots are delicious! They keep the place pretty clean and I LOVE the decoration. They also always have the good games on. So it's good for the guys and the kids."}
{"text":"We LOVE this place!
Ask for a meatball calzone.  They are HUGE and soooo delicious.
The husband loves the chicken parm dinner.
We've taken everyone we dine out with to this place.
The staff are great and we love talking to them.
Pizza is very, very good."}
{"text":"Terrible pizza. If I tossed it at the wall it just might have shattered it was so hard and stale. I asked the girl who helped me what happened to the pizza place that was here before and she rolled her eyes and said that they sold the business along with the recipes to them and even though it's new owners and a new name the pizza would taste the same. She made me feel like I was bothering her and came off very rude. I do feel the price at around $6 is fair for 2 slices of pizza and a drink but it needs to be edible. I couldn't make it through just 1 of the slices because it was so tough on my gums to eat. Maybe they should try some of their own recipes if they have any. With other solid pie joints nearby I'll pass on this place in the future."}
{"text":"Best pizza in town. I ordered the big Bobby with extra cheese. Reasonably priced. Waitress was extremely fast and courteous. Very clean and warm environment. Will go back there again and again."}
{"text":"I saw Mark Rich's Groupon promo in my inbox one morning and decided to give it a go--bad choice. The service was straight up horrendous. 

We ordered a Caesar salad which was tasty, but then waited for 30 more minutes on a spinach calzone. 30 minutes for a single spinach calzone. 

You gotta love open kitchens, because it was wonderful watching the cooks giggle and flirt with each other, slowly assembling meals for the handful of tables and take out orders they had. All the while, the manager casually enjoyed his red wine, slowly sipping the night away. Seriously, it felt like an episode of Kitchen Nightmares. Get off your bar stool and manage!!

The apathetic waitress walked passed our table several times, ignoring our empty beer mugs and discontented faces until I shouted out twice to ask how much longer we'd have to wait. The single calzone arrived and tasted good. But I don't like to wait around and be ignored all night for just good.

And wouldn't you know it? That waitress got so smiley and attentive as soon as the check came. You would have thought she was in the running for Miss America."}
{"text":"We love it here! Delivery  or dining in. The pizza and Italian beefs are great.

It's really a good value, and the portion sizes are generous."}
{"text":"When we moved to Vegas two years ago, this was our go to place. Over the last few months, the place has changed ownership and the quality has gone to shit! The only waitress worth anything is Ellen, always has been. The new owner is an asshat! He was extremely rude and has absolutely zero business skills. Sadly, the quality of the food has also declined. I don't think we'll ever be back again!"}
{"text":"My husband and I chance upon this place when we were visiting a friend in the area.  When we walked in, there were only a few open tables.  By the time we left, they entire place was packed and there were a couple of people waiting for a table.  This place is a very cozy neighborhood restaurant.  Even though the place was packed and they were busy, the waitstaff was very friendly and attentive.

My husband and I shared a medium pizza, which was the perfect size for two people.  I had a soda and my husband had a beer.  I noticed that many people had wine as well.  Overall, I have to say this place was great!  The food tasted good and the atmosphere was very inviting.  If this was in my neighborhood, we'd definitely be regulars!"}
{"text":"Not bad but not great.   Recommend the spinach calzone.   Very tasty.   Service has improved.   Extensive menu. Pricing is rather reasonable. Outdoor seating available. Good location for after Red Rock Canyon activities"}
{"text":"We have eaten here a few times. The dinner options are great and the garlic knots are awesome. We have had issues with wait times, but honestly, its no worse than any other place. The food is good and if the service is on time, it's worth the wait."}
{"text":"I got the ricotta, spinach, whatever one... BOMB.

I'm from LA and I only came to this place because a friend wanted pizza delivered... all the way from Las effin Vegas.

Even ate it cold on the way home when we got hungry.  I'm coming back whenever I visit."}
{"text":"Aftet 15 years here in Vegas, originally from NYC, where we know good pizza,only 2 other places come in second here in town this has to be the BEST in Vegas, from the QUALITY ingredients, to the selection and finally to the AWESOME service... we have been there a handful of times, we still try other places to see if Mark Rich pizza can be beat, but we still walk away from any other place and say that Mark Rich Pizza is better..."}
{"text":"I have given this place many chances,  yet they always fall way below standard.  Food is microwaved,  lukewarm at best."}
{"text":"I'm surprised by all the bad reviews, I order from here frequently and am not disappointed. The pizza is not the best pizza I've ever had but it is an upgrade from rocco's and papa John's. I looooooove the chicken fingers and the home made ranch is the best ranch I've ever had ( I normally hate ranch) the delivery is always sooner than I expect and the delivery drivers are always very nice."}
{"text":"We love the food and the delivery service is always faster than they say. It's a great little spot in summerlin. If you need a quick pizza and yummy pizza this is your place, don't forget the garlic knots!"}
{"text":"It was a busy day at the office preparing for trial when the boss decided to buy pizza for everyone. YAY! Nothing like ordering pizza to keep up everyone's spirits. It might usually take a while to get everyone together in the office, but not when pizza is involved. We all raced to the pizza as soon as it arrived, lovingly placed on a table by our office manager. But, something was missing. WHERE ARE THE GARLIC KNOTS?

My favorite part of eating pizza is enjoying the garlic knots--a love discovered in NYC, made permanent by a bag of knots small enough to be eaten like popcorn on a long subway ride through Manhattan. Delicious, buttery wads of dough covered in minced garlic? YES, PLEASE! Dipped in marinara! Dipped in garlic sauce! On their own! They are just delicious! But, to my disappointment, they were absent.

I was put in charge of calling Mark Rich's to inform them of the terrible news. The man who answered seemed to already be aware of the mistake and asked if I wanted the delivery person to run them back to the office. Well, yes, sir, that is why I called. He told us the knots would be delivered right away (we already paid for them anyways.)

As I slowly ate my pizza, trying to save space for knots, the phone rang. Someone from the pizza place called back and offered to give us a credit for the knots. How kind! ...Wait. Are the knots still on their way? No? Oh.

Is this a refund?

A credit for a future order.

Oh.

I don't enjoy ordering knots, not getting them, being promised knots, and being told I can have them later. Why would we order from them again if they didn't get our first order right? It's one thing if you get compensation for a mistake, but this wasn't the case. 

I almost gave them two stars because the pizza was pretty good, but poor service drives me up the wall. I understand that mistakes do happen, but to make a promise and renege due to laziness or any other reason is inexcusable."}
{"text":"There seems to be an abundance of good pizza in Las Vegas, but Mark Rich's pizza comes with a flavor and personality that makes it seem home-made.  Maybe it's the family atmosphere of the restaurant, or the savory flavors packed into the stromboli.... or perhaps it is just the fresh ingredients that they put on the plate... whatever their secret, the food is good and reasonably priced and this spot is well worth the visit."}
{"text":"The food was very good. Their ranch dressing is home made and so good. The portions are very  big. The service was the best part."}
{"text":"This place is about as good as it gets for pizza. There is a personal attention that you seldom get in chain places. The wait staff is friendly and attentive. Orders are accurate, and every detail is seen to. The place is relatively small and intimate, nothing opulent but just a good old-fashioned pizza place."}
{"text":"The nyc aesthetic is magnetic, the hospitality is excellent. I felt at home, this place dragged me in and I ordered pasta and garlic bread it was delicious. They have awesome deals for families. Wednesday night kids eat free, any item from the kids menu is free with one purchase. Tuesday night they have a buy one get one free. Monday night is all you can eat pasta for $8.99. You can mix and match their ravioli rapture $12.99+tax with garlic bread try their Chicken Stromboli you have to! And for dessert Italian lemon cream cake trust me on this one Grazie x"}
{"text":"I live around the corner from this place so I had high hopes.

First, i'll say that this place looks very nice inside.  They keep it very clean and the staff seems friendly.  Both times i've been here, I saw the owners come out and ask everyone how their food was (the reason I give this place two stars instead of one).

As for the food, most of it was horrible each time.  I got chicken marsala and the wine they used in the sauce was so bitter that I couldn't finish it.  Chicken marsala is one of my favorite dishes and i've had it many times, and I can honestly say this was the worst chicken marsala i've ever had.  The pizza was OK.   I'd rather go to pizza hut if I wanted pizza.  The chicken wings and wedding soup was average.

Overall I just feel that since this place is new, they just need to work on their recipes and they could easily become a 4-5 star restaurant.   I'll give this place a chance every 3 months or so to see how they've improved, but too many bad experiences and i'll stop wasting my time."}
{"text":"The stuffed pizza slices are the bomb- it's basically a thinner version of a deep dish style pizza, with cheese and meat stuffed between two crisp layers of crust. They're around $5 each and easily make a lunch, served with a cup of marinara for dipping. 

The salads and pastas here are not their forte- maybe it's just the dressing, but the antipasto salad had ample toppings but nothing interesting going on flavor-wise. Meat quality seemed just so-so, and the \"house italian\" looked like it was packed with herbs but tasted more like plain oil. Fellow diners who opted for pasta specials mentioned that they were overcooked and mushy rather than al dente as expected.

They have a limited list of lunch specials ($7, five options) and outdoor dining tables with umbrellas. Though it's set up as though you walk in and order, then wait for your food to be brought out, they only do takeout orders at the counter and if you are dining in, you have a server. Beer and wine are available."}
{"text":"Went here about 2 weeks ago and I must say I'm disappointed. I had ordered a pizza and the guy who was making it seemed real irritated it came out in the pizza. It was bland, to doughy, not enough seasoning etc. I walked in and wasn't greeted how I should have been. My wife ordered a pasta and that wasn't to good either, the sauce was way to runny for her taste it was almost like water, the noodles were over cooked but On the other hand the burger I got was to perfection, very flavorful, the meat just right, looked like it could be in a commercial. The salami and cheese sub was absolutely tasteful as Well. I give the hamburgers and subs a 4 star but for me the pizzas and pastas are a deffinent 2."}
{"text":"Our family dined here this past weekend for an early dinner.  When we arrived, the restaurant only had a few patrons, so we were seated almost immediately of walking in their doors.  The waiter who greeted us and took our orders was friendly enough.

I decided to order a cheeseburger and french fries along with a root beer.  I know what you're all thinking!  Here I come to an Italian pizza and pasta restaurant and I order the most American item on their menu.  To my defense, my husband chose the restaurant as we were looking for some place quick to eat before our show.  I wasn't in the mood for pizza, the pasta seemed too heavy as I wasn't very hungry and the salads didn't sound too amazing.  They all came with raw onions, (Yuck!) and their descriptions sounded as if they were all made with filler iceberg lettuce, as I like to call it.

Of course I was given a Sierra Mist in place of my root beer.  The waiter quickly dashed off, and I was too tired to say anything.  A half an hour later my cheeseburger arrived very dried and sad with no cheese.  Maybe I should have ordered one of their salads, and requested no onions.

The only saving grace for this restaurant is that they brought out some wonderfully soft dough on a cute pizza plate to keep my daughter occupied while we waited for our meals.

#90 / 100
Yelp 100 Review Challenge 2014"}
{"text":"Nice clean casual restaurant. Good pizza but the garlic knots were very disappointing."}
{"text":"I went in and got a slice to go. While I was waiting for my slice of pizza I noticed they didn't seem to have any sense of urgency. They were very laid-back. I took my pizza home and honestly it wasn't any better than Little Caesars. The pizza was just ok."}
{"text":"3.5 stars. I do like pizza joints like this. I thought the food was good and the service was very friendly.
Seems a little sleepy in there though and they could use some newer TVs. 
Nothing memorable or very unique. Not that I'm not glad I tried it."}
{"text":"Read all the comments and just cant understand them. I always try somewhere twice because businesses do have off days. We had pizza and wings tonight. Everything was great, even Ellen was still there and happy to take care of us! We have been eating at Mark Riches locations for years and years and the food was just as great as it always was. We drove here from LV Blvd and Blue Diamond and it was worth it. 
If you had a bad time, try it again.... Ive never had any reason to complain here...
Great food great service and it's 530 pm on Sat night!!!!"}
{"text":"For me, this place rocks as parents.  They have great food for my family and it delivers!  I love their pizza, pastas, and chicken wings.  I think We order here like at least once every two weeks for delivery."}
{"text":"It took a little while to get the food after we ordered but everything was wonderful when it arrived and definitely worth the wait. We order to pinwheels and two strombolis.  Delicious!"}
{"text":"I'd actually give this place 3.5 stars If I could. I've only had their pizzas via take out.  Overall, the pizza is pretty good. The crust is thin, which I like in a NY style pizza and the pies are fairly big. The cheese to crust ratio is evenly distributed and the amount of toppings on the pizzas are pretty generous. I did, however, find the crust just slightly doughy in my opinion. Not necessarily the best NY style pizza I ever had, but it's not bad."}
{"text":"Still our favorite italian for 8 years running.  Owners make the experience over the top as we feel like family.  Great value and food is hands down better than any italian in the vegas area.  Favorites are garlic cheesy knots, Sicilian pizza, BBQ chicken pizza, pinwheels, stromboli, and chicken parmesean."}
{"text":"Food is always awesome. Great place. Wings are my favorite! They do not disappoint each time. Thank you!"}
{"text":"The food is authentic & amazing! I had the lasagne when I went in & was very impressed with the fabulous flavor. Other people with us had the pizza & they gobbled it down so I did not get even a taste!!! Next time I am ordering some pizza.  The shrimp was fresh & excellent. 

We never expected such a nice restaurant on Centennial & Tropical. If this restaurant was on the strip there would be a line out to the street. 

Great service to top it off. The owner Bobby came over to check on us and ask if everything was to our liking. That was the icing on the cake. A+++++

We left feeling great & wanting to return soon"}
{"text":"Salad - bad
Pizza - bad
Sangria - horribly made

Overall, it was awful!!

We ordered a salad and pizza and each was awful.  The salad dressing tasted bad and the pizza was very, very greasy.  We also ordered a sangria to which the server said \"I'm not even sure what's in that, so it will take a bit longer than normal\".  Definitely not confidence inspiring and it turned out again, awful.

Make sure to avoid this place if you're in Summerlin.  There are much better places around."}
{"text":"You know what? I eat here a lot. I feel I need to update my review because this place is awesome. You really can't go wrong here. The service is very good; I always receive fast and friendly service when I come for dinner. 

I don't really like to describe food so I'll keep it short and say, try the stromboli. The medium can feed two people; the large feeds a family. I've had the garlic knots, stromboli, works pizza, antipasto salad, french fries, and chicken fingers. Yes! The food is good. Come here and enjoy."}
{"text":"Again, I'm slow on the review uptake....I'm an avid hiker and after a long day in Red Rock, I want food NOW.  My hiking buddies and I decided to check out Mark Rich's in the Albersons' complex on Charleston and Desert Foothills.  I was very pleasantly surprised by how much I enjoyed my lunch!  My group ordered a variety of items, including the tuna melt sandwich, chicken wings, and spinach calzone.  Portions: large.  Service: really nice! (and super accommodating when it came to splitting the cheque).  Food: yummy!  Of course, anything with cheese pretty much guarantees a party in the mouth (even for lactose-intolerant folks like myself), but I didn't notice overgreasiness (is that a word?).

I'm sorry that I can't comment on the pizza -- funny how no one in my group ordered any pizza at a pizza joint! -- but perhaps I'll update this review after my next post-hike lunch.  It looks like this place suffers a little from inconsistent quality, judging from the yelp reviews, but on my visit, everything was good enough to warrant a second visit."}
{"text":"I have the chance to frequent this establishment very often. They have the best stuff pizza I've ever had. Papa John's, Pizza Hut etc. Pale in comparison to what this little restaurante can cook up. There are all  different signature items on the menu. They also do delivery and take out if one desires. They have a very pleasant eating environment on the interior with vintage art and photos from a far gone era. The staff and chefs are amazing and should be complemented at every point of their service. We will definitely be frequenting this establishment for the long term!
Btw. They have Pizza by the slice, Made to order. We also have gelato in a pretty decent bar"}
{"text":"Small place conveniently located in Centennial in the Walmart center next to Port of Subs. Good pricing for lunch specials, that was actually the reason we stopped by. But we ended up not get getting it. My bf wanted to do the 2 slices of pizza for the lunch special but with the toppings he wanted, it was cheaper to just get a small pizza.(pictures posted)

And I ended up with a patty melt. Food was decent. Nothing special. Spent more than we expected to... bummer. Server was nice though."}
{"text":"This place is terrible! Every time I order from here, I ask myself \"why do I continue to support such a lousy establishment?\". Well tonight was the last time. Never have I ordered a meal from here and thought it was good. Incorrectly preparing my food the way I ordered it seems to be the norm here. Not putting onions on something is a simple task for many people, but obviously not for this place. I simply threw my food in the garbage because I couldn't eat it. No longer will I \"settle\" for Mark Rich's solely because it's close and convenient."}
{"text":"We went on a Sunday. The place was fairly busy when we arrived and completely full by the time we got our food. Ordered the fried zucchini with marinara and a large The Work pizza. The zucchini was good, the chucks of tomato in the sauce were cold. The pizza was undercooked and tasted like it. We saw other pizzas come out to tables looking fully cooked and a darker golden brown than ours. Didn't even bother to take the leftovers home. Very disappointing."}
{"text":"It's not really New York pizza. Sorry selling pie by the slice does not make it so. When I ordered \"two plain slices she looked at me like I was nuts. No....just a East Coast babe ordering the only way I know how. The pizza itself is average the cheese isn't gooey enough and the garlic shaker has to be requested. The prices are good and the bathroom is very clean and well stocked. A good place for a quick bite with ample seating but not true to the East Coast quality I am accustomed too.(spoiled)."}
{"text":"Well me and my kids or should I say family like to go to this place they did a whole lot better before it became Gianni's now you don't know when they're open you call nobody answers got a take-out menu here says they're open Sunday through Thursday 11 AM to 9 PM Friday and Saturday 11 AM to 10 PM so why is it when you call nobody answers guess were going to have to find a new place"}
{"text":"We used to frequent this restaurant often. Unfortunately, the inconsistency of their food has forced us to go elsewhere. The pizza is either soggy, undercooked/over cooked with water downed sauce. Rocco's or Dom DeMarcos (both in Summerlin) never disappoint."}
{"text":"First time eating here and WOW! It was delicious!  
The food was served quick and HOT!
The service was friendly from the moment we walked in to the moment we left. Bella was amazing server! 
I ate everything before I could take pictures  so I had to order a sundae!
I will definitely be coming back!"}
{"text":"We've been several times, and the food and service are always excellent. It is much busier on Friday nights, but the food came out quickly. My wife loves their eggplant parmesan, and I'm a fan of their Stromboli."}
{"text":"Love their stromboli! Often, after hiking at Red Rock, I'll happily undo all of my exercising by going to Mark Rich's and having a fulfilling meal. 

The pizza is excellent and I've eaten my bodyweight in the two slice lunch special (great pepperoni). But when I want a filling meal, their stromboli can't be beat.

Great staff, friendly managers, and an all around enjoyable atmosphere. Can't wait to return."}
{"text":"This is the best tasting pizza I've ever had!!! I've been looking for a good pizza place since I moved here 5 years ago.  Had the works, it had so much flavor, just delicious!!!  Paired it with a Stella. I am going back soon to try the pasta.  I highly recommend this restaurant."}
{"text":"We always order food from them for work and last night I decided to take my mom since she's been there once and loved it. Pizza was great we got some wings and fries that was amazing as well and their creamy Cesar salad dressing is to die for! A must have while you wait for your pizza."}
{"text":"Went for lunch. The food was good. The service was so slow--very, very slow.  All the enjoyment of the food was lost. Wasn't really crowded. I have no idea if there was a problem. The waiter was uncommunicative."}
{"text":"Ordering slices to go is such a hit and miss expience. Sometimes it is well prepared and fresh...other times they like to give you 5 hour old pizza that has been re-cheesed!  

Zero consistency. Same with their sandwiches. Once I had a fantastic meatball sub, filled with generous amounts of sauce and cheese. Another time the sandwhich had way too little sauce and the bread wasn't cooked at all.

If you want to experience the original NY Pizza and Pasta, try the location at Jones and Sahara.  Their food is way better."}
{"text":"Nasty food. To many dishes to focus on and it takes away from the quality. Ordered a few dishes and happen to try there pizza which was frozen in the middle. Let's me know its frozen food warmed up to order. Very nasty."}
{"text":"The food was very, very good.  The crust was soft the way I like it.  The best part was the sauce.  Definitely made fresh."}
{"text":"Son enjoyed the slice on a beautiful day. What could be a better way to spend an afternoon. Only ordered 1 slice for my boy, but really enjoyed my time."}
{"text":"Local great pizza in Summerlin, very casual, owners are always there.Prices are good and kid friendly. They have a clown who comes on Fridays and makes custom balloons designs for kids..."}
{"text":"Unlike other opinions on the bad service, I've been here about 5 times and find the waitresses have all been incredibly friendly.  And I LIKE the fact the owners are always casually there, eating with friends, drinking wine, whatever they want to do at their own place of business....I think the fact they can eat at their own restaurant is a good sign.  And the fact that they remain so accessible to their customers and ask how things are makes them rock stars in the pizza business.  They are very outgoing and amicable...and last night, personally stopped by our table asked my friend and I if everything was okay.  There were just a couple issues with the food:  I had ordered the tomato basil soup...thinking like most restaurants, it would be very simple...tomatoes in a blender, basil , etc.  But a white soup came out instead and I was a bit put-off.  It must be all milk?  I had a sip and it was pretty much milked down and tasted terrible.  The waitress kindly asked me if I didn't want it and she took it off the bill.  She felt bad about it and the kitchen was super busy.  No worries..I don't let a few small things ruin my image of a place - especially with the service being as good as it is.  My friend and I ordered a gluten-free pizza (because of my diet restrictions).  It was soooo tasty.  But sooo bad because I have been feeling sick all night. :( SO...I think there was something else in the crust that I couldn't process - probably corn.  Was really yummy though...
Message to Mark Rich:  they now have great wheat-free and corn-free pizza crust flour!! *hint hint*.  Thanks you all!"}
{"text":"Large pie w/ mushroom is always the winner.  I've heard good things about the rest of the menu but it's very difficult to stray from our \"weekly order\".  Nice to have some NY pizza in the desert."}
{"text":"Food: Delicious, with generous portions
Service: Deplorable

First, the good: I had chicken marsala, which came with two full chicken breasts cooked to perfection and a massive pile of pasta. Put a fancy presentation on this dish and I would expect I was eating at an expensive gourmet restaurant. One friend got a large antipasto salad which... well, large doesn't even begin to cover it. This salad was big enough to choke a hippo. The pizzas also looked very tasty, and got great review from everybody at the table. Honestly, the food itself deserves a higher rating, but the service was bad enough to drag this all the way down.

Now on to the bad. Most of our time there, the entire staff was too busy watching the football game to be bothered paying attention to the customers. Personally, I had to ask for water multiple times and had to get a set of utensils from a friend, as the server forgot to bring a set after I asked (shouldn't they have been provided without asking?) Oh and the real icing on the cake: I asked to get a box for my food, so the server was kind enough to go box it up herself. And then forget about it. I actually had to ask for my food back several minutes later as we were getting ready to leave.

I'm going to have to mark this place off as a \"Do Not Return\"."}
{"text":"Hey Mark Rich! Hi Five Broseph, that's one freaking good pie.  Superior ingredients creating superior taste what a crazy concept, I know it sounds nuts but trust me it works.  Every time I go I get a large pie with pepperoni, sausage, mushroom and ricotta cheese. The flavors are off the hook and they aren't stingee with the toppings.  The ricotta is creamy and flavorful.  My only complaint is that the crust doesn't get as well done as I like it.  Dudes all you got to do is take the pizza off the sheet and lay it directly in the oven for the last 2 to 3 minutes of cooking.  This will give that nice char on the bottom and will prevent your slice from laying there like a flaccid dong the moment you try to pick it up.  I can't speak for the rest of their food, considering I've only tried the pizza. I'm not saying it's the best pie in the valley, however if you live in the northwest and looking for a quick slice this is the place to go."}
{"text":"I like running in here for a quickie lunch with their slice and drink special."}
{"text":"Great service, I love the pepperoni pizza and they have some great specials. Its a neighborhood shop and easy to get too!"}
{"text":"So good! And the service was exceptional! The Stromboli is out of this world and the wings are great. I come here all the time with my family and friends."}
{"text":"I've eaten at the northwest location many times previously and was extremely happy so decided to try the Summerlin location close to my kids school. Ordered the #1 special. (Large pizza and a bucket of wings for $35) and a spaghetti with marinara ($7) Got home and found that we had received a 4oz souffle cup of ranch for a BUCKET of buffalo wings. Obviously not enough. The pizza was good. The wings tasted like they had freezer burn or something. Didn't eat many since we didn't have enough ranch. Went back the next day to ask for more ranch. Explained how much I got with my bucket and she still charged me almost $5 for more ranch! Ridiculous but needed the ranch to make the wings edible."}
{"text":"I don't know why this place only averages 3 stars. I've been ordering to go and dining in here for the last couple years and it has been pretty legit overall. The pizza is pretty good, the the typical thick crust variety. The chicken strips and soups have all been good too. The only gripe I would have is pretty minor is that the DM chicken wings sometimes has feather traces left on them but they came from a bird so not really a big deal for me but I've seen others get grossed out from it. 

Otherwise great mom and pop pizza spot. Another plus, you can get a decent bottle of wine for about $20."}
{"text":"I have never had a bad experience here. Come here routinely after a day of climbing in red rock and almost always order a pepperoni, bacon, pineapple, jalapeo pizza! Wash it down with a chainbreaker white IPA."}
{"text":"Had to stop coming. Pizza is ok, there's much better in town but the service has been awful. Twice we ordered pizza, arrived before our quoted time, only to get cold pizza that had been ready a while. The next time we waited over 30 min past our quoted time for our to go order."}
{"text":"Pizza was good when first going there, sadly the quality has quickly declined and pizza is no longer good, pizza is also much too expensive, not the worst, but certainly not the best"}
{"text":"Centennial location: I usually give Mark Rich's 5 stars.  Had a bad experience as the pizza had almost a cinnamon flavor to it this time and the pizza was no better than any other pizza here in LV.  Usually it tastes great.  None of the regular servers were there and they didn't have their license for beer and wine which they usually have.  Also the garlic knots were much smaller than usual and the sauce is a bit sweeter than usual."}
{"text":"I only had their stuff pizza here and I'm a fan :-) I really enjoy when the owners care enough to remember their repeat customers too :-)"}
{"text":"Never had take-out here, but definitely will again!

So the food takes about 15-20 minutes, and we had ordered 2 slices of pizza, and 2 medium spinach calzones.  I've never seen a large in my life that cost $16, but after seeing the size of their mediums, I can probably guess at the size!

So, from a NY pizza slice perspective, this was not too bad.  It was about right on the price, and definitely right on the taste buds.  Had a slice of cheese, and a slice of white.

The calzones by far, were definitely a winner.  We were expecting at $9 a piece that my wife and I would be getting some tiny things which would complement the pizza slices.  However, we could barely share one!  The crust was soft, of which I've rarely had a calzone like that which meant that the dough was freshly made and cooked to the right temperature.  They also didn't skimp on the marinara which I did appreciate.

All in all, will definitely be trying them again.   Hopefully don't run into the same bad reviews as others, but perhaps for to-go, it's actually a good spot versus the in-dining.  Personally don't care for in-dining that much anyways unless I'm going to some posh place on the Strip.

Now to find a good place that's close with teriyaki/hibachi chicken to-go and I'll be golden."}
{"text":"Had a team party here for our flag football team and the food and service was great. Mark Rich personally made sure his staff took care of us the whole night! Awesome pizza!"}
{"text":"We have been here a couple of times and the food and service have been great. Bob and his wife are in the restaurant most of the time and always striking up conversation.  My kids love to play with the pizza dough they give them to keep them occupied."}
{"text":"Pizza is good. Service is good. The BBQ chicken wings are amazing. They have a special with a large pizza and a bucket of chicken wings which is priced at $29. Wife and I take the 4 teen kids and all of us eat for that price. One time a calzone was a little undercooked and they were very good about fixing it immediately and getting us a new one.

The best part about this restaurant is that they have not caved in to the trend of all the chain restaurants in town (e.g., Chili's, Olive Garden, Tony Roma's, Applebee's, Red Lobster, etc.) where they seem to be heating up TV dinners in the microwave and serving them. At Mark Rich the food is cooked fresh.

Enjoy."}
{"text":"I've only been here twice while working nearby at a client site. The waiter service has been nice and efficient.  Both times I've had a calzone and the dough is quite nice and baked just right.  The sauce is a little on the mild side for my liking but it's tasty nonetheless. They also have about 6 flavors of CJ's italian ice at this location.  If you've never had Italian ice you gotta try it.  Not a bad spot for a quick lunch.  I'm not sure about their pizza as I haven't tried that yet...next time."}
{"text":"I went there on a Sunday Night Football game and was pleased to see the game on their TVs. The pizza quality is OK but I have had better. The worst part of it all was the service. We went and felt that the service was rushed the entire time. Eventually we found out our server was getting close to the end of her shift and kept prodding us to pay for our check. Now, I don't mind paying & tipping in advance for a server that is leaving early but she was being very rude to my guests and I, constantly asking us if we wanted our food to-go when we just received it five minutes ago. I checked the closing time and it was 2 hours prior to closing so it wasn't like we were holding the entire staff back. I don't think I've ever received such poor service. When I was eating I thought the food was OK and wanted to come back to try their pasta, but after what we experienced I'm not going there again. Hope you have a better time than I did!"}
{"text":"Kristin was excellent they call her smoupie because of her hospitality and the pasta tequila was wonderful I had it with whole wheat pasta which you can ask for special. Mark Rich's really covers it all great food with healthy options and a beautiful, competent  waitress with a smile... I'll be back for sure!"}
{"text":"Should of known that this place has been bad from the Day it opened.  My wife said oh lets try them again.  Okay hopefully they improved since the last time which was well over a year ago.  Well should of KNOW better!!!!  The PIZZA WAS BURNT ON THE BOTTTOM,  THE CRUST WAS SOGGY!!!.  Ordered Calamari Bigger Mistake. Frozen rings.  My son thought it was mozzarella rings, my daughter thought it was onion rings.  They must buy there food in albertsons frozen food section.   The staff needs to be trained on knowing the Menu and better at telling people accurate time for pick-up.

Leave another menu on my door and I will bring it back to you store everytime and ask for the owner.  Leaving menu's on doors and cars is littering not marketing!!!!!!!!!

Also tell the owner to get off his bar stool and Manage!!!!

More competition is coming and you won't survive."}
{"text":"I was trying to find a great place to order pizza from aside from the usual chains.  I came across their website through Google and ordered online.  We ordered one Works pizza, a pepperoni, and some plain wings with ranch sauce.

The pizza was supposed to be NY style, but it's too doughy for me.  I was expecting it to be a thinner pizza, but it was okay.  What we really liked were the wings!  They know how to make them crispy and not oily.  They delivered it nice and hot.  It was so yummy.

If i ever order from them again, I'd just get wings.  They were awesome."}
{"text":"Terrible. Something is wrong with the dough. Dry with no flavor and flat. White pizza is tasteless. Just terrible. After living in New England, Florida, and Vegas this is by far the worst pizza I have had in my entire life. Wish this part of summerlin has something better. I will take Digiorno over this place!!!"}
{"text":"We've ordered three times and it just seems to be lacking something special.  Nothing really wrong with it, but nothing special either. Like eating Sbarra at a mall. It's ok, but nothing extraordinary or memorable. Each time we ordered we felt the pizza could have used a few extra minutes in the oven. Just didn't seem to be cooked long enough. One of the few local non-chain pizza places that does deliver however"}
{"text":"I ordered  food  to be delivered to my job and waited over and hour for it , when I called to get a status on the delivery , the guy tells me the driver already delivered it, I told the man on the phone I had not received it , so he then tells me someone signed for it , mind you I paid with a credit card He clearly didnt check my ID when someone signed for it , At this point the manager tells me he cant do anything about it that it was delivered and he cant refund my money , so I am paying for someone else to eat. He was so unprofessional about it and completely unhelpful, He refused to credit my card the money I spent on food I clearly did not receive , I have worked in a restaurant  just like this and  the owner I worked for  obviously cared about reviews like this and always made the customer happy , I will make sure that the area businesses know what this restaurant does to the customers , Im going to tell my friends and they can tell their friends and so on. Hope it was worth it !"}
{"text":"Great pizza, made fresh. Chicken parmesan is awesome. The stromboli is great also. His red sauce is awesome, great local place to dine in or take out."}
{"text":"Delicious NY style pizza!

We spent some time at Red Rock Canyon, and this nearby spot was the perfect place for a quick bite.

We were skeptical about the place, but the crust was thin with a bit of crispiness. The cheese was nice and melty.  

The meatballs appetizer was good enough, though it was very standard.  The meatball was soft.

Our waitress was friendly and gave us some tips on local places to visit.  I'm pretty sure the owner is from New York, so he knows what's up."}
{"text":"The pizza was as bad as the service. They did not greet me when I came in, forgot half of my order (unapologetically) and didn't so much as thank me.

The pizza had sweet sauce, soggy sweet crust and was about as close to authentic New York pizza as dominos. I moved to Las Vegas from New York. If you want authentic New York pizza and good service, check out Rocco's."}
{"text":"Just tried their gluten free pizza. It was pricey but excellent. It seems they make their own crust instead of using the tiny frozen ones that most places use. I printed out a buy one get one coupon from the Entertainment Book online so I got a great deal."}
{"text":"Not bad, pretty standard for a pizza joint.  Nothing wowed me here though.  

I came for a quick lunch and service was prompt.  Food was typical pizza fare, I had chicken fingers and fries as I was on my own.  Everything was tasty and basic.  Reasonable price and the food came quickly.  

Best part of it may have been the free WiFi lol"}
{"text":"Excellent food. Excellent service.  Chocolate Italian ice is THE BEST!   Try it, you'll like it."}
{"text":"This is our local pizza/Italian place. We are always satisfied with our food. The staff is very accomodating, even for our picky small child. I have to say I am a bit obsessed with their broccoli soup. I know it is not something you would expect from a place like that, but it is excellent, and when I spilled mine at home one evening, they helped make it all better. The service has always been excellent, even when I ran in late begging for a new soup. It is a bit slow, but the quality it so worth it."}
{"text":"The best thing about our visit was our waitress. She was attentive and apologetic that the pizza was terrible. It was undercooked, the crust was soggy and the toppings were sparse. Too bad. It was the first time we have been out in the evening in 4 months.What a disappointment!  We won't be returning."}
{"text":"What a bizarre lunch experience I had.  I just wanted a quick lunch and figured they would offer slices.  I went to the counter and ordered a pepperoni slice and soda.  The guy took the order but then when I went to sit at the counter...he said that I needed to order from the server.  

So the server came and I placed the same order.  Slice of pepperoni and a diet coke.

Food comes and I'm eating.  I'm not sure whether I'm supposed to get my own refill or wait for the server.  There is only one other table and they're regulars.   The server is there talking to them for about 10 minutes.

I'm hoping I could catch the attention of one of the two employees who are behind the counter, but they're in their own world.  So I stand up and refill my own soda.  

Now I'm waiting for my check.  Finally one of the other servers gives me my check.  

Never stopping here for lunch again."}
{"text":"Little family owned place in a walmart shopping center.Stopped here for noms after visiting a comic shop a few stores down. Service was really friendly here, but I expect they usually haves in the evening. The place was filling up fast when we left. Menu is nice and big with several pizza options, stuffed, new york, and Sicilian. We decided on the stuffed and were not disappointed. The only thing that I could recommend is that they make the bottom of the crust on the stuffed just SLIGHTLY thicker, it tended to get a soggy."}
{"text":"I thought being a privately owned pizza restaurant they'd have a good recipe. Sadly I was very disappointed. Paid $25 for a medium pizza and wings and that was with the special. The wings were in this kind of breading which was soggy and unfavorable. The pizza lacked much flavor and wasn't very good. Delivery was fairly timely, about 30 mins but then again it was also early Thursday evening. I probably won't be back. For that kind of money I'd rather go elsewhere and get more quality for my dollar."}
{"text":"We took a chance on this place we've passed up for 8 years. Should have kept going...now we know. Our takeout chicken marsala was mediocre with low quality noodles. Unfortunately our chicken tequila didn't come with the chicken. They offered to make one with chicken so I had to go back in the middle of our meal to get it before they closed. They also forgot the dressing we asked for, though the order taker repeated our order request."}
{"text":"We live in Summerlin and have passed this establishment many times. We decided to give it a try. We know better now. Food was a C- at best. As we waited to be served it felt like, if you're not a regular here, we'll take our time serving you. We'll drive the extra miles and stick to Villa Pizza on Durango."}
{"text":"Consistent and good, nice portion sizes and good on-line ordering system.  This is our quick'n'easy Italian food spot - not necessarily our local pizza spot  (Rocco's) or nice Italian local spot (Siena) - and great in a pinch when no one in my family can decide what they want to eat.  We love their \"make your own\" calzone with all of the items to choose from."}
{"text":"Good food , Great service. Portio s are pretty good size. 
We loved the atmosphere. Nice place to go with kids as well. They have kid friendly menu
Tiramisu was very good"}
{"text":"The reviews on here weren't great, but I decided to give this place a try since I live in the area.  I got delivery, so can't speak to service inside the restaurant.  However, on the phone they were very nice, and the service was fast - think it came in less than 30 minutes!  The toppings were fresh and the sauce was good, but the crust lost them a star.  It seemed cardboard-like and didn't have a lot of flavor.  With a better crust, I would become a regular here."}
{"text":"I live less than a mile from this restaurant for 1 1/2 years and thought I'd give this place another try. 

In order to get a lot of work done this evening, I went ahead and ordered online to have my meal delivered. It took the typical 45 minutes my order to arrive.

 Because there was a $15 minimum, I ordered chicken parmigiana with house salad and a combo appetizer.

The combo appetizer included my fried favorites - mushrooms, zucchini and mozzarella cheese with marinara sauce. It was good but not mindblowing. 

I opened up my side salad and wasn't at all impressed as it looked like something I would've put together, boring.

And the chicken parmigiana....well, it looked like the chicken patty may have come from Costco.

All in all, with my first and this second experience, this place is just okay."}
{"text":"Went yesterday for lunch and just thought I would update my review. I am obviously a fan.
Had some guests in from out of town who were penny pinchers and thought this might work for them.

$6.95 for the two slice lunch special including drink is a really good deal. Personally, I had the Stromboli, and it was awesome as always.

If you are from out of town and have a car , this is so worth the drive"}
{"text":"Best New York pizza in Vegas without a doubt !!!!!! Every slice of pizza u eat is a slice of heaven !!!!!! This is the real deal!!!! Swear on my mothers eye!!!!!! True story!!!!! Now get in the trunk!!!!!!! Eating mark and his family's pizza for 16 years in Vegas and every slice bring me back home...... To my childhood the Bronx ..... Where we don't f...k !!! Around with our pasta so I'm saying u want the best  here it is!!!!! Bronx belly approved!!!!!! Steve aka no neckwhere pasta gets real!!!!!!cheers knuckle heads!!!!!!!"}
{"text":"I have enjoyed Mark Rich's food for over 3 years and in addition to me, my Dad orders delivery a MNIMUM of 1 night each week. Dad is 91 and homebound for the past 2 years. Since I travel frequently he ordersbhis dinner from Mark's.   I can't blame Mark for requiring a minimum charge for delivery.  So when Dad orders his meals he orders UP only to meet the minimum.  Last evening Dad ordered his meal as usual but for some reason the total was $0.02 (2 CENTS) less than the minimum and was told he needed yet ANOTHER item to bring the total up.  At first, Dad thought this was a joke but after some continuing discussion he realized this was no joke.  Dad asked to speak with Mark who came on the phone.  Homebound Dad was offered a \"beer\" next time he comes in and even after being told Dad cant leave Mark was steadfast about the 2 cents. So, Dad is understandably disappointed that an resolution couldnt be reached.  So, how much is the loyalty of a long time elderly customer worth to Mark Rich???  Answer: Not even 2 cents."}
{"text":"I stopped in for lunch to check out this new pizza place. Mark Rich's NY Pizza and Pasta used to be here. I recognized the girl at the register when I walked in, so I asked her if they just changed the name, but she said that Mark Rich's recipes transferred over when the new owners bought the business in this location. Mark Rich's NY Pizza and Pasta still currently operates another location, using the same recipes and ingredients, but has nothing at all to do with Giani's NY Pizza and Pasta.

I ordered the lunch special for $5.95 which was 2 slices of cheese pizza and a drink. The pizza slices were a good size. I didn't care for the pizza though. They might be using the same recipe the previous owner used, but it doesn't mean it comes out the same and it just didn't for me. The pizza was somewhat burnt and had a stale taste to it like maybe it was from the day before. This is a real disappointment for me because I regularly shop in the shopping center Giani's is in and enjoyed stopping for pizza. Good thing \"Above the Crust\" is just around the corner though on Ann Rd so there still is a solid pizza joint in the neighborhood I can go to."}
{"text":"I wish I could give a 0. 
For those who are ordering online don't do the chicken finger platter. They are ill equipped to make it in a reasonable time period. They will then blame yelp for keeping it on the menu. 
I wish I didn't auto gratuity. We asked to cancel this order and they wouldn't. Completely inflexible. 
Updated to add the instructions that were added on my yelp order. Like double cut and extra ranch they completely failed"}
{"text":"This has to be my favorite family Italian restaurant since moving to Las Vegas 5 years ago. Great service, the food is classic NY style pizza as close to a NY pizza as I can remember. The pasta is home made and they cater to people with gluten free pizza dough and soon pasta. The pizza maker is tossing dough right before your eyes. Dinner specials every night. I had the Chicken Marcela overall very good a bit on the salty side but very good. My wife had stuffed shells that she cleaned the plate. Staff was very friendly and will take the time to just have a conversation with you. I really like this place."}
{"text":"Good food and friendly service.  The pizza is always excellent.  This place is a family favorite.  Keep it up!"}
{"text":"Don't order the gluten free. Obviously they don't know that you have to bake the crust first!  Under the cheeses my pizza had the consistency of oatmeal ! Yuck !"}
{"text":"Called in for a pickup order and was told it would be 30 minutes. When we got there we waited another 20 minutes for our order. I saw the pizza and fries sitting on top of the oven and I knew we were waiting for the Calzone. When we got home the fries were warm and soggy and the cheese on the pizza had started to harden. The Calzone was flat and under cooked. This is the 3rd and final time I go here, it is the same issue each time. Service is terrible and there are about 10 people working also. The manager//owner?? just sits and does nothing and the girl at the register is just over whelmed. 

It is too bad because it is so close to the house but I will drive the few extra miles to go to Rocco's which is better and the service is quick and excellent.

You can tell they don't care here and it shows."}
{"text":"I'd give it a solid 3 for the pizza slice lunch special, but my wife's egg salad sandwich was so good, I bumped it to a 4."}
{"text":"I came in after karate. Good service and the food surprised me. Wings, fries and pizza all excellent!"}
{"text":"Mark Rich's is near home and has great delivery service...usually arrives in 30-45 mins.  I absolutely LOVE the Stromboli!  We had spaghetti with meatballs and shells and cheese and both were very good.  The salads are large, but nothing special as far as taste goes.  We also had pepperoni pizza with jalapenos...which are VERY spicey, not a bad thing if you like them that way but be warned."}
{"text":"Very poor customer service. I ordered a calzone, and was not told until after I had paid that there would be a 30
minute wait. The wait itself was closer to 45 minutes, and I was not given any notice that it would be longer than expected."}
{"text":"Locally owned, awesome little restaurant serving great pizza, calzone, stromboli, pasta, sandwiches, etc. You get the idea, lots of Italian style grub at decent prices...and it's good! 
Friendly staff, homey feel, New York regalia all over the walls.
This particular visit we had the cheese calzone and Italian beef sandwich with side salads. The salads were  you're basic iceberg, tomatoes and onion, but what made my salad was the blue cheese dressing. Very tasty! The \"small\" calzone is anything but, unless you're ravenous mad dog hungry, it'll feed two people easy. The Italian beef was really good too, nicely filled with thin slices of beef, a hardy roll to hold up to repeated dunks into an excellent au jus and some decently spicy giardinera on the side. It does come with fries but unfortunately were of the limp under cooked, not-even-close-to-being-crispy-or-seasoned variety. Come to think of it, I've never had good fries at a pizza/Italian joint. Just doesn't happen. Regardless, I don't come here for their fries, the rest of their food is return visit worthy!"}
{"text":"Don't understand why the bad reviews?  We ordered xlarge cheese. I like the crust. Its buttery. Sauce is good and its super stringy cheese is totally New York. Ranch dip is thick but good. (Yes I like ranch with NY pizza and I know what your thinking)  If your looking for great pizza and super super good service you found your spot. The atmosphere here is 5 star and the pizza is great. The wings sounded good but didn't order any. The other menu items only looked ok..but I didn't try. I really am tempted to have the pistachio custard but better not!"}
{"text":"I have eating @ mark Rich's for years and I have found it to be decnt family fare.  The pizza to me is good espeically the sausage,italian beef and the homemade ranch dressing is yummy.  there are Not that many places in vegas that are truly kids friendly and mark's does this well"}
{"text":"I've ordered delivery from this place and I don't recommend it because the Pizza will be soggy when it arrives....that's like most NY Style Pizzas.....because of the Thin Crust, it can't survive a delivery without getting soggy.

I wanted to give it a try dining in.....so I stopped by today for lunch.  I intended to order 2 Slices of Pizza....but after reviewing the menu, I couldn't help myself and ordered a NY Hot Dog (Dog, Fries, Green Peppers, Onions, Parmesan Cheese, Italian Roll) and a Slice of Sausage Pizza.

The Sausage Pizza Slice came out first.....it was loaded with Sausage....too much in my opinion (see pics).  I also thought the Cheese to Sauce ratio was off.....not enough sauce, the Pizza tasted dry.  The Crust was good and cooked well.....if I was rating just on the Pizza, this place would get 2 or 3 Stars.

The NY Hot Dog on the other hand was Fantastic!  The all beef dog was juicy & full of flavor.  The combination of the Fries, Green Peppers, and Onions made the sandwich taste a little like Breakfast.  It was soooo good!  I could have eaten 2 of them!  This NY Hot Dog is what bumped this place to 4 Stars for me since I've never seen this item anywhere else.

Overall, I enjoyed my experience here.  There are other items on the extensive menu that I want to try.

Will I return?  Fah-getta-bout It, of course!  Probably not for the Pizza though.....ironic."}
{"text":"As an italian girl born and raised in NY, I and am VERY picky about pizza and italian food.  Ask my husband!!  When we moved to the area I noticed Mark Rich's on the corner by our house and thought \"oh it probably sucks.\"  Boy was I wrong!! This place is amazing--the pizza is authentic NY and the pasta dishes are delicious.  We order pizza from here all the time and some times the pasta dishes as well.  I enjoy cooking italian food so we usually dont eat italian out.  When my family comes out to visit we always go to Mark Rich's.  Delicious and friendly staff!"}
{"text":"This place is amazing! Their garlic knots are so delicious, the pizza is pretty good & the service is good. I can't complain!"}
{"text":"Best sausage pizza I've ever eaten in Las Vegas!!!  I used to work across the street from Mark Rich's and we'd order lunch from them a couple of times a week.   I live on the East side of town, and now that I'm retired, am never in the neighborhood to conveniently stop in.  There are no pizza places on my side of town that can compare!  Wish they'd expand to the SILVERADO RANCH area of town!  Outstanding food, friendly service, and reasonable prices!!!  Their lasagna, baked ziti, and fresh salads are outstanding, as well the pizza!  Try it . . . you won't regret it!!!"}
{"text":"OK I have to say, I'm really starting to lose faith in the YELP community. 
Decided to go out for pizza with some friends tonight and since I'm still learning my way around out here, and starting to see that sometimes yelpers will lead you astray, I asked a friend of mine if this place was any good since its kinda close by. She said it was but also suggested another place that was equal distance away. Since I now had a choice I decided to see what yelpers had to say about both.
Both had the same amount of stars and good and bad ratings. So the deciding factor to come here was that my hubs likes thin crust, so we were directed here. I liked that they offered GLUTEN FREE pasta and pizza. 
Our server was super nice with just a little sass that I actually fell in love with right away! It made me feel comfortable and at home. 
I asked if the salads were big and she said s large would feed 3 people. I honestly did not believe her and ordered the NY CHICKEN SALAD for myself and we also ordered a XLarge combo pizza with bell peppers, pepperoni, mushrooms, and olives.  The salad was HUGE!! I brought 1/2 of it home! And there was so many fresh crispy veggies on it! More than actual lettuce, which was fine with me! The pizza was DELICIOUS! The veggies on the pizza were fresh and perfectly cooked and everything was perfect! Not one bit was soggy like I had read in other reviews. In fact, everything about this place was FABULOUS! 
Its not a stand alone resturaunt like I expected, Infact its wedged between a radio shack and a port of subs. So when we walked up and I saw it was just a bunch of tables inside, I thought \"great, loud, noisy, and uncomfortable!\" But it was just the opposite. Surprisingly quiet, pleasant, and staff was attentive   and the place was FULL! It must have been that everyone was eating because the food was so delicious instead of talking. 
Like I said, our service was great, and for all that food for 5 of us our bill was 30 bucks! 
We will definitely be regulars here. It was AMAZING!"}
{"text":"Ordered a pizza a few weeks ago & have to say it was horrible. It seemed almost raw. The crust was cooked but the cheese was white not the golden color on a good pizza. It's a shame because it's so close to home. We've had food from there before but it's been awhile & it use to be good. I guess I'll be sticking with Rocco's because they are always consistently good."}
{"text":"Courteous staff and great Pizza! Plus it doesn't hurt that they carry CJ's Custard and Slush. Haven't tried much else on the menu other than pie and would recommend getting it well done as they load on the toppings."}
{"text":"This is my all time favorite pizza place in Las Vegas! There is nothing better than finishing a hike or rock climbing at Red Rocks and grabbing dinner here! Garlic knots are amazing, Stromboli is great, and of course the pizza slices are huge! The only thing that could make this place better is delivery to Henderson, but that's why it's such a treat. Highly recommend this place to friends and strangers alike :)"}
{"text":"Tomight was our first time visiting Giani's New York Style Pizza.  Flavor was just ok, Xtra Pepperoni & sausage, bacon  and mushrooms.
The crust was way way undercooked. With GF crust with the best texture and flavor longer cooking time is required, the crust should be baked like cracker so it is crispy, but not hard.
We will try it again, but will give more direction.,but please try it

Where Giani's scores an A is with their CUSTOMER SERVICE. The young man working the counter was exceptional at his job"}
{"text":"I usually go to Rocco's but I did a take out order here last night.  The food is decent for the price.  It takes a while to get the food though.  We ordered at 8:00 on a Tuesday and it took about 40 minutes to receive the food. They quoted 30 minutes and the cashier was sweet, so I would say my service experience was good.

The food was hot and freshly made.  We had sandwiches, pizza, and salad.  I was impressed with the salad.  It was very fresh and tasty.  The pizza is not bad.  The sandwich was good.  I am going to try their pasta and wings next time.  

I live less than a minute away so if I am not in a hurry to get dinner, I will probably use this place, but Rocco's is on my way home from work too so I may stick with them if I have a service experience that others on Yelp have mentioned having.  I will order before I leave work and then plan on being there no sooner than the 30 minutes they quote.

One thing Mark Rich's has over Rocco's though is they serve alcohol and pizza and beer is a nice meal on a hot summer's eve.  Also, the interior is nicer than Rocco's too; Rocco's has always been too hot in the summer, Mark Rich's has a nicer atmosphere and is not too hot even with that huge pizza oven."}
{"text":"We came for lunch. Ordered the lunch special spaghetti w/ meat sauce & garlic bread. Let me just say I love the meat sauce! It's a traditional sauce instead of the kind out the jar. Also had the antipasti salad small; which is basically a large salad. Each bite of the salad had a different veggie or meat! Was all very good. I gave four stars because the service was slow... Usually though we have faster service."}
{"text":"A very sweet lovely admirable place on the way to Red rock canyon with a very nice service staff!
Best is that they do slices of both New York and deep dish pizzas which were very yummy.
The lunch pasta - Spaghetti marinara was delicious, tasted like homemade tomato sauce and just rightly flavoured! 
Loved it!"}
{"text":"I had the time to read all the latest reviews and I have to agree with some that say that it's not absolutely outstanding but just okay. I ordered the 10\" pizza with sausage, mushrooms and bell pepper. It was the sausage I would say that was a little scarce however overall it was okay for lunch. Service was normal. Just another average and expected lunch. No complaints but not memorable. I'd come back.."}
{"text":"This place was great when it was called Mark Rich's NY Pizza.  The new place has gone way downhill.  I used to love their pizza, but now it's way below average.  I used to drive miles out of my way to eat here, but no more.  It's just not the same.  The staff changed and I guess they changed cooks."}
{"text":"I've been a semi-regular here for a long, long time... I like their cheese pizza, but if you add toppings it does tend to get a little soft in the middle. Their salad is soooo good if you mix ranch with their italian dressing. I pine for it. Their spaghetti is delish and their lunch specials are a good deal. My boyfriend loves the stromboli more than he loves me. When I'm thinking of going out for lunch, Mark Rich's is usually in the top 5 choices.

Service has usually been good, except for once or twice. But once or twice in 5+ years? not too shabby, M.R."}
{"text":"Good lunch specials. I had the side salad and slice of cheese. The rest of the fam had 2 slices of cheese. It was filling. In fact my daughter didn't even finish both her slices. Daily specials also. Would defiantly come back."}
{"text":"I have ate at Mark Rich's numerous times, due to the fact that I lived across the street and used to work next door. If you are eating in or picking up and planning on not traveling far before you eat, the food is great. However, there is something that doesnt work out when delivering or picking up and having a more than 3 minute drive home. If you get something breaded, it get soggy. There have been a few times where we have had pizza delivered and had to reheat it. If you chose to eat here, make sure you eat inside the first time so you dont get a bad taste afterwards and not want to go back. Aside from the food, they always have very courteous employees."}
{"text":"I ordered a half-pepperoni and half-cheese pizza for my first visit yesterday.  Very fair price and very close to my house.  I wish this place was next to bars because it'd be the perfect pizza to smash after being hammered!  Mark was there and he is a super nice guy.  I used to work with his daughter so I guess niceness runs in the family."}
{"text":"We went here last night with the kids and as much as I wanted to love it, I'm not sure I'd go back! I love local neighborhood eateries, but not this one!

The service is amazingly awful, there were maybe 3 other tables of people while we were there and our server forgot our drinks and didn't get two of our four orders, we had to tell her them a second time! The guy who refilled the water was very kind and very good at his task.  Drinks only.  We asked him a food question and he said, \" you'll have to ask your server, I'm sorry\". Ok. 

Prices are on the higher side for what you get.  My husband ordered a side salad which was a small bowl of iceberg lettuce with a slice of tomato and some red onion slices tossed on top. $4. We ordered wings which were sauceless and dry - at least they came with decent fries - $12.  The kids each ordered pasta -- one had spaghetti and meatballs and the other had fettucini alfredo (no chicken) and each bowl was $5.99 with an extra $1.75 per meatball on the spaghetti and $1.00 for alfredo sauce!!  We weren't told of this and it wasn't very delicious, to say the least!

The owners were sitting there eating, like it was the end of a long day.  Carried out food from the back kitchen and sat down to eat.  Kinda felt like I was at Mel's Diner. :p

I didn't try their pizza, but maybe I should've.  However, I won't be going back, so that won't happen. Its too bad, but like another reviewer said, I'd drive the extra mile or two to Rocco's pizza -- their food is great and their service is ten times better!!"}
{"text":"Pretty darn good pizza, the BEST chicken cesar salad, yummy pasta and great soup!"}
{"text":"I have always got the pizza here take-out, but I'm sure there isn't a massive difference at all.  The pizza is good when you first start eating it, but don't let it get cold.  Something strange happens to it and the pizza becomes inedible to me.  And since pizza is one of maybe three foods I can eat that is a day or two old.  That is a big no no.  Despite that I'm sure the best thing to do at this place is to eat it fresh."}
{"text":"Today was our first time going to Mark Rich's!  We purchased a deal from restaurant.com.  We really enjoyed it!  The food was delicious.  We had The Works Pizza, Fried Ravioli & Garlic Cheese fries!! Everything tasted so good!  The customer service was also great!  We will definitely be back!"}
{"text":"Something has changed for the worse here.  We are long time regulars and I have to agree with Erica V that on the last two pizzas the crust has been soggy / gummy and the sauce was runny / watery even when ordered well done and crispy.  So much so I called the manager last night. This used to be good pizza but sadly no longer. They've either changed ingredients, recipes and/or chefs.  Last week's sausage pizza tasted like bagged hospital grade meat."}
{"text":"Great pizza, Very good atmosphere.  My favorite pizza joint in the area."}
{"text":"What a gem. Had a gift certificate and we were on this side of town after a hike. Decided to try it out and boy I'm glad we did. Warm friendly greeting at the door. Nice sporty decor with an emphasis on baseball. Small town diner vibe with lots of regular patrons. Food was spectacular. We had caesar salad, garlic cheesy fries, chicken parm, and white spinach pizza. One word: YUM! Will be back for sure!"}
{"text":"HORRIBLE Service!!!!

I ordered a carry out pizza and arrived 25 minutes after placing my order. The pizza was no where to be found. The pizza maker said he made it. Cashier gave it to someone else. I asked for a refund. Took 5 minutes for a manager to show up and about that time the customer they gave my pizza to called to complain. The clerk had the nerve to laugh. The manager was extremely rude. 

This was once a great neighborhood pizza place but never again will I darken their doors!"}
{"text":"The pizza here is really really bad. My boyfriend and I came with a group of 8 people. One person in our group has a gluten-free diet, and with there being such limited gluten-free options for pizza restaurants we were looking forward to trying Mark Rich's. Unfortunately, I doubt we'd ever go back.

Each person ordered a different pizza. Jayse and I shared, ordering a large cheese with tomatoes and half artichoke. The crust could best be described as a tasteless, soggy cardboard, and the toppings on each pizza were sparse. For the artichokes on ours, there was only individual artichoke leaves (no actual heart pieces) spread around the pizza very sparingly. You couldn't even taste them. The food was paired with poor service from our server, making for a very disappointing meal. We wouldn't recommend this place. There's much better pizza options here in town at similar prices."}
{"text":"After doing a hiking meetup, we all came here for a pizza and some drinks. My hiking partner hesitated about staying for pizza, as he was gluten-free. However, after looking at the menu and asking the server, we discovered that they do in fact have gluten-free pizza. Yay!

I think there were about 15 of us, so it took awhile for everyone's food to come out. When our gluten-free pizza came, we dug right in. We were really hungry! Our pizza came with four toppings - garlic, mushrooms, chicken, and something else which I forgot. :) It was pretty good! My hiking partner encountered a green pepper on one of the slices though (not one of our toppings). The person next to us had a calzone and it was huge!

Overall I would say this place has A-OK gluten-free pizza. The wait for food can be a bit long though, particularly for a large party."}
{"text":"First time there and my first review. I tried this place because I had a buy one get one free coupon. I ordered a large with pepperoni and sausage and another with chicken and bacon. The proportions of all the ingredients was spot on, but it felt that they were slightly lacking in strength of flavor. The sausage and pepperoni were slightly bland. The chicken was as well. I did taste a slightly herby overtone in the chicken. Not exactly sure what it was, but I'm leaning towards oregano or rosemary. Not horrible, but not exactly playing well with the other flavors. My biggest complaint would be the crust. It's properly cooked, but still ends up being soggy. My preference is for a crust with bits of charred crust. I like the flavor, texture and structure that it provides. If it go back I'll try asking for a well done crust. All in all, this place wasn't horrible nor was it spectacular. I wouldn't be opposed to eating here again, but I also wouldn't go out of my way just to eat here."}
{"text":"I always get the chicken Marsala her so good! Other favorites are spaghetti and meatball and chicken alfredo. I am not a big pizza eater but my family is so to find a place where I can have good pasta and they can eat pizza is a definite plus! Service is always really good and I have never had to wait to be seated."}
{"text":"Went there for lunch today and my GF got spaghetti and meatballs and I got their Stromboli (medium) and it was amazing and huge. Come hungry!"}
{"text":"Never ever order from the Tropical location they are closed! Although they have no problem taking your money. We sat and waited for our order for over an hour, then someone called and said: \"We did not know if this was for delivery or pickup. Then we told them delivery. Okay. About 10 minutes later they call and say, so sorry the location you order from is closed. If you don't come to our new location and pick it up, you will not be getting your food. Oh and also we can't refund your $60. No food, no money. Happy birthday to me. Thanks a lot for nothing."}
{"text":"Never ever order from the Tropical location they are closed! Although they have no problem taking your money. We sat and waited for our order for over an hour, then someone called and said: \"We did not know if this was for delivery or pickup. Then we told them delivery. Okay. About 10 minutes later they call and say, so sorry the location you order from is closed. If you don't come to our new location and pick it up, you will not be getting your food. Oh and also we can't refund your $60. No food, no money. We have followed Mark Rich from all his restaurants and the food is awesome, but this crummy service without an apology is unforgivable. Happy birthday to me. Thanks a lot for nothing."}
{"text":"Love the pizza and the dish Christopher's Pasta is delicious ! Really cool atmosphere inside very nice place and good service. Ashame I just found out about this place been missing out!"}
{"text":"We ordered on 6/18 through grubhub and the food is average. The garlic bread was great but the pizza was a little different...stuffed crust means, not the crust only stuffed but all the ingredients are stuffed in between two layers.  Wasn't too impressed with it, but it was average."}
{"text":"I normally come to Mark Rich's for their pizza, which is very good, but decided to try their Baked Ziti with garlic bread. Nothing to rave about. Marginal at best as compared to the baked ziti you can get at Sbarros. The garlic bread lacked flavor and just tasted like toasted bread. I better stick with the pizza ."}
{"text":"Eat here often, however waited inside to pick up a pizza we ordered. Apparently it was sitting on top of the oven for some time and that wasn't communicated to the cashier.  And then ended up with a pizza that wasn't what we ordered. Disappointed."}
{"text":"The quality on this place has really dropped.  I got a takeout broccoli topping pizza that had one floret and the rest was broccoli stalk.  It was absolutely disgusting and I had to pick them all off.  I thought it was bad enough that it took 5 minutes on the phone for them to take your order.  But when you start sending out pizzas with inedible toppings, that is when you lose my business.  I ended up trying another pizza place down the street from them that ended up being better and slightly cheaper.  Why did I waste my time with Mark Rich's for so long?"}
{"text":"The best in Summerlin!

Mark Rich's New York Pizza is always consistent and the staff is very friendly. Michael is our favorite server. He's professional and goes the extra mile for our orders. The place is clean and dressed up nicely. The autographs on the wall are really cool. 

Highly recommend this place for pizza in Summerlin!"}
{"text":"This restaurant is excellent. It isn't far from home. It has the New York style and it is mine and my hubby's favorite spot. The food is great and the staff superb!"}
{"text":"We live around the corner but we have had bad experiences with them. Service was awful, long wait, they don't honor their coupons, over charging. We drive to other pizza places to avoid the drama at this place."}
{"text":"We ordered take-out today.. I arrived 5 minutes early and took a seat to wait. I noticed a bag in the warming area but continued to wait until 3 more bags were added. I finally mentioned one of them had to be mine and of course it was the bag that had been sitting for nearly 20 minutes. When I asked the cashier about it, she said the bag was only there three minutes. 

The good was good though.."}
{"text":"Came here for pasta about 6 months ago, pasta was not that amazing....
A week ago ordered pizza to go and WOW it was great. Came today with friends and service and pizza was just great, will submit photos of food"}
{"text":"Last time we ordered for \"take out\" and they messed out the order.  We ordered garlic bread and cheese and we received just garlic bread and the meat ball pasta came with just one meat ball.  I decided to give them another chance and today we called to deliver at home.  The food arrived one hour later, the onion rings were totally cold and the pizzas were cold and rubbery also.  Next time I prefer to order from Pizza Hut or Domino's, they bring the food hot and for a better price..."}
{"text":"the worst pizza and the worst service.  I ordered some food and it was delivered 2 1/2 hours late and the order was wrong.   When I called them I was SHOCKED at how I was treated.  The worst part is the female on the other end is the owner?  I would never order from them again and I do not recommend them to anyone."}
{"text":"They literally gave me a cold cheese pizza and added fresh cheese on top with rubbery pepperoni, heated it up and served it to me to go. Disgusting. Took one bite and threw it in the trash. Waste of money."}
{"text":"Mark Rich's NY Pizza IMHO is rated way too low. I know, haters are going to hate no matter what, but dang people if you're going to hate make it for the right reasons. 

My wife, 2 year old and I checked this place out last night and I was pleasantly surprised. Ok, being a pizza snob it's not Settebello. But sometimes you want a pizza without fuss that you can customize and with a thin crust. And that's what I got, a pizza with a reasonably thin, hand tossed crust. I watched the guy toss it and he's good at it. And when you add fresh veggies and tomatoes and more it's not going to be as dry as a cracker, it's going to be kind of wet. (Notice I said wet, not soggy, there's a vast difference there!)  I ordered a NY Combination, tossed the bell pepper, added green olives and tomatoes. What I got tasted great. The green olives added just the right amount of saltiness so it was like a combination meets a Mediterranean pizza. It was good. But I wasn't the only one liking it as my 2 year old didn't spit it out and he ate very good here. (This is also one place where I even ate the crust as it was really good)

My wife ordered manicottis which I tried and liked but had to stay away from as I had that massive pizza to enjoy. Our appetizer included mushrooms, zucchini, and mozzarella sticks. The zucchini was off for me but my wife loved it, and the mushrooms and mozzarella sticks were quickly gone.  

Service was really good. I did have one time I had to ask for an ice tea refill but that was it. Service with a smile? Yep, got it here in abundance. Oh and one other little detail, the fork I was using had seen better days. But beyond that, I have nothing else I can gripe about. 

Overall, I liked this place. And I will be back. While Old School Pizzeria, Grimaldi's, and Settebello have their place, Mark Rich's NY Pizza is worth a look too."}
{"text":"Just had an incredible dinner with my wife, the shrimp scampi pasta she had and the baked manicotti I had were both excellent, we also had wonderful service from Isabella, this evening was our first time here, but we have made this our favorite local neighborhood Italian food restaurant and we will be back frequently!!"}
{"text":"I really wanted this place to be a favorite. I drove 30 minutes just to go there, and I was disappointed once I had it.

First, let me start by saying, if I ever had a restaurant, if for any reason I came out of the back, I would go around (like a lot of places do) and address customers. I would maybe thank them for wasting their money on my terrible food or I would even ask them how they're liking the food. I would say something to better my customer's experience.

With that being said, I sat next to the owners friends and they requested to talk with him. He came out the back and sat with them for 30+ minutes. He never once looked up or even smiled at us. He was too busy telling stories about his childhood and jokes about fat people.

Even when my food came out, he didn't even glance up to look at it. If I had a small business, I would want to make sure everyone is satisfied. Even if I was talking with old friends, I would stop to acknowledge customers. I would make sure the product that being served is satisfactory. He didn't, but if he had, he might would have saved himself a customer.

Ok, so they had one waitress. She was really sweet. She started off great, as far as serving skills. She brought our drinks right out. She asked if we were ready to order, but at the time, we were not ready. It took her about 10 minutes to come back and take our orders. That would have been ok if she was at other tables, but she wasn't she was in the back.

When she came back, we placed our appetizer order. We ordered the Garlic Bread with Cheese and when it did come out, 10 minutes later, it didn't have any cheese on it. They waitress said that she didn't know we wanted cheese. She said that it wasn't a big deal and she took them back to the back. After about 7 minutes, she brought them back out. They had cheese on them and they didn't look too bad.

We started on the bread and then placed the order for our pizza. We ordered the 16\" Sausage Pizza. I should have read the tips on this place before I arrived because if I had, I would have known to order my pizza and appetizer at the same time.

We finished the bread and still waited another 20 minutes to get the pizza. It took a while. I know that they're made fresh, of course, but dang, even Dominos can get the pizza out quicker than that, and they have like 20 other orders to fill. I was the only one ordering, at the time too. Let me stop, I'm not sure the equipment they're working with. It may be significantly different.

Either way, the pizza got to me, but it was really gooey. It was hot and runny, to say the least. It smelled like butt, too. I wasn't the only one that noticed the smell either. It made it really hard to eat it.

The bread tasted pretty good but compared to other places I've previously tried, it was average. It was, in fact, better than the pizza. The pizza was poor. It was well less than average.

In all, this place was not added to our Favorite's List. I drove too far to be disappointed like this."}
{"text":"On my first trip to Mark Rich's I tried a small personal pizza with pineapple, green olives, bell peppers, and onion. I asked for the then crust and was a little disappointed the crust was too floppy to eat with one hand. However, the dough was tasty and the toppings fresh and plentiful. 

I also tried the Caesar salad, which had a lighter dressing than I'm used to, less creamy and more of a vinaigrette. I tasted my friends' seafood linguini (Pasta Christopher) with pink sauce and Linda's Linguini, noodles in red clam sauce.

The Christopher was definitely better and I liked the creamy but lightly fishy tasting sauce. Because we were celebrating a birthday they brought us a candle cannoli and it was rich and sweet.

Overall I liked this place, the service was decent, and the prices good. It didn't jump out as spectacular but overall a good experience."}
{"text":"Ok so the second star is for barely being edible. I have had better frozen pizza. Watery on stale thin crust,the sausage bits were barely edible. I wanted to try a new place but Roccos is a far superior choice. In addition the person who greeted me was slovenly dressed and had a bad appearance for first impression it proceeded downhill from that point..there was no energy no friendliness..basically the impression is that everyone is miserable working here. I was never asked how my meal was in fact it appeared that everyone avoided eye contact in order to avoid any conversation at all. This place has bad food and bad energy..oh well at least I know now. Stouffers french bread pizza is a far better choice."}
{"text":"While the pizza is decent, the service is not so good. Being told it would be 45 minutes for a pick up order is fine. However, after showing up at about 40 minutes and paying then being told it would still be a few minutes and nothing even 15 minutes later, patience is over. Then after asking how much longer and come to find out our pizza has been sitting on top of the oven since walking in, is just NOT right!! Then after pointing out that we have been waiting an extra 15 minutes for no reason, there was no apology, just \" sorry I didn't see it\". Totally unexceptable! Will never go back. There are plenty of other choices in the area. Not worth my time as clearly they could care less about my time and their mistake!!"}
{"text":"Started with a caprece salad which was huge and fresh! Very yummy, then moved on to the supreme pizza which was excellent couldn't have been better if they tried! Our sever (Vikki) was on top of everything and the owner even came out to greet us and make sure everything was good with our table. Overall very impressed and will be going back! I recommend this place to anyone who enjoys a friendly atmosphere and great food!!"}
{"text":"This place is so yummy! I always get their angel hair spaghetti with meat sauce and a side of garlic bread. Sometimes if you order it to go, it can get on the soupy side and the bread can get dried out. So just dine in. They have a lot of food options and is not just limited to the typical pizza place. Every waiter/ waitress we have had is great and attentive.

Don't forget to try their cannoli!"}
{"text":"We have been come here for the 4 years e have lived in Summerlin. Today the restaurant want any busier than any other usual Sunday. But the service was horrid. 4 other tables came in after is.  2 of those were serviced before us.  Finally after 11 minutes the waiter cane to take our drink order.  Then another 14 minutes before someone else cane over for the same thing.  25 minutes abs then we get our drinks.  2 others came in about 5 minutes prior to that and got their drinks right away.  
The  owner comes over and I say something. He then chastised me and explained he was short handed.  He was rude,  curt and today is the last tine I will ever be here."}
{"text":"Ordered the pizza with FRESH GARLIC and PEPPERONI. Slow service at 1:30 pm.... really? Crust was tasteless. so was sauce. Nice amount of decent cheese and they got it thin-crust right and cooked good but it lacked so much taste! WTF!? The supposed FRESH GARLIC was a JOKE!!!!! Unlike ARNOLD SWARZTSENEGGER............ I WON'T BE BACK!!!!!! Best bet...... drive down 5 blocks on Charleston to Dom Demarcos  for pizza or better yet drive down to NE corner of Jones and Sahara... THE REAL NEW YORK PIZZA AND PASTA! Order a \"THIN CRUST...ALL THE WAY TO THE EDGE WITH FRESH GARLIC AND PEPPERONI\".......However the best pizza maker there, Brian , only works early tuesdays and then wedn. thru saturday.Brian has 20 years of pizza making experience..... it REALLY makes a difference! I have spent 9 months of 2012 in search of the best N.Y, thin crust, Fresh Garlic, Pepperoni pizza in Las Vegas. It has cost me in the hundred of dollars in research. Trust my opinion..... the only thing that's not injured on me is my tastebuds."}
{"text":"They should be arrested for impersonating a NY Pizza joint.  Mushy pasta, really bad.  Pizza was below average.  Meatball sub was the only thing decent of all we ordered, but I would not go back just for a sub."}
{"text":"My girlfriend and I decided to try a new local pizza place, and we bought the gift certificate from Restaurant.com. We are definitely coming back here. The food was amazing with very reasonable prices. Our large pizza with an appetizer was right around $24 before the discount. We even had leftover pizza that I'm enjoying as I write this. Our server was very attentive and helpful. We like to drink a lot of water, and she brought us a whole pitcher of water so we could always be topped off. We marveled at every dish she brought to other tables. The food has large portions and it all looks so good. We will definitely be going back.

The only bad thing about this restaurant -- and hence giving it four instead of five stars -- was the fact that the restaurant wasn't very warm. We were seated near the door, and every time it opened the room got very cold. It never really warmed up. We had to wear our coats the whole time to stay warm. Everything else about this place was stellar. I recommend experiencing it for yourself."}
{"text":"Pizza ok not like true NY which would be more cheesy and foldable (Rocco's is more authentic) I got a salad it was simply iceberg lettuce and tomato that's not a salad to me, especially in an Italian restaurant- it should have had many more items in it."}
{"text":"Love the pizza here. Great eat in lunch special. Reasonable prices, and a good quiet spot for yummy pizza. The inside decor is boring and bland, nothing to write home about definitely, but the food and staff make up for it."}
{"text":"ordered a large pizza with a large plate of wings for delivery. Got to our house in record time, and it's AMAZING! East coast should be proud, will use this place for deliveries as much as I can once I am in summerlin again. Any football fans out there, call these guys for some clutch between game food! yum!"}
{"text":"Having dinner here once again and love the thin crust pizza! I am a pizza snob and have had pizza all over Italy and NYC.  So I know good pizza and this place is at to of my list.  Service was friendly and fast !  Will come back for another 6 years!"}
{"text":"Nastiest, soggiest pizza ever. Was like Wonder bread with sauce on it. Crust was completely soaked. Could barely separate pieces, it oozed grossness. Watery sauce all over the place. Was like a culinary school, epic fail, mistake. Would love to eat any chain's pizza over this. Made better pizza with kids at home with a 99 roll of pillsbury dough. NEVER EAT THE PIZZA, unless you are on a diet, its too gross to swallow."}
{"text":"OK,  This place is your typical local pizza joint.  Good pizza.  Great Staff and Fun Enviroment.  Been going here for three years.  Never a bad experience!"}
{"text":"I've always wonder about this pizza place every time I stop by Albertson's in the same plaza. Today was the day I decided to give them a try. As I entered the restaurant, that East Coast feel surrounds the place and the smell of the pizza oven lingers. The cashier  was no where to be found as I stepped up to the order counter, and took her a good 3 minutes to realize there was a customer. She did not  look enthused to be working today apparently as she just wanted to take my order and get back to her task. I do give her a star for being so helpful to figure out my giftcard and giving me feedback on using it.

Now to the food, I ordered the chicken wings with fries and the eggplant parmigiana. I am a chicken wing fanatic and I can eat it and never get tired of it. The chicken wing I received seem very dry and chewy, you can tell they were frozen and then fried.  I was not impressed at all whatsoever with their chicken wings, so moving on to the main entree the eggplant. I was very excited to try this dish as the last time I've tasted it was in Florida months ago. Today was the day to give my palate a taste of this amazing dish. So the eggplant I got  was burnt and tasted old. Like I was expecting the eggplant to be a bit moist and soft, but what I got was a burnt, dry, hard eggplant. The sauce however deserves a star for being somewhat tasty. I'll give them another star for the neighborhood pizza place feel and for the convenient location. 

All in all, I give this place a three star for the three  things that I thought was reasonable to be awarded. Unless you're really hungry and you have no where else to go and this is nearby, then you can go ahead and choose this place. I won't say that I'll never come back, I've still yet to try their pizza, but for now I'd  rather just savor my once memory of a delicious, perfect, eggplant parmigiana meal in my mind."}
{"text":"This place is so ASNFPI#&$*#$Y YES!
If you want to eat at this place, make sure you go to the one in Centennial Center, it's awesome. Can't say the same for the Summerlin one.
I've been going here since high school, it's always so much fun and the environment is very family-oriented and friendly. I remember a few years back they used to have this balloon guy that came in and made all this crazy shit, but haven't seen him recently, so me and my friends probably scared him off.
The food is a reasonable price and super good, the pizza is what this place is famous for, but the pastas and everything else is also just as delicious! I take my mom here all the time. The waitresses are so funny and they're always so nice, it's nice to see her have a good time for a change.
The place never gets too crowded, so it's often pretty quiet in here and you can actually hear the conversations with each other. It's Seat-Yourself policy unless you have 5 or more people, so you can even pick where you want to sit.

This is truely one of the only places I'm a regular at, I recommend it to anyone!"}
{"text":"I just gave this exact place in Centennial Center a five star review, cause it's great. I say to go to the Centennial Center instead of the Summerlin area, if you really want to experience this place for what it really is.

Never got a chance to try the food at the Summerlin area actually, the people were too fucking rude for me to want to even put up with their shit long enough to be seated.
I was with someone, and we were coming back from Red Rock when we stopped here to eat. I figured since the Centennial place was so awesome, I could expect the same thing here.
We walk in, there's no seat-yourself sign. So we stand there, looking at all the empty tables, but  the hostess tells us to wait and walks off. Some teeny-bopper with pink hair is at the cashier, and after a few minutes of the hostess not returning I ask here if we could just seat ourselves, like the other location. She gets all annoyed that we DARE bother her and tells us to just wait. After another few minutes of watching the hostess walk back and forth, not really doing anything but ignoring us, we walk out.
Wasn't going to deal with that horse shit, and pretty disappointed that the customer service quality wasn't the same as the other location. They are run by the same people right?

I really don't understand how the people that work here are so rude compared to the Centennial location. Maybe it just reflects the customers that come in, since we all know everyone that lives in Summerlin is an asshat. But there's no need to assume a sour attitude with everyone that walks in.

Luckily we didn't eat here, I've heard that the food isn't as good as the other one either. It pangs me to give this a shitty review cause I really do like the restaurant, I just think this location needs a big hug or something."}
{"text":"Wow I have been here four or five times. The first couple were a few months ago and I thought the pizza and pasta was great! I'm from Chicago and appreciated having this nearby. Well I'm not sure what happened but the past three times in the last two months are unacceptable. Just bad. First visit -- watery spaghetti and meatballs. It was marginally ok ... I ate it. The garlic bread was ... Terrible, I could have made better with wonder bread and garlic salt which is basically what it was ... Second time, I waited in line and their computer system went down it was a Friday night and they had no clue what to do... I forgave them for this, it happens but they could have written down my order and made my pizza ... They were completing orders and had other customers they just decided to freak out and not take mine, how did people order pizza and pay before computers? I had cash too. Third time tonight is just unacceptable. I don't eat a lot of pizza or carbs, when k to it's a treat ... I just spent $35 for a take and bake pizza (it was not cooked) and eggplant Parmesan (which was surprisingly ok) but the garlic bread was also not cooked. When I say this stuff was not cooked I mean it was not cooked. I had to break out my toaster oven which I did not appreciate. Terrible. I guess I have to find a new place or stick with due forni even though they are not really a take out place, huge disappointment I was hungry... 3 strikes you are out."}
{"text":"First, let me start by saying I used to frequent the location that closed in the northwest and it was great. I have only had the pizza from this location on W. Charleston when other co-workers have ordered it and it was okay. Not as good as the location that closed.

So someone wanted to order some lunch and asked if I wanted to order and I figured I'd give it a shot. I ordered the bowl of soup and garlic bread, which was listed as a lunch special on the delivery menu online. The woman taking the order said it was only eat-in, so I just ordered it off the regular menu. If you advertise something, you should honor it. The online delivery menu does not say anything about eat-in only, just the hours it is available. 

Our order arrived 30 minutes after the promised time, which I was okay with. I worked in food service for 30 years so I understand that things happen. What was not okay was the fact that there was no plasticware or napkins, and nothing was labeled or marked, so we had to open everything to see what it was. 

Now for the food itself. The soup, Italian wedding, was bland and tasted like they just added water to some powdered bouillon and threw in some  green stuff (spinach maybe?). The meatballs tasted like rubber balls. The garlic bread was stale and hard. I was extremely disappointed. 

Needless to say, this was the first and will be the last time I order from this restaurant."}
{"text":"Love this place we have been eating here for a few years and can't beat the combo for football  sundays."}
{"text":"We order from Mark Rich's quite frequently and enjoy their pizza, calzones, and other dishes. Delivery is quick and staff is super friendly."}
{"text":"It's safe to say that I am a huge fan of Mark Rich's NY Pizza. This cozy restaurant is located in Centennial Center in the Sam's Club parking lot. The restaurant is small-ish in size and the seating area is pretty compact.  Don't worry though, the noise level inside always is comfortably mellow and you still have plenty of elbow room. The walls are completely covered in pictures and hallmarks of the East Coast, building on the overall vibe of the place.  

You must order the garlic knots! My husband and I are nuts for Mark Rich's garlic knots ($2.99). They're soft, thick, and loaded with garlic. I can't go here without having an order of them. I'd also recommend the eggplant parmigiana hot sub ($7. 95) with a side order of fries ($1.50). My husband's favorite is the schwarma pita ($6.99). All the food tastes fresh and homemade. The food comes out with lightning speed too. We used a restaurant.com certificate and our total came to $13! Mark Rich's is crazy affordable and has awesome food to boot.

The service is always great. The servers are attentive and very friendly,  yet casual too. The garlic knots will ALWAYS keep me coming back for more."}
{"text":"Great pizza!

Before I start, I should be clear that my review only covers pizza from Mark Rich's New York Pizza & Pasta. 

I was coming from a long hike in Red Rock Canyon and had to have a bite before I could have a full dinner. I stopped at Mark Rich's New York Pizza & Pasta and had a couple of their cheese slices. I was pleasantly surprised with the quality. It took me back to my Brooklyn/NYC years! The crust was thin and crispy, the tomato sauce was tasty and the cheese was spread evenly and applied in just the right amount.

Next time I am in Vegas I will visit again and try some of the other items on the menu. If the pizza is an indication, my update should be just as positive as this one."}
{"text":"I'm a fan of Mark Rich's New York Pizza.  We usually get a 12\" supreme style pizza with olives, pepperoni, sausage, mushrooms,  peppers, and onions.  Every meal I've had here has been delicious, service quick and friendly, and at a good price.  I'll not argue how \"authentic\" to the New York style they are as I'm no expert however, I'm an expert in taste and I've enjoyed all the pizza I've had here!"}
{"text":"A friend told me about Mark Rich's several months ago, but i've never had to opportunity to visit the Centennial Hills location.  Yesterday, I decided to stop by for my lunch break.

I'm definitely coming back again!

I ordered 2 slices with sausage and pepperoni and a drink.  It was definitely the best NY style pizza I've ever tasted.  The service was quick and friendly, and I felt right at home with the ambience.

I look forward to trying other items on the menu in the future."}
{"text":"Ok, I'm sure there are several other reviews on here from native New Yorkers and I may sound a bit redundant but here it goes...

THE FOOD: This' New York' pizza is just ok. Its about equal to your below average pizza in the city. Had the two cheese slice special for $5.95, a very good price as it comes with a drink. The slices are slightly smaller than your average NY slice but not by much. The crust And cheese were slightly burnt. I felt the sauce was just right. Not too much, not too little. Not too sweet, not too tangy.  It wasn't very hot when they served it.

THE SERVICE: Pretty good. Nothing special but just the right amount of attention. Welcoming, friendly, courteous and professional. 

THE ESTABLISHMENT: Very accessible in a great commercial area in Cenntenial Hills. Very clean and cheery. They have a couple of TV's with the game on. Lots of NY flare and memorabilia. The lighting US a little low though. Most importantly they have beer and FREE WIFI!"}
{"text":"Coming from NY, I can say they are providing real NY Pizza!  This is a fantastic place to go!  We have dined in and used delivery several times now, and we have not once been disappointed.  They didn't even blink when we said we wanted extra bleu cheese, which, by the way is REAL bleu cheese - incredible!  The meatball sub is definitely the best we have ever had.  Everything we have tried has been wonderful and we can't wait to try even more. We highly recommend!"}
{"text":"Came here with my husband and kids. It s a bit out of the way and not really worth the drive.
There is a dining room and we were treated right away. The staff is very nice and welcoming but none of the tables looked like they had been cleaned off.
We got an order of \"knots\" which were really just6 biscuits that were brushed with butter and had huge chucks of inedible garlic tossed on top.
Got a large peppier in &a mushroom pizza. It looked great but once we tasted it we realized there was no taste to it. The crust was light and barely there. After we added cheese and crushed red peppers the pizza became more tasty.
It was ok but we will not be coming back anytime soon."}
{"text":"While house hunting in the Summerlin area we decided to stop in at Mark Rich's for some pizza. We had our 2-1/2 year old with us who was enamored with watching the pizza makers front and center. We ordered a Big Bobby and, unfortunately, the first time they made it they burned it to a crisp. Our waitress came by and explained the situation then brought us an order of cheese sticks on the house. Once we got our pizza a few minutes later I cannot tell you how divine it was. I've had pizza on the streets of Italy before- this was better. The dough is crispy yet foldable, the cheese and meats are sooo delicious- not at all overly greasy. Sauce was the perfect amount and was so yummy. When we finally moved here a few weeks later I told my husband we would not be eating at any other pizza establishments."}
{"text":"This is one of my FAVORITE restaurants in Las Vegas!  It's small, quiet and the food is GREAT!  They advertise in Restaurant.com and the prices are very reasonable so its a win-win!  Oh, by the way, they have nice size televisions on the walls so you can enjoy your meals and your favorite sports at the same time.  Do yourself a favor and try this joint!"}
{"text":"We ordered a NY thin crust pizza with meatballs, sausage and mushrooms.  It was excellent, with rich savory tomato sauce, the cheese heavy and gooey as we pulled it apart, the meatballs and sausage dripping with flavor.  

Overall, a good thin crust pizza, service was decent, and the place was clean."}
{"text":"Me the wife and kids tried this place out for this first time this past Saturday. I like the set up. It was cozy, clean, and you could tell the place was family owned. Our waitress was very helpful. She gave the kids pizza doe to play with while we were waiting on our food. The pizza was good. You can either order by the slice with extra toppings not costing that much, to a full pizza with wings. Our large pizza had nice big slices and they allow you to customize slices as you wish. This is good if you have a picky family like i do. The wings were a good size and the mild sauce was pretty good.  The only down side is we picked a rather small table to sit at and with all the food we had it made it a little uncomfortable. Since there front sign stated to  seat yourself that was totally our fault. I recommend this place if your craving some pizza, don't want to be bothered with the strip and want to still make sure you have enough money to pay rent....lol"}
{"text":"Loved this place! We are from Jersey and felt right at home when we walked in. The service was great and I was reminded of home once I took a look at the menu. If you are from NY/NJ this is the closest you will come to NJ pizza. If I come back to Vegas, I am definitely going back to Mark Rich's for a slice of pie! Plus it's right on the way back to the strip from Red Rock Canyon. 

The best was joking with our waitress about true NJ Taylor ham, which she misses so much!"}
{"text":"I used to like the pizza from here. Last time I ordered it was still doughy and I had to cook longer. Today it was ice cold. Not even lukewarm. My kid was screaming for pizza so I didn't send it back. But, I won't ever order from here again. $31 plus tip for a cold pizza and cold soup. There was a piece of \"garlic bred\". It was half a sub roll uncooked with some garlic butter on it. Yum. Should have had a can of Progresso and a frozen pizza and saved $25. Wait, I could have saved $35. I tipped $10. I figure a poor kid driving his own car deserves a decent tip. I called to let them know and she said sorry we can replace the pizza. My kid ate the cold thing anyway. And who wants to wait another hour for the replacement? Blah. Next time I'll drive my lazy self over to Bonnanos and pick up a pizza myself."}
{"text":"I don't like the pizza, pasta, or stromboli here one bit (after multiple attempts).  You can do way better elsewhere (try Rocco's just across the 215) for actual food that is Mark Rich's namesake.

But the tuna melt and french fries here are absolutely fantastic.  I think they use provolone cheese and it makes for a great sandwich, if a little greasy.  The Greek-style pita and mozzarella sticks are pretty decent as well.  

Otherwise, this place has a nice, family-run, slightly upscale feel to it (e.g. it's more of a sitdown restaurant than a fast-food place).  Service is friendly and prompt enough.  Too bad about the pizza, but if you are craving a tuna melt, Mark Rich has got you covered."}
{"text":"I love this place. They have such great pizza, and it's only down the street! Their garlic knots with mozzarella cheese are to die for! Their veggie pizza is downright amazing, and they have the best cannolis I have had. They have a very good lunch deal (until 4pm) with six options for 5.65$ with a drink. My favorite lunch option is either the two slices of cheese pizza, or the one cheese slice and a small salad. They have an extra large cheese pizza  (18 inches) for 16$, which is the best deal in the neighborhood. 
They also serve gluten free pizza here."}
{"text":"Not as good as the original Centennial location. The garlic knots are not even the same size- think half- how is that possible? The food is alright, pretty much the same in most respects, but don't expect to get the same food here as you would at Centennial. The two times I have been here service has been lacking. The last time we came we had a coupon that wasn't applied, and I had to remind the waitress- she had an attitude all night and I guess I was the last straw since she gave me such a death look and snapped, \"Yeah I will do that.\" 
A cannoli I got wasn't filled all the way- not even half, which sucked. What's the point of a shell with no filling?"}
{"text":"My favorite place for lunch specials. I always get the spaghetti marinara, and my mom loves the meat sauce. Great prices on salads for the group, and a slice of cheese pizza on the side is less than two bucks for awesome crispy cheese pizza. Homemade salad dressings are awesome. Me and my sister have made this our regular place for years before we moved across town.

My ONLY complaint is the last couple times I went before I moved they have new servers...I always get a small side of marinara for my pizza and use leftover salad ranch...its just awesome to dip. The one new servers charges us for EVERYTHING. We always get a big salad to share, but get a couple different dressings because not everyone wants ranch. Getting charged 1.50 for a side of Italian is lame. So as much as I love this place, by the time I moved I was kinda turned off and stopped going in."}
{"text":"I came here strictly because I have had a restaurant.com certificate sitting around for 6 months for this place and wanted to use it.  Little did I know that it was all the way the hell in the Centennial Hills area and it was a long ass drive.  At least I got to get familiar to a new area of Vegas I have never seen before.

It wasn't really worth going out of my way to go here, however I would like it better if it was a neighborhood joint for me.  I didn't feel like eating pizza so I had the wings and fries, and I didn't like the wings at all.  I asked them not to drown them in hot sauce when they asked me if i wanted the sauce on the chicken or on the side, and they ended up giving me a bare faint of sauce, which ruined the whole entree for me.  Wings need to be tossed in sauce the moment they come out of the fryer.  When I told the waitress the wings didn't really have sauce on them she brought me some on the side, and they still didn't taste like they should after they are tossed in sauce out of the fryer.  Yes I'm picky about wings.

Anyway, husband had a medium pepperoni and although a little greasy, was pretty good.  If this was a neighborhood place for us that delivered, this would be the best pizza ever, but being that we trekked from the Henderson area, we weren't thrilled with the meal overall.

However, this was a complete bargain with our restaurant.com certificate.  We only paid $15 for two drinks, medium pepperoni, and my wings/fries.  We won't be coming here again unless we already happen to be in the area, however."}
{"text":"First of all the only reason I didn't give a one star is because I've never gotten sick at this place.

I've lived in the neighborhood since they opened and have ordered numerous items but the pizza is a regular item for me. There is something wrong with their ingredients apparently because the pizza doesn't taste anything like New York style or anything else for that matter. The pizza dough is completely tasteless and is undercooked to the point of being watery. But it has to be the sub-standard ingredients because pizza from a place that is called \"New York Pizza\" should not taste like this. The cheese also is totally devoid of any taste whatsoever. 

Although, from the outside this place looks so very inviting. The lighting, layout and all, it sets really high expectations... which are quickly dashed the minute you dive into your meal. It's like they really don't know, or care, what they are doing.

While dining in the staff seems like they have better things to do than, well, waiting on tables. Rushing out, dropping off whatever you order and rushing off to hide behind the veil. 

But the main reason I will NEVER order from them again is the pizza has NO taste whatsoever. Sorry Mark Rich, New York should not be in your title... and neither should pizza for that matter... adios!"}
{"text":"I've only had the pizza at this place and it's excellent. This is a New York style place. It's comfy to eat inside with the option to eat outside. This is a good spot to have dinner after a hike at Red Rock. Also, don't forget the Black and White Cookie. It's packaged and pre-made, but it has a good dense cake with a nice cold frosting. I've held group dinners here and the owner has always been very accommodating. Also, the service is outstanding and very personable."}
{"text":"Maybe slightly higher than a 3 star - but not a four star.  

I have been here about 5 times.  It is a small pizzaria with a New York Theme.  The staff is very friendly.  The prices are very reasnoable.  It was cool because we ordered a \"pitcher\" of root beer - pitchers of root beer take me back to the pizzaria days of my youth...

They have decent food.  My major hang up with this place is the pizza is soggy in the middle part.  You can't fold it properly or even lift up.  The pizza tastes good but it is just to soggy - almost wet in the center.  There are 2 ways to eat it; you have to fold the point end towards the crust or you are reduced to eating the pizza with a fork!!! 

Also, Ordered a cannoli.  It was very good.  They might even make the shell homemade (if this can be confirmed I would rate this a 4).  It was the right color and it wasn't perfectly round like the a factory made shell.  I told the waitress - \"Leave the gun - take the cannoli.\"  She had no idea what I was talking about.  

So - It isn't the best in town, but it will cure a pizza fix if you are in the northwest part of town."}
{"text":"Ate here yesterday as a group of 10 after we hiked at Red Rock. I'm not sure if any of us had been there before, but our cars were parked in the lot and we were a bit hungry so we voted between this place and In-N-Out and pizza prevailed. We were seated right away by the kitchen around 3 ish. 

I don't know about you, but I HATE splitting things as a group. The group wanted to order three large pizzas to split between us along with garlic bread. Ugh, I always feel like I'm going to have to throw down $10 for two slices or some other nonsense. I decided to opt out of the pizza and garlic bread sharing (and bill splitting) by ordering an Italian beef sandwich and fries that came with au jus (hence the reason I ordered it) and jardinere for $6.99.  The fries were thick and gave them to a guy at our table and I ate the sandwich. It was filled with a ton of meat, but I wish there had been a bit more aus jus and jardinere. It was really yummy and I'd for sure order it again, subbing onion rings for an extra charge, though. 

Apparently the pizzas and garlic bread (half with cheese, half not) was really good, according to the rest of the group. One of my friends from Jersey also opted out of the pizza sharing and got the $5.65 two slices of cheese pizza and a sprite and she said it was ok. 

The place is covered by family photos and the owner (or I assumed he was the owner) told us who the various people were on the wall."}
{"text":"Love the finger bucket! Pure heaven and the pizza rocks!!!"}
{"text":"I'm very disappointed and I will never order from here again.I called to place a order(every time I've called,I have ALWAYS been put on hold) to be delivered and was told that it was going to be  a hr and 20min.for delivery ,so I said ok I will come pick it up.he said it will be 40 min.(that's still a long time,but ok)when I arrived at the place to pick up my order,I was right on time(40 min).I was informed that it was still going to be another 15 min.(what!!!!!!!!!!!!!)my Pizzas were sitting on top of their oven,but my wing,fingers and a salad were not ready...he therefore proceeded to have me pay(when I called to place the order in the beginning,he took my card info)I told him that I already gave you my info and I believe you already charged me.....he came back with my cc info on a scratch piece of paper,it was somewhere in the back. (scary,for someone to get that out of the garbage)..about 20 min later,my food was ready and I asked for some blue cheese and he said that's a extra charge(are you f ing kidding me,you already had me waiting a long ass time for my food)I said ok, never mind and as I was leaving I heard him say to another customer in there\"what does she expect,its a fight night\"seriously,I have been ordering and getting food from you for a long ass time and I have never been so offended it all my life.....you just lost a long time customer"}
{"text":"Great service, Ellen is very sweet and Mark the owner was very kind also. I like the lunch specials. Deff going to try the Calzone next for sure. Thank you!"}
{"text":"First couple of times I was in there for pick up and it was great. I tried to come in and eat and the experience isn't the same. The table and floor were dirty and it seemed like whoever was in the back was having a party because all I could hear was laughing and loud talking. My regular to go girl was there and pleasant and the morning pizza guy makes pretty decent pizza. Maybe I'll give them another chances soon but I'll probably just stick to pick up."}
{"text":"My first visit here and i was going to use the groupon i bought, but they had a special of half off any pizza so i decided to try that and save the groupon for another time. I can say my daughter and i enjoyed the pizza, far from the usual papa johns or pizza hut. she usually doesnt like thin crust but loved it. and while my only complaint is that the end of the pizza was a lil soggy but that was due to the fresh vegetables. Overall it was good enough for me to try again."}
{"text":"This might be the best pizza I have ever eaten. New York style thin crust with high quality ingredients on top. They have thick crust selections as well. New York theme and decor. Very friendly and good service. The place is packed in the evening even on weekdays. Superb price/value on food and drinks. Located across 215 about 20 minutes from the strip in the suburbs of Las Vegas. If you go by cab be prepared to wait a long time for one to pick you up.  There are not many destinations for cab drivers in this part of Vegas so they do not like driving one way without a fare to pick you up."}
{"text":"Super friendly Staff, very accomodating, Family atmosphere, delicious Entrees & nice size portions, Love their Spaguetti & Meatballs Sauce!"}
{"text":"Solid NY experience and food, at least as far as you can tell from one visit.  It's not huge, about 20 tables plus a few seats at the bar, it's got a pretty simple ambiance but with lots of good NY memorabilia on the walls.  The service was very friendly.  The menu covers the staples from pizza to calzone to various pastas (e.g., stuffed shells, manicotti) to subs like a meatball or veal parm sandwich.  It goes a bit too broad for me, I think they sell burgers too, and I'm thinking they should stick to the core southern Italian checkered tablecloth fare.

The side salad was fine (iceberg plus a few slices of tomato and red onion).  The stuffed shells very good, but I wouldn't say outstanding.  The garlic bread was a nice free add-on, but was on the dry side.

Overall, a great experience at a good price.  I'll be back."}
{"text":"What this country is lacking is more small businesses like this place. I can't even begin to tell you all how wonderfully we were treated here. Not to mention that the food is spectacular!
Our server, Tasha, was sweet and helpful. Who I'm assuming is the owner, \"Mr. Rich\", walked around and greeted each table with a silly pizza puppet making my kids giggle.
We WILL be back and an planning on making this our new little family spot."}
{"text":"I'm giving this three stars instead of two, because

1.  We showed up 5 minutes before closing and were welcomed to eat dinner. 

2.  The service, both from the waiter and the busboy, was attentive and excellent.

3.  The dish I ended up with, after sending back my initial choice, was pretty tasty.

4.  They have wine (and beer).  And they have wine that I'll drink (I'm picky), at a reasonable price.

I'm not awarding five stars because:

The ambience, IMO, is nothing spectacular, despite other reviewers liking it.  It kinda reminds me of New Jersey strip mall liquor stores, with the big, unadorned plate glass windows and Bud signs.  The chairs are comfortable, though.  

My first order was Chicken Marsala.  In general, I hate it when Marsala sauce has cream in it.  In particular, I hate it when it's not indicated on the menu.  I hate it even worse when the chicken and the pasta are drowning in said sauce, to the extent that I can barely see the two main ingredients.  The fact that it's served in a soup bowl is a testament to this.  I never learned how to swim, and wasn't about to so that I could dive into this soupy mess.  But worst of all?  The chicken was straight out of a food service frozen box, two semi-elongated patties that were breaded, identically sized (by a cookie-cutter?), full of salt, and probably worse than a Sbarro's at any turnpike pit stop coast to coast.  One bite and it was history.  

To his credit, the waiter was gracious and, despite the hour, offered to substitute any other dish.  I \"had what he was having,\" and got the Chicken Cacciatore my husband was happily slurping up.  With pieces of fresh, unbreaded chicken, fresh mushrooms, green pepper, black olives, and much less sauce than hubby's, per my request, it was delivered quickly and was pretty good.  Grated parmesan and red pepper flakes kicked up the chunky red sauce, and it was a very satisfying dish.  And because I asked for less sauce, my swimming dysfunction wasn't an issue.  Ultimately, we left satisfied, but the origin of the chicken from my first entree leaves some nagging questions unanswered."}
{"text":"The prices are very fair, the pastas are good, and the pizzas are great.  The restaurant is very small, so sometimes you feel like you are eating in your neighbor's lap.  The help is always friendly, if a little familiar."}
{"text":"I am not a local, but I suspect this gem stays in business thanks to many loyal local fans.  We tried the salad, 2 types of pizza, and a chicken dish.  Everything was fresh, nicely spiced, and served hot and on-time.  The atmosphere was comfortable and quaint, with authentic New York photos and decorations. Good food, good service, and fair prices - how many other places have this perfect combo?"}
