{"text":"Now it's been 2 months and I've been craving for a properly spiced Indian food... not like the usual ones in north america. Today I stumbled upon masala kitchen, ordered chicken biriyani and lamb curry. They were just as spicy as the north indian food should be. The delivery was fast and the employees were friendly. Overall it was a 5 star worthy experience.

There's not enough siting arrangements there as the place mostly targets the customers who wish to take away their food."}
{"text":"A great place to get fast, cheap Indian food!
We visited this place twice already and both times we were not disappointed. They have daily specials that run you only $5. Our favourite thing to get so far is the chicken biriyani. At $5 you get huge chunks of chicken with a side of flavour explosion. You will not be disappointed. 
This is definitely a place we will be going back to for our Indian food craves."}
{"text":"The food is okay, nothing special, but the service is terrible. I've been disappointed in their customer service here on numerous occasions, including having to wait over 45 minutes for a simple pick up order and another time where I was told my food couldn't be made when I went to pick it up. I understand there are sometimes technical issues with kitchen appliances but at least call me ahead of time and let me know that you're having issues vs waiting until I get there to tell me. You have my number for the order!"}
{"text":"Just popped in here on my way home from work and took the daily meal deal of Masala Fish, Potatoes and Roti. Was freshly prepared in 5 mins while I ate a lovely beef samosa! Meal was excellent and fresh and the place was clean! I will be back - a lot! Good home cooked food - great value. Thanks!"}
{"text":"(Review from Sept 2013 visit)
We went with MK to cater a pre-wedding Dinner event on a recommendation, and we were thoroughly pleased.

One should be aware of what this food outlet is so that one's expectations are realistic. They have the capacity to do two things very well - take out food and catering orders.While they have a couple of small tables where one may consume freshly made food this is not a sit down restaurant in the typical sense.
.
What is also useful to know is while the cuisine is Indian it has an East African influence and therefore there are some important differences to the usual Norther Indian restaurant food.So for example the samosas have a thinner crispy, triangular wrapping rather than the doughy, thick wrapping associated with Northern India.They also have fried Muhogo (cassava) that you do not find in Typical Indian cuisine. They make Biryani in two styles, the East African way with the rice and the masala gravy separate or the Lahori style where it is cooked and presented in one vessel.

We had the opportunity to sample various dishes during our two vists there to work out a catering menu for our event. The challenge was to accommodate the significant number of vegetarians among the majority carnivores. The management was very helpful in helping us come up with a good combination of items. My biggest problem was in trying to pick a few dishes as so many delightful items are available.

I would highly recommend the Black Kebabs- fried meatballs essentially, with the right combination of spices. Bet you cannot just eat and stop at one.
For vegetarians they have the spicy potato balls (BatetaVada).
We had Chicken Pakoras that were a huge hit with our guests. The Chicken Biryani is a must.

Next visit I want to try their masala fish- it looked so appetizing, but I truly was way too stuffed to try one more thing.

Our order for 100 people was ready to be picked up at the appointed time.The portions were overly generous.The owners had gone out of their way to obtain disposable serving thalis for us, knowing we were out of town and the party was in a rented community center hall.
I was impressed by the quality and quantity of food and the professionalism of the staff."}
{"text":"I'm going to give this place 5 stars.  While the food is not the absolute best Indian food that I've had, the price was excellent.  I had the special of the day, which was a chicken leg and thigh on a spicy, flavourful bed of rice.  With tax, the meal came to about $4.50. That's a pretty damn good price for a homecooked meal.  I'm definitely going back.  It gets 5 stars, because that same meal would have cost 10$ at most other Indian food restaurants.  The place was clean and ambiance and the atmosphere were really calm and relaxing.  I liked the music they were playing in the background.

A place is either 5 stars - 4 if it's good, but a little pricy, or 1 star if it's crap. There really is no middle ground when it comes to food or any product that you pay money for.  It's either good or it's not."}
{"text":"Great value as many others have mentioned, and lots of flavour too. A small space, but very clean and well-decorated. I ordered the chicken mishkaki, masala rice and masala potatoes plate. It was $8 and a large plate, so great value. I have to say however that the chicken was quite overcooked which pulled the experience down a bit. Worth another try for sure, but hopefully that's not always their approach when cooking meat."}
{"text":"Possibly the best Indian food I've had. They also have little bonuses like Masala Fries, which are a must eat. I haven't tasted a butter chicken as good as Masala Kitchen's. The curries are flavourful. I get dahl with every order. Their naan is great and they embed garlic into the garlic naan.

The employees are friendly and efficient. Don't be in a rush when you get here and expect to wait for your food to be prepared, depending on what you order. They don't have everything precooked and waiting under a heat lamp.

The best part about this place is that the food is priced right. I can order enough food for two people for $11."}
{"text":"food quality is good.

quantitiy is too small

highly over priced. it is in scarborough but it is priced like a downtown toronto takeout place. 

options are not that great."}
{"text":"How do they do it? How do they fry up their Batata Vada, Chicken Chop and Shami Kebab and still keep the mashed potato soft, fluffy and moist? They definitely are working some culinary magic in their hidden kitchen.

Once you enter MK you can smell the delicious aroma of exotic spices in the air (the cooking spices not incense). The inside is bright and clean. They have 2 small tables a bench and a fireplace: a nice place for couples to have a lunch. Outside they have three picnic tables for groups to sit down and eat. Most people order to go so the tables are always available.

When you want to order look through the kitchen window and get someone's attention (the cashiers double as kitchen help). The staff have always been warm and helpful. They patiently answer all my newbie questions with a smile. If you need to use the washroom, you'll need to go through the kitchen to get there. 

They have the best Indian Street food (Samosas included as well as above mentioned items) in the GTA. They use a harmonious blend of spices that work so well together. Add in the tamarind dipping sauce which has a little heat and you've got all the five basic tastes of sweet, sour, bitter, salty and yes umami (savory) covered.

I took away a star because not all their food is well spiced (Butter Chicken is bland), and the temperature of the food isn't hot enough for my liking. I like my food piping hot right out of the pan/fryer/oven. 

TIPS:
For the best bang for your buck check out their daily specials and definitely add one or more of their yummy \"bitings\" ($1-$1.50) or maybe a cup of Masala chai for $1.25.

Learn from the regulars on which items to order; remember, I did say the balance of spices are perfect in some things but not others."}
{"text":"Although we enjoyed our first meal here a year or so ago, we were very disappointed today. We ordered a 2 meat thali with beef curry and butter chicken and for Indian food, it was quite bland. We also ordered the round kebabs as appetizers which were dry and came with a cilantro chutney dipping sauce which had very little heat. The food wasn't bad, just unmemorable, but it wasn't the food that was our biggest disappointment...

The service was terrible. There was one girl on the counter, she took our order then proceeded to dish it out from the hot plates into the thali plastic take away container. The phone rang and from the conversation, it was a personal call. We waited close to five minutes for her to get off the phone while our food was on the counter, uncovered cooling off. She got off the phone, went back to filling the Thali box with the roti, tomato, rice, and chopped onion then the phone rang again. This time it sounded like a take out order, but again, we were ignored and our food was left to cool off more. The call ended and at this point she passed the Thali containers to a girl in the back to put the lid on and wrap them in a box and sure enough, the phone rang again. Once again ignored. I'm not quite sure why the girl in the kitchen couldn't help fill the container or answer the phone.

There's so many awesome Indian dining options in East York and Scarborough next door that I can't imagine returning."}
{"text":"Pretty good, nothing special, but I like the place.  They're just so eager to please, so sweet, so hard working.  They want to be good. I think in this spirit they're going to improve and get a loyal base.  They'll gain fans with service first and later with the food.  So: the food needs more flavour and spice.  It's pretty bland.  And the naan is sub-par.  On the bright side, it wasn't at all greasy. A lot of South Asian fast food can be truly oily and MK is not at all.  Take out is emphasized here: they're almost no space to eat in (though I did).  I suspect they're a healthier restaurant than most.  They seem quite clean and wholesome, and I wish them well as they grow."}
{"text":"Great new lunch spot since La Familia was closed for lunch. Split between two people, the large butter chicken, chana daal, 1 rice and 2 garlic naans was more than enough for 2 people. Will be ordering again!"}
