{"text":"Fantastic! This is my favorite restaurant to deliver from. Food is always delicious and on time. The gyro platter is some of the best gyro meat I've ever had.. yum!"}
{"text":"Delicious place! We're vegan and really appreciate the options they have. And yelp delivers so that's a plus. We just discovered this place a few weeks ago and have ordered delivery at least 4 times."}
{"text":"This place is literally the yummiest arab food I have ever tasted. The staff is so kind. I ordered falafel and they were extremely delightful and bursted with flavor. Their shawarma is always an exquisite run of flavors. The restaurant is a very nice and relaxed environment with many places to sit. I come here often, and recommend it to all my friends."}
{"text":"Food does not come close to what Arabic food is. So please people don't be fooled I'm Arabic so I know.  I had to fix the dressing for fattoush salad and I added Mexican hot sauce to chicken shawarma to be able to eat it. I felt awful doing it but I had to do what I had to do.  Arabic food is all seasoning and this place I think is allergic to seasoning or really lazy about it. So obviously wouldn't recommend or eat there again."}
{"text":"Nothing special at all about this place or the food.  Much better at Pita Jungle!"}
{"text":"Never had Lebanese food before and decided to give it a try ... and it was GREAT! We asked for their recommendation and had the chicken shawarma. Absolutely delicious. We had their fries on the side. My wife, a fry connoisseur, said they were \"the best I've ever had. Perfectly soft and steamy on the inside and yet crunchy and crisp on the outside. The perfect French fry.\" 
The server was friendly and kind. The atmosphere was comfortable and cozy. The prices were great. Overall, a terrific experience and wish their restaurant the best of luck."}
{"text":"So glad to have found this gem in my own backyard.  Wonderful service.  Such friendly people.  Happy to support family owned business.  They even offered a snack to my grandson although we had brought our own food for him to eat.  Will be back for sure."}
{"text":"Started ordering from this restaurant through Eat24 and they also are on Restaurant.com. Good quality food and quick delivery. Love the gyros and the fries are a good amount for the price. Friendly service as well."}
{"text":"I was recently visiting the Pheonix area and looking around for Mediteraninan food and I am so glad I came across Mashawi Lebanese Grill on my GPS. The food was Amazing. The hummous was the best I ever had, and I've had hummous from when I traveled to the middle east, and here all over in New York and California. This has been by far the best! 

We were very hungry, so we ordered the \"Mixed Mashawi Platter for Two\" which had a little of everything we wanted. its was so good, I had to ask what they marinated their food in. Its a cute family business, that I dont think many people are aware of, but it is definetly worth a try.!

I travel to Phoenix a lot and I know now for sure, where I'll be getting my meals."}
{"text":"1st time visiting. Wonderful, fresh & healthy food. Very nice & courteous staff. Family owned & operated. Wait for food is consistent when making fresh.  Nothing bad to say, No complaints.  Will definitely return!!!!"}
{"text":"4 star when eating inside, better portion for the money.

But don't get gyros to go unless you prefer very small portions of meat.  Disappointed.  Chicago Gyros $7 for a loaded gyro, 2 miles away."}
{"text":"As others have said, appears to be family owned, and this contributes to making Mashawi great! Friendly atmosphere combined with very good food that is also a great value = a winner. Our server was genuinely polite and friendly.

The Lentil soup was very good, we enjoyed the salads, the Greek version had excellent flavor and both salads were very fresh. Our entrees were prepared well.

I was surprised that others made some comments about the amount of food - when you consider the prices here, ( as well as the quality) I disagree.

Even though the PHX area does not seem to have much demand for good ethnic food, it is only a matter of time ( and maybe some marketing) until this place really catches on, and for the sake of the family that seems to take pride in their restaurant, I hope it does."}
{"text":"Not 100% Lebanese like u get served in the middle east.. But for american standards of Lebanese..it was yummm! We were 6 of us and all of us loved the dishes we ordered.. There was feedback from the table that quantity of meat was less... Anyways.. All that said, certainly i wud suggest you all to give it a try... Its a family run business.. Everyone from the cook to the server.. All are family.. The person that greeted us, took the order n served us (all the same dude) was very polite and warm.. I will certainly go back for more..."}
{"text":"Went there with a friend who is blind.  We went in and sat down to look at the menu.  The restaurant was nearly empty except for one table.  The owner came over to our table and told us that we would have to leave because of my friends service dog.  We pointed out that he could not kick us out for that reason.  He admitted that he knew the law, but he still demanded that we leave.  Needless to say I can't review the food there, but I tell you for sure that I will never go back.  My friends was angry, but most of all he was shamed by the treatment he received."}
{"text":"We ordered the gyro sandwiches, fries and hummus. All of it was delicious! We will definitely be coming back here soon. :)"}
{"text":"Lebanese food just like my Situ made at home growing up.  Delicious, authentic, wonderful.  I am so delighted.  The Kibbee was excellent and the grape leaves were perfect.  The salad and the Tabouli were both done in the traditional way with the lovely flavors of lemon and olive oil and mint.  Marvelous."}
{"text":"We were being lazy one weekend and decided to order in for food. This place and one pizza place were the only available restaurants that offered delivery in our area through GrubHub, so we decided to give this place a shot. 

We ordered a medium hummus, chicken shawarma platter, and the gyro platter. The medium hummus was huge! Definitely more than I expected to get, and more than enough for the two of us. You could easily split the medium between four people. The chicken shawarma was very good; different than I was expecting, though I've been to a bunch of Mediterranean restaurants but never Lebanese. The chicken was tender and had a nice spice (not spicy) flavor. It was served with a large bed of fluffy white rice and a Greek salad ($1 up charge for Greek over house salad). The gyro platter was also very good; the meat was tender, well-cooked, and not at all greasy like some other gyro meat I've had. It was served with a side of fries and also a Greek salad. The fries were surprisingly good, even though we had read in reviews they would be. They tasted fresh (not from the freezer aisle) and were sprinkled with a Mediterranean spice. 

Overall, we were very happy with the meal as it tasted good and was delivered nice and warm, which we were initially concerned it wouldn't be. We'll definitely order delivery from them again, and also plan on visiting the restaurant."}
{"text":"Outstanding!  
Service was wonderful!
Food was delicious!  I ordered the lamb kabob and it was perfectly cooked.  It was tender and very juicy. 

Very pleased with this experience."}
{"text":"Definitely as good as it gets!. The  food is always fresh with great flavor. Super friendly and polite staff,. Highly recommend! Would definitely order again!\""}
{"text":"Staff is very friendly and just ordering their chicken and salad is a great healthy meal after or before my workout at the gym next door. Their house salad is amazing ! I love their chicken shwarma  pita so good"}
{"text":"Went here tonight for the first time. Started off with their combo appetizer. The best falafel I've ever had, hummus, Baba ghanouj, and tabouli salad. We then shared a mixed grill plate of steak, chicken, and ground lamb. The two sauces that came with the meat were awesome. The garlic sauce was my favorite and my wife really like the other because it had a lot of fresh mint in it. 
We'll definitely be going back to try out the rest of the menu."}
{"text":"Really enjoyed this place. We went for an early evening dinner and therefore it was pretty empty. The service was very nice and the food was fresh and the woman there makes everything. Hummus, salad, pita, kibbe, chicken platter- everything was delicious. Prices are very fair. It is a local establishment in Phoenix and I'm ALL about supporting local. My mother and I went and we definitely plan to return. It was nice and filling. Noting was too greasy nor overdone. Nice and clean atmosphere, parking available in the lot. Probably the best good I've had in Phoenix. Nice staff as well."}
{"text":"Unfortunately this place has closed.

My wife and I were in the shopping center and Mashawi caught our eye. It had been some time since we ate Lebanese food. We were not disappointed. We decided to order a little bit of everything with the Mashawi Combo for two. We loved every bit of it and had our middle eastern bread basket refilled. The scenery was unique as it looked like you could rent the restaurant for events with laser lights and disco balls hanging from the ceiling. I know they cater as well. They are well worth a try. The chef came out and greeted us after we ate which was quite nice."}
{"text":"I recommend the generous Meza Combo which includes hummus, baba ganoush, tabouli and falafel!"}
{"text":"The food was fantastic, and generous...BUT, don't come in if you only have 30 min on a lunch break and you didn't call in your order. The food was made to order. It's worth it, however you'll be waiting for a while. 

Also keep in mind that the to-go menu prices are different than the dine-in prices. I've only eaten there once-tonight-so I can't tell you if they changed their prices after printing out their to-go menus. Their prices were pretty cheap considering the food we received. 

All of their platters come with your choice of rice or fries, salad or soup. I ordered the gyro platter with fries and an upgraded Fattoush salad (an additional 0.50 charge). While it didn't come with fries, it came with their rice which was pretty good so I didn't mind the mix up. 

We came with a party of 6 people, and everyone's order came out at different times. There was only 1 server and 1 cook. The server had to wait for the chef to cook everything by hand. It wasn't busy inside the restaurant, but they may want to consider hiring another chef once business picks up. 

To thank us for patiently waiting, the chef upgraded our salads from M to L at no charge. The lentil soup was yummy. They puree the lentils. Apparently the lamb dish was really good. The garlic sauce was heavenly.  I ordered some to go. The Turkish coffee was a little weak, but definitely good as an after dinner treat."}
{"text":"Good place.  I had the mixed plate of lamb, beef and chicken.  The dish was prepared quite nicely with seasoning and rice.  The Greek salad was also very good.  Was surprised at how not busy it was for luck lunchtime. I was worried at first but that was unfounded ."}
{"text":"The delivery options in my new neighborhood are terrible. I almost cried when I discovered Mashawi today! Finally a place I can count on for quality food.

I am in no means an expert on Lebanese/Mediterranean food, so I can't say much except that it was all amazing. I ordered the two person platter that Pepper T. also reviewed, and their review is spot on. It was all so delicious, we forgot to take a picture before we had finished it! 

Prices are incredibly reasonable, 21.99 for the whole heaping plate (literally overflowing), a huge salad, several pieces of delicious flatbread (homemade?), and 3 containers of sauce. We ended up spending just over $31 for the whole meal, due to delivery and taxes, which is honestly about how much I've spent for food for one person at other places! It would be even more affordable to eat in.

Delivery was fairly fast, and even though I unintentionally gave terrible directions to the delivery driver, he was super nice about it once we eventually found each other. I will definitely be eating from here again!"}
{"text":"Came here for the first time yesterday and as other reviewers have said this place is a local gem. Will definitely be back! Delicious Lebanese food and amazing service!"}
{"text":"I thought I was going insane when I swear this place existed but there was no sign. Closed?? Why?"}
{"text":"Holy shawarma, Batman! This place rocks. Nestled between a Chinese joint and Dollar Tree, I was frozen when I saw the photo in the window. Chicken shawarma is my favorite meal of all time. The place never seems to be too terribly busy. It's family run, and the younger men are pretty friendly. However, I brought my friend, who is a butch, and the older folks--the parents--refused to look at her, and only addressed me. Bummer. 

The food is tasty, from shawarma to gyros to house salad to basmati rice and tabouli. I'll just stick to take out or delivery from now on."}
{"text":"We had the sandwich combo for $6.99/person which came with a generous portion of fries and a soft drink. I had Shish Kafta sandwich and my companion had the Chicken Kafta sandwich. There was a long wait from the time we ordered until we were served, but they'd just taken a large phone order (8-10 people) right as we arrived. Service was attentive and glad we were there. The food was excellent so the wait was worth it and we'll definitely eat there again!"}
{"text":"Me and my Fiancee got the Mezza Combo (large size) and the Mixed Mashawi Platter for two.   So between all of that, we got...

Hummus, Tabbouli, Baba ghanouj, falafels, pitas, 1 Lamb kabab, 1 chicken kabab, 1 beef shish kafta, 1 chicken Kafta, 2 grape leaves, rice and a Greek salad (good size).  

To say the least, we had a ton of food, we had it for dinner, lunch for both of us the next day, and I also took some of the hummus & baba ghanouj to work as a snack.  You get a lot of good food for the money!  We dined in and it wasn't very busy but the service was excellent.  

If you like Mediterranean type food, give this place a shot."}
{"text":"This is the real deal - family owned Lebanese restaurant with amazing food.  Service was slightly brusque but the falafel was delicious.  It doesn't look like much from the strip-mall exterior, but give this place a shot.  You'll be glad you did."}
{"text":"Amazing, such a pleasant surprise. We ordered the baba ganouch and then the 2 person sampler. Everything was excellent, we couldnt stop eating. Oh yeah, and the baklava to finish it off (small, but tasty)"}
{"text":"We got the chicken kabob. They were juicy and full of flavors. Food looks fresh and tasted good. Will go again.."}
{"text":"Unfortunately, this little family run business with the best Lebanese food is now closed. Wishing you the best, and hope you reopen again with better service."}
{"text":"Chicken kabab was good. I tried a few things and it was all very flavorful.
The owner was very welcoming along with his family. 
The mother came out to make sure we enjoyed everything."}
{"text":"Based on my experience here, I found the Lebanese food to be very authentic! I have family in Lebanon and willingly concede that the food tastes like traditional Lebanese dishes that would be made by members of my family. I tried the falafel sandwich and was extremely pleased with the way that it was tasted. The hummus seems to be homemade which I think should be an absolute standard in every Arab restaurant. Furthermore, the waitress was pleasant and seemed to be in good spirits. My only complaint is that I wish the Lebanese music had been a bit louder. All I could hear when I was in the restaurant was the sound of a sports game on tv. :( Other than that though, my dining experience here was superb. :)"}
{"text":"It's always hard to figure out where to eat when you're new in town and have cravings for good food. This was the case in my scenario: being the nomad that I am, I moved into Phoenix for a short while and was looking for a place that served authentic Mediterranean food the other day. I ran across Mashawi Lebanese Grill using Yelp and I was SO GLAD I did because this place is such a GEM when it came to real authentic cuisine. 
I ordered the Mezza Combo and Meat Shawarma Sandwich with Fries, and every thing was made beyond my expectations. Like, yeah, I did read Yelp reviews so I knew it was gonna be good, but certain things was just like some other Yelpers described: the soft, warm pita bread went so well with the flavorful hummus, tabbouleh and baba ghanouj, and the shawarma sandwich was perfectly spiced, with the meat tender and well cooked. Even the fries were awesome, seasoned uniquely with (I think) paprika.
This place is now definitely on my list of favorite restaurants to eat here in Phoenix - can't wait to visit again! :)"}
{"text":"One of the best beef shawarma I've had. The meat was tender and well flavored and paired wonderfully with the tahini that accompanied it. The pita was thinner than a Greek style and had a crispness that made it perfect for heaping on the creamy and smooth humus that was the appetizer. 

The staff was friendly and the service was pretty quick. The restaurant was fairly empty, which was strange considering the quality of the food. But I did notice plenty of people coming in for take out. 

Highly recommend trying this place if you are in the area."}
{"text":"EVERYTHING WE HAD WAS DELICIOUS and we tried a lot!

This Lebanese Grill offers a platter or feast for two that cost $21.99

We got started with two generous fresh crisp salads that were lightly dressed with tasty flavorful dressing.

Soon our humungous platter arrives to us. We got....

one juicy tasty Chicken kabab
one shish kaita (lamb & beef)
one chicken kaita
one tenderloin kabab
Three house made tasty sauces
two crispy falafels
two stuffed grape leaves
fluffy rice
and flat bread

The kaitas had this delicious char on the exterior and the centers were seasoned with delicious herbs. they also were mouth watering juicy. The falafels had crisp exteriors and also were filled with delicious herbs. Everything was seasoned just so and everything was prepared well.

Service was friendly and welcoming. The dining room was comfortable and appeared clean.

Found a new favorite for my rotation!"}
{"text":"This little Lebanese restaurant of a gem was the best middle eastern food I've had in Phoenix in a long time (and there are many mediocre and horrible alternatives all over the valley). All Mashawi selections are perfectly cooked, fresh and delicious food as well as warm, tentative great service. We ordered a grilled combo for 4 which came with rice and salad and everything was perfectly cooked and delicious, the meat selection was tender and amazing. We also ordered the medium mezza which included babaganouj, hummus, tabouli and falafel and everything was excellent. We had so much food on the table and to take home. The grilled combo was very good quality of meats cooked to perfection. We also ordered kibbe which was very good and the tabouli was perfectly made. This will definitely be a place I will come back to next time I'm in town."}
{"text":"best middle eastern i've had so far in phoenix! not as consistent as i would like (have had the rice, bread, and garlic sauce served different ways) but haven't had anything bad. just grateful to find a spot where i can get toum."}
{"text":"I have ordered from this place several times with co-workers for delivery. I'm sure the food is usually great but by the time the food gets to us, it's cold. If they run out of an item you ordered, they don't call you back but replace it with something else without asking. They have also forgotten to deliver items as well. It seemed so promising but after our 3rd time ordering and being unhappy, we won't be ordering again. Which is a shame because they could have gotten a lot of business from our large medical group."}
{"text":"As a Palestinian I am very particular about arabic food. The food here is superb. The Baba Ganoush is some of the best I have ever had including the middle east. The hummus is delicious. We really enjoyed all the appetizers. The kabobs are very well done. Great place."}
{"text":"Very good - discovered this place a few blocks from our apartment and decided to give it a try.  My chicken shawarma platter was very tasty - portion could have been a bit larger for the price, but worth a try.  The hummus was delicious and had a creamier texture than I've experienced at similar restaurants in the area.  My wife ordered the shish kafta - I'm normally not a fan but the bite I had was moist and very flavorful, and I'd actually consider ordering it the next time we're there.  Her fries came dusted with a reddish spice (paprika?) that was an unexpected treat.

All around a good first experience.  Interior of the place was nice and they were super friendly.  Appears to be family run - service is a bit slow and they aren't all that organized, so I'd stay away if you are in a hurry. Given the proximity to my place, I'll definitely follow up and try them again for takeout."}
{"text":"Informal restaurant very good very tasty it's literally like homemade I guarantee that you will enjoy it if you're a little adventurous and you try different things."}
{"text":"The food was fresh and very tastey.  This is definately a gem of a place.  I will be going again."}
{"text":"The food here is really good.  The staff is very friendly, service is quick, and the place is very clean.  I would recommend this place to anyone that is looking for some Middle Eastern food."}
{"text":"What a delight !! Staff was great and so eager to please. The guests were telling the restaurant staff how great their meal had been. Ours was delicious as well!!  We will be back. Thank you. 

Went back the next day and it was fabulous again!!"}
{"text":"I order delivery from GrubHub and it always arrives on time. Always delicious, generous portions that taste like like a home cooked meal. Thank you!"}
{"text":"Got the Mashawi dinner for two here this evening.  You can't beat the price ($25) and it was pretty good. The side salads were made of wilted lettuce and the meats were a little dry, but there was plenty of food with good flavor - the falafel was amazing! I would definitely get just the falafel next time. Service was top notch. There wasn't anyone else there which always makes me nervous, but I would eat here again."}
{"text":"Most terrible food I have ever experienced. Their service was slow, no one was in there, the cook took forever to make simple meals, the meat tastes rotten, the pita bread tastes as if it had been sitting in their for 48 hours- could barley chew it. It was dry and hard. Said it is homemade that is a lie!! Their meat I could barley chew, it tasted like cat food- two other people described it as the same. Terrible food!!! Do not go!"}
{"text":"The closest I've found for great Mediterranean cuisine. The staff is always polite and lead you in the right direction for what your hungry for! Don't be fooled by the dining area, this is a great take out spot!"}
{"text":"I love this local ethnic gem in our North Phoenix neighborhood. We have eaten their food twice so far. Both times we ordered take out. First time we had the gyro kabobs and the second time I ordered the combination platter for two. It came with rice, salad, bread, and the three sauces of tahini, garlic sauce and yogurt sauce. The meal included 3 different types of meat, chicken and 2 skewers of ground chicken and a lamb&beef combo. 
I personally would have wished two of every sauce since the meal was for two people and also the meat and rice by themselves can taste a little dry in the mouth. 
I am dedicated to try more things off of their menu and maybe we will even eat there once and I can update my review on service and location."}
{"text":"Very good Mediterranean food and reasonably priced...food tastes fresh...good service. ..highly recommended"}
{"text":"The food is OK. We in for dinner and were the only table the whole night. Our server disappeared for a good ten minutes at one point. I had the grape leaves and they were not good. Not at all. The falafel was OK but we got the last of the batch and they were gray. The kitchen didn't have enough of the old batter and gave us a short order while they made more. So we were able to compare the old gray falafel to the fresh green falafel. But tried them again with delivery and ordered the gyro platter and a large side of rice. The gyro was delicious but the tzatzaki wasn't seasoned at all. The rice was cooked perfectly and was a huge portion. Tried them a third time, for lunch deliver, and they took my order just to call back and tell me I need to order more. Personally I feel a fifteen dollar minimum at lunch is a little high with a 2 dollar delivery fee. All and all I'll remember the restaurant is there but can't see myself craving it..."}
{"text":"This restaurant is so amazing. I come here once a week and am impressed every time. Authentic Middle East cuisine. It's not get busy and that's make me sad so people need to come here. Family restaurant and good service."}
{"text":"Excellent food!! Very clean. Decor is a bit strange (they have a disco ball on the ceiling). Highly recommend the sampler platter!"}
{"text":"This place is quite the hidden gem! I had no idea it was tucked into the goodwill shopping center until it came up as recommended on yelp! I have been twice, and both times the food did not disappoint and staff is super friendly. The first time I got falafel and Greek salad, it was so good that is also what I ordered the second time! Personally, I enjoy their greek salad because the dressing isn't too creamy, it's more olive oil based. I also enjoy that they use green olives instead of kalamata, as I'm not a huge fan of the latter."}
{"text":"I love the atmosphere.  Best thing is close to my home, food was super fresh, delicious and I loved the service.  The guy was super friendly accommodate my order and explain the menu. Definitely will be one of our go to places :)"}
{"text":"Nice place.  Only one other table in there at 715pm on a Saturday and I always question that but I wanted to keep my dinner under 10$ including tip.  Aftr chkn out next door Chinese restaurant Dragon, I went in to Mashawi.  I ordered the 4.99 gyro sandwich and a can pop which they will give u free refills(another can) cause they don't have a soda fountain but free unlimited cans, that was a nice touch, I have never seen that before.. The gyro was very good.  The meat was tender and not dried out with the tomatoes, onions and sauce.  It was alittle on the small side but it was only 4.99.  After tip and tax my total was 9.34."}
{"text":"Can I give 6 stars?
Lentil soup was great.
Salad was fresh and delicate.
Star of the meal was the gyro meat and Tzatziki Sauce was, hands down, the most amazing thing I've ever eaten. Moist, tender meat and the dill in the Tzatziki Sauce marry together perfectly.
Will absolutely be back.

That said, don't come if you're the type who demands perfect service. This is a family owned place and because of that, it can take a bit to get a refill or silverware but if you're willing to ask, they're more than happy to provide whatever you need."}
{"text":"I continue to be enthralled by the food here - so an update. I was raised in an extended family of first generation immigrants with mad Lebanese cooking skills; Ms. Bouzidi (she and her husband are the proprietors) in the kitchen - is their equal.  This past week, over a three day period, I binged again: baba ghanouj - simply the best I've ever had; the mixed grill platter - one skewer each of chicken, kafta and lamb kababs; with rice or fires ( try the fries!) and a salad or soup -  always enough for me to take some home.  With the weather getting warmer, today I opted for the laban (tart yogurt) and cucumber salad, and a gyros sandwich.  The gyros is stuffed with gyro meat - and tomatoes and onions, and smothered in a taziki sauce.  All their mezza (appetizers) will satisfy two; I like to order the kibbee, there is always a couple left for me to eat later.

The incongruity of sports on the big screen - European soccer, NBA basketball, or Sportscenter - with Arabic music in the background - works for me.  

Mashawi is a  ***** favorite restaurant for me."}
{"text":"We have eaten here 3 times now and always enjoyed everything.  The spices they use are just awesome.  The staff has aways been very friendly and very quick to serve and give suggestions.  This restaurant has just opened a few months ago it is worth giving a try."}
{"text":"Best place I've eaten at in a while, they deliver!! And also their food is all HALAL (which means kosher). LOVE IT!!"}
