{"text":"Best. Hummus. Ever.  Been here twice and we've liked everything so far. Kid-friendly."}
{"text":"Very tasty and the service was superb. Eating at Mashu Mashu is a personal favorite. Sooooo good!!!!!!"}
{"text":"Used to be good but I prefer Sofra Middle Eastern restaurant now. Their services are good and fast but unstable on keeping their foods quality, sometimes their meat/fish are slightly burned, dry or salad is not so fresh."}
{"text":"Never for delivery...... I recommend ordering Mashu Mashu for takeout only. The food is definitely quite good, but the customer service and restaurant environment leave something to be desired. i've ordered from Mashu for delivery to my friends house (who lives 10 minutes away) and the delivery took over an hour, on a wednesday. When i tried to place an order to my house , 1 block east of their delivery zone,  they refused my business."}
{"text":"Great value for the food. This has become our favorite neighbourhood joint. Any of the sandwiches are awesome for takeout. The salad with duck is pretty darn good if you are eating at the restaurant, but tends not to as good for takeout."}
{"text":"Mashu Mashu has delicious falafels. Green inside with fresh herbs, flavourful, a little spicy, and crispy hard on the outside and they don't seem too oily. The sandwiches are delicious - stuffed with cucumber and tomato salad. Also, their hummus is so fresh and so garlicy. Very recommended!"}
{"text":"After Shoom Shoom (Mashu Mashu's sequel) closed down on Bayview in Thornhill, I have to try out Mashu Mashu.  It is absolutely fabulous!  Very Casual, yet classy. Lots of noise and buzz.  I ordered their Kefta Kabob dinner. What I loved the most was how you can choose your side salad. Not like most restaurant where they give you a standard house salad. I would say there were at lease 7 salad options. I chose the Mashu Mashu salad which had a sweet balsamic dressing with goats cheese. I have been craving that salad since I finished my meal.  Defiantly returning in the near future."}
{"text":"Hands down best Mediterranean food in the city. Everything is made in-house; the dips are made fresh, vegetables cut by hand, soup made my scratch. All of it. It's amazing food especially for the price. I go here at least once a week and have been eating the food here for almost 3 years without a single complaint. The fried eggplant and Mashu Mashu salad are two of my person favourites, and don't forget the lentil soup!"}
{"text":"Really good middle eastern food. Roasted eggplant is the best I have ever had."}
{"text":"Pretty decent middle eastern cuisine. Not a bad choice for the selection of reliable eats in the area, but I still wouldn't consider this my go-to restaurant in Forest Hill. On the pricey side for simple foods. I would be back if I wanted reliable, home cooked food."}
{"text":"Mediocre at best if you're a downtowner, and probably more appealing to suburb dwellers who might not be as familiar with the true gems of the core.  Nothing here struck me except that it was way over priced : the service was very shoddy and slow, the food was nondescript, and the restaurant was filled with noisy, entitled acting, and very inconsiderate guests.  The whole thing was a turn-off. I'll never waste my money there for a third time."}
{"text":"Great food: Their Shawarma sandwich (lunch only) is the best in town. The Mashu Mashu salad is great too. Overall food is great. A little gem in the Forest Hill village.  Ambience: 3/5 (Nothing special)  Food: 4/5  Service: 3/5 (Friendly) Value: 5/5  Repeat: Definitely for the shawarma sandwich :)"}
{"text":"Good portions, good food not overly priced in the heart of forest hill village.  Excellent lentil soup"}
{"text":"So mediocre, bland, and overpriced, this place is the perfect match to the forest hill clientele."}
{"text":"Had the chicken shawarma plate, was pretty healthy. Only reason I give 3 star is because of the service."}
{"text":"We've been really disappointed by Mashu Mashu the few times we've gone.   Nothing horrendous happened, but the food is mediocre, expensive, and the service has wavered between ok and dreadful.   The only thing I'd recommend is their baba ganoush and hummus, as takeout. Go next door to The Kitchen Table to get pitas, though."}
{"text":"I dont know what has happened to Mashu Mashu, but i used to love it back in high school. I came here last night and I feel that it has totally gone downhill.  After being seated, the waitress came right away and we gave both our drink orders and meal orders. Somehow, she totally forgot about my drink or the fact that we ordered a hummus. We only got it at the end of our meal.   The mashu mashu salad however is one of my favorites. Too bad it gave me a horrible stomach ache after. I hope they don't leave the goat cheese lying around!! The schnitzel was good and once I finally got my lemonade virgin mojito, I was happy I ordered it in the first place.   Step up your game mashu!"}
{"text":"I attended a private Birthday party here, so the whole restaurant was reserved specifically for that purpose.   Firstly the biggest problem I have with this place is the decor, nothing about it is cozy, sitting on wood chairs really is not pleasing.   Their menu is overpriced for dishes that you can also get at many many other Mediterranean restaurants, but I guess their rent is higher because of the neighborhood?   Anyway, the best thing I had here, and I mean the best is all of Toronto is their Babaganoush (eggplant dip), you will not taste no Cesar salad dressing in this dip my friends!   I believe they also have a small patio?"}
{"text":"Always one if our favorite a Middle Eastern spots in Toronto. Love the new avocado spinach salad and topped it with delicious grilled chicken.  Say hi to Matilda and Enri, they are terrific hosts."}
{"text":"Food is hit and miss here.  Sometimes really good. Other times meh. Adding garlic really can mask almost any flaw.   If you decide to do take out, DOUBLE CHECK your order.  They are notorious for conveniently forgetting something.    For a restaurant in the village, you'd expect more and yet here we are."}
{"text":"imagine a dark haired woman, toiling away in her kitchen, bent over a bowl filled with food staples of a thousand generations. a wisp of her dark chocolate curls consistently fall in front of her eyes, her fingers too speckled with bits of cilantro, lemon juice and chickpeas to whisk it away, as she, with as much of a smile as she can muster between those errant locks of hair,  silently watches her mother juggle a recently fried falafel ball in her hands.  one bite could send her back to the drawing board, as it were.   cool enough to the touch now, her mama crunches through the crispy rough framework of this ancient timbit, purses the fingers of her other hand together forming a peak, and while waving her arm back and forth like a comforting nod, says with a smile,   \"Mashu, mashu.\"  any israeli who has any similarly breathtaking experience will, without hesitation, speak those words in response to her elation.  literally translated mashu mashu, which in and of itself is already a bastardization or a slurred version of the real words which make up this phrase, means \"something something\".  the essence of the phrase is essentially \"isnt that something\", as in isnt that incredible.  surely this phrase was repeated either in adoration of this ancient food or this restaurants version of it.  either way the phrase is apt.  ive been here many times and though you do have to wait a while sometimes to get a seat the food will pay off.  this is the best mediterranean restaurant closest to downtown.  all the middle eastern places downtown are indeed fast food places that for the most part pale in comparison.  their food is not as fresh, nor as plentiful.  the salads here are meals in themselves.  traditional ones are israeli salad and tabouli salad with well made standards like caesar and greek.  you can also get a number of kebabs, a fish entree and a handful of well made traditional middle eastern appetizers and dishes like hummous, tahina, fried eggplant, eggplant salad, and varying lamb dishes.  this place still is not my favorite.  that honour goes to Sababa way further north - http://www.yelp.ca/biz/sababa-restaurant-thornhill - they have more specialties, but this place is quite good and being the only real place to get this kind of food done well in close proximity to a relatively jewish area, its no doubt why its always packed."}
{"text":"If you would like your tooth to be potentially broken by bones found in chicken shawarma, go ahead and eat here.  The food is nothing to write home about.  The service is not with a smile.  And yes, I found a bone in my chicken shawarma lunch plate and instead of offering to comp my meal, the waitress told me she was a dental assistant and merely asked me if I had pain in my teeth.  I was appalled at the lack of genuine concern.  I even asked her if there are bones in chicken shawarma knowing full well that it does not, and she did admit that bones are not typical in that dish but can occur.  WOW.  Put a frickin' notice on that in your menu then.  I just broke a tooth.  I don't need to break more.  Never going here again.  One and done."}
{"text":"I tend to think it's pricey but people have disagreed with me about this.  Chicken skewers and lentil soup are the best thing on the menu."}
{"text":"this is a very mediocre middle eastern grill.  the food is ok, but nothing special. there are definitely better middle-eastern restaurants than this. check out Me-Va-Me or Sofra Grill. both of these places have much better food for the same price range.   the service was ok, but the waitress forgot several items that we ordered. she even brought the wrong main course!"}
{"text":"This place isn't so MASHU MASHU (something something). I thought the food was mediocre at best. They did try their best to make it look as appetizing as possible. The service is good usually but sometimes the food lacks a lot of flavour. I was really hoping for some quality HUMMUS."}
{"text":"This place has fresh tasty food but the portions are getting smaller and smaller. First the appetizer mix got downgraded to smaller containers and now my pita sandwich contains half the ingredients! The portion for the pita sandwich does seem to depend on the sandwich maker... there's a new guy who is very stingy. He carefully inserts teaspoon amounts of veggies into my pita and if I ask for more it's another teaspoon. He searches for the thinnest sliver of a pickle for my garnish. Oh boy. It's starting to feel like too much money for too little food. Too bad."}
{"text":"A-OK is probably the right word for this restaurant.  I'd probably give it closer to a 2.5 but overall it was a decent experience.  The food and portions are actually quite good, however a bit overpriced for what you get and compared to other similar restaurants. Service was lacking, friendly but really slow and the restaurant is decent, nothing special.   I went with the two skewer chicken shish kabob dinner, hoping for leftovers for lunch the next day and it was around $22, plus I upgraded the salad for $2 to one of their specialty salads, the avocado spinach salad which was fresh tasting and loaded with goats cheese, avocado and strawberry, the portion was good for a starter salad. We then waited for probably over 30 minutes for our main dishes to come. In between that time, we actually had a server come out to try to give us our salads again, it seems that our order was duplicated for whatever reason. Finally after asking the waitress where our food was, it came. The portion, again was large for the chicken; I did get my leftovers! The rice was a small portion, which is strange as it's the cheapest part of the meal and it was sprinkled in some sort of sour spice (sumac?) and almonds or nuts. I'm not sure i'm a fan of nuts on my rice, I also wonder about people with allergies as it's not mentioned on the menu. This might be something to add to the menu or alerted to customers. On the plus side, the chicken was all white meat, tender and delicious. We also tried the fried eggplant salad which comes with pita, the pita was actually a bit stale tasting, maybe it was over toasted and the eggplant was decent but sweeter than I'm used to.   On a Sunday night there was a bit of a wait, it seems to be a popular spot among the neighbourhood. The service wasn't great, our waitress seemed flustered and uncommunicative when our food was taking so long to come out, and other tables were getting their food before us even though we had ordered earlier. We were double served our salads and she just seemed really confused when we told her we had already gotten and finished our salads about 15 minutes earlier.  The restaurant is casual and clean but not all that notable. The tables are quite close together but it's not overly crowded feeling. We were sitting near the entrance which might get uncomfortable if there are lots of people waiting for a table.    I think i'd prefer choices like Sofra or Me Va Me for this type of food, it's a few dollars cheaper and I find the food and service to be a bit better. Definitely not worth the $120 or so for 4 people."}
{"text":"There's an old saying: \"If you can't bring Mohammed to the mountain, then bring the mountain to Mohammed\". If you substitute \"Shawarma\" and \"Forest Hill\" you get a good idea of what it takes to succeed in the restuarant business in this part of town.   Mashu Mashu opened about a year or two after I moved into the area, and judging from the crowds at lunch and dinner, it will remain long after I have left. It's a family place. Tables are overhwelmingly multi-generational, with the exception of a few middle-aged daters (and maybe one or two actual Daiters in the mix). Noisy, but in a fun, lively kind of way.   The space is neutral, the chairs comfy, the builder's beige walls set off by some of the ugliest restaurant art I've ever seen. Art work answers the long-asked question \"what would happen If  Pollock, Basquiat and Bubbles the chimp got together for a threesome at the vomitorium\". Thankfully the food is much better.   Overrtaken by Zoomers and new moms at lunch, Mashu Mashu promises and delivers good value. In and out for about $10 and an hour of your time. you have a choice of grilled cubed meat, sliced rotisseried meat, falafel and a host of dips. Salads are always healthy and generously portioned; a shame that dressings tend to commerical sweetness.   The caesar is pedestrian, near-soupy unless you ask for half the regular amount of dressing. Greek salad fares better; a decent dusting of feta on a basic blend of iceberg, tomato and cucumber. A stray pepper or olive may land on your plate if you're lucky. The Mashu Mashu salad is better; it adds the crunch and temperature contrast of toasted nuts, and creamy goats cheese to overplayed designer greens.   Falafel is damn good. Crispy chickpea fritters are almost molten inside; sharp with cilantro, parsley, cumin and chili bite. Creamy tahini, airy hummus and crunchy veg both pickled and plain make for a superstuffed sammitch. A side of french fries is oddly among the best I've had in the city. Almost as golden as the falafel themselves, they're super-crunchy outside, sweet and puffy inside.   Mains are much less consistent. Chicken breast kabobs arrive moist and well-seasoned at one sitting, dry and cold the next. The portion is huge in any case. Ditto for Shawarma, which is either e-cumin-ical chicken thigh deliciousness, or prone to dryness and occasional bits of cartilage (with all due respect to other cultures, once I get a mouthful, or rubber-crunchy cartilage, I'm done eating for the evening). A trio of kafta sees three very large, very dry, very salty free-form sausages sharing the plate with properly-cooked basmati rice and fresh but uninspired broccoli, carrots and cauliflower.  Vegetarians might enjoy the random items in the vegetarian plate, but other than a block of feta and smoky marinated eggplant, you're better off with a salad and a few dips of your own choice.   Service is generally pleasant, ranging from distracted to attentive. Water is refilled, but coffee requires repeated requests. For a shawarma joint, it's a rich, bottomless cup; fair competition for the multiplying chain coffee shops that dot the Village.  As part of the current wave of middle eastern restaurants, Mashu Mashu is middle of the road. The fact that the road in question winds through Forest Hill suggests that what corned beef and pastrami were to my forefathers, shawarma and falafel may be to my unborn children."}
{"text":"I had lunch here twice when I was working at a building close by; it came hightly recommended, however, the service I found to be not so friendly and kind of slow ( they also didn't seem overly apologic for this by the way ) the chicken souvlaki however was FANTASTIC, but the cucumber and tomatoe salad on the side was kind of bland; also could've done without the side order of chest and attitude from our waitress; seems as though she is one for the boys...meow..."}
{"text":"Arugula duck salad is amazing!  Staff is friendly and the food comes quickly and it was all well made.  Would recommend for a nice casual evening out."}
{"text":"The food is delightful. Had few times and was very happy each time. The Falafel is one of the best in the city and my husband loves the chicken shawarma and chickpea salad. The biggest downside is the horrible staff. People are rude and not helpful. Everyone seems confused. Would never eat there but it's a good place for takeout. Would rate the service 0 but the food a Solid 4"}
{"text":"Went here with a few co-workers for lunch today.  The food was good, nothing spectacular. My coworkers thought the same. I ordered a chicken shawarma plate which came with chicken, a big serving of hummus (very tasty), tzatziki sauce, cucumber/tomato salad, and some bread. I was honestly expecting a larger portion size - I guess I'm used to feeling super full after eating a shawarma plate from other establishments. The serving size left me satisfied.. but I was definitely still hungry so I just ate some more bread with the hummus I had leftover. I was expecting more toppings as well - other places I order shawarma plates from usually pack the plate with everything (i.e. turnips, tomatoes, lettuce, sauce, sometimes fries, etc.).  The food was good overall but I was definitely yearning for some more for what I paid. If you're looking for a shawarma or a shawarma plate, this place probably won't satisfy you.   If you're into spicy, definitely ask for the hot sauce! I believe it's house made - it had a nice kick to it."}
