{"text":"The cooking tables are great but if you really want the best fried chicken in all of Central Illinois look no further make sure to get the sauce on the side and dip at your leisure but you got to cover it up with all that yummy red sauce but if you get it to go get the sauce on the side or else when you reheat everything Will get soggy."}
{"text":"Only Korean BBQ in town. You grill your own with an electric built-in grill! The food is fabulous but service may be slow! I will definitely come again if we we ever get the check!"}
{"text":"Having been to Korea before, I was really excited when this place opened.  I can confidently say that Masijta grill is the real deal.  Flavors of the BBQ and bi bim bap were spot on with what I experienced during my trip.  As others have noted the service was on the slower side, however it was never that bad.  The servers themselves were polite and friendly.  My biggest issue (but still a minor one) was with the timing of the food.  We ordered egg rolls with the BBQ portion of the meal, but those came well after the main course.  Again, not a big deal but odd.  We'll definitely be back."}
{"text":"Masijta is our favorite Korean restaurant in town and we've been eating here quite often since the day they opened. It's a little small inside but when the weather is nice, we enjoy eating their delicious food in their outdoor dining area.   They always serve you about 5-6 side dishes (sometimes 7 like last time we were there) such as kimchi, fish cakes, seaweed and danmuji. The menu has different sections, namely appetizers, bentos, bibimbap, soup, stir-fry/teriyaki, grill and hot pot and I can easily name some delicious items in each section. For appetizers, I like their kimchi pancake and seafood pancake (though their pancakes can be a little inconsistent in terms of quality). Gyozas and fried chicken are both pretty tasty but can be a little greasy. My most favorite main dish here is beef dolsot bibimbap since it has plenty of healthy vegetables. Their bentos are really good value and my pick is salmon teriyaki bento. For soup, I usually get galbi-tang which is a hearty beef short rib soup and is not heavy at all. We sometimes have grilled marinated beef short ribs and pork belly and though I like it, I don't like that my clothes and hair smell so bad after eating. I've only tried bulgogi hotpot and find it a little sweet but pretty tasty. It has lots of meat, glass noodles and vegetables and can probably feed 3 people.  Service can be hit-and-miss, depending on who your servers are and how busy the restaurant is. The owner lady is friendly and always greets us with smiles whenever she sees us."}
{"text":"I went to this place after checking yelp reviews. This place is very new, so give them a chance! They are a bit slow. Not sure if it's just me, but I have noticed that all korean restaurants I have been to (and I have been to plenty from different cities) are slow at making their dishes.   Overall I had a pleasant experience there. The waitresses were very friendly. The food was decent. I will go there again soon."}
{"text":"Really great Korean bbq! not super cheap but delicious. i love ths pork adnd fired chiken"}
{"text":"Great food. Friendly staff. Restaurant is very clean and well arranged with plenty of room. All food is cooked to order and came to the table relatively fast. Recently opened business but doing great do far. A+"}
{"text":"Best Bibimbop and soondoobu with seafood in CU. I used to live in the LA area and when I moved back to the midwest I was not able find a really good soondoobu in town for years, until this place opened. They serve 5 side dishes with the entrees, and all of the side dishes are delicious. We have been here more than a couple dozen times and each time the wait staff is friendly and happy to do refill a side dish for free. The restaurant is small, clean, and minimalist looking. For best spicy chicken bulgogi, I would go to Star Karaoke instead, but it is more like a dive bar, with vinyl chairs and radio music playing."}
{"text":"Came here for a birthday lunch over the weekend.  The Good: -The Salmon Teriyaki is very good, I enjoyed every bite, as I did with most of the items in my bento box. -My SO enjoyed his stew, although he would have preferred it not served still boiling at the table. -All of the accompaniments with the meal (kimchi, etc.) were pretty good.  The Meh: - The service was okay. The two people there were very nice, but I had to wait five or so minutes before I was able to flag someone down to ask for forks for everyone, and it's a pretty small place. It also took a bit for us to get the bill. -I really didn't like the dumpling that came with my bento box. This is a personal thing, but I really expect a good dumpling if it's on the menu.  The Bad: -Not really anything.  Overall: I would recommend this place to people who like korean food, and for the amount of food you're getting, the prices aren't bad at all, especially with the lunch specials."}
{"text":"There was a big chunk of chilly powder in my glass of water!  Urghhhhhh so gross!!  And the owner didn't even apologize!!!  Terrible hygiene, terrible service."}
{"text":"This place has amazing food, especially the tempura/fried foods.  The bento boxes are huge, the meats are flavorful, and the meals are tremendously filling.  Everything tasted fresh and I look forward to coming again to try their fried chicken.  The servers were also really nice and attentive, and the atmosphere is great, a comfortable, home-y feel.  Definitely felt at home here!"}
{"text":"Badly understaffed when we went. One guy seemed to be the only waiter, the host, and the cashier. We left after not having our order taken for 20 minutes (not even a drink order) and being ignored when we tried to flag the guy down. It's too bad, because the place was clean, the decor is great, and we were looking forward to using the brand new grills in the tables.  Hopefully they figure things out, and I'll give them another chance in a few months."}
{"text":"The restaurant started well. Very good bulgogi and Korean chicken, an attentive lady owner who used to make sure things went well. Not only did I visit often, I brought the place lots of business by recommending it to friends or even inviting them there.  Been there with my friend yesterday for lunch. Got the bulgogi again.... we didn't even go for the cheaper lunch special option, we paid full price - which is not exactly cheap. Atrocious quality meat - nobody expects fillet mignon in a Korean marinated beef dish, but to have more cartilage than actual meat, making it hard to chew and impossible to swallow, made the experience akin to consuming dog food. The waiter just didn't care, he was a completely untrained young guy who made no effort to help the customers.   Nevertheless, the bill included the \"suggested 20% tip\" number, the percentage calculated including the tax as well, which is a bit rich. We paid, we didn't complain, but, given the extraordinary wealth of restaurants Chambana has to offer, Masijta just disappeared from our map.        Definitely a one star experience. I give it two for the sake of the old times. If they don't revise their practices expect this place to close soon."}
{"text":"Was looking forward to trying this place out. I love this type of food and friends have had good experiences. One star is generous as I can't even give a rating for a glass of water as we never even got that. Was quickly seated but waited over 10 minutes for someone to acknowledge us and take an order. Two other tables that came in after us were quickly addressed but each of those groups were all Asians. Finally got an order placed but our drinks still hadn't come after  another 15 mins had passed.  Wait staff were hitting all the other tables numerous times. Again all or majority Asian groups. We finally had enough and walked out. Courier Cafe across the street was more worthy of my money. Busier but we had our orders placed and drinks on the tables in less than 5 minutes.. and hot food 10 minutes later...as it should be."}
{"text":"Masijta means \"it's delicious\" in Korean.  I went here with some friends shortly after it opened for BBQ dinner. Everything was very tasty. They brought out a small iceberg salad to start and 4-5 side dishes. The menu overall was a bit on the pricier side, but I guess it depends on what you're used to.  There were some hiccups in the food/service, but I think this was because they had recently opened and were still figuring things out. The owner was apologetic and gave us a kimchi pancake which was good.   When ordering meat for BBQ, it's hard to estimate how much people will eat. The waiter suggested we order one meat for each person. (This would have been too much for our group of 5.) We opted for two meats and a couple appetizers and rice (which doesn't automatically come for every person). You can always order more meat if you find it's not enough. Their BBQ meat servings are smaller than what I'm used to at other Korean restaurants.  The waiters weren't super attentive; you should feel free to call for their attention, to ask for more side dishes, etc.  The restaurant is clean and nicely decorated. This is a great addition to downtown Urbana.  Food was great. 3 stars is taking into consideration food and price."}
{"text":"Best Korean restaurant in Champaign-Urbana. Foods taste really great with friendly prices. Grilled meat is my favorite cus you can do BBQ at your own table. We ordered boneless short ribs, octopus and pork belly. Friendly price. We ordered a lot: two orders of grilled meat, one spicy soup,!one noodle dish and they cost about $23 per person. Will definitely come again."}
{"text":"I've been here 3 times and the food has been great every time. The service is good, but it sometimes feels as if they are hurrying you along."}
{"text":"Went here yesterday and was very shocked about how great the experience and food was. I have had Korean BBQ across the country and I would definitely say this is one  of the better Korean BBQ experience, especially for Champaign (since there isn't a lot of options for KBBQ). The all you can eat option was so plentiful that after one plate full, we were immediately in food coma. Food was delicious and the meat was very  high quality, especially the galbi and the Bulgogi."}
{"text":"Masijta is a great casual place for traditional Korean cuisine with a calm and polite atmosphere and service. My friend and I came here for lunch together and we had the dol sot bi bim bap with seafood and the one with bul go gi. We were eyeing the table of bbq a group of Korean girls were having behind us and thought how fun it would be to come here for a big group. If you get bi bim bap be sure to let the bottom sit a while undisturbed so you can get the crispy layer of rice on the bottom :)  the bul go gi was perfectly seasoned and very delicate, very little fat on the meat and was a nicely balanced large dish overall, served with lots of different banchan. The serving sizes are huge here. I even had to take half to go, although I went in hungry!"}
{"text":"It's nice to have a Korean place in Urbana and off-campus.  Often not too busy, though it's downtown just off the main drag.   Friendly, fast service.  Been there a few times and have only tried the bi bim bap hot stone bowl and the kimchi pancake.  There is a bit less variety to the sides, compared to (B-Won or Good Fella), but they're still great.  Even though there was something about vegan/vegetarian options posted on the chalkboard near the entrance, I wasn't confident that the server understood when asked about vegan options.  I'm sure the kimchi contains fish."}
{"text":"Good food , great service normal price, fulling took the galbi beef and grilled teriyaki salmon , beef was very good, salmon was good, get kimchi as an appetizer"}
{"text":"Food was OKAY, but their service was miserably bad. They were so busy that they ignore people's request, and if you're non-korean, they don't give a fuck about you. They basically threw our food on the table and moved on without even looking. After we were mostly done, they did the same thing! Slapping the check to our face as if they want us to leave ASAP because the table were filling up. Oh my goodness. I understand that they were busy at the time, but the way to treat your customers like that is unethical. Hire more workers rather than just having two (one being the boss himself), and the one being rude is the boss, ironically. It ruined my day and I would never go back again."}
{"text":"This place overall was really great. I'm making this review short and sweet.  I had Bulgogi. My dining partner had Bulgogi Dolsot, and we shared the kimchi pancake. Everything was excellent.  Service was fast and super friendly. The place was full of people who seemed to really enjoy their food.   I'm not sure it's fair to compare this place to K-bowl, but the ambience, service, and food was much, much better in my opinion."}
{"text":"I have a hard time finding Korean restaurants in the US that can match the quality of food in Korea, but so far, most of what I have tried here has gotten close. Overall, the quality of food is pretty good, but they need to get better kimchi for the side dish. One thing that I absolutely love about this place is that I can substitute the mixed meat in kimchi jjigae for tuna; it's a fantastic combination especially with beer."}
{"text":"Lunch bento box is awesome!! This place is clean and the service is nice. I enjoy dinning here! Food is over my expectation!! Will come back soon!"}
{"text":"I understand that Korean restaurants aren't known for their service (I say this as a Korean person), but this place was really terrible. When I alerted the waiter that the lettuce in my salad was brown (i.e., old), he blankly asked me, \"So you don't want it anymore?\" Eventually the waitress brought me another salad, which was still brown. It took a really long time for me to get water and banchan before my meal even though they weren't particularly busy. As for the food, on the whole it is too salty."}
{"text":"Being raised up in city of Seoul, I am Korean from the waist down. Hence, when I first came to Champaign, I was utterly disgusted by the Korean restaurants here; they used msg, had marginal service, and were overpriced. I started cooking just because I needed Korean food now and then and I couldn't bare the restaurants here. But today, I got to taste something different from this newly-opened restaurant called \"masijta grill.\" Their choice of meat for Barbecue was excellent; the meat was fresh and was cut right. The soon-tofu soup with intestines were far from the competitors' in that they actually used properly made stock, instead of the \"msg frenzy.\" The attendents were eager to serve us--I didn't even notice my cup of water being filled up occasionally. They honestly told us how they got the ingredients and asked us how the taste was like each time the dishes came out. I could feel that they wanted to get a good reputation as they are starting their business out and they were quite successful with it. The effort must stay the same, but as of now, when someone asks me if there's any good Korean restaurant in town(or let's say a Korean restaurant that is worth going to), I would pick Masijta Grill with no hesitatioon."}
{"text":"Food is about as much as you would expect. But with a server throwing silverwares and menu on the table, it gets very hard to enjoy your meal."}
{"text":"Had the dolsot bibimbap, which was terrific, my wife had the bulgogi, which was likewise delicious. The dumplings as appetizer were likewise very good. One of our new favorite restaurants."}
{"text":"I ordered the spicy chicken gui on the grill. It was very delicious. I went with a group of 7 and they were very accommodating to us. The staff was friendly. I will come here again for sure."}
{"text":"This place definitely hit the spot! The restaurant was small but nothing that was elbow to elbow with other tables. The tables alone were small esp for a Korean restaurant. We could hard fit all of our food on our table but managed just fine.  Friendly waiters and they brought out our food pretty quick! The food we delcious too!!   Great experience and yummy food! I'd come here again!"}
{"text":"Overpriced. 500g (~a pound) of Korean BBQ regardless of what meat you eat should never cost over $50. In addition, the side dishes that you get (pickled radishes, seasoned radishes, kimchi, fish cakes, etc.) are average at best. Could be because there's not a lot of decent Korean restaurants in Champaign-Urbana giving them no competition. Having grown up on the west coast, where k bbq places are more accessible than here, I may be a bit biased. Nonetheless, I cannot deny the fact that this was the most overpriced k bbq place I've ever been to."}
{"text":"This restaurant truly met our expectations!! If I can't have homemade Korean food, this is my next choice in CU!! Cute little place, very clean, amazing, fast service.  We ordered a TON of food for 2 people and it came so fast!! The bulgogi and rib stir fry was delicious and no end to the sides, some new ones I hadn't had before even.  Delicious accurately describes this food and we will DEFINITELY be back!!"}
{"text":"The banchan are varied and are never in short supply, which is one major thing this restaurant has going for it. The decor is nice and the location is pretty great considering its near ample parking and just off the major bus stop. However, the food was less than spectacular. My friend got the bulgogi which was cooked thoroughly, but was not especially tasty or well made -- could have gotten a similar dish elsewhere and had it taste basically the same. I had the jjajjjamyun which had a great sauce, but the noodles stuck together quite a bit and the pork was a bit tough. Our server was courteous, and brought us everything we order, so no complaints there. As it is, it's a standard Korean place but for the price, I would have expected a little more."}
{"text":"I had this place bookmarked for a while, and I'm so glad I decided to try it out before leaving campus. Overall, my visit was a very pleasant experience. The staff were all very nice and helpful. We ordered off the grill menu and selected five different types of meats: sliced duck meat, beef short ribs, beef brisket, sliced lamb meat, and marinated beef slices. The order also came with rice, soup, assorted veggies on the side, and two different type of sauces. They kindly started the grill for us, and the owner would check on us every once in a while to provide tips on how to best grill each meat. The beef short rib was by far my favorite of all the meats. In general, everything was very fresh and delicious. This place is on the pricier side for a college student. Each meat selection serves one person and ranges from $21-$25.   They also have a 20% off beef special on Sunday. However, since it was Mother's Day, the discount didn't apply. I assume that's the case for most major holidays."}
{"text":"My daughter is a vegetarian so we picked this place on our road trip since it had many options for her.  Imagine my surprise when her vegetarian bento box had two options that were meat!  The waiter also did not like what I wanted to order and basically told me to get something else.  Huh?  On my own I would give it 1-2 stars, but my husband and son really liked their orders, so I bumped it up."}
{"text":"had soba with porkbelly, $11. was good. not fresh soba. was store bought. three stars because the noodles were not made in house. that is all."}
{"text":"First time eating Koren food. Food was great. Service was good but they were a little overwhelmed. What can you do? Go here on a Monday or Tuesday might be a little better idea."}
{"text":"I had the bento box and it was a ridiculous amount of food.   The waiter talked me into getting curry rice bento box (12.99).   It came with salad, 4pc maki, a gyoza, a chicken wing, 3pc tempura, kimchi, curry rice and tonkatsu.....and soup.  Everything was great except the curry rice....it was very bland and tasteless.  I had a lot of food leftover but couldn't take it with me because i was't going straight home for 6 hrs....The service was great....attentive but not overpowering. I'd definitely go back but maybe try something a little bit smaller."}
{"text":"I love Korean BBQ and could find the best at Urbana, IL. A lot of Asians including Koreans visited here.  Quality: 5 stars. I often visit Korean restaurant around DC and MD area, but this restaurant served the best dishes in the US for me. Protein soup might be a little bit smelly for American people.  Volume: 4 stars. Good to share all dishes for 2-3 people. We ordered 3 BBQ, one cold noodle and one pancake. They served complimentary rice and appetizers.   Price: 5 stars. Price was $115 including tips. We also ordered some alcoholic drinks and soft drinks. Really reasonable.  Staffs: 5 stars. Friendly, polite and quick.  Atmosphere: 4 stars. Clean, but old. You might be smoked because of BBQ grill. You should not put on formal wear.  I hope to be back when I visit Champaign again."}
{"text":"I should have visited Masjita sooner :) I had the Seafood Soon Doo Boo on a cold, rainy day, and it was so comforting. Just the right amount of heat, with soft silky tofu, and the seafood was not over cooked. I've also had the Korean BBQ (lamb and short ribs). The lamb was sliced very thin, while the short ribs were marinated in some tasty sauce. The Korean BBQ came with rice, lettuce to wrap the meats, soup, and two sauces. Masjita also has interesting side dishes (like marinated hard boiled egg, pancake) that vary during each visit."}
{"text":"Great service,  very nice staff.  I enjoyed the food, and the atmosphere was very friendly.  Good location,  sparse but tasteful decor. Also vegetarian friendly."}
{"text":"The JJampong is really the best in town. Definitely worth it, even though it does cost more than other restaurants. After having theirs, I can't go to other places anymore.  The kalbi is very expensive and overpriced but the marination is just like LA kalbi, it is very good. Is it worth getting? Only if you have lots of money to spend or really craving LA style kalbi. It is the best marinated kalbi in town though."}
{"text":"What a fun experience! I've been here several times and I love cooking my own food on the grill in the table. I've tried the bento boxes as well and those are pretty good. I have only tried spicy items and none have been spicy. On my next visit, I may see if they can kick it up a notch.   There is a minimum of two dinners when you want to cook at the grill even though one could feed two people. This is a great spot for a small group or double date. Two dinners is plenty for 4 people and it's a lot of fun cooking your own meat and veg and then adding the toppings of your choice."}
{"text":"I was very excited to hear there is a KBBQ place for us to check out. Its about 1hr away from us but we had to check it out. Originally from LA, I literally used to go to KBBQ at least once  a week. Unfortunately, my craving for KBBQ was not satisfied. The sides that come with the meat (we did the grill) were ok - i was looking forward to some kimchi but they didnt have any. We ordered the boneless short ribs and galbi - both lacked a bit in seasoning/marinade. I did really like the Japchea (glass noodles). I'm a huge ran of KBBQ steamed egg but theirs lacked salt. My biggest KBBQ pet peeve is when staff comes and tries to cook for you by randomly coming to your table and moving the meat around on the grill, which happened here."}
{"text":"Lovely authentic Korean place. We had a spicy beef soup (Yook Gae Jang) that came with 8 accompaniments including sprouts, kimchi, assorted vegetables and noodles, and giant Asian radishes, thinly sliced (4.5/5 - wished it had more of an umami taste, but the spice was perfect).   We shared the soup, and ordered the Bulgogi roll as an appetizer (3/5). My boyfriend, who hates sushi, ate nearly the whole roll by himself. It was served partially warm, which was nice.   We also ordered the short ribs as a side to the soup. This does not come with additional rice, since we used it in the broth, as someone would do with a traditional soup. The ribs were delicious, well-marinated, and a combination of sweet and savory (5/5)."}
{"text":"A must-go place in Champaign-Urbana if you want to have real Korean grill. The service is good; they'd grill it for you and make sure the food won't get over cooked. Not as good as something you may find in bigger city like Chicago, but definitely the best in Champaign-Urbana. A little pricy, so I only go there occasionally and always go with my friends."}
{"text":"I had the Pork set dish with curry rice.  The pork was a bit dry and was lacking a bit of spice and salt. Loved the fried pork dumplings and coleslaw.  If you're dining alone and want to try the grill you might be in for a disappointment as there is a minimum requirement of 2 orders for the grill.  I would like to go again with a larger party just to try the grill."}
{"text":"Love atmosphere here! The table grill is super modern, but the store is homey. Had the Budae jeon g, and even tho the 32 dollar stew was labeled for 2 it easily fed 3. I would say a little overpriced overall. But yummy!"}
{"text":"I called the restaurant ahead of time to ask which meats were marinated in sesame oil due to my sesame seed allergy. They informed me which ones had sesame so I made sure to not order those. I was out with a party of 6 and we picked 4 meats for all of us to share. I chose sliced duck and the waiter was well aware of my sesame allergy. He did not inform me that the duck had sesame marinade until he was putting it on our grill and just told me not to eat it. This was really disappointing since this was the meat I selected and still had to pay for! We also went on a Sunday and were supposed to get 20% off the beef we ordered, which we did not. The pancakes side dish that came with the BBQ package was completely raw inside and when I notified the waiter about it, we did not receive new ones. Overall, a disappointing experience and for approximately $20 per person, definitely not worth returning."}
{"text":"Service has been quick and accurate. Restroom clean and not burdened with multiple \"deodorizers\". Only one of the banchan, napa kimchi (napa) has any spice.  Seafood soon du bu is fine but not particularly flavored of seafood and I would add more onion, garlic, and pepper. May contain potato.  At only about $11 before tip it's an inexpensive and healthy dinner. But I should specify spicy, spicy."}
{"text":"Nice service; long wait until someone takes your order but food comes out quick. Taste was just alright."}
{"text":"Very nicely organized and spacious for group of friends to eat together. The food is pretty good. I would recommend the bento boxes for lunch and budae jjigae for dinner. Overall, a good place to eat."}
{"text":"While passing through Champaign we wanted to stop for supper at a Korean restaurant.   After reading the reviews and looking at the pictures on yelp we wanted to try either Good Fella or B Won but they were closed for holiday so ended up going to Masijta Grill.     We ordered grilled mackerel, ddukbokki, and sautéed squid.  Overall, the food tasted good.  There were a few side dishes but none of them looked appetizing,   This place looked like a place for college students.   One of the servers walked through the isle back and forth to see everybody was doing okay.   Other server was sitting down and was occupied with her cell phone."}
{"text":"It's good but it's pricier than other Korean places around town. They do have the bbq at the table ($22+ per person), which is unique to this place. I tried the bulgogi poutine and was disappointed. It was just regular freezer fries with a scant smattering of bulgogi on top. I could've made this at home but I'm too lazy. To be less risky, I do enjoy their bibimbop and galbi. And they do offer a bunch of banchan (complimentary side dishes). It's not the fastest service but the food is good. The price is high but the staff is friendly. If you're feeling thrifty, there are many other good Korean places to choose from. If you're feeling fancy, this place is a nice option for tabletop bbq."}
{"text":"Masijta opened on Friday, May 16, 2014.  Our party of five people had lunch there on Tuesday, May 20.  It's really surprisingly good.  I think after they've been open a little longer they will improve on service speed.  The food was delicious.  Bibimbap in a hot stone bowl was excellent.  I deducted a star for a poorly designed menu and blah interior ambience, including bad acoustics."}
{"text":"The soups are very good with generous portions. We got dumpling which basically taste like won ton soup, and the spicy basic but popular hot stone soup. That I would get again. The bbq meats were expensive ($21-30 a portion) and you are required to purchase 2. Marinated short ribs were yummy but pork belly was flavorless. Would come back for other menu items and maybe grill if we had more people."}
{"text":"I am new to Korean food but am I glad I ended up for lunch! :-) For me if I love the food... it's worth the stars ...I ended up eating everything and for a person ... my size ...it was a lot of good food ... A must try if u are ever in the area ... I m definitely going back here again every chance I get :-) .They have good lunch deals and even if u are trying to eat good food on a budget you will loove their lunch deals.. so goo out there and enjoy :-)"}
{"text":"Great food and service! We had the Korean BBQ (marinated beef ribs, pork belly), Korean fried chicken, and seafood pancake.   I love how they serve you lettuce and side dishes so you can make your own Korean BBQ wraps and enjoyed the meat, veggies, and flavors with one big bite! Highly recommend the two grill dished we got.   Korean fried chicken is also a must try. It is absolutely different than American fried chicken. Try it with the sauce on the chicken, as it was more flavorful (try garlic honey soy sauce. It is their specialty).  However, it is a little pricey, especially if you come in a day where they don't have discounts. Check out other yelpers' photos for that. Tuesday is all the menu items 20% off! Also, remind your waiter to refill your side dishes and lettuce. They are the key to have a great grill meal!"}
{"text":"Amazing Korean food! We went twice while in town and the stone pot bibimbop was so amazing! I loved the vegetables they put in there! The pot could have been a little hotter because I want my rice to get crunchy. No crunch :( but it was delicious anyways! The employees are very helpful and we loved that they were so helpful with my boyfriends allergy to sesame seeds! We didn't try any desserts because we were so full from the main course!   If you're in the mood for good Korean food, try this place! It's small inside but worth the wait."}
{"text":"We went today for lunch and really enjoyed it. Nice staff, good food, attentive service, and comfortable, clean interior.  Yes, the menu's design leaves something to be desired, but the important thing is the actual food, which was great.  We got a pleasantly spicy seafood noodle soup (can't spell it!) and seafood bibimbop.  Both were excellent, with a nice mix of seafood (squid, mussles, shrimp, etc) and very flavorful.  The owner came out to say hi, which was nice.  We will be back to try the tableside barbeque!"}
{"text":"This location in downtown Urbana is perfect.  Plenty of affordable parking.  The food is truly delicious.  Grilling is so much fun, and the service was quick and the servers were very pleasant.  I would recommend a visit to Masijta"}
{"text":"I went with 2 vegetarians who'd never had Korean food.  One got the teriyaki tofu - looked really good.  The other had tofu bibimbop with no egg.  They both enjoyed.  I had the hot stone bowl with seafood.  Very tasty, a good amount of heat.  The banchan (side dishes) were good too."}
{"text":"Friendly service. The bul-go-gi is very good! Shrimp Yakisoba as well. (I don't do spicy dishes). The side dishes that come with it are hit and miss, mostly hits though."}
{"text":"First trip to Masijta, but certainly not the last. Had lunch there today. Tried the hot stone pot beef bibimbap, veggie egg rolls and the Korean fried chicken. Food was delicious and beautiful, love all the side dishes that are served with Korean food. It was quiet at 1pm on New Year's Eve Day,  service was timely and the staff was very attentive.  Highly recommend and will be going back to try many more items, especially the in-table grilling!"}
{"text":"Seafood soup had everything from clams to octopus in it! Very impressed with food quality and service."}
{"text":"The food here was pretty good, and there's plenty of seating. Came here with a party of 4 on a Saturday night and there were only around 3 other tables filled. We didn't get K-BBQ but the regular dishes still did it for us!   I got the budae-jigae and it was definitely a good size serving + really hit the spot on a chilly winter night. Price was a little steep ($14) but I guess it was okay considering how much you got. My friends got the tonkatsu and chicken teriyaki, everyone was pretty pleased with their dishes. They let me have an additional bowl of rice with my budae-jigae, but they told us only one additional bowl for entire party. Oh yeah and unlimited banchan! The servers were super good about keeping our waters filled and didn't mind refilling our banchan periodically.   Overall, I'd probably come here again but compared to the korean food prices on campus, this would definitely not be a place to casually come to for dinner on a regular basis."}
{"text":"I love the food here; the mul namyeon, kimchi jjigae and grill items are outstanding. The service is attentive, the banchan has a decent selection and tastes good while the atmosphere is spacious, if not a bit smoky from grilling. I think the prices are a bit high though, especially if you decide to grill meat."}
{"text":"Been there for several times. The best Korean beef and pork bbq in Urbana."}
{"text":"Very tasty! I always go with a group that loves the endless meat option- you get as much meat (I think it is unmarinated) as you can eat. However, I really like the hot pot options. Much cheaper and super delicious! Last night I shared the Boo-Dae Jeon-Gol and we had plenty of leftovers for the next day. I would definitely recommend Masijita Grill if you're in the area."}
{"text":"Nice atmosphere.  Delicious truly authentic Korean food.  Owners and staff are delightful."}
{"text":"Favorite Korean place in town. The Korean ribs are good and so are the french fries with kimchi. Also the waitstaff has been consistently nice whether the place is busy or slow."}
{"text":"Good to have another solid Korean restaurant in the area. Came here for a quick dinner and was in and out with no problems. I had the bulgogi and I really enjoyed it. It was a generous portion of beef and also had a good amount of napa cabbage and other veggies, very atypical for bulgogi but I enjoyed it. Usually when I want Korean food I'm craving bulgogi and I was definitely satisfied with Masijta's. My grandmother really enjoyed her dolsat bibimbap, so that was good too. We also shared a seafood pancake that could've been a hair crispier, but otherwise was chock-full of seafood and green onions. Overall, while I definitely enjoyed my meal here, I'm not sure if it would be my first choice when I'm craving Korean given the many options in the area. However, the off-campus location could definitely be a perk and I hope to be back!"}
{"text":"This place hit all the right spots! Great service and food! It was absolutely delicious! Only downside is you have to pay a lot more to be able to cook your own food. (Have to choose 2 from the menu, if you just choose 1 they cook it for you)  I would absolutely come here again, and bring more people!"}
{"text":"My friend brought me here last night. I have ordered takeout from here once, but I HIGHLY recommend dining in! We ordered two grill meats. The food was incredible!! The meat was so tender and soft and just melted in my mouth. I will absolutely be coming back for more! Our bill after the two meats (one was $21 and the other $26) and one order of mochi ice cream for dessert came out to $60. It is a bit pricey but the quality of the meats and the experience is well worth it!"}
{"text":"Coming from California, I was pretty surprised that the spicy tofu soup I got here tasted just like it does back home. I'm definitely coming back here.  Service was fast. It seems like they had some growing pains when they first opened, but its been half a year now. We got our food in less than 10 minutes, and the restaurant was almost full when we went at 7:45pm."}
{"text":"You definitely don't want to come to this for Korean BBQ. So at a normal K BBQ restaurant, you pay $20 and get unlimited BBQ. Here, you pay about $25 for just one plate of BBQ. That plate of BBQ has less meat than the plates you get served at AYCE KBBQ places. My crony ate all his food and ate all the sides and was still hungry at the end of it. They also didn't have my favorite KBBQ side: rice paper. It's best to order something else on the menu."}
{"text":"I love korean food and was excited when this place opened. Finally, one winter day seemed like the perfect time for some hot spicy korean lunch. so, off we went in the brutal midwest winter.   the place has tables setup for the korean bbq. grill in the center of the table and all that. sparsely occupied. hey, its winter, so ..   the menu was typical korean fare. i went with my standard sundubu, SO ordered a spicy chicken bento box and a colleague another bento special with chicken. the lunch specials include a drink, thats cool.   though the place was not very busy, it took a while for the food to come out. kind of annoying esp, for lunch. but i dont hold it against them.   the accompaniments came out but only for one of us for some reason. i always expect to see a good helping of korean sides and always get disappointed if they dont appear. what they did serve was better than other korean places in town. radish, sprouts, kimchi, and one more item. the wait staff forgot to get/ ask for drink.   the food came out. chicken bentos were good. a lot of food for a bento box. spicy chicken was tasty with a good helping of veggies and chicken. sundubu was quite disappointing. it had a very fishy smell (too much fish sauce?). taste was significantly off.   might come back for another lunch but not in a hurry. will probably order the bento again."}
{"text":"Came here with my mom for a weekday lunch. We went with the bbq. The service was great! and the food was delicious and authentic. I will be back!  12/1 UPDATE We came here with both of our families over the weekend. Everything was DELICIOUS! I highly recommend the korean bbq poutine. It will blow your mind! I only have a few minor complaints. First, I felt that the food wasn't spicy enough especially considering that it was a Korean restaurant. Even the kimchi was surprisingly bland. Second, there were a few items we ordered that were supposed to come vegetarian but did not and thirdly, we ordered french fries for the kid only to find out that they didn't have ketchup. They shouldn't have french fries on the menu if they don't have ketchup."}
{"text":"The service was good but one of the side dishes and the soup I had ordered had hair!!! I am not too sure about their sanitary policy.."}
{"text":"I would give it 5 starts when it first opened. However, lately the service has not been that great. A couple of times when I went here, the restaurant was clearly understaffed. Water was not refilled, it took forever to get the bill etc. Also, one time they tried to fit 4 people with my friend and me (2 people) in an eight-seats table, which would have not been a problem... except that this is a Korean place that requires a lot of table space for side dishes + meat tray. It was awkward.   Despite being a Korean bbq place, this place doesn't have a good exhaust system. When a lot of tables are doing bbq, the room gets smokey.   The food is good overall. I always get the traditional bulgogi and marinated short ribs. Delicious."}
{"text":"So yummy! They give a lot of side dishes which is always a plus. We had a Kimchi Jigae vegetarian and a cheese egg roll. I usually order take out but my experience dining in was pleasant. Can't wait to go back!"}
{"text":"Good res, grill is pretty good, must try their chicken wings"}
{"text":"The food is good. My only complaint is that I wish the pickled veggies were an option, and not a mandatory accompaniment to most of the meals. It is a little pricy for the amount of food you get. However, the main dishes are really delicious."}
{"text":"Masijta is a good place for korean bbq and soups. I went there on Sunday when they had 20% off for all beef for the grill. My boyfriend and I had the yuk gae jang, galbi, and thinly sliced marinated beef with enoki mushrooms. The yuk gae jang was a huge portion and with the two beef options, we had a lot to take back home. The check also came out to $66 with tax and tip. The meat was lightly flavored and the yuk gae jang had a strong beef broth flavor. I recommend coming here when they have special deals."}
{"text":"Worst place in this town. Discrimination?  Me and my girl got here around 1:00 PM on Oct 28. We were told one minute wait time. We waited for about 5 minutes and a white couple came in. The waitress showed their table immediately. Never go to this place ever again"}
{"text":"The WORST experience ever!!!!! We ordered bbq and they are supposed to cook for us, but no one came and no one told us that we should cook it. The food was then burnt, and we just want them to change for a new plate. But the boss came and said that the food was still edible, because it was marinated. Burnt food was edible? Are you kidding me, and she refused to change it for us until I said that I would post a photo of it. I thought that the issue can be peacefully solved, but! They bring us a much smaller portion!!!!!"}
{"text":"Good Korean barbecue, cold noodles and casseroles are also delicious! A good place for dinner!"}
{"text":"This is a very authentic Korean restaurant. No, I'm not Korean, but I've been to a few restaurants and asked some friends and this is definitely on the more authentic side of the spectrum. I got the seafood Bibimbap and it was delicious! It comes sizzling hot (literally) in a stone bowl. The rice is still cooking in the bowl when it's served. If you want crunchy rice, you can let it sit in the bowl and sizzle and then mix it. I love letting the rice get crunchy. They added a generous amount of seafood. It's nicely topped with a over-easy egg. My friend got the seafood pancake and some type of cold soup. Both looked amazing. Hugely recommend this place!"}
{"text":"Lovely little restaurant on the corner!  My husband and I went to this little restaurant one night last week.  The staff was overly friendly and multiple servers stopped by to make sure we had water, seats and menus.  My husband ordered the vegetable stir fry and I had the Korean dish-tofu dolsot Bi-Bim-Bap which was amazing!!!  Loved the atmosphere and the vibe.  Everyone around us seemed to be enjoying themselves and almost everyone was using their cook top.  that is next!  A special shout out to the manager/owner-a lady wearing an apron that came around asking us about our food.  When she told us she was going to start adding Sushi-I proclaimed I LOVED sushi and she promptly went in the back and brought out a plate of Sushi she had just made.  i am now a fan for life :)  Nicely done!!!!"}
{"text":"Honestly truly completely we loved this place, and can't stop falling in love with their food. We lived in Peoria which one and half hour away, we did not mind to drive to have their food at all. The owner lady is super friendly and sweet. Everytime we came, they served us the most amazing food and service, except one time the two waitresses were so rude and careless but we were FINE. Anyway, this place is a must for Korean cuisine."}
{"text":"I am SO gonna miss this place!  The Banchan is always wonderful, the service is quick AND friendly, and the Spicy Pork is to die for.  Prices aren't low, but reasonable for this type of restaurant.  Wish I could take it with me to Fairview Heights or O'Fallon area!!!"}
{"text":"We ordered \"Korean\" chicken wings as an appetizer and bulgogi as an entree. The wings tasted chewy, rubbery, and just like any other chicken wing you could buy from the frozen aisle.   After a long wait, our entrees were served first, and then the wings. The boss came by to check on us and scolded us for not eating the appetizer first. Um, excuse me??"}
