{"text":"The worst food. Ever. 
The worst bartending. Ever. 
Unclean.
Bathrooms are at the bottom of rickety stairs. Someone has puked in the stall. trash and clutter everywhere. 

Negative stars."}
{"text":"Had lunch there yesterday, with my wife and son.  The buffet was not good!  Everything was overcooked.  We were the only ones there and I understand why.  The pictures on this site are not accurate.  There were about 7 items and most were overcooked.  What a disappointment, because I had heard good things about this place..."}
{"text":"I thought the food was very subpar. After dinner the waitress spilled a glass of wine on my wife's dress and did not acknowledge it. After that I spoke to the owner and he just ignored my comment/concern. Very unprofessional!  I will NEVER go back again!"}
{"text":"What a terrible terrible place! We went here as a family to enjoy the food as a family. The food was Terrible! The potatoes were dry and hard as a rock. Some of them were burnt and dried out. I am not sure if they were left over or what happened but I have never seen potatoes cooked so bad. The spaghetti was mushy. We might as well have been eating baby food. The beef that they had on the buffet looked like pieces of leather. I should have taken pictures. Not only was all of the food absolutely disgusting but there was only one server for our entire family. As we try to enjoy our family meeting and continue eating the terrible food, people continue to stroll in off of the streets and pay the host to eat our buffet food. I would never recommend this place to anyone for any event. I am pretty sure there wasn't toilet paper and any stall in the bathroom and it was also disgustingly dirty. I'm so sorry that we had to waste our time there. We won't be making that mistake ever again!"}
{"text":"First trip to Cleveland - and decided to come to a historic Cleveland establishment for lunch on our first day.  Ooooops - big mistake to choose this one.

It may be a fine venue for events but run do not walk from the lunch buffet.  It looks fine on their website but all selections were very dry, tasteless, not even lukewarm (and we got there 45 minutes after they opened).  How do you ruin potatoes?  it seemed as if they prepared everything on Monday and let it sit under heat lamps or in warmers until we arrived on Thursday.  Horrible.  The photos on their website of the buffet when you click on 'lunch' are very very deceiving.    

Too bad there aren't negative stars.  But actually they do deserve one for the iced tea (which was very fresh and flavorful and refilled often), the mini-desserts brought to the table (flavorful and chilled) but just two bites (very small) and the service. 

The building is cool and the atmosphere had hotel style tables with sheets tied around the standard hotel chairs (think wedding) with large centerpieces of flowers.  It was like being at an event before the rest of the people arrived.  

There was a sign at the bar that bottles of wine were $3 - so if you wanted to come and share a bottle of wine and maybe have dessert only (which I don't know if they offer) - that would be at least interesting."}
{"text":"NEVER EVER book an event at Massimo da Milano.  We held my brother's rehearsal dinner there and it was awful.  The food was COLD, not warm, COLD.  The green beans looks days old, the chicken was disgusting and the pasta sauce came out of a can.  I let the planner know ahead of time about previous stories I heard about the food being cold.  She ensured me that would never happen and IT DID.  The other thing that was very upsetting were the sloppy tables.  I asked for the tablecloths to be ironed and they weren't.  It looked like they were in a ball and then thrown on the table. The most alarming part is that the owner didn't seem apologetic about what happened.  He kept calling me \"babe\" and said \"people have been bragging about my food for years.\"  Those people obviously don't have taste buds.  He offered me a cake to make up for everything.  I have no desire to go back.  Please don't be enticed by the restaurants prices because you get what you pay for.  NEVER AGAIN."}
{"text":"The first time I went to Massimo's it was a couple years ago. The lunch buffet wasn't phenomenal, but it was good, especially for the price ($7!). I've come here a few times a year for lunch since and every time it seems like the place goes downhill. This last time, the food was stone cold, the dishes were dirty and the food was bland. The salad was brown, the chicken piccata was goopy, and the chicken was rubbery.  Massimo's has so much potential (great location, good atmosphere, good prices) and I've heard great things about them as a venue, but as far as a place for lunch goes, I'd say it's best to avoid."}
{"text":"I wish I could give this zero stars; one is a stretch.  Attended a wedding reception here this weekend.

Steak and chicken were very dry and hard to cut.  Just overall not great food. 

Bartenders have no clue how to work the progression of the bar. 

Bathrooms are downstairs; they do have an elevator tucked away for elderly but through a hall full of stored items. 

The worst was the server who was either on something or bombed.  Dropped trays of rolls.  Then an entire tray of food. Had to be shushed as the speeches and toasts were being given. Busy dancing and sitting with guests instead of clearing tables off, walking/bumping into walls and columns, and spilling beer all over our table before she was finally told to leave.  Very unprofessional!!!

My friends paid good money for their event. I would never recommend this place.  Go someplace else!"}
{"text":"My husband's company hosted a dinner party here, so this was my first experience.  I have driven past this place many times and have always been curious because it looks great from the outside.  

As soon as I walked in, I was greeted by what i believe to be the owner, smoking a cigar inside the building.  Uh, isn't that illegal now?  Gross.  Getting past that, I went into the dinner area, and it was set up nicely, probably too nice for what we were there for, but that's fine.  Once it was time to eat, the buffet of food looked great so I was excited to try it.  One bite of what I think was the fettuccine, and I had to spit it out.  It wasn't burnt, but tasted like it was slow roasted in an oven that had something else burning for a very long time in it.  Awful.  The rest of the food was way too salty, and tasted like it had been sitting around for quite a while.  

Also, throughout the event I noticed the cigar smoking man lurking in the doorway, just watching us.  Umm, creepy!

The desserts were decent.  The wait staff was attentive.  That's about all the good I can say about this place.  If you are considering having an event there, please think again!"}
{"text":"You can do a lot worse than Massimo's on the Near West Side.  Then again, Massimo's could do a little bit better.

The food itself is good.  It won't wow you, but it's not bad.  This place looks like something amazing, though, so I was disappointed when I actually ate here after walking by it many times.

I don't know what else to say.  It feels a little cold inside, more spiritually and existentially than literally."}
{"text":"Absolutely, unapologetically BAD!  This place couldn't have been worse if they were trying to fail as a restaurant/event venue.  

We booked ahead for a large group, and were subjected to construction workers from next door and vagrants off the streets eating and sharing the buffet we had ordered for our group.  With the owners' blessing!  Seriously!

Beyond that, the food was absolutely horrific!  I can't imagine a reason why anyone would ever want to eat what this establishment argues would pass for food.  

I don't know about most people, but over-cooked reheated leftovers at $10/plate for a party of 150 people (coupled with an incredibly understaffed and dirty establishment...) doesn't define an enjoyable family event to me. 

TERRIBLE!"}
{"text":"I've been meaning to write a review of Massimo da Milano for a while now - and when I saw that the only other two reviews were only 3 stars, I HAD to weigh in. We had our wedding reception there in May 2011 and it was simply PERFECTION! I wish I could give it ten stars!

Also, I have been to the lunch buffet there many times and that is also awesome, and one of the best deals near downtown for a pasta feast. 

But I mostly want to comment on their banquet services. I absolutely adored working with Tony and Lisa at Massimo for my wedding reception.  For the year I was planning my wedding as a nervous nellie, I must have called Lisa about a dozen times with random annoying questions, and she NEVER made me feel like I was bothering her, and was always happy to help and accommodate. She was the best! 

The price for a wedding reception there cannot be beat. We had the buffet reception, which was $50 per person, which included open bar, appetizers, dinner, champagne, valet service, dessert, taxes, etc). 

The dinner buffet was delicious! I can't remember everything that was served, but it was a LOT - a couple different pastas, antipasti, meats, veggies, potatoes, bread, salad.... People still comment about how good the food was at our reception! 

Oh - and if you do have a party there, it's DEFINITELY worth the extra cash to add the strawberry amaretto and cassata sheet cakes! They are delicious AND you can save money on expensive wedding cake. I ordered a 100-slice wedding cake for 160 people. There were PLENTY of desserts for everyone, and there was STILL lots of cake leftover.

The atmosphere was great! We didn't want a \"banquet\"-looking venue, and I love that Massimo is in such an old building with so much character. There is a whole wall of windows, and, at least in the spring and summer, the litle bit of light filtering in right around the time dinner is being served at a typical reception is just perfect, and very romantic!

I love the exposed brick and wood floors. The table linens were provided by Massimo, and looked great. Because the venue is kind of minimalist, I worried that the tables would look bare, so I overdid it and spent way too much money on centerpieces, candles, favors, etc. I wish I hadn't!! There really is so much character and charm in their big dining room!

The ONLY kind of sucky thing about having a reception there is that you and your guests will inevitably interact with panhandlers and crackheads, and more security would be ideal. The valets, and Tony, the owner, did a decent job of turning out a couple \"crashers\" at our wedding. One woman and her two little girls (!!!) did come in and helped themselves to armfuls of wedding favors, takeout containers of buffet food and wedding cake, and no one seemed to notice or intervene, but ultimately, I wouldn't have wanted a \"scene\". 

All in all, I absolutely LOVED our wedding reception there, and we love stopping in for lunch for the great lunch buffet."}
{"text":"Yuck! Yuck! Yuck! The lunch buffet was cold and didn't get refilled one time the whole time we were there. The fish smelled old and rotten. The whole place is extremely dirty! Sad because the owner seemed so nice! The desserts they bring to the table after are good, but really nothing before that. :-/ Too bad!"}
{"text":"Wow............. I cannot believe that people even consider this place to hold events.  I was here for a baby shower and there was a first communion celebration going on  in an adjoining room. We shared the same buffet line! Classy. 

The food was bland.  Desserts inedible. But the worst part of all is the cleanliness.  It was so dusty and dingy.  The floors need a good scrubbing and the carpets need cleaned. You have to go down a flight of stairs to the bathrooms. Halfway down the steps, I had to hold my nose from the mildew smell.  I've been in port-o-johns that smelled better."}
