{"text":"The sesame chicken is filled with deliciousness!  Obviously this is food court grub, but there's something about it that keeps me going back each Friday during lunch.

The line can sometimes be pretty intimidating during lunch hour, but this is without a doubt the quickest line of any place at Tower City"}
{"text":"I got an egg roll today.  I vomited thirty minutes later.  I have felt great since which makes me think it was the eggroll.  Avoid."}
{"text":"Another Tower City  jewel has caught my attention.  I've had some good Chinese take out but the food I had at Master Wok in the Tower City Center was excellent.  Even though the experience was almost ruined by some crackhead trying to reach over my mother and I and then trying to start a confrontation just to get extra soy sauce because puffing on the rock kills your tastebuds beyond tasting even soy sauce.   Anyway the Sesame Chicken and Orange Beef were tasty and not over sauced and the fried rice was nice and tender like I like it.  Now eating in the food court isn't the best way to enjoy a tasty meal but hey when you're in Cleveland take what you can get."}
{"text":"It's no coincidence that the line at Master Wok is often the longest among the eateries in the Tower City food court.  The food, while your usual Chinese mall-food fare, is a step above what you usually find at similar places.  On top of that, it's relatively inexpensive:  Your choice of white rice, fried rice, or noodles with a main entree item and a side entree item totals $4.75---$6.00 even with a Coke to drink.  Personal favorites are the BBQ Pork and especially the Curry Chicken, which only comes out on Wednesdays, Thursdays, and Fridays.  The Green Beans are also very good.

And...don't worry too much about the line.  It moves pretty fast."}
{"text":"They have the best buffalo chicken tenders on Thursday only. People line up from 11:30-1:00 just to get them. Can't go wrong if you like buffalo chicken tenders."}
{"text":"It's mall food court, but for under $7 you get two main dishes and two sides (rice is a side).  Not too shabby."}
