{"text":"5 stars for the pizza only.  Service is homey and good. The pizza at this place is the best for the standard pizza, not the gourmet pies that are popular at other joints. Got a large with double cheese, pepperoni, sausage and mushroom-classic Midwestern pizza. Neither Chicago or New York style, but a great crust, sauce, and ingredients. Ok, mushrooms are canned, but the Italian sausage is huge chunks of meaty goodness, pepperoni is perfect and the cheese is gooey deliciousness. Anytime that I'm in the Greater Cleveland area, I head to Master Pizza. Best to go in and get it fresh because delivery can be hit or miss."}
{"text":"My favorite pizza because they use an old fashioned pizza oven. Nice family owned restaurant. Great lunch deal Monday- Friday 11am-3pm."}
{"text":"First the good: the taco pizza is really good, the other pizzas have always been pretty good.  The bad: if you choose to eat-in you may want to bring your own dinner ware. My daughter wouldn't even drink out of her cup. The silverware was gross. I try not to think of what that means about the places in there that you can't see...like the kitchen. The service was really slow and the men's bathroom was out of paper towels. I will never eat-in again but I will occasionally order their pizza for pick-up...at least until the Health Department shuts them down or I get sick:("}
{"text":"We decided to head out to Brunswick after our dessert. What goes best with milk shakes? Duh, pizza!! The staff was extremely friendly and we were sat right away.  I was able to check out the back and they actually due still use an old school oven. Which I find impressive.  We placed our order. Standard large pizza with everything, some sodas and I wanted some fried cheese. Our server was quick and got us our drinks, then about 10 minutes later our cheese.  They were your standard bar cheese stix. I wasn't that impressed with them.  However, when our pizza came out. Wow! It really was a thing of beauty. Classic dough. Meaning nothing frozen. You could taste the sweetness in the sauce. The fresh cheese and fresh toppings were an awesome bonus.  It was delicious! The price was just right ad well. When we're out this way, we'll most definitely come back."}
