{"text":"My mom was a frequent patron of this pub. She is in her 60's and retired. We came in tonight and had pleasant service from one of the waitresses. Then out of no where this older lady comes up to my mom and begins yelling about a 5 dollar bill that allegedly my mom had left on one of her previous visits, claiming it was counterfeit. I interjected and she started shoving her finger in my face and told me to shut my mouth! After my mom tried to tell her that she had no idea it was fake she started barking that she(my mom) should be able to recognize counterfeit money and yet one of her staff members had apparently not recognized it right away either. She proceeds to yell at my mom like she is a criminal for possibly (and really how can you trace a 5 dollar bill back to a lady from months ago) making an honest mistake then demands we pay our tab and pay the 5 dollars. After we clear up our tab she finds a staff member and asks her to take a picture of my mom while she writes down all the info she could remember from her credit card! It was unbelievable how she treated us and I'm considering taking action against her threats to come after my mom... who has been nothing but a good customer! The location is great as well as the food but the older manager Darleen needs to go... I think she has seen her better days and might need a permanent vacay so more people don't stay away"}
{"text":"I wanted to like this place, but too many things added up to just this one star rating.  I went there last week, as we couldnt get into our usual choice on the lunch hour - Ceilis.  I love finding old little placss that are full of character and good food - even simple pub food.  Unfortunately, this place missed the mark. 

First the good - walking in I was pleasantly suprised at the warm and welcoming feel lots of wood - glass separating walls - very nice pub feel.  There were alot of other suits in there, so I thought this place must be a hidden gem.   Hidden maybe, but no gem. 

Now onto the bad - the menu itself was sticky, and greasy - yuck.  Looking past that, I looked for something vegetarian friendly - and could find very little. I ended up ordering a basket of french fries and a caesar salad - no bacon.  I saw that the half size Caesar on the menu was 750. I saw one being delivered to a table near me and I said to the waitress, is that half size? She said \" uh, yah its the side Caesar\" I said is that really 750? \"she said, \"no I think its five bucks.\".  
Well when the salad arrived, it was the same one, small side plate with sad bits of romaine lettuce tossed in what tasted like a very crappy bottled dressing.   If you are going to charge that much for a little salad then at least make it a decent size with quality ingredients. Utter crap. 
The french fries were just normal  fries- not hand cut or anything, just deep fried frozen fries. 
My coworker order a chicken burger - she said the chicken tasted good - and was a chicken breast not formed patty, but the weirdest thing was it was accompanied with 2 large potato wedges.  Just 2. Very weird. 
The server was friendly enough, but  young and apathetic. 
My basket of fries and crappy salad with a diet coke and tip was over 20 bucks. What a rip off. I will not be back."}
{"text":"That other review is crazy. Ceili's is an over priced douchey breastaraunt while Master's is a friendly downtown neighborhood pub. I'll concede you the ceasar salad there is not great but virtually everything else is, the beef dip and pizza is some of the best in the city."}
