{"text":"This is the best pizza in the area.  Very consistent..I've never had a bad pizza here.  Cute place kind of going back in time."}
{"text":"Yum! 
Just tried master pizza for the first time tonight and I'm impressed. Just wish it was a little closer. I don't know if I'll drive 20 min every time I want pizza."}
{"text":"The pizza here is so good! So. Good. I've never eaten inside but have ordered take out and delivery. No complaints with either. Our order is always right and the food is always yummy. Plus, they frequently offer coupons on the back of Giant Eagle receipts and in the penny saver that's mailed out. Bonus!"}
{"text":"Best Pizza in town!  I have been buying for 5yrs.  I wont go anywhere else."}
{"text":"Ordered a large pepperoni mushroom and sausage pizza...for delivery. It was perfect. Hot, the crust held up and the flavor was on point.
This is my new go-to pizza choice."}
{"text":"Best. Pizza. Ever. Friendly service. The red sauce is excellent and unique to Master Pizza. With ALL the pizza places that deliver,  I still choose to drive there since I'm out of their delivery area."}
{"text":"I love this place! I'm sad that this one is the only one that has this menu, because it's by far the best. Their broccoli and cheddar pizza and mashed potato pizzas are both AMAZING. And their salad dressing is slightly different then the other locations also. This one is less sweet and more vinegary. Super yum. The other locations that aren't independently owned like this one are good, but pale in comparison to this location."}
{"text":"Some of the best pizza in the area... def trumps pizza hut, dominos papa johns. It doesn't look like much from the outside but I could eat this pizza every day."}
{"text":"Love the pizza and posted the menu in the photos section.  They don't have a website and it's not on their FB page!"}
{"text":"My mom and I came to painesville to check out the lake for a couple days and this was our favorite meal! Pizza was full of flavor and had plenty of toppings. Try the veggie with broccoli and the garlic bites were great even cold the next day! If you get a side salad you might consider asking for light cheese, ours came with about 12 oz of cheese on top! Definitely recommend trying Master Pizza!"}
{"text":"Pizza was awesome! Best crust I ever had. It took over 30 minutes to get the pizza, but was worth the wait!"}
{"text":"Cannot say enough good things about their pizza.  Ate it before and craved it monthly when pregnant - one taste and you will see why!  So crispy and delicious is the golden brown crust and pizza bottom that it will melt in your mouth a little bit.  Not soggy - never soggy - but so good! And they know how to cook it for the cheese to brown and bubble - so few places do that. 

Order the pepperoni, order the Hawaiian (hubbys favorite), order the sausage - all delish!"}
{"text":"Master Pizza Painesville has been around for a long time. Its a terrific little pizza joint. The recipe is just the same as it was 40 years ago. Their sauce is what makes the pizza different & really tasty. It has a nice subtle sweet n tangy flavor. Also they use just the right amount of italian spices. 
You can also get various subs & sandwiches along with a nice selection of salads, appetizers and pasta entrees. They serve BBQ ribs too! Beer and Wine for adults & lots of soft drinks for the kids. 
A nice family restaurant. Eat in, Carry out and Delivery. I think you will be happy if you eat there."}
{"text":"From the outside Master Pizza looks like a little hole in the wall, but go inside and it's a very laid back italian joint. Family friendly, neighborhood feel.

They have great specials everyday and their pizza has some of the best flavor around. Definitely get yourself a dinner salad too, they don't skimp on toppings, especially cheese! Their Italian dressing is the best!"}
{"text":"Best pizza ive ever had. Anywhere hands down. Those cheesy breadsticks are also a gift from god. I recommend this pizza place to all pizza lovers!"}
{"text":"This is exactly the pizza I grew up with. Great crust, large toppings and not afraid of calories. It's nice when tradition never changes. Try the deluxe, it's heaven on a plate"}
{"text":"Absolutely one of the best pizzas I've had!!!
Great service, outstanding people. You will not be disappointed."}
{"text":"When I want gourmet pizza, this is where I go.  They have a carousel oven, which are practically extinct nowadays.  Takes a little longer, but worth it.  You get that great soft in the middle, crispy on the outside type of crust.  The sausage and mushroom is my fav.  The salads are wonderful and loaded with cheese.  The lasagna is homemade and yummy.  They make you fresh coffee (love that).  It's a local place, community minded and serving.  Owners and workers are good people.  I hope it will be there until I die.  Go, enjoy.  While you're at it try the Cinema 20 across the street.  Great, low cost movie house.  Great date night."}
{"text":"OK. Let's get straight to it. This pizza is too good for mortals.

Grew up here - so I'm biased.

Small town boy who left and ate some big world meals. Paris. Rome. Brussels. New York. San Fran. Alina in Chicago. Whatever.

Ate all the deep dish. And the New York fold and eats.

And all I got to say is ....

Bow down to the Master ...b's

Bobby Flay? Giadda? Mario and Lydia? All you wanna be's...

You don't know ....sh....what you don't know. 

Trust me. This is the real deal, real deal. I've had your stuff, you can't bring it like the Master. Real Italian sausage? Check. Pure mozz - check. Concentrated flavor mushrooms - check. check. check!

What can I say? When the plane lands, my family knows I ain't coming home until I roll up in to the Master. They even got a map to prove that folks all over the world know where to come when they want pizza done right. So steer 'rem G6's up in to Hopkins and find out what life is all about. Too sad it's so far away (I'm ready to open the Hilton Head branch tomorrow, folks!!!) Call me!"}
{"text":"I grew up in Lake County. We've lived in Dayton since 1973 and have travelled extensively. No pizzeria compares! (Be advised it stands apart and is not part of the other Master Pizzas in the area.) Nearly every visit of ours to Cleveland includes this pizza. The delicious pinched-edge crust even supports a deluxe which includes house-made Italian sausage chunks (no pellets here), fresh mushrooms, red pepper strips, etc.  Try one soon and thank me later"}
{"text":"Delicious  thick crusts yet horrible pizza sauce; super good  Mexican salad."}
{"text":"this is by far my favorite place to eat. friendly service, amazing pizza, and amazing pasta. the heartiest meat sauce. one of the best lasagnas i ever had."}
{"text":"We heard it was good, so we tried a pizza. Nice amount of cheese and toppings. I prefer a little more sauce and thinner crust. But this is a good pizza and I like how they've been part of the community for a long time."}
{"text":"Not worth all the hype. I went here before and didn't really enjoy it. When I got home and finished the pizza it tasted way better. I had it to go the next day because I enjoyed it so much and again I gave it time to cool off and at it.. It was only average. Here we are a few months later I decided to order delivery and even after waiting a while the pizza was still horrible. It was so bland and the sauce was weird. There was so much cheese on it but again it didn't taste like anything. I'm so disappointed and upset that I wasted $15 on this. I only give it two stars because of the convenience of delivery."}
{"text":"I haven't eaten at the P' ville location much, but i went to the Mentor one a lot of times in the early 2000's. Hopefully it's the same folks involved. The pizza was nothing spectacular. Good enough. But the WINGS!! They were incredible. I have never had any like them since. Saucy and mild and not greasy. Now that i am a self-flagellating vegetarian, I'll never taste them again. I could still get the pizza. The dining room was quintessential Italian meets neighborhood bar chic. Is that chic? I also really like the logo of a cartoon smiling chef holding a pizza like a steering wheel. Maybe I can get a tat of it to show my allegiance to my old hood. They also served pasta. I grew up in a first generation Italian home and was taught never to order pasta out unless one of my uncles was the chef. The Mentor spot was reopened under a different name by a man of questionable character who i knew personally. He said \"you don't have to wash your hands if you use enough toilet paper\". Sorry to gross anyone out. That was very vulgar, but I couldn't resist throwing that bit in. I think there's a location down near Cuyahoga Falls."}
{"text":"The pizza was terrible. I ordered two pizzas they were floating in sauce and not cooked through. When I called to tell them they said to bring back half of the pizza and they would credit my order. I've been going there for 20 years, sadly I won't be back."}
