{"text":"best iced tea ever.... iced toddy is wonderful. food is good and reasonably priced."}
{"text":"If you are looking for a great neighborhood coffee shop that roasts it's own coffee and unexpectedly serves wine..than you have found your dream spot.. Not to mention .. The amount of coolest people in the world that walk into this place on the daily.. The owners are friendly and the employees are one of a kind. Best little secret in Phoenix.."}
{"text":"The coffee is great, but the atmosphere isn't what it used to be. Service used to be efficient and pretty fast, now it takes forever because there is just the owner and like one other person that works there."}
{"text":"Anytime after noon, all drinks are only 3 bucks. which makes this so much cheaper than most places. The black tea I had was good."}
{"text":"My wife and I started going here before Christmas almost every weekend.  They usually have something going on like photographers, massage therapists, and they even had a Santa Claus for kids around Christmas time.  They have great breakfast sandwiches, smoothies, and coffee of course,  It's a great neighborhood spot!"}
{"text":"After moving where a Starbucks isn't in walking distance, we found Matador's Coffee that is close enough for a Sunday stroll. It's nice and cozy and had a lot of things to choose from for breakfast, brunch or lunch! I've been trying out different iced lattes and coffees and all have been great! The sandwiches are made after you order so nothing is just put in a microwave. The pasta salad is great, too!! My husband ordered it once and I ended up devouring it. Nice sized portions. Has both indoor and outdoor seating, which is great because I don't like to leave my little pooch at home!"}
{"text":"The muffin I had was still and dry the menu board was hard to read because of the Sun. I ordered a breakfast sandwich for someone else it looked good and they said it tasted good it was prepared very quickly"}
{"text":"http://www.matadorcoffee.com | 32nd and Union Hills (across from PVCC)

 

I have been driving by this place for a couple of years now and have always wanted to stop in, but it was usually on my way to work (don't have time to stop) or after they were closed. Driving home today, I suddenly realized that I am right in front of it, and I don't have anywhere specific to be at the moment... Perfect!

It is a very cute, dark little place that seems very comfortable.

There were some customers hanging out, and one of the baristas walked over from a table and greeted me along her way to behind-the-counter. I was getting ready to order my typical drink (iced latte w/honey drizzle), but I wanted to make sure they had honey available first, so I asked her. She showed me the bottle kept behind the counter, so I proceeded to order my latte.

She offered to put the honey in with the espresso so it melts, which is much appreciated, but I actually prefer it drizzled over the ice once it's done because I get a couple chunks and then the remainder slightly sweetens the latte. It was pretty cute, though, 'cause she kept trying to be really helpful with the honey, so it ended up being a little more complicated than it needed to be...I'm used to just ordering a latte and drizzling it myself at the condiment bar, so I didn't think to specify, and I actually think it's great that she was being so accomodating, so I'm not complaining at all (although the guy behind me might not have thought it was as cute as I did, ha). But she was really friendly the whole time, and we were having a conversation about different types of milk and blah blah blah, and then she finished the drink and allowed me to drizzle my honey on it.

I thanked her and picked up my latte, lid, and straw to assemble it somewhere else so I could get out of the way of the guy behind me, and then I realized that I was still holding on to my money. \"Oh, I guess I should pay you, ha!\"

I'll definitely go back to Matador Coffee when I'm in the area. The service was fantastic, and my latte was good as well.

Oh, yeah, and it was double-punch Friday, so I got two punches on my soon-to-be-punched-again card! (Don't know if that's a valid weekly thing or if she was just being nice) :)"}
{"text":"I keep trying to give this place a chance but ever since the new owners took over it sucks. The quality of the food has gone down and you will wait forever for a sandwich. They are only capable of making one thing at a time and are always apologizing for the wait or for being out of one thing or another.  The guy who made my sandwich pretended to be shocked that a key ingredient was missing, then looked all over for it and admitted they were out of habenero jelly. I got mustard instead, on the \"spicy habenero turkey sandwich\". Save yourself the time and frustration and go somewhere else.  This place won't be around for long."}
{"text":"I have been there on three occasions and have been disappointed all three times. The first time a dread locked girl \"forgot\" to make my sandwich. 
The second time (same girl) I asked for no cheese, only to get a huge heaping pile of cheese. Also, I ordered a latte and noticed the milk was a little off so I mentioned that it tasted sour and she said \"Well it's not. Our coffee is supposed to be bitter\".
The third and last time was no better leaving me with a wrong drink, my husband without his OJ and water bottle and a sandwich that took 25 minutes to make! Same girl!! She's got a black tattoo sleeve and is as sweet as can be but dumb as a chump. Or maybe that was me for thinking this place could get my order right. Try 32 Shea....better coffee and quick service. Hell, go to the Circle K on the corner....you'll be happier."}
{"text":"This place is great. They have great coffee and good service. The employees are always helpful. I go to school across the street so I love that they extended their business hours."}
{"text":"Really great coffee and even has an awesome vibe for simply hanging out. It is always fun finding a new coffee shop to go to especially one that is locally owned and even does its own roasting. Definitely worth a visit!"}
{"text":"This is a great stop off point during my pool service route.  If you are hungry, their breakfast burritos are huge and tasty! 

Their coffee is good and fresh.  They make an excellent cold brew that is perfect for the hot summers here in the valley.  Go see 'em - they will take care of you!"}
{"text":"I have a love/hate relationship with this place.  The service can be slow slow slow especially if there are 2 people working, so with that in mind I never stop when I am in a rush.  They used to have the best scones and muffins...but they are now getting free pastries from somewhere (generic danishes, jelly donuts etc), and while they keep telling me they occasionally make baked goods ...you never know when it will be.  I've been there 3 times this week and twice they didn't make any and once they were sold out by 9:00 am.  (which would lead me to believe its popular so why not make them???, but whatever).  My biggest problem is the amount of time dirty dishes are left on tables and how unclean the tables are when you go to sit at them.  I don't drink much coffee I stick to black tea, and hot chocolate but I was asked by an employee, \"Why do you come to a coffee shop when you don't drink coffee?\"  Felt very unwelcome, so if my money isn't good I guess I can take it somewhere else.  I want to like this place, and then every time I go there I don't have a great experience.  Maybe I'm just expecting too much?"}
{"text":"What a marvelous coffeehouse! The best iced mocha I have ever had, great eclectic music, delicious food, and friendly servers .... they've always been happy to share their favorites and give tasters of the daily brews, which are usually roasted on-site and change regularly. I love the El Toro for breakfast and the herbed chicken sammie for lunch, but I have never had anything not scrumptious. I have spent an afternoons reading and working on my computer (good free wifi), and never felt pressure to leave or consume more delicious things. Although the happy hour specials (buy 1 frozen drink, get 50% off the second, 2-4pm) make it easy to indulge! They recently added an entire bookcase of looseleaf teas, in addition to a great selection of roasted beans. Stop by for a great drink and all the things a coffee house should be."}
{"text":"This is great local coffee! I tried from Whole Foods, Casa Blend, and it was very fresh really delicious.  Much smoother than many other popular roasters in the Valley."}
{"text":"Excellent local coffee shop.  Roast their own.

Nice decor, olé Matador!

The lounge chairs and sofas in the back are cozy and awesome!  Just wished the lady using it would stand up...

Great coffee overall!"}
{"text":"Excellent coffee shop. I'm a particular fan of the Caramel Mocha, as well as the fantastic breakfast burrito. Great ambiance, extremely friendly people, and always good music being played, whether it's live or recorded. Check out the open mic night on Thursdays and the various artists they feature on many Fridays. My favorite coffee shop in the area, bar none!"}
{"text":"Awesome environment, fresh coffee and an excellent breakfast burrito. and all-around winner!  Only a mile from my house. A definate regular for us. Great to see such high quality coffee in Phoenix"}
{"text":"GREAT COFFEE.
We go though a pound of coffee a month and I've been enjoying Matador's coffee for months now. Last month I ran out of coffee so got some Kirkland brand at Costco thinking it wouldn't be so bad, but ew! I was so wrong! It was so horrible that I couldn't even finish the cup. My husband and parents-in-law who are not a coffee snob like me and drink coffee with lots of cream and sugar told me that even they can tell how Matador's coffee is fresh and has great aroma.

I give 4 stars because they don't have much selection of beans. What I mean is I haven't seen more than 2 kinds of beans at a time (usually one medium roast and one dark roast), so I have to go with whatever they have in medium. So far I tried Breakfast blend, Guatemalan (very similar to breakfast blend), Brazilian, Mexican, Ethiopian Harrar (dark roast), and Columbian Supremo (my favorite of all). They are all great coffee, I just wish I could go back to get the same kind when I want, but I guess it's the perks of shopping at small local shop."}
{"text":"I enjoy going to the Matador. The staff is really nice and fun to talk to and the coffee is great! In addition there is free wi-fi!

The only downside is their hours. I came there to do some homework last week and it looks like they are closing at 5pm which is a huge bummer! If they stayed open later that would be awesome!"}
{"text":"Underrated...this seems to be a theme for me lately.  These guys are solid.  I am doing all I can to support local business.  And not just any local business will cut it with me.  I will try you once but you better have your game face on and these guys do.  Quality Coffee and the Food is a lot better than you may think.  Especially for the price.  I got a huge Breakfast Burrito (on a real plate) for $3.50 what??  It is easy to just drive by and go to a Starbucks but we as a city need to go out and try local places.  It does a lot more for the community than you know.  And they are great so do it.    Life is short...stop and smell the coffee.  I just handed them their new t-shirt.
P.S. I am a Starbucks guy but am slowly changing my ways I will miss the drive-thru service."}
{"text":"Went here recently with a lady-friend.  I've been dying to take her here and our vacation gave us the opportunity.

She doesn't drink coffee and when she asked what the \"barista\" recommended that didn't have coffee in it he rudely said, \"Go to Starbucks down the street.\"

Despite my natural instinct to choke him, I quietly ordered a coffee as to not start my  vacation badly.

My lady and I went outside to have our drinks.  The \"barista\" left his post and sat outside too, with his friends.  They went on to heckle and by heckle I mean shout loudly, at the ladies entering the tanning salon a few suites over.  They were shouting, \"CANCER!\", \"SUN IS FREE, STUPID!\" and such.  Hey, employee at Matador.  They know, they don't care.  Shut up.  I'm pretty sure that shouting at potential customers makes you the stupid one.

Oh, yeah.  The coffee was a shadow of what it was and the chai latte my girlfriend got was awful.

Never coming to this place again.

Man, I miss Mario and co."}
{"text":"I will keep this short and sweet.

Service - Young guy. Really friendly. Solid 5

Coffee - Americano - really weak.  Maybe I should have asked for another shot... I think my large Americano only had 1 shot... Weird. 2 stars

Food - chicken Sammie - chicken was ok, little dry. Wasn't expecting a lot but the tomato was not ripe or fresh. Disapointing.  2 stars.

Atmosphere - music was way too loud.  Mostly college kids.  Everything was dirty.  The tables, the chairs ripped, the floor carpet was gross.  Tiny flys everywhere because it was dirty.  If I had to use 1 word it would be sticky.  Cobwebbs and dust everywhere.  1 star is being too kind.

Overall - would not go back due to the filth.  If you aren't going to clean it, hire someone to."}
{"text":"We still frequent the Matador when we get to that part of town, and they are STILL amazing. Sarah, I believe is the owner of the place, and she is always working hard, and always remembers us. Still love them, have never ever had a bad experience with any of the staff or any of our drinks or food. YUM!"}
{"text":"This place is amazing. Coffee is fresh, the food tastes great and the staff is super friendly. The owner Sarah is one of the kindest people I've ever met. Definitely will be back as much as I can! Would give more than 5 stars if I could!!!"}
{"text":"Love, love, love Matador's coffee. I'm a coffee snob, having been born and raised in Seattle, and this is the best place for coffee in Phoenix. Starbucks, Tully's, SBC, etc., don't compare to the quality of coffee you'll enjoy here. The staff is always very welcoming, and the vibe is very chill. With purchase, you can take advantage of their wi-fi. 

IMO, the only time anyone should frequent a big name coffee shop is in Seattle, otherwise, skip it. It doesn't taste the same outside of WA. I highly recommend the Black and White. It's my favorite thing on the menu. Come hungry, and enjoy a delicious breakfast burrito... with bacon. It's huge, and nice to share with someone while you enjoy your coffee."}
{"text":"Awesome coffee! Great friendly Manager and staff! Indoor and outdoor seating with great delectable delights! Love the art paintings too!!!"}
{"text":"This place is AWESOME!

I was yelpin for a place nearby me with free wifi and coffee so i could get my morning fix on.  Matador came up first and had great reviews so i gave it a shot.

I am sitting inside right now on one of their big fluffly chairs comfortably working on their free fast wifi, sipping their AMAZINGLY good coffee and enjoying every moment of it.

The people behind the counters are super cool and friendly and seem to know every person that walks in here.  This is a very cool local coffee spot.  And my god.. i never want to go back to starbucks again...their coffee is top notch.

Love it. Thanks Matador! You rocked my socks this morning. I will definitely be back...how's tomorrow sound?"}
{"text":"I come here almost every morning, and love it! The music is always good, and the staff is always so friendly. The owner, though, is what really impressed me. She works on a regular basis with the staff, instead of on a computer at one of the tables like I have seen so many other places. It's a very refreshing place that will become a regular spot if you go in."}
{"text":"Their coffee is delicious. It's strongly roasted &  without bitterness. Excellent.
I also tried the signature hunk-a-burnin-love Sammy. A creative combination of grilled peanut butter, bacon, honey & banana. It was tasty.  It sounded so weird I had to try it. I was surprised at how good the pasta salad was. It's usually a terribly bland side that I skip. This one wasn't"}
{"text":"I buy the fresh today whole bean coffee every few weeks for home. only thing I would change is the opening hours. The place just doesn't open up early enough for me to get breakfast and get to work on time."}
{"text":"I've been on the hunt for a nice coffee spot and this is a really great spot. I've had the iced Americano and Soy Latte a couple times, and they've both become a staple. 

There was plenty of space to work or sit, and the artwork on the walls interesting. A nice spot to come back to."}
{"text":"Absolutely love this place!  it's my Sunday morning caffeine stop on my way to work those overtime hours.  
I always go with a drip coffee with cream and I'm never disappointed.  

Plus, every size cup is the same price!  doesn't get much better!  

Local art on the walls and just a relaxed, funky vibe...I really hope to have a Sunday morning just to sit & relax for a while."}
{"text":"First, it is great to see a local company  roasting their own beans on-site!  The smell is intoxicating.  This little family run, locally owned business puts out some really great coffee and some enticing coffee drinks.  They run great specials and if you friend them on Facebook you can learn about all types of little specials they run.  To top it all off, the owner's father bakes many of their muffins, breads and other treats.   

Ok, wait, it gets better. Matador opened up last night as a wine bar too!! A few of us attended to celebrate my Canadian friend's green card, finally!  But that's another story.  Matador is the perfect coffee&wine bar because it is cozy and personal. We had the sangria which was really great. Not -too-sweet, crisp, tasty and full of fruit!  

I looked over the wine menu and it looks like they really took their time in selecting some nice wines and some great beers to feature.  They have  a small appetizer type menu with dips and bruschetta.  We did not order food but in observing the other tables the food looked great.  

I will be back to sample some of the wines and an app or two and,  as always, I will be in for my fresh roasted coffee!"}
{"text":"Great relaxing atmosphere. Across from PVCC makes it a great place to get a quick bite before or after class. The frozen latte is a perfect blend of coffee and creamer and not to sweet or bitter. I had the El Toro for breakfast and i loved it! A bagel bun with egg, cheese, bacon, turkey green roasted chiles and topped with sirracha. Was surprised it wasnt extremely hot as sirracha usually is."}
{"text":"My favorite coffee shop! Ambiance is ok, but coffee is great!!!! White chocolate raspberry soy iced latte, yummmmmm."}
{"text":"The best coffee I have ever had ! I recomend the Sumatran if you like the rich dark coffee but my very fav was the Brazillian. 
Now they have sangria and some other drinks in the evenings , the food is great,very friendly staff and patio with heat makes for a nice cozy place for a date."}
{"text":"Yummy coffee and baked goods. Great breakfast sandwiches. Nice place to sit and enjoy a cappuccino in North Phoenix."}
{"text":"I am on this recent mission to find the best place near me to get fresh and delicious coffee and I really enjoyed the place. I ordered a cappuccino and it was very good and did not require any added sweetener. The barista even asked me my preference (heavy or light) which I appreciated because I always forget to mention that I like a lot of foam. I also ordered a grilled cheese sandwich with pasta salad and it was good. The bread was nice and crispy and they used good cheese. It was a comfortable place to spend some time."}
{"text":"I'm in town from Chicago visiting family and drove 4 miles for this cup of coffee! This was not a disappointment, rather I got the family hooked too. Cute shop, FRIENDLY team, clean homey atmosphere. Perfect place to catch up with friends or get work done. #illbeback"}
{"text":"Free WiFi, excellent coffee and a comfy sofa.  The baked good are amazing (Mama makes them)

Mario and his team are, dare I say it, the REAL masters of exceptional coffee in the North Valley.

The shop is a bit tiny, but the product is extraordinary.  Go for the coffee, stay for the baked goods..."}
{"text":"GREAT experience at Matador this morning!  Stopped in after seeing other yelp reviews. Barista was super friendly,  atmosphere was really cool & fun, had a pumpkin nutmeg latte that was awesome and the suggested breakfast burrito was great too. I'll definitely be back! Check it out!"}
{"text":"Came in a few times and had the breakfast burrito. YUM!  Also got a chai latte... also very yummy.

Their wifi is free and very fast.  Employees are very friendly and personable.  They all seem like they love there job which makes the atmosphere more enjoyable.

I'm new in town and have found my new trusty coffee shop :)"}
{"text":"Friendly staff, great coffee!  We tried the ciabatta bread breakfast sandwich and breakfast bagel. Both were made fresh and tasted yummy!! I have a feeling we will be regulars soon."}
{"text":"This is a nice little find in the north valley. I moved from Arcadia in the last year and was sad to leave my favorite local coffee shops behind. But I will be coming back to this place. The espresso is pretty good. A rather unique taste. Sort of reminds me of Urban Bean but a little better. They also serve beer at night which I thought was a nice touch. IF you are in the area and need a pick me up, this is your place."}
{"text":"Was looking for a great cup of coffee and a decent pastry this morning. Thought I would try Matador Coffee as it had good reviews listed and less than a mile from my house. I asked them what pastries they made on site and was told the scones. So I tried their strawberry scone. It was terrible. It was like eating a donut nothing like a scone. And a bad donut at that. And the coffee was nothing more than ok. I am comparing this place to my favorite coffee place called Village Coffee at the Village of Haydn. They have excellent fresh roasted coffee and great pastries. Unfortunately I don't think I will be coming back."}
{"text":"First time there and will be back. Good, endless coffee and el toro breakfast sandwich was awesome. Nice local spot."}
{"text":"This place has so much potential. New owners will not stay open for long, and will go out of business. My last two visits have been awful on every level. They seem to be completely disconnected from the basics of running a coffee shop. Health Dept. needs to visit."}
{"text":"I love this place!
Great coffee, always my go to spot between classes since it's right across the campus.
Customer service is great, and coffee is DELICIOUS and not too pricey. Probably better then Starbucks not going to lie. It is so nice inside too. Cozy & a great little coffee shop to study. Will always be my go to place! :) awesome sandwiches and breakfast burritos too."}
{"text":"Cafe has dark interiors but is comfortable and spacious. I ordered a latte, and it was weak. It's not the worst coffee I've tasted (that honor goes to It's A Grind), but it can be so much better."}
{"text":"Matador is my go-to coffee shop when I'm anywhere near the area and I even go out of my way to buy their beans for brewing at home. When I buy beans there, I always get two pounds, one ground in the shop for making toddy at home and one whole bean for grinding right before I brew it in my Moccamaster.  I love the Peruvian brand the most, but also enjoy the Mocha Java and Guatemalan..but really, I'll take whatever they have in stock, it's all fantastic and fresh. They give you a free coffee with the purchase of beans, and I opt for their cold brew (which is the only slightly weak point for me- it could be stronger but that's prob just me because it's the same level everywhere I go). 

The staff is always friendly and knowledgeable about their coffee, which is a major plus for me. The one barista (and I feel terrible for blanking on her name right now) remembered me after I hadn't been in for almost a year (I was pregnant and to my horror I couldn't even stand the slightest whiff of coffee..not that I would have drank any but I couldn't even go into a cafe for an herbal tea without feeling nauseated!) She asked me specific details about conversations we had had months and months before-completely winning my loyalty to the shop that employs her!

I chose my eye doctor and chiropractor based on their proximity to Matador, that's how much I love this place!"}
{"text":"Perfect Capp... Not too hot.. Not too dry... & I like alot of espresso... Done! Friendly service:-) IM a complete sucker for a great coffee bar.. since I fell in love with coffee in the capital of java.. Seattle..:-)"}
{"text":"I love this place!  I like their coffee a lot, like that they roast it locally, and the customer service is awesome.  The employees generally seem really happy to work there, and like getting to know their customers.  I like the little things they do as well, like having a punch card and not making you use it only for the cheapest drink.  Keep in mind that this is a local coffee joint, not Starbucks.  Each barista adds his or her own touch to the drinks and the ambiance, and lines don't move quite as quickly as a big rig coffee place.  Plan for that and you won't regret it.  Matador does everything to show how much they appreciate their customers and makes every effort to keep them happy, and it shows.  Every time I've been in there I've seen other regulars.  I've taken drinks to coworkers and friends and it's always been a step up from whatever their regular drink source is."}
{"text":"I want to like this place because it is locally owned, and their coffee is great, but over the last year it has gone down hill.  They used to have the most delicious scones and muffins... Now not so much.  The staff is always friendly, but don't go if you are in a hurry.  The place looks a bit dirty.  Food under the furniture, ripped chairs, tables chipped, walls with gauges in them that need repair and paint etc.  Still a big fan of the scram-bull, still better than Starbucks, but no longer 5 star."}
{"text":"My visit here was totally out of the blue.  It's not in the general direction (or distance) that I've driven for coffee here in Phoenix, but I am so glad I had to be this side for another errand! The vibe of this place is definitely \"cozy\".  There's no gross smell that lingers at a lot of other coffee shops. It appears clean, and the displays well organized.

I had the orange sunset to drink.  Tried their mediterranean plate - and after frequenting Dearborn, MI, I have high expectations for mediterranean and middle eastern foods.  This plate passed the test.  :) :) :)

My only regret is that this place isn't closer to where I live.  Though, I am sure I will find ways to make the drive.  I suggest this to any one looking for a chill place to read, study, or just catch up with a friend."}
{"text":"Is this place under new ownership?  It has new faces and the ambiance has changed.  The jazzy funky coffee shop feel is disappearing to oldies music.  The food and coffee is still the same, I just hope they don't install a big screen and show espn all day."}
{"text":"Have been wanting to step away from the \"mermaid\" and find a local roaster.  I've finally found my place in Matador coffee. A friend spoke high of them, so I stopped in to buy some beans and try some coffee. So happy that I did. The staff were wonderful, and very knowledgable. Even pointed out that I happened to miss a coupon for the beans that I bought. 

I tried a hot mocha, and it was nice and smooth, not biter or acidic like I can find at that other place.  Also, I picked up their Cafe Esperanza to grind and brew at home. They roast, package, and sell the coffee in the shop.  Also, when purchasing these beans, you'll be supporting AZ Leaderforce programs collaborating charities. Ground my Cafe Esperanza beans this morning, and what a great way to start my day, so smooth and a depth of flavor. Overall, A win-win altogether. 

So happy I found a new LOCAL coffee shop!  Go LOCAL and support Matador Coffee!"}
{"text":"Hands down the best coffee spot in Arizona (and I've been to plenty). After having Matador for the first time, I have been completely hooked and refuse to go to any other coffee shop! The staff is super friendly and they make me feel special by knowing my order when I walk in :) Everyone must try their White Mocha Raspberry Iced Latte! Perfection!"}
{"text":"Easily best place in North Phoenix for coffee. I always get a soy vanilla iced latte and it's always perfect. Prices are pretty average for a coffee shop. Also, if you're hungry for lunch grab a grilled cheese with green chiles, onions & siracha. One of the baristas recommended it to me and it was so messy and delicious! Only problem I had was connecting to the wifi but easily could have been my kindle. Right across from PVCC so great for any college students needing to get work done. Highly recommend it to everybody!"}
{"text":"Yeah, these guys know their coffee! Tucked away in this little obscure strip mall about a stone's throw from my house. I had avoided going there because they used to put this mannequin matador out in front of their place. It was sun damaged, kinda creepy and just BAD in so many ways. I know, I shouldn't be such a branding/marketing snob but it was just creepy, I'm serious!

That said, they have since removed said matador and we decided to give it a try. Yes, we should have gone way before!! Exceptional coffee and an awesome omelette later, I was completely kicking myself for not trying it sooner."}
{"text":"Disappointed... Went in with a friend, my coffee was quite bitter, and the service was unpleasant. It took 30 min to get our sandwhich while other customers walked out with their food in hand. This is my second bad experience so I doubt I will be returning. :("}
{"text":"Stickin' it to the man one cup at a time! If you think Starbucks is the only place for coffee then try this out. You'll soon learn how corporate America has been abusing your taste-buds.

Come find out what happens when you set aside the Profit and Loss sheets, the same store growth over last year charts, and the general ledger and see what happens when you start to care about the beans, the people and the community.

They have lunch food and alcohol (wines and beer) too."}
{"text":"Love their coffee, especially the Black and Tan, and love supporting a local business. You get a free cup of coffee when you buy a bag of beans! They also have a punchcard system on their POS when you run your card. The only thing that sucks about the punchcard is that it only counts each visit - not each bag (which kinda sucks when you buy 2 bags at a time).

The only thing that frustrates me is that it seems like the baristas are never sure when they will get more of whatever types of roasts in stock. It's such a small business, that you'd expect them to have better communication, but I guess not!

My only pet peeve with Matador is that 9/10 there is someone smoking at one of the patio tables RIGHT by the door. Really not appealing to have to walk through a cloud of cigarette smoke to enter and exit."}
{"text":"PROTIP: Compliment and be interested in my weird hair and you will get cool points. 

Super-friendly barista, small setting littered with ASU-West students cramming for.. something.

I'm not drinking coffee anymore so I don't jazz the little fetus in my belly, so I opted for a mint tea. The tea sachet is sewn and held in a cheesecloth kind of thing and it was really fantastic! I'll go back soon."}
{"text":"Loved this place even more than most little coffee shops. I'm not a huge coffee drinker so I always end up ordering something out of the ordinary. This time it was a chai tea freeze. It was delicious. Spicy and not too sweet. There was enough food on the menu to make things interesting and the interior was super cozy with lots of comfy places to sit. Definitely somewhere we'll stop again when we're around that part of town."}
{"text":"My boyfriend and I tried this place today. I got a Hot Vanilla Latte while he ordered the Iced Vanilla Latte. I was sad to see that my Latte wasn't served in a mug especially since we ordered food. Instead, both of our drinks were served into to-go cups. Now I am new to coffee, so I am not sure if I need to order a specific drink to get it served in a cup but I was looking forward to it. As for the flavor... AMAZING. It has the perfect balance of flavors and I found that I like their Iced Vanilla Latte more... Although, after my Hot Vanilla Latte cooled off a bit, it seemed to be sweeter, which I enjoyed. All in all, my boyfriend and I probably would not order food from here but as for the coffee, Absolutely."}
{"text":"The best coffee I've ever had.  It is so good that I'm not even able to stomach anything else.  The sandwiches and homemade pasta salad are great but the star attraction is the beans."}
{"text":"Love this place. Great service & vibe. Stopped in for a beverage while my daughter was at soccer. Just wanted a large black coffee with a shot of hazelnut. Barista asked me how dark I like my roast, and I told him I like it light. He said they only had dark roast brewed so he walked me through some light roast options and brewed me a fresh cup (and then a free refill). Super friendly. If you like indie & new wave 80's & 90's tunes (yup, that's me), this is a great place to chill with a delicious beverage. At least on a Tuesday at 5:00 p.m."}
{"text":"I popped into Matador yesterday afternoon (a bit after lunch time) for a pick-me-up.  I just love this neighborhood gem.  There's a nice comfy vibe and the staff is welcoming and accommodating.  They patiently fielded my questions about available sugar-free syrup options and happily indulged my request for a combination of syrups for my iced latte.  It was fantastic!"}
{"text":"I had a networking event scheduled at another location and when we showed up, they were closed, permanently.  We quickly took a look on Yelp and found Matador.  Called and were warmly greeted and encouraged to visit their location.  Thankfully, we did and WOW, what a wonderful place.  The staff was exceedingly friendly, professional, and courteous.  Everything you want in a \"feels like home\" establishment.  The spicy turkey was recommended and amazing along with a wonderful assortment of drinks.  I was very pleased and we'll be returning on the first Friday of each month in the afternoon for our networking.  We found a new home."}
{"text":"It's a locally owned place. It costs a little more than subway next door, but the food is a heck of a lot better in quality and taste. Everything I've gotten is delicious and lots of healthy options.  Free wifi. I used to like this place a lot because of their great Greek food, but anymore when I go they aren't serving food : ( They tell me they either won't be serving til 2:00 or they only serve in the morning?-it seems like unless owner is there you don't get served any food. I don't have time to check when he is there or not so I don't go there very much anymore."}
{"text":"Got the 20oz \"Dirt Clod\" - a hot white mocha with a chunk of dark chocolate thrown in. The coffee was delicious! Not too bitter or over roasted. The chocolate didn't really mix in so I got a nice chocolate sludge when I finished the coffee, which I enjoyed. Overall, pretty decent. 
The inside really appealed to me - a great space to study or just hang out and read. Tons of cushioned seating, art, and just generally aesthetically pleasing. It felt homey which is always a bonus for a place that you'd want to stay for longer than it takes to get a coffee to go.
I'd go here again if it weren't so far away (right across the street from PVCC)."}
{"text":"This place is phenomenal. The coffee, chai frappuccino, and iced black tea are delicious! I've never had black tea like this. 
Don't get me started on the milieu, it's wonderful. I don't know what station these guys play, but  with as much rotation as The Smiths, The Cure, Depeche Mode, New Order and Soft Cell get, I would be there every day if I could. 
The decor is great as well. Pretty and dark, to complement the music maybe."}
{"text":"Drip coffee is pretty good, but of the several visits I have yet to get anything near a decent espresso drink. For example, the small americano has a single shot and then water. The extra large (Why is there an extra large?) has a single shot then water."}
{"text":"Tired of your chain coffee joints? In the Desert Ridge vicinity? Well then I suggest you high-tail your ass over to Matador.

Totally awesome decor and bitchin' coffee. Friendly and COOL baristas.

Yeah, just go. GET SOME!!!"}
{"text":"Have an issue with keeping chai in stock. Great place for students to do work with the free WiFi. I personally like the food served here. It's a cozy spot to get out of the heat. They sell ground coffee too."}
{"text":"My favorite neighborhood coffee shop! GREAT coffee - great service & now they have added more pastries!!!"}
{"text":"Good coffee good location, but not a place I'd want to hang out. It's not that inviting to me for some reason. That said, I do really enjoy their coffee!"}
{"text":"Absolutely delicious coffee, made precisely and exqusitely. Great java ambience with tables to meet inside and outside and couches to lounge. The jazz music gave the place a soothing feeling and made it all more enjoyable to be there. I don't live near but this place is worth the drive for me. Coffee lovers, I highly recommend this place!"}
{"text":"Every so often for convenience purposes only I will buy Coffee beans from Costco.  This leaves me a very sad person for weeks on end until I get through the terrible coffee.  I will then come to my senses and stop at Matador for beans.  They give you a free fresh drip with each pound you buy.  The only thing that makes me sad is they aren't open early enough (6:30am) to pick up a coffee for the road on my late days.  Still, they are worthy of five stars."}
{"text":"Frozen mocha....not very good. Has a powdery taste. Regular mocha, pretty tasty. 

Ordered a breakfast sandwich and a burrito...15 minutes and we are still waiting. 

The kid at the counter is nice, although seems inexperienced. And the guy making the food is so rude. Not only to the kid running the counter, but to everyone. Stopped in for a \"quick bite\" and have been here for over 30 minutes."}
{"text":"My husband and I watched an employee scoop ice into a cup, and then throw the scoop, handle and all, back into the ice. As someone who got a life threatening kidney infection by way of eColi....I'll pass. Basic sanitary standards, people. I will never be back, your tea isn't worth me dying."}
{"text":"I'm having a hard time with this review. I was really frustrated earlier when I pulled up to the store 10 minutes before closing and the employee closed and locked the door in front of me, but I have since calmed down. I do really like their coffee but This makes trip #4 that I ended up at Starbucks because the Matador was closed. I think they have great coffee, adequate (not friendly but not rude either) service, but the hours are so very limited. With longer hours I would for sure frequent them more but as it stands now, it's not worth it for me to go back a 5th time"}
{"text":"This is a classic coffee shop with plenty of great seating, good music, and powerful wifi. I'm here now and having a lot of fun. The wifi connected to Yelp really well. I'm drinking really great coffee. Make sure to get the Double Boch if they have it. :)"}
{"text":"I love their coffee and the staff is amazing. Hands down my favorite place!! 
I always get the Orange Sunset, cold no ice with almond milk and it's delicious. 
Their pastries and food are great as well. A must try for anyone who hasn't been!"}
{"text":"I by almost all my coffee for my drip machine (yes, my automatic drip coffee maker...get over yourself) from here.  Mainly because they are close by  They roast their own coffee and have some excellent roasts.  My favorite so far is the Peruvian.  But there are still so many to try.  Their roasts are constantly changing, which can be annoying when you find something you like and next time it's gone.  

The people here are super friendly (both employees and guests).  The crowd is mostly 20-somethings (PVCC is right across the street), but I've never felt \"the old man\" when I'm in here.  They are not as specialized as Cartel Coffee, but offer great coffee and comfortable environment and a very pleasant experience."}
{"text":"I've been \"living\" out of this coffee shop since it opened, so this review is long overdue.  Matador has the best coffee in the country-- hands down.  I honestly can't drink anything else.  When I travel, my wife & I always pack along a couple of pounds of Matador coffee.  (We have back-up Matador coffee stashed at both of our in-laws' houses, too)!  Ususally, I buy/drink the Espresso Roast, or the French.  However, the Mocha Java is the best-- ever!  In the shop, I'll get Americanos or Lattes.  The Americanos are always made just right.  Y'know...  with that slight frothy top-layer. This is a family-owned business with a long-lineage of coffee roasting and cafe operation.  They know what they are doing.  Everyone who works here is great too--  knowledgable, friendly, & fast baristas.  Great environment.  The shop is decorated w/ vintage matador/spanish bullfighting posters and old italian renaissance paintings.  Great music always on their soundsystem -always changes depending on the barista - but it usually varies between, jazz (big band, crooners, beebop), underground garage rock, indie, electronica & downtempo, 90s and new wave.  Cool, friendly diverse crowd always here--  families, college kids, hipsters, business ppl laptopping, artists, people on dates, etc.  The evenings here are great too.  They transform the space into a wine cafe w/ \"afterhours\" specialty coffee drinks (like the Mafia Hit - scotch & amaretto in a cappucino) + an evening menu of various apps and hummus platters.  They dim the lights and all the tables are candlelit, btw.  Makes for a nice vibe- think old italian cafe.  Great spot for the wife & I to bike/beachcruise to and grab a glass of wine in the evenings.  PS- they distribute their coffee to many other establishments around town."}
{"text":"Yelp you never cease to amaze me!

Found this place on yelp, obviously :). Walked in to find a cozy yet sophisticated atmosphere and walked up to the Barrista who was behind a bar with some comfy stools. The only downside to the place is that the menu is a little hard to read. I ordered the equivalent of a mocha frappe and it simply soo savory! Just the right blend of coffee and creamy goodness. ...this place has personality and I will definitely be back to chill with a bev in hand"}
{"text":"Neat coffee shop in north east Phoenix. Good seating area with tables, chairs, sofa and lazy chairs. My first visit was for a cup of coffee. The home made coffee brew was prepared. I handed my debit card for payment and was hit by ten cents fee for using my debit card for a bill under ten dollars. The debit card fee was not stated when i ordered and there was no visible signage. The coffee was great but the ten cents extra charge for using my debit card made my visit short. My search is on for another locally owned coffee shop without the ten cents debit card fee aka coffee tax."}
{"text":"I recommend you try Matador if your at 32st and Union Hills. I used to live very close to this little coffee shop. The owners used to roast their own coffee here but have moved that operation to a better location. Their coffees are really good. 

They have a liquor license for a full bar with a minimal essential stock of beer and luxury spirits. I order a breakfast egg sandwich which was delicious. The young gal that slaved for me was super cool. 

Paradise Valley Community College is right next door to the South, so this is a good study hall."}
{"text":"Not impressed at all. Went here because it had good reviews and it was close by. Pastry was dry. I ordered a specific drink and they did not have what they needed to make that specific drink so they changed my order without telling me. I found this out after I started questioning what was in my drink. They also did not have all the ingredients they needed for the food we ordered. Dissapointed."}
{"text":"Hands down the best coffee around!  I actually go out of my way to get coffee at Matador coffee.  My husband and I also keep a good stash of Matador coffee beans stocked up at home and can not live a single day without having an amazing cup of joe or an espresso.  If you are a coffee connoisseur then this coffee is for you! I Highly recommend Matador Coffee!"}
{"text":"Nice place to hang out and get away from the heat. Good ice brewed coffee and big breakfast sandwiches. For a coffee shop and bakery, there are no croissants. This is way it didn't get 5 stars."}
{"text":"Excellent coffee and food! A great place to hang out with friends or by yourself. Very intimate with a Spanish twist"}
{"text":"Amazing place that supports local businesses.... fantastic coffee ++, great Happy Hour.... this place should be everyones local hang out...."}
{"text":"This place has this very nice western theme to it. Is very clean and really comes in well with all the decorations. I ordered a coffee with white chocolate and dark chocolate and tasted very smooth. I had a sandwich that blended some flavors very well with peanut butter, bacon, honey and banana. Service is great with the employees interacting with the customers and making it more of a enjoyable experience."}
{"text":"Coffee or latte ordered along with breakfast burrito..So coffee was great although I had the toasted iced marshmallow latte skip the chocolate-too dark with the choco....LOVED the burrito and I got extra bacon bcz appearently the smart ass counter guy did not put in the order in..I waited like 30 minutes before I realized he just didnt order it....I guess they use a tablet t pay so to sign your name I was expecting a stylus pen that comes with the tablet to sgn your name so I asked the barrista/smart ass can I just sign with my finger which than  to he replied well I would prefer you sign with something really sharp so it can scratch the tablet..I'm thinking -.First off I dont know you that well for your douche self to be joking like that I am a first time customer and I asked a relatively normal but serious question. So from that moment on my attitude was changed from I need coffee to wake up to fuck off pint size little man / bitch rage....Needless to say customer service needs help..Music was jazz so I was not a fan of the music either....."}
{"text":"I wish this place was on my way to work so I can stop more often! 

I ordered a 16oz toddy and it was very good. Seems like their ratio of coffee-water may have more water in it than other places, regardless the flavor was great. The barista was very nice.

The atmosphere is nice. There was a table of people playing some sort of card game and some other people hanging out on their laptops. I had two different people stop me and talk to me and were very friendly, safe to say it's a friendly environment. 

Excited to try this place again!"}
{"text":"I have never received a cup of coffee I didn't love from this place! And their breakfast burrito is likely the best in town! The staff is also very friendly and down to earth. Great food, great service! The atmosphere is really unique and welcoming, and always great tunes playing. Zero complaints from thia gal!"}
{"text":"Best coffee shop in the valley hands down. The roasts are better than Lux and the vibe is more welcoming. They will know your name the second time you come in and know your drink shortly after. 

The espresso is fantastic and the prices are cheaper than your local Starbucks. The baked goods are consistently good and the food is great as well. Try the herbed chicken sandwich! 

All in all a fantastic welcoming place with outstanding coffee, great prices, and very friendly staff!"}
{"text":"They actually roast their own beans which is rare in Phoenix.  Good, flavorful coffee here and polite staff too.  Good parking for the location and they have plenty of seating after they made some interior changes.  Nice place."}
{"text":"What a great atmosphere with great coffee and great food.  My wife and I shared One of their breakfast burritos.  It was fantastic!  You could tell all of the ingredients were fresh.  I had a mud clod to drink.  A mix of white and dark chocolate perfectly balanced at the perfect drinking temperature. The shop was clean and comfortable with several different seating options.  The staff is great, taking time to interact with each of their guests.  This is by far one of my favorite coffee shops in the Valley."}
{"text":"Love this place. Best coffee in town and always great tunes. Super friendly service too. Tasty pastries and breakfast sandwiches. Smoothies are delicious. I always try to support local places over corporate and in this case it's not just a matter of principle and really pays off."}
