{"text":"So excited to find a European food store close to home.  Right across from Costco no less.  Owner was so friendly and helpful, he found my ever elusive lingonberries and gave me a welcome candy .   We love to support local shops and will be back."}
{"text":"There are moments you find jewels hidden where you didn't expect.   After a trip to Best Buy in Mayfield Heights, I chanced upon a little store on the back side of a building off of Golden Gate Boulevard. I was both surprised and pleased. Mayfield Fine Foods is a little shop with a LOT packed inside. The store has breads, cheeses, candies, fish and meats from all over Europe, Russia and other exotic places, and for those who have emigrated here, you might find a little slice of home (or a whole cake, for that matter,) at this fine establishment. The owner is a kind soul and very helpful; he knows his stock well.   The only downside to this place is how hard it is to find; the store is on the BACKSIDE of the address, so make sure you head around back, you wont be sorry.   If you're looking for everything from kefir to caviar, this little shop may just be for you."}
{"text":"People are friendly and some one is always there to help you when you need it! Great choices of fresh produce. LOVE this store!!!!  The best Russian food store in Cleveland"}
{"text":"I moved from Baltimore hoping to find a store that carried foodstuffs from Eastern Europe for a fair price, and it took me almost a year to go off the beaten path and find Mayfield Fine Foods.  Very inconspicuous looking from the outside, and very plain looking on the inside, but they stock absolutely EVERYTHING in terms of Eurasian imports. Caviar, pastries, candy, meat, cheese, canned goods, juices, cookies, waters, juices, and especially tea. The tea selection is huge, and all super high quality. It's the only place where I buy my tea from now.  My favorite part is how they offer a discount for paying with cash, and bulk discounts on cases of sparkling water. This makes shopping here the best compared to other similar niche markets in the area.  I always stop by here on the way back from the Costco next door, and you really should too. You might be surprised with what you find there."}
