{"text":"carry out disaster. ..they come to your car so don't see the area inside. ..dirty storage area for junk so do yourself a favor and. don't go but if you walk in the back door you will understand"}
{"text":"Service was very friendly, polite, and responsive. Medium fried seafood platter was huge. I can't imagine the large.  I had hoped not to gain ten pounds at dinner so the idea of a plate with fries, fried hush puppies, and fried seafood was a bit off putting. They had salad on the menu, but one went by my table and it looked like someone threw a head of iceberg lettuce into the ceiling fan and covered it with dried bacon bits. I thought the restaurant was clean. Not great atmosphere but fine. Food was okay. Kind of hard to screw up frying everything."}
{"text":"Came on a Friday night and the place was packed. No wait though. Soups were very tasty - lobster bisque tasted delicious but no lobster pieces in it and a little watery but great taste. All the food was quite good. Nothing greasy. Platters were full. Wait staff very friendly and service quick considering the amount of people there. Family friendly place. Great prices!"}
{"text":"great food and excellent service with reasonable prices! Will be back soon! Thank you so much for having us!"}
{"text":"This was my 2'nd visit to this restaurant, and just like my first visit in 2013, it was extremely good.  The parking lot was totally full - which is to be expected on a Saturday night!  Once inside, you see that this is a big restaurant with several dining areas, and there were lots of people here.  However, we were quickly taken to a table and in less than 2 minutes, our waiter appeared.  Once we were ready to order, we received our food in less than 10 minutes.  It was UNBELIEVABLY quick, especially since neither of us ordered anything broiled or grilled - which takes longer to prepare, as stated in the menu.  I ordered a \"senior\" 2-combo platter with fried scallops and fried flounder, and my husband ordered the salt/pepper fried flounder.  In this restaurant, \"senior\" doesn't mean age-related plates only available to older individuals, but rather a smaller-portion plate.  It gets confusing to those of us that aren't quite seniors, but our waiter explained it to us.  After a bit, I overheard a waitress explaining to another customer the same deal with the \"senior\" plate - except this young lady could have actually been a \"senior\" ...in high school!!  :) 
The food was NOT greasy at all; I had a nice sized piece of flounder that had some \"meat\" to it - if  you will, and the scallops were very good as well.  Their tarter sauce contains dill pickles - which I immediately loved!  I only used a little of the cocktail sauce - not enough to give a good opinion on it - but I'm thinking it could stand a bit more horseradish in it.  Their hush puppies are circular, and resemble cake-doughnuts.  
Tonight, I saw that their health grade was a 97.5, and from what I could see - the restaurant was as clean as a whistle - and I certainly didn't see any insects or bugs!!! 
Service was quick, food was great, and the restaurant was very clean! We were in and out of there in 45 minutes - tops!  Again, on a Saturday night at approx 6:35 PM?  That is unheard of anywhere."}
{"text":"Well, this was unmemorable.

The parking lot was packed, and always is so I had some expectations but when I walked in I immediately noticed a very dingy eating area.  Not dirty,  just....tired. They have a large fish tank but I didn't see fish.  Just algae.

We were seated quickly and despite being extremely busy with a large party, our server was at the table quickly for drinks and our order.  The menu has the standard southern variety of southern fish camps, which is basically anything you can bread and throw in a deep far fryer. There was nothing memorable, and nothing that would bring me back there to eat. It seems to be quite popular with the local crowd, and I'm not sure why that is.

I don't believe I will be returning to this restaurant because I just didn't get a good feel of it, and I didn't really enjoy the food all that much."}
{"text":"I had the fried white fish with fried shrimp and the wife had fried shrimp.  My shrimp were little popcorn and her's were big ones.  We ate our fill and spent around 20.00.  What a deal.  No beer but good fried seafood."}
{"text":"I took an out of town guest there for dinner on March 15.  When our meals arrived, we were greeted by a baby roach crawling across the table.  Baby roaches suggest that much larger ones are present.  We informed the manager, who did not seem at all phased that a roach had appeared at our table.  The only thing he was concerned with was making sure the other patrons were not aware of what happened.  He offered to replace my friend's meal, but took nothing from our check and offered no apology.  I will NEVER, EVER return to this place.  All I cay say is eat here at your own risk."}
{"text":"Our first time there. Seated right away but near the kitchen (there was other tables available ... we should have asked to move but not a big deal). Waitress was friendly and responsive. Food portions were BIG. We had the calamari for appetizer --- wasn't bad. They put 
 pepperoncini peppers on them ... it was very good and a twist on a common appetizer. My wife ordered for us and she chose one of the platters (fried) that combined fish, shrimp, scallops and oyster along with french fries and cole slaw. We couldn't eat it all. The food was not overly greasy and it tasted OK to good. Overall the food was worth the cost. The service was good. The place could use an update inside. We will try it again."}
{"text":"KACHOW. My grandparents always go. They have a fish tank . My favorite fish is Nemo. He gets lost in the ocean, and they have to find him. I love my grandma, and she loves me too. She loves this place, and you should too!!"}
{"text":"There salads come with Bacon! lol! There Cheese sticks are good and jumbo shrimp is even better! The catfish wasn't done right to my tasting but happily they substituted and gave me a few dollars off my plate."}
{"text":"I am in Town for business, staying across the street at the Hampton Inn.

NO BEER! Or wine was my only disappointment but Wonderful Fried Shrimp dinner and excellent, attentive staff.

I will be happy to return."}
{"text":"The parking lot was full and I expected to wait but the place is huge. Seated right away and waited on in minutes.

Everything that came by my table looked good so I decided to try the Mayfair platter. Boiled shrimp, fried shrimp, fried oysters, fried scallops and fried flounder fillets. 

Excellent meal. 

Next time I plan to be healthier and try one of their broiled platters"}
{"text":"Hands-down the absolute best seafood that we have had since we moved from New England 14 years ago!  The seafood was fresh and delicious and the batter on the seafood platter items was absolute perfection for this New England girl!  Great prices, excellent menu selections and very friendly service!  I can't wait to go back!"}
{"text":"I came here on a Friday dinner with my wife. We enjoy places like this, especially when we're craving our favorite fried clam strips. And after I found out that Captain's Galley in Matthews had closed, I was nervous that we wouldn't find a similar place near us. Then I was able to find this place online, and to say the least, we were not disappointed. The parking lot was packed. It's a casual family friendly atmosphere. And ofcourse, the food was delicious! Eveything was perfectly fried and tasted great (i.e. not greasy or damp with oil). The service was also friendly and responsive. But I would have to say their oyster stew was not what I expected, it was mostly a light milk and butter stew with just oysters and tasted watery with no flavor. I knew I should have ordered the clam chowder instead. They also had fried scallops which I thought were amazing. They were large sized and tender with a mild sweetness to them like they should be. I will definitely be going back as this will be our new fish camp joint."}
{"text":"We have been craving some king crab legs and crab cakes. I called the restaurant before going there to see if the \"Alaskan Crab Legs\" on the menu were King or Snow. The lady on the phone said, \"they are the really big ones\".  \"Big snow crab or are they really King?\"  \"King I guess\" This should have been my first sign not to go, but I was desperate.   The second sign was the type of restaurant it was.  It was not bad, but it just looked like it was a cafeteria at a workplace. I ordered calamari for an appetizer. It sounded good because it was supposed to be tossed with peppers. For some reason my brain was thinking it might be like Capital Grille's.  Um no.  The calamari was chewy like rubberbands and tossed with jarred banana peppers.  We didn't even get appetizer plates.  My husband ordered his crab cakes and they looked like grey hockey pucks.  He took one bite and could not eat it. My crab legs were actually snow crab and very very salty and watery.  This is not the way to cook any kind of crab legs. I would say the only decent tasting food were the hushpuppies and baked potatoes.  The service was great.  The waitress checked up on us very often making sure we had enough to drink, and she was very friendly."}
