{"text":"We had the Southwest Chicken wrap, it was really good.  
The resturaunt is really cute!"}
{"text":"I go down to the MHC often to get get ice cream. The service I get is great and they have a huge selection of choices. The prices are also really cheap. I recommend the MHC to anyone who needs to just re"}
{"text":"Very good cinnamon rolls ,coffee,and light breakfast. Highly recommended. The owners are very friendly,and I had good service every time I ate there."}
{"text":"Ive been there a handful of times the last couple of months and its definitely NOT the same since new owners. It seems dingy and dirty inside, the atmosphere seems less happy. The menu items have many of the same names but clearly different recipes. I didn't know the old owners, and don't know the new ones, I come from out of town to meet friends and really wanted it to be a success because I used to love going there at least monthly. Unfortunately, after 3+ strikes I will be suggesting our group meet someplace else."}
{"text":"Coffee was very good and cheap. Breakfast sandwich with sausage was wonderful. Owners are wonderfully friendly. 

This is a must stop for locals as well as someone just passing through."}
{"text":"This place is quite cute. Historic farmhouse building turned into cafe. Nothing fancy, but has a decent variety of menu options; something for everyone. It's one heck of a nice deli.

My friends and I have only had sandwiches. They are good sandwiches, but nothing wow's me. Portion size is small to medium - no footlong sizes here. The chefs take their time and really seem to like what they are doing, but the sandwiches just seem to miss on the details. For instance, I ordered the Maui Chicken sandwich. Awesome! I thought. I wanted the Cuban Club, BUT I don't want the pork. The Maui is all that WITH chicken. While the sandwich was piled high with moist, real PULLED chicken (in a red seasoning), it wasn't really that flavorful. The Asian \"slaw\" was barely one millimeter in depth, I couldn't determine what made it Asian, I couldn't find any red onions, the Angora-BBQ sauce was there but not tangy/mesquite/BBQ-y; and lastly, the red seasoning on the chicken might be perceived as a \"buffalo-style\" but I really couldn't feel any \"heat\" from it, so I still don't know what that seasoning was. The only thing that helped for flavor was the bacon (extra charge), but even that was on the blander side: no \"smoke\". As a whole, the sandwich needed a flavor profile: something with more slaw (quantity), more vinegar (in the slaw) and/or tang (from BBQ), bacon with flavor, and definitely more onions! 

Even at the bland side, I still liked this sandwich. It's not horrible; it's good, BUT it could be SO MUCH better. 3.5/5

My friends got the Tuna cheddar sandwich and the Asian turkey wrap. The tuna should just be flipped into a melt/panini (esp in winter) and the Asian wrap looked as described. The friends thought the sandwiches were \"good.\" But I did not witness any excitement. 

Coffee - you either like Angora coffee or you don't. 

Latte - great! I asked for Soy milk and they had it. As you can see, I have the bar set kinda low. No fancy images in the froth = 4/5.

Overall, I WILL eat here again, the coffee is bitter, the latte is good, the pulled chicken really is PULLED, great beer selection, and it's a charming old farmhouse with great insulation. I just need to keep trying the different sandwiches and hope the chefs add a little more pizzaz to them like they do the coffee."}
{"text":"I work across the street from the McFarland House Cafe so I find myself in there quite often as dining and coffee options are somewhat limited in the McFarland area. 

The first time I was there I was surprised at the size of the menu and the unique items available on it! This is what makes McFarland House Cafe stand out in my opinion. They utilize locally sourced, fresh ingredients in their dishes whenever possible and you can definitely tell. 

Their soups are wonderful, and they have two different options every day, along with a daily lunch special. I recommend the villager wrap, or big kid grilled cheese. I also am obsessed with their broccoli slaw, which they offer as a side for most dishes (sooo good).

They provide espresso drinks and coffee, which is expected for a cafe, but they also have beer and wine on the menu along with a happy hour on Thursdays and Fridays from 4:00pm - 8:00pm! 

It is a family-run business and the staff and owners are incredibly friendly and welcoming. 

I would definitely recommend the McFarland House Cafe to anyone who is visiting the McFarland area and looking for a great place for lunch or a drink!"}
{"text":"Just had lunch there.  This place is wonderful.  The owners are very friendly and always chatty.  The food has always been exceptional, especially their soups!  Will definitely keep going back."}
{"text":"As a barista, I go into coffee shops with certain expectations. Because I know exactly what goes into a good coffee drink, I look for exactly that.

I went into McFarland House Cafe, and felt immediately at home. It does help that it is in an old house, but still. The two baristas working were very friendly, especially considering I went in within 10 minutes of their close. The two girls tour-guided me through their drink menu, and answered all of my questions. I ordered a vanilla-caramel-raspberry latte, and warned them it might be a little weird. They said that wouldn't be a problem. We talked about working as baristas, swapped recipes for drinks, and when I continued to ask about their menu, they were happy to talk to me about it.

Enough of the service and experience, onto the drink!!  

I ordered a two-shot (16 oz) 2% raspberry vanilla caramel latte.  It was delicious!!! There was a perfect ratio of coffee to flavoring syrup to milk! It wasn't too sweet, and I could still taste the coffee. The espresso was not over or under extracted (under and it can taste a little raw or weak, and over it tastes burnt- personally I prefer a weaker to perfect shot to avoid the burnt taste). The milk was beautifully steamed. It had a perfect microfoam (ideal for making latte art- if your foam can make latte art, you steamed it correctly). It wasn't chunky, or burnt (the reason you never ask for extra hot lattes, people). It was perfectly smooth, so much that I would consider going back for a steamer (just steamed milk with the option for additional flavoring). I savored this latte till the very last drop!

5 stars from a picky barista. Will definitely return and will definitely recommend to friends!!!"}
{"text":"Lovely! 

Housed in an historic building, the cafe makes good use of the charm of its location. Original windows & wood floors, calm, muted colors on the walls. But the bathroom is modern and very clean.

The coffee menu is extensive, as is the ice cream menu. Tea is a bit limited, but at least it's good (Tazo). The selection of baked goods is very small for a coffee shop - at the moment only carrot cake, two muffins, and one kind of cookie. But the pumpkin muffin I ate was delicious - and served warm with real butter! 

There's plenty of seating, including a beautiful back yard, and the counter staff were friendly, quick and helpful. They were even attentive to the kids who were asking about the goldfish on the counter and not buying anything.

It's pretty far from home for me, so I'll never be a regular, but I'll definitely be back."}
{"text":"PROS: Cute vibe, nice coffee
CONS: ?

A real gem. I would love to return to try some breakfast. The coffee and teas were great, and the food other people had ordered looked pretty good. The atmosphere is a big sell. Located inside a house, this spot feels like the coffee-shop equivalent of Gib's."}
{"text":"I was all sorts of happy when I realized we have a REALLY good coffee shop in our new town.  

I'm often unimpressed by lattes at some coffee shops.  Many of them use syrups that taste like fake flavoring and corn syrup, and their coffee beans lack intense flavor.  If I'm paying $5+ for a latte, I want it to be really good!  McFarland House not only uses natural syrups, but they use Ancora coffee beans, which have a complex, nutty flavor.  They do their best to source locally for food and beverages (they also serve beer, wine and Nessalla Kombucha).  The food menu has mostly healthy options, which is a nice change of pace in a town that mainly serves heavy, high-calorie foods.  I've been there for both breakfast and lunch, and I was pleased with both.

The shop is in a historic house with plenty of room to gather for a meeting.  One thing I really appreciate is the play area.  It's really nice to go meet a friend for coffee and let the kids play so we can actually talk.  The atmosphere is warm and welcoming, and it seems like a community meeting place."}
{"text":"We stopped in on a recommendation from a friend. We were looking for a fun new place to check out in McFarland. I love the idea of this coffee cafe in this historic home. What a great place and the location is OK too. Parking on the street was a little scary as cars and trucks were moving pretty fast on the road and didn't seem to be watching for any pedestrians. I almost got hit by a vehicle getting into and out of the cafe. The winter roads make roadways a little tighter for pedestrian/vehicle to share the road. We walked in and had no idea what we were supposed to do. Are we supposed to grab a table and someone will assist us, are we supposed to wait to be seated or do we venture to the counter and order and then get a table to sit down. Well, after about 5 uncomfortable minutes, we found out. You need to order at the counter and then grab a table with your table flag (with order number on it). We ordered a beef sandwich, an ahi tuna salad and two coffee breaks. I was not impressed with the pretty pricey salad and/or sandwich. The meat in the sandwich was processed and flavorless. There was an overabundance of sauce on it that kept coming out every side of the sandwich as you bit into it. The Ahi tuna on the salad was pre-cooked and very chilled all the way through. There was very little dressing on the salad and the lettuce was earthy tasting. I had to drink lots of water to get it down. The portion sizes for the sandwich and salad were pretty tiny too. The nitro coffee gets 5 stars. The 4 shot espresso was a hit too. I'd stop back for the coffee and ice cream, but probably would pass on the over priced small plates of OK food."}
{"text":"Great place to eat lunch and get a cup of coffee or ice cream. Kid friendly with a couple of high chairs available. Always friendly and always good. Great place to stop in if you are in McFarland."}
