{"text":"I am overjoyed at this new BBQ and Mediterranean restaurant in Oakland. I'll admit that I may never get around to trying the Mediterranean fare because the BBQ and Southern food is just that good.   Being a native Texan, there are a number of food dishes I truly miss and crave, living here in the 'burgh. BBQ, despite being available here, is one, while good authentic Southern food is another. So, when I saw fried catfish on the menu, I could not resist trying it. I expected to be disappointed. Not only was I not disappointed, it was the most delicious catfish I've ever had, bar none. It is also one of the most delicious meals I've ever had flavor wise. It came with fantastic lightly fried and seasoned French fries and wonderful hush puppies that the owner said is homemade from his grandmother's recipe.   I also had a delicious fresh lemonade that was mixed to the perfect combination of tart and sweet. I'm not exaggerating, either. When you get a good lemonade, it's such a satisfying drink. I told the owner how amazed I was at getting such an amazingly fresh and delicious fried catfish meal in Pittsburgh. He is from Georgia and he said after trying the common farm raised catfish that everyone uses, he just wasn't happy, so he sources his catfish from an Alabama fisherman and it is fresh caught, not farm raised. Amazing and such a wonderful thing.   My husband ordered the pulled pork, which was also delicious and came with seasoned French fries. Even the BBQ sauce was just as I like it and not the sickeningly sweet bottled variety. There are a few sauces, all of which are homemade.   I also must say that it was glaringly apparent that this eatery does not use the same fry oil to cook different food. The catfish did not taste like the French fries, which, similarly, did not taste like the hush puppies. Again, so refreshing when a place does things right. Meat Here is the kind of business that will develop a very loyal following, starting with me."}
{"text":"Loved the BBQ I think it's the best that I've had in Pittsburgh (Same owner as Yinzburg BBQ) The hush puppies & black-eyed peas were yummy.  It's a BYOB,  too. Can't wait to go back & try the kebabs, just for something different."}
{"text":"After a drop off college kid to apartment, he said that a new BBQ joint opened a couple of blocks away.  Let's try it.  So we wander over and it is Meat Here.  Having just tried the truck, I was game.   The Menu has BBQ and Mediterranean (see attached).  There a lot of tables but we were getting take out.  Noticed someone had a YinzBurgh BBQ T-shirt on and asked if they were connected.  Was told that they are but did not get a full explanation.   My ribs were definitely smoked and very tender and good.  Ordered a Kansas City type sauce...they have a couple of others - mustard based and vinegar based.  With my plate I could get one side and  selected the Hush Puppies, a true southern comfort food.  The Hush Puppies  were OK, a little overcooked but enjoyable.   All in all a nice place for BBQ.  Will have to stop back and try the Mediterranean."}
