{"text":"This is my own personal opinion/experience- The products are very good however the customer service is horrific. Not sure if I have experienced more curt/ borderline abusive service from the ownership/ management.  I've used Medium Rare in the past and have never been satisfied with the service. This Holiday season was no exception. Rude on the phone when placing the order and to add insult to injury I was treated poorly when they didn't have my order ready. I'm a patient and somewhat understanding person but I've had my fill of this place. I'll take my business to people who appreciate my patronage. One more thing, it is shameful the way you speak to your staff. Enough said."}
{"text":"I just moved to the area and went to check this place out. I must say my experience was not the best... Firstly the service was pretty crappy. The lady on cash continued to talk to the customer in front of us after her transaction was finished for a good few minutes leaving us standing in line staring at the ground, waiting to pay and leave.  Whatever the experience there was, the real disappointment was the meat. We bought 4 chicken breasts which came to about $25. Pretty pricy but usually for the quality it is worth it. In this case no such luck. The meat sat in the fridge for no more than 24 hours and when I took it out to prep for dinner it smelt horrid. Like a thousand farts had been released in my face at once. I immediately threw the meat out.  I am not impressed generally with the lot of it."}
{"text":"The most frustrating thing about this place is that their food is quite nice. However, everything is insanely overpriced. But the worst part of this shop is the woman who runs it. I've been in a few times (since I will usually give a place a second or third chance if I like the food) and the blond woman, I presume she is the owner, is horrible. She treats customers as though they are in her way and not worth her time. She will carry on conversations with staff while customers are waiting to ask a question or to pay for their food. On this last occasion she walked off midway through me asking for something. I won't be returning. There are other butchers who I'd prefer to give my money to."}
{"text":"Buy great meat here, grill great meat at home and never go to another old school steakhouse again!!!"}
{"text":"We stumbled apon their shop as the result of a random internet search of the top sausage places in Toronto, though having lived in the area for ages and passed by their store countless times.  Boy did they not disappoint.  I can't begin to describe the incredible selection of sausages they have in stock at any given time.  I particularly love and highly recommend their Jerk Chicken sausage and their Wise Guys sausage.  They weren't at the top of the list for nothing...their shop is simply AMAZING!"}
{"text":"No better place to buy meat in Etobicoke. They have a lot of other great gourmet food items in the store too."}
{"text":"I love this Butcher Shop. The service is great and they stand by their products. The flank steak is so flavorful."}
{"text":"Trying to find a new local butcher with grain fed chicken. I tried this place...  As I came into the store I was greeted by 1 of the 3 people who saw me, he was super nice and had I only dealt with him this review would have been a 4 or 5 star.  The meat is pricey as expected from buying natural but if I pay the extra price I expect to feel welcomed to the store.   As it was my first time I had some questions, as they do marinate their meat if request, I asked the second person I dealt with what the most popular marinate was, he barely looked at me and said depends....no further conversation.  I returned to the first person who greeted me who again made me feel welcomed. He answered my questions willingly and was more then happy to serve me.  After getting all the meet I wanted and heading to the check out I was served by a female who absolutely had no time for me. Talking on the phone about personal issues, not work related, was definitely not a customer as she was discussing her credit card bill. The only thing said to me was how are you while continuing her phone conversation...no thank you for coming, thank you for your business, see you next time, nothing.  Will not be returning!! Sad because this place could be so good"}
{"text":"Tried it for the first time today.  I bought the Tourtiere.  It was expensive ($20) and the taste of cloves was so overwhelming, it was inedible.  Not impressed."}
{"text":"Excellent sausages with interesting combinations:  turkey apple cranberry  Apple & Stilton Etc Friendly service, they really take the time to show you their products."}
{"text":"THANK YOU ANGELO for making me buy the sexiest cut of steak that totally made me look like a goddess in the kitchen.  It was a dry-aged rib steak that he cut so it can be enjoyed by two people.  I am so proud that there is such a great establishment here in my hometown Etobicoke.  Angelo is the butcher and he is so nice, amiable, knowledgeable and friendly.  When I told him I wanted to impress for a dinner a deux, he pulled out this seriously meaty and luscious looking steak that has been dry-aged.  I stopped listening to what he was saying because I was salivating just looking at this meat.  It was mouth meltingly delicious and cost me a third of what I would have paid at a steak house,  Just come in and talk to Angelo or anyone behind the counter and they will not steer you wrong.  It is a short walk from Kipling subway and there is free parking in front.  So I say \"heck yeah\" I am coming here for my meats from now in!!  It is totally worth the trip since there are only so many accessible and great meat shops in Toronto."}
{"text":"Ya this place has top notch meats.  If you want special burgers or cuts check this place out.  Wild boar burgers? Yes. Perfect looking veal chops and pork baby back ribs? Check. This is the kind of store that will make me spend till i can't spend no more. Don't come here hungry."}
{"text":"Great quality meats but very expensive. I have been several times and many of the staff members including the butchers are very friendly and helpful, but the woman who runs it,  is wretched. Today, she proceeded to drop F-bombs in front of me as I paid for my purchase. I don't believe that she intends to be rude,  but that her demeanor is partially cultural or something. She needs to be locked away from the public because complaining about personal problems and yelling at her mom/other staff is bad for business and very uncomfortable."}
{"text":"I once bought some ribs that ended up bring just bones... Not impressed! Also not a fan of the attitude in here..."}
{"text":"Any business that has a cow up on the roof is a business that I want to know about. As one of the original FARC girls who love to eat the meat it is so appropriate that my 100th review here at Yelp is all about the carnivore in me. What just sweetens the pot for me is that it is also going to be an FTR (cha-ching!)   I have found heaven on earth and it's located on Dundas Street just east of the 427. Medium Rare is a fairly new player on the meat scene going up against the likes of the Healthy Butcher and Rowe Farms but as far as I'm concerned Frank Del Gobbo and his crew at Medium Rare have them beat hands down. MR is known to its customers for its butchery, its charcuterie and its great offering of prepared foods, hence they refer to Medium Rare as a cookery.   The real thing of beauty at this meat stop and their claim to true meat glory is that the butchery does a dry age cure of the beef. What's super cool is that they have put a window in at the end of the store where they have racks adorned with loins and prime ribs all tagged with aging dates. To quote one of my favorite sista FARC's (and I'll let you guess who that might be) SHUT THE FARM DOOR! I just can't believe what I'm seeing! I just stood there like a small child gazing all starry eyed into the old Eaton's Christmas windows with my little faced pressed up against the glass dreaming of what treasures might come my way. Hey Santa, this girl's been quite nice (and maybe a teeny weeny naughty) this year so do you think you can leave a hunk of perfectly aged beef tenderloin under my tree? Perhaps a small prime rib 'o beef? Or maybe a New York strip...just a itty bitty one.  Hell I'd do my best Eartha Kitt rendition of Santa Baby if I thought it'd get me some meat.    There is an endless selection of meats that are already vacuumed packed with seasoning such as the Chimichurri beefsteaks. They sell my most beloved Berkshire Pork in this store. The meat counter runs almost the whole length of the shop and this place is the mother lode of high quality, ethically farmed, hormone free, locally raised and harvested meats. Opposite of the butcher case is a full wall of upright freezers filled with everything from desserts to pot pies to seafood. I counted more than 20 kinds of sausages.   Fresh prepared foods are also readily available. I took home a bundle of giant Fred Flintstone sized beef ribs and a container of roasted potatoes with prosciutto and herbs. I was told that they have a small smoker on the premises and the ribs I grabbed up had been smoked right there at the store.  Frank Del Gobbo is my meat God. I am not worthy.   And for you grass eating, sprout munching bunch of vegetarians, yes there are things for you too. There is a beautiful line of freshly jarred soups and huge gorgeous platters of grilled vegetables.....whatever. Medium Rare has created their own branded line of food products.  Kudos to them for making sure to cover all their food bases.    Medium Rare is my personal shrine to all things that are meat. I say hallelujah Brothers and Sisters and please pass the prime rib!!!  It's my meat mecca on Dundas....amen."}
{"text":"I stopped by here the other day, and picked up some tilapia (delish), and some grass-fed steaks (I like they they are packaged).  I also picked up their beef jerky (homemade - but I found this to be quite salty).  Overall nice"}
{"text":"I'm so glad we have Medium Rare in the West End! I get all of my meat here and often purchase their pot pies as well. The products are rather expensive,  which is probably because everything is organic. The staff are always friendly, which is a plus. I wish they would start stocking organic milk, since there isn't a place in the area to buy any and they seem like the only logical place in the area to do so."}
{"text":"This place kicks ass. My new favourite Butcher.  Seriously Amazing: 100% Grassfed AAA Striploin Steak Dry Aged Striploin Steak  Lamb Shanks (If you the time to braise them, just perfect...)  I also tried the Wild Boar (frenched), it was good but won't buy it again because it was on the pricey side and I'd rather spend the money on steak!!  They make a lot of sausages, I tried to find the most interesting one I could find just for kicks, \"sweet cherry duck sausage\", and it was that - interesting....but I think next time will just go for something spicy!  They also have some pre-cooked eats in the display window.  Super friendly staff too."}
{"text":"This place is awesome. It's family run by some of the nicest people I've ever met, and the product is absolutely top notch. We live 2 doors away and over the years have tried everything from chicken breast to standing rib roast, goose to turducken and nothing has been a disappointment. They have a great variety of sausages (try the duck and cherry), cured meats and cheeses. As a bonus, if they don't have it, they can usually get it in for you.  They are definitely more expensive than a grocery store, but you get what you pay for both in quality and in service."}
{"text":"Expensive but worth it. Amazing organic ribs, and I am especially a fan of their rapini and salads! Their sausages are also great (try the garlic one), they have a thin casing unlike other sausages and pack a lot of flavour!"}
{"text":"After watching \"Food Inc\", not only was I nausiated by where the majority of our Meat came from via Chains of Grocery Stores. I also felt the moral currency was far too high (based upon how these animals lived). I've not sworn off meat, but - anyone that watches \"Food Inc.\" can understand my viewpoint.  Now, down to Business. I had driven past Medium Rare on a number of occasions, thinking it was not a Butcher Shop. Just some shitty steakhouse. Wow. Was I ever wrong.  First off, even if you're not into the buzzwords of \"Organic\" \"Hormone Free\" \"Grain Fed\" - the products are fantastic! And it's all local, and all of the above. Costs marginally more than you'd pay at No Frills, Loblaws, etc. But considering it is Independent, and everything is Organic, Hormone Free, Grain-fed and Local - it's outstanding value. The Quality is fantastic as well. I used to buy my Steaks exclusively from Bruno's...no more."}
{"text":"5 stars! And i must thank Yelp for this one too! Since moving from Bloor/Ossington to Etobicoke, i was in dire need of a real butcher. I was spoiled by Gasparos (see review), and will always consider that place the real deal. So i typed into Yelp, and came across Medium Rare.  I needed something pretty specific, and cut specific (inside round, was making beef jerky), so decided to give this place a shot. I was very impressed upon first impression. Great deli meats and cheese display when you arrive.   I have been here a few times, and even on the 2nd time, i was recognized, and was asked how my previous order was.   Right wall is all freezers of homemade and Medium Rare approved meals. Some really neat finds too further down in the sausage section. I picked up the Turducken sausages (which were awesome!), and have the Maple Cajun in the freezer. Another trip, i picked up the lasagna, and a steak soup. I am actually considering cutting out a lot of my shopping at Sobeys, and shopping here with their pre-done meals. (I am a single guy who lives on his own, and works long hours and travel a fair bit, so i find I am in a race against time with groceries). The meat cut i received was fantastic, and cut to order, and he even sliced into strips for me since i was making jerky. No attitude, and happy to help. Was offered an espresso while waiting. Great window into the meat curing room too, can see my next rib-roast! They have some great looking fresh fish as well, will give a salmon filet a try next payday.  Very pleased though with Medium Rare! Give this place a go! 5 stars!"}
