{"text":"Delicious tapas, generous portions and very fresh! We tried 5 different tapas all excellent, great margaritas too!"}
{"text":"You get what you pay for. Wanted to try all the tacos but they asked a minimum of 2 per type of taco. So we took all 11 of them twice + the guacamole. The steak taco was better then the rest, I would not recommend the vegetarian ones."}
{"text":"food was fresh and delicious. server was friendly, open, and a little pushy but we didn't really mind. we shared the guacamole and two cocktails and ordered the cactus tacos, steak tacos, and vegetarian enchiladas with mole. all were completely delightful. portions are such that you could say yes to everything and not be overstuffed. ambiance is kitschy but very warm and cheery. I will definitely be back to try more and enjoy this delicious and adorable resto."}
{"text":"Ma mère et moi sommes tombés sur ce restaurant en nous promenant sur St-Hubert. Notre arrêt tacos etant d'habitude El rey del tacos sur jean-talon mais avons décider de faire ddifgéren. Premièrement l'accueil est chaleureux c'est une petite place où l'on voit que le propriètaire très sympatjique fait tout les efforts pour créer une clientèle régulière. Commerces familiale la présentation était atrayante tacos présente sur une ardoise noir avec message personnalisé j'ai adoré et les portions était bcp plus généreuse que celle présente chez la concurrence qui a déjà sa clientèle. Je vais y retourner pour essayer les autres plats je suis certaine que ce seras un régal."}
{"text":"Very disappointing, inauthentic Mexican meal.   A friend and I were walking down the plaza and were drawn into the restaurant by its cute, attractive and bright Mexican decor.  The atmosphere and service were good, but the food was just bad. First, to be greeted by a server asking if we're familiar with Mexican food is a little off-putting in 2015, especially in a neighbourhood that is just booming with taquerias and other Latin American restaurants.   First there was the tortilla soup. I love tortilla soup. This one was just a simple translucent chicken broth soup with tortilla chips in it. No spice, no peppers of any kind, no tomatoes, no cream, and grated cheese instead of queso fresco. When I asked the server why the soup was so bland and had no peppers in it, he replied : \"oh, we don't put any in, cause some people don't like spicy food. (?!?!?!?!?!?)  The tacos were edible, but the tortillas were quite hardened and didn't taste fresh. Lastly, we had the enchiladas mole, served with plain overcooked white rice with absolutely no spices in it. The mole tasted super sweet and pre-made. We weren't able to finish it."}
{"text":"Very friendly service, generous portions of delicious tapas ( more small meal portions). The margaritas are good too."}
{"text":"Mexican restaurant out of guacamole    And the mojitos, well I think they were kid friendly. The alcohol content was probably  close to was a cooler would be. In a way, not bad because I was thirsty and alcohol is not a great help in this situation. But I paid for mojitos, not soft drinks!(you know what I mean!!!)  But now, the food! It was ok. The flavours were different enough so you could tell the tacos apart, but nothing was really flavourful.  I was with my mom and my sisters shopping and we sample all of the 1$ tacos. I think, I would have love it more if we had decent seating and plate or at least a napkin each. (I had to split my napkin in half because we only had 3 for 4 people)  Also, there is only one washroom, like one stall. The place look like a mess in the kitchen and even more in the bar.  No guacamole, bad mojitos and bad seating.  Well, at least it's cheaper then McDonald's. But, with so many restaurants in the area, I would go and try out something else."}
