{"text":"I really enjoyed my visits so far. As mentioned by one of the other reviewers there are 3 connected areas you can enjoy. There is the restaurant, specialty market and cafe.   I found the prices in the cafe reasonable and the coffee better than at the local Starbucks. The grocery market has many specialty items and fresh produce daily. The prices were very reasonable and the produce was fresh. As for the restaurant the food was great. I had Uncle Sals Famous Sausage Sandwich. It comes with a side salad and their house dressing. Thumbs up. Prices vary depending on what you get. You sort of get what you pay for... if you want fresh, local ingredients and a very tasty meal then give it a try.   As for one of the previous reviewers comments... I found quite the opposite experience. The decorum was great and has a very inviting atmosphere. The folks working there were extremely friendly and inviting. The restaurant area was clean and I felt that everyone there was attentive. I would recommend at least popping in and checking it out for yourself. I give two thumbs up to a refreshing new local business."}
{"text":"Waste of time. don't waste your time here!  The place isn't fully open!!!!!its being renovated and no note of anything being closed online. You will drive there and find cafe and restaurant closed!   We drove here, walked in and cafe/ restaurant were closed. Only the market  was open, no cafe, no restaurant all closed. I asked the cashier  lady in the market, why is everything closed and there is no mention of being closed on Yelp or the internet. She said the place is under renovation, and she didn't know anymore she just started working there.  And the place is expensive and overpriced. I saw cookies on the shelf you can get cheaper at Wal Mart."}
{"text":"This market is part of three businesses at the same location; there is also a restaurant, Cucina di Domenica, as well as a cafe, Caffe' d' Antonio. Though they are all part of the same business, I will review them separately. This review is for the market, which I enjoyed immensely. It's a small market that offers specialty food items, some imported, some local, and has a deli case where you can pick up some Italian salami, prepared salads and sandwiches. I found the shelves to be stocked with interesting and thoughtful choices, and had a great time perusing the aisles. Whether it's Italian coffee you want, artisinal packaged goods, or house made gelato, you can find it here."}
{"text":"Not impressed at all, I so looked forward to ths place when it was being built, I enjoy places like this but have been very disappointed. I made three trips there and came away feeling the same each time. Over-priced, food is less then desirable and the service is horrible. Third time was not the charm in fact it was just the last time for me."}
{"text":"Right off the highway, and so yummy. You'd miss it if you didn't know it was there. There are three \"stores\".... the coffee house (w/ dirt cheap drive thru coffee), the Italian grocery, and then the Cucina di Domencia. The food is soooo yummy. I had a chicken sandwich and carried it to the coffee side where my mother was having a drink. Everything was fantastic about this place."}
