{"text":"Meron Brothers Restaurant is under construction currently, according to the sign on their doors.  Otherwise, this place is has the best shwarmas in a pita out there. 5 bucks for a shwarma with chicken and all kinds of healthy ingredients. Cucumbers, and all kinds of vegetably kind of healthy stuff.... In terms of the dishes I prefer \"Antons\" just down the street. The beef and skewer kebob is not always well made and very chewy sometimes... The chicken is an average grade hit and miss kind of thing.  Look for a review on \"Antons\" soon."}
{"text":"Great restaurant huge portions excellent fresh salad house dressing delicious. 1000x better than Me Vah Me"}
{"text":"I visited this restaurant for take out with my husband's family. I have never even heard of this place, but I'm the shiksa who married into the Jewish family. This is an Israeli restaurant and the owner (or son of the owner maybe?) was very knowledgable about gluten free, as well as the staff. The only things I was unable to have was pita (obv) and the fried eggplant. The portions are so huge here that I was able to have my meal for dinner and two lunches after. I had the beef kabob which is cooked to taste as a steak would be and soooooo flavourful and delicious. I also had it with rice, salad and mixed in generous amounts of babaganoush. Side note: their babaganoush is OUT OF THIS WORLD!!! I could literally sit and eat it with a spoon needing nothing else to be happy. It is like none I have ever tasted before (and I've tried an insane number of them because I'm obsessed) and I think I'd go back on a regular basis just to stock up. It's fresh and creamy and has huge chunks in it. It's everything ganoush should be and more. I'm salivating just thinking about it now.   Moving on, their beet salad was delish and I'd definitely get it again. Same to be said about their coleslaw. Meals also come with pickles/cabbage on the side. Yum!   My husband and in-laws had various forms of pita and falafel and all enjoyed their food immensely. They were huggggee and stuffed to the brim with meat and toppings (and also had the famed ganoush, hummus, tahini, etc, inside as sauce).  The prices are reasonable, especially for the huge portions. For 5 people to be stuffed to the brim with lots of leftovers, it was just over $100.    I will be back again and again and again and again. In fact, I might go back today."}
{"text":"We visited Meron Brothers the night after eating at Me Va Me so it was impossible not to compare them since both are Israeli restaurants across the street from each other, serving huge portions of food at about the same prices.  Both restaurants had complimentary pickle and pepper trays. We also ordered an appetizer combo at both places. At Meron Brothers we had: -Hummus (better consistency than Me Va Me, but less flavor) -Fried Eggplant -Grilled Eggplant (both eggplants were good; I think the table preferred Me Va Me's but I found little difference)  I had the Chicken Shwarma ($12.95). I'm used to the lesser-seen shredded chicken style of shwarma that I mistakenly thought I might get. Instead it was fresh off the rotisserie style chunks. The chicken was well seasoned, but there were some weird pieces. The portion was so large I think I might have gotten half a bird.   My husband had the Beef Kabob (1 skewer $14.95, 2 skewers $16.95) which was described on the menu as filet mignon cubes. Again the portion was huge. He seemed disappointed in his kabob, mostly because there was too much charred surface on his cow. (Maybe his cow should have used sunscreen... I'll be here all week! Tip your waitress.)  Plus for Meron: Despite being a Saturday night there was no wait for a table (we had a 45 minute wait at Me Va Me). Minus: The bathroom was down a very steep staircase. Since my husband's 87 year old Bube needed to go, she had to wait until she got home.  The verdict seems to be that Me Va Me edges out Meron Brothers, but only by bupkes. (Showing off my shiksa Yiddish there.)"}
