{"text":"Wir waren Sonntag das erste mal seit längerem wieder in der Messerschmiede. Dieses mal war glücklicherweise die Chefin nicht Anwesend das Klima war wesentlich angenehmer!!! Das Essen war trotzdem nicht besser!!"}
{"text":"Die Qualität der Speisen lässt deutlich nach. Der Level von der Chefin ist der gleiche. 
schade um den schönen Laden."}
{"text":"Wir haben viel Freude gehabt. Sowohl mit dem Essen als auch der Chefin. Toller Laden mit Pep und Schwung.
Das Essen hat ein super Preis Leistungsverhältnis.
Für Hungrige empfehle ich Schnitzel xxl.
Wir kommen wieder.
Anke und Bernd"}
{"text":"Sehr schönes Ambiente, super freundlicher und herzlicher Service!


 Zu 100% weiterzuempfehlen!"}
{"text":"Gemütliches Restaurant mit gutbürgerlicher Küche. Leider waren Küche und Personal trotz moderater Gästezahl völlig überfordert. Lange Wartezeit aufs Essen und allgemeines leichtes Chaos waren die Folge."}
{"text":"Wir waren Ostern mit unserem Sohn dort essen ,die Chefin ist sehr freundlich und aufgeschlossen. Das Essen war sehr gut. Für mich waren die Portionen eher zu groß, aber lieber so als anders rum. Es hat uns sehr gut geschmeckt. Wir werden bestimmt wieder dort einkehren."}
{"text":"Bisher waren wir von der Qualität immer überzeugt und das ist auch noch immer der Fall. Für den Preis waren die Portionen die groß was in Ordnung ist. Letzte Woche habe ich allerdings Labskaus gegessen der dich sehr gestreckt schmeckte. Es war einfach nicht lecker. Man hat das Gefühl man Versucht den maximalen Gewinn zu erzielen und darunter leidet der Geschmack. Schade."}
{"text":"Sehr gemütlich in diesen Resturant.  Der Service ist sehr gut und freundlich . Die Schnitzel sind spitze , ich kann sie nur empfehlen"}
{"text":"Auf unserer Weihnachtsshoppingtour haben wir uns in der Messerschmiede zum Stärken wollen.
Wir waren die einzigen Gäste. Die Begrüßung war sehr freundlich.
Das Essen war ok, aber wirklich nur ok. Wir hatten beide eine Folienkartoffel. Mein Matjes war gut, aber der kommt ja eh aus der Kiste. Die Kartoffel hatte leider so gar keinen Geschmack und der Quark dazu hätte auch gut etwas mehr Gewürze vertragen können.
Bei der Rechnung, habe ich nach einer Verzehrquittung gefragt und wurde dafür ziemlich pampig angefahren, dass ich das nun wirklich hätte früher sagen müssen.
Alles in allem gibt es in Stade sicher nettere und leckere Orte zum Essen."}
{"text":"Wir waren gestern dort essen. Die Speisen waren gut . Die Sahne sauer !!! Die Herrin des Hauses kam später rein. Da war schluss mit gemütlichen Essen. Sie verbreitete eine Unruhe, das uns dadurch der schöne Abend in der Messerschmiede verging.Ihr lautes Organ passt nicht dort hin. 
Das Persomal ist sehr bemüht . Wenn die.. . nicht da ist, kommen wir gerne wieder."}
{"text":"Wir waren mittags zu Dritt da. Es war alles in Ordnung, allerdings war es für meine Begriffe etwas zu fettig. Aber jeder mag es halt anders und für die Preise kann man kein Gourmet Restaurant Niveau erwarten.
Wir werden sicher noch einmal dort hingehen."}
{"text":"Schönes gemütliches Restaurant. Sehr leckere Speisen, gutes Preis Leistungsverhältnis. Ordentliche Portionen. Der Service war teilweise recht langsam, Karten musste ich mir selber holen und wenn mein Getränk leer war musste ich immer die Bedienungen ansprechen. Ansonsten top."}
{"text":"Hunde sind erlaubt hatte meinen dabei :)

Haben sogar ein Wassernapf bekommen ohne Aufforderung, einfach ein toller Service ruhiges und gemütliches Ambiente TOP :) gerne wieder"}
{"text":"Es gab sehr leckere Bratkartoffeln mit grandios liebevoller Garnierung! Der Service war sehr aufmerksam und nett. Das Ganze in warmem Ambiente: Wunderbar. Bis bald!"}
{"text":"Wir waren letzte Woche mal wieder in der Messerschmiede und haben
die Platte für 2 Personen gegessen.
Alles einwandfrei, sehr reichlich und lecker.
Die Bedienungen waren nett und freundlich.
Gerne kommen wir wieder!"}
{"text":"wir waren gestern in der Messerschmiede und unsere Scholle war exzellent, auch der Service war super und es gab allgemein nichts zu beanstanden. 
Einmal hat die Chefin eine Mitarbeiterin in Anwesenheit der Gäste angewiesen sie soll schneller machen und hat dabei in die Hände geklatscht a la zackig zackig, sie hat ne etwas rumpelige Art, wenn man was gefragt hat, das ist etwas befremdlich gewesen..
unsere weiblichen Gäste aus München haben die Sauberkeit der Sanitären Einrichtungen stark bemängelt und sich gewundert über das Schild das nur für Kunden die Benutzung kostenlos wäre, alle anderen 50 Cent bezahlen müssten.. (noch ein Überbleibsel des Altstadtfestes vor 2 Wochen?) die Sauberkeit kann ich abschließend nicht beurteilen weil ich nach dieser Aussage das Klo lieber nicht benutzen wollte. 
Fazit: Alles in allem war ich durchaus zufrieden."}
{"text":"Die Messerschmiede ist vom Ambiente her sehr einladend und gemütlich. Leider ist der Service wirklich eine Kathastrophe. Sehr lange Wartezeiten tragen nicht gerade zur guten Laune bei, dann kam das Essen und wir waren sehr enttäuscht. Keine frische Ware, alles war lieblos angerichtet. Tut uns sehr leid, aber uns sieht die Messerschmiede nicht wieder."}
{"text":"Also wir waren am Freitag dort. Die Bediehungen, ob dunkel oder blond waren beide auf angenehme Weise aufmerksam. So wie man es sich wünscht. Das Essen ebenfalls ohne Tadel. Was noch einmal ganz toll ankahm war, meine Frau hatte heimlich schon bezahlt und ich bat um die Rechnung. Mit breitem freundlichem Grinsen wurde seitens der blonden Bediehnung geantwortet:\" Das geht alles aufs Haus!\". Das kam ganz klasse an, erlebt man auch nicht in jedem Lokal. Zusammengefasst: Tolles Lokal, tolles Personal, tolles Essen. Danke."}
{"text":"Unser Ausflug in die Messerschmiede fand mit vier Personen statt. Drei Essen waren wirklich super ! 
Wer ein XXL-Schnitzel nimmt bekommt auch wirklich ein sehr großes Schnitzel ! Leider war ein Essen zu durch gebraten, obwohl Medium bestellt wurde ! Das Essen ist frisch zubereitet und schmeckt wirklich klasse ! Negativ ist uns die Staubschicht auf Lampen und Deko aufgefallen. Die Servicekraft war nett , leider wurde teilweise unsere Getränkebestellung bei einem fast leeren Restaurant ziemlich vernachlässigt und vergessen ! Die Tischdeko in unserem Fall Rosen waren teilweise verwelkt und das Wasser in den Karaffen nicht mehr ansehnlich ! Es sind Kleinigkeiten ,die aber irgendwie das Wohlbefinden stören! Zum Essen gut !! 
Zum Wohlfühlen verbesserungswürdig !!"}
{"text":"Lecker Essen, freundlicher Service und tolle Preise. Wenn teurer in Stade essen will, muss man zum alten Hafen gehen ;o)."}
{"text":"Sehr gemütliches und uriges Restaurant in der Stader Altstadt. Wir hatten das Cordon Bleu und das Schnitzel Hawaii. Sehr sehr lecker. Die Bedienung ist sehr aufmerksam und schnell."}
{"text":"Wir waren heute spontan mit 6 Personen da. Freundliche Bedienung, gutes Essen, faire Preise. Wir kommen gerne wieder."}
{"text":"Wir waren innerhalb von ein paar Tagen zweimal in der Messerschmiede - jeweils abends und der \"Laden\" war richtig voll. Wir hatten aber in weiser Voraussicht beide Male reserviert und so war das kein Problem.

Ob das Essen heute schlechter ist als früher kann ich nicht beurteilen, denn wir waren vorher nie dort (kommen aus dem Rheinland). Es war aber auf jeden Fall gut. Die Chefin, die hier viel und oft gescholten wurde war an beiden Abenden da, aber uns ist sie nie negativ aufgefallen - im Gegenteil. Bei unserem zweiten Besuch hat sie uns gleich wieder erkannt und wir waren beide Male rundum zufrieden, mit dem Essen, mit der Chefin und dem Personal."}
{"text":"Sehr gutes Steak und Bratkartoffeln. Bedienung ebenfalls sehr nett. Ich komme gern wieder."}
