{"text":"The only reason I come here is for the bbq food the fresh roll platter,vermicelli noodle bowls etc I don't even know why anyone would order pho here as it's not that good.

Probably my 2nd or 3rd time here because the service is slow I timed it about 25-30mins to bring our food!? Ridiculous as another table came in after us and got their food first,even when I asked for the bill they didn't bring it to us why is that so hard??? Seems like there is only 1 person in the back kitchen I ended up going to the front to pay

Yes they only take cash but that's like most Asian restaurants so better have cash on you 

Food was good had the platter but the hot water to dip the rice paper was in a plastic bowl they should actually be using the proper container which would also save a lot of space as our table was small"}
{"text":"I love pho - Tried many restaurants around the city - this is the best and best price. Quality, service, the whole package."}
{"text":"I had bad Vietnamese once and vowed never to go again. After a few years of my boycott (I can be stubborn) I finally went to Mi Mi on Gerrard with a friend. Delicious! Friendly service. Very basic decor but clean. I got the bbq beef on rice noodles, my friend got pho and loved it. I would recommend. I've been again and even though my meal wasn't as hot as I'd like the second time (it took a little longer to get to me), I  am looking forward to my next visit."}
{"text":"The best Pho I've had in the city.  My family loves this place and we take pretty much all of our visitors here for dinner when they stay with us.  The staff are very pleasant and the food is always great!  Since we found this spot, we haven't gone anywhere else for Pho (other than lunch time take out near my office)!  The spring rolls are not to be missed!"}
{"text":"I started eating here around 18 years ago and this neighbourhood Vietnamese spot is still to this day always great.
While the menu is extensive and authentic my go to meal is the BQ pork with spring rolls. Generous portion of noodles with loads of fresh crisp veggies make this a healthy filling value priced dinner.
Give this spot a try and bet in 10 years you will be making a weekly pilgrimage to MI Mi's has I have for going on 20 years!"}
{"text":"Delicious delicous declicous!! It is my go-to place for vietnemese food. I am never disappointed!! Yummy soups and can never go wrong with the spring rolls."}
{"text":"My favorite Vietnamese restaurant in Toronto. Their pho broth is perfectly seasoned, the staff are friendly, the prices are good, and theyre open late. What else could one want?"}
{"text":"We were in the area and felt like Pho there were several restaurants around and decided on this one based on Yelp and because it was quite busy.

-service was EXTREMELY slow, especially for a bowl of soup I've never waited so long at any Pho restaurant
- the soup broth was ok, but there was barely any meat but a whole lot of noodles

very disappointed, I was still hungry at the end I was already thinking of grabbing a shawarma on the way home."}
{"text":"Don't let the plain walls and lack of decor fool you! The simple furnishing are a testament to how much effort they put into making good, authentic, and fresh Vietnamese dishes instead. Feeling adventurous, I ordered the do-it-yourself platter with BBQ shrimp on sugarcane, BBQ beef and spring roll. The service was quick and they brought me a huge plate of food I could barely finish! It was a lot of fun to make my own rice wraps with whichever toppings I wanted and I enjoyed interacting with my food. Dessert was a yummy concoction of red beans, green beans, green jello, coconut milk, and crushed ice. I'll be back here again, Mi Mi!"}
{"text":"Mimi's delivers consistently great Vietnamese food time & time again. Live in the area, this has become our go-to local dinner spot.

Disregard the interiors, the place needs an overhaul but the food and top notch service makes up for it.

Their pho is delicious, deep, authentic broth, full of flavour and delicious fat. My pick for pho is the BBQ beef pho, the char from the beef adds a delicious smoky taste to the broth. Their bun dishes are also very good and super cheap. I'm partial again to the BBQ beef bun but always get it with sugarcane shrimp. Their cold rolls are chalk full of huge butterflied shrimp, tons of pickled carrot/daikon and glorious mounds of thai basil. The spring rolls are a bit hit and miss, sometimes arrive perfectly fried. other times super soggy with grease. Still worth a try.

Dinner for two with drinks and a share appetizer is about $30 with tip.
Beware: cash only."}
{"text":"Good Vietnamnese can be a little harder to come by in the East York/Danforth area so I'm glad to have found this restaurant to throw into the Vietnamnese rotation.

Granted, I only tried one item, the Special Pho (Pho Dac Biet) but I enjoyed that their broth was not super salty or oily like most other places, it was very natural tasting.  My friend's vermicelli with grilled pork and spring roll looked really tasty too (Bun Cha).  

Silly suggestion but they should play music in the background b/c even with a few tables of patrons in the restaurant, it sounds absolutely dead in there - not that most people go to Vietnamnese restaurants for the atmosphere."}
{"text":"Love this place. The food is consistently delicious. They are a typical no-frills Vietnamese joint but don't let the sparse décor put you off. Service is excellent at well. You will not be disappointed."}
{"text":"I ordered the combo beef, shrimp, and spring roll bun and and iced coffee to go and was left feeling pretty disappointed. For $15 I got maybe 2 sugarcane shrimp and 3 chewy bits of beef  without much flavor.  

I have to agree with the other reviewer that the service is the best part of this place. While I waited for my order they gave me some green tea to sip on and my order was ready in 5-10 mins."}
{"text":"The food here is priced at a bit of a premium for the area but everything we ordered was very tasty. 

The restaurant is very large and kid friendly. Service is good. 

We had a pho noodle and a rice vermicelli dish with a shrimp paste on cane sugar and spring rolls. Everything was delicious. 

Would definitely go back."}
{"text":"My go-to spot for warm vietnamese treatment in Toronto.
The vermiccelli fix for lunch, in any combination, is simply UNBEATABLE."}
{"text":"A great place to go for authentic Vietnamese Pho and more.

We have been coming here for many years and have never been disappointed.

Mi Mi offers consistent good food and friendly service.  
This combination has kept us coming back years after years even after some of us moved away from the neighbourhood.

The decor is nothing fancy but the food will keep  you coming back for more.
Get in the front door and you will be greeted by the aroma of the simmering beef stock for the noodle.

We come here mostly for the Pho, a beef noodle soup.  It  is inexpensive and always satisfying.  The noodle soup comes in three size, each around a $1 more. 

For Pho, the broth is the heart of the dish.  Mi Mi's broth is never oily, always clear, fragrant and packed with flavor.  Our other favorites include the steamed rice rolls, accompanied by sprouts, cucumber and basil and cold rice paper wraps which are packed with rice noodle, shrimps and thai basil.

For deserts, we always finish our meal with the glass jelly and red bean drink and the drip coffee in sweeten condense milk. 


Cash Only."}
{"text":"Nice service. Ordered vermicelli grilled pork, everything is good except the pork. It was kind of dry"}
{"text":"This is the best pho place east of university that I've been able to find. Basics: it's clean, the food is very good, and the service is warm and friendly. Most places I've been to seem dodgy but this one rates. It's rated on chefs feed too."}
{"text":"Im torn about this place.  I've been a few times and have enjoyed their pho and other times it's  a tad bland.  I like they have various size for pho as some other places only have 1 size.  But what is consistant and soooo addictive is their assorted mixed meat fresh rolls.  You get a huge platter of meat where you roll yourself.  It's awesome and highly addictive.  I love it sooooo much!!!!  

Their service is always kind and warming...I just had a couple of experience where the broth is a touch bland.  But of course I keep coming back so the food is of good quality."}
{"text":"Ever since the Pho 88 at Broadview and Gerrard closed down, I haven't had a goto Pho place in the East Chinatown.  However I had always heard good things about Mimi so after cardio training/hill running at the Riverdale Park, about 6 other team members and myself decided to give the pho at Mimi's a try.  One thing to mention - if you have never ordered a fresh fruit smoothie to enjoy with your Pho, you are missing out.  

Service - we came at around lunch hour on a Sunday and the restaurant was about half full 30 mins after we arrived.  We had the most people in our group with 7.  2 people were working as servers, one was probably the owner.  Food took significantly longer than the expected (for a pho restaurant) to come out.  We had to remind them about our smoothies, which came almost after we were finished eating.  There was probably a 30 minute delay in between the first smoothie and the last smoothie (ordered 7)

Smoothie - the mango smoothie was tasty, however it tasted like it was made from mango nectar rather than the actual fruit.  My team member had the avocado and said it was good.  Another team member ordered the jackfruit and said it was terrible with no flavour.  I had the sour sop and it was alright - it would have better if the flavour was stronger.

Sizes - Sizes at pho restaurants are a hit and miss. Sometime you get a gigantic bowl for a large and sometimes you get a bowl the size of a small.  At Mi Mi's, there is hardly a noticeable difference between the small and the large.  Many of our guys were shocked when the bowls came out.  In short, bowls are small - order a larger size.  

Pho - I tasted the rare beef and beef balls noodle.  The broth was very clean and tasty - not as oily as the soup at Train.  Noodles were fresh.  Tasted like what pho should taste like.  

Vermicelli with grilled beef and spring rolls (bun) - nothing that stands out here.  I've had better elsewhere  There was an interesting taste to the spring rolls.  Fish sauce was quite bland.  Unimpressed.

Overall, I would come back for the Pho or try something else on the menu."}
{"text":"the bun and fish sauce were awesome.
the pho beef did not disappoint.
flavours, smells all authentic. prepared fresh onsite.
ladies were friendly.
informal and no-nonsense atmosphere.
go here if you're craving proper viet food!"}
{"text":"Nice mom and pop style Vietnamese restaurant  If you want quality food....try this place. Everything looks fresh and well kept. Cash only though but worth it."}
{"text":"I'm surprised this place doesn't have a better overall rating.

This is THE place we go for Vietnamese. There are so many choices in this neighborhood, and we have tried them all - always returning to Mi Mi's. 

I don't eat Pho, but my partner is a bit of a connoisseur. In his opinion Mi Mi's even trumps his previous favorite place in Markham. The real star of the show here is the Bun. It is very fresh, with a quantity of fresh veg, sprouts and peanuts. Their BBQ Shrimp on sugarcane Bun is fantastic. The best Vietnamese Shrimp Paste I have ever had (Soooo much better than Golden Turtle). Smoky, Lightly Charred and Sweet.  My SO gets the Bun Combo, Shrimp and Pork and Beef in one. 

Family run, by an incredibly nice family. I completely screwed up an order once and offered to pay for my mistake. They took back the dishes and gave us what we had originally wanted without charge - and with a smile. 

Tea is good, always hot. The Sauces and tables are clean."}
{"text":"I want to concludes my East Chinatown pho hunt @ Mi Mi.  I have frequented here while I was living in the area.  Their pho broth is clean and fresh and they use fresh ingredients.  This time around I've tried their bun bo Hue since I've never had it before.  At first it looks more like sate beef pho rather than bun bo Hue, and the meats are totally off.  Instead of using beef, pork hock and pork red they only use lean beef, and the meat portion is poor.  The broth has flavour but I've definitely had better in Toronto.  Goi cuon on the other hand is average and sauce isn't too memorable.  Kudo to them for not using MSG as I don't feel minor migraine after the meal.
Haven't been here for while but I can tell they've built a solid fan base in this area as patrons here seem to be mixed in ethnicity.  They are pricier than other Vietnamese joints in the area but still acceptable.  The service is consistently friendly and their pho is one of consistent one in East Chinatown."}
{"text":"Good Day to all reading my review of Mimi's Thai Restaurant located on Gerrard Street. 
This restaurant is a hidden gem waiting to be discovered.
From the moment we arrived we felt like we were in the Four Season's Hotel!  It was incredible.
The proprietor took care of us with silk gloves on, she was that smooth of a restauranteur!
The menu is quite extensive and is available online if one wishes to peruse the menu before arriving.
The Pho was so plentiful, tasty and hardy.  It was bursting with different layers of flavour and textures.  The accompanying garnishes personalize your Pho to your liking.
The cold shrimp rolls were exquisite and stuffed so full of wonderful ingredients and flavours.  The accompanying dipping sauce was the perfect foil for the roll.
The Restaurant was clean, organized and very well managed.
If you are looking for a culinary feast, Mimi's is the only place to go!  They certainly know how to deliver!
Manga, Manga"}
{"text":"Here's another one for Kelly O.  Is this fake too?

Great Vietnamese place run by some sweet Vietnamese women.  Mum's in the kitchen, and all smiles on the floor.  

They have a special chicken soup that cures what ails me in the colder months.  I tried learning how to make it at home and I just can't.  I'm sure they have this simmering all day in the back.  

It's inexpensive and the quality is A1.  They get phone orders in for pickup from people on their way home.  So their food has a great reputation.  Big menu as well.  I always leave this place stuffed.

One small complaint:  It's run by 3 women, so the place is kept super warm.  If they cooled it down a bit, I would go more often.  Too warm, coupled with a hot soup, doesn't make for a fun meal."}
{"text":"I rate 2.5 stars and have deleted my previous review. I believe ownership has changed and quality/taste has suffered. Pho soup base is bland and beef balls did not taste fresh. Prices have increased quite a bit. Bowl of vermicelli is $8.95 whereas I usually pay somewhere in the $7 range for the same dish. Bun with grilled pork and spring rolls. Mediocre and would likely, not go back. It's a real shame since I've been there on a few occasions and considered it the place for Pho in East Chinatown"}
{"text":"This is our go to place for Vietnamese food.  Cheap prices, friendly service and amazing food.  My favorite is the vermicilli with BBQ pork and spring rolls, filling and so tasty."}
{"text":"Get the rice paper roll platters. For $13, it's more than enough food for two. The pho is pretty good here too, but sometimes the broth can be a little too salty. Coming from pho-less Parliament St though, really cannot complain too much."}
{"text":"I tried their bbq bun and there were many nice aspects to this particular dish.  The bbq pork was missing that smokiness that I was looking for and I personally thought there was a little too much lemongrass.  But it was beautifully meaty and succulent, the ride noodles had the perfect texture to them, and the vegetables and herbs were very fresh.  Overall, the dish was maybe a touch sweeter than what I was accustomed to but it was a very nice meal overall.  Service was very friendly and polite too which I appreciate.  One note about this place, it's cash only."}
{"text":"I've been searching \"Mimi\"... I've been going there doggedly for years and always assumed \"Mimi\"!!  Now, I know.

When asked for a recommendation for Vietnamese resto, I ALWAYS recommend one of two places: Pho Phuong on College and Mi Mi.  Both are a little off the beaten path, but definitely worth the trip.

Mi Mi is family run and has a friendly and warm atmosphere.  I recently took some friends there who were mostly vegetarian and they were super cool about adjusting dishes to make them work for everyone at the table.  They have always been super accommodating.

It's a nice open space.  Lit well with a nice amount of space between the tables (ie - not packed like sardines!).

Me?  My usual there now is the bbq pork with egg and rice noodle (dry) with soup on the side ($7-ish).  I don't think I eat it right because I always ask for the fish sauce for it and dump it onto the noodles... but their bbq pork is RIDICULOUSLY good.  I've also had the rice dishes, pho and the vermicelli dishes and they are all a step above most Vietnamese places in the city.

Mi Mi:  It's worth the trip to Chinatown 2."}
{"text":"If you happen to be in the area and feel like having Vietnamese food, this is a great spot. However, I don't recommend going out of your way just to eat here.

We went on a Saturday at around 2pm and it was a little busy. I had the bún with beef, sugar shrimp and spring roll for about $10-12. It was delicious!"}
{"text":"Mi Mi's secret weapon is their BBQ. I love their BBQ lemongrass pork chop and it's excellent value for the money. They also have the big platters for wrapping which are also very popular. Give them a try, you won't regret it."}
{"text":"I happened to be in the area so stopped by for lunch at Mi Mi! We ordered the house special pho, deep fried spring rolls, and the Vietnamese iced coffee. The pho was average - good amount of beef, decent broth, and the noodles were the thin kind (vs. flat). Spring rolls tasted good but not the freshest. Vietnamese coffee was okay too. Overall not a bad place to eat but probably wouldn't venture here just for pho."}
{"text":"Best BBQ chicken and pork on rice, and nice service! just a little slow though..."}
{"text":"Good Pho but not the best. My friend Stanley had the grilled chicken on rice, I tasted his, it was very good.. I can only give this place 3 stars simply because now so many mediocre Pho places around.  The staff where over friendly, sometimes I don't want that much attention and just want to enjoy my food. I feel lucky to have so many Pho places in Toronto to choose from."}
{"text":"The pork chop was good. 

The beef was not good. Too chewy. 

The shrimp salad roll was decent. 

The pho doesn't taste anything like what a pho should be. I never had pho that has sesame oil and pad-thai style noodle. The pho tasted more like a Chinese noodle soup than pho."}
{"text":"There are a ton of hidden gems in east Toronto and Mi Mi is definitely one of them. The food, the atmosphere, everything about this place feels like home. You might have to wait a bit longer than a usual Vietnamese restaurant, but it's well worth the wait. The vermicelli is awesome and there are so many great combinations you can add to it. I'm partial to the pork sausage and the spring rolls. And the service is great. They are super friendly and always remember you whenever you come in. Give it a try and you'll be hooked!"}
{"text":"Best pho place downtown toronto. Pho soup is always clear and very flavorful. Most places are very oily but not at mi mi's.  The lemongrass chicken is the best!! A must order, you can get it on the side or with rice. Spring rolls are also delicious, actually everything is delicious. 

Customer service is excellent,  especially for a pho restaurant. The owner is very friendly, nice, and remembers most of the frequent customer names, and I also seen her bring out people's take out to their car that's parked outside. I don't think any other pho stores would be that nice. 

Be prepared to wait in line on weekends but it's worth the wait. I know some people mentioned here the wait is long for food but what do they expect from a family owned business. It's not like moxies where you have 10+ servers. The longest I probably waited was 15 to 20 minutes but that's during the busy hours."}
{"text":"In a sea of pho restaurants in this area, my friend brought me to this place since he lives in the area assuring me it was decent. The service is acceptable, not great or bad. The plus is they have Chinese broccoli as a side veggie option. The spring rolls were not good, the broccoli was undercooked, the pho noodles were cold, and there was not much meat compared to other pho restaurants even though I ordered a large size. We were also the only patrons on a Sunday at 11am. It's a family run restaurant so I like to support the little guys but next time I'll try another pho restaurant in the area."}
{"text":"Stumbled into this restaurant on a Sunday afternoon with a group of 10. It's located in the heart of old china town. Judging from the decor and signage out front I wasn't expecting much especially since I saw this was a cash only place. To my surprised the food tasted better than I would have expected and the value is really good here. I would come back here for sure! 

Atmosphere - 3/5
Taste - 5/5
Portion -5/5
Price - 6/5

Atmosphere - the sign our front is scribbled in italic cursive red on a while background. There are a few large plants from the window and you can tell this is an authentic Vietnamese food. As you walk in, you can see the restaurant is long and narrow with about 20 to 30 seats. There is not much use of aesthetics on the wall.

Taste - I ordered a chicken and porkchop on rice dish with shrimp roll and avocado milkshake. The rice dish came with chicken broth soup as well and it was excellent. The porkchop was cooked to perfection and melted in my mouth with a savoury finish. The chicken lacked taste as it was thicker so perhaps not as marinaded. The shrimp roll was ok and usually I look forward to the peanut sauce but this one did not taste like peanuts. The avocado shake was beautifully presented with two pieces of strawberry on the top. It was missing a bit of sugar but I also tend to have more of a sweet tooth so I think this would have tasted perfect to others. 

Portion - I definitely ordered with my eyes than my stomach. I was too full to finish all my food. I had a piece of the shrimp roll, some soup, and finished the porkchop but not the chicken so now I have lunch for tomorrow! 

Price - $12.50 for the rice dish, $4 for the avocado shake and $4 for the shrimp rolls. Pretty good value for what you are getting."}
{"text":"Read about this place in a magazine (pretty sure it was Toronto Life), and found myself in the area around dinner one evening so I thought I would check it out.  Seems I'm not in the norm by posting anything but a glowing review but honestly, I just don't understand the hype..?

Service was excellent and incredibly friendly.  I loved the fact that we got tea with our meal as well.  Other than that, this place was pretty typical of most Vietnamese restaurants in the city.

My spring roll appetizer was awful, which I found very surprising.  I've never had mushier and blander rolls..probably ever.  Our main dishes were good but hardly ground breaking.  Just regular Vietnamese food.

Maybe I didn't try the right item.  Maybe the spring rolls were off with my batch.  But ultimately, I found this place pretty average at best.  Please note, this place is also CASH only."}
{"text":"I had the grilled pork with vermicelli and do it yourself platter here. Both very very tasty although I probably would have preferred a little more meat in the vermicelli dish. Next time I will just pay more for extra meat - problem solved! Otherwise I really enjoyed their food, and the platter was huge with lots of protein!"}
{"text":"Let's get this straight: i really wanted to like this place. I've only come here because Que Ling Pho is not opened for service on a cold Thursday night. (By the way, Que Ling: it would be amazing if you could indicate your hours on your restaurant)
Since I promised my S.O. for great pho, we looked on yelp and luckily there's 'Mi Mi' which is just 10 steps away. 
Upon walking in I noticed that this restaurant is 90% full, which at first seemed like a good sign. However that may have been the reason my bowl of pho took longer to arrive then in any other pho place I've experienced.

I was growing really impatient but the owner and his family were very friendly and each time I looked at them in my hangry eyes they would kindly tell me the pho is almost ready. Was this pho going to be the best pho I will have? At that point I thought NO pho in the world is worth 25 minute wait. 

And I was right: this pho is watery and not an ounce of oil to be seen. Barely any beef flavour was detected. The noodle was perfectly cooked however, but the beef was few to be found and too overdone. 

I applaud their business as they clearly have a fan base, but I will take my pho craving else where. Thank you."}
{"text":"I went here for the first time and loved my experience. Our server was amazing, so informative and helpful. I was looking for a veggie cold roll, and there wasn't anything on the menu and the server gave me two options. 

The meals were delicious, however my fiance got spring rolls and his response was 
\"they were disgusting, they were the worst spring rolls I have ever had\".

So just stay away from the spring rolls and you'll be good to go!"}
{"text":"The owners here are all very friendly. I go to Mi Mi when I crave porkchop and chicken on rice. I usually get them to make me a sunny side up egg as an extra. This dish here is one of their better dishes. I find that Vietnamese restaurants in general usually have a few dishes they are known for - whereas everything else is ok. 

Their pho and vermicelli dishes are just all ok. Their rices dishes are better than most other viet places. They are also known for their shrimp dumplings in broth with noodles on the side as well. Everything is preference and this place is above average then most Vietnamese restaurant. 

I have been coming here for years and 95% of the time their dishes are quite consistent. However, there are those odd times where their dishes have been disappointing. You cannot rule this place out, there is a reason why they are able to charge a little more for their dishes than the other Vietnamese restaurants nearby and why they are usually quite busy."}
{"text":"the food was decent, not too special though
service was good but id prefer going to other places! they do have vegetarian options which is cool"}
{"text":"Service and prices are 5 stars.

Vermicelli dishes are 2 stars. I have had better dishes elsewhere. The spring rolls are not authentic Vietnamese. Vermicelli is the only thing I've tried there, so I can't comment on other dishes."}
{"text":"This was truly great! Every time I'm sick, I NEED Pho soup in my life and this place did just that for me. This was the first time I tried Pho in my area and I was impressed. The people here were super sweet and the food was excellent. I ordered a chicken Pho and my husband had a pork and rice dish (can't remember the name of it now) but we were both very happy with our food. Just go there and see!"}
{"text":"Some of the best viet spring rolls in town. Their fresh shrimp rolls always used crisp fresh roll, with fresh lettuce. The spicy peanut sauce is delicious as well. 

Always enjoyed their vermicelli and rice with grilled meats. 

Atmosphere is very simple and home style, no fancy decor, but you do get a good meal at a good price."}
{"text":"Excellent neighborhood restaurant. Well prepared Vietnamese food.  Friendly family style service. Pho with beef broth very good. The noodle soup with chicken soup/broth excellent. We like the shrimp roll and spring roll - well prepared. We eat there or get take out at least once a week."}
{"text":"Their food always tastes fresh and home-cooked. The barbecue chicken legs and the chicken curry soup with vermicelli are our favorites. Clean restaurant and friendly service."}
{"text":"What a lovely family owned restaurant! We come here regularly, and have always been so impressed by the food and the customer service. I know some people complain about how it's cash only. I honestly don't mind. I think it's awesome that they have such a huge following that they can still do cash only!"}
{"text":"Mi Mi delivers on good, affordable Vietnamese food in Gerrard St Chinatown, which probably should be deemed a Vietnamese town given the number of Vietnamese restaurants in the area.  

Came here last night and had Salad Wraps and Do It Yourself Rice Wrap platters (which has an actual Vietnamese name, but I don't recall what it is).  Both dishes were very good.  Salad wraps had nice pieces of shrimp and done well.  I had the special mixed platter, which came with beef, chicken, shrimp on sugar cane and probably other cuts of meat.  It was enormous and filling.  The accompanying veggies were crisp and fresh!

I was most impressed by the service and decor.  It's not a fancy place by any means, but the menus are nicely printed, space was clean and comfortable and the servers were pleasant and even took time to answer questions about the menu.  Not the typical transactional service I experience at most Vietnamese restos."}
{"text":"I found the hu tieu thap cam kho a bit bland compared to kimbo/kimpo but I think it's because this place doesn't use MSG in their broth. Overall me and my girlfriend enjoyed our meals and will definitely come back."}
{"text":"The kindness of the staff, the delicious food and they low prices......  What else could you ask for during a mid-week quick family meal at a local restaurant."}
{"text":"Best BBQ chicken/pork chop rice. When I come here I only get that"}
{"text":"I was with my gf heading to softball when i got a call that the game was going to be cancelled.  My gf felt like heading to the Broadview Chinatown and grab some Pho.  I wanted to take her somewhere that was GOOD so i yelped it as usual.  Mi Mi was across the street and had good reviews.  The place was packed for a Thursday and the food...just right!

We got 2 orders of the egg rolls (Vietnamese style all the way for egg rolls).  Crispy outside, flavourful and meaty inside...dip it in fish sauce and you are in heaven.

She got the Pho and i got the special seafood noodles with rice and egg noodles.

Both were really good and we left impressed and full....that's how we do it!"}
{"text":"It was packed on a Thursday afternoon for lunch. I was quite impressed for my first time here. Service was quick and friendly. Loved the fact that they can speak English, Chinese and Vietnamese so fluently, all of which I understand.

I ordered the rice with BBQ chicken and Vietnamese sausage. ($7.95) The chicken was flavourful and done just right. The sausages were amazing. It's different than the ones I usually get at other Vietnamese restaurants. It tasted authentic and delicious!

I'll be back to try the vermicelli and pho. Now I can't stop thinking about those sausages..."}
{"text":"Oh boy was I in for a surprise when I entered Mi Mi... This was a ok dining experience. The place had a somehow comforting atmosphere to it, fair prices, excellent service, but alas the stores cleanliness failed the test.

   I was in a party of 4 people and all of us noticed that when we received our spoons and chopsticks they were slimy, sticky, and just plain Dirty.  We actually had to clean the chopsticks in the hot tea provided.

   Other than the cleanliness everything was fine. I ordered Bun Nem Nuong Cha which was alright in a giant bowl, I couldn't finish it.  In total, this dinner cost us 43 dollars which is a OK amount.

  Overall if you are looking to try a fast new not so sophisticated vietnamese restaurant; I'd recommend going to Pho Mi Mi!"}
{"text":"There is a plethora of Vietnamese places in East Chinatown you could be eating at. Why not Mi Mi?? It is probably your best bet. Always reliable and affordable comfort food, like a big-ass steaming bowl of pho, or a vermicelli dish. Zoidberg would not complain at all.

This place attracts a disproportionate number of non-Asian diners compared to East Chinatown's other (and less remarkable) pho houses. Probably because the friendly folks in this no-nonsense eatery speak fluent English. That, or these white people have discovered what my own family knew long ago about where to eat in this part of town. They should also remember that it's cash only here.

{TTC: the 506 to DeGrassi.}"}
{"text":"This is a small family owned vietnmese restaurant.  People don't come here for the decor, frankly it's a bit tacky; they come for the fresh, inexpensive and delicious food.  When you walk in theres a somewhat cloudy fish tank with very large cat fish with bulging eyes, don't let this turn you off.  I have been to this place many times and usually order the same item. They do grilled steak and bbq sugarcane shrimp very well. My favourite is the bun vermicelli, it's always the same and loaded with fresh veggies.  My kids always order the do it yourself salad spring rolls and they have fun making their own food. Where else can a family of 4 eat dinner for 41$?"}
{"text":"I went here with my friends and ordered the rare beef pho and shrimp spring rolls. The pho was okay, but definitely not the best I've ever had. I absolutely hated the shrimp spring rolls and the dipping sauce that came with it (it made me gag and I ended up spitting it out), but I think it's the same spring rolls that you would find at any other vietnamese restaurant so I don't blame them for that. 

I really liked that they had the option of hot or cold tea (we ordered cold tea, I think it was green tea!) and it was very refreshing on a hot day. This place is also airconditioned!!

One thing that I didn't like is that by the front desk where you go to pay the bill they had a large container of fish sauce with no lid and it smelled very bad and unappetizing to me. They also only took cash, not even debit card was accepted so I had to run around looking for an atm."}
{"text":"The food was good/decent.
The low review is for the LACK of signage in front that this is CASH ONLY.
It's 2017 if you don't have debit, you are both lazy and most likely 'particular' about what gets claimed at the end of the year...  When I have to walk down the street, pay a debit fee and banking fee to get your 'blessed' cash, it's annoying.  There are a lot of us 'cashless' folks these days, get on-board.  Ultimately I would go back to the other PHO places in the area, easier/cheaper.  
Plus what is it with Vietnamese restaurant/daycare?!  Wandering toddler switching between crying or hollering ain't endearing!"}
{"text":"We stopped in here this evening.  I really dig this place, it's tasty, and clean!  A pleasant surprise.
I ordered the pho with with beef and brisket, and my friend had the pho with beef balls and something else...both were delish ($5.95 each for Small)

We also has shrimp fresh rolls ($3.95).  Everything was very tasty and extremely affordable.  

I'll be back."}
{"text":"East Chinatown, you have disappointed me yet again. There's something about pho in the east that just doesn't quite cut it. With so many raving reviews, you would think that Mi Mi would be a gem but I think it's far from that.

Let's get to the basics and that means Pho. The noodles are right (traditional dry noodles), condiments all good and the beef is pretty standard stuff. The broth is what really let me down. Instead tasting the usual herbs and spices like star anise, strangely enough I was tasting fish sauce. I love fish sauce in my stir fries but in a soup it left me a little confused.

Equally confusing was the fact that there is yet another Vietnamese restaurant in the east end using the wrong spring roll wrappers for their spring rolls (Bach Yen is the other one). However, I do have to admit that the filling is pretty good.

My partner in crime ordered some seafood noodle soup and it was loaded with Pepto colour faux crab sticks (it's common to have faux crab this type of soup but just not in such an abundance). The taste is again very strange and off-putting.

All in all, both soups have a taste that I don't quite recognize and neither are good. However, as I glanced over at the other tables I did catch a glimpse of their barbeque dishes and they look delicious! Maybe, i'll come back to try it out in the future.

In the meantime, avoid Pho in the east if you can. Oh yeah, the service is impeccable and they accept cash only!"}
{"text":"Not bad -- of all the 'East Chinatown' Vietnamese joints, this probably has the friendliest service from the Cantonese speaking ladies.  And, oddly enough, has a large rainbow flag decal on the window.

I've had the dac biet (house special pho) twice here.  The pho broth is very light in colour but packs decent flavour.  However, I felt the beef bits subpar -- these is no rare beef and everything comes fully cooked.  I would suggest going with the pho tai or asking them to have the rare beef on the side.

I have to give the edge to Bach Yen for my favourite Vietnamese joint in East Chinatwon, but Mi Mi is a decent alternative.  Drop by here because my girlfriend prefers the vegetarian options here."}
{"text":"Very overrated. Food was alright - we had bun and pho. I've been to Vietnam and Ginger, which is fast food Vietnamese, is cheaper and better in my opinion."}
{"text":"I generally don't eat a lot of Pho but I definitely enjoy the vermicelli dish here.  I usually get the beef with springs rolls and it fills me up 8/10 times.  GREAT hangover food in the morning / early lunch.

Sometimes service is a bit slow but hey this looks like a mom and pop establishment so not complaints.  4.5/5 for me.

Take out is generally pretty fast if you're in a rush.

 4.25/5 for me."}
{"text":"As a Vietnamese person, I highly recommend this place for pho, bun, and/or ca phe sua da. The pho broth is the best in comparison to the other pho competitors within the vicinity. Their drinks are delicious, but seriously, get their Vietnamese iced coffee if you want to stay awake for the rest of the day. Such refreshing scents and tastes here. 

This is the best Vietnamese spot in East Chinatown that the GTA's got to offer."}
{"text":"Mi Mi is amazing, open late and great quality food for the price.  We had the BBQ lemongrass chicken and the \"make your own cold spring roll platter with beef\"...  The latter on its own would be enough to feed a couple of people.  The service was very quick and super friendly.  A local fave."}
{"text":"The outside of this place is pretty nondescript and upon entering it's also apparent little to no effort has been put into the decor.  But that's okay, as what they lack in ambiance is made up for by arguably the best Vietnamese comfort food in the city. 
    Bun noodles are good and pretty standard fare, but the Pho Broth is where this place really stands out. Clear and flavourful, the broth in the noodle soups is as much a part of the meal as the noodles and filling.  I drink every drop!
     I've been where I'm the only one in the restaurant or other times when it's full, quality is always great. 
     Cash only."}
{"text":"Stumbled across this place in East Chinatown.  After reading the Yelp reviews, my mom and I decided to try it. 

I ordered the rice with chicken, shredded pork, and quiche.  She ordered the vermicelli with spring rolls, and beef. 

My shredded pork, and quiche was absolutely delicious. As for the chicken it was juicy, but extremely tasteless. I don't think it was marinated long enough, because I have never tasted such bland chicken at any Vietnamese restaurant.  As for my mom's meal, the beef was dry and the spring roll filling was really bland.  If I had to come up with a title for this post, it would be \"Drenched my meal in fish sauce\".  Overall, mom gave it a soft four, and I give it a three."}
{"text":"Typical Asian fare, good price, fair service but really lacking in making it a great place. The poor fish in the tank look abused, they are not given enough room to move around and it made me sad while I ate. :("}
{"text":"There soup is always good but beef quality n quantity compare to other pho restaurant is not as good n 10-20% less.

There dry pho with lemon grass pork chops are the best in Toronto.

I think there price has gone up.  Not sure."}
{"text":"We dont come here for Pho. We live in Vaughan but would drive here for its do-it-yourself-platters. Sooooo delicious and worth the drive. Writing this makes me want to make the drive there now..."}
{"text":"I came to this restaurant based on good reviews by my boyfriend's brother. 

Atmosphere was like any other pho restaurant, similar to a cafeteria-style. Small and narrow restaurant with approximately 15 tables?

The pho was tasty, albeit, not the best, but I was more disappointed with the spring rolls. Although they were \"okay,\" they weren't fried with rice paper, but just regular spring rolls wrapper. I would probably return if I were in the area because this place seemed to be a lot cleaner than other restaurants near by and the wait staff were attentive.  It appears that many Westerners come to this restaurant as well."}
{"text":"Come here for rice, vermcelli, and do-it-yourself platters. Noodle in soup dishes should be avoided. 

Friendly service, but can be slow during peak hours.

Pretty average prices, huge menu - a lot of selection."}
{"text":"Was visiting Toronto with a friend, and had a craving for some pho. Put \"pho\" into her super oldschool gps, and ended up in this neighborhood. We were a little sketched out at first, just picking a random restaurant (no data on our cell phones in Toronto, so no yelp to guide us :p) Totally picked this place on a whim, and I'm glad we did. I'm only sad that it's so far from home and I can't have it more often. 

One of the best bowls of pho I've ever had, everything was so fresh. Same goes for the fresh spring rolls. I was also pleasantly surprised that the prices were on par with those that I pay here in the states. Usually eating in Canada is super expensive. 

The service was good as well, though the ordering of the food was a little different than I'm used to. The waitstaff doesn't actually take your order and write it down, there's a piece of paper and pen at your table and you do that part yourself. Guess it's a good thing, never have to worry about being misheard and having someone write it down incorrectly. Once we ordered the food came out quick, which is also a bonus. 

This will now be a stop every time I'm up in Toronto. Yum!"}
{"text":"We've been eating here for years. Favourite pho place, hands down. We have lived in Toronto, Burlington and Mississauga, and always come back to Mimi's whenever we can."}
{"text":"I'm Vietnamese and I think this place is one of the more authentic places for Vietnamese foods.  That being said, authentic doesn't mean it's better.  To be honest I like the pho from those chain pho restaurants better, but those pho places are the equivalent of McDonald's for \"white food\": they taste good, but they aren't authentic.

The pho and noodle soup dishes at MiMi's taste a lot more like what my mom's pho and noodle soup dishes taste like.

What I go to MiMi's for, and what it is known for are their BBQ vermecelli dishes!  Their vermecelli noodle with their BBQ beef, beef balls, Vietnamese sausages, shrimp/seafood wrapped around sugar cane with the fish sauce - that's the stuff!  It's fantastic!  If you go to MiMi's, I would strongly recommend their Vermecelli dishes.

I also eat their rice dishes, they're good too.  And yes, there seem to be a lot of white people in this restaurant for some reason... but I think that's because it's a slightly nicer looking pho place and the waitress there is really friendly and speaks English fluently (as well as Chinese and Vietnamese) - which is impressive!"}
{"text":"great service food is above average but it does take a lilttle longer then usual"}
{"text":"Bomb food yo!!! So good that I didn't even complain a bit! So bomb so good! Very cool very tasty I like it!"}
{"text":"One of my fav places when i lived down here!! This was quite awhile back in the late 90's.
Probably came here every friday for dinner.

And from looking at the reviews, its has not changed much.

Always ordered the Pho. and shrimp roll wrap.  Always hit the spot.

Gonna try it, the next time i'm down here!!"}
{"text":"This pho was so fucking bad I couldn't even find a rating for how shit  it was. Constructive criticism don't dilute the broth"}
{"text":"If you like thick coffee, then the coffee here is a must try. This is way better than the other pho/Vietnamese restaurants on this street."}
{"text":"This is probably the best tasting Pho place i've been to. Broth is clean, and the noodles are very fresh. the Shrimp Rolls are great as well. My Pho standard is the Pho Tai Nam, Rare beef/brisket in XL. I have eaten here regularly for the last year. BUT....

Three out of the four of us noticed a fruit fly in our broth. one of the bowls of Pho had two fly's! such a bad break for such a good restaurant. I hope they do get a hold of their fly situation. talking to the server, apparently it happens when the weather gets suddenly warm. The front of the store is covered....in spider webs and fruit fly's that night we went. hopefully they will take care of that the next time i come by but I lost the appetite fast....

If it wasn't for this fly issue, i'd give this place a 5 star. best tasting pho by a longshot, friendly serving staff, and relatively 'clean', this place deserves a make over to take it to the next level...  and a pest control inspection..."}
{"text":"Everyone tells me how much they love Mi Mi.  I loved how close it was to my house.  What I didn't love was the pho.

The good:
- It's close to my house
- The servers speak perfect English
- It was pretty fast
- It was packed (which like Neil, should have been a warning sign)

The bad:
- The beef in my pho was sketchy looking and fattier than rare beef at the other pho places
- The broth wasn't as translucent as other places, it was cloudy
- I expected the cloud was beef bits that would impart a more robust flavour but... I was let down
- My can of pop was over $1, which I never think is right at dumpy places.  Pop should be $1, the end.

If this was the only pho place in my area I would begrudgingly eat here occasionally, but since it is one of about 10 pho places in my area I will never eat here again."}
{"text":"I've been by this place many times but never gone in, and I'm glad I did tonight. I had the BBQ pork, spring roll, and shredded pork skin vermicelli, which was pretty good. I like the addition of pork skin, which isn't available in all Vietnamese restaurants. The spring roll was also good but not very hot. Same with the BBQ pork. And the noodles were a bit thinner and softer than I like, but that's just a personal preference. Service was friendly but a bit slow. I'd love to go back to try the pho. Bathrooms are in the basement and pretty clean."}
{"text":"My friend's girlfriend is Viet and she said this place is good. She was right. The noodles were fresh, amount of meat was generous, and broth was super flavorful. Also unlike the Chinese owned pho places, the XL size here really does mean XL! Lady taking care of the front is attentive and friendly. The food doesn't come out super quick like the other pho restaurants but it's still relatively quick and the pho is definitely worth the extra few minutes!"}
{"text":"Service is the best part of this place. Nice, friendly and attentive.

Cha gio are home made but not fabulous. Pho is too bland to my taste and meat not a first choice. Perhaps this place is better for bun and do-it-yourself plate/combos.

I can continue to look for the best pho in Toronto."}
{"text":"ordered a rice dish. the bbq pork chop and boneless chicken thigh. also added an egg.
it was a bit pricey, coming in at over $13 before tax and tips. but the portions were big. also comes with a bowl of soup which is a nice unexpected gesture.
food was a bit slower to arrive than other pho places but it didn't disappoint.
i'd definitely come back to try out some other stuff they have."}
{"text":"Been going to Mi Mi Restaurant for years! I love this place. It's my daughters and my go to restaurant when we're downtown to see my grandparents. The food is so flavourful.  The service is great and the owners daughter that serves us is very nice. My favourite and go to dishes that we usually get is the fresh shrimp cold rolls and their yummy spring rolls filled with taro and pork. Their pork chop with rice is so good and flavourful and comes with leek soup. I usually get the specialty soup called Bun Bo Hue. I usually asked for slices of beef only. This soup comes with pigs blood and pigs feet which I'm not crazy about. My daughters love their beef balls noodle soup.  Their vermicelli set where you wrap the rice rolls yourself is also quite good. Never had a bad experience and really love this place!"}
{"text":"I've been to many pho places, and this is definitely one of the better ones. The soup base tasted fresh, the meat portions were good, and the bowl was massive. Unlike a lot of other pho restaurants, the soup base at Mi Mi doesn't feel like it's loaded with MSG and salt. The service was also speedy and friendly. 

Mi Mi is overall a viet restaurant with great value."}
{"text":"Love this place !!  Owners very friendly and accomodating
DIY platter with bbq pork and beef platter amazing.
 Bun vermicelli very fresh
Curry noodles in a broth/sauce out of this world. Never tasted anything like it
  Had vietnamese coffee.. OMG it was heavenly. individual press(at the table) with condensed milk in the bottom"}
{"text":"Great pho noodle soup! We ordered rare beef and chicken pho our usual favourites. The broth was so clean tasting, enjoyed every bite of our food. Large is bit smaller compared to other places so order xl if you're hungry. Would've been 5 star if the portions were bigger."}
{"text":"There are so many different Vietnamese restaurants in the Gerrard and Broadview area. Sometimes it is not easy to decide which one to go. 

Me and my friend was walking along Gerrard looking for a place for our Pho fix. Mi Mi Restaurant looked packed on a Sunday afternoon and I thought it must be good if the place is busy... I was wrong and right at the same time... 

We were lucky to get the last available table, after that people start lining up waiting for one. 

Special Pho XL ($7.50) 
- The broth is so clear...but full of flavours.. though lacking the star anise but is A-OK 
- All the Beef that comes with the Pho were nicely prepared.. taste wise, texture wise.. 
- Noodle though not fresh but was also nicely prepared 
- XL is huge....we cannot finish the whole order! 

Spring Rolls ($3.95) 
- has taro inside as stuffings.. not usual in a lot of other Vietnamese restaurant I been to 
- pipping hot when it arrived... 
- the wrappings are more the Chinese spring roll wrappings 

Mi Mi Restaurant is the only Vietnamese I been to when our nice polite waitress asked me if we want more broth for our Pho!! My friend is a Pho soup monster..she was drinking the soup without even eating the noodle!! 

So the food is quite good and service is nice.. I would give a 3.5 to 4 star. However, it took us almost 1 hour to finish our lunch!! Now I know the reason why Mi Mi was packed this particular afternoon.. we waited more than 30 minutes for our food to arrive!! All these people were just sitting there waiting for their food!! If I go for Pho, I expect to be fast and quick, in and out within 30 min..not 1 hour!!!!!!!"}
{"text":"Our go-to place for Vietnamese food! This place is no frills, but cranks out authentic spring rolls, pho, rice dishes and vermicelli. Service is friendly enough and fast. I always order deep fried spring rolls and pho (chicken broth) with BBQ pork. Now, the key to a delicious pho is to season it properly. The BBQ pork comes on a side plate so dump that in right away along with the bean sprouts and those beautiful fresh Thai basil leaves. Squeeze the juice of a lime wedge or two in. Add a touch of soy sauce, hoisin sauce, sriracha and chilies. Perfect!"}
{"text":"I honestly think that anyone would enjoy food at Mi Mi's. It's just that good. But if you are a fan of healthy light food, this is a perfect place for you. Food is flavorful, ingredients are fresh and you will get more than enough food for a good price. I love going there with friends and order fresh rolls which you get to make on your own. Makes the experience more fun! Personal favourite: avocado smoothie."}
{"text":"Basically the food tasted good.  I ordered pork chop with rice and it also came with soup.  Nothing wrong with the food.  And there's quite a few selections to choose from on the menu.
The only thing was that it was a large group of us and we had to write down our orders on pieces of paper, which somehow got confusing.  Then we waited a long time for the food to come.  
So the gist is, they are not well equipped to handle large groups last minute.  But i should think everything would be fine if you go with a small group of people."}
{"text":"My friend and I are from Rochester, NY and stopped here randomly for food. We were a little nervous walking in because of the appearance of the restaurant but I'm super happy we stayed. This was BY FAR the best Vietnamese food I've EVER had! The shrimp spring rolls were amazing. My friend got the chicken pho and loved it. I got the bun with bok choy and tofu. Everything was perfect. Great prices and TONS of food. 

We WILL be back!"}
