{"text":"Mi Pueblo is now open under a new name - Mi Casita.  Same menu, same cooks and recipes, new management.  Come on back and enjoy.  From: The New Management"}
{"text":"i am a california, mexican  transplant to the cleveland area.  i was longing for the authentic taste of the hole in the wall taquerias that are so prevalent in the mexican hoods of L.A. when i happened upon Mi Pueblo.  My prayers were answered.  The food is as authentic as it gets and whenever I need a taste of home that's where I head to."}
{"text":"Was wondering what Mexican food would be like in OH... but was pleasantly surprised by this little place- Muy Bueno!  Steak Tacos were highly rated by my travel companion and the tamales I had were the best I've had in a while -moist, full of tasty shredded pork covered with an awesome home style sauce -Muy Rico!  Did not try margaritas, but they looked too Limey to me.  Only thing that could've been better was the Tres Leches cake was a little dry & needed more Leches, but tasty non-the-less."}
{"text":"Went for lunch on a Saturday afternoon. The server was prompt and friendly. We ordered chicken enchiladas with mole sauce. It was delicious and one of the more authentic dishes we have had in his area. Everything we had was very flavorful. The salsa had a little bite and the chips were crispy and tasty. We will definitely return!!"}
{"text":"FYI sign on the door says \"closed for business\". No indication of a new address. My favorite restaurant, so this is painful to see."}
{"text":"Truly authentic mexican food, not that gringo stuff, and lots of it. Salsa's are house-made and not the same-ol, same old. If you like real Mexican food try this place. Only down side: dumpy location and tables are sort of cafeteria-like. Friendly and efficient staff, though they aren't so fast at clearing off tables (though when they do get around to it, that table is CLEAN!). Recommended."}
{"text":"Authentic family run taqueria atmosphere and a very fine burrito. A little different in composition and presentation than I'm used to at home in Southern California, but well prepared and delicious and the rice was also very tasty. Will definitely eat here again the next time I'm in the Cleveland area."}
{"text":"I've been working in Cleveland the past few months and wanted to get out of downtown and explore the other dining options in this city. I noticed on Yelp Mi Pueblo had received good reviews for their authenticity and yes, I agree with the other reviewers about the food. It's nothing too spectacular, it is just authentic Mexican food. The prices were decent and the decor was as everyone else has described it.  But what I didn't expect was to contract viral gastroenteritis from this place and remain sick for several days. If you don't know what this is, look it up. It sucks. I will be working diligently to have this place inspected by the city health department for unsanitary conditions. I will never go there again. Good luck if you feel like taking your chances at this shady joint."}
{"text":"Very disappointed. Read the rave reviews and was excited to try. Went with my husband and 2 kids, around noon on a Saturday. The place was pretty empty. Everything is very cheap on the interior and exterior. Ordered a kids quesadilla meal, a chorizo and a barbacoa taco, and the fajita entree. Everything was bad. The rice was dry, the tortillas were soft and tasteless, tacos were average at best. The fajita entree had almost all peppers and onions and no chicken, and they gave you one teeny tiny scoop of guac and sour cream. My daughter ate maybe 2 bites off of her plate. The chips and salsa were the best part. They were warm when coming out, and the salsas were quite delicious. Very spicy. We also shared their signature lime margarita, which was also nothing special.   Also the service was fine when we went.. but then again the restaurant was nearly empty.   Definately won't be coming back."}
{"text":"With places like \"Mi Pueblo\" around, I don't understand how chain places can stay in business!  One of my extended family members is from Mexico and this is the only Mexican restaurant she will even consider setting foot in!  I ordered the Sopes al Pastor and they were outstanding!  The shells were crispy on the outside, chewy inside and the meat was fantastic!  The ubiquitous chips and salsa was even great!  They serve green and red salsa and they are very flavorful and pretty zesty!  The pickled carrots on the table are really good too!  I've also been to Mi Pueblo for breakfast and the \"desayuno especial\" (mexican steak and eggs) is very, very good!  Be sure you wash everything down with \"horchata,\" a Mexican rice beverage.  The service is very good, and they even endure my attempts to order and speak Spanish with minimal laughing!    If you go, be sure to stop in the grocery store right next door.  All of the meats, salsas, guacamole, etc are available for purchase, as well as \"chicharrones,\" the GIANT Mexican pork rinds."}
{"text":"I've been a fan for at least 10 years. This place is fantastic. Don't go there if you're looking for run-of-the-mill \"tex-mex\" food. It's far more interesting (although they DO have massive, good time burritos).  HOWEVER, they are currently closed for remodeling as of Nov. 27, 2013. Hopefully they reopen!"}
{"text":"While I never seem to get the name quite right, the avocado torta with refried beans is my favorite avocado sandwich ever, and Mi Pueblo has allowed me to enjoy it for years.  The bread is what makes it, in particular -- it's a very light, flaky roll.  The sandwich is warm, and the avocado is plentiful.  I haven't dabbled with a whole lot else on the menu because I'm so hooked on that torta, but other people have enjoyed their entrees when they've been along with me."}
{"text":"I have honestly been going here for years. It isn't as good as it was a few years ago,but still is very good. the one on detroit is alot better then the one on euclid. I usually get the tomales and and have to say they are the best i have had around town. The large margeritas are pretty good as well and depending on the day are quite strong. I know there is a half priced night just not sure when. Anyways enjoy"}
{"text":"I spent 15 years in Southern California, and this is the most authentic Mexican food in Cleveland. The atmosphere is non-existent, but the food makes up for it."}
{"text":"Like many others have said, this is easily the most delicious Mexican food I've ever had. Though I've never been to Mexico, it seems very authentic.  I've had the avocado tostadas several times. It was hard to switch and try something else, but I took the advice of several reviewers and tried the avocado tacos - yum! So simple and delicious.  My boyfriend loves the beef tongue tacos. He also enjoys the tripe, but that can be more an an acquired taste.  I don't think either of us have ever finished a complete meal. Most recently, I even ordered smaller portions a la carte and still couldn't eat everything. I did, however, really want to.  If you're drinking, beware of the large margaritas, unless you plan to stay for awhile. Basically, for the price of one standard cocktail at a fancy bar, you get a margarita the size of a fishbowl.  That being said, for my money, nothing goes better with delicious Mexican food than a Tecate with lime, salt and hot sauce."}
{"text":"I love this restaurant , great food good spices and there's tapatio on almost every table. :D"}
{"text":"I just moved to Cleveland from FL and have been searching for a good Mexican restaurant. I went here with high hopes after reading all the great reviews.... Ended up pretty disappointed! I got a chicken burrito. The chicken was bland and could have used some seasoning. The rice also lacked any kick. My fiance got carne asada. He was also not impressed, leaving his meal unfinished. (This is noteworthy as he ALWAYS has a clean plate!)  All in all, Mi Pueblo Taqueria was alright... not horrible, but not good either. I will not be returning."}
{"text":"Mi Pueblo is not only my favorite Mexican restaurant in Cleveland, it is my favorite restaurant ever. Period. And I've been going to Mexican places since I was like 4 years old. I would probably eat here every week if my girlfriend would allow it. I've been to most of the Mexican places in town(Luchita's, Maya, Don Ramon, Nuevo Acapulco, Villa y Zapata, etc.)and they all seem to have the same menu items. Mi Pueblo however, has dishes not found elsewhere. I highly recommend their steak dishes and soups. Their salsa is unique and spicy, not for the faint of heart. Service is generally good and fairly quick, though not lightning fast. Things here seem mostly made to order. I've never been south of the border so I can't speak to the authenticity of the food. The Taqueria still flies refreshingly under the radar and there is no trace of trendiness nor a hipster to found. Check out this hidden gem... stat."}
{"text":"I'm very enamored with Mexican food. Every time I've come here the food has been great. The dinners have large portions and the lunch burrito's are huge too. You get every cent of your money's worth here."}
{"text":"We visited this restaurant due to the yelp reviews but were very dissapointed with our visit. The best part of the meal was the chips. The food and salsa were tasteless. They were overpriced for the quaility of food and the ambiance of the restaurant. Will not return."}
{"text":"The best mexican food in the city of Cleveland......  GOOD STUFF:  Again, best mexican food in the city.  This is the closest you can come to original, native mexican food.  It holds its own against places in Arizona I've tried.  Marguaritas are strong- holey moley- the medium has a crazy amount of alcohol in it.    BAD STUFF:  Not upscale dining but how many mexican places are.  The area is average.  PRICE:  About 40 for two people with drinks  OVERALL:  My favorite mexican place in all of Cleveland.  Good, well prepared, non americaized food.  Strong drinks. Check it out for sure."}
{"text":"once, on a first date with a guy, he took me to mi pueblo.  this was before i lived in the mission in sf, so i had no idea what real mexican food tasted like.  i was just used to chi chi's. well, i spent the rest of the date in the bathroom.  yep.  i'm THAT cool.  i dated him for years though, so i guess mexican gas is endearing.  and so is mi pueblo.   (side note:  that should be a commercial for them.  with some really suburban sorority girl doing a testimonial saying that.  if i didn't know  about the place before, i'd turn me on to the place. hahahahaha)"}
{"text":"Good, but not worth all the hype.  I don't know or really care all that much what California Mexican is, but feel sorry for you guys if this is what it is, because I assure you it isn't authentic Mexican.  It wasn't terrible, in fact I had quite a good experience, but I was expecting a more authentic experience from somewhere with these reviews.  Tacos with lettuce and tomatoes??  I expect that at Taco Bell, but \"con todo\" usually means onios and cilantro, and if your lucky some radish and cucumber on the side.  I had a chile relleno, which was pretty good, but my chicken taquitos were beef, no biggie though, I like everything, just expect to get what I order.  What really confused me, is I ordered Guacamole, and our server said \"no more guacamole\", and walked away without any other explaination.  OK, if they're out, I understand, but then when my meal came out with guacamole, I got a little more confused.  As far as Al Pastor goes, not in my top ten, but I am very picky about it, and have been spoiled down in Columbus, as they have tons of amazing Mexican joints."}
{"text":"I AM a fan of Mi Pueblo. However: I'm not its biggest fan ... yet.  I'm reluctant to write this review now, after having only a burrito and a bite of my husband's tostada. It was very good. We did takeout, so I can't speak to the entire experience, which I suspect is part of the reason why I'm not like \"OMIGOD, this place is sooooo authentic!!!!\"  So I'll just focus on the food, and update later when I've been to the restaurant.  The burrito was fine. The chicken inside was FABULOUS and tender and lovely. But everything else was just ok. There wasn't much cheese or sour cream or really anything else other than chicken and refried beans. So that was a little disappointing. You know it's bad when I have to go to my fridge and bust out the greek yogurt to make it not so dry.  The tostadas were great. Full of flavor. I should have gone with something like that.  The rice was really not so special. Bland and one-note. I'm a fan of really tasty, zesty rice. This was not it. The refried beans were ok, but as a general rule I like to stay away from those.  So, the moral of the story? I don't know. I'll try it again, dining in, and then update!"}
{"text":"This is a taste of Mexico. I have been to Mexico and nothing in the states that I've had is exactly like the food there, but this is the closest thing I've had to it in the city.   Nuevo is one of my faves, but they are Americanized and don't carry the same variety of dishes as Mi Pueb. I have been to Arizona and they are the Mexican food capital. The taco's are prepared at Mi Pueb exactly as they are in Arizona. Great tasting, fresh, white corn tortilla, stuffed with chorizo or carnitas or steak or barbacoa, served with pico and lettuce. I have tried them all, my favorites are carnitas or the chopped steak (don't remember the actual name for this meat). Also, I thoroughly enjoyed the tamales. The red sauce on my enchilada's was a little bitter, so I'd rather to do tacos or tamales any day.  I love spicy, so I crave their salsa that they serve upon seating with tortilla chips. I ask for no beans or salad with my entree (they just take up room on the plate as far as I'm concerned). The rice is nothing special but doused in the red or green salsa, is fine.   I have tried the flan and tres leches cake as well, both were good. Also, try the rice water if your into that sort of thing.   Most authentic Mexican tacos around, I'd stick with something simple like a burrito or tacos. I also recommend mixing and matching, i.e. one carnitas taco, one fish taco and one tamale. If you do, you wont be disappointed. Yum-mo."}
{"text":"Decent food....overpriced sour mix passed off as margaritas. Medium margarita was almost twice the cost of each meal."}
{"text":"the new grocery store they have opened on Lakewood Heights blvd ROCKS! The service is friendly, they answer any questions you have. They have really tasty samples for you to try and and the taco stand has multiple filling choices and would be approved  by Anthony Bourdain as truly authentic Mexican...  I am so lucky to have this nearby!"}
{"text":"**HIDDEN GEM ALERT**  This is seriously good, authentic Mexican food.  Being an ex-Californian, this is the closest I have found to great Mex and I am one tough customer when it comes to Mex.  We usually frequent El Jalapenos in Lakewood but the quality of ingredients at Mi Pueblo is head and shoulders above El Jalapenos.  Mi Pueblo makes their own corn tortillas and they are delicious.  I ordered the Enchiladas Rancheras with cheese and they were super yummy.  The ranchera/mole sauce is killer.  Great service.  Perfectly sized and priced lunch options.  We will definitely put this place in rotation--and go to it frequently!"}
{"text":"Went to the on Lorain for the first time with a friend. I was not looking forward to it considering my experience with the one on Euclid was tasteless and awful.  I was pleasantly surprised. It was a-mazing. Best mean I've ever eaten (and I'm not much of a red meat girl) and the avocado taco was even more amazing.  Atmosphere was much like a diner with lots of people speaking spanish around.  I definitely recommend it.  Afterward take a walk to Holy Land imports and gets some SUPER cheap spices."}
{"text":"This place is hands down my favorite Mexican restaurant in Cleveland!   Yes, there are more trendy places. You can go get a crazy taco somewhere or really unique gacamole for $10 somewhere else. But this place is authentic (as far as I can tell), cheap, super filling and delicious!   The table salsa is probably my favorite table salsa ever. There are two kinds and both are nice and spicy. They also provide fresh chips and some pickled veggies to munch on (YUM). The sangrias are HUGE and there are a few Mexican beers to choose from, as well.   The menu is large and so are the portions. Everything I have tried here so far has been really tasty. Nothing insane - very basic stuff - but I promise you that it's better than all of those chain Mexican places or the ten other restaurants with identical menus (see el Jalapenos and and Si Senior - I kid you not, the menus are the same).   Servers were friendly and food came out pretty fast. I have zero complains. It also hasn't been crowded, in my experience. Like I said before, it's not trendy or innovative, really, but if you are just craving Mexican, this place is the best!"}
{"text":"Best tacos in Cleveland, worth the drive!  Very authentic, wish I lived next door so I could enjoy their dishes every day.  Not heavy or greasy, very fresh ingredients prepared honestly at an honest price."}
{"text":"Mi Pueblo was a hit with my fiance.  My opinion?  This place just isn't my style.  The day we tried Mi Pueblo I was in the mood to stuff my face with chips and salsa, chow on some cheesy enchiladas and swill some margaritas.  I knew the minute we stepped foot in the door that I was in the wrong place.  First of all, even though there were several tables filled with patrons, it was so quiet you could hear a pin drop.  I felt like everyone in the place could hear our conversation.  Speaking of, the other diners sorta bordered on the creepy side.  There was a table of older men speaking Spanish and staring at us as we ate.  I got fed up at one point and threw a stank face their way, but that didn't deter them.  My high school Spanish didn't allow me to make out what they were saying...which is probably a good thing.  But needless to say it made for an uncomfortable dining experience.  Our meals were very good.  My fiance had a pork dish that he raved about and my shredded beef tacos were delicious.  The quality of the food is what saved this review from being a 2 star-er, but Mi Pueblo isn't on my try again list based on ambiance alone.  Yeah, yeah...I know that if you want \"authentic\" sometimes you have to skip the ambiance, but that doesn't work for me.  Oh well, I guess I am just a margarita drinking-taco eating (wait, that doesn't sound right)-cheesy Americanized Mexican restaurant-loving gal."}
{"text":"Closest your gonna get in this area for authentic mexican. Makes me feel  like I'm back in Cali maaaaan. Seriously this place ROCKKKKSSS !! WAZZZUP MI PUEBLO YOU MY SAVIOR!!! CHORIZO TACOS RULE!!!!"}
{"text":"\"best authentic Mexican I found in this City. When I say authentic Chipolte does not come to mind (McDonalds owns it)\""}
{"text":"This is one of those not-nice-looking, not-in-a-nice-neighborhood, but good food places for cheap.  The building it sits in, and the inside are both unimpressive. The first thing that was good about this place was the chips and salsa. They give you their house salsa which is nice and spicy. We did not order drinks but on the menu, we decided to try out some of their different tacos. They have interesting things like beef tongue, etc. and the best part of it was that everything was cheap.  I wouldn't go out of my way to go to this restaurant, but if I were in the neighborhood again, I would try it out."}
{"text":"I love Mexican food with a passion greater than I have for many things in life.  On our trips to Tucson we basically eat nothing but Mexican food because you can find it in abundance and it is authentic.  If you are reading this and thinking \"yeah, I love Taco Bell,\" then I kindly ask you to stop reading, pick up the nearest heavy object, and smash it over your head.  Anyway, it's not as easy in Cleveland, Ohio to find decent, much less fantastic, authentic Mexican food.... but you really only need one, and that one is Mi Pueblo.  The prices are reasonable, especially when you see the amount of food you get.  Now I have been known to clean my plate in Mexican Restaurants, regardless of my fullness, regardless of the pain of my stomach stretching to new sizes, regardless of the food coma that I know will hit me shortly after eating that much food.  I love Mexican food so much that I just can't stop.  Mi Pueblo, however, served me so much food, that I could barely eat half my meal.  This does not mean I did not love every bite, because I did, there was literally that much food.  Of course we started by munching on the usual chips and salsa.  The salsa, however, is not so usual.  You get one red and one green and they are both fantastic.  We then got an appetizer (this could be considered a mistake, considering we knew how much food would be coming... but ooooh it was so good... trust me... get the app and then bring some of your meal home.)  We chose the \"Queso Fundido con Rajas.\"  Just thinking about it makes my mouth water.  For those of you less proficient en Espanol, this is a plate of melted Chihuahua cheese with poblano peppers which comes with warm tortillas to wrap it all up in.  This is one of my favorite appetizers of all time.  If you are a cheese addict like me, you need this!  Then our meals came.  Jason ordered the Flautas, which were piled high with cheese, lettuce, sour cream, and home made guacamole...  They were good, really good.  There was so much food on his plate you really could not see the plate, between the rice, beans, four flautas with the previously described toppings and a little arrangement of lettuce tomato and I believe cucumber for those trying to consume something healthy along with this meal :)  My meal was way more than expected.  I ordered the Gorditas.  I actually thought I would be getting one gordita, along with rice and beans.  Instead, my rice and beans had to be served on a separate plate because the THREE gorditas on the other plate didn't leave room for side dishes.  These things are like thick, crispy, taco sandwiches.  I got the carnitas (shredded pork), which was cooked perfectly.   I had enough left over to eat a second very filling meal today for lunch, and honestly, should have split it into three -- but I am a glutton for punishment.  Each gordita is plenty of food on it's own.  I wish I knew more about the history of this place.  I don't know how long it's been there, but I believe it's been a long time.  Everyone who works there is super friendly and they have a great jukebox filled with Mexican and Tejano music.  We always go to the original one on Lorain Rd, but I believe there is also one located in University Circle.  We've gone for breakfast, lunch, and dinner, and were never once disappointed.   I highly, highly, recommend Mi Pueblo for  your next Mexican meal."}
{"text":"I think this is a standard mexican restaurant. It's alright. Free chips and salsa are always welcomed."}
{"text":"Been here twice now and can say without a doubt that this is the best Mexican food in Cleveland.  Not necessarily the most authentic but definitely the best TASTING Mexican food around.    I'm a burrito fiend and I have been to too many Mexican joints around here that serve me burritos smothered in sauce with a fork and a knife on the side.  WTF is that?  A proper burrito is one I can hold with two hands and devour as I reveal the deliciousness within.  Eat a burrito with a knife and a fork?  Psh!  Who am I, J. Peterman?  With that said, props to Mi Puebla for serving me a proper burrito full of tender, juicy carnitas and just the right amount of toppings all in a perfectly warm and toasty flour tortilla.  Ay papi!  I'm not even going to lie.  This burrito literally made love to me.  And baby, I'm coming back for more."}
{"text":"Love this location. Lomo de res en chile de arbol lunch special is awesome. Salsa actually has a bite to it. Whenever I'm nearby, it is hard to go anywhere else."}
{"text":"In an effort to try new places to eat rather than the old fav's Stephen and I went to Mi Pueblo on Lorain Avenue this evening after reading the many 4 and 5-star reviews on Yelp and Google. It's close to home, looks good...let's go!   WORST MEAL EVER. I'm not kidding, Cleveland reviewers must really like bland, season-less food because both meals were awful. To start my boyfriend ordered a frozen strawberry margarita. It was a 5 on a scale of 1 to 10 (10 being the best). Barely frozen, no kick and just average compared to other Mexican joints we've gone to. We shared the Quesadilla Grande. It arrived...it was a flour tortilla stuffed with cheese and grilled on a flat top. No garnish, no lettuce, tomato or sour cream with it. Thank goodness we had the boring, liquid style salsa/red sauce to dip it in. Next up:   He ordered the Cheese Enchallada  Combination Platter. Once again, no flavor, tolerated it but it was also very bland.    I ordered the Chicken and Cheese Gordita's. Oh, they didn't have those tonight but offered to make something similar and I can't remember the name (started with an S). They arrived and it was basically three grilled English Muffins (mexican version I assume), coated with beans, chicken that looked like and tasted like it came from a can, topped with cold grated cheese, sour cream, lettuce and tomato. I ate 3 bites and couldn't bare to eat anymore. It did taste a bit better when soaked in the red sauce that we had left over on the table.    The server never asked us how the food was, just saw I wasn't eating and brought me a box. Not her fault, she just works there so she got her 20% tip.   We both walked away wondering \"Is this what authentic mexican food in Cleveland is\" and \"is our favorite place Nuevo Acapulco maybe Americanized Mexican food?\". I don't know. I've eaten a lot of mexican food in New Mexico with my parents and it all had flavor. I will never go back to this place. No second chance."}
{"text":"Mi Pueblo is just one of those joints that has always been, and will always be, slightly overrated. It's good, sure. But it's not \"AMAZING\". More appropriate adjectives would be \"alright\" or \"A-OK\".   The food is mostly authentic, I guess. I've eaten in Mexico and I suppose it's pretty comparable to what you'd find there. It's not your typical Americanized slop that you'd find at most other Mexican joints in town. The salsa they serve is actually salsa and not that chunky, mild garbage you expect at other establishments.   Sadly, I think that Mi Pueblo has taken a bit of a nose-dive since I've last been there. They didn't even have guacamole due to \"running out of avocadoes\".   Do yourself a favor and do NOT order a margarita here. Unless you like those fake, electric green, Little Hugs dranks -- stay away. I do not remember their margs being so bad in the past. I'll be smarter next time and order a beer. That sad,  godforsaken margarita was $10 too!  :("}
{"text":"This is the most authentic Mexican food I've had since I've been in Cleveland.  The Quesadilla Sincronizadas are AMAZING (one of my favorites on the menu). everything is well seasoned and extremely fresh. It's the perfect place to go when I'm feeling a little home sick."}
{"text":"The main dishes were pretty good, but not worth the price point, while the rice and chips felt stale/dry.  The service left a lot to be desired.  They rarely refilled water cups, took 10-5 minutes to bring the check after we were done eating, and forgot about a drink order."}
{"text":"Probably the best, most authentic Mexican you will get in Cleveland.  I have been to non-touristy parts of Mexico on a few occasions and I can say this isn't too far from what I would get there.   The first thing you will notice is that there are actual Mexicans dining here. Always a good sign ;) The chips are great and the salsa is HOT. Just the way I like it. I imagine you can get mild, but I'm guessing you'd have to ask for \"gringo salsa\" ;)  One of my favorite dishes is the Chile Rellanos. Lots of melty cheese inside. The burritos and tacos are great as well as the chicken mole. I really haven't had a bad dish. The rice and beans can be a bit on the bland side, but still decent. The guacamole is fresh and chunky. Yum  One important note, as others have pointed out, is not to expect the same quality of food at the east side location. If you want great Mexican, this is where you want to be."}
{"text":"Some of the most authentic Mexican I've had outside of Texas. Would eat here again and again!"}
{"text":"Food was delicious; amazing salsa. The atmosphere was very authentic. Mexican music was playing which made the experience even better. While the surrounding area doesn't seem the greatest, the food at this place definitely makes going there worth it!"}
{"text":"Mole mole mole MOLE.!  So I have long been a fan of Mi Puebs. Ever since my time in grad school at case where it was a Wednesday night staple for half price pitchers of margaritas, it has proved to be the best Mexican restaurant I've had the pleasure of frequenting.   Let's start out with their staple starters. Salsa is not to hot but still packs a good amount of heat. The chips are nicely cooked and lightly salted. But wait there's more! The pickled carrots are tasty bites of sour goodness.   The entrees are all great. Most everything comes with rice and beans, which is always perfectly cooked and not the mush you get served at most establishments. I tend to stick to their mole in one form or another. Their mole is the traditional preparation so it packs a punch of poblano, coffee and chocolate flavors.   My husband goes for their tacos which almost deserve a review all their own. Carnitas, chorizo, carne asada all of them are tasty.   So I guess what I'm getting at here is do not pass go, do not collect $200, and get to Mi Pueblo for the best Mexican food in Cleveland not made by someones abuela."}
{"text":"This is my favorite Mexican restaurant. The food is authentic and not just covered in cheese (which seems to be the norm at most Mexican restaurants). The service is fast and friendly. The complementary chips/ salsa & pickled carrots are always amazing. I love the margaritas. Get one of the flavored ones or the Gold. The regular ones are good but they are neon green and super tart. We love this place so much we go at least once a month."}
{"text":"As a Mexican I find this place offensive to my taste buds. This is not the best mexican food anywhere, ever, at all.   My sister-in-law and I were in the area and craving authentic tacos, saw the rave reviews and decided to give it a try.   The chips promptly delivered to the table were not bad, a bit stale but palatable. The salsa on the other hand was aone-note flavor of just chili. Good salsa is characterized by a subtle blend of key flavors like garlic, onion, cilantro, lime, salt and the chili.   I ordered a carnitas and picadillo taco. My sister got lengua (tongue) and tripas (stomach lining). Yea, she is hard core! But we spent over 10 years actually living in Mexico City and know how this is supposed to taste.   First, lets start with lettuce and tomatoes on tacos. That is just not right and the first sign of inauthenticity. Taco Bell serves lettuce and tomato on their tacos. At least they didn't use shredded cheese.  Second, carnitas are not supposed to be dripping in grease. They are supposed to be a touch crispy, tender and mouth-watering. I literally had a puddle of oil on my plate. Picadillo is not supposed to resemble mushy, pastey sloppy joe. My sister-in-law said her tacos were a bit off namely too chewy and tough. She only took a few bites of each.  Third, the rice is bland. It is supposed to be light, fluffy and again the subtle blend of flavors including tomatoes, chicken stock, salt and cumin. This was just blah, no flavor and mushy with random carrots.  Fourthly, the beans. They were from a can. I'm convinced. It had the twang of tin can that hit your senses as soon as you took a bite. You know the funky aftertaste, that would be the ring of the aluminum. They weren't even brown, they had a red tinge to them and were quite runny. Oddly enough the oil from the carnitas did not add to the flavor of the beans.  We left most of our meal on the plate. We have no desire or need to ever go back."}
{"text":"First, let me start by saying that since I've never been to Mexico or anywhere south of the border for that matter I have no clue what \"authentic\" Mexican cuisine tastes like. I've seen it on TV as Anthony Bourdain waxes poetic about how great it is to eat seared beef tongue tacos off of a dirty-handed street vendors cart (intestinal distress anyone?) and I've read about it on various foodie blogs over the years. My point is, I have no first-hand experience with the native cuisine. For me, authentic Mexican food means that all of the following criteria have been met by the establishment:  1. Food must be prepared by Mexicans. Not having it done this way would be like having your sushi made by an Italian. It's just not right. 2. The location in which it is prepared must contain at least three stereotypical items of decor.  3. I must be able to hear the staff communicating with each other in Latin American Spanish (that's an \"s\" not a \"th\" thank you). 4. I must witness Mexicans eating there at least once during a visit 5. At least one television must be broadcasting soccer  Mi Pueblo passes the test with flying colors. Having been here several times now I think it's safe to say that this is just about as authentic as they come. Everyone that works there appears to have an ethnic tie to the Mexican homeland. The dining area itself is pretty clean. There's a television mounted on the wall, bright red, green and white banners hanging from the ceiling, a sombrero-wearing chili pepper, diner-style laminate topped tables, and plenty of windows. It's nothing to write home about but it gets the job done.  The food is the main reason you come here. The menu is huge and the portions are large. For starters, you get a complimentary basket of really brightly colored tortilla chips and two styles of salsa, an orange and a green. I'm not too sure what makes them different (I'm assuming different peppers) but they're both pretty damn spicy. I wouldn't call either of them mild, that's for sure. As you would expect, just about everything comes served with rice and beans. The beans are smooth, perfectly spiced and topped with queso fresco and the rice is, well, as exciting as rice can get. For me, if the rice is cooked it's good rice.  I've had the tamales, the burritos (chicken and beef), the tacos, carnitas and the chicken mole and they are all wonderful. Sure, some of the meat is a bit dry and the presentation wouldn't exactly merit a nod from Eric Ripert, but c'mon, this is Mexican home-cookin' at its finest and it's not dumbed down for the American palette. And yes, I have witnessed Latin Americans eating here. That's always a good sign, right? I'm also glad they stopped serving the pickled vegetables with the chips and salsa. I bet those things were just about as popular as the cole slaw at Melt Bar and Grilled."}
{"text":"This place is more of a cafeteria than a restaurant. Authentic mexican food with very reasonable prices. I thought the food was good but, the service was very slow. Took over 30 mins to make 5 tacos and bring them to my table. Not one of the better mexican restaurants in Cleveland.  Ok place for lunch but, wouldn't recommend for dinner."}
{"text":"When Mi Pueblo was new it was where I bought burritos to feed my friends as we tried to transform my big ugly old house into something better than it ever was in its century on my block. Thru the years that followed I ate many a time at Mi Pueblo never once regretting a thing. Later years found me dividing my life between northern Ohio and southern California.  Southern California means two things when it comes to eating out. The first is more fast food chains than any place on earth. Second is Mexican food every where. Unlike native Californians I reached super saturation with both.  I sold my house in California and spend most of my time in Ohio staying away from Mexican and fast food.  For the past few months I come home late twice a week and frequently prefer not to cook. I get carry out along the way home. Tonite I decided to return to an old haunt and got a carnitas burrito from Mi Pueblo.  It was amazingly good. In California pork dishes are loaded with fat. At Chipotle the burrito is filled with rice and corn. Mi Pueblo is nothing but chunks of lean juicy pork with a minimal amount of typical Mexican garnishes. It easily out weighs a B spot burger or a Bogtrotters sandwich and is 1/3 cheaper. I was hesitant to return since I have read many negative reviews recently. I am here to add my Hoorays to offset at least one bad review."}
{"text":"I disagree with the other reviewer in that I think the food here is quite outstanding.  This is certainly a more authentic Mexican restaurant: the food is coarse and quite different from the typical run-of-the-mill Tex-Mex.  The menu is also quite large.  Everything I've tried has been good, although some things have been better than others.  There are many items on the menu that can be difficult to find elsewhere, including some good seafood items, and some big soups/stews (including some that aren't on the menu but that the local Hispanic people will often be eating).  They serve drinks, with a good selection of Mexican beers.  The atmosphere in this location is nice, but it is less fancy than you would expect for the price (this place is not terribly expensive but it's not cheap like you might expect).  It feels more like an upscale cafeteria with a small dining area attached--the kitchen is semi-open.  Like the other reviewer said, this place is always hopping!  This west-side location is the one that is frequented by the local Hispanic population, and I think that says a lot about the quality and authenticity of the cuisine.  The east-side location has almost the same food, but a very different atmosphere."}
{"text":"Pueblo is not in MI, it's in CO, so this should be called the Pueblo, CO Taqueria. Except that it's in Cleveland, so now I am confused. Or confusing. Or both, which is worse.  Went back here, and it's as amazing and delicious as ever. They complained about the way I parked :) and that doesn't bother me even slightly when the food is this divine. Second only to Reading, PA as my favourite Mexican food in the North East USA, with Hartford, CT close behind in 3rd.  old review: Wonderful Chille Relleno, good tacos too. Very impressive. Awful service, but when she tastes this good, who cares. The food! I mean the food! 5/5  Anyway, as I said the service isn't great but get over it, you're in the Lakes now and besides that's not why you come here. You just can't find a lot of good Mexican food in these parts, and this food is so delicious (and greasy!) that you just have to put your hands up and say thank goodness. Compare it to the \"best\" Mexican in, say, Buffalo (which doesn't exist)... exactly. Columbus on the other hand does have an amazing taco truck (or did last time I was there), but this place is comparable to that.  It makes me laugh reading the reviews on here. First there are all of the \"I was born in Mexico\" people... but you're not in Mexico, you're in Cleveland! Do you know how hard it is for real Mexican restaurants to survive with all of the American-rip off, American-owned \"Authentic\" Mexican places around? Just for the effort, these guys deserve credit... not to mention some of their food is top notch and delicious. A little greasy yes but so are a lot of the best Mexican places in USA. It's never going to be como El Mexico, but you're not going to get much better than this in the Great Lakes, which is by no means a popular destination with Mexican Americans. You realize also, if we're not careful, Taco Bell will be all that there is left in some regions when it comes to so-called Mexican food. That is why I would champion Mi Pueblo even if they weren't as good as they obviously are.  Secondly, there are all the \"this sucks, there was no guac on the table and no lettuce in the tacos\" people. You can't have it both ways. Either you like bland Americanized Taco Bell crap (which is not even in the same food group as Mexican, nor is it good), or you like Mexican food, which is what this place is.  And like the man (Jeff) said, order the tacos. It's what's right. This place is a Taco joint. Get the Al Pastor. Try some Chille Relleno. Go for it."}
{"text":"Most authentic Mexican food the west side has to offer. Reasonable price, great taste, and friendly/family service. I have been a loyal customer for 15 years. Simple surroundings, great food."}
{"text":"Oh my, Mi Pueblo I still love you, don't worry.   I just can't say no to those salsas, pickled veggies and fresh chips. By the time I get my food, I'm stuffed on those alone.   But yet, you cannot help but still order a delicious meal you'll never finish. This time? Oh, I went for the enchiladas rancheros. You get three, so I ordered one with cheese and two with chicken. The chicken was certainly the star of the dish--tender, a little smokey and perfectly seasoned. The rest was just OK. The red mole sauce was bitter, but when you ate it with the beans and rice, it was better. One of my dining partners had mentioned that their tomatillo sauce is way more tasty, so I'll definitely try that next time.   The service was also a little spotty. At first, everything was great, but then it started to go downhill with really slow service. Not for our food, though--that came out fast. It was when it came time for the check that it was painfully slow.   I will say that when I saw my check I was elated! Thirty bucks for four cocktails (don't judge) and a great meal? Wow... I guess I'm used to much more expensive drinks (and no, they weren't the neon green margaritas.)   Overall, another great experience with delicious, authentic food that only had a couple things keeping it from 5-stars. I left so stuffed that I thought someone might have to roll me out. That's always a good sign!"}
{"text":"Mi Pueblo on Lorain is the best Mexican food in Cleveland.  Being Hispanic and a native of California, I've tried many Mexican restaurants since moving to Cleveland, and while some are good and others not, Mi Pueblo is consistently the best.  It tastes the most like home.  The salsa is very spicy, and incredible.  The enchiladas rancheras are fantastic.  This isn't Tex-Mex.  If, when you order a taco, you mean two corn tortillas with carne asada and pico de gallo, you will enjoy this place.  If, when you order a taco, you mean a flour tortilla with ground beef, sour cream, cheese, and lettuce, well, give it a try because you might find you like this kind better.  Of course, Mexican food like this costs like six bucks in California, but I'm in Ohio, so I'm willing to pay more. But their lunches are cheap!  I have not been to their East-side location, so I don't know whether it's as good."}
{"text":"Real Mexican food not Tex-Mex. Great when it comes to the great soft corn tacos, tortas, and super large burritos with your choice of meats such as Triitas (tripe), Lengua (beef tongue), Chorizo, and at least a dozen more. Weekends there is Menudo, (beef tripe soup) and Birria Estillo (goat soup). Some of the other dinner menu items I think are either a hit or miss. Just stick to the basic Mexican street food item like the tacos and burritos and you'll be fine. They also have a full bar,a good selection of Mexican cerveza, along with some Mexican non-alcoholic beverages as well."}
{"text":"Outstanding!  Skirt steak was succulent,  beans were homemade,  and guacamole was fresh and delicious.  Will definitely be back. And the price was right.... $8.95 for a carne asada lunch which also came with a cheese enchilada."}
{"text":"Very big fan of this place.  I've been coming for years and the meals are huge and come out very fast.  Usually start here before we head out.  Parking can be tricky but its worth it.  Very reasonable prices and I've got to agree with Alan S about the fish tacos.....gotta try them."}
{"text":"Sorry, burnt flautas with the taste of old grease, stale tortilla chips, but the tamales were ok. We used to really like this place. We won't be coming back."}
{"text":"I went to Mi Pueblo Taqueria with a group of friends.  We went for dinner around 7:30 on a Friday night.  They were not too busy and were able to fit our group in.  This was definitely a plus!  I ordered their house margarita on the rocks with salt.  It was ok.  I have had better.  We were served chips and 2 salsas and some pickled veggies.  Just like the margarita they were just ok.  Also, they were all pretty hot on the spice level.  For dinner I don't remember exactly what I ordered, but mine looked very similar to other people at my table who ordered something different.  Overall this place is just ok for food and drinks, but great to go with a group.  Although, the bartender did send over free tequila shots!"}
{"text":"Yes, best Mexican in the city. But hey what do I know I only lived there!  Here is Mexican food 101 Bourdain style!  This is a taco joint. So what do you order at a taco joint? Let me give you a hint, and is not a joint! Tacos, tostadas, tortas, you can not go wrong. Try the Al Pastor! Al Pastor is seasoned pork cooked gyro style! If you want tacos Mexican style it is a corn tortilla, with meat the cilantro, onions, salsa, chile and lime are on the side. You add all your toppings.   What is the national dish in Mexico? Its pork! So if you get any pork items it is going to be good.(see1st paragraph) They also do soups pretty well, it is served with most meals, as expected the soups are good. Mexico also has wonderful skirt steaks, a cut that is just starting to make its way here. So that will be pretty good. Vegan food, just stick to chips and salsa, oh wait I forgot the chips are probably fried in oil that has some contact with animal products.  Are we beginning to see a pattern here? Comprende Gringos? If you ever had a quesadilla in Mexico its just cheese in a folded tortilla, does not have lettuce, tomato, on a sesame bun! So that is what you will get.(Sometimes eaten for breakfast.) A burrito in Mexico is a tortilla with a little bit of meat and or beans. Never is there rice on a tortilla South of the Border, never not once, that would be another Americanized invention. I'm not saying its bad but rice is served as a side! Not sure why they do it  in at the Pueblo.  I do not really care for the fajitas here, the bright colored \"Casa Bonitas\" do a better job than the Pueblo! Not a fan of the flautas either but I did not like these too much when I crossed south of the Rio Grande!  The chips,and salsa, pickled jalapenos and carrots are la bomba.  So if you like your Mexican with lots of ground beef and like to finish with with fried ice cream this is not the place for you.  Stick with places named after popular tourist destinations. Vaya con dios!"}
{"text":"This place is great. It used to be a hidden Mexican hole-in-the-wall kinda place. Now it's pretty well-known and I spot non-Hispanics in there all the time. The combo plates are cheap and tasty. They include rice and beans. Good stuff, overall. Don't go in expecting some kitschy, cheesy Mexican motif. It's pretty bland in that department but if that inauthenticity repels you too, you'll be able to appreciate this place."}
{"text":"People who wrote that this is comparable to CA Mexican food...you're wrong.  Sorry.  The beans and rice are bland...doesn't work. The carrots and salsa in the beginning, yes, yum. The mole...ok but not great.   I will say, the enchilada sauce was incredible except I didn't get an enchilada when I ordered it...they delivered a quesadilla and a side of sauce? Final deal breaker:  I smelled the restaurant on my clothes for days."}
{"text":"My oh my! How is this wonderful place not packed everyday like that grill cheese joint? I've been missing me some awesome mexican food since I moved here and the reviews did not disappoint! I had the Bistec a la mexicana and I should say it's one of the most delicious thing that my mouth has ever had to experience. When you step into this fine eatery, you'll find it unassuming, unpretentious and quaint. You'll be served a plate of the often-mentioned pickled carrots, chips and two kinds of salsa. Try the pickled carrot. It's an unique dish that I've not tasted before. The tortilla chips is good but beware of the salsa. There's the red chili salsa which is the best salsa I've ever had at a a restaurant if you can get pass the burn.  Next is the verde salsa. Green goodness if you can get pass the burn.  Yep they both burn GOOD! The menu is full of both familiar and house specials. I've always like most any dish \"a al mexicana\" so when I saw \"Bistec a al mexicana\" I was sold! MAN was it good. Good doesn't even do it justice. It was excellent! it's like waking up in the morning with coffee and breakfast already made and served to you in bed, good. It's like weekend at Bernie's without all that Bernie drama, good. You know what I mean. I didn't have room for anything else after but I must say, the smell of leftover Pueblo's food in your car is an aphrodisiac. nuff said."}
{"text":"This restaurant is authentic, and with most Mexican restaurants.. the margaritas are heavy on tequila ;-)  However, the al pastor is quite bland, but the sides of rice and beans were excellent."}
{"text":"In honor of the past, this place was the real deal.  Consistent and probably the best authentic Mexican in the city.  Found them at the Taste of Cleveland in 1996 and going since.    RIP!"}
{"text":"As far as inexpensive, indigenous Mexican eats in Cleveland, it won't get any better or more authentic than at Mi Pueblo Taqueria.   That's all. Short and too the point. I could wax poetic on the chili rellenos, the spicy salsa, the guacamole or the pickled carrots, but I don't want to muddy up the review. It's all been said before. Quite simply, this place is great."}
{"text":"Actually , The sign on the door says:  \"closed for remodeling... Will reopen under new management\""}
{"text":"I live in the hood and have eaten here or got take-out dozens of times. I don't care for the burritos, but do love the enchiladas, especially the enchiladas pollo suiza. Good chunks of tender chicken, the green sauce is superb. The simmered beef and simmered pork tacos, especially the pork, are very good. I'm going to breakfast there tomorrow for the first time. For the money, you can't beat this place; you can get a very inexpensive lunch that tastes great!"}
{"text":"Awesome taco dinner. Great salsa. Excellent cheese sauce.   I would really like to box this place up and plop it down in TX where it belongs.  I don't have one bad word to say about the place. It's greatness."}
{"text":"Hot damn. This is by far the best Mexican food I've had in Cleveland and in the running for the best I've had in my life. Sure, it's in a slightly dumpy part of town, but at this point in my tenure in Cleveland, if that's gonna dissuade you from a fantastic food and drinking experience, then I feel sorry for you, fella.   For starters, you get bottomless chips and salsa (two types: spicy and spicy as hell) AND these sweet-ass pickled carrots. And as for entrees, the pictures of small plates on the menu won't make sense when you get about three pounds of hellaciously delicious actual food about 10 minutes later. I got the tortas platter because I didn't think I could handle the combination platter, and just the plain tortas were enough for about two and a half of my regular meals. I could have also eaten probably a bucket of just the seasoned rice and refried bean sides.   They say you can only get two of the following three at any restaurant: fast, cheap and great. This place proves that wrong."}
{"text":"Been goin there for years.  Real authentic feel even though youll find the occasional hipster in there lately..Food is consistant.  Service is friendly but a tad slow sometimes.  Margaritas can taste like the mix and not the booze (which is why i dropped a star).  Im a big fan of the tacos.  They will even give ya more chopped cilantro if you like it as much as I do!  Also try to grocery store next door.  Produce can be a lil old though."}
{"text":"best and most authentic mexican food in cleveland, hands down. LOVE the pickled carrots that come with the chips and salsa too!"}
{"text":"We have finally found authetic Mexican food in Cleveland. The pickled carrots and salsa are great!  We make the trip from Akron because it's just that good!  Everything we have had here has been delicious! I personally think the Lorain location has better food than the Univ Heights location."}
{"text":"went for tortas and they are amazing here... my girlfriend and i went for the first time the other day for lunch.. i had the chrizo and she had the bbq pork tortas both were amazing piled high with meat beans lettuce tomato and avacado..  rice and beans are amazing as well ..both the green and red salsa are tasty and spicy.. this place is real mexican food ... after lunch check out the grocery store next door you can a pound of guacamole for under five bucks and it is amazing..  this place is not in the greatest area but it is worth i"}
{"text":"Salsa is really good. Tacos were decent as well. Definitely one of the better places around."}
{"text":"One thing that is hard to find in Ohio is authentic mexican food!!! I've been missing it ever since my last trip to Mexico.  This place is as close as it gets to authentic.  The salsa, tacos, and pickled veggies are my absolute favorite.   If you love mexican food- this place is a must."}
{"text":"Mi Pueblo is still the greatest, but last week I was feeling a little under the weather, and decided to try the Sopa de Res (Beef Soup). It was amazing, and even came with corn tortillas, so you could slurp some soup, then make some little tacos with the savory beef. It was heavenly. And Tom L mentioned the 3rd warm salsa, which I think is only served on Sundays, and is so good, I eat it with a spoon. I am now trying to go as often as possible on Sundays for this special salsa."}
{"text":"My husband & I are from California, have both ate food in Mexico, and we have ate Mexican food all over the United States. My husband said this is one of the best Mexican food places ever. We think their reddish / charcoal type salsa is legendary amazing. We went there 2 nights in a row on our trip to Cleveland. The first night, my husband ordered the chile rellenos dinner, which came with corn tortillas and he said that the rellenos & corn tortillas were the best he's ever had. I ordered a veggie burrito, and I thought it had a little too much onion. The second night my husband ordered pork carnitas - again he said the best he's EVER had. I feasted on their reddish / charcoal salsa & ordered a relleno with beans. My husband said this place compares to the place he loves in Atlantic City, NJ, which we also have reviewed. From now on every trip to Cleveland will include Mi Pueblo."}
{"text":"I must say that we were highly disappointed with this place.  First the red salsa was too hot for my wife, so she asked for something less spicy.  I don't know what the h*ll the brought for her but it was a pale pinkish looking liquid which she said tasted like a tomato soup.  The green sauce had little flavor.... but with all of them where was the cilantro and garlic?  Refried beans, just OK.  With some sort of very few, small pieces of shredded cheese... guess we have become to accustomed to La Fiesta homemade refried beans which IMO are much better with some great cheese on top  The rice, meh !  I had the mole chicken enchiladas, not much mole and not much flavor.  Wife had a skirt steak which was OK.  The worst part I had to stop on the way home to pay respects to Montezuma... and 3 more times since arriving home!  Something in their food was bad.  And to imagine this place was highly recommended by a Mexican friend.  Sorry we will stick with La Fiesta... until we find a place as good as those we have found in the SW US."}
{"text":"A down-home taqueria with great tacos and quesadillas. Features a Mexican grocery store adjacent. Lots of character. Mexican immigrants constitute the majority of customers, although this is not a Latino neighborhood (actually its largely an Arab neighborhood). Parking is scarce. The tacos last time I went were pretty small.  As for someone else's comment that the area is unsafe- that's news to me. I drive through here and stop at businesses frequently and I have never noticed any crime or suspicious activity, just many Arabs...unless that is what supposedly  makes it unsafe???"}
{"text":"And like Dick S I'm here to neutralize a negative Mi Pueblo review.   Like Dick,  I have had Mexican food in some of the most heavily Mexican-influenced areas of the country, including SoCal, Phoenix and Tuscon.  Mi Pueblo would absolutely hold its own in any of those locations. To say my wife and I have eaten there dozens of times would not be an exaggeration in the slightest. Tonight was the first visit in a few months and I'm not kidding when I say we both looked forward to it SO much. And, as usual, it was great as great can be.  From the wonderful service (thank you Theresa and Myra!) to the yummy food to the fun and authentic atmosphere, Mi Pueblo is our go-to place for honest and delicious Mexican food."}
{"text":"This one'll be short, since I've only been there once so far, but I really dig this place.  A friend introduced me to them recently and I had a great experience there!  My avocado taco meal was delicious (and inexpensive!) and the chicken soup that came with it (that comes with everything, as a matter of fact) was pretty tasty, though on the brothy side.  The beans, rice... everything... was cooked superbly - and authentically - and was very flavorful.    I loved the atmosphere, and there were a lot of people there, so it was great relaxing amid the chatter and bustle of a successful eatery.  The light is great, and our server was extremely attentive and knowledgable.  One point missed because my friend is vegan and there was cheese on his plate after he'd asked that it be left off, but it was not that big a deal.  I'd definitely go there again for some yummy Mexican!    (Food.  Yummy Mexican FOOD.)"}
{"text":"I've been to Mexico's west coast, east coast and Mexico City.  The best Mexican food is still in Cleveland at Mi Pueblo.  You won't be disappointed.  The lunch menu is the same great food as the dinner menu with nice portions for about $6."}
{"text":"Ok, but didn't care for their appetizer sampler and my friend's cheese enchilada was drowning in sauce and was chewy and bland.  Nice friendly staff.  Hoping their other choices are more flavorful."}
{"text":"The chips and salsa are very good. Spicier than most. The chicken mole poblano is excellent. Enchiladas are also very good. I would recommend this place highly. Good food at a good price."}
{"text":"Believe the hype. This place is fantastic. It seems they have done some renovations since I last  visited, about 8 years ago. I don't know why I stopped going but I'm glad I returned last Tuesday while waiting to have a muffler installed.  Last time I visited there was a little Mexican grocery store attached. That is gone now but the dining room is much nicer than it used to be.  I had the mole quesadillas and the beef tostadas. Both were quite delicious but If I had to choose between the two I'd get the quesadillas again. Absolutely delicious and super low prices.  I was a little disappointed that they stopped serving the pickled jalapenos and carrots and that the little grocery store is gone but I guess it's a fair trade for the cleaner more comfortable dining room."}
{"text":"The menu was definitely authentic and and the food quality was superb. That being said, the service and atmosphere were just OK. Will probably stick to Nuevo Acapulco."}
{"text":"So, Cleveland, we're 2 for 2 today.  Had a gobble and run experience @ Mi Pueblo as I was chasing a flight at the airport.  The location is down a non-descript street that seems to be in a very average city neighborhood.  The restaurant is brightly lit and clean. Service was prompt and friendly and they more than accommodated my need to move fast with the meal. It's an expansive menu of selections and I got the Tostada combo, which had taquitos, a soft taco and tostada along with rice, beans, guac and a salad of sorts.  Holy combo, that was a ton of food.  Add that to my lunch and I'm gonna have to run for days to get back to my pre-trip weight. The food was decently spiced, not overly but just enough.  I would have liked a bit more seasoning, but it wasn't a detractor.  Everything was fresh, warm and tasty. Prices were reasonable, not suuuper cheap, but not expensive either.  A good value meal that tastes authentic."}
{"text":"I had pretty high expectations per the reviews but found this to be just OK. The flautas were good. The rice and beans were almost inedible to me. I find el jalepenos to be far superior for similar pricing."}
{"text":"My friend and I tried Mi Pueblo for lunch yesterday after I read a lot of a good reviews and the experience was just OK. The location itself is off of Lorain in kind of an empty area. As soon as you walk in, you smell the amazing aroma of fresh sizzling fajitas coming off the stove. They give you two salsas (a green tomatillo one and a red one - both spicy and both delicious). The chips are warmed (don't taste completely fresh) but are still pretty good!  When we first sat down, they were fast in giving us chips and salsa and getting our drink orders in. However, the service slowly began to decline. We requested more salsa and the girl said sure and began wiping down tables, pairing silverware, etc before another party came in. Then she finally grabbed their chips and salsa and extra salsa for us. We decided after we ordered that we wanted queso, so we asked one of the girls who said \"cheese dip? sure\" and walked away. A few seconds later, another person came by and said they don't serve any. Looking back at the menu, they don't - but a) why were we told sure to begin with then and b) i've NEVER heard of a mexican joint not having queso??? And finally, there were maybe 3 tables of customers there when we walked in and maybe 3 walked in after us. People who walked in after us and ordered well after us were getting their food. They had more people and it clearly would have taken more time to make theirs than ours so we were VERY confused as to why our food was taking so long. The waitresses didn't really make it a point to walk over to tables if they weren't taking orders or bringing food and they DEF didn't make eye contact so it's not like we could have asked them. Finally, one of the girls came by with drink refills and said our food will be out soon.   I ordered the lunch portion of enchiladas rojas - one with peppers and onions and one with cheese. My friend ordered their chicken fajitas. From the look of my enchiladas I thought they made a mistake and poured mole sauce on them (not a fan), but after trying them, they were delicious with the rojas sauce - it was just super dark. My friend liked her fajitas as well.   I was happy with the cost of my lunch portion - only a little over 7 dollars. My friend had the lunch fajitas and a diet coke and somehow her meal was 13 dollars, which she wasn't to impressed with.   Overall, the pricing and food were pretty decent. But, the service was not. I probably won't go back mainly because there are other mexican places that I prefer, but if you are considering going, the food is definitely not bad. And, from reading other reviews, it seems the service is either really good or pretty lacking, so hopefully when you go they're doing a good job :)"}
