{"text":"I had my first sushi burrito at Mi'hito and it didn't disappoint!
The atmosphere was quite chill and relaxed, I went on a Wednesday at noon with some friends and most people seemed to be young professionals on their lunch break. It is definitely a trendy place to check out.
Their sushi tastes very fresh and delicious, I got the Flaming Dragon. The combination of ingredients tasted great to me, I love tuna and there was a generous serving of it in my burrito! If none of the pre-set burritos appeal to you, I'd recommend building your own! My friend did that and the process was very simple and no fuss, all you do is check off the ingredients you want on a card that they have at the front then bring the card up to the register to order and pay.
I would definitely come back but I will say that it is a bit on the pricey side. Overall it was worth it though!"}
{"text":"Great place! It's a little expensive since they stopped offering vouchers so I won't be going now as often, but the food is great and it's very filling :)"}
{"text":"Found this place located on Courtney Park and Huronontario which replaced Prince Sushi. Came on Wednesday a bit after 2 and they had a few customers. Not so busy so that was good if you are in a hurry. 

The restaurant provides you with order sheets which allows you to design your own burrito or poke bowl, or you can just order from options from the menu board. The food is pricey I won't lie. If you are looking for sushi worth your money you can probably go to an AYCE, but if you want fresh tasting sushi burritos as a quick bite for lunch this place will suffice.

On to the flavours. My family and I ordered 3 sushi burritos and sushi tacos and they were pretty good. Really fresh ingredients and surprisingly filling. 

Overall if you are willing to shell out money for something tasty that's made with fresh ingredients and will keep you full this is a nice place to check out. Also the take out containers for the burrito is super cute!"}
{"text":"I tired out this place meet lunch because they were giving out free burritos to commemorate their opening. I'd go back. I got the Rising Sun burrito and it was filling. There was a good amount of salmon and crab meat. The tempura bits and shredded cabbage were fresh. The spicy mayo wasn't very spicy but I'm glad it wasn't overpowering. It came in a neat and tidy box with a packet of soy and wassabi. It's a decent value for $11.99. Service was good and the place is clean."}
{"text":"Generous portions, timely service and clean restaurant. The sushi burrito itself was really good. Highly recommend it to my fellow sushi lovers."}
{"text":"I got a salmon burrito and my friend got a poke bowl with chicken. The chicken has so much pepper you'll most likely choke. They give you such little salmon it's ridiculous. I probably could've gotten more salmon from 2 itty bitty slices of sashimi. I basically ate a lettuce wrap with rice. Don't come here - don't be fooled by the cute renovations. Also, they drowned my wrap in spicy mayo it was disgusting. I mean, spicy mayo is great but why do u drown the sushi burrito in it?"}
{"text":"Both the burritos I tried were delicious and filling . Wish I had more room to try the ahi tuna bowl . Would recommend for any sushi lovers . A bit messy but worth it !"}
{"text":"I also found out about Mi'Hito through InSauga. It is located in the AMC Courtney park plaza (approximately two doors down from Demetre's). It reminds me of Burrito Boyz, except sushi style! They serve: sushi tacos, sushi burritos, Poke bowls (sushi bowls) and of course, sushi. The setting is casual. The interior is very modern and clean with plenty of seats. However, you would probably have to share the tables with strangers as they only have long, connected tables.

I couldn't decide what I wanted to try, so my friend and I ordered: a customized sushi burrito, spicy salmon taco and a spicy tuna taco. They gave more filling ingredients than I expected, which was great. Overall, I personally like Mi'Hito better in comparison to Corner by Spoon & Fork's sushi burritos. 

I would definitely come back to this place for some quick sushi meals. I actually wish it was closer to my home (even though it's only really 15 mins away)."}
{"text":"First time at Mi'hito did not disappointment! I ordered two tempura shrimp tacos ($4 each) and they were absolute perfection. 

Each taco came loaded with toppings including corn, cabbage, shredded crab meat, chopped tomato/onion/coriander salsa, avocado & lettuce -- not to forget the two tempura shrimps on each taco! Topped with a drizzle of mayo and you've got a great lunch option. 

Will definitely be back to try other items!"}
{"text":"The burritos were really flavorful and big enough for two people. not bad for something under $20"}
{"text":"As a regular at Corner by Spoon & Fork, this place has all the same sushi offerings, with the addition of tacos.  Great taste.  Only downside is no free water.  Had to buy bottled water."}
{"text":"Nice, clean and accommodating. The reason for 4 star is that they should give more protein if they are charging 13 bucks for poke bowl"}
{"text":"I appreciated the unique items like sushi tacos and nachos. Coworkers got burritos and they were large with lots of fish. I ordered large salmon nachos and a spicy salmon taco. They both tasted great and the nachos were especially excellent for the price paid. It had a ton of different flavours that were enjoyable together."}
{"text":"All other poké places are dead to me. The food is fresh, the range of toppings is on point, and the large bowls are big enough to share. Other poke places falter on the sauce-to-stuff ratio, but these guys nail it every time. 

For those interested, I get the tuna bowl and would recommend it to anyone ;)"}
{"text":"Clear best poke bowl and sushi burrito in Toronto, and great sized portions. Comparable in quality to what I've had in California. Also has original concoctions that don't just follow the standard template, with kimchi, unagi or smoked duck."}
{"text":"What a fantastic surprise. The restaurant is in a restaurant strip mall. I walked up and it almost looked closed but luckily that was not the case. Very cool interior and some interesting fusion oldie standard music playing. 

You can either order off the menu or create your own sushi burrito which is essentially a large sushi roll. I made up my own based on what type of sushi I like and the sides I enjoy and it worked out great. I had passed by this place a month or so ago and sought it out and I was glad I did. I will be back when in the area."}
{"text":"I got a coupon for 5 dollars off so decided to give this place a try. I was not disappointed

I had the salmon poke and my husband had the sushi burrito 

Dressing and topping: there were 16 of them to choose from. I had the Yuzu sauce and it tasted amazing. Their toppings include tempura bits ( which is key), fried onion, sesame seed, ginger , tobiko and more in which I love 

Rice: on par with poke guys, slightly chewy just he way I like it

Protein: I had the salmon which is normal, but they also have beef/chicken/ lobster / duck etc which is good for people who don't eat raw food 

Packaging: I love the packaging for the sushi burrito. It comes in this box hat opens in half. It is cute and neat, makes the whole experience so much better, since sushi burrito can be messy to eat

Will definitely come back to try other toppings and proteins!!"}
{"text":"The manager of the store invited me to return to this location for a meal.  Revisited the store, and ordered the same meal I intended to have - which was his recommended item - salmon poke bowl.

I had it as a salad - it tasted absolutely delicious. A good cut from the December feasting. 

Although the bowl was big, with lots of variety of vegetable.It took me 2 sitting to finish it, but I felt great afterward. Doesn't provide you with that feeling that you just pigged out (although it took forever to eat it).  Be light on the sauce as I did - it's still super flavourful, without the calories.

I would absolutely order the same menu item again."}
{"text":"This place is owned by the same people as those who own Spoon by Corner and Fork, and therefore, many of the poke bowls and burritos are the same. Again, I am slightly irritated by the name The Rising Sun, for reasons I have mentioned before (the connotation and relationship with imperial Japan during WWII). I strongly urge the owners to change the title and name, as this is still a very sensitive topic.

I ordered a customized poke bowl this time, and my friend got a personalized burrito too. Compared to the standard items on the menu, the custom made items cost at least a $1 more. 

I got a salmon poke bowl with half base, kale, arugula, lychee, pickled cucumber (I was hoping for the Vietnamese type, but they ended up being the actual Japanese pickled type), shredded crab meat (LOL naive me was expecting real meat, and was therefore quite disappointed to find that it was the imitation stuff), and seaweed salad. For toppings, I got ginger (tasted slightly funny), tobiko (my complaint is that the portion was too small), green onion, and sesame seeds. For dressing, I got sesame vinaigrette and wasabi cucumber on the side. The vinaigrette was great!

The poke bowl was a decent size, but I found their salmon to be not too fresh. The flavour was quite fishy, and I had to mask it with soy sauce and wasabi. Their packaged wasabi was very spicy and flavourful!

My friend got the salmon burrito, with lettuce and spring mix, edamame, mango, shredded crab meat, and avocado (I wanted avocado, but it cost a $1 extra for poke bowls). For dressing, she got spicy mayo and teriyaki sauce, with fried onions, tempura bits, tobiko, etc. She loved the burrito, but mentioned that she wouldn't get the fried onion next time as the taste was quite overbearing.

A good and filling meal, and can be made quite healthy if you make the right choices!"}
{"text":"I've tried both tacos and sushi burritos here, but my husband always gets poke.  He would give it a 5 star, but for me just 4.  I found the tacos to be expensive and lacking in amount of filling for the cost.  I was also surprised when a sushi taco had no rice in it... I just assumed.

Love all the options with mix and match toppings.  It makes it so easy to order when there is a form to fill out instead of having to stand there and decide and them punch it in.  Hand in your paper and pay."}
{"text":"I built my own salmon bowl which in my opinion should be called love in a bowl! All of their ingredients are fresh including the salmon. Small restaurant however definitely a gem. I've been back 3 times and each time, very satisfied. The sesame vinaigrette and wasabi Mayo.... delish!! The restaurant is clean and the staff is friendly."}
{"text":"Mi'hito is a yelp hit and an Instagram must so of course I had to check it out. 

I brought my cousin from Chitown here and she ordered the the Flaming Dragon sushi burrito and I ordered a the lobster and beef taco. She finished her whole meal and loved it. It's a pretty good serving size so you'll be full for a solid day or 2 (or a couple of hours).

My beef taco was juicy and yummy! The lobster taco has a sweet chilli orange sauce which LITERALLY tastes like summer! I've never tasted a sauce like that so I was all for it! The lobster was juicy and they gave a lot of it. 

The interior is really cute and the employees are friendly so that's always a plus  overall I'd return for the tacos but if I want a poke bowl I'll go to a toronto poke bowl location because their prices are better and variety is greater (zucchini noodle base)."}
{"text":"I usually don't like the poke/sushirrito fad, but I really like this place! The ingredients are fresh, the ambience is modern, and the kitchen is clean. Sometimes they have coupons.

The burritos range from 12 to 14 pre-tax. The custom burrito is 13 for the basic proteins like salmon, additional for lobster. The toping options include inari (my fave! they list it as sweet tofu), minced crab, wakame salad, etc.

It is expensive, but the portion is worth it; they really top it off full of ingredients. It's not just a bunch of rice like other places because they got this neat machine that spreads the rice evenly. Oh and I love the orange mexican daruma boxes! Mi'hito is phonetically similar to Mijito (spanish truncation of \"mi hijito,\" my little son) but it's also kinda japanese sounding. ¡Fusión!"}
{"text":"Location/Service
- Located on College with street parking available around the block, way more easier to access via Public Transit
- Decor is bright, welcoming and a little bit of a food court/assembly line 
- Surprisingly lots of seating available, initially I thought it was more of a buy-and-go place
- Staff is nice and friendly and patient (as it took me a while to choose what I want)

Food
- Ordered the Sushi Burrito, Unagi to go (~$15)
- Portion wise was well enough to feed for dinner
- Sushi Burrito is essentially regular sushi rolled up like a burrito. So you have your unagi (eel) mixed in with rice, seaweed and a variety of vegetables
- Everything blended well together. They do supply wasabi/soy sauce, but since I was eating on the go and didn't use it - it was a little dry
- Service wise was quick as well, so it's perfect for busy people

Overall this place is great for busy-people or if you're in the area. Price wise is a little on the higher end, but similar to other poke/burrito places I've seen. They also offer build your own or standard menu items of poke bowls - so feel free to experiment yourself!"}
{"text":"I ordered the Ahi Tuna Poke Bowl and it was delicious! Great ingredients that were fresh and given in generous amounts. Enjoyed the choices for free toppings, especially the tempura bits and tobiko. A little on the expensive side for a lunch bowl but I would get it as a treat every once in a while. The one thing I'd say was a drawback is that they don't pre-marinate their tuna like Poke Guys do."}
{"text":"The best fast food in Toronto!!!! Super savoury, big portions and very filling. No other sushi burrito place compares!"}
{"text":"A new sushi burrito spot in Kensington area (spadina and college) in downtown Toronto. Their main location is in Mississauga. You can choose to create your own sushi burrito or poke bowl. Came here during their opening event and got a free rising sun sushi burrito. The workers there were really nice and the sushi burrito was very delicious and filling. Ate only half in the restaurant and took the rest home. They have a table at the front, a few high tables on the side seating two, and also a long communal table at the back of the restaurant. Would definitely come back to try their other burrito flavours and also their poke bowls!"}
{"text":"This is a most excellent place for poke bowls and sushi burritos. They are not skimpy with the seafood and the ingredients are always fresh. Super busy during lunch times so its better to go early at 11:30 or after 1 pm. Or you can place an order on the phone beforehand and eat in (will save you about 15 minutes on really busy days) or eat out. They also have a little section of pre-made sushi that you can pick up. 

This is my go-to place when I want to eat healthy in the area. You just have to skip the sauce at the end and some of the toppings such as the crunchy tempura bits.

I really hope that they keep their standards up because this place so far is pretty awesome."}
{"text":"Got the lobster burrito today. It was delicious but pretty messy to eat! Will get a poke bowl next time. Very busy with the lunch crowd but the line moves pretty quickly. My friend got the beef and vegetarian tacos. She said they were both delicious but preferred the beef one more. Will definitely be back!

Update: June 13th....got the salmon poke bowl...amazing!! My friend got tacos again, cuz she loves them ;)"}
{"text":"No complaints. Good food and portions, good fish to rice ratio, consistent price, good options, friendly staff, lots of parking, and they serve beer.

I chose the build your own sushi burrito $12.99 and build your own poke bowl $13.99 and there was plenty of ingredients to choose from. They even had lychee!

Came on a Friday night and there were a couple of groups eating there and some people waiting for takeout. It's cafeteria style FYI."}
{"text":"Pretty standard poke bowl I'd say. Went for my own creation. Mexican fusion was interesting I suppose, but nothing that blew me out of the water. Wish they had ponzu sauce as well. Decor was nice, and service was quick (there weren't too many people there)."}
{"text":"Expensive, but delicious. I live in Oakville and my husband and I have regularly made trips out to Brampton to get poke. Why is there no decent poke shops in Oakville yet? 

Both of us like the ahi tuna poke. Comes with edemama, tangerines, carrots, cabbage, crabmeat (the fish kind), and of course ahi tuna. Wish there was more protein, and wish the cuts were larger (like a certain poke place in Toronto), but given the monopoly - it'll do. 

Ingredients are fresh, they are always replenishing. Service is quick. You can dine in (I always grab it to go), it's a long table with maybe 10-15 chairs (?). Don't expect to bring a big party here, but definitely worth the stop in. 

Next time - I'll have to try the sushi burrito!"}
{"text":"I felt like a poke bowl for lunch and didn't want to buy it from Spring Roll.  So I saw this new place open up and decided to give it a try.

What a pleasant surprise!

Portions are really good.  They really pack in all the ingredients in this plastic bowl.  Hope this continues as they get more popular though, some places will start skimping later.

The salmon tasted amazing.  You also get to pick from a long list of toppings including tempura bits and tobiko!  Yes tobiko!

The dressing was also a long list and I'm happy to see spicy mayo and unagi sauce on there.

Fresh, good value, good portion, close to my office too......will definitely come back again!"}
{"text":"This is a pretty good option to grab a light refreshing meal/snack in Yorkville. Located a bit across the main food court area this option is one of the more enticing for this mall or this area even as I have started to explore it more. There are few a pre-configured for the lack of better word. I opted for a make your own bowl. The ordering system is intuitive. You choose the base, you add the layers of condiments, choose a protein if desired and select the dressing. All the ingredients were fresh and the tuna looked and tasted decent. I really enjoyed the pickled items and edamame. Having chosen the salad base I felt light yet filled after my meal. I will be back."}
{"text":"Have only had a chance to go to this location once so far, but I loved it! I go to the Mississauga location often and I found that they were very similar (aside from this somehow ended up being spicier than usual for me.. possibly extra sauce). Love it here and highly recommend, although this location doesn't have much seating options."}
{"text":"I go here every time before I watch a movie in the same plaza and the service is always consistent along with the food quality being amazing every time! Always fresh and tasty. Love it here."}
{"text":"Was looking for something fresh and clean near Kensington Market and Chinatown and found Mi'hito. I went for a mix of maki and my partner took a grilled chicken ahi poké bowl. We weren't very familiar with the sushi burrito concept so we picked more conventional foods - everything was delicious! 

I have to admit though I can't give 5 stars, because as a tourist who knows nothing about the place, I got a bit scammed. We had a miso soup included and I thought it was free with every meal but apparently I was wrong... They counted our order as \"combo\" although I never said that's what I wanted. It's only 1,50$/soup but still, it should be clearer. 

However, the food was truly tasty and it was more than enough. My partner didn't know what extra's to take in his bowl and the chef suggested some ingredients. I hope this wasn't a scam also... lol... looking back now I'm wondering. Anyway... It turned out great and no regrets. Be aware of the menu before ordering"}
{"text":"There's a lot of sushi burrito/poke bowl spots popping up across the city. I would say that Mi'Hito is the best. The flavor, quality of ingredients and speed of service can't be beat. For fast and delicious sushi burritos check out Mi'Hito!"}
{"text":"They have amazing tacos (shrimp tempura), and sushi burritos! Everything is made fresh, the service was great, and the place looked pretty clean. What more can I say, keep up with the good food and good service!"}
{"text":"Excellent poke bowls. Very similar to Poke guys, but they have a different variety of main and side ingredients. I ordered the Lobster poke bowl and it was very filling. They also have shiitake mushroom as a topping, and it was very good.

Quality: 8.5/10. Service: 8/10. Value: 8/10. Overall: 8 out of 10. (Not an average)"}
{"text":"Talk about a delicious sushi burrito! Probably the best tasting one I've had yet. Sure it's messy, but that's part of the experience, right? Also, the packaging is just adorable. Unfortunately the seating is limited, but it's a great option to take home or over to the big food court by the movie theatre. If I lived closer, I would definitely be getting these on the regular. You can even get a custom burrito made! (Not that you need to, the salmon burrito and kimchi beef burrito are both excellent as is.)"}
{"text":"I wasn't a fan. I was so excited to go and had heard highly of this place but honestly I really didn't like it. both me and my bf got the bowl but it wasn't good,  deff wasn't for me"}
{"text":"Unreal. I came to Mi'hito with average expectations and suffice it to say they were beyond surpassed. The menu is inventive and extensive (burritos, tacos, nachos, and poke bowls that can be made with rice or greens bases - so much to choose from and the 'customize' option leaves room to satisfy vegetarians/those with restricted diets). Fusion can be a hit or miss, but make no mistake - Mi'hito hits the spot!

While there were a few areas for improvement (the poke bowls are enormous and a bit pricey, ranging from $10.99-13.99, which I think could be bettered by offering a snack/small size akin to North Poke's approach; the high tables make for a bit of a tight fit if you have bags, etc.), I can't complain about the food - it was sublime. I had the spicy salmon taco ($4.50), which infuses a classic sushi e?ssence (tempura bits, spicy mayo sauce) with generous heaps of salmon and a fair portion of lettuce on a white tortilla. My companion opted for the tempura shrimp taco ($4), which was a heavenly blend of fresh, piping hot tempura and chilled salsa, avocado and other fresh green ingredients. One each was fine for us as we weren't famished but if you are, do order at least two! But be warned, you may soon become addicted to the crispy perfection that is either taco. I emphasize again that they don't hold back on the protein - I could barely close my taco to eat it and I saw someone behind me working on theirs with chopsticks, having faced the same conundrum. I also observed one of the employees stuffing the burritos with TONS of tuna, which is great because these monster sushi rolls also command $10-14 apiece. I have my eye on the poke bowl next, but I'll revel in memories of these delectable tacos until then!"}
{"text":"This is probably the best sushi burrito place I've been to so far. I feel like they really know what they're doing in terms of taste and proportion. If your sushi burrito is so packed that it explodes when you peel the wrapper off, they ain't doing it right. This has NEVER EVER happened at Mi'hito. Everything is always perfectly proportioned and I really appreciate that. My go-to is definitely the Rising Sun Burrito. It's SO flavourful and I like how I can taste everything in one bite. Will definitely be returning to try the tacos :)"}
{"text":"love coming here after school as a treat for myself... the amount of fish you receive in a sushi burrito + the price is awesome. the flavour combos are great and delicious and i am so satisfied after finishing a burrito. great lunch/dinner option if you're craving sushi."}
{"text":"I must say, I'm so happy to finally have a place like this close to Brampton!! Maybe there is, but I haven't found it since this spot!  Saw a posting on Instagram from yelpGTA and I knew I had to try!

The ingredients they use taste so fresh! I'm kind of regretting not getting another sushi burrito cuz I want more! *Lol*. I got the 'rising sun' sushi burrito and it's sooo good.  Next I want to try their poke bowls and tacos.

The place is a nice, clean and modern look.  Definitely a great spot to grab something fresh and yummy to eat or to sit and eat there.  

Staff were very friendly from my minimal interaction when placing my order and waiting on my food.   I'm definitely coming back and recommending to others!"}
{"text":"Delicious and refreshing poke bowls.  This establishment also offers the ever so popular sushi burrito, sushi tacos, and more.  I ordered the Ahi Tuna bowl which comes with generous toppings of mandarin orange, surimi, spinach, shredded carrots, edamame and a heaping amount of seasoned tuna.  The bowls also come with free toppings with your choice of tempura bits, pickled ginger, pickled jalapeño, green onions, masago, REAL BACON bits, and nori.   You'll be surprised by the extensive list of sauces available to really customize and make your bowl truly unique.   I got the spicy mayo and sesame vinaigrette added to my bowl.  I needed a bit of creaminess and tangy vinaigrette to balance out the flavours in my poke bowl.  
Seating is very limited, so it's best if you order takeout.  I'll return to make use of my $5 off $10 purchase coupon!"}
{"text":"3.5 stars

I got the poke salmon bowl. Everything was really good, just find this place to be really overpriced for what you're getting"}
{"text":"Mi'hito is a casual restaurant, perfect for dine in our out. I ordered the Rising Sun Sushi Burrito, which had mainly salmon, avocado, tempura bits, tobiko, crab meat, and a few other ingredients, topped with a spicy mayo dressing. Everything was fresh, but I wasn't blown away by the taste. I certainly had better sushi burritos before. Maybe I came with high expectations. I think it's still worth a try if you are craving sushi burritos or poke bowls."}
{"text":"This made my day. Fresh and delicious. Must try.

I came the next day as well with a 5$ coupon they gave and tried Rising Sun again. I would have been happier to have more Salmon, in my Borito but with the price you pay,  it is fairly decent.

Very spacious, nice environment, nice staff, and awesome options."}
{"text":"Sushi burrito  solid spot, offering poke bowls, sushi tacos, and sushi burritos. I got the sushi burrito and a half-poke bowl. 
Prices are extremely decent. If you're looking for quantity and fair quality, Mi'hito is where it's at. extra stars for the sushi burrito presentation! I got the store favorite and crowd pleaser: The Rising Sun with fresh salmon. I was pleased with the filling to rice ration in the sushi burrito. I was worried that there would be inordinate amounts of rice. Good portion of fish in there, also had lettuce, shredded cabbage and carrots, avocado, spicy mayo, tobiko...i might be missing some ingredients, but it was good! I got spicy mayo and unagi on the side and mixed it together to make a little dipping sauce, but the burrito is fine without it. I'm just a lil extra with my flavors 
The half-poke bowl i got (salmon) was okay, i wasn't too impressed. Would definitely get a burrito if i came back. Big enough to split between you and a friend. 
Staff are friendly, place is clean, presentation is fun, food is good! What's not to like?"}
{"text":"Mi'hito Sushi Laboratory is a fast casual restaurant that offers everything fusion sushi creations.  This included everything from the trendy sushi burritos to poke bowls but also sushi tacos and sushi nachos.  They really took it up a notch to differentiate against their competitors by including tacos and nacho version of sushi too. 

I really liked the design of their logo/mascot and how they incorporated it into the paper packaging of their sushi burrito.  Instead of wrapping it in foil and paper, their sushi burrito was put into a cardboard wrapper where you ripped apart the paper to expose it.

I really enjoyed my Lobster Roll!  I liked how it had arugula in it and that there wasn't too much rice.  (I spotted how they made their sushi burritos on the counter -- they use a machine to mechanically flatten out the rice on a piece of seaweed; it's not done by hand which explains why it looked so perfectly made.)  I liked the combination of ingredients in the Lobster Roll too.  However, I do have to say that the \"lobster meat\" was more crab meat and salad than actual lobster meat...  it still tasted good but I don't think this was a true Lobster Roll sushi burrito."}
{"text":"I will admit that I first thought sushi burritos were a gimmick.  I still believe that, but I do see the benefits of eating them vs. the maki rolls many are accustomed to consuming.  These babies are easy to carry around in their cute card-stock containers and they take away the hassle of carrying around chopsticks and constantly dipping each individual piece of maki into soy sauce/wasabi (for the burrito, it's sufficient enough to just pour the sauce on at the beginning before eating).  

I tried other sushi burrito restaurants and this one is my favourite. It serves both burritos and poke bowls, but I firmly believe that the burritos are better here. From what my friends tell me, the poke bowls have smaller-sized pieces of protein compared to other restaurants.  The burritos here are also slightly smaller than those at Rolltation.  However, in terms of freshness, price, and flavour, Mi'hito beats Rolltation by a long shot.  The items are generally 1-2 dollars cheaper than their counterparts at Rolltation and the Rising Sun burrito (at Mi'hito) had SMOKED salmon pieces rather than the sashimi kind, so it had an extra zing to it. 

I would not go as far to say that this is the healthiest lunch item out there, but it is definitely a better choice compared to other choices in the area.  It, at least, has the carbs, vegetables, and protein you need in a meal."}
{"text":"The sushi TACOS were my favourite. I'm very picky about poke bowls because I've had them everywhere and am more often than not, disappointed, so I got the tacos. They are not skimpy with the seafood and everything tastes fresh. They mixed up my order twice though so that's why they lack a star; especially since I wasn't the only one in the queue that they did this to. Nonetheless, I would definitely go back for the tacos. The shrimp tempura taco, unagi taco and the spicy salmon were my favourite. This place is especially good for to-go orders."}
{"text":"Finally got to try my first poke bowl and it was so worth the price! $13.99 for a custom bowl or less if you want the premade bowls on their menu. I got the ahi tuna with spinach, cabbage, edaname, pickled cucumber, shitake mushrooms and half mango mayo and sesame dressing. So delicious and filling! Pick whatever dressing you want on your bowl or do half and half.

My fiancé got the kimchi beef bowl which was also very good, it came with lychee! The beef was perfectly cooked and tasty!

They also have other great menu options such as their taco sushis or sushi burrito was has become the trend nowadays. You can also customize these as well. 

There's plenty of seating and the ambiance is perfect for a quick in and out meal. Service is friendly and they explain to you how to customize your meal. I definitely want to come back here and try their lobster tacos."}
{"text":"Grilled chicken poke bowl, $13.55 

It's a bit pricey but it was really good. It's also a good portion if your not too hungry. Workers were friendly and the atmosphere was good (for a lone eater). Overall, I would come back."}
{"text":"Feeling blessed and lucky that i found this place away from my country but taste authentic"}
{"text":"I was super excited when I found out this location does half sizes for their poke bowls because I'm the kind of person who can never finish regular portions, especially during lunch. For only $7.99, I got the salmon poke bowl with half brown rice and half salad and it was more than enough to fill my stomach for lunch. I found that their half bowl is still a considerable amount of food and it was pretty much the same size as regular sized poke bowls at other places that cost nearly twice as much. 

In terms of taste, it was one of the most delicious poke bowls I've ever had. The proportions of all the toppings were perfect, and the preset toppings in the salmon poke bowl paired together really well. This will definitely be a go-to spot for a cheap, yet filling meal!"}
{"text":"Really good sushi burritos. Would give a 5 Star if they took off that stupid jazz music that they played."}
{"text":"First time having a sushi burrito. I wanted to like it but it felt like a large California roll that's overpriced. For that price I coud just go to an ayce sushi place. I guess it's okay to try once but I would not go back for it."}
{"text":"What can I say other than this place is awesome.  Was in Toronto for work and this place popped up right next to my hotel.  You can select from sushi burrito to sushi bowls to just plain sushi!  There are so many options it's hard to choose just one.  Definitely would return in the future!"}
{"text":"Wow, this place is seriously magnificent. This better not be a pop-up shop, because I plan on coming here every time I'm downtown for a LONG time!

The sushi tacos are amazing. I love the spicy salmon and spicy tuna tacos. The tuna, especially, is superbly fresh. They add a nice big avocado slice, some chipotle mayo, corn, lettuce, and the best, crunchiest panko/tempura bits I've ever had. I prefer it without salsa as the chipotle mayo is ample--they're happy to accommodate changes.

Service is good, you order at the counter then pick up your order down the line; it's extremely fast--sushi tacos are generally ready in just a couple of minutes. Takeout is possible, ample seating for dine-in, and you can devour these quickly. It's a little pricey for the smaller portions/less-filling nature of the food, but two or three sushi tacos makes for a perfect lunch. Probably wouldn't come here for dinner, you'd need to order a lot to be full, and that would start to add up price-wise. One nice side effect of this is you can actually eat the tacos cleanly, toppings don't explode out every seam of them.

I had the rising sun sushi burrito and unfortunately I thought it tasted awful. Really not sure what happened there. Oh well, the tacos are out of this world and there's no accounting for taste, other people seem to like the burritos."}
{"text":"Terrible food quality and customer service compared to the College St. location.

There's barely any seating here and NO WASHROOMS! Unbelieveable--I've never been to a restaurant anywhere in the world without washrooms! They don't even have the decency to offer hand sanitizer. If you've been driving, cycling, or taking transit, or if you've done ANYTHING since washing your hands, I guess you're not welcome to eat here? To be fair, come to think of it this might be the same at the College location as I don't recall seeing a bathroom there, but it's unacceptable and highly unsanitary at any rate.

I've been here a couple of times and each time there was only one employee. One of the two times I was the only customer and it took almost 10 minutes for the employee to make 3 sushi tacos for me--this takes about 2 minutes at the College location. The tacos themselves were horribly stale and burnt, they were inedible and I had to eat the toppings with a fork and throw the tacos in the garbage. I've been to the College one a dozen times and have never had the food be anything short of stellar--here it's really not good.

Really disappointed that the Mi'hito brand has turned out to be so spotty and lacking in quality control--guess you can only trust the College location."}
{"text":"Language barrier staff (limited English) which presented a challenge when ordering food."}
{"text":"I'm glad there's a yummy trendy sushi place in sauga now! I ordered the lobster and eel burritos and found that the eel burrito was too saucy/salty, so make sure you ask for less sauce next time! Like every burrito, the sauce leaks through the bottom so eat with caution!"}
{"text":"My first intentions was to go to Subway to grab a quick bite before I went to my corporate meeting but then I saw Mi Hito beside so I decided to try there instead! I'm still wondering if the owners are the same owners as Corners on Dundas because they have the exact same orange sushi burrito containers. 

Upon arriving the layout is very nice and open, a large table to share among others and other more private tables for your group. I assumed it worked the same way as Corners and stood there staring at them for a good few minutes until they told me I had to fill my order on paper. I felt very rushed because I had to read through the whole process and ingredients and a line started to form behind me so I just checked off random stuff. I got a custom sushi burrito with salmon, spinach, seaweed salad, avocados, kimchi, spicy mayo, and what I got in the spur of anxiety... mandarin oranges. 

When they created my burrito, I then realized they had artificial crab sticks which I usually get and I was kinda sad that I looked over it because I was panicking since I didn't want people to wait too long. Oh well. 

Good thing though is that they give you a good amount of protein (which I had made a comment about on my Corner's review that they gave very little). I was honestly surprised they were able to close my burrito because they put a good 3 handfuls of spinach in it as well. 

The sushi burrito if I'm not mistaken was about $13? My friend paid so I'm not 100% sure  

But there's not much to say because it tasted great due to my great choices and I quite liked the oranges in my burrito. 

Would definitely return if I'm ever in the area or if I want to sneak something into the movies!"}
{"text":"I've been here many times and always get the tempura taco. Delicious, you see them fry the tempura in front of you and o love the bits of fruit at the bottom it makes it soo good.  Very affordable and filling."}
{"text":"Best sushi burrito in the city! Top quality ingredients and most importantly, they actually put a lot into their burritos. The price isn't the cheapest, but you get what you pay for and for the quantity of food it's similar pricing to regular sushi restaurants. The staff are nice, and the location is obvious very clean!"}
{"text":"Soo delicious! Can this just be my every day meal? So fresh, so great tasting, so filling and affordable. A must check out place if you're in the area."}
{"text":"I was recommended by a friend to Mi'Hito back when they opened and were giving out free sushi burritos. Since then I've been back 3-4 times, so needless to say, I quite enjoy their food! 

I have only tried their Rising Sun burrito so far. When they ask you \"salmon, crab or smoked salmon?\" be aware that they're referring to the filling and not the added ingredients. I was confused once and received a full crab burrito because by default the menu states there is salmon in it. Apart from this, the burrito is really delicious. It has a combination of typical sushi ingredients and fresh vegetables which adds a nice crunch. Since the sushi burrito craze took off last summer, I've tried various ones from food trucks and they definitely do not compare. I love how the seaweed wrap is fresh and can be easily bitten- it has never been soggy (which can drag the burrito apart when you eat it! The worst!) Another important note is that they really load on the ingredients (the salmon most importantly!) which I appreciate. The salmon filling is big chunks and not a mishmash of filling with meat like other sushi burrito shops. 

Overall the place is great! There is a lot of seating available and quite a variety of Asian drinks to choose from. The servers are super friendly as well. 

My only note is that the downstairs washroom doesn't have a lock on it, but can't say this would keep me from coming back! :P"}
{"text":"Place is delicious! So glad Mississauga has an option like  this. It's not easy to find healthy, modern places to eat around here for some reason. Everything is super fresh and you can customize whatever you want.  I made my own burrito and loved it!"}
{"text":"Finally, a Burrito(?) joint after my own heart!

Originally saw this restaurant pop up on the insauga website, saying it had taken over Prince Sushi (which really was a shame, they had the best kitchen items around town.).  As it seems however, they're run by the same company (Spoon and Fork) so it would appear they knew what they were doing. 

Entered to see a very rustic restaurant, with a very simple layout.  Shared tables, open concept, very relaxed atmosphere.  Very different from it's former occupant. 

Ordered a standard Rising Sun, with shrimp and lobster tacos for the side (I had someone with me, stop judging.) Food arrived as timely as you'd expect some sushi rolls to be made.

Food was pretty good!  The whole Burrito concept fell through, in that about 2 bites in, you realize this is simply an oversized sushi roll. Not that I'm complaining;  there was a good salmon/crab to vegetable ratio, and they all meshed well as you would expect for sushi.  

One thing I was surprised in was the texture: it was crunchy.  This property is usually only associated with hand rolls that are freshly made, so it was a good thing.  They were able to replicate it by adding a handful of shredded cabbage in the roll;  an ingredient I wouldn't otherwise think belongs in a sushi roll provided a new experience without sacrificing flavour.

One thing I wasn't too pleased with was the Lobster taco.  Almost definite that this was imitation lobster (similar to imitation crab found at your local asian market), with the price premium as if authentic.  Wouldn't really blame them though, not sure why I was expecting fresh 

Luckily, the Shrimp Taco was delicious, and offset the lobster.  I'll be giving the duck a try next time I come back!

All in all, a definitely cool twist on sushi.  For the price of a deluxe sushi roll, you're getting a mega sushi roll (I like how that sounds considering that's what it is - and not a burrito). Will be back to give the other menu items a try.  

With all this cultural mingling, perhaps I'll go ahead and take a siesta after such a meal."}
{"text":"As someone who works in a lab and loves Sushi, I felt right at home at Mi'hito! They're 'cooking' up something fantastic here and really enjoyed their food here.  

While I know that their poke bowls are a far cry from authentic poke (the fish in poke is supposed to be marinated and seasoned), I still very much enjoyed them. They were extremely well balanced in terms of flavors and textures; there's some great chemistry with the ingredients here and to have that in a (mostly) premade poke bowl is great thing. What I really liked about Mi'ihto is the ability to customize the bowl at the end. You can choose among various toppings such as tobiko, nori, tempura bits, fried onion, and more and your choice of many different sauce. Oh, and you can choose from choice of just rice, salad or half & half. The possibilities are endless! That does mean your chance of a 'bad experiment' increases, but that's the whole premise of doing experiments in a lab (Smart decision calling yourself a Sushi Lab, Mi'hito).

I had the salmon bowl with spicy mayo and the tuna with the sweeter unagi sauce variant for contrast, both which I highly recommend. The salmon bowl provides more sweetness if that's what you're looking for in the mango, corn, and seaweed salad. The crab salad, carrots, and the edamame of the tuna bowl provided a different flair that simply works better with tuna. Their ingredients are good and somewhat fresh here; nothing was out of the ordinary in terms of quality.  

Their portion sizes are good and don't hesitate to ask for a glass of water. I can't wait to come back and try something new here!"}
{"text":"Found this little gem on Yelp :)

Visited after work with one of my friends and we enjoyed the experience. Their fusion menu offers poke bowls, sushi burritos, sushi tacos and ready made sushi.

I opted for the Rising Sun sushi burrito which consisted of salmon, lettuce, cabbage, avocado, tempura bits, tobiko, carrot, carb meat, green onions, spicy mayo dressing. Overall, the burrito was tasty. The ingredients tasted fresh and were prepared with care. Next time I would request no fish eggs (just my personal preference) and less spicy mayo (it was a little over-sauced for my liking).

Be warned, the burrito gets pretty messy as you eat it so perhaps might not be the best menu pick for a first date :P

Will return again soon to try a poke bowl!

Tip : this place is a bit hard to find. My friend and I circled around a few times totally confused lol. Just park and walk towards Twin Fish Thai, Mi'hito is right across the way :)"}
{"text":"My cousin and I were looking for a new place to try and we are glad we chose Mi'hito! The ambiance is nice and modern, so it's a great place to grab a bite with friends.

Food: I ordered the flaming dragon sushi burrito and it tasted like everything I enjoy in a sushi roll. It is a bit messy to eat but it's worth the flavors. My cousin ordered the beef and lobster tacos. I tried the beef and the meat was cooked to perfection and it tastes like your classic bulgogi. She said she loved the lobster as well! 

Overall, nothing out of the ordinary but if you do like sushi, this place is an excellent choice."}
{"text":"I love sushi and I love burritos. So this was a no brainer. 

Unagi rolls are my favorite and their unagi burrito was beyond anything I've ever had.

This may be my new favorite sushi place.

word of warning: when I went to google map it, gmaps gave directions to prince sushi and said it was permanently closed. That's the restaurant that was there before Mi-hito took over. So don't worry about that!"}
{"text":"This place just opened and it looks like i may the first review.  Had an awesome salmon poke bowl. The workers were super nice and graciously explained the whole menu to me.  The fish was fresh and I loved my bowl. I'll be back!"}
{"text":"Been on a poke kick recently and I was glad to come across one in Mississauga!

Chose to make my own bowl but they do have several preset options available in both the burrito and poke bowl. They only had one size for the bowl and it was neither too big or too small - in fact, it was pretty filling. The topping options were pretty standard of any other poke places, but they did have a few interesting sounding sauces on the menu. Went with the spicy mayo choice this time, but would probably give those other choices a try the next time I come back!"}
{"text":"This did not disappoint and I will definitely be back again! I was recommended by a friend to check out Mi'Hito.
So on a Cold and windy day, we decided to get take out and check out the new place. Let me just say I have tried Corner by Spoon and Fork and hands down, I like this place 10x more. It is modern and hipster and just reminds me of what you would find downtown. There are a few things to choose from, sushi burrito, sushi taco, poke bowls and just simply premade sushi for grab'n'go. You can also get miso soup and Japanese drinks. 
What I liked about Mi'Hito was that it is more focused/themed than Corner. I felt like the sushi burrito I got was bigger than their other store. I also liked how they had the forms to fill out for the sushi burritos and poke bowls. 
For my order, I built my own burrito and so did my fiancée. I also ordered a unagi taco from their menu. I loved the unagi but this was a bit too saucy for my liking. Next time I would ask for less sauce and no coriander but the fish itself was delicious and good portion size. I also saw poke bowls being made and those portion sizes looked quite big and yummy as well. One more thing to add is that the location is very convenient since it is at Courtney Park and right beside Demetres.
Definitely a thumbs up and can't wait to be back!"}
{"text":"Was curious to try this place out as I frequented the former Prince Sushi often.  Tried the lobster and spicy salmon tacos, custom poke bowl and the Rising Sun burrito. The food is definitely fresh, the time from making it to receiving it was within 10 mins and that's with having 6 people in line ahead of us. Of the tacos, the salmon was the better. The burrito was good, good rice to filling ratio, and the poke bowl was good too. 
Very casual place with cafeteria/fast food style service and atmosphere. It's something different and a better lunch than dinner spot I'd say"}
{"text":"A friend told me about this place, and said it's a fusion of mexican and japanese. So I said sure, why not? I was also craving some sashimi on rice. 

The inside of the place is nicely lit, maybe way too many fluorescent lights?

Decided to build my own salmon poké bowl with kale, cabbage, shredded imitation crab, shiitake mushrooms, seaweed salad, sweet tofu, topped with tobiko and a \"wasabi\" cucumber dressing. Clearly I put the wrong ingredients in it, because it was too sweet! Had no idea their shiitake mushroom was sweet, and the dressing had no hint of wasabi in it! Was a bit disappointed by that, because I was expecting a hit of wasabi to my nose, but got none. Not to mention they definitely drowned the whole thing in sauce. Definitely feel like they should have a salty soy sauce based dressing to balance out the sweetness from their ingredients.

I do plan on coming back though, so expect this review to be updated!"}
{"text":"Whenever I'm in the area, I always consider stopping by Mi'hito for a sushi burrito. Of all the places I've tried, I must say this Mi'hito makes it the best for my taste. Very fresh and tasty, lots of delicious toppings, and fast and friendly service.

You get a nice box to house your burrito so it stays intact while you transport it so it's great for those who study in the area.

Try the sweet tofu in your burrito. You won't regret it!

They also have a location in Mississauga, which is where I first discovered them. It's great they have this location near Ryerson as well."}
{"text":"I was waking by and tried the sushi burrito. It was huge. The Salmon taste average and it's like AYCE quality. However it's pretty pricy. I mean 13 dollars without a soup or drink. It's over price. Therefore, if you don't mind the price, it's ok."}
{"text":"Not too bad - great to grab a quick meal from. On the shadow I went, there was half off poke wraps and poke bowls so I couldn't complain.

The service is pretty quick - there was also no lineup. I got the Korean beef poke bowl and not only was to filling, but also filled of flavour.

My friend's got the salmon bowl (really cool) and two burrito sushis which is worth it if you like that kind of stuff.

With all their sushi bowls, there's also a piece of fruit in it which I found very interesting. In my beef bowl I had some lychee!

Overall, I found the place to be nice, quick for a meal. It can improve on being more friendly to its customers - offering them water instead of leaving them out to dry.


Overall there are many other hurricane agencies out there that will willing to well for less!!

Good luck and may all the best be with you in this season!!"}
{"text":"I was impressed with Mi'hito Sushi Laboratory. They offer a wide variety of sushi, bowls, tacos and burritos. You can make your own combo or choose from their list of pre-selected options. We picked from the pre-selected option, and it was delicious. 

They make the food in front of you, everything is fresh including the sashimi. The burrito is basically like eating a giant sushi cone! I was full after eating the first half. You could definitely split one burrito between two people, depending on how hungry you are or if it's snack!!

The decor is nice for a \"fast food\" restaurant. The cost of 2 sushi burritos and one bottle of pop was $30. I had a pleasant dining experience with FRESH food, and for this reason I would recommend. 

I hope they continue to use fresh ingredients...if that changes, it would be an average place to get sushi."}
{"text":"We came here for Friday night date night before watching a movie at Cineplex. 

Food: I ordered one salmon taco and one tuna taco. They were both decently sized and delicious. They didn't skimp out on the fish. I was full but not too stuffed. My husband ordered a poke bowl. He said his was good too but you get better value for the tacos. 

Service: The cashier was friendly and explained that for the build your own poke bowl you have to fill out a form prior to ordering. 

Overall experience: Great! We managed to find two seats together so that really helped. I can see it being crowded and that being an issue when bigger families come. We thought my tacos were a great value!! Filling for a good price. 

Cost: $4.50 each for salmon and tuna taco. $13.99 for poke bowl."}
{"text":"Came here for the free signature sushi burrito.  It was good, but given that it was free, I wasn't able to customize it as I'd have liked.  No crab or sauce.  

Aside from that the salmon was fresh and they put alot of crunch.  If you like spicy, they put a ton of spicy mayo on it if this is the one you're ordering.

Would like to come back here again to try a pokebowl, they also have salmon tacos which is kinda nice.  Its about $7 and the portion is the size of a small take out container.  Not bad but you don't get that much fish from what I saw."}
{"text":"Keeping it short and simple. Need some food after the gym.searched on yelp.This place popped up.had overall good reviews.drove all the way from Dixon and Kipling. To check this place out. No problems finding it thanks to someof the reviews posted.Got a custom burrito.with smoked salmon.And iam done. Thank you guys for ruining my workout today not only was the burrito that damn good i got a poke bowl to go."}
{"text":"Simply delicious poke with excellent service! The interior is also very clean and chic."}
{"text":"They had a special where they offered 50% off so decided to come by and check it out. Place is small, and there is not much seating. I ordered the salmon poke bowl. The put a lot of ingredients in it and has a bigger portion than Poke Wrap close by, I visited just the day before. The poke bowl was yummy. Definitely recommend it."}
{"text":"Recently opened, Mi'Hito has been the talk of the office! Decor is simple and elegant but the service is exceptional. Friendly staff are there to greet you, ask if it is your first visit, and make recommendations as to what is good from each category. They are diligent in asking if it is to go (busy business area) or to dine in. There are a few tables and bar stools for you to hang out and enjoy the food but the food also comes in an easy to-go container for your convenience. The staff check on you throughout to ensure you enjoyed your meal without being overbearing. They want to ensure you are full and happy with what you got. 

Price wise - perfect. While other similar shops offer sushi tacos, burritos and bowls at a similar price, Mi'hito offered a bang for your buck for the amount of ingredients they put in! The tacos I had (lobster, spicy salmon, and unagi) were delicious and the bowls and burritos my friends had were also given high praise. Hope you guys come check it out and enjoy too!"}
{"text":"Came by today for lunch. Was not disappointed. No official signage up yet. But it's where the old prince sushi was.. Beside Demetres and across from twin fish. The space seems much larger than it was when it used to be prince sushi. High ceilings, decorative grand tiles on the walls, communal seating, very clean.  They specialize in poke bowls, fusion tacos, and sushi burritos. Nice large menu on the walls - easy to read. I got two tacos myself.. But felt like I could of had one more. I got the spicy salmon and the unagi taco. Unagi taco was really flavourful, fresh produce and good sauce. Spicy salmon was more mild on flavours but still good. I'd definitely come back and try the other things on the menu. 4 stars because I would have liked some appies or sides to go with my tacos."}
{"text":"Read about this place from InSauga! I've been enjoying the sushi burrito places downtown and was happy to see one pop up closer to home! 

They have the regular sushi burritos but what caught my attention were the sushi tacos they offered! I grabbed 3 different ones to try (too much food for one meal I couldn't finish them all) they are served on a toasted tortilla with a variety of toppings you usually get in the burritos and poke bowls.

I tried the Spicy Salmon, Unagi and Lobster Tacos! My favourite was the spicy salmon for sure, the little bit of heat I think is needed for my sushi dishes.

Over all, all 3 were very well done! I will for sure be coming back!

The atmosphere and restaurant is very nice and clean and the staff was friendly and took the time to compose each item perfectly!"}
{"text":"Recently opened up at the Yorkville Village mall by one of the downstairs entrance to Whole Foods. Had a huge salmon salad here. I really like how they load it up and allow you to pick all your toppings. The salmon pieces weren't too many, maybe 4 small pieces, but the salad overall was filling. Costed me $14.68 in total."}
{"text":"One of the best Salmon Poke bowls I have had! I have tried many in Toronto as well as California and this one truly was a party in my mouth. 

Some bowls are overloaded with rice and the toppings aren't as flavouful but this one was perfect! It didn't become soggy and I was able to eat half of it 3 hours later...love it!

Looking forward to going back real soon!"}
{"text":"Amazing first poké bowl experience here. This little place is literally a sushi lab - all orders are highly customizable to your preferences. 

I ordered the salmon poké bowl on salad, with green onion and tempura bits. Portions were a good size, and the ingredients tasted fresh. Salmon sashimi is just about my favourite thing, so I happily devoured my meal. 

My boyfriend ordered the flaming dragon sushi burrito. I think their free burrito promo was over, but it still tasted great. However, one of these burritos may not be enough for one person. 

It was pretty empty when we came here around 1pm on Saturday. I do wish it was a little closer to the subway line, but still a place I'd love to visit again."}
{"text":"Yet another restaurant hopping on the poke bowl trend, and I decided to check it out. They had a good selection of choices for bowls and burritos. I particularly liked that they allowed you to add on additional toppings at the end, free of charge. Portion sizes are huge. I couldn't finish mine. Excellent value for money"}
{"text":"First time trying a sushi burrito and I must say it was tasty! We got the Rising Sun burrito and it was big enough for two to share. I liked the cute box it comes in as well as how they cut it in half. Ingredients were fresh and the tempura bites and fried onions gave it a good texture. Will definitely return."}
{"text":"When my friend first suggested that we go here, I was thinking... now why would I pay to eat a sushi burrito when I can go to eat all you can eat and eat a wide variety of things instead. She seemed really into this place and she introduced me to other great places so I thought why not.

She had the poke bowl with salmon I think and I had the sushi burrito with spicy salmon and crispy bits. My burrito was heavy and dense. It came cut in two and it was nicely wrapped for minimal mess while eating, much appreciated.

The taste was amazing, I did not predict that it was taste so good. Fresh too! I was completely full after eating it and, I still think about it whenever I drive by the area. It was that good for me. I definitely have to go again.

You must try it if you have ever thought that a sushi burrito is a dumb idea or why not just eat straight up sushi instead."}
{"text":"I built my own poke bowl, very similar to the salmon one but I subbed out mango for avocado. Overall, the food is good. Salmon tastes good, options taste fresh. I like that there's a 50/50 option. However, I just feel it's just a lot of one flavour. I think that's due to the spicy mayo sauce. For next time I would say if u want the spicy mayo to ask them for only half or on the side. Otherwise a lighter sauce would do you good. They work very hard to keep the place clean and presentable. Their downtime is filled with cleaning and picking up any stray receipts and you can really appreciate their effort. I really do like this place but I have to say North Poke's Ono poke still is the best poke I've had ever. But overall, I would revisit if the craving hit and I wasn't close to North Poke."}
{"text":"Confession: I don't like poke bowls. I know, it's blasphemy. I've tried poke bowls at various places in the GTA and wasn't really a fan. So, what I liked about this place is that they have bowls with proteins beyond the usual smoked salmon, ahi tuna, etc. Their bowl offerings also actually include kimchi beef, veggie, grilled chicken, etc. - so if you're not a fan of \"raw\" fish, you can still come here! Their menu also includes a variety of other options - sushi burritos, sushi tacos, etc. 

Located in that ever-growing Cineplex (formerly AMC) plaza at Hurontario Street and Courtneypark Drive, we visited on a Saturday around lunchtime and found the place relatively busy. Decent amount of seating, and honestly, it looks like a decent, casual place for a variety of groups - friends, family, couples. Very laid-back, clean, sleek yet casually modern ambiance.

We ordered the Kimchi Beef Bowl and was pleasantly surprised. Decent sized portion, a load of beef (they don't skimp on the meat!), the beef itself was flavourful and very soft/tender, with a good amount of veggies/kimchi. Not bad, and I wouldn't mind getting this again.

Our Kimchi Beef Bowl was $11.99. Prices are average, service is cheerful. We'll be back!"}
{"text":"First time trying a Mississauga version poke bowl as I usually get mine from Poke Guys. In general, I find that their portions are smaller (almost significantly) compared to what you get in downtown and actually pricier. The food quality overall was good but I would most certainly get it from downtown unless you're really craving for a poke in the Mississauga local area. 

Atmosphere was more quiet - not usually too much people as people sit in like a takeout style and self-service after you get your food. Not a restaurant style but I guess they went for more \"modern fast food\" type of deal. 

Close and convenient to the movies right after if looking for activities to do or the Demetres within the same plaza. 

A friend of mine also tried the sushi burritos and comparably was good as well to Corner's sushi burrito."}
{"text":"- They put way too much dressing on the poke bowl. It was so much that I couldn't even eat the bottom quarter of it because it was so disgustingly soggy.
- I paid an extra dollar for avocado and they left it out. I didn't even go at a busy time so I don't know how they could make such a basic mistake.
- The amount of fish is so so given the price. The variety of toppings and protein is pretty good. It's alright if you aren't expecting real poke. It's just raw fish with dressing and not that real marinated Hawaiian stuff.

Tl;dr Don't go here. If you are in the area and want poke, walk the five minutes more to North Poke in Kensington market."}
{"text":"Interesting and delicious fusion food!!!
The place has a welcoming ambiance, food is fresh and really good... definitely recommend!!

We had Lobster Taco and Rising Sun Sushi Burrito. Both tastes amazing... fresh, prepared with care and perfection. It's definitely going to be in our shortlist as favourite."}
{"text":"Big quantities AND I'm in charge of what gets what? Sign me up! I always seem to want to change up something in an already designed dish because there's always something I don't like or would much rather prefer. That's why Mi'Hito Sushi Laboratory is perfect. I always get their \"Make Your Own\" bowl/roll option when I go so at least then, I get everything I like and don't like. 

Reasonably priced for their stuff and the proportions you get for it is totally worth it! They measure out each item but even so, I never seem to finish a bowl in one setting. 

I've gone more than one time already, and my picky eater of a brother loves this place as much as I do! Now that a new location opened near my school campus, I'll be eating fish so much I might turn into one!"}
{"text":"Delicious fresh food.  I thought it wouldn't be that amazing but the reviews seemed good.  But it's amazing.  Totally surprised me.  The burrito is like a huge sushi wrap.  Seaweed on the outside with a rice layer and fresh ingredients.  The spicy mayo gives it the perfect flavor.  Rising sun and the dragon burrito were both great.  And their soup was delicious too!  We traveled here from Houston, Texas.  I hope the owner decides to open one there one day because it will be super popular."}
{"text":"Iv heard about Sushi burritos before but never had the marvelous oppertunity to try one before till now. Checking this place out on Yelp first i knew i had to check it out. 

My & best friend both went to try out this amazingness idea of a sushi burrito...is it what it sounds like? & Yes it definately is. We made our own burrito, you get to pick out everything thats on it. Burrito prices averaging to about $12.99 which was what we each payed for our Shrimp Tempura burrito. Theres plenty of space to sit down...good for big groups. It doesnt look like this place gets that busy...but hey thats a plus right?! Even going on a friday night it was wasnt busy. We waited for about 4 mins for our order to be ready and we sat down & my taste buds were blown away. A little messy towards the end but it doesnt matter because it was so tasty. It was definately very filling. I can't wait to be back."}
{"text":"One word... AMAZING!!!
The food was super delicious, fast, and the fish was really FRESH!
The interior is beautiful too, and the staff very friendly.  I'll definitely be back! :)

I docked one star for two minor reasons:
1.  There's not enough seating inside.  Please add more seats (you may have to re-layout the restaurant a bit in order to do this, but there is space!)
2.  The location was hard to find because there's no sign on the front, whereas all the other neighbouring restaurants do."}
{"text":"Saw the reviews on this place and it looked quite promising from what other Yelpers had mentioned plus plenty of photos to show what portion and quality of ingredients they serve. 

I built my own poke bowl where you can select all your personalized toppings on a sheet.  My custom bowl went something like this : 

- White & Brown rice mix
-Spring mix (veggies)
-Salmon (protein) 
-Corn, Avocado, Tomato, Shredded crab meat, and seaweed salad (4 condiments)
-Spicy mayo (Dressing)
-Green onion and Tempura bits (to cap off the toppings) 

The portion of the bowl was quite large and everything tasted very good! Good size with generous slices of salmon.

Interior is pretty nice, its spacious and has plenty of seating and near the back there is TV so you can watch the game if they put it on =) 

Pretty good poke place in downtown nearby Spadina and College."}
{"text":"I like the concept of the sushi burrito! It's fun to eat. It's basically a big sushi roll!  Ingredients taste fresh, it satisfies my craving for sushi roll. The portion is good, if you are craving for sushi , it's not a bad place. But that's it! Nothing much special. I ordered rising sun , I picked tuna instead of salmon."}
{"text":"Tried this mi hito out for lunch  2 days this week. First day kept it very basic and had the maki set sushi ready to go and tried the spicy tuna taco. The sushi was usual prince sushi ( they still own this place) so I figured that was a safe bet and good. But the spicy tuna taco was amazing. Went back for lunch today and tried the beef tacos and also very good. The bowls look good . I'll try that next."}
{"text":"Best sushi burrito in town, definitely way better than rolltation downtown. Better price and way better food. Each burrito tastes very different but the lobster burrito is just to die for. Everything tastes very fresh and the orange sauce is just another reason to come."}
{"text":"Tried this place for the second time.  It was as good as I remembered the first time.  I tweaked my order toppings-still tasted like a California Roll with salmon. 

Two bowls were ordered, one with smoked salmon and the other was regular salmon.  Both tasted good, but mine was better! :D

The last time I came, we felt rushed even though we were not dinning in.  This time, I dinned in and I did not have the same feeling.  We found a quiet little corner and munched away on our Poke Bowls.  

(I'll upload pictures when i get a chance.)

Overall it was a better experience, still have to try their sushi burrito.  Maybe on my next visit.  Anyone want to tag along?

So, if you are looking a quick and healthy alternative to lunch or dinner this place provides that.  It is a laid back and casual atmosphere, great for a solo meal, with friends or a foody date. 

Cheers to good food and great company."}
{"text":"The concept seemed right. Quick serve sushi and burrito.  Sushi is worth the wait - better not to rush.  Bathroom was absolutely disgusting also.   Send one of the 6 people behind the counter to clean."}
{"text":"Amazing new type of sushi. Their innovative sauces are amazing especially the ones with mango and mandarin orange. We made our own sushi burrito with 3 meats and double avocado. 5 star taste. Then we tried lobster sushi taco and tuna sushi taco. Something very different and very tasty. The staff was extremely friendly and customer focused. Decor is really nice and welcoming as well. Definitely going back there...."}
{"text":"Poké! So many variations and additions.

It ranks quite high in my books. Thankfully it is quite close so I am now a regular patron. 

Definitely a fan and highly recommend. Plus can't beat the prices."}
{"text":"Not a bad dig. The atmosphere was a little cold and empty. The staff members weren't exactly the most warm, inviting, or helpful, but they did the job and served well. 

Tried the sushi tacos (salmon and tuna) and there was a good amount of fish and vegetables. I liked the corn, and the use of lettuce apart from other sushi tacos I've had. It gave it a more crisp and fresh texture to everything. 

The tortillas were also of a good texture. I prefer the ones from Corner more in terms of flavour, but that doesn't mean that Mi'hito was bad. I'd want to come back and try other things on their menu to get a good feel for it all. 

Definitely good for a quick lunch break!"}
{"text":"Mi'hito carries all the latest popular fads in sushi, including sushi taco, sushi burrito and poke bowls.

I tried an 'Unagi Dance' sushi burrito and a 'Salmon' poke bowl in the recent 50% off promo they had going on during the first week of classes.  The unagi dance sushi burrito didn't have much flavour. The presentation was nice, and the burrito box was pretty cool. The paper wrap unfortunately got soggy and stuck to the outside of the burrito - is there too much veggies/water in the unagi dance burrito? Or maybe a better paper/wax wrap is needed.

The salmon pokebowl was good, the flavours were all there and it was made well. There wasn't very much fish though and the greens add a lot of air content to the pokebowl. There are a variety of dressings and toppings for you to choose from, the spicy mayo is pretty good.

There were long line-ups, and it was generally quite slow probably because of the promotional price.  There was also a contest to win a bike, but it was not communicated at all that filling in the order slip is an entry to win (also something here about 'No purchase necessary contest entries...'). There is very limited seating.

I liked it at the 50% off price, but I wouldn't pay $13-15 for this on any other day. They take credit cards and Android Pay."}
{"text":"Tip:  The awning signage isn't up, so I almost walked right by.  Spot is located right across from Twin Fish/Shoeless Joe's!  It's a lot bigger than it looks.

Having already tried sushi burrito/poke already at a couple of different places, I decided to try sushi tacos.

First, I prefer corn tortillas over flour, so that automatically made me miss the burrito/rice bowl version!  I got 1 of each Spicy Salmon/Tuna @$4.50ea.  They were slightly pressed/toasted and ok tasting.  However, after 2 I was satisfied, but I could've eaten more.

I'd definitely consider going back, but since the owners are the same as Corner, I'm thinking the sushi burrito/poke bowls will taste the same.  Location is a bit out-of-the-way for me, so I can only see myself going back when I'm in the area next!"}
{"text":"One of the perks of working in the city is definitely the variety of poke joints, and Mi'Hito gives me another option of where to go!

I found out about this place from a friend, and her bowl looked amazing from photos, so I decided to give it a try one friday for a late lunch. Got in around 2:15-2:30 and I'm sure I avoided a busy lunch period. Ordered myself the salmon poke bowl, with extra mango sauce, and I was sold right away. I'm a sucker for mango sauces in my Poke bowls, and Mi'Hito is probably one of the few that offer it. Portions were very generous and from my first experience there was a good rice to veggies and fish ratio!

Haven't tried their sushi burritos or tacos yet however, but I'm sure they're just as good! Will definitely be back."}
{"text":"Came here today for lunch and got a poke bowl. I made my own. I love the concept of  how you write it out and make it for you. It's such a sufficient way of completing the bowls or burritos as quick as possible so you can be in and out quick. It's a bit pricy, you'll expect to pay 16$ but it's a once in a while, let me spoil myself thing. They should put more dressing because at times it was Dry. Still a great spot and would love to come back again. Great service too."}
{"text":"This place is packed during lunch time! They have some very awesome poke bowls. The toppings are diverse and really delicious. The custom bowl for $13 I found too big for a lunch serving though... but they offer lids to take your bowl home. I have tried their cucumber dill sauce, wasabi mayo, and wasabi sesame. Very tasty. I like the cucumber dill for a refreshing taste, and the wasabi for a spicy kick. I have only tried their salmon. Pretty good. They offer tuna too. Something I will try next time. 

I do not recommend adding the pickled ginger on top... Way too sour, tastes like the cheap pickled ginger you get at a bleh sushi restaurant... I don't think they make their ginger in house."}
{"text":"I took advantage of the free rising sun sushi burrito and it did not disappoint. The burrito size is very reasonable and I was pretty full after. The burrito itself is full of flavor and fresh ingredients. Will definitely visit this place again!"}
{"text":"I love this place! Their burrito packaging is so cute, and the size of sushi bowl is very large! Compared to other poke places near them, their food is more fresh and more tasteful."}
{"text":"the spicy tuna and unagi taco were very flavourful plus a lil crunch. Too much dressing in the unagi taco tho but still very good. 

The salmon poke was customized but they do give u a lot of salmon! 

Staffs were very friendly. Got a nice place to sit down and eat."}
{"text":"This place gets extra credit because it is my first time having a sushi burrito. I love the concept and I loved the lobster roll."}
{"text":"F&F: Fresh and flavorful! 

When you come out from the movies and you and your group want to have a snack and chill, something light, try this place! 

I have eaten 3 sushi tacos from here: tempura shrimp, lobster, and chicken. Of the 3 I love the shrimp and lobster! Each bite is full of flavor!  Again I did say snack right? Don't come hungry and expect to be full...unless you order like 10 lol (and if I was crazy I'd actually do it!)

But this place isn't just reserved for sushi taco, you got sushi burrito and poke bowls as well (for sure a different review for those choices).

We have the usual AYCE sushi places around town and that is all and good, but if you want to try something new, different, F&F, I would recommend here =)"}
{"text":"Just stumbled upon this place after going to the gym and it is amazing! They have sushi burritos, poke bowls and sushi tacos! I've never had a sushi burrito or a taco and had to try. I ended up getting a variety of sushi tacos. The prices range from 4-6$ per taco and the selections varies just like a sushi roll: spicy tuna, spicy salmon, beef etc. I had those three, beautifully made, delicious and all great ingredients. They are wrapped in a small white tortilla and made with real ingredients: cilantro, corn, onions and crispy flakes top the main meat ingredient. Check the pics out that I posted. The atmosphere is spacious, great friendly staff and a pleasant place to go to before or even after a movie! Would take a date here too ;) I would come back here and try the burritos and poke bowls...ps the lemonade is delicious...enjoy"}
{"text":"Always a great time dining here. It's a quick service/fast food/healthy option type of place. Service is great. The employees are nice and the sushi burrito which they are known for are always yummy! Will come back again when in the area!"}
{"text":"First time eating sushi burritos ! They were really good. Definitely will be back to try the poke bowls !"}
{"text":"3.5 Stars ... above average for sure but not quite a solid 4 star

The newest fad hitting Toronto is poke bowls, sushi taco, and sushi burritos and Mi'hito fills that niche nicely for GTA West.  I've had a few poke bowls in downtown Toronto and also the big US cities, so I was hoping Mi'Hito would be a hit.  It definitely is a good offering in GTA in terms of fresh ingredients and also execution... the constant complaint all new poke places get is value.  And Mi'hito is not bad but possibly where it can improve.

This new place is tucked in the small side restaurant row in front of the theatres.  It has communal tables and the it's quite a nice open and clean space.  As long as you come before the rush, there is no issue finding a seat.

The ordering is fairly quick and you can customize your poke bowl with a paper checklist.  The prices are right align with downtown Toronto prices so it's not as dirt cheap as a thai lunch special but it it isn't outrageous like a $19 burger.   My custom poke bowl came just under $15.  I ordered green leaves only with salmon.

The assembly was done by one gentleman and though i was there early and didnt have to wait, I noticed when they started to get hit with the lunch crowd, it did cause a bit of a line up.  The was methodical in is plating which made for a nice looking lunch bowl but it also felt like he didnt add as much nicer ingredients as one of the other places I've been to... definitely a small scoop of salmon instead of a medium scoop which I'm more used to.  

So when I started to mix the salad up... I noticed the entire bottom had rice even though I didnt order it and noticed that all other poke bowls had it too.  This was really weird as I wasn't expecting that. Then I realized that maybe this is how they make the bowl look more filled in a cost effective way.  A bit odd if that is true.  Either way, from a taste and presentation perspective.  It is good.. the wasabi sauce had a great bite and all the items were fresh and had the nice crunch to it or softer nice texture.  I ate it fairly quickly... the only thing was that the rice was a bigger filler and I had a small scoop of the salmon compared to downtown at the same prices.  

This is the only reason why I docked the 0.5 stars to make it a 3.5 star experience.  if they were about the same as Toronto, this would definitely be a 4 star experience.  It's still a good place for GTA west ... till the next hot place gets opened."}
{"text":"ordered the spicy samurai duck sushi burrito.

the smoked duck was delicious. tender, juicy full of flavour. the mandarin orange was the other dominating flavour and i found it to work in great combinatiion.

i think there needs to be improvement in the way the sushi burrito is wrapped. it will completely fall apart with your first bite. very messy."}
{"text":"My friend and I were in a mood for sushi before our movie and this was the closest thing in the plaza. They do offer sushi to go but since they specialize in sushi burritos and poke bowls, we decided to try those out instead. 

The burritos come in cute packaging which includes soy sauce and wasabi. I thought it was brilliant. Everything you need in one place and great for take out. They have premade burrito and bowl options but you can also assemble your own. I decided to go with this option. They have paper on hand with easy to follow instructions that allow you to customize your burrito or bowl to your liking. The base price is dependant upon the protein (or lack of) you choose. My only complaint was that my poke bowl had soy sauce added to it already. I'm not sure if this was an accident as I didn't choose soy sauce or if it's a default they just do but I didn't appreciate that. The whole point of customizing a poke bowl is so that it is flavoured according to my preference and the added soy sauce was too salty, especially when absorbed by the rice. Next time I will definitely tell them to omit it. Other then that, it's a cute place for a quick meal."}
{"text":"This is a special restaurant. Japanese sushi fusion with mexico..... crazy. The easiest way to split this review is between the Japanese and the mexico cuisine.

Starting with the Japanese. The key point is the freshness of the fish and veg. I can say they are fresh. Provided these type of restaurant, they are as fresh as it gets. the rice is done well as well with no complaint. Also, they did not cheap out on the seaweed.

The Mexican is on how they wrap it. The presentation of the burrito is quite nice and eating it does not make a mess.

Will return for 2nd. but it's not something I would make a special drive out to."}
{"text":"I like how they are incorporating two cultures into one. Even though it is more japanese sushi dominant than mexican food.  They are presenting the food in a whole new different way.

Poke bowl - now ive heard so much about this so called poke bowl that originated in hawaii.  In the simplist form its a salad with raw fish.  My salad had raw salmon, ripe mango pieces, corn, seaweed, arugula and a sweet mango mayo. Not a bad meal at all, considering its my first poke bowl

Salmon burrito - when they make these work of arts its big, it fills you  up quick. Maybe because they put probably to cups of rice in that burrito.  Just imagine a salmon maki but super sized.  This is probably the best one from what we bought.

Spicy salmon taco - it felt underwhelmed, like it needed something. The filling was good, typical salmon with spicy mayo and tempura bits.  But together with the flour tortilla it didnt work for me.  It tasted bland, maybe they should also use nori with the tortilla shell.

I gave them four stars because the concept is original and unique. They have other locations, go and try it out!"}
{"text":"the sushi burritos were delicious. I had the unagi and my friend the salmon make your own. casual but nice decor. clean. I liked the burrito boxes. I'd recommend going here. lots to choose from. sushi nachos look good too."}
{"text":"Went here twice already and enjoyed both times! I first went there and got the salmon poke bowl and my brother the chicken burrito. I like the poke bowls here because there is only one size and that they actually load up with many different toppings. I am used to eating Poke Guy's poke because they marinate the poke but this place mixes the sauces right away (I'm not complaiming though!) It's pretty filling and they gave me a coupon for $5 off the next $10 purchase. As for the chicken burrito, it tasted a bit weird for me... but it makes a good substitute for anyone who does not eat raw fish. I came back a second time and had the same poke bowl and it did not disappoint. Service was really attentive as there weren't that many customers during the time I went. I shall return again haha!"}
{"text":"As if this place needs my review, it's awesome. I always get the poke bowls, and I'm never disappointed. I'd recommend you try the tuna bowl with rice and garnish it with tempura bits for that extra crunch. Most toppings are included in the price, up to 4!

This is my go-to place for poke. It should be yours too!"}
{"text":"This location is tucked away in Yorkville Village's food court, which makes it a great place for a quick meal in the area with it's ample seating. 

Mi'hito is so far my favourite place for sushi burritos. I usually get the rising sun burrito because it's delicious and the ingredients are well balanced - there's just the right amount of fish and the cabbage provides a sweet and crispy texture that you didn't realize you needed. 

The burritos also keep their shape quite well and are presented in a cardboard tube which makes it great for travelling. The tube is opened with a rip tab in the middle to perfectly split the burrito, but don't rip the tube if you plan on taking half of it home!"}
{"text":"I seriously had high hopes for this place, but was left disappointed. I thought Mi'hito would be a good change from the usual place I get my poké craving fix (Corner by Spoon and Fork), but it turned out to be the exact same when it came down to the toppings and taste (EXACTLY the same), with the only differences being the price and the tacos. Mi'hito for some reason has made their prices way too high for what you get. At Corner I would usually get a poké bowl with half tuna and half salmon. However, Mi'hito completely refused that request of mine. They also had a weird system, whereby, although you're meant to order at the station, we still had to write down our preferences for choices and toppings rather than just pointing at what we want. 
My experience was a bit hilarious. We entered and it was completely empty. Once I place my order, I was just standing there while he began making my bowl. For my bowl I asked for half mixed field greens and half cabbage. But the server had no idea which greens were which. He literally put spinach in my bowl then removed it, and then put arugula in, and then removed it...he did this more than 5 times. So maybe he was new, but I feel like they should've trained him a bit before letting him serve anyone. Same thing again for the additional toppings, where he was just so confused to the point that I just gave up and ended up finding it funny rather than being frustrated. I didn't try the taco, but maybe next time I might. 
Taste-wise, it was exactly like Corner, which is a good thing. But again, I rather just go to Corner next time as it's cheaper and they accommodate some alterations."}
{"text":"Good poke/sushi burrito joint. Workers load the toppings which is awesome. Had to dig my way through to get to the rice which was good. They don't skimp like other poke places. I would come back and try their unique proteins (smoked salmon, smoked duck, etc)."}
{"text":"What a disappointment. $14 for the Rising Sun sushi burrito; it is over priced and over hyped. The taste was just ok and there really isn't anything special about it.

I said I'd try it once and I did.
Will not be going back."}
{"text":"I've been here twice now and both times I got a half sized poke bowl. Unless you're very hungry, I would say that the half size is the perfect amount of food for lunch. It can get pretty busy at noon so don't count on finding seats, it's a pretty small establishment that does mostly take out. The first time I came here I picked the yuzu sesame sauce for my bowl and I found that it was much too thick and not enough to coat the rice so it was slightly bland. The second time I got the sesame vinaigrette, and this was a much better choice because it was runnier and went well with the rice. The thicker sauces are probably better suited for the burritos and tacos, and less so the bowls. My only gripe is that there isn't actually very much fish in the poke bowl, and it gets lost in all the other toppings- kind of disappointing seeing as typically the focal point of poke bowls would be the fish. Other than that, I love the variety of toppings that they offer and it's great for a lighter and healthier meal."}
{"text":"Love how much closer this place is to me versus Corner.  I miss Prince Sushi, but this was a good replacement.  Every time I'm in the plaza I automatically gravitate towards this place.  What do I order?  The tuna poke bowl with sesame vinaigrette and spicy mayo sauce.  Delish!  Sometimes I add lobster or extra salmon/tuna and it's instant tears of happiness.  Then they have the Rising Sun sushi burrito--a must try (probably their best-seller too).  And the location is perfect because I can grab a quick bite before and/or after a movie (yes, I wrote and).  Oh, and the interior's clean, understated, and soothing to the eyes.  Plus the jazz music.  It gives this urban/fresh/classy vibe."}
{"text":"Ordered the sushi burrito and it was delicious! Fish and veggies were fresh, and it was not stuffed full of rice.

The price was a little high for the serving size, but at least it tasted great."}
{"text":"Read about this new opening on this site: insauga.com. And I had to try it out!! 

The place has a communal seating and it's clean and spacious. Like a burrito place, you order first, pay then watch your food be made in front of you. 

My partner had the spicy salmon burrito and he loved it. It was wrapped up nicely (and cool) in a carton. Definitely it fits a large burrito - with style!! And it was filled with lots of salmon chunks!! 

As for myself, I ordered a beef and chicken taco for $4 each. They had similar toppings and they warmed up the meat in a portable grill. They were generous on the toppings that it was definitely hard to eat. Overall I was satisfied. 

Verdict: Grab a bite before or after the movies since Cineplex is there. Also, I'll be going back since they gave us a coupon each for $5 off next visit. (They probably saw me as an Elite Yelper and they knew how to please me.)"}
{"text":"Mihito  Sushi Toronto is just as good as the Courtney Park Location. Having tried all the tacos I went with my favourites of the shrimp tempura , vegetarian, and the spicy salmon . The service was really fast and If i am in the  area again and  craving a sushi taco  Im coming  for some ."}
{"text":"If you are in the mood for  a fusion of  East meets Central America then  you have come to the right place. This is a long overdue review  as will the next few of mine for other places  due to a busy life. 

Sushi Tacos are what Mihito is known for and thats what I will focus on. I will  pokebowls in another  review. I will not review a sushi burrito because a sushi burrito is simply a giant sushi roll that  has more   items in it and has not been cut into a set of rolls which we see on sushi  menus. 

I have been to Mihito 3-4 times and  eaten all the sushi tacos on the menu . They are an excellent flavourful snack which is made fresh right before your eyes.   

 My top three sushi tacos are the : shrimp tempura, salmon, tuna  in that order . The rest are nice but these are  the ones I enjoyed most and of course recommend for you to  enjoy as well

 One can easily order 10-12 if they are in the mood but  recommend consuming food in moderation so go with three per visit for a hearty snack  before or after the movies

The service is excellent but be prepared for   a wait  if there are five or more people in line ."}
{"text":"WHAT TO TRY?!

They have sushi tacos, sushi burritos and poke bowls. I recommend tacos if you want something small to snack on, burrito if you want something on the run and bowl if you're extra hungry and don't want to be messy. 

I ordered the rising sun burrito and the salmon poke bowl. Both were delicious and freshly prepared when ordered. The poke bowls are a decent size that are clear and packed with ingredients and toppings. The burritos were also huge and packed with a lot of ingredients. Raw Fish was also fresh and had enough seasoning. 

The place is like grab and go style where you pay for your meal first before they made it. There's long communal tables for people to sit. Ceilings were high and the space was pretty open. 

LAST TIP?!

They ask you if you want any more toppings like fried onion bits, tempura bits, green onion, sesame seeds, tobiko, seaweed, ginger and jalapeños to name a few! Feel free to add all of the above. Also add more condiments, sauces or wasabi on your own if you want. They have some additional condiments on the side by the cashier so you can add more if you don't think it's enough!"}
{"text":"Mi'hito opened very recently - serving Sushi Burritos, Sushi Tacos, and Poke Bowls. I went and got take out for lunch. We got there right when it opened and were kindly greeted by one of the staff. We were given a coupon as part of their opening promotion ($5 off a minimum $10 purchase). I decided to build my own Sushi Burrito and I was not disappointed. Ingredients were fresh with plenty of options. Overall, I had a great experience and the resturant is a nice addition to the area. 

Taste:  4/5
Service: 5/5
Atmosphere: 4/5
Value for Money: 4/5
Would I come again: Yes"}
{"text":"I have eaten countless sushi burritos from this place. The fish is fresh, the rice is perfectly cooked and the other fillings are tasty. The seaweed is super crispy and the caviar is plenty. Even the wasabi packet they give you along with the burrito is spicy and not watered down. 
It is also conveniently located in the cineplex plaza so you can grab a bite before the movie.  
My reason for giving it a 4 star is because they put way too much rice in the burritos which is a filler. This could be compensated by more seafood since you are paying over $10s for each burrito. Overall I would recommend you try this fusion is Asian and Mexican at least once!"}
{"text":"Good place for fusion style quick bite, the burrito is big portion and harmonious, but the taco is bit dry and hard to chew.

Tried unagi, salmon and tuna. They all fresh and reflecting the price level properly."}
{"text":"Wanted to grab dinner before we watched a movie. Never tried this place before and bf wanted a poke bowl so we went to check it out! Was our first time here. I've known of this place for a while but I always thought it was raw sushi pieces and I don't eat raw.. so we went elsewhere. Turns out they have other meats too YAY. I got a chicken bowl with half salad and rice. Don't rmbr what the bf got. Portions were huge! I couldn't finish it so I ended up asking for a lid and bag to go. All the ingredients tasted really fresh and this is customized to your liking. The added mango chunks tasted great with my bowl as well.

It is a bit  pricey for 2 bowls though. Other then that, it's really good! I would come back!"}
{"text":"I can't help but keep coming back to this place as my dinner choice before my once a week school night. If I'm hungry I go for the salmon burrito (11.99) which is super filling and great price. If I had a late snack already I would get the salmon taco (4.99)."}
{"text":"This place is giving out free signature sushi burrito this week with its grand opening promotion.  All you have to do is to post a picture of the restaurant and tag 3 people.  The burrito was generous in size, and they piled on the salmon which was awesome.  Everything was fresh and tasty.  I wish them the best in their business."}
{"text":"Absolute favourite place in Sauga to get a poke bowl! Their Salmon Poke Bowl cannot be beat. The salmon and mango tastes really fresh and they have a variety of sides/toppings options as well. The price of a bowl is about $12 but it's very filling. For a quick lunch time bite, other items on the menu are pretty solid as well. I've tried their tacos which are tasty and a good portion but not a standout.

It gets really packed during peak lunch times on weekdays, so place your order before going in to dine-in/take-out. There's a significant amount of seating inside (and patio during the summer)."}
{"text":"I'm a huge fan of smoked duck and seafood poke bowls, but obviously, you can build your own. It's an industrial-looking small space with family tables, and can get busy around the usual meal times, but well worth it."}
{"text":"I have never heard of MI'HITO before but I'm glad I went today. They serve sushi burritos, sushi tacos, poké bowls and so forth. It had replaced Prince Sushi that occupied that space prior. Today was first its first day and the interior is very modern chic with jazz music playing on the background. The staff were dressed in white and beige aprons with a beige paperboy hat, a nice touch!

I've also never had a sushi burrito before so I can't compare to another place but when I showed my friend a picture of their menu she said it was the same as the places downtown in terms of prices.

I ended up ordering the Flaming Dragon because it was the first on the menu and I had to get back to work quickly. They made my sushi burrito in about 3 minutes flat. It came in a cute little box with pickled ginger and wasabi.

I am definitely coming back here multiple times because every ingredient they used was so fresh. The Flaming Dragon was like a spicy tuna roll but with a cabbage slaw as one of the ingredients. The only issue I had was that it started to come apart a bit towards the end of each sushi burrito half."}
{"text":"Mi'Hito is a new poke/sushi burrito chain that has been expanding at a rapid pace in the GTA. One thing that makes their menu stand out is the fact that they do sushi tacos here as well. These things are pretty decent and they tasted just like poke-but in a tortilla shell instead of your usual sushi rice.

I also tried their salmon poke bowl, which came in a hearty portion with lots of different veggies toppings. The poke here is more \"Californian\" style though, since they basically use plain salmon pieces and then add in your choice of sauce afterwards. Flavour wise, the bowl was very average and I wish they gave more protein for the prices that they charge here.

Overall, Mi'Hito is an okay chain for some poke inspired dishes. There are better places for more authentic and delicious poke in Toronto, however."}
