{"text":"Pizza and salad are delicious!! Homemade Caesar dressing is fantastic. I can't wait to go back and try everything else. Nice and clean, service was excellent!"}
{"text":"After trying so many pizzas in Calgary in my quest for the best, this pizza is hands down the best in the city. I have never been disappointed. Quality ingredients. You seriously can't go wrong with the pizza here."}
{"text":"I'm giving a 4 star review instead of a 5 star only because the pizza was not what I was expecting.  It almost looked like a stuffed crust and I'm use to a more traditional, NY Italian style.  The pizza was delicious but different.  So much so, I had to ask the owners what \"style\" pizza they make.  I was right, the origin was Greek.  We had the pepperoni and mushroom and would definitely go back."}
{"text":"Checked this place out before we went to the theatre on a Thursday night. It was cozy on a cold winter night. It's a small place, so there's not a lot of room to move around. We had to flex our way through a table full of boxes and we had to move our table to let someone pass to go to the restroom. The phone rang constantly, probably for take-out orders, but the ring was very annoying and distracting. For a small place it has 2 large TVs, so the distraction level is at the maximum. There was a large table (?) on one end of the resto with a bunch of pizza boxes, etc. on it. The place definitely has a \"mom and pop\" type of \"charm\"

We ordered a small pizza, spanokapita appetizer and caesar salads. The pizza was tasty, but the crust didn't seem to be cooked through. The spanokapita filling was good, but the pastry had a burnt flavour, and I was a bit disappointed that there was no tzatziki sauce on the side. The caesar salads were quite good, with very fresh crisp lettuce and a nice hit of anchovy in the sauce. 

Overall, I probably wouldn't go back as there are other places with better food and atmosphere, but if you are in the area it might be worth a try.

The service was similar to the resto, a bit rough around the edges.

Food ***
Atmosphere **
Service **"}
{"text":"This was our first time trying this place, and it definitely won't be the last!! It was DELICIOUS!!! We ordered a medium half meat lovers/half pepperoni, and it was AMAZING. We also ordered the traditional wings, those were equally delicious!!!!!!! The fried ravioli was good, if you like the mild flavor of jalapeño :) The service was above and beyond, and fast!!! DEFINITELY RECOMMEND!!!!!"}
{"text":"I love everything on the menu!! The Crispy Hot Wings are one of my top 5 favorites! As well as the Fried ravioli, and the deep Fried Meatballs!"}
{"text":"My new favorite pizza/sub place, by far. Stopped in today for lunch and Michael himself recommended some great sub choices. He brought us a slice of pizza as an \"appetizer\" while we waited, which was above and beyond for customer service. Pizza as an appetizer?! SOLD! On top of the amazing customer service, the subs were absolutely to die for. We'll definitely be returning customers and support our local, small business pizza joint."}
{"text":"Don't let the size of the restaurant fool you. It is small but the portions are large. The sandwiches are tasty and satisfying. As are the pizzas. You will not be disappointed with the food nor the friendly staff."}
{"text":"I live right above Michaels and I frequent here.  Pizza is delicious fresh and always what I ordered. People who complain about the crust do not know pizza. I think it's a compliment to be told it's thick and cheesy. The salad has a homemade dressing and its so delicious. One a side note if you like cheese cake you must try it here. Bar none the best in the city. Again home made and tastes like baby cherub tears. Heavenly."}
{"text":"I had the lunch special, 2 slices and a soda for $4.99. What a great deal and I was so impressed! The pizza was AMAZING! I will be coming here often."}
{"text":"This was our first time eating at Michael's and we ordered pizza and wings. We were impressed with the taste! The pizza was perfect and the crispy wings were delicious! Michael is very kind and courteous. We will definitely be coming back!!!"}
{"text":"This place exceeded my expectations! The pizza is SO good. I also love the wings, they are absolute perfection. Fair prices, great food and excellent customer service. So happy this place is so close to my house!"}
{"text":"We wanted to get delivery to try this place, however the delivery system would not accept our address. We are about 5 blocks away. Too bad for them."}
{"text":"Just had one of the best mushroom pizzas. I'm a pizza geek and this was one of the best i've had in awhile. Lots of mushrooms, good sauce, lots of cheese and good chewy crust. Try this place."}
{"text":"This was one of the best pizzas I've had in years!  I was going to lick the plate but I thought it would be frowned upon by the other restaurant patrons, ha ha! Chatted with the owner who said this restaurant has been in business 35 years in the same location, now that is a successful business and a legacy of serving customers. Keep up the great work team, excellent food and service."}
{"text":"This was not my style of pizza. The flavor got lost in the dough and cheese. But what I will say is that we took home what we did not eat. The next morning it was time for breakfast pizza. The flavor was outstanding. So if you love it great. If not have the left overs for breakfast."}
{"text":"Back in Ca. after a brief trip to Gilbert.  Once again,   we decided to bring back some food from Michael's. This time we went with their cheesy breadsticks with marinara sauce a couple of pizzas and reg. breadsticks that Michael made dairy-free a special order due to my grandsons food allergies. Well we just had lunch, 
and I have to let everyone know that 
everything was amazing !  
thank you again 
Michael's Pizza is the best !"}
{"text":"Stopped by here on my way home from work today to try it out.  Ordered a medium 2-topping and it was less than $10.. Not sure if it was a special or something or just a great price.  Either way.. Nice job.  

The store itself seemed nice.. clean, etc . Very similar to the place that occupied the space before.. Not a big restaurant, but there are some tables inside and out.  The staff seemed pleasant.. Just the right amount of enthusiasm actually.  Not bouncing off the walls like other places.. just sortof normal.  Kindof refreshing actually.  

The pizza itself I really enjoyed!  It wasn't my \"perfect pizza\".. but the taste was fantastic!  The crust was nicely done.. I did have to eat most of it with a fork.. Toppings would have just slid off otherwise.. Not my preference, but the taste more than made up for it.  I will be back for more pizza and to try other things on the menu.  Nice job guys.. Keep up the good work!"}
{"text":"Just bought my first pizza at Michaels and it was one of the best pizza's I've ever eaten. I ordered the All Meat and it was incredible."}
{"text":"Great pizza. Delicious pizza actually. Miss black and white cookies?? One of the few places that have them. Good lunch deals. The employees are awesome."}
{"text":"This's is new pizza houses very good pizza I would Order over Ana over welcome to Giilbert
Great pizza"}
{"text":"Love this place! Super friendly staff! Very clean! They have a special of 2 slices of pizza and a soda for $4.99! The slices are larger sized and delicious!! Loved the atmosphere! I wish we have one where we lived in Cali!  Will definitely be coming back!"}
{"text":"1st time pizza from Michael's. The outer crust of the pizza was perfect and tasted great, but the pizza shell was too thin and over cooked. The topping which were fresh and plentiful but just fell out off the pizza. Also the sauce had a off taste almost maybe burned at some point. This is from my tastes buds and by no means I'm I bashing Michael's. The staff and Michael was super friendly and delivery time was very fast. We will try back in a month or so."}
{"text":"The pizza here has the perfect amount of cheese and grease for my taste buds.  If it were cooked in a brick oven, I'd probably give it five stars.  The side dishes were a disappointment, but I will return for future pizzas."}
{"text":"The large pizzas here is 18 inches and at a great price. The pasta portions def can feed two people. Big menu. Definitely more of a takeout place, but really nice place to dine in as well. Will be coming here often for sure."}
{"text":"I hate to be  Debbie Downer, but I am not a fan of this place. 
We ordered this at work recently,and I was reluctant as I live close to this place and have seen the cooks standing right outside thier back door smoking, dirty looking and in dirty aprons. yuck.

Our pizzas arrived and they ( like many have said) very thick....this would have been fine if the pizza wasnt so greasy...the grease was pooling up in the middle of the pizzas.... worst part was..... we found a huge long hair baked into the cheese.  Now I recognize that hair in food can happen from time to time... accidents happen, however that combined with the images of the dirty looking cooks I have seen was pretty off-putting.  
Many will continue to frequent  this place... However I wont be one of them."}
{"text":"So good! Our administrative assistant ordered a few pizzas for lunch today and they are just the way I like it - soft, chewy crust piled on with a ton of ingredients and cheese! I was full after a large slice.  Yum!"}
{"text":"We tried this place tonight for a custom pizza and were not disappointed! We are native to Val Vista and Warner, but lived on the east coast for 4 years and got addicted to good pizza. We realized moving home we would be giving up the best pizza of our lives, but were beyond happy with this place. Good vibe, nice service, and the crust on the pizza is crunchy but not  too chewy. Marinara is on point, not too tomato and not too runny. We are definitely going to be back.  Best we have had since our east coast days."}
{"text":"Picked up our first pizza here after visiting my daughter, who said we should try Michael's.  We got a 4-topping, 14\" pizza and were blown away by how good it is.  This is among the best in the Valley.  Absolutely delicious.  We're going back tonight!"}
{"text":"For the first time since going gluten free, it feels like I have eaten a real pizza! The gluten free crust is unbelievably good! I just had it for the first time tonight and I feel like I can now fully enjoy pizza again.

If you like pizza thick, cheesy, and loaded with toppings, you will love it!"}
{"text":"The pizza crust was great. Just crispy and chewy enough. The pizza sauce was good. A little light on the flavoring for my taste but good enough to be a decent sauce. The sausage had a decent flavor too. Overall I'd like to rate this pizza (mostly because of the great crust) 4 stars but because it was too greasy it didn't all work together so I'm giving it 3 stars."}
{"text":"O...M...G. Thank the lord  I have found my new go-to pizza joint!! I have lived all over the valley, tried numerous pizza joints.. found like 2 gems along the way.  Now I can make it 3. Since I have moved from the west side back to the east side, I haven't been able to find that good good pizza until Michael's pizza. By good good pizza, I mean that flavorful-thin-crispy-crust with flavorful toppings. Yaaaassss Between me and my fiancé, we ate all but one piece of a large, thin crust pepperoni pizza. We couldn't stop eating it. Even my fiancé who normally doesn't eat crust was tryna steal my crust from my plate . The wings.. tender and delicious with a different but delicious crispy coating. Anyways - go eat there. You wont regret it !"}
{"text":"We have ordered delivery here twice, and both times was AMAZING! Love the pizza. Thin crust was awesome and bread sticks were yummy, quick delivery as well. Dropped by today to pick up a pizza, Met Michael. Super nice guy and food was ready when I got there. Great addition. To the neighborhood! Definitely a favorite for my family!"}
{"text":"I went in for lunch and ordered two supreme pizza slices. The crust was crisp and tasty, but toppings kept falling off! I could tell the veggies were fresh and the meat as well yet all of them just could not stay on my slices. Other than this little hiccup, I would recommend the pizza and I would order from them again."}
{"text":"This is probably my favorite pizza place in Gilbert.  My wife loves the grilled chicken sub as well.  Hopefully this place stays!"}
{"text":"Yum! Just had the Classic Italian and it was love at first bite! Delicious meatballs! Had a the Caesar salad, also good. Really like that they asked me if I wanted it chopped, I hate fighting lettuce, so I appreciate the smaller bite size! Delivery was quick,food delicious and I can't wait to try the deep fried meatballs and pizza fries. Welcome to the neighborhood Michael!"}
{"text":"I think this place is the one of the best pizza shops in Calgary. I usually always order the Cesar salad and it is tasty. It has a great home made dressing that is very rich. The pizza is loaded with toppings and it has a bunch of cheese. I have tried many different versions of the pizza and I have not found one that disappointed me. This is definitely the best pizza downtown and it is in the running for best in Calgary. You don't leave here hungry."}
{"text":"My boss brought this pizza to work on a late night and it was amazing, different tastes. It uses feta, spinach and even burger meat. It's not the typical thin crust, instead it's a terrific thick great taste crust. Totally recommended"}
{"text":"Super impressed. Walked in staff was extremely friendly, our fountain drinks were flat we let the staff know they were able to fix the problem. They also threw in a free liter of soda for our troubles. Pizza was delicious!"}
{"text":"I stopped in the other day to give this place a try. I ordered the meat pizza with green olives. 14 inch pizza. It was a tad bit more price wise because I added the olives. It was made quickly and after getting home, having a slice, I thought that it was very good pizza. Lots of meat toppings and great crust. I will be ordering again!!"}
{"text":"Pretty good pizza! House salad was much bigger & nicer than we expected. Wish they were open a little later on the weekend. Crust is ."}
{"text":"This time we ordered delivery and again....Customer service was outstanding and arrived right on time. Order a calzone and the crispy wings!!! Pure yummy goodness! I mentioned that we we love ranch and they threw in extra for us!! We will definitely be going back again and again... 2nd order within 10 days!"}
{"text":"The crust is excellent! The staff is super friendly. I liked the flavor of the sausage.  The cheese wasn't my favorite..it seemed a little greasy.  I prefer a whole milk Grande cheese on my pizza.  I will definitely be back."}
{"text":"I'm slow to try a non chain the pizza because I've had alot of lousy pizza. This place is very good. Give'em a try you won't be disappointed. I'll be a regular."}
{"text":"Next time, I'm gonna ask for \"easy on the cheese\"! I appreciate the different crust choices and I love that you can get a big salad. They are generous with toppings and everyone who works there is very friendly and upbeat. Great little pizza spot! And they have slices!"}
{"text":"Michael's Pizza has solid pizza, friendly staff and attentive service. They have a small dining area and outdoor seating. 

Ordered a large supreme and it was good!"}
{"text":"My husband stumbled upon Michael's Pizza a couple weeks ago & we've been back 3 times since. The 1st time was delivery & the owner himself was the delivery guy & he was awesome, the 2nd & 3rd time have been dine in & the service is just as great.  So not only is the service great but the food is even better. The pizza is legit, breadsticks are my favorite & my husband loves the crispy chicken wings. All around good food!"}
{"text":"We just tried the pizza and wings for the first time and it won't be our last. So delicious. My kids loved the pizza and they are pizza snobs. The wings were amazing! The combination of just the right crisp mixed with the right amount of kick left us pleasantly surprised. The owner is very personable and friendly. I can see this place being a pillar of the community."}
{"text":"Ordered a few pizza pies for delivery, Meat Lover's, Hawaiian, and Pepperoni Mushroom. Really nice crust, good and fresh/ chewy. I stuck to the Meat, but everyone said the other kinds were really good too."}
{"text":"Really good. Loved it. Delicious and Nutritious also it's excellent. Quick and fresh. Vibrant."}
{"text":"I was really hungry while yelping today and after my stint last night at VIN; I woke up at noon with no inspiration to cook so I decided to call Michael's.  When researching Yelp pages (thank you Yelp) this seemed to be the most loved pizza place.

After yesterday's snow spill, going out to get cash was not an attractive option so I was relieved to find that Michaels takes credit card orders on the phone plus delivery in the downtown area is free.  So incredibly happy, I ordered the small house special at 12.75.  This has pepperoni, mushrooms, ham, green peppers, tomatoes and feta cheese.  MP also had two of my favourite dessert treats, baklava and Nanaimo bars.  Man what a great lunch I will have, all for a grand total of $16.

30 minutes passed and as promised I got a knock on my door, the box seemed small but I was super hungry.  I measured the pizza, a grand total of 8 inches but the most impressive feature is that it was 1 inch tall.  MP is not shy about loading your pizza and first bite was so amazingly good.  I was really impressed, thick, crunchy, tons of feta but not overwhelming.  After 3 slices I must admit I am already stuffed. 

Like other yelpers I love Michael's pizza and will definitely order from them again."}
{"text":"I loved the crust here. Its nice and fluffy and crunchy. So company got this pizza and yes they deliver. Nice and generous on the cheese. Have to say definitely one of the better pizza I have had.

Loved their Hawaiian pizza - lots of pinapple !"}
{"text":"With so many chain and industry manufactured pizzas out there - this is awesome home style pizza ! If you want a great pizza you won't be disappointed !"}
{"text":"Great new pizza place. And Oh Em Gee the fried meatballs!! The girls at the counter could use a bump of professionalism, but the grub was really good."}
{"text":"Ordered the special tonight. 18\" pizza and 8 wings. Friendly staff. The pizza and wings were excellent. A little expensive even with the coupon.  Definitely nice to have a good pizza place close by. I will have to give the rest of the menu a try!"}
{"text":"I just moved from Cali and having a solid go-to pizza place is key. This place was an accidental find but glad I found it. I've been here twice and the pizza is outstanding. I'm partial to the thin crust N.Y. style and it hits the mark. It's unpretentious deliciousness! If you aren't in the mood for pizza, I recommend the house sub. Think Italian sub but add in grilled chicken. It's for real!"}
{"text":"Am in Calgary for work. Saw this restaurant highly recommended and so I ordered a pizza for delivery to my hotel. Yum! So glad I did. It arrived hot and fresh and was delicious.  Now I know who to call for great pizza in Calgary. Better than any pizza I've had in Toronto."}
{"text":"Went here due to all the buzz it got here on Yelp and was not disappointed. Probably top 5 best pizzas I've ever had. Server was amazingly kind, price was expected (18$ for a medium \"all meat\" pie which I couldn't finish in 1 sitting) but the taste... Just fantastic. Highly recommended. Will go again before I leave Calgary."}
{"text":"This is my first time trying this place. They just delivered the pizza about a half hour ago and i couldnt wait to let them know what i think! Drumroll.... 5 stars! This is the way i like my pizza!"}
{"text":"Tried Michael's because of yelp reviews. Obviously went there for pizza. To our happy surprise they have broaster chicken. Which we were having problems finding locally. Killer chicken. Ordered pizza by slice. Price was reasonable and good. Crust was the best. Very friendly and prompt service. Will return"}
{"text":"Yum yum yum! Everything we have tried has been delicious! We have tried the pizza, fried meatballs, spaghetti, and Chicken pesto pasta and loved them all! A must try!"}
{"text":"I drive by this place everyday on my way home and decided to try it out last night. I was expecting greatness after all the positive reviews but it was just average. Pizza was super greasy and delivery took over an hour. I'll be looking for another local pizza place in the near future."}
{"text":"Thanks for your support to Finley Farms PTO, the pizza was delicious!  Such friendly staff and awesome food!  Thanks so much!"}
{"text":"I think the oven may be dirty? Pizza had a weird after taste of burnt oven but our pizza wasnt burned. I wanted to like, but not a fan

Thanks for offering a new pizza Michael. I don't think this was our style of pizza though, so we will pass. The pepperoni's were delicious though- you definitely have that right!"}
{"text":"Tried this pizza place recently and was pleased with what I got.  I ordered a salad, wings, and a medium pizza. The wings are really good and unique, the salad is large and the pizza is delicious!  Had meatballs and green peppers as the topping.  Will go back for sure!"}
{"text":"This Pizza is very good! My husband is EXTREMELY picky about his pizza. I brought home the 18\" supreme which is a pretty good size and I was only able to get 2 pieces out of the entire pizza...my husband ate the rest! My husband said, \"when I wake up in the morning thinking about the pizza I just had the night before...it's pretty darn good pizza!\""}
{"text":"I was told that Michael's has \"the best pizza in Calgary\".  So for a recent meeting we had a couple of pizza's and some salad delivered to my office.  I first tried the salad, trying to be healthy and all, it was way over dressed to the point where the lettuce had turned very soft.  But, lets be honest who really cares about the salad at pizza place (it is all about the pie!).  This is a thicker crust pizza, with LOTS of cheese.  I would compare it to a mix between a true chicago deep dish and an original crust pizza.  However, there pizza was way to cheesy and greasy.  The crust absorbed too much grease and was like a piece of bread dipped in water.  I was not impressed, I am definitely on the look out for a better pizza place in Calgary."}
{"text":"This is by far the BEST pizza  in town! 
I go into Michael's Pizza at least once a week. 
And don't let the name fool you it's not just pizza ! Amazing pastas amazing wings (try the crispy wings it's to die for) and so many other things :)  next time you take the family out for a pizza dinner or a dinner at all do yourself a favor and go to Michele's pizza"}
{"text":"Had the pizza delivered tonight,  it was pretty good, nothing crazy special but good. My hubby liked his, I think it is a little pricey."}
{"text":"Our office once in a while orders Michael's Pizza - they have the best pizza in downtown Calgary!  I love the SFO (Spinach, Feta, Onions) - my absolute favourite!"}
{"text":"Chosen for its close proximity within walking distance to Stepen Walk Ave district and other DT attractions.  What Michaels lacked in ambiance, they made up for in the quality of food. Service was above par.  A large ceasar salad & medium pizza adequately fed our family of 4.  Great value $.  Perfect choice for a quick meal while passing through town en route to the airport."}
{"text":"Great pizza and love the friendliness of the owner  their wings are delicious as well.  They Also have black and white cookies which were are a staple of my home back east.  Loveeeee this place.  Have eaten there and ordered delivery.  Check it out if you are a east coast style pizza lover!!"}
