{"text":"This place is to die for! Literally, die for. Food is crap! Garlic knots were raw and the chicken piccata was so gross. Total old microwave type food. I do NOT recommend. Total waste of money and time. Getting a refund for my uneaten disgusting food.  I have NO idea how they got a 4 star.  Customer service was nice tho."}
{"text":"Food was great, huge portions, and great service! Couldn't ask for a better neighborhood spot."}
{"text":"I've been there twice, once with the girlfriend and both times I was blown away, not to mention ordering a take home pizza last night. It starts with the small family style setup with some of the staff talking to each other in Italian. Then add in some of the most amazing Italian food and you have a place worth adding to your favorites. My gf who's eaten at the little Italian family places in Pennsylvania says this place is every bit as good; I know the food's awesome. All I have to do is try the desserts to round off the experience."}
{"text":"On recommendation of a friend I went to Miele's for the first time tonight.  I was pleasantly surprised.  I had spinach ravioli with pesto sauce, my parent's had orange roughy with spaghetti and a special with penne in a brandy sauce with smoked salmon.  The food was tasty and came in good portions (but not TOO much which is starting to really be a pet peeve of mine).  The service was excellent; friendly, fast, and accommodating.  My one annoyance stems from the fact that they added $2 to our bill because I requested pesto sauce on my ravioli (rather than I guess what would normally come - marinara?).  Thing is, the server didn't say that there was an additional cost when I requested pesto and the $2 on the bill was simply labeled, \"misc.\"  I think that is kind of bad business and it was reflected in the tip we gave.  Nevertheless, I will go back.  It's nice to have a good local non-chain neighborhood Italian place nearby."}
{"text":"I agree, we should have tried it a lot sooner.  Great food.  Every thing is very fresh.  The chicken gorganzolla is made with a real cream sauce, you can taste that clearly.  The fried calmari were tender and delicate.  Very friendly and competant service."}
{"text":"I can't believe these reviews! I can only assume these are either friends of the owners or they got a new chef! I ordered from here because they deliver and had good reviewa, when in fact we ended up picking it up anyway. We both ordered the carbonara with chicken, and the only thing good to say was the pasta was cooked right. The sauce has already begun to separate, there was huge chunks of raw onion and the chicken (which was like $3 each extra to add was 1000% the precooked perdue you buy in bags at costco- So easy to recognize by the fake grill marks! All in all it was extremely disappointing, and oddly for the area VERY expensive- $18 for that! It came with like a half loaf of stale, unheated, unbuttered bread and a \"salad\" which was (im not kidding) cut up lettuce and four slices of black olive- It was a sad view- Kinda wish a took a picture before we threw our $40+ mistake in the garbage! Though not soon enough..  I can't remember ever being so thoroughly disappointed with a meal as I was with this experience. My poor husband was up all night sick from it, luckily I was not able to eat much of it after the first bite!  Stay away!!!!"}
{"text":"A lot of my friends always want to hit up (insert mediocre chain name here).  On the other hand, I love supporting local businesses and the food is almost always better.  Somehow I didn't try this place for years even though I shop at the Fry's right next door.  Dang, I'm sad I was missing out - great food.  This is my go to Italian place now.  If we are feeling lazy, they are great for carry out too."}
{"text":"I've been going here since high school for slices. There pizza and pasta dishes are incredible. The service is very friendly and remember me when I come in. If you looking for a nice relaxing place to have dinner this is the spot you have to check out."}
{"text":"The food here is always solid. Last time I went I ordered the gnocchi which was delicious and well cooked, though it was heavy with the kind of sauce it was paired with. Whenever I want some good Italian food I come here since the food is good and the owner is always very nice."}
{"text":"We chose Miele's Bistro because of what we read online. The website and reviewers both said the chef would cook to order. When we arrived, we immediately ordered the garlic knots, which are even better than all the descriptions of them in reviews. We couldn't wait to order a meal!  However, when I sent the waitress to the kitchen with my list of food restrictions, she came back and said none of the entrees would work for me. We came for \"cooked to order.\" What a disappointment! Reluctantly, I ordered a plain salad and settled for their special white cheese gluten free pizza that listed ingredients that were all ok for me--and I emphasized that there must be no tomatoes (which were one of the seven NOs on my list.) Things went from bad to worse when the waitress delivered me a pizza slathered in tomato sauce. I told her this was not what I'd ordered, and she took it back to try again.   Meanwhile the manger (Rich?) walked by and asked if everything was to our liking. I explained the situation to him, he apologized profusely and asked to see my list. Then he asked what I would really like. He thought about what he had in the kitchen, asked if I liked certain items, and came back with a DELICIOUS meal created just for me--veal sautéed in garlic and oil, with red peppers and exotic mushrooms on a bed of spaghetti. It was incredible--even better than I'd hoped for after reading the online info.   If you go, definitely order the garlic knots! Also, be sure to ask for exactly what you want (you might want to ask the waitress to repeat it, just in case you get the waitress I had) and you will be truly delighted. The chef really does cook to order!  Just so you know, the waitress did come over to apologize and to be sure that we were happy, as did the manager, so the evening ended as nicely as it began.   One interesting note: the prices are all unusual: $3.06, $14.14, $17.84, etc. A waiter told us that they try to keep their prices reasonable, so they use the exact cost of food, and don't round up as most restaurants do. This was a very nice touch.  Also, they are moving this summer, because they are so well-liked that the kitchen can't keep up with the demand, and needs to be expanded--a very good sign that this is the place to go!  (Note: if you read my ratings, I had to give the service a poor rating because f my experience with my waitress. However, I could see that other servers were doing an incredible job.)   http://www.tripadvisor.com/ShowUserReviews-g31377-d4477857-r275609639-Miele_s_Bistro-Tempe_Arizona.html#"}
{"text":"This place is as good as it gets! Service is great, the bread they bring out while you wait is to die for and I have not yet had a meal at this place that I didn't absolutely enjoy. Potions are big, so go hungry or plan to take some home."}
{"text":"You know.  I love canolis. I love the canolis at AJ's Fine Foods and other places. I've never had a problem. I'm allergic to nuts too and I've never encountered a place that put nuts in their canolis..... until now.  So, I gifted some pizza boxes that I had leftover from a cake decorating commission to Miele's and ordered the white pizza for my mom. They are very generous people and gave me 3 canolis as a thank you for the pizza boxes. I didn't think anything of this. I thought it was nice of them. I've been eating canolis for over 15 years.  So I get to my mother's we mange the pizza down to crumbs. (Hey! It wasn't over salted! And the salad wasn't salty either! YAY!) An hour later, we try the canolis. Less than a minute later I notice my gums, tongue and lips were blistering and swelling. I can feel my throat swelling and my stomach swelling. Nice. Allergic reaction. What the hell was in these??  When I could I decided to look up \"authentic\" canoli recipes online. I went through 10-15 recipes before I saw one that had it. Pistachios. One recipe out of 10-15. That's when I was kicking myself in the ass because I should have known.  But when you've been safely eating canolis for over 15 years? Would you have asked?  I checked out Miele's menu.  Nope, no mention of nuts. No disclaimer that nuts are in the recipe. Nothing. So I emailed them for the recipe. There it was. Pistachios. So I kindly told them that hey, you should have that on your menu to warn customers with allergies.  Their response? \"Usually most of our customers who do have allergies will tell us....\"  Nice.  You're lucky I'm a nice person. This place is a lawsuit waiting to happen. Although I used to be a regular customer, I am never going back. There was no apology or a hint of regret. When they were giving me these canolis as a thank you gift (I didn't order them!!) they should have said something. Although I am taking half the blame for this situation, their response was inconsiderate, rude, unprofessional and if they had the wrong person on the other end, a lawsuit."}
{"text":"Yummy Italian dinner with group of friends and family. Service was attentive. Food met all expectations. Garlic knots were a hit along with cavatelli bologese"}
{"text":"it took 10-15 minutes to get drinks. By drinks, I mean water. At about 30 minutes in, we got one of our appetizers. My daughter had to go to the bar to ask for the other one. It took an hour to get our food and it was served one person at a time. Spaced so far apart that it became awkward. Our server had to be asked 3 times before we got a refill on water.  My daughter had to walk up to the bar for lemon. Again, after the third request. When we finally had all of or meals, it was disappointing to say the very least. From the presentation, I'm guessing someone just finished attending culinary school. Unfortunately, the preparation wasn't given as much attention as the presentation. The chicken was borderline undercooked. At that point, we weren't going to send it back and wait another hour so we shared food. Considering the time quantity and service, the food was highly overpriced. After the last meal was brought to the table, we were basically forgotten. The next time out server came out, it was to offer boxes for uneaten portions. We were never offered beverage refills or dessert. We were presented with our ticket only to find charges for items we did not order or receive. At that point I had had enough. When I complained, a man who I am assuming is the manager proceeded to tell me that if I didn't like it, leave a review. Good or bad. He didn't care. Then he basically threw us out stating, \"The door, it is very big. \" Needless to say, no tip was left and we wouldn't recommend this place to our worst enemy. And the door is just an average sized door."}
{"text":"Miele's is our neighborhood Italian restaurant and we go there a lot.  Sergio and Joe are great guys who chat with their customers and make them feel at home.  Their home-made bread is delicious!  It's hard to name a favorite dish, as we like so many. For dessert, their chocolate mousse with brandied cherries is to die for!.  They will alter dishes for you if you have special requirements."}
{"text":"Wonderful!  Our first time here.  We will be returning.  The lasagne was yummo. The bread is flakey and fresh and melts in your mouth.  And the sangria is STRONG!! :-)"}
{"text":"We've been to Miele's twice within a two month span, both times it was pretty good. Decent price for the sit in and an ok price for the carry-out pizza. The white pizza is good, although you MAY want to hold off on the fresh cheese. Overall, good place, nice atmosphere."}
{"text":"This place, first of all, was delicious. The staff was very friendly and attentive. I couldn't have been more impressed with our server's knowledge and friendliness. It was my first time here, a nice dinner out with the family. I can't believe I never noticed this place til I found it on Yelp and now here I am. Will definitely be back.   I ordered the chicken parm dinner entreé and I'd highly recommend it. Kalamari and garlic knots as an appetizer. I ordered a kilt lifter to drink followed by an amaretto sour."}
{"text":"Yum! Pizza is amazing and the bread...oh man...YUM! You can't go wrong with pretty much anything you order from here."}
{"text":"My husband and I love, love, love the pizza. It all comes down to the crust and sauce which are both hand made each day. We always get the same waiter to serve and knows what we want. Great for a weeknight meal."}
{"text":"Intimate restaurant worth eating at! The food was delicious. The  menu is small, but they will make you any dish you request. It's nice to find a place that goes above and beyond. They offer a great happy hour.   P.S.- Get the fried calamari! Ever since I've had theirs, no one can compare."}
{"text":"Small family owned restaurant making typical italian dishes. Extensive menu with a variety of price options. Service was great. Attentive and quick.  House Wine's: $6/$22 Domestic Beer Draft: $4  White Pizza: $9, smaller than I thought it would be but very tasty. Pepperoni Pizza $9, best item that night. Fettuchini Alfredo w/ Chicken: $12 and pretty bland. Bread on the side very warm and appealing taste.  A okay in my book, but I don't need to go back again. I'll venture out elsewhere."}
{"text":"In a word - disappointing.  We used to love Miele's, but since the apparent change in ownership it isn't the same. The antipasto salad was mediocre and the entrees were as well.  My friend had the pomodoro and she was very disappointed. It lacked the fresh flavor (and appearance) that defines a good pomodoro. I had the chicken Marsala and it was absolutely flavorless.  I've had much better at Carraba's and I'm not a huge fan of chain restaurants.  Sadly, we will not be returning."}
{"text":"I adore Miele's and am fortunate to live right in the neighborhood.  Super friendly owners.  It's like a real life experience of the film \"Big Night\" when you dine there.  Great food, lots of nice little touches, warm atmosphere.  I said I just wanted some plain-ish spaghetti with sausage and they made it to order for me...perfect! Have had to go pizza which was super good too.  Love love love this place...*****!"}
{"text":"My wife bought a Groupon for Miele's and we finally had a chance to use it last night. The dining area is small and quaint. The Bistro was full as we walked in around 7 pm.  We were greeted promptly and seated. The waiter quickly served us water and gave us the typical intro of specials etc.  As far as the food:  Ordered a house salad with Italian dressing.The salad was impressive. The plate was big and topped with generous portions of tomatoes, olives and cheese. I enjoyed my salad.   The bread that arrived on the table was excellent. I couldn't get enough and almost ended up not being able to finish my main meal because of the great tasting bread.  I ordered Penne Pasta Gorgonzola with Sausage. The serving size was above average. I was barely able to finish the meal (very uncommon) The sausage that came with the dish was tasty, but much on the platter. There should have been more. The dish was a little bland and lacked flavor when I just had the pasta.    My wife and friend also felt the same about their pasta dishes. There was some element lacking to make the meal really stand out.   The service was really good. Our waiter was very attentive. Probably some of the best service I've had in the Phoenix area.  Overall, Miele's is good, but doesn't stand out for me. Decent food, decent prices, but  falls a bit short to other Italian places I've been to."}
{"text":"The place is decked out in Italian decor. The staff is super friendly! The food was delicious!  Friday night was not busy at all! We had the gnocchi plate and the butternut squash ravioli. The gnocchi was good, but the ravioli was DELICIOUS."}
{"text":"These guys have great food.  The Carbonara is to die for.  I have yet been able to eat more than half at a sitting - It's so rich.  And the loaves of fresh bread are amazing.  Fresh bread always makes things better.  If you order delivery do it in plenty of time.  They take about an hour but it's worth it."}
{"text":"My girlfriend and I arrived for dinner around 7:30 pm on a Friday night and were seated right away. Everything about our dining experience was fantastic- our server was extremely attentive and provided us with excellent recommendations."}
{"text":"Nutshell- Good food, good service- overall, a good value! We will be back.  We went there 8.30 on a Saturday night, just missed the weekend crowd! Didn't wait too long before Jenn, our waitress stopped by. They have a decent wine list- good selection, fair prices. We found a nice blend and we were off to the races!  I had the Cannelloni's-Stuffed w/ ground sausage and prosciutto; very tasty! The Mrs's had stuffed eggplant which came with Pasta and Red sauce. We both enjoyed the meals- fast service, nice portions, nice, very nice!  Bummers were that they didn't have any seasonings with the oil/balsamic dip for the bread.   They have a nice variety on the menu- In the time we were there, we saw 3 take out orders, 2 with pizza."}
{"text":"After reading reviews we thought we would give this place a try.  We went to the new location on Dobson and Guadalupe.  The food was wonderful and the service was excellent.  My husband and I were there for lunch on our anniversary, and when my husband mentioned that to the gentleman serving us (who we think was the owner or manager), he gave us a complimentary dessert!   I had the Fettuccini Alfredo with Sausage. The sauce was deliciously creamy and the sausage was nicely seasoned.  My husband had the Spinach Ravioli and added meatballs. The ravioli were tasty as were the large meatballs, and the sauce was very good.  For our dessert we chose the cannoli, which I've never had before, and it was so good. The cannoli were crisp and the filling was smooth and not too sweet.  We truly enjoyed our meal. We plan on going back with family members."}
{"text":"It's hard to find authentic Italian food in Phoenix. But here's a little gem. We even overheard the owner speaking in Italian to an older gentleman at the bar.  We liked the classy touch of tablecloths and cloth napkins but don't be afraid  to wear your favorite jeans. The atmosphere is comfy and casual with a touch of class. Very nice mix. Only about 20 tables so  you won't get lost in the crowd.  We were waited on hand and foot by a very attentive, friendly server. My drink never went empty. We were always asked how everything was.   We shared an antipasto which was brimming with nice little ingredients. Field greens were more impressive than iceberg lettuce. The house Italian dressing was delish.  For the main course I had the chicken parm which was out of this world. Their sauce had that homemade taste you can't get anywhere. My wife had the Shrimp Orecchiette. She said it was dry but Idon't know how that is supposed to be since I never heard of it. Thats why I stick to the basics. The Portions were large and we were full. Overall, it looks like they take pride in hand-preparing your meal.  For dessert: Cannoli. Well presented on a big dish with chocolate sauce drizzled over and a hint of lemon in the light filling. And only $3.50. Nice finish.   Oh. And they will box up your leftovers for you. You don't see that much anymore except the high end places."}
{"text":"Called them last night for a to-go/pick-up order and the guy on the phone said 'We're not little Caesar's'. Had great luck in the past but won't be going back there anymore."}
{"text":"I live right behind Miele's and finally got around to trying it. I just called for take-out (which is the reason for the 4 stars and not five... I felt I couldn't get the real \"whole\" feel). I got the white pizza with some extras added on. When I went to pick it up, the service was awesome. I was told that the white pizza has won best in Phoenix for 3 years. I got home, the pizza was hot. It was seriously the most delicious white pizza I've ever had. The meatballs I added were great with big slices on top. The ricotta had so much flavor and there was the perfect amount of garlic. So, I look forward to the full dining experience and thats the only reason they didn't get 5 stars."}
{"text":"This is the kind of Italian restaurant I would go to if it was in my neighborhood, and I could walk to it on occasions when I didn't want to put much thought on where to eat.  In essence, I don't think I'm going to go out of my way to return here any time soon.  I appreciate that Miele's is a locally-owned restaurant, and the wait staff is friendly.  The six-dollar glass of Chianti was decent but nothing special.  The free bread was very good, being crusty on the outside and soft and doughy on the inside, but the olive oil and balsamic vinegar combo given to dip the bread in was quite mediocre.  The olive oil was not of high quality, and there was way too much balsamic vinegar.  I can't remember the name of the chicken special I ordered, but it was very salty and heavy-tasting.  The side of pasta that accompanied it could have been more al dente, but the marinara sauce was tasty."}
{"text":"I walked by Miele's 100 times before finally giving them a try. I wished I had stopped in sooner. It's a small family run place with great service and high quality. In the past three months we've dined here a half dozen times and ordered take out pizza a few..  I tend to gravitate towards veal or seafood dishes with pasta. Everything I've had has been very good to GREAT. The pizza is top notch but the white pizza is outstanding. I can't say enough good things.   It's hard to find good Italian in Tempe. We found our local place for pasta and pizza."}
{"text":"Found this place through a gift card I got from Restaurants.com. The place is small and probably run by family or a very great group of employees because the food was amazing and their service was exceptional. All the ladies were welcoming, nice environment for either a family or just you and your better half. I will definitely be coming in more often!"}
{"text":"This place is great, food is prepared fresh and staff is very friendly. Waitress checked on us regulary and refilled our drinks quickly. The tiramisu was amazing also. Definately recommend this place to others."}
{"text":"YUM!!!! So good. Loved the garlic knots! Also great bread with the pasta. Staff was friendly. Overall great experience."}
{"text":"Ordered from grubhub. The cheesy garlic bread was too cheesy. (And that's saying something because I LOVE cheese) The egg plant parm is good and their sauce is flavorful. Delivery driver was pleasant as well."}
{"text":"This is a Tempe gem. I've debated on reviewing Miele's because it's my favorite neighborhood secret. However, Joe (and his brother) dishes out some of the best Italian food in town and definitely deserves some of the paying of the homage. It's the kind of place people go to enjoy their meal - that includes the food, the service, the conversation, the whole nine yards.  They specialize in pizza, hot/cold Italian subs and Sicilian-influenced entrees. The salads are large enough to be shared before dinner, and the Giuseppe's Chicken is pretty good. I usually order off the special menu posted on the wall ... actually I almost always get the chicken with artichokes, proscuitto and mozzarella. Sometimes I shake things up with a little of the white pizza. They serve a few Italian and California wines, but I usually choose a Moretti or Peroni. BTW, he also makes his own cannolis and if you don't get one you're soooooo missing out!"}
{"text":"Read the negative comments folks!!! This place needs new staff, starting from the owner, and down the line to the person who drops off your food and picks up your check.  Food was just ok, I walked out feeling like it was just average Italian food, definitely not worth the price, but ok to eat.  Lunch was $14-$18 per person, and the owner was beyond rude, that, no idea how this place can still be in business. There's much better Italian food in Tempe.  This place looked like it had potential, but being a small restaurant, tucked away in a shopping complex, doesn't mean you've found any hidden gems here!"}
{"text":"Just had dinner with my mother here. I was a little worried at first as i had yet to hear of this place. Also, I lived in Little Italy in SF and have become a Italian food snob.   I have to say...this place is amazing. Chicken Piccata was to DIE FOR. Their bread, well, I bought some just to bring it home and enjoy with wine and cheese.   The set up is very small. It is a bistro after all. It has tables outside that face west so you can see the sun set (When it is not 100 degrees outside).   I would have given 5 stars, but it is a bit pricey when you compare with others. No salad with the meal that is $14...but...I will say, this Friday I will be back. Great to hear about a place like this in my hood of T-Town."}
{"text":"I really enjoy coming to this resturant. The staff are great and it's a small place so you will soon recognize them. Did I mention the food yet???? Amazing."}
{"text":"Checked this place out because of the yelp reviews.  I have to say that it was really good.  I ordered the chicken parmesan and my wife ordered baked ziti.  Both were very good.  I'm not a huge italian food fan but I do like good food and these guys delivered that day.  The service is spot on and the kilt lifter was ice cold.  Nice place for a date night too."}
{"text":"We went for lunch. The food was just ok. Cheese in my calazone very rubbery.  All the tables were dirty and the booths smelled like dirty dish rags. A spider crawled up my arm halfway through. I told the server and we switched to another dirty table. Will not go there again."}
{"text":"First time take out order was quite good.  We tried a pizza, spaghetti & meatballs, penne a la vodka with chicken and a sausage parm sandwich...all of which were spot-on delicious!  You can tell this restaurant employs excellent kitchen staff as everything is handmade and mostly all from scratch in house.  Very authentic.  We are looking forward to going back on a dine-in basis to taste more of their delicious sounding entrees."}
{"text":"I wish I could give a 1/2 star.  I'm from the east coast where gravy (sauce) rules supreme.  I also fancy myself as a meatball connoisseur.  Here is my take on dinner.    Ordered spaghetti and meatballs.  Sauce was ok.  It was a little heavy on the oregano and a little light on the salt.  It was a little on the sweet side.  Not my favorite gravy out there but hot and respectable.  The meatball was pretty decent.  Very good texture and flavor.  Again, not my favorite out there but respectable.  Bread was good.  Came to the table hot which was nice.  The salad was meh.  The house Italian dressing was heavy on the vinegar but not bad.    Place is tiny and tucked away in a strip center.  Wait staff was pleasant.  Not sure I would come back again in the near future."}
{"text":"The food was great especially the pizza. The service was wonderful and the atmosphere was quiet and pleasant."}
{"text":"A bit liberal a rating to be sure, but I don't write in one dimension. The service was the best part of the evening, followed by a great Italian dark beer. The food around the table looked pretty good, especially the Chicken cutlet. My stuffed pork was tasty, but hard and not very juicy. Two people had baked ziti and both talked about doing a better homemade. I'm not swayed by the word of others. I have to say though that we were offered bruschetta on the house and even a nice custard like desert, also on house. So, in all, if the ownership is in transition, they earned enough of my respect to win me back for another try. I would really like for them to be successful. They're very generous."}
{"text":"38 years ago I lived in the Sorento area south of Naples. There was a cook in the restaurant we went to, who made Calazone... and I had it there for the first time. Now, the Calazone they made were not the pockets of dough that are bake here in the US -- not by a long shot. These were huge fluffy, delicious FRIED dough filled with all sorts of deliciousness (cheese, meat, vegetables) and then you topped it sauce. Heaven on a place.   We left Italy when I was 14. I am now 48. Over the years my father would make fried Calazone occasionally. It was a huge treat. I have not had fried Calazone for more than 28 years.   Until this past Wednesday at lunch. I was hungry. My daughter had just gotten a cast on her leg. We were tired and hungry. I wanted to try Miele's. For the past year, I have resisted going into Miele's Italian Bistro. I shop next door all the time, and for one reason or another (usually time constraints or groceries) I have not been in.   We went in, right at opening time. 11:30. We were greeted by the manager. Started talking, and asking about the calazone... and he told me \"Yes, we can fry it for you!\" He went on to explain that they will make WHATEVER YOU WANT if they can accommodate you right then, or -- they will make it for you for another day! WOO!~  I was so excited I almost got up and danced a jig! Of course this set the tone for the rest of the meal, excitement and stories of living in Italy and playing in an extinct volcano!   We started with Garlic knots from Heaven. (3.00) They are a favorite of my 16 year old. Most garlic knots I have tried are overwhelming with too much salt and garlic, so I did not want them, thought we would have some to take home... nope.  These were perfect. Light, golden, slightly crisp on the outside, with just the right amount of garlic. The insides were pillows of steaming hot perfection. They are the best, hands down, I have ever had.   Then the mozzarella sticks arrived. (5.50) Crunchy golden breaded perfection on the outside and a quality mozzarella melt and Delicious on the inside. Also the best mozzarella sticks I have ever had. It came with the best marinara sauce I have ever had. So good, my taste buds exploded!  I (or course) ordered the fried Calazone. (4.99) It was better than I remembered it from when I was a kid, or when my father made it for me. The sauce was delicious. The pillow of a half order of calazone FILLED THE PLATE! So wonderful.  My daughter ordered the Chicken Parmigiana (9.99) She said it was delicious and she finished EVERYTHING (unusual for her) It came with a wonderful fresh green salad with a great Italian dressing on the side. The manager also brought us a loaf of bread, fresh from the oven and tasting like it had been baked in Italy and shipped here... complete with real butter!  All in all I am regretting that I had never tried this Bistro before. I have been missing out. As we were leaving it started getting full. Let me tell you something -- Olive Garden will never have my business again as long as Miele's Bistro is in business!   I am looking forward to trying their Eggplant Parmigiana, and the Veal, and the Lasagna -- and they list special on their facebook page all the time!   Best thing for me? I am in walking distance of the Bistro... bonus!"}
{"text":"Ordered delivery from Grub Hub and the food was 20 minutes late, cold and horrible. Will not ever order here again."}
{"text":"Went here with my wife and two kids. Food was middle-of-the-road and so was the service. The waitress seemed annoyed that we had our kids with us.  They are well behaved, but our youngest (two) was holding a jar of Parmisian cheese from the table and the waitress tanked it away from her.  Definitely rude.    Bottom line: very mediocre all around.  I'm not a food snob by any stretch, but this place is just simply average."}
{"text":"Well, I am not a foodie.  I am a super pickie super taster (that's a thing, look it up on Wikipedia).  I don't care for many foods.  I don't like meat on the bone, I don't like fish, I don't like spicy foods, and the list goes on... .I also am not a lover of a many places.  Additionally, service is KING and I will frequent a place that has fair fare just because service is phenom.    In Miele's, I hit the JACKPOT.    Let me start with my personal favorite: the bread loaf.  Now I had this type of bread only once before in my life... at Tony's Pizza on 59th and Olive and he would not sell me a loaf by itself, the most he would do is sell me the \"pizza bread\" with no sauce or cheese.  Come on, Tony.  Help a loaf-lover out.  So the loaf.. and they have them to go.  And I love them for it.  Get one.  Get five.  They're wondrous.  The ONLY suggestion I have here would be an Italian Mix of herbs on the table if you want for your oil and vinegar dip.  Small preference, might be just me.  Next: I had the calzone my first trip, with a mix of rich cheeses.  So melt-in-my mouth delish... just perfectly cooked.  The servers were so friendly, anticipating my empty beverages.  Our cups runneth over.  It was a relaxing, enjoyable experience.  That was first trip.  I don't remember what my fiance got, but he was thrilled.  That was our first trip, and we used a Restaurant.com coupon.  Second trip we got a little smarter.  Since this is a smallish place (hence the name: bistro) we went a bit after the dinner hour.  The weather permitted, so we picked a spot on the patio and settled in and ordered the Sicilian pizza.  I know from experience (Raffaele's has been a fave since high school) that they take a good hour to cook).  We enjoyed the garlic knots as an appetizer.  They were good but if you're expecting a serving size like that at NYPD you're only going to get about a half dozen - although they are tastier than NYPD.  I preferred the mozzarella sticks that we had previous.  Nom.   We ordered our Sicilian with the white pizza toppings and salami on half.  It was really good although a bit overdone.  They mentioned that they had a new pizza oven and were dialing in on the done-ness of it.  I think they'll get it perfect next time.  I actually prefer the sauce to my other Sicilian fave (mentioned above) which is a bit too sweet for me.  Some will disagree.  NOW... the icing on this cake... is the CHEESECAKE.  Can we talk????  I had THE BEST... and I mean THE BEST piece of cheese cake ever in my whole entire life of all times here.  It was so rich and just the right amount of sour and the consistency was so delicious ... I just inhaled it.  I had my fiance go back the next day and pick me up a piece to go.  They'll do it up with choco and nuts and a drizzle but I prefer mine plain.  OMG I think about it every day now.  My mouth is literally watering thinking about it.    So to top all of that off, we were really scared what it would cost, after all, the first time we used a coupon, and now we were paying full price.  These prices are SO REASONABLE that you can't NOT go there.  It's such fantastic service, they are so friendly and attentive, it's such a fantastic experience and the food is amazing.  You have to go.  They have us as long as they'll have us."}
{"text":"Place was clean and quaint. Service was prompt, portions were perfectly sized. Bread and salad was great and they arrived to the table perfectly timed. Quality of food was excellent, salad was romaine with homemade croutons and homemade vinagrette...not some crap iceberg lettuce with the core still in it. Chicken was moist, tender and flavorful. Menu was diverse and had many authentic dishes. Took the girlfriend out for her birthday and she was pleased as well."}
{"text":"Me and my wife have been to Miele's 5 times now. We have always had a great experience here. We order something different everytime, always good. The staff is super friendly and service is great!!!    My only complaint is that we live too far away for them to deliver to us."}
{"text":"We went here for lunch. When we walked in there was only one other group there, so immediately I thought that it was either a well kept secret or it wasn't great.  We were greeted very warmly and the waiter was attentive and very polite.  My husband and I almost always share a  meal. We ordered the bruschetta and chicken parmesan.  The bruschetta was yummy. It was also really nicely plated.  I really liked that there was no hesitation when I special ordered the chicken parm. I usually don't like the marinara on top of the chicken because of my acid reflux and when I asked for it on the side he was nice about it. The only complaint I had about the chicken was that it was a little dry.  My husband got a cannoli, and from his reaction, I'd say he was pretty pleased!!  Over all it was pretty good. We will be going back again !!"}
{"text":"Stopped in for the first time today. The bartender made me feel as though I was inconveniencing him... no wonder they were only doing take out. After I heard him commenting about me in spanish I changed my order to go. Food was good, but my chicken marsala came with 2 small pieces of chicken in one container w marsala sauce and spaghetti w marinara in another container. Seemed like it could be decent, but I am not going back."}
{"text":"Ate lunch here today with all my coworkers!  It was delicious! We had alfredo, pasta vodka, white pizza and eggplant parm! Everything came out super quick and the service was excellent! Will be using them for work catering and future lunches!"}
{"text":"The sauce and bread are excellent. The calamari has light breading and tentacles--like it should. Don't go near closing because sometimes they close early."}
{"text":"\"What do you want for dinner tonight?\" \"Eh, I don't know. I don't feel like cooking. How about you?\" \"Meh, I don't feel like washing the dishes...\" \"Miele's?\" \"MIELE'S!\"  Absolutely no nonsense. Prompt service. Good food at great prices. Welcoming but non-pretentious atmosphere.  Miele's isn't the best Italian out there - some local, fresher ingredients and a little more attention to seasoning might help the flavors - but it gives great value for the money.  Bonus points: excellent desserts. Try the cheesecake or the chocolate mousse."}
{"text":"My family and I really like this neighborhood restaurant. While we often get their pizza ( the kids LOVE it ) their lunch and dinners are really good, too. The salads are large, the pasta is good and anything they make with Gorgonzola is really good!  Sometimes, they get pretty busy on Friday and Saturday nights but you can sit at the bar and have a glass of wine or a drink while you wait."}
{"text":"Good luck putting down the warm focaccia...I dare you to try!!!  This is the BEST Italian food that I've had in Arizona- hands down.   My family and I have been eating at Miele's monthly for over 5 years now. The staff is great, the pasta is to die for, and the pizza is even better.  Do yourself a favor and order their \"linguine and clams\" if you want to bite into a little piece of heaven."}
{"text":"Absolutely disgusting.  One star to the nice guy who waited on our table.  Very nice and professional.  Prosciutto was frozen.  Their bread appetizer had a cheese drenched in oil that was uneatable.  The middle of the bread was still unbaked.  I wonder if frozen foods and under baked breads are the owner's idea of \"fresh\" and \"made from scratch.\".....  Beer tasted old.  We offered to pay for our drinks and left.  I am glad we didn't risk trying our main courses.  I should've taken the hint when this place was empty on a Friday night.  Must have spent good money on having their bad reviews removed (thanks Yelp)."}
{"text":"We got delivery, which was fast and the entire order was correct. I had chicken pesto ravioli, it was delicious. He had seafood fra diavolo, which he said was delicious (I don't eat most sea creatures so I'll trust him on that). We also had calamari, which was crispy and delicious despite being delivered. I will definitely order here again!"}
{"text":"Food is delicious. Pretty authentic. Meatballs actually tasted just like my grandma's.  Satisfied  with everything except the dinner salad that was a tad small. Service was OUTSTANDING! !"}
{"text":"This was the best Italian food I've ever eaten in the 10 years I've lived here. I had a truly wonderful experience yesterday with my friends in this restaurant and I wish to repeat it again and again. See you soon and thank you for the Sambuca."}
{"text":"Great true Italian food with excellent service... And we like the wine and dessert too"}
{"text":"Phenomenal lasagna!  Excellent bread!  This is my go-to place for Italian.  I wish I could  say that I've tried a lot of the menu, but I can't stop ordering the lasagna.  I did try the Baked Ziti, which is good, but it was cheese overload. Nothing wrong if that's your thing, but it was a bit cheese-heavy for me.  The waiter did warn me ahead of time of how cheesy it is, so I can't fault anyone.  I love the lasagna, though.  I don't know what they put in that tomato sauce but it's addictive.    I've been to a lot of Italian restaurants in AZ and this place is my favorite, hands down."}
{"text":"So our go to place for Eyetalian had always been Rigatony's. However, the success of that place in it's new location makes it impossible to go there on our lunch break and not go overtime. I have no problem but some other folks that join in our lunch rotation are not okay with it - especially when there's anything over a 15 minute wait. That's what happens when you go to lunch with those hourly folks :P So luckily we found another Eyetalian place that is also very reasonably priced as far as their lunch entrees go. It is also not crazy busy during lunch whenever I go. Dinner is another story but lunch is quiet and mellow. Can't even remember how long I've been coming here - off and on but I've had the white pizza, some items that were \"specials\" back when they still had that for the lunch menu, and lately the lasagna. I was once here for dinner - sitting at the bar and was given a complementary piece of tiramisu. Wow. Haven't had a bad meal here - not that I'm hoping to or expecting to. Over the years ownership has changed but the dining experience has been consistent. Place is in the mall that houses a Fry's, The Habit, Jamba Juice, Starbucks, Pei Wei, Filiberto's, and a bunch of other businesses so there is lots of mall parking. Actual location is just south of Fry's in the same building."}
{"text":"I just know Anthony N. is going to make fun of me for reviewing another pizza place, but I'm catching up on bookmarks! ;)   Anyway, Miele's is a pretty small Italian joint in South Tempe, just across the street from Changing Hands. It's a local place that serves up traditional Italian classics like pastas and chicken parmigiana as well as pizzas for delivery. I've only had their pizza twice and I wasn't crazy about it, but I did like the white pizza very much, so I recommend that."}
{"text":"I was pretty excited to find this place right across the street. Basically, they have pretty good tasting food at a price that I feel is competitive. First off, the lunch pizza deal they have is great (pizza, drink 5.99). Also they do the same deal with a Calzone. So when I am in the mood to NOT follow my healthy eating then I slither on over and grab. Plus, they are friendly and prompt. When they say 15min, its 15min."}
{"text":"The Best Italian Food in Tempe, Arizona!  Authentic & Delicious!  Just come out and check it out for yourself... The customer service is over the top!"}
{"text":"Great Happy Hour. The Bomb Sandwich, gnocchi and spinach salad are some of my favorites. The service is always excellent. But don't forget the garlic knots, they are awesome!"}
{"text":"My boyfriend and I got a Groupon for Miele's and decided to use it last Friday night on a whim.  The restaurant is in a strip mall kinda place, but it actually happened to be convenient so I could go next door after dinner and get a couple of groceries.  :)  The restaurant itself is quaint but nice. It's got a fancy feel to it, but you can walk in with jeans and not feel under dressed at all. When we got there, all of the tables inside were occupied, so we decided to sit out in front. I was hesitant at first because I thought we might be forgotten or maybe it would get cold, but neither of those things happened.  Our waiter was sooooooo nice and always very attentive. I don't remember his name, but on the bottom of the check it said Jareski.  Anyway, he was very friendly and always made sure we had drinks and were okay.  We ordered a side of garlic knots to try and then ordered our drinks and entrees.    About the garlic knots, they were okay. My favorite part of that was the marinara. I swear to you that marinara became my crack. I could have probably drank it from a mug for dinner, that's how good it was, hahha. I think the reason the garlic knots weren't my favorite was maybe because they weren't garlicy enough for me. They were a little bland.  The bread that comes to the table with the individual oil/vinegar plates was decent, but it would have been even better if it had been maybe a nice crusty loaf of bread. I used the marinara leftover from the knots instead of the oil/vinegar as I'm not so much of a fan (boyfriend is and said it was yummy.)  Not tooo long after we had finished the knots and some of the house bread, our entrees arrived. The waiter said each thing is hand made to order, so if people have a problem with waiting a few extra minutes for ultimate freshness, they need to work on patience.  Yeah it took longer than maybe Olive Garden, but Olive Garden has all of their stuff ready to go and to be plated and sent out.    I wanted a side of artichokes on my pasta and he wasn't certain if there would be a charge or not, so he went and checked. I wasn't concerned because I had the Groupon, but he did go and check and when the meals arrived, there were my artichokes. A very generous serving at that.   My boyfriend really enjoyed the Rosemary chicken, which came with spaghetti and marinara.  I got the penne Alfredo with chicken and had that side of artichokes- YUMMMMMMM.  The Alfredo sauce here is quite mild, but is still very flavorful. The pasta wasn't drenched in a thick goopy white sauce which Alfredo usually seems to be. It was almost delicate.  The chicken was very moist and there were not weird fatty/rubbery parts in it (which is my weird issue with ordering chicken or other meats in restaurants because I'm super picky about it).  He finished his entire entree and ate a few bites of mine and I decided to pack the rest of mine and the artichokes to go so we could enjoy a slice of the Spumoni cake. AHHH MAHHH GAHHH!!!  We seriously scarfed it down before I even realized I should have taken a picture. It was basically a slice of \"Spumoni\" ice cream in cake form with an almost orange-ish whipped cream on top and a graham cracker crust. It was as delicious as appetizing looking.  Next time we come I think I want to get something with that yummmmy marinara and maybe try the garlic cheese bread as an appetizer instead. Of course we will be getting the Spumoni cake again, that's a sure thing.  To sum up my entire evening at Miele's would be: Had a really great meal with a really great server and we most certainly will be back again!!!"}
{"text":"My new favorite Italian spot. Had penne pasta in an Arrabbiata spicy red sauce with house made sausage and roasted garlic. It was AWESOME. Did I mention they deliver. The biggest surprise was how great the house Italian dressing was for salad. Highly recommend this place"}
{"text":"One of the best Italian restaurants in the valley. Chicken parmesan, pesto chicken pasta must try according to me."}
{"text":"This place closed and moved. And by the way the Yelp app sucks. Let me tell you how much I hate the Yelp app. And constantly nags me to give it a review. & I refuse to review it. Even though it says its customers at restaurants are not allowed to be solicited for reviews on Yelp did I mention the Yelp app sucks I'm only adding all this BS because they won't take my review without more detail but there's nothing to review since this place has closed in moved in the Yelp app doesn't even know it because we eat the Yelp app sucks"}
{"text":"We live nearby but never tried Miele's until we bought a groupon deal. We were so impressed. The food was delicious and the service was impeccable. It was much busier than usual ( per a conversation with an employee) but everything was wonderful. We ordered wine, appetizer, salad, dinner and a \"to go\" dessert. Our 5 year old daughter was with us and treated very well. Our waiter poured our wine each time he approached the table, our water glass was never empty, we were checked on often by waiter, support staff and management but I never felt hovered over. The atmosphere was great. It's small and we were in a corner so that may have made a difference, but it didn't seem \"noisy\" like so many places do. I asked that a plate of random leftovers be wrapped up and they did it without questioning or picking through the plate. This is our new favorite italian place. We will now drive a mile and a half to Miele's instead of walk a couple blocks to VinciTorios."}
{"text":"Stopped in yesterday for first time, this food was so delicious! I would be back soon!"}
{"text":"Really really great food! The four cheese pizza and chicken Toscana were amazing! Found this place on Yelp and I suggest to to someone looking for freshly made Italian."}
{"text":"We tried this little Italian place because we live right near by. I honestly wasn't expecting much from a small restaurant in a strip mall, but boy was I surprised! Most things come with a house salad and bread- and this is to die for... it tastes so fresh and delicious! We have tried the Cavatelli Bolgonese, pizza and their gnocci- all delicious with my favorite of the 3 being the bolgonese (which is why I had it the second time we came here!)  I definitely would recommend this and was pleasantly surprised by it ! YUM!"}
{"text":"They are speaking spanish while cooking my italian food. What did i just get myself into? Hopefully the food will be good on return to house.  Never been the first customer of the day anywhere. Roll the dice. Its ready. Well, the language barrier is not an issue here and the $7.99 lunch special (the only difference between lunch special and regular price is a free soda).  turned out very good. The fresh baked bread in alot of the photos held my chicken cutlet nice and cozy and it was a pretty filling sandwich. The cutlets were crispy and there was just enough sauce, but maybe a touch more mozzarella was needed. The chips were a bag of Lays, but it would be great if places let us try something homemade on the side instead of a bag of mundane chips. Still, worthy of another visit for lunch."}
{"text":"I love Miele's!  This is my new favorite local Italian food restaurant.  I took my mom and dad here for my dad's birthday and he's not really a fancy guy, so I worry about him being uncomfortable in places.  Well the worker's here made  him feel right at home.  He has not stopped talking about the food and how nice everyone was and what a great treat this was.  I've heard him bring it up to my brother, my Grampa, a few friends.. he was really impressed.   I had the chicken parmesan which was delicious!  My dad had the spaghetti and meatballs and by the way he keeps going on, it must've been amazing!  My mom had cannelloni with sausage in it and was a happy camper in the end.  We ordered bruschetta to start off with and I pretty much licked every last drop of tomato and seasoning off the plate.  I don't know what to say other than you need to try them out.  They always offer great deals when you sign up for their emails, at least a couple every single week!  Also they do some fantastic one day deals through some of the local daily deal websites that you can't pass up.  Just writing about this makes me excited for my next visit here!"}
{"text":"The new expanded lunch menu is excellent. It has all the favorites and more selections. I had the Fettuccine Alfredo. They now have pasta add-ins on the lunch menu, kind of a modify version of their build your own pasta menu. I added chipotle chilies. The result was divine. The service is wonderful. My whole family loves to come to this restaurant."}
{"text":"The food was delicious however I was most impressed by the service. Our delivery order was delayed and when I called the restaurant to see how much longer, the owner, Jeff, was extremely apologetic. He was very sincere and understanding about my situation. That alone made my experience amazing and the food was the cherry on top!"}
{"text":"Last time we were in Mesa, we ate at this restaurant and couldn't stop thinking about the pasta.  We said next time we were in town, we were going to try the pizza and we are glad we did.  We had a white pizza with huge dollops of ricotta, garlic and mozzarella cheese.  We also had a deluxe pizza with sausage, pepperoni, mushroom, onions and olives. Both were fantastic. The crust is crunchy on the outside and chewy inside - it was delicious!  it's definitely worth a try."}
{"text":"This is a place for me pick up my lunches when I was at my workdays, it is very closer to my work about a few minor drive! I was ordered a few times for my lunches at work and the Italian foods are so goods here!!! I truly recommended!!!!"}
{"text":"We have been here 5 times now and have brought our family from out of town. Our family all commented that they would come back.  I bordered on 3 stars as I don't truly think their prices are worth it. The food is very good but slightly overpriced for the quality. Their seafood pasta is wonderful as is their bread. Oil and balsamic are great.  Service is above average for most places these day but is not 5 star service. That being said, this is family joint and 5 star service shouldn't really be expected.  Although there is room for improvement ultimately we come back for their consistancy. Their location is convenient and we are comfortable there. We never spend less than $60 and keep going back. That tells you something."}
{"text":"Decent option for a neighborhood bite.  Gotta like any place that has Peroni on tap.   A few suggestions:   1- Serve your pasta al dente. 2- Use better quality Parmigiano. 3- Adjust or swap those silly bright pendant lights at the bar.  Customers don't want to feel like French Fries while they dine.  I might try it again one of these days.  Especially if I'm in the mood for an ice cold Peroni....unless I just grab one out of my fridge instead."}
{"text":"Service was exceptionally slow and unresponsive.  Owner even passed it off as being 'the kitchen', so he obviously doesn't get it that service encompasses the entire experience in the restaurant.  Too bad too because the food wasn't bad."}
{"text":"We had a great dining experience, however the food was just average. Great cocktail specials from 3-6pm! Wish we would have gone for an earlier dinner."}
{"text":"Delicious!! Calamari yummy! Pasta yummy! Everything yummy! Very good and a lot of options on their menu. Lunch menu provides an abundance of options as well from sandwiches, pizza, pasta, etc. server said all their sauces as individually prepared per meal. Would highly recommend!!"}
{"text":"While this place has a cozy feel to it, that's about the extent of my positive feelings.  My husband and I both had eggplant dishes--his was eggplant parmesan and mine was stuffed eggplant.  Both dishes tasted like vegetable oil, rather than olive oil, was used to saute the eggplant.  The eggplant had no taste.  The dishes were both way too salty.  The pasta was covered in a marinara sauce that looked and tasted like a can of tomatoes was dumped on top.  My husband, who is Italian, said it is probably the worst Italian food he's ever eaten.  I couldn't agree more."}
{"text":"I've lived down the road for two years and can't believe believe never stopped in here before! I just stopped in for lunch today, ts a tiny place and I was the only customer there at the time. They have a lunch menu with reasonable prices, and I went with the spaghetti salcchita, which is spaghetti with Italian sausage. For the lunch plate and a loaf of bread I spend $7.99, and it was delicious. The owner was in the building and was very attentive to my needs, and overall it was great experience. I'm surprised more people don't go in despite it being a small restaurant! Definitely will return."}
{"text":"We had gone to Mieli's last winter and loved it so we made reservations for the prix fix Valentine's Day dinner tis year and brought a guest. It was very disappointing. There were enough severs for the full house so I had to remind ours to get us bread plates, serve us the before dinner drink, etc.  The caprese had very little cheese and it was mushy. The salad was enough for 2 persons (we were 3) and inedible, way too  vinegary so  the amount served didn't matter after all.. The seafood risotto was good but had very little seafood. We could not drink the water-did they never hear of bottled water? The cannolli were good and so was the  limoncello after drink. We  had to remind the server to bring it. He was a very nice server but they needed more servers as he was running around trying to do too much. I asked if the owners were in the kitchen cooking because I remembered them  as coming out to greet the diners and was told they were at their new restaurant in Chandler. Another case of overextending. It was very disappointing and way too expensive for what we got. We won't be back."}
{"text":"Great food! The $1 delivery fee made us try it. Forget the traditional delivery places because it's worth it!"}
{"text":"Been going here for years, totally legit, great appetizers, pasta, pizza, very reasonably priced,   Andres the waited on us/ hardest working restaurateur in America. Great bruschetta & limoncello."}
{"text":"Food was just ok, the service was slow. An hour plus after having ordered the special, the manager came out and apologized... as they had ran out of the salmon. After a lack luster replacement, they had also ran out of our desired dessert. The table next to us never received their salad. And this was not the only table complaining. The manager said he would be waiving my meal, but the waitress felt I should pay and put it on the bill. We will not be putting Miele's on our repeat list."}
{"text":"Love this place! My family and I have been coming to Miele's for almost 9 years. Everything on the menu is scrumptious and the staff is awesome."}
{"text":"My husband and I have been looking for a good italian restaurant since we moved here from Ohio.  We finally found it.   The food was outstanding...starts out with great bread and homemade salad dressing - with gusto flavor!  Then the entrees were just right; good portion, not salty (like many other places are).  I got a chicken dish and he got the veal parmesan and we both left full and happy.  He wants to go back again today!   You won't be disappointed."}
{"text":"Four of us arrived for dinner about 5:00 pm. When we arrived, we were the only ones there but that soon changed as others showed up.  We started ordering drinks and at that point almost gave up and went elsewhere. The drinks available have changed but not the menus! I got the impression that this is an ongoing issue. The first three drinks ordered off the menu got the response: \"Sorry we no longer have that but we have not updated the menu\".  So if you are looking for: Bud Light, Michelob Ultra or a Mojito you are in the wrong establishment. We wound up with a Coors Light, a Margarita, red wine and an ale.   Once we got past that ordeal, things went better.  We were served small individual salads with dressing on the side. - not bad but I think a family style salad in the middle of the table would be more \"Italian\".  Hot bread was served to the table and each of us was provided with a saucer of olive oil with a dabble of balsamic vinegar prepared by our waiter. A little rosemary and oregano to mix in would have been nice.  The meals were pretty good. I must say that the arrabbiata sauce was one of the most \"spicy hot\" that I have ever had. But, I love hot and spicy!  Fresh cheese was not available to sprinkle onto the meals. Only the jar of aged cheese similar to that used for pizza is available."}
{"text":"I love this restaurant and go every chance I get even if I do live in east Mesa. It's worth the drive. I think the service is friendly enough - not overly so but they never leave you wanting for more. My favorite dish is a special they seem to always have which is a penne salmon with a white sauce. I can't get enough. I never have to tell them to cook my pasta el dente. They KNOW how to cook it just right. I also have eaten the chicken parmesan which was delicious. I love their pizza too so I've been around the menu a few times. The only item I've ever ordered that I did not like was the antipasti salad and I think it was more my preference than bad food. I didn't think it was hearty enough for the price and there was no lettuce - which I happen to like.  The prices are reasonable and one of my favorite things to do is go to Miele's Bistro for dinner and then catch a $3.00 movie at Pollack Tempe Cinemas down the street.  Go to Miele's Bistro for the best Italian food in the great Phoenix area. You won't be disappointed."}
{"text":"I liked this restaurant and enjoyed my dinner but didn't think it was anything special.  I ordered eggplant parm.  It was a bit pricey I thought- at $14 and you pay almost $5 more if you want a salad.  I thought the wine was well priced at $5.50 for a glass of house wine.  By the time I left every table was taken on a Saturday night.  The location is very easy to get to and the service was both attentive and friendly."}
{"text":"We came here with a resturant.com.  The place is small and nice and has a full bar.  Service was excellent.  The bread was fresh and hot and came with olive oil and balsimic.  Salads were small, fresh and tastey.  And then ... ... our dinner arrived. I had the carbanra, it was so salty and just not good.  My husband had liguani with clams.  It was pasta and a huge pile of clams, I love clams but it was overpowering, not good.  I have had liguani with clam sauce at alot of Italian resturants and this was the worst."}
{"text":"I have been coming here for years. The general manager (Rich) runs a tight show.  He makes sure the food is made properly, the customers are happy, and the drinks are cold. He provides excellent customer service and the food is great!  Will definitely be back."}
{"text":"due to new changes this place only has the Scilian pizza as take out only...  went in on a tuesday night there were 2 other tables in the place...and found out that I couldn't order a Scilian pizza...I ordered a regular pizza and it wasn't as good.  Sad that they added this stupid rule...what restaurant does that by the way?"}
{"text":"Great service, delicious food, and reasonably priced... what more do you need?!  The flavours in my ravioli dish melded very well together and the sangria was a refreshing treat on a sweltering day.  The highlight for me, was certainly the exceptional service.  Thanks for a great meal experience!"}
{"text":"I wish this place were in central Phoenix where I live, the chicken dishes were fantastic, the wine sauces amazing, I can't wait to visit my friend Karen again so we can return.  You will not be disappointed in tgis place"}
{"text":"I came for the pasta and maybe should have had the pizza.   I was looking for something different my family would try, and this place fit that bill.  Inside you will find real tablecloths on smallish tables.  We started our meal with a fried zucchini $7.95, it was a bit over breaded and just mediocre as fried zucchini goes.  For the main course we went with pasta dishes, I had the cheese tortilinni in gargonzola sauce, ($12) as I love mould cheeses. I do wish they had their ginocci in this sauce. The portion was quite small, and a-typical for a Italian place. The sauce had some gargonzola flavor but not the deep blue kick I was hoping for.    The bread here is mediocre and can benefit from a crisper crust, also each person gets their own oil with blasimic dipping dish, which really crows the table and made me worry about oil dipping my sleeve.  I tried some of the smoked salmon pene that had a great strong Smokey flavor and some of the fungili which was also nice and mushroomie.  I will come back again to try the pizza but for the pasta there are other options around for a good meal, but for  date this may work well."}
{"text":"Pros: The food is edible. The table bread is good. Our waitstaff was very attentive.  Cons: Garlic knots were very doughy (I don't think they were finished baking). The center of our pizza was soggy. The Chicken Zingara was very mediocre.  The sauce was underwhelming.  Overall:  Take a pass on Miele's and find another restaurant.  There is better Italian food out there."}
{"text":"My husband and I went here for our anniversary on a Sunday night. When we walked in there was only one other group there. We chose our seats and were immediately given menus and beverages. I love Italian food, so I had a really hard time deciding what to get. We did decide to order appetizers: garlic knots and mozzarella sticks. We ordered our food shortly after and got our appetizers soon after that. The food was hot, fresh, and delicious. Both of our meals came with a side salad and bread. I love carbs so I was inhaling the bread. It was crunchy on the outside and soft on the inside. The flavor was so amazing it didn't even need the oil and vinegar provided (although that too was good). Our food arrived hot and fresh and I couldn't wait to dig in. My chicken pesto ravioli was so good. It didn't have much of a pesto taste to it but I think that was because of the rose sauce on top (delicious). My husband had the chicken parmesan and it was HUGE! His also came with a side of spaghetti. At this point, we could not possibly stuff any more food in our faces and asked for the check. We noticed that we had gotten a 25% discount on our bill! (Perhaps because we mentioned that we came because of the reviews on Yelp.) We paid the bill and were about to leave when we mentioned something about our anniversary. Our waitress said, \"Wait, it's your anniversary? Hold on. Don't go anywhere.\" She soon came back with a cannoli and \"Happy Anniversary\" written in chocolate sauce. It was so sweet of her! We had such a pleasant experience; the staff was so friendly and the food was great. I'm glad we will be moving back to Tempe so we can eat here more often!"}
{"text":"We were craving Italian Food and not being from the area we used Yelp and found this WONDERFUL bistro.  Such great food, we had spaghetti w/meat sauce and the Cavetelli Bolgonese, both were so savory and made you eat slowly to enjoy every flavor.  We will definitely be back to try out the rest of the menu."}
{"text":"Celebrated my birthday there this evening with a party of 6, the food was excellent, atmosphere casual and the service far beyond my expectations.  The waitress who served us was attentive and fast.   Oh, did I mention the food was good too.  I would recommended taking a chance with them."}
{"text":"We came here with a Groupon hoping to like the food and service. We had some questions about the menu like what is pink sauce and what kind of cheese, etc... The waitress informed us it was her first day and she did not know. No offer to find out from someone else. So, I ordered the lasagne and my wife ordered a chicken dish. We waited and waited for the salad, bread and garlic knots. The salad was good as well as the bread so we were getting excited to try the entrees. Well, after waiting another very long period our entrees came out. My lasagne was not very good and my wife's chicken was terrible. The amount of salt on the chicken was excessive even for someone that can tolerate salt. Cannot recommend."}
{"text":"Fantastic. Excellent service. Excellent homemade bread. Cioppino was fabulous. Presentation of the food is excellent. Brought home leftovers."}
{"text":"I've been here several times. My fiance loves it. Me? eh. The bread is the best thing here. The service is either really good or really bad depending on who is your waiter/waitress.  Recently changed over ownership and since it has the service has been much better."}
{"text":"I got the beef ravioli. It was good but WAY too much sauce. It was drown in it the stuff. At least the sauce was tasty! My boyfriend got the chicken something that had green olives in it. This was much lighter than my dish. The salads were fresh. I really did not like the drunken bread though :/ it was so greasy that we each took a few bites and threw it out. I really discourage ordering it.  Next time I'll ask for a light sauce and skip the drunken bread."}
{"text":"My fiancee and I went here for date night a little over a week ago because they are part of Upromise and I am glad we did.  We got the garlic bread with cheese...YUM!...and the special roasted tomatoes with shrimp app they had, good too.     He also had one of the specials on the board for dinner and I had chicken piccata (one of my favorite all time dishes).  His was good and mine was okay, could've been better, maybe if it was served with rice or something.  And we got their tiramisu for dessert...plus a coffee, a tea, and a glass of wine for $57.  Thought that was a great deal since we also had enough to take some home too.   The only thing was the server we had didn't start off very good, we waited almost 10 mins for an iced tea and water, and it took a while for him to take our order and for our apps to get out.  But, we will definitely be going back"}
{"text":"I've been coming to Miele's for years and I never thought to review them until now. In all the years I've been coming I have never had a bad meal or poor service. I just returned from a family dinner and wanted to sing their praises.  My favorite dish is their amazing Cavatelli Bolognese. The pasta itself is made with ricotta and is served with a robust red meat sauce with a bit of cream. The pizzas are fantastic with fresh ingredients and without the grease you get at most places.  The pasta and Italian entrees are all top-notch and the staff is very friendly, efficient and thoughtful. It is by far my favorite neighborhood Italian restaurant in the Phoenix area."}
{"text":"I ate Miele's three days in a row.  10\" Margharita pizza with pepperoni one day then I had a 14\" Margharita pizza with sausage the next day on the third day I had the Chicken Zingara.  All very good.   (Update) Today marks the third day in the past week I've eaten Mieile's Margharita Pizza.  I am officially addicted."}
{"text":"Friendly staff. Seems like a great establishment. Been around for 10 years and thriving since the beginning.   I got a half calzone to go - which was a full calzone in my book. It had a nice mix of garlic and salt on top of super soft bread that they make in house. The calzone was excellent.  Couldn't give it a 5 star right off the bat just for the principle of it. Definitely plan to go back sometime soon to explore their menu and see if we can bump things up to a 5 star rating!  ~TheWaterGuy"}
{"text":"I'm surprised by all the four and five star reviews.  I ordered the Penne Alfredo and just got a plate of penne with some watery alfredo under it.  No vegetables, no side salad....this for $13????  The group I was with were split regarding their meal.  Some though it was good, others were just as disgusted as I was.  But no body thought it was worth the price.    I tried a slice of someones pizza and the crust was really good, but their sauce is very bland.  Others agreed.  Yet I saw customer after customer walk out with boxes of pizza.    I don't get it.  I'm not real picky, but this place has no imagination or flavor."}
{"text":"Absolutely great food and atmosphere! Staff was very kind and helpful. My wife and I basically licked our plates clean. I think we just found our favorite restaurant. We will be back soon, mos def."}
{"text":"Miele's is a solid choice for Italian every time. With dishes that range from some of the best pizza in the area, to gnocchi with sausage and peppers, to a penne a la vodka that will knock your socks off, it's truly hard to go wrong with this place.  I stopped by here with the parents a few nights ago and we all three wound up sharing and tasting what each other got. My mother went with the Chicken Gorgonzola. The chicken was cooked very well, and the sauce was rich, smooth, and had a nice depth of flavor. Pops went with the traditional Lasagna, which was fresh and delicious. The pasta within was just the right amount of al dente. I went with Deluxe pizza which is adorned with premium toppings and baked fresh to perfection. Everything was delicious, we all went home full, and had a bit left over as well.  I feel the pizza deserves its own side-note: Despite the fact that the owners are from New York, and despite how incredibly delicious the pies are here, I would not call this true New York style pizza. Its similar, but not quite. Its really more of a hybrid pizza, somewhere between New York style and Italian neopolitan style. Frankly, I prefer the variety. If I want true New York, Im going to Buonos. If I want true Neopolitan, I'm going to Classic Italian Pizza. This, in many ways, brings the best of both worlds together. Pro tip: the white pizza here is simply incredible.   I have been going here for a number of years, and will continue to return with my family whenever I happen to be in town and the dinner tally favors Italian food. A fine establishment with good atmosphere, friendly and expedient service, and most importantly some really delectable food!"}
{"text":"I had my first meal at Miele's last night, and was pleasantly surprised.  I purchased a Groupon to the restaurant a month or so ago, and am glad that I did because otherwise may not have noticed this cute place amongst it's neighbors in the strip mall.  We started with the brochette, and spent the next 10 minutes raving about how amazing it was.  The tomatoes were crisp and fresh, the chopped garlic was very complimentary, and the oil had a fantastic flavor.  Definitely a good choice.  For dinner I had the spaghetti and meatballs and my boy had the chicken toscana.  Both had a very authentic Italian flavor that accompanies food made with care.  The meatballs were everything I was craving...a little spicy and filled with flavor.  My portion left enough for leftovers, but Brent ate his entire meal.  We both left with a full belly and intentions to return again soon.  I have no complaints about the food (delicious!), but docked the restaurant a star for two reasons:  1. The lights are way too bright.  While I appreciate that the restaurant is more casual than some Italian joints I've been to, a dimmer switch on the overhead lights could do wonders for the atmosphere!  2.  One of my favorite treats at Italian restaurants is bread dipped in tasty olive oil with fresh ground pepper and Parmesan cheese.  The bread is delicious, but the prepackaged butter that accompanied it didn't impress me.  I also would have liked freshly ground Parmesan on my spaghetti.  We noticed a lot of pizzas being picked up for takeout, and both thought the bar looked like a cute little place to come have a drink and a bite sometime.  Highly recommended and a great way to support a local business owner in Tempe!"}
{"text":"Even though it's in a southwestern-architectured strip mall, this place had a back east,  Italian vibe going for it.  Each table had a bowl of grated parmesan.  The restaurant was mostly empty.  One old couple sat in the corner.  A few large guys with slicked-back hair sat at the bar, grabbing a beer and watching TV.  We made jokes like, \"I wonder if I can place a bet,\" and \"I hope no one gets whacked.\"  The menu had a lot of choices, but the everything except the sandwiches and pizzas seemed a little exorbitant for lunch.  I opted for the Astoria pizza, no olives ($9).  The roasted red peppers and feta was a nice combination.  It accented the sauce and cheese, but didn't hide them.  I thought the crust was excellent.  It was thin and crisp, but it had body and flavor.  It wasn't cracker-thin or bland and doughy like chain pizza.  The portion was perfect... filling, but not enough to take home.  I'm torn between 3/4 stars.  The food was good, but a little pricey.  I'll pick 3 stars, but I'll go back.  Maybe another selection will bump up my rating."}
{"text":"Found Miele's by accident tonight, and I was highly impressed. It felt like home. Having lived most of my life in the northeast, I was missing good, homemade Italian food. We started with some cheesy garlic bread. So yummy! Then, I had the Veal Saltimbocca, my boyfriend had the Baked Ziti, which he asked for with heavy garlic. Both were amazing! The veal was tender, the sauce was silky and flavorful. The ziti was saucy and garlicky and the mozzarella melted in our mouths. We finished with cannoli and a glass of port. The cannoli cream was not too sweet, and the shells were light and crispy.   Not to mention, the service was awesome. We came in an hour before closing and had special requests, and no one batted an eye. The waitress was attentive and friendly, making conversation and recommendations, and the owner even stopped by to make sure everything was ok.   We have definitely found our new favorite Italian place!"}
{"text":"People must come here for the owners or the pizza, because what we experienced last night was just mediocre.  The penne in cream sauce was just plain. Presentation was bleah. Caesar was okay. Chicken was dry and there was a bit too much dressing.  If you want romantic and quaint, this isn't it. Think pizza joint with slightly better decorations.  I would say if you're in the area, go to VinciTorio's. We seemed to be the only non-regulars, so I must be missing something. Probably will not return."}
{"text":"My friend and I had the Penne with Vodka Sauce. I have never been able to find a vodka sauce that is better than the one I make at home. It was rich and creamy and had a deep flavor like it had been simmering all day on the stove. It was so incredibly satisfying that I almost licked my bowl clean. The loaf of bread that was brought to our table was definitely homemade and was soft, and warm. Prices were great and our entrees came with a salad and the bread. Delicious! We will both be back!"}
{"text":"just ate there again tonight.  The bread is so good. I dont know how they do it.  I'm assuming they make it there cause its so fresh it melts in your mouth like the eggplant parm.  I love this place.  I want to go back tomorrow and try the spag in clam sauce."}
{"text":"Some girl friends and I tried this place for one of our Thursday Girl's Nights.  Two of us arrived a little before the rest of the group and ordered an appetizer and a bottle of wine.  The bruschetta was good, but I've had better.  We ordered a moderately priced bottle of red from their list ($28) which was fair.   Once the rest of the party arrived, the lack of quality service became more evident.  It was 30 minutes after the other members of our group arrived that we were asked for our order.  The food took an average amount of time to be delivered to the table, and while the order was technically right, it lacked some of the extras that were requested.  I cannot speak to the quality of the food my friends had, but my spinach ravioli was mediocre.  There was a lot of it, but nothing remarkable.  We were not checked on once afterward, and our plates were cleared without a word of acknowledgment. We requested two separate checks, my friend and I on one (since we arrived early and ordered the appetizer and wine alone) and the others on the second.  My friend had originally suggested this place because she had received an advertising coupon in the mail.  The coupon was for $10 off a $50 dining check, or $5 off a $20 check.  We included the coupon, but the owner (who turned out to be our server) declined to apply it because we were shy of the $50 required to use the coupon.  He tried to explain that the total before tax failed to meet the required check amount.  Upon further examination of the check, our total (for two people) was $49.78.  Literally 22 cents shy of the required amount.  When I realized that he was unwilling to honor a coupon (that he sent out) due to a 22 cent shortage...it took a lot of self control not to shout, \"ARE YOU SERIOUS??\"  If this guy, with his family owned and operated business does not wish to encourage return, repeat, loyal guests, that is totally on him.  Honestly, had he honored his coupon I may have written this review from a different perspective.  However, since his attitude toward us (on a very slow night) was so negative, and it left such a sour taste in all our mouths...he and his place will not receive any praises from me."}
{"text":"Nobody makes Italian food quite like my dad did, so I'm usually let down when I try any Italian restaurant, but Miele's did not disappoint!   The restaurant is small, but clean, cozy, and nicely decorated. Our waiter was friendly and attentive, and most importantly, the food was delicious!  My mom and son tried the spaghetti with meatballs--which was great because the sauce actually tasted good and well-seasoned, not like Chef Boyardee, and their meatballs were moist with excellent flavor--while I opted for the butternut squash ravioli. If you love tarragon as much as I do, then I definitely recommend the butternut ravioli.   The adult entrees also came with a side salad which had one of the most tasty Italian dressings I've had in awhile, and the bread was also delicious.  For dessert we tried the spumoni ice cream cake, which was good, but not my favorite part of the meal.   While it may not be my dad's cooking, it's still pretty darn good, so I will definitely be recommending it to my family/friends and be back to try their other dishes!"}
{"text":"Omg! All I can say is Wow butternut squash is the bomb!its like better than well you get the ideal! It's like placing decadent dessert in your mouth.The first time I ate it I went on and on and on,praise the recipe and the chef.I am not Italian but I want to kiss the chef right now! #miele's 4 life baby!"}
{"text":"I ordered the white pie and a red pie with pepperoni.  Both were good, but not outstanding.  I saw some pasta dishes come out that looked pretty good though.  This is a cute little Italian place if you are in the area, it may be worth a try..."}
{"text":"Love the food, the bread, the quaint atmosphere.  Definitely worth going here if you want a change up for the routine of chain-style Italian dining.  It's a smaller place, but there's usually not a wait.  Overall I would highly recommend this place, and try different things because everything is good here!  (I had the eggplant parm which is my favorite dish ever, and is often not good at other places, but it was GREAT at Miele's)."}
{"text":"There are tons of good Italian joints in Tempe, this place is not one of them. I expected more, given the reviews. But the food was very mediocre, and the service was terrible. They seated us right in front of the door, even though there were other tables open and when we asked to move the waitress was extremely rude. The manager was nice, and he took care of us the rest of the meal. The dessert was decent, but the main course and the side salads were not great. We ordered lasagna, chicken parm and another chicken dish that I can't remember the name of. All were lukewarm and we're either prepared earlier in the day, or they sat under a heatlamp for a while. If you really want some good Italian, try one of the other great places in Tempe. Even Oregenos has better pasta than this place."}
{"text":"Little gem of a  restaurant in an unlikely site. It is my favorite place to have lunch and the pizzas are fantastic. Whenever my kids are in town we make Miele's a rendezvous spot at least once during their visit."}
{"text":"When we walked in it instantly smelled dusty and very muggy like it was an older establishment. Their hours said they didn't close for almost 2 hours but there was only one other person sitting at the bar. The menu was very large a lot of options but weird prices. Like $7.02. The bread came very under cooked it was practically dough still. A salad was brought out before the meal and was completely pointless. Just lettuce and 2 vegetables on it. Both our entrees were okay but nothing great. After the undone bread and muggy environment we were very turned off from the experience. I will say the waitress was very nice and attentive. The only reason I'm giving them a 2 not a one. I would never recommend them. It was a complete waiste of money and bad way to spend our anniversary."}
{"text":"What a pleasant surprise this was.  We had ventured to this part of Tempe to finally visit The Crepe Bar, but sadly it was closed for the holidays - so this was the closest joint with solid reviews & we went for it.  Instantly wary when you're the only couple dining in a new place, but it was the day after Christmas - and an odd time, so we didn't think too much of it.  Here are a few tips:  MUST.GET.GARLIC.KNOTS!  I've had too many greasy bread-sticks in my day, this was nothing like that - and came with a nice cup o' marinara to dip them in.  Also, get the baked ziti - it's a cheese-splosion.  Fresh mozzarella, ricotta and delicious baked goodness.  We also got the veal parmigiano - which was just spot on.    Great service, reasonable prices, and shockingly authentic and fresh... we will be back for sure!"}
{"text":"What a wonderful staff!! A friend and I stopped by for dinner the other night just minutes before they were about to lock the doors. Realizing how late it actually was, we apologized and started to head back to the car. They insisted on having us stay and were so incredibly welcoming. The food was good, but it was the service and friendly staff that will have me making another visit sometime in the near future.  Next time of course, not so late."}
{"text":"This is a restaurant that I don't get to as much as I should as I live further away now, but good food is worth traveling for.  If you want a break from all the bad chain food for some good home-style Italian, Miele's is your place.  I've eaten here several times over the years, and there's no doubt that these are people that care about the food they're putting out and the service.  Awesome job guys!  You can tell the new owner really cares.  PS - Try a sandwich on the house-made bread they have.  My favorite is the chicken parm."}
{"text":"Mediocre at best.  Poor wine seletion & quality with small 4 oz pours and the caprese salad was forgettable because it contained salty canned artichokes.  Pizza was OK, minestrone so-so.  Will not go back."}
{"text":"We've been on a pizza kick lately, so when picking a place to celebrate our anniversary, we decided to give Miele's a try.  Wasn't very busy on a Monday night at 7pm and we were told to sit where ever we wanted.  We asked for recommendations on what to order and we were told they've won awards for their white pizza (which happens to be our favorite).  We ordered it with tomatoes and pesto and it was fabulous!  We also order the caprese salad which was very good with not just tomatoes, basil and mozzarella, but also artichoke hearts, roasted red peppers and olives.  Loved it!  Then we got the cheesecake for dessert.  OMG.  Soooooo good!  Even though I was full enough to burst I finished every last bite.  Yum!  So glad we tried this place and we'll definitely be going back!"}
{"text":"They make everything in house so the bread, sauces and pizza are great! I have tried a lot of things on the menu but my main order is the Calzone. For less than $10 you can have a massive meal with house made marinara and dough.  Other dishes are great and often hover around the $14 range. They are in a very small space but this place is definitely worth a try!"}
{"text":"This place was ok-very bright and no music so felt a little odd hearing everyone's conversations-would be much better atmosphere with dimmer lighting asks some music-appitzer was great! Salad great! Dinner was a big disapoitment-had chicken marsala -was so salty I couldn't finish it-wasnt very hot either-if better atmosphere I'd go back and try other things but prob won't b back"}
{"text":"Had this place delivered on DoorDash. DD was great, but Miele's food was disgusting! Homemade sauce was a lie, both the red and Toscana. Full of corn starch, cold canned artichokes and olives, dessert not homemade. We just threw out the side pasta, even the kids wouldn't touch it. $55 for two entrees, a kiddie pasta and dessert. What a rip-off! Tasted like microwave dinners from the freezer. An insult to Italy."}
{"text":"Great little Italian joint with nice decor, good food and reasonable prices.  We live near this spot but had never stopped in despite it being extremely close to our home.    We showed up on a Sunday afternoon for an early dinner.  The restaurant was empty, so we were seated quickly by a really nice man who briefed us on the history of the place, recommended dishes, and the like.  His service was very attentive and courteous (which of course it should be, since we were the only customers, but he's a great guy nonetheless).  Very clean with an Italian decor, but not the cheesy type.  Thank goodness checkered tablecloths are finally going out of vogue.... Understated and a mixture of casual and elegant.    A nice touch was an order of bruschetta brought to the table as an appetizer, with fresh tomato and cheese. And the bread was excellent as well.   We tried the deluxe pizza, which was excellent, and $17.99 for a 16 inch pie--not bad.  The menu is extensive without being too crowded.  It's apparent that Miele's tries to get Italian right but not to try to overdo it by offering every possible dish, as many others do, especially the chains.  In any case, a nice dining experience.  We will definitely be back to try other dishes."}
{"text":"We went there for a leisurely dinner at about 6:30.  We ordered an appetizer, salad, and a pizza.  Well before we could finish the calamari and before we could dent our salad, the waitress was trying to clear a spot for the pizza  Although she said she wasn't trying to rush us and would keep the pie warm until we were ready, not much more than 5 minutes passed and she brought it back again!  You'd have thought the were trying to close.  The calamari was good.  The antipasto salad was tasteless except for the dressing which was overpoweringly acidic.  The pizza crust was doughy. The toppings sparse and as tasteless as the sauce.  Thankfully, it's no place I'll ever find it necessary to return."}
{"text":"We went to Miele's to celebrate our anniversary.  We had been past it many times, but had never eaten there or been inside.  It seemed quaint and very comfortable.  When we sat down, we detected a slight disinfectant smell, to the point I asked the wife if she wanted to leave.  She said no, we would get used to it; not my first choice, but we did get used to it.   The service was very good, attentive but not over bearing.  The food was very good and tasted very fresh.   The pricing was fair for what we had.  Overall, we were pleased with Miele's and would go back. We also will try there pizza as a carry out next time we want pizza."}
{"text":"Have to say it's been a while since I've been there some of the best Italian food I have ever had. Miss you guys Sergio and Giuseppe. Garlic knots are amazing and love the chicken parm!"}
{"text":"I have only been here once, but if my experience at Miele's was typical than this will surely become my go-to Italian restaurant.  I love how small and quiet this restaurant is, even with the huge television over the bar playing sports games in the background.  (Girls, maybe you can get your dates to take you here on football sundays!... yikes that sounds sexist.)  The service was exceptional - although anything else would have been unacceptable because the ratio of servers to tables was about 2:1.    The salad and breadsticks were great, but my entree was phenomenal - I had a penne pasta vodka with chicken.  The vodka sauce was killer!  The desserts were amazing, also - my boyfriend had tiramisu, which really tasted home-made, and I had that night's dessert special, which was fresh strawberries in zabaglione.  They didn't skimp on the strawberries, which I loved, and the custard itself was really light and creamy and soooo delicious."}
{"text":"This place used to be better. Seems like they've lost their mojo over the past few years. Last night the service was ok, but the vibe was not warm and welcoming. I am trying to put my finger on what's changed with the pizza...I think the crust used to be thinner. On the plus side, the pizza sauce is good and the crumbled Italian sausage is tasty. The beer selection is trapped in the 1990's...time to drop the Fat Tire (or better yet drop the domestic swill) and add an IPA. We should have dined on the patio, because it smells funny in there."}
{"text":"Great neighborhood restaurant.  The food is fantastic and the service was great.  I sat at the bar with my mom and had a chance to speak with one of the owners.  In talking to him you can tell they really care about serving great homemade italian food.  It would have gotten 5 stars except for the Tiramisu...but everything else was wonderful."}
{"text":"I had the chicken sorrentina. It was one of the chief specials of the night.  It was fabulous. A nice little place with good Italian food at reasonable prices.  Highly recommend."}
{"text":"Great find  Discovered this place after a meeting yesterday. Seems like a nice place with a cozy neighborhood atmosphere.  Friend and I sat at the bar, had a couple of wines and bruschetta. The lady working the bar was super friendly and helpful.  Could not beat the happy hour wine special at $5 for a glass of house wine and the appetizers were discounted. The bruschetta was big enough for two on homemade bread. We got there early so it wasn't very busy but people coming in were regulars, or treated as such. Some were picking up pizza to go. Need to go back and have a sit down meal there.  Love discovering these locally owned places!"}
{"text":"I liked it.  The restaurant is small and many of the tables were reserved, so we sat at the bar. From the moment we walked in we had nothing but good service, from being greeted, to our bartender/server, to the bussers, and even another server who had his own tables but was friendly and thanked us for coming in.  Bread is fresh and warm, mixed drinks are strong, and the caprese salad is awesome - several slices of tomato and soft mozzarella garnished with basil, kalamata olives, and roasted red peppers.  There were entirely too many fantastic-sounding dishes to choose from. I went with penne pasta with a light gorgonzola cream sauce and sausage, my hot date went with lasagna. Although I could have used a little more gorgonzola kick on my pasta, it was still cooked perfectly and the sauce was clearly homemade, not heavy, and went well with the sausage. I had a few bites of the lasagna as well and the red sauce was pretty good - not too acidic, not too sweet.  This restaurant also provides a perfect amount of food - not too much that you're going to have a ton of leftovers, but you will be pleasantly full and pricing is appropriate to that - reasonable to inexpensive. While we ate, we noticed several pizza orders were picked up. More than several. Maybe one every three minutes. I am definetly going to try the pizza next time I come in!"}
{"text":"What a nice surprise. This place was really cute and welcoming. It was busy when we arrived but we were seated right away. Everyone was very friendly and helpful. We had a Groupon so we were able to try several things on the menu. We had the white pizza as an appetizer, the pesto penne with chicken, the cannelloni with sausage, the tiramisu, and a cannoli (to go!).  The white pizza was just okay for me, not much flavor. When I said to my friend \"it just tastes like bread and mild cheese\", he said \"that's why I like it.\" There was shredded basil on top, which I love, but I think the dish needs more garlic and/or salt. I only had one piece to save room for all the stuff to come.  Our pasta dishes were fantastic. My pesto penne was delicious, I could eat a bowl of it even without the chicken. The tomato sauce that comes with the cannelloni was really good. Even though I have a ton of love for the pesto, I am totally ordering a tomato sauce dish next time! The cannelloni was chock full of sausage. The portion size on the pesto pasta was huge, I ended up bringing half of it home. The pasta dishes were served with a loaf of warm, soft bread and oil/vinegar for dipping. The bread is really good...we finished ours, heh.  We shared the tiramisu for dessert even though I am not a fan of coffee flavor. It just looked so good. I ended up liking it, quite a bit. My friend was too full to have more than a bite or two, but he agreed it was good. We got a cannoli to go after the busboy said it's his favorite thing and they make 'em fresh. I had it for breakfast this morning...and it WAS good. Really good. The only thing I don't like is when places \"dress\" the cannoli in chocolate drizzle. I will ask them to leave that off next time.   The prices are very reasonable for the portions and we had a ton of leftovers. Overall it was a great experience and we plan to go back :)"}
{"text":"Where do I start? We were say promptly, and then ordered a bottle of wine. When we ordered our appetizer, pane ubriaco, is when things began going south. It took at least 20+ minutes. The bread was still wet and uncooked inside, and soggy everywhere else from the cheese on it. Our entrees where a Napoli pizza with pepperoni, and the Pollo Picatta, which was reminiscent of a cheap microwave dinner. The roasted vegetables was mushy baby food, not fresh, the potatoes where dry, and the chicken looked more like white fish in an ocean of white wine sauce. The pizza was unimpressive. The dough was soggy. I do NOT recommend."}
{"text":"Visited this restaurant for the first time last Friday with family, one of which was a very hungry seven year old. There was no receptionist so seating was a little slow. After a brief wait we were shown to a table by a gentleman who would be our waiter. During our time there nothing was done hurriedly....so we waited...for water...for bread....our dinners....the bill. The food was very good. The adults both had baked ziti which had great taste with lots of sauce and cheese. The seven year old had spaghetti with a meatball that he declared was the best he'd ever had. Overall this is a good Italian restaurant just don't be in a hurry when you go and don't bring a starving child who asks every few minutes where his dinner is."}
{"text":"Another smallish, friendly neighborhood joint with a comfortable atmosphere that lends itself well to any kind of guest.  I like the outside seating as well.  I've had mostly lunch selections, and since I am a vegetarian my choices are a bit limited. I wish they had more vegetable dishes.  That said, I really like their little bar area. Perfect for a slice of pizza and decent wines in a friendly place.  A good antidote to the overcrowded, noisy mediocrity of Oregano's."}
{"text":"Moved to a new worse location. No sign on new location. The big sign asking for all kinds of help including cooks should've been our first sign to run. Inside looks like an old 80s hotel basement. Service was horrible and food was worse. Tasted like they open a can of tomato sauce and poured it on old burn chicken Parmesan. Horrible place."}
{"text":"I've experienced horrible service here too, like other reviews below. I happened to meet the owner today, who is a complete jerk. No idea how this place can remain in business. For exceptional italian food, Riazzis (down the street) is 10 times better, if you're looking for pizza, Classic Italian Pizza is also down the street, and makes this place look like the taco bell of italian!"}
{"text":"I was excited to come back to this place before I even sat down at my table.  It's a small place and it was crowded, yet we didn't have to wait to be seated.  I think we got the last open table.  The two brothers were awesome.  They are super friendly and joke a lot and their accents let you know you're in for an authentic Italian meal.  I was waiting the entire time for one of the guys to say, \"Itsa mee, Mario!\"   The prices are very fair.  I ordered the 10-inch white pizza with spinach and It was $9 I think.   It's thin crust with mozzarella and  chunks of ricotta. Holy schnike it was so divine!  It very well could be the best pizza I've ever had.  The wait time to receive our meals was what I would have expected.  I was in a group of 6 and everyone ordered something different, including pastas and other pizzas, and they all loved it.  I will be returning to this place to try the other dishes soon.  Tip:  Try the white pizza!"}
{"text":"Came here for dinner two weeks ago, after first sitting down at Pappa Razzini's a few doors down.  After waiting more than 10 minutes there w/out a glass of water to pass away the time reading the menu (I couldn't find anything that piqued my interest), I decided to try my luck at Miele's, instead.  Within 5 minutes, I had already chosen my selection AND had ice-cold water in front of me!  I'd already had their white pizza last year (lovely crispy thin-crust and awesome ricotta!), so I decided I'd try their penne pasta chicken alfredo, which came w/ bread and butter.  Delicious, and I'd order it again!  I also tried the tiramisu, which was served in a cocktail glass, sprinkled w/ cocoa and topped w/ two pirouline cookies!  It was light and refreshing.  Just perfect (but not really a great choice for someone w/ a new-found chocolate allergy)!  I'll be back!"}
{"text":"Sergio and his brother are very kind and professional. I ordered a Greek salad tray for my business grand opening and they had it ready on time and even went out of their way to accommodate my schedule by coming into work early and having the tray ready for me to pick up. Excellent service and salad was a big hit! Thanks again!!!"}
{"text":"I LOVE this place. Theres a few reasons. First, the baked penne is amazing. Its like cheese with cheese on top, cheese in the middle, its cheesetastic (unless you're lactose intolerant). Its a large portion, I usually have some for dinner and the rest for lunch the next day.  My girlfriend loves the calzones, they're big and she always is stuffed.  The bread that comes with the penne is so delicious, I could eat just that. Its warm and soft, doesn't need anything, perfect.   We usually order to go, the atmosphere there is nice, but I like to eat at home usually.   Yesterday we ordered to go, got home and found out our order of lasagna was missing. We were about to sit down to eat, so we just decided to split the penne and get a refund for the lasagna after dinner. I called the restaurant and they offered to give me a credit for the next time we were there plus dessert, or we could get a refund. I agreed to the credit, we eat there often enough. A few minutes later they call back, they offered to DELIVER the lasagna to us (they don't deliver). Ten minutes later our food was at our house, by one of the owners I'm pretty sure, along with two free cannelloni! They were so delicious and fresh! They really went above and beyond.  This place is awesome!!"}
{"text":"I finally decided to eat inside Miele's for dinner this evening.  It was barely 5pm so I was the only customer. I was seated and an impersonal, no personality, waiter gave me a menu and took my drink order. He  briskly handed off my iced tea and proceeded to make a few personal calls on his cell phone from the kitchen doorway. He returned and I ordered the Bruschetta  for an appetizer and glass of Chardonnay. I finally decided,  Chicken Sorrentina ~ Topped with Prosciutto, Eggplant, Mozzarella & White Wine Sauce. This sounded divine and I love eggplant and prosciutto!  The waiter returned a bit  prematurely with the salad and bread( a bit doughy for an Italian loaf, I expect something crustier) to accompany my  Entree with no Appetizers in site yet.  The  bruschetta appeared after maybe 10 minutes and that was a perfect amount of time to wait for an app. I just really didn't want to look at my salad sitting there as I worked on my starter.The bruschetta was ok, more basil would have made flavors pop more. My entree arrived and it looked nicely presented. Layer of Melted Mozz, over sliced proscuitto and then something that looked like a grey piece of lunch meat .It actually was the eggplant ( I did ask where the eggplant was, waiter said they use the same for the Eggplant rollitina) I mentioned  it tasted like breading but definitely no eggplant. This breading thing was perhaps, if even 1/8 in thick,  and then there was my chicken medallions on a nest of spaghetti pasta in a  tasteless white sauce but alas it was no where in the category of a white wine sauce. The chicken was bland and dry. The one  good thing was the Pasta was  cooked just right.  As an Entree I expected a more authentic Italian tasting dish. It was more reminiscent of  Coffee Shop fare for elderly customers with out of order taste buds..  Perhaps I should just stick with Miele's Take out Pizza.  Unfortunately I was sorely disappointing in my $30 meal."}
{"text":"You don't need to travel to Scottsdale to get a 5 star Italian meal with 5 star service. My wife and I brought an out-of-town guest to Miele's Bistro in Tempe and were blown away. We had a wonderful evening. To start, Andres (the owner) waited on us. He was knowledgeable, attentive, and added much to the atmosphere. We started with sauteed calamari in a lemon garlic sauce. It was delicious. We even used the complimentary bread so as not to let the sauce go to waste. I should also mention we had the house Cabernet throughout the meal. The wine was mild, smooth, and paired nicely with our food.    For dinner, we ordered the forte pizza (prosciutto, argula, and sauteed mushrooms) to share. We also ordered the special, which was slow cooked flank steak in a red wine reduction sauce with fettuccine, as well as the 4 cheese and spinach stuffed porkloin, topped with a red wine mushroom sauce. The portions were generous and the food was magnificent. The flavors were rich, balanced, and complex. Andres told us the sauce for the flank steak had been simmering for hours (which also made the steak to be extremely tender). The pizza was excellent, and seemed to be cooked in a brick oven. The pork was moist, and the four cheese/spinach stuffing really enhanced the dish.  For dessert, we ordered the tiramisu and the secret (non-menu item) bread pudding. I am not typically a dessert person, but I was last night. The tiramisu was delicate, light, and perfectly balanced with rich coffee and chocolate flavors. The bread pudding was the best I've ever had. It can't be described - only experienced.  Bring your friends and loved one to Miele's Bistro in Tempe - you won't be disappointed!"}
{"text":"My boyfriend and I wanted to see downtown Tempe and have pizza for dinner.  We selected this restaurant after reading some of the reviews.  We didn't think much of the restaurant at first.  It's in a grocery strip mall.  However there's patio dining which would have been nice, however it was too hot.  After opening the door, we felt welcome into the dining area, as there was no formal host.  The waiter shared the specials and quickly returned with our beverages and bread.  Although we searching for pizza, the other Italian dishes stood out to us.    We started with the brushetta and cesar salad.  Definitely recommend both.  The brushetta toast was lightly toasted and soft.  The brushetta had flavors of fresh basil, tomatoes, garlic, and perhaps oregano.  It was delicious!!  The cesar salad was excellent as well.  The cesar dressing was light but had all of the right flavors.    I had the clams with linguine and Warren had the chicken parmesan.  The linguine had a lot of clams, no shells, which I liked.  The sauce tasted like olive oil, wine, and garlic.  The chicken was thick and very tasty.  The sauce was a thick blend of tomatoes and garlic.    Should we ever visit Phoenix again, we will be sure to go visit this restaurant again."}
{"text":"When the moon hits you eye like a big pizza pie / That's amore / When the world seems to shine like you've had too much wine/ That's amore....Like Dean Martin, Meile's Bistro is a delight, a great weekday/weekend respite from the kitchen. I could be wrong, but it looks like the restaurant has been spruced up a bit recently, either way it is nice and cozy.   The fresh bread that comes with every meal is great and the bruschetta is wonderfully fresh and flavorful. There are typically 3-4 specials every night and always a nice selection between a vegetarian dish and a fish dish. The wine selection is average but the by the glass prices are great and enough variety that I can chose something different every time.   The service is absolutely stellar. The waiter in the evening is impeccable and the owner makes the rounds too, asking how your meal is and the like. I absolutely love this place for a nice meal, middle of the week, enjoy myself spot."}
{"text":"Cute, cozy little bistro that serves up delicious and sizable portions of Italian dishes.  If you're a coupon saver like me, they often have coupons on the back of the neighboring Fry's grocery store receipts.    The bread that is served initially is warm and crusty, and is served with an olive oil/balsamic vinegar mixture.  The bread was decent, but for me the olive oil was very light and I couldn't really taste any flavor in it, just an oily texture.    I tried some of the antipasto salad, and ordered the shrimp parmigiana ($14.99) for myself.  The antipasto salad was a very large portion, with a good amount of toppings on it.  The meats and cheeses were delicious.  I was intrigued by the idea of shrimp parmigiana, having eaten other various incarnations of parmigiana, and I was glad I ordered it!  It came out in an elegant presentation, with a ring of breaded, cheese-stuffed shrimp and fresh basil chiffonade in a hearty tomato sauce.  The entree came with a lot of food, since there was also a house salad, and pasta in red sauce included in the meal.    Service was good, and drinks were filled promptly.  There was a little bit of a wait for our entrees to get served to us, but it was worth it!  We'll definitely be marking this place as a new favorite to get Italian food!"}
{"text":"ive eaten here and to-go, for both dinner and lunch.  their meatball parm and chicken parm sammiches are awesome! and the lunch deal is a great value . . . you get the sammy, chips and a drink for like six or seven bucks.  the best thing about this place is the bread. they give you a mini loaf with your pasta dish and they serve the sammiches on it. seriously, it might be the best bread ever!  the pasta dishes here are also delish. they even do some interesting things like pesto-based raviolis topped with marinara. sounds weird but really good. also had an excellent veal dish here.  the white pizza is also i go-to fav. i havent had the red sauce pizza but i love the white. i think they only do that to go, though.  great local business to support. consistently good food."}
{"text":"We were in Phoenix on vacation and had a craving for pasta. We looked up best Italian in our area and Miele's came up. The bread was light and delicious. The Gorgonzola chicken was to die for and the Bianca pizza lives up to the other reviews. We loved it."}
{"text":"I was in town for a half marathon and Yelp led me here the night before my race.  I sat down and my server was good about getting my drinks right away.  In addition he took his time to go over the specials.   I ended up having the Chicken Toscano.  The entrees come with a house salad.  It was good, though slightly over dressed.  The bread was served with olive oil and balsamic provided for dipping which was very good.  The entree itself was solid.  The chicken was cooked well and so was the pasta.  It felt a little heavy but that can  happen with cream sauces.    Though not \"blow me away\" fantastic, this place has large portions, good value, and stand-up food. Overall, a good Italian restaurant in a strip mall."}
{"text":"The pizza was talked up by at least a couple of friends, but I'm not seeing it. It's not too bad, but also no better than the chain places. Therefore, I didn't feel that it was a very good value. We ordered takeout with family, and the vote was a unanimous \"meh\".... crust wasn't very good, everything else was simply okay. If I lived right around the corner, I might end up here just to support the locals, but I'm definitely not making the effort to come back -- at least not for pizza."}
{"text":"Great food,  the cavatalli bolognase is my fav and my hubby loves the lasagna, just wish they would deliver to me! Had them do it once and was so happy but now I've been told that we are too far away. The guy on the phone tonight actually said I was 10 miles away when yelp says 4.7. I would honestly order from here at least once a week if they would extend their delivery range. Once I'm home from work I just don't want to go out again sometimes. Maybe my review will help persuade them to expand the area, and I'm a really good tipper :)"}
{"text":"We went here after finding a coupon on groupon.com.  The service was good and friendly and the restaurant was quaint.  It definitely has the neighborhood bistro feel.  The food... not so good.  We ordered the special appetizer with shrimp, tomatoes, and garlic bread.  The garlic bread was stale.  I ordered the Chicken Toscano, which sounded yummy with with artichokes, prosciutto and Mozzarella.  It tasted like Chicken soaked in butter with ham.  The prosciutto was probably the worst quality I have ever experienced.  My boyfriend ordered Sergio's Ravioli and I would say for $14 we could have gotten Costco's frozen pasta to last us a week and it tastes much better!"}
{"text":"Since today (21 August) is National Spumoni Day and Brak celebrates these sorts of things, we wanted to find a restaurant that serves the stuff. A quick Yelp search and we had a hit.  A small strip mall cafe on a Sunday night should be sad and empty, but not this place -- there were at least 8 tables filled before we finished our meal. Now that I've eaten there, I'm not surprised that Miele's has such a steady business.  The food was fantastic. The bruschetta appetizer was huge and delicious: five pieces of properly garlic-rubbed and oiled bread, and a ton of fresh, chopped tomatoes with a light oil drizzle and lots of basil. It was so good I took the leftovers home, even though I know they won't be the same tomorrow.  For the entree, I ordered off-menu (as usual), and even though I thought I confused the waiter, he nailed it. I had the gnocchi, which they normally oven bake with sausage, peppers, and cheese, but instead tossed with a spicy marinara sauce. The sauce was thick, very spicy (in a good way), and amazing. I would definitely order both dishes again, though not at the same time -- it was far too much food.  The restaurant was small but comfortable and nicely decorated. There are about five booths, about the same number of tables, and a lot of seating at the bar. There were two TVs on in corners, but they were unobtrusive (and did give us a chance to see the football game). Our waiter was attentive and friendly.  We're big fans of Italian food, and we've been looking for a place to call our favorite for a long time. I think we've finally found it, and we'll definitely be regulars. Thanks, Miele's."}
{"text":"We have been looking for a good Italian restaurant close to home with a great atmosphere.  We enjoyed our dinner.  I had the Fettuccine and my wife had the Chicken Picatta.   I found the Fettuccine to be creamy.  Their bread was wonderful.  It was delivered to the table fresh and hot.  The only downside was my wife did not like the Chicken Picatta she ordered.  She felt that the sauce tasted off and the chicken was a bit rubbery.  But we still enjoyed our dinner very much.  Our server Rich was very nice and prompt."}
{"text":"It seems to be a new place...... they came in like a wrecking ball..... in my mouth. I wish this place would stay a local secret......  however, this food tastes like it was hand crafted by Jesus Christ, therefore it would be a sin not to tell everyone. F=*king incredible, seriously I'm fairly positive the portabello ravioli gave me super powers, the white sauce it was covered in satiated me to use my new found pasta powers for good, so I went home. ALSO they serve, and deliver the greatest five letter word in the English language P I Z Z A. Haven't tried it yet but I assume its great because everything these people do is great, therefore it's on my bucket list of things to eat before I die."}
{"text":"I came in for an early dinner. I ended up ordering the salad spaghetti meatballs. They also served me homemade bread is absolutely delicious The staff is super friendly and I got to meet the manager as well. I would deathly recommend come here even for lunch specials. I will deftly be coming back within the next month to have some of their delicious bread. Thanks again!"}
{"text":"The first time I tried this place I was randomly searching \"delivery\" because I was super lazy.  We ordered carbonara and beef ravioli.  Though it did take a little over an hour to get to us, someone was nice enough to call us and let us know, they also gave us a free dessert! Back to the food, a decent portion of both the pasta and raviolis.  The flavors were perfect, you know when pasta is not to salty and not to bland..its exactly like that. Not to mention the leftovers the next day were phenomenal.  So after eating the delivery I found myself thinking about this pasta all week.  Finally decided to look up its location, to my surprise my husband and I have passed by this place many times (its right in between Petco and Fry's).  I wanted to try the pastas at the resturant. My grandpa came with me and he usually eats chinese food so his food palette is pretty singular, he loved this place.  We ordered the carbonara and chicken toscana, the carbonara was as good as the first time! The chicken toscana was way too salty, however they were so busy I didn't want to send it back and wait, I had to be somewhere.  None the less this place is cozy and yummy!"}
{"text":"The food was pricey and not that great. There are much better italian restaurants a mile down the street. Our server, I think he was Mexican, was extremely rude to us. He literally tossed the bread basket on our table and just walked away. Never going back again."}
{"text":"Excellent food, great service.    Small enviroment, friendly staff.   Love eating in and also getting take out."}
{"text":"Stopped by this place for lunch and it was tasty!! I also read the negative reviews as I always do before choosing a place to eat from Yelp. I was greeted by the new owners which were very nice and welcoming. My wife and I will definitely be keeping Miele's in our back pocket when in the mood for some good, old fashioned Italian food!!"}
{"text":"Food was great ! People were so attentive and nice ! The appetizers were amaaaaazing , the bread was warm and good , the food was savory and delicious ! High recommendations come and eat here!! My family had such a great time here"}
{"text":"The bread was mediocre when it should have been mouth watering since it came out warm (so supposedly fresh?). I ordered a calzone with pineapples. The calzone was was huge and there was just a huge slab of cheese inside with canned pineapples inside. The marinara/pizza sauce was on side. When it was warm, the cheese oozed out, but after it cooled, inside was just a slab of solid cheese. Kinda gross. The gnocchi was mushy as opposed to soft and chewy."}
{"text":"Everything was exceptional. Try the pesto chicken ravioli. Also the chicken Tuscans was yuuummooooooo! Taking cannolis to go... Too stuffed"}
{"text":"These guys are still delivering consistenly good, fresh food.  It's a great little neighborhood place, good food, friendly owners.  Just a really good place to go for a nice meal out - nothing fancy.  Clean restrooms - always.  Good limoncello after dinner - always a hit!"}
{"text":"What a bummer. I came for lunch, and ordered a Hot Hero for something like 7.99. When a tiny sandwich, on a big plate found it's way to my table, I couldn't help but giggle. A little roll, with sauce, a couple slices of sausage, and some cheese. Taste wise, I give this thing a 2.5 out of 5. Portion wise.. a 2.. Service was service. Our waiter had no personality. I am curious about the dinner entrees, cuz that shit did sound amazing. Lunch was wack as f*** tho. I don't want to detour you from eating here, cuz I imagine the dinner is probably decent, based on other reviews I have read. Just don't get a sandwich."}
{"text":"We have loved this restaurant for many years now!  Their pizza has a unique and amazing flavor, the crust is super delicious and the sauce is great too!  It's our \"go-to\" pizza place and when we are in the mood to eat in and have Italian it's also a fav!  If we are ordering out for a big group, we also like to do a little combo of pizza, pasta and salad!  You can't go wrong here.  This location struggles to stay busy but I think it's just a \"hidden gem\" so hopefully more people will discover it soon!"}
{"text":"This is a truly authentic Italian restaurant.  I was a fan for years and unlike some of the eateries in town, when ownership changed hands, the quality of the food has remained consistently at a high level--  amazing white pizza and dinner specials never disappoint.  One of the few places that still makes food from scratch and the only place that has Peroni on tap.  Wine selection needs help, but other than that, a great place!!!"}
{"text":"We come here regularly because it's a block from work. But seriously, I think their alfredo has got to be the best in the history of the universe. I could live off it! We also typically get calamari and Italian sodas. And the garlic knots are ridiculous! Yum! The only thing I don't care for is the salad. Just not my style. But I can't complain. Everything always comes out super fresh and perfect."}
{"text":"A friend an I came here for dinner for the first time because we had a gift certificate. When we arrived we had about a 20 minute wait because the place was small and all of the tables were full. As we were waiting another couple waiting to be seated told us they were regulars and how fantastic the food was. We took this as a good sign and decided to wait and we were so glad we did!   The food and the service were fantastic. There were so many choices on the menu and I ended up with a chicken dish with artichoke hearts and a delicious wine sauce and my friend had the veal parmigiana. Both came with a salad, pasta and this unbelievably, amazing fresh baked bread. We were told that many of the sauces and dressings were made in house and they were very rich and flavorful.   The staff was helpful and attentive and didn't hesitate to give us recommendations on the food. This experience was great overall and I will definitely be back."}
{"text":"I went here last night for dinner with a friend. When we got there at around 7, it was busy, but we were able to get a table immediately. I think there are definitely some good and some bad things about this restaurant.  I really liked the bread and salad, and I thought it was kind of neat that the salad comes on a big share plate. I got the spinach ravioli and I thought they were fine, but needed a little more filling and a little more flavor. The sauce had a weird smokey taste, a little like sausage maybe, which made me think that they might not clean their pans well enough before cooking something new, but maybe the sauce is just like that....who knows. Anyway, it was decent, but nothing to rave about. My friend got the gnocchi (which the waitress pronounced 'guhnahchi,' which I thought was kind of funny (I'm a snob...huh?), and she said it was pretty good. So here is where it went from a fairly positive experience to a not so positive experience. We wanted dessert. Someone came out and told us they were out of the spumoni cake and that the chocolate mousse cake usually has some kind of sauce, but they were out of that. So my friend and I asked the waitress which was better- the tiramisu or the chocolate mousse cake. She says definitely the tiramisu because they make it in-house and not so much with the chocolate, so we go with that. A minute later she comes back and says they're out of tiramisu....really? It was friday night and not very late....they should be more prepared. We decided to get the chocolate mousse cake after being assured that it was VERY good too. Well.....it wasn't. I'm pretty sure they went to Fry's next door and bought a Sara Lee cake (but like...the knock off brand of that) and put some Hershey's syrup on top. I just don't understand why a restaurant would serve something of such poor quality and not JUST serve what they make in house (tiramisu) and make more of it..... further, we barely ate the dessert, but no comment or question was given by any staff members as to whether we liked it or not. That is so weak, not only was it a disappointment for me, but it made the whole meal and restaurant seem less appealing that it may have given the rest of the meal. I probably wouldn't make a special trip back here."}
{"text":"There's pizza. And then there's Miele's pizza.  Miele's raises the bar on pizza SO HIGH that nothing else compares. The intimate atmosphere is fabulous, and the service is stella. Always has been, always will be. The coolest thing about Miele's is that we've been going there since they opened, and despite all of the hulabaloo and press they're getting, they are still the same guys serving up great pies. No pretentiousness, no attitude. Just good Italian guys and great Italian food. Love it!"}
{"text":"On Friday I was here for women of Christ Aspire, I ordered pizza  and it is one of the best pizza I have ever tasted!   I love it !  Today I'm back withy hubby, we drove from Scottsdale for pizza  and drink a pretty reasonable price."}
{"text":"What a great find. We were in Tempe for a Volleyball Tourney and were looking for a nice dinner. My daughter came across this on Yelp and we tried it out. As soon as we walked in the door we were sold. Nice atmosphere, the smell of fresh baking bread and a table with comfy seats. My chicken parm was perfect, my wife's Margherita Pizza was delish, and the Peronni on tap was cold. I'll be going back next time we are down for Volleyball!"}
{"text":"We've been here for Lunch and Dinner, and haven't been disappointed. Starting with the friendly service and freshly baked bread, the dining experience is top notch. Today I had the freshest calzone I've ever had and my partner had the penne vodka pasta, both delicious.  This has become one of our favorite Italian spots in the valley, and we will definitely be venturing out here more often!"}
{"text":"Have eaten pizza here on several occasions; always terrific. Tried the gnocchi for the first time the other night; delicious!  Also, if the tv's too loud for ya, ask the man behind the bar to turn down the volume. When has Joe ever refused an accomodation?  Good for a casual night out for Italian. If you want something a little fancier, drive to downtown Chandler and dine at La Stalla; an excellent choice for a date night."}
{"text":"Second time there and I'll be back again!  Great service! Warm atmosphere. Delicious food!  Their table bread is addicting, chicken Marsala melting, and spaghetti and meatballs savory.  They have great marinara here!  High on my list. I felt guilty walking out of the restaurant, staring into the Bikram Yoga studio next door! (I go there, too)"}
{"text":"Oh wow- what a great place! You would miss it if you blinked, right between a PetCo and Fry's grocery. Small and cozy- we got there just before the dinner rush and thank goodness we did because it filled up fast.   Let's just get right to the food- awesome. The servings are pretty good size. I had Serjio's ravioli, which is a shrimp mixture. SO good. Kids loved the cheese and spinach ravioli, and husband loved the Gnocchi. Really good flavors. The service was also pretty decent. Great place, I would love to go back again! It's nice to find some great Italian food that isn't overpriced."}
{"text":"Miele's Bistro is awesome! Fantastic little Italian bistro joint in Tempe. The bread is to die for! It's made fresh daily and is some of the best I've ever had. The short rib raviolis were amazing! Great little spot! I will definitely be coming back soon!"}
{"text":"We are from out of town and visited because of the good reviews. We went at 7:30 on a Tuesday night and we were the only people in the restaurant. I had the linguini with clams, that was only ok with not much flavor but ok!! Others had the baked Penni and chicken scallopeini which again weren't bad but just lacking flavor. The menu was very limited for an Italian restaurant. The staff was very friendly and helpful. I would not return."}
{"text":"I really wanted to like this place since it's right around the corner and we're huge fans of Italian food.  But our waiter had a bad attitude right from the start. He made us feel unwelcome,  like we were a nuisance to him.  I can deal with that if the food and everything else makes up for it, but honestly, it didn't.    I didn't think the pizza was very good.  Maybe it is just not fitting for how I like my pizza, so just my opinion.  If you stick to ordering pasta and appetizers it will likely be a better outcome.  The bread, wine, caprese salad and tortellini were all pretty good.   My mother-in-law asked the waiter if he could dim the lights because they were too bright for a nice dining ambiance, and he said he would. However, it didn't happen. So my mother-in-law asked the waiter again and he said he told someone. Finally, after it still didn't happen, she got up and went out to the patio to ask the owner herself if he would dim the lights...voila, it happened instantly.  It just shouldn't be that hard. I really have no idea why the waiter had such a weird attitude, but right from the start it made us uncomfortable. Unfortunately, the overall experience did not leave me feeling like going back."}
{"text":"The restaurant was really nice. The booths are comfy and the lighting just right. The food was OUTSTANDING I love linguine & clam sauce if it is prepared right. When I ordered it I was wondering if it would be good. I am glad to say, the pasta was perfect, the sauce was seasoned just right and the clams were generous. The bread was great and generous. My husband had the veal and it was tender as a baby lamb (tee hee). I highly recommend you try Miele's."}
{"text":"My husband and I went to Miele's for our anniversary.  When we walked in the door we were greeted quickly and pleasantly.  When we told them we had reservations they asked if we were the anniversary couple..so nice that the hostess knew that!  We were seated and immediately one by one the staff stopped by to congratulate us.  The manager then came out with beautiful flowers and another set of warm wishes compliments of the owner!  We ordered the garlic knots..warm bread knots covered in little chunks of garlic..delicious!  Our meals were just as good.  My husband got the special a chicken breast covered in a bruschetta type salsa with a balsamic glaze.  The presentation was wonderful and tasted just as good as it looked.  I ordered fettuccine with the gorgonzola cream sauce, peas and olives....scrumptious!  The sauce was so creamy and tasty! The bread was hot, soft and fresh!  The atmosphere is cozy and welcoming and everyone was very nice.  They are getting to open up another location so they can keep up with the demand!  I can see why!  We will definitely be back!"}
{"text":"I had the Cavatelli Bolognese and my boyfriend had the chicken fettuccini Alfredo. It was very good, fresh and hot. One thing I would suggest to them is more garlic in the Alfredo sauce and use fresh grated Parmesan instead of the shaker container of it on the table. It's nice and quaint here. Service was very good too. We will come again."}
{"text":"Inexpensive delicious Italian food in a small and personable restaurant.  We tripped across Miele's in some 'best of' magazine article.  They were right.  This place is not showy, but it sure is right for dinner.  Your fresh bread will be brought out on a plastic dish, and you'll love it.  I also thoroughly enjoy and recommend the Lasagna.  I judge italian restaurants by this dish and Miele's is still the standard by which I rate the others.    If I owned this place the only thing I would do would be to add regular Ice Cream to the dessert menu, but that's the same knock on most italian restaurants.  No real ice cream."}
{"text":"This is a cute little family own Italian restaurant. Let me start by saying that their customer service is excellence. Our waiter showed up often to check up on us, constantly gave us refill on drinks and picked up the tables each time a meal was delivered. I really do enjoy spending quality time with my friends when I was here.   We start by ordering Garlic knot, Bruschetta, and Meat balls for appetizers. Garlic knot is very delicious and covered with garlic flavor like it was supposed to. Bruschetta is stack with pieces of tomatoes. However, the red sauce they use on the meatballs was a bit sour for my taste. Nevertheless, my companies enjoyed it. For drinks, I ordered a Irish cream Italian soda. It was delicious at first, but then it was a bit too sweet for me. Next time when I come here, I'll ask them to go easy on the creamer.   For main entree, I had a linguini with clam. They are very generous on the clam meat (basically covered with it) but was disappointed when I taste the sand in it. Overall, it is still a delicious meal.   I really want to order dessert at this restaurant but was so full after we were done. I'll definitely come back here again to try something else."}
