{"text":"Been to Mighty Skillet two times now and both times have gotten the golden age poutine.    This dish is simply delicious.  Two soft eggs over large wedge fries, covered in all melted cheese curds and slices of ham and smothered with hollandaise sauce!  Yum!  I love how the cheese curds are all melted, for me I can't stand when there's unmelted cheese in a pountine.  The soft eggs are a nice touch, yoke oozes all over the wedge fries making every bite more flavorful than the last, but then you get a bite with the ham and bam!  You're in brunch heaven!  The ham just adds the right amount of saltyness to the dish.    This food truck is totally worth stalking and the wait while they make your box of deliciousness!"}
{"text":"Stopped by last weekend for a lunch time eggs benny by the park.  I had seen the truck on TV, so thought I would have to give it a try.   I was a little skeptical about getting a benny in a box, but was pleasantly surprised!  I'm a big breakfast/brunch fan, so I admit I was a bit of an easy sell.  Traditional eggs benny over a bed of home style fries, covered in a delicious hollandaise sauce, what's not to love??  I would definitely go back again!  Oh, and I took mine across the street to the Starbucks, ordered a coffee and enjoyed both on their sidewalk patio.  Made eating my meal a little easier at a table.  And got to relax afterward with my coffee!"}
{"text":"This truck is a sneaky way to lure me in.  Appealing to my nerd side by plastering your food truck with comic book heroes is quite the marketing scheme.    The majority of the truck seems to base itself around the particular brunch ingredients of eggs and hollandaise.  I decided to pick their version of one of my food loves.  Their Golden Age Poutine is made with potato wedges, back bacon, cheese curds, 2 eggs and hollandaise sauce garnished with chives.  They didn't skimp.  It was big, filling and delicious; Definitely worth the $11 they charge for it.  I will be back."}
{"text":"The Mighty Skillet Food Truck parked by our building last week and we tried it and loved it!  If you love bennies, you will love this food truck!  We ate the Golden Poutine - 2 beautifully soft poached eggs sitting on top of thick cut potatoes fried to a golden crisp and nicely seasoned and cheese curds.  Beautiful yellow hollandaise sauce tops the dish.  Just dig in and wait for the egg to explode all over the poutine!  Very2 good!  We also ordered the Eggs Benny as well - basically the same as above but without the cheese curds but instead the eggs sit on your English muffins and comes with potatoes as well.    Of the 2, I like the Poutine one the best!  Very well done, Mighty Skillet!  Make sure you line up for THIS food truck!"}
{"text":"When you're eating breakfast for supper, what do you call it? Breaper? Supfast? Sunch? Whatever it is, the Mighty Skillet is the place to get it IMO.  The truck was parked in Olympic Plaza during Snowblower and I was in some serious need of grub before braving an evening of shenaniganary. Lonnie T was kind enough to head on over and order my food for me while I manned my station at the event. When he asked me what I wanted, I said: \"Surprise me!\" And so Lonnie went on over to the Mighty Skillet, and when asked what he wanted to order he said: \"Surprise me!\"  So really, I'm not sure exactly what it is I ate. There's no website yet for me to even look it up on, but it was a box full of shredded potatoes, toast, eggs and ham I do believe. The smell alone made my stomach rumble loud enough to make a passerby look up.   I wish I could say I devoured it all in one sitting. It was causing my tastebuds to salivate enough to want to do so. But the come and go of folks at a booth ended in a portion of that yumminess getting cold. Boo. The good news, those shredded potatoes in the bottom were still worthy of drool. The bad news... the toast was not. If you're getting breaky to go, make sure you'll be eating it relatively soon afterwards or you might find yourself with some soggy toast. Nobody likes soggy toast. Unless the guys on the truck have a little paper sleeve? Hey Mighty Skillet guys... paper sleeves? If you don't have any, they might be handy to have on hand... just in case!  Once my dinner was done, I kept catching wafts of other people walking by with boxes containing nom noms from the Mighty Skillet. How do I know? Because they each smelled exactly like mine. *stomach rumble* And I may have asked one or two of them (the people with the boxes, not the boxes) to confirm... and let them in on the fact that they were about to eat something so delicious, there's not even a name for it (at least not when you ask them to surprise you and nobody actually tells you what you got ;p).  The End."}
