{"text":"Excellent food! The Gyro sandwich was huge delicious. So glad we discovered a great restaurant nearby! Yum"}
{"text":"Amazing food and service. These guys know how to serve and create delicious Mediterranean food. I was here last night and had the Beef Shawirma sandwich with fries and it was really good however I'm not big on having lettuce in my Shawirma sandwich but I know now to tell them to skip the lettuce. While I was waiting they offered me a taste sample of other items however I was craving for the Shawirma and didn't want to take away my from my taste buds so I refused it in a polite way. The fact that they offered it to me was just awesome. I am back again today to try other things on the menu (not sample lol) Stay tuned for my feedback but in the meantime this is a must try."}
{"text":"Hands down best authentic shawarma in the whole state. Will definitely keep coming back, very friendly staff and clean restaurant, you can tell the owners take pride in there business. Love all the different choices on there menu. I'm so happy I finally found a place in the valley that can make shawarma the right way."}
{"text":"I typically don't write reviews, but this place deserves a raving review. I ordered a gyro and fries, it was a great portion, and the taste was unbelievable. I've had many a gyros, even the ones at the Greek festival weren't this great. Also, the service was very friendly and quick. Do your self a favor and eat at Mighty Gyros."}
{"text":"I've been here probably 2-3 times a week since I noticed it opened up near my house. Routinely friendly, fast, and delicious. 

And, this might be a downside but it is actually very important to me, there is not any forced small talk or pointless statements like, \"hot out, huh?\" Or \"you work around here?\" Or \"TGIF am I right?\" (Which is a weird thing to say In the service industry where weekends are busier than weekdays!).

I haven't settled on a \"regular\" order yet, but this picture is probably it. #1 with onion rings. 

Check it out. Eat a thing. Enjoy."}
{"text":"The food was so good!  We had the chicken kabob sandwich and the chicken schwarma sandwich.  So tasty!  The garlic sauce was amazing.  We also really enjoyed the lentil soup!  So nice to have this in our neighborhood!!"}
{"text":"My first time trying Mediterranean food and I definitely loved it! Will be coming back again :) my falafels were amazing and the food was of great quality. The customer service was really nice and management was nice as well."}
{"text":"The food here is amazing especially the Gyros. There is plenty of meat inside the sandwich unlike most places. And everything is fresh. The employees are attentive and very sweet! This is my second time coming here and there will be plenty more times to come! Love it"}
{"text":"I live down the street from this place and every time I drive by the employees (or owners?) are standing in front of the door smoking! Not just one person but 2 or 3.... I went into the business next door today and had to walk through all their disgusting smoke!! They've already irritated me before I have even walked in the place. Have some respect for potential patrons and step around the corner to smoke. Please......"}
{"text":"Was pleasantly surprised to find a very generous portion of steak in my shawarma sandwich. Everything about this place was great... great customer service, amazing garlic sauce, great price... highly recommend!"}
{"text":"Nice clean place, I ordered the combo plate with steak and chicken shawarma and my daughter ordered the gyros and we also got a salad topped with chicken shawarma. I wanted us to taste everything and it was pretty good. They gave us plenty of sauces and pita breads. I'd definitely recommend this place... just wish they would play Assyrian music instead of Greek."}
{"text":"YUM! Loved this place! Nice, clean, friendly and fresh!"}
{"text":"Family atmosphere, very clean, good food and prices are reasonable. Gyros combo menu is worth going back for!!"}
{"text":"Out for lunch at Mighty Gyros. Awesome! Great food. Roomy and clean and close to home."}
{"text":"Excellent service, friendly staff, excellent food. Sharma meat was excellent. Excellent for eating in ot take away. Fresh ingredients well seasoned and cooked meat."}
{"text":"We came for lunch and we were not disappointed. The food was so delicious. I am happy to say I found a place to have some really awesome mediterranean food. The restaurant was clean and the staff was very friendly. Stop in and give them a try. Best baklava in town!!"}
{"text":"Awesome gyros, great fries, and chicken shawarma!  Friendly staff. We will definitely be back!"}
{"text":"Mighty Gyros catered our son's high school graduation party. The food was amazing and everyone loved it.  The weather was hot so the food was perfect.    It was a nice change from the traditional fair. Great prices lots of food I highly recommend.     The baklava is amazing . Thank you Fred and Sam!"}
{"text":"Food is delicious. Staff is super friendly and welcoming. Exactly what you want and expect . Awesome place !"}
{"text":"We tried this place out on Sunday 4/22/18. Ordered quite a bit of food and was sadly disappointed. The sauces were just okay and the meat was dry and not flavorful."}
{"text":"Get your \"Mediterranean On!!\" Super fresh and fantastic flavors. Great service, clean and open. Good location, easy to get in/out. Now get in there and eat!!"}
{"text":"Tried this place on a Sunday night and honestly was shocked by all these great reviews. We had a gyro plate and chicken kabob plate. The chicken was extremely dry. Tried to dip it in some \"garlic\" sauce which honestly looked and tasted like nothing more than mayonnaise. Not at all what we were expecting based off of reviews on here... maybe we went on a bad night but based off this experience not sure why anyone would go back."}
{"text":"Mighty Gyros has very tasty food. I ordered the #3 steak shawarma gyro lunch special and got 15% off. It was very yummy and perfect for lunch after a long morning of classes or work. I was happy with the kind and friendly service. I will be back! Thank you!"}
{"text":"Very good falafel! Not fried to death and dry, but moist and flavorful! I do not care for lentils, but their lentil soup is another story. Consistency of split pea soup and very well done. I can't wait to try their hummus. Staff was friendly and attentive. No complaints whatsoever!"}
{"text":"Stopped here before an appointment around the corner. It turns out this is their first full day open. I love chicken shwarma, but when I learned it was day one, I was a bit apprehensive.  I ordered the chicken shwarma sandwich as a combo, with no lettuce, tomato or onion. Fries were a part of the combo and they've Coke products so I was happy.

Look, if I wanted a salad, I'd order a salad. 
Don't judge me on my vegetable intake.

I'm easy, just meat and sauce stuffed into a pita.
I asked for the fries well done because I'm that guy.

While waiting, I was offered a cup of their lentil soup to try. It was super good. I don't know that I've had more than a taste of lentil soup before in my 47 years around the sun, but I'm glad this was my first real experience with it. Nice consistency and great flavor.

Before I could finish, my food came out. 
This was a large amount of chicken stuffed into this pita with a good amount of garlic sauce dolloped over it. Seriously, it was a ridiculous amount of chicken and they could probably cut back a little, but don't tell them that. 

It was absolutely delicious and I ate the whole thing.

The chicken was both white and dark meat and seasoned perfectly. They nailed their sauce. I know, it's garlic sauce, how hard could it be. We've all had the bad garlic sauce and it was great to see them get it right. The pita was still hot and filled with delicious chicken and sauce.  No veggies in sight.

The fries had a good seasoning blend on them and were crisp as I'd asked for them well done. My son was with me and halfway through the shwarma, they brought over another basket of fries as we'd demolished ours.

Super polite staff, they seemed happy to be there and were obviously attentive to their customers."}
{"text":"Excellent food, excellent service, hands down the best Mediterranean food in the North West Valley. Glad I stumbled across this find, definitely will be coming back-- prices are very fair too."}
{"text":"Before you read my comment, please know that I don't write food critics to every restaurant I have ever been in unless the foods are absolutely mind blowing. The foods at Mighty Gyros were amazing. I bought number 7 and 12 for to go. Honestly at first  I kinda expected the foods to be the same like every other Mediterranean places in Glendale. However, I was wrong. The foods were so much better. I strongly recommend this restaurant to all of my friends at school."}
{"text":"The gyros here are really good. They use a lean mix of well seasoned lamb and beef. The pita was warm, soft and stuffed with gyro meat. The tzatziki sauce was creamy and delicious. The only knock was the steak in the steak shawarma was dry. Although it is well seasoned and the garlic sauce very good."}
{"text":"An above-average Mediterranean restaurant. Amazing service, very family oriented. Lots of menu options, including some vegetarian and vegan ones. The portions are good size, especially the combination plates -- generous but not enormous. The falafels are tasty and most importantly are not at all dry like at some places. We're definitely going back!"}
{"text":"My new favorite place. Best chicken schwarma I have had in Phoenix. Wish it was a little bit more tender but otherwise very flavorful. The portions are huge and their garlic sauce is amazing. Definitely will be going back soon."}
{"text":"Best Falafel in Phoenix!  Chicken Shwarma was also very good.  Prices reasonable.  Staff friendly.  Will be back soon!"}
{"text":"Really great experience- excellent food- excellent service!  Favorites- chicken kabobs, jalepeno hummus, beans.  We'll definitely be back!"}
{"text":"What a fun place!!! Great customer service!!! Super flavorful!!!! Highly recommend!!!!! So delicious!!!!!!!"}
