{"text":"My brother visited me in Champaign and we were craving some sushi. With his friends, we went to Miko. The server was very nice, asking us if we needed anything occasionally. There were Korean, Japanese, Vietnamese dishes available. I ordered the Hwe Dup Bob, which was bowl of rice mixed with sushi, vegetables, and spicy sauce. My brother ordered spicy tuna roll, unagi roll, and salmon roll. Food came out rather quickly, which was a plus. It was delicious. I tried some of the rolls that my brother ordered and they were also tasty. I especially liked the spicy tuna roll. The price was excellent! My brother paid."}
{"text":"Probably some of the best sushi in Champaign. Sunday and Monday now offer $1 sushi. I have never had a roll here that I didn't enjoy. The owners are super nice and go above and beyond to make sure you have an enjoyable experience. It's not the best looking building, nor do they have the trendiest decor, but then again, you go there to eat! And that's something they do right, every time!"}
{"text":"When I went, it was completely empty except for one other small party. The service was great, everyone was very nice. As for the food... They don't offer $1 sushi anymore, but I ordered a roll anyways. It was only okay. The rice had been sitting out, and the shrimp tempura wasn't hot or crispy anymore. The entree prices were much higher than we wanted to pay for dinner, so I split the chicken fried rice with a friend. It was flavorless and I think the chicken was frozen and boiled. The rice did come with a few sides of kimchi, which was great if you like kimchi, but not an acceptable substitute for seasoning and preparing everything else correctly.  I wanted to like Miko, it's nearby, and I remember going once during 50% off time and it was fine. But now, it's completely not worth the price."}
{"text":"Like other reviewers, I agree that Miko's has gone way downhill.  I had been there once before a few years ago, and I remember enjoying the food and the place.  This time, I thought everything about my dining experience was pretty bad - bad tasting food, expensive prices, and boring teppanyaki \"show\".    The sushi was terrible.  After waiting for 30 minutes (and the place was empty), my fiance's sashimi came out .  It was not worth the wait as it was super fishy tasting.  He thought that it came from the freezer, yuck.  I had a big roll, which in my opinion, was definitely not \"big\".  The only big thing on it was the many layers of tempura batter.  I felt like I was eating all breading.  I also did not like that the little bit of unagi sauce on the roll had carmelized before gettting to me, weird.  Even though the roll was half off, I felt it was over-priced for the 6 small pieces that I received.    Since we were with a large group for a friend's birthday, we also had teppanyaki.  We received salad (gross dressing!) and egg drop soup (ok).  The rice that the chef made was pretty good, though very heavy on the onions.  He also gave us a cream sauce that reminded me of honey mustard.  While I liked the sauce, I don't feel it went well with anything - maybe I could have used it on my salad to improve the taste!  The chef putting on our little \"show\" was uninteresting, awkward, and boring.  For my meal, I split the filet and shrimp with my fiance, and even the shrimp tasted too fishy.  I'm sure this is standard, but I had to pay an extra $16 to split my fiance's meal.  Everyone assured me that it was worth it because of all the food I got....hmm....I don't consider a small bowl of soup, a crappy salad , and some rice to be that much food.    Everything about the experience was negative.  I struggled with giving them one or two stars.  In the end, I went with one star because I honestly will never return there.  While I've rated other restaurants as twos, I still have hope that maybe sometime I will return and my experience and food will be better....but everything here was so overwhelmingly negative, that I really don't think I will ever go back.  Sad."}
{"text":"My fiance and I came back to Miko's after I raved about the food and \"great\" prices. He pointed out that it wasn't that great of a deal to have extremely high prices and then to say it's \"50% off\" when it is then considered a reasonable price.  They messed up on my entree twice!! Luckily my waiter was super accommodating and nice about it, and ended up not charging us for the entree. It was the Masaman chicken, which I had previously said was SOOOO good. Well, this time they left out nearly all of the veggies that the menu claimed that the entree had. When I pointed this out, the waiter took it back, and when it came back the second time, the only thing that was different was that there were now cashews!! Dumb!!"}
{"text":"Went here for the lunch buffet and was totally disappointed, only to be surprisingly more so when I was handed the bill. There was a lot of selection, I guess, but I couldn't tell what anything was because it was so freakin' dark! I just basically spooned a bunch of different stuff onto my plate and hoped for the best, which was a mistake. Only about half the dishes were any good, and most were cold. There's also a buffet of different rolls. Those were so-so. I suppose if you ate a ton of rolls it might make up for the buffet's price. All in all, I give it a big 'meh.' It's okaaaaay. Nothing special, and I won't be going back."}
{"text":"The food was good but definitley expensive. If it wasn't for the 50% off, I don't think I would go back.   But again, the food was good. My friend ordered the Bul Go Kee (Sliced NY strip marinated in soy,garlic, and Korean spices, then charbroiled to perfection) which was seasoned really well. This came with a side of rice.  I had the Ya Chae Gob-Dol (Rice with assorted vegetables and steamed tofu in a hot stoneware bowl. Stir it up with hot sauce, served on the side.) I had cellophane noodles instead of the rice.  This was a pretty funny story. At first I asked our waiter if I could have noodles instead of rice. He veeeeery hesitantly said...\"Welllll I don't know...I'll have to ask the chef...\" We couldn't understand why they couldn't just put noodles on the bottom instead of rice. The guy was hilarious though. He was so awkward about it, but in a cute weird way, not a mean \"I don't want to do it for you way.\" It turns out that because the pot is so hot, he didn't know how the noodles would hold up to the stone pot. The chef said they could do it so I was happy :)  The service was okay. There was only one guy working. He was nice though. Didn't refill my water though."}
{"text":"I really cannot say better things about Miko because I really love their food and they helped out our student organization with a major Asian food fundraiser. I can assure you though that my opinion about the food is unbiased.  I've gone to Miko twice now for their lunch buffet, and really like their offerings. They have sushi rolls (some raw and some fried), seaweed salad, miso soup, spicy soup, chap chae, sugar donuts, orange slices, salad with an Asian-style dressing, a really good sweet chicken akin to sweet and sour chicken, and either seafood, pork or chicken kalbi...all for under $14! The buffet runs from Monday through Saturday between 11:30 am - 2 pm. I particularly crave their chap chae.  They also do teppanyaki for weekday dinner, Saturday dinner and all of Sunday. I will have to go back for that."}
{"text":"Miko may not be the best, but if you're going to eat there, you should best do it soon--the 50% off sign on the side of the building does not bode well for the restaurant.  I went with a visiting friend last week to finally check Miko out, and was pleasantly surprised.  The sushi is entirely adequate and teh Dragon roll was indeed quite good.  There's a varied array of Japanese, Korean, and Vietnamese food available, which seem delightful if not extremely special.  The space is large and friendly, yet it was made much more spacious by the lack of people there on a Sunday night.  I enjoyed my chicken katsu (a bit dry, but okay overall), and sushi while taking in the slightly austere decorations (and super cool fish tank).  The only thing that made it truly surreal?  The love of the cheesy movie soundtracks.  Primal Fear.  Titanic.  Star Wars. 2001.  All of the pivotal movie scores swelled serenely, lending our conversation an entirely unnecessary gravitas.  In fact, you all should try it--talking about grocery shopping is incredibly portentious when done to \"My Heart Will Go On\" or \"Flight of the Valkyries.\"  One big note: Miko's price.  Thank God everything is now half price, which now means that things are *normally* priced.  Otherwise, you'd have a restaurant offering decent food for exhorbitant prices.  Now, you have a restaurant that serves decent food for decent prices in a decent setting.  In a word, decent. In two words, good sushi. In three words: Celine Dion sings."}
{"text":"ew. the food is decent and highly over priced.    Secondly, the service is poor.  When we walked in, no one was in sight.  We weren't seated for 10 minutes before someone happened upon us, and the hostess FINALLY walked out.  She seated us, took our order in her broken english.  We had a hard time communicating, and my order came out all wrong.  When i pointed this out and said I shouldn't be charged the amount I was charged, she told me, there was nothing she could do...so I basically paid double the bill and she brought the chef out to yell at me.    Thirdly, my experience was so bad, i would recommend that NO ONE should go there ever!! AVOID AT ALL COSTS!!!!"}
{"text":"Worst dining experience I have EVER had in my entire life. I would never recommend anyone go here. Read Tom S.'s review bc the exact same thing happened to me.   AWFUL!  Although, I refused to pay the incorrect bill and they finally fixed it for me.   This place and KoFusion are a JOKE."}
{"text":"Just plain bad, overpriced food. When I started eating here in the 1990s, they were ok. The Korean dishes were quite good. But since then, the prices keep going up and the quality of the food and service keeps plummeting. I haven't gone here in years because the food was so inconsistent and overpriced. I'm amazed they are still in business."}
{"text":"Miko is the predecessor to KoFusion, and quite honestly I prefer it.  You can get great Korean, Japanese, and Thai entree options plus sushi, and both aren't nearly so pretentious as its downtown alternative.  The fish is always fresh which makes up for the somewhat greasy and heavy-tasting entrees. As Korean restaurants are notorious for side dishes of different kim chis, the Korean owners have made no exception for this upscale restaurant.  Look forward to delicious varieties of kim chis and other samples to be shared among your party."}
{"text":"Very disappointed by the service. We were four of us and the restaurant was almost empty with just one more party in front of us. They took almost 45 mins to get our order. But I should say.. that food was great! If you are really looking to lazy around and eat some good food, Mikos is the place. But I won't be going there again."}
{"text":"We eat here on a monthly basis and we have had positive experiences every time we eat here. The service can be a little bit slow at times, but overall they do well. The owners also work in the establishment so they always do everything to make sure you are happy. The food is good and moderately priced, it is worth a trip to check it out."}
{"text":"In fairness, I used to work here, so I have a huuuuuge fondness for this place.  It's been a few years, but last I checked - delicious sushi, and unpretentious entrees.  The bulgogi was always my favorite.  I just liked the simplicity of this place - the food was authentic and delicious every time.    Some of the teppanyaki chefs were better than others - but when they were good, they were amazing.  Especially for central Illinois....I mean, come on!  Also, it was a great place to work.  So laid back, so much fun.  I have no idea what it's like now, but last time I checked...."}
{"text":"I don't think I share the opinion of the other reviewers.  It looks okay.. but not super trendy.  This place is a ripoff and the food is just not that good.  The teppan is okay.. but they dump a bunch of sweet and sour sauce on everything.  The lunch buffet is not that good.  The Korean dishes are okay but I think I would rather go to B Won.  The sushi is okay.. but really expensive and not that good.  I would rather go here than Ko Fusion but that's not saying much."}
{"text":"Service was very slow. We were the only patrons and yet it took them 45 minutes to give us our food.  They served in intervals instead of all at once.  We were forced to watch some people eat while our food was still being prepared. Not recommended!"}
{"text":"Miko is a great place for a meal. They offer pretty large portions for an affordable price, and the service there is very nice. Their menu also has an impressive variety of dishes, ranging from sushi to larger entrees like budaejjigae (spicy stew)  Their teppanyaki was also very enjoyable. There are many dinner options available (chicken, steak, shrimp, or a combination of those). Not only was the food tasty, the chef had a great sense of humor.   Miko has become one of my favorite local restaurants, and I would definitely recommend this to my friends"}
{"text":"really bad lunch buffet. very small choices of sushi and they seem like they have been left out for a while. the owners put in a lot of korean food that's not cooked very well in their lunch buffets. It doesn't really seem like a japanese restaurant... and it's really dark inside with very few people so it was kind of awkward eating there... BUT it was really cheap and the owners are really friendly.. however i will not go back for the lunch buffet ever again"}
{"text":"Horribly disappointed. I made reservations for 7 for the teppanyaki or whatever. Walked in at 7:03, they told us we'd have to wait. I asked how long, and she said that a table was just finishing up cooking. I looked at her with an \"are you serious\" look on my face. Ok so that table would still have to eat, maybe eat dessert, sit around for a bit, THEN pay! After talking in Japanese or something to the owner, they brought us to a table and stuffed us in the corner. The table was already full of people who were halfway done with their meal (soup and salad and the chef was on the way out). My boyfriend and I looked at each other and walked out. What is the point of a reservation if #1 we'd have to wait or #2 they seat us at a crowded table that's already halfway done with their meal? Terrible. Will NEVER return, will NEVER recommend, and will discourage others from going. Thanks Miko's!"}
{"text":"Miko is possibly best described as a laid-back version of KoFusion, which is unsurprising since it is owned by the same group of people.  Miko has teppanyaki though, which I guess sets it apart.  Also, the \"Champaign Roll\" at KoFusion is called the \"Urbana Roll\" at Miko (since KoFusion is in Champaign and MiKo is in Urbana).  Hilarious!  It's wierd that I think I actually like Miko better than KoFusion, because it is more laid back, but I go to KoFusion much, much more because of the $1 sushi.  The staff at Miko has always been friendlier than at KoFusion, for whatever reason, but the bar is not as good.    Anyway, try the Dragon Roll.  Top Notch"}
