{"text":"Rarely have I ever been as dissapointed with a restaurant as I was with Milanos. The service was fine, the wedding soup was good, but after trying the lasagna I ordered there was no doubt in my mind that I was eating Stouffers Lasagna. I ate tons of the stuff growing up, my parents used to buy it by the case at the Stouffers warehouse so I know what I'm talking about. Please brimg back Sambo's"}
{"text":"Agree with the other review here about bad service an bad food. Don't know how a place that specializes in \"Italian\" food could mess up pasta...how on earth do you mess up on pasta? 

I'll start with what I ordered. We got a sautéed calamari appetizer. Thumbs down. Tastes like calamari boiled in the jarred pasta sauce it was served in with some zucchini and spinach thrown in. Yuck. Didn't finish it. My Caesar salad lacked flavor and the dressing tasted funny. My entree was simply scallops on angel hair pasta with olive oil and tomatoes. When it arrived it was a plate full of some noodles that didn't resemble angel hair but those rice noodles you get at Vietnamese restaurants. Looked really clumped together. And man was the taste bad...the more I tried to eat the worse I felt. I took maybe 5 bites and when the waitress came back she asked if I wanted a box. Nope. Plateful was sent back. Thank goodness I had a nice tall beer that helped fight off hunger pangs. 

And the service? Took forever. Wow. Half of our party's food was served while the rest of us waited another 20-30 minutes for our food. Slow service. Didn't deserve the gratuity they added. 

Not worth the prices for the lousy and slow service and god-awful food.

Just stick with regular bar food, guys. Maybe you'd get more business that way."}
{"text":"I've never had such a terrible dining experience. 

My grandmother decided that she absolutely had to go to Milano for mother's day. (which I thought would be an upgrade from her usual request - The Olive Garden) It seemed promising. The menu posted online listed seemingly delicious sounding Italian and Greek fare. Despite the fact that I can name the half dozen businesses that have occupied this space in the past 10 years, I had high hopes for this restaurant, especially after Grandma told us she'd read a great review in the local paper. 

Let's start with the service, shall we? I think there were 2 servers and a busboy manning the restaurant. I could see maybe half a dozen parties seated throughout the restaurant, along with a few bar patrons. (the bar patrons had the right idea - they saw how slow the service was and left) Not an overwhelming crowd by any means. But it still took nearly a half hour for a waitress to greet us and take our drink orders. (had Grandma not been so intent on staying we would have gone anywhere else!) It took at least another 10 minutes to get our drink orders. Did someone take our order immediately after that? Nope. My mom had to get up and track down a waitress. And did said waitress rush over to take care of us? Absolutely not. She sauntered over 5-10 minutes later. 

Once we placed our orders, the service was ok. Our waitress was nice but not overly attentive. I ordered what ended up being a bland pasta dish, and I can't say that anyone at the table was wow-ed by their food. Perhaps if we'd been able to drink (no Sunday liquor! in a place that has a huge bar!), we would have been more patient or would have enjoyed our meals more. 

There's no excuse for such poor service and mediocre food. Avoid this restaurant!"}
