{"text":"They have the best breakfast sausage. Come here often for breakfast because the coffee and food is good.  Service is usually good only had a problem today trying to get seated.  Busy place and local fab."}
{"text":"Its an old peoples restaurant.  The food is okay.  The honey fried chicken is wonderful, but a lot of their other items are on the bland, came out of a can side of taste. I've been here many times with my grandparents and now parents.  The specials are good. I don't ever choose to eat here, but I won't refuse to go either."}
{"text":"Decent home cooking local restaurant.  We have eaten here several times. It is always clean, the service is good,  and it is affordable.  I like it here,  nothing remarkable,  but just a nice place to eat that us not some annoying chain restaurant."}
{"text":"While in town I met a cousin at Mimi's. We met just before noon & I was happy they serve breakfast all day long. Mimi's is a typical family diner. Nothing fancy, with a very diverse menu serving local ethnic favorites & regular American diner fare. There is a big sign in the window boasting of their corn beef, so I was disappointed to learn the corn beef hash was out of a can. My cousin had the soup & salad bar.  I'd suggest providing folks having only soup & salad a full size plate for the salad bar vs a small salad plate. I enjoyed my breakfast of a corned beef (fresh not canned) & Swiss cheese omelette that I had them add sauerkraut to & nice crispy home fried potatoes. Service was neither good nor bad. Would I return? Sure if I'm looking for a place to meet at with comfort food."}
{"text":"Decent food, great service. My boyfriend and I have been checking out local diners and came upon Mimi's. I was surprised to find how big it was inside! Typical local diner with a little outdated decor, but nothing too drastic. Although, the neon lighting on the ceiling did throw me off... it just didn't mesh well with the atmosphere.  It was a little busy so our server was nice enough to bring out our toast first as we were pretty hungry. I ordered the gyro slices and it came with two eggs and homestyle hash brown. My boyfriend had the corned beef and hash with scrambled eggs. Nothing too special. We've definitely had better. The gyro slices were a little thin, but there are a few pieces to satisfy anyone's hunger. My boyfriend wasn't too happy with his dish. I tried it myself and the corned beef was a little dry.  I really liked our server, Zaida. She was super nice and even gave us a coupon for a buy one get one free lunch. We just had to order drinks with it, which I noticed seemed a little steep. I didn't mind as much since we did get one of our meals for free. The tab was already cheap to begin with, less than $20 for both of us. I'm a stickler for attentiveness and they're pretty good in my book. Whenever Zaida was busy with other customers, the other servers made sure we were taken care of. We might come back at some point and try their other dishes."}
{"text":"Mi-Mi's is what it is. I've ate here several times and each time its the same type of experience. I give it two stars cause there just isn't much to it. They have tables everywhere cause they pack the people in here. As for the food, nothing fancy here. The service is always good, the food comes out super fast and its cheap. I guess I don't have anything bad to say about it really, there just isn't anything to the place, nothing to get excited about.  The old timers really love this place and often times it looks like heavens waiting room."}
{"text":"Debbie was our server. She was polite and helped my son with his coat zipper when it got stuck. Wait time was fine. Food came in about 10 minutes. I had the corned beef omelet and it was great. A bit too much butter on the toast. Grits were not good at all."}
{"text":"Mimis is the only place in town I can get a good veggie burger. They have crazy amounts of food for vegetarian diets and I'm sure they have things for vegans as well. I love Mimis, everyone is always awesome and so nice. I go so often my favorite cook knows what I want on my burger before I even ask. I couldn't ask for a better staff or better food. I love them to bits. If you can go to mimis always go to mimis."}
{"text":"It was ok until they raised there price for this 2 star food.   Did mind the quality for the price before.   Now that there prices are higher there no reason to go there for c- food  The drinks were 2.25 for adult and kids drinks."}
{"text":"The corn beef in the omelet was all fat and grizzle. The guy sitting behind us was belching the whole time and a crazy old man was running from table to table telling jokes. This was at 8AM on a Saturday morning. Plus the service was terrible."}
{"text":"Coffee really weak, toast cold with butter not melting on it. How do you have toast and not allow the butter to melt.  You should be ashamed of yourself. home fries so so, $.99 breakfast is actually 3 to 4 dollars after you add a drink and meat. Inside the restaurant feels kind of dirty.  The carpet looks tired and tables weren't the cleanest."}
