{"text":"This place doesn't look like much from the street. If I hadn't seen the yelp reviews I probably wouldn't have eaten here. Excellent food, and friendly service. Their soup is my favorite. If you order it as take out you get the piping hot broth separately from the noodles,  vegetables, hot sauce and herbs. Then you can combine them however you like. Yum!"}
{"text":"The shrimp on sugar cane search has not ended here.  The sugar cane was so small that it was hidden in the shrimp (which I didn't notice through 3 slices of the shrimp(?) mixture.  Interesting idea but more successful theoretically than practically.  The grilled pork was fine.  Despite the many pictures of mint, there was no mint/basil/coriander or peanuts on the dish.  The spring rolls were a little undercooked and more mushy than noodle-y.  The avocado shake was good-creamy and not-too-sweet.  Overall the place was okay, but not good enough to go back."}
{"text":"First Yelp review. I've used Yelp many times before to read reviews ... But never wrote one myself until now .    I have ate pho at many places some good some bad , but this little restaurant does it really good... I ordered the shrimp wonton with egg noodles (N03) . Very very tasty broth. Nice size shrimp wonton tasty as well . We also order deep fried spring rolls , they were golden crispy and filled with goodness ;-)Friendly clean place to eat. I will definitely be back ."}
{"text":"Lovely little place, good food & nice people. Stick with the lunch specials if you're in a hurry. They are good, fast & inexpensive. Delving deeper into the menu is just a little more expensive & can take a little longer if they're busy but it's well worth the exploration & the time if you're not in a rush. Try the Mint Garden Special Vermicelli for a filling selection of the flavours typical of this restaurant. The appetizers are good too. Definitely worth a regular lunch date."}
{"text":"Seems like a family owned restruant, very nice and friendly owner. The fried calamari was amazing, pho was good too. Had the pho with rare beef and beef frank, it would be nice if it had beef tendons too. But overall nice small restruant with a nice environment.  This is hands down the best Pho in Newmarket! The soup is just AMAZING!"}
{"text":"Can't beat the price of the lunch specials!  There are 4 options at the $6-$7 range that seem to keep the locals coming back.  I have had the Pho (rare beef), and it is always done well.  The specials can be a bit dry at times.   Also on the menu are more Chinese faves like the Shrimp Wonton Noodle Soup, with either egg or rice noodles.  Flavour is great, portions are good, and price is right.  The place is small, and it packs up at lunchtime from the larger local businesses, so get in early!"}
{"text":"We were in the area heading to the mall and just used good old yelp to find a quick good meal. Lucky this place showed up with such high ratings. From the outside, it looks really small and just off to the side, but it's actually really nice and cozy inside. It's spacious enough that you aren't really close to those who might sit next to you and it's clean and bright.  But enough of the decor. The food was great! We got the regular pho which wasn't anything too special but it wasn't bad. It's a decent portion with a strong broth. We also got calamari which I think was good but I don't know if I like my fried calamari with a sweet and sour dipping sauce. When in Vietnam, you kinda have to expect that sweet and sour flavoring though.  I got the mint garden special vermicelli per Yelpers recommendation and it didn't disappoint. The grilled meat was a bit tough but I liked the flavors. Very fresh :)   I'm a bit picky about Viet food just because it's literally everywhere and sometimes it's really just noodles in soup passed off as Viet pho. But I would return here :)  Service by the way is amazing. Really friendly! Gotta love a family establishment!"}
{"text":"Mint Garden is a nice little place in Newmarket that serves decent pho at a decent price. Given the options nearby, it is one of the few restaurants that serves authentic and tasty asian food.  Price: 3/5 - if i recall correctly it was $9 (maybe $8) for a large bowl of pho. This price is comparable to other restaurants in the GTA in terms of price.  Food: 3/5 - i got a large bowl of pho with rare beef. The pho and soup base was good  and so was the beef, which was pretty soft. My only complaint is that i did not get much beef at all. If you see my picture attached to this review, you will see it is literally about a handful of beef, probably less.  Service: 3.5/5 - the waitress serving the restaurant was nice and polite, and even asked me how my meal was after (which to be honest, is quite rare to see nowadays). However, there was only one waitress serving the entire restaurant and that made service just a little slow.  Overall if you like pho and you're in Newmarket for lunch or just hungry, this place is worth a visit"}
{"text":"Came here for lunch with friends after reading good reviews on Yelp. There is Only the cook and the waitress so service was very very slow. Waitress had to run in and out of kitchen. Had customer waiting for takeout food that was called in already. Waited 20 mins b4 our food came. The worst food I have ever eaten in Newmarket. Not authentic what so ever. I would give 0 stars given the choice. First and last time here."}
{"text":"I'm not going to lie, I only even come here for the pho - but it does not disappoint.  This small, family run restaurant is particularly unassuming, and we would have all but ignored it had we not seen the reviews. I am glad we decided to stop in because this is now our go to for all things pho :)"}
{"text":"Recommended from coworker. I had the lunch special grilled chicken with steamed rice. The chicken was a bit burnt and a bit undercooked on the inside (I'm a bit paranoid about these things, so it could be just me) but the spring roll that came with it was really good! Price was about $8 after tax and tips."}
{"text":"BEST PHO IN NEWMARKET!! We have been passing this place never giving it a try but we finally did & so happy!!  Family owned, with local clientele and very casual.  We ordered the vegetarian roll with cashew sauce (no peanuts there due to peanut allergies so safe to bring kids) the vietnamese rolls were excellent & we both had the beef pho which was very delicious & flavourful.  We will be back as found a hidden \"pho\" gem in Newmarket that's authentic & legit!!"}
