{"text":"This is the best fish and chips place in Mississauga I've been to. I've only had their halibut and chips, and stick to it, though I'd eventually like to try some of their other fish (if I can get past the halibut!)  I've only ever gotten take out here but it is served pretty quickly and properly for fish and chips, in a cardboard box. I can't stand places that use styrofoam as it makes the fish soggy. Thankfully, these guys do it old fashioned!  Their fish is lightly battered and crisp. The fries as delicious and obviously fresh. I also believe they are double fried.   The home made tartar sauce is good, though they usually give you the packets with your to-go bag, I would like their homemade stuff! It's much better!"}
{"text":"I've come here a handful of times, and each time it's just a stellar experience. The restaurant itself is very bare-bones--nothing fancy happening here, decor-wise. But the service is phenomenal, and the fish and chips is the best around. I don't crave fish and chips often, but whenever I do, this is now the only spot I'm going to."}
{"text":"My mom and I returned from our visit to London, determined to find the best fish and chips back home. It's been a few months, but we finally got a chance to start our fish and chips adventure.   Our first stop was the Mississauga Marketplace Fish & Chips, which seems to be the most popular in the city. We were here last Monday around noon, and we instantly noticed there were quite a few people in and out, ordering takeout, and others appeared to be regulars enjoying their lunch break.  A simple restaurant with a simple menu, and minimal waiter service. However, it was quick to order and pay, and the servers were friendly. Because it's fried to order, we waited a bit for the food to arrive at our table.  We ordered the Haddock & Chips Special, which comes with a side of coleslaw and a drink, plus an order of Cod. I personally liked the haddock better because I love eating firm, chunky pieces of fish (especially when it's fried) and it had more texture to it. The cod was softer and pieces fell apart the moment I ran my knife through it. Both fish tasted fresh though, the batter was also light, and the tartar sauce was delicious.  The coleslaw was all right. The fries could have been better...  Onto the next fish and chips shop!"}
{"text":"Our search for the best chippie tea continues. This place is obviously very popular. We had to queue about 10/15 minutes for a table. There were also lots of people getting take out. There was still a queue when we left.  I had haddock, chips and mushy peas. OH had cod, chips and gravy. It was pretty good. No complaints. But don't feel it was as good as Country last week. Though here you can have a beer with your food.  Felt the staff were a bit overwhelmed by the volume of customers. Don't know whether we just happened to pick a particularly busy Friday night, or if it's always like this."}
{"text":"Honesty, this is probably one of the best, if not the best fish and chips place in Mississauga. I would recommend getting their special haddock and chips.   And if you want something lighter, try the grilled salmon with wild rice. Absolutely divine!   Overall, it's a must try if you like fish. Bon Appetit!"}
{"text":"Excellent, excellent fish and chips. I love that they offer you the option of either getting haddock, halibut and more. Staff is very friendly and welcoming and the fish and chips   are amazing. The fish is very crispy and flavorful and the fries as well. The tartar sauce tastes great. They also offer great family packages which work out to be cheaper than getting individual portions, including 3 fish, a huge size of fries and 3 pops for I believe $30. Great value for a family. My only wish is that they'd close later so I could sit down for dinner. Great place otherwise for fish and chips."}
{"text":"The Best Halibut I've had in my life! ...It was a smooth tasting experience,pure bliss & The fries are amazing with the Tartar sauce ,lemon, coleslaw, A true masterpiece, it was my first time there and it sure won't be my last... Highly recommended"}
{"text":"This place has the best fish and chips in Mississauga. The staff there is great and service is always super fast."}
{"text":"Super friendly environment, amazing food! Friend took me once and now i love it! Great prices!"}
{"text":"This place is an amazing gem.  I can't find enough good words to say about this place.  First off, food is amazing.  Need had such fresh delicious and perfectly cooked fried fish.  The calamari was equally amazing - fresh, delicious, and best I've ever had (and I've had calamari from acclaimed trendy restaurants to 3 Michelin star restaurants).  The house made cocktail sauce is amazing too... they use fresh horseradish!!! and that makes it the best cocktail sauce I've ever had.    The couple who runs it is so so so nice.  such a friendly atmosphere.  You can tell they love the shop and love the customers.  I will be coming back here again and again.   Oh and prices are so damn reasonable.  It's $8 for a giant piece of fried fish.  Quality, freshness, great taste, friendly.... this place is perfect and I would give it 10 stars if I could. You have to come here and try - you will not be disappointed."}
{"text":"My kids like the Halibut fish and chips but a little pricey for the amount of fish you actually get. Need to order extra fish, drives the cost of one meal to about $20. Also, you feel pretty heavy from the oil used, kind of greasy and soft, not as crispy as one would expect. Overall, ok but not a regular fan."}
{"text":"The fish portions are huge. Come on an empty stomach. Totally worth it. Get the haddock. A great staple of theirs. Fries are nice and big. It's tucked away in a little spot in the Mississauga Marketplace. Nice little find."}
{"text":"I got an order of haddock n' chips, which was uber tasty! Fish was moist and the fries were perfectly seasoned. The service was attentive and pleasant as well. I would come here on a weekly basis but I don't want to eat deep fried fish and fries too often (if only unhealthy food were healthy eh?). I must mention that the tarter sauce was awesome albeit the portion was way too small!  Check this place out!"}
{"text":"I ordered the haddock w/ chips. The fries were plentiful, but sadly warm, flabby and too oily for me to eat. I got two pieces of fish, a huge, thin fillet and a smaller, thicker piece which may have actually been cod. The haddock was okay, but it was its odd shape didn't lend itself to even cooking. The thinner bits were actually like fish jerky. The smaller piece of fish was much better, IMO. Friendly staff."}
{"text":"The halibut and the chips are excellent and not too oily. The batter is thin and not overpowering. The tartar sauce is great too and home made. This place is the reason why I love fish and chips."}
{"text":"By far the best fish and chips in the city!  Perfect size portions, Home made tartar sauce, Fresh Fish and Crispy Fries!   Highly Recommended to everyone."}
{"text":"I went there again with my 9 year old daughter. We had fish and chips ( special) and spend total of approximately $28.00.  My going there was based on some reviews.  The fish was greasy and the batter did not taste that great. Also the food was extremely hot. As for the chips, I'm not sure if they cut their own chips or not, but the fries were not that great either.  It was not worth the price either.  I think the reviews I read prior to going there exaggerated."}
{"text":"Best fish and chips place in Mississauga. I highly recommend the place as the food is always consistent and service is very friendly. If you ever walk in ask for the Halibut special you'll be happy."}
{"text":"Truly the best fish and chips I've had in the GTA/downtown. I ordered the Orange Roughy which had a nice light batter as did the onion rings.  The coleslaw was especially nice...just slightly creamy. Super customer service, nice painting of fish on the walls,  and only a little eerie because there is no music played and all you can hear is the sizzle of frying fish."}
{"text":"Great place. Our server was incredibly friendly and our service was quick. The food was fantastic and the portions were perfect. I will definetly be back here."}
{"text":"I wrote a review about a year or 2 ago the halibut fish and chips was great then and still is today. I love walking in and getting big greetings. The staff are so friendly and quick,not much time spent waiting. You all must try the food here next time your up at Hurontario and Eglington. Drop in you will not regret it."}
{"text":"The owner is incredible and very attentive. Gives it a real small village in England feel. Poutine was really good, haddock and orange roughy were some of the best I've had outside of the U.K."}
{"text":"Service is friendly.  Sitting area is decent.  Food is also good."}
{"text":"Halibut & Chips are definitely good but price is getting steep. Also no coleslaw included  Total bill about $18. Other places with similar quality available in Mississauga at lower prices"}
{"text":"Had the haddock special that came with fries and a pop.  The portion was pretty good and the coleslaw was nice.  Wish it had a bit more flavour.  Haddock was very good, crispy and light on the outside and hot and soft on the inside.  My wife had just the haddock fish and got 2 large haddocks.  It was pretty filling (my wife gave me some of hers) and I can eat quite a bit.  Good price, excellent service.  The girl serving us was super nice and cheerful.  Caught us off guard a bit to be honest as we're not used to servers being that cheerful and helpful.  She came to us several time to give us water and check on us.  Place was clean, quiet and comfy."}
{"text":"Delisious fish n' chips place hiding inside a strip plaza on the corner of Hurontario and Eglinton. Service is great, fish is always good, nice chunky cut fries, gravy is so flavorful, no matter what your order is it will be served to perfection. My wife and I had the haddock special and halibut fish only nice and crunchy crust. The special comes with a huge piece  of haddock, fries, and gravy.  We also added a large size coleslaw. I would recommend to anyone that is looking for delicious fish n' chips. 1 meal, 1 fish only 1 beer, and 1 large coleslaw came out to $39 plus tips.  Halibut 9/10 Haddock 7/10"}
{"text":"I'm obsessed with this place!   I think it's safe to say it's the best fish 'n' chips place in Mississauga.   For one, it's a really friendly atmosphere. The waitress is super sweet and so, so attentive. I love it! She strikes up a conversation with you, and always notices if it seems like you need something more. Granted, it's a small place, so not very hard to, but her warmth just really highlights the entire experience.  The food is TOP NOTCH. For the price, the portion is enormous and I'm always stuffed with a little even leftover. It's so delicious and the fish, wow. The fish tastes so fresh and flavourful, and the batter is never soggy or overpowering or too thick. It's nice and crunchy, and light. The fries are my favourite kind of fries - thick cut, crunchy, salted just right. I always say I won't eat as many this time, but I can never stop myself!  I'm a huge coleslaw fan, so their coleslaw really hits the spot for me. It isn't too sweet or creamy like other places, but it's a really nice balance to the fish.   Okay. The tartar sauce. Let me just say, that if you don't go for anything else, and if the rest of my review hasn't convinced you to try it out yet, go for this sauce alone! It will blow your mind. I could eat bucketfuls of this tartar sauce (gross, I know, but it's that good!).   All in all, I've never been disappointed with this place. I took my brother with me (I like it so much that I usually go by myself when a craving hits - I live across the street) and he loved it so much that he took his friends the very next day.  Don't miss this! I am forever a loyal customer :)"}
{"text":"Definitely one of the best fish and chips I've had recently.   My mom and I ate here today and we were both pleasantly surprised.   We both ordered the haddock and chips which was \"on special\" and provided the best value.   $12.65 gets you a generous portion of fried haddock, fries, a side of coleslaw and a can of pop.   Haddock is advertised as the \"best value\", but you can also choose from cod, halibut, salmon or orange roughy for a few extra dollars.   The batter is light and crispy without being overly oily or salty. The fish is moist and flavorful.   The nice thing is that you can actually see your fish cooked to order so you know it's fresh.   The accompanying fries and coleslaw are also very tasty. Both seem fresh, homemade and never frozen. The coleslaw has a good balance of sweet and sour. The fries are lightly salted but very tasty.   Overall one of the best fish and chips I've had in the GTA and definitely a gem of a restaurant in Mississauga."}
{"text":"Just a quick word on orange roughy, since they do serve it here.  I don't know what is the current situation with the sustainability of orange roughy since many of their stocks were nearly wiped out due to overfishing in the 80's.  What I will say is that pregnant women and children would be best to avoid eating this fish.  Due to its unusually long lifespan, it accumulates a lot of mercury, nearly 10 times as much as other fish in some cases.  That being said, if you really enjoy orange roughy and understand the possible adverse health effects from consuming it... go for it.  Anyways, I dropped by this place for some fish and chips since I was in the area.  The place was pretty busy and service was a little behind.  I ended up ordering the haddock special with coleslaw and within a few minutes I was looking at a beautiful plate of fish and chips.  The fish was delicious and the coleslaw was even better.  The fish was cooked perfectly and the coleslaw was crisp and very refreshing, which paired perfectly with the heavier fish and chips.  The chips on the other hand were chewy, so I was not a big fan.  I prefer my chips to have a bit of a crunch but paired with the ketchup, I was still able to down most of them.  I'd go back just for the fish and coleslaw.  If I could special request that my fries stay in the frier for a bit longer, I'd be one happy customer."}
{"text":"i had the haddock special.  the fish tasted fresh and the batter was crispy.  a great lunch."}
{"text":"Amazing fish & chips, and great value. I ordered the haddock, and I plan to have the Halibut next. I had it to go and I regret not having it in the store. Staff was a delight.  Pros: - Excellent fish & chips - Decent selection - Tartar sauce was delicious - Daily specials  Cons: - Can't think of any!"}
{"text":"This has to be be the most expensive fish and chips in the country and not even worth half the price. This should be called \"Mississauga Grease and Chips\" (greasy is an understatement). $21.50 for halibut and chips; better off going for Fine Dining at those prices. Btw this place is a Dive! #Renovate.  Good luck"}
{"text":"The fish was splendid, the chips were actually fries . The customer service was great ! Definitely eating at this place if ever in the area."}
{"text":"Haddock special was really good.  Plenty of fries and a huge fillet, enough for 2 people who are regular eaters.  We got a side of rice which was also very good.  We ordered takeout and it was quick.  I would recommend this place, it is really good and deserving of 4.5 stars."}
{"text":"So glad when place highly rated on Yelp comes through. Today is not only a fish-Friday, but Good Friday, so you can imagine how insane it was inside. In spite of that, staff were still very friendly and didn't give off an impression of being overwhelmed.  Beautiful, light, flaky batter which does't retain excessive oil. The haddock was this great long cut which must've been near 8\" long.  The tatar sauce may be the best I've ever had (and is house-made). Coleslaw is also right up there too.  The 'chips' were excellent. Fresh cut, cooked right and in clean oil (that matters, believe me).  Far and away the best F&C place I've been to in the GTA thus far, and frankly, I'm no longer even concerned to continue searching after today."}
{"text":"Great service, awesome food. You will always leave happy with their beautifully battered fish and to die for fries!"}
{"text":"We are here visiting from Texas. After reading Yelp for over an hour we arrived at the restaurant which had the best reviews for fish and chips When we walked in we were told we could order but not dine in. We had to get it to go. It was a half an hour till they closed. We did not feel welcomed at all. I was so very disappointed."}
{"text":"Service was top notch .. the store manager Jason knew what customer service really is .. full marks to him .. the haddock was great, clam chowder was amazing, missed the Cole slaw though, halibut was over done .. the batter was too crispy .. fries were spot on. Had the batter been slightly thinner, I would have given all stars. Clean place, and well managed eatery."}
{"text":"It's everything they say it is!  My son and I were there for lunch today, we had the haddock and chips with a side order of rice. The haddock was delicious and had a nice light batter. The fries and gravy were certainly tasty. The rice really topped up a good meal. The food arrived quickly and the waiter was friendly.  Can't wait to come back! :)"}
{"text":"This place is sooo good I don't even want to tell you about it. But I will.   Fresh. Few places leave you with the impression of how fresh the food is. This is one of them.   The food is served so quickly from the friers that my food was still sizzling. And the fish was so nicely cooked, and battered.  When fries are cooked well, they don't need salt. These are those kind of fries.   No gimmicks here. Simple, focused menu, with simple food preparation that lets the ingredients sing.   This is the best fish and chips place I have been to. And one of the few restaurants worth visiting in Mississauga."}
{"text":"My son tried this place first and since then he always ask me to go there. The haddock special and calamari are his favorite. Fish is freshly fried everytime! My favorite is clam chowder soup and the calamari. The staff is very nice too"}
{"text":"I was told by my friend who grew up in the same neighborhood that Mississauga Marketplace was owned by the same people that owned the place we have been going to since we were kids.   The place I am referring to is Renforth Fish and Chips at the corner of Rathburn and Renforth in Etobicoke. Well it turns out he was right because although the owners were not there when I went today, their photo was on the wall.   This place is in the big strip mall at the south east corner of Eglinton and Hurontario in Mississauga. Upon entering there is a huge chalkboard sign at the cash which is essentially the menu as they don't bring any menus to the table. They are licensed however so I did order a beer.   The choice is simple... Halibut and chips for 2 and add another cod and chips only because this will be lunch and dinner combined.    The food was served fast... In less than 10 minutes and it was fresh and hot. I was in heaven because this food brought me back 3 decades to the place we used to go to when we were still in grade school.   Besides being nostalgic, the fish was damn good and the fries were amazing.   Our server was happy to hear we came to visit from the old neighborhood and she was happy to tell us all about the business and how they now have 4 restaurants. This location however was there first after leaving Renforth.   This was the best fish and chips I've had since we left Codmother in San Francisco.   We will definitely come back and I am happy we \"returned\"."}
{"text":"Let me start with a story. While on vacation in Sri Lanka last summer I had the chance to try this amazing fish and chips place. I was surprised that a quintessential British dish turned out deliciously well in a land miles and miles away. Once back in Canada, my fish and chips craving struck again.   Husband and I decided to search for a nice, reasonably priced place in Mississauga. Marketplace Fish & Chips did not disappoint.  Food: HUGE portions. You will end up taking home  leftovers. We took home a box filled with french fries to the brim. The tartar sauce is amazing! The fish not greasy at all - light, crispy, and perfectly battered.    Service: We went in the evening at rush time. Restaurant is a bit small. Fortunately we found a table just in the nick of time before a family of 3 came in after who had to wait 20 minutes to be seated. I like how the orders roll out quickly and we received our food within 10 minutes of sitting down.   I will definitely be coming back to Marketplace when I'm in the mood for fish and chips again."}
{"text":"Found this amazing place to have my fish and chips in Sauga. The Haddock with chips and pop cost two of us under $35 including the 20% tip. Saturday at 2pm was not as crowded as some reviews say.   Nice clean restaurant. The fish was sufficiently battered and hardly oily. Customer service was timely and customer care was awesome. The overall experience was exemplary. Kudos to the lovely server/cashier and the chef.  The only reason I gave 4 stars is that I was expecting fresh potato fries rather than the packaged frozen ones."}
{"text":"Excellent spot for fish & chips in mississauga   We ordered the haddock special with a side piece of halibut   Halibut: 8/10 Haddock: 7/10 Fries: 8.5/10 Coleslaw: 9/10 Gravy: 8/10 Decor: 7/10 Service: 10/10  Overall, really enjoyed it and will definitely come back another time when we are in the area"}
{"text":"I really like this place.  They have a good assortment of fish (halibut, haddock, cod and salmon).  I rarely see salmon fish and chips and I'm curious as to how that tastes.   I've had the halibut and haddock fish here before.  What I like about is that the fish tastes very fresh and doesn't have a huge fishy flavour to it.  The batter is light and doesn't completely overwhelm the fish either so you are actually eating fish and chips, not batter and chips with a small slice of fish in the middle.  The fries here are average and the decor is also typical fast food.   All in all, a good place for an unhealthy fish and chips fixing!"}
{"text":"A mountain of freshly fried food for $9. Most places just offer \"fish\" and chips. The Mississauga Marketplace offers a selection of which type of fish you want.  If you're in the neighborhood, this is a much better option than the Square One food court so stop here on your way to the mall."}
{"text":"Very nice and cosy place. I came here a couple of months ago and got their day special, which I believe was a bass fish. It was yummy. A very big portion also! Their tartar sauce is homemade, which I love. Will definitely come back for more fish and chips!"}
{"text":"The waitress was incredibly friendly and service was quick. I had cod fish and chips and it was very filling and delicious! Definitely recommend this restaurant to anyone who likes fish and chips!"}
{"text":"Great fish and chips and wonderful service. It is a strip mall. Just look for Swiss Chalet and the restaurant is a few doors up on the left."}
{"text":"Solid haddock offering. Nothing to complain about at all. Really deserves more business than it gets, especially in the area that it's in."}
{"text":"There will be days when you don't really care about the calorie count or eating something all deep fried.  When one of those days comes.. definitely come to this place.   The onion rings were ho hum that I would skip.  The cod was decent but a bit too much batter for my taste. The fries were the real deal, delectable and perfect. Go for the gravy definitely a better compliment then ketchup up period. Only disappointment is no homemade tartar sauce... I should also mention I had takeout and at least on the take out there was only the regular tartar sauce not the homemade"}
{"text":"For a specialty fish and chip place, this place is pretty weak. Maybe make a better tartar sauce and never give packaged stuff. Put some zing into the batter or something! I've had better at the firkin pubs. Try chicken!"}
{"text":"Homestyle fish and chips are better. I found service here to be slow and the chips weren't crispy. Overall opinion, I won't be going back."}
{"text":"Off the hook good. Lightly fried variety of fish, hand squeezed lemonade, soda and beer. Fries were just so so but the fish is super fresh, and the batter is light and really good. Not greasy at all. Just all around good solid and great friendly service."}
{"text":"Ordered dinner with three friends on a Monday night. Naturally it was quiet, maybe 5-7 others in the place aside from ourselves. We started with calamari which was AMAZING, definitely recommend it. Happy to split it between 4 people.   I ordered halibut only, and received halibut with chips, which was disappointing. Thankfully she only charged me for the halibut. Both the haddock and halibut were good, a little too much batter but no real complaints. I found the chips to be poor quality - don't want to say refried/heated, but it did not taste good.   Lastly, our waitress did not come by at ALL during our meal, and the booths are quite high, so no water refills unless you go up to the counter and ask. Generally a decent experience."}
{"text":"I used to go here, years ago, when the Asian guy was there--he was the best.  His sister used to help out but she was better upfront (very friendly counter-service). I came home with two separate orders & my pal said--why did you get extra fries--it was loaded.  I said I only asked for the regular order; of fish'n chips, dude.  The cook would put the fish on the counter, to thaw / breathe, whatever--reminded me of the place at West Mall & Bloor in Etobicoke--exact method.  Since the Asian guy left, it is not as spectacular.   I have tried every fish'n chips in Mississauga except for one more--Queen Fish'n Chips in Streetsville, on Queen Street. As for the Mississauga Marketplace--not bad but after having the best it is hard to go for jest \"okay\", okay?!"}
{"text":"Best fish and chips in Mississauga! You have a broad selection of fish to choose from (haddock, cod, halibut, etc.), not just one. As well, the service is friendly and quick. I can see why this place has so many positive reviews. Ample portions and plenty of tartar sauce. If you like fish and chips like I do, I suggest that you check this place out."}
{"text":"This place has the best Fish n' Chips in Mississauga. It's a pretty big claim, but I've done a fair amount of research. The location is pretty awesome, Huronatrio and Eglinton, right in the smack \"core\" of Mississauga: meaning it's not too far from Square One lol.  The setup is super-chill, there's usually lots of room here so seating everyone isn't an issue. I usually take group of about 6-8 people and we're always comfortable. The hostess is super nice (and hella hot, even though she's an older woman) ...I think she's the owner's wife, so behave! She has build a fantastic rapport with our group and always knows who ordered what last time. Also, she brings us extra tartar sauce (heart!)  Speaking of which, their tartar sauce is epic! Probably the best tartar sauce I've had outside the UK. Dip your fries in it, dip your fish in it, hell dip your fingers in it! It's just that good. The portions are huge compared to what else is out there: the group I go with usually get the Haddock special, so fries and coleslaw are added in. The prices are also very reasonable, a huge fish n' chips combo for ~$11 ..you can't really go wrong with that.  TL;DR: The best fish n' chips place in Mississauga. Awesome tartar sauce. Super nice & hot waitress!"}
{"text":"I have a new love and I've been seeing her on a weekly basis. Haha! I'm talking about the food not the waitressess, although the one waitress is very sweet! :-D   Finally I don't have to travel far to find some great fish and chips, not to oily and not to salty, its the perfect blend of seafood and batter.  The moment you walk in there is not alot of spots to sit, most of the people who come in usually get take out. But me I like to sit there and eat the food at the place b/c it just wouldn't have the same feeling or taste if I were to eat it at home, if you know what I mean. There are many options there is calamari, shrimp, scallop, or fish - halibut, holy haddock, cod, and salmon. There is also the option of having it deep fried, grilled or poached. I have had all four fish dishes deep fried and my favourite suprisingly was the salmon. I never thought salmon deep fried in batter would taste SOOOOO good I highly recommended it. Another item is the onion rings, they're huge they remind me of the blooming onion you would get at a fair or at ribfest so good!  Lastly, the chef/owner is an older gentleman who is very friendly. He sat down with me and my friend for a bit and started talking about so many random things. I didn't mind b/c I love people like that especially when it someone who owns the restaurant. He took his time to get to know us but not just us he went around to the other tables as well to talk up a storm.   If your looking for great fish and chips and great people to keep you happy and satisfied this is the spot to go to.  Items to definetly get:  - battered salmon - onion rings - calamari"}
{"text":"I ordered a special item they temporarily had on the menu.  The halibut nuggets and chips. It's a shame because this meal was unbelievable! Maybe because the halibut chunks are smaller but the nuggets were so juicy on the inside and so perfectly crispy on the outside.  The super nice lady that works there told me it was only temporary because there shipment of halibut that week only had smaller pieces. I hope they keep them around.   Everyone raves about their fries.  While they are good, I just found them ok.  The tartar sauce is excellent though.  Be sure to ask for extra because you will want to drink it."}
{"text":"Yeah, we were just hankering to have fish and chips when the weekly Yelp! email came in and highlighted the Mississauga Marketplace: Fish and Chips shop!  It had 16 reviews all five star!  So we made sure to stop by for the Haddock plate special $10.95 that includes yummy creamy coleslaw and the best ever Tartar sauce! The fish batter was light crispy and flakey, not heavy and greasy.  Accompanied with that you got a generous helping of delicious fries and a can of pop! Best fish and chips in Mississauga.   Robert and I will be back, for sure! Thanks Yelp! H. Bengert"}
{"text":"Bad idea to go here on a Friday during Lent! It didn't even cross my mind that it would be super packed! But obviously it was, why wouldnt it be?! This place is serving up one of the best fish and chips ever!! That is one of the reasons why we didn't ditch the line, because i knew this would be worth it.  My only con to this place is that they need a waiting area for people dining in so they wouldnt get mixed up with the people ordering take out. When we entered the resto we were second in line to dine in but after 5-10 mins the line tripled!!   We ordered the Haddock special that came with fries, a drink and coleslaw for 12.99!! We added shrimps on the side. The Haddock was really great! I love the crispy batter, not oily at all and it didn't leave an oily film in my mouth with most deep fried foods do. I like that it wasn't all batter and it was more fish to batter ratio! I would ask for extra tartar sauce before chowing! Great coleslaw and fries portion, both tasted great! The shrimps were amazing! A must try! Next time i come back i would love to try their calamari, i'm a big calamari fan!   Great service! Fast and friendly! I believe this is a family owned business and thats always a PLUS in my books! Support your local family business!"}
{"text":"I lived in the UK for school a couple of years ago, and this place reminds me of my favourite fish & chips joint, which I'd frequent during those late nights studying. In short, an absolutely fantastic, reasonably priced, fish & chips spot that totally exceeded my expectations.   Think of nice, perfectly crispy coating surrounding a good amount of fish (but not overly battered). Really fresh, perfectly cooked, not too fishy, and well-seasoned. The batter is very, very light (no soggy batter here!), and allows you to really enjoy the flavour of the fish. It's absolutely delicious. The tartar sauce is also top-quality. The fries are decent, not outstanding, but overall, taking into consideration the whole combo, with coleslaw, coupled with the decent price point, this is great spot to cure that craving for fish and chips (for those that have fish and chips cravings, anyway).   We visited on a weekday for lunch and it was actually quite busy. Keep that in mind, if you come during the lunch rush - while there are a decent amount of tables, it fills up quickly. For two people, with tax and tip, we paid around $24.00."}
{"text":"Best authentic fish and chips place in Mississauga! I've been to England recently and this restaurant tastes very similar to what I tried in London. The fish and chips are always fresh and the portions are large. They even wrap everything up in newspaper :) service is good and the restaurant is clean... But if you're coming on a lunch hour, be prepared to wait... It gets pretty busy. I usually get the haddock and chips or sometimes grilled salmon and mushy peas. Mmmmmm!"}
{"text":"4.5 stars. This is one of my favorite places to get fish & chips in the city. Every time I go to a fish & chips spot I always try their halibut & chips. This time my fiancé ordered the halibut while I opted for their special which is haddock.   The halibut was great, fish was nice and flaky as well as generously sized. The fish to batter ratio is perfect as they just use enough batter to give the fish a crispy texture. They also give a good portion of fries which are great as well. Now the haddock surprised me the most because I found myself enjoying it more than the halibut and so did my fiancé. I found it to be much lighter and tastier. They mark it as \"best value\" on their menu and I would definitely attest to that. Each order comes with coleslaw and while I'm a big fan of coleslaw, the one here lacks flavor and is nothing special."}
{"text":"My second favorite Fish & Chips joint, and that's only because of personal preference. You can't go wrong by coming here. The service is super friendly and the waitress is fantastic! I alternate between this place and \"Country Fish 'n' Chips\" depending on what I'm in the mood for. But this place definitely feels slightly on the healthier side, the atmosphere is much nicer, and the fish is a bit more on the filled side."}
{"text":"Tip:  It's located towards Swiss Chalet portion of this large plaza.  Plaza is undergoing a facelift, so there aren't any lit signs, but this unit is beside Bubble Republic.  The restaurant itself is much larger than it appears from the outside!  More like a 3.5* based on the Cod.  I found the fish itself a bit tasteless, but the Haddock was better!  Confession:  Fish & Chips is not something that I crave often, so after this experience, I'll be good for another 2-3yrs or so.  Prices (~$11 w/ chips, depending on fish) are quite decent for the portion size.  You will be forcing yourself to finish the piece of fish and if you're like me, you won't be able to finish the fries...even if they're fresh-cut and really good (when hot)!  Lady who was running the place was very kind and sweet.  We ordered, she told us to sit down, she brought the food over - it was served rather quickly - and you pay afterwards.  A very solid place in 'ssauga for F'nC!"}
{"text":"I've been here twice with pretty different experiences.   The first time, the service was terrible. We walked in and the lady asked us if we'd be eating here or getting it to go. We said \"here\" and she said \"okay\" and didn't seat us or anything. We took a seat ourselves and tried to get her attention to order something. She never came to our table and after waiting way too long, we just left the place.  The second time, we decided to give this place another go. This time around, the service was great. Our server was really upbeat, took our orders, and came back once we started eating to ask us how we were doing. We ordered the halibut and chips because it was the daily special and also ordered the salmon and chips. The coleslaw and tartar sauce that it came with were amazing.    I definitely recommend trying their daily specials! Of course, the fish and chips are absolutely drenched in oil but it's great to go to this place every once in a while."}
{"text":"Grandpa had been craving so I took the whole family here and everyone was thoroughly pleased. Large portions and you couldn't ask for much more out of fish and chips. Calamari was yummy too!"}
{"text":"Got the cod and halibut. Both fish were great, but the halibut was definitely worth the $2 extra. Next time im definitely getting the halibut.   Fries were meh - kinda soggy, but the fish was great. Tartar sauce was also delicious."}
{"text":"First, their coleslaw is the best i've had in a while. They have a distinct lemon-mayo taste to it. The chunks of relish were very small, making it more sauce than tartar. The tanginess of the sauce perfectly compliments the fish and the fries. Do yourself a favour and ask for extra tartar sauce!  The fries were perfectly cooked! They aren't soggy nor too crunchy. They're beefy and cooked perfectly! I'm not a fan of fries, but this place did it right! Definitely one of the best fries I've had this side of Mississauga  I had the Haddock special (comes with a pop and cole slaw). The coleslaw, while delicious, shouldn't come at an extra cost- I didn't think, especially for the amount given, would be worth an extra $0.90, but it is very good!  The fish was pretty good, not to much batter and just the right amount of \"fish\"  Overall, It's a great place! A little on the pricey side for the food (considering the cost to make fish and chips is pretty low), but still pretty good nonetheless!"}
{"text":"Definitely get your money's worth here. I got the Haddock and chips and it was massive, and the Halibut is pretty good-sized portions as well. Good fries (a little greasy but...I'm not looking for health here!) and great gravy. I'm getting hungry just writing this.  Plaza has plenty of parking and my order didn't take too long (I got take-out). Pretty sure they took debit, which is always a bonus."}
{"text":"3 stars. Sorry to shut down the hype in the previous 5 star reviews but I've had better fish &chips elsewhere! The thing is I'm comparing it to the best fish & chips I've ever tried (Olde Yorke Fish & Chips). There may not be a lot of fish & chips restos around this area, but it's worth the trek to find a good one. This one is just 'okay' but pretty good.   Ordered the Halibut and Chips with a side of gravy.  Fish was well cooked & flaky. Semi-generous portion. Batter was quite yummy, crunchy, and golden. The batter was a shell around the fish, it seemed to fall off away from the fish once you cut into it. Fries, were good! Home-made, very generous portion. Gravy was great as well :) Finished it right to the last drop!   Price- a little on the pricey side. For 2 orders of halibut and chips, gravy and a drink was $43 with tip.   Service was nice on a positive note! Got us seated, asked us for drinks and was very quick with our bill :)   Overall: would consider coming back on the occasion where I'm in dire need of a fish & chips craving."}
{"text":"When we walked in, we were seated immediately. However, the server didnt come to take the order for about 10 minutes despite there were only 2 other tables at the time. I was confused and thought maybe we had to go up and order. I got the servers attention to ask this, and that's when she took our order.  The wait time was short, and the Haddock and chips were very fresh and crispy! The tartar sauce was flavourful and creamy. Although I found the batter to be a little thick, the fish to batter ratio was fair.   Definitely one of the better Fish and Chips I've had, and would recommend to others."}
{"text":"This place has ok fish and chips but their prices are a rip off. I mean its $17 for halibut and chips... can get it down the street at applewood for about 20% cheaper... A place that over charges this much is a little bit ridiculous. Also the fries portion was very small for paying $17. Wont be back"}
{"text":"Pricey but worth it. I got the halibut and chips and the halibut was pretty damn good! Good portions too. The fries were decent too."}
{"text":"Service is very friendly and homey.  My standards for fish and chips come from the UK so I was hard pressed to find a comparable fish n chips place at home. This one definitely does it well.   I got the Haddock special, my go to fish for fish n chips. There is a good batter to fish ratio unlike some other places I've eaten at where a lot of the time the meal is wholly batter. The fries are rustic and old school, very appropriate for fish n chips. The tartar sauce was pretty awesome too. The coleslaw was good too, but nothing special.  Overall it's a pretty decent fish n chips place and I would come again if I get a hankering. Probably will want to try the halibut next."}
{"text":"Went to Heritage for lunch today.  It was exactly what I was looking for. A genuine fish & chips place!  Nearly impossible to find in the States.  Everything was great. I had the luncheon special with a Greek salad and fries.  The fries were home made unlike those damn coated ones everyone else seems to be serving.  The haddock was just right.  I will definitely be back one more time before I leave Toronto.  They were very busy even at noon on a Wednesday."}
{"text":"Today was my first time ever eating fish and chips.  Fish was freshly fried and tasted yummy. I'm not really into fried stuff so I took off some of the batter. Mmmm fish and tartar sauce is so yummy! I got to try a bit of the cod off of a friend and it was good too. The meat was very soft and moist. My order of halibut and chips was a bit pricey for the amount of fish I got.  Overall, I enjoyed my fish and chips experience!"}
{"text":"The food is excellent,  service is phenomenal,  and the wait time from order to eat is practically nonexistent.  I would have taken a picture of my food, but I was to busy eating it."}
