{"text":"Went here for lunch with a friend. We ordered the bulgogi octopus hot pot which was priced at $28. Waitress seemed inattentive and in a hurry. 

My friend and I decided to split the bill. We did not discuss the price while we were paying, and didn't realize until we already left that we were overcharged. The hot pot price was a total of $28.  We each paid over $20 each with tip! Partly our fault for not double checking with each other, but also, we should not have been overcharged by that much in the first place. 

Food was subpar, and they should definitely work on the service. Won't be coming back."}
{"text":"\"miss korea\". More like \"miss so-good\", because this place is actually sooo good. 

pros: The beef bulgogi here is one of the best I've eaten. Kimchi side (although a bit on the small side),  is pretty good too. I could probably pick any item,  at random, from their clipboard menu and it would be good. The atmosphere is also really nice. 

cons: Yo what up with those cylinder seats? and those cylinder tables? I understand it looks nice in theory, but wheres a guy supposed to put his coat?! fio"}
{"text":"Honestly, spend the few extra minutes to get yourself to Christie station instead.
I get that this is probably the best Korean food in the neighbourhood (and maybe one of the better restaurants along this strip littered with fast food), but that doesn't say much. 

The restaurant is going for a \"modern\" take on Korean I'm guessing - which means the decor is beautiful and seems trendy, but the goodness stops there. \"Modern\" means that none of the traditionally expected side dishes come with the meal, which is a big disappointment. 

Ordered the bulgogi, beef soon tofu soup, and bulgogi bibimbap (modern version of stone pot - without the stone pot). The bulgogi was nicely flavoured but super fatty, the soup relatively good but super small. The place is \"okay\", but not for the price point and not by comparison to other Korean places. 

This place just feels like a rip off for what you get comparatively. If you're around the area, this is probably one of the better picks. But if you're fiending for some good Korean, get yourself uptown a bit. 

Also the washrooms were HELLA dirty!!!"}
{"text":"The food is good, especially the bun. I love the cute interior, and the workers are really nice - except his perfume is kind of too strong for a restaurant.

Wrote an indepth review here:
http://korcan50years.com/2013/12/16/miss-korea-trendy-korean-restaurant-bar-in-downtown-toronto/"}
{"text":"This restaurant had unique interior and fascinating foods.

All the staffs were friendly and nice. 

I had a great time in that bar with my friends!!!!!!!!!!!!!!!"}
{"text":"Went this past Saturday night and had a very weird experience --

I stepped in after work and placed my order for takeout (2 veggie bibimbaps) and a shot of Baileys while I wait for the food, to smooth out the edge from the day. I asked if I could get hot sauce stirred in with the bibimbap, but the girl said no and that they would put it on the side to better control the spiciness. Ok, fair enough.  I then noticed the cooks plating fries and drizzling them with sauce. So I asked where I could find that dish on the menu. The girl at the counter said they are free and accompany drink orders. So I asked her how much it would cost to add a side of fries to my order. She asked the cook and the cook smiled and said they'd be free. I was grateful and asked the girl if they could put the sauce they drizzled on the fries, on the side.

So the girl rang up my order and presented me my bill. When I looked it over, I saw that she had charged $0.04 for the shot of Baileys. I showed her the error, she apologized profusely, thanked me and rang it up on the machine - I paid for it, making sure to to tip well (over 20%). I then realized that the amount she charged me was the same as the amount in the erroneous bill she first presented, and did not include the cost for the Baileys shot.

So I told her again that the cost for the Baileys shot was missing. She apologized again profusely and I paid for the shot with tip.

I waited for a bit and when the order was almost complete, the girl at the counter got my attention to tell me that they had put the sauce on the fries, and not on the side like I had requested. So I asked if it would be possible to get a new batch with the sauce on the side. When the girl informed the cooks, they seemed so pissed, which I could understand because they were giving them for free, but on the other hand, I made sure to give them a generous tip for this and really, why serve someone something free if it's not agreeable to the person eating it?

I asked the girl if they were angry and she just giggled and said no. But I'm thinking you don't necessarily need to speak the language to know if someone is pissed.

The girl at the counter seemed sweet, but tried too hard to pass off as sweet rather than do her job correctly, error after error... which I think caused a string of inconveniences for myself and the cooks. The whole thing left a bad taste in my mouth. I'm not sure I'd go back again."}
{"text":"Came here after dinner for a drink with a friend. The service was horrible. We wait 20 minutes for them to bring a menu. Didnt get a chance to try the food, maybe next time."}
{"text":"I really love the food here and the workers are extremely hospitable!
I bought a lot of food for take out and they forgot to give me one of the dishes, but when I came back to get them, they gave me some free food and candy! Definitely one of my favourite places to get Korean food."}
{"text":"It has a nice atmosphere and tasty food. It opens up late and is one of the better korean restaurants in the area. It has these really cool seats that double as a storage for jackets and bags.

My only issue with it is the price (it's a tad on the expensive side)."}
{"text":"The food here is great although it is a little pricey. I ordered grilled pork bellies and was surprised at the large portion. I couldn't even finish it all which is unusual for me. It was cooked perfectly and came with a little side salad that had a great spicy dressing on it. The only hitch with this place is the trashy looking tables and stools. they literally look like someone went dumpster diving and glued a bunch of garbage together into furniture. Its also awkward when there are no backs on chairs AND no coat rack. You end up having to throw your coats over the stools at the table next to you. That being said, the food and service were good enough to make up for the furniture and I would go back here definitely; maybe in the summer though when I don't have a coat :)"}
{"text":"Nice interiors and friendly service. 

Found a strand of hair in my tofu dolsot. 

The waitress apologized profusely, and made me a fresh one with no charge at all as an apology. The dolsot itself was quite good and the price seems worthy.

Without the hair incident, this place would get 3 stars!"}
{"text":"Had their bimbimbap to go via Ritual . It was barely edible. There was nothing in it that resembled a bimbimbap with the exception of a fried egg and rice. I mean there was lettuce in it. Plus none of that korean hot sauce that usually accompanies it. It was like the kitchen ran out of ingredients and threw whatever was leftover into it."}
{"text":"The food here is hit or miss. 

The good:

Spicy Pork Buns - Nice grilled soft bun with what I will describe as \"korean pulled pork\"  inside. The pork inside is sticky and soft with a bit of chili. The bun being grilled is a nice touch since it adds a nice smokey flavor to the sandwich. I wish there was some pickles on the side or inside this sandwich to add some acidity though, but overall a nice dish.

Spicy Rice Cake with Pork Belly - I love the rice cakes in this, the texture is soft and chewy and not mushy, there is also a generous amount of pork belly and has a nice kick. It is kind of greasy, but it is soo good.

The bad:

Kimchi Jjim - The good thing about this dish is the portion size, it is huge and comes with a very generous amount of pork belly. This dish consist of fried tofu layered with kimchi and braised pork belly. The tofu is not crisp, and kind of greasy so it was not that appetizing, the dish taste only of kimchi and does not have that much dimension, the pork belly was bland.

Cheese Don Katsu - The coating is way tooo heavy on this dish and the pork was bland and bit dry (due to overcooking?), the sauce was kind of strange with the cheese at the bottom, I really did not enjoy this dish.

Other comments:

They have drinks with food combos, which will save you a bit of money in a group, so that is kind of cool. The main dining area is downstairs but, they also have a private Karaoke room upstairs which you have to book in advance for parties. I am not a fan of karaoke, but the group I was with are, and they enjoyed themselves. None of us in the group were Korean, but the karaoke machine buttons and screen was all in Korean, so it took us a while to figure out how to work this thing. 

The service was ok, being in the private room, we had to keep going downstairs to request more drinks. I understand that the waitstaff does not have the time to keep checking on us and might feel like they are being intrusive, but there is no service if we have to keep going downstairs for every round of drinks needed. I think a good idea would be to have a button to request the waitstaff attention in that room."}
{"text":"It's my second visit and I've ordered the same dish: The Bulgogi beef Dolsot hot plate. I love it. I don't tolerate spicy food so I made sure this one is not spicy and it's still a sizzling hot plate. The restaurant decor is quite nice and it has a young loungy vibe. I recommend it."}
{"text":"This is the worst Korean food I've had in GTA. The pork bone soup was not available and lunch menu was not available for the weekend. The Tofu Stew was warm and not hot as it was supposed to be. The amount of tofu and meat in the Stew was nothing compared to other Korean restaurants. The soup tasted like nothing besides the extremely spicy chili oil. I would avoid this place in the future. Plenty of other options in the area."}
{"text":"I'd like to give this place a second shot. To summarize my A-OK experience, their soft tofu stew was very flavourful, but I did not enjoy the horrendous amount of onions in it. And even though their kimchi pancake with pork was bomb, the fact that it was tiny as hell and it cost $12 was quite the disappointment.  

Food (3.5/5): Mostly said above. I wanted to love their soft tofu stew. It's got a great flavour and just the right kick of heat, however every spoonful was 90% sliced onions which was super disappointing. I really loved their kimchi pancake with sliced pork. It's got a great crisp at the bottom and very well flavoured with kimchi and thinly sliced pork, but god it is tiny for $12... 

Cost (3/5): I found it alittle pricier that other korean places. 

Service (3.5/5): quick and fairly standard. Nothing particularly stellar, but not complaining either!

Ambience (3.5/5): You around a typical round table with buckets for seats. It's nice to be able to store my stuff in the seat itself. The place has got character, but it's also fairly narrow with a door right in the middle. Those sitting near the door were wearing their coats. I sat fairly inside the restaurant but that didn't mean I didn't get a brush of the cold breeze every now and then when someone walked in.

Overall would give it a second chance for the table top cooking. I saw alot of tables ordering the set for 2 or more people and they seemed to enjoy their meal more than my BF and I enjoyed ours, haha."}
{"text":"food was good but they really need to tidy up
empty cardboard boxes are stacked up on the shelves also cleaning product are left out in the open with disarray 
I guess I am comparing it to the GO restaurant that was there before and looked so much visually appealing
presentation is EVERYTHING"}
{"text":"Cool place to eat.

My girl friend and I went to Miss Korea last week and had one of the most pleasant meal experiences of my life. 

The food was delicious and plentiful. I had Spicy Pork Rib, Cheese Katsu, JJambong and Bossam and they were so delicious and well presented. The best Korean food in town.

Excellent experience and highly recommended."}
{"text":"Honestly, this place doesnt even amount to one star. I hated my first experience at Miss Korea but still decided to give it a second chance. I was so wrong to do that. First of all why are all the waitresses wearing street clothes? At least have an apron around ur waist?? The wait for the food was way too long and during the wait they didnt even bring us water, I had to ask for it. Also, that button on the table? Ya it doesnt work. Why is it even there if its not going to be functioning properly?? The food was honestly too expensive, around 20 dollars for a few pieces of ribs. This was also the first korean restaurant that didnt have appetizers and the funnier thing was that when we asked about the appetizer the waitress seemed to be in awe that we expect side dishes from a korean restaurant... A few days later I come back wanting to give them another chance. I asked for a pork bone soup, they were out of that, I asked for their bbq ribs they were out of that too and mind you it was 8pm when I went there and they close at 2:45am. I then asked the waitress what she recommends and she says the beef tofu soup. The soup literally had 3 small pieces of beef and a few pieces of tofu!!! And my friend ordered bibimbap, this was also my first time seeing bibimbap in a regular bowl rather than a stone pot. Do yourself a favour and dont waste your time and money at this place."}
{"text":"I am visiting from LA and got in very late a couple nights ago and found this spot right around the corner where I am staying and open late night! I opted for the white noodle soup with seafood and was surprised by how hearty and delicious it was without being too salty. I have already gone back again for more of the soup and the service has been friendly and quick. The food is fresh and clean (doesn't seem like it's full of preservatives like some places) and I wish I had a version of this in my neighborhood at home!"}
{"text":"My boyfriend and i went in here for lunch today, he ordered the budae jjigae, I had a dolsot bibimbap w/tofu, and we shared the tofu w/ kimchi appetizer. Everything was so good, in fact I'm going to say this was probably the best bibimbap I've had in Toronto. It was just what we needed on this super cold day.

Atmosphere is really fun and casual, and our server was super nice. There was no one there when we arrived but by the time we were done eating there were 10 or so tables seated, so I can see why it might get busy.

Would give this place 5 stars, except I was surprised that we weren't served any banchan (aside from a small dish of kimchi). If they did that (and maybe played some k-pop instead of Coldplay?), this place would be perfect.

Will definitely be back next time we're in the area and looking for lunch."}
{"text":"Ordered udon takeout from here because I remember liking their food a while ago when I ate in store (despite absolutely terrible servers but hey decent food is decent food). Arrived for pick-up and saw two containers and I thought okay good these people aren't dumb enough to put the noodles together with the soup.

Got home, opened it up and realized each container had some soup as well as some noodle. Seriously???? 
The food was not edible.

Seriously, hire some legit restaurant workers who give a damn for a little more than min wage instead of a bunch of monkeys without brains.

I'd rather wipe my ass with my money than to give it to this place"}
{"text":"The concept is nice but the food is disappointing. We found the dishes to be way spicier than advertised and mine (Korean Spicy Rib) was almost inedible due to the level of heat. The restaurant has a very nice layout and the service is fast, but the fact that we really didn't enjoy our food due to the heat lets the whole thing down.

Won't be back."}
{"text":"This is not the same Miss Korea in NYC, ny's version is soo much better. Also, PLEASE clean your washrooms! Aside from the filthy washrooms, the food was good. Small portions though."}
{"text":"Good place to drink and eat, the hole vibe is cool! Good place to go at night, but usually there's only one waitress, if the the place is busy... It's going to be complicate to order. Go there knowing about this will set your expectations in the right place! ^^"}
{"text":"Been here more times than I can count. FOH/BOH never missed a beat on service or quality though I think they're somewhat afraid I'll eat through their daily prep and leave others hungry. Booze and dinner combos kick ass for flavor and value and don't forget to try the spicy rice cakes when you visit. You won't be disappointed here."}
{"text":"Food here is very expensive for what you get.
I had a chance to speak to the owner about this issue, but he was living in his own world."}
{"text":"Atmosphere is okay, tables might be too small for two ppl tho. Had a bimbimbap and a soon tofu soup however neither of them worth the money we spent. Food is a bit OVER PRICED, the soup was watery, bimbimbap had the SMALLEST PORTION I HAVE EVER SEEN IN MY LIFE. Waitress was quite nice. Not going back again.

Taste: 3.5/5
Atmosphere: 3.5/5
Average cost: $17"}
{"text":"Tried the spicy seafood noodle and bulgogi soup. Both are pretty good! The owner needs to relax with the AC tho, way too cold"}
{"text":"We went to Miss Korea last night, and enjoyed our pork bossam and beef. The service was polite and efficient, and the storage inside the seats was an interesting touch...a good spot."}
{"text":"I don't know why their rating is so low on yelp, i really enjoyed their food. I had the stone bowl beef bibimbap. My friend had the spicy seafood noodle soup. The dish was actually spicy. The quantity for the soup was too large for us to finish. The service is kind of slow."}
{"text":"*ATTENTION PLEASE* enough is enough. THE WORST EXPERIENCE EVER and I awfully suggest people NOT TO COME HERE. Here is what happened.

I've been frequently visiting this place for quite years and my must-eat is their killer Beef TarTar. It was stunning and I loved to introduce this dish to my friends whenever I bring my friends with me here. 
From my last 3 visits, I started noticing that the Beef TarTar doesn't taste great like before it was fairly bland as if nothing added on it and the meat was not fully defrosted so I asked them to add more sauce on it.
The same issue happened at the 2nd and 3rd visit, but I tried to think positive thinking probably they got the new cook or something because I really loved the menu. The servers were friendly most of the time. 

I'm not a person who jeopardizes business by nonsense complaints. What made me to write this review is this. It was the 3rd visit, I was here with my Korean friend. The Beef TarTar was quite bland and I asked the waitress to add some sauce. And then I heard one Asian guy with glasses in the kitchen yelling in a high pitched tone. I wondered what he shouted about since I can't understand Korean. I asked my Korean friend what the kitchen folk said and it turned out the guy was swearing about the Beef TarTar that we returned. According to my friend, to say the least, the cook bellowed \"FUSSY BI**HES ARE NEVER WELCOME HERE,GET OUTTA HERE.\" 
Baffled, I couldn't believe that they dare to say out such words loud enough to their customers to be able to hear in the distance. Probably the guy didn't notice that my friend can understand Korean because my friend was facing my way against the kitchen. blushing in anger I left the place in no time with telling myself I will never return here.

Even at this moment, writing up the review, I cannot calm myself with the resentment. This restaurant deserves to lose many customers cuz of ZERO RESPECT."}
{"text":"The service was pretty good. Nothing to complain about. But what I loved was the food quality and portion. I got the seafood dolsot bibimbap and the seafood wasn't just measly pieces but nice big chunks of mussel shrimp and squid.  I was so full but had to finish it all because it was so good. The round metal tables made me feel like I was back in korea. Definitely a pleasant visit and will be back again. They also have a cute little noraebang upstairs (karaoke) that you can rent out and have a little private party!"}
{"text":"Visited this place on my trip to Toronto. A trendy, hip, and young Korea. Restaurant. Busy place, the service wasn't the best but no complaint. Solid food! I would say it's has a taste of fine dining in the food - bulgogi and soup (not something we have in the U.S. even in big city like Houston or Dallas). Like pretty much everything except for the seafood pancake (tasted like omelet to me). Thought fried chicken would be better since it's a signature dish of Korean but it was just ok. Decent price. $90 for 6 people (we didn't order any alcohol)"}
{"text":"Like some other Yelpers, the wait is simply too long for this place to be worth it.

We ordered two bibimbaps without the stone bowl, so essentially, rice with ingredients placed on top that we'd have to mix ourselves...aka quick prep. Waited 30 minutes without a peep and when we finally asked, they said it'd be another 10 minutes.

The restaurant was half empty. 

Would not come back."}
{"text":"The soup is too spicy and greasy. My stomach wasn't even digesting after the meal."}
{"text":"Chill spot for some pretty good Korean food!

Came here around three times and love it everytime. It is your staple Korean place with various rice bowls and soups but within a very casual bar type of vibe. It is definitely more of a drink spot where soju and food is a definitive pairing within the atmosphere of this restaurant. Last time I went I got two things, one was of a soup and rice and the other one was of spicy ricecake. Savory and great to be paired with various alcoholic drinks."}
{"text":"a very modern place. service was SUPER NICE!! I ordered takeout and the food was ready to in around 10 mins.

food seems a little overpriced compared to other korean restaurants in tow, but the portion is HUGE!! definitely worth the price!

ordered
*spicy seafood noodle soup(MAIN)* - they used udon noodles instead of the traditional ones. the noodle soup was so flavourful! HUGE portion!! definitely good for two people for share. And there were 25 mussels in the noodle soup. 12.95 for a two people portion noodle with that many mussels is a very decent price.

*tofu kimchi(APPETIZER)* - this a vegetarian version(?) - no pork. but i loved it, cuz the seaweed on top gives this dish a very nice smokey flavourful. The portion is not small neither."}
{"text":"Seafood soon tofu and seafood pancake hit the spot on a really cold Friday night.  It's a cozy spot close to Yonge and Bloor.  Service is quick.  Only challenge is the tables are situated close together so you better be pretty skinny to get in and out..."}
{"text":"Came for lunch today to this 1-week-old addition to one of Yonge's most eyesore-iest stretches. Really 2-ish stars but I'll round up for looks, just like in life.

Contrary to a previous review, there is definitely bibimbap, but the dinner menu might be different. We ordered seafood dolsot ($11) and a traditional bibimbap minus the meat ($8), making the terrible mistake of thinking it would also be in a hot stone bowl. Now, I wouldn't kick a regular bibimbap out of bed for eating crackers, but let's be real: dolsot or go home.

There was a bit of a language barrier while we were ordering, so maybe not conducive to ordering for dietary restrictions, but we eventually managed.

PROS:
+ Clean and nicely decorated
+ Refreshingly short menu
+ Delightfully unpredictable playlist consisting of Shania Twain, Backstreet Boys, Bon Jovi and \"That's Amore\" (you know, \"When the moon hits your eye/Like a plate of japchae...\")

CONS:
- Hot stone pot did not stay very hot (an excerpt from the unpublished Dr. Seuss book \"Horton Visits a Korean Restaurant\"). My dining partner notes that the \"crispy rice factor was maybe operating at around 60%\".
- Fried egg on my bibimbap must have been of the Cadbury Mini variety because it was tragicomically tiny. I wish a took a picture but you still would have had to squint to make it out.
- No banchan. A pinch of kimchi and tiny cup of [delicious] seaweed soup was the extent of sides. No potatoes? No tofu? No bean sprouts? :(
- Poor seating. I happen to have a spine condition that makes supporting my own upright position throughout a meal quite difficult, but regardless, let's leave backless stools to bars, please?

Price-wise, I can't find a reason for the extra $1-3 on some dishes (in comparison with K-town spots) especially in light of the lack of appetizers. Maybe I'll come back when they've settled in more and see if I can find one then."}
{"text":"Stumbled upon Miss Korean Restaurant & Bar with Iris the other night after shopping in the Yorkville area (if you don't know who Iris is, she was featured in our Zomato Meet Up video.  Make sure you go ahead and check it out by clicking HERE!).  What drew us in was their rustic / factory style decorations, which you wouldn't normally expect from a Korean restaurant.  One side of the wall consisted of exposed bricks, while the other side was decorated with intricate drawings of wine bottles.

They used stainless barrel tables, which adds a touch of chic to the overall design.  I found the tables a little small even for two people, but I guess style speaks louder.  Their stools were designed such that customers could store their belongings in it.  Just lift up the cushion and Voilà ~ a very safe and secure place for your personal belongings.  Just don't forget to take everything with you at the end of the night!

This restaurant also has a second level, which contains a private room (for around 10 people) with Karaoke.

Miss Korea has a relatively small menu, but is filled with all the Korean dishes that you'd crave.   Pancakes, octopus sashimi, deep fried chicken, bimbimbap, bulgogi, and don katsu - they have it all!  They also offer a few combos that are served with alcoholic drinks.

As an appetizer we ordered the Pajeon (seafood pancake).  The taste was surreal!  The pancake was filled with lots of seafood such as shrimps, crab meats, and squids.  The texture was a little bit chewy, yet not too tough. The touch of scallion and onions really brought out the flavour of the seafood!

The Beef Tartare with Pear was another appetizer that we ordered, and I've got to say that it was not only \"the bomb\", but one of the best Beef Tartare that we've have had in a long time.  The beef was marinated to perfection with sesame oil, sesame seeds, and soy sauce.  Mixing it in with the egg yolk added a richness to the texture and taste.  The pear on the side complimented the Beef Tartare very well, as the beef itself might be too filling for some people.  The pear helps to digest and clean out your palate.

We couldn't resist the temptation of the Cheese Donkatsu.  As soon as we saw it was on the menu, we knew we have to get it.  Here is it, a huge slice of pork chop served with a small salad on the side!  The pork chop was crispy on the outside and tender on the inside, while the cheese added a bit of richness and creaminess to the overall taste.

Bulgogi served on sizzling plate - this was probably our least favourite dish for the night.  As you might be able to tell by just looking at the picture, that the bulgogi is very dry.  The taste was ordinary at best.  Not recommended.


Miss Korea Restaurant & Bar is best for nights when you just want to grab some drinks and snacks with friends.  I found that they get busier later in the night.  At around 9pm, the usual demographic of college students and young professionals start swarming in.  Nonetheless, Miss Korea is a great addition to the Korean restaurants located in the heart of Toronto.

xx,
Janet"}
{"text":"The name caught my attention. We ordered the Miss Korea Bibimbap - 8.95. The bulgogi spicy soup. And fried chicken. All three dishes were tasty and the spicy soup was very flavourful.  You will just want to drink it alone. Will definitely come back!"}
{"text":"We had a late dinner here, and ordered the spicy pork with rice and the spicy tofu soup with pork. The spicy pork was really good, but the tofu soup was nothing special. The seats can be uncomfortable since many of them don't have a back support. I would definitely still come back to order takeout though!"}
{"text":"Tasty korean staples at a reasonable place. The bibimbap is a large portion. However the stone bowl wasn't heated to a high enough temperatire and you don't get those crispy rice bits on the side that you expect. Overall it was okay, but no distinctive flavors and the general feeling after getting a couple bites in was that it was relatively bland. The soontofu was pretty mediocore  as well. Their sizzling plate options are alright but quite oily, and once again the food comes off as bland. There are cheaper offerings in northern korean town, and it's not top tier korean food,  but with a good atmosphere (the place also has dice for drinking) some okay food for the price (and location) miss Korea is a cool place to drop in for some drinking but definitely not my go to to grab a bite."}
{"text":"Restaurant and bar; 7 brands of tequila!!!; cheap beer; Korean alcohol + variety&authenticity on the menu.

Nice music, but a little loud for a date or a romantic dinner. It's clearly a celebration joint where to go hang out with loud friends you've known your whole life; I saw a lot of cool young Korean clientele, which made me wonder if in Seoul they would be partying that hard...)

The decoration was made with materials like wood, iron, and  barrel tables, like a NYC factory style.

The downs of our experience was that few people was working in the kitchen, and the place was full with waiting line, so the service was slow, plus it wasn't cool that they served the table beside us which arrived after us. They brought their rice wine, and their appetizer even before our beers...

After reminding them, they told us they ran out of the Korean beer we asked for, and they apologized for the waiting time.

We ordered an octopus sashimi, and we had spicy and white seafood soups.

For our smile while chewing, we both thought that the octopus was perfectly cooked, felted fresh, and the flavor was well balanced.

The soups were contained in huge bowls, with plenty of seafood items, veggies, like udon noodles, but the best part was the broth: tasty, no, as delicious as a Mexican seafood soup eaten in Playa del Carmen...

So cool that the place is near my new office; I see myself going there frequently... Nothing about the 7 brands of tequila and moderated prices..."}
{"text":"Came here twice for lunch. Me and my friend ordered \"bulgogi hotpot\" first time, then the waitress came with \"kimchi hotpot\", so we told her this is not we ordered. She looked at us and she asked us if we can just eat the kimchi one so she didn't need to take the food back. Obviously we said no cause that's not we ordered!!

The second time I came with another friend. We ordered \"octopus bulgogi hotpot\" to share which was $28 in total. We decided to split the bill which was a simple request. We each paid $20 with tip. We didn't realize until we already left that we were overcharged. It was partly our fault because we didn't realize when we were there. And it was the same waitress! 

Overall, food was okay and waitress was rude. Will not come back or recommend this place to any of my friend."}
{"text":"Typical Korean food. Nothing particulary stood out. It's good for late night eats since they're open until 3AM!

We sat next to an obnoxious table who were clearly inebriated from all the free alcohol the waiter was bringing to them on the house. If it's not too late into the night, I'd recommend going elsewhere for your Korean fix."}
{"text":"The food was actually good so it pains me to dock points but it's all about the smaller details. The tables are small and have back-less stools instead of chairs leading you to believe it's a place for a quick bite. Then you notice that dishes are $13 - $18 so you better savour it. No bibimbap which is my standby in unfamiliar territory. I ordered the bulgogi from a server wearing a skirt that was much too short. Like waaaaayyyy above the knee. I don't care for naughty bits dangling over my bulgogi. She was nice enough, though. The food arrived and the portion was small. And no side dishes. WTH? The sizzling plate stopped sizzling within 10 seconds of being placed on my table. The rice served with it was in a super-tiny cup. I guess they are paying by the grain. The bulgogi was delicious. When I was done I was still hungry and went to McDonalds, though. When it was time to leave I placed my utensils down. No response from staff. I finished my water. No response from staff. I made eye contact twice, no response from staff. I put my wallet on the table, no response from staff. Eventually I did a \"hey you!\" to get the bill. There are stairs in the middle of the restaurant where they stack cases of pop. Doesn't help the trendy  vibe they are going for. The chopsticks weren't Korean. I'd go back if they lowered the price on the dishes to $9."}
{"text":"Literally everything is bad here. Don't go. Terrible service and terrible food. Chef does not know how to cook."}
{"text":"So disappointed I looked yelp they said open until 2:45. And I decided to walk 20 minute away from my hotel, I arrived around 1:15am in the restaurant. They still open and some customers still there. But they said not taking order anymore and closing."}
{"text":"Not bad in that the food wasn't drizzled with salt like some Asian restaurants but like many other Korean restaurants, this one kept me hanging a bit.

Food 3/5: I got the spicy tofu soup and it was OK.  The beef was tender but not a lot of tofu to really enjoy the soup. The rice that came with it was unfortunately too plain.  We also shared a rice cake appetizer and found it way too spicy.

Service: 2/5, quite poor. They just come to bring food and you really had to get their attention to get anything.

Ambience: 3/5: bar feel with circle tables. It gets a little loud and I didn't feel it much.  The decor on the walls were nice

Price: 2/5, about $20 per person.  Not sure if it's worth the food I had."}
{"text":"I got fried chicken, stone pot bibimbop, and grilled pork belly.

The best thing was the bibimbop... chicken was ok - a bit too greasy for my taste. pork belly was not flavorful and waaaay too much green onion.. and almost raw garlic cloves??

interesting, expensive for the food, meh"}
{"text":"Modern take on Korean food.  The spicy rice cake is delicious, particularly because of the deep fried seaweed rolls with noodles, DELICIOUS.  Short rib was also really, really good.  I love the take on Korean cuisine.  Only thing is it is a bit pricey for what you get."}
{"text":"Where to start?   I was impressed when I looked inside while on the street.  It looked kind of cool, and wasn't busy.  It was a Sunday evening around 7:30 pm and I was coming from a relaxing afternoon of being pampered at The Four Seasons Hotel.  There was two of us, and the restaurant was almost empty.  The hostess insisted on seating us near the door as it was a table for two.  It was cold, and i didnt want to sit any where near the door.  I almost has to arm wrestle her for a table for four, away from the door.  First mark against Miss Korea.   She appeared less than 10 seconds later to take our order without giving us a chance to even look at the menu.   Her communication skills were weak.  ESL was definitely at play so I give her an A for effort.  The food was mediocre at best.  My dish was so spicey I didn't really get to taste any flavour.  I had a chicken dish that I don't remember the name of.  My partner had a traditional hot bowl and he enjoyed it.  Our appetizer was unique and tasty.  It was a chicken/crispy vermicelli roll that was done to perfection.  Great texture and nice flavour.  I might give them another chance, however, with several other Korean choice within a block, it will go on the maybe list."}
{"text":"UPDATED REVIEW.

We were the only table (2pll) in the restaurant 
I ordered a soup -kimchi soup 
I TOLD the server that I was vegetarian so no beef or chicken or anything other than tofu. 

She brought me a soup... I tasted and it tasted strange... 
I asked another server to please ask what time of broth was in my soup, what was the base... 
and guess what. It was beef... BEEF 
If you are vegetarian/vegan 
You know what this feels 
I literally felt sick to my stomach. Then she was like oh sorry I'll make you a new one and went to the back of the restaurant to tell the chef and the other server what had happened and they were laughing... 
I obviously told them I didn't want anything else and left.
What would have happened if I was allergic to meat? 
This is unacceptable. 
I'm so furious. 


The food was really great, lots of options for everyone! They have vegetarian dishes, seafood dishes and lots of beef and pork dishes. 

They have a decent selection of alcoholic beverages.

It gets busy so make a reso.
Service is ok."}
{"text":"Does not take takeout phone calls, does not explain why , just hangs up, very bad customer service"}
{"text":"Alright so back in TO for the first time in two years and it is good to be back for sure but I wish it was not so cold. Anyways got off a late flight at Pearson and met up a buddy who had not eaten since 1 so he was ready to grab some food. He mentions that there is a joint over by Yonge & Bloor which is an area that I have good memories on from my adventures a few years back. We head over in the freezing weather and find parking on the nearby streets which was still busy even though we showed up pretty late. We walk over to Miss Korea which is a relatively new spot that has opened up in this area and serves up a variety of Korean eats. The décor is simple and clean with the small tables but they have tried to make it look more modern. I found it strange that there was a bottle of Johnnie Blue on display at the front but moving on.

We are promptly greeted and told to sit wherever we please and there were a few large groups out and people kept trickling in till even after we left at around 12:30 AM. They have the standard adult beverages and of course we went with soju to kick off my return to TO. After looking through the menu we decided to order the Pa Jeon, Spicy Pork Dup Bap, and the budaejjigae. I would say all in all the food was good but nothing spectacular. I think this joint is more of a bar then an actual restaurant for dinner which was solidified with the lack of banchan also. With that said all foods were fine and definitely a great spot to catch up with a friend or even a group if you have one. The server was very friendly and even joked with us towards the end of the night so appreciate that.

All in all, a joint that is fine to check out but I think I went with the wrong expectations of it being a restaurant probably. Would still not be opposed to hanging out here again but would also search for more interesting joints."}
{"text":"I really like Miss Korea, the staff are very friendly and the food is delicious with good presentation! There are a few things that sets Miss Korea apart from other Korean restaurants: firstly it's a bit more expensive than what I have generally found I pay, especially for the amount -- the portions are not small but not big, and I have been multiple times and have only once been served sides- or rather *side*. The sides are generally one of my favourite things about the Korean food experience, and have been a standard fixture at every other Korean restaurant I have been to in Toronto's Korea Town, or anywhere else for that matter -- but this restaurant is on Yonge Street and seems to be a bit more focussed on the social aspect of food as opposed to relaxed dining. As this is the case, I often order to go as the music can be quite loud at certain times. Having said all of this, I do really like Miss Korea, it's close to where I live so it's convenient and settles well as its not too heavy. 
I generally order a tofu Bibimbap, and my husband really likes the grilled pork belly. For the two we pay $32.66 before tip -- which is way more than we are used to paying at other restaurants."}
{"text":"Miss Korea needs to staff up.  The last two times I've been there was one girl working the entire restaurant.  Even two is not enough.  She was busting her butt to keep up.  Some people left in frustration.  Food portions and recipe were not consistent between visits.  No banchan provided.

Will give it one more shot.  If they don't improve, its likely I wont return."}
{"text":"First of all, if you take off the lid of the seats, you can stuff your coat in it. I didn't discover this until I saw another customer do it( I was super surprised lol). Got the spicy rice cake and kimchi pork pancake. The rice cake came with a fried vermicelli roll and 3 dumplings.  The roll felt too heavy and greasy, the dumplings were dry. The rice cakes were on less sweet than what I'm normally used too,and the rice cakes themselves had the texture like the frozen ones bought at T&T.... The pancake wasn't great either, with very little pieces of pork. For the price I expected bigger portions or really good food...
Also this place doesnt serve banchan(side dishes) with the orders"}
{"text":"I lived in Flushing (NY) for a year, so I know what Korean food is supposed to taste like. I currently work in Toronto and after I tried a few \"Korean\" restaurants on Yonge street, I knew right away that they were Chinese owned. I was hesitant to try Miss Korea because of the so-so reviews, but I was surprised. This is legit Korean food!

My go-to dish is the sam gyup sal (pork belly). You can see the grill marks, so you know it's good. They give you the bean paste instead of soy sauce like the nearby restaurants. It tastes just as good as the Korean BBQ in Flushing, minus the work of grilling it yourself, and the pieces of pork are thicker. The tofu salad is good too.

I've only been getting take-out, but the service has been great."}
{"text":"You'd think all the restaurants along Yonge St. are either really old and tacky, or just gross. But I'm so glad I can say something different about Miss Korea.

A friend had brought me here at lunch saying that he knew the owner. The decor is absolutely adorable where you can store your purse in your chair! 

I had gotten the Bulgogi Beef Dup-Bap which was around $9. ALL DAT BEEF. It's making my mouth water just thinking about it now.. It comes in a nice hot stone bowl with lots of beef and a couple of vegetables mixed in between. The taste is amazing and I would definitely go again for this. 

The one thing that won me over was their Soju Popsicle. Basically a freezee, but alcoholic which makes it the best thing. 

This is a great place to stop by for lunch, and if I'm around the area, I will stop by again."}
{"text":"I've been here a few times for drinks with groups of 5-6 people. As a Korean, I think this place isn't really for having meals; it's more like a Korean izakaya. We (at least for me and my friends) only go here if we are planning to get pretty intoxicated that night. There are many other places like this in Toronto, too. Compared to other places, they are a bit more expensive and portions are smaller. Their drink menu is also pricey. $14 soju is considered expensive.

I've tried some dishes here including donkatsu, seafood pancake, and mussel soup. When I had the donkatsu, I was super hungry so it was pretty damn good. The size of it was really big so it was good to share, but when you are with 4 other starving men.....you only get to have one pick at it before it's gone. 

Seafood pancake was okay. The taste was kind of as expected. There were only 4 pieces - too small for it's price. I think my favorite out of all was the mussel soup. It's enjoyable, spicy and goes really well with alcohol. Especially, when you're drinking just soju. 

Overall, the dishes were all pretty good/enjoyable. But not to the level where I would go back with cravings. The reason I keep returning, though, is because of their vibe. I like their interior details, setting, lighting, etc, although it can get pretty packed and loud. 

The tables are very cute. The seats are not that comfortable to be sat on for hours (since it doesn't have any back support). However, I really like that you can store your belongings inside the chair! Just lift the cushion up and you can put your stuff inside. It guarantees security and clean, safe passage. 

So, in closing, the food is good, but not the best I've had, and a bit expensive. The atmosphere, however, complements the drinking/hanging out/dining experience, and tends to make me want to return for that."}
{"text":"Food is really good. quality of the place in general wasn't the greatest. tiny seats and tables and all the seats were already ripped. again food was delicious and I will definitely come back"}
{"text":"I went Miss Korean on February 25 at 11:40pm. Bad server ever. I ordered pork belly salad as appetizer on the menu price is $8 but server brought out pork belly salad as I didn't know that my order because it's look totally same as pork belly and salad ,after I ate and asked for bill, it cost me $61, I ordered app $8 with 2 main $30 the bill suppose to be $50.First happened the server didn't want to give me a bill, till I asked for it and then I looked at the cost each order finally I found out one of them she charged me wrong price which is a pork belly salad as a main course not appetizer this one cost me $20 , I asked her..... what she said you already eat it also you ordered it. Didn't even say sorry that she took the wrong order.. Dammm have to be careful with the bill before you pay for it...."}
{"text":"This is the best Korean restaurant in the neighbourhood. It not only has really good food, but the atmosphere is great and they play good music. The restaurant is always packed with Koreans, which is a good sign. The quality of the food here is better than anything you'll find in Korea town. 

Some of the best things I've tried here are the bulgogi beef bun, kalbi steak, and the steak dolsot. Steak Dolsot is a hot stone bibimbap but instead of regular bulgogi meat they put steak! Worth that extra dollar or so. 
They also have food + drink combos that are pretty good deals. 

This is the type of restaurant you go to with a group of friends at night and you guys can order drinks and food to share. The restaurant actually closed for a friend of mine who threw a party there. They didn't even charge for renting the place, just for the food! Of course, if you are going to ask them to close the restaurant, make sure that a lot of people will come. It was a really good party and the staff was awesome!

The only thing I don't love here is that in the winter it gets REALLY cold by the door because they only have one glass door, so don't sit near the door unless it's summer!"}
{"text":"did not expect anything from Toronto's Korean food but this place was pretty good. the budehjigeh, spicy jokbal was really good and we got the yuzu flavored soju. everything was really good and you get French fries as service."}
{"text":"Went here tonight to order spicy rice cakes to-go. It was my first time at Miss Korea and upon entering, I wish my plans included dining in! 

The place was fairly busy (5-6 groups of people). The tables are pretty close together and it's somewhat hard to maneuver yourself towards the door. There's apparently an upstairs too but I believe it was still closed off. The atmosphere/vibe was awesome and so was the music playing. 

The waitress/hostess was really sweet. I didn't bother looking at the menu since I knew what I wanted. The portion was decent, a great sharing plate for two. It also comes with a side of some sort of fried dumpling and fried sushi with cold noodles inside. I apologize, I'm not too familiar with the actual terminology/name. 

The price came up to roughly $13. Kind of steep but considering it's more of a 'bar' I semi get the reasoning. I'd price is closer to $8-$9. The food however, was not bad. I've had better spicy rice cakes but this satisfied my craving. 

Actual rating 4.5/5 stars. 

I would revisit Miss Korea in the future."}
{"text":"There are several things I want to leave a review about this place. 

I live about 2 min walk from Miss Korea and it is located at a very convenient location.
I go to this place quite often. However there are several times where I was not pleased with their service. Their food and atmosphere of the place is satisfying. However there has to be change with the waitresses working there. Most of times I would not even bother taking to them because they are very rude first of all. However there is this one waitress where I had two incidents where I really had to make a complaint to the manager of the place. 

Last week she even was very rude to my wife and her friends so I decided to leave this review. 
I am satisfied with their food and location but staffing definitely needs to change in order for them to attract more customers."}
{"text":"I came here on a Friday night with a friend around 9 pm and it was busy, but not too crowded. Lighting inside is a bit dim but it's supposed to match the fun/youthful/hipster atmosphere that it tries to make so whatever. Me and friend actually found the music too loud so we requested if we can go on the second floor and use their reserved room to get away from the music but they declined us so that was a bit annoying since that space wasn't being used anyways. The table and seating is a bit tight but it is a small restaurant.

I ordered the bibimbap and the portion size was reasonable  and there was an average amount of meat + vegetables. The price was about $10 so it's average; nothing too expensive or cheap. Service wasn't that great; we were constantly trying to get the waitress' attention. I'm sure if she wasn't constantly talking with her coworkers, she would've noticed my hand waving around. I didn't enjoy the atmosphere, loud music, or food that much so I probably won't come back."}
{"text":"My sister loves this place! Probably comes by once a week, once every two weeks!

The hot pot for two is a great deal! Lots of food that can probably feed 3 (assuming you aren't  huge eaters - just regular eaters).

When it's not hot pot time, my sister says they have really good Hot Stone Bibimbap - which is what she typically gets."}
{"text":"I went here at 1am since I wanted Korean food and this was the only one that was close by and still open. I unfortunately went sober. Had I been intoxicated the spicy pork ( I think there was meat  in the red sauce ?) on bland rice may have fit the bill. Also  The restaurant says it is open till 3 AM but when I got there I was told that the kitchen was closing in two minutes. Not one but two minutes. I quickly ordered, ate about a quarter of it and left - this restaurant is an easy one to give a pass on."}
{"text":"If I could give this place ZERO stars, I definitely would. In fact, negative stars would be more appropriate. Let me explain. 

1) Went to the washroom, there's a stream of dried up light brown residue over 30% of the washroom floor, stemming from the toilet plunger. Clearly someone tried to fix something and after they did, they didn't bother cleaning it up.  I just walked in and walked out. I cannot. I was absolutely HORRIFIED. 

1b) The waitress started taking our orders and after 3 orders she decided that it was a bad idea not to write it down so she runs downstairs to get pen and paper 

1c) if you ever wonder if that little buzzer that's supposed to signal for service  actually gets you any service ...well  it doesn't. Pretty much pressed the thing 130000 times and nada. Don't waste your finger strength.

2) Ordered cheese katsu for $12.99 which isn't particularly a bargain.  It came with a giant bowl of rice and some...soggy salad and lumpy salad dressing. The chicken katsu was so hard and overcooked, at some point in time I asked myself, is this deep fried beef jerky or something. After halfway though,my stomach just couldn't handle how much digestive power it's going to take to break down this crispy beef jerky so I just gave up eating it and started playing with my food. I pulled apart the cheese and breading and to my dismay, I started seeing little pieces of hair, around 1 inch each. AND THERE WERE MULTIPLE PIECES!!! HOW IS THAT EVEN POSSIBLE. Did someone just decide to shed on my dinner?!? As for the other menu items, nobody at our table sounded like a fan of the food.  

3) Private room advertises karaoke but when we got there, they said that the machine is broken. For some reason I feel like it's just permanently broken but fine sure.  

4) When it came to splitting a group bills, we'll you better make sure that at least you know how to do math. After everyone paid around $150 for drinks, they tell us that were short $100 and we had to show proof of payment. Unfortunately for some people who pay cash or just don't care to keep the reciept, then you're in trouble.  After we all hashed it out and walked back to the cashier, they decided to tell us that they messed up and counted wrong.  Well...I'm not even sure how to respond to that one."}
{"text":"During weekday peak lunch hour there was 1 cook and 1 server in charge of the whole restaurant. The owner obviously doesn't care about staff just wants to squeeze every cent of profit. Poor server had to run around carrying food to over 15 ppl, and didn't even have time to clear the other dozen or so empty seats and tables of the leftover food from patrons who had left long ago. Cook is working his ass off cooking for those sitting down and for takeout orders. We had to wait 40min to get our order of two soups, which were mediocre."}
{"text":"- service was meh
- crowded and seats weren't great
- got the spicy rice cake and the flavour was really good but it was hella spicy..."}
{"text":"One of the best bibimbap and kalbi in Toronto. However, sometimes the service is slow because of the line inside"}
{"text":"Killer Bibimbap and Dumplings

Definitely a great find that took me way to long to identify. Possibly my most favorite Korean joint in town!"}
{"text":"BEST korean food (I'm korean) & BEST service & BEST atmosphere for dine-in/late night
I've tried their spicy rice cake, white noodle soup, fried chicken with spicy oil, soy garlic, and sweet spicy sauce, & EVERYTHING was heavenly.

I've been looking for such a place where I can taste what I used to eat back home in Korea. 

Authentic, fusion, & deep, elaborate flavours - finger licking

love you, thank you! NO wonder it's crowded even if you go on Monday 1 AM :D"}
{"text":"Cheap and cheerful joint here at Miss Korea! My husband and I had a great meal, ordered a bottle of soju that goes down waaaay too easy (it was infused with grapefruit and you can't get it at any LCBOs) and three dishes for $65 including a 20% tip, so how can we really complain? Also, they give fries for free as an appetizer which won me over instantly!! 
Service - excellent! Our server was very pleasant, attentive, and helpful with the menu! 
Food- Jjampong was good, very spicy!! We would have liked perhaps some more noodles, but once again, good amount for the price! 
Pajeon- much more healthy tasting than at other restaurants. It was more like an omelet than a traditional flour made jeon. 
Chicken ddup bap - spicy and yummy! We ordered another side of rice because apparently we are carb monsters! 
All in all, good bang for your buck, and a cute little Korean joint!!! Thanks, staff and kitchen!! Fighting!!!!!"}
{"text":"What I got: Spicy Pork Rib 
Cost: $19 incl tips for takeout
First impression: not good considering they gave me kimchi in a sauce cup (probs like two pieces). And this is the first Korean restaurant I have been in Toronto, but places I have been to outside of Korea gives you decent amount of other side dishes. Here I got a sauce cup of Kimchi. 
Taste: The portions quite big for one meal. But then again it is a bit pricey for what it is as are many korean dishes abroad. I definitely like when the bean sprouts are not smelly. Undercooked for texture is fine but it should not have that smell if cooked right. Definitely not the flavor I was looking for in spicy pork rib. I kinda enjoyed it but why spend money on overpriced average korean food."}
{"text":"This place is very small; it can probably fit about 20 people max. It has about six or seven tables on the first floor. The second floor has no dining space; it's just washrooms. Some tables are close to the front door so on a winter day, it can get cold with winds blowing in. 

We had Bibimbop, Spicy rice cake with deep fried seaweed rolls and Don katsu. Spicy rice cake with deep fried seaweed rolls was so good. Highly recommend it if you know what spicy rice cake dishes taste like and if you enjoy them. 

Service wasn't very good and it may be difficult to get the server's attention. 
It seemed like a popular place for twenty something Korean crowds."}
{"text":"Let me start this review by saying that if it wasn't for this establishment opening until 2:45am, my boyfriend and i would have never went. & this establishment is pretty much racist if your not Korean or Caucasian. Save your money don't come here.

I was visiting Toronto when we stopped at Vapor Central (aaaamazing smoke lounge). We were pretty hungry on a Saturday night but not much is open late unlike NYC. I found Miss Korea on yelp and was interested in the cuisine and nor importantly, it was opened late. 

To begin the horrific experience we had, when we walked in, we were ignored by the staff who pushed around us and acted like they couldn't understand that we were asking for a table for 2. After getting seated, our waiter disappears for about 15 mins leaving us unsure on what the service would be. When the waiter returned, she was very pushy and did not spend any time explaining the menu that was mostly in Korean. After finally deciding on the chicken wings and the beef (the combos that come with a drink), our waiter returns with our drinks. To begin, the plum wine is absolutely disgusting. It literally tastes like you're drinking perfume, absolutely horrible. After trying to get our waiters attention for about 10 mins I made my way to be back counter/kitchen when i asked to have my drink replaced or returned because i was not going to drink it.

Again i was pushed around by the staff who again acted like they couldn't understand my english. i was told that they could not replace but would offer me another drink. by the time we got back to the table, my waiter informed me that i would have to pay full price for a new drink, NO WAY IN HELL. so i decided to keep the perfume flavored drink and drink 1/2 of my boyfriends 4 Molsens.

after waiting for our food for another 25 mins, the waiter only comes back with my boyfriends chicken wings, my food is still MIA. After another 15-20 mins, my boyfriend has eaten his entire meal and mine still is yet to arrive. Fed up once again, i go to the back counter and ask where my food was, to my surprise the order was never rung up.

At this point I'm ready to leave. The restaurant offered to get me a to go place which i accepted but there was no comp for their forgetfulness. 

This establishment is rude, disgusting, racist, and over priced. Waste of $71. 

save your money don't come here"}
{"text":"I literally just reviewed another restaurant in NYC called Miss Korea.  For a moment, I thought it was a chain but I don't think so.  It's just a coincidence!

Had lunch here and went with the Miss Korea Bimbimbap ($8.95).  I wasn't really in love with it.  Everything was just kinda cold, limp and flavourless.  Extremely tiny portion of kimchee on the side and no sides either.  

I'll trek into Korea town for my next bimbimbap fix thanks."}
{"text":"I was looking for something to dislike it honestly couldn't find a thing. I figured it much be sub-par given it's not in korea town but so so glad I'm a jerk and that I'm wrong.

I had the pork bone soup. Broth was awesome. Super peppery, big chunks of meat that don't feel over boiled. Fresh cabbage and spring onions. It just came together really well. Likely one of the best pbs I've ever had.

Service is really good. The waitress is very attentive and is constantly looking for ways to help you make your meal better.

Definitely will come back!"}
{"text":"I ordered the bulgogi with rice, and it was okay. I found the seasoning they used wasn't particularly great, but I enjoyed the meal. Service was very poor. After delivering my meal to me, they did not come to check if everything was okay, nor did they refill my drink. After finishing my meal, I sat around waiting for ten minutes before I finally had to flag someone down to take my empty plate and bring me my bill."}
{"text":"I have a love hate relationship with this Korean bar because it's a super fun spot for a group drinking party but sometimes the service is less than nice. It has an industrial vibe with food prices slightly higher than the average Korean joint, and is a popular hang for foreign students.

The party room on the second floor fits 15 people and can be booked for 3 hours provided that the total spending was $250+ - not hard at all. The decor is like an office meeting room, with chairs around a large table, a flat screen TV for the karaoke system (standard machine + book setup with decent amount of English songs), and a wireless phone to call in our order downstairs. They have a good selection of Korean alcohol and dishes for a decent price.

While the service is generally polite and efficient, there have been several visits where the staff were quite curt and impatient. Either way I still go there often enough because of the great food/drink combos."}
{"text":"Their pork bone soup is very salty and I got tummy-ache after having the soup...so is my friend. I would not go back there again."}
{"text":"Food was pretty good and though there are better places for Korean food near by, they allowed us to purchase beer for take out on the weekend at 10 pm when most liquor stores were closed¡!!;)"}
{"text":"I've tried this place twice and their porkbone soup both timers were either extremely spicy or their cabbage came frozen... it is however in a location that's convenient compared to making the trip to bloor and Christie but I have definitely had better for less."}
{"text":"I work nearby and came here for lunch with a few friends. The portions were pretty small and the overall food wasn't that great. I ordered the bibimbap and I've never actually had Korean food that lacked that much flavour. The service was good though."}
{"text":"I ordered the spicy tofu and seafood soup, and it was absolutely delicious. The wait staff were friendly and fast. The only issue I have with this place was the lack of appetizers. The best part about going to any Korean restaurant is the delicious appetizers that are usually served, however Miss Korea only offered us one tiny plate of kimchi for the appetizer."}
{"text":"yam?I like here!
but little bit lazy staff....

??????????????
?????????????????????????????????????????????

????????????????????
???????????????????????????????????????????????????...
????????????????????"}
{"text":"I ordered the take out of Kimchi fried rice, Kalbi steak, and Spicy and Sweet Chicken Wings. I waited for more than 45 mins for these. They gave me the wrong sauce wings, I ordered Spicy and Sweet but they gave me the garlic wings. And the rice is like conjee, too much water. Worst experience."}
{"text":"We decided to try out the newly open Miss Korea (@MISSKOREA_BAR) on Yonge & Bloor, nothing better than a bit of shopping before a meal. The space is definitely different from the Korean Restaurant that we are used to in Toronto. It's \"hipper\" looking with the round stainless steel tables and stools where you can open up to store your bag/coat inside.

Just like most Korean restaurant, they have a few Combo to choose for where they include some alcohol drinks ~ choose from Soju / 4 Beer / Makgurli / 2 Cocktails

We end up ordering 3 combo with 2 Makgurli and 4 Beers (#KoreanDrinking)

Deep Fried Chicken Ddong-Jip (Gizzard) 
~ $23.98 Combo or $10.00 Regular
~ We usually order the sweet and spicy DF chicken but since all of us love gizzards, this was an obvious choice. 
~ Love the crunchy texture of the batter with the gizzards and love how the sauce is served on the side which left the gizzards crispy for longer.

 Kimchi Jjim (Kimchi & Pork)
~ $27.95 Combo or $15.00 Regular
 ~ This was definitely different from what I am use to with the steam pork belly and kimchi. The kimchi here somehow lost it's spicy and sour flavor. 
~ But love how it's served with slices of fried tofu which gave the whole dish some texture. 
~ Just have some of everything in each bite and it'll be perfect.

Kalbi Jjim (Braised Short Ribs) $18
~ Braised Short Ribs, Squash, Chestnut, Date, Pine Nuts
~ A very traditional dish, it was my favorite dish of the night and with a bowl of rice each, this can easily feed 2 people. 
~ The short ribs were cook to perfection, melt-in-your-mouth goodness that's packed with flavors.
~ I was basically drinking the sauce, so good!!!

Sam Gyup Sal $15
~ Grilled crispy pork belly, home made relish
~ Perfect grilled mark and cook just right without being too soft (still have that springy texture to the belly fat) 
~ Just give me some lettuce to wrap it in and it would be perfect.

Jjamg Bbong (Spicy Seafood Noodle Soup) $13
~ Calamari, shrimp, mussels, scallop, udon noodle, onion, watercress
~ This was the only remotely spicy dish dish of the night and the perfect drinking food.
~ It's nice to have udon for a change instead of the instant noodle/ramen that's usually used.

Cheese Don Katsu (Pork Cutlet) $13
~ Deep Fried pork cutlet with cheese, signature katsu dip
~ This was ordered at the end just to have something to munch on with our drinks and this was probably the only dish that I didn't like that night.

Miss Bomb Cocktail $9.00
~ This was their signature cocktail and it was complimentary

Private party room upstairs, karaoke machine included. 

Verdict :
~ Love everything except there's no free side dishes here
~ Very well priced for both food and drinks.
~ Will love to go back to try the other dishes or just for the Kalbi Jjim again

P.S : We went on a Friday night and the place start to pack up rather quickly by 9:00pm"}
{"text":"It took 30 minutes to make a take out order here. It was just one tofu soup. Like wtf"}
{"text":"DO NOT GO. It's THE WORST experience I have ever, and I could ever get. So I was visiting Canada for the first time and that day was my first day in Toronto. My friend brought me there because he lives across the street and it was still open late at night. THE SERVICE is the most HORRIFYING. After I paid with my card the waitress gave me a despise look probably she's not satisfy with my tips. So when I got home I realized I lost my glasses and I'm pretty sure that I left it at the restaurant. So immediately I called to ask if the waitress could find it. The waitress didn't even pause to look for my glasses and hung up rudely. So I decided to go there to check for myself. When I got there the waitress act weirdly. When she saw me she immediately come up to me and ask what am I looking for and won't let me step into the restaurant and search for my stuff. I suspect that maybe the waitress hid it from me because she's not happy with her tips, but then I told myself no one could be that evil. I felt so bad because that means i can't see clearly for the rest of my trip.
Since I'm pretty insisted that the glasses was left in the restaurant, I returned the next day morning. There was another waitress working so I ask her if I could talk to the manager and if she know the waitress who worked the night before. She refused to tell me anything and said I could just talk to her. So I just said I need my glasses back. AND IT'S THERE. I could've report her for STEALING by hiding away customers' properties. 
In terms of food, we ordered fried chicken gizzard and bugogi hotpot which is greasy and spicy - taste like your typical Korean tofu soup but nothing like bugogi. The ingredients especially the beef and the gizzard are bland. I believe there are much more better options for the price of $50"}
