{"text":"They used to have great wings.  I have tried them twice in the last six months and they are now small, over cooked, and under sauced.  You would be better off getting wings at BW3 and that is saying much.  The server was great and the beer was good but that was the only saving grace.  There are way to many bars serving better food than this in the area.  Do yourself a favor and go somewhere else."}
{"text":"Nothing flashy but good food and GREAT Sarver. Thanks, Shannon!  
We're first timers and will definitely be back. A beer a beverage a sandwich and a special for under $20!  Really comprehensive menu which usually makes the food suffer - not so here. 
Be back soon"}
{"text":"My friends and I came here for our monthly pierogi outing and man is this place cheap in a good way. On Saturdays they have $2.50 Bud Light or Miller Lite Pints and they have $6 small red or white pizza's up to 2 toppings! What a steal deal!

The pierogies here are absolutely delicious and my pizza turned out great. My friend ordered the broccoli bites and unfortunately these were a fail because they had bacon pieces in them and that was not stated anywhere on the menu. We were thinking these would be a vegetarian item and they were not - in a bad way.

This is a great place for locals. I think we were the only first timers."}
{"text":"Volleyball! They have leagues almost every night in the summer and it always draws a pretty good crowd. I've played the last few seasons.

Anyways, the food is above average and they have specials on weekdays. I know Mondays are $0.40 wings which are decent sized and flavorful. Wednesdays they have $5 small pizzas which are not too shabby either. Check out the happy hour food specials also for a reasonable deal. 

The only thing I wish they would improve is bringing on more drink specials. I guess the volleyball crowd is going to drink anyway though so maybe they don't really need cheap drinks. Not that it's expensive but there are better deals to be had.

The bartenders are very friendly here and always greet you with a smile.

Large patio area is great for a warm summer/spring evening."}
{"text":"It's close to home!  So I've been going there for the last 6 months almost once a week.  Yesterday 6.25.13 I finally decided that's it, NO more, and yesterday I actually received silverware which surprisingly I had to get on the last 5 visits myself.  It shouldn't be to hard for a server to notice that when they bring Your order that there is NO freaking utensils on the freaking table!!!!  But yesterday I got surprised, at least with the utensils. 
The Food has been very inconsistent and the orders have been taken wrong on more than one occasion.....I always raved about their Wings to my friends but was so disappointed by the sauce last night which tasted like hotsauce mixed with Ketchup when in fact it was supposed to be Hot BBQ, mixed with the fact that my drink sucked because the syrup was low, out and nobody cared or noticed it.
Cleanliness during the syrup change left much to be desired as the hose (coupler) was dropped on the dirty floor where it remained during the swap of boxes and got kicked around to pick up some more stuff."}
{"text":"Came here for a work happy hour. Not only did they give my credit card (which I started a tab from) to another patron, nobody admitted fault and essentially carried on as business as usual. The waitress then actually tried to convince me I had closed out and to \"check my pockets.\" Will never set foot in this place again."}
{"text":"Went to Mitchell's Tavern on 3-5-17 around 12:00 for lunch w/3 friends.  I ordered the steak sandwich w/grilled onions & mushrooms, lettuce, tomato and French fries--$9.00 (minus the bread and fries).  Steak very tasty and prepped as ordered.  Service was good although there was only one, yes--only one overworked waitress.  As time passed, the place filled up--still, only one waitress & bar tender on duty.  Waitress deserves a substantial bonus from owner for not throwing up her hands and walking out the back door.  The place was literally packed.  I almost stayed behind after eating to help her bus the tables--I wish I would have.  She was working like mad and still was nice to everyone.  Still, this is a good place for burgers and steak sandwiches. Free popcorn.  Clean restrooms.  Nice neighborhood hang out."}
{"text":"I met some family at Mitchell's for an impromptu dinner and it was great. I ordered a burger and it was huge and delicious. Other people ordered taco salads, pizza and I forget what else. It was super traditional bar food but definitely good traditional bar food. 

The interior is classic townie bar, but the big twist on Mitchell's is the sand volley ball courts in the back. That's right: SAND VOLLEYBALL! Right in the middle of Westlake:) This recent California transplant was thrilled to see it and I can't wait to sink my toes in that mess.

The service was really great and they were hustling on a very packed night. I'm looking forward to going back for another fun night and good food."}
{"text":"The place is great the food is wonderful only complaint is drinks are served in tiny glasses and drinks are way too strong !"}
{"text":"Went Friday for the fish fry, husband liked it.  I had a burger.   Would go back.  Feel it could use a little cleaning and the kitchen staff brings out the food feel they could dress a little less dirty looking.  But all in all would be back food was good can't wait to try the wings."}
{"text":"Wing review only, pretty good wings here and didn't try anything else. I had hot with Cajun seasoning and was satisfied with the outcome. My friends enjoyed their wings as well. The place seemed pretty popular from what I could tell."}
{"text":"Mostly just play volleyball and drink here. The people are always nice and on the few occasions I've had food it has been very good."}
{"text":"My experience is the food has always been sup par but not bad enough to complain in a public forum.  Recently I ordered a chicken wrap, it actually tasted pretty good until I damn near chipped a tooth by biting into a plastic bag tie that somehow made it into my wrap.  If the cook had bothered to come out and apologize I wouldn't have written this review.  The barmaid was the only person who apologized.  The wrap was removed from my bill but they didn't offer to pay for our drinks.  I feel fortunate that I didn't swallow it, could have caused a serious medical issue."}
{"text":"Great food. Love watching browns games here. Right around the corner from my house, take the wife and kids when we're looking for a greasy meal, which is all too frequently."}
{"text":"They use child like glasses to sever their liquor. The staff complains about their job but seem nice. Crowd seem happy. Back bar looks cluttered and present dirty. Manager on preg. Leave.  Dark and if they want a dive bar look they achieved it.  Chairs torn not a good place. Don't see any reason to come back
 Chef looks sloppy when he shove the food jacket to you as though you are putting him out. Overall impression sloppy and dirty.  Sign says they charge you for a credit card under 10.00."}
{"text":"Several months ago, this would have been four or maybe three stars.  I mean the service kicks butt!  The wait staff is friendly, fast, attentive, fun...most other restaurants could learn from them. The space is ok.  Just ok.  The new menu is expensive.....$60 bucks for four sandwiches, fries and soft drinks.  For average to above average bar food this doesn't work for me."}
{"text":"Great burger.  I don't think you can go wrong with this place, especially when the weather gets nice.

Enjoy a few beers, take in the ambiance of a roadside bar, and take a load off while you get into the mood for some decent bar food."}
