{"text":"Wow!  What happened to this place!  It used to be a great place to go to to enjoy a really good fresh fish meal.  Not any more!  I have 2 reviews.  1) My Dad and I recently went for lunch on a Thursday.  There were maybe 10 groups in the whole restaurant.  We were seated in the back of the restaurant.  It was stinky, & hot.  No air circulation at all.  We told our waitress, they did try to solve that problem by turning down the air conditioning.    It was almost comfortable by the time we left.  I had to call our waitress over from another part of the restaurant to place our order after a 15 minute wait after that.   As for our food, really just mediocre at best.  I always order iced tea for lunch, it tasted old.  The cobb salad was really just chopped fish in a mayonaise mess served over lettuce. I ddn't expect mayonaise!  My fathers gumbo was good, he was satisfied.  Waitress was nice, just unattentive.   Also, kitchen and restaurant were very noisey.  Dishes breaking, things dropping right next to us at least twice, no appoligies for noise.   2)This past Sunday my husband wanted to go to sit at the bar and grab a quick meal, which is something we often did on a weekend night with no hesitation.  I strongly tried to persuade him to go elsewhere after my last experience with my Dad.   We love when Terrie is working there, she gives great service and is great to talk to.   She was not there this Sunday.  Our bartender was really unattentive and seemed bored to be there.  Never talks to you, short quick answers.  The restaurant was not very crowded, we got a seat at the bar right away, it was early also, before six.  It started to fill up as we were sitting there.  Maybe six more people came while we were there.  Bar was still more than half empty.  It took a long time to get our drinks (15 minutes), and a long time to get our order in, (20 more minutes) and a long time to get our food (25/30 minutes).   The bartender spent a lot of time talking to other employees with her back to us.  My husbands shrimp tasted fishy, salad tasted old.  My salmon was just ok, nothing special, not bad though.  All in all, It used to be a great place to go to for a nice meal.  Now its too pricey for just mediocre food and mediocre service.  We will definitely go elsewhere.  Mitchells has gotten old and tired!!"}
{"text":"Quality food is low my shrimp and scallops were bland  and overcoat it came out about 10 minutes after the first dinner was served I think it was just  left under the heat lamps.  My wife's dish came out completely wrong Manager did not charge us for those two meals but it still seem very expensive."}
{"text":"Chilean Sea Bass Shanghai Style = Heaven on Earth I think about it often. Yum  Also great for business dinners/meetings - they have a few private rooms which are very nice and quiet for a larger group."}
{"text":"i really like this place....nice ambiance.  The food is well seasoned and the seafood is fresh.  The wait staff is particularly good."}
{"text":"Awful Experience from a Landry Location. Our server Ashely looked like she had taken one to many Xanax. She could barley stand up straight. The food took forever to come. Not cooked to my liking also. But when my 7 and 9 year old kids ask \"Daddy Is the waitress sick\" it's a fucking disgrace.  So pathetic. She's a druggie and the restaurant was awful."}
{"text":"First I would like to say that I was hesitant coming to another fish place recommended by some temporary coworkers since the last place they sent me to made terribly ill.  That being said, I came here and was delighted by my server Michael who was not only friendly but incredibly attentive and very sharp.  I originally ordered the Mahi Mahi but alas, the ran out upon my ordering, in which case the manager promptly came to ask me for another upgraded selection at no additional charge. Hence, the tuna.  Now the tuna was amazing. Seared almost perfectly, with the rare flavor still intact.  I would most definitely come back again and if I lived in the area, this would be one of my top spots."}
{"text":"We went here for my Mother's birthday, and the experience was overwhelmingly--BAD! From the time I picked up the phone till the time we left, we dealt with a company that could care less about what garbage it puts out in the world.  I will start with the confusing reservation, we had a semi-large party (10), and it took about seven phone calls (I just counted from my call log) to actually get a reservation. After finally speaking to some \"party planner woman\", who when I finally got to speak with her went off on an anti-government tangent like the ramblings of a nutcase (any sane person would be ashamed). I actually had to ask the woman a second time to repeat her story so as to make sense of her crazy anti-government taxation narrative. After a second run with the story (I THINK) that she was blaming the government because we needed to pay a 3% charge on the room we reserved, and the tip could not be included because of the government.  It was literally the ramblings of craziness, I personally try to keep my politics out of making reservations. After that I almost cancelled, but being I live in New York I really did not have the knowledge to keep looking around for another place to have the birthday. We finally confirmed this reservation, but not without two messages being left on my phone by other staff members that sufficiently lacked phone skills. It sounded like a message left by an angry high schooler that was trying to bully me. The only person that I spoke to with any restaurant or phone skills was a man named Jay.   We got to the place and the one hostess made the only gesture of kindness from this entire experience; she took the cake that we had brought so that we were not standing there with it in front of the place. When we got to the room, it was called the \"captain's quarters\", and it smelled like a dirty mop. I asked the waitress to get us some candles to mask the smell, but of course she could not find any.   Our waitress was horrible, one of our party guests never got a refill on his drink, nor were others asked if they wanted more cocktails. She left appetizer plates on our table for way too long, even when our main dishes came up; YUP still have those appetizer plates sitting in front of me.   If you can get your waitress to help you at all you might order some very AVERAGE food. If you're into mid-grade nothing-special cocktails and food, then here you go, this is your place.   I was so upset as the night came to an end that I almost thought about leaving a below 15% tip (cause you know the government is going to take it all any way, so why even leave it--right?) But my good conscious said, no, you could leave 18%, and that was more than kind!"}
{"text":"We sat 20 minutes without a waitress. Had to get a hostess to finally get ahold of the waitress. Wait staff was extremely rude. Service was slow. Quality is rapidly declining. Worst restaurant in the vicinity."}
{"text":"Where to begin !  The hostess greeted us , lovely, the bartender accommodated us to a better table, pleasant as can be, but then that all suddenly changed.  It's about 2 o'clock , and there's maybe 5 tables in the entire restaurant. I understand the server probably got off at 3 *wont name names* but doesn't reflect your level of service. Not attentive and nothing but a mere order taker. Oysters were good and the lobster bisque ok. Food was subpar , scallops shrimp salmon all over cooked and bland , and the asparagus hollandaise was disgusting, regardless , there server is the point of this review. Food came out one at a time during a 10 minute interval, drinks took extremely long, the table wasn't properly bussed or prepared for the next course, unopened hot sauce   Bottle on the table asked several times for things and after the check was dropped our \"order taker\" who failed to tel us any specials stood there waiting to just grab the check with the 12 percent I left instead of 20.  I won't be back I'll have a better time at the blue point"}
{"text":"~~~The Deal-o ~~~  East coast version of McCormick & Schmicks w/ fresh daily fish, signature preparations..but also have a prefix option & retail fish sale  Solid oyster / crab place; will come back to try the fish to see if it is all that..   ~~~The Order ~~~   -- Fresh Bread - this was real warm & good   -- Spicy Asian Shrimp - sweet sticky rice, pickled cucumbers......$8.95  * BF ordered and loved, well cooked, fried/crunchy w/ sauce, lots & lots of shrimp   -- Lg Oyster Sampler - 2 oysters of each of the 4 types offered....$15.95  * Liked the variety options from Chesapeake bay, WA, etc  * Included both cocktail sauce & minuet sauce  * Fresh & good sized; my favs were the chesapeake & G-something oysters   -- Alaskan King Crab Legs - 1 lbs w/ bake potato & broccoli ....$28.95  * Legs might not look like a lot but gets you to full w/o even gettin' to the potato or broccoli  * BF sub'd asparagus w/ broccoli; waitress also offered other options  * BF loved legs, sweet, fresh, sliced already for him & vat of melted butter on a candle   -- Sharkfin Pie - Butter fudge ice cream, honey roasted peanuts, fudge,  peanut butter, Oreo cookie crust.....................................................$6.50  * Huge huge portion; side crust w/ peanuts & PB in bt/wn the ice cream   --- Shanghai Martini - vodka, lychee, ginger cocktail .......~$9  * I usually don't drink martinis cuz the vodka for me is overpowering..but this cocktail was perfect. You smell the lychee vs. the vodka and still has a kick...and sweet & good. Very addictive..  * Only wish was that they would've added a couple lychee at the bottom of the glass   ~~~ Service ~~~  Great service & atmosphere; extra plus for having a carafe of ice tea at the table for self refill  Note - women's bathroom offers mouthwash & lotion..nice..."}
{"text":"I recently went to dinner here for my sisters 21st birthday 3/17....everything was amazing!!! I had the clam chowder soup, bourbon BBQ salmon, loaded redskin mashed potatoes, and asparagus. Everything was good!!! Other guest ordered the bacon wrapped shrimp, grilled shrimp, Alaskan crab legs.......the only reason this review is a 4 and not a 5 is because the broccoli and spinach had no flavor.    The reviews below were not helpful, (even though this was not my first time dinning it has been years since I've been here)........you need to experience it yourself to get a better view. Our waiter was patient and helpful :)"}
{"text":"The food was great. I had an amazing yellowfin tuna (not cheap) but great. I went with my family and my sister who is a REALLY PICKY EATER. However, she was pleased to find some items on the menu she enjoyed. The mashed potatoes are great. My entire family was pleased and we are excited to go back."}
{"text":"We went to this restaurant with a group for their advertised Christmas turkey dinner, fixed price for three courses. The turkey (only white meat served) was tasteless and so were the gravy and the stuffing. The turkey tasted like it was the \"pressed\" kind. We could have had a diner-made hot turkey sandwich that tastes better. The mashed potatoes were mediocre. What a scam at $28 a pop! This is a fish restaurant and clearly they should stick to fish instead of luring unsuspecting patrons on Christmas for turkey."}
{"text":"Went there for dinner tonite. Visiting from out of stat and it's close to the hotel where we're staying. Everyone complaining around us. Took our order quickly. Told they ran out of bread and we could have crackers. Waited a half hour for our food.   Waitress said they were running behind in the kitchen and out of a lot of food. Asked the waitress to check on our food and waited for her to come back and when we saw her serving water to another group, we just left. Poor service and management."}
{"text":"My boyfriend and I went with my parents who came in from out of town and everyone enjoyed their meals. For the quantity and quality of the food it's very well priced. The bacon wrapped shrimp app was to die for! So were the tenderloin cubes that came with my stuffed lobster. Service was good as well considering we went on a busy Friday night. To top everything off we got a piece of carrot cake for dessert. It was MASSIVE, and could easily feed 3-5 people. It was only 8.99 too. Overall, we had a very pleasurable experience and will be back!"}
{"text":"Mitchell's Fish Market in Homestead, Pa: We ordered a House Salad and two Pecan Crusted Trout entrees. Our server promised the salad will arrive before the entree but it did  not. The \"smashed\" potato and the long \"al dente\" cooked string beans were seasoned well. The warmed baked mini-loaf sour dough bread was great. We are looking forward to returning."}
{"text":"Just got to Mitchell's fish market the exterior reminded me of my nights in Miami on spring break but don't let the looks deceive you the interior reminded of a funeral home, we ordered the \"crispy shrimp\" and it wasn't what I expected at all it was barely crispy and tasted sweet? Like a cheap Chinese take-out restaurant if you want sweet meat go to Panda Express don't waste your money and time here, And I ordered the fish and chips and it was horrible don't bother upgrading to the grouper or halibut because it's the same fish soggy crap if I could leave zero stars I would."}
{"text":"I got the flounder stuffed with crab, the flounder was pretty good, but the crab meat inside was awesome. My date got the Shanghai Salmon with scallops and shrimp, he said his meal was very tasty but the scallops were a tad rubbery. Overall our meal was very good. We split the carrot cake for dessert and it was HUGE and delicious. Our waiter (forget his name) was also super friendly and amazing."}
{"text":"Recently returned to Mitchell's for dinner.  As usual the entree was excellent and the service great.  The three stars represent my opinion on their concept of portion control.  Ordered a \"bowl\" of their incredible lobster bisque before the entree and was offended by the amount of soup in a shallow bowl and they were charging $9.  I dipped the tip of my dinner knife in and the bisque wasn't quite 1/4 of an inch deep.  I've had bisque at this location before and have been pleased with the serving portion.  I sent it back.  Although the matter is a small one, I probably won't return to a Ruth Chris affiliate that makes a customer feel as though their being ripped off."}
{"text":"Typical overrated poor service Laundry's operation.  When this was owned by an Ohio based company it was outstanding.  Arrived a 4 pm only three other people in the restaurant that should of be the first sign to go somewhere else.  We ordered Salmon and Dover sole.  Took 30 minutes for food to arrive.  My fish was very good but my wives Salmon was cold and under cooked.  Took ten minutes for waitress to come back  we sent the Salmon back and came back even worst with the middle ice cold and mushy not flaky.  The manager got smart with us and said she would take the Salmon off the bill.  I hope so since we never ate it  REALLY"}
{"text":"Bad food.  Dinner for 2...$117.00?  For fried and steamed seafood.  Even the fries wre bad...old stale.  The salads were fine...but couldn't make up for the poor seafood...red lobster tastes with park ave prices."}
{"text":"I have mixed feelings about this place. I have eaten there twice. I have enjoyed the flavors of their Shanghai option both times. The seafood has been cooked well. The Sharkfin pie is tasty for dessert. However, both times, I had shrimp as part of my entree. Mitchells is a perfect two for two at FORGETTING TO DE-VEIN the shrimp. First time I ate there two of my shrimp were not de-veined. Second time there was one (I only had two). If you order shrimp take a good look at it. The management has been very apologetic and helpful both times. They truly cared."}
{"text":"I decided to write this review because my experience at Mitchell's Fish Market was so bad that I felt I would do other people a service by telling you: save your hard-earned money for a better restaurant.    I ordered the \"lobster duo\" - a 4oz. lobster tail that comes with lobster \"pot pie\". The \"lobster pot pie\" was -- no exaggeration -- an ordinary biscuit. The biscuit had a little slice at the top, and then they drizzled some flavorless pink sauce over it that had a couple kernels of corn in it. There was literally one small chunk of lobster meat on the pot pie. It was crud. I sort of wish I had sent it back and just cancelled my order, but I was with a group and didn't want to make a scene. But it was that bad.     The lobster tail was cooked to s*** -- extremely overcooked and basically ruined. The \"drawn butter\" was probably corn oil with coloring. It did not taste like butter at all, and it did not have the consistency or flavor of butter. It was probably just corn oil. Disgusting.     It was by far the worst seafood experience I've ever had, and I'm including my visits to Arthur Treachers. This is basically a glorified Red Lobster, but at least at Red Lobster you get fed. I ended up eating the leftovers from my fiancee's plate (fish fry) because I had just eaten a $30 appetizer and was still very hungry after my $30 \"dinner\". My entree was completely unfilling and unappetizing. It was pathetic. The real tragedy is that people spend their money at this place because it is in a high-end shopping plaza, but the food at Mitchell's Fish Market, based on my experience, was worse than Red Lobster's (a low-end chain seafood restaurant).      Don't let them lure you in with their tall dessert cakes, though -- they suck at seafood and that is what matters. If you want dessert, go to an ice cream shop or a bakery.    For others' sake, I would recommend spending your money elsewhere. I hope this place goes out of business.      The only nice thing I have to say about it is that they had decent margaritas (the 1800 Margarita...it actually has alcohol in it, surprisingly...but their food was so crappy I half expected their drinks to be all filler)...      The last annoyance came when they charged the wrong credit cards on a split check (between two couples...so in other words, not difficult). But they charged us our friends' bill on our card and then charged our friends our bill...so, the service is not top notch, and not even really that competent.       Edited once because I think I was being unfair and harsh about the wait staff, who were polite."}
{"text":"I went to this restaurant last week with my husband and my family. The restaurant is located on the Waterfront area. The variety of fish was excellent, including the fresh fish of the day. I ordered the atlantic cod and it was delicious. The waitress' service was really good.  I definitely recommend this restaurante."}
{"text":"Tried to give my mother a nice birthday dinner and ended up overpaying for subpar food and service.  To begin with the appetizers were lukewarm ( slightly crispy calamari are not appetizing ). Then while we were eating our apps they tried to cram the already small table with our entrees. We told them we were not ready for our entrees and I'm sure that when they came back to us they had been sitting under a heat lamp and not re-fired.  Drinks were not replenished in a timely manner so a bottle of wine arrived towards the end of our meal. To top things off the complimentary birthday dessert was charged on the bill.  I don't understand the 3+ star review. Will not be coming back!!! Can't believe we drove 40 minutes for this.  Beyond disappointed!!!"}
{"text":"Have been here a few times. The wait staff is always top notch and food is very good. I had the steak and lobster tail. Steak was a perfect medium rare and the lobster was also cooked well. Oysters as an app. they appeared fresh and tasted how they should. Overall like in the past we had a great experience at mitchells which is not something I always expect from a chain."}
{"text":"I went here on a recent business trip, and there aren't many decent options in West Homestead, so I decided to splurge on the company's dollar and  ordered take-out.     I was highly disappointed in the service, and I only ordered take out.    Upon going to the bar to announce that I was there for take out, there were 3 other people at the bar.   The bartender had her back to me and it wasn't until a few minutes had passed that another guest told her that she should wait on me.      After announcing the reason for my visit, she checks on my order (not ready yet) and helps other tables.  No offer of water, or a drink.  Another gentleman working the bar asked the bartender if she had offered me a drink, she stated to him my order would be right up.   He then asked if she offered me a water, to which she replied, her order is going to be right up.    He placed a glass of water in front of me.  Then I hear my name and order announced by the kitchen staff.   3 staff members yelled. .  .\"it's TAKEOUT\"  so back it went into the kitchen to be packed up.  Gentelman bartender asks female bartender if she has rung me up yet (she had not)  After more time had passed (how long does it take to put food into a takeout container?)   it finally is put down in front of me.  She then rings me up.   I don't expect take out to be piping hot, but at this point i wondered if it was even going to be room.  When i go to eat my meal, utensils were not included.  I now had to go find something to eat my lukewarm food with.   VERY DISAPPOINTING experience.   Will not be returning."}
{"text":"Not impressed at all!  The first time we ordered drinks our server forgot our drinks and the second time we had to ask if we could have more drinks. I ordered, white frutti di mare for 24.49 and I only got 2 scallops and 3 small shrimps.  Our bill was $120. 00 Way to pricey for 2 scallops and pasta."}
{"text":"Sat at the bar for an early Sunday dinner. Bartenders were consumed w setting up the bar. Stocking tea bags in the boxes. Restroom was filthly over flowing garbage cans. Bar floor was gross. Meal was mediocre for the price. Overall severely disappointed. Won't go back."}
{"text":"I have Celiac's so I ordered off of the Gluten Free menu (just ask the server). Speaking of the Gluten Free menu, why weren't there any prices on the menu? I found that strange. At any rate, I chose the burrata and mozzarella side salad special ($11) to start. It came with some cut up cherry tomatoes and an avocado mouse (I chose to skip the pistachio crumble) and found the portion very small for the price. My entree was the Shanghai Shrimp, Scallops, & Salmon. The gluten free option was accompanied by  sticky rice, spinach, and a gluten free red wine soy sauce. I was extremely disappointed by what was brought out to me. Yes, I cannot have gluten, but that doesn't mean I want bland and tasteless. The 3 shrimp, 3 small scallops, and piece of salmon that came out were the decoration surrounding my mound of unflavored white rice and the small ramekin of soy sauce. I mean to not even use butter, salt, or pepper? Anything?! At best, My meal could be called a flavorless deconstructed sushi. I order a side of smashed redskin potatoes (to which I had to add salt and butter to make palatable) and snuck some crab legs off of my dinner companions so I didn't have to leave the restaurant poorer and unsatisfied. The service was very friendly and fast, no complaints there. The atmosphere, at least on a Sunday, left a little to be desired and the food is just horrible, or at least the gluten free options are. So disappointed. I've uploaded pictures of my main dinner (after I added the super salty soy sauce to the rice). I'd give this place a pass, unless you plan to just come for the crab legs."}
{"text":"What has happened to this place? It use to be the best around; now within the last few months it has gone completely down hill. The quality is completely gone, portions are smaller, prices higher. From what I read it's a company change, but how could this make a place go from wonderful to horrible so quickly? The server even tried pushing a diners club program on us!!! Who would pay for a dining program to this place!?!? That's right, I said pay! The company wants you to pay for a membership! Why should a loyal customer pay to be rewarded for being LOYAL??? Why would anyone even pay for such lousy food? The place is not even kept up anymore. The atmosphere has become dingy and even the dish my $30 + meal came out on felt grimy!!! My silver was even wrapped in torn linens! Where is the management? How can they allow such expensive meals to go out on dirty dishes? Where has my wonderful night out gone? I use to look forward all week to when having a night out here. Now I don't even want to drive past! Even the staff is miserable anymore. Everyone use to be so pleasant and welcoming, and now they seem run down and well, miserable. I've come back now 3 times hoping my experiences were flukes, unfortunately this place is just not what it use to be! I'm sad knowing my favorite restaurant is now gone!Do yourself a favor and don't waste your hard earned money here. You will be nickeled and dimed for everything only to receive nasty frozen sea food on dirty dishes with ratty linens, from miserable workers."}
{"text":"Not what Mitchell's used to be. There was a hair in my food and the bathrooms were less than clean. For a $70 bill for each of us (once my Salmon was taken off), far from worth it.  I would love for them to be what they used to be."}
{"text":"Had reviews for 930pm, 4 people, New Year's Eve. Was told by the girl out front \"we're running behind on our reservations, please take this pager and just hang out.\" --ok, I thought, it's New Year's Eve, I can understand the delay. However, while standing within 10 feet of the hostess podium I watch 2 parties (4 & 6 people) walk up immediately after me and get seated. One of which didn't even have reservations. I finally became vocal made a tiny fuss and was promptly seated. WTF?  Next, we are never given silverware until our main course comes. We're forced to eat our pan-seared ahi tuna with bare hands. Getting our drinks also took 20 minutes after ordering them. Ok, whatever, the Sam Adams winter ale I'm drinking makes me friendly and forgiving.  Next, 3 out of 4 from our party order lobster bisque, but all 4 are given lobster bisque. We're told no charge for that fourth bowl... Guess what happens? Yea, you guessed right.  Next, our main dishes are served. I ordered filet shrimp & scallops with asparagus. My main entree has 2 asparagus spears, two rather small shrimp accompanied by 2 nice ( the only thing \"nice\" during the entire evening) scallops, with a baked potato. My filet was ordered \"medium\" and was served not just rare, but RAW. When cut into, it was actually ice cold in the middle and close to the surface. Waiter apologizes, takes it back to the chef and brings my baked potato back to the table so \"I at least have something to eat\". Gee. Thanks. Steak comes back 20 minutes later, cold and untouched, like it sat there on the counter, nobody touched it, and it was brought back out to me. I refused to eat it, I became mean and was told \"let me see if I can just get this \"taken care of\". Thankfully, for the sake of a huge embarrassing scene they took the stupid crappy looking filet off of my bill. Boy, What a favor.   Verdict? Absolutely horrible service, lousy cold food (which would have made someone sick if they ate it) that was just thrown on a plate for a ridiculous price. Don't get me wrong, I have no problem paying for something in return. The only thing I got from Mitchell's was frustration and probably one of the worst dining experiences I've had in quite some time. I can see this kind of stuff at Applebee's, but this is supposedly a true restaurant with ridiculously fresh fish and a great atmosphere. I should have used my darden restaurant gift card for dinner at Longhorn Steakhouse. At least I would have left having actually been able to FINISH my entree.  Avoid this glorified (and overpriced) Garfield's and goto McCormick and Shmick for fish, unless you like paying $145 for absolutely nothing."}
{"text":"Watch out when ordering \"House Wine\" during Happy Hour on the Patio..Our party of four chose to eat on the patio and take advance of both the happy hour menu and the dinner menu...Overall a good dining experience..until we received the bill. We thought we were ordering the $5 per glass 'happy hour wine'...it was true, we did say \"House Wine\"..thinking of course that's what they'd be serving for 'happy hour' prices...so you can imagine our shock when we received a $60 charge for 4 glasses of wine. We spoke to our server, and said that we certainly never meant to order $15 per glass wine (I mean what restaurant serves $15 dollar glasses of wine as \"HOUSE WINE\") She went to the manager and was told \"that's too bad..they drank the wine and they must pay for it\"...We asked to speak to the manger..and after some discussion as to our shock ad surprise that we were not served the 'happy hour wine' she agreed to comp $40 off our dinner menu...Now, what was so disturbing and disappointing was that she (the manager) would not just do that when our server told her what happened..It embarrassed our server and made her look unimportant that she could not just 'satisfy' her customer with the 'right thing to do\"... I gave it a 3 star rating for the above situation...The Food and our server...deserve 4-5 stars"}
{"text":"I was here to celebrate Valentine's Day. Yes, some of their dishes are a little bit pricier, BUT it is great for special occasions and well worth it in that regard. The fish was super fresh (don't worry, they have steak options!). I also had to try the lobster mac & cheese-- no complaints from me! Great restaurant for seafood and special occasions"}
{"text":"Great food and our waiter was wonderful, but someone needs to tell him - and all waitstaff - no cologne!!!  I want to smell the food not your cologne!"}
{"text":"Went to Mitchell's Fish Market last night for my 29th anniversary.   Showed up 5 minutes late for reservations (Monday night 8:30 pm, restaurant was empty).  Usually like Mitchell's bringing clients there and celebrating there.  We were seated immediately but at 9pm, still didn't have water, although  waitstaff seemed overly concerned about wiping tables.   We left for sushi across the street.  I won't be back."}
{"text":"Been twice, and it's completely unremarkable.  Service the first time was good, second time was lacking.  My Salmon was overcooked and absent any real flavor.  I'd rather go to McCormick and Schmick's up the road."}
{"text":"Raw oysters and Shrimp cocktail excellent Clam chowder flavorful but only one (1) clam. Will try their entrees on next visit - 2nd chance warranted."}
{"text":"This was a great find near Pittsburgh alternative to down town scene. Ambiance was great on the deck by the river, and service was excellent (Thanks Melisa for history lessens!). Seafood including Oysters were fresh and well prepared. Price was reasonable for \"Prefix\" menu including scrumptious dessert.  What an evening to end a fantastic summer day in Pittsburgh."}
{"text":"My boyfriend and I had a great dinner there last night. We didn't have a reservation but were seated right away at a table in the bar area. He got the Salmon and I got the Alaskan King Crab legs and they both fantastic. We took the Shark Fin Pie home to eat later for dessert and it was to die for! We will definitely be back."}
{"text":"This was the second time in a row for poor service and my final visit to Mitchell's Fish Market in Woodmere Village, Ohio. The service was horrible and even though last time it took more than 1 hour at the bar for our dinner, I decided to give it another shot. The excuse last time was that hundreds of lobster tail dinner orders were processed that night, so that was why everyone else who came in after us were served prior to us. The restaurant was not crowded this time, so the expectation of getting top rate service was in order.   First, they didn't bring any bread until we asked and we were given 4 pieces for the 6 of us. Next, my soup had not arrived until I asked at least 20 minutes after ordering it. After asking what happened, the server stood by the kitchen and finally brought it over with an additional wait. My Swordfish took at least 50 minutes to arrive, though our grandchildren did get their orders earlier. 2 people ordered shrimp cocktails and salads which came separate. Once I mentioned my problem, the server offered to send over the manager, but by then, I declined. There's no hope when the kitchen seems to be their issue and they are certainly undeserving of any business."}
{"text":"For the average Joes that we are, Mitchell's is more costly than we can afford on a regular basis, but we come here often for special occasions. We consistently have good  experiences. The wait staff is friendly and responsive, and the food is delicious and fresh. I knock one star off for making wait staff cover too many tables when its busy. Still good friendly service, but not 5 star. This is not a deterrent for us, and Mitchell's remains at the top of our eat-out list."}
{"text":"Decent restaurant, mostly fish on the menu and I LOVE seafood. Very expensive for what it is though. Had the trout entree with grean beans and scallion mashed potatoes, very good tasting but the fish was a little over-cooked. Wouldn't recommend it unless you have NO WHERE ELSE to go."}
{"text":"I am posting my review again as it was not deemed important enough to keep.  Funny within days I was contacted by customer service of Landry's asking for my contact information. I gave it twice and no one bothered to contact me.  Stay far away from this place.  Extremely high priced for below average food.  What a disappointing Easter dinner.  We had eaten here twice last year and the service was impeccable, food delicious, piping hot.  I did not realize that Ruth's Chris had sold to Landry's, the change is not a good one.  We made reservations for five and were seated promptly, drinks were brought.  A very good crab dip and salads were enjoyed by all.  Then the main courses arrived.  First let me say that something occurred because the table seated after us of the same size were served first. Finally four of our five meals were brought.  The hush puppies and fries were cold, the seafood was ok, the coleslaw was warm as if it had all sat under a warming light.  The planked salmon was good but not hot.  Five minutes later the $32 Easter special came out. One tiny lobster tail with some salty stuffing. No discernible seafood in the stuffing.  4 small very dry over cooked shrimp with a blob of salty stuffing, a large blob of cold dry hard mashed redskins.  We were all shocked.  Our waitress, who was actually wonderful felt terrible and knew something had gone wrong when she saw the other table served before us and then us short a plate.  She spoke to her manager several times and asked him to talk to us.  When he finally did he told me he was sorry and that I should have told him sooner so he could fix it???  He was very rude to us.  Offered us a free dessert. I told him he couldn't possibly think I was going to pay for inedible food. He begrudgingly took  the price of 2 of the less expensive entrees off the bill.  I had been looking forward to this holiday meal for weeks.  His poor management skills and rude behavior ruined our holiday.  I will never go back.  manager of Mitchells in Homestead, you should be ashamed of how you treated us.  Landry's needs to look into this restaurant if they expect people to keep coming.  Those prices are only acceptable for fantastic food and service."}
{"text":"Went with a colleague, and both of us had a decent meal. The specials looked good, but both of us went for shanghai style plain fish.  And both were good.  We got some oysters too, and those were ok too."}
{"text":"The service is great and friendly. I got the baked spinach and artichoke dip and it was superb. I love the fresh, right out of the oven bread too. I got the Atlantic salmon, and it was probably the best fish I have ever tried. Listened to other yelpers suggestion of the shang hai preparation, and they were right. Just make sure you make a reservation! Best seafood restaurant in da burgh!"}
{"text":"Good service. Excellent seafood. Prepared to perfection. Nice atmosphere, but a bit on the loud side at times. Good selection of fish and very fresh. Always a nice night out!"}
{"text":"I went yesterday with my husband, the host was the best part of the experience .  We went for happy hour, the mussels were good, as was the fish sandwich. The crab cakes so so the lobster Mac and cheese dry, the pasta runny.  I won't be back, for the price, I feel they are overrated.  I had better at Red Lobster."}
{"text":"My friend suggested Mitchell's for our traditional New Year's eve dinner.  What a great idea I initially thought and we met there at 8:30 pm.  On our way to the booth in the corner where my friend and her husband were already seated I noticed that even though my shoes had some rubber-type treading on the bottom, the floor was slick with grease from the kitchen.  The constant traffic of servers through the kitchen across this section of flooring had created quite the build-up of grease on the floor.  I noted to myself to walk extremely carefully.  We safely arrived in the booth.  As we sat down we all discussed the slick floor before we turned our attention to the menu.  We had a good waiter who was attentive to our needs.  The food was good although honestly after what happened after dinner I can't even remember what I ordered.  For those of you who may think what happened next was caused by alcohol, let me state that I did order 1 moscow mule.  My friend and her husband had never had one and I wanted them to try it.  They each drank some of it and I sipped the remainder.  That was before dinner.  1 partial drink.  I did not get a chance to finish the drink before dinner came because the food was served promptly.  I intended to finish it after dinner.  When we had finished eating dinner and had ordered desert I decided to visit the ladies room.  I got up from the booth and carefully made my way taking literal baby steps across the slick section of floor to the restroom.  I finally made it and noticed that the floor in the restroom was not slippery at all.   As I left the restroom I walked first on the carpeted hallway section that runs front to rear.  As I took that first step back onto the grease-slicked tile section the edge of my heel slid and I could not control the fall that followed.  I hit my left hip and then broke the fall will my left cheekbone.  It was quite violent.  In order to hit my left side and the front of my face my body must have twisted as I fell.  I was initially stunned and could not get up.  The General Manager, Michael Shebeck, was apparently standing nearby as he was the first person I heard.  In that moment I was very angry.  I felt this was their responsibility to prevent this type of situation.  Simply cleaning the floor on a regular basis could have prevented my fall.  After I was raised to sit on a nearby chair, I showed him by sliding my shoes back and forth without any resistance how slick the floor was.  After limping back to the booth and applying ice to my cheekbone I sat there wondering if anything was broken.  (I subsequently went to the hospital and had my femur x-rayed and had a Ct scan to my face and neck.  Nothing was broken. Though, I have Physical Therapy twice a week to address the problems caused to my joints by such a violent fall on concrete.)  Honestly, when the check came I thought just maybe that they might comp my meal or the whole check.  That did not happen.  I guess that would have been some type of indication that they took ownership of what happened.  We paid our $111.38 check (for the 2 of us) plus tipped our waiter. Several weeks later I got a call from Landry's the parent company (Tony Lazenby, Risk Assessment Department).  She asked for my 'side of the story'.  At the end of the call she said she would get back with me after she finished her investigation.  Weeks went by and Tony would not return my phone calls.  Finally she did.  'Landry's would not be offering any compensation', she stated flatly.  They would not cover hospital bills or physical therapy costs. NOTHING!  When I asked why, she told me that the investigation is confidential and she could not tell me anything further.  I did receive a letter in the mail stating that they were 'unable to establish any negligence on their part'. Hmmmm.  Apparently, a dangerous, grease-slicked floor, easily preventable by regular cleaning did not constitute negligence.  I wish I knew what Mr. Shebeck had told his corporate office.  Please be careful at this location and at the location in the Waterfront.  My friend tells me that the floor there is also not cared for properly and it just as slick. In fact, try Bonefish Grill or anywhere else where the safety of the consumer is important."}
{"text":"Service was very friendly but very slow. It took a long time to get our drinks. The appetizers and drinks came out before our waters. I had to specifically request water for the table.  Fortunately they brought out the kids' meals before our entrees, but our entrees also took forever to arrive. Our empty appetizer and entree dishes sat for a long time before anyone removed them. Then after we finished eating we were left forgotten for at least 15 minutes before I got the chance to ask for the check (to save time I just handed over my card instead of checking over the tab first.) Our entire meal lasted two hours, which is very slow for lunch service. Our server did apologize for the long waits.  But it wasn't like only one part of the meal was like that, but the entire meal. The food was decent but the slow service put a damper on our experience and I have qualms about coming back."}
{"text":"We like to sit at the bar and enjoy the atmosphere and chat with others while we enjoy our cocktails. It's one of our regular \"neighborhood\" spots.   Renee--the hostess--is just lovely and very accommodating.  She knows we like to sit at the bar and she always helps us scope out 2 stools that might open up soon if the place is very busy.  The bar staff--especially Terry and Jay--- always treat us wonderfully and we enjoy seeing them each time we are there.  We love their beer battered fish and their homemade tartar sauce is AMAZING.  If we have to sit at a table because the bar is crowded...we really love having Kelly as our server.  Great people.  Great food. Great drinks.  So, yeah, it's GREAT..."}
{"text":"Food is just not good!!!! Bread was sour, with butter all over. Chicken parmesan not edible. Tuna was so so. The best thing was mashed potatoes, but there was hair in it. Very overrated, and overpriced. Have not been here for the last 3 years, will not come for the next 3...."}
{"text":"Had another (yes I know we shouldn't have gone back) terrible experience.  Place looked like it was closed .... maybe because it should be (next controlled burn in the Waterfront) - service was painfully slow.  The oysters were below average.  The charbroiled oysters were terrible.  Took 30 minutes for our entree to come out after oysters and the filet was well done (ordered medium rare). When I asked to get my Landry points the waiter informed me Landry's sold this location a month ago and they are no longer part of their company ....... NO KIDDING - because this location is horrific.  Time to close this ship wreck."}
{"text":"To sum it all up: don't eat here.   Seat yourselves because the hostesses are busy---talking to each other.   If you do decide to eat here, get sangria. It was the only really good thing at the table.  Only order lettuce wraps if you want hard, dry chicken breast chopped and thrown on top of lettuce with noodles and peanuts. Disappointment. Buuuut not more disappointing than the Tuna Poke tacos. Not quality sushi grade tuna...basically just chopped chunks of the tuna they serve for dinner. Yuk!  Ok let's just order soup. Can't go wrong there! Wrong! I think the gumbo was out of a can. A really old can, bc it reaked of funky seafood. No thanks.   Ok last try. Jerk tilapia. Only get this if you want a really expensive piece of mini tilapia, lightly seasoned and not jerk. Complete with cold veggies.   The waiter was nice though. See you again NEVER, Mitchell's!"}
{"text":"Amazing seafood.  They have a bunch of different cuts of (fresh) fish out on display, which I personally love to see in a restaurant.  The food is great and the atmosphere is great, although it can be a bit pricey.  I only took one star off because service was slow, but I also went during peak dinner hours so that's excusable in my opinion."}
{"text":"I went here for dinner as i wanted to have a nice dinner. The tuna was excellent. I asked for it grilled and it came out perfect. The only issue is that the raspberry tea does not have free refills but the unsweetened ice tea is free. I was VERY pleased with the dessert as the chocolate cake was very good. The waiters were top notch."}
{"text":"From the ability to choose your fresh-filet-o-fish (and what an array there is!) to the Happy Hour prices and prix fixe menu for $29.99, there's a lot to like about Mitchell's.   Supposedly fish is flown in fresh seven days/week.  Portions were generous where they needed to be (the main course), and lighter on the sides - perfection!  Great bread basket, too.  Our party of six received excellent service.  A nice stop on the Eton Collection restaurant row."}
{"text":"decadence has its rewards! I love MFM. This place has one of the nicest staff's ever. I send clients here all the time, and they are always always happy! Bob and Herman do a fabulous job running the joint, and it really shows.  Now onto the food.  Freshly made to order spinach/artichoke dip with or without lump crab meat. Get it. Comes out bubbly with fresh parm and red peppers on top. Yum. Crab cakes, always tremendous. They do them well, probably one of the best around. As a favor they let me buy a few trays of the mini crab cakes uncooked, so I could take them and bake them at my parents house for Thanksgiving. HA! You thought I made those???   Seriously though, the seafood is always really great and super fresh. When they have Sturgeon, try that too.   Most recently, I had something truly that I have never had before. I have been called decadent for years, and I think I know why... chef made for me a crab stuffed lobster. OMG. I hope I can add the picture, because I actually had to take one.... it was an entire lobster, stuffed with an entire maryland crab. As they brought the platter to me,  other people were pointing and staring and they started to follow it... well no, but a lot of jaws dropped. there is shock and awe; shop and awe; now may I present FORK AND AWE!  Good lord, it was incredible. And incredibly good!! Go there and ask if they will make it for you. Be decadent. Take the picture!"}
{"text":"My friend and I had lunch yesterday. The server, \"B\", kind of weird which I'll not elaborate here. He completely forgot the soup we ordered and we had to ask another server for the soup after the entree were served 20 minutes later. B didn't even apologize to us and the soup he served was not hot; only warm. The manager, \"T\", came to apologize but didn't seem care that much. We've been customers of Mitchell's since they opened more than 10 years ago. It was better back then when there was something like this happen, they would at least make the soup on the house. It was a lousy service over all. Our food were not great at all. The scallops were hard and the salmon fish was too dry. The crab cake wasn't fresh and taste terrible. The food quality was a lot better back then when it was owned by Cameron Mitchell. I believe it's now owned by Landry which make everything seems below average. Avoid this place!!!"}
{"text":"Tasty!  From the grapefruit-basil martini to the seared tuna (with surprisingly efficient wasabi), everything was beautifully prepared as well as flavorful.  Also tried the oysters (delicate and refreshing) as well as the lobster bisque.  The lobster bisque was a bit darker and saltier than I normally like, and was a bit weak on the lobster, but still tasty.  While not cheap, not outrageously expensive either.  Would go back."}
{"text":"Arguably the worst place in NE Ohio to dine. I'd rate this restaurant 0 star if it was possible. This review is long overdue and I hope to spare fellow yelpers from wasting their time and money at one of the worst dining establishments in the area.  Over the years, I've tried giving this particular restaurant the benefit of doubt since all other Mitchell's Fish Market restaurants in the region (OH, MI, KY) have met or exceeded my expectations. Having dined at this location no less than a couple dozen times over the years, I've come to the conclusion that the poorly trained, rude and obnoxious waitstaff, along with their awful service, poorly prepared food, and apathetic managers are the norm and that they can't be attributable to everyone just having an \"off\" day. The Incompetencies from the floor manager(s) to the people working in the kitchen are pervasive. Waiters regularly forgetting or omitting food orders, kitchen serving poorly prepared and/or cold food, and unapologetic managers unwilling to address complaints are just a few examples. Yelpers, do yourself a favor and avoid this particular Fish Market. Today was the last time stepping foot inside this pathetic excuse of a restaurant."}
{"text":"Very pleasant atmosphere.. Fresh sea food not the frozen stuff.. They have great lunch specials too.."}
{"text":"My family really likes this restaurant for a nice dinner. It's not extremely fancy, but not totally casual either.   We went there recently to celebrate my mom's birthday. Their warm sourdough bread is a delicious way to start the meal. My mom and I shared the house salad appetizer, and there was definitely enough for both of us. Others had the clam chowder, which was yummy. For dinner we enjoyed the Seafood Sampler Shang Hai style and Cedar-Plank Salmon.  My 1.5-year-old son loved the broiled cod and green beans from the children's menu, which had a great selection. I was happy to see the children's menu had an option that wasn't fried and wasn't mac and cheese! My son also really liked the coloring/activity booklet they provided along with a packet of triangle-shaped crayons! I was impressed at how prepared this restaurant was for little diners. The waiter was great about bringing the toddler's food when he brought our appetizers.   Overall, no complaints. I'd highly recommend this restaurant. We always make a reservation through Open Table."}
{"text":"My family and I go here whenever there is a special occasion and for good reason. The food is fantastic and the service cannot be beat, at least not when it's coming from the Governor or Kennedy. Best servers in the 'burgh!! I took my Dad there last weekend for his 70th birthday, didn't tell anyone that it was a special night out, but they treated us with such attention, accommodating our needs to a T. Kennedy adjusted meals to fit our taste, suggested things based on what we were looking for, took at least 10 minutes with us going over the menu...I could go on, but needless to say, it was just a fabulous meal and was worth every penny. We got the king crab and bacon wrapped shrimp to start, lobster bisque soup, cedar plank salmon, Chilean sea bass, and a fish medley made to order. We also always get the 7 layer carrot cake, which to me is the best cake anywhere in town.  A must go for anyone looking for an amazing meal and excellent service. But be sure and ask for Kennedy, he's a real dude."}
{"text":"We visited  this over priced fish restaurant  and were very disappointed. The prices are very high for bland food.  Ordered grilled salmon it had no taste.  I can cook a better  grilled salmon than the cooks at Mitchell's.    I would never go  back not worth the money, $50   for a very poor fish dinner."}
{"text":"They we're so accommodating for my daughter that doesn't like seafood. The food and service was very good."}
{"text":"My husband and I grabbed lunch there today. Lunch was ok but hardly anything to write home about. We ordered three bowls of lobster bisque and clam chowder to go for my kids at home. Roughly 30 dollars for soup. I had asked the waitress for bread with the soup. I get home and there is a half a loaf or 3 slices of bread. Pretty weak in my opinion.  We had a gift card but otherwise I would not recommend. Much better options close by with better food and better prices for what you get."}
{"text":"The staff here at Mitchell's is courteous kind and helpful. Always making sure to take time to ask the customer if they need anything or grab them extra things for their meal. Bread is brought to the table after the drink orders are placed. The bread is great house made sour dough with a butter coating that makes it glisten. The food as always been past expectations and the one time out of many that it was a little over done, the management was very graceful and gave me a new meal for free. I recommend this to anyone looking for a nice place to either grab a drink or a meal."}
{"text":"Average service. Entre came out cold. I believe they plated the veggies then added the fish some time after.  Food was ok, but not served hot.  Had to ask for bread. Really? Waiter never came back to check on us."}
{"text":"Good happy hour prices! Otherwise overrated! Don't order the chargrilled oysters. They're not even in a half shell and served with burnt cheese and butter on the side. Make sure to ask for in a shell which they don't tell you about. Crispy shrimp was good. I suggest that!"}
{"text":"What a horrible experience we just had at this restaurant!! Food was cold and not the same we have been used to in past years. Apparently they have just been bought out and everyone in the restaurant has been quitting. Parking lot was completely empty. Manager did not even come over to apologize for our food being mediocre. In the end our $300 bill with a party of 8 was not even comped one bit! We never saw the manager and waitress apologized because no one working there seems to care anymore. This place will be closed soon. It's a shame because it was one of our favorites. I guess nothing lasts forever. Stay away from this place! Overpriced, food went downhill and what used to be a very busy vibrant restaurant now seems like a cold morgue!! My husband's birthday celebration was a complete disaster!!"}
{"text":"This is tucked into a corner of Eton mall.  The food, atmosphere and service was decent.  Nothing really stand out, was expecting more.  They do have a cool deli selling raw fish filet to go.  I prefer Bonefish in independence more than Mitchels.  Similiar type of restaurant."}
{"text":"I've eaten here before and it's very good. Delicious if overpriced.   I write tonight because I am disappointed in treatment I received from the bartender. I saw they were offering food & drink specials until 10pm on a poster outside, but the bartender shoo'ed me away at 9, claiming they were closed. Bummer and I hate being treated like that."}
{"text":"Updating my review of Mitchell's.   After my review I was contacted by 3 different members of Mitchell's management to tell my experience. They were very apologetic and said they would mail me gift certificates that I could use at any of their restaurant's since I did not live in the Pittsburgh area.    It has been over 2 months and I have not received them or any correspondence.    Apparently the problem with this chain goes higher than the local employees in Pittsburgh."}
{"text":"After a relaxing pedicure at Priv, I stopped in during a busy Friday Happy Hour. It was my deceased friend's birthday week. I needed to have my traditional Lemon Drop Martini, her fave... My server, Douglas, earned this 5-star rating and should be commended by regional leadership. I dined alone...was a very emotional mess when I came in. Douglas seemed too nice for my bad mood. So, I told him ONE of the MASSIVE things I'm coping with...\"just in case he returns and I'm crying\" (I felt it coming on...). His kind, reassuring words helped me to avoid the feeling. Douglas let me know I was in the right place. After making sure I was set with a menu, questions answered, he said the bar staff would ABSOLUTELY make a Lemon Drop Martini. (It wasn't on the menu, so I panicked; thought I'd have to eat next door, instead). Douglas made me feel much better as I enjoyed dining alone (one of my \"things\"). Instead of sadness, I thought of the many good times with my friend.   I was able to enjoy a quick drink and appetizer. The Shrimp Pot Stickers were perfectly prepared and delicious. Douglas seemed to know a grieving girl needed carbs...Thanks for the bread, Bro' - (AS IF...with an appetizer!!)...His manner of authentic, charasmatic, skillful service completely relaxed my emotions. I could see he was equally attentive and quickly returning to all of his customers (kudos to the kitchen).  Look - I was only there for QUICK \"martinis & tapas\" (I told myself as I walked in; polish on my toes was still wet.)... Eventually, I thought....\"I LOVE GREAT SERVICE, AND SADLY - IT CAN BE DIFFICULT TO FIND....Therefore, I'm staying!\"   I ended up ordering the \"Perfect Pair\": Lobster & shrimp stuffed lobster tail, crab stuffed shrimp, smashed redskins, asparagus. The kitchen staff should be commended. My meal was perfectly prepared...promptly served...Thank God for Douglas and the Team!!. My friend would NOT want me crying over delicious food!  ...By the way, as an African American guest, experiencing all of today's politics, it was nice to be greeted warmly by the manager..."}
{"text":"Had my birthday dinner here. Omg awesome stuffed shrimp with crab. Nice elegant place!! Friendly staff. Wait time was good."}
{"text":"Out of all the restaurants I eat it this is probably one of the only chains that I go to often. The food is usually cooked to perfection and the staff usually very attentive and friendly. I recommend lunch here because you can save about $30 just on the food not including drinks.  I have never experienced \"snooty\" service at the locations in Pittsburgh although I wish I have because it would be so much fun for me.  When all else fails I think most folks would enjoy Mitchell's...  Shark fin pie is pretty tasty as well mmmmm."}
{"text":"Love this restaurant. The seafood is incredibly delicious. Wonderful appetizers. My favorites are the Spicy crispy shrimp and the Ahi tuna. Relaxing atmosphere with great drink menu also. It does get crowded on the weekends so call ahead."}
{"text":"I was impressed.    Went here for lunch.  The seafood gumbo was tremendous.  I wasn't in the mood for more seafood so I had the chicken blt on ciabatta bread.  I'm not sure what type of creamy sauce they put on the bread, but it was delicious.  Will go back again.  The food was reasonably priced for lunch.  Dinner would obviously be more expensive but I imagine it's worth the $."}
{"text":"WOW.. THE WORST! From a person that eats all over Pittsburgh at some of the best places in this city, this place was so bad!  I met a friend there last night. I knew something was wrong when there were 10 cars in the lot, on a beautiful Friday night at 7pm. I should have followed my instincts.   Drinks (12.50 each) were fine so were the bartenders. But the food and prices were ridiculous ! 2 entrees, sea bass and blackened scallops. 4 drinks and 1 appetizer. $151.00 + tip. Trust me, go to Applebees and you will get better food and I hate chain restaurants.    Sea Bass.. tasteless with bland rice and nasty spinach. Blackened Scallops.. not blackened and tiny with 3 spears of asparagus.  I usually would never go to a chain, but we did for convenience.  I can eat at some of the Burghs best restaurants for Mitchell's prices and walk away saying WOW.    This place needs a serious face lift and needs a new head chef. OR... price your food like it should be. These entrees were worth about $12.00, instead of $35.00.  I have never been to Eat and Park, but I am sure you will get better food there.  This is my first Yelp review. I had to create a profile just to write about this place.  I know food is a crap shoot, but the managers and owners of Mitchell's should be ashamed of what they serve and charge.   Close the doors or just get a clown for a mascot and price your food like a below average restaurant."}
{"text":"Great food and atmosphere. Started off with the jumbo lump crab dip and it was so good. Then I got the Perfect Pair, which was crab stuffed shrimp, and lobster and crab stuffed lobster with red skin mashed potatoes and asparagus. It was all so delicious, and I would love to go back to try the bacon wrapped bbq shrimp (as an appetizer). We ended with the creme brulee (I am a sucker for a great creme brulee)"}
{"text":"I've been to this location dozens of times, last night being the most recent.  This is a nice location, nice ambiance, nice tables, and so on. The menu is laid out well with food on one side, and drinks on the back.  The table-side service is generally very good. They are friendly, don't interrupt conversations, and seem genuinely interested in your well being when you're there. They know the menu well, and are always willing to check on special requests.  The young host/hostesses, including the people who answer the phone, are less trained and experienced. It's obvious that's where they put the new people. I had one girl answer the phone \"Hello?\" and I actually thought I dialed a wrong number. Another one taking my order clearly didn't know the menu, and the one ringing me up couldn't be bothered to search another way for my Landry's card information after the first search failed. Oh well.  The manager almost always makes their way over to check on the food and service.  The food is really top notch, and everyone enjoyed their dinners. I especially like the sea scallops (which I ask to be wrapped in bacon, trust me) and the sea bass. The clam chowder is delicious, the lobster bisque also good, the Gumbo way too dark and heavy for my tastes. I've probably had about half the things on the menu, and you really won't go wrong with the food. The \"Sam Adams Battered Seafood\" is good but less healthy than the rest of the menu.  This place, as you should expect given the environs of the Galleria, is fairly expensive. I'd estimate about $75 per person out the door, with a starter (soup/salad), a couple drinks, and dessert. The food quality and service makes this worth it."}
{"text":"Mitchell's is one of those restaurants that I never find to be disappointing but never have a pressing need to come back. Meals are hit or miss, albeit reasonably priced. Waitstaff is typically pretty good. But they just don't have the wow factor.  It's seafood that's better than Red Lobster, but it doesn't have much character. Like most seafood establishments in Pittsburgh, they do have a good Happy Hour but I'm never in the area that time of day.  The cod with lobster Oscar topping is a prime example. The bernaise sauce is not very good, and neither is the potato hash, but he fish itself is cooked well. Decent appetizers and a good wedge salad, so at a future visit I might stick to finger food."}
{"text":"Awful,  Gave it 2 stars cause the wait staff was nice.   Was there on a Saturday night.  It was warm in there (too uncomfortable to enjoy a meal) and was told by management that air conditioning unit was broken.  Can't you afford to pay extra on a weekend to have someone repair or replace the unit?  Not even a ceiling fan in sight.    Same old menu with few options.  Ordered the tuna medium and came out rare.  They redid it but this time was way overcooked.  Ate it anyway.  Are the chefs so inexperienced that they can't tell when something is rare, medium, or well done?    Anyway, haven't been there in years until now and I remember why I avoided this place."}
{"text":"Came here to celebrate a family members birthday dinner. We had reserved the private party room which was a $300 order minimum, which with 10 people we easily met that.       The room was a tad chilly upon arrival but the waiter had the temp adjusted to correct it quickly. We had a guest arrive a little late, their was no one at the front to escort them back and they kind of walked around lost for a little.      After some internal debate, I settled on the millionaire margarita to drink, didn't love it, but didn't hate it. I ordered the Sam Adams Battered Fish and Chips which came with coleslaw, hush puppies, and french fries. Everything came out really well and on time.       My girlfriends water glass never got refilled.       Overall though, I just wasn't impressed with the atmosphere, for a restaurant that is more pricey than elsewhere, I shouldn't have any gripes. I personally would not come back here if it was my choice."}
{"text":"Delicious food! came in for their wine pairing night and was impressed. The chef and servers were very knowledgeable and friendly. Really enjoyed the butternut squash ravioli, the sauce they used had me craving more after my last bite. A bit pricey but great for a date night or special occasion."}
{"text":"I want to like this place more than I do. Its definitely at least decent. It's a family style seafood restaurant that has a bit of class to it. Pretty nice visually, and service is good as well, especially at the front desk. I've taken a couple of people there for birthdays and they do a nice job with that without being obnoxious with the ceremony. If you make a birthday reservation you can actually get \"Happy Birthday Bob!\" or whatever printed on your menus for the evening. Nice touch.   Food is just solid, that's why I don't give them more stars. I've had a few things here and there's nothing special about their flavors, although their presentations are nice. I've been a couple of times and haven't had anything I'd be excited about. Basically a safe, family style, classier mid-scale seafood choice."}
{"text":"Everything here tastes as if it were old and frozen. It is extremely over priced for the portion and quality. Nothing is fresh by any means. If you want fresh seafood, a chain restaurant is really a stretch. Majority of the wait staff seems absolutely miserable. I didn't see one manager on the floor any time I've been here. I've given this place a chance many times and something is always wrong. If you do decide to dine here, ask for Samantha. She's is a great server and will make sure you are satisfied."}
{"text":"For a suburban chain establishment, Mitchell's is a big step up from Red Lobster. They have a sizable menu of fresh seafood with relatively creative recipes and multicultural inspiration. They also have great complimentary sourdough table bread. Food tends to be more buttery than necessary. My one major complaint is that their cocktails are TERRIBLE. For $10 a cocktail should not taste like a watered-down cheap mix drink. I ordered the \"pomegranate cosmopolitan\" and asked specifically for it to be \"not too sweet,\" and it came out tasting like daquiri mix and even had sugar around the rim."}
{"text":"I have only been here for lunch.  The food is reasonably priced and the service was decent.  I usually get the fish and chips which are always good.  We go here for lunch every once in awhile and everyone at works seems to like their food as well.  I would recommend this place, at least for lunch.  I will eventually get over there for dinner but the area it is in is a cluster when it comes to traffic and I try to avoid it as much as I can.  So, if I have one major criticism, it is the location, which really isn't their fault.  I just hate it over there."}
{"text":"We went here for Thanksgiving dinner; we had called ahead to check out vegan options, but the person on the other end was a little grumpy about the matter, but there's so little open on that day, there was little choice except to make sure I ate a big lunch earlier.  I ordered the Thai salad, which is probably the only vegan item on the menu - really just a coleslaw with a peanut sauce and some funky chips.  I also ordered some grilled vegetables.  Both were good, but not amazing.   The beer selection was really bad (I mean, dive bar stuff), however the slightly pricey wine selection redeemed the place, and we had a great red and white.    The service too was pretty good, but I simply can't recommend going here due to the poor selection of vegan items."}
{"text":"Love Mitchell's - even with new ownership.  Great quality seafood on the east side.  Service was good for us late on a weeknight.  Glad they were open!"}
{"text":"Excellent service! Great food. We went at a good time when it wasn't crowded but they do take reservations. I'm not a big fish person but the shellfish is terrific and fresh, One critique,the lobster bisque had too much wine. Worth the price"}
{"text":"Not what I was expecting....very similar to RL. We were there for a corporate lunch. Needless to say I will not be returning on my dime."}
{"text":"Being from FL, I'm pretty spoiled in the way of good seafood.  I've actually been the Mitchell's in Tampa and not been terribly impressed (perhaps because in Tampa, great seafood restaurants are a dime a dozen).  That being said, I was dying for some fish up here, so we stopped in for some.  I had the wild-caught Alaskan sockeye salmon, broiled.  Pricey, but literally the tastiest salmon ever.  So worth it.  The hubs got the cedar plank salmon which was tasty, but by even close to mine.  The mozzarella and beefsteak tomato salad was good, but beware of a salad dressing drowning!"}
{"text":"Poor service for the price. Expectations are high at their high prices and reputation, but this location disappoints. We had to ask for silverware, glasses, sugar (expected with iced tea order). Veggies were  badly cooked and tasteless. Fish was quite good."}
{"text":"I love Mitchell's Fish Market.  95% of the time, the food is amazing but, when they mess up, they move heaven and earth to make it better.  The last time we were at Mitchell's, I ordered the lobster and tenderloin skewers.  My lobster was underdone.  The server was amazing and replaced the lobster tail even though I had eaten most of it.  Then, to make our night even better, comped us a dessert.  It's that kind of stellar service that keeps us going back."}
{"text":"One of our favorite special occasion restaurants. Five stars for atmosphere. We enjoy the patio and the dining room. The food is superb and the service is also very good. Birthday and anniversary desserts on the house but no hassles like singing or incessant questions about the reason for your visit. One pointer/ don't go on Valentines without a reservation, but the same is true everywhere."}
{"text":"The ginormous carrot cake. That's what comes to mind when I think of Mitchell's. It's huge. Split it between 4 people. If you like normal carrot cake though, this may not be for you, since it's particularly sweet and moist and tastes like actual cake, instead of y'know.. healthy. Instead of like carrots. 90% of my trips here have been just to split this slice of cake among several people. You MUST end your dinner with this, especially if you don't normally consider yourself a fan of carrot cake.  I have eaten here a couple of times outside of that, as well as other Mitchell's locations over the years. I will say that the restaurants are pretty consistent across that board as far as I've seen in terms of execution and friendly service (with the exception of one server here who I believe I saw still working here last week somehow - but it's good enough chances to be worth taking). It's nice to have a decently good chain to rely on if there's nothing else that strikes your fancy in a new city or middle of nowhere somewhere.  The seafood here is pretty good - always cooked well, fresh, and seasoned properly, but some entree portions I've seen are on the small side, and it's not very consistent across the menu. But again, there's good service from waiters who can probably make a good recommendation in terms of size.  If the seafood craving strikes on a tight budget, happy hour is a great deal. I believe it's weekdays 5-7pm here. Can stuff self for as low as $6 (ie 2 decently sized tacos + plate of fries) with pretty delicious food in the lounge/bar area, which is quite spacious and has comfortable booths along the wall."}
{"text":"My significant other and I thought this would be the perfect place for an early New Year's eve dinner. I had eaten here a few years ago but my SO had never experienced Mitchell's so we thought it would be a wonderful new experience. We were sadly disappointed. I ordered the Chef's monthly special-essentially a 'boil' of various types including a lobster tail. While it was all good, the alaskan crab had not been pre-cut causing me several cuts to my fingers while trying to extract the meat.   My SO ordered one of the evening specials- a surf and turf with lobster Oscar. The first pass, both the filet and the potato were barely warm so they were sent back. When they came back, the filet was seared on the outside-but blue on the inside and totally raw and minus the lobster. So again sent back. We were assured by the manager that the kitchen would get this right. We were praying he was correct, but unfortunately he wasn't. The third pass was the worst example of a filet I had ever seen. There was fat and gristle throughout the meat and again there was no lobster. We gave up. When the manager asked what he could do to make it right-we had to request to not pay for the meal-something I feel he should have offered. He did then offer two complimentary appetizer passes for later visits, but I am not sure that we will ever return after this experience."}
{"text":"This place is fantastic! If you are a frequent traveler and looking for FRESHLY made food this is the place!! It's a quick walk from the hotels next door.  Highly recommend!"}
{"text":"Management issues! First, Mitchell's thinks it's fine to price gouge on holidays (New Years Eve, Mother's Day) by putting dinner prices on their lunch menu. Then, they shamelessly serve lunch portions. When you complain, they send the \"manager,\" Samantha Rubaker, over to cement your poor customer service experience. Avoid this restaurant, except at lunch on non holidays. The food is pretty good when the pricing is fair."}
{"text":"I love eating in the beautiful river setting (though it is right by where the bloody Homestead Steel Strike took place in 1892).  I would have given this place a higher rating based on past visits.  But my most recent experience was not quite as good.  The waitress spoke too fast, and gave me misinformation about what sides came with the plank of fish.  She did offer to fix the mistake, but I let it go and traded sides with another person who was with me. I think broiled is better than the plank.  I still will eat at Mitchell's at least once each time I visit Pittsburgh.  The food is healthy, and I enjoy being there."}
{"text":"Me and my girlfriend went to Mitchell's for valentine's day dinner. We chose Mitchell's because it was close, we both like seafood, and we were easily able to get a reservation.  When we showed up at 7:00, there was a line to get in, which I figure is normal when everyone is making reservations for the same time. The line went quickly as everyone had a reservation and was promptly seated in the restaurant.  for some reason, me and my girlfriend were seated \"outside\" rather than in dining room or at the bar. I use quotes because outside in this context is basically in the middle of the mall. Couples before and after us were seated in dining area so I'm not sure why were had to sit in the mall. It felt weird because they seated us by the hostess station and there were people waiting in line to get in about two feet away from us. It was also a little strange to spend this much money on dinner while staring at the Panera from across the hall.   What I did like was that when I made my reservation, I told them I had a peanut allergy and the seating hostess was aware when she sat us without me needing to say anything. She told us she would tell our waiter for us. Just to be sure though, I told the waiter about my allergy and it seemed like he was hearing it for the first time. But maybe she just had not spoken with him yet. Our waiter was very nice and attentive.   I ordered the Shang Hai Sampler. It was pretty good. My girlfriend ordered the cod stuffed with lobster and shrimp. She loved it. We were given complimentary chocolates and also ordered creme brule and a cappuccino. My girlfriend loved the dessert but my cappuccino had no foam by the time it came so essentially it was a latte.  We will probably give this place another chance since the food was pretty good and we were given a coupon to come back. Otherwise this place is a little too expensive for the food. It is really too expensive if you are eating in the middle of a shopping mall."}
{"text":"Food was great! Scallops were fresh and cooked perfectly considering I had them blackend. So easy to over cook.  Only complaint was on charge on McCallan 12 on the rocks, $19, yikes! What do they charge for 18. Nearby competitors only charge 15 tops."}
{"text":"Big night out with the girlfriend's parents and family a few weeks back. Since we had a gift card we went along.  Gotta say, the service was good and the appetizers were good also. in fact i tried raw  oysters here for the first time and loved them. Neither of us, though, much cared for our dinners. She had the crispy ginger salmon and i had something w/ shrimp, scallops and salmon (i think). There was nothing really awful but nothing that knocked my socks off. Her salmon was not crispy at all. Due to the fairly expensive prices i doubt we'll be back. you never know though."}
{"text":"Service an atmosphere was great. I had the shrimp boil and it was very under-seasoned. Much closer to bland than anything."}
{"text":"Pretty average restaurant. It's a little dark and drab on the inside. However, they do have a great happy hour with some very decent food selections. My favorite is the spicy crunchy shrimp that comes with sticky white rice. It's only $6 during happy hour."}
{"text":"This was our first and probably last time dining here. The waitress was nice but did not really have her game on tonight. We waited quite awhile for our drink orders and some had to ask for water three times before it was delivered.  The salads were good but for the price the portions were a bit mediocre. Our dinners arrived and were not hot.  I had the salmon, scallop, shrimp soy ginger dish and all of my seafood was overcooked and cold and the rice was barely warm. Another at our table ordered scallops and they were cold and overcooked also. We were a party of 10 and everyone's dish was not hot. Our water glasses were never refilled. The restaurant was not very busy and I feel like they could have done a much better job on our food for the prices charged."}
{"text":"I am bummed about this- I had high hopes. Here's a rundown of the evening:  Pros: - super friendly waitress, Stephanie, who maintained her professionalism and friendliness throughout  - yummy elderflower and pear beverage - lobster bisque was nice and lobster-y - hot delicious bread  Cons: - oysters were sketch. And I don't feel good about that. Stephanie brought us an order of East Coast oysters to replace the West Coast ones that we sent back. - fresh grated horseradish had NO flavor or heat- what's up with that? - scallops were meh- came with weird veggies, unevenly seared, and no real flavor. And at a whopping $25 a plate, I expect some nummers!  I doubt we'll go back- for those prices, I would prefer McCormick's or Ruth's Chris."}
{"text":"Our second time here. It was so good the first time, we went back. What a disappointment. Service was slow. Bar drinks watered down to virtually nothing. The food is good, on the other hand. You get good quality fish, no argument. I had lobster and crab stuffed cod, but no starter or salad. This was a mistake, as I was still hungry after my entree. I ordered the ridiculously large carrot cake, which seems to try to make up for its lack of appeal through size, and couldn't finish it. Would have preferred a more substantial main course."}
{"text":"Traveling with my boss, we had dinner here since it was convenient to the hotel. Food was good as usual but we ended up with a young man who had not been a waiter for very long. Brought us a bottle of Cabernet when we ordered a bottle of Chardonnay.  Told us he had never opened a bottle of wine before. Expected better service at a place like Mitchell's."}
{"text":"Had the blackened fish taco's, the were very good along with a pint of Guinness. Recommended."}
{"text":"So... dinner in the Land of Bland.  Where ya gonna go?  Let's face it.  In this neck of the woods, it's mostly chains.  Your job, should you choose to accept it:  suck it up and pick the best of 'em.  One could do a lot worse than Mitchell's.  What the place lacks in personality it makes up for in fresh seafood and cheerful service.  We had reserved a private room for our party of eight, and were not disappointed by the abundance of hot, crusty bread, large wine menu, and pleasant wait staff -- which included a woman who seemed to be one of the managers, helping out with a smile.  We started with the calamari and artichoke dip served with tortilla chips.  I indulged in a Columbus Pale Ale and copious amounts of bread and butter (too much, likely) before diving into the Shang Hai Seafood Sampler, a cornucopia consisting of fresh Atlantic salmon, scallops, shrimp, sticky rice, sesame spinach and rice wine soy sauce.  Presentation was excellent and the sauce added a delightful gingery kick to the proceedings.  Even our three year old was entranced by the clash of flavors.  All in all, a nice dining experience for a chain in an upscale mall in suburban Ohio.  As much as I don't like to let my Brooklyn/New York food snob side show, sometimes it's hard not to judge places like this -- there's just so little that's distinctive about them.  But when a place like Mitchell's impresses on the level of its cuisine alone, that's something worth putting prejudices aside for."}
{"text":"I've been here twice and I'm very pleased with the seafood there. I have ordered some of the fish dishes, very fresh and delicious. I wish I lived closer to the East side, otherwise I would totally go more often!"}
{"text":"This place used to be THE place to get some good fish around the Beachwood area.  The blackened sea bass was off the hook.  The portion size was good and the service was impeccable.  You just knew that if you took anyone here, they would get a good meal.  Recently it has just been an average experience.  The fish that I received both times was ridiculously small for the price of the dish.  I'm not sure what happened to the wait staff, but they seem to have forgotten how to take care of a table.  I guess that this happens after a restaurant has been open for a long time.  They become complacent.    Best of luck Mitchell's.  Cleveland is a very unforgiving place."}
{"text":"The service was mostly friendly but I was disappointed in my meal. My meal was way over cooked. The soda was flat and the carbonation needed changed and I felt like we inconvenienced our server by asking for new ones.  Overall, I thought it was mediocre and I was expecting more for the prices."}
{"text":"I took my daughter here for lunch. She had been wanting to come for a good while. She's graduating high school next week so it seemed like the perfect time. She had the clam chowder and the shrimp scampi. It was great. She wished that the chowder was slightly thinner but enjoyed the alfredo-like flavor. I was not in the mood for seafood so I had the bacon cheeseburger. You can't go wrong with a burger right? Well, let me tell you, that was one of the best burgers that I've had and I frequent restaurants who specialize in them. It had a beautiful char flavor to it. I did not need any condiments. The broccoli I had was wonderful as well and I especially enjoyed the seasoning.  The only thing that slightly sullied it for me is that it was too dark. I love atmosphere but I was almost asleep before the food came out."}
{"text":"Was here with a few friends on 12-21 for an annual dinner tradition we've been keeping up with.   If the kitchen had a manager, it was certainly not evident as the place was not even half full and we waited well over an hour for our food. Part of the wait was due them running out of entrees and the server coming out suggesting substitutions.   I ordered the chicken which wasn't even made yet when the rest of the party was nearly done eating. The server offered to box it up but at that point I was no longer interested.   While kitchen screw ups on such a light night is difficult to explain, how it was handled by the restaurant manager was even more inexplicable.   It was good that my wife's meal was comped and I didn't need to pay for my coffee and the gumbo That came with the food I didn't get, but it is the  managers responsibility to come out to address issues like this with the customer. Doing so would have motivated me to come back another time , but instead the server was thrown under the bus to address and apologize for issues that were not her fault but that of  the kitchen. The manager never showed his or her face.   Making this very point was that on the receipt under refund was \"server error\" when it was the kitchen screwing everything up. I brought this up to the server and assured her none that of what happened was her fault and gave her a ten for her troubles.   The manager taking 5 minutes to come out and explain things and at least shaking our hands would have redeemed this evening but instead he or she hid in the back. It's a pity because now they lost customers over being discourteous."}
{"text":"Beautiful decor. Very genuine staff. Very clean washrooms. Delicious food. I tried the market trio. The blackened tilapia was nice with a little bit of spice. This is a great place for a seafood lover."}
{"text":"Awesome seafood! Lobster bisque and clam chowder were superb. Mussels are perfectly cooked and seasoned. Scallops and shrimp fresh and tasty. Dining with a large group we still were taken care of promptly with friendly, courteous staff. Our food arrived hot and timely. Will recommend highly and with confidence that the entire dining experience will be great!"}
{"text":"I've been here only once, and it was just OK. Not wanting to eat too much, we shared a house salad and a fish & chips (beer-battered cod, chips, hushpuppies, and coleslaw). The salad was a bit limp, and the cod wasn't outstanding nor bad, just average. They didn't do a great job of the beer batter, however -- I would say it was over-deepfried (ie, a bit burnt). The chips were average, hushpuppies weren't great, and the coleslaw was also a bit limp. The fish was not seasoned, which could be good or bad depending on your tastes. On the upside, our waitress was very nice and amenable to us sharing (both the house salad and fish & chips came out halved, on separate plates, for us, much to our surprise), though she was slow at times. Overall, a disappointing meal; I wonder if there are other items on the menu that Mitchell's does well?"}
{"text":"I go here with my elderly father for the sole reason that he only eats lobster bisque when we go out for dinner.  Last night I had the shrimp stuffed with crab meat.  Embarrassingly small shrimp with a heaping teaspoon of crab meat.  Kudos to the chef for being able to butterfly shrimp this small.  The green beans were inedible due to excessive salt-and I like salt.  Mashers were okay.  I'm always disappointed.  I should have ordered the broiled scallops, they looked good and were a fair sized portion."}
{"text":"Since Mitchell's went corporate, it has gone downhill from the quality and service customers used to receive. This place has been hit or miss the last few times. This time it started off as a miss but finished with a homerun.  We had dinner reservations for 3 at 6:45PM. Upon entering the restaurant was extremely busy, with a good bit of people in the waiting area. We arrived at 6:25 and immediately checked in. 6:30 came, same amount of people still in waiting area. 6:45, the 6:30 reservations were still waiting to be seated. We spoke to hostess at 6:55 and promised us we were 2nd in line. 3 tables were seated before us. The hostess looked flustered, confused, and not interested in helping to rectify situation. At 7:05 we were finally sat.  Our server was excellent. Came by often to refill waters and take new drink orders. Helped us with our menu questions and gave suggestions. Our appetizer came out quickly with enough of a gap between our entrees which is always a plus! I got the Shanghai Chilean SeaBass. Cooked perfectly!!   The initial experience was setting the stage for an irritating evening but once we were sat the service from our waitress and quality of food quickly made up for the early mishap."}
{"text":"Place is always good. Its been years and I cannot remember a poor food experiance.  The servers can be hit or miss.  We always have great company so our conversation may override poor service.  We also order an app when we order drinks just in case service is slow (then we don't notice as much since we are not as hungry and focused on it).   We will keep going and prices are fair.  If you want cheap then hit up Red Lobster."}
{"text":"OK, I'm here mainly for the Charbroiled Oysters! Shhh, it's on the secret menu, don't let anybody know that I told you about it! Since i'm new to Cleveland, I was dying to find a good seafood place that has grilled/charbroiled oysters and finally, here I am!   Thanks to \"Kristen\" who told me about it! I wish it is included on the happy hours menu tho \"unfortunately it's not :(\"   I've tried the following: - Raw Oysters (the sauce is kinda strong so get it & the celery on the side just in case!) - Charbroiled Oysters (thank me later!) - Grilled Salmon with goat cheese (mama mia!) - Spicy shrimp (It was kinda too sweet! Not a fan of sweet food - I guess maybe it's ok for an appetizer..hey some people like it!) - Fish tacos (meh, kinda plain to be honest! I feel like it needs some spices.. cumin salt and pepper would make it PERFECT!  Their happy hour lasts from 4-7! Kinda limited menu with fair selection of drinks! I will definitely come here regularly, service was excellent, thanks to Kristen, Britney and (Erica?).   I would definitely recommend it! Give it a try if you like seafood!"}
{"text":"Great place!! It's a chain but has awesome food.  I surprised myself and picked a white wine I actually enjoyed. The oysters were awesome despite the Ohio location.  Gumbo was absolutely delicious. Arugula and squash salad (fall specialty) was just what I needed!   A casual/ laid back place in atmosphere - you could dress it up or dress it down casual if you really wanted.   If I'm back in the area I definitely will try and come back! I was very impressed! One thing I didn't like is at 9pm they started cleaning up, and we were sitting by the bar. It was a little unsightly to see employees doing stock checks, so arrive early!"}
{"text":"Good service. slow kitchen. Tried the new scallops with duck hash. Good. Squinchy portion not $30 good. Wife had new signature item. Good. not memorable. Again, squinchy portion was all we remembered about it. Probably won't be back. Just not worth the $$$,"}
{"text":"My husband an I went to Mitchell's for our 31st wedding anniversary. It was just alright. I had the Mitchell's trio. The grilled shrimp was more like shrimp jerky but the crab cake and grilled salmon was good. Hubby had tuna steak which he said was 'good'. The service was average - Just feel it's over rated. I doubt we'd go back. Maybe for just a fish sandwich...."}
{"text":"Tried the cedar plank salmon which came with grilled zucchini and asparagus.  It was also topped with diced tomatoes and feta.  It was cooked to perfection and proved to be a very filling healthy meal.  I also really enjoyed their bread pudding.   Not too sweet and the perfect portion.    This would have been a five star rating but the atmosphere of the restaurant was a bit lackluster. It was a Monday during football season but I was the only guest in the restaurant.  Generally this would make me think twice about staying at an establishment but I'm glad I stayed. I will try this place again."}
{"text":"Diane and I took guests from Brazil here for lunch. The food was wonderful. We had Talapia that Diane thought the very best she has ever eaten. My Scallops were grilled perfectly. Try the Gumbo if you want a zesty treat. I could have enjoyed this slighty spicy treasure as my whole meal The service was wonderful and the waiter was very patient with the language barrier Try Mitchell's, you should not have a regret!"}
{"text":"It's difficult to justify depleting our oceans of sea life in order to have this place ruin the food.  Calamari was limp and cold. All the fish orders were under whelming and unappealing.  My blackened scallops were fine (but way overpriced) but the vegetables would have been better if they had been cooked.  (Note to management - raw carrots people eat (sometimes) however raw beans are for the birds).  Bread was tasty but here's a novel idea - slice it all the way apart - why do each each of my dinner guests have to wrestle it apart using two hands AND arms?  Even something as simple as ice tea - it was so cloudy and nasty looking,  Very gross.  Note: tea should be clear.  I only came because my guests were interested in fish over other local options.  Next time I will try harder to encourage those other options.  If I was not in front of guests, I would have given up and sent it all back.  Summary - you can (and should) have a better experience elsewhere."}
{"text":"I can here with my family yesterday and we had a great time. The service was wonderful and the atmosphere was very pleasant. I wish we had selected to seat outside the view was wonderful, but maybe next time. Mitchells is a little bit pricey, but I think its worth it. I had the mussels as my appetizer they were delicious just wish there was a little more of them. Since I did not feel the appetizer was enough I ordered a lobster bisque soup. The soup was ok, but I have had way better lobster bisque before. Then I ordered shrimp and Andouille jambalaya it was pretty good. Finally for desert I ordered crme Brule it was fantastic. I ordered a pineapple coconut mojito as well it was good, but not nearly as good as the mojitos in south beach :(. I would recommend though. :)"}
{"text":"One star is so generous - What a joke this place is.   We went there several years ago (wasn't very good then either) and haven't been back until today.  MISTAKE. Our waitress was Anna.  We refused the bread and while I understand she seemed surprised, (cuz everyone loves bread, right?) made a face and scoffed a bit about my refusal.  (Sorry, we didn't want bread). She seemed in a hurry for us to order because she had to come back twice, but I wasn't ready.    Husband ordered Lobster Bisque soup for $7 for about 3/4 of a cup.  It was room temperature and nothing like the bisque you can get for half the price and quality at Piada and no where near the quality of Hyde Park and Texas de Brazil. It was not smooth and creamy but very tart. I thought it was too tomato tasting.  I was glad I did not order it.    Onto placing our dinner order - after the quality of the soup I decided NOT to order a $35 meal so I opted for something that would be difficult to mess up.   I got a grilled chicken Caesar salad and asked that the lettuce not be tossed in the salad dressing, but wanted  the dressing ON THE SIDE.  Husband got the crab legs. Easy enough - right?HA.   Anna didn't give husband a shell cracker, the seafood fork, nor butter. A different lady brought our meals. Husband had to use his hands to crack the legs and a dinner fork to eat the crab.  My chicken was overly charred and actually it was not even a full breast of chicken (for an extra seven dollars??!) but looked as of the breast had been sliced in half.  My salad had dressing all over it and they were kind enough to supply an EXTRA SIDE of dressing.    Anna was nowhere to be seen.  We began to eat. She noticed that husband was using his hands and a dinner fork and hurriedly brought the scrap bowl, the cracker and the fork, and hurriedly left again for an extended period of time.  Then later she came back and asked how everything was.  We were about done at this point.  I explained to her that the salad had dressing all over it despite me saying I wanted it without dressing. Instead of apologizing, she began to argue that she thought I had put dressing on it because they \"usually give two sides of dressing\" but I only received one.  Then she asked if she could get me another one.  I declined.  Where was she 15 minutes ago?  The manager came over and spoke a little too loudly.  Servers were staring.  She asked if she could get me another salad and I declined.   Husband made his statement about the utensils not being provided and asked if butter should have been provided and the manager said it should have been provided prior to the meal coming out.   Manager stated that she would let Anna know about that and walked away.  Okay...?  I thought the manager was actually going to adjust our check and our check was brought to the table. It was for the full price.  No adjustments made whatsoever.  I wasn't expecting free meals, but some sort of discount.  NOPE.   Husband gave the credit card and I thought they may adjust it then.  NOPE. Then Anna proceeded to depart our table and was so obnoxious saying goodbye and \"have a FANTASTIC EVENING!\"  Ya thanks Anna.  You too.    My suggestion is that if you're planning to go to Mitchell's, take another hop, step and a jump to Texas de Brazil in the same parking lot.  There - you can get an all you can eat salad bar with FRESH ingredients AND a lobster bisque (that is also to die for) for less than what you would pay at Mitchell's.     I felt bad because I was the one that suggested Mitchell's.  Never again."}
{"text":"First off I have to note, their Maine Lobster Bisque is amazing. Definately don't miss out on it.   That being said, we had lunch there and the lunch portions are a good value. I had the Cedar Plank salmon. The fish was fantastic, except that the vegetables were a little bland.   The atmosphere at the restaurant is quite relaxed, and I don't think I've ever seen it get more than mildly busy in there, so it is a nice place to go to have a quiet meal with someone special."}
{"text":"This Review will be three parts... food, service and decor.  Food...  4 stars. Food was very good. I got a filet and shrimp. Excellent but pricey.  Service... 2 stars. We sat at the bar. The bartender took our order and waited on us. Although it seemed she worked here for a long time, she was very flustered and got our order wrong. She even forget our drinks at one point and we had to remind her. The bar area was not very crowded and we noticed that she made the same mistakes with other patrons. Not sure what the problem was  Decor..1 star.  As previously said we sat in bar to watch a football game. There are four tv's placed in very strange places with made it almost impossible to watch them. The tv's were old and needed updated."}
{"text":"I have always had a great dinner at Mitchell's but something has changed. Went there last night about 5:30, the place was maybe half full. We were seated and when it finally occurred to us that no one had been to the table at all to ask about drinks or even bring water, I started timing.... 14 minutes later we decided to leave. Told the hostess what had happened and got a blank stare.  Sorry but not going back there again."}
{"text":"The food was delicious. Excellent seafood, and plenty of things to choose from on the menu. However, the service we experienced was terrible. We sat at our table for 10-15 minutes before anyone even noticed we were there. Keep in mind, we were here late afternoon/early evening so the place was half empty. Once we ordered my draft beer took 10 minutes to come out, then it was wrong. I kept it anyways or else I'd probably still be sitting there waiting for it. Good food, but I won't be in a hurry to go back."}
{"text":"Celebrated my birthday last night.  They arranged to have that printed on my menu.  Had Chilean Sea Bass grilled.  It was excellent.  The service was great.   Not too fast and not too slow.   Had the opportunity to dine outside on a very pleasant October evening."}
{"text":"I love this place. Yes, it's a chain. Yes, it's a bit pricey. Seriously though, there's nothing better on a thirsty Thursday night than rolling into the bar area, scoping out a cozy, dark booth with my husband, ordering a strong martini and enjoying the evening.  The fish is always cooked to perfection, and the wait staff never minds if you have a special request.  Feel like eating healthy? Order your tuna steak blackened with a side of steamed asparagus (double up and forgo the starch). A great neighborhood stand by for the Lebo/South Hills area."}
{"text":"Excellent service, great meal!  They had an excellent selection of seafood,  and I can't wait to dine again"}
{"text":"Food was only ok. Had lobster bisque soup not to good. Had the shang Hai Seafood Sampler. The scallops were hard, over cooked. The samon was good. Shrimp had no flavor. I will say the service was the best. Our waiter was great!!"}
{"text":"Ordered 1 lb. of crab legs and found a short hair. Kind of gross to say the least. The \"manager\" decided that a credit of 1/2 lb. of crab legs was appropriate since a couple were eaten. While the math isn't necessarily wrong what he neglects to realize is the fact my wife ate those in the presence of a short hair on her plate. I'll NEVER be back and I strongly recommend avoiding at all costs. I paid. I tipped. I left."}
{"text":"This review is just based on one visit during happy hour but.... we really loved Mitchell's happy hour!  Good food and drink choices between $4 and $7.  I had a mango-jito which as basically a mojito with tangerine rum and mango puree.  Delicious!  I also tried a white wine sangria which was also good but I'll go back to the mango-jito next time!  A table close to ours had the fish sandwich and it looked great!  We had oysters, pot stickers and crab dip.  My husband was disappointed that there were only three oysters in the order but he said they were very good!  Can't wait to go back and try more of the food!"}
{"text":"Went here for a group dinner and had our own room off to the side since there was AV involved.  Our room sat about 10 of us and we had a preset menu.  The salad was meh, seemed to be out of a bag and underwhelming.    I had the chilean sea bass for dinner with vegetables and mashed potatoes.  The entire dish was delicious and generous on the portion size.  The potatoes still had the skins in them and maybe had some garlic, but were delicious.  I'm not sure what the fish was cooked in, but it was delicious.  For dessert, I had the 'mini' version of shark fin pie (Butter fudge ice cream, honey roasted peanuts, fudge, peanut butter, Oreo cookie crust).  The mini version was still enough for two people, so I'm not sure what the regular size looks like on the menu.  The other option was key lime pie, which everyone at the table thought was delicious.  Probably more on the pricey side, but I didn't have to pay, which made it even better"}
{"text":"So this is only my opinion and what transpired while dining here.  I called and made reservations for 7:00pm on a Friday evening.  My wife and I arrived at 7 on the dot and were immediately seated.  We were there 20 seconds when our waitress rushes over and apologizes for making us wait.  20 seconds?  We ordered drinks, which came quickly, then we ordered appetizers and the main course.  My wife had calamari, which was to die for, and I had oysters on the half (great choice).  We both ordered surf and turf and the steak and the lobster was done to perfection.  A little free dessert for my birthday and a round of applause from the fellow dinners capped it off. Service was excellent, food was really good and the atmosphere was comfortable.  Plus, since I'm from NYC the prices were reasonable for what we had. Would we dine here again?  Every time we visit Pittsburgh it's a must!"}
{"text":"I had heard good things about this place but was a little skeptical based on some reviews and portion size. However, went with my mom and brother for mother's day and I was very impressed! The place was really busy so obviously the service was a tad bit slow but Chris was a great server. He had amazing customer service, enthusiasm about his work and was truly working his butt off while checking in with us multiple times. I commend hard work like that regardless. Ordered the Mitchell's trio for dinner and shark fin dessert and both were executional. Every plate that came out for us was cleared off it was that good. Highly recommend giving this place a shot."}
{"text":"USED to be my favorite restaurant.  USED to be is the operative word. 2nd time here recently and both times a disappointment.  Tonight, service was horrible!  I had to send my tuna back twice. It was grizzly like a steak. Twice. Couldn't cut it with my knife. Won't be back. Too pricy for this."}
{"text":"We went to Mitchell last night, We knew there was going to be a wait , which is fine, but when I told the hostess that I forgot my phone, she said that's how they get a hold of me! She didn't even give me an option!What did they do before cell phones, wait at the bar, of course! So we went to their competitor. Very poor customer service."}
{"text":"I did not know this is a franchise restaurant until I had looked it up on the internet. This is the only restaurant I was not familiar with by the waterfront. My mom and me sat on the outdoor patio, the weather was very nice on a breezy summer day.  There was a great prix fixe special for $23, what a great price for regular portion salad---the dressing was too sweet for me---entree and mini dessert. The fish was fresh. My mom's chilean sea bass shanghi style came with sticky rice and spinach. The sea bass had nice texture and was reasonably priced. My lobster and shrimp pappardelle had more shrimp than I expected. My desert was creme brulee, which was very good. I love a good sugar coated dessert."}
{"text":"I've eaten here twice and the location in the waterfront once. I really enjoyed my experience! The food is pricy, but it's high quality seafood. Much better than red lobster, Joe's Crab Shack, etc.  I really like the shrimp tacos and the sea bass with lobster on top. If you're in the mood for a great piece of fish and sides, this is the place for you."}
{"text":"My friend and I ate lunch here for first time past Friday July 1 2016. We started w cup of Maine Lobster Bisque you could taste the lobster broth butter and cream& dry Sherry( Im a retired Sous Chef) it was better than bonefish's which tasted like tomato soup! Paid $5.96 a cup but worth it! My friend had Stuff shrimp w crab meat and six nice size shrimps w lump crab in it. And hers came w buttered smashed reds potatoes&?fresh Broccoli melody which were all fresh veggies seasoned right. She had extra take home. I had the Sam Adams seafood platter- just right for lunchtime. 2 pieces if beer battered cod was so fresh like they cut it off the fish.& 3 medium battered fried Shrimps tasted sweet fresh like shrimps do fresh& 2 diver dried scallops size of silver dollars- they brought us a fresh hot Bread loaf w softened butter! Mine was $14.95 hers was same plus 2 glasses Ice tea w Tip it was $50.00. But it was worth it! If you want fresh good seafood or fish you pay it! Im going back to try dinner menu! We really were full and couldn't have their Shark Fin pie desert! Really an enjoyable time w better co& food!"}
{"text":"Here's the thing.  My wife and I would go to Mitchell's about once a week.  It would be a quick happy hour dinner then a movie.  We eventually started going elsewhere to try something different.  Not to long ago we decided to go back.    In between there I believe the management had changed.  Typically during happy hour we would get the fish tacos which were pretty good and crazy cheap.  Other than that it's normally an overpriced piece of fish that usually is pretty good along with a nice atmosphere.    Not too long ago I would have given them 5 stars but based on the bad service recently, lower quality food, and newly smaller portion sizes I'm being generous and giving them 3/5.  When a higher priced establishment cannot accommodate you by serving you from their bar menu when they carry all of the same items normally I feel like that's a problem.  I am not asking you for the happy hour price, I am just asking for the same items I normally get because I like them.  Charge me triple!  I don't care.    On top of that there is a person there who relentlessly places a reserved sign on the booth tables in the BAR!  Yes, in the bar.  When you can make reservations at a restaurant with tons of seating I wouldn't imagine I would want to be seated in the bar.  Also when I show up at 6:00 p.m. on a Friday and the place is mostly empty and the bar is where I'd like to sit I shouldn't have to deal with a reserved sign along with a snotty comment by my server asking if we're going to be eating dinner.  I'd prefer a nicer booth and not being crammed into a small booth, sitting on a bar stool or at a high top table.    Sorry, I may be a little disgruntled but for the price you will pay here you shouldn't be treated this way especially if you come here often enough and keep coming back with this type of service."}
{"text":"I absolutely LOVE Mitchell's! Everything here is awesome. The food, drinks, service...all fantastic. I'm kind of surprised to read poor reviews for this place, because every time I've been to Mitchell's I've had a great experience. The staff has always been friendly, courteous and accommodating.   My favorite dishes here: Alaskin king crab legs (obvs), the clam chowder, jumbo shrimp cocktail, calamari, house salad, cedar plank salmon and the tuna....it's some of the best seafood I've ever had."}
{"text":"Very enjoyable evening at Mitchell's last night.  The wait staff was exemplary, attentive and pleasant.  The tuna appetizer was very good, although pricey for an appetizer. (14.00)  Coffee for 3.25...CRAZY but it wont stop me from going to Mitchells...just wont order another cup of coffee.  (I'll save that money to use towards the delicious tuna appetizer!)   The 10.00 carrot cake Is plenty for 4 people, so don't pass it by!"}
{"text":"What can I say: Great seafood!  Cheap oysters and half priced appetizers on Mondays.  The bar staff is excellent."}
{"text":"Stopped today for lunch and sat at the bar. Received a rude and confrontational reception from the bartender. Since I have other choices nearby (Bonefish Grill), I left. Only 1 other customer at the bar. Hard to understand but I'll not return."}
{"text":"Top points.  Service. I was there with a large group for a meeting. They gave us a private room and two servers took care of us. They were efficient and very accommodating. Kudos.   Appetizers: had the crab dip and calamari. Both were good. Servers brought extra chips with the dip as they were needed. I'm always surprised that more chips are not just added to the original dish at this point. Dip was good. Calamari was done well. Preferred the shrimp cocktail Sauce with it versus the Asian type soy sauce that is served with it.   Wedge salad with bleu cheese. Waaaaaay too much cheese and I like bleu cheese.   I had the blackened tuna with mashed potatoes and seasonal veggies. Carrots were carrot sticks hardly cooked and dry! Green beans overdone and broccoli had seen better days. Simple green beans would have been more appetizing.  Tuna had blackening spices but needed a better sear on it. Was not over cooked. Potatoes as expected.  Other dishes seen--fisherman's platter. Looked a little greasy, but that's expected from me in a full fried dish. Would be nice if this was offered broiled as well. Crab cakes and filet looked okay.   Overall I'm always underwhelmed and overcharged here. I guess with chain places you get that, but I want more from a place that charges me 25 bucks for sub-seared tuna."}
{"text":"In the Homestead area of Pittsburgh. Seafood gumbo was very good. Broiled scallops were very good, partner had sea bass stuffed with lobster, also very good. Vegetable sides were not as good as the fish. With two glasses of wine the total was $83. In and out in an hour. I'd go back because the fish was that good"}
{"text":"Unlike some other reviewers here that came to a FISH MARKET looking for vegan food (and didn't like it, who would have guessed !! :| ), I came here to eat fish.. and it was delicious..   I had atlantic salmon on special, with chili citrus glaze, that turned out awesome.. we also ordered cedar plank trout which didn't disappoint either.. overall, a real good first seafood experience for this place.. I'd have loved to give them 5 stars, but I'd hold that till they add some nice local beers.."}
{"text":"After a long but beautiful day touring Pittsburgh and riding the Duquesne Incline we settled down for a late dinner at Mitchell's fish market. We were seated in a picture perfect spot by the window as requested. Our waiter initially greeted us warmly but the service went south quickly and I trying to wrap my head around - Why?   What was wrong with the service you wondered. Well..... *We had to wait a long time for our drinks  *appetizers ordered but not received. * Requested bread several times waiter was oblivious to the request  * Dinner took for ever it felt like a century later  It was good thing we was on vacation so we had time to waste.  We observed the other waiters and waitress was busy attending to their patrons.  On the plus side the food was divinely delicious!  Salmon, scallops- Super fresh and melted in my mouth.  My husband's dish ordered the Shrimp and Crab Cakes and he hummed  yum to every bite he ate.  Unfortunately service and excellent service should go hand and hand.  If only the head manager who was consistently walking around to various tables talking to patrons would have stop at our table we could have given him the scoop about our lack of service.  On well."}
{"text":"We (our group of 5) arrived at Mitchell's around 9 pm.  Place was shutting down, server did their best, but appetizer and entree showed up at same time.  Server then disappeared,  no servers on the floor.  Could not get butter for mashed potatoes, no offer of dessert.  Don't go after 8 pm.  So many good choices out there that want business."}
{"text":"My wife and I were always wanting to eat at this restaurant but never had the time. Today we did and I was terribly disappointed. We went at noon, which I would believe would be pretty busy (first sign) it wasn't. We both ordered the same drink an Arnold Palmer, which was watered down. The appetizer we ordered was the crab cake, it tasted overly salty. Our entrees the fisherman platter, the portions size sucked (2 shrimp, 2 scallops, and 2 pieces of fish) for $20, and it was over cooked pretty much burned. Will not recommend dinning here...... Oh and service sucked to, but the atmosphere was nice!"}
{"text":"We were passing through the area and were looking for dinner a little more upscale then Eat 'n Park so we ended up at Mitchell's Fish Market. We sat in the parking lot for a while waiting to ensure that we were dressed appropriately, but it was a Tuesday night so it was quiet, and we figured we would give it a go. Overall, the dress for the resturant is business causal, but there were several people sitting at tables in jeans.   Food was incredible! I had the salmon which is sushi grade salmon and melted in your mouth. My boyfriend had a platter with three different types of seafood in three different preparations... he said it was incredible. I was able to steal one of his Shang-hi Scallops which was perfectly cooked and the shang-hi sauce was a great salty balance to the sweet and savory scallops.  I was surprised none of our meals came with a starter salad, but only a small basket of bread... but to be honest, once our meals came we hardly noticed since the main dish was so large.  I just wish there was a location closer to DC."}
{"text":"so my husband asked what i wanted for x-mas. dinner out. someplace nice. so here we are.Mitchells fish market. nice drinks at the bar. bartenders very nice fun and friendly. now at table. sat for 10 minutes before someone said \"ill be right with you\". ordered mussels which were some of the best we have had. crabcake very small($14) burnt on one side and tasteless. i really enjoyed the  arugula salad but my Chilean sea bass($35) was small and just ok. good potatoes but vegies cold and uncooked. rainbow trout just OK. service was not up to pare for a \"fancy\" restaurant. will not be back"}
{"text":"Feels like our entire vacation from Vegas has been nothing but a let down on the dining spectrum. After eating in Michigan, Ohio, Illinois and Indiana I finally thought hey, PA has gotta have some good food! Please!!!! Um no. Took my bf here to celebrate his 40th birthday and no one even asked if we were celebrating anything, obviously because no one cares... anyhow, why should y'all? The oysters were good but what a waste of money on the Chilean sea bass and the market trio platter. The sea bass was way salty and the rice was mush along with the cold spinach. The salmon and crab cake were dry, cold and just awful. Good thing I had my wine to wash down the salty fish!  When we finally thought we'd have a decent meal on our vacation....nope. Huge let down. I apologized to my bf for such a crappy birthday dinner. We probably would've been better off eating at Wendy's. After spending over $1,500 on meals only half way through our vacation I'm starting to think fast food would be better!!!! Server was nice but nothing to be wowed about. I still tipped her $18 anyway. Not her fault our food was crap and we didn't tell her. Figured it was towards closing time and should've known we were not gonna get anything good. Blah!"}
{"text":"A nice classy dining experience with very fresh fish.  Dark comfortable atmosphere with fishing and ocean-related trappings.  I tried the seared tuna and thought it was quite good.  The crab cakes here are excellent, probably my second favorite crabcakes after Gulfstream in California.  My girlfriend got the special tilapia once with mushroom risotto and she raved about the risotto.  It is a special the waiter said they had maybe once a month."}
{"text":"You can rely on Mitchell's to have fresh delicious seafood anytime of year. I've been there many times & have always enjoyed it."}
{"text":"I like this place. It may be 4-stars, but I've only dined here two or three times.   Here's my take:  - The Food. I've had seafood (no surprise) and it's very well prepared and plated. Fish seems fresh and not over cooked, not dry, very tasty.   - My wife tried a seafood pasta that she liked very well. The calamari appetizer is great, too - lightly fried with just a little crispy batter.   - They've updated their menu and there's good variety here. Entries, soups, entree salads, and even some non-seafood pastas and sandwiches.   - SERVICE:  I'm seated quickly and the wait staff are good.   - SETTING:  It's a little bit worn; a little in need of a makeover, but it's not egregious.  It just feels a little 1998 in there.   My most recent visit (May, '18) was better than my previous, so I'll be back, and may add a star if it's really good again."}
{"text":"Had  lunch here today with my Mom and have to say I was underwhelmed  for sure. When your charging prices upwards of $15 for lunch, the quality should be there. Well, not the case. Ordered clam chowder and bisque to start..good considering the $8 or so price for bowls of soup! the reason I  came was for oysters on the recommendation  of a trusted friend.. $14 for six tiny, tasteless oysters ( supposedly  Chesapeake  Bay)..;We had a couple more appetizers,  but nothing worth writing  about.. All in all, not great.Wonderful service though! another weird observation  were the 3-4 \"managers \" just wandering  around not really  doing anything. ..Strange.. Won't  be racing back here anytime  soon."}
{"text":"My husband and I just had a great meal at Mitchell's! Our waitress Ashley was literally one of the best servers I have ever had. She was top notch and gave us some nice recommendations and made sure out beverages were also filled! I had the lobster stuffed cod which was excellent! My husband had the trio of salmon and shrimp and crabcake. His fish and shrimp were a bit dry and the crabcake was a bit sallty but it was sfill very good!"}
{"text":"We went to Mitchell's last weekend to celebrate my BFF's birthday.  She has been to Mitchells several times and speaks highly about it.  I have been there before but is has been several years and really didn't recall much.  But like my friend I love seafood so there was no objections there.  The menu isn't too big, which is good, and they allow you to choose sides vs giving you what they deem you should have with your meal.  Our waitress was very nice. We arrived a little after my friend, but waited about 15 minutes for her other friend and date to show.  Once settled in we all placed our orders.  I decided on a yellowfin tuna, prepared medium rare, and for the sides I requested a double order of asparagus.  We didn't wait too long for our 6 meals to arrive.  However, 3 out of 6 of those contained mistakes.  My BFF asked for coleslaw.  Not there.  Easy fix they brought it out.  My husband wanted fries, he got potatoes.  Ok so now he gets both for same price, so I guess another easy fix.  And then there was me.  They just straight up brought me someone else's food.  The waitress quickly grabbed it up after I said to the guy this isn't what I ordered.  There was rice on the plate, and I don't know what fish since it only sat in front of me for a few seconds before being snatched away.  I only waited a few minutes and she brought me my correct meal.  The yellowfin looked amazing.  Nice thick portion, and once I cut into it, it was beautifully cooked and seasoned well.  However, my \"double\" order of asparagus was FIVE spears.  Before the waitress left after bringing the correct order I said something to her about it.  That to which she said, \"That is a double\".  Hmmm.  So a single order is 2 and  1/2 pieces of asparagus right?  That's bunk.  My fellow diners felt sorry for me and offered up some of their veggies, very sweet of them.  Weird thing was, my friend's other friends date ordered asparagus as one of his sides and got 4 pieces.  So was it just me or maybe they need some help executing in the kitchen and in service.  Not to mention the meal was $32.00, and I just bought a bundle of asparagus for 1.88 at the Giant Eagle!    So other than the mix-ups and the asparagus situation of 2016, I really enjoyed my meal and time at Mitchells.  The fish was as noted very tasty, but the price is reflective of a special occasion dinner option."}
{"text":"4 stars and a half! I ordered fried Calamari, lobster soup and a grilled salmon with mushrooms and bok choy in the side. Everything was very delicious. I recommend the lobster soup for those who like strong flavor (wine), there are some small pieces of lobsters inside, it's better eat with the bread they serve as courtesy. The server was very kind and attentive, I really like the service. The window view was wonderful and the price is fair for the quality of the food."}
{"text":"Chain. Never got the bread. And what restaurant does not have drawn butter with the tails. Food was good. Service was good. Probably won't go back though."}
{"text":"Went to Mitchell's with another couple for Valentine's Day. We were all disappointed.  First the place was not busy (yes on Valentines Day!) then they had a limited menu.  My friend has a shell food allergy and is catholic.  He could choose only one thing - the salmon which was acceptable. I too was limited with my allergies.  My husband asked to have the special for one and they \"couldn't accomodate.\" The 2 salads they offered were a caesar and a boring house salad, which was all ice berg lettuce.  (On other nights, they have really good salads) Why not offer those for Valentine's Day? The food tasted OK. Mashed potatoes were awesome. My husband asked for no asparagus but roasted veggies.  He received the asparagus and a side of steamed veggies. Desserts were fine except due to my allergies I could only get the boring creme brle.  I am so sick of Creme Brle at restaurants as my only choice that I usually do not have dessert.  Service was slow and inconsistent. we were not the only table with issues.  The table beside us a child ordered pasta with alfreaedo sauce.  He received his pasta plain! YUCH!  This restaurant previously was one we would go to when at the Waterfront but after the last 2 trips, I see why they are not busy.  I am rethinking booking this restaurant for Christmas Eve."}
{"text":"I was there yesterday and ate in one of the booths at the bar. I have been there many times but last night was very disappointing the server was bad. I have been a sever for 34 years and still do so for me to complain since I'm in the business must mean something. Granted I understand your busy but so unfriendly and unattrntive . We never got bread and when asked he threw it in table and kept walking never once stopped for one second even check on us or even introduce himself. When I would go to ask a question or for something he was gone before I even got to finish. It was very upsetting to go out with my 82 year old mother and be treated so poorly.  Last time I'll ever sit in bad booths if that's the way the service is there."}
{"text":"This is the first time that I've been to Mitchell's in a couple of years.  I used to dine here, frequently, but the last few times, the food wasn't the same.  This visit wasn't much different.  Not what I expect from a Cameron Mitchell restaurant.  My husband and I made reservations thru Open Table, arrived at the allotted time and were immediately seated in a booth.  The seating in the booths had definitely seen better days, as we both settled into huge indentations in each side of the booth benches.  We reviewed the menu and decided on a couple glasses of wine, which were decently priced.  I ordered the Thai salad and Shanghai salmon, shrimp and scallop entree.  My husband ordered a cup of gumbo and fish & chips.  Our appetizers arrived a short time later.  My salad was pretty good, sweet, spicy and lots of crunchy veggies.  My husband wasn't thrilled with the gumbo (which he used to love).  He said that there wasn't much to it, not enough meat nor any other gumbo ingredient.  There was a little bit of a wait for the entrees, but we did have fresh bread and butter to snack on, while we waited.  When the food arrived, it was just ok.  The salmon, shrimp and scallops were all overcooked.  The salmon was borderline mushy, instead of tender and flaky.  The scallops were a bit tough and shrimp were tiny and tough.  There was a huge portion of rice in a soy/teriyaki type sauce and an ample portion of green beans.  The flavor profile was on-point, but the proteins were disappointing.  My husband mentioned that that the fish and chips were ok.  Tiny portion of tarter sauce to accompany his entree, so he had to request more.  I ordered Key Lime pie for dessert, which was pretty tasty.  All in all, I wouldn't rush back to Mitchell's.  Our bill totaled $92, which would have been better spent elsewhere."}
{"text":"Never again...1st time there...pocket full of money...love to eat at the bar...she...the blond could not have been more disinterested. We ordered a dozen oysters...no forks  ...no napkins...just the B.....and could you spare the calamari? In any event did I say never again... Wow...what an upscale place...Red Lobster puts you to shame...thanks for nothing."}
{"text":"Ahi tuna and you're done. We also crushed about a dozen oysters...rather nice for the rust belt. Try the shanghai and blackened preparations."}
{"text":"Very very good chain family restaurant. I had their yellowfin tuna steak shanghai style and it was great. Service was excellent and the party of 5 I was with swore they could eat there every week as the menu was extremely diverse. It's hard for me to give a chain 5/5 but this is pretty close."}
{"text":"This place in good. I've bee here a few times and I've enjoyed each visit. The Location is easy to get to, the decor is nice and clean. The food is excellent and the service is very good. I would say it's slightly expensive in most people's opinion though. I would absolutely recommend this place and plan to come back myself sometime."}
{"text":"I was so excited for the night we dined here but was fairly disappointed. Crab cakes were not worth it, I'd rather have gone down to Ruby Tuesday's for theirs! Nothing was extraordinarily impressive and for the prices I just felt remorseful and not satisfied with the experience."}
{"text":"I have been wanting to try Mitchell's for a while now and finally got the chance. Twin lobster tails for $22? No brainer! Worth every penny-- even for the original price ($28.99) Our server was super nice and attentive. We started with the calamari, which was good but a tad greasier than I prefer.   The atmosphere is nice and they have a cute patio for outdoor seating. I like the location of Mitchell's and that I can also squeeze in a trip to Trader Joes or Wholefoods before/ after dining. The only thing negative I can say about it is that it's a tad more on the chain restaurant side than I prefer."}
{"text":"Wonderful service and since it was our anniversary, we were treated to desserts.  Great night and good food."}
{"text":"I have eaten some very good dinners here.  Although it's a chain, I would say it's several notches above the other chain restaurants.  The chef here seems to add some creativity to the menu, so I will be definitely back again soon."}
{"text":"Eh. Nothing to write home about. Average food and average service. They get very busy so I understand the wait, but the service could be more attentive."}
{"text":"very disappointing.  i have been a patron of this restaurant/location since it opened.....usually dining there about once a month.  my last few visits were fine, not great, but fine.  today was not.  the restaurant was about half full, i was with one other person.      food---  my friend had a ceasar salad:  the staff didn't know where the anchovies were, therefore none.  it was served at room temperature.  chef's special was penne in a light alfredo sauce with crab and shrimp.  it also was served at room temperature.  i had the scallops with stir fried vegetables.  the scallops, too, were at room temperature and only seared on one side, some not at all.  the manager offered to redo the meals, which we accepted.  she shrugged her shoulders and said she didn't know what else she could do.  the scallops were better the 2nd time, penne was watery, crab was all but invisible.  the garnish had cheese on it the first time, not the 2nd.  penne was mediocre at best.      service--- probably the worst service i've ever had there.  our server seemed overwhelmed, apologized continually to us and every other table she had nearby.  maybe that was part of the reason our meals were not hot the first time.  never did get a refill on iced tea.      ambiance--- the place is starting to look tired.  the tables are showing their age.... the surface hasn't been kept up, the finish has long since worn off in the most used parts.  sorry to see this place go down hill.  have many memories of better times.  may not ever go back.  looking for a new place in the area."}
{"text":"Second time visited, have to say this time was an improvement . My wife ordered the lobster dinner special for 29.99, great price and well prepared. Service was rather slow and unspectacular. On the servers recommendation I ordered the market burger 12.99 for an 8oz from a box frozen patty.  I've had better burgers at McDonald's, Wendy's, and Rallys for a lot less. Fries we're over cooked and not very substantial. Beer was even stale."}
{"text":"Horrible service at the bar.. our server couldn't have cared less that we were there.. had to ask for napkins.. soooooo bad!!!!! Actually had so much better service at red lobster the night before and spent less money! Never again!"}
{"text":"Ate here last night...fantastic food & service!! From apps to dinner to dessert everything was top notch! The only place comparable was an old seaside joint I used to frequent down near Delaware...that says something!! The crab/spinach dip was different than mine but still very good...I had the Mitchell's market side trio and cleaned the plate...she had some Asian inspired girlie thing and it too was very good!! We shared some dessert thing with banana bread pudding, a brownie creation & an ice cream thing...fabulous!! It's good we shopped 1st otherwise I would've been miserable waddling around after this great food!!"}
{"text":"I appreciate your apology, but haven't heard anything from your district manager. This was a business trip and we were really looking forward to an enjoyable meal."}
{"text":"This is one of the few restaurants I frequent in the Waterfront. Why would you come to Mitchell's if not for the fish/seafood? You probably wouldn't. But you can swim in the Great Lakes beer on tap here and have some nice oysters while enjoying river view. Not many places in Pittsburgh offer these types of views while dining (and that's a Pittsburgh mystery to me). The restaurant is never to crowded and you won't get packed in like sardines in a tin can. So you can enjoy a fairly romantic dinner with your loved one(s).   The food is very good but you may have to shell out a few clams of your own ($$$). If you have deep ocean like pockets put your hook into the  sea bass which is always moist and scrumptious at around $29.99. They will cook your food one of several ways. I like my fish broiled, their signature is too salty for my liking. Bread is mmmgood and hot (free). Staff is very  accommodating ie you can request to sample a soup and the servers are pleased to do so. I recommend you try their soups like the seafood gumbo. A bowl of this creamy delight goes a long way...bonus they toss in those little hexagonal oyster crackers as  reminds me of my youth on Long Island's south shore (but that's another story). Salads a bit skimpy and somewhat pricey (approx. $7.95 for basic house salad). Bottom line is Mitchell's at the Waterfront is well worth taking the splash for if you really like a nice seafood dinner."}
{"text":"The seafood is generally very good. King crab legs were cold and the service was horrible on two of the last three visits. Very disappointing that we told them twice that it was a special occasion and that completely ignored it ; no acknowledgement."}
{"text":"I have passed by this place a zillion times and never given it a second look.  I thought it might be a Red Lobster knock off.  Then I asked a friend if they had ever heard of it and they had, and liked it.  I was pleasantly surprised by how nice the ambiance was inside.  Very cozy.  Much more upscale than I had thought it would be.  The service was terrific.  Lots of things to choose from on the menu.  A bit pricier than I had imagined.  Most entrees were anywhere from $17 to $30.  But this is Pittsburgh and this is seafood.  That said, they started us off with really delicious sour dough bread.  Butter was soft which I like.  Our entrees came pretty quickly.  I had a seafood assortment of blackened talapia, grilled sea scallops and salmon cooked on a plank.  The scallops were just done, I like them cooked a little more.  Everything else was pretty good. My beloved had the crab cakes and really enjoyed them.  We'll probably be back, but will order something different.   We liked it."}
{"text":"For the money it was disappointing.  Tables had no table cloths, no center pieces, loud music.   Again for the money the portions of food were very chinchy. But the food was very good.  Would not return."}
{"text":"I gave two stars only because we didn't actually eat any of the food. This is simply a customer service review. I'd like to give them the benefit of the doubt, the food is probably excellent. Sadly, the hostess was so incredibly rude and uninviting, the mood was ruined before we even met the server.   Upon our arrival (party of 2), I asked to see a menu. 20 minutes later we had still not been acknowledged. 4 other groups came came and we're seated as we stood there, looking toward the hostesses expectantly. After quite some time the hostess stared at me, I suppose waiting for me to greet myself. No 'Hello' no 'may I help you?' Finally a curt 'have you been helped?' to which we responded 'no'. The hostess brusquely grabbed two menus, didn't ask whether we were expecting more people, didn't ask whether we wanted a booth or a table (every other patron was offered their preference) and stated FOLLOW ME. She literally threw our menus down on a booth passing by, didn't stop to await us take our seats, didn't introduce or even mention our server or anything. Simply threw our menus down on the table and left, not a word spoken. We didn't remain there long enough to meet our server, which is unfortunate because I was really hoping to have a nice meal there. I will not return."}
{"text":"I had lunch here on Black Friday and I had an amazing piece of Chilean sea bass cooked in their Asian style with rice and wilted spinach and Asian sauce.  The sea bass was like butter and it just melted in your mouth.  My lunch party shared desserts and their creme brulee was just heavenly.  The server was attentive and I had a good time."}
{"text":"I'm giving 2 stars because the restaurant was clean, the service was fast, and the waiter was polite. However that was where the stars stop. I guess quite a few things have changed since my last visit.... apparently the king crab legs no longer come split (unless you ask). I didn't know. I didn't ask and they also didn't give me anything to open them with. The waiter finally took my king crab back to the kitchen to split them but by the time I got them, my party was just about done. Whereas Mitchell's was a go to in the past, it's becoming a do not go to."}
{"text":"Excellent fresh seafood. Good vegetables. Good service. Best place to eat on Waterfront."}
{"text":"Excellence service and great food. Definitely will come back to try other seafood. Cook to perfection and great portion too"}
{"text":"Good. One of my favorite restaurants in Pittsburgh. Went yesterday with family and enjoyed oysters(very fresh). I always like appetizers more than their entrees"}
{"text":"Mitchells is a great place to get fresh seafood vs some of those national chain places. I have been there 6 times and never had a bad meal. It is a little more expensive but worth it. Chillean sea bass was $35 which is in line with other places that have it. Talapia is about $27. The atmosphere reminds me of some of the seafood places at the ocean."}
{"text":"I have to say that the quality of food and cleanliness has fallen dramatically over the years.   Once I entered Mitchell's I was seated promptly and immediately noticed the set of silverware left for me had dried food on both the fork and knife. Not some small spot but about a dime size of dried food. The silverware was quickly replaced once I brought it to their attention.   After placing my order for the trio entree I went to wash my hands in the restroom. The restroom was dirty and both soap dispensers were empty. After returning to my seat I started looking around more because of the dirty things I came across. Not surprised the restaurant needs to have a major deep clean and better standards trained to their staff. The walls that surround the main eating area are caked in splattered food along with the wooden tables you eat on.   The food served was not good and the shrimp tasted spoiled.   Not sure what happened to this restaurant as I typically visit a half dozen times a year when I travel to Cleveland and have been doing so for five years. Sorry to say I won't be back."}
{"text":"Went here for dinner tonight. New Orleans oysters are too die for.  Fish was fresh as always.  Shanghai Style sea bass is crazy good.  My only complaint is that they do not offer enough ways to cook the fresh fish entrees.  My broiled yellow perch was good but prepared a different way would make it great.  I like my fish cooked English-style. I wish this was a option.  Some bread crumbs on top broiled in butter. But i guess it was a healthier option. Maybe I just have to ask."}
{"text":"Lets start with two things.  One, Mitchell's is consistently good seafood no matter what city I eat at. Mitchell's in Pittsburgh, Cleveland Ohio, Carmel Ind. These restaurants are sharply appointed with beautiful and comfortable tables and booths. There is a reception area with a host/es and comfortable upholstered benches for waiting. Inside they all have a very ample and well appointed bar area. There a many seats at a U shaped bar, with some high-tops and 2 and 4 person booths. When alone I will usually eat in the bar area. The service is very good in this section, but it usually good all through the restaurant. As I recall they all have a private separated room for large parties.  Two, really, let's start with a Martini, say Grey Goose up with blue cheese stuffed olives. Okay, now I'm ready to eat. I always enjoy a version of their very fresh and very good Ahi Tuna appetizer. This time served with Sushi rice, ponzu and apricot ale sauce including pickled ginger and nicely hot and tasteful wasabi. This is outstanding Tuna, seared very rare. My other favorite appetizer here is the clam chowder. This chowder is so very thick, rich and clammy. Soooo good.   A loaf of warm sourdough bread is served with fresh butter. Enjoy as you see fit. I will say that I try to take it easy on the bread, but my gosh, it is really good sourdough.   For my entree I have probably two strong favorites. First and perhaps at the top is the Chilean Sea Bass, served Shang Hai Style, which is steamed with ginger and scallions, served with sticky rice, spinach and rice wine soy sauce. This dish so outstanding. First if you love the buttery soft texture of the sea bass, and you'll love it with this preparation.  My other outstanding favorite is the Cedar Plank Salmon, preparation is balsamic glazed and oven roasted, with delicious, mouth watering grilled zucchini and peppers,sun-dried tomato pesto and goat cheese. This combinations works so well. I find this to be just an outstanding meal.  Mitchell's has several deserts, but by the time I get there I usually pass. But I have tried and recommend the \"Shark Fin\" Pie, which is butter fudge ice cream, honey roasted peanuts, fudge,peanut butter, with  Oreo cookie crust. I also enjoy what they call their Triple-Chocolate Mousse Cake. But my favorite is the Key Lime Pie which comes with a Macadamia nut crust. I love the lime, and the the stronger the lime flavor the better.  I would suggest that anyone who enjoys seafood will enjoy a meal here."}
{"text":"The food was really good, but the prices were pretty high and the portions were on the small side. The desserts were the high point of the meal for me. I got the \"shark fin\" pie and it was really good. The waitress thought I wouldn't be able to finish it... but I showed her. Take that, waitress."}
{"text":"4 stars for the happy hour; however, I can't speak for the restaurant dining experience.   Happy hour consisted of: $3-4 dollar draft beers.  Most of the appetizers were half off.  We tried the artichoke dip which was served with tortilla chips (super rich and creamy), shrimp cocktail (perfectly steamed shrimp served over ice with cocktail sauce), Asian shrimp (these were deep fried and had an sweet glaze and served with rice and small cucumber salad), crab cake (perfectly pan fried with tasty tartar sauce).  No complaints from me.    Just glancing at the menu, the entrees seemed a little pricey.  I think most of the fish entrees were between $25-30.  The quality of the seafood in the appetizers was excellent,  so I imagine the entrees would be similar.    The service was polite and the appetizers and drinks came out pretty quick and our server was kind enough to split the checks."}
{"text":"The dishes were just okay. The portions were quite small, the seafood was generally overcooked, and everything was pretty bland tasting. Service was okay for us, though the table next to us seemed to be neglected and were complaining a lot. Atmosphere was okay. Being able to purchase fish fillets is a neat idea. honestly I probably could have cooked up a better meal if i had just bought the raw fish and cooked it at home.  Overall, the experience was probably just short of 3 stars, but for the price they charged, I would expect at least a solid 4 stars, so due to being grossly overpriced for the portions, food quality, and service, I have to round down to a 2.  Would not recommend. For okay fish, Blake's Seafood and McCormick and Schmick's are better. For some truly wonderful seafood, check out Pier W. It's a bit of a drive, but it will be one heck of a dinner experience for about the same price."}
{"text":"i have been to this restaurant a few times and each time gets more like an experience at red lobster, just three time the price. first, 3 times out of 4 you will have to ask for silverware. annoying, but if you just accept it you can move on. second, order fish. just fish. your steak will never be cooked properly, you will wait ages for the refired one, and they wont ever offer to take it off your bill - even if its wrong the second time.  this has happened to the person i was with twice. monday was the icing on the cupcake. my poor dad ordered lobster tail which came out browned on the edges with 2 pieces of asparagus. then they asked if he wanted drawn butter as if they shouldnt have just brought it. after waiting for that to come i could see him chewing and chewing. it was like rubber. he didnt want to make a big deal about it but we did advise the server. poor guy was very nice but couldnt overcome the bad food. he sent the manager over who just said they were making another. we said thanks but no thanks and we finished the meal. 5 mins later here comes the manager with another lobster packed to go. nice gesture, but the next day we found that it was equally ill prepared. its conveniently located but only marginally cheaper than capitol grille where they know how to prepare ALL the items on their menu."}
{"text":"This is my first post probably ever. Today is my parents' 43rd wedding anniversary and they are supposed to eat at Mitchells'. I wanted to do something special and buy them dinner so I called to give them my credit card information. Not only did they refuse to take my credit card over the phone, but they also refused to send me a credit card authorization form to sign to allow me to purchase the dinner. This is a chain operated by Landry's not some mom and pop restaurant without the capability to handle such a simple and reasonable request.   CLASSLESS."}
{"text":"Went on a Saturday, 2 hour wait. food is good, I got some seafood gumbo to go and I won't do that again. Seemed like it didn't have any seafood in it."}
{"text":"My boyfriend and I went here for a nice dinner last night...I wanted to take him somewhere nice but not somewhere overly expensive. We both tried to crispy shrimp appetizer....delicious! Good portion too. For dinner we each got a steak, me the filet, him a ribeye. They were both cooked to perfection and reasonably priced for a good piece of meat! We got the lobster Mac n cheese as a side but I was too full and Brought it to my mom instead. She said it was delicious! I ordered banana bread pudding for dessert because I can't resist banana and it was a cute little single serving dessert that was yummy. I wish I had gotten our waitresses name because she wa great as well. Very nice and prompt and checked back often. Would love to go back soon!"}
{"text":"I really had a taste for the Shanghai Trio......everything was meh, the sauce wasn't reduced so the rice was floating, the shrimp & scallops totally flavorless (yes, steamed or poached seafood can still have some flavor).....Such a disappointment  ***Note:  Ask Landry's Select Club members how they wish to pay, never assume.....This will prevent any issues later"}
{"text":"Mitchell's Fish Market in Homestead is my favorite fish restaurant in the area. At one time I knew the head chef, but he has since moved on.  I really like the food here, which keeps us coming back again and again.  I think that management needs improved in some areas, but that doesn't keep me from enjoying the food.   On several occasions we have had new servers that really needed to have the senior server follow them until they are comfortable with service. The new servers get distracted or confused and it is not a good dining experience when you have to explain or worry about what the server has forgotten or will not deliver. Okay that's the negative, on to the good stuff.  We return because we love seafood, and the quality here is good. We belong to the resultant group and rewards program. I also receive points by making the reservation on Open Table. The gift cards and points from the restaurant group help absorb some of the cost.  Mitchell's is a wonderful restaurant for special occasions as well as date night with a movie.We have come as a family or as a couple.   Despite what some have commented on, the price is comparable to other seafood restaurants of this quality. Walking through the door of a restaurant like this, you should expect the higher price for the quality of what you receive.   I like dining here and Highly Recommend.  I love the Salmon !"}
{"text":"The food was overpriced and miserable. We paid $14 for five pieces of overcooked shrimp in the cocktail, and $11 for a musty tasting mussel Provencal with quite a few dead and utterly inedible mussels.  The fisherman's platter entree was at least edible, though the fries were generic (Think Ore Ida's).  The King Crab legs were cold, old, and skimpy for a $33 entree.  They were also bizarrely cut down the middle, perhaps as part of a nefarious ploy to fill the plate with more mediocrity.  All in all the seafood was consistently disappointing and only a few shades away from being actually poisonous.  The only saving grace is the excellent service and gorgeous patio which at least meant we could enjoy our loathsome meal in a pleasant atmosphere.  Maybe there's a reason millennials are letting places like this die.    Side note: the hush puppies and smashed potatoes were actually quite nice which only makes the rest of the meal all the more pathetic in contrast."}
{"text":"I came here with my family for a meal. The food was very good overall, as was the service. And while the prices might be in line with the market prices, they seemed very high to me. I ordered the trip with a small piece of salmon, 6 shrimp, and a crab cake. It came with a vegetable side. The salmon was great and well prepared. The crab cake was ok. The shrimp, however, were a little rubbery and dry. For 30 dollars, I probably wouldn't get that again. I would, however, try something else here. My family members got steak and all of them were cooked perfectly. They were all very satisfied with their desserts as well, which were shareable!"}
{"text":"I went here with a friend for dinner.  The restaurant and bar is nicely decorated and we were pleased to see the wide selection of fish and lobster on display.  The menu had a wide variety of dishes.  We were really looking forward to a great dinner.   The service was friendly but our server couldn't really explain the dishes or tell us much about the different selections of fish.  I selected the Hoisin Glazed Yellowfin Tuna and my friend selected the Chilean Sea Bass.  Both of our dishes were just so-so.  The quality of the fish was decent but the overall dish was bland and lacked flavor.  The sticky rice was just plain old white rice.  It was a real let down.    What really turned us off was seeing a waitress showing a little kid one of the lobsters.  The waitress put a napkin on the floor, then plucked out a lobster and set it on the napkin so that the kid could see it crawly around.  Then she picks it back up and puts it back into the tank!  I would think health regulations would prohibit this kind of thing, but I guess not.  Finally, If you are still thinking about visiting this restaurant, try to go during the off-peak hours as this place gets uncomfortably crowded and loud."}
{"text":"The patio view is beautiful, and the food is good, too! We ordered the Grill Rainbow trout, Shang Hai Rainbow trout, Crispy Ginger cod & rainbow trout. Everyone is happy about the dish. They have music every Thursday, it is a little bit loud, but the band is really good. Will come again!"}
{"text":"Finally, I restaurant in Pittsburgh that I can give 4 stars!! Mitchell's is located on the Waterfront and is one of the nicer restaurants in that area. The interior is a classic, clean, modern seafood restaurant-- dark wood, glass, etc... The menu has really great seafood selections and is printed daily.  But here's what's great about this place: after 4pm you can get \"small plates\" at the bar for $3 each, and these ain't no Costco fish sticks! Two of these small plates would make a sufficient meal (along with the sourdough French bread they bring out). Finally, while the drinks aren't cheap, they're creative, tasty and fresh. All in all, I had a great experience, and I think this place would be perfect for a date or a happy hour with the girls from the typing pool."}
{"text":"Mitchell's...what have you done?!  I have been to this location several times and always loved it (just never got around to writing a review).  The patio area is great when the weather is nice and I've historically loved the fish preparations.   This last trip, though, was a pretty steep slide downhill.    First, I went to the bar and ordered a glass of the house pinot grigio...a generous poor from a bottle that was definitely a couple days past its prime.   You should know better.     Then onto the table.  I'm pretty sure the hostess double sat the server who was supposed to take care of me, because she expressed her frustration right in the middle of the patio area.  I waiting a few minutes and then someone else ended up taking care of me.   The service was fine, but I was a little put off by the start.  What really got me though was the menu.  Mitchell's used to have a great menu and I've always been thrilled with my selections.  I don't know what changed, but it was something.  I ordered the crispy ginger salmon with stir fried vegetables.   The portion was ample, but the fish was sort of mushy and the crispy ginger topping wasn't crispy at all.  The veges were half overcooked and half undercooked.    If I didn't include this last visit, I'd have given it 4.5 stars.  This last visit brought it down.   Here's hoping that whatever changed, changes back."}
{"text":"Whoever gave this place 4 or five stars must be out of their minds. Had dinner here in July and it was so so. I was looking for a fish place in town again, and figured, after reading positive reviews that it had improved. Yikes. Bad decision.   The staff seemed put out that anyone was here at all, and were seemingly puzzled by the menu. I watched two bartenders trying to figure out how to make a strawberry daiquiri for 5 minutes, which was admittedly entertaining.   I ordered the chowder and the crab cakes. The chowder was basically flour stew with potatoes. I'm guessing that there may have been a clam or two in there somewhere, but you couldn't taste it if there was through the flour.   The crab cakes were definitely frozen, and not made from blue crab. If you're going to offer Chesapeake crab cakes, they had damn well better be the real deal. Zero flavor and dry as hell. Stringy, Asian crab that was definitely pre-made. Terrible.   I don't like to rip a spot, but this was a seriously weak restaurant. Don't know why I expected western PA to offer up the goods, but if Chicago can do it well, why not Pittsburgh. Best analogy- the Olive Garden of seafood"}
{"text":"Fancy place. Not impressed with the food. Started with a cup of lobster bisque. That was room temperature.  Then ordered Sea Bass for main course. That was a big disappointment. I sent it back to the kitchen twice because fish was cold. The manager did not bother to come to our table to speak to me. Waitress ended up taking the dinner off my bill. That's the least they can do since I left there hungry. Two thumbs down. I do not recommend this restaurant to anyone."}
{"text":"This is probably one of the most overrated seafood restaurants I've ever been to in my entire life, food completely subpar. The bathrooms were disgusting. They didn't even know the difference between Chesapeake Bay and Prince Edward Island.  Would've been better to have just gone to Red Lobster."}
{"text":"DRINKS: Water for me, Yuengling for my fiance APPETIZERS: Cup of Maine Lobster Bisque for me -- soo good! My fiance had the New Orleans Seafood Gumbo which I had a taste of it and it was good, but I liked my soup better...very rich and creamy but full of flavor with a fair amount of lobster bits mixed in. The bread they served with the apps was fresh baked (I believe sourdough) and it was quite tasty along with the whipped butter. Our entrees came with house salads - had great elements, but I felt I couldn't enjoy mine because the dressing given was a poppyseed vinagrette and I can't handle too much acidity in my food these days. My fiance however cleaned his salad plate (not a sentence I utter often). ENTREES: I had one of the specials, Grilled Shrimp and Scallops with roasted summer vegetables and tomato vinagrette (which I asked for on the side). The seafood part was great - the vegetables were so-so. My fiance had the special of Cod stuffed with Lobster (and some other seafood) with asparagus and a lemony sauce - I had a taste of his and it was really yummy, I'll def order that next time! We both finished our plates, which wasn't too challenging b/c the portions were moderate (I got 3  srhimp and 3 scallops for example) but still filling. DESSERT: Didn't order any SERVICE: Friendly, though a little sparse. After we finished our meals we felt like we were waiting around for awhile before we could ask for our check. But our server was overall friendly and we didn't feel neglected or anything. DEALS/DISCOUNTS: None OVERALL: We liked the variety and freshness of seafood. Def a place we'd consider going to again, which is the main mark of a very good experience!"}
{"text":"Ironically, we enjoyed the appetizer and the dessert,but the entrees were nothing to write home about.   The steamed mussels, an appetizer, was fresh and the sauce complemented their delicate flavor nicely. For entree, we got the Blacken Chilean Steelbass and the House Special Cedar Smoked Salmon.  Biting into the blackened steelbass was, well, fun, but the taste isnt' anything revolutionary and it was a bit dry.  The Salmon had potential for innovative dish, but it was overly sweet and vinegary, which gave it a generic cast.For dessert, we got the mini creme brulee, a highlight of the meal. It had a particularly rich creamy body with a thin layer of caramel. The whip cream that came with it was outstanding and not merely decorative.   For a seafood place, the price was very reasonable."}
{"text":"Just had an awesome Sunday at work. Feeling accomplished I decide to take my wife out to dinner and I got tuna and she has ordered the scallops. She love the island Jerm last time we were here and I had planked salmon decided to try the tuna from hawaii. Hopefully it should all be good."}
{"text":"I'm so glad Mitchell's participated in restaurant week. I'd never been to either location and we didn't know the location closer to us existed until Bryan noticed them on restaurant week.  The food was AMAZING. Bryan warned me to save room for the shark fin pie, thankfully. I don't eat dessert at restaurants often, but the shark fin pie is worth it!  I tried the gumbo and tuna bowl, which were both good. I loved my jambalaya and the asparagus took a while to get used to (a bit softer than I prefer), but it was good. The shark fin pie was beyond amazing, but I'd recommend getting the SMALLER portion unless you have a table of 4 or more. Splitting the big one with two people was too much. Delicious, but too much - even when I saved half my jambalaya for lunch.  The service was wonderful. Our waitress, Lisa, was so fast & stealthy that I didn't always realize she'd filled my water until I'd look down and see that it was full. The manager was also very friendly.  We'll definitely be repeat customers and look forward to many more delicious meals at Mitchell's. I wanted to try almost everything on the menu, so I'm sure I'll eat there many times before repeating a dish (other than getting the mini shark fin pie to share)."}
{"text":"Went there over the weekend got oysters and grilled shrimp starter and fisherman platter. Everything was excellent. Lightly battered cod very goof. Service was very good and food came quickly. Will be back"}
{"text":"Very good, very pricey. I'm not really well versed in the world of fish or seafood, but I like to eat. So I am never really sure what to order at places like these. We just picked two items randomly off the menu (I had the atlantic salmon with an asian/ginger sauce, veggies & rice). The rice is really good and served in a pyramid shape. The fish was tasty too. I wasn't a big fan of the bread-cumb style coating but it was OK. At the end, when I was too full to finish, I found myself eating the rice and sauce and leaving the fish behind on the place. But that might be more a testament to my love of rice than the quality of the fish.  Next time I think I'll try their 3-course meal for 19.95 (salad, entree, dessert)."}
{"text":"Had the Clam Chowder, the Sea Bass and a 3 dessert platter. Everything was fresh tasting and delicious. I love sweets but the desserts were my least favorite part of the meal. The rest of the food was so good I would have rather had more of it and passed of the dessert. That's not to say the dessert wasn't good, it was. The other food was just better.  Food = Great Waiter = Great Prices = Not bad"}
{"text":"Used to go to happy hour here every week. Good drink specials and shrimp tacos. The Shanghai Sampler was my favorite until I'm sure me and two others got poisoning after my birthday dinner. After that I never went back. Me not returning is probably just a mind thing. Seafood is nothing to play with. Never want to get that sick again."}
{"text":"Great dinner. love the fresh fish choices they offer. I am a fan. You have to stop in. lunch or dinner."}
{"text":"My husband and I were on a quest to find King Crab Legs in our area and we hit the lottery with Mitchell's! We both agree they are the freshest best tasting King Crab we've ever had. The shell breaks so easy. The lobster is off the hook as well. It's truly the only restaurant where I make that mmmm noise pretty much with every bite. Kind of embarrassing but I seriously can't help it. So frickin good! On top of that both meals are under $30!"}
{"text":"Such a sad night out. Been eagerly awaiting my return to Mitchell's where I've always had great food but tonight was, well, sad.    I previously would have put them at a 4 or 5 and tonight the pineapple martini and the spinach salad saved the meal and raised them from a 1 to a 2 stars.  I had the wild salmon on a cedar plank w grilled veggies. First time the salmon was cold and uncooked in the middle so it went back.  I normally enjoy salmon medium but raw is not medium.  Also the seasoning was off and not very complimentary.  I often have at the salmon here but this time was a huge mistake disappointment.  This would not cause me a return visit and with the great options of restaurants in Cleveland I may not return.  The highlight was the delish pineapple martini (who knew!) and a super fresh spinach with goat cheese, green apple salad tossed in a maple vinaigrette.  Yum.  I think the kitchen was not doing well on this night. The couple at the next table had to send their meal back to the kitchen 3-times.  Yep, 3-times.  So for a $45 meal this was a painful night."}
{"text":"Bartender said what do you want?  I asked what kind of raw oysters have you.  Instead of answering, he grabs a printed menu and drops it on the bar.  I read aloud to him,  \"ask your server for today's raw bar selection\".  He answers: \"an east coast oyster and one west coast\".   With that attitude, all I could do was leave.  Too bad.  The Mitchell's in Covington KY had great service, and good food."}
{"text":"Save your money the absolute worst's seafood for the price that they charge is unbelievable had the worst experience ever   Way over priced for the quality of seafood. Red lobster quality at twice the price. Weird taste. Lobster tail was tiny not even sure it was legal to catch such a small thing. Save your money."}
{"text":"I easily got a table without a wait on a weekend at dinnertime. The waitress and her tag-along trainee were both nice. The waitress did talk a bit too much, so she could scale back on the smalltalk. The appetizers and fish entrees (I ordered the cobia) tasted good. I was not blown away by the taste of any dish, especially for the price, but the food was solidly good."}
{"text":"I have eaten at Mitchell's in the past and it has always been a good experience, now fast forward a year. Last Sunday evening 5 p.m. Mostly empty tables, if they had been busy I might have understood the poor service but no explanation about the food. We ordered two appetizer - Crab cake and some shrimp mixture served with thin tortilla chips, the crab cake was decent, the shrimp dish was awful, tiny shrimp with a very watery mixture of soggy cucumbers, maybe canned corn and I'm not sure what else but it was not good at all. The bread was good, wedge salad and house salad were also good. The Lobster bisque was awful it looked like someone pour a can of Campbell's soup into the bowl it had an artificial taste and couldn't find any pieces of lobster and on top of that it wasn't even warm. The waitress removed it and took it off Our bill. The fish platter which our friend got was tasty she said but the bottom of her plate was so greasy, our mother Guest got a crusted fish I believe itnwas the trout he said it was just ok, mashed Redskins were not even lukewarm, he did not eat them. Planked salmon was good, steamed veggies were decent, while eating our salads the server came over asked if we were done of Course we weren't she came to our table twice during the entire meal. 3 of us ordered coffee and none of us were give spoons not was our coffee ever refilled during or after dinner.  More Tables began filling up but it wasn't busy. Just our opinion that Mitchell's has gone down a lot since our last visit and with so many competitors we will go elsewhere when in the mood for fish. The outdoor area was beautiful with the flowers and fountains, but that's not enough to keep customers coming back."}
{"text":"We went here for a family holiday dinner. Our waitress obviously didn't have much time to fill our drinks or ask us how our food was. She was kissing butt at a table where the patrons were obviously quite wealthy. I'm speaking standing at the table talking at least halal fest through their meal. She may as well had sit down with them to have dinner. It happened twice. As I waved her over, she rolled her eyes and made her way over. Normally tip up to 30 percent during the holidays, it was closer to 15. And I only did because she is young. She apparently needs to retrained to act/service everyone no matter how they are dressed."}
{"text":"Great Experience!  Was looking for seafood dinner - haven't been to Mitchell's for years - and only visited the Waterfront location in the past.  We really weren't impressed with that location enough to go ever back again.    We went early for happy hour and were impressed with the drink and appetizers offered!  I love the moscato sangria!  yummm!  Also Calamari was fantastic and my husband loved the fresh oysters (not on a special, but delicious!)    We stayed for dinner, ate at a hightop in the bar area - service was EXCELLENT!  (Jae)  We tried New England Chowder & Lobster Bisque - enjoyed them both with the warm bread they offered.  Husband had pan seared scallops (cooked perfect) - I had the Shang Hai Combo - also enjoyed.   Can't say anything negative about this experience and we are pretty tough on restaurants.    Also- being in the business - we noticed something that impressed us too.  A server broke a glass by the bar, shattered everywhere - This happens a lot.  You should remove all the glassware that in close range and re-wash.  Most places won't do  that honestly, especially during a busy happy hour at the bar.  BUT, they did - we watched as someone carefully took all the glasses out and had them washed.  Great job Mitchells.  Clearly they have a GM who knows what's up here.   We love how close this location is to our home and will continue to go here!  They have a new regular customer.  Thanks for a great experience."}
{"text":"Came here for a happy hour, quite honestly everything was averge or below average at best. Let's start off with the good, the patio is quite nice.   Now for the food, the tuna poke was just complete garbage, the portion of tuna was maybe 2 ounces at best, of frozen brick tuna that had a very grainy texture, the person i was with whom was Japanese took one bite and she was like I can not eat this.  The oysters were completely lackluster and tiny. I will take Whole Foods seafood any day over this place any day.  Next the lettuce wraps, flavorless and lacking in every way.  Well that is it for Mitchell's not doing that again."}
{"text":"Can't say I was impressed this the good. I ordered the shrimp scallop and salmon entr for dinner. The first scallop I had was OK and as soon as I got to the second scallop on my plate it was already cold and hard which is so strange because I have never had a hard scallop. The salmon was tasty and I hate salmon so I was impressed with the fact that my tastebuds were satisfied. There was nothing special about the shrimp which was disappointing. I also had the Maine lobster bisque and holy crap it was so unbelievably salty I couldn't hardly eat it and in fact I didn't even get more than three spoonfuls. To finished the meal I tried the shark fin for dessert and it was the best part of the meal and highly recommend. All in all I would probably not go back but don't regret going."}
{"text":"Yeah, I am going all-out and giving this place 5 stars. Here's why: when I moved here in February, I moved from Hawaii. Yes, that Hawaii. With a fabulous hey-I-just-caught-this-ahi-let's-cook-this-up mentality. When I moved in the dead of winter, I wanted fish like in Hawaii. Whatdoyouknow, they had ahi from Hawaii. Let me just set up my tent and live in this restaurant! Fantastic preparations, fabulous sides and seafood flown in from Hawaii. Served up by great bartenders and waiters and I'm sold.   I have been going there at least every 2 weeks since February. Now they have wahoo from Hawaii on the menu. There is a word in Hawaiian for delicious, it's ono. Ono is also the name used for wahoo. Seriously delicious. If you can, go to Mitchell's for any fresh fish, but make sure to try the ono-I mean wahoo. All the fresh fish is amazingly ono!!!"}
{"text":"What an extreme disappointment!   My husband and I don't go out much due to our hectic work schedules so we planned on drinks and apps at Mitchell's tonight for a night out.   The $100 inc tip we spent was completely wasted.   We ordered a lemon drop martini & a Bloody Mary which were good the first round.  Second round had No garnishing!!  Isn't that the point of a Bloody Mary?!  I had the Mitchell's salad ... supposed to have dates & pine nuts.  Had No pine nuts and 1 lone date.  Sad.   Ordered lobster bisque and gumbo soup.   Bisque was good.  Gumbo was pathetically just rice & sauce.   We love mussels and were looking forward to our order.  They looked good and were tasty but had no broth to go with it.   We like to dip the bread in the broth. So we requested more broth.  It came out right away and the waitress dumped it all over the mussels.   It was straight up salt.   Made the mussels completely inedible.   After the disappointing 2nd round of drinks, the disappointing gumbo and disappointing salad, we were just done.    $83 hard earned dollars down the drain.    We will definitely not consider Mitchell's for our next date night."}
{"text":"Great wine list for a chain restaurant in Ohio and the food was okay.  Think of \"Red Lobster\" quality.  I had one King Crab leg and the body portion was still icy inside (actual ice crystals). I mentioned it to the waitress and she said \"I'm sorry\" but I was charged full-price.  A little shocked at that one."}
{"text":"We had reservations for a group of 6, everything went along as it should have, we were seated quickly and had service quickly. Staff was friendly, and somwwhat attentive. We all ordered drinks, the 1st round came quickly the 2nd took quite awhile and that was enough for me to stop buying $10 a glass drinks. With everyone odering dinners we had quite an assortment. We all concluded that though the food was good, they were served luke warm at best. Portions we also very small. Bottom line is that it wasn't bad for an average restaurant but for what you are going to pay it is NOT worth it at all. I was so disappointed. We will never be back. The 3rd star is only for how tasty the smashed potatoes where, and that was the best highlight."}
{"text":"This place has great seafood. The best in the area. I come here for seafood every time. Everything on their menu is good. Their menu changes all the time depending on what was in season. Appetizers are amazing like the raw oysters.  Their clam chowder is the best. Really creamy with lots of clams. Wonderful restaurant. You cannot go wrong with anything on the menu. We love coming to this restaurant. Don't forget a reservation on weekends. You will not get a table and will probably wait an hour or two if you don't have one. We never get to the dessert. Always too full to eat dessert.   Forgot to take pictures."}
{"text":"I've been here several times and usually very good. A bit overpriced, but very good. I'm a big fan of fish and chips, but don't really care for it here, been getting the Shanghai style Sea Bass, Cod or Salmon. I recently switched to Crispy Ginger preparation, so good with the Salmon. My wife got the Seafood Trio, disappointing to say the least. $35.00 for a Lobster tail and a few crab legs that were quite small. I wanted to make her walk home, not only because so pricey and so little food, nothing left for me to finish. Anyway, still our favorite spot, but if you're hungry don't get the Seafood Trio, go to Pickle Bills for that."}
{"text":"I had the swordfish and jerk rice combo.... No flavor in that meal which is very surprising for jerk food. I kept eating thinking it would get better but no such luck.  it was pretty pricey for the quality of food being served."}
{"text":"First time in Pittsburgh on biz and staying in the Waterfront District. Nice selection of better than average chain restaurants on the area. Spotted Mitchell's Seafood and since I never heard of ot before, decided to make it my evening dinner choice - in fact, looked forward all day to a nice shellfish dinner ala Bonefish Grill. They have a nice al fresco patio overlooking the River that I wish I say at.  Place was pretty empty at 8 pm on a Monday night, but that's to be expected. I ordered the Seafood Americana which was supposed to have sauted shrimp and scallops in a light butter sauce. What I got in return was a plate of small shrimp in a brown gravy with NO scallops whatsoever. I immediately returned the dish and the young and nice manager came over to make it right, so I reordered a different steamed shrimp and scallops dish which was much better- 5 larger shrimp and 5 sea scallops over spinach and veggies with a soy sauce on the side - very nice but wish they had drained the ingredients better so they didn't end up on a soupy broth.  Having waited tables in a high end seafood restaurant through graduate school I am tempted to attributing this experience to Monday night, late dinner, inexperienced cooks, and lack of kitchen or server oversight. I hope your experience is better than mine. Too many other good choices nearby to give them a second chance - sorry.  Disappointed."}
{"text":"A very nice meal in a very nice restaurant  PROS: Very good food interesting choices--not your typical red lobster crap Great service Very clean (restrooms, included)  CONS: n/a"}
{"text":"Food was amazing, the server Kimberly was even more amazing! Super knowledgable of the menu as well as a genuinely happy person!  She deserves a raise!"}
{"text":"I had a work dinner while visiting Pittsburgh. We shared some apps- the calamari. Crab cakes and bacon wrapped shrimp and all were fantastic. I had the fresh Salmon entree prepared on a Cesar plank. Yum! Great service to."}
{"text":"Very good food! The fish and lobster were delicious. Presentation on one of our plates was a little sloppy and subsequently distracted from the pairings of flavor of the dish. Service was fast and friendly, attentive but not overbearing."}
{"text":"If you were thinking of going to Bonefish, do yourself a favor and head over to Mitchell's instead.  We always enjoy our meal at Mitchell's - food is great, service is prompt and it doesn't take 20 minutes for your drinks to arrive.  Bonefish is TRASH!  Haven't had a bad experience yet!  Waiters are really cool and the manager always stops by to check on us."}
{"text":"The food here is good, but also pretty pricey. You might get more mileage and value spending the same somewhere else. However, this would be nice for a business lunch. The decor and atmosphere is classy, and there is something for everyone on the menu--albeit it is all very seafood focused, of course.  I've found the wait staff to be professional and personable.  This location has outdoor seating that overlooks the river."}
{"text":"Good middle of the road chain seafood restaurant. We didn't stretch their skills tonight as we both chose the British Fish and Chips. Not up to British standards (of course) but good, decent portion and worth trying. The service was great, and the quiet ambience (early dinner - around 5pm) was just right to enable us to chill after a stressful day of making funeral arrangements :(    Didn't really care for the apple martini at all, but the Chardonnay was decent."}
{"text":"So yes I went there, the meal was good. I would love to say I would go back but I doubt it."}
{"text":"One of the worst dining experiences ever. - I ordered a Bloody Mary ($10) - the picture showed it with lots of yummy garnish - I got NONE - sent it back to be fixed meanwhile the waiter forgot my water so I'm thirsty.... they screwed up our salads (YES ... SALAD!!). I didn't even order one and all my husband wanted was his without the dates & pine nuts - waiter tells us the kitchen messed up - salads come FREEZING COLD and no dressing!  Meanwhile I had to remind him that I ordered lobster bisque - then he came back and said - you wanted the chowder, right !!!   NOOOOO Then steak is undercooked - the had to bring my 4th shrimp out separately because the forgot to make enough!!!  I ask for the manager ... tell him I typically don't complain but every part of the meal was messed up - he apologized and said \"I'm going to take care of your bill\" - they deducted $40 !?!?  We paid and YES I tipped the waiter a little cause I realize nobody's perfect - but unfortunately we will NEVER go back"}
{"text":"The service was horrible from the start to the finish line. The food was bland and basic. I thought this would be a mature and advanced Red Lobster, but we should have went to Red Lobster and save half our money w/ better experience."}
{"text":"Our experience at Mitchells Fish Market was definitely a positive one. Our food was good, drinks were good, and our service was INCREDIBLE. I have to give a big shout out to our server that night, Rayleigh. She was amazing. That was our first time at Mitchells, and we went there based on a recommendation from a coworker of mine, and Rayleigh really made our experience super enjoyable. She was extremely friendly and polite.. and patient, and knowledgeable, and personable, and attentive.. seriously, she was wonderful.  She never seemed flustered or too busy, and she never promised to return with something and then let it slip her mind (the worst, am I right?). She was just so pleasant to spend an hour or so with, my husband and I were both impressed with her. Thanks Rayleigh for being an A+ server- your kind are few and far between now a days ;)."}
{"text":"I used to be a huge Mitchell's fan, but my last few experiences have caused me to make it a B-list choice.  There are just better options, it seems.  My last 3-4 experiences were just average.  Good to very good food, and ok to slightly frustrating service.  Their blackened preparation is really good.  Good amount of spice with just a little sweetness and crust from the cane syrup.  Tough to go wrong with this... especially good with a grouper.  The rest of the menu is a little boring for the prices.  Good quality seafood, but prepared in not too many exciting ways.  I may give it a try again soon and see if it's back to being a 4-star experience, which it always seemed to be over the years."}
{"text":"My husband and I went to Mitchell's last summer for our wedding anniversary. We both took a half day at work and we arrived in the early afternoon (after lunch but before the dinner crowd). I can't say enough about this place...we have gone here on a few occasions and I've always been please with everything.   Pros: Nice friendly waitress, who took some time to take our picture (since it was our anniversary), food was excellent and not extremely overpriced, restaurant and bathrooms were clean!  Cons: None on this visit or any previous visits"}
{"text":"wow .... what happened to this place???? yuk! clean next to the booths near the window ... disgusting!"}
{"text":"This was a favorite with my coworkers over the past few years but the quality was off the last time.  The appetizer had stale chips and the rice was under cooked on 3 of our dishes.  Not sure it will remain on our short list after this last trip."}
{"text":"I know the bartender/server was overwhelmed, but 30 minutes to receive a caesar salad and cup of soup was a long time (but very, very good!).  We were just looking for a \"quick bite\" that ended up being an hour and 15 minute visit.  It was my first time at this location - not sure if time spent waiting is a normal issue.  Great lobster bisque!"}
{"text":"I've had good meals here in the past but not this evening. Ordered the Chilean sea bass which is approximately $37. It was a surprisingly small piece for that price and not very thick. The portions of the sides were extremely skimpy as well. Despite a long row of empty tables except one, the rather cold hostess put us at a table right by the kitchen's in and out doors and the large open window facing into the kitchen. Staff constantly came and went within a foot of us and the kitchen staff talked and screamed out food order pick ups needed. It was a poor meal, high cost and bad atmosphere. Refuse a seating in that area, and avoid the higher priced entrees as they might not be worth the price. Better yet, go to Longhorn nearby for a great steak that's fairly priced and consistent quality, ample portions of sides. Leave full not hungry!"}
{"text":"Mitchell's is located on the river side of the Waterfront and out of the crazy \"let's fight to find a parking spot\" area.  They do take reservations, but doubtful you need one on a weekday during lunch.  It wasn't busy when I was there on a Tuesday at noon.  Mitchell's has a cool layout - large full bar in the middle, private large rooms for large parties, smaller areas for business lunches, full dining room seating with tables and booths, and an excellent outdoor patio where you can watch people ride by on the bike trail.    This is a seafood restaurant with lots of good options for fresh in season fish.  You can choose from a number of different fish to have prepared for salads, sandwiches, or just as they are.  I had the chopped salad and added scallops to it.  Delicious!    The price range is reasonable and you can plan on spending around $15 with your lunch and a soda/iced tea.  For that price, you really can't complain.  I drop almost that much at Panera on a half sandwich and cup of soup with an iced tea.    I'm sure it's much busier for dinner but I find Mitchell's to be an excellent place for a business lunch or just meeting friends.  I've been here for brunch as well and had an excellent Bloody Mary and eggs benedict with crab."}
{"text":"I am in Pittsburgh for business.  I ordered the tilapia blackened style.  The fish was very good but was cooked in a lot of butter.  I don't mind butter because I am on a low carb diet.  However, if you are watching your fat intake you should be careful.  The fish was cooked well though and was quite tasty.  The issue that I had was the side of asparagus.  It was totally uncooked.  I like my asparagus to be firm but it was plain crunchy.  I should have sent it back but I was eating by myself and did not feel like making the meal take longer.  The service was good.  I ate at the bar and everyone was very friendly.    The bottom line is the restaurant is pricy and the food should reflect that.  In this case, they came up short."}
{"text":"Once they got bought by the big boys it has gone WAAY DOWNHILL! Everything sucks here . Especially the service. You can tell the employees get paid horribly because no one is happy or no one cares"}
{"text":"Good quality food here. The clam chowder was excellent and so was the tuna appetizer and the Americana seafood plate loaded with shrimp and scallops in a creamy spinach sauce with small potatoes. I'd go here again if possible."}
{"text":"We went here for Valentines Day after some traffic downtown made us miss our reservation somewhere else. We both loved it. The calamari is outstanding and if you get there before 7, they run happy hour which is half off apps and $3 beers.   I had filet and crab cake and it was delicious. The steak was cooked perfectly and the crabcake was a good size. Atmosphere was good and busy but that is likely because of it being Valentines day. Despite the busyness, the wait staff was very attentive.  My wife's steak came out rare despite asking for medium but they took it back and recooked it to a perfect medium level. We will def be back."}
{"text":"My boyfriend INSISTED that we went to Mitchell's for our anniversary dinner and I couldn't argue it. I'm so glad we did.  We ordered SO much food. We started with some salads, he got the house salad, but he wasn't real fond of the dressing - it was like a ginger-y vinaigrette. Honestly I couldn't eat too much of it. I got the Ceasar salad which was delicious! Then we moved to an appetizer - mussels! First off, the size of this app is huge! Not too big that you can't eat afterwards, but definitely share with 1 or two people! The mussels were incredible and tasted so fresh! I also sipped from a strawberry mule, which had fresh strawberries in it - YUM!  Now, the entrees - I got the Shanghai Shrimp + Salmon + Sea Scallops and wow, I cannot emphasize enough how fresh the seafood tastes. It's such a difference! This dish was amazing! Has a little spice to it, but it's a large portion and you get the fantastic trio! I probably could've done without so much spinach piled under the salmon, but definitely not a deal breaker (eat your spinach kids!). My boyfriend got the swordfish of course! He finished his whole dish so that's all I have to say about that.  Previous to coming to Mitchell's, I was told to save room for dessert, or at least order it. GUYS, the sizes of these desserts! Dining in, we split a mini shark fin pie because we previously saw one go by which was full sized and I'm pretty sure it could feed a civilization! I had to take a piece of carrot cake home, which weighed about 50lbs! (Not really but it's the size of a mini cake!) Although these desserts sound terrifying, I highly recommend getting something to take!  I cannot wait for another excuse to go to Mitchell's. I do recommend reserving a table online or call ahead of time because it does get crowded. We reserved ahead of time, arrived, and were seating instantly. The service was great and it was just a really nice dinner."}
{"text":"I went here for happy hour and expected a great time. The service I had was very good, but the food was subpar. The prices for happy hour are reasonable, but when the food comes out I expected more food than what it was, it was a teaser. The crab dip wasn't really deep and u get very little with more chips. I won't be back. Don't expect alot of food during happy hour."}
{"text":"I have never thought that a place could fall so far.  Let me start off by stating that I used to love dining at Mitchell's. Now I doubt I will ever walk in again.  I took my wife to dinner here since she has been craving scallops. I am always up for fresh seafood. I always expect to pay a premium but the quality usually offsets the price.  Well not anymore.  The $27 for six small scallops (quarter sized) which were halved and skewered for some reason (too small to flip and the attempt to look like a larger portion epic fall l). Taste was good size ridiculously small for the price.  My entree was the fish shrimp and chips.  Normally I get everything broiled. This time I went with the fried. Well. The fish. 4 small strips of cod. Was oily/greasy. The grease dominated everything. I couldn't even bare to eat more than 1 shrimp.  They were soaked in grease and were mushy.   Service was below average.  When the Waitress asked how the food was I told her it was of by no means good. The amount of grease and the lack of flavor. Her reply sorry and ran away.  Never. Had a manager stop by just dropped the check and ran. My advice go somewhere else.  Once a favorite now avoid at all costs.  Poor service, poor quality, just plain disgusting."}
{"text":"Great food The staff is super nice... Nice to meet up for a quick dinner/meetings with coworkers .. Great for happy hour Nice mature laid-back crowd... And date night is a must here...  So check this place out my yelpers"}
{"text":"Excellent Chilean Sea Bass!! Placed on rice mixture that was toasted and exquisite! Side of fantastic vegetable medley. Tasted my buddy's dish and whatever it was it tasted divine. Atmosphere makes you feel like you're in a tackle shop, which is probably appropriate. :)"}
{"text":"My husband and I had a late dinner of appetizers with my parents here on a Friday night, and it was perfect.  We walked in after 10:00 pm, and were seated immediately by a friendly server who did not just ignore us because she wasn't the hostess.  Very appreciated!  We all had wine and beer, and shared plates of calamari, ceviche, and crab cakes.  All were very fresh, and the dipping sauce for the calamari was awesome - something different from traditional marinara that had an Asian spin.  The crab cakes were full of fresh crab, and the ceviche was light and refreshing, served with plenty of chips.  Overall we were very pleased with the food and service, and even though my husband and I only dined here once, my parents visited three times during their stay in the area.  My mother recommended the lobster roll - said it was even better than ones she has had in Maine!  Cheers!"}
{"text":"Mitchell's was surprisingly good.  Everything I tasted was good or better, and there were plenty of options.  Everything I drank was good or better, and there are options for everyone.  The atmosphere was great (especially sitting outside on one of the rare nice days), which definitely enhanced the experience (though don't count on that part being reliable in Pittsburgh...).  My dings against the place are mostly minor (e.g., tiny hiccups in service), but for one: it's a bit pricey for the category in which I'd place it, though it's still a great option in that category."}
{"text":"First some advice to the owners. Close at 8:30 pm. You just don't have the level of professionalism in your staff to bother staying open later. My mistake? I'd made a late reservation for 9 pm and as soon as I walked in there were obvious problems. There was no hostess and it took some minutes for a flustered bar tender to locate anyone who could assist. It went down hill from there. A bisque which tasted more tomato soup than lobster was accompanied by a luke warm over seasoned clam chowder. The wine was palatable but while waiting for the entree it was clear that any leadership within the establishment had long departed the scene. It resembled more high school playground than high end fish restaurant. Servers lounging around, some on their phones others seemingly dozing while their colleagues flirted with the kitchen staff. Perhaps it explains what was to come. My sea bass was pan fried well enough, a fairly simple task, but the hollandaise sauce arrived cold with what appeared to be a lump of butter in it. A request to the server for it to be delivered warmer received a response from the kitchen that it wasn't possible and would scramble. She reported that happened when the chef had placed it in the oven to warm!! You have to laugh. This really is 101 cooking and I would expect better for a $50 head.   The server was all too keen to explain the issues in the kitchen... apologies... we lost our head chef and they have no direction... they have recipes to follow but... etc.etc. Not good enough I'm afraid. How anyone makes it past pot washer in such an establishment without being able to do the basics is beyond me. Incidentally my girlfriend's crab stuffed halibut was tasty but cool baring all the hall marks, as with the hollandaise, of previously cooked and reheated food. We declined desert and the offer of our server to return in a few weeks when a new head chef arrives. I'm afraid the damage is done for a good few years with me. I shan't be going back."}
{"text":"This place gets quite busy for dinner, reservations are recommended to avoid the wait.  I ordered the Chilean Sea Bass cooked with their signature method which is Asian style on a bed of rice. It was Delicious! However the sauce was soaking in the rice and would make it too saucy towards the end so I had to move the rice away from the sauce at the beginning of my meal. The wild caught salmon was surprisingly not dry or fishy like most wild salmon are. It was moist and most enjoyable. I also had the clam chowder that was filled with clams! As most people may have experienced, clam chowder usually lacks the clams, this one was the exception. Not salty or greasy the clam chowder was one of the best I've had. Maybe the best I've had! This is not the quite type restaurant if you're looking for that but it has a classy atmosphere with the dim lighting etc. There is also a bar and outside seating where you can enjoy the fine weather and fountain The bathroom lighting was really dark and there were tampons, body spray, etc. for the ladies to use. Overall the food was excellent the bathrooms were clean and the service was wonderful. It is averages $20 a plate."}
{"text":"Service continues to be a problem. Lunch service is spotty.  Today it was slow and the time before it was good.  Dinner service is uniformly awful.  The food is good and the prices reasonable. Doesn't management realize that service is an integral part of a meal?"}
{"text":"I lived in Columbus when Cameron Mitchell still owned the Fish Market and it was fantastic. I'm a seafood-lover and I trusted that even after the sale of the chain they could still maintain the quality of food.   I was foolish to think so. I've had two terrible meals there in the past month. I wants to give them more than one chance, but that was yet another mistake on my part. The food reminds me of an Applebee's or some godawful chain that simply nukes pre-made meals. I don't know if that's what they're doing, but that's how it tastes. My meals were bland, poorly cooked and sparse in terms of the actual fish/seafood on the plate. My husband's entree was just as dismal.  Cameron, you are greatly missed. Hopefully, the Woodmere location will close down soon, so a real restaurant can take its place."}
{"text":"Let me first start out with I hate having to send food back, but I felt like since I was dealing with a $37 piece of raw fish, it was warranted.  Ordered the Sea Bass, tried to cut into it and was very tough. After taking a bite, I had to spit it out because it was cold and raw. Sent it back and the same piece of fish was brought back out (at this point it was dissected into a bunch of smaller pieces) by the manager with no apology. Asked why a new, fresh fillet wasn't cooked and got the vibe that since she was comping it, I should be happy enough and eat what was brought out.   It's a shame the quality of service at this Mitchell's is lacking, since I've always had a great experience at the Louisville location. Our server was fun and personable which is why I'm giving 2 stars and not 1."}
{"text":"Mitchell's Fish Market is a very nice place to eat...for a chain restaurant.  And actually, if it wasn't a chain, it wouldn't be too bad either.  The atmosphere was surprisingly pleasant - the room was warm and intimate, perfect for a date.  It wasn't too noisy or too crowded, and we were seated right away on a Friday around 7:30 pm.  Our server was friendly, and happy to give recommendations.  I started with a house salad, which I told the server I would split with my boyfriend.  She brought it to us on two separate plates, which I thought was a nice touch, and more than what I expected.  Poppy seed dressing was okay, it's pretty thick and creamy as I remember, but tasty.  I ordered from the special menu, since they had a bit of a lobster promotion going on.  My entree was a combo: lobster tail, and \"lobster pot pie.\"  Now, lobster is a beautiful thing, but I have to say....it wasn't beautiful here.  It wasn't awful, but it didn't taste as fresh as I like (I'm guessing that's because the meat was frozen originally).  It's just a shame.  Dipping the lobster in butter was a pleasant experience, but it's supposed to be an ecstatic one.  The lobster pot pie was totes not what I imagined.  I pictured a flaky, golden crust, a delicious creamy lobstery gravy, and big hunks of lobster and vegetables.  Instead....I got what sort of resembled a small bread bowl made of a biscuit.  There was a lot of sauce, which was surprisingly orange in color and very rich, with some lobster chunks and vegetables that appeared to come from a bag of frozen veg (I'd recognize those tiny square-shaped carrot chunks anywhere)!  Whaaaaaaaat?  It wasn't bad or anything, but not what I imagined.  I was a little bummed out.    So everything we ate was just fine, and nice when you're craving seafood....but I think in future I'd rather just head to the Strip, get a lobster, and cook the sucker up myself.  I didn't try their fresh preparations, so I can't say how those were.  I'd say in the Waterfront though, it's probably one of your better options.  Healthier and fresher than most of the other choices.  And the atmosphere is great, including the service."}
{"text":"The lobster rolls were delicious, the blackened fish tacos were light and flaky, not too spicy and had a nice salsa.  The white sangria was very refreshing and not too alcoholic.  The outdoor view of the river was really enjoyable and the service was quick."}
{"text":"3/16/18 Not At all worth the price. Calamari fair at best downhill from there. Lobster Mac & cheese not creamy or tasty. Lobster and shrimp stuffed cod bland. Smashed potatoes and Caesar salad good.  Service slow."}
{"text":"Delightful! After biking on the river trail that led us to the Waterfront, we zoomed past what looked like a wonderful patio situation at Mitchell's, right on the river. We parked our bikes and were seated promptly at the patio. The waitress even filled our water bottles for us! The interior of the restaurant is very nice, sea-themed, and clean. The decor is really tasteful and classy. The outside was perfect. It was Sunday afternoon and the weather was gorgeous. Looking out to a serene part of the river is fabulous as well. Our waiter was professional, knowledgeable and friendly. We decided just on a few drinks and an app. The two drinks my bf ordered were AMAZING. The first, muddled basil, grapefruit juice and vodka (I forget the name). SO refreshing! the basil was flavorful and tasted awesome with the grapefruit juice. The second he got was a frothy pineapple-vodka with a huge fresh chunk of pineapple inside. Both were winners. I stuck with a fairly priced white wine but got to test his fun drinks :) The app we got was the Hawaiian Seared Ahi Tuna and it was delicious as well. It was a pretty decent size to split, and came with sushi rice, a red onion/cucumber relish, ginger and wasabi. I believe the tuna was also drizzled with ponzu. It was so good - definitely recommend! My bf couldn't help himself so he also ordered a cup of lobster bisque, which I don't eat, but he said it was very good. He also polished off some of the warm bread loaf that accompanied our meal. This place definitely earns the stars and I had no idea it was even a chain. The waiter said they were expanding, so hopefully the quality and service don't go down. I also checked out the rest of the menu and they use quality ingredients and the prices really aren't bad (it was the lunch menu - I'm sure the dinner menu is pricier.) I felt like I was on vacation and I'll definitely be back!"}
{"text":"Two of us got the lobster.  It must have been fresh, because as long as we had to wait, they had time to fly up to Maine and pluck it out of the ocean.  Then we had to wait for them to go out to the dairy farm to get drawn butter.  During this protracted wait, I think they just left the steak on the grill.  Med rare came out well, I mean zero pick.  What do you do?  Everyone had their food and they offer to cook you another one and you sit there with everyone else eating?  And all the meals came with smashed potatoes (OK) and asparagus.  Three spears of asparagus, give me a break.  And I guess there weren't free refills on water.  Or at least none was offered."}
{"text":"Mtchells is one of the best fish places around.  I really like their Shanghi preparation of my fish. It's just delicious.  The establishment is always clean, the staff courteous and the fish, of course, fresh.    Oddly enough one of my favorite things about going here besides the fish is the bread they give you.  It's always so warm and tasty.  The deserts are also very tasty.  I have gotten two that I really liked  They also have a three course fixed price option last I went that was a great value. I think it was $20/person for lunch."}
{"text":"Excellent meal! We had a family dinner for 13 on Easter Sunday and the staff and food couldn't have been better.  We had Cara as our waitress and she was just naturally pleasant, professional, and really skilled with people, from our 86 yr old dad to our 4 yr old.  The seats were comfortable and there was plenty of room for us to eat.   Let me start by saying they have the best clam chowder I've EVER tasted.   Our dishes ranged from perfectly cooked NY strips to bourbon salmon to the trio and everyone raved about their dinners.   We also got appetizers; everyone loved the civiche and the spicy crispy shrimp!  And desserts, the shark fin pie was delicious.    The only slight negative was the bread. It's sourdough and people in this area might not be used to how sour it is. That being said, it was fresh, hot, and crusty. I didn't care for it, but that's a personal taste issue. There's plenty of food without the bread.   I'd come back here in a heartbeat for another family dinner. Everything was fantastic and perfectly executed. :)"}
{"text":"This place has plenty of parking - can be a bit tricky to find if you are from out of town, but once inside - there will be plenty of seats and great food selections. Remember - it' a fish place - so don't order steak - not that it wouldn't be good, but the fish was AWESOME!  The selection and price were both good, the service was a bit on the lam side, but overall we received what we ordered and it was darn good at that."}
{"text":"We had made reservations ahead of time to avoid the wait and when we got seated we were disappointed!  They put us in a corner that was definitely meant for a 4-5 top table and we had 7 people in our party so it was a bit crowded and awkward.    When we got our initial server, it seemed like he was more attentive to the party of 2 next to us compared to my party of 7.  I had to call him over to my table just to get a drink order in because he rushed away from my table right after I ordered a couple of appetizers.  Later when we got moved to a more comfortable seating, we got a new server.  She was awesome! The service here was great and attentive.  She was busy so we understand that there may be a little wait for some things, but with good company we didn't pay much attention to it.  The food on the other hand... It was delicious but would of been better if it was served warm rather than cold.  We had to make some changes with the soup because their lobster bisque was very bitter and bland.  Horrible combination if you ask me.  The New England Clam Chowder was amazing! It was chunky so you know you got what you paid for.  The entrees were served simultaneously but was upsetting because 5 out of 7 of our guests were highly disappointed on the taste of everything and 7 out of 7 were disappointed on the temperature of our meals.  Some lacked seasoning so the taste was very bland.  Some had an over abundance of butter so you couldn't taste anything but that.  The mashed potatoes were delicious and rich in flavor and served warm!  The twin lobsters with the sides were cold along with the asparagus.    Overall,  service is great, drinks are great, but food would of been great as well if it was served warm rather than cold."}
{"text":"This was my first time at this location.  I've frequented the Upper St Clair Galleria restaurant.  There's a lot to like about this Columbus OH based chain.  I don't usually eat at chain restaurants nor will I review them because they're typically big food corporate run places that don't care what they feed you they just care about their stockholders.  This place seems different to me.  The food quality and care seems to be very high.    The staff is always well trained.  I like the decor and ambiance.  The menu offers many options.  I don't really like the fish preparation options very much and the portions can be small in some of the dishes but overall I am a fan.  I do really appreciate being able to buy fresh fish here.  I like to buy the trout and prepare it at home.    We were here for a Thanksgiving meet-up event with 69 other people.  The room was a little small and it ended up being too loud too but the staff really pulled it off overall.  It's a tough thing to do.  It wasn't perfect for sure but the food was surprisingly good and came out hot and fresh.  Nicely done."}
{"text":"We enjoyed this place on our first visit. Today we made the mistake showing up on a late Sunday afternoon. Nobody at all in the front. A few uninterested waiters wandering in back. We finally sat at the bar only to have the bartender disappear for 15 minutes. We finally just walked out to go elsewhere. Bottom line: if you're not read for customers then just close the place until dinner service begins."}
{"text":"Believe it or not this place actually has a very good Thanksgiving dinner special. It comes with delicious turkey and all the trimmings including one of their amazing desserts. I've eaten here a number of times before and the meals are always quite reliably good."}
{"text":"Oh Mitchell's how I wanted you to be good, But no dice. We use to come here often and now I remember why we stopped. A lot of money for a lot of nothing. Undercooked food and when brought to the manager attention nothing really done. Sad I wasted money here, should have just went to Panera across the hall. On a side note our waitress was attentive."}
{"text":"So many layers of disappointment here... The food was mediocre at best. I got the pecan crusted trout and it came out cold. Actually, my and my daughter's food arrived first, and we sat there patiently waiting for five minutes until my wife and other daughter's food arrived.   Speaking of poor service, they forgot half my daughter's meal so by the time it was brought to her we were all done eating.   With so many other dining choices nearby, I would suggest skipping this place and going somewhere else."}
{"text":"Valentine's Day 2017 ruined by Mitchell's.  We got a reservation for 5:15 so it was not busy at all.   There was 1 other table in our section in some horribly decorated back room.  Our server Michelle greeted us took our drink orders and my husbands appetizer and salad order,  a wedge salad with no tomatoes and 1000 island dressing on the side.  Michelle brought our drinks, then his shrimp cocktail.  Then asked if we wanted to order.  I had to ask her if there were any specials.  We ordered.  My husband ordered the 8 Oz filet medium rare and added grilled shrimp.  She asked if he like garlic butter he said yes.  I ordered the 1 lb of King crab legs that were on the menu with redskins and asparagus.  My husbands salad came with blue cheese dressing,  we flagged someone down to get the correct salad.  Then the dinners come.  She brings a huge contraption to set the crab legs on???  The crab lake were cut open and cooked on a grill and completely dried out.  Not anywhere near a pound.  Maybe a quarter pound of crab meat and some potato wedges. No asparagus.  My husband steak was rare, barely warm and had some mashed up shrimp with tomatoes and onions on it.  He had also ordered strawberries as his second side.  Never got those even after asking for them 3 times.  He had also asked for another beer halfway through the meal which he never got.  Wait a dissapointment and huge waste of money."}
{"text":"Once a month spot for me ,and it never fails. I recommend sitting in the bar for lunch. Raylee is awesome and is always on point."}
{"text":"Last night was my first visit to Mitchell's and I was really looking forward to some great seafood.  I am sorry to say I did not get it.  I ordered the crab stuffed shrimp and was disappointed.  There were five very small shrimp on the plate.  The shrimp were dry and overcooked.  The crab stuffing was mostly stuffing.  All I tasted was breading.  I didn't see a piece of lump crab anywhere.  The best part of the meal was the bread and butter.  I was with a party of 12 people and I was surprised to see such small portions on the others plates.  For the prices at this place, I had hoped for so much more.  I will not go back."}
{"text":"I have been to Mitchell's before but in 12/29/12 it was kind of horrible. The waitress kind of ignored my table of 2. the food was not seasoned at all and when i complained the waitress was very aloof about this. I hope this was a one time event but I don't know if i will be back."}
{"text":"Will not eat here again.  1) Waitress (Angela) could not be found for 10+ minutes at a time. The entire meal was a running commentary on where she was and why we didn't even get water refills until dinner came. She had to be specifically asked three times for water before we got our one and only refill.  2) Spilled mussel butter on my jacket and although she did apologize no manager ever came over to see if we were okay. When I did complain they offered a $25 gift card which didn't even cover the cost of said jacket, thanks but no thanks.  3) When asked specifically if a dessert was served warm the waitress said \"yes, of course\" but spoiler alert it wasn't. Party involved said it was fine and asked me not to say something.  4) When asked if they had a very specific after dessert drink the waitress replied in the affirmative only to substitute Irish coffee instead. If you are out of something just own up to it, don't try to pull one over on someone.  Long story short - decent if overpriced food, nonexistent management and the worst service I have experienced in a long while. As a server myself I am pretty forgiving but the (non)service ruined a $150 meal and Mitchell's management couldn't care less."}
{"text":"So I've never been here before, I came with a friend and her aunt. The place is decorated really well, a little dim though. Even the bathroom is really really dim. Like I get the atmosphere you're trying to go for but I want to be able to see. I got the seafood stew and it was so good. The scallops were perfectly cooked and the flavor of the broth was fantastic. My shrimp were over cooked though, thus the four star review. They got everything right but that one thing kinda tainted it. I had the banana bread pudding for dessert and that was also very good. I've had a lot of bread pudding and this was one of the best. It was light but also dense and the flavor of the banana came through very clearly. Overall I had a very good experience! It would have been very great if it weren't for the over cooked shrimp. I'd definitely go back, but it is pretty pricey."}
{"text":"I have to mention that I eat regularly at this place and always order the same dish because its quality was great. HOWEVER, the quality of the restaurant went downhill since its acquisition in January.  I always order the same tilapia Shanghai style and this time the sauce was watery, the rice was undercook and the veggies were just nasty. So, the food is 1/2 bad...how about the place in general...? I was always impressed by the restrooms...oh...wow...mouth wash, great soap, and nice toiletries. Today, all gone, just a roll of brown paper remains. According to management \"customers\" do not need that. Even the mints and toothpicks are gone...and good luck finding a prompt hostess...as she is always on the phone taking care of take-outs. On the plus side, service is trying very hard to keep the standards.  If you want an overprice place with medium quality food that does not care for its customers....Mitchell Fish Market galleria is the place to go. Save your money and visit BRGR.  sorry guys....you are not special anymore...."}
{"text":"To start, I normally love Cameron Mitchell's restaurants.  That said, the experience on this particular night, for my party of 5 was pretty underwhelming.  This was unfortunate because my group was entertaining a potential new client from out of town.   A combination of Slow service, mediocre food, and lack luster service all played a roll in my rating. . I will say that the wedge salad was pretty good and was the highlight of the meal.   Anyone can have a bad night so I will go back to Mitchell's but I will be on he look out for signs of a repeat performance."}
{"text":"People that think this place is pricey need to realize they are in Greater Cleveland and at a seafood restaurant (with fish not from the Great Lakes), of course it will be 'pricey.'  A co-worker took me here for lunch and man, I'm glad I know about this place. The Ahi Tuna Wrap was amazing. Fairly large piece of tuna with this amazing spicy sauce. My only regret was the wrap not staying together.   If you're used to living in a small town, you might feel sticker shock. If you're from a big city (major metropolitan area like LA, SFO, NYC, or CHI, not Cleveland) the prices aren't bad.   Will definitely come here again."}
{"text":"Typical Mitchells dark decor & slightly snooty service but the food is good, we shared kung pao calamari appetizer & then Sea Scallops shanghai style & the fish trio all pretty good without any wow factor decent but over priced wine list"}
{"text":"This is a really hard review for me to write, simply because I cannot for the life of me find the words to explain the food. Lackluster, no, not really...Mediocre...no....Pedestrian/average/common...huh uh. Just 'eh.' It wasn't awful, terrible or even bad, and it wasn't great, good or even fine. It was just....edible, I guess.   We started with shrimp dumplings from the happy hour menu and the BF got seafood gumbo. I thought the gumbo was decent; he said 'eh', however we both agreed the dumplings were 'eh'.  I got something called the market trio, which came with creole style rice, corn, a crab cake, a hunk of salmon and 5 shrimp. It wasn't terrible, inedible food, it was just....not good. And for $28 I wish I would have just gotten a bowl of the gumbo. The only thing that seemed to have any flavor was the rice. The BF got a crab and lobster stuffed cod, which again, was not bad just not good. It had a lemony-buttery sauce, that didn't taste quite lemony or buttery somehow.  I know this is a stupid thing to gripe about, but I hatehatehate when restaurants charge necessarily high prices for pop. Soda, cola, pop, call it what you want, but it should never be more than $2.50. I usually just drink water with lemon, but I had a headache, so I ordered a coke. $325!! And having a BF who works for a restaurant, I know that pop costs them pennies! I see $2-2.50; some people drink glass after glass of the stuff, but $3.25 is simply ridiculous. Especially when the food kinda sucks. And I read other reviews and the decor is not classy. It's like it's trying to be classy, but real classy restaurants know its' not classy. It was a little like an over-priced, under-flavored Red Lobster without the kickass cheese biscuits. But when your food sucks at Red Lobster, you can always fill up on the delicious biscuits."}
{"text":"My wife and I dined here for the first time despite living nearby for more than thirteen years.  Our meals and dining experience were good, nothing extraordinary, nothing that grabbed us to want to return soon.  We were early for our reservation, but were seated right away.  It saddens me to see the slovenly attire of many of the diners, including a backwards baseball cap worn throughout the meal, at a fine restaurant like this.  We were not asked whether we wanted to dine outside, which would have been nice on this beautiful Easter late afternoon.  My wife ordered a gin martini that she is convinced was made with vodka.  I ordered a bottle of Penn Dark beer, which was predictable and good, full of flavor.  My iceberg wedge lettuce salad, $6.99, was delicious and a nice portion for one person.  It contained grape tomatoes, a tiny amount of tasty bacon chips, and the creamy bleu cheese dressing was ample and good.  My parmesan crusted chicken with angel hair pasta in garlic sauce, $16.99, was a nice portion: three chicken cutlets and a fair amount of pasta, but the dish was on the dry side.  The sauce was tasty, but scarce.  In an effort to keep from drenching the dish in liquid, the restaurant erred on the side of dry.  The description of the dish reminded me of Pollo Alla Italiano which was offered by Poli Restaurant, of blessed memory.  It was not nearly as good as the rendiition by Poli.  My wife's chef feature seafood at $22 was enjoyable and was served with a pyramid of seasoned rice.  The sourdough bread was served quite warm with softened butter:  very good.  The service was unobtrusive and fine.  The waiter tended to our needs.  For $62.31 for two plus tip, and this without one of the restaurant's $9.99 desserts, there are restaurants at which I would rather dine."}
{"text":"Happy Hour here is decent although not all their appetizers are half off.  I opted for the Magic Hat #9 beer and an order of half off cocktail shrimp.  The shrimp come out on a bed of ice, 1/2 lb size, and with 2 dipping sauces (both really tasty) along with horseradish.  The shrimp themselves can come with or without Old Bay Seasoning, I chose with.  The seasoning complimented wonderfully with my beer making me one happy man.    Although I was only there to drop off my wife so she can have a girls night dinner, my short experience will have me back just for some beer and shrimp.  Wife told me her dinner was solid 3 stars maybe 4 but she was already 5 glasses of wine into it so I'll keep myself from judging until I get in for a dining experience."}
{"text":"Love this place - they were very accommodating to me, Peanut and Gramma (she goes often).  Solid wine selection and Gramma says they make a good Margarita.  We all enjoyed all of our food as well.  Great view of the Mon too."}
{"text":"Awesome server, and bartender, Raleigh . I work in the industry and came between lunch and dinner . We had a table in the tavern area . She was great- I'm difficult to wait on. I lived in Manhattan, for years,  and when I'm spending  a few hundred for two people to eat, I have  expectations . Raleigh never acted inconvenienced by my requests.. and I can't have much sugar and am very particular, and she happily tailored my drinks. I literally deconstructed the drink menu.. And she was awesome about it. AMAZING FOOD, even more AMAZING SERVICE!"}
{"text":"The best Ribeye i have had twice now!!! I almost didnt get it the sexond time because i didnt want to be disappointed from my first experience.. It was just as good!! Definately recommend"}
{"text":"The blue point oysters were buttery and smooth.  The halibut was fresh and meaty.  The halibut preparation (chutney, spinach, Parmesan risotto) was amazing.  Nothing too special about the desserts, but I definitely enjoyed my meal."}
{"text":"I have been to this place a few times. Its actually pretty good. Its always clean. The servers are knowledgeable. The food is good. Just a few small things is why I did not give it a five out of five. When I have come here in the past it is and was always for some sort of special occassion. I became accustomed to knowing that they offer valet parking. I got to know where the valet parking spots were. This time there was no valet so I was a little confused. They also had half of their parking lot gone because something is being built there. Not a big deal. One of the other small issues I had at least was the menu. This is a seafood restaurant. So their menu is obviously going to be seafood. They also have steak and chicken dishes. They only had two chicken dishes. Both were kind of heavy dishes with some sort of garlic or butter sauce or a friend chicken breast. Neither was very appealing or healthy. I know its a sea food place but usually they have about four chicken dishes that range from chicken with a light sauce to fried with heavy. I had to basically pick the lesser of two evils. It was still good though. I might recommend having a few more chicken dishes. I seem to remember them having a lighter fare chicken dish. Wonder what happened to it? The other minor issues i noticed. The foods came at different times. Not like they walked back over to the window to grab it. Like half of it was not done cooking yet time.  So some people were eating their meals for like five minutes or more before the rest of the tables food came. I thought it was common practice for a cook to look at the ticket decide what takes the longest, start that first. then add the others in as they need so everything gets done at the same time. Guess not here. finally we had a family member with a birthday. It was not clear at all whether the desserts we were being told about were for one person, or for everyone as a birthday dessert. It was actually just for one person. Management might want to train their servers a little better on that. Otherwise its a great place. I recommend it."}
{"text":"I honestly wished I'd eaten at home last night instead of Mitchell's. We had a reservation for a party of 8 and were seated on time.  Tucked a bit out of the way, but at least we were able to hold a conversation since the room wasn't crowded. It made my wonder why they were stating there was a 30 minute wait to those arriving when half the tables near us remained empty the entire evening.   We waited 10-15 minutes for our server. In fact, another server came by to say she'd be there shortly. Once she arrived she took our drink orders, which took about 20 minutes to arrive. She returned to bring water and take our orders for appetizers, which, sadly, arrived before our drinks did. Service was slow throughout the evening, and although she was courteous and did the job I can only say she was average.   I ordered the bourbon glazed salmon which was overcooked and cool when it arrived. The glaze was hard and crusty on the bottom and I ended up leaving that on the plate. Without the glaze the salmon was bland. My husband had the shrimp and chips, which were also overcooked. The hush puppies were hard and dry, and everything arrived lukewarm or cold. We've had better at local franchise restaurants at half the price with better service.   I looked over the menu online before we went, as I try to make healthy choices when dining out, and noticed that the prices online were not updated. Cocktails listed at $8.25 were $10 and food prices were also higher.   The floors were wet and dirty and the bathroom needed attention. I expect more when I dine at a restaurant considered to be upscale. We will not return."}
{"text":"Went here for lunch with my Aunt this past weekend.  It was my first time at Mitchell's Fish Market although my Aunt is somewhat of a regular.  We started with the Spinach and Artichoke Dip for an appetizer.  Since, that is such a common appetizer I can't really compare it.  I thought it was good.  However, for my main course I thought I'd be adventurous so I ordered the Shanghai Sampler.  Which is is salmon, shrimp, and scallops on a bed of sticky rice, with spinach and a yummy Asian inspired sauce.  It was awesome!  Perfect portion for lunch and very tasty!  It wasn't overly sauced and the seafood was cooked to perfection.  Over all the food was great, as was our waiter.    I will be back."}
{"text":"Tried this place out tonight looking for some good seafood. We are new to the area and really haven't found many seafood places around. This place is overall alright. The atmosphere is pretty good. We ate outside which was nice. Service was good, knowledgeable and friendly. Now to the most important.... The food. It was just ok. Ok to where it was alright for the night but we likely will not be returning. Prices are about average for the food you are ordering. Oh also, drinks were not very good (we ordered mixed drinks), but that part was not a huge deal. Drinks are usually hit or miss anyways at most places."}
{"text":"Good beer selection, friendly yet unobtrusive service. I had the crabcakes which were not the usual restaurant goo. Good seafood is hard to come by in Cleveland. This is a reasonably good choice but you'll pay for it."}
{"text":"An excellent choice for fresh, well prepared seafood located in the Waterfront area in Homestead.   I frequent this area for business travel, and you can't do much better without heading downtown.  The seafood is excellent, with a daily menu crammed full of fresh fish specials, a raw bar, and a list of chef's specialties.  The house salad is sweet and delicious, and the 'shanghai' seafood preparation is delicious, healthy, and unique.  Try it with the scallops or a white-fleshed fish.  There is a nice selection of regional beers on tap, a decent selections of wines, and creative drinks (think elderflower and pear martinis).  The deserts are adequate, though not a highlight.    If you're on the Waterfront, you won't do better than this.  Enjoy!"}
{"text":"We had a bigger party and I think that might have flustered the waitresses just a bit. They forgot about our waters until the food came out, but were super apologetic when they did bring them. The food was ok. I ordered the crab cakes they were a bit heavy on the breading, so I would give them a rating of, \"eh\". My friend ordered a steak, asked for medium rare, and it came out...well done. He was too hungry to complain and just ate it. We might go back again, and this time maybe take a bit more time looking over the menu."}
{"text":"Will I come here again?  Yes absolutely for drinks, they knocked the Ketel One extra dirty blue cheese olive martini outta the park.  The ambiance is very nice.  Of the 4 types of reviews I give (awesome, OK, bad where they get slammed and bad where I hope they improve) here I am giving the heartfelt \"bad where I hope they improve.\"  Our waitress was very friendly and did a good job.  I mentioned the gritty redskins of the mashed potato.  We went with appetizers she recommended.  Not good.    Seared ahi tuna: horrible flavors mixed with the rub, the prep, the tuna wasn't cool inside, the chips were not good, there was no soy sauce but there was wasabi.  NOT good.  With heartfelt advice, compare this against Outback's ahi tuna appetizer and it's no contest.  The chef should do so.  (He's a nice guy like me I hope.)    BBQ shrimp: go try Redstone's (Philly) buffalo shrimp appetizer.  It is chilled, very delicious.  This appetizer was recommended and was garbage.  The barbecue sauce was horrible, overwhelmed and left an unsavory aftertaste in both my and my clients' palate.  Gordon Food Service or Sysco BBQ sauce.  A real \"must-miss\".    Cod entree was OK.  The skillet beans were too firm, too mature, they need petite green beans.  Potato skin had grit in the mashed.  Why 1 star?  The price was close to Capital Grille, but far from the cuisine.  I hope they spruce it up.  The place is nice."}
{"text":"Seafood is quite good, but expensive.  Nice atmosphere on the waterfront.  Blue-collar bartenders have inappropriate friends hanging around the bar dropping F-bombs and smoking out back.  You can put five-star restaurant in Homestead PA but you can't take Homestead out of Homestead..  Drive to downtown Pittsburgh for better experience; only 10 minutes away.  Lots of restaurants there . . . Six Penn is a winner."}
{"text":"Awesome service great food not overpriced very friendly and it's a great place for kids and family."}
{"text":"The food here is always top notch.  If you are coming, use the open table so to make a reservation and definitely ask for Casey.  The service tonight from him was exceptional!"}
{"text":"We came here on a Friday night because we were determined to try something new so we figured why not try Mitchell's Fish Market. I am not much of a seafood/fish eater but luckily my boyfriend loves it. I had the \"knife+fork butter salad with a creamy  avocado dressing, a medium-well ribeye served with asparagus and redskin smashed potatoes. He had lobster mac-n-cheese and the Tuscan grilled vegetables. The ribeye was cooked perfectly and was juicy and delicious. The drinks (Mango-jito, Black Cloud mojito) (sparkling strawberry lemonade) started us off with a good note along with the waiter Edward being extremely friendly and attentive. I would definitely go back there to try food again after the wonderful experience that I had"}
{"text":"After doing some chores at The Waterfront, we were hungry and decided to try Mitchell's for dinner. We were seated at a comfortable red booth. The clam chowder was perfect; definitely get it. The mussels were delicious--not as firm as mussels usually are (but in a good way) and bigger than normal. The spicy crispy shrimp surprised me; I didn't think it would be good, but it was. Boyfriend said his lobster bisque was \"funky\" and I agreed that it tasted weird, but it was still edible.   The calamari, however, was unseasoned. Maybe they forgot to season it that night? I feel like the way it was served to us is not the way they usually serve it. Also, I was disappointed with the small portion of the calamari. For $12, we should be getting way more than we did.   Our server was attentive and noticed that we liked a lot of their appetizers, so she informed us about their happy hour (Monday through Friday 4:30-6:30pm) where their appetizers are at most $7 each! Tempting, especially after our pleasant dinner experience.  Taste | 4 Atmosphere | 4 Presentation | 3.5 Service | 4 OVERALL | 4"}
{"text":"It depends on what you order here as this can be a reasonable meal or a splurge. They have some delicious tilapia/trout/salmon entrees with veggie and starch in that sweet spot of $20; however, if you want you could easily go $35+ a plate. The spinach salad with chevre and roasted pecans was awesome.   Wine was surprisingly reasonable and they were food allergy friendly.  Better than Red Lobster and not nearly as busy as PF Changs or Bravo!--so you might be able to walk in.  Would give a 3.5 if I could."}
{"text":"I am a seafood lover so I really love this place! Yes it's a chain, but that's mostly what you're going to get at the Waterfront. It's nothing like Red Lobster though--way nicer/fancier interior, and staff who are all knowledgeable about the menu and actually care about their customers. Even when my mum and I popped in one late night before they were closing, they still accommodated us! Trout and salmon are both very fresh and tasty, especially with almonds or other nuts crusted on them. Lobster bisque is 5 out of 5 stars, and the desserts are to die for! Never a long wait either, I love this place and I love the interior."}
{"text":"Walked in to a 3/4 full house.  We were old it was a 20 min wait unless we sat at bar.    I opened the open table ap and they were taking reservations for 15 min after our arrival so seating us should not have been an issue.    I would never complain about bar staff because they were over busy making drinks and were having tables pushed to them.   However a manager should have been helping them.   Never got our bread, and our food order took forever to come out and was tepid warm when it arrived.  Wife ordered a drink and it was tasty but had an overkill of ice in it so two sips and it was gone.  Litterally was 2-3oz of liquid in a pint bar glass full of ice   Great bartender though she was nice and had good skills just needs some help on the management end"}
{"text":"I gave my mother options for restaurants for dinner - and she chose the chain.  I was bummed.  However!  I was pleasantly surprised with Mitchells!  I have been to a few seafood chains recently - and Mitchell's has by far been the best.    I got the Ahi Tuna bowl and was so pleasantly surprised!  It was phenomenal - phenomenal enough that I would go back for it!  My mother loved her scallops and we both enjoyed our cups of Lobster Bisque.  Thank you Mitchell's for the pleasant surprise!"}
{"text":"Went for dinner Friday evening with friends and sat at the outdoor patio. It is so nice and relaxing there with the river and bike trail. The sourdough bread they serve is always hot and fresh. The Chilean sea bass just melts in your mouth, it was awesome. The Cod stuffed with shrimp and lobster was also very good. I had the carrot cake for dessert, it is big enough for 3 people. It was so delicious. My friend had the creme  brle, which she said was very good. I was here 3 times this summer and every meal was excellent."}
{"text":"Pretty good food and service overall. I got the crab Spinach dip for an appetizer and wasn't disappointed (needed more chips) and had the fresh artic char blackened with mashed potatoes and mixed veggies. Never had artic char but it was pretty similar to salmon but a little milder. Price is high but it's pretty upscale and a lot of quality goes into the food."}
{"text":"I mean, it's not Bluepoint. So if you are going to pay for good seafood in the Cleveland area, obviously I'd probably point to Bluepoint or Pier W. But you really won't go wrong at Mitchell's. (Only issue is that now most Clevelanders associate Mitchell's with the ice cream spot, and so I really just wanted some campfire s'mores ice cream, but that's beside the point.)   I ordered the tuna rice bowl, which was basically poke without the poke name. A delicious white rice was at the bottom of the bowl, covered with some flavorful sauce. Then, in sections on top of the rice, there was fresh/raw tuna, chopped into small pieces, pickled cucumbers, julienned carrots, jalapeos, plenty of avocado, and seaweed. The combination was really tasty, and every bite felt like choose your own adventure. I've been to plenty of poke places that charge insane amounts for tiny amounts of fish, and this felt like a really substantial portion for a good price.   The dessert deserves its own paragraph. We ordered a \"sharkfin\" pie, which the menu describes as \"butter fudge ice cream, honey roasted peanuts, fudge, peanut butter, oreo cookie crust.\" Oh my god. Why did we share this six ways? I want one just for myself. It's basically all the best sweets paired into one leaning tower of pie slice. It was incredible. Do not miss it. The service was very good and patient with our large party. Can't complain about a thing."}
{"text":"Food was excellent. Went for the Sunday brunch and loved it. I highly recommend the steak and eggs with the zucchini pancakes, really an outstanding dish. Oh, and if you get the carrot cake....one is enough for everyone! It was huge, and it was soooo goood! I don't know how they can make something taste that good and cook it in such large volumes. Really was an excellent experience, my only reason for not giving it a five star review was that there was too much time in between our courses. There was probably a good 40 minutes that passed between our salads and our entrees. That's a little long for me when I'm at a brunch. Usually I don't eat a breakfast if I'm going to something like that, so 40 minutes was too long for me."}
{"text":"This is not what I expected a high end chain would be. I had to return my entree to the kitchen as it was served cold. My partners entree was bland as well. The only part of the meal that was satisfactory was the dessert.   For the money we paid we received disappointment. The manager was not helpful and was dressed poorly."}
{"text":"My husbands first time.  Nice to be able to pick your fish and style of cooking.  I had a trio of Jamaican jerk tilapia,  salmon,  and scallops.  All good but too much sauce on scallops.  Husband had surf n turf special. Snow crab legs tasty but smaller portion than I expected. Glad they had raw oysters,  but no idea where they were from.  For $2.50 each you'd think they'd say.  Waitstaff friendly but inexperienced when it came to wine.  We taught two of them how to open a champagne bottle.  Nice time out,  but two gripes... #1 Used my phones flashlight to see if there was an outlet on the floor.  Felt like an archaeologist finding old remains of dinners gone by.  Crumbs,  napkins wedged between booth and wall,  gum,  dirt.  For the price I would expect a cleaner place. #2 our waiter kept saying Thank you. After every single sentence,  even when it wasn't appropriate.  Silly gripe,  right?  But it was way over the top and felt more like,  Can I have a tip?  Can I have a tip?"}
{"text":"Love this place so much. The food is always so delicious always leave feeling extremely satisfied. The service is incredibly slow though, takes FOREVER to our meals! Even during lunch time when there's almost no one there.. I don't understand I always end up eating here for at LEAST two-four hours. Fish is always fresh, lobster is delicate and tasty, and surprisingly the steak is amazing as well. Clam chowder is rich and creamy-- perfect thickness! Love their salads as well. Definitely recommend this place for a date night :) pricey? Definitely, be prepared to spend at least $20/person!"}
{"text":"Service was slow, but that was because one of our party insisted that the bartender, her favorite server, serve us in our private room for a party of 8.  The food and drinks were good and we woud return."}
{"text":"Service was excellent. The drinks were good and on point. Only complaint my shrimp was overcooked and rubbery to chew."}
{"text":"For a Midwest chain seafood restaurant, Mitchell's has \"good\" seafood. I recently ate here for Happy Hour and wasn't too amazed by anything, but it is consistently good. They have very good happy hour prices on small plates, most $5, and drinks. I did enjoy the blackened fish tacos, and ended up ordering the codwich sliders and another item off the full menu in addition. Like most Midwest chain seafood/steak restaurants their happy hour menu is mostly fried food... Although I do enjoy me some fried food I wish they has some more fresh/healthy small plate options.   Their fish does taste fresh and I do like that they have items out in a chill case for you to view as you are being seated. You can also order raw fish from the counter to take home.  Inside the restaurant is slightly run down and I would rate the service at a B-. I likely will only return here if I want to go somewhere nearby by house for dinner, or for lunch/happy hour.  If you are looking to try I suggest trying their happy hour and splitting and entree with a friend."}
{"text":"My wife and I took my parents out to dinner to calibrate my Moms birthday.  We had the Brie appetizer it was very good.  My Mom had the twin lobster tails, I had the yellow fin tuna, my Dad had the ginger salmon and my Wife had the Scallops.  Everything came out temperature hot and cooked correctly.   It was all very good and fresh tasting.   For desert I has the key lime pie,  my Dad had mango sorbet, my Mom had the shark fin desert.  The deserts was also very good.  I would recommend this Resturant if you like fish as there are several differs way to have your fish cooked."}
{"text":"Better than I expected! I hadn't been to a Mitchell's in a while. I had subconsciously grouped it together with McCormick's and Bonefish as middle of the road seafood chains. I was wrong. We had a 30 person private dinner here last week and the food was much better than I anticipated. I had the wild salmon cooked on a cedar plank --- it was fantastic, fresh, and cooked to a perfect medium temperature. Most of my group had the Chilean sea bass and everyone seemed to enjoy it. Best of all, our two waitresses were on point all night long. They put up with our boisterous group and always seemed to be there when you needed something without being overly intrusive. Great job!"}
{"text":"I went by myself at 6:30 on a Saturday, got a table right away. Ordered the herb crusted cod. The fish was under-cooked and watery (a sign it was frozen until cooking). The plate and everything on it was cold. No one came by my table to ask how my food was, and I was too disgusted to complain when the check came. \"Get out and stay out\" is my motto."}
{"text":"A OK!  Really loved the bacon wrapped shrimp! So amazing with the sauce on the side. This was probably the the best part of the meal.    I also had blacken salmon with a double order of spinach instead of a starch. The spinach was just steamed without any flavoring... Which is better in the long run,  but I wish they had options for sauteed with garlic.   The service was great as well!  We were always taken care of.    Will definitely bring my bf here in the future."}
{"text":"I have tried time and time again, to get myself to like this place and every time it's more disappointing than the last time.   I had a take out order today, and when I called to place the order, I could tell that instantaneously, the bartender taking my order was not going to be a pleasure. Well that was an understatement.   When I arrived to pick up my order, there was class A attitude from the minute I walked in with the bartender. Then I had a total of 5 bags and 2 fountain drinks (which she said she had absolutely nothing to put them in for me), and I asked her if she could help me carry the bags to my car.  Her reply \"no. I have tables I need to take care of.\"   I don't expect over-the-top service at this restaurant, but I do expect a smile, a nice and pleasant attitude, along with a little helpfulness. If you aren't having a good day, don't take it out on customers."}
{"text":"Dinner tonight was great, my husband and I have been there several times.  Used  Mitchell's website to make a reservation, definitely recommended, or there is a wait.   Our waiter, Trevor was very attentive and helpful with dinner recommendations. We ordered Chilean Sea Bass, blackened with smashed redskin potatoes and fresh steamed vegetables, it was wonderful, it came hot and delicious- perfectly seasoned.  Our other dinner was Atlantic Salmon prepared Shanghai style, with sticky rice and spinach, it was delicious, tender, perfectly cooked and the Shanghai style was extremely tasty. All in all a wonderful dining experience."}
{"text":"Mitchell's is consistently good and I find myself coming back for both lunch and dinner. Oddly enough this is where I usually go with my Grandmother and it seems that's more of a norm from surveying the rest of the clientele there. If anything I think that points out that you can count on food being good (especially for my Grandma who can be a pit picky) and the servers are patient (how many times can they explain the preparation of a fish and the options for side starches?)  I'm a fan of the pecan crusted mountain trout and also of their signature wood planked salmon preparation. Salads (the spinach salad with goat cheese and granny smith apples please) or the soups are greater starters and that Shark Fin pie is worth sharing with 2 or maybe 5 people (yes it's that big!)  On our last family meal here my brother's dish was lukewarm and the fish looked overcooked (not great when he's a restaurant manager himself) but they offered to remake it for him and when it was served the second time it looked wonderful. Service with a smile here folks!"}
{"text":"Came here for a family dinner and couldn't have had a better experience. Our waitress was very accommodating and attentive. My in-laws like to share entrees between them, so she had the kitchen split their order on their individual plates. She did the same for shared desserts. I had the shrimp and bay scallop pasta, which I feared would be a huge portion, but surprisingly it was totally Goldie Locks--just right! Several people raved about the crab cakes and holy f**ck the \"sharkfin\" pie was the BEST dessert I've had in years!  Would definitely come back for another group dinner."}
{"text":"We recently hosted a birthday party in the private room at Mitchell's. Billy, Allison, Nick and Adam did a fantastic job planning and serving the event. They were very accommodating to us and we're great about our dairy allergy. Chef Matt even came out and walked us through what was ok to eat!   The food was good - some better than others - and there was a ton of it! Shrimp and oysters were fresh and the seafood tower was awesome. Deviled eggs, crab cakes, sliders, spinach dip and sesame beef were delish. Could have done without the crudits and cheese platters as well as the fried calamari.   Overall I would highly recommend Mitchell's if you're hosting an event in the South Hills.   Great job guys!"}
{"text":"Met for lunch with high school friends We enjoyed Mitchell's Fish Market. Four of us arrived around 1:00 pm on a Tuesday and we were seated immediately. Our server was really nice as she kept checking on when we were ready to order. We were excited and had not checked the menu due to the chatter. A couple of ordered the crab cakes with corn and broccoli. The crab cake was hot and delicious with not much filler. The corn tasted as if it was fire roasted. Yum.  One had the salmon and the other had a lobster. Everyone enjoyed their meals. The checks were out promptly and a manager out front actually spent time to take several pictures of our group. Great job.. We will return."}
{"text":"We met friends here because it was convenient to where we lived. We met in the bar and our service was good. Not as attentive as they could be but not bad. We had cocktails for about an hour before sitting down for dinner.  Our waiter, Robert, was MIA. Glasses went empty, dishes piled up, one of our party after waiting for awhile went to the bar for water. The bartender apologized and brought us all water. We ordered appetizers, fried calamari and shrimp cocktail. The calamari was luke warm and had a soy based dressing. I requested cocktail sauce which took around 10 minutes. The shrimp were tender and had good flavor. We ordered a Caesar salad to split. My wife enjoyed her portion very much. For me, I didn't think the dressing had much flavor nor enough Parmesan cheese. We ordered stuffed flounder, cedar plank salmon, blackened tuna and the market trio. The flounder and salmon arrived at our table and both were enjoyed. Unfortunately the other two dinners had disappeared. After several minutes the rest of the meals arrived and they were only warm. I had ordered my tuna medium rare. It came rare, Luke  warm and grey in color. I sent it back be warmed up and the manager had the kitchen retire my dinner. Unfortunately it came back pretty much looking the same. I tried it but I really didn't like the look or the flavor. The tuna seemed like it had been frozen. The manager was apologetic and took the tuna and salmon off of the bill. Over all very disappointed. I"}
{"text":"To say it in a few phrases: long wait for food to be served waiter did not refresh the water waiter did not ask if everything was OK until we were finished waiter did not give options, until I asked what they offered all in all - I believe it was not worth my time  (the manager was informed of the long wait and did not offer anything but \"sorry\")"}
{"text":"I don't often go here since it is located in an upscale mall. I've eaten lunch here a couple of times and haven't been disappointed. They have a makeshift \"outdoor area\" which is really in the mall. Their fresh fish selection is good and paired with a nice salad is enough for me. Service is friendly and you can see some of the seafood through a glass window. Since it is pricy I prefer to go for lunch where I can pay a reasonable amount for a meal."}
{"text":"This is the place you should go if you like:  Management and wait staff who are rude to people with disabilities.  Managers who take no responsibility for their rude bartenders, poor service, and mediocre food quality.  Bar staff who are vocal about their disdain for large parties.  25 minute waits for drinks; 45 minute waits for salads; and 90 minute waits for mediocre, bland, and cold food.  Poorly staffed events.  Poor customer service.   General incompetence.  Save your hard earned money and go to one of the many decent, moderately priced establishments in the area.  You'll get better service and food, and you'll still have some money in your pocket."}
{"text":"I took my cousin from California here for lunch. We were both eating lite since a) I was dieting and b) my family was having dinner at my mother's house and she was slaving over lasagna all day, so if anyone knows anything about Italian mother's, you better arrive hungry. Back to mitchell's, I had the iceberg wedge with bacon, egg, tomatoes and a delicious home made blue cheese dressing. I also ordered a bowl of seafood gumbo which was the best gumbo I ever tasted. It wasn't overly packed with rice, as a matter of fact, there wasn't much rice at all. It was mostly shredded crab, scallops, and shrimp with a very delicate broth that wasn't too thick and the heat snuck up on you after swallowing. It wasn't a lot of heat, just enough to make it exciting. As for the iceberg wedge salad, every once in awhile I need a piece of iceberg instead of a bowl of spring mix (ie: tender weeds). The star of this salad was the chef made blue cheese dressing. It was not overly thick, very tasty and savory. It complimented the bacon and egg on the wedge. The cousin ordered the carrot cake for dessert and it was easily a pound slice. I tasted a little bite and must say it's the best carrot cake I've ever tasted. The cream cheese frosting was more buttery than \"cheesy\", it was a great surprise when you're expecting the normal cream cheese frosting. There were whole walnuts throughout the cake and many raisins, which I love. Also this recipe seems to rely on more cinnamon than I've tasted in the past. I highly recommend it. It was a wonderful lunch and I'm sure she had carrot cake to take on the plane ride back to Riverside."}
{"text":"My husband and I came to visit Cleveland b/c he had some work training in the Mayfield area. We were craving some great seafood and read the reviews about this place. The service was great, scenery was nice, and food was amazing. My husband had the blackened cod with green beans and cajun rice. I had the pecan-crusted trout with garlic mashed potatoes and I substituted green beans for sauteed spinach. We also shared a bowl of lobster bisque to go along with the warm sourdough bread they brought us =)"}
{"text":"Horrible service can't compensate for a good menu! These guys need to train people before letting them wait on tables.  Wrong glasses for wine, no silverwear, no plates for appetizer... Not to mention the editor was not able to open the bottle of wine and had to ask for help!  I don't think I will go here again. There are a lot of good fish restaurants in the area to choose from, fish Market needs to put their act together."}
{"text":"Have dined in three times, and carried out twice. Dining in was terrific. Great service. Carry out is another story. I would advise against it. Incorrect pick up times, rude workers, incomplete and wrong orders, and aloof service. It's too bad. Contacted corporate, through their website, and no response. It has been a week."}
{"text":"Took my wife on a date here while we were visiting family in the Burgh.  The restaurant is in the Galleria mall. Nice bar area, and fresh seafood. My thoughts:  1) Oysters on the half shell - delicious. 2) King crab legs - overcooked. 3) Warm sourdough bread with whipped butter to start - addictive.  Bottom line - this place was a little pricey but you're probably paying for the quality seafood. Check it out if you're in the area.  Also a nice mall to walk around in before or after dinner."}
{"text":"The meal started out with such promise, but sadly went downhill from there. Our starters were gumbo, clam chowder, and the house salad. All three were enjoyable. Then we had to wait quite a while for our food. The blackened salmon + baby spinach salad was good, but the fried foods  are to be avoided. The crispy cod slider and the crab sandwich were greasy and sad looking. The crab cake was tiny and thin, and spiced beyond belief. I couldn't taste if it was pepper or what but it was so spicy it burnt out my palate. Maybe it was done to cover the fishiness of the crab? And then the fries were awful. Barely warm, not crisp, insanely salty, and... tough. They were hard to describe, but it was also difficult to comprehend messing up fries so badly. They also consider water from the fountain a soda, so be prepared to pay for it, unlike most other places. Honestly depending on what you want to eat, you'd be better off going to Red Lobster."}
{"text":"Another good meal at Mitchell's  Not many options for seafood in south hills"}
{"text":"Had another good dinner / happy hour here with my husband and and brother. Happy hour specials, especially the oysters never disappoint and the prices are great during happy hour!   Everyone ordered different dinners, from stuffed shrimp, to stuffed cod, and salmon- everyone seemed happy. I had the fish sandwich and it was great. Only hitch was when I asked for it wrapped up,they threw it away by accident . They quickly made me a new one. What great customer service!"}
{"text":"It was a lot of food. We had fish and chips and panko fried fish. Very good and our waitress, Katrina, was nice"}
{"text":"I loe love love this place. I usualy stop in at least once a visit...and with so many nice places to eat in the Cleveland area, that is really saying something.   The outdoor seating is nice with a fountain blocking out parking lot noises.  The food is outstanding...I've never ordered something I didnt like.  The prices are in line with any high end resturant but not overpriced for seafood IMO."}
{"text":"We went there tonight as a party of 5. The service was awful it seemed we were forgotten.  They were slow on the drinks. My Grandma had to ask twice for water. The food came out very slow. They did not clear dishes, My salad plate was still on the table at the end of the night. When I got my dish a Salmon with a bourbon maple glaze. The fish could have swam in the glaze, that included garnish and potatoes. The only decent thing was the salad the goat cheese and spinach salad. I would give a half star for that but couldn't"}
{"text":"Got lunch from here today.   What I sampled:  Maine Lobster Bisque (delicious and the whole reason for getting lunch from here) Cheeseburger (decent version I only ate about half, but I expect the other half won't last long)  Overall I enjoy going here, though it is a bit overpriced, but sometimes I am just in the mood for that lobster bisque!"}
{"text":"I've liked the Fish Market since I first tried it in a couple of locations in California. So I was happy to find a branch when we moved to the Cleveland area. The food is good; though I don't advise ordering a steak. In general a fish restaurant isn't a place to order meat but here they just don't cook the steaks well, and don't use the best cuts. So stick to the seafood and try the variety of dishes they have. So far I've been happy with every fish or seafood dish I tried. I wanted to give a special thanks to the restaurant for printing personalized menus for my birthday party there, with my name on the menus. And for the complimentary birthday desert.  I'll definitely consider the Fish Market for other group events or just an occasional dinner out."}
{"text":"This is always one of my favorite seafood restaurants. Their menu changes daily, and they have excellent raw oysters!  They have their oyster bar happy hour on Wednesdays for only $1 each!  What a deal!  They used to have this pasta called Pasta Diane I believe that had shrimp and spinach in it, and it was absolutely divine!  They took it off the menu, but if you ask for it... They will still make it!  That's service!!! My brother ordered their tuna steak and ordered it raw because he loves sushi, so it came out seared on each side. He loved it!  It was definitely fresh and sushi grade tuna!  They also have an excellent happy hour at the bar!  Definitely one of the best seafood places on this side of town!"}
{"text":"Went here for happy hour.  Initially, service was prompt, but after the first drink order, we had to track a server down in the kitchen to take the food order.  It took so long to get, we just left.   Will never go back."}
{"text":"No pictures!  I knew I should have taken my camera!  My aunt and I went there today for Mother's day.  I think we must have gotten the lunch menu because everything looked pretty cheap (I've been to the one in Columbus).  My aunt had a chicken dinner (grilled chicken, green beans and potatoes with butter) and I had their Shanghai sampler which had a couple of shrimp, a couple of scallops and a nice piece of salmon, all done perfectly.  We didn't order dessert since my aunt had made my favorite pumpkin pie!  Anyway, dinner was great, and so was the service, thus the five stars!"}
{"text":"We were really looking forward to the acclaimed restaurant scene in our hometown of Pittsburgh, after having retired to Arizona 6 years ago.  We had remembered Mitchell's Fish Market as excellent for seafood, as well as (surprisingly) steak. Wow, were we disappointed!!!!!  The near-empty parking lot at 8:00 PM on a Friday was the first clue. The misunderstandings about the reservation and being treated accusingly by the front greeters who were arguing with each other was the second clue.  The lack of availability of the first 3 choices we made from the menu was the third clue.  The shoe really dropped when the food came.  Both my blackened cod, the steamed vegetables with it and the side of asparagus in hollandaise were ALL cold, dry and hard.  The cod portion was tiny.  MY partner's fillet of beef ordered \"medium rare to medium well with some pink\" was black on the outside, dry, cold and very well done.  Others in our party of six had similar experiences with just plain tough batter-dipped and greasy fried fish for one and cold, dry, small portion of \"fresh\" fish for another.  We were told that this place had changed management in the past 5 years.  In light of its poor quality of food at upscale prices, Mitchell's Fish Market deserves to fail and close."}
{"text":"Class and sophistication at reasonable prices. My partner and I celebrated our 15th anniversary here and had a delightful meal. Our seafood entrees were fresh and very well prepared. Service was congenial and attentive. The interior is handsomely appointed. This was our second visit, and we're now wondering why why we haven't been there more often.   One final note: a competitor, McCormick and Schmick, is just a few miles away. M and S is quite good, but Mitchell's is better in every respect."}
{"text":"First time visitor here and from the door we were greeted and welcomed so nicely!   Restaurant is attached to some kind of shopping plaza but didn't even realize till halfway through the meal.   Food was AMAZING!!!!  Served hot and fresh and at daily market prices (this is a treat for us) a little bit more expensive then your normal TGIF & Applebee's.   We ordered :   Two cold water lobsters served with smashed red potatoes and asparagus.  DELICIOUS and appropriate serving amount to fill you but not overstuff you. You get a personal butter warmer which is cute and a nice little detailed touch.   Mega Sizzling seafood combo which included : king crab legs/mussels/clams/shrimp/ potato wedges - served on a huge sizzling platter (food was grilled and lightly seasoned) at $58 a platter it was awesome to be served food not drowned in seasoning and butter !!!   Our waitress was a gem and very accommodating! We will most definitely come back!!!    ***only downside is where we were sitting - near the kitchen /take out area and all we could head under the candlelight glow was most of the young staff complaining/dropping/ and talking about things I wish not to hear if I'm spending $150 for dinner *** sit somewhere near a window or away from the kitchen area ***"}
{"text":"Despite reading some awful reviews on here, booked NYE (first visit to Mitchell's) and hoped for the best. Arrived early for reservation and was seated immediately. Started with sangria and the sourdough loaf of bread- both great!  Noticed a wedge salad go by and it was huge, so ordered it and asked for an extra plate for my boyfriend- salad was split in the kitchen :)  One of the best wedge salads I've ever had.  For my entree, I had the stuffed sea bass and substituted the asparagus for grilled vegetables- everything was fantastic!  Food was hot (noticed a \"cold food\" theme in reviews) and very tasty. Boyfriend had the shrimp/salmon/crab cake trio- very good, as well. Portions weren't huge, but after the bread and salad, we were good!  Still managed to split the dessert trio. Yum!  The banana bread pudding was my favorite, and the boyfriend loved the sharkfin(?) pie. Now for the service- excellent!  Edward was our server and he was simply perfect. Being a server myself, I can be fussy. But Edward was wonderful- was sincere, helpful, and was around just enough- wasn't too much, wasn't too little!  Already looking forward to our next trip to Mitchell's!"}
{"text":"I'm not a mean reviewer, if you look at the other places I've reviewed, but this was just so so so disappointing. The Shanghai style Merlin was very poorly done. The meat was extremely bland, with very little seasoning. I have a very low sodium tolerance and yet I still found this fish to be made too bland. The rice was entirely uncooked and it made crunching sounds as I took my first bite. I talked to the waitress and she offered to bring out another side. It wasn't the same. The whole dish was a fail and I don't think I am ever coming back again :("}
{"text":"Attended a ladies luncheon of 32. Was held in the back dining room facing the interior of Eton Mall. Wonderful service, from working with the assistant manager to the waiters. Started with the best New England clam chowder ever. Had choice entree of Asian shrimp chopped salad, Trout with mashed potatoes and veggies, or Jerk chicken with mango salsa on beans and rice. Comments were all very good. Dessert was a platter of the prettiest decorated spring themed cookies that were carried in. Program was a fashion show by a boutique in the mall. A very nice and fun afternoon. Thank you, Mitchell's!"}
{"text":"Good seafood, even in Ohio! We started with the seafood gumbo, which never disappoints. It's full of chunks of seafood in a yummy tomato broth.   We then had the Ahi tuna appetizer. It was a bit smaller than I would've liked (only 4 pieces of tuna), but it was tasty.  I had the mahi mahi, shang hei style, which is steamed and served in a rice wine soy sauce with spinach and sticky rice. Delicious. I ate the whole thing!   My husband had the mahi mahi, grilled with market vegetables. He also finished his and said it was good.  Definitely one of my favorite seafood places!"}
{"text":"Went there on Mother's Day.  I must admit that my meal was good.  I had crab cakes.  However my husband ordered scallops, and received 6 tiny scallops- about an inch in diameter each.  He paid 27 dollars, and was still hungry after his meal.  My son ordered trout, and his piece was very thin and unseasoned.  He substituted fries for the potatoes, and received a small handful of fries.  Needless to say he was also still hungry.  His meal was also around 27.  Terrible to spend over 100 dollars on a meal for three people and not be full.  Will not go back.  You do not receive a good value for your money."}
{"text":"There really are not too many seafood options here in Pittsburgh. I have been here 3 times so far, and each time has been very good. This last Friday I walked in, and I was able to be seated immediately without a reservation. It was about 6:30 when we went in, and at about 8pm when we left, it was pretty packed. The seafood has always been good and fresh, and this was the first time in my life that I had swordfish and it was moist and tasty. They have a signature way of steaming their fish (if you ask for it this way) with ginger, sesame seeds and soy sauce over spinach and rice. It is excellent. They have a full bar, with a few good drafts (Guiness and Dogfish 60). Definitely pricey among the Waterfront restaurants, but to me it is worth it."}
{"text":"Highly recommend this restaurant. Spent the weekend in Pittsburgh for a Steelers game and found this place close to the hotel. Service was good, but the food was better!!!"}
{"text":"Wonderful! I stopped by simply because I saw the sign for a fish market. And I am so happy that I did. The seafood is very fresh. So fresh that they even have a raw bar and a deli case stocked with all the fresh fish for you to preview. And there was no \"fishy smell\" that you sometimes get at fish markets. The restaurant is moderately upscale and has a very nice atmosphere. The lemonade was hand squeezed and made per order (not made in advance) and absolutely delicious! The drink menu made my mouth water with almost ever drink made with hand squeezed juices or house-made fruit infused liqueurs. I can't wait to go back. And I will definitely visit every time that I'm in town."}
{"text":"Rainbow trout blackened. touffe rice and beans. Green beans. Excellent. My second favorite seafood place in town."}
