{"text":"I had the meatball sandwich and a small side fry. For 15.50, it was a let down and nothing special."}
{"text":"I heard about this place from my friends who stayed in the plateau area while visiting from NYC. I thought, why not, I'll give it a shot; with very few good grilled cheese spots back home. I had the jalapeño rancher and my partner had the Mac m cheese with bacon. Obviously we did half half, thank god we did...  Two separate pieces of heaven. The workers seemed shy at first, but they warmed up quickly and were very hospitable... Some of the best service I had in Montreal at a grilled cheese restaurant .. Aaaaamazing !  I recommend they open in NyC. I will def be spreading the word.... People need to know about them. #mltdwn lover for life !"}
{"text":"Great food but our food took about 30 mins to show. Later found out the machine didn't send out order to the kitchen. I would come back though since it seemed like a fluke."}
{"text":"So I went to their location in Ottawa at the Rideau Center, and then noticed on Instagram that they had a store in Montreal on Mont-Royal so I had to check it out. First of the all store looks great and it was great for people watching. I went with the Jalapeño Rancher this time and it was so freakin good, my cousin Frank had the Mac and Cheese and he said it was phenomenal. I tried the tomato bisque soup and dipped my sandwich in it, doesn't get any better. I look forward to the next time I'm in Ottawa or Montreal on business."}
{"text":"This Mlt Dwn location just opened in Carrefour mall. Delicious gourmet cheese sandwiches with a variety of delicious fillings....the spicy waffle fries are the best...the cheesecake sandwich with Nutella was so good."}
{"text":"I was walking on mont-royal looking for some casual food. I was attracted by the big couches we could see from the window. I looked at the menu. Overpriced grilled cheese. Nevertheless, the poster says it was worth the price. My adventurous food habits push me to try it. Nice concept. You make your own grilled cheese or select a pre-made. The staff recommended me the \"Beef brisket\" which was a popular choice.  You order, pay, sit and they bring you the food. :D  I was amazed by the homemade ketchup (normal, spicy and pepper). THE WAFFLE FRIES OMGOMOGMOMG. must try.  It's like something we used to know, but enhanced to a next level.  For the grilled cheese, it was tasty, crispy and the sauce made a huge difference.  It fills you up if you are not starving.  The fountain drink is too \"fast-food\" style. I'd prefer a homemade drink.  They serve beer which is a great idea. I was confused whether I should wait for the waiter to pick up my tray or give it back. There was no \"specified\" place to give back the tray.  Free wifi which was great. It may seem pricey for the meal (10-15$) for trio. Nevertheless, like I said, it's similar to what we are used to from fast-food, but quality is enhanced.  Mix between fast-food and normal restaurant service. Overall, good experience. Many possible combinations to try.  Recommend for lunch/ afternoon meal."}
{"text":"Love the west coast and the tomato soup. I come to the mall just so I can eat here. Friendly service always."}
{"text":"My favorite restaurant in Montreal! This place is the best. Amazing grilled cheese and dessert. Eat the smores dessert!!"}
{"text":"While the food was great (great, quality grilled cheeses with really interesting toppings), the service is what blew me away. They took the time to talk with me, figure out what I felt like, what I might like and built me the perfect grilled cheese. Everyone there was the absolute nicest and made the experience great (and super quick too). I recommend the mac & cheese grilled cheese with pulled pork! But I doubt you can go wrong with anything on the menu, especially because you can build your own from scratch. Would definitely recommend as a great lunch or light dinner spot."}
{"text":"Right off the bat, yes the option do feel like grilled cheese you can make at home. They aren't highly gourmet or anything. But they are delicious and also the cheese fries are amazing.   I got the mac and cheese grilled cheese (duh) and I don't normally like kraft dinner but it worked in the grilled cheese. It was gooey, warm, tasty, and made with love.   The cheese fries were so good I couldn't believe it. I savoured every bite.   The service was great, super friendly and fast. No complaints whatsoever about the cleanliness of the area or the theme/table arrangements.   Looking forward to making my own on my next visit.  About the cheese fries though, MORE CHEESE PLEASE.   PS: the cheese grater lamps are too cute."}
{"text":"So I went there expecting an amazing grilled cheese and decided to go with their classic. Little did I know by classic they meant 2 slices of smart bread with a slice of Kraft cheese. I could have stayed home and made a better grilled cheese with whatever is in the fridge!!! A bit disappointing lol"}
{"text":"They used to have a counter at the Carrefour Laval and I would dream of their fries!  I've not tasted anything the I didn't like there, their tomatoe soup was very good, their numerous grilled cheese were great, their poutine gravy was yummy!  I just hope I get to go to their restaurant, but its not really  my neck of the wood!"}
{"text":"First off, grilled cheese is awesome. Custom grilled cheese sandwiches are amazing.  Came here, ordered the Caprese, one of MTL DWN's signature grill cheeses. I found it quite expensive being $10 without any side attractions. I expected excellence, it was simply OK.  I was somewhat disappointed and didn't feel I got value out of this meal. There are better options in this food court. Kindly revise your prices!"}
{"text":"Great staff and great food, we went with a group of four for lunch and everything we had was real good. I'm gonna stop in again when I come back to Montreal for sure."}
{"text":"So how ya gonna kick it? Gonna kick it MLT DWN!   Dude. Seriously. Omg. Seriously. Dude. This place makes a meaner melt than a summer snowfall. It's cheesier than your dad's joke book. It's got more flavour than a packet of MSG. Needless to say, MLT DWN has the goods. The Rancher and Pulled Pork are my faves, but if you only want a snack, you can't go wrong with the Classic. Oh, and while you're at it, tack on an order of basket fries. In fact, add a whole basket of basket fries - they're so tasty that they basically redefine what a fry should be.   And did I mention the service? The owner remembered me from my first visit... a month ago! Plus, he understands the difference between a gluten intolerance and coeliac disease, which is the restaurant equivalent of striking oil in your backyard.   Officially my #1 grilled cheese spot in Montreal and so should you."}
{"text":"I would have given this place five stars if the service hadn't been so slow! There was only one guy serving everyone so I guess it is understandable. The grilled cheese themselves were fabulous! I had the Rancher (cheddar, jalapeno jack, herb chicken, house-made cilantro ranch, bacon and jalapenos ) on garlic bread for an extra 50 cents. My boyfriend had the pulled pork grilled cheese (pulled Pork, caramelized onion, jalapeno Jack, cheddar & house BBQ sauce on sourdough). Both were so good!  I want to go back and try the others especially the mac and cheese grilled cheese. The grilled cheeses come with a slice of pickle on the side. The waffle fries were good but were a bit soggy by the time we got home. They also had spicy ketchup and pepper ketchup was was fun to try."}
{"text":"The Grilled cheese are good , fast , clean, easy to choice, many places, why not if you are hurry.."}
