{"text":"Yesterday was my first time going there.  The outside looked kind of sketchy, as the restaurant is located in a more industrial section of Oakville, but we decided to go inside.  The decor gave off a very old school diner-style decor, which was nice.  Food tasted good with GIGANTIC portions.  I figured that I was hungry enough to try their \"mo-mo burger\" which was a burger with two patties and bacon/cheese.  The burger that arrived was huge and there was no way it could fit in my mouth; I had to take one of the patties out and treat it like a steak later.  The burger itself tasted fine, although the patty was a little bit on the dry side.  Poutine was good.  The staff wasn't bad.  We had a bit of wait and our waitress was sprinting around to get to people (us included).  The place wasn't jam-packed or anything, but it seemed that they had a bit of difficulty tending to all the customers.  Overall, a decent experience and I wouldn't mind going there again."}
{"text":"This is a nice family restaurant with a variety of options and American portion sizes so bring your appetite and a ask for a doggy bag. They have breakfast all day, which is a bonus and not even on Friday do you wait for a table. The wait staff are above and beyond amazing, although the kitchen can sometimes be a bit slow. Overall great options that will please everyone from stomach temperamental seniors to picky toddlers."}
{"text":"Absolutely disgusting. I had the country skillet as recommended by the server. It came drowned in 8 gallons of yellow sauce and had absolutely zero taste. I sent it back and ordered the protein breakfast with sausage and bacon and ham. Well..bacon was burned on some pieces and raw in others . The ham was burned as well. What a disaster going there. This was the downtown Oakville location. Definitely avoid this place."}
{"text":"The food is great and the portions enormous. Outstanding hash browns. I would have given a 5 but for the condition of the washrooms. They were filthy, this makes me question the cleanliness of the kitchen. Very concerning"}
{"text":"Good god!  Looking to feast at a reasonable cost?  Look no further.. Mo takes his portion sizes very seriously.   In fact if your a light eater you may want to order one meal and share it between two.. they dont mind!  I even overheard a waitress suggesting that to an older couple.  Go MO!"}
{"text":"Great family restaurant. Nice selection,pleasing specials and generous portions. The hot turkey with stuffing is just like my Mother's. And the breakfast special is one of the best."}
{"text":"I read the reviews and took my husband and 9-year-old son here for breakfast.  On the plus side, the place is big and feels open and comfortable.  Even more importantly, all the servers and staff we met were helpful and friendly.  So ... We wanted to love it.  Regrettably, those pluses could not make up for the food, which was just plain bad.  Home fries were slightly reheated shredded potatoes.  My son's pancakes were overdone pancake mix pucks.  There was a sour taste to my peameal that I couldn't quite explain, and it was underdone in part.  Perhaps they do better with dinner ... But we won't be trying any time soon."}
{"text":"This is a great place for families, the ambiance is nice and the staff is friendly. The lighting is kind of harsh, but the food makes up for that.  I ordered pancakes and sausage, and I received a gigantic (and I mean gigantic) pancakes, the size of my plate. they were so good, that I had to package them up and bring them home to finish. All the food is pretty amazing actually. :)   Probably will return."}
{"text":"Excellent place of you are hungry and down for a feast. Food is really good and it comes it large quantity! Staffs are also great! Price is very reasonable. Place is very nice. One thing that is not really a biggie but the sanitizer smells very cheap however this is about over a year ago when I was there but the rest is great!  I used to go there all the time before I became vegetarian. This place is awesome if you are not on a diet! Way way way better than what u get for at other diners like Denny's or sunset grill. This is s family restaurant where the food is not franchised!"}
{"text":"Great value for money. The main concern I have with this restaurant is that first impression is that it is old and dirty, because of the furniture tables, chairs,and I think it's because it's a busy and popular spot they don't have a chance to do deep cleaning of the furniture and chairs. I think it needs a bit of a facelift. The food is certainly good and it is a popular place."}
{"text":"Great food. Friendly kind staff. Great portions of food, got the pancakes and omelet and a coffee."}
{"text":"Probably one of the worst  experiences  I had at a restaurant. And I am used to eat out often in all sorts of restaurants, from high end to family fare. We placed our orders and  had to wait for one hour and twenty minutes. I found the waitress to be patronizing and although she came a few times to let us know the food would be arriving shortly, I had to let her know the wait was unacceptable. She shrugged her shoulders and responded she didn't know what was going on in the back. Finally the food comes. Yes, I agree with some of the reviewers the portions are massive. So what? My daughter's meal was inedible. The meat was dry and the vegetables totally undercooked. When she told the waitress she took away the food and NEVER  offered a replacement. It was my first time at this restaurant and surely my last visit. Chef Moyardee should take a vacation and never come back. I am usually never this harsh when reviewing a restaurant, as anyone can have a bad day. The fact that the staff didn't seem concerned is a clear sign they  are either beyond caring any longer or they experience this kind of complaint from other customers on a regular basis.  I highly recommend you avoid this place . We had to stop at a McDonald's to buy some food for my daughter on the way home."}
{"text":"Their skillets are hilarious. They should come with a defibrillator. Huge portions full of really tasty hash browns, bechemel sauce (ask for it on the side) and cheese. Usually service is great unless there is a hockey team going there after a game. A nice alternative to the franchises that are pervasive in oakville."}
{"text":"Consistent tasting food, great price and large portions.  It is absolutely food crafted to the perfection. Absolutely delicious.  Its a place I go to regularly. The staff are friendly and quick."}
{"text":"So disappointed with Mo's! I read the many positive reviews here on Yelp and on Google and was keen to try this place out with my husband and two kids. We went for dinner on a Tuesday night so it wasn't busy. The lack of crowds and lovely nature of the waitress were really the only positive things about our visit. The waitress who seated us was a bit meh, didn't really communicate beyond what was absolutely necessary, but the lady serving us was very kind and attentive. The decor is ugly, to say the least. The whole place is tired. But frankly I'd happily sit amongst it if it meant I'd get nice food. It was, to be honest, gross. When the waitress came towards the end to ask how everything was I just said I was done as I couldn't tell her it was fine and didn't want to be rude. But the food really was utterly awful. And it didn't arrive promptly despite the place being two thirds empty. Big portions mean nothing when it tastes terrible and is old and overcooked. I ordered the mushroom Swiss burger. I couldn't really taste the mushrooms or Swiss cheese as the burger patty was three times as big as it should be, overcooked, bad quality meat and not fresh, just dry. The only really fresh bit was the red onion. I can see why the packets of condiments were lobbed on the side of my plate as drowning the thing in ketchup, mustard and mayo was what made it vaguely palatable. Even the pickle was awful. The fries were disgusting. Clearly cooked in really old oil, they had this rancid aftertaste and I couldn't stomach more than a few. Even my one year old rejected them and she normally inhales everything! My husband ordered the cheeseburger and, again, it was tasteless and no cheese could actually be tasted due to overpowering burnt dry meat. He had the chicken soup as his side which was probably the nicest thing any of us had, just a basic soup really, nothing special. My four year old had the kids fish and chips which was a portion suitable for three children. The fish wasn't fresh and he chewed the one mouthful for 20 minutes due to the rubbery texture. The batter was raw in the middle and doughy, no crunch to be heard. And the coleslaw tasted really bland and had this soggy texture like it had been sitting around for a while, yuk. What's more, this pile of horrible empty carbs and trans fats cost $9! And no dessert or combo or even a measly colouring page - family restaurant? No, I don't think so. Overall, we hated Mo's and will never go back. I feel bad for the nice waitresses who work in this awful place. If I could leave less than one star, I would."}
{"text":"I admit, I was a little bit nervous to try this place at first.  It did not look that great from outside.. Sort of a dump actually  But I went in anyways, because I recognized the first and the only reviewer (Randy G), on my BlackBerry Yelp App.  I trusted his 4 stars, and I went out on a limb.  Inside, it is a bit tacky to say the least.  What was up with the chairs?  They are these grand leather chairs, but almost like a king's throne.. with a 90's modern twist.  They make you feel like an alien queen just sitting in them lol..  We stop for breakfast, so we ordered a bunch of items from \"Mo's Breakfast Speciality\" section to share (there were three of us).  Come hungry, because the portions are absolutely massive.  Reminds me of restaurants in the USA.    As far as the food goes, they did a good job on cooking things right.  Eggs, which I always order over-medium, were just that.  The hollandaise had a nice consistency, and their sausages were actually quite delicious.  The only let down was the fact that everything seemed to lack salt--and I don't usually eat salty at all.  Service was a bit on the poor side.  All of us felt that the waitresses did not do a good job of describing menu items, nor did they come by at a timely manner (sometimes twice in five minutes, but then gone again for another twenty).  Prices were around $12 for each plate, but they can easily be shared.  Or smaller breakfasts can be had for a lot less; maybe $6-7 per person.    I would return for another try, since it is a local Oakville restaurant for me.  Maybe I will try their dinner menu and follow up with another review.  Right now, it's a meh."}
{"text":"The quality of the food is amazing, and the amount is incredible.  The only \"bad\" thing is that the tables and seats are quite old but the food is spectacular!"}
{"text":"First time here and the food was awesome.  The portions are flippin huge so come hungry!!!  The place was packed.  Wife had the Reuben with onion rings.  Daughter had the kids burger which was a 12oz patty!  I had the banquet burger with fries and gravy on the side.  None of us finished our full meals.  We also had the large Greek salad to start.  Will definitely be back!"}
{"text":"Huuuuuge portions. Comfort food. They close earlier than most of the restaurants, especially on the weekends..."}
{"text":"Went to MO's for dinner last week with my parents food was really good big portions staff where friendly and professional and hope to return soon they have a really good menu"}
{"text":"Food is beyond bland, and service is horrible. 3 of us ordered a VEGETARIAN wrap and all 3 of us received the SAUSAGE wrap. Needless to say, this has been the most disgusting and horrendous experience in my entire dining life. We ended up eating it before realizing all the pork sausage was hidden inside the wrap."}
{"text":"Went here for dinner with wife and kids under 10 .  Food portions were huge but didn't taste good enough to ask for any doggy bags.  Service was slow."}
{"text":"I love the serving portion. Pasta was nice. Service was ok. I will go again for sure, when i am near by."}
{"text":"This place is nice. If you want family owned good eating this is the place. The food came out pretty fast all was fresh. The portions were extremely large. The prices were very reasonable. I got the steak and eggs with hash browns. No complaints. All the added things I asked for the cheese and onions for my scramble eggs and onions for over my steak were perfect. My children order waffles they were large and they had left overs.  My other two guest had eggs pancakes and bacon. They enjoyed there food as well. The atmosphere is chill and it's fairly large seating. The staff was prompt and on top of all of the request.. I would deff come back here again when I visit again.  Thanks mo-s"}
{"text":"We used to go here all the time for breakfast. Servings were big and never had to wait. We stopped going when we saw a cockroach on the floor walking past our table. The place seems to have gone downhill. I was even charged a buck for what appeared to be rotten tomatoes!!! Will not return."}
{"text":"Great value for the money.  Acceptable quality considering the size of the portion. I rate this place five stars for execution based on their target market. To provide some contrast, i got the pene chicken parm with rosay sauce and i had a similar dish at La Spaghett, last night. If i compared the two dishes, La Spaghett would receive 5 stars and Moe's would recieve a 2. The difference being the quality of the ingredients. Moe's did however have four times the size in portion. My wife had the french toast special and she rates it a high four (the quality of the sausage was on the lower side). Overall all this is a really good family restaurant and we will continue to come back."}
{"text":"This place is so yummy! I've only been here for breakfast, it doesn't have a bunch of options but the portions are huge and delicious!"}
{"text":"When ever I'm in Oakville for work I have to stop by this place. I have only eaten breakfast there but from what I've experience and have seen come out it all looks fantastic. Since I'm from the states I'm use to big potions but they take to a whole nother level."}
{"text":"This 'diner' is totally under-rated. The food is simple, great, and you get a plate full.  Decor is not so good, but the food more than makes up for it. Well worth a try."}
{"text":"Food is usually good! I've been a few times and 3/4 it's been great! Big servings for a small price."}
{"text":"The best brunch and lunch spot in Oakville by far. Thier portions are huge! The prices are more than reasonable. Two eggs, hashbrowns, 4pc bacon and 2pc whole wheat toast for $5.50. Their coffee is $2 and is unlimited. They bring a thermos to your table and have no problem re-filling it. Their skillets! To die for! They are overflowing with awesome ingredients and are literary served on a hot skillet. Their pancakes are HUGE! The size of the entire plate.   Their burgers are phenomenal and they make a killer poutine. Again, portions are huge. I easily take half of both home.   FYI they charge you a fee if you choose to only get one meal and split it between two people.   Their staff is wonderful. You'll see the same people every time you go. They desperately need more staff though. Those poor ladies are running around like crazy and try their best to keep up with all their tables which they do a pretty good job of considering how busy it is.   What I love is they always tell you to take your time. They never rush you out even if there is a line.   Choose your times wisely. Sunday mornings between 11am-1pm is crazy busy. Lineups can be a good 20min. Saturdays aren't as busy. Sometimes the wait can be 10min or so, but it's always worth it.   Mo's is located in an industrial area. Smart since all those employees gets a lunch break and want something fast, hearty and delicious. It's not much to look at from the outside, but inside it's huge for a diner type spot. There's nothing fancy about the decore, but it looks nice and is always clean.   Mo's is a weekend regular for my family and I and will be for many, many years to come."}
{"text":"Wow. *only come to MO's if you are either super hungry or super hungover*   Awesome family style restaurant that has enormous portions of GOOD fresh food. Nothing frozen here kids.   Came in for breaky with the Mr. on Sunday morning and were very happy with our choices. Had the eggs benny that was enough food for 3 people! Mr. had a regular hungry man type meal that could have fed 4 people!! The pancakes were the size of a human head!  The homefries are grated potatoes with nice pieces if onions in it, so if you don't like onions, request without. I love that if you order coffee they bring you your very own carafe so you don't have to keep bugging for a refill.   Awesome home cooked breaky...can't wait to come back and try the dinner menu!"}
{"text":"Big portions, friendly staff, food was pretty good. We had the buffalo chicken wrap, it was huge as was the Greek salad I had with it, it wasn't very spicy more sweet I'd get it again. Others had the eggs moe which is like eggs Benny the sauce was great the eggs were perfect the hash browns kept giving , would get again."}
{"text":"Mo's is the best restaurant bar none in the GTA probably in Canada or pretty close as per cost per meal. Staff are great and MO is very pleasant and personable too. Keep up the great work and foods MO. Nom Nom."}
{"text":"Good service. Huge menu for breakfast, lunch& dinner menus. Very generous portion, good food and reasonable price.  Perfect place for breakfast and brunch."}
{"text":"10 years living in Oakville and we just discovered this place!  Sunday morning breakfast, no lineup at 1130am yippee!!  Place was pretty busy and almost packed with families in the back where we sat.  Portions are huge!  We ordered breakfast champion &  veg omelette.  They give you a carafe of coffee which is nice.  Food was good.  Portions huge.  Nice alternative and a bit cheaper than Cora's.  Equally good are their dinners!  They have specials every night of the week.  The prime rib special on Saturdays is a steal of a deal for $20 for good prime rib, soup or salad, and the starch.  The portions are large and everything we have tried is tasty, especially the giant schnitzel.  It's a popular place for families and large groups and the service is friendly.  Definitely a great family restaurant."}
{"text":"Came here for post-call brunch with a friend.  This place is located in a kinda strange area - plaza in the middle of an industrial area, which as auto body shops, warehouses, furnishing stores. Looks like a family restaurant inside - nice warm colours, very open. Ordered the house skillet, which is quite a construction. Thick layer of hash browns (the shredded kind) topped by an omelette (false advertisement, as it says scrambled eggs on the menu) and then by cheese and hollandaise sauce.  It is a heavy creation and despite being hungry and wanting to eat salty, greasy food, this dish is a little hard to handle - but that could also just be cuz I was so tired.  The hollandaise sauce is heavy and thick and kind of bland.  I think if the place had smaller portion sizes (their omelettes are 4-egg!!), and cut down their prices a little more, it would make the meals more reasonable, more affordable and healthier.  Nice place to go!"}
{"text":"As I was parking my car in their parking lot I was actually very skeptical and for a moment was thinking of skipping the idea of eating here..But I'm glad I decided against my instincts and dined here.  So this place is old and absolutely non fancy, old furniture, art work and vibe but it isn't dark and dingy it's got high ceilings and quite a character to it.  I had walked in on a Sunday evening an hour before close and boy this place was packed, that actually was my first reason of relief.I was seated immediately.Being my first time here it was a hard decision to choose from their huge menu also every food passing by us looked amazing.Our waitress carol was an absolute delight, she was helpful, friendly and kept checking on us.Shes been with the restaurant for almost 5 years.  Let's come down to the food..this place is actually a food heaven.I ordered the veal cutlet which was perfectly cooked.So crisp and flavorful the gravy on top was outstanding, it came with mash and perfectly cooked vegggies.We also ordered a jays burger.The burger had the most flavorful patties, loaded with cheese and had roasted red peppers in it which created an amazing taste.  This place offers great food and is fairly priced.Lots of parking outside the restaurant.Will definitely be coming back."}
{"text":"Great food, great drinks, great selection, great portions, great prices, great staff, great takeout.  Only thing is the decor is weird, spruce it up and the atmosphere will be perfect."}
{"text":"Excellent breakfast fare, huge portions, various eggs benny and i was impressed. Had lunch on one occasion and our table had veal parma, a lasagna and a monster burger....i really like this place...old timey feel and service was crispy and quick. 4 stars with a hint of 5...price is very reasonable and leftovers seem inevitable."}
{"text":"We ordered take out last weekend as we were visiting the indoor playground in the same plaza. Food is pretty good especially the porche eggs with salmon. You are paying little bit more than a McDonald's combo but can have a much healthier food. Will come again."}
{"text":"If you are hungry Mo's is the place to go as their portions are definitely bigger than your average breakfast spot. Although that doesn't mean the food tastes any better. There wasn't anything that tasted wrong about my breakfast but my eggs, bacon, hash browns and toast didn't stand out compared to other breakfast places. I also wasn't a huge fan of their style of hash browns, could've been a bit crispier. Also their orange juice was strangely expensive. I will probably be back at some point but wouldn't go way out of my way to eat here."}
{"text":"Just like Peter's on Eglinton, a big place with big portions!  Old school family restaurant always serving good home made food.  Had the veal sandwich and it was better than I expected, also had the burger special and it was outstanding!  Wish more places like this exist where you get affordable meals that give you more than what you pay!"}
{"text":"I really can't believe it's taken me so long to leave a review for Mo! This place is close to my heart and has been a go-to for my family since they opened so many years ago--we even decided to have Thanksgiving dinner here one year, as there were too many of us for one person to host.  My favorites on the menu?   For breakfast, the skillets, and the egg Mo's (Benedict with peameal and hollandaise).  For lunch you can't go wrong with the fresh, homemade chicken tenders, or any of the wraps.  Dinner favourite is by far the mushroom chicken dinner with mashed potatoes, or the souvlaki. I've never had a meal I didn't enjoy though.   No matter what you order, the portions are always huge, the food is always great, and the staff always friendly. Mo will come over for a chat and make sure everyone is happy. I honestly don't think in all these years that I have ever successfully finished my whole plate. Did I mention the portions are huge?   Keep it up Mo and staff! See you guys again soon."}
{"text":"Ok for all the foodies out there this place is a must visit if your in for a challenge to finish any of there enormous entrees.  I have been here before a few times and have always had a hard time finishing there huge portions, the food is always  fabulous and great friendly staff , there located in what looks like a commercial industrial area but don't let that fool you ...today I had there Sunday Turkey dinner just delicious Turkey was so moist tender just melt in your mouth goodness the whole nine yards gravy , fillings , veggies , crane berries , mashed potatoes a must try there only served on sundays."}
{"text":"Ohhh mama, this is what breakfast is all about. My breakfast life can now be separated into pre-Mo and post-Mo (no, not post-mortem - although after that breakfast I wouldn't be surprised if I died within the next 2 months of a heart attack)... I came here for a Sunday morning 'hang-over cure' breakfast. The restaurant is kind of hidden and not very attractive from the outside, which is the ONLY reason I took away a star. It's in an industrial-ish area and I think they could get better signage seeing how popular they are with the locals.   Inside is very big and spacious, with pretty chairs and tables - not your usual diner style basics. There were two of us, I ordered the Breakfast Champion for $11.99 which included 4 eggs, bacon, ham, sausage, double serving of hash browns and toast. My friend ordered there Country Style Skillet for $11.49 and that had a layer of hash browns with bacon, ham, sausage, back bacon, eggs, cheese AND it was all smothered in hollandaise sauce. My friend couldn't finish the skillet, but I finished mine and his hehe so no problem! IT WAS DEEEELICIOUS!!!! All the meats and cheeses, it's the perfect breakfast.   Apparently they do birthday parties too - when we were there a lady was celebrating her 85th which was adorable. The staff sang to her, she smiled, everyone was happy.   I wish I lived closer to Oakville. Portions are huge, ingredients are fresh, staff is super nice - great experience. Awful location...but then again, maybe it's hard to find prime restaurant space in Oakville, it's either unused open space getting ready for construction, parks or mansions :)"}
{"text":"Great service and quick turnaround for food. Huge portions! Pancakes and French toast aren't gourmet but if you are looking for a diner like experience it's pretty good."}
{"text":"So many reviews here have said it, but you can't imagine the serving sizes of the food here. We went for a Saturday brunch and I was still stuffed by dinner time.  The hash browns are great. You get a plateful of shredded potatoey goodness. If you order coffee, they'll bring a carafe to your table, so you won't have to wait for refills. We drank a lot of water, so our server offered to bring us a pitcher of water, too.  I had the vegetarian skillet: a giant bowl of hot hashbrowns topped with veggies (peppers, onions and tomatoes) and scrambled eggs, all topped with melted cheese and hollandaise sauce, with a side of toast.  The food was tasty. Not too salty or greasy. Just good home cooking - a plateful of comfort food. My dining companions also enjoyed their food - not everyone could finish the large portions. I saw other diners taking home containers of leftovers.  The service was friendly and efficient. The servers were clearly being run off their feet - nobody was pausing to take a breath. Still, I did have to get up and find our server to ask for drink refills, as she was so busy with several large tables."}
{"text":"Who feels like cooking all the time? Not me!!!! So I went for a nice breakfast with my family at Mo's. the restaurant has a very rustic charm to it with decent prices and a large space. The service was great and our server was lovely.  I was pleasantly surprised with the heaping amount of food I received from my order. I had the French toast special and I couldn't even eat half of the food I received. There were three pieces of French toast, half a plate of loose hash browns, three sunny side up eggs and five slices of bacon. The food was really tasty but man oh man there was an awful lot of food. Luckily I was able to get a take out box to bring whatever wasn't eaten for my round two at home. My brother got the skillet which looked to be an assortment of various breakfast items all in a skillet together. He also really enjoyed his meal, especially the large quantity. We ordered a pot of fresh coffee which our server was very great about checking to see if we needed refilling.   This was my first time at Mo's but I had a really pleasurable experience :)"}
{"text":"HUGE PORTIONS! That is your only warning.  Mo's Family Restaurant is this place on the industrial strip in Oakville. There's nothing but old industrial buildings, bars, automotives, and trucks. The place itself looks pretty crappy outside actually. We were keeping our eye out for it and still drove by it. The interior is pretty old and reminds me of a tavern. Blackboard specials are posted outside and menu is rather large with lots of different items from burgers and sandwiches to pastas and steak. They also have an all-day breakfast for you hungover zombies looking for a fatty retreat.  I ordered the Breakfast Champion ($13 - 4 eggs, bacon, ham, and sausage with hash browns and toast), thinking that it would be just your standard breakfast meal. You can get an upgrade for only $2 more with a stack of pancakes if you like as well. When that plate came, I damn near had to cancel the rest of whatever I was doing today. This is definitely something you eat twice in a day. The eggs were good, and definitely feels like it was more than 4 eggs. The hash browns are exactly that. They were strips of potato smashed onto a griddle. The meat portions were the key. They give SO much meat. I'm talking 3 sausage links, 4 strips of long bacon, 2 slices of thick ham. Seriously? When they said bacon, ham, and sausage, I thought maybe 2 of each max? No way.  Service was amazing. Our waitress looked so tired but was still friendly enough to throw around some laughs and such. Really made me feel like a \\"regular\\" even though it was my first time here. The sheer portion size is enough to make you want to come back, but when you factor in price and service, it's a no brainer. When glancing at the menu, I thought it looked a bit high in price. When the food comes though, you'll soon realize that you've paid for two meals so it's actually pretty cheap..."}
{"text":"So it's Friday morning. Time for our gang to head for Mo's and the breakfast special. It usually doesn't matter what food you subtract from the special, the price is pretty much the same, so you may as well have it all. Tastes great and good value."}
{"text":"Great family style restaurant in Oakville. I was visiting from the States with my father and a friend from Oakville gave us this place as a recommendation. As a big eater... I was intrigued by the Mo's Scary Burger Challenge. I decided to take it on and was told I was the first in a few years to actually successfully eat everything. It involves a triple burger with Canadian bacon slices in between each patty, 3 slices of cheese and caramelized onions on it (absolutely delicious no matter how much pain I may have been in) and an extra large side order of pouting which probably could have fed 3 people itself. Other than this challenge... everything on the menu is a large portion but everything looked delicious around the restaurant. My dad loved his meal and we had a great time with people cheering me on. If I find myself back I Oakville, I'll definitely come back here for a meal."}
{"text":"OMG!! I'd you want value foe your money with FANTASTIC food, Moe's is the go too place Our table of 6 each had different meals. The New York steak sandwich that my husband had was a full 8oz steak that was cooked to perfection. The chicken fingers were home made, lightly breaded chicken breast, that our nephew couldn't finish. My nieces banquet burger was just that, a full banquet. My Julien salad was huge, but spectacular! Our friends vegie quesadia was large and vegies sandwich filled then up for sure!   Huge portions at great prices. Comfortable atmosphere and friendly staff. On our go to list when we hit Oakville!"}
{"text":"This place used to be good value. $33 for two breakfast and coffee. They charge $3 each per person for ONE pot of coffee... Sonia was our waitress and only seemed to pick and choose who she greeted with a smile and was attentive too. Typical stuck up waiter/waitress who eyes up your tip when they think you aren't looking and judge you.  Don't go."}
{"text":"Wow portions are huge steak sandwich was great. Fries were awesome and the gravy is just amazing. This is a guilty pleasure"}
{"text":"Brutal service staff - they don't care to get your order right and when hey hear it's wrong they blame you and move on -massive waste of food.   There value and then there's gross- this is right on the line:   Omelet probably has about 6 eggs or more... just too much for me and all their dishes are overkill like that.   Tasted good but the service again brought it waaaay down"}
{"text":"3.5/5  I stopped by this place with my friends for an early dinner, since one of them who's a resident of Oakville said this place is excellent.  I had the mushroom and swiss burger with a daily soup plus a dessert, which was chicken and rice. The soup itself was good, though the rice was a little mushy...I guess I'm not used to non-mushy rice.  The burger itself was gigantic. Gigantic to the point I actually had to use a fork and a knife to eat the whole thing as my mouth was too small to fit it all. The toppings were overall decent, though the patty itself was sort of dry.   I had a cheesecake with chocolate swirl for dessert, which actually tasted very good!  Service was excellent, the lady kept our party of 10 attended throughout the 1.5 hours we were there."}
{"text":"Had my breakfast at this simple busy family restaurant. Had eggs over house made home fries (which were spectacular) with Peameal Bacon. The Peameal was incredibly tasty & very soft (not how I make it-hard & tasteless). All-in-all...great breakfast."}
{"text":"You get great value and friendly service. Portions are huge and delicious.  Not 5 star food but 5 star 3 star food!!! If that makes sense!!!"}
{"text":"Good value, serious portions, friendly staff and delicious food. You need to check this place out!"}
{"text":"Heavy food, huge portions, typical breakfast and diner experience in a familiar very casual large restaurant that is suitable for families and big groups. They usually are very busy although unless you are a big group, they can squeeze you in. I like their Greek omelette and I order fruits on the side."}
{"text":"Huge portions, good breakfast... country style skillet +++++ breakfast wrap +++++ fair prices for the portion you get.... it's been getting pretty popular these days... it's in sort if an industrial area but don't let this fool you as it's world star quality!!!!!"}
{"text":"A nicely situated family restaurant in Oakville, didn't wait long to be seated. Friendly staff, and took my drink order right away after seating.  Ordered a hot chicken sandwich with French fries, huge selection and multiple menus, was offered their lunch or breakfast menus and took a look at both.  Got my food in 10 mins, hot fresh and smelling awesome. First thing I notice, HUGE portions. French fries are cooked in house from scratch and ultra crispy. The sandwich was incredible and out of all the hot sandwiches I've had easily comes in the top three I've had.  Don't pass up on this joint. Great food."}
{"text":"We are always looking for new restaurant options, and my better half saw that this had good reviews, so we thought we would give it a try since we happened to be over in that direction.  I actually like the decor inside, although the chairs are the kind that you can't easily hang your purse on.  The waitress didn't seem overly friendly but she was not really rude either and did bring us what we needed.  My first problem was that I was craving something sweet for breakfast that morning instead of something eggy ... most restaurants offer a french toast with berries or berry crepes or something, but unfortunately this place had plain french toast (with syrup only) or crepes filled with either nutella or ice cream ... that's way too sweet for breakfast.  So I opted for a BLT.  The sandwich was decent, the bread was fine and not overly greasy, and they did load it up well with bacon and tomato.  For the side I paid the extra $2 or so to get their \"famous\" hash browns.  I'm really not sure what they are famous for.  They looked encouraging, the American-style shredded potatoes and there was a huge pile of them.  Unfortunately, under the crusty part they were basically a pile of mushy potato with absolutely zero flavor ... even salt couldn't save the taste.  My other problem here was that I ordered water to drink, and as soon as I tilted the glass up to take a taste I got a big whiff of musty smell.  I'm not sure if they dried the glass with a musty towel or if the glasses are stored somewhere musty or if there was an issue with the water itself ... I'm sure it was potable but the smell was a huge turn-off and I had to order something else instead.  Overall I maybe wouldn't object to coming here once in a while, but why bother when there are better options like Sunset Grill or Denny's or Golden Griddle."}
{"text":"Great place for brunch. Ommelates are delicious and there is so much food. You better bring huge apetite."}
{"text":"We decided to give Mo's a try for late breakfast today.   We walked in at around noon to a fairly busy dining room and were seated right away. The waitress came over within a couple of minutes to give us menus and take our drink orders. We were given a breakfast menu, which surprised us as we thought the menu would have something other than breakfast items on it at that time of day.  Our food arrived about 10 minutes after ordering and we saw that the portions are indeed huge as other reviewers had mentioned.  The eggs Benedict had 3 large eggs, a CRAZY amount of ham and a huge pile of hash browns. The eggs were poached nicely (extra soft, as ordered) and the Hollandaise sauce was pretty good although I would have added a little more acid to balance the flavour. The hash browns were nicely browned on top and on the bottom, but the ones in the middle were really just warmed through. All in all, it was pretty good though.  The country style skillet was also absolutely huge. There was a mountain of hash browns, covered with bacon, sausage, ham, scrambled eggs and cheese. Atop all of this was at least a cup (maybe 2) of Hollandaise. Our son said it was tasty, but was only able to eat about a 3rd of it as it was a LOT of food.  My husband had the protein breakfast which consisted of 2 large eggs, bacon, sausage and ham. It was garnished with tomato slices and included toast. It was also a huge portion. He asked for sunny side up eggs and they were nice and soft but unfortunately there was quite a bit of uncooked egg white on top.  We all enjoyed our food, but I feel like quantity was more of a priority than quality. As I said before, it was all good but not wonderful.   The prices are okay. It was $48 for our 3 breakfasts with one tea (served in a carafe, so no need to ask for a refill).  We may return, but to be honest there are other breakfast places we prefer, so we'll more than likely frequent those over Mo's."}
{"text":"We really like this restaurant for breakfast. Huge menu with equally huge portions. Always accommodate any strange requests I may have.  Today, we both got the smoked salmon skillet. It was delicious with mountains of their famous hash browns and lots of sauce. Our only gripe today was that the food was lukewarm at best. Its served in a skillet but definitely not heated in one. I get the concern about burning people with an overly hot skillet but i also enioy my food warm.   We do also love that you get a coffee canteen for the table so you can serve yourself."}
{"text":"Food 5/5 service 4/5 overall would recommend this place! Great portions, you will not leave here and feel hungry thats for sure! not from arround there we decide this place only by reading reviews ans it did not desapoint! Recomment 100%"}
{"text":"I usually order eggs and sausage. It was pricey considering what you get. The hash brown was not that good. Generally, I did not like it that much."}
{"text":"This is a solid 3. 5  The good: The food portions are insane. The value is indesputable.  You could technically have 2 meals by doggy bagging half of your meal. The menu is extensive and all around comfort food favorites. Burgers to pasta to schnitzel to steak to all day breakfast.  The service was friendly and quick.  The place is huge. We came with a fairly large group of 9 last minute and they made a table for us no problem. The house wine was pretty good for house wine. The vegetables that came as a side were pretty impressive. This is the first time i havnt seen a bag of frozen vegetables as a side. They were fresh Brussels sprouts, sweet potatoes and beets. Quite yummy and abundant. Go local fresh produce! Free garlic bread for the table.  Where it loses points: The decor is dated and the place could definitely use a face lift.  The food albeit huge isn't anything out of this world. My schnitzel was tasty and the gravy was delicious. The Mashed potatoes clearly came from a box.  The seasonings weren't very flavorful my husband's chicken parmesan came with pasta which was pretty lifeless. The chicken parmesan was enjoyable though.  Overall this was pretty much a diner but a notch up. It felt family like and closes pretty early too. We would come back for the breakfast for sure!!"}
{"text":"Excellent Breakfast place. Finally can have Hash Browns the way I like it.  I had the Asparagus Benedict and it was \"Fantastic\". It was a Big portion, but it was so good that I actually finished it and that is very unusual for me.   Staff was helpful and friendly.  Oh.. And the coffee was really good too."}
{"text":"Quality of food is fairly good. The atmosphere is family casual. The portions are definitely the key point here - huge portions. Family usually takes extra food home because of the quantity.  One recommendation would be to change the light bulbs used - they use LED lights that are pure white. It would be better if they had a filter to make them warmer so the light isn't so... surgical.."}
{"text":"I've only ever been here for breakfast; that said, I do keep coming back for breakfast.  Ever since Oakville got a Cora's, that seems to be the \"in\" place for breakfast, with lines out the door just about every weekend. And while Cora's is pretty good, it isn't always worth that kind of wait.  At Mo's, you can usually walk in and sit down right away. Service is quick, and there's a good selection of breakfasting available. Of special note is the Challenge breakfast - 3 of everything, and a beverage, for about $20, and it's free if you finish it on your own. Here's the problem - you can't. I guarantee* it. I've sat down with 1-3 other people to try to finish this one off, and have FAILED MISERABLY EVERY TIME. Something about the three gigantic pancakes, PLUS three slices of French Toast, and then three (large) orders of hash browns... It's a plate of food the likes of which you'll seldom see, and somewhat unexpectedly, it's all tasty.  Other stuff I've had here - the hangover omelette stands out as a particularly good example - was equally tasty, quickly served, well priced and delivered in quite a generous serving. I've never dipped into the lunch / dinner menu, because the breakfast was just so tasty.  Overall: why go to Cora's when this is here? On second thought, you lot keep going to Cora's - I don't want to line up to get in here.  *Guarantee does not represent an actual guarantee - just a poetic device."}
{"text":"Expensive but large portions.  I ordered 2 items. One was good, the other was regrettable.  1. Austrian Schnitzel: bland, bloody-tasting. Had no sauce or flavouring to go with it.  2. Chicken with Gravy: tender and flavourful.  Service is decent, but UNDER-staffed. Only 2 waitresses during busy lunch hour. It didn't have a warm \"family diner\" atmosphere because staff was so rushed.  I might return, but only if desperate."}
{"text":"Great place to eat if you haven't eaten in days. Huge portions that you will definitely not finish but it's not just a lot of food, the quality and taste is pretty good too. From their breakfast to dinner, nothing is disappointing. Their chicken wraps are amazing and so is their chicken souvlaki."}
{"text":"Are you looking for deliciousness?  Do you love you some big ol' portions?  Do you like nice people?  SERIOUSLY. GO. TO. MO'S.   Saturday night? Prime Rib special - $20.00 for a HUGE piece of prime rib, soup, veggies, potato. Ugh, why am I reviewing this while hungry? Now I'm starving and Mo's is closed! :(  They have SO many choices - fish, butter chicken, HUGE breakfasts, steaks, pastas, you name it. The breakfast is my absolute fave, especially since it's like $6.00 for breakfast super early in the morning, and the breakfast is HUGE.   And Oakville KNOWS Mo's is good. Everytime I go to Mo's, it is SO busy. I've never seen it not busy. That would be so weird.  I blow kisses at Mo's when we drive by. My Husband knows that Mo's (the restaurant, not the owner) is my side-chick. Sorry baby, but those hashbrowns are THAT GOOD.  Embarrassing tidbit - I go to Mo's so much, the waitresses all know me. Eh, what can you do. Girl's gotta eat!"}
