{"text":"Visiting the lovely city of Montreal for a few days in July 2017 and my bride was a treat.  She had wanted a delicious meal of steak frites without the high price tag.  So we looked at the reviews and chose Modavie...moderately priced French with Steak Frites on the menu.   Well...the steak was subpar at best.  Tough, lower grade cut of meat, not what one would expect.  She ate most of it but I can tell you we wouldn't return based on her meal and the poor delivery of a French \"easy\" classic.   I had the fish special which was ok...but lacked full flavor, little seasoning or special prep prior to baking so the flavor on a scale of 1-10 was a 3.  Having said all of this, the upside to Modavie was the service...our waiter was terrific...and the quaint lively atmosphere set off by the non-intrusive live entertainment which rotates nightly.  A true delight!  So if it's great food you seek...not so great on our first trip but if you want to linger with a cocktail and listen to some great music and soak it all in...Modavie is the place!"}
{"text":"The food was ok, we've had better. The kitchen was extremely slow...one-hour wait for salads, which were just ok, was way too long!!"}
{"text":"Excellent jazz. Food is good; had truite amandine flavourful. Great spot.  Service a little slow but waitress is knowlegable with good recommendations.   Crème Brûlée was a little lumpy, not bad though."}
{"text":"The service here is excellent. I do not know if Lorenzo is the owner but I would assume so with how amazingly he treats any customer in the restaurant. As soon as my friend and I sat down he was friendly and conversational and making sure we got whatever we wanted. This man knows how to run a good business and make you feel like you are his most important customer. I had a delicious glass of whiskey and listened to some very soft and enjoyable acoustic jazz. Beautiful atmosphere and I will be going back to try the food. I could go on.. but if you want to go somewhere to be treated like a queen (or king) go here. This is for you Lorenzo! much love"}
{"text":"I suggest that you do not ignore their recommendation when they recommend the lamb dishes to you!! Good atmosphere and good salads. Can't expect much more from a place in a touristy location."}
{"text":"Great place. Love the atmosphere, somehow dim but well lit, very warm feeling and interesting to look around the room without being chaotic. Fits the street perfectly too, St Paul is a great place to walk through small galleries and shops in the Old Port of Montreal.   The music is great too. Jazz bands typically led by beautiful and talented francophone women. I definitely recommend sitting upstairs so you can enjoy the live music.   The food is excellent as well. No bad choices from my experience, but I think the lamb is the best I've had. There's a full page of lamb on the menu and it's their specialty. That being said I'd have a lot of things there that aren't lamb, and I've never been disappointed.  Another great thing is that they work to get you in. I showed up with my wife for New Years without a reservation and though they were jammed they made it work. They had to speed up our service a bit, but let us know before hand what to expect, and didn't push us at all during the meal.   i really have nothing but great things to say, and i recommend this place to everyone I know who's going to Montreal."}
{"text":"After a series of disappointing dining experiences in Old Montreal,we are beginning to think that we should avoid restaurants in this part of the city altogether. Add this one to the list -watered down drinks and overpriced food that was fair to middling-sorry Lorenzo you were very nice but the Mushroom Risotto was a big pile of bland mush.If I wasn't vegetarian I would ordered the lamb like you suggested."}
{"text":"Restaurant agréable dans le vieux Montréal proposant une cuisine type française ,la nourriture est de qualité et le personnel très accueillant , les prix sont correct pour un restaurant français"}
{"text":"Good food. Good wine. Amazing service. Went on a Saturday night with a toddler and they were great at finding a good table so my daughter could watch the jazz musician! Not the best choice for a restaurants to go to with a kid but they made it work for us!"}
{"text":"The rack of lamb was delicious. The goat cheese was strong and fresh. The vegetables were fresh. Everything was beautiful prepared. I will be back!"}
{"text":"Nice restaurant, very promising, just a few complaints. They were busy and service took for ever, plus they screwed up our order of mussels. What a shame, they were fresh, good quality mussels, but, maybe because they were rushed they did not take the time to let the mussels filter out the mud and the sand, so easy to do. As a result, I ate a few that were full of sandy thick grey mud. Sadly that wasn't the only problem, they weren't cooked properly, half of them were unopened, a few of the ones I ate, tasted like uncooked oysters. We had to turn back the mussels and ordered the trout that was ok, slightly on the overcooked side. A positive note, our waiter was probably the best waiter I have had in a very long time and made the substandard experience liveable"}
{"text":"Outstanding service, outstanding food, great ambiance. Go for the lamb, it's their speciality and go the extra mile for the tiramisu, it's made at the restaurant and tastes fresh!   Lorenzo is charming and courteous! He makes the whole experience that much better"}
{"text":"Excellent food, wonderful staff. Loved the lamb burger.  Husband had the rack of lamb with goat cheese. Both were fantastic."}
{"text":"Only lamb chops are above average..fillet is so plain, taste only salt and lemon..I really doubt how this can get so much reviews on tripadvisor"}
{"text":"This restaurant has a lot going for it! The ambiance was very nice, great decor, and the food was fantastic. Unfortunately, the live jazz is only upstairs, and despite the speakers throughout playing the live tunes, (which were fantastic) it wasn't the romantic jazz experience I had hoped for.   The service is the main reason I did not give 5 stars. When we were seated, we were not greeted from a waiter/waitress for 15 minutes. This means no water on the table, not even a look of acknowledgment.   There were 2 waiters surrounding us and that were frequently tending to others which made it awkward and left us confused.  After finally getting some service  we  ordered everything at once as we had such a long time to mull over the menu.  From then, we waited another 45 minutes until we were tended to again. At this point, our charcuterie board arrived and only one onion soup, even though we ordered two. Our drinks had been empty for 20 minutes and no one cared to notice, offer us another, or another look at the drink menu. Eventually, we had to attract a different waitress to help us, as the service seemed impossible. Our onion soup dishes sat there for around ten minuets before being taken away. Perhaps they started to realize things were not up to snuff and started to be more attentive. This made us feel much better but the dinner took over 2 hours. Yes we were vacationing here and were not in a hurry but such horrible service for an upscale restaurant it not acceptable.  Our meals and dessert were delicious so our experience got better and better throughout the evening. I am sad to write this review as I had such high hopes for this place."}
{"text":"I came here with a large group for a birthday celebration and we were all thrilled! The service was wonderful, ambiance was fun, interior was really nice (stone walls etc...) the stand out though, as it should be, was the FOOD!  The Bison Burger and the Lamb Cavelletti (Pasta) were major stand-outs, however filet minion, steak and frites, and several different desserts earned raves too!"}
{"text":"Looking for a local spot in Vieux Montreal, and the live jazz was just the ticket; or so we thought. The red wine that we splurged on was brought over from the fridge (seemed a bit odd) to the point of us having to ask for it to be decanted. I ended up holding it in my lap to warm it up a bit more. We'd decided on an onion soup and salad to start. Basic, to the point.  Lamb was their specialty, so we thought the chops looked good. They did, but they weren't particularly flavourful, nor warm. I wanted to really enjoy the meal, the ambiance, but it was a miss."}
{"text":"Had a great dinner here on the Christmas day. Staffs were really friendly and awesome. The foods were a bit late but the staff apologised right after which was nice of him. This restaurant is good place for a special occasion :)"}
{"text":"I had a very enjoyable meal here in May, on a very busy night. Despite the restaurant being full, our waiter was attentive and friendly, and even indulged our request for a photograph. We had no complaints about the drinks (bellini, rose sangria and the grapefruit cocktail) or the food (lamb burger, lamb pasta and duck).  I would definitely go back, if I was looking for a sure bet in the Old Montreal area. It isn't the trendiest choice in the area, but it is a warm atmosphere, with good service (and live jazz, if you book a table in the main room)."}
{"text":"This place was recommended to us by the hotel we were staying at.   From the moment you walk in, there is a relaxed vibe to the place. When being seated, we were led up a wraparound staircase to an upstairs area featuring live music. Not sure if they sung in French for most of it, but definitely noticed they had sung in English for part of it.   Ordered a bottle of Cabernet Sauvignon (brand was sterling). Delish. Food I ordered the braised lamb which came on this flaky pastry with meat in each layer. So moist I dreamt about it later. My friend had the steak which was juicy, tender, flavorful. Cooked just the way he liked it (medium rare).   Waitress was super sweet and gave us details about the area. Overall fun experience at a place with ambiance that makes you feel fancy but it's still casual so you can wear your jeans."}
{"text":"I guess we should have gone for the music and ordered the lamb! Lunch on a Sunday was underwhelming. French onion soup was nothing to brag about. The frisee with lardons was not bad but nothing special. My husband's filet, however, was a wretched piece of meat. We suspect that it was (over)cooked and then forgotten. It was just a bummer of a lunch--and really expensive, too."}
{"text":"Loved this place.  My friend and I each had a lamb dish-- a self-proclaimed specialty of the house.  My rack of lamb with goat cheese was fantastic-- would not change a thing.  Service was superb (maître d Lorenzo!!) and responsive and wine selection solid.  Just a really top-notch experience all around."}
{"text":"Went there for our 30th wedding anniversary.  Had a lovely meal of lamb chops. My husband had a pasta dish with chunks of lobster. Everything we ate was really delicious including his after dinner drink and dessert. Enjoyed excellent service from Francois. Would def return and recommend highly!"}
{"text":"We love coming here! Good solid food and great service. Lorenzo the manager is friendly, kind and very accommodating. He regularly checks on his staff and guests and makes sure everyone leaves happy. He even gave both our daughter and Ginny (her doll) ice-cream! A great place to stop for lunch, especially if you have young children."}
{"text":"Great little French bistro in the heart of Old Montreal that had an incredible atmosphere thanks to their nightly live jazz. The restaurant had great ambience, terrific food, lovely wine. Service was polite (though tended to be a tad on the slow side) and my lack of ability to speak French was not at all a problem.  Started off with a salad, followed with their spice rubbed lamb chops (they specialize in lamb), complemented with a glass of Shiraz. Finished with a creme brûlée.   It may not be the best food in Old Montreal, but combined with the jazz and inviting atmosphere, I had a lovely and relaxing evening."}
{"text":"One star for the nice waitress and live music. No stars for feeling rushed during dinner and spending $25 on salmon and chicken plates that I could have made taste better in my toaster oven. Veggies had no flavor, chicken was dry, salmon was uninspiring."}
{"text":"Not worth it. The food was fine, but the wait between our salads and the entrees was unacceptably long---- by a lot. The owner is very officious, running around actually yelling at the waitstaff. Overpriced, too. With all the great restaurants nearby, this one is a waste of time and money."}
{"text":"Excellent experience all around. Lorenzo the owner was a gracious host assisting us to move our reservation up and selecting a nice table for a special Christmas Eve dinner. Service, food, music, and atmosphere all made for a fabulous evening on a special day. Would highly recommend at any time of year."}
{"text":"Food was not great; but the atmosphere and live jazz singer made for a really nice evening.  The service was a bit slow, but she apologized and comp'd us a glass of wine for the wait, which given how busy things were and the entertainment, did not seem that bad.  Go here for the nice wine list and sit at the bar and hear some music, and then grab dinner elsewhere.  Also note, the place and vibe isn't very trendy and youthful, there were a lot of senior citizen couples and families.  Other places in the neighborhood are a better fit for a hipper, younger crowd."}
{"text":"Just walking around the old port area and found Modavie Ordered a lunch special (lamb chops comes with soup and tea) Service: 5/5 Food: 4/5 Environment: 3/5  Service: Fantastic. Food: Soup was so good. And a waitress severed me some bread also pretty good. But the lamb chops was not on the level of the soup. Could be better imo.  Environment: It was pretty noisy  even only few customers. And I can barely hear the music.   Price: $30  I hope they can do a better job with the lamb chops. But I do like their service a lot."}
{"text":"Food: The food was alright, nothing mind-blowing.   Service: Can be slow on weekends  Value: On the pricey side but within the normal limits of Old Port restaurants  Ambiance: The restaurant has 2 floors, there is a live jazz band upstairs at night which is nice if you don't mind it being too loud although it might be hard to hear conversation. The light is also too dim to my taste."}
{"text":"First I would say it's my fault for not seeing that it was a \"bistro\" which is a upscale (in pricing only) bar.  There was a TV blaring and tons of kids running around.  I wouldn't mind but the manager was moving (screeching) tables/chairs as he was setting  up for jazz singer (why does it take one hour to do this?).  I was more mad when my drink came and it was tiny AND water down!  Yeah that's right!  Serious accusation but I take my first drink neat for this very reason (see photo).  Feeling cheated and after a cursory glance around I quickly canceled my food order.  We didn't get bread until after the third patron who sat down asked (and then the waitress realized that she forgot all of us).  My hubby got the steak which admittedly was perfectly cooked but was absolutely nothing special.  The other positive note is that the waitress was very pleasant.  I would never recommend this place for the value of food, drinks and experience - it's all geared to cheat tourists."}
{"text":"The poutine was delicious.  The combo of the cheese curd,  lamb, and the fries on the poutine was amazing! Had the rack of lamb med rare and it was perfect to the bone. A great aura with the love band and singer.   Highly recommended it!"}
{"text":"Came here because my husband saw that they have mussels in pernod sauce.  He was not disappointed.  A huge bowl of mussels, a glass of wine and live music and he left very happy!   I had the mushroom risotto which was delicious- well seasoned and a good portion.  We also started with the foie gras- excellent.  We didn't have room to have dessert, but based on the ones we saw around us, they all looked very good."}
{"text":"We were staying in the Old Montreal section of town and looking for a place to grab a decent cocktail and have some appetizers.  Modavie was just right. The location was good, we were able to sit in a window and watch the world go by while enjoying a drink and some nice apps.  It's a solid choice.  Good for exactly what we were looking for."}
{"text":"My husband and I were in search for a restaurant that offers a great atmosphere - a nice treat for the both of us away from the kids.  Walking down Rue St-Paul, we heard jazz music being performed and was also attracted to the menu.  We were greeted by the very charming, Lorenzo and were seated right away.  My husband ordered the sea bass and I ordered the trout - both cooked to perfection.  I highly recommend this restaurant. What a lovely way to end our holiday in Montreal."}
{"text":"Lovely dinner! Very well prices prix fix menu with some delicious offerings. Really enjoyed the welcoming live music and service was on point."}
{"text":"Quality live jazz and their lamb is amazing. Pair it with something from their good wine selection, and you have a memorable night in the making. It can be a bit touristy but not overwhelmingly so; it's more a function of being in the Old Port area. The ambiance is perfect for a romantic night out.   The one downside is, the service can be a bit slow on occasion. I've been a few times and had this issue only once."}
{"text":"Loved this place. Get a seat upstairs by the live music and enjoy. Timing was great. Not rushed through any courses so we could stay a while and enjoy the music. Good was delish - mussels, duck, beef tartare"}
{"text":"We were here last week.  Our last day in Montreal and we stopped in for some lunch. The food was good and the service was excellent. When we were leaving it started to downpour which forced us to take up a seat at the bar and have another glass of wine.  The bartender was very nice and helped us with directions. It's a bit off the beaten down tourist trap path which makes it extra nice.  We saved the best stop for last in Montreal."}
{"text":"Last night we had a wonderful dinner.  The restaurant is in old town on St. Paul street.  Beautiful street filled with shops, bars & restaurants   We were seated near the fireplace and near the jazz band.  The beautiful stonework added to the ambience   We had the ny strip with peppercorn sauce and grilled salmon.  Both were cooked to perfection.  It also came with grilled mixed vegetables.  For dessert we had tiramisu, which was delicious!!"}
{"text":"Modavie Wine Bar and restaurant is the best. The Maitre,  Lorenzo greeted us and made sure our afternoon wine stop was a success on the 13th of May.  The Vietnamese bartender was extremely knowledgeable about the wines and suggested a great cheese plate to go with our Chardonnays.  Without a doubt, when in Montreal again we will come for dinner and jazz,  Beverly Barth San Diego"}
{"text":"Located right in the centre of old montreal, this restaurant was one of the only ones open on Christmas. It was suppose to have live jazz music but we didn't see a live band.  The restaurant is separated into two areas, the bar area which is more rustic but still has table seating, and the main dining room. We enjoyed the rustic feel of the bar area, felt much more Christmas'ee.  We ordered the charcuterie and cheese boards, both were very standard and nothing to rave about. The mains were however,  delicious.   Our table had ordered the steak frites, the rack of lamb, the duck confit, and the risotto. The steak frites was probably the most standard/boring main - a bit dry in my opinion. The lamb was juicy and tender, done to perfection. The risotto was very creamy and flavourful - served in a very large portion considering how heavy this is. Last but not least, and everyone's favourite, was the duck confit; a good size leg, juicy and tender!!"}
{"text":"We went on a Saturday night and sat upstairs where they have live jazz.  Not too loud... it was perfect.  The food was excellent.  We got the Octopus and White Bean Salad and Roasted Beet Salad for appetizers, Braised Lamb and Rack of Lamb for dinner, and Tiramisu for dessert.  The strawberry flavored ice wine (from Quebec) went very well with the Tiramisu (thanks to our waitress!).  The Rack of Lamb was probably the best I've ever had.  The Braised Lamb came with a puff pastry and was a little too salty but still very, very good."}
{"text":"The last time we were in town, this was the first place we ate at because it was so close to the hotel and didn't feel like wandering-- so glad we did, as it ended up being our favorite place.  This time around we made it a point to have dinner here, and are very glad we did.  We had the Duck Confit and the Lamb Shank-- both delicious.  Then we had the Tiramisu for desert, again delicious.  This has become our go to place when in town."}
{"text":"Went here for dinner the first night that we were in Montreal. The restaurant wasn't anything great but it was alright. The wine list was small but we found a bottle. The menu was alright - I was told that they specialized in lamp so I ordered the lamb chops but they were pretty small and not overly great. The service was also okay. At the end of the meal we were finishing our wine and the bartender brought over the check without asking if we wanted anything else - we weren't super happy about that. I wouldn't go back but if you're in the area and can't get in anywhere else it could work."}
{"text":"Very very tasty. The lamb here is the bee's-knees. You'd be foolish to order a non-lamb dish, but it would still be delicious. (The orichette with artichokes, prosciutto, and mushrooms is particularly lovely. The mediterranian salad w/smoked salmon is also another great choice.)   The live jazz band: stand up bassist, guitarist, and female singer (Sarah ...???) were fantastic. The catalog was well chosen, and the music was just the right volume"}
{"text":"Between visiting the Norte-Dame Basilica and shopping in Old Port, this corner bistro was a convenient place to grab a bite on a late Sunday afternoon. They had plenty of seating available at this off-peak time with options of outdoor seating, bar space as well indoor tables by the open windows. We started with a Nicoise salad, which was plenty to share with two. The mussels and frites was also plenty to share. They were tender and had a tasty sauce for dripping the bread. The lamb burger was quite tasty with the right amount of goat cheese and onions. I would go back to try dinner and listen to the evening jazz performances."}
{"text":"Great service. Lamb burger was very good. Risotto was below par but when we told them they replaced it with the blinis which were very good!"}
{"text":"Amazing professional jazz band on Saturday (2nd floor). It's a wonderful show while eating. I recommend you to try the filet mignon, it's a blast, as well as their risotto (I'm normally quite picky when it comes to risotto).   However, you need to make a reservation first. Otherwise, you might have to wait outside for an hour. It's a very popular place in the Old Montreal."}
{"text":"This place was lovely. I went while traveling to Montreal on business, and was looking for somewhere to experience Montreal jazz.  I had the salmon, and it was quite tasty!"}
{"text":"Good music, good service, good wine list, but an OK food. My husband and I was told by the concierge in the hotel that Modavie is a french bistro, but when we arrived, we saw \"wine bar\" on their sign! Ops, we walked in without too high expectation on the food. And it turned out we were right. The menu is mixed( glad that they didn't have any Chinese fusion dish), but the wine list is pretty well rounded. Haven't seen Opus one for a long time except recent trip to Smith & Wallensky! But over all it was good restaurant and we enjoyed our night there."}
{"text":"We were recently in Montreal and fell upon Modavie.  The weather was cold and the restaurant was warm and inviting.  They have the most amazing French onion soup!  We enjoyed our entrees as well and visited twice while in Montreal.  We definitely recommend this restaurant.  The food, the ambiance and the people who work there are all first rate.  The mussels should not be missed.  Go!"}
{"text":"Even though we had to wait an awful amount of time to be knowledge by the waiter...once she took care of us the whole experience was worth the wait. Awesome food, great service and the ambience was perfect for a late lunch on winter time!"}
{"text":"Ordered spaghetti al dente - the pasta came broken into 4 inch pieces & sticky hard?!?!  4 days ago we went with friends for a birthday celebration & ordered the lamb burger which by law should be well cooked - it came pink in the middle.  The plate arrives hot to touch but the food is lukewarm.  Been a patron for over 10 years & when the regular staff - Lorenzo, Rodwan are working they make sure that the plates don't look like fast food & replace the dish immediately.   Last night was a waste of money. Needless to say chef should be doing a better job & the staff should be more involved.  Elena Miller.   Heard Lorenzo was back at work so we decided to go for a quick bite. Kitchen staff still needs work - but it was great to have Rodwan wait on us & to glad see Lorenzo.  The atmosphere is back to normal. My husband enjoyed his lamb burger & I had the fish.  Next time I'll order the pasta again.  The music was fabulous.  Thank you for a great night."}
{"text":"What a Gem of a place. We went to celebrate my girlfriends 50th birthday and the Mondavie staff did not disappoint. From the warm greeting from Lorenzo who never forgot our names throughout the evening. The French Onion soup, calamari, filet and lamb chops were some of the best we have ever tasted. Tayna was so great and attentive and her wine choice was superb. We will come back for sure and have raved about this place for the last 4 days."}
{"text":"This was the best meal of our vacation! The steak and frites were delicious and the desserts were phenomenal! Our waiter was friendly and very helpful. We really enjoyed the atmosphere as well. We will be sure to go back next time we are in Montreal!"}
{"text":"My husband and I just arrived in Montreal after traveling all day and happened up Modavie.  We got there very early in the evening, around 5:30 and were able to get the best seat in the house next to a window looking down one of the quaint Old Montreal streets.  Our service was excellent.  The food was delicious.  We ordered Calamari for an appetizer that was one of the best we have ever eaten..  I had the trout almandine and my usband had the short ribs.  They both were outstanding.  The atmosphere was so relaxing and background music very nice.  I think we may just have to go back and listen to some jazz, since we got there too early for that the first time.  A definite must in old Montreal!!"}
{"text":"We had a wonderful experience at Modavie this Valentine's day. My husband and I met our parents for dinner, and when we arrived my parents had already been seated in a table right in front of the live singer. They had gone to the restaurant early to check it out, and the owner Lorenzo gave them a personal tour and told them he would reserve that table especially for them. All of the service we received from that moment on followed suit, and we felt like part of the family. We all enjoyed our food and wine, and when we left Lorenzo remembered all of our names as he showed us out."}
{"text":"A bit pricey for the food, but good service, atmosphere, and food.  Live music venue in upscale restaurant. We went around 9 pm in September and it was somewhat busy, but we were able to be seated right away. The waitress did a great job of keeping our water glasses filled and checking in with us. Our food orders did not take long. I ordered the seafood linguine and my wife ordered the spaghetti bolognese. Both dishes were good, but we expected better for the price. Main courses are around $25 to $50 a plate. Expect to pay around $40 to $60 a person for a main course and a drink. We recommend this place for a casual dinner date with light conversation. Do not expect to be able to have an in-depth conversation at the table."}
{"text":"the low lighting, rows of wine bottles downstairs, and live jazz at this restaurant and wine bar were perfectly matched with the ambiance of the city.  we enjoyed a delicious appetizer at the bar - puff pastry with brie and pear, and continued with a really enjoyable (and big!) meal upstairs with a window overlooking rue saint-paul on one side, and the jazz band on the other.  we had endive, apple and roquefort (sheep milk blue cheese - that was google searched before the trip!) salad; french onion soup; pasta (pasta and mushrooms was the only veg entree - it was great, but a few more options would've been nice); seafood; tiramisu; creme brulee; and dessert drinks all around.  it was a really enjoyable meal, and the service was good.  the jazz band was excellent.  a great spot for romantic and/or special occasions."}
{"text":"My wife and I came here for dinner expecting a decent dinner, if not a great one after reading several reviews in an Old Montreal top 10 restaurant article. I had the steak and frites and she had the catch of the day. The steak was the blandest I've ever I mean EVER had. I could have done a much better job in my own kitchen.  My wife's fish was just as bland! We were truly disappointed. So far, Modavie has been the low point of our mini foodie vacation. The high points have been Olive and Gourmando and Foxy. Tomorrow, we will go back to Olive and Gourmando for lunch then seek out a good crepe restaurant for dinner. The jazz is a nice touch but the steak and fish were truly bland and tasteless."}
{"text":"Nice ambiance here including live music. I have visited a few times and had meals that were just OK to good. Overall this is a fairly solid option in the Old City, and I do like it -- but there seem to be more memorable meals to be had in other parts of the city."}
{"text":"Great food in old Montreal.  I had the filet mignon carpaccio and the lamb chops. All very good. Lively place,  I would certainly go back."}
{"text":"We did not have a reservation so we were seated at the bar.   The lamb chops were to die for. My wife had pesto penne which she also enjoyed.  The live jazz was a wonderful surprise and we stayed for over three hours just enjoying the food and music.   Would return in a heartbeat."}
{"text":"Lovely atmosphere, ambience, live jazz, very dim lights all those great things. The only thing missing was a real flame in our candle (we got a tea light).   Our server was really cool and friendly, effortlessly so, unlike some servers who try really hard to be cool but aren't, she was truly cool, but not too cool. Great service.   Food was fantastic. If you love lamb as much as I do. The lamb is the buzz at this restaurant. Too bad I could only afford the lamb poutine. The rack of lamb is 39 dollars I wish I could've tried it.   My girlfriend had spaghetti and meatballs  The pasta was delicious, al dente (it had bite!). And the meatballs were monstrous. It was courteous of her to ask how many she wanted. I mean huge. Baseballs of meat. They were really delicious baseballs of meat!"}
{"text":"Nice ambience and music, but for us the food was so-so. It was Easter night so perhaps the key chefs were out... The foie gras was too cold, the onion soup felt a bit watered down and the key lamb chop special was not that special. Anyway would recommend for the atmosphere."}
{"text":"First stop on Montreal visit.  This was a really fantastic place.  We booked through opentable, no problems, got seated after a 10 min wait, since they were really packed.  The tables are a bit on the cramped side, but the entire place is very charmingly decorated and felt comfy and friendly.  We had a very friendly waiter, who pegged us as the leisurely tourist, so let us be, but still well cared for and not letting us feel neglected at all.  We were seated right up at the stage, which is not our first choice, but unavoidable because it was full.  Not a big problem, just a personal preference, and the trio that played that night was quite good and not too loud at all.   The food was just delicious.  I had the BEST lamb chops, perfectly done and so tender.   Well seasoned, with potatoes and grilled-just-right veggies.  Hubby had the fish, which was excellent as well.  Well paired with an excellent bottle of red recommended by the waiter who didn't try to upsell us.  Topped off by a very yummy piece of tiramisu.  We had an excellent romantic night out, well chosen.  Great start to the rest of the trip."}
{"text":"Great customer service:  We were greeted with a warm welcome from Lorenzo who did a great job helping us select wine and dishes.  Our waiter was very attentive and kind; our food came out in a timely manner.    I got the lamb shank special and it was so flavorful.  I only wish it was a little more tender.   It came with a veggie medley which tasted fresh and crisp with a hint of olive oil.  The last thing I want are vegigies drenched in butter/oil.  I would definitely go back but be sure you ask to be seated upstairs!  That's where the live music is."}
{"text":"Came here for their \"Taste Montreal\" table d'hote. The maitre d' was very friendly and accommodating because I had to change my reservation from 3 people to 2 people, and in the middle, the third person showed up so we had to change tables. All this was done without any hassle and the waiters/maitre d' were very friendly about it. Downstairs is very quiet and the upper floor was more lively, with quality live jazz. I personally had the brie puff pastry (which was good, but perhaps a bit too sweet as an appetizer) and the Mediterranean seabass (which was good, but not great). Others ordered the mesclun goat cheese salad (which was really amazing!) and the braised lamb millefeuille (which was ok, but the portion was quite generous!). For desert, we all had a tiramisu, and it was excellent. They also have an extensive wine list.  All in all, Modavie is a great place for great service and ambiance/decor. But as for the food, I've certainly had better."}
{"text":"Modavie, known for its lamb dishes, excels in other plates it has to offer. We had steak and wild mushroom risotto with duck confit. Amazing! Dessert on the menu was tiramisu (classic, and well done!) and chocolate molten cake with a scoop of ice-cream (melts in the mouth... love it!) highly recommend!"}
{"text":"Rack of Lamb with a side of cool jazz.  So what do u expect on a Monday night?  Well the Modavie serves it up right!  Jimmy Doucet on guitar, and great service with Lorenzo keeping every one straight!"}
{"text":"Great ambiance, music and service. Food we got was mediocre especially for the price."}
{"text":"I loved this place!!! Awesome atmosphere, ambient, service. Live music. Food was very good to my liking. My wife was complaining too heavy. I loved it!!"}
{"text":"I love this place.  My wife and I go here every time we are in Montreal.  Typically we sit at the bar and drink large pours of wine and chat with the host Lorenzo who is great. Our most recent visit we ate in the dining room with our children. The steak frites were delicious as were the duck confit over mushroom risotto.  Live music, warm fire, old port."}
{"text":"We just returned from our meal at Modavie and WOW... We were underwhelmed.  After being positively wowed at our previous Montreal spots, our four person team was expecting another great meal. We had made reservations for the jazz area and were greeted by nice soft jazz. The man, who seemed to be the owner, joked that I had written on my reservation that if I didn't enjoy the food, I wouldn't pay. If only.  We sat down, ordered drinks and apps: a cheese board, calamari, a soup and salad. Came out just fine, calamari was crispy, cheese plate was good, big strips of bacon on the salad. We also put our  entrees in before the apps arrived.  And then we waited. Watched the tables that were sat after us get their food. Watched them finish their food. Watched their waters get refilled while ours sat empty. Watched our drinks whittle away to nothing... And then watched as waiters rushed by without a word to us.  Finally our food came. One pasta dish was incorrect and had to be sent back. The mussels were lukewarm and the fries cold. The confit duck was hot, but the skin was flabby like over cooked pasta and the roasted carrots were well under. It was not impressive. The correct pasta came later, and was relatively flavors AND we had to ask to get drinks refilled.  We picked at our food a bit, politely declined dessert and any takeout boxes. We received the check and were dismayed to find none of our concerns were acknowledged on the bill.  I wouldn't recommend wasting your money or time here. Go elsewhere."}
{"text":"My wife and I visited twice on a recent trip to Montreal--once for Food and once for drinks.   I had the mussels which were amazing!  I've never had them that way but they were in a delicious cream sauce. Absolutely wonderful and highly recommended.   We had drinks at the bar with the live music. Another very fun time. We met a guy named Lorenzo and he was charming and funny.   The employees seemed to be working hard but all were pleasant and smiling.   Overall a very positive experience and I would recommend this place."}
{"text":"Best French onion soup I've ever had. Quintessential Montreal experience...a must visit!"}
{"text":"We went here the first night of our trip to Montreal and it was excellent. It reminded me very much of Pigalle in NYC which we love. The restaurant is charming and on the corner of the street with lots of windows to watch the night life outside!  The service was excellent and the food was great. I had the pasta with lardons and chicken with black truffle oil and it was cooked just right and not too heavy. My husband had the ratatouille and thought it was very tasty. Live jazz music was fantastic!  Can't go wrong with a visit here for a nice, romantic, Paris bistro kind of night!"}
{"text":"We were looking forward to dinner but left somewhat disappointed. Nice scene, attractive space and great live music. However, our waiter, while polite, was inattentive and seemingly absent minded. We needed to waive him over each and every time we wanted something. The cheese plate needed some honey or jam as it was otherwise unremarkable.   The kitchen was very slow in producing plates for us and those around us. Between the delays caused by the waiter and kitchen we elected to pass on having dessert.   We had the rack of lamb crusted in sesame and the chicken supreme. Both were cooked nicely but required a little more flavor.   We would recommend the earlier seating -- at least then they will serve you in a timely fashion to get you out before the second seating."}
{"text":"Very good place during the stay and e food was great ... However the music was down and we eat upstairs ... Brie with cheers was excellent and the Bordeaux also .... Very good time there"}
{"text":"thoroughly enjoyed myself at Modavie. We dined upstairs over live jazz music. Excellent service by our very sweet waitress. Wine was good, halibut was a bit dry, but a great time here nonetheless. It was a classy start to the night.."}
{"text":"As a person who is not really familiar with French Cuisine, I was pretty happy with my steak dinner and side dishes (cannot recall their French names).  My fiance ordered the rack of lamb, which also came with side dishes.  She was also very pleased with the taste and quailty of her dish as well.  As for atmosphere, the place was really great.  They had a live Jazz band playing upstairs as we enjoyed our meal.  Where the waiter is concerned, he was very personable and helpful, but he was not all that attentive.  I kept having to ask for water refills.  All in all, my fiance and I would return back here because the food was good, and the atmosphere was great."}
{"text":"Great Restaurant, Great food, decent prices  This was a great find in the Old Port. We were here for lunch, and was quite happy with our dishes. We got the lamb sandwich- which was absolutely delicious. Not too gamey in taste, but quite juicy and flavourful. We also had the fish which was light, tender and delicious.   The service was excellent, food was great, and prices were reasonable. I would definitely return if I was in the area again."}
{"text":"With a party of about 10...so dinner took about 2-3 hours...I got sleepy. Room is dim and kind of romantic.  Had the mac ans cheese...for $20..it was different from the American mac and cheese. Made with Gruyere cheese, I think. Was good but I would have been happy with something else, too."}
{"text":"Great food, great service, wonderful live music as bonus. Nothing to criticize, just not exceptional enough for 5 star. However it definitely deserve a 4.5 star rating"}
{"text":"Very good French restaurant in a nice area of town. Nice service but a little slow. Would go again to try other things. They accommodated a gluten free allergy. Peach arugula salad and filet mignon stand out!"}
{"text":"Ok, I looked at these reviews after I went there for dinner ... And my first thought about the negative reviews was that someone has an axe to grind. Ex-employees perhaps or competitors? Lovely food, nice service, convenient location, and great ambience.  I'd definitely go back to eat there."}
{"text":"Very good food, service, atmosphere/ambiance, set in the beautiful old port neighborhood."}
{"text":"The music really makes this spot! The food is definitely just middle of the road. The vegetarian option didn't have really much flavor but the chicken wasn't bad. It is definitely busy so the servers have lots of tables to tend to. Go here for the atmosphere and you won't be disappointed."}
{"text":"We visited Montreal on Labor Day weekend and were searching for dinner options when we stumbled across this quaint restaurant on Yelp. Seeing the multitude of positive reviews we gave it a shot and all I can say is WOW. The live Jazz that greeted us as we walked into the restaurant was an intimate and warm touch. Our waitress Caroline was quite pleasant and offered her honest and candid suggestions. Every aspect of the meal was delicious. For starters we had the salmon crostini and fried calamari which was quite flavorful. I ordered the soup du jour which happened to be a tomato soup (I loved it). The bread and butter combo was perfect. For our main course my wife ordered the lamb burger which was perfectly cooked. I ordered the lamb chops (apparently a restaurant specialty). At the suggestion of Caroline I got them cooked medium rare and they were quite tasty. One of my friend's happened to order the Duck Confit (another specialty) which he enjoyed as well. To finish it off, for dessert I ordered the creme brulee and my wife ordered the chocolate fondant with vanilla ice cream. It was the perfect cap to a wonderful dining experience. I'm sure Montreal has a slew of fine dining options, but if you're looking for excellent food in an intimate setting, you can't go wrong with Modavie."}
{"text":"Wow, what a great place. Lorenzo runs a well oiled machine and made us feel part of the family. Service is outstanding and the food is spot on. Our server, Francois was attentive without being too obtrusive and did an amazing job making us feel at home. We started with the onion soup and charcuterie board, both very well done.  The lamb \"burger\", really shaved lamb with caramelized onions and a house bbq sauce was succulent and delicious. The beef tenderloin was perfectly prepared to our order of med-rare and the pan sauce was fabulous. Live music and sophisticated ambiance was icing on the cake. We highly recommend."}
{"text":"A friend and I from out of town stumbled across Modavie one night. We were greeted by Lorenzo as soon as we walked in and he brought us to a lovely table right by a big open window. Great wine selection. My friend got the lamb (which is their speciality) and it was absolutely perfect. Our server was wonderful and Lorenzo came by to check on us while we ate as well. Add to that a view of Old Montreal and live jazz upstairs and you have yourself a really fantastic dining experience!"}
{"text":"Very mediocre food. Onion soup was some of the most bland I've ever had. The steak was equally uninspiring and the salmon even less so. The atmosphere is decent and the service was good but this overpriced touristy joint is best skipped. For $140 for two (we had one of the least expensive bottles of wine) there is absolutely no question better food can be had elsewhere."}
{"text":"This spot is one of the best restaurants to eat at in Montreal.  It is best to get a reservation before going, but on a slow night they will help you out.  The live jazz was great.  Make sure you meet Lorenzo."}
{"text":"Popped in for the Old Port Dinner Specials during the month of January while I was visiting my hometown for 2 weeks. We arrived 30 minutes early before our reservation at 1830 - most tables had reserved signs but since we got in before the big rush we had first choice (and sat right next to where the jazz duo would later perform). They were the highlight of the night.  As a young couple in our mid-20's we received the service we normally get - sub-par. We needed afew extra minutes to order as my girlfriend went to the washroom soon after arriving. Afew extra minutes turned into about 10 minutes. When he did pop by, he seemed annoyed to answer questions about the menu. Not the first time I've experienced a waiter give lousy service because he believes that because we're young people that we're going to not tip appropriately for good service. Carrying on...  We ordered the three courses right away: 2x Mesclun salad with goat cheese on croutons topped with apple cider dressing, 1x Tiger shrimp with a cajun style sauce, 1x Rack of lamb with goat cheese, Dijon mustard and sesame and 2x Tiramisu. 1/2 litre of the Cab-Merlot and a glass of the house wine.  The salad was tasty, she felt the tiger shrimp had too much sauce and the rack of lamb was tasty though difficult to eat (shank may have been the better bet). The waiter dropped off the Tiramisu's and then promptly disappeared. No coffee or espresso offered. He returned when we both finished and asked how it was: I told him flat out that I would have enjoyed a coffee with the dessert but he neglected to ask. He had offered then but I refused as the moment had passed.  It was after that when we waited far too long to pay for the meal. I've learned through the years that paying more doesn't necessarily yield a better meal. This is definitely the case with Modavie as a young couple. The live music was brilliant, food was mediocre (as compared to Lola Rosa where we can eat for a fraction of the price) and the service was disrespectful.  We filled out a commentary card which the waiter glanced at when we left the table though I doubt this will break the view waiters have of Gen-Y. Chicken or the egg? Young people don't tip or young people get bad service so they don't tip?  Young couples/foodies beware!"}
{"text":"Menu selection limited, however all was delicious. Ambiance suitable for date nights in beautiful Old Montreal!"}
{"text":"Came here for a date night with the mister to relieve midterm stress. Since he loves jazz music and i love good food, i knew modavie was a must.    Upon arriving, we were guided by the hostess upstairs towards the jazz bar, the atmosphere was amaaazing. Although i'm not usually a huge fan of jazz, i still really enjoyed every min of the show. The service was also A+, given how busy it was the waitress was relatively fast on refilling our water and bread basket. Let me just say, out of all the restaurant I've been to, Modavie hands down has the best kaizer buns ever. It was warm and crispy on the outside and perfectly soft and tender on the inside. We even had to get a refill because it was that good. The food took about 30 mins, but between the wine and music, it really wasnt so bad.    I ordered the pasta while my boyfriend order the duck confit. The pasta was alright but the duck was DELICIOUS. it was so tender that it literally just fell off the bone. The sauce was also perfectly done.    Overall, we had an amazing experience and i would definitely go back."}
{"text":"Modavie is a great place to get a drink and soak up some really exceptional live jazz...but skip dinner. My fish was (and I hate to slam any restaurant based on one meal) but it was simply terrible. My girlfriends steak was similarly bland, chewy, string and not cooked properly. Such a disappointment.  Having said that the place is really gorgeous, great decor, great atmosphere, great bar. You've a great spot, but really, up those standards at the pass folks."}
{"text":"The lamb, risotto, and duck were all fabulous during our family's visit to him Modavie.  We sat downstairs, but could hear the wonderful jazz music upstairs. It added to the ambience and made for a great night. We have to also mention how friendly Lorenzo was as soon as we walked in and throughout the evening.  We would enthusiastically recommend a meal here for anyone who is in Montreal."}
{"text":"Very pretty restaurant with a lovely atmosphere in the heart of old Montreal. The food was good and the service kind. It was a little more on the pricy side so the good service, food, and atmosphere were expected."}
{"text":"love!! I was in  Montreal a couple of months ago. This restaurant is in old town, has a great ambiance and decor. We split a bottle of wine, reasonably priced, ordered some really good pasta and listened to the beautiful live music that was at the restaurant. My only caveat is that the service was a bit slow, albeit it is understandable because it  was really busy and we had to make a reservation that morning to get a table. The couple next to us kept giving judgy looks, given that the tables were a bit close, but the food/wine/music combo all made up for it. Highly recommend this!"}
{"text":"Loved the atmosphere, the food and the wine. It was all very reasonably priced. I had the pesto penne and my bf had the lamb which were both delicious. The service was also excellent. I definitely recommend it."}
{"text":"Valentine's dinner was extra special here!  The atmosphere is wonderful--beautiful building with exceptional music.  We started with cocktails and the meat and cheese platters as starters. They were both excellent--the cheeses especially stood out.  The lamb chops and duck confit were our choices for the main and they did not disappoint.  Dessert was tiramisu and creme brûlée with lovely coffees and port. The service was extraordinary and we had a wonderful conversation with Lorenzo.  He exemplifies what restaurant ownership should be.  It is very rare to see this type of hands-on customer service in this day and age.  Try this restaurant if you get a chance--you won't regret it!"}
{"text":"I went to Modavie for Taste MTL 2013. I jumped on the occasion because they had a menu with a reduced price. The fact that they have live music playing is something I enjoy a lot. We had our table on the second floor, right next to the musicians, which was nice.  However, I wasn't impressed by the food. The fried calamari as an entrée was ok, the lamb chops were well seasoned, but everything else on the plate was lacking and finally the maple tiramisu did not taste like maple. Also, I was still hungry after the meal.  Overall, very nice ambiance if you want to go on a date, but a little overpriced for my taste. Good side would be that the bar and its selection is nice."}
{"text":"Came here on our second to last day in Montreal, after having been here for a week and not having one exciting meal.  The food was amazing!! Started with fresh calamari, followed by the rack of lamb with goat cheese and it didn't disappoint. Ended the night off with some warm homemade apple pie that was the cherry on top for a great evening in a beautiful restaurant.   I will definitely be back on my next visit during the summer!"}
{"text":"Visited Montreal for a few days and needed a place last minute to celebrate a birthday. Lorenzo (the manager) was gracious and accomendated our party. Made the wonderful dinner perfect! Food was delicious and ambience delightful. Highly recommend."}
{"text":"Visited with my wife and a friend over the 4th of July weekend, on Sunday. The place looked nice from the outside and the reviews were good so we decided to try it out. The place was about 1/3 empty at that time (around 10pm), so we were sure we won't have a problem getting a table. The Asian hostess asked if we have a reservation, and when I said no she said that we can't come in, and that \"the kitchen is closing in 20 minutes\". Really?!? There were plenty of seats, no line, and yet she didn't even bother asking if we are going to eat or just drink, but it was clear she just wanted us out of the door under any excuse. Not sure why, as we looked just like typical tourists that visit that place. Maybe she was a Red Sox fan and didn't like my Yankees hat, lol. But that would have been ok with us if it wasn't for an Asian family of 5 that walked in about a minute after us, and the hostess asked them to wait a minute while she went to get them a table without a reservation (I asked them while she walked away and they said they didn't need a reservation). That's where I draw the line. Its one thing to have certain rules but completely another reason to discriminate and lie to your customers. But its ok, we ended up going to another place in the area which was just as well rated and spent our money there. Thought of complaining to management at first, but in the end realized that they're punishing themselves with this attitude. There are plenty of nice restaurant and bars in the area who don't treat their customers like this."}
{"text":"This was our first time to Montreal and we decided to try Modavie. It was AMAZING!! The manager, Lorenzo was awesome and extremely nice! He made all of us from MOSI (The Museum of Science and Industry in Tampa, Fl.) feel very welcomed and gave us an experience we will never forget! Thank you!"}
{"text":"I'm writing this over 2.5 years after I actually ate here. My friends and I still talk about this restaurant during our visit to Montreal.  The lamb was great, the wine was better, and the atmosphere was even better than that.  We sat at the square bar, and the conversation flowed easily between us, strangers and the staff.  We will definitely be back some day."}
{"text":"My wife and I went here for a Saturday evening dinner while visiting Montreal.  Found this gem on OpenTable before we left; we were looking for an affordable yet romantic dinner spot in Vieux-Montreal.    When we arrived, the ambiance was perfect - Lorenzo seated us at a cozy table overlooking Rue St-Paul.  I had the penne pasta with pesto (added chicken) and my wife chose the shrimp risotto.  Both dishes were excellent and generously sized portions.  The waitstaff were all friendly and genuinely interested in where we were visiting from, what we liked about Montreal, and the occasion we were celebrating (our anniversary).  We also enjoyed the live jazz piped in from upstairs.  We will be back next time we're in Montreal!"}
{"text":"This was a lovely experience.  It says it isn't recommended for kids but the waitstaff was super accommodating.  We have a a toddler and it was fine for us both times we dined there both at lunch and dinner.  Once with a reservation and once without.  The food was really good and in the evening we lucked out on the jazz singer upstairs.  It would be a nice place to sit at the bar and just listen as well as dine.  We tried pasta, lamb and game and all dishes were prepared very well and were seasonal.  The suggestions were always good and the service was always prompt and courteous despite the crazy waits of the high season.  Would highly recommend."}
{"text":"Loved it! On a really cute block, jazz band playing. The service was excellent. Lamb poutine was sooooo good, as were the mussels. Panacotta was homemade and definitely worth the calories! One of the best dinners we had in Montreal!  Would love to come back on our next trip!"}
{"text":"We saw an ad for Modavie and read that it's known for its jazz and lamb dishes.  We arrived without reservations to a small line at the door and no empty tables in sight. We were happy to be lead upstairs to additional available seating. Modavie is romantic and cozy with white lights strung up (for the holiday season)?  I had read that tourists go to Modavie and not locals and that's the vibe I got from the patrons around us.   Our waitress was adorable with a thick, French accent. We started with a bowl of French onion soup and  1/2 a Mediterranean salad (feta, olives, artichokes, smoked salmon on mescaline). Both were really good. For entrees I had the roasted shank of lamb and my husband had a cut of beef he had never tried before. Husband's beef was stringy and not that good but my lamb was excellent. We ended with chocolate molten cake with vanilla ice cream. The word \"orgasmic\" best sums up the dessert.  I really enjoyed Modavie. There was a talented jazz duo playing downstairs that we could hear via speakers upstairs.  It was a nice touch and I would definitely go back the next time I'm in Montreal."}
{"text":"3.5 stars for this cute restaurant I old Montreal. The host (Lorenzo?) was very welcoming and friendly giving us a lovely table on the second floor. The reason I have it less stars was because my salad and entree came out at the same time, after our calamari that was very well prepared. In addition,my risotto was not the right consistency (very dry) nor was it fully cooked. Husband requested medium for his lamb that came highly recommended but was well done. He did not mind it one bit because it was well prepared. It was I. A great spot and the service was good and the ambiance lively, but the food did not quite meet a 4 or 5 star rating."}
{"text":"Generally reservations only. If it's a weekend or holiday and you don't have a reservation, the only choice is sitting at the bar for an overly priced meal.   They say that they are known for thier lamb but I think it's only because it's the highest priced item on the menu.   We started out with the French onion soup which was probably the best French onion soup that I have ever had. Also ordered the octopus salad which was over dressed with oil and had about 5 small pieces of octopus ($15!!).   My bf had the rack of lamb which was maybe at best a solid 2. I had the mussels and fries which was pretty decent but not for the price of $30.   Would come back for the soup but that's it. Not worth the $30-$40 entrees. If it wasn't for the soup, I would give a rating of 1.5."}
{"text":"Word to restaurant. When your client arrives on time for their reservation don't tell them you need the table for another client later.. We eventually were moved however it spoiled the start of our evening. The food was good. Thanks to our waitress who tried really hard to make our dining experience a good one. The music was good as well. We probably will not go back."}
{"text":"Was not impressed with Modavie. The food was just really average and it felt like one of those moments where, oh well, we needed a place for dinner anyway so at least we had something to fill our stomachs from Modavie.  We went on a wednesday night and the live music was good. That's about all that was good about this establishment.   We were ordering drinks and my friend asked for a Aperol Spritz, and the waiter said they were out of it. Then my friend asks for basic sparkling wine, and they were out of that too... I'm not sure how a restaurant can be sold out of sparkling wine, but Modavie was. She ended up ordering an Old Fashioned and I had a Twist Canadien. The waiter comes back with our drinks and we notice that they look a bit light in color. We taste our drinks and it is nothing but water and a tiny drop of alcohol.  We shake it off and order appetizers since we are really hungry.  We order the lamb poutine, beet salad, fried calamari, and mussels. Everything came out relatively fast, but everything was luke warm. The fried calamari comes with a huge salad, but the calamari looks like it came out of the freezer and thrown in the deep fryer. The lamb poutine was okay, but the gravy was cold and just ruined the dish. The mussels came in a huge pot, but tasted very bland and once again it was not very warm  Overall, we were not satisfied and we left after the appetizers. The waiter did not even bother us after we ordered appetizers, but that was a good thing since we did not want to continue our dining experience."}
{"text":"This place was perfect. Romantic, amazing food, great live music and top-notch service. Would highly recommend this place to anyone looking for a date night dinner in Old Montreal."}
{"text":"Incredibly disappointing. We only had one night in Montreal this trip, and were incredibly disappointed we made such a poor restaurant choice.  The weather was fantastic, so we sat outside on a Monday evening. It was not super busy and the waitstaff to customer ratio was sufficient. Our appetizer was brought to us before we even saw a drink, including water. We eventually received water, but the cocktails we ordered when we were handed our menus, did not arrive until our main course was served. My coworker ordered a medium rare steak and received a well done, almost burned piece of meat. I ordered the seafood special, which happened to be sea bass and it too, was extremely over cooked. When the waitress asked about our meals we told her the truth and she said \"bummer\""}
{"text":"Great little spot in old Montreal. We had great service from Sonya, who was super friendly and attentive. The cheese platter was delicious. Our entrees, the salmon and lamb chops, were good but nothing spectacular. Overall, I give it four stars for service, beautiful ambience and overall experience."}
{"text":"We made a reservation here because the restaurant was close to our hotel and our hotel recommended it. It's a busy place with a nice atmosphere and a lot of tables, plus there is live music every night. From the moment we entered, the host made us feel welcome. Our server was also very nice.   The food itself was good, although I wouldn't say it was outstanding. They say their signature meal is lamb, which my date tried and thought was good. I got a pasta dish which was filling and satisfying. We also both got onion soups, which were delicious, and cocktails, which seemed watered down. Overall, an enjoyable experience."}
{"text":"My first Yelp review:  The two-star \"Meh. I've experienced better.\" describes this place perfectly.  The place certainly has a nice decor. We were placed at a cozy, yet slightly cramped corner, facing a nice Ray Charles poster. We were sitting slightly behind the jazz music but could still appreciate it. Not at all a jazz connoisseur, I still enjoyed the music, especially the singer's voice.  At first, the waitress approached our table every ~2 minutes asking if we were ready to order. And no, we were not. After a long day of drinking and being tourists, we appreciate a moment of peace. We were by no means taking a while, but she felt that were slow at everything. At least that's what it seemed like because she then began to take much too long between appearances.  I ordered the filet mignon appetizer. If I'm correct, it was literally greens, olive oil, a little shaved parmesan, and thinly sliced filet mignon. My only way to describe this was average. Slightly bland but a little fatty. Parmesan and greens stole the dish, not the filet mignon, which was disappointing.  I got the braised lamb millefeuille and a glass of the cab-sauv as my main dish. It tasted like a dish from Applebee's or some other American chain, in my opinion. The lamb was moist but just not very good, to be frank. The vegetables were mediocre too. The millefeuille was the best part, as it was slightly soaked in the lamb's juices, making it melt in your mouth.  Slow service, mediocre dishes, slightly balanced by a nice decor and enjoyable live music make this restaurant miss-able on your trip to Motreal."}
{"text":"Went for lunch, no live music. Food an services were excellent. Lamp chops so yummy . Will come back soon."}
{"text":"I had the best lamb chops in the world at Modavie. I'm a vegetarian now, but I have to wonder if I'd be able to stay one if I were to go back to Montreal..."}
{"text":"We wandered in during Formula 1 week and were seated at a high top in the bar area and we loved this spot. With live music, a person signing in the other room was a lovely addition.  My honey ordered the beet salad which was fantastic and I had a green salad to start. He ordered the grilled lamb (they are famous for) and it didn't disappoint. The server suggested I order the wild mushroom risotto with duck and it was incredible. HUGE, and delicious. Check it out and enjoy as there are many items on the menu I could have ordered."}
{"text":"Went for Christmas dinner. Waitress was friendly (which was a change from most people in Montreal) and the food was good. Lamb was delicious."}
{"text":"Terrible service.  Sat at the bar waiting to order while the bartender talked with the musician."}
{"text":"Le meilleur restaurant de Montréal tout simplement! Pas donné mais la cuisine et le service sont excellents !"}
{"text":"We stumbled across this place while looking for a restaurant with live music in old city. A quick check with the hotel's concierge resulted in more personal recommendation.   It was very easy to find and we didn't regret it at all. The service was delightful and very professional. The food was very satisfying with decent sized portions and very nice setting. They claim they have the best french onion soup in all of Montreal - not sure if that's exactly true, but that was definitely on par with the best one we tried before.   Restaurant is very trendy decorated and is very intimate and cozy. Music itself somewhat disappointed - musician didn't sound exactly professional - but they have different musicians each day - you might get more lucky. Nevertheless, we didn't regret it a bit.  Make sure you get a reservation in advance - they do get booked.  They are on more expensive side than most other places around. Still, relatively inexpensive by US standards."}
{"text":"Started with the Caesar salad with bacon and the onion soup, both where surprisingly amazing!! we had a reservation and where sat in the bar area, I was looking forward the the \"live jazz music\" but what they had playing throughout he restaurant didn't sound live and I didn't see anyone playing music so that was a little disappointing- oh well the food was good!"}
{"text":"Excellent food, great atmosphere. But what really outshined everything was our waitress Kim. She had a wonderful personality and went above and beyond to provide us with an excellent service. I would come back just to be taken care of by Kim again. Great service!!!!"}
{"text":"I would have given this a 4-star based on food and ambience alone, but the service was outstanding and elevated that.  We were looking for live music and we mentioned this when checking in at 9:30, so the manager Lorenzo asked the band to continue playing after their 10:00pm ending time just for us.    Decent blues duo (guitar and bass) on a Thursday night.  The food was all good - lamb burger, ratatouille, onion soup.  The wine was an old bottle with sentiment (maybe not stored properly) and the overcooked and underseasoned  rack of lamb were the only underwhelming things.  The server Caroline was a delight and even invited our 12-year old daughter to come and help torch the Creme Brûlée.  It is a beautiful restaurant in Old Montreal and well worth a visit."}
{"text":"The French Martinis were amazing! The chicken talligettele (spelling) pasta was also great. I was visiting Montreal on the whim and this place was right by our hotel (Marriott Spring hill Suites). The manager (Louie) was so sweet. Definitely a go to restaurant. Did  I mention they had live music? Was awesome, and great for a girls late dinner or date night."}
{"text":"I was staying in Old Montreal for some work and had the pleasure of stopping by for dinner.  It was a weekday in the off season but the place was still over half full.  After reading the reviews and per the reccommendation of two staff members I went with the lamb.  It was cooked perfectly and delicious.  I am a fan of lamb to begin with so when I read the reviews I had to head over.  The live jazz was a nice touch."}
{"text":"Disclaimer:  this review is written by a tourist from San Francisco.  In the winter.  Just so you know.  Great spot.  Went here for the jazz, came back for the food.  Modavie is listed as one of the best jazz locations in Montreal.  We went more for the music than food.  The music was good, and they have live music every night.  You probably want to make reservations, as it can be busy, and specify for the second floor (where they have a stage) for the weekends.  Weeknights, the musicians are on the first floor.  We went both on a weeknight and a weekend.  The weeknight musicians were very good.  Original, creative, quality music.  The weekend performance was also good but, oddly, wasn't as much to my taste.  The food was very good.  I'd come back solely for the food.  A small, but good, selection of vegetarian options (can be important) and a great variety otherwise.  Prices were pretty reasonable (a little high, but not that expensive) especially considering the portion size, which was on the large side.  Finally, the staff was great.  Friendly, attentive, and personable.  A great place to go for a romantic dinner or a couple drinks and dessert.  Much better than I was expecting given the touristy nature of Vieux Montreal."}
{"text":"I cannot believe how, after passing in front of this place for so many years, I only got to try it this week. One would expect a meal at Vieux-Port to be very pricey, but believe me, the whole dining experience here will worth every penny.  Reservations can be made online, which was definitely convenient. Upon entering the restaurant, we were immediately greeted and seated. The ambience in the evening was incredible: live jazz available at late night, retro style decor of the 80's, dim lighting and of course, the inevitable cliché of a romantic dinner---candlelight.  We went during Happening Gourmand 2014, and thus I cannot comment on the regular pricing of the dishes, since we had the special three-course menu. What I can say is that the food and the service were perfect.  The service was extremely caring, fast, and efficient. The waiter was very courteous throughout the night, and came regularly to ask if the food was cooked to our likings and to fill my glass. There was only two waiters in the whole establishment, but the service was always up to standard.  The Fried Calamari was very scrumptious, the batter were impeccably seasoned and fried to perfection. The calamari was very fresh, with a crispy and yet not very greasy outer shell. The homemade mayo sauce made it even better. Comparing to the seafood, the other appetizer kind of shy away from the spotlight. The Duck Rillettes was well prepared, quite exquisite, but nothing too spectacular.  The Lamb Chops with Oregano was absolutely fantastic, it was flawlessly seasoned and cooked to a beautiful, splendid medium-rare. The oregano wisely masked the lamb's gamey taste, while complementing other elements of the dish. The Trout Amandine was somewhat average, the fish was beautifully cooked but lacked seasoning. In my opinion, the risotto that came with the trout was actually better than the fish itself, as it was very flavourful with a beautiful texture.  The Tiramisu was succulent, divine, heavenly, perhaps godlike. It was not too sweet,  and the texture was smooth and silky, a plate of pleasure to eat.  I shall comeback soon, hungry for more."}
{"text":"I absolutely loved this place! Easily my favorite restaurant in my trip so far.  And since is my last dinner in Canada, the best dinner of the   Unfortunetaly we came too early for the live jazz (which starts at 7:30) but they were still playing recorded jazz over there speakers, and that definitely set a great mood.   First the service.  I've noticed that in Quebec there is a certain snootiness.  Maybe they are trying too hard to imitate the French, even in their negative traits, but it definitely exists. But not here.  The waiter was super friendly, very fast and really helped the night flow smoothly.   As an appetizer we go the brie baked in something, then with some nuts, some sauce and some pears.  Ok, i'm not describing it well at all, but it was awesome!  For the main course I got the Greek-style lamb. It came with some vegetables, including this beat puree, and freshly made potato chips.  The lamb was absolutely delicious.  I tried a different lamb dish, that also was delicious.  If you come here, get the lamb.    For dessert we tried the creme brulee.  I completely agree with Leighann F. This was not the best creme brulee I've had.  Not even in the top twenty.  The sugar was too thick and the creme was too clumpy.  I'm told that means they cooked it for too long.  The taste was fine, but the texture was just off.   However, I also got the blueberry tea, which it turns out doesn't have any blueberries in it, but is made of Grand Marnier, Amaretto and hot Orange pekoe tea.  It gets its name because it smells and even tastes amazingly like blueberries.  Definitely something I'm going to ask for in the future!   Overall, amazing experience.  Good for a date or a nice evening out."}
{"text":"This was definitely the mistake in a recent visit to Montreal during the Jazz Festival.  Not sure how this place has 4 stars on Yelp given that everything was average at best.  Music? It was okay.  Atmosphere?  The front bar section was beautifully done but you couldn't hear the music and the main dining room was fairly tightly spaced and not exciting.  Cocktails were okay, wine list was okay, and the food was just okay.  The lamb burger was actually better than average and cooked nicely plus it was served with a side of decent fries which appeared to be completely unsalted and we didn't get any condiments delivered to the table until halfway through the meal.  The lamb cavatelli pasta was completely under-seasoned, not great even after adding salt, and had 3 tiny little scraps of braised lamb in the entire large plate.  If you're looking for a tourist trap in Old Montreal, you've found it.  We didn't mean to end up here but we did for one night and it was by far my worst decision on a 4 day visit to Montreal.  If I weren't from New Orleans I might have lower expectations and may have potentially enjoyed this place more, but I easily could have done a whole lot better at home and will long be disappointed by wasting a meal at Modavie while at the Jazz Festival in Montreal.  Oh well, lesson learned."}
{"text":"We had a pleasant lunch outside, people watching. Food was great, our staff was so friendly. A little pricey."}
{"text":"Enjoyed the Seafood linguine  it was fantastic!!! The mustard in the ham platter out of this world! One of the best meals we had in Montreal!"}
{"text":"We saw this place when visiting old Montreal and thought it looked cute so we decided to come back later that evening for dinner. We walked in and were able to be seated right away with no reservations. Walking through the dining room/bar area the place has kind of an upscale kind of feel, with a live jazz band playing. The place is nice and a lot bigger then I expected.   My partner and I both ordered drinks, he had a martini and I had the cucumber tonic. both dinks were very good. We did not order and appetizer but they do give you bread which is always nice! The waitress we had was very attentive and nice.  I ordered the stake frites and was less then impressed. The fries were okay but the stake was eh. It was cooked well but covered in steak sauce or something which I was not really a fan of. The dish was kind of boring, literally just steak with a bunch of fries on the side. Partner had a dish I believe was called chicken supreme which turned out to be pretty good! its nothing I would rave about. Its a 1/2 chicken, baked crispy, served with some potatoes.   The place feels nice. The service was good, but I just don't feel the food was anything to rave about. There are so many good places to eat in Montréal, I probably would not return. Maybe I would try it for brunch!"}
{"text":"Great location. Friendly staff, especially the manager. The live music is great too.   The food seemed like a fancy French diner. They're known for the lamb, and the burger was great. Well cooked, not dry. The duck confit was very tasty and not overly greasy. The fried calamari was great. Also not greasy. And you don't need any of the dipping sauces. I thought it was fine without it.   Don't get the smoked salmon crostini- it was kind of sad with hard bread and a tiny piece of salmon, two capers and a pea size cream. The linguini with scallop and shrimp was meh. Bland, boring. The scallops were tough but the shrimps were perfectly cooked."}
{"text":"We ordered the foie gras and salmon gravlax to start - I highly recommend the foie gras which was delightful with the crackers and paired jam. The salmon gravlax was also pretty good, but seemed just like a simple smoked salmon with a side salad. For our mains, we ordered the duck confit with risotto and seafood linguine - both of which were extremely delicious. My duck confit was so tender and juicy and slid right off the bone. My partner also seemed to really enjoy the seafood linguine as well; I had a bite and it was full of flavour.   The ambience was so romantic and the live jazz music was a nice cherry on top. It is on the higher scale side, so expect for dinner to be around $30-$80 per person (depending on what you order and how many courses)! The only downside was the service, which was decent.   I definitely recommend going to Modavie for excellent French food and a romantic night out!  Tip: If you're going in the winter, you can hang up your jacket in a coat room at the front of the restaurant."}
{"text":"Just stopped in for a cold beer and a snack and we're thoroughly impressed with the service and the charm. We'll be back for dinner when we return to Montreal."}
{"text":"Great place, nice decor, nice waitstaff and very good food. We were stuffed from eating all day so we had an onion soup each (would have liked more cheese on top) that was very good. For mains we had the duck confit which my husband LOVED as well as the green salad with goat cheese. Both were great and we left totally happy with our choice."}
{"text":"What a journey, we walked up and down all of the little streets in old Montreal looking for a restaurant with pasta, a pasta without duck, rabbit, or some other wild pheasant. We walked for over 2 hours. I almost gave up hope until I read Modavie's menu which had lots of vegetarian pasta options.   Our server was very attentive and helpful and our food was delicious. I loved the decor, I loved that the windows were open so I could people watch while I ate, and I loved the music.  Would eat here again!"}
{"text":"Good food, efficient service, jazz is a nice extra."}
{"text":"shitty restaurant. they served frozen food thats not seasoned.. the service and ambiance are nice but the food.. eeesh"}
{"text":"Lovely evening with bunch of nice people. Had the steak with fries and was completely satisfied. A bottle of California Cabernet Sauvignon, beets salad with goat cheese and a smooth cheese cake finish! This all came with some jazz, played and song by a lovely band accompanied by dancing customers and staff of the restaurant. Could not ask for more. Will visit again for sure. By the way we visited during an event offering a less expensive menu. Staff were nice and friendly, although it was packed and very busy service was quick and satisfactory."}
{"text":"It's in Old Montreal, aka tourist central, so it's overpriced but still rather tasty. Our waitress was extremely accommodating, especially considering it was a busy Sunday night and I'd brought two kids -- one on the picky side -- to an upscale restaurant. But she was fine with his simple choices, and even made recommendations to help us out.  For appetizers, my niece -- the foodie -- shared goat cheese filo dough creations topped with a sweet, nutty sauce that we both scarfed down. My pasta was fine -- nothing to write home about, just fine. Sames goes for the kids' meals, although there were certainly ample portions.  I wouldn't recommend Modavie for a resident, but I think we lucked out with our tourist-zone pick."}
{"text":"Better than expected. The food is good, but unmemorable (although the lamb might be better). I would recommend this for a tourist and/or someone looking for a more romantic dining experience."}
{"text":"Montreal is a city with many different parts to be seen.  While on vacation with my wife we were walking around Old Montreal.  Taking in all the historic sites and amazing views when it hit us, we were both hungry.  What is one to do, pull up Yelp of course.  Looking for something a little extra we settled on Modavie Resto-Bar.    When we walked into the restaurant we were taking by the old world charm and beauty.  The building itself was clearly from a different time, like much of Old Montreal.  We were sat upstairs at a beautiful window side seat.  It was clear that they were going to be having live music, which was a win in our books, and it looked like the musician was nearly ready to start playing.  However, in the hour that we were at our table not a single note of music was to be heard.  When the server came to our table she gave us water and helped to explain the menu some, as well as lay out the nights' specials.  When she left I notice that there were some black specks in my water. I assumed they were pepper from them recently filling all the shakers, as they were all filled to the brim.  Other than these small hiccups the service overall was great.  The food, oh the food.  The part that everyone looks forward to in a restaurant.  We got a complimentary basket of bread.  The bread its self was quite good, soft and chewy in the center with a delicious crunch crust.  The butter on the other hand was rock hard and completely non spreadable. We ordered an appetizer of fried calamari. When it came to the table we were shocked to learn that it came with a side salad, which was very good.  The calamari on the other hand, was dark in color and rubbery in texture.  Clearly overcooked and at the same time lacked seasoning. The paprika mayo dipping sauce was the saving grace of the appetizer for sure.  For me I ordered the steak frites.  This is one of my favorite dishes, I particular enjoy the contrast in textures between the soft tender steak and the crispy fires.  The fries were perfect, salty and crispy just as one would hope they would be.  The steak, which I order medium rare, was close to medium.  It looked as though it had been cut several times, maybe to check the temperature that they missed the mark on.  Overall the steak was tender and moist, however, it too lacked seasoning.    Overall, Modavie is a nice restaurant for atmosphere and service.  The food on the other hand is not as good as the price would lead you to assume."}
{"text":"We had found this restaurant online prior to our trip to Montreal and wanted to visit.  So, we stopped by in the afternoon to make a reservation.  We were given a very nice table by a window (great for people watching in the Old City) and within eye- and ear-shot of the music.  Both my husband and I had trout almondine.  Before we ordered we were advised by the server that it wasn't white trout, but a salmon trout - which we really enjoyed.  Veggies were very nice as was the wine.  Normally we don't linger over coffee and dessert but the ambiance and music were so nice that we ordered coffee/cappucino and a yummy chocolate dessert.  Service was also excellent. Both the maitre d' and server were friendly, cordial, and bilingual.  I would recommend and return on a future trip."}
{"text":"At the core of Old Montreal, excellent food and great ambiance. Live music every night and the staff was friendly with great service. Would recommend to friends!"}
{"text":"My boyfriend and I stopped in here for an afternoon drink and snack.   We had been walking around the old port and came across this beautiful little corner spot.  The exterior is very charming and inside even better.  The interior design and details were well thought out.  The waitress was very kind and accommodating and found us a nice table off to the side.  Our waitress was very attentive and pleasant and explained the menu well.   We ended up ordering a French onion soup, Charcuterie Board along with two glasses of wine.  Food had lots of flavour and the wine was lovely.  It was a little on the pricey side, however location, decor, food quality and service made it worth the $80."}
{"text":"AMAZING! This was my first visit to Montreal and I decided to eat here after reading other yelp reviews. The staff was so friendly -very accomodating of the fact that I don't speak french. I got a duck dish and panna cotta for dessert. Both were amazing. One of the best meals I've ever had."}
{"text":"Mitten in der Altstadt von Montreal gelegen. Als ich den Concierge des Hotels fragte, welches Restaurant er mir in Montreal empfehlen könne, war die Antwort ganz einfach: Alle. Na gut,.....schliesslich konnte die Anzahl von etwa 6.000 Restaurants doch deutlich eingegrenzt werden, und schliesslich machte das Modavie das Rennen. Es ist eine lockere Mischung aus Restaurant und Bistro/Bar, die Abends geöffnet hat. Ab 19:30 gibt´s Live Musik. Die Gerichte sind an die Französische Küche angelehnt, aber es gibt natürlich auch Burger. Zusätzlich wird ein 3 gängigesTagesmenü angeboten. Die Qualität der Speisen ist einfach nur lecker, die Weine passen nach der kompetenten Beratung auch dazu, und die Bedienung ist freundlich und flott. Nach dem Nachtisch gönnte ich mir noch etwas Exotisches: Eiswein aus Äpfeln hergestellt. Eis-Cider sozusagen. So etwas gibt´s wohl wirklich nur in Kanada. Probieren lohnt sich. Ein weiterer Besuch sicher auch!"}
{"text":"A wonderful little restaurant in Old Montreal that was definitely worth the walk from Centre-ville where our hotel is located.  The menu covered a wide range of tastes that our dining party was looking for; fish, pasta, lamb, and chicken.  I had the goat-cheese chicken with fresh vegetables and risotto.  Was this delicious. There were no complaints from my other dining partners about their meals either.  They also had a wide selection of wines from all over the world.  I finished the evening with tiramisu, which was tasty, light, and fluffy, and some coffee. The waiter even took the extra step to make us fresh coffee.  Overall the evening was wonderful with live jazz filtering down from upstairs. The staff was excellent and kept our water glasses filled.  This is one definite spot I would recommend in Old Montreal."}
{"text":"Fantastic meal! Everything was wonderful. Spaghetti, mussels, quinoa, beet salad and calamari. I know it's touristy in this section of old Montreal but thus place will not disappoint!    The waitress (Rachel) was fantastic. I'd recommend this for dinner!   Does have live jazz music so if you aren't into that try to sit in front room rather than main dining room.  Make a reservation!"}
{"text":"Hands down the best lamb chops I've ever had. Perfect seasoning (Rosemary of course) and perfectly grilled to medium. I also had a bite of the mussels and even though I'm not a huge fan of fennel, it was subtle and worked with the mussels. Overall, great experience and great meal."}
{"text":"I came here while in town on my \"mini-moon\".  I had wanted to try this place since we walked by it on our first night and tried it a few nights later.  It was good but didn't blow my mind.  I had the lamb chops and it just seemed like a smaller portion for the amount of money.  If I came back to Montreal I'd probably pop in here for drinks/apps but do dinner elsewhere."}
{"text":"I had the duck confit on beans. The duck tasted good but the beans tasted like it was out of the can. The dish overall was very salty. I tried my friend's grilled lamb chops, it was ok. Another friend had their chicken supreme but the chicken was too dry for him.  The place looks nice; we sat beside a window in the summer and it had a view of old port. They also have a patio."}
{"text":"I recommend but correct the category - it's not really French, more like Mediterranean.  Lamb is the specialty.  This was my second visit.  Great lamb chops, rack of lamb and pasta, and nicely priced wine list (enough under $60).  The interior is exposed brick of a historic building, so that is charming.  The downstairs may look full but the upstairs is expansive.  It's in a tourist district, so I can understand if some others had an off experience when the place is full.  Our server was a sweet and professional woman, who did her job very well."}
{"text":"Excellent resto dans le vieux port de mtl ! Les spaghetti bolognese etait tout simplement delicieux et les moules au pastis etait incroyable aussi ! Le mettre d'hotel qui est sur place est tout simplement exceptionnel, il s'assure que tout le monde sois satisfait et il fait presque du divertissement en meme temps !"}
{"text":"It took quite a bit of work to find a restaurant that could satisfy all three of us traveling to Montreal for a weekend night stay.  If you are really into foie gras, then Montreal restaurants are waiting for you...   However, we weren't looking for foie gras, but a menu with a wide selection of pastas, meats, and seafood from a restaurant with good reviews.  Modavie, it turns out, was all that and more.   We were able to make a reservation for 8:30 p.m. even though we didn't call until 2:30 that afternoon.  Even without the reservation, I think the wait would have been minimal.  Tables were turned over fast, but at no point did we ever feel rushed.  Upon arrival, we were sat at an amazing table in the corner of the second floor, overlooking Rue St.-Paul and all of Old Montreal.  We had jazz on one side of us, the beauty of Vieux Port on the other, and a lively but not overly loud atmosphere all around.    Our waiter was personable and friendly, with a thick French-Canadian accent.  He was helpful and attentive throughout the service, even going so far as to tell me NOT to get the Osso Bucco because he thinks it is too tough and can't recommend it.   I ended up getting lamb, a house specialty, but more on that later.   We began with cocktails paired appetizers of French Onion Soup Gratinee and fried calamari.  Both were very solid starts to the meal, with the soup being very beefy tasting with satisfying layers of cheese and toasted bread.  The calamari were fried to a dark golden brown, but stayed tender and were served with a spicy marinara and coconut milk-lime sauce.  Though both were good, they ended up being \"only\" average compared to the rest of the meal.   Among the three of us, we were able to try three different proteins prepared in three very different ways.  Tagliatelle with chicken and pancetta in a truffle oil sauce was as savory, rich and umami-filled as it sounds.   The \"AAA+ Angus hangar steak with a cabernet sauvignon wine butter sauce\" was nearly as equally decadent, with the wine and butter sharing equal billing on the sauce complimenting a perfectly grilled and sliced hanger steak.    The highlight for me was my own meal, as I went with the specialty of the house, lamb.  After sorting through the five selections, I went with the rack of lamb with goat cheese, Dijon mustard and sesame seeds.  The waiter informed me that it was the best one on the menu, and he wasn't kidding - it was the best lamb I've ever had anywhere.   The meat was perfectly cooked and the flavors blended wonderfully.  The small round of toasted goat cheese served over fresh vegetables paired with it perfectly.   We partnered the meal with a Mission Hill 2007 Cab-Merlot blend  which was pleasantly spicy.  The fantastic meal ended on a high note, as we were able to watch the fireworks competition display right from our table as we enjoyed apertifs and three lovely desserts: creme brulee, tiramisu, and chocolate fondant (warm chocolate cake).    From the service to the location, to the food, this is a meal that we will be talking about for a long time, recalling very fond memories."}
{"text":"Food: Beef Tartare - 4/5 French Onion Soup - 3/5 Lamb Chops - 4/5 Mussel frites - 3.5/5 Steak frites - 3/5 Catch of the day - 3/5  Ambiance - 4/5  Price - 4.5/5"}
{"text":"There wasn't much I didn't like about Modavie. The food was delicious, the service was excellent. I had the lamb and switched my potatoes for truffle mash, changed my life. The lamb was cooked perfectly. The atmosphere is fantastic. In the heart of Old Montreal, the live music was so much fun. We didn't once feel like we were being rushed, we stayed for several drinks after our meal.  Will go again for sure."}
{"text":"Classy elite ambience! Bartender was really sweet. We just had two drinks - during our bar hopping at the old port!"}
{"text":"We arrived in Montreal for the Jazz Festival hoping to have some of the fine French food that we'd heard so much about. With so many to choose from we settled on Modavie based on location and some of the good reviews. At seven on a Wednesday night the place was pretty empty. Service was fine but the food didn't impress, especially for the price. My wife had sea bass and I had their recommended signature dish, rack of lamb. There was nothing wrong with either of the dishes, but there was also nothing special about them. My lamb was served with some sautéed green beans and a stack of potatoes with goat cheese. Neither had much taste at all. Even the lamb was bland. The sea bass looked and tasted like trout. For the amount we spent I would expect a far better meal."}
{"text":"What a wonderful surprise!!  The atmosphere and the food were great. If you're in Old Montreal this place is well worth a try. We will be back."}
{"text":"Great food and service.  Warm and cozy ambiance located in the heart of old village of Montreal.  Has cool bar area.  Food is delicious and the service is great.  French onion soup was yummy and the the mussels were amazing.   The broth was so good that I finished it off by dipping my bread in it."}
{"text":"We went on a weekday evening and it was very crowded. There was a live music which was in the level of the place (professional but not very tasty chosen).  The menu is nice and has quit good option although for a such place it is expected to have more options on the menu. There was no vegetarian or vegan option. The service was not bad but could be faster and more efficient. A friend ordered medium rare steak and got overcooked one which they accepted their mistake and brought her a another dish. Fish of the day was nice but a little bit overcooked and dry. The wine menu was extended and had a lot of good options."}
{"text":"I love this place! I visit every time I am in town. Jazz music (different musicians each night) starts nightly at 7pm- a tad pricey, but worth it! Best to split a bottle with friends- glass service is expensive! Definitely make a reservation for lunch or dinner. Staff is very friendly and fun! Great place to unwind- romantic atmosphere"}
{"text":"Had a wonderful dinner here last night. Service super attentive and friendly. Menu was varied, food was delicious. Lamb cavatelli fantastic, highly recommended. Salmon simple but cooked nicely,tasty. Beet salad, calamari great. Lamb poutine was really good. Lamb hamburger excellent. (Went here with the family so got to sample a lot!) Drinks were very good, tiramisu dessert nice. Entertainment was an unexpected bonus:jazz singer starting at 7 pm- great music, not too loud to affect conversation-really added to what is already a wonderful atmosphere. Restaurant has a great ambiance. Great location -near heart of old Montreal but not too loud some other streets. Prices were very fair. In all, the family and I loved this place."}
{"text":"The food was okay, not great. We had the tagliatelle with lamb and the duck confit with mushroom risotto. The service was attentive. We sat upstairs to listen to jazz, but a band was also downstairs that was more lively."}
{"text":"Just came from this sweet little gem inOld Montreal, where I had the best lamb chops in years. So tasty! Started with some fine smoked salmon crostinis- mmm! - but the chops beat all. Definitely a place to seek out!"}
{"text":"Great food, friendly staff and terrific live music. We are visiting from the US and these folks made us feel right at home. I would definitely go back."}
{"text":"Ambiente charmosissimo!!  musica muito boa... A comida... Minha nossa.. Maravilhosa!!!! Super recomendo..."}
{"text":"My family and I came here our first night in Montreal. Our hotel was right around the corner and it was very convenient. At 8:30pm on a Tuesday we were seated right away. The atmosphere inside made me think of a French cafe or wine bar. Very fitting! The ceiling was hammered copper and the walls were covered with posters of French art. The food was pretty good! My father and I both had the cream of cauliflower soup, which we both enjoyed. My husband had french onion soup and loved it. He didn't love his pasta entree and my only option was a salad as a vegetarian. My mother loved her duck confit. The creme brulee dessert was just okay. They play live jazz music at night as well and whomever was there that night was wonderful! The servers were very wonderful: funny, inviting, and on top of things. The prices were reasonable. The hostess seemed to be slightly annoyed with us when we walked in, but I can't really speak to what that might have been about. I would recommend this place to people for sure."}
{"text":"very good restaurant...we both had the rack of lamb with goat cheese...excellent. we started with white bean and octopus salad and the salmon blini ...both quite good. nice wine selection, loved the bluesy band. only thing not great was the cheese plate..a bit unimaginative with Asiago,  Fontina , gorgonzola, provolone....but lovely evening overall!"}
{"text":"I found Modavie on a few different travel sites with excellent reviews so we had to try it - and it exceeded our expectations. It is located near the port where all the main shops and lively streets are. We were greeted at the door by Lorenzo. Lorenzo was the kindest person and made sure our service was nothing but perfection from the moment we walked in until the moment we left! The waitress we had too was very excited about the food, answered our many questions about the different meals and was always attentive. We had French onion soup to start which was delicious. Our main meals were the rack of lamb, duck confit, and mushroom risotto. It was all so beautifully presented and very tasty! They also have Jazz nights every night of the week, sometimes on their second floor and other times on the main floor. Even though we didn't sit where the jazz was that night, we could still hear the performance and it added to the experience. Overall the place is beautiful, the food was excellent, and best of all, the service was perfect. This is a MUST in Montreal!"}
{"text":"Lovely restaurant and wine bar! We only went there for wine, but the host, Lorenzo, was kind enough to offer us seating in the restaurant/lounge area where we could listen to the live jazz music (which is usually only reserved for those having dinner). Wine was affordable and delicious and the bartender helped guide us to the type of wine we're looking for. I would buy an album of the musicians in a heartbeat. Overall a great place for a low key but classy night out. Can't wait to come back for dinner as well!"}
{"text":"2nd time here in a week while visiting Montreal so that should tell you something. Live music is a plus. The duck confit with mushroom risotto was excellent. The tiramisu is one of the best I have had."}
{"text":"The food, service and drinks were easily a solid 4- everyone loved their food (however, the accompanying risotto needed more flavor), but steaks were perfect, as was my fish. The location is also fantastic and right in the heart of Vieux Port. This was our last big meal of a family vacation. As we were a large party, we were seated upstairs. The downside to this? We were competing with the volume of 30+ very boisterous diners, perhaps all co-workers? Their volume, coupled with the high ceilings, made for an almost deafening experience. It's a shame because it hindered our ability to have conversation that didn't include shouting."}
{"text":"Very lovely, charming décor, old-style restaurant in the heart of Port Vieux, we arrived as they were opening up.  Did not know they served up live jazz at night, I missed out! Anyway, while visiting Montreal, I wanted to try my first poutine, I guess l found the right spot since they make their version with a generous portion of braised lamb. needless to say, it was awesome!   Wife loved her French Onion soup, and her cheese platter. Overall experience was fantastic, I recommend this if you are a local, or visiting the city (first time, for the F1 race). Tres Magnifique!"}
{"text":"I had dinner here with my parents, husband and two-year-old son. The concierge at Le Saint Sulpice recommended it to us as a family friendly restaurant. I was pleasantly surprised but just how family friendly it actually was. They prepared a smaller portion of spaghetti for my son, provided a booster seat and even gave him a set of crayons to draw with during dinner. Our waitress was very sweet and the owner stopped by our table a couple of times to make sure we were enjoying ourselves. I really enjoyed the live music, very much the highlight of our evening. The restaurant is walking distance from our house so I for sure intend to go back."}
{"text":"This place is really very good! I has steak, she had the house specialty, lamb - both were done to perfection. For desert we had Creme Brule,  again it was exceptional. Lorenzo was over the top with his hospitality and Yen is very knowledgable with the menu and her recommendations. We will be back and highly recommend to anyone looking for a great experience in dining!!!"}
{"text":"After our uber disappointing Joe Beef Experience, went back here for a dinner.  (i was here a few night before, and had the perfect rack of lamb. wine was excellent and we finished off the meal with a great 30 year port. What a fabulous experience.)   So we went back.  we had the mussels Poutine and the Lamb Cavatelli and both were incredible.  great wine, amazing service (thanks Rad!)"}
{"text":"Delicious food and awesome specialty drinks!!! French onion soup is a must!! Loved this place and will be back again very soon!!!"}
{"text":"Great wine selection, friendly staff. Wandered in here. No doubt, viex-Montreal is tourist central and this place is the jazz tourist bar. But the lamb is good. Really good. It isn't cheap, but it is tasty."}
{"text":"I got the pleasure of dining at Modavie during my business trip to Montreal. Great restaurant: wonderful personalized service, incredible food and lovely jazz. Lorenzo personally checked in on us multiple times and was great at recommending dishes and wine. Everything he suggested was amazing. The live jazz musicians added to the atmosphere of relaxed fine dining."}
{"text":"This was a tasty restaurant, with  friendly service, nice atmosphere (live jazz every night) and a great location! A good spot to try if looking for a nice , but not Ayer elegant dinner in downtown Montreal."}
{"text":"We went here on the recommendation of a friend. We were excited to eat lamb, their signature menu item, and to here the live jazz singer that was performing. We booked reservations online (so convienient) and my friends and I got dressed up and headed down to old Montreal for a delicious meal. Or so we thought.   When we arrived at the charming bistro, we were whisked away to the upper level right past where the live singer was playing. Upstairs we could faintly hear the music, and shortly after they seated a large party not far from us and we could not hear the music at all.   Their warm herb filled rolls dinner started with were lovely and warm and delicious. My friend ordered onion soup and while she thought it was tasty, she described it as \"nothing to write home about\" my friend raved about both his foie gras appetizer and his duck confeit, while I ordered the lamb with goat cheese and potatoes. The goat cheese was incredible! Creamy and earthy and fragrant. The lamb was perfectly cooked, but lacked any real flavor, still I enjoyed it.   My friends and i agreed that while it was okay, it was nothing epic or amazing and that our $80 a person (we did order two bottles of wine as well) could have been spent better."}
{"text":"If you come here, order their lamb. Its what they're known for and it's pretty damn good. I don't particularly like lamb but took the dive. Order their rack of lamb and was blown away by how good it was. Tender, juicy and not overwhelmingly gamey. I wish I had time to come back for the lamb chops. The risotto was so-so."}
{"text":"I cant say enough good things. Our waitress was absolutely lovely - attentive and sweet without being overbearing. The soup of the day, cream of broccoli, was divine, and definitely called for on the snowy cold evening. I had a duck breast - perfectly cooked, with excellent sides. I subbed risotto (personal preference), and it was perfect. Excellent portion sizes as well. My mom had the chicken supreme and loved it, and she's very picky. All in all, a wonderful atmosphere and experience for our last night in town! Definitely a must. Pro tip: make a reservation, well in advance."}
{"text":"This place is utterly charming with a warm vibe that's very inviting. We drank some yummy wine and listened to the live music which was very lively and lots of fun. I wish the food was amazing to match the ambiance but it wasn't-- although it was certainly solid and the service was great. Definitely worth the visit!"}
{"text":"In Montreal for our anniversary weekend on Saturday Sept 25th.  The place was recommended to us by our hotel as it has live jazz music 6 or 7 nights a week. Modavie is a very nice restaurant with a full service bar. It effectively has 2 dinning rooms and you can hear the music throughout the place but if you want to see the musicians you need to sit in the main one facing the side street.   My wife and I both had different fish plates and they were both excellent. Service was friendly, efficient and atmosphere overall very nice. My only disappointment was we were told by the hotel that music played until midnight but it doesn't, it ends around 10 pm. Otherwise I would highly recommend Modavie if you are in old Montreal."}
{"text":"Lovely evening in old Montreal. Great food, friendly waiter staff and live music. Wish it was just a short vacation stop. Would love it near home. Would go often."}
{"text":"We chose this restaurant according to the reviews and I have to say that it was EXCELLENT. We have two kids so it is important to find a kids friendly restaurant. The receptionist helped us to have a seat outside the restaurant shortly after arriving.  Our server, Josiane, was really nice, polite and friendly. We ordered onion soup as starter and lamb chops which was the signature of the restaurant and also the steak with peppercorn sauce for the main course and All of them were really delicious.  We ordered spaghetti bolonaise for kids and it was the first time that they had a kind of homemade spaghetti in a restaurant!!! They really enjoyed their meal. I highly recommend this restaurant."}
{"text":"We had a delicious meal here on our last night in Montreal.  As a family of 6 we tried the French onion soup and charcuterie board as ten starters and several different main courses - tuna Niçoise, filet steak, risotto with duck and lamb chops.  The children had pasta and the meatballs were really big.  Desserts were tarts tartin and crewmen brûlée both great.  Our waitress was wonderful.  Always present but not too much, gave great advice on the menu.  There was enough jazz and blues music without being too much.  Overall it was a great night and I highly recommend booking here.  The female manager came by at the end of the night to check on our experience which was much appreciated."}
{"text":"My girlfriends and I went to Modavie for the occasion of Happening Gourmand. Unfortunately, their menu for happening gourmand weren't as appealing compared to other restaurants who are participating in that event.   So we went outside of the Happening Gourmand menu. The 1st service was good and quick then our waiter finished his shift, and the next waitress took over, sadly, the service was lacking speed and help.   Food wise, I started with onion soup; it was delicious. For my main meal, I had salmon tartare with fries. The flavor was little bland for me, and fries were over cooked. Then I got the cappuccino and tiramisu. It was the best tiramisu I ever had. Super light and delicious.  The place is beautiful and rustic. The ambiance was fun and energetic.   I hope next year, their menu for Happening Gourmand would be slightly better."}
{"text":"After walking around Old Montreal looking for somewhere to eat with a good atmosphere, we stumbled across Modavie. They had live music but without reservations, we were seated in a section that didn't see the band, but could still hear the music. We had the mussels, Caesar salad, and seafood linguine. All dishes came with a generous portion, and the waiter would come by with heaping amounts of Parmesan cheese (who says no to extra cheese). Though touristy, on a rainy Tuesday evening, Modavie provided the perfect setting for a spontaneous night out."}
{"text":"Came here for a birthday, arriving around 6:45 on a Saturday evening. There were few people but we were still waiting for our dessert at 9.  The food was mostly good, as I'd heard. I started with fried calamari, which were nicely cooked, though the sauces could have been a little more adventurous. The birthday boy had foie gras, which came with a pear compote (nice complement), and a piece of olive-oiled herbed toast, which actually detracted from the foie gras, but never mind.  Our mains were the catch of the day - a fillet of dory, served with a super creamy, delicious risotto; the lamb rack with sesame seed crust and goat's cheese (the meat was beautifully cooked); and my 11yo had the guinea fowl in honey and lemon (the flavours complemented the texture and taste of the meat very nicely). The portion for my child was actually perfect, but I'm sure I would have felt a tad cheated as an adult...  We had crème brûlée (perfect texture with the merest hint of lemon, just as it should be, and the correct, tepid temperature under the sugar), tiramisu with kahlua (light, creamy, very coffee-flavoured but not that authentic), and tarte tatin with ice cream (lovely caramelised apples that were cooked separately from the pastry apparently, but delicious anyhow) for dessert.  We drank an Italian Sangiovese with our meal, which was excellent, and had started with cocktails: a French mojito (yum) and a Cosmo with ricard, which had a slightly medicinal taste... We finished with great espressos that were strong and smooth.  But the service left much to be desired:  - We got our cocktails quickly, but weren't informed of the soup of the day or the catch of the day before we asked. This meant we weren't ready to order when the server came over. So we had to wait again.  - We didn't get bread though I saw every other table did.  - We ordered the wine with the meal but, instead of getting it immediately so it had time to breathe, we had to ask for it once we'd received our hors d'oeuvres. The wait between dishes was long. We noticed this despite having gift-giving to occupy some of the time.  - We did not receive any apology at any time.  In retrospect, it seems our server had a greater number of tables to wait than the other two servers. This tells me it's the restaurant's organization that is to blame.  I'd really like to have given this place a better review. I loved the live jazz that adds ambiance but at no time interferes with talk, as well as the absence of the ubiquitous Montreal TVs. The food was good. The wine selection was wonderful, and the wine we chose was excellent. But going out is a total experience. If it's just for good food, I can eat that at home..."}
{"text":"Old Montreal charm with delicious dishes. My group enjoyed their wine selection as well as rack of lamb and sea bass special. Top it off with silky Tiramisu,  and it was a memorable evening. The waitress was spot-on with great recommendations!"}
{"text":"I recently had an early Sunday dinner at Modavie while visiting Montreal.  It's in a nice area of town in Old Port however I was underwhelmed by my experience here.  The service was slow.  The French onion soup was OK.  I ordered the lamb chops as my main dish since the menu said it was their specialty but there was nothing special about the dish.  It said it came with potatoes and seasonal vegetables but it was a pitiful portion of each.  Perhaps this place is more lively later at night when there is live jazz.  Unfortunately, we couldn't stay for that since we had other plans."}
{"text":"This was my favourite stop during my trip to Montreal. The atmosphere of this place made it an enjoyable night. We came without a reservation and were seated immediately. The room we were seated in was the one that had the live music in. The other guests were getting into the music, dancing and singing along. I ordered the carrot risotto and it was DELICIOUS! The portion seemed small at first but once I ate it all I was stuffed and couldn't eat it anymore. We were in and out of the restaurant in about an hour and a half. This restaurant was such a pleasure to go to and I would definitely recommend it to everyone!!"}
{"text":"Ils n'ont plus de bière en fut malheureusement."}
{"text":"I've been twice. The first time had duck and something else and it was fantastic, worthy of 4 stars at least.  Next time I had a steak and was very disappointed. 2 star disappointed. The rest of the table enjoyed their meal so I will give a 4 star review but I am concerned if the plates are not consistent. Calamari is nice."}
{"text":"Live music, intimate atmosphere, good food.  Chose here because of the live music and it didn't disappoint. I had the lamb because Lorenzo said it was their specialty, and it was excellent. My gf had the seafood pasta and she liked it as well."}
{"text":"This was my first time in Montreal and I'm glad someone suggested this gem of a restaurant.  I'm not a big lamb person, but the lamb chops here were delicious!  I had to protect them from my coworker after he took a bite!  My coworkers and I went a second time and ordered the lamb burger, braised lamb, and steak... all were spectacular.  The great live jazz didn't hurt either.  This place is a keeper!"}
{"text":"This was near our hotel and we loved it! Great lychee martini, gluten free pasta and ambiance. We sat by the roaring fire and had a great night. Just a caveat--they sometimes run out of GF pasta but they do have other menu options."}
{"text":"This restaurant was a recommendation from a friend. We arrived and were seated upstairs. We asked to switch tables as we wanted to be closer to window - no problem. Once we were seated we were asked what we would like to drink the waiter took our order and we didn't see him for 15 mins so no water or anything and it wasn't that busy. We had the foie gras as a starter which was amazing. For our mains we had the lamb burger and lamb shank and both meals were delicious. However the service was poor but food was excellent. It was also very hot and no air conditioning"}
{"text":"We walked in off the street because the mussels looked incredible and asked them for a reservation in 30 min for 5 and we wanted a window seat. Lorenzo said no problem see you in 30 min. We came back and the table was set for 5 by the window as promised.   This restaurant gets really busy but he took care of us. Our party of 5 included a 5 year old but it was no problem. Lorenzo was really great with my son and made us feel welcomed the entire evening.   The food was as good as it looked and the service was great. Next time I'm in town this is a go to spot for us. Go check it out!"}
{"text":"Had a really good time at modavie!!!! Jazz music, good wine and excellent French cuisine with great ambiance!!! The lamb was very savoury one of the most delicious I have had and appears to be their best dish ;) the waiter was also super helpful recommending the right wine to couple our dishes!!!"}
{"text":"Oh wow.. this was a treat. I don't think there is anything you could order you wouldn't happy with. Impressive service and plating! The music was great, the atmosphere wonderful. The vibe wasn't to much but yet electric at the same time. Four of us from the office went (3 of us from Atlanta, GA) and really enjoyed this experience."}
{"text":"Come here for: cozy spot when you're freezing your a** off on the rue - caveat I came in for a tea and dessert only   Food: I was disappointed with the creme brûlée. It was so shallow that the ratio of sugar top to custard was off. I could only taste the sugar and the custard itself was missing   Ambience: actual roaring fire! There is also a large bar   Service: nothing to complain and nothing to write home about"}
{"text":"We just popped in on a Friday right before dinner rush for a drink at the bar. Of course, being in the service industry and on vacation that turned into quite a few drinks at the bar.   Great wine list - I had the rosé which I liked a lot. It wasn't too sweet and had a deeper mouth feel than a lot of the rosés I've had before.   The bartender was super friendly and she checked in often even though she was prepping for dinner service and continuously got new customers at the bar who seemed to have the same idea as us. The atmosphere around the bar is great, it reminded me of places here in Raleigh that I like to spend time at."}
{"text":"We stopped in and had a couple beers with the charcuterie boards (cheese & meat).  They were wonderful, best duck pate we've ever had.  We didn't even like duck pate until this day.  If you've never had, this is the place to try it."}
{"text":"This was such a cute bistro in the old Port area. You can do some great people watching! We got the beef tartare, French onion soup, and duck poutine. Would highly recommend the beef tartare. It was definitely the highlight of the meal. The large portion was plenty for two and was super tasty."}
{"text":"Horribly busy during the weekend rush. The service was absolutely terrible then. I would highly recommend they hire more staff during rush days.  That said, the food is as expected. They feature a simple French bistro menu with nothing fancy or special.   The prices are slightly below average for this part of town."}
{"text":"Just had dinner at Modavie this Saturday night. I made a reservation so we were promptly seated in the upstairs section. They play live jazz between 7-10pm on the upstairs level so it was a lovely setting for our dinner.   We ordered a couple cocktails to start, one French Mojito and a Cosmopolitan, which Modavie makes slightly different adding Cointreau-which for me left a strange taste almost like black licoroce. I wasn't a fan of that cocktail.  I started with the bean and octopus salad which was large enough for toe people to share. The octopus had a lemon zest marinade and was delicious. I do have to mention it was served cold I would have preferred a grilled version. The salad was overall a good starter with the accompaniment of warm bread and butter.  My boyfriend had the pasta with chicken and pancetta and I ordered the catch of the day- sea bass with risotto and vegetables. I didn't enjoy either entree. The pasta was a generous portion but to me felt very slimey and I didn't like the roasted peppers- but I think this is my preference.  The catch of the day was very bland with too much salt which overpowered the dish. I also didn't enjoy the side of cucumber tomato with some kind of vinegar dressing. I just don't think the whole fish dish came together very well.  Overall I give Modavie a 3, I did like the ambience and live jazz. I would not return for the food-although apparently their lamb is a big hit. Overall I think there are better places for dinner in Old Montreal."}
{"text":"This restaurant was recommended by a friend My husband and I were not impressed.  The food was very disappointing especially the pre-fixed menu Wine was great!!! Live music just ok Falling glass, water and wine from 2nd floor also quite dangerous"}
{"text":"We ordered the duck confit & the seafood linguine. Both were enjoyable, but the linguine was the show stopper of the night. The linguine was much more flavorful and rich. Each strand of pasta was drenched in a tasty sauce unlike anything we've had.   The ambiance at Modavie is what you would hope an evening meal in Montreal would look like - a dark lit room and great live music that isn't too loud where you can't hear your own voice.   The assistance from the staff was ok, we thought they could have been more friendly and helpful."}
{"text":"Poor, at times rude, service combined with un-imaginative plates made this a disappointing dining experience. We will never return. Modavie left an impression of a one trick pony, able to technically cook a proper meal yet lacking any creativity to make it a culinary destination worthy of returning patronage. A real disappointment considering the quality of restaurants like Garde Manger just around the corner.   Our Experience::  We made New Years Eve reservations after reading the positive reviews online of the restaurant. When we mentioned we had reservations upon arrival, the front of house manager looked at us and gruffly asked, \"You know it's a $95/plate meal tonight right?\"   Both dressed well, (me in a dress and designer boots and my partner in a suit,) I'm not sure if he asked this because we looked younger (we're in our mid twenties) or because we are a same sex couple.   Our waitress was polite and seemed like a nice person but showed little to no knowledge of the menu. When we asked what she would recommend off the prix-fixe menu she said, \"Umm one of the first two?\" She also questioned me when I ordered a cocktail off the menu because she admired she didn't know the restaurant made the drink.  Being more cocktail drinkers than wine drinkers, we were disappointed with the lack of quality and selection of cocktails. The bar couldn't even make a standard \"old fashioned\" because they lacked the ingredients.  Being New Years the chef was serving a prix-fixe menu.  The starter was a large prawn with a salad finished with caviar. The prawn was tasty and well prepared, however the salad consisted of leaves and globs of dressing that wasn't even tossed to coat the leaves and some caviar tossed carelessly on top. The flavor of the salad was lackluster and showed a real apathy on part of the kitchen in my opinion.  During our starter the front of house manager came to greet all the tables except for ours, yet another indication of rudeness.   Our mains were technically well prepared in that the sear on the beef was a perfect medium rare and the fish was juicy and flaky. The accompanying vegetables were also soundly technically prepared however lacked any imagination. The most interesting part of the dish was a beet root mash. Otherwise, the filet mignon had a rather boring flavorless sauce, and was presented with salted roasted potatoes and steamed bok choy with two asparagus springs. My partners fish had much of the same except for rice rather than potatoes.  Each dish tasted good but would never stand out as interesting, creative and exceptionally prepared. Instead I had the impression that this is a restaurant that seems to have fallen asleep and is riding off the ability to cook consistently to clientelle that isn't looking to be wowed and intrigued by their meals.  Our desert was possibly the best part of our meal. The chocolate mousse was beautifully flavored, not too sweet with a deep chocolate flavor that was never bitter. The only complaint was that the accompanying orange sorbet did little to elevate and add to the dish.   Considering the bill came to over $300 we left feeling our money could have been better spent at another restaurant more engaged in providing a stand out experience.   Conclusion:: this is a good place to take a boring aunt interested in stuck up service and run of the mill dishes but for a true dining experience that will leave you impressed skip Modavie and head to Garde Manger down the street."}
{"text":"I celebrated my 30th birthday at Modavie with a big group of friends and we all enjoyed the experience. We made reservations in advance and had a very kind manager email us confirming our reservation and group menu. I was impressed with how good the service was as we were a large group and the resto was packed. The food arrived fairly quickly. I had the salmon which was perfect. The tiramisu was out of this world. I think our entire table was going crazy over the tiramisu. The live jazz was just a cherry on top of a great evening. The next day I got an email from the manager asking if we enjoyed our night at Modavie. Excellent service and experience. I definitely recommend this restaurant for a party."}
{"text":"Excellent Italian offerings, and original seafood ideas, including scallops to die for, fantastic white wine accompaniments, generous and gracious service. A real find, especially upstairs if the band is too loud for you."}
{"text":"Un resto-bar sur deux étages au coeur du Vieux-Montréal. Ici, la plupart des restaurants sont orientés vers la clientèle touristique et nous nous aventurons que rarement dans ce secteur. Cependant, le restaurant fait partie d'un petit groupe de restaurant qui offre des tables d'hôtes dans le cadre des \"Happening gourmand du Vieux-Montréal\" en janvier quand le touriste se fait rarissime. Après avoir consulté les menus spéciaux des sept restaurants participants (aucun ne m'épatait vraiment) j'ai décidé d'essayer le Modavie basé sur son programme de musique Jazz avec un groupe \"live\" chaque soir.  Premièrement, si un repas agrémenté d'un spectacle de Jazz est ce que vous recherchez, assurez-vous de réserver à l'étage, car le rez-de-chaussée est strictement un restaurant, le spectacle est en haut. Le menu en revanche est le même sur les deux planchers.  La spécialité de la maison est le \"carré d'agneau\" ce que le serveur nous a fortement conseillé. Le plat était bien réussi.  L'atmosphère est très agréable avec le groupe de Jazz mais entendons nous, c'est du \"jazz\" populaire et bien que le groupe était professionnel et la chanteuse talentueuse (c'était le jeudi et la tête d'affiche était \"Soulove avec Sara Latendresse\") les puristes de Jazz serons un peu déçus... par contre si vous êtes plutôt jazz populaire, cela devrait vous plaire.  En somme, une soirée fort agréable, une nourriture correcte mais l'addition aurait été un peu chère à prix régulier (mais acceptable avec la promotion)."}
{"text":"Certainly one of the better options I found in Old Montreal. Ambiance is a kind of classy casual, but also reasonably priced and unpretentious - a seemingly hard balance to find in the area. The live jazz was great, volume level was just right, and it was very easy to feel comfortable there.  The waitress struggled a bit with English, which is absolutely fine, as I don't expect fluent English in a primarily French speaking area. The reason I bring it up at all is because despite her not being fully fluent, she was still very friendly and not at all impatient with our mixed English and poor attempts at French. It was nice to be able to try the bit of French my girlfriend and I know without feeling judged at all for it, which isn't something I can say for some of the other places I dined and visited.  Food and mixed drinks were quite good. Not outstanding, but certainly a satisfying and enjoyable meal. But it was the atmosphere and music that really sold me on Modavie.  Absolutely recommended for a comfortable, fun, and reasonably priced option in Old Montreal."}
{"text":"Montreal's old town is as close to Europe as you can get in North America. However, the food choices in the Old Town are truly terrible, Modavie included. We ordered two glasses of wine, the catch of the day (walleye with vegetables), and the lamb chop (per the recommendation of the waitress).   The fish and lamb courses were brought before the wine and bread even arrived. The lamb was average, but the root vegetables were badly undercooked. Everything was dry and flavorless. The walleye special was much worse. The fish filet was scrawny, mushy, and flavorless. The vegetables were likewise overcooked, and the only flavor I could taste was the pepper I added.   According to Yelp, Modavie is the best restaurant in the Old Town, but after my experience, I would take the metro to a less touristy part of town if you want to get a decent meal."}
{"text":"We came here for dinner one weekend when we're were visiting Montreal. The service was incredible, our waiter Kim was attentive and personable. The drinks were delicious and creatively named. I highly recommend the bullies de menthe if you like mint. We started with the lamb poutine and the charcuterie plate, both of which were incredible.  The entrees were sub-par and underseasoned: the lamb burger was over cooked, the truffle cream sauce tagliatelle didn't taste like truffle at all, but the risotto and lamb was cooked perfectly. Overall, I would recommend this spot for a nice dinner and live music."}
{"text":"Based on the food it's a 2 star restaurant. Based on the service it's 4 stars. I ordered the guinea fowl. It was extremely dry. The potatoes were undercooked. My wife ordered the fresh fish(red snapper) and the escargot. Nothing to rave home about. Lorenzo was extremely apologetic and offered me another dish."}
{"text":"Came here for dinner on 1/14 and it was a delicious! Got the rack of lamb along with the duck pate, which were both scrumptious."}
{"text":"Be sure to get a reservation if you want to see music. We made the mistake of not (weekend tourists) and the owner still managed to find us a seat even though it was 7 on a Saturday! We had lamb cavatelli and let me tell you... perfection. Drinks were delicious as well and a lovely candlelit ambiance."}
{"text":"DELICIOUS!!!! We visited this restaurant just before leaving Montreal and it was perfect. Their onion soup is to die for! Great staff and fantastic vibe to the place even early at noon."}
{"text":"we stopped in for snacks and cocktails only.  calamari,  smoked salmon and salad all good.  cocktails as we like them.  in historic district, nice place, friendly server"}
{"text":"My husband and I were walk-ins last night for New Year's Eve. We were so glad to get in without reservations. Our server was super friendly and helpful with recommendations for drinks and food. He also allowed and encouraged us to take our time, which was much appreciated. The old fashion and martinis were good. The cabernet sauvignon and dessert wine were okay. We got the mushroom risotto and pesto penne. The food was good too. Nice ambience."}
{"text":"ATMOSPHERE: I couldn't imagine it being any better.  Located in Vieux Montreal (old Montreal) just off the river, this establishment was featuring live jazz when we visited, and smooth jazz over the stereo when the band took breaks.  The area feels very much European, much like a lot of Montreal, naturally.  SERVICE: our server was a nice young man from Vancouver that gave us all sorts of suggestions for things to do.  He, and everyone else, was awesome.  FOOD: I had a nice filet mignon (been eating lots of steak, lately) that was very good, but I want to highlight that the lamb chops that Tarra T had were perhaps the BEST I've had in life...period.  Didn't taste too gamey, very tender.  They were ri-donk-ulous.  Check it out if ever in Montreal."}
{"text":"whenever we are in montreal, we make sure to visit modavie...the food is spectacular, the service can only be described as \"professional\" , these people take their skills seriously. the atmosphere is exactly what you'd expect in a french bistro. the live music only adds to the experience."}
{"text":"This restaurant has one of the best Caesar Salads i have had in a very long time! Frisee salad was also delish. My girl's pizza was very good. The service was great - our waiter was wonderful. The prices were right.  Overall a very nice dining experience."}
{"text":"Très bonne décoration. Le service est impeccable, nous avons été servi par quelqu'un de très agréable et serviable. La nourriture est fine et très bonne. Nous avons pris les planches de fromages et de charcuterie pour attendre nos plats, elle sont excellente avec une mention particulière pour celle de charcuterie et le magret de canard fumé !!! De nombreux plat à essayer...."}
{"text":"When in Old Montreal spend a special evening st Modavie Bistro bar a vin. Order the house specialty, lamb, with a bottle of Cahoors Malbec and now you are living Canadian style. Yum!"}
{"text":"Live music and good food equals a wonderful dinner. Lorenzo the owner greeted us upon entering this restaurant. There are two levels and we made reservations to be seated upstairs by the music. I recommend making reservations as it is busy in the evening. Our waitress was sweet but with the level of noisy patrons and music it was hard to hear her with her lovely French accent. We were brought a loaf of good crusty French bread and soft butter.  We started our meal with a cheese plate and a bottle of French wine. The cheese was plentiful but was really nothing outstanding which was surprising. We have better cheese plates in the U.S. I was expecting lovely French cheeses but had hunks of just middle of the road cheeses. The wine, however, was outstanding!  This place specializes in lamb so my husband ordered the rack of lamb, which was perfectly cooked rare and was encrusted in sesame seeds and served with warm goat cheese over roasted potatoes and grilled baby carrots. It was amazing...I had a taste. I had the cavatelli with lamb, fennel and sun dried tomatoes and our server grated Parmesan cheese on top.  I started eating the dish and it tasted very good, but after a few bites, I noticed I had no lamb in my dish.  I flagged down our server and pointed that out, and she said she needed to take the dish into a better light because the dining area was very dark. She brought my plate back and apologized that the chef forgot to put lamb in the dish. Unbelievable! The dish with the lamb was delicious. I would expect for their error that they would have provided better customer service and maybe offer a complimentary dessert for their mess up. Being a server in my past life, that's what I would have done for my customer's inconvenience.  The musician was so good and added to the dining experience.  I would recommend dining here, making reservations...and double-checking your entrée to make sure that they have all ingredients!"}
{"text":"Loved this restaurant, highly recommend if you're in Old Montreal area. We actually decided to go here last minute since it was like right next to the Marriott we stayed in. What a pleasant surprise! We shared  the octopus salad with white beans for appetizer and that was very refreshing and plenty of octopus in the salad. Then, I had the duck confit and my husband had their signature rack of lamb with goat cheese. Now, the duck confit was amazing; super juicy dark meat, crispy skin and just enough duck fat, yum yum yum. As for the rack of lamb, it's their signature dish for a reason; medium rare was cooked to perfection, beautifully seasoned and super tender and delicious even for me who's not crazy about lamb to begin with. And for dessert, I ordered their pana cotta and cappuccino. When they brought the pana cotta out, it wasn't pretty with red raspberry or brown caramel, so I was a bit disappointed. But that initial disappointment disappeared in a flash as soon as I had my first bite. OMG, their pana cotta was sooooo creamy and just perfect with my cappuccino. I'm so glad I went for dessert even though I was already pretty full. But then again, I always have another stomach for dessert. Anyway, good service, amazing food, definitely give it a shot if you're in the area."}
{"text":"Attended a bachelorette in montreal and had dinner here. We sat in the upstairs room (more casual) which had live music. We had a group of 12 and did the prefixe. Our waitress was fantastic and constantly checking in with us. We  ended up having to push out reservation back and there were VERY accommodating. Highly recommend for large groups."}
{"text":"Modavie accepts OpenTable Reservations. Modavie's located on a quiet street, not too far from Notre Dame. Eventhough Modavie has 2 Floors the space is tight but clean & modern.  I started with the Octopus Salad w/White Beans & Lamb Chops w/Oregano. Both dishes tasted great & were given 2 free glasses of port wine on the House at the end of our Dinner. Modavie is very casual & friendly. No need to look like a Million Bucks, just be yourself as it has a tasteful & loyal young clientele."}
{"text":"My husband, 1year old and I came here yesterday (Easter Sunday) after reading many reviews of how good this place was. They certainly lived up to the reviews! We arrived at 5pm and the restaurant was full! We waited 10 minutes and were offered a great table in the corner looking out to the street. Was perfect for us as it kept the little one occupied looking out the window whilst we enjoyed the poutine, lamb ragu and fish of the day along with decent pours of a Pinot Grigio and Pinot Noir. Highly recommended this place and the great service we had!"}
{"text":"Nice find in the Old Port, good service.  After a long walk, we did the random and wander around looking for a place to eat.  Finally stumbled upon this place and sat on the outside.  Food was surprisingly tasty and service very friendly.  Knowing there are a lot of overpriced places along here, we found the prices reasonable.  They also did a great job preparing a kids meal for my daughter of grilled chicken and fresh vegetables."}
{"text":"We had a great experience here three years ago and wanted to hear some live music with dinner this trip so made reservations yesterday requesting a table upstairs.  (Thank you Lorenzo!). The Blues band was very good and the food was excellent.  As was the friendly but extremely professional service.  The waitress recommended the lamb entrees and the fried calamari appetizer, and my husband enjoyed both (the cavatelli with lamb) and said the calamari was the best he has ever had (\"Melt in your mouth\").  I was happy to find some wonderful vegetarian fare, starting with the delicious cream of cauliflower soup and then the mushroom risotto.  Wines by the glass were very good.  The only weak spot was the decaf cappuccinos which were extremely bitter.  But overall a great night.  Unusual to find a place with good jazz/Blues that also serves decent food."}
{"text":"Awesome place. Went for husbands birthday and the food was outstanding. Live music was perfect. Service was 5 Star. They also brought out a beautiful tiramisu with a sparkler for his birthday! Very special"}
{"text":"Wasn't exactly impressed with Modavie. I'm not sure if it was because we came for lunch but then again, it shouldn't matter if it was lunch or dinner. The food was just really average and it felt like one of those moments where, oh well, we needed a place for lunch anyway so at least we had something to fill our stomachs from Modavie.  Lunch order came with a choice of daily starter or soup. I chose the daily starter which was a small plate of salad. The salad didn't look exactly very compelling or attractive presentation wise--- light green chopped lettuce, sliced almonds and pieces of mandarin oranges. Sounds pretty good in writing, right? The pieces of mandarin still had the white pith hanging from all the pieces. It looked like if I was peeling the orange myself at home for a quick snack while standing over the kitchen sink.  My lamb sandwich sounded great on the menu though there was nothing that stood out from it. The lamb was tossed with brown gravy and the meat was tender, but that was it. It didn't do anything else for me, taste wise. I asked my husband how was his smoked salmon and said \"It was good but not great.\""}
{"text":"The pri-fixe menu is pretty good. for 29 dollars, you get an app (i got foi-gras, i think you can also get soup), a main ( theres lamb, fish and pasta to pick from), also a dessert (we got tiramisu). it's good for sharing, food is plenty. i also tried the duck confit - still amazing. The food here is not as good as France, but i enjoyed the environment and atmosphere a lot - the live blue's band was pretty awesome.  I got a french mojito - tastes watered down. don't do it, get something else.   Service is a bit weird.. we asked for a second basket of bread - it was like the most complicated task in the world. first we got like nothing for half an hour, then a few baskets came out all to our table - wat?   our next table over had a large group of like 10 people. between the music and that group, it was hard to even have a conversation... a bit annoyed about that."}
{"text":"I feel somewhat bad rating this place at 3 stars, as the ambience of the place is great, the live music is excellent, the staff are very friendly, attentive and not overbearing - all the right elements for success.   The only problem is the food - it is average at best. Since the main reason for visiting a restaurant is the necessary task of eating, it is kind of pointless to visit a place with mediocre food.   No reason to repeat."}
{"text":"What a fabulous experience. Early 1800s location. A absolutely magnificent Decour. Perhaps the most beautiful ceilings I have seen.   The food was wonderful too. The menu seem to have something for everyone. French onion soup was out of this world.  My rack of lamb was perfectly cooked.   My server Rad was a true pleasure and extremely helpful."}
{"text":"Maybe it is because I had higher expectations for Modavie based on other yelp reviews, but this place is a solid 3 star and I was a little disappointed as my expectations weren't met.  Good but not great.  Reviews says it isn't really a touristy place even though it is right on the edge of the highest concentration of touristy shops in old town.    On the plus side, the waiter was great.  Made a good suggestion for a bottle of wine based on what I told him I like and didn't try to go crazy on the price.  Points there.  He was attentive without being obtrusive and just seemed like a nice guy not only to us but the tables around us.  The arugala salad was great as well as the brie.    The problem was my lamb shank.  And it really isn't a problem, but on the menu they say lamb is their specialty.  And the lamb shank was pretty boring.  No real flavor or soul.  And I think it really hadn't been braised long enough. It was kind of like meat pellets in fat.  Now I've had braised lamb shank many other places where it is tender and lovely and flavorful.  This was not, this seemed like a poor rendition of the most basic version of a braise.  Maybe I should have had the chops or the rack of lamb, but done right I think the shank is better than those cuts.  So maybe just a bad night.  But for something that is supposed to the \"speciality\"  they got to lose a star for that.  If you are going to claim to be in the big leagues you better put it out there and do it consistently.    The jazz band that was playing was good, not too load, but boy was it hot upstairs, some fans or open a window would have helped a lot.  Should have sat downstairs and watch people walk buy."}
{"text":"We were very pleased with our dinner here. We had beef tartar (4 stars), French onion soup(5 stars) , duck confit (5 stars) and some steak ( not sure how to rate it,3.5 stars). But over all experience was very pleasant . Great service. Live music . Spacious place. Highly recommend !!!!!"}
{"text":"Came here for a date night- toddler free, on our trip. Coming from NY, so we had a lot to compare this place to. Let me tell you...  We ordered a lot of food. Just for the two of us. List is as follows:  Apps- lamb poutine French onion soup  BOTH THE BEST WEVE EVER HAD. Neither were too salty. They were incredibly delish.   Dinner-  Seafood linguine- outstanding Lamb chops- their known dish. Hubby LOVED. Tender and good quality. Great seasoning.   Food was superb.   Desert- creme brûlée. The best I ever had.   Wow. Wow. Wow.   Beers also fresh and service was good.   5 stars."}
{"text":"Came here as it was one of the few places that could accommodate a group of 10 with a kitchen closing time late enough that we could all make it in time for food.  The live music is probably a draw but unfortunately we all came right at the end of them wrapping up. The decor and atmosphere is certainly inviting and I can see how this place can be a tourist trap, ourselves included.  The steak I had was tasty and so was the salmon dish I tasted, but beyond that the general consensus at our table was that the food wasn't anything exceptional.  Service was a tad slow at times, but it was friendly and patient especially when we all tried to figure out how much to throw down for the tab."}
{"text":"what a great place!  wonderful french food with great atmosphere and the most amazing staff. by dinner's end we felt that we were in the midst of beloved people we know. Lorenzo, maitre de extraordinaire was my brother by evenings end and alexandra our waitperson was efficient kind and very funny! lamb and seafood highly recommended , great wine list. don't miss this place if you are in old montreal!!! live music, jazz, in the evening button intrusive, we went back 3 times!!!"}
{"text":"Located in Old Montreal on Rue Saint Paul  W , a very happening and busy area. We sat in the bar area which is huge because on the other side was live music. Started with  French onion soup and a beet salad with goat cheese and candied walnuts. Both were very good.  For entrees, we had the grilled lamb chops rosemary marinade and chicken supreme with a mustard demi-glaçe. Both were very flavorful and tasty.  They have a very nice wine list."}
{"text":"Honestly I love this restaurant!! Great ambiance for a date night. Food is delicious and great service no complaints about this resto. Just love it!!!"}
{"text":"Great live jazz music. Lively atmosphere with beautiful old world decor. Nice menu selections. Specializing in lamb chips, shank and burger. Homemade pasta and good steaks. Fun place to gather with friends and enjoy dinner."}
{"text":"en bref:   - beau décor mais cher à payer pour des plats ok mais trop chers - trop bruyant près du band   Nous avons réservé une table pour profiter du menu table d'hôte du temps des Fêtes annoncé à 50$.  Une fois arrivés sur place on nous annonce qu'une belle table nous avait été réservée au deuxième étage, près du \"band\" (un chanteur de jazz/blues). En nous asseyant, on remarque que le menu est à 95$... On demande alors s'il y a une autre menu, ce à quoi on nous répond que non.   Lorsque le chansonnier a commencé à chanter et qu'on ne pouvait plus s'entendre parler, on a demandé une autre place ailleurs. Une jeune fille nous a répondu que c'était la même chose partout... Cependant, une autre dame a gracieusement accepté de nous placer en bas. C'est alors que nous avons remarqué que les gens autour avaient des plats et des menus différents... Nous avons demandé ce qui expliquait cette différence. On nous a répondu que les \" walk-ins\" se voyaient offrir un autre menu et que nous, ayant réservé, avions droit au menu à 95$. Bref, la logique est que si vous réservez, vous vous faites avoir!  Pour les plats:  -soupe de poisson assez bonne -Chevreuil beaucoup trop coriace -dessert ordinaire sans bon sang.  Au nombre de bons restos qu'il y a Montréal, on va aller ailleurs."}
{"text":"Rack of lamb was great. Octopus salad was ok. Risotto was bad. I ate all the shrimp and left the risotto, because it was a blob of mess! It was seriously horrible!  The service was friendly but VERY slow! All in all an ok experience."}
{"text":"Omg so good! We walked in about 15 min before they closed on a Sunday night. The staff sat us and the waitress was so nice!! She immediately gave us warm bread, and always kept our glasses filled. Really amazing salmon and lamb burgers!"}
{"text":"For the live band playing jazz For the very good food we had the $29 menu for  For the very good wine from Napa valley  And for the good service  I give a 5 stars because they really deserve it"}
{"text":"It seems like we definitely needed our reservation here since it was very crowded. The decor and menu is what you would expect from a French restaurant and there is an extensive wine list. The duck entree I ordered, which came with a mushroom risotto was ok only. The skin of the duck was very good but the duck meat itself was a bit bland, as was the risotto. The others also didn't seem to love their dishes, which made me wish we had dined elsewhere since we were only visiting Montreal for 3 nights. The fries that came with the mussels were good - the typical type of fries served at French establishments and it also came with a large amount of mussels that we couldn't finish."}
{"text":"My first time in Montreal, Modavie is easily my best restaurant experience so far (5 days into the trip). The ambiance is warm and relaxed, with smooth jazz playing in the background.  Apparently every night they have two live jazz shows however my friend and I ate before the shows started.   As Denis S mentioned regarding the snootiness in some Quebec restaurants, that is completely absent in Modavie.  The maitre d' and waitress were friendly and very attentive throughout our dining experience.   The French onion soup was good but nothing to write home about.  The lamb is their specialty - I opted for the rack of lamb with sesame, goat cheese, and Dijon mustard served with crispy chips and vegetables.  The lamb was cooked just right ( I go for medium) and seasoned well and the large piece of goat cheese was lightly singed for a nice partially melted taste to compliment the lamb.    When I come back to Montreal I will definitely revisit Modavie and hopefully have room for dessert the second time around."}
{"text":"OMG! The seafood linguini was so delicious. My husband and shared linguini and vegetables soup and enjoyed  it very much. This restaurant has live music every night starting at 7. Outlet waitress was super friendly and nice."}
{"text":"Very nice food and restaurant. Service was very good. One Point off because the main came seconds after we finished our entree... we even hat the plates still in front of us. The waitress apologized... but i think thats a no go and the kitchen should learn how to slow down if its needed."}
{"text":"We went to Modavie on our first night in Montreal, while staying in the old part of town. I was with my family and we got a selection of different things from Lamb burger, sea bass special, pasta (with chicken and lardon--ham), and risotto.  Every dish was better than the last, the pasta my personal favorite.  It was a Tuesday night and so it was not terribly crowded, good live music playing, a rustic french decor, and a mix of a crowd, seeming locals with a few tourists.  The staff was friendly, and helpful.  I found the prices very fair and not quite worthy of the $$$.  I would highly recommend."}
{"text":"I was in Montreal for only one night, and I was looking for a place to go and get dinner for one. I loved the vibe from the outside, saw a sign for live music, and was intrigued by the menu. I ordered the duck breast salad and wasn't given any grief for being alone. The wait staff was friendly and kind and my food came quickly. It was DELICIOUS. Other dishes smelled amazing too... I highly recommend this place! There was no live music when I was there but there was great jazz and a super cozy vibe. A must go to place if you're in old Montreal!"}
{"text":"The food was very tasty - enormous portions. The drinks o ordered I expected to have some sweetness, but these were incredibly sweet.  The wait staff was incredibly sweet and very attentive. They were also super helpful when we had questions. I would definitely go back."}
{"text":"Awesome place for dinner with a group! We took my best friend here for her bachelorette. Really wonderful and attentive service, absolutely delicious food in big but not insane portions, delicious drinks, and really fun live music (at least we had some on a Friday night). The decor is cool but not trying too hard, and the location is great--close to the water, lots of galleries, and bars. Would definitely go back."}
{"text":"Went here on Friday night - first night in Montreal...the food was great - the house wine was nice.  I ordered the lamb shank which was nice - but the most amazing thing was the creme brule - served in one of those flat ramekins - so there was tons of that fantastic, tasty, crispy coating, the right amount of custard (and all for $5) - don't miss out!  The live jazz band was nice too, I'd go back again for a glass of wine and the creme brule!"}
{"text":"Poor service by rushing people out right after checked. Decent foods and drinks. Nice music but extremely rude and unqualified service. Even though, I was sitting at the bar but i had a full meal with a glass of wine, which I m pretty sure that it costed me not less than any table here. So i would expect more high standard manner. Sorry, not recommended to anyone."}
{"text":"I was sold on this restaurant because of the proximity to the hotel, live music, and favorable reviews for their lamb here on yelp.  My wife and I showed up 30 min early for our reservation on a Fri night but they still sat us down right away.  I thought this was a sign that we were in for a smooth sailing dining experience.  We started off with some red wine and fried calamari.  The calamari came out pretty quickly and we enjoyed it.  Unfortunately, the lamb entrees we ordered took over an hour to arrive.  We felt like diners at Hell's Kitchen during the first week of service.  Our server was very apologetic and said it was an error in the kitchen.  She offered some more wine to make up for it.  It was a nice gesture but we declined as we just wanted our food.  In observing the other tables it looked like some other diners were waiting a while for their food too.  The wait staff seemed to be overwhelmed that night.  When my rack of lamb with goat cheese finally arrived I devoured it.  It was good but I that wait was torture.  After we finished our lamb our server offered dessert on the house but again we declined.  We were too tired and couldn't wait another thirty minutes for dessert..."}
{"text":"Located in Old Montreal, Modavie claims to be Montreal's hottest Jazz bar and bistro. Lorenzo, The owner is super friendly and makes sure everyone is having a good time. The have Live Jazz  / R&B music on their 2nd floor seven days a week.  You need to make reservations in advance if you wanna be in the jazz section. If you like strong stuff to start with, The Smokin Martini is for you. We tried their Fried Calamari. The best I had in town so far.  Also their Striplion with pepper sauce is a hit. For dessert I had the Kahlua Tiramisu. Was perfect. Not too sweet. Definitely worth a visit.       Food -  Good  Service - Friendly   Ambiance -  Intimate Worth the money - Yes"}
{"text":"Was searching for a fresh cuisine in the old town and ended up here. Overall I would say it's a great value, not as expensive as the other French restaurants nearby, but the atmosphere was close to the other Toronto bars. We had the lamb rack and duck confit. I think the lamb rack tastes good, but not worth $40 bucks. In constant the duck confit was much better value. The cucumber conic was fresh and light, perfect summer drink. If planning to come here I would recommend make a reservation for seat after 7:30 upstairs for the live music..it's what really distinguish it from other bars. Maybe not the most classic French cuisine but the food was tasty regardless."}
{"text":"Enjoyed this rustic romantic friendly spot with good service and a decent menu.  Service was very attentive and music was a bonus.  The atmosphere was inviting and felt very warm."}
{"text":"Pretty good, but not good enough for the prices - hence the 3 stars.  Still, all around a great meal.   About a 10 minute stroll from Chinatown and just 1 block from the water.  The French onion soup gratin is a must.  Fish there is done very well (ask for it to be medium rare) as is the game fowl dishes.  Service is matter of fact, but caring all in one. We love our evening and would recommend you check it out if you're looking for French flair food."}
{"text":"My sister and I were touring the city when it starting snowing pretty hard so we decided to take shelter and warm up at Modavie.   We started with the foie gras, French onion soup, and lamb poutine --- all of which were very good. My favorite out of our appetizers was surprisingly the lamb poutine. The fries were crisp and the lamb was delicious. It was our favorite poutine out of the ones that we tried during our visit. Even though our waiter touted that their French onion was the best in the city, I thought it was just decent and not really worthy of the $10 price tag.   For my entree, I ordered the duck confit which was executed very well. The duck was nice and moist throughout and the skin was delicious. My sister's lamb was cooked to a medium rather than the medium rare that we had requested, but it was still very tender and flavorful so we didn't make a fuss. As our dessert, we tried their vanilla panna cotta which was just the right amount of sweetness to end the meal with. Overall, it was a great experience and we were glad to have such a nice haven during the storm."}
{"text":"Nice, classic French bistro in the Old Port.  Got snacks, wine and lunch, so not sure how dinner or the live jazz are, but I heard good things overall.  Recommend the Croque Monsieur and a glass of wine.  The side salad was great also."}
{"text":"We ate at Modavie on the second night of our Montreal trip from Toronto.  I really have nothing bad to say about the food (very 80's), service (professional, knowledgeable & polite) or location/atmosphere. Everything was very good and enjoyable. My issue however is with the other patrons.   I can't believe how many people (men) thought it would be fine to go to a nice restaurant wearing shorts and flip flops. Ladies what are you doing with these guys? My partner would castrate me if I told her I wanted to go out to a nice place for dinner and came out with a golf shirt and cargo pants. Is it no wonder locals hate tourists? I know you're on vacation but put on your big boy pants and don't pout. Maybe she'll appreciate you more. You're not going to Hooters with the boys to pound back some brews and tackle the suicide wings.   The owner should take some of the blame and that's the reason I rated this 3/5. I guess he's more worried about cashing in on the travelers cheques than setting a higher standard. Pity. he seemed to be a really nice guy."}
{"text":"Excellent food, wine selection and acoustic  music. Food was very well balanced and tasty too! The fireplace is a nice touch and adds to the coziness!"}
{"text":"My husband & I were very happy with the ambience & staff. The food was very delicious & the wine that the waitress recommended for us was delicious. If anyone is visiting or lives in old Montreal you have to go here"}
{"text":"Love the live jazz. It was really good. We sat by a window and we able to people watch. The food is good but you really go there for the ambiance and decor. Lamb and the duck confit was on the smaller side but good. Good wine list. Even if you don't get a table the bar is great to dine in."}
{"text":"Some reviews have said this place is nothing more than tourist trap. Well, this section of town does draw tourists, so expect a lot of tourists here. Is it a cookie-cutter place that serves overcooked food to throngs of tour bus crowds that are disembarked at its front door? No. This is a quality establishment serving great food.  I'm not easily impressed with food and am a bit of a \"foodie\" if you want to label. I'm even more difficult to impress when it comes to service. Modavie impressed me all-around.  We were seated at a window, which was nice, but the whole atmosphere in the place was charming and fit the ambience of the surroundings of Old Montreal. Our server was right over to take drink orders but was sure to not rush us, which was greatly appreciated as we could see them turning people away at the door who did not have reservations.  My meal came from the Table d'Hote section of the menu, so it included a salad, soup, and an entree. The mushroom soup I enjoyed was absolutely one of the best I've had. Perfectly seasoned with a nice woodsy-earthy taste - perhaps some chantrelle mushrooms in there. Loved it. My entree was the filet mignon with a king crab leg. I've not had any kind of land meat for nearly four years, but for some reason I was drawn to it on this menu. It was amazing, albeit a little more done than the \"medium\" temperature I had requested. It was a very flavorful cut of beef served atop a spot of risotto alongside a sweet potato puree.   Our server was patient with our somewhat rusty French and was jovial, polite, and professional throughout the evening. He clearly knew about the dishes on the menu and could effectively answer all of our questions.   If you're looking for an out-of-the-way restaurant, this is not it, so don't expect a place that isn't full of tourists. You're in the wrong neighborhood for that. Duh! But this isn't The Keg or some other chain restaurant that you can visit back home. That's down the street. Enjoy the atmosphere at this gem and I think you'll enjoy the meal as well."}
{"text":"An old building on the edge of  touristy Old Montreal. A nice interior of exposed brick and wood. There was a band playing jazzed up renditions of 90's songs which made for nice ambiance.  We ate the charcuterie board, I had the lamb chops by recommendation dessert and a few featured cocktails. It was a nice experience and the lamb was tippy top!"}
{"text":"Yum. We had great service and great food here. We had a party of 12 and service or timeliness. Everything came out great and pretty quickly for a party of our size. For apps we ordered fried calamari, beef tartare, foie gras and a charcuteries plate. The foie gras was delicious as was the beef tartar. The main dishes that were especially delicious were the lamb and the duck confit. Both were cooked to perfection. Tanya, I believe that was her name, was wonderful. She put up with a lot from the group with a big smile. I would definitely recommend this place if you are ever in old town Montreal."}
{"text":"I good flavor restaurant with longer open hours, this was important for someone craving for food at 2 pm."}
{"text":"Modavie is the kind of place you go to when you want to listen to live jazz, stare into the eyes of the one you love, dine on delectably well-presented food and sip on refreshing French wine.  Escargot, lamb shank, bass...everything was very well made. The escargot, an easy texture lacking the chewy quality you often get with the dish, sat atop a puff pastry in a light cream sauce. The lamb shank was buttery soft, bursting with flavor and coated in a light peppery spice. The creme brulee, though admittedly hard to mess up, was not one of the better versions I've had. The crispy top was extra thick and the creamy portion below was lumpy.  The wine list was excellent...great buys in various varietals, alongside some pricey-pricey bottles. Since dinner preceded a night out, we chose a light white, which went with both of our meals and was even more enjoyable as it warmed up a bit.  The service at Modavie was a little slow, but very polite. Our waitress even helped us pick out a few places to go dancing after dinner and didn't seem to mind that we were one of the last couples in there. The owner (manager?) kindly thanked us as we left, which we did full, happy and satisfied with our meal and experience at this charming French restaurant."}
{"text":"Great food and waiter was very nice and brought us an extra order of fries. They were wonderful ."}
{"text":"Amazing food.. Great ambience. Very good live music, very nice staff and very delicious desserts. One of the best restaurant in Montreal"}
{"text":"This place is great for live jazz, some good eats, and decent selection of wines.   In terms of highlights, I do love their calamari, as well as their goat cheese salad.  On different occasions, the bands or singers have been awesome! The interior is gorgeous, and the staff has been wonderful.   The cuisine, I wouldn't consider really french, it's kind of like a contemporary fusion of Mediterranean and a selection of pastas.  They offer lamb, bison, and seafood for a range of types of dishes. Their choices for vegetarians could stand to be improved upon but in general the food is okay.  During the summertime it is busy and bustling, and during peak dinner rushes can be pretty loud. As for the tourist factor, it seems like a fair amount of tourists do dine there, but if you like Jazz like I do, locals do dine here too."}
{"text":"Delicieux! The waitress recommended that the lamb was the \"thing to get\" on the menu, so I ordered the lamb chops and my friend ordered the rack of lamb. Both were delicious, and we were very happy with our meals. Same with the drinks. The sangria rose was very refreshing. Glad we stopped here for lunch, and took the waitress' suggestions."}
{"text":"Absolutely love this place! Fantastic vibe and great food!  The food at Modavie was very good! We had the foie gras to start which was flavorful with an excellent glaze. The entrees were just as impressive. My lamb burger was succulent and full of flavor.  The staff were excellent, our only complaint was how long it took us to get our food. From the time we ordered to when we were served it was 50 minutes. Needless to say we were starving!  Overall we loved this place! The live music combined with a romantic atmosphere was hard to beat!"}
{"text":"Really nice decor and great customer service. Great collection of cocktails. I orders two drinks. I will come back  again. Recommend drinks: Bellini Kochi, French something. Sangria rose is kind of light to me. Sapgattgti Bolognese is wonderful."}
{"text":"My new wife and I did Montreal and Quebec City for our honeymoon. We knew we wanted to do 1 upscale dinner when we were in Montreal, so I made reservations at L'Express. However, upon arriving in the city we quickly realized how difficult it can be to get around, and we decided to cancel L'express in favor of something closer to the hotel.  What a great decision! I'm sure L'express is good, but Modavie was a couple minutes away from our hotel, and the experience was amazing. The food, the MUSIC (Sam Orsini), and the service all top notch. We cleaned our plates of Shrimp Risotto, Strip steak, and lava cake. It had been a dreary, rainy day but we had such a great time we each left dinner in a fantastic mood.  Go on a Tuesday night to see Sam! Beautiful acoustic versions of classic songs, we didn't want to leave we enjoyed his music so much."}
{"text":"We loved this restaurant.  It was amazing.  Great experience with Francois.  He made our visit and meal special.  Thank you Francois!  Carey and Dianne"}
{"text":"My daughters took me out for dinner to celebrate my birthday.  My choice of Modavie over some other fine dining spots in Old Montreal was because of the live Jazz.  After spending an afternoon meandering around the old port, we had a cool drink atop one of the smaller boutique hotels and then took in an Imax film.  Dinner reservation was 7:pm.  We were seated at a cozy table upstairs not far from the live entertainment.  A friend of mine joined us shortly after we had ordered a delicious white wine and our shared appetizer....can't remember what it was but it was puff pastry and very good.  Our waiter was attentive, polite and had a good sense of humour.  He recommended the halibut so I ordered it and it was excellent.  One daughter had a chicken dish and one had the filet mignon; both enjoyed their meals.  The live jazz was wonderful background for a most enjoyable evening."}
{"text":"Pretty place and always crowded, but...  The onion soup was a huge glob of cheese, with no sign of onions. The lamb chops were decent, but one was too fatty to eat. Flavor of everything was bland. Service was great, but don't go for great food."}
{"text":"I like the atmosphere, but the food was just OK.  Like a lot of the reviews said, this is for tourists. ...and not foodie-tourists.  I might go in again for a glass of wine and to take in the ambiance, but not to eat dinner."}
{"text":"Our first night in Old Montreal we were tired from driving and we wanted to find a restaurant that was pretty casual and had good food.  Our hotel (Hotel Nelligan) recommended Modavie to us since it is right up the street and met our needs.  Let me tell you it met our needs and exceeded our expectations.    My wife and I both started off with a salad.  She got the \"Mesclun salad with goat cheese on croutons topped with apple cider dressing\" and I got the \"Endive and apple salad with Roquefort and a walnut oil vinaigrette\", both were amazing.  Let me say real quick that this restaurant offers something that most if not all restaurants don't offer these days and especially in a tourist area (HALF PORTIONS).  I love that fact since you don't want to over eat and when you can't talk the leftovers home it is a waste to get too much food.  Okay, back to the food.  For our dinner my wife ordered the \"Halibut with an avocado and lime salsa\" and I ordered the \"Ravioli stuffed with goat cheese in a roasted pepper and spinach sauce\".  Both were very good and I have nothing really bad to say about our experience at Modavie.  The only regret I have is on me, since I didn't get wine at a wine bar.  I ended up ordering a beer but it was very good so maybe next time I will order a glass of wine."}
{"text":"Loved this place. I can`t give it five stars only because I did not have a full dinner, but the salad I had with an egg on top & a sausage appetizer were great. I love the space & it`s industrial but elegant feel. The Jazz was on point. I have to say what made the night was the best waitress I have had while in Montreal, in fact anywhere in a long time. She was lovely, helpful, suggesting great wines, drinks, and even going so far as to google on her local phone ideas for places to go and writing them out! Catherine was just a delight and it made me feel so welcome not just at this place but in Montreal in general. Thank you"}
{"text":"Modavie has amazing lamb (especially the lamb rack, to die for), and the live jazz gives it a great atmosphere. Would absolutely recommend."}
{"text":"Had a nice French style dinner here with friends. The lamb chop is really yummy! The dishes are in good portions. Nice service!"}
{"text":"Modavie was among one of my more memorable experiences in QC. The restaurant achieves a great balance, so much that it is difficult to categorize. Modavie is where French brasserie meets contemporary lounge. You don't have to search hard to find that Modavie is known for its Jazz. While enjoying the live entertainment, diners enjoy a relaxed atmosphere that is pleasing to the eyes as well. The detailed woodwork, exposed stone/brick and dim lighting gave Modavie a very romantic feel.  The food was outstanding. The cuisine can be considered French Canadian at heart, but don't be afraid to step outside of contemporary Québéc towards classic Americana dishes a la steak and potatoes. My rare filet mignon was on par with a Ruth's Chris, with a superior selection of vins au verre. The experience was good enough to keep me around for the rare dessert course that was enjoyed with a hard to find J&B Jet 12 year blended scotch.  I left Modavie with a full stomach and a great buzz."}
{"text":"Modavie is in the middle of Vieux Montreal. It sits on the ever so cool cobble stone Rue St. Paul. It is a great walk before dinner and after.   Modavie is a high end French Bistro with the most marvelous food and deserts. We sat upstairs and were lucky enough to be there on a night when they had some live jazz music. It was great. The seating was comfortable and the place just really pretty.  We had the shrimp appetizer and the French onion soup was beyond great. We also ordered the sea bass which was cooked to perfection with great sides.  The service was friendly and we were left to linger and enjoy the music and our great food. You will love it."}
{"text":"Eaily accomidated our party of 11. Okay music."}
{"text":"Restaurant charmant et bel endroit situé au  Vieux  -Montréal  .Le service  du serveur était très  chaleureux  et rapide .La nourriture  quant à  elle était  correct  sans plus ."}
{"text":"Great bistro with great service.  Quality ingredients, nice presentation, friendly and professional service made for a lovely break on a rainy day in Montreal."}
{"text":"Great experience.... we went back tonight for the second time. The restaurant owner and the waiter were so friendly . Food was great and delicious . We also had a great conversation with the owner and we met John rhys Davies at the restaurant overall it was unforgettable night"}
{"text":"Wine bar Great food and a nice selection of wines. The jazz music is really making a fun atmosphere. Just love that place."}
{"text":"I was definitely not expecting my favorite meal on the Montreal trip to be at a small little restaurant locating in an extremely touristy area, but here we are.  We'd spent way too much time looking for somewhere decent to eat in Old Montreal and when we came across Modavie, I kind of just said we're eating here and didn't even look at the menu.  We took a seat at their very comfortable, very quiet patio and were immediately greeted by an incredibly friendly and helpful server. We weren't looking to eat anything too heavy, so we decided to just order a couple of appetizers:  Fried Calamari: This has to be one of the better variations of this venerable classic I've ever eaten. The calamari was perfectly breaded and fried, and didn't contain any of the chewiness you sometimes get with bad calamari. And they were accompanied by two addictive sauces that proved a perfect complement (a creamy one and a tomato one that was surprisingly spicy).  Duck Rillette: I'm not sure what separates a rillettes from a pate, but at any rate, this was delicious. It comes presented on a plate with crunchy toast and an assortment of nuts and berries and honestly I was blown away by how flavorful and melt-in-your-mouth succulent it was.  I rarely mention alcohol in these reviews, but I have to single out the chardonnay we both drank. It was a brand called Oakbank and it was a perfect accompaniment to what turned out to be an incredibly laid-back, delicious lunch."}
{"text":"Service, lamb, calamari, onion soup, OpenTable reservations and the live music?  All good to great.  And our server specifically was pretty funny when I asked for a second helping of the tasty bread served between courses.  My Negroni cocktail was also pretty good.  But the steak frites was a borderline disaster.  It was a large (10 ounces?) piece of steak dropped on top of some very plain fries on a large plate.  People who know me well know this, but even in total agony I eat cooked flesh no matter what but I left about half my steak and some of the fries on my plate because this was so bad.  Just wasn't what I was expecting; I order steak frites at a variety of French and French-leaning places all over the US and when I went to France, but this was a very Americanized version of a steak and fries meal.  My advice?  Skip the steak, get the lamb, order a couple of drinks and soak in the scene.  You'll be fine!"}
{"text":"I'm not sure why this place has good reviews because my whole experience here was terrible. We had booked a relatively early dinner for 6 people and the restaurant was about half full.  The service was extremely slow. It took at least 20 minutes for them to serve our wine and drinks. We had asked for plates to eat our appetizers since when they set the table, only three of us had any table settings. The plates never came. By the time we could locate the server, we were done with the apps. Next came the waiting game for the entrees. We were falling asleep waiting for the food while the server kept giving us empty promises that the food would be out shortly. I didn't realize shortly meant an hour and fifteen minutes. The worst part of this all was the food came out lukewarm and dry. As if they had been sitting there for an hour and fifteen minutes... There was nothing special about the food. Mediocre at best. I would not recommend this place to anyone unless they wanted to waste money on an underwhelming meal, kill 3 hours for no reason and end their night in disappointment."}
{"text":"We stumbled upon Modavie as we were looking for an affordable but classy restaurant for lunch.  We were SO happy we found this restaurant.  Our waitress was very friendly and we got quick and pleasant service.  We were visiting Montreal for a long weekend and got tips on fun nightclubs and events going on from our waitress.  The food was also VERY good and there was a lot of variety on the menu.  Just wish we could have come back to sample more!  Among the three of us, we sampled a wide variety.  For apps, we tried the salade mixte with goat cheese, which was light and very good!  We also had the rilette, a rich and filling, but not overly heavy, dish that we all really enjoyed.  The rilette came with bread and a side salad, so it was a nice mix.  We also tried the Toulouse sausage, again a hit - tasty and not too heavy for a summertime lunch.  Next, we had the soupe d'ognon, a French classic done to the T! It brought back memories of living in France - excellent execution!    The smoked salmon and fresh cream with capers blinis were good, although the blinis themselves were a bit hard.  I would have preferred a bit of a softer pancake as this was a bit hard to cut through.  I didn't get the feeling that they were fresh (maybe frozen and then microwaved?)  However, the balance between the salmon and tasty fresh cream was just right!  A rich meal that made you feel like you were dining in style! :)   Finally, the salade frisee avec lardons was also a success - the frisee had a light dressing, the bacon/lardon balanced out the lightness of the salad and it came with a hardboiled egg.  Again, reminder of a life of leisure in Paris :)  Try Modavie if you're on a budget, but still want to eat well.  We stuck with smaller plates and felt very satisfied with the quality and portions!  We'll be back the next time we return to Montreal!"}
{"text":"Made reservations for a wedding anniversary, specifically noting the occasion and requested to be seated in the same room as the music was being played. Upon arriving, hostess did not say a word... seating us in a table where we could hear the music but not what we asked for.  Server was ok, but seemed like he was running around as the place was understaffed. The food itself was very good. Main complaint came with dessert. Ordered a spiked coffee and tiramisu. The tiramisu came immediately and the waiter claimed at that moment that he would be right back with the drink. 15 min go by, he's nowhere to be seen. We finish the dessert and now don't want the coffee.  I get up to tell the waiter to cancel, he now has the drink.  He gets to the table and tells us that it's not French custom to serve coffee with dessert - turns out this is 100% true. Ok, cool, but 3 factors here: 1.) we're clearly not from here and got confused by his statement that the drink was coming right up 2.) he was missing in action for so long we couldn't even ask about it. 3.) maybe it's us, but we felt like he was speaking down to us... given the cost of the food, we expected more of an \"I'm sorry\" and that would have been enough.  He comped the dessert, which was nice, and even brought another one, but by that point the meal was done, and the offense was taken. Call us stupid Americans if you will, but this area is all tourists, so you need to at least consider who's paying your tab.  This was our second time here, the last time with friends 2 years ago, and due to the service, will also be our last."}
{"text":"I decided on this place due to the great reviews but the place really wasn't all that great. Yes the jazz music is a nice touch but the food by Montreal standards was just ok. We have the calamari which was good but same as anywhere else and I had the chicken drumette which was decent but not great by any means. My friend even commented that the place is just like a british pub and what we had tastes like pub food. Sorry but this place is not worth the prices they charge. There are much better places in the city."}
{"text":"What a great place. The atmosphere is extremely cozy and relaxed. The music is great for a relaxed jazz sort of feel, but it would be cool if they had a sax or trumpet too.  For starters, the table ordered tomato soup, garden salad with goat cheese, and smoked salmon. The starters were good but nothing too special. They were generous with their goat cheese portions though.  Main course wise is where the restaurant blew us away. The boys had lamb chops, a friend had grilled salmon, and I had cavatelli with lamb, fennel, and tomatoes. Everyone was thoroughly impressed with their food. I can say that the pasta I had is one of the best pasta dishes I've ever had- the mix of flavours was spectacular. The portion was also very very generous- enough so that I took it home and had it for lunch at work the next day.  My table ordered the chocolate fondant which was also good, according to those eating it.  I will DEFINITELY be back here again. Service was a bit slow at the end, but that is my only complaint."}
{"text":"Out of the five nights we spent in Montreal, my boyfriend and I both agreed this was our favorite restaurant!  My boyfriend started off with the French onion soup, which he said was the best he's ever had. Then we shared the escargot puff pastry and lamb poutine, both were incredible!  For entrees my boyfriend ordered the rack of lamb, which he devoured and I ordered the butternut squash gnocchi with braised lamb, which was really tasty.  The service was excellent, they kept refilling our drinks and there was a live band playing while we ate.   Would definitely recommend!"}
{"text":"Atmosphere is great. Kim and Lorenzo were fantastic. Order the lamb, it's a must. Try the specialty cocktails.  Kim makes a great drink."}
{"text":"My wife and I had Christmas dinner here. We loved every bit of this establishment! The service was exceptional and my lamb burger was the best I ever had. When in Montreal, this place is recommended in the heart of Old Montreal. It is a real gem of an establishment."}
{"text":"Good service with spot on recommendations. Filet was cooked perfectly, my husband enjoyed the short ribs.  Really liked the live jazz.  I would return."}
{"text":"J'ai beaucoup aimé la simplicité du restaurant et les plats réconfortants qui y sont offerts! La fraîcheur et la saveur des aliments sont certainement des plus du restaurant ! J'ai pris un spaghetti sauce bolognaise et il était tout simplement délicieux!   Le seul hic, les bouteilles de vin ne sont pas donnés! Par contre, pour la beauté du restaurant, le maître d'hôtel hyper sympathique et leur plat excellent, je vous le conseille! Une belle soirée dans le Vieux-Port peut très bien commencer par un bon repas au Modavie!   PS: il y a des shows live !"}
{"text":"Had a wonderful dinner on a cold January evening. Made reservations 3 days before to ensure we would have a table on a Saturday night!  One word of caution, parking in Old Montreal is not always easy.  We had to park a little walk away!    As we entered the restaurant we noticed it had a nice cosy dark feel to it with an open kitchen and a bar tucked just under the staircase to the second floor.  We had a smaller sized table against the wall(2nd floor) but had a good view of the small stage where music would soon commence.    I started with a glass of the Carnivor Cab Sav ($9 a glass) and my wife had the Cosmo pastis $9.  nice light Cab Sav.  We both ordered soup, mine the french onion ($8) and she had the soup of the day cream of broccoli!($5).  Onion soup au gratin was okay 3/5 missing some onion filling but definitely had a nice taste to it just it could have been better.  My wife's however was much better (she gave me a taste).    For main's I had the steak frites ($23) and she had the Salmon tournedos with lentils ($21).  The SF was fantastic.  The cut was a hanger steak (bavette de boeuf) a bit chewy but had a very nice shallot sauce and was just as I had in mind.  Ordered it rare!  My wife was very happy with the Salmon tornedo.  She said freshness and flavour was great!  The portion size was perfect for her.  Not too large not too small!    I was watching the servers bring food to different tables and it looked like 60% of the people ordering were selecting the rack of lamb with oregano or the one with goat cheese.     As we were eating a nice blues band started to play and the place started to fill up quickly shortly between 7 - 7:15 PM.  The band was quite good and added to a nice ambiance that fit the mood of the place.  The only negative I would mention is I believe there to be too many tables upstairs.  I told my wife \"I would not want to be upstairs if there was a fire as you felt that there would be a mad stampede\"!  Heading to the washroom you had to skinny through tables to the restrooms.      For dessert I had the Kahlua tiramisu and she had the Apple tart with Ice Cream.  My tiramisu was really good.  Nice and light and as a Tiramisu should taste.  My wife was disappointed with her apple tart.  It was basically a cored apple in a shell with cinnamon and a scoop of ice cream!    All in all this is a fabulous restaurant and we really enjoyed the experience and would definitely come back even though there were a few missteps!    Thanks Risa and Katherine!  Happening Gourmand GC greatly appreciated!  Rock on!"}
{"text":"We loved Modavie! The live jazz music is perfect for a night out in old Montreal. Delicious cocktails. Definitely try the beet salad!"}
{"text":"Food is mediocre but staff is nice and is very kid friendly. It's worth the trip as we found feeding the kids in Montreal somewhat challenging."}
{"text":"We've ate at three or four places in Montreal during our stay and I just had to come rave about Modavie. We had a glass of wine and french onion soup, which may be the best french onion soup I ever had. The very kind waitress told us the onions were aged in apple brandy, it was to die for..."}
{"text":"Came here to celebrate New Year's Eve, a birthday, and anniversary. I made reservations online and they greeted us happy birthday when we arrived. Asked for window seat which they happily moved us to. Food was average, waitress wasn't as friendly as I would hoped as I asked for recommendations and she didnt suggest what I read they were known for (lamb and wine). Came for the live jazz music but was disappointed as I overheard they would arrive later in the evening (we came at 7pm) and no music provided until the end of our meal when they played it through the speaker system.   The decor is really intimate but the food was average for the price. We had the seafood tagliatelle and steak and frites.   Maybe I had high expectations since this was a three-in-one celebration dinner, but I don't think our first experience here deserved any higher than 2/5."}
{"text":"LOVE IT HERE! The beet salad was amazing! the stuffed mushrooms were delicious! and possibly the best tiramisu I have ever had! We definitely will be back when we visit Montreal again! The owner Lorenzo was so great and made our friends birthday very special!"}
{"text":"Awesome food and hospitality in Montreal  I went to Modavie in the old district of Montreal after reading some good reviews.  I was not disappointed. The host Lorenzo greeted us at the door took time to ask our names and gave us some suggestions on the menu.   The food is amazing, like much of the affair in Montreal, it can be referred to as comfort food. The French Onion soup is excellent, the lamb is out of this world. One of us had the Sea Bass which was cooked to perfection and perfectly paired with the sides. I had the lamb chops which were absolutely perfect, very juicy, great flavor, awesome!  Our waitress Alexandra and the entire staff really make you feel at home. I strongly recommend Modavie if you are in Montreal!"}
{"text":"Modavie was the first place we ate at while in Montreal; we were starving and hot from all the walking around. I quickly checked their Yelp reviews and decided we'll go inside and have a nice cocktail and some grub. There are many places to eat in Old Montreal, but Modavie being directly on the corner of all the action of Saint Paul spoke to me. We decided on having a seat at the high seats next to the window, with a view of all the people going by. It's a very elegant French restaurant without the need for getting dressed up all fancy. We checked out the wine menu and we both went with a glass of Riesling.    We decided we'll pick a few things to start and share with each other. We ordered the poutine which I was informed by our server is their version of junk food. It's basically fries with cheese curds, gravy and braised lamb. It was a large portion, tasted really good. We both enjoyed it very much and would come back for it again. We also ordered the Beet Salad along with a side of fries. This place was great for a late lunch not sure how dinner is but our food and service was great. We left with content full stomachs with enough carbs to fuel our walk around Old Montreal."}
{"text":"I came here with my family the other night. A very nice bistro with good food and attentive service. A nice selection of American and Canadian wines. The food was excellent and it was a lovely atmosphere.   Husband had lamb cavatelli which is shredded lamb with fusilli pasta in a tomato based sauce. I had the tagliatelle with chicken in a light creme sauce. We both liked our dishes.   They made my daughter a special entree of spaghetti with gravy and mushrooms and mother in law had the moule frites with Pernod sauce. They enjoyed their meals as well.   A good choice when in Old Montreal.  Lorenzo the owner came to our table and had a nice conversation with us."}
{"text":"Venue, atmosphere, service and entertainment (live band) absolutely a five / five!  Our server was SO sweet and attentive.  The band played a great mix of classics that kept the energy up, some women even got up to dance.  We LOVED the bread and beef tartare. Our Cornish hen papperdelle dish was flavourful, but it didn't thrill us nor would we order that again. I had originally ordered the market fish which I was so excited about (Marlin) which is one of my favs but she came back to tell me they ran out I had to settle for salmon, which was a generous portion but lacked flavour especially when paired with the risotto. The dessert which was a creme coffee caramel, was delightful.  I would go back for the ambience as we ended up meeting the people sitting next to us and had a great night!"}
{"text":"I love Modavie Resto-Bar and FELL IN LOVE with Lorenzo, the owner.  This is the best night spot in all Montreal.   The food is good, music delightful and Lorenzo entertaining.  Lorenzo is charming and cute.  Lorenzo, marry me!"}
{"text":"Exceptional service, ambiance and food. I ordered the lamb rack, which tasted incredible. It could have been a little more pink for medium rare but the flavor was outstanding. Live music was wonderful. I'm taking off one star because there was a bug in one of our drinks. Working in the food industry, I understand this happens, but it grossed me out as it was worm like and had many legs. Overall outstanding and I will definitely come back next time I am in Montreal."}
{"text":"Place was bustling when we arrived and we snagged a place at the bar.  Live Jazz going on was nice.  Drinks were potent and excellent.  I tried Foie Gras for the first time here and now I know why it's a treasured French dish.  My wife had Lamb Chops, but said they were a little thin, although she got 5 of them, she would have preferred thicker and less of them.  She said Creme Brulee was as good as she has ever had - and they had a great after dinner drink selection for me.  We had a very good time ad Modavie and you should too."}
{"text":"A nice find amongst the many French restaurants in Montreal/Old Montreal. The space was a larger than we initially though so there was plenty of room for us at about 9:30pm on a Tuesday night. There was a live guitarist finishing up when we got there.  We started with the braised lamb poutine and the French onion soup which the waiter told us they were known for (I think maybe all French restaurants say this.) The soup was great and cheesy. The onions had definitely been caramelized well. The poutine was also good, but the fries were a little skinny for poutine so the gravy:fries ratio ended up being a little to high for me.  My mom and I both got the sesame crusted lamb with the goat cheese potatoes. Lamb was cooked perfectly medium rare and the sesame crust was crunchy. Could have used a touch more salt. I LOVED the potatoes, they give you a huge slice of goat cheese - as much or maybe more than the amount of potatoes they give you. That's what I always hope for in cheesy potatoes.   For dessert we split the apple pie, which our waitress told us was their best dessert. Coming from the US (specifically the southern part of the US) it was not apple pie as I know it because it was deconstructed. There was a pie crust surrounding a very artistic looking mound of cinnamon apple slices. That being said, it was tasty and much less dense/filling/intense than a typical slice of apple pie. It's served with maple syrup (of course) and ice cream.   Our waitress was super friendly and smiley which I always appreciate. She also kept our water glasses full which generally equates to an A+ in my book.   A bit pricey, but a nice special occasion place in the scenic old Montreal area."}
{"text":"Wonderful! Great atmosphere and impeccable service. The food was amazing! Appetizers- French onion soup very good, Shrimp cocktail fresh tasting. Chicken supreme- tender juicy chicken with tasty vegetables . Spaghetti was delicious and perfectly cooked. The desserts were the best ever! We ordered Tiramisu and raspberry cheesecake!"}
{"text":"Overall experience was good except for the super slow service.    Arugula salad w/fig - fresh and light Gois gras - really good & nicely presented Duck confit - delicious  Rack of lamb, this is your place if you like gamey lamb Pannacotta - way too sweet  Person who greeted us was very welcoming Live jazz always a plus"}
{"text":"Duck and lamb dishes were so delicious here! Tender with rich flavor. Wine and cocktail were so so."}
{"text":"This was an amazing musical and culinary experience. My husband and I came more so for the music but the food had exceeded my expectations we were seated on the second floor not to far from the talented musicians."}
{"text":"Honestly, i was slightly dissapointed. There was no live band when i was there! That's 75% of the reason i wanted dinner here. I didn't go for Valentine's day, but was just so surprised that there wasn't live music. Other than that i loved it. I got the lamb shank with almond crust, and the apple pie for dessert. It was a whole baked apple with filo dough. So good. Maybe next some live music?"}
{"text":"We were headed to Robin Square, but unfortunately they were closed.  Wandering around, we saw Mondavie.  Friendly greeting when we walked in.  Lorenzo is crazy funny!  We decided to sit at the bar, and he told me that if anyone came in, I was suppose to seat them if he wasn't up there.  I felt at home.  The bartender, Kim, was friendly and funny as well!  We all felt at home.   I ordered the poutine with braised lamb.  This tasted more like the traditional, however, that first one in Vancouver will forever be my favorite!  Two of us ordered the lamb chops since that is the house specialty.  The others had the steak frites.  The chops were grilled perfectly!  They came with some assorted vegetables and a rosemary marinade.  The others said the steak was ok, nothing spectacular.  I'm of the opinion that the lamb is the way to go!  Our bottle of Malbec didn't last very long, so we though another was in order.  It was fun sitting at the bar and watching all the guests coming and going.  We started making up stories as we watched, like the couple on the first date and her thinking, \"How do I get out of this?\" and him thinking, \"She's the one!\"...things like that.  They also have live jazz playing which is nice, especially if you are in the main dining room.  Again, Lorenzo and Kim made the visit so much fun and enjoyable.  I would definitely come back if ever in the area!"}
{"text":"Our guide recommend this for a dinner when in Montreal.  Traditional French cuisine.  The ambiance was nice, and included a live jazz band.    I ordered the steak frites; actually what it says steak and fries.  Standard meal. Nothing to brag about.   Maybe other meals are better.  Definitely a great place to sit down, order drinks and listen to good music.  And of course the crowd and staff are all a class act! I salute you Montreal!"}
{"text":"Stopped in the afternoon of Boxing Day while visiting from the USA. Enjoyed a few glasses of wine while chatting with a friendly and helpful staff and manager. Didn't eat, other than a great bowl of squash and spinach soup, and some warm, crusty bread. A very enjoyable and relaxing refuge from the cold Canadian afternoon. Wine drinkers and fans of French bistros should check it out."}
{"text":"Order the lamb poutine & an arugula pasta which intrigued me.   Lamb poutine was served on a bed of thinly cut French fries with a gravy sauce & slivers of cheese curd and what I would describe as pulled lamb. Not outstanding but not bad either.   The Arugula Tagliatelle was pretty good - pasta was clearly a fresh pasta, it looked like a basil pesto sauce through it there was a distinct bitterness which indicated chopped arugula was through the sauce too. An interesting vegetarian option!"}
{"text":"[Montreal Food Tour Stop #3] Modavie Resto-Bar is a hip restaurant with tasty French food in the middle of Old Montreal.  I was looking for a slightly more upscale meal to enjoy my second night in the city.  There's a medium sized cocktail menu and a decently sized wine menu.  Some dishes on the menu include foie gras, beef tartare, steak frites, salmon, and ratatouille.  Also, live music is played every night.  I skipped the wine and went for a three course meal with my friends.    Highlights: The poutine here is excellent.  There was only one type of poutine on the menu.  It was served with your standard cheese curds and gravy - but there was also braised lamb.  This is a big upgrade from poutine from ground meat (which is also good too, but lamb makes it great).  The meat was soft and tasty and the overall dish was not too salty.  For my entree, I ordered the market catch of the day, which was halibut served with risotto and vegetables.  The entree was very light and I really liked my risotto.  Our waiter was entertaining - he was boasting that Modavie's poutine was the best in all of Montreal.  I admit that I haven't tried enough poutine in the city to back this claim, but it is very good and I will recommend it.  For dessert, I ordered the creme brûlée.  Decent - not outstanding, but good in my opinion.  Critiques: I would have preferred that my halibut be seasoned a little more.  I definitely had a good time at Modavie, but judging overall taste and price, this is probably 4 stars in terms of value.  Overall: Very good food in a great part of Montreal.  You'll have a pleasant time and enjoy a tasty meal with good service.  Also, lamb is the way to go when you're choosing a meat to add to your poutine."}
{"text":"Really nice place to grab lunch. Outside tables are nice, the food is delicious and creative. The service is excellent and the staff is incredibly welcoming. Our waitress Richelle was very friendly and knew the menu well. The portions were larger than I expected and well presented. Also, it was a nice surprise when I checked my c/c statement to get back 25% with the currency exchange to US dollars."}
{"text":"One of the best culinary experiences in Montreal! The food was great and the live jazz made it special. The hostess during our visit was exceptionally nice and seated us on the second floor where the music experience was doubly great! I definitely recommend the place."}
{"text":"I was really pleased with my meal on my recent trip to Montreal. I was not overly hungry so I ordered the Beef Tartare. It was actually my first time trying Beef Tartare and it was quite the treat. I enjoyed the  pine nut and avocado that were mixed in with the tender beef.   The place has a really nice vibe and in my opinion is reasonably priced given the area/food quality. They also have a amazing cocktail list which I should have explored more!  Our server Rad was also great. Very friendly, attentive and knowledgeable!"}
{"text":"Excellent restaurant. Wonderful service; even with a larger party. Lamb with pasta was great. Decent wine selection (not the best). Beautiful jazz music playing in the background. Tasty desserts to round off the evening."}
{"text":"Jazz was playing on a weeknight and a group of us sat in the back to drink wine and share charcuterie trays.  The manager was very friendly and made sure that we had everything we needed.  We ended up staying until the restaurant closed reflecting the good time we had!"}
{"text":"We had the pleasure of dining here very late night years ago and were not disappointed this visit either. From the moment we walked in Lorenzo welcomed us with opened arms and made our meal a wonderful experience. The food was outstanding. Our group has Duck Confit, rack of lamb, and Mushroom Risotto.  Service was non obtrusive and delightful. The Jazz playing from the second floor was very nice and not a distraction from the meal and good conversation. Thank you Lorenzo for a wonderful evening of food wine and conversation. We will return on our next sojourn to Montreal."}
{"text":"As romantic as you want it to be, yet totally safe when I insisted my family return with me.  I was totally turned on to lamb with an oozing slab of goat cheese when I first dined here and I wanted to spread the word. And the chops.  Between walls of wine, a warm atmosphere and swirls of jazz in the air tie the experience together perfectly. Take your pick between the downstairs wine bar and the upstairs dining room with live band. The music is lively but not distracting from intimate conversation. No yelling over the table necessary. I will continue to return when in town."}
{"text":"We enjoyed our meal here. Our hotel was able to get us a reservation on short notice. We were seated in the side room but could hear the jazz that was playing perfectly. The french onion soup appetizer that I had was very good, as was the special rack of lamb with goat cheese. My husband had a steak frites which he enjoyed. I noticed many people having ordered mussels around us as well as the lamb."}
{"text":"What I really like in Montreal is the french food and if I have the possibility to get some 'Moules et frites' (mussels fries) I can't resist. Ok it's not rocket science -  haute cuisine - to make some mussels with a good sauce, but they were really good. We've been there on a Saturday night in April - not high season yet. We got a table right away. Service was really friendly and also the chef passed by to ask about our well being. In one of the Yelp reviews I read that this place is a tourist trap - from my visit experience I can not confirm that - but as I said it was slow season so possibly in high season it's different because it's located in a very popular area in the old town. Overall the prices were reasonable for the location also playing life music. We enjoyed the ambience and the food very much."}
{"text":"Sat down by the window which should be a good spot but turned out to be extremely uncomfortable. There's a huge dent on the seat and my back was hurting the whole time(couldn't change seat as the place was packed on the Saturday night). Ordered the 3-course meal with halibut(the most expensive thing on the menu is supposed to be at least half way decent?!). The fish was well-overcooked and hard to chew. Maybe nice ambiance in general but too bad I didn't get to enjoy it much...."}
{"text":"Excellent place to eat, drink and listen to music. I had fixed price cod which was delicious. Several people had the beet salad. I had cod, yum. The catch of the day was also excellent. All were happy diners!"}
{"text":"This is the best place for a nice European cuisine. Great steak, awesome lamb burger . I did also enjoy the live band"}
{"text":"Tourist spot. The best dish of the night was the guinea fowl, crisp skin, juicy meat that tasted like turkey with a citrus flavor.  The sliced lamb was OK, and I should ordered the rack of lamb instead.  The service was fast and good.  Wish we were seated upstairs instead. The seating was tight on the first floor. Overall, our meal was good, but I wouldn't recommend or return."}
{"text":"The food here was spectacular. Although slightly overpriced (as are most restaurants in Vieux-Port), I enjoyed my meal and left very satisfied. The service was amazing, our waitress, I believe her name was Alexa, was helpful and efficient. The soup of the day, a tomato basque, was delicious and affordable compared to their pricer main dishes. My friend who ate the Lamb, I'm a vegetarian so didn't try it, said it was amazing. If you're in old town and are willing to spend a little more than normal on a great meal in a place with phenomenal ambiance, I recommend eating here for dinner. Also, the cheese plate for 2 served our party of 4 perfectly and coupled with the free bread was delicious."}
{"text":"Worst place we walked into in Montreal. Walked out in two minutes because I was not allowed to sit and have a glass of wine at this WINE bar without ordering food. Absolutely ridiculous."}
{"text":"very very crowded even at 10:30 at night and so noisy you could not hear yourself think.  The lamb burger was excellent thou and they were helpful with my disability letting me use restroom on main floor.  The jazz music could be heard from other room was nice."}
{"text":"The food was great, and I liked the ambiance, but we must have gone on an off day because the service was off. The waiter was trying his best, but I think they must have been understaffed because he just couldn't do it all himself. The weird part about it was there were two hostesses/bartenders just standing around and setting tables endlessly. They could have stepped in to help the lone waiter who clearly needed another set of hands. We had a good lunch, but we waited far too long for service."}
{"text":"tourist trap, food was awful service even worse - how can you not provide a decent service when you have 2 tables?.., I understand service is \"relaxed\" in Canada but man...this was something else.."}
{"text":"TL;DR: Great food but service & ambience subpar to the prices of the food.  The rack of lambs & seafood linguini were excellent as well as the neige martini, however; service not to the price standard & from where we were sitting we couldn't even see the band--the resto is poorly laid out. Our waitress gave us a lot of silent attitude. The band was playing not in harmony and took TWO breaks in one hour!"}
{"text":"Glorious lamb chops, extraordinary French onion soup, pleasant vibe and attentive servers.  Just a nice spot.  Highly recommend."}
{"text":"With the steak I ordered pretty darn good, their lamb was even better.  Not just meat but It was the whole experience that I am recommending here. I loved how the waiter treated us: very knowledgeable, good humor but not chatty, suggesting good choices of wine for our dishes, careful but not over-caring.  I loved the wine he suggested me, and it went so well with my salad blended with liquified blue cheese. I normally would not have blue cheese, but it was blended perfectly with the endives and pear and greens in the plate. The flavor filled my nose as the wine flew through my throat.   The live jazz was my favorite. The vocal, guitar, and cello humbly played in the background. Never too loud or noisy. But when I put down my fork for an appreciation, I could listen to their performance clearly and calmly. We were lucky to be seated upstairs and two tables away from the stage -- good distance to see all the musicians.  Modavie marked the best night of my vacation."}
{"text":"Get anything with lamb and you won't be disappointed. Came here based off a suggestion on Google. Definitely the best choice for dinner we could have made."}
{"text":"Good location and atmosphere. We had dinner on the lower level next to the jazz singer which was nice.  Food quality varied - the soup was great, the shrimp appetizer and the fish entree were good, salad nicoise was very bad - they first forgot the boiled egg, but were apologetic upon being reminded and brought us a couple of eggs on the side,  and the tuna tasted like chunks of salt.   Service was decent but quite slow. We were there for over 2 hours for dinner. Overall a mixed experience, and it wouldn't be at the top of our list of Montreal restaurants we'd revisit."}
{"text":"My family and I loved the meal so much we went back the following night.  The atmosphere is charming and the food fantastic.  We had ratatouille, seafood linguine and a chicken dish and all were great.  This is a must go in Montreal."}
{"text":"Delicious!  Had the steak frites and the chocolate mousse.  100% recommend.  We were downstairs but could hear the jazz at a comfortable level."}
{"text":"Our hotel in Montreal suggested we try Modavie, so at first we were resistant, thinking it might be a touristy place.  In the Old Port, Modavie is a breath of fresh air amidst much more touristy menus (although the weird digital menu boxes outside restaurants leave this US native feeling like she's contemplating a night at Chili's -- get rid of those, Montreal!).  The live jazz music inside drew us in, and we were immediately given a lovely table for two in the window where we could watch others' faces glow as they stared at the digital menu box.  Having had a late lunch, we shared a salmon carpaccio appetizer and endive salad with apples and roquefort.  The salmon was extremely fresh and the garnishes were fresh and arranged with great technical precision.  A squeeze of lemon brought out the freshness of everything on the plate.  The endive salad was also rife with bitterness from fresh endives, with a not-too-heavy dressing, and balanced by the blue cheese.  A solid way to start an evening in Montreal with small plates and seasonal offerings."}
{"text":"My husband and I were in Montreal this weekend for the F1 race. We stopped in for dinner and truly enjoyed our meals. My husband had the Lamb Cavatelli and I had the Lamb burger...we loved it so much we came back a 2nd time and brought friends..We had an equally amazing meal, and service. For Americans, I was reminded that there is a slower pace than what were are used to...the slower service is their pace...not an indication of poor service. Sit back and relax. Enjoy the atmosphere and the meal."}
{"text":"A solid restaurant located in old montreal. The menu is a little cliche, with all of your french favorites. We made a reservation, but it doesn't seem like we really needed it. There was \"live jazz\" somewhere in the restaurant but I didn't see it. There were some serious AV issues going on with the volume. Sometimes it was so quiet you couldn't hear it, punctuated but abrupt increases in volume that were quite startling. The service was friendly and helpful. We ordered a bottle of wine which was well-recommended and appropriately presented. We caved in to our cliche little experience and ordered the steak frites and the duck confit. Both were good, but not outstanding. This was a very enjoyable dining experience because of the ambiance, and I would likely return next time I am in town."}
{"text":"We had an engagement celebration at Modavie last week and Lorenzo made it very special for us. The food and atmosphere was excellent and the live jazz music couldn't be any better. Lorenzo came to our table and congratulated the bride and groom to be and the singer congratulated them as well. They even brought them cake with a sparkler candle on top of it. We had the best night and definitely it was memorable for the bride and groom. Highly recommend this restaurant."}
{"text":"Very good food, excellent ambiance. Just a detail, limoncello is not from the freezer, it is kind of cold."}
{"text":"Came between lunch and dinner. We had the poutine (not a fan in general but good), the bolognese (delicious) with handmade pasta, steak and fries and homemade bread. Definitely delicious, food service and would definitely recommend. Not sure how lunch and dinner work, I think it's reservation only, but at the time we came, it was definitely a great experience."}
{"text":"Went there during 'happening gourmand'.   Food was good 8/10.  I mostly wanted to write a review for their service. It was really great 10/10. Our waitress was very nice and social and went beyond what was expected from her. A couple beside asked her to take a pic of them, not only did she take a pic she even said there's a spot in the restaurant with a nice background, let's go take a pic there.   2 desserts were included in the menu for the event, 3rd had a surcharge. Me and my bf both chose the same one. She came back saying bad news i only have 1 left so i brought you all 3 on the house.   Ambiance: 10/10 really nice place"}
{"text":"Better than we expected for a \"touristy\" restaurant in Old Montreal.  We came on one of the last days of happening gourmand. We enjoyed all the food we had except for the lamb poutine. When it arrived, it wasn't hot and had way too much sauce. The sauce was a bit too salty and was watery. I don't recommend it at all, and it certainly wasn't worth the 5$ surcharge. All the orders of poutine except for one came out right after we ordered. I think it must have been the last portions of a big batch because we could tell it wasn't fresh. The last poutine that came out was about twice the size and was steaming hot. My partner, the lucky one who got the fresh poutine actually really enjoyed it.  For mains, most of us had steak-frites and one ordered the Duck Confit. We were all impressed with our meals. Dessert was a choice between cheesecake and tiramisu. Both were delicious.  If it weren't for the poutine, I would give this place a 5 star review. The atmosphere is cozy and the live jazz music is a serious plus. I'd recommend asking to be sat in the room next to where the music is being played. That is where we sat and we heard the music perfectly but it wasn't overwhelmingly loud. The service was excellent and friendly.  Food:3.5/5 Value: 4.5/5 (for Happening Gourmand) Service: 5/5 Atmosphere: 5/5"}
{"text":"Very nice restaurant.  Visited while vacationing in Montreal.  The Ambiance was great.  Very warm feeling and the music was a nice touch.  Our dishes were excellent and the service was on-point.  We would definitely go back."}
{"text":"Had such a great time at Modavie! I came here on a Friday night with two girl friends. All three of us were in Montréal for the first time and loved exploring the city. Modavie was a great spot to end the evening with lovely live jazz music and delicious menu offerings.  We ended up visiting during a restaurant week of some sort where they had a discounted prix fixe menu of starter, main, and dessert. We all opted to get that, with different combinations of the beet salad or poutine to start, lamb and risotto or steak frites as the main, and cheesecake and tiramisu for dessert. All of the flavors were absolutely perfect and you can tell the chef puts a lot of work into each and every meal.  We also shared a bottle of red wine. The wine list is a bit daunting, but there's certainly something for everyone, taste- and price-wise.  The atmosphere was so lovely and our server was beyond amazing. He didn't even turn up his nose when we stated that we were just too full to have our desserts there and would it be terribly gauche to get them to go. (Sidenote: they kept very well and we all feasted on them for breakfast the next morning!)"}
{"text":"L'accueille impeccable, le service plus que courtois. Table d'hôte découverte à 25$ interessante dans le cadre du happening gourmand MAIS considering steak frite is that basic classic simple meal a restaurant, especially a bistro, can not afford to miss.... First I rarely ever return a plate but my medium rare was very medium and the waiter insisted on changing it for me which I very much appreciated ensuite j'ai eu un steak plus saignant mais sèche et sans saveur. Comme si le steak avait été décongelé avant d'être cuit. Les frites étaient bonne s. Bon vin aussi.  Si le but de l'exercice était de donner envie au gens de découvrir le restaurent c'est un échec pour moi. Les chandelles sentaient la cire \"cheap\" voir le plastic brûlé. J'espère vraiment pour eux que le menu régulier est à la hauteur de l'excellent service que nous avons eu mais  je ne retournerai pas pour le savoir."}
{"text":"We came to this restaurant because it had such high reviews and specialized in lamb, but we were sadly disappointed despite the romantic charm of Old Montreal.   We started the night off with drinks, but were sadly disappointed by their use of premade mix and not egg whites for their sour drinks. Although, they did serve us with a giant glass goblet, which was much appreciated. We then had the lamb poutine, which really did not do justice to the classic Canadian dish. We had to hunt for cheese curds, and the sauce was practically absent. It was literally a spoonful of lamb on top of, surprisingly, crispy fries. We also thought the lamb was oversalted.  The entrees were average at best. We had the sesame-crusted lamb chops, which were okay but nothing to write home to your mama about. The brie mashed potatoes, however, were definitely interesting and stood out in this dish. We also had the catch of the day, which was, again, average. Not what I expected from a French fine dining restaurant.   If you're looking for drinks, go somewhere else. If you're looking for poutine, go somewhere else. If you're looking for haute-cuisine, go somewhere else. If you're looking for an average restaurant to hide from the snow and rain from, come here. You're welcome.  PS If you're looking for a nice and romantic ambiance, this restaurant (the bar area) is alright."}
{"text":"The ambience of the restaurant is nice and the band was a great touch upstairs. It was New Year's Day so being one of the few restaurants that was open it was really busy. Our waitress was great I only wish that the food was too. We had the mushroom risotto which lacked flavor and the shrimp and scallop linguine. Neither of which we finished or wanted to bring home. The linguini had what I think was tuna mixed into it and completely overpowered the dish. I wish that that was also listed in the description because I probably would not have ordered it. The scallops were also very overcooked. The salads were good the bread was good and the service was good just wish that maybe we would have ordered other items. Maybe it was an off night for us but if we return we will try something else."}
{"text":"I came here with 4 other friends from New York City for Sunday lunch. The place was fairly empty at 12pm. We were seated on the ground floor near one of the windows. The decor is wooden rusty. There were jazz music background.   Now the food: - foe gras: nothing to write home about, but it was good with bread. - smoked salmon: it was good but not too special. It looked nice though with the piece of salmon twisted like a flower.  - duck confit: solid classic dish that was perfectly done. It had right amount of fat and slightly crusted skin. This was my entree - rack of lamb: my friend ordered this and I got a bite of it. It was awesome with baked goat cheese and sesame seed garnish.   Overall, this was a classic and solid French restaurant."}
{"text":"The service and atmosphere are great. The wines and food are good.  I've stopped by previously for a bottle of wine in the afternoon. This time it was for dinner and light jazz.  The service was excellent and friendly. The wines were pricey and the wrong years for me. I had a duck breast with Chutney and my friend had a filet in peppercorn sauce.  She won.  The tiramisu was good and surprisingly better than their tarte tatin.  Coffee was stale and shocking.  Pricey and overall enjoyable.  You can do better for $165."}
{"text":"Two words.....Lamb Chops!!!  That's it, just go, order these and thank me later. Best meal you will EVER have!!!!!"}
{"text":"Not mind-blowing in that it is just not as intimate a place like Bocata a few blocks west, but very good French-style cuisine in a rocking place.  Guitarist/singer was rocking out in a romantic sort of way.  Our table had Caesar salads, endive winter salad, and I had foie gras to start.  The foie gras was truly awesome.    Entrees were mussels, duck confit, and braised lamb.   All very good.  Desserts were fondant chocolate, tarte tantin, and tiramisu.  All were very tasty and I'd go back, especially with a group or with well behaved kids.  Not quite the right place for an intimate evening, but a great place for a fun and delicious evening."}
{"text":"Went for lunch, everything was fantastic and very reasonably priced! Celiac; gluten free friendly."}
{"text":"Modavie is an excellent restaurant in Old Montreal. The food is very tasty- we started with the fried calamari and it was delicious, more calamari, less fry- the way I prefer it. We also shared the octopus and white bean salad and loved it. I had the lamb burger and it was one of the best burgers I've ever had. And I'm from NY so I'd like to think that says something. My husband had the duck confit and it was incredible- the meat melted in your mouth. My mother had the steak frites and also said it was quite tasty. We paired our dinner with an excellent bottle of French wine- also fantastic. They actually had a really nice wine selection to choose from. The ambiance is perfect- dark rustic restaurant set in an old stone building along a cobble stone street. I definitely recommend sitting upstairs to enjoy the live jazz- it was great and really added a nice something extra to our night. Would definitely come back on my next trip to Montreal."}
{"text":"This is a great place to spend an evening. It's not a tourist trap,  but an authentic restaurant where an English speaking person would be welcome. Our waiter was helpful and the perfect amount of attentive, not annoying but always ready when we needed something. We spend almost 3 hours here in the early afternoon enjoying the food, win, and atmosphere without ever feeling like we were struggling to get his attention. The food was fantastic classic cuisine, nothing mind blowing but exactly what we ordered, perfectly prepared and presented."}
{"text":"Great place with live music. Not a band but a single man with an acoustic guitar playing classic rock and pop songs.  Great atmosphere for a casual evening. Had the mussels steamed in Pernod. OUTSTANDING! Very nice Long Island Iced Tea. They were, however, mystified when I ordered bourbon.   Outstanding creme brulee to top it off."}
{"text":"With the open windows and wafts of jazz music, this place was wonderful!!  It was the most \"French\" feeling place we ate while in Montreal.  The lamb with goat cheese was phenomenal.  The cocktails, ceasar salad, and tiramisu were all pretty good too.  Lorenzo, the manager, was just exceptional!  He really made the place a *5-star* in my mind.  It did seem a little overpriced for what it was though I would certainly recommend it to anyone."}
{"text":"I'm giving Modavie an official 3 Star rating after my third visit last night. Modavie is likely the restaurant you'll be directed to in Old Port if you're looking for a dining setting with some live jazz music.   For me, it all comes down to service. Each time I've visited Modavie, I've experienced some kind of issue with rude and/or visibly overworked staff members. Last night's experience started with a very out \"of sorts hostess\" who guaranteed us we would not get a table and, after we asked for a second opinion, changed her tune and found us a decent spot upstairs. I'm not saying people need to be perfect but a positive attitude is foundational in any service job.   Food wise, it's hit and miss. My go to is typically the pork cheek risotto. You can't go wrong with the charcuterie boards. Most of their cheeses and pates are home made.   And lastly, the reason you end up at Modavie, the live music. Totally makes coming here worth it.   Will I be back? Most likely. Will I enjoy it? It's different every time."}
{"text":"Perfect spot for a great dinner experience and dinner date. We came here for a dinner date, had a great meal, and enjoyed the live jazz music. For dinner we went with the prix fixe menu, and they recommended lamb so we selected the lamb starter, and the lamb gnocci. There were other options, but we weren't let down with the lamb. We had a nice bottle of wine and port to finish off our meal. Service was nice and easily transitioned between English or French. Excellent place and I'll definitely be back. Enjoy!"}
{"text":"I know that the old city isnt known for its food, but I have to be a nay-sayer on this one.  The food was fair to middling at best.  They had a strange menu with some french and some poorly made italian dishes.  We were seated with a nice view upstairs....but we were the only ones up there. on the bright side, the service was excellent and the calamari was well prepared.  the snapper was fine, but nothing special...something I would prepare at home without planning.    Highly mediocre."}
{"text":"We were recently on vacation in Montreal and really loved this place.  The atmosphere was busy and fun.  Even though we had reservations, they were able to seat us right away on a Saturday night, which is not an easy feat in Old Montreal.  I had the steak frites and the steak was huge and delicious! Perfectly seasoned, perfectly cooked.  My husband had moules frites and his portion was huge and delicous, too.  The dish reminded him of a favorite meal of moules frites that he had some years ago in Paris.  The wait staff seemed a little harried but was professional.  Yes, this is in the heart of the tourist area, but the crowd seemed like it was (only) half tourist and half local. I will definitely go back the next time I'm in Montreal."}
{"text":"Charming restaurant with attentive wait staff. I had the grilled lamb chops which were quite good but slightly more well done than the medium rare I requested. The wine list was decent but not exceptional."}
{"text":"Amazing live music...they even managed to squeeze me in without reservation letting me know they would need my table after 9PM. i liked the hostess honesty. Great group of ladies.  Unfortunately same cannot be said for server or food here necessarily. I was feeling a tender steak and made a point to ask the server which of their Bavette or strip loin is most tender. He told me the strip loin...so I trusted him. The person next to me was having steak frites...his looked perfectly cooked medium rare. I got my steak. Well done to hell. I told my server and he looked at my well done cross section and said \"yes you mentioned medium rare...\" Mind blowing stupidity. I said its over cooked and not medium rare....he says in Canada it's medium rare...I said if this is medium rare...what the hell is well done? Charred to shit?  Anyways he claimed I should have ordered it blue and brought me a newer steak. It was better but not medium rare. More like medium. Steak was delicious but the vegetables were so/so.  I'd recommend the place for live music and OK food. Not great for perfect steaks. Prices reasonable but the food I would sort of say is below par."}
{"text":"The music was a bit loud but besides that, everything was amazing. The service was top notch. I had the fillet mignon medium rare and it absolutely perfect! The creme brûlée was good as well. I would definitely go back!"}
{"text":"This was my second time here and both times I had to have the lamb cavatelli!  I finished every last inch of it.  We started with the foie gras torchon via a recommendation from our amazing server.  My boyfriend had his first duck confit and now it's his favorite dish of all time!.  The live jazz is really nice.  Overall, a fantastic experience."}
{"text":"This is a great spot in old Montreal! We stopped here on a whim for a late lunch and were happy we did. With its wooden walls and warm lighting, it felt very cozy.  For our meals we split the mushroom risotto with duck confit and the lamb, fennel, and sun dried tomato pasta. Both were excellent! I was especially impressed with the duck - this restaurant nails it.  The service wasn't notable."}
{"text":"The lamb is a must try! Their specialty. The white sauce for the mussels and fries is absolutely delicious. Service was superb. Francoise, our server was incredibly kind and attentive to all our needs. Ambience is amazing. A must when visiting!"}
{"text":"This was a really cool restaurant. It has lots of different rooms, a bar, and live music every night (which runs from 7pm to close).  The food was very good - I had the Table D'Hote consisting of a peach salad, a halibut and grilled octopus dish, and a key lime pie dessert. All were excellent, although the halibut was a touch dry (the octopus more than made up for it).  Service was friendly and fast. They have two seatings, with the second starting at 9pm (at least on a Thursday night).  Since we came as a business group hoping to talk, the live music was a bit of a distraction. It was a bit on the loud side, even though we were in a side room (and not in the room with the stage). I think they pumped the music through speakers to other rooms. So, be warned that if you are coming to have a quiet chat, the music may be distracting."}
{"text":"So my girlfriend and I went to Modavie, a place we've heard such great things about, for our second anniversary dinner.  We really enjoyed the ambiance and the jazz music that was playing.  The tables were a little crowded (we were sitting maybe a few inches from the next table) but we weren't too uncomfortable.  Our server was attentive and spoke with both me and my girlfriend in English and French respectively.  We started our meal with two glasses of Sancerre and a nice portion of calamari with two delicious sauces.  Tres bonne!  Next, we each had a nice pasta.  Her the ravioli with goat cheese, and I had some sort of spicy sausage pasta.  Both were incredible!  We shared a nice molten chocolate with vanilla ice cream dessert.  From the moment we sat down until we left, we had a nice experience.  I only rated it a 4 instead of 5 because we didn't say to each other \"Wow, we NEED to come back!\" but in truth we had a great time, delicious meal, and we probably will be back sometime.   :)"}
{"text":"We really took a stab In the dark with this one. Fabulous staff.  We ordered cocktails and pasta dishes. My guest was very excited and then pleased by the lamb cavatelli. Great time, glad we made a reservation!!"}
{"text":"Visited this place based on the recommendations and notes about the love music. The place is much larger on the inside than I thought. I love the old school feel of the place and the extensive menu. I wanted to try everything but we asked the waiter for his recommendations. We settled on the beet salad, onion soup, mussels and fries and lamb chops. I am not a fan of beets but the beet salad was fantastic. The onion soup was so so, it looked a lot better than it tasted. The mussels were amazing. I wish I had ordered it for myself instead of sharing with my husband. The mussels we're cooked perfectly and had the best flavor, sweet and light and it went well with the fries. I got the lamb chops over the rack as recommended because the waiter said the rosemary was fantastic. The flavor was good but I wasn't a fan of the way my lamb was cut or cooked. It could've been better. Overall we we're happy with the place and I do recommend them for dinner. Good price for good food but some things missed the mark."}
{"text":"Monosh was an attentive and charming server and we selected beautiful dishes - my favorite was the salmon gravlax. Amazing. Also a surprisingly delicious Caesar salad with lardons - the best Caesar dressing I've had. We sat by an open window on a sunny day. It was delightful."}
{"text":"The owner, Lorenzo, is very kind and personable. He said us next to the live music, per our request and had a great time. I had the rack of lamb and it was delicious! I would recommend adding a soup or salad if you're very hungry."}
{"text":"Scrumptious pasta, great beer, festive atmosphere in Old Montreal."}
{"text":"Do you know what $17 spaghetti bolognaise tastes like? You can find out at Modavie. Definitely a little expensive for spaghetti, but it was the best spaghetti I've ever had. The French Onion soup was pretty darn good too! We were just walking around Montreal (We're from the US so we didn't have smart phones without date charges! NO YELP!) and we just stopped by here to have dinner and drinks. The service was excellent and the wine was too!"}
{"text":"Moi et mon copain sommes allés souper au Modavie mardi le 9 janvier. Cette soirée fut l'une des meilleures que j'ai passées dans un restaurant. Premièrement, la musique d'ambiance est plus qu'excellente! Deuxièmement, nous avons mangés le tartare de boeuf en entrée, les raviolis de wapiti en plat principal et terminé par le clafoutis aux cerises. Ce repas a été tout simplement EXQUIS! Finalement, que dire du service que nous avons eût! Notre serveuse, Ève, était d'une gentillesse et d'un professionnalisme inégalable! Nous allons y retourner c'est certain. Merci à toute l'équipe du Modavie."}
{"text":"The lamb was the best that I have ever had and the service was top notch. The wait to get what we ordered was a little slow. The place was packed the entire time we were there. The music was good but a little to loud. This a great place to eat at if you are in the city"}
{"text":"I have to say this was one of the worst dining experience of my life. The place is in a great location and the idea of live music is what made us chose it. Well....... the decor is old and just cheap looking. The prices were extremely high which is fine if the food and service are good. The salmon was almost non eatable and the drinks were shameful. $16 for a vodka on the rocks which was literally one sip. Not joking ONE SIP! Not once but twice. As far as the live jazz. The singer was on break for 40 min after playing for about 15 min. She had an amazing voice but she definitely did not want to be there. All around terrible experience! Save yourself $200 and go to one of hundreds of other fantastic places in this city."}
{"text":"I had a lovely dinner here with friends while I was in Montreal for a conference.  The food was delicious, the music was excellent - not too loud for us to converse and absolutely gorgeous (I bought one of the artist's CDs).  Drinks downstairs were reasonably priced.  It was an absolute gem of a find for us.  I can't wait to visit Montreal again so I can go back."}
{"text":"Modavie is a treasure. The French onion soup was absolutely perfect. The wine selection was stunning. And the food... Although Modavie has a full menu, it's really all about the lamb, which was magnificent. The service was also top notch. My only regret is that I had no room to try their dessert menu."}
{"text":"Lovely French bistro in Old Montreal. We were seated in the original section of the restaurant which was nice. Complimentary bread with butter was good. Foie gras torchon was good with a berry compote. They recommend the lamb chops here ($32) you get five chips with some seasonal vegetables. My first dish came out cool temperature wise, dry and well done. I pointed it out to the server and she immediately took it back. She didn't say too much when she took it away and when she brought me back a new dish. Oh well the second one was much better as it was medium rare and tender. Flavours were ok but I've had better.   My friends loved the seafood pasta and the steak frites.   Caesar salad was large but way too overdressed and dressing tasted kinda off.   Service was fine and offered gluten free options.   Bathrooms could be cleaner."}
{"text":"Very nice local restaurant , they have a fantastic French onion soup . The service was very fast and courteous . I ordered a prefix lunch 3 items 29 dollars ... Very filling and tasty came fresh and hot ...."}
{"text":"Went here for anniversary. Great place. Made a reservation for 8, but was in the area earlier and was seated at 6pm with no issues. They told us we needed to be out by 8, so they could use the table which was weird. but we weren't rushed by our waitress and seated immediately. So many thanks there to the great staff.  Ordered beet salad for an appetizer and it was tremendous. All the ingredients were very fresh. For an entree, i ordered the duck confit and mushroom risotto. Where the risotto lacked in salt and flavor, the duck made up for. Cooked perfectly. The beau ordered lamb chops, which she said lacked any kind of flavor, so that along with my risotto is the reason for the 4 stars. I'd visit again, perhaps try something else."}
{"text":"???????????? ???? ???? ???????????? ????????? ?????200?? ???????? ?????????????? ????????"}
{"text":"Was looking up \"best french onion soups\" in Montreal and Modavie was one that popped up. We weren't here for long but figured at least one of the dinners we eat should be one fancy one. I made a reservation for 530 and we ended up being late but it didn't matter I think because it didn't get that busy till a lot later. It's very dark in the restaurant but has nice vibes. We sat near the door and it got a little chilly because well. It's winter. Seating area can be a little squishy but it's not too bad.   Services was great. Food was good. The french onion soup was packed with flavour and the cheese was just amazing. It's the best when the cheese keep stretching. My pasta was interesting. It looked like a salad because it was all green. There wasn't any meat in it (wish there was, not sure if there's an additional add-on). It wasn't bad, tad plain. Tasted very healthy for sure.  Desserts: cheesecake was probably my favourite. Not too sweet either. I don't really remember much as it was a while ago but I had a great time here. Warmly greeted by staff and generally good food."}
{"text":"My friends and I drove to Montreal for a weekend trip from NY.  We made sure that before we leave we get to dine in a French Restaurant.  Although this place wasn't our original choice, it still made our trip to Montreal great.  Everything we ordered is delicious especially the lamb.  But more than the food, the service is exceptional especially our server Caroline, who took care of us and went above and beyond.  This is truly one of the best experiences we had in a restaurant."}
{"text":"In the heart of the old city, Modavie provides the perfect setting for a wonderful dinner with some live jazz for your listening pleasure.    Located on Rue St Paul the main thoroughfare of the old city, Modavie has two levels of dining.  The ground floor is complete with a small bar, plenty of tables and a somewhat open kitchen.  The upstairs has a small stage and a larger dining room the spands the length of the restaurant.   It was at the request of my associate (whom has been a previous patron) that we sit upstairs as the live jazz singer was a little loud while sitting downstairs.  But, the stage is upstairs... he assured me he knew what he was doing.  As we sat in the power table in the corner with two beautiful windows overlooking Rue St Paul, we talked about the day's meetings and discussed the future.  I started off my meal with a goat cheese and arugula salad with a citrus vinigrette.  While the goat cheese was not in the salad per se, (came melted atop small pieces of baguette) their flavor carried into each bite.  The vinigrette cut right through the tanginess of the goat cheese with tastes of pepper from the arugula.      Upon next fillet Mignon.  Cooked to a perfect rare, this steak was succulent. With a small portion of risotto and sauted veggies to go along with it, I was a happy camper.  The name of the wine we had escapes me but I remember it went well with the steak.  Modavie being a wine/ jazz bar there will be no shortage of choices when looking for that perfect bottle."}
{"text":"We were on a cruise and decided to try a local restaurant. We stopped at a hotel and they told us to go to Modavie. We are so happy they did. Fair prices and excellent food and service. The Lamb burger is as good as I have had. Worst the short walk from the cruise terminals."}
{"text":"Surprised i have never been here. But it was a good find in my city. I loved the live blues. My meal was excellent. I wanted the mussels but i was told it was a very unique taste. Which i would not like. So i have the oniin soup and the filet mignon. Both excellent."}
{"text":"Yum!! Such a cool restaurant and bar. Love that they take reservations. Love the live jazz music. Love the style of the interior.   Food was great and not what I was expecting in terms of portions (they were big!). Had the calamari and lamb chops. Calamari appetizer had so much calamari I had to send it away with over half still on the plate! Came with 2 sauces to dip - a marinara and an aioli. Lamb chops were good but I'd probably get something else next time. My friend had the rack of lamb which looked good and I snuck a bite of that delicious cheese it came served with!  I like that the wine comes in 5 oz and 8 oz pours. Hello, 8 of course! Wish I had room for dessert because they all sounded good but the wine was enough!"}
{"text":"Excellent experience at Modavie! Reserved on OpenTable and had a great table waiting for me and my family right by the music, which was so awesome, and not too loud or overpowering. Food was excellent, and we had a person in our party with Celiac who was able to choose from several choices, and our waiter went back to the kitchen to check all the meal choices with the chef to ensure no cross contamination. Was a great find, and great evening. Even ordered dessert so that we could stay longer! Highly recommend!"}
{"text":"The live music was good! I tried their special course meal with frog legs and quail. Personally, i didnt find the food surprisingly good. It was ok compared to the high price we had to pay. But its definitely worth going to have some nice music and wine."}
{"text":"I was really afraid that this is one of those tourists trap given its location. Turned out that it's really a nice bistro with well-priced food, great live music and pleasant decor in old-montreal style building. We came for the happening gourmand event with the set menu. Mushroom Risotto with duck confit was well-seasoned and in generous portion. The dessert was great. Not much comment on my appetizer but my friend who ordered salmon tartare looked delicious (she did say that the calamari is not her best).  The highlight of this place is the live music and impeccable service if you want more than just good food. (It took us 20min to get the table even with a reservation, but the owner kept apologizing and served us free 10-year-old port wine with our desserts)."}
{"text":"J'y suis allé 2 fois, une fois pour le lunch et une fois pour souper. En gros, la table est correcte, mais juste correcte. Les prix aussi. Certainement pas l'endroit pour souligner un événement spécial ou pour s'offrir une expérience gastronomique, aucun des plats que j'y ai goûté ou vu m'ont semblé sortir de l'ordinaire. Bien pour les groupes, par contre.  La carte des vins est correcte aussi.  Correct, je crois bien que c'est le mot qui convient à cet endroit."}
{"text":"Had a wonderful dinner here while on a work trip.  Was able to get a reservation online before flying in, which is very convenient.  I was staying in Old Montreal and was very pleased that this place was around the corner.  The ambiance is nice and live music is always great with dinner.  The food was good and affordable for the area.  I got the catch of the day, it was simply but hit the spot.  Also the staff is very friendly!"}
{"text":"Duck leg comes with the mushrooms sauce rice. Flavor is ok but the rice is raw which ruins the dish totally. Rack lamb is their signature but lamb does not have any flavor.... overall, this restaurant with this price makes me very disappointed."}
{"text":"Beau resto, tres busy , d'un coté du resto il y a la musique live mais de notre table on ne l'entend pas, belle déco avec lumieres tamisées. La bouffe correct. Le tiramisu reussi."}
{"text":"Woah, this place was great. We stopped in for a beer... didn't eat. We were quite entertained by our bartender as well as a local liquor salesman who came in. We absolutely loved Kathryn! Unlike many of the French Canadians we encountered, she was extremely friendly and helpful. She tells us there is jazz every night and that many famous people have visited. We can tell why. It felt very comfortable and easy at this quaint wine bar with tin ceilings, lots of charm and a long list of vino. Go!!!"}
{"text":"This place was awesome. Came here for lunch one day during my bachelorette weekend with my friends, and we all enjoyed the food! The soup of the day was cream of vegetable.... i can not rave enough about it. We still talk about it. I also had the croque monsieur.. delicious! Waitress was fabulous. I will definitely be back when we travel back to Montreal :)  Thank you!!"}
{"text":"Delicious find! Everything was amazing! I loved their French onion soup (tons of cheese over rich broth) and they fried calamari. They are famous for their lamb but I got their duck confit over mushroom risotto which was absolutely delicious. A perfectly cooked duck leg with cranberry sauce over creamy risotto. My friend loved her mussels with fries. Great place with good ambiance, delicious food and live music. The live music was great (guitar with female vocalist) and not super loud. Cannot recommend this place enough!"}
{"text":"Excellent food and service.  My server recommended a great local beer.  Nice foie too."}
{"text":"A wonderful choice for dinner in Old Montreal. My date and I shared the duck confit and the lamb chops - the lamb is their specialty. The food was delicious, and there was live jazz music. One thing to note is that their portions are quite small - you'll either need to order quite a few dishes or be prepared to explore nearby for other food (I highly recommend going to Chinatown)."}
{"text":"This was our first place that we ate in Montreal.  We just happened to luck into it.  Went in during lunch, and saw that they had a lunch special.  The deal? $12 for an entree and a soup or salad and a beverage (coffee, tea).    I got the lamb shank.  So wonderful.  Meat was very tender and lots of great flavor (greek syle).  And even the soup was one of the best soups I've ever had...a saffron potato soup...it wasn't lumpy or thick and the saffron flavor was perfect.  It was so good that we went back two days later cause we knew we were going to get a great meal for a great price.  Only disappointment was that they had a different soup; still good, but not as good as the saffron potato soup. So I'm giving this place five stars specifically for it's lunch special.  I don't really know anything else about it.  But if you're around the area for lunch, it's a must."}
