{"text":"Best tacos ever.  The pork tacos were delicious... definitely the greatest I've ever eaten.  Track this food truck down for wonderful food!"}
{"text":"Modern Tortilla has came to my place of employment several times. 05/09 they were there again and they never let me down. Those Burritos are the best I ever had. Carne Asada has so much flavor. I would recommend this Food Truck to everyone. I talk about you guys all the time. 


The only disappointment today was the beautiful lady with the amazing smile taking our order had a wedding ring on.  Lol! 

Modern keep doing what you do!"}
{"text":"Mediocre food at a premium price.  I spent $18 on a burrito and two tacos.  They didn't have the pork (one of three taco choices).  The carne asada was chewy, not great quality, and not tender.  My girlfriend didn't finish her tacos.  The rice was pretty bland as well.  They wouldn't give a discount for a coworker who just wanted a plain quesadilla and they charged her $11.   Just want to give you a heads up before you go here."}
{"text":"The company I work for did a private event with modern tortilla coming to our workplace. The food was awesome, the service was fast, and everyone at the office loved the entire experience! I had two tacos-one was pork and one was chicken. Great flavors! We also had a choice of different flavored tortillas that they make fresh on site. The chips and salsa Fresca were on the side and were also amazing and fresh!! The best part was the chocolate and caramel churros also made fresh for desert-so yummy!!!"}
{"text":"OK so I had the flautas...i think thats how you spell it..anyway they were delicious however the street corn was so so and the service was the pits...the absolute pits..NEVER AGAIN even though the flautas were yummy."}
{"text":"My office ordered catering for a lunch group of 30 - we selected the chicken and carne options for meat, a green salad, and Modern Tortilla provided all the toppings.  The delivery was on time, and the food was hot.  While setting up the food the employee asked me when the party planned on eating, and provided specific instruction on the tortillas as to ensure they did not get cold or soft.  

The lunch was a hit and we would definitely use them again!"}
{"text":"I came across Modern Tortilla at the food truck event in front of the chef store in tempe and I can say I am glad that I did. The food was very different from any other taco truck, and different in a really good way. Everything looked brand new and clean, the team was smiling and seemed to enjoy their work. I saved the best part for last, the food, absolutely amazing! I had the pork tacos followed by their real deal churros, which I can assure you were the real deal and delicious! I will be eating here again next time they are in Tempe."}
{"text":"What a cool truck! The food is amazing and they make their own tortillas that are gluten- free! I can't wait to follow these guys all over town and will def be using for my catering needs... My first grandsons 1st birthday is coming up!!! A pony, and a street taco; what a hit Nana!  Next time I'm trying the elote; Mexican sweet corn. Yum-yum-yum-yum!"}
{"text":"This truck was hired by our school for teacher appreciation and it was incredible!!  Would recommend highly to anyone."}
{"text":"I'm sort of surprised by some of the negative reviews because my experience was top notch from start to finish.  I was planning a graduation party in Scottsdale for my ASU grad...28 and finally doing it.  Coming from Houston, I had no idea who to call (only 5 days before I might add) and found Modern Tortilla online.  From my first call to Kyle, to the arrival of the truck, there was not a minute of stress or feeling unsure. They promptly responded everytime I reached out.   Thankfully Kyle didn't overwhelm me with choices.  He basically told me what I needed to serve.  I made queso dip and guac, (lots of booze of course) while they made chips right on the truck and served delicious salsa.  Boom, party.  So the truck set up in the driveway, cooking great street tacos, beans and rice.  The guests loved the whole thing.  I wish I had some seating out in front by the truck, but no one complained.  The churros for dessert were a huge hit, I'm eating one with my coffee this morning.  Laura and Tom were professional, but fun and kept it all going.  They have this down to an art.  Don't hesitate to call these folks, your party will be mindless for you and a blast for your guests."}
{"text":"This food truck is delicious! They have homemade flavored tortillas.. I have never had anything like it! So good!! I recommend the cilantro lime tortilla. They have a ton of toppings to choose from so it's fun to always change it up! I would eat here everyday if I could. They always post their lunch stops on their Facebook page. So it's super easy to find them. Also make sure you get the churros it's like $2 for a plate of them ( such a good deal ) as for a drink the horchata is bomb!"}
{"text":"I'm sure their food is good but their service takes forever! We only have a 1/2 hour for lunch and it took the whole 1/2 hour plus  to make 2 tacos and a side of corn."}
{"text":"Stood in line in the sun for nearly 30 minutes only to be snapped at \"cash only now!\" by the grumpy lady taking the orders.  You'd think they would put a sign over or near their \"credit cards accepted\" logo sticker but nope, they prefer wasting my lunch break and providing poor customer service.... Beware before waiting in line!  They may or may not take your card, even though the sign is up that they DO."}
{"text":"Their steak burritos are juicy and delicious! The steak is well seasoned, cheese, sour cream and probably cilantro and onion in the burrito lol I pretty much devoured it! Their salsa is also flavorful. It's a chunky slasa It's definitely a \"Modern\" burrito! Will be following this truck for life!"}
{"text":"Nice looking truck. I recommend the southwest egg rolls, elote, the horchottas are perfect. The flavored tortillas are great! Gluten free to boot. staff knows how to make great food! Thinking of using them to cater a party in the future."}
{"text":"Solid eats.  We had a private party catered by Modern Tortilla a couple months ago.  They served about 40 of us and everyone raved about them.  They arrived on time and all of our guests enjoyed being able to create custom tacos.  The homemade salsa is on point and their tortillas are my favorite part of the taco.  Lime cilantro and smokey chipotle is what I recommend.  We chose two meats: carne asada and chicken pastor.  I couldn't get enough of the carne asada.   It has to be something in their marinade. I hope they start getting into the food truck rotation on Thursdays at hayden ferry.  Let's make it happen guys.  I need more Modern tortilla in my life!"}
{"text":"Awesome food, great service.  The ordering forms were cool and made it easy to customize my tacos.  I got one beef and one chicken, and they were delicious!   The tortilla chips were thin, crispy and perfect and I loved the salsa fresca!  Also got to try the eggrolls...amazing!  Can't wait to eat at Modern Tortilla again!"}
{"text":"Most of the previous reviews feel like they're written by people associated with this truck in some way. Suggestion, if you run out of salsa, tell people when they order the chips and salsa as the side so they can change it to the rice. Nobody would order just tortilla chips with no salsa as their side. 

Otherwise the tacos weren't bad and I liked how many toppings they offer. Made it to the truck fairly early on and they had run out of salsa (which seems ridiculous for a taco truck) fish and agua frescas and at least one flavor of the tortillas, which they also failed to mention when I placed my order. 

Glad I tried it but probably wouldn't go back unless I was having a serious taco craving."}
{"text":"I ordered the chicken tacos for lunch today and they were by far some of the best tacos I have ever had.  Words cannot describe how good these tacos were.  They were even better than Las Cuatro Milpas in San Diego!"}
{"text":"I started with the Mexican sweet corn it was amazing and then ordered the pork pastor and steak tacos. The pork was tender and had a sweet finish and the steak seemed freshly prepared and marinated. The flavored tortillas were my favorite though, I had the cilantro lime and chipotle. You could tell they were homemade and fresh. Lastly, the order sheets made ordering easy because of the many available options. Will definitely come back next time they are at the office!"}
{"text":"Just ate at Modern Tortilla for the first time and it was amazing! I had the Al Pastor tacos and churo and they were unbelievable. The best item by far was the elote though. I literally got a second order right after I finished the first because it was so good. I will definitely be searching them out again!"}
{"text":"I've been wanting to try this truck for a while.. and today was the day.. Aioli Burger is one of my top 5 favorite food trucks in the valley.. why not try another creation done by Chef Tom. 

Not the best experience. homemade corn tortillas all tasted the same.. and we're hard, luke warm and fell apart when folded.. The Chicken was decent, Carne need ed a little salt and some lime (which was on my list of 3 toppings and were forgotten). Al Pastor need the most work lacked flavor ( and I'm all about Al Pastor). 

Mexican fried rice was decent, and I like the concept. What really got me was \"The Real Deal (Resturant Depot) Churro\" with the side of dulce de leche dipping sauce.. never got my dipping sauce..

Over all would probably never seek this truck again.. along with 98% of the food trucks in the valley. The mom and pop feel is dead and it's now about how can I do this easy and cheap to make the most money.."}
{"text":"Really tasty steak tacos! A bit on the pricey side for 2. The steak is chopped into small pieces and you won't need a toothpick afterwards (BONUS) :)"}
{"text":"I want it first to be known that my previous review was taken down by Yelp, so we can start off with how amazingly dishonest this business is.

They came to my work yesterday.  It was a hot day.  It was a record hot day.  116 degrees.  Quite hot.

I ordered a cod taco and a pork taco.  The pork was very gristley.  The cod was very stinky, but managed to have no flavor at all.  Both tacos came topped with shredded cheddar cheese.  This cheese was similar in color to the cheese from Taco Bell, but it was also similar in taste, texture, and flavor.  If the meat was as good as Taco Bell, I wouldn't be able to say these were the worst tacos I'd ever had in Arizona.  That title would belong to Taco Bell.

But they've been dethroned.  Modern Tortilla makes the worst tacos I've had in Arizona.  They also took home the gold for worst Mexican food, worst Tex-Mex, and worst Food Truck.

I've never had a taco so tasteless as that cod taco.  The Taco Bellian cheese overpowered any other flavor on the taco.  I took two bites and threw it in the trash.  That's EXTREMELY uncommon for me.  I eat when I'm full and eat thing I don't like because I brought up not to waste food.  But screw that food.  It was terrible.  And I was extremely hungry because I hadn't had anything to eat since breakfast the day before.

So what I'm saying is that they're the worst.  Enjoy."}
{"text":"First experience with Modern Tortilla was at the food truck festival in Peoria. My boyfriend and I decided to try, and we were blown away! AMAZING!!  Also their elote is fantastic!! That's a must have! Their flavored tortilla were definitely a nice touch! Highly recommend tracking this food truck down and trying it!"}
