{"text":"This place is amazing youve got everything you need in one location!! Keep it local, maggie matt and the crew are always so accomodating. Yoga spa juices what else do you need!! Highly recomend modify!!"}
{"text":"Great place to spend a day. I love that I can take a yoga class and then stop by the vegan cafe for something fresh. A variety of great classes and teachers."}
{"text":"Had a great experience while visiting for 2 weeks. The staff was very friendly and the entire studio had a welcoming vibe as a traveler! I have not always had the same experience at other studios."}
{"text":"I love the relaxing, friendly environment. I feel like I can leave all my problems at the door and enjoy a yoga class, a hair cut, a massage, or something healthy and delicious from the cafe and walk out feeling like a million bucks! Safe to say that I'm a fan! Modify might just be my new home away from home."}
{"text":"I don't know if it's the people who work there or just the general vibe and atmosphere of the place that makes it feel so inviting.   As soon as you step inside your presence is appreciated, always greeted with a smile that says I love what I do. Wether you've scheduled a hair cut from the solan or signed up for a yoga class you will instantly pick up on how passionate they are about their work.   They have a great selection of organic products and alternatives, as well as a cafe that utilizes some of the most natural and organic foods possible.    The store is always in good condition. Well kept, clean and organized. I defiantly recommend you to try any of the services they offer here. You can't go wrong . 5 star"}
{"text":"I came here on a random whim and I'm glad I did.  I absolutely loved it.  I took a 9:30AM class (forget the teacher's name, but she was excellent).  The entire place is welcoming, chill and just has the perfect vibe you want for a yoga studio.  I came in tired from a morning hike and left relaxed, refreshed and super zen.  They really went out of their way to make sure you had a great experience. As a drop-in to many yoga studios nationwide, I can't say this is always the case.  Once I move out to Arizona, I'll be here a lot."}
{"text":"I was planning to be in Scottsdale for work and found Modify online while searching for yoga studios to visit on my trip.  I send Maggie an email with some questions and she was very prompt to get back to me.  I attended the 6pm mixed level class on Thursday night and it was really terrific.  Maggie is very welcoming and a great teacher.  It was a great class - both challenging and fulfilling - everything a yoga class should be.  I look forward to coming back to Scottsdale and taking another class when I do at Modify."}
{"text":"I met Maggie when she was teaching one of the free Lululemon yoga classes and when she mentioned that she was opening a new studio in Old Town, I was intrigued.  And now, having been there several times, I'm really glad that I was. Maggie has created an amazing space that is not only a yoga studio, but also a hair, makeup and spray tan salon... and hopefully soon, a natural-foods cafe. Of course, as a guy I have my barber, but everyone I talk to says Maggie is a great stylist.  As for me, I just know that she is a great yoga instructor. She teaches the basics in a clear, understandable manner, that helps beginners to learn and also works for those of us who have been practicing for a while. Even while continuing the class flow, Maggie takes the time to give one on one instruction and to teach new moves,  Plus she's not the only great instructor at Modify. Misty teaches both flow and restorative yoga classes that leave you feeling great and Alissa teaches a yoga nidra that took me deeper into meditation than I have been in years.  So if you're looking for a yoga studio and want to take your practice to a new level, check out Modify!"}
{"text":"So much to offer...  I love Modify. I love its vibe, I love its services, I love its people. It's vibe is welcoming...not necessarily yogi-like, which can get a bit stale...just authentic, like they are really glad to see me! I love its services, from its juice bar, to its little shop on site, to all the different types of classes: acupuncture, healing sessions, meditation, AND yoga...it's all my favorite things in one spot! And the people there are just a joy to spend time with; everyone is completely engaged, and I always see everyone smiling!"}
{"text":"Why have I not reviewed Modify?? It has taken toooooo long! Yoga: Since my very first contact with Modify, they have been nothing but kind, helpful and supportive. The yoga classes are awesome! I have been on off and on newbie yogi for years. This was the first studio that took the time and had to patience to really help me do it correctly. Adjusting lightly, pushing me a little further, encouraging me to go a little deeper. The basics are a great way to refresh your muscle memory and go a little deeper. The flow classes with Jules and Lorel fantastic!! They are amazing people here and I HIGHLY recommend you take a yoga class here! They also have extra classes that introduce you to different types of yoga, meditation, eastern medicine. Yoga Nidra (amazing), Gong Meditation (YES!!) group acupuncture (Darrin is amazing!!)  The cafe! YUM! Best salads and juices ever!!"}
{"text":"Love this place! It's a relaxed atmosphere with great and friendly staff. The yoga classes are the best with awesome variety. Jules Flow class on Saturday morning and Mod.I.Fly (Ariel yoga) on Thursdays are a must!!"}
{"text":"I attended a yoga class here this morning. It was a very relaxing and enjoyable experience. The instructor was very knowledgeable and interactive. The the class was challenging but not too difficult for a beginner, I even worked up a sweat. This studio offers massages, salon services, and a juice bar is coming soon. I will definitely be back and will be recommending the studio to friends."}
{"text":"Once in a great moon one is blessed with a great find. Put Modify in that category. I apparently have a very sensitive scalp. Coloring my hair has not been met with very good results. Colors were ..ok but bad allergic reaction. Needed something with less harsh chemicals I have tried many salons, many were considered high end. Thought if I spent more id have better results. Not true. My wife informed me of her great find after her stylist left Toni n Guy for Modify. She thought I would be comfortable there and always liked her results(me too!).   Great color job and new style. Everyone at work couldn't figure out what I did but kept getting compliments. Never noticed the dye job just thought I combed it differently. PERFECT! A great big Thank You to Maggie and I will see you again!"}
{"text":"Maggie is a short hair expert! Constantly get complements in my cut. But one of my favorite things about getting my hair done by Maggie is her head massage during the shampoo! Heaven!"}
{"text":"I have known the owner, Maggie Carvalho for 17 years.  She has been cutting mine and my daughters hair forever.  She gives wonderful head massages, while she is washing your hair.  I also have been taking restorative and gentle therapeutic yoga for the last 3 weeks.  I am a Breast Cancer Survivor, and the environment is so therapeutic, happy, understanding, professional, calming and peaceful.  I take Yoga with not only Maggie, but Misty, Heather and Alissa.  They are all so supportive of my journey, and we use lots of props, for instance, blocks, blankets and straps.  I support Maggie and Modify, 1000%.  You need to go and try it for yourself.  She is offering all kinds of specials through Groupon for 19.99 for a month of unlimited yoga,and meditation classes.After that the  Monthly unlimited yoga will be  69.99 till December.  Then it will be the regular price of 99.99. And if you are a Student from ASU, for instance she has Student Specials too!!! Tell me where else you can receive Professional Yoga instruction, with instructors who are willing to teach and help you modify to do Yoga, an amazing hair stylist, a Make-up Artist, Massage and a Cafe all Eco-friendly!!!   Modify is an awesome experience!!!  Go check it out!!!  Nancy B."}
{"text":"Our work team stopped by on a corporate scavenger hunt and Isiah was a great host and all-around good guy!  The smoothies are fantastic as well!  Thanks for the wonderful hospitality!"}
