{"text":"One star for doubles and negative for chicken w/ rice and goat curry w/rice. Rice dishes lunch special literally had one table spoon of meat and one table spoon of potatoes  - wtf - ripoff. My goat curry had 100gm bones and 3gm of meat with one tea spoon of sauce or gravy but thankfully there were two small 20gm of boneless chicken in chicken curry w/rice. If you are on high carb diet then this place is highly recommended but not for meat lovers or curry lovers.  Would like to learn from others - how there experience was ? Not impressed and highly disappointed !"}
{"text":"Small mom and pop shop with communal tables when busy. Great food. I have visited twice and ordered the  same thing both times, doubles and boneless chicken roti.  When you get it right the first time, why screw the order up? =)    Reminds me of home cooked meals at my Trinidadian godmother's house."}
{"text":"The only reason I haven't given 5 stars is because I can't speak to the entire menu. The roti's are so good here that I never stray from them and order anything different. I've tried roti all over Brampton/Sauga and Molly's is still my go to! Its not overly dry (which is my usual complaint when it comes to roti) and they always give you a ton of chicken/goat/whatever meat you're ordering. And Molly herself is always there :)"}
{"text":"Below par. Pretty awful actually went once will never return. Had the roti and doubles. Skimps on chicken big time. Tasteless. Don't waste your money on this place."}
{"text":"I don't understand the lackluster reviews for this restaurant. The roti is excellent & the doubles are well spiced (and priced!). The staff is friendly and courteous. The place isn't glamorous, but the food more than makes up for that. There are half a dozen tables if you want to eat in, but we generally get our food to go. I usually get a chicken roti but they do offer vegetarian dishes too, as well as Halal.  Highly recommended."}
{"text":"I had a doubles and a mini chicken roti here today, and both were good. I particularly liked the fact that the roti came in a smaller format ($3.50). There are 4-6 tables to sit at, as well as a bar with a couple of stools at the window.  This plaza on Chrysler has several restaurants that I'd like to try."}
