{"text":"Over the past  few years or so, I've become obsessed with pizza. It used to be that I could take it or leave it. My mom and aunt make some of the best I've ever had and honestly, most pizza joints just can't compare to what I get at home. My expectations may be too high because of my upbringing.

That said, I was expecting a lot more from Molta Bella after hearing good things about them from several people. Even the pictures here make the pizza look delicious.

My parents had some sort of BOGO coupon, so we used it a few days before Christmas when nobody felt like cooking. 

We chose the Molta Bella pizza and another with mushroom and onion. The Molta Bella was slightly burnt AND soggy. (When I say \"slightly\" burnt -- well, it was visible to the eye that the pizza was too dark on the bottom.) I'm not sure how those two things (soggy AND burnt) can occur together in a pizza but they did. It was also mostly flavorless. We were all adding salt to our slices. A bit more garlic may have helped. The mushroom and onion pizza was a bit more flavorful because of the red sauce. 

I don't like giving bad reviews -- especially since this was the first try for Molta Bella. I'll try to give them a second chance.... but honestly, I took my kid to Chuck E. Cheese the other day and even their pizza tasted better to me."}
{"text":"We were looking for something different than the usual chain pizza and yelp gave us Molta Bella!  We got a great deal on two pizzas which were both really tasty.  There was a plentiful amount of cheese and lots of toppings.   The best part of the pizza was the dough, so fresh!   This place was definitely many strides above any chain in the Willoughby area at a price reasonable to a chain.   

My \"pizza connoisseur\" husband would have liked more sauce on the pizza, but I thought it was spot on!  

Trying something new by eating Molta Bella was a good choice and next time I'm in town craving pizza I would definitely order it again."}
{"text":"AHHHmazing!   Service is great, it's personable and genuine. The owner takes pride in his business and it shows. The crust is crispy and satisfying. The sauce is sweet and unique. There's a hint of garlic to the pizza. I had the pizza with meat on it. The toppings were flavorful and large. No magnifying glass needed to locate toppings!  The best pizza I've had in a long time. I will definatley return for a second visit.. The garlic hot wings are delicous too!  I've grown tired of most pizza places. They're overpriced and have weak toppings,flavor and crisp.  When I ask for a pizza cooked well done. Most will not do it.. This place is more than willing to assist."}
{"text":"This review is about the customer service/operational aspect of the restaurant.  NOT about the food -- because we never got to eat the food!

We had never heard of this restaurant until I received an offer from AmazonLocal (via LivingSocial).  I purchased the $14 dinner -for-4 voucher and the next day called the restaurant as instructed.  A very nice man told me that unfortunately they could NOT accept the coupon until 4 days later due to some sort of code issue.  

Since the whole family now had pizza on their minds, and since I actually liked the person I talked to on the phone,  we decided to drive the 20 miles anyway and show up at Molta Bella, just to try out the food -- unfortunately, we were stopped at the counter by a sour-faced teenage cashier, who informed me that \"we are backed up on phone orders\", and essentially told us they are too buy to serve us.  I looked around the tiny dining area, it is EMPTY!  Apparently the carryout/delivery orders have overwhelmed the system and they did not want to serve dining-in customers.  We literally walked next door and ended up eating at Subway (btw, actually quite delicious).  We drove 20 miles just to eat at Subway! 

My conclusions/advice:

1. The sit-down ambiance is terrible.  The area is dark and windowless. 
 
2. If you want to eat there, CALL FIRST 

3. Beware of the disconnect between AmazonLocal/LivingSocial/Groupon and actual establishment.  It might not be ready to handle the business generated from this type of promotion."}
{"text":"The pizza was pretty good... But not great. Everyone liked it, but didn't love it. We would go back but I'll try different places first."}
{"text":"While it is not the best pizza in the world it is great pizza for the price. You can get a large one topping pizza for $6.99 for pick up. It is way better than the pizza chains, and the price can't be beat."}
{"text":"Yay for Groupon! Otherwise I wouldn't have found this place. It's tucked in a strip mall in Willoughby and from the outside it doesn't look very promising. The inside isn't all that promising either, but we're talking straight pizza here. The owners are friendly and were great at making sure that we were satisfied with our order (we dined in).

The pizza itself is great. There's a distinct crunch when you bite into the crust that's satisfying and the choice of toppings were good. We got the molta bella pizza which was flavorful and thankfully not watery like so many other veggie heavy white pizzas, and the meat lovers pizza which was loaded with meat (duh) but you can tell that the ingredients were quality (quote from the BF: \"The bacon looked like it was cut up from strips, not bacon bits like you can get everywhere else.\") crust was worth eating and I sorta wished it came with some sauce."}
{"text":"Service was great! Staff was attentive and friendly. I got the salad and Molta Bella pizza and really enjoyed it. Wish the pizza had a more flavor but the crust was sooo good. Will definitely eat here again!"}
