{"text":"This is probably my favourite place to go for sushi. The sushi is fresh and delicious! The service is good, and the prices are reasonable. Good sized portions, and I love the sushi pizza here. Better than anywhere else hands down!"}
{"text":"Their sashimi pieces and special sushi rolls are unbelievable. Quick and good service - a neighbourhood gem.   Nice quiet restaurant for sushi lovers in Clarkson."}
{"text":"been coming here for the past two years, have told family and friends about this place...all good...until my last two visits.   SLOW service to the point of frustration. (our sushi sat at the sushi counter for close to 10 minutes before the waiter noticed it)  MASSIVE maki pieces with tons of rice, I should of taken a photo of this disgusting monster.  I don't know if its new management or what, but it will be our LAST visit to this sushi restaurant.   *the visit was on sunday night. oct 31 2010"}
{"text":"We optimistically decided to give this a go, despite the poor online reviews on yelp and restaurantica.  Next time I'll heed the advice from fellow foodies and listen to their the warnings.  The service was barely non-existent.  We had to aggresively keep giving our order sheets, despite the fact that we were seated right by the counter.  Many items that were ordered did not come at all. They were hording wasabi like it was being rationed - and I guess ginger is a luxury as we never received one sliver.  Our water never came and tea was topped up once, at the end of the meal.  So many items we ordered never arrived. If after reading this, you still decide to brave this place, I suggest you keep track of your orders on a separate order sheet that you don't give to the staff.  Overall, such a poor experience - the bill was over $100 for the 4 of us.  For that, you can go to a decent sushi place and get a big boat and some other dishes.  Seriously, don't think that \"all-you-can-eat sushi\" - what a steal.  The exact opposite."}
{"text":"Good service, bad fish.   What they sell as white tuna is not tuna, and snapper is not snapper.   Had a sushi boat and got sick. Since it's a walking distance from home gave them another chance but got sick again. Fish are too mushy meaning not fresh. You can get this quality of fish at any Chinese operated AYCA sushi place for much better price.  It's a shame since I all my sushi spots are in Toronto and was really hoping this place to work out."}
{"text":"So good!! It's the best sushi I have tried so far in the GTA. Food here tastes very fresh and the service was fairly quick. I would recommend the black dragon rolls and the dynamite rolls. However, I would not recommend the \"Inuit\" maki rolls as I found the garlic flavour didn't go well with the rest of the roll- personal preference! The servers are shy but offer attentive service.  I will continue going back here as it is local and delicious!"}
{"text":"This is one of my favourite places to go to for sushi in Mississauga. It is too bad the service is not always pleasant."}
{"text":"Good sushi but very overpriced. $20 for volcan roll should have more then 6 pcs... Not sure if I can give it 4 stars"}
{"text":"OMG!!! I LOVE THIS PLACE! AGHHHH! :D This is probably the best place ever! It is like heaven! I'm not the raw fish type of person, however, I am addicted to this place! I just love the Spicy Salmon Roll, aghhhh my stomach jumps each time I pass this place.  At first, the waiters did give my family and I, a very intimidating glare; probably due to our 8 seats request (their max is 6 haha).  But anyways, after ordering a Love Boat B (?) We were amazed by the taste, and freshness of the sushi... truly amazing.  Also, the Miso Soup here is quite good unlike a lot of other sushi places.  I AM DEFINITELY COMING BACK HERE AGAIN!!!!"}
{"text":"After reading the reviews, I am bit hestitate to go there.  But it is picked by the host, I have to give it a try.  The restaurant is more than half full when I arrived. We are at the corner table which is a separate separated area.  We order all the sushi, sashimi, udon, teriyaki and udon.  There are some items that can order only once.  Each one can order a pop.  The dishes arrive one after another.   Then we find out that some dishes did not arrive.  The manager who serves our table told us that the dishes are really missing.  Sorry about that and we have to put order on the order sheet again.  The shrimp teriyaki will have to wait a while as there are a lot of customers. However the eel is all gone.  How come they never tell us when we order!  Although the manager rectifies all the situations, the memory is not that good.  But he tries his best.  The food taste is not bad."}
{"text":"First time here for take out and it will be my last. Ordered a spicy salmon roll and what I got was a tempura bits roll. Barely any salmon in the roll, such a waste of money. I hate when restaurants skimp out but this is definitely the worst I have seen. So disappointed and upset. Please see images for how little salmon was in my roll."}
{"text":"They're level of service is always amazing, but this time they had completely outdone themselves. I mentioned that I was pregnant, so asked if the raw fish on the sushi could be fully cooked. Not only did they do that, the server informed me that the chef would be taking out the fish eggs too, which I wasn't aware of. After almost 7 months of pregnancy I was able to settle my craving for my favorite sushi roll, the fire white dragon! To be completely honest, I think cooking the fish fully may have enhanced the flavour. I'm so happy with the way they tried extra hard to accommodate me even though I would've completely understood if they had just said \"sorry, we can't do that,\" but they didn't go the easy way, which made me love my favourite sushi restaurant even more!  Based on previous experience, I know these rolls are amazing, but it seems all their food is great: Blue Mountain roll, Volcano roll, Sky roll, any spicy salmon, and, of course, my favourite roll of all the time, the fire white dragon."}
{"text":"This is a great spot. I came here with my friends and her two kids. We were greeted immediately on arrival in a very upbeat and friendly manner and seated quickly.  My friends kids had never had sushi other than maybe a couple of grocery store options. It was pretty cool to see that this place had a kids menu. With really decent portions! (They also ended up liking most of what they had).  My friend and I both had the sushi and sashimi bento boxes. Yes, they weren't cheap but definitely comparable to other places cost wise with what I consider to be better quality and portion size. Everything was tasty and I devoured it all! The fish quality was excellent.   The server was quick to refill tea and water and check in when needed. This is a great little neighborhood spot, work checking out."}
{"text":"Recently, I've had the chance to go here for lunch & dinner (2 separate occasions).  In both cases, I enjoyed the experience.  Not just because of the company (the dinner companion was much prettier), but the food and ambiance are excellent.  As a sushi lover, I had sushi both times, and was not disappointed.  The fish portion was decidedly larger than the rice, as it should be.  The food was fresh, service was excellent!  Go!! 'nuf sed!!!"}
{"text":"Nothing special if you're looking for legit sushi. Went there for lunch and had the sashimi special plus a dynamite roll. I thought the fish was decent but the rice used for the nigiri and maki was hard and lacked flavour. I thought the price was a little steep as well for what you get. Unfortunately, there aren't too many sushi options south of the Qew.  The service was not good. I had asked to get more ginger two times and the waitress kept forgetting."}
{"text":"Was in town on business looking for a nearby sushi place. Of course Yelp pointed me in the right direction. Nice clean location tucked in a small plaza.  Sashimi was fresh and flavorful. Vast sushi options. The Udon soup with seafood & chicken was excellent. Enough for 2-3 people.  Fresh, good flavor and selection. Great spot, I will be back."}
{"text":"Took my family for lunch the other day and we had the bento box kalbi, beef teriyaki and chicken. Sooooo yummy and the service was great also. My new favorite sushi place from now on :)"}
{"text":"Well I am of two minds leaving this review.  The food was 5 star and the service was 1 star so I will hover somewhere in the middle!!!   I had been to the Bloor St Etobicoke location several times and it really remains one of my fave spots.  I was also very excited to see the Clarkson location so close to our location while my brother was in town at a convention at the Lake Shore Convention centre.  Well....we walked in and were eating a late lunch/early dinner due to my early schedule the next day.  We were the only ones in the place and as such, one would expect that we would have been taken care of fairly well.  The server very kindly told us that it was her first day and seemed almost afraid to take our order without help from a regular.  WELL.....if she's being trained by the other 3 that did nothing but stand around and either chat or bury their noses into their smartphone, Momiji is going to have big service issues.  The sushi/sashimi was fabulous as it usually is....the miso soup was barely warm though and that was a bit of a disappointment.  We had to call out to place an order for drinks.....we had to call out again to order food.....we had to call out for napkins.....we had to call out for extra wasabi....we had to call out for a second sake.....essentially, we had to continuously wave our arms or call out for EVERYTHING.  Very very disappointing for Momiji.... oh shoot!  Forgot to mention the boys walking all the garbage containers including the garbage can out through the front door of the restaurant right by our table!!!!  THEN the server who was't around to actually serve came to the table and had to tell us that they were closing out the lunch and that we needed to pay so that they could leave.  WOW......REALLY?!?!?!?  Won't be back to this location.....too many choices in the GTA for great restos and awesome service.  Heading back to Bloor St location!!!"}
{"text":"Caveat, my review only applies to their lunch time menu and service. I've only been here for dinner ONCE.  Great bang for buck if you order off of their lunch bento menu.  Nothing over $13. The Lunch Bento Box 1, is what I always get.  Start with miso soup.  You get a choice of either a california roll or spicy salmon roll, with 4 pieces of sushi, 2 tempura shrimp and 2 pieces of tempura vegetable with a scoop of rice and a small salad.  The spicy salmon roll, I don't know why, but I\"m obsessed with it.  It's never too spicy,  and the little bit of tempura crunch bits that they put in adds a perfect balance to the \"mushiness\" of the chopped fish.  It's neatly rolled.  The nigiri sushi is average for a lunch time bento box special.  The tempura can be hit or miss. If you get the freshly fried pieces, it's pretty tasty.  I've had luke warm ones that are not so good.  Service is average to awesome depending on the server you get.  Great place for a quick inexpensive delicious.  I go there at least once a week, and am known to go back to back on some days."}
{"text":"Im not sure why the reviews of Momiji are so bad but then again, I have not gone here in a while so management must have changed.   Going back from when I use to go often, service was great. Its a cute little family owned restaurant with fresh Sashimi. I liked that they have private dining areas much like in Japan, it makes dining feel more intimate. Anyway, I don't have much to complain about Momiji other than that they dont have a wide selection, and that the decor is quite outdated. Food is decent, service was great.  *Edited Review: Apparently this place is no longer in business. It seems I may have miscalculated the last time I ate here. I really did enjoy it while it lasted."}
{"text":"A nice little sushi place on Lakeshore in the Clarkson area.  Unlike some previous reviewers, I had no problem with service and the waitress was quite nice.    This place has a big menu and it will take you a while to decide.  Took us about 10 minutes at least.  For my order, I had the Kalbi Bento box.   It was a large portion and I loved the shrimp and pumpkin tempura.  They were both so crispy without being over battered.  It also came with 4 pcs of sushi, salad and rice on the side.  The sushi was pretty good and I liked the fact that it was mostly fish without a big chunk of rice below it. Salmon and red tuna were very fresh.  I would give a 5/5 for this portion of the meal.    Okay, onto the main course - the kalbi.  The meat was average, not too tender, but not too tough either.  As for the taste, it tasted like BBQ and a had bit of a char taste.  I don't mind that with some meats, however, it doesn't seem right with kalbi, as I think the natural meat and seasoning should cancel that out.  It wasn't bad, but not spectacular either.  Of course, the entire bento box was only $14, so I can't really expect that much.  I'd give this portion a 3/5.  Overall, this is a nice, clean little sushi joint on the Lakeshore and worth trying.  I would love to try to their rolls but we were both really full by then."}
{"text":"Once you have experienced Momiji Sushi, you will be spoiled for anything else! Their sushi is delicious and fresh. There are excellent vegetarian options (the vegetarian tempura roll is highly recommended) and the rainbow dragon roll, spicy tuna handrail and spicy salmon handrail are winners. The service is excellent, whether you drop in for a nice takeout dinner or have a nice dinner there.Highly recommended!"}
{"text":"I went here during the week for lunch and it was definitely a popular place for people to have lung as it was quite packed. The staff was polite and quick to take our orders, which was nice as we didn't have a lot of time for lunch. I got the sashimi lunch which came with 12 pieces of salmon/tuna/red snapper, miso soup, salad, and a side bowl of rice. The food came out fairly fast considering it was lunch hour and many people were on their lunch break. We were able to get in and out within an hour and a bit. Everything tasted great and would highly recommend this spot!"}
{"text":"My family and I have been coming to this location for years. This is the best place to get a la cart Sushi in the Oakville Mississauga area."}
{"text":"Great Sushi place in the heart of clarkson , sushi is very good and fresh service is decent and the place is very nice all around . Definitely go here on a Date night it can be romantic ."}
{"text":"Went to Momiji last week Saturday. The quality of the sashimi was really bad, and it's extremely overpriced. the sushi chef cuts the sashimi slices too big. i have a feeling the sashimi went bad as well, since me and my date had a terrible stomach ache afterwards. There's a lot of better restaurants out there for quality and price. i would stay away from this place."}
{"text":"Yuck! Serving Escolar. Toxic. Of course they will not call it that because they don't want you to know."}
{"text":"Great rolls and very fresh. Some interesting combos. We ordered shrimp tempura app which was good but I've had better. The shrimp were a little small but they weren't greasy. The tuna sashimi was super fresh.   The rolls were good but I'm not sure how I felt about the white sauce on the green dragon roll. This place was good but too pricey."}
{"text":"There are two locations of Momiji in Toronto,  and Clarkson is by far the better one. The location in Etobicoke lacks in service and food quality and is very much a few stars down on the scale, in my opinion.  The Clarkson location serves the BEST Salmon Terriyaki EVER! Having eaten recently at the Clarkson Momiji (and many times in the past), I couldn't believe how PERFECT my Salmon Terriyaki was. Easily the best such dish I have ever had. The salmon was grilled perfectly to a warm pink center with the perfect terriyaki glaze and presentation of rice and grilled vegetables. For $19, it's one of the best dishes I have ever ordered, anywhere.  Their sushi is always fresh and while the sake sushi is sometimes on the \"fatty\" side, the portions are normal to large and the nori is always fresh. The food is presented in a modern setting with nice tableware on black stained tables.  If you visit in the winter, it does get a bit cold closer to the door. They have a great takeout service with the food well-packed and organized.  While they specialize in sushi and maki rolls, there is a wide selection of non-sushi dishes. The service is friendly and perfectly on the slower side :-)"}
{"text":"I was extremely impressed with this restaurant, the sushi rolls are unique and creative, the salmon sashimi is fresh. We ordered the Clarkson dinner, the tempura is unbelievable, the chicken teriyaki was cooked to perfection, including the vegetables.   Servers are intuitive and gave us excellent service.  I've eaten at a lot of GTA sushi restaurants including the ones in the Annex, cannot compare any of them to this.   My only one complain is that we didn't get free ice cream.  That being said, I will not eat sushi anywhere else in the GTA region again."}
{"text":"Decor is quite plain.  Service was adequate to average.  Was a bit taken aback by pricing. Regardless, ordered giving the benefit of the doubt.  Afterwards, still felt it was overpriced.  Sorry,  I don't typically write poor reviews.  Specific to my order, the quality of the sashimi in my \"sashimi donburi\" (a sashimi salad bowl more commonly known as hwe dup nap commonly served in this and other Korean-run sushi restaurants) was very mediocre - to clarify my personal stance,   I think Koreans do a very good job of running sushi restaurants in general and I love hwe dup bap! Even the salmon sashimi,  typically the strongest flavoured fish, had little taste and the texture also left much to be desired.  Maybe they assumed I wouldn't care about the fish since I was ordering the hwe dup bap instead of the chirashi? To their credit,  the veggies were fresh.   Based on my experience here,  I'm not sure how they justify their product with their pricing.    On the other hand,  I'm inexperienced with sushi restaurants in the Mississauga area,  so maybe the competition is less stiff here.  I would place the quality of their fish alone as equivalent to Sushi Bong in Toronto,  though without the latter's price appeal."}
{"text":"Unlike some of the other reviewers I thought the service was very good and just the right amount of friendly.  We started with a small Gyoza dumpling which featured a crispy pastry like outer wrapping rather than the boiled tender style that I prefer.  My wife clearly enjoyed her \"arm sized\" sushi roll but my order of teriyaki beef was a little disappointing. I would have preferred less steak but a higher quality cut that was more tender and a tad less teriyaki sauce that was more tasteful.  We will return for another go around this summer because Momiji is not that far from our home and based on other reviews it surely deserves another chance."}
{"text":"How does this place have 4 stars? The sushi is terrible to mediocre. The rice isn't well seasoned, maki proportions are bad. Some of the fish was clearly not fresh, and none of the cuts were acceptable. Galleria the supermarket has far better sushi, and I think the nearby Longos and WholeFoods give it a run for its money. Not good value at this price. The only saving grace is the service is fast and the k-pop atmosphere is enjoyable."}
{"text":"I will agree with the other reviews: the food was ok, at least the food that got to us:) the did miss on our order and we had to re-order. We did have to stand up few times and give them the god damn sheet, and let me make a note, there were only 2 other tables besides us..(imagine how would they drown in a drop of water if the place gets busy) Oh, the salmon:) the poor teriyaki salmon was smoked to ashes:) just avoid it...unless you are into burned food:p I had to ask twice and actually chase the \"oh so busy\" waitress to give me the bill. I paid 10% for the tip and only because I was in a good mood. Would I go again...hum...not high likely.."}
{"text":"my mother's day  / daughter\"s b.day dinner too to long  the two poor severs were too busy to even come back to refill my tea and I had to  get  up to sever my self and go to the counter to paid the bill . THe owner needs to staff his restaurant  better on busy weekends or their regular customers won't be back because of the bad service  . NO CUSTOMERS   NO BUSINESSE"}
{"text":"Me and my friends decided to try this place out despite reading the reviews online...we should have listened to you guys =(.  We arrived there around 8:30 pm and they made us wait while they had to clear up a table...even when there were barely any customers there...so there were other tables available. The service was the worst I've ever seen in my entire life! They took forever to come get our order sheet and we had to get up TWICE to give them the order sheet. I guess the sushi was okay but I don't remember it being great. The bill came up to $100 for 4 people and the server even asked me to tip her when the service was non-existant...no, I did not tip her.  Me and my friends will not be coming back anytime soon...more like not coming back ever."}
{"text":"Was good food and they were accommodating and made a custom sushi roll to meet our needs.   Spicy crunchy salmon was very good"}
