{"text":"Très bon rapport qualité/prix. On parle ici d'un petit comptoir de quartier avec quelques places assises. C'est pas Brit&Chips mais les prix sont aussi moins élevés. Et les 'chips' de meilleure qualité. Seul problème: la bière. Pour un F&C, Budweiser et Labatt ça ne passe pas!"}
{"text":"We got delivery and it's honestly the worst fish and chips I've ever had. Soggy and greasy, the batter was far from crisp. The fries were the worst part. The best part of my meal was my Stewarts root beer. :("}
{"text":"Great fish and chips in Montreal. I was going to say best but I recently tried the ones at McLean's Pub on Peel downtown and like them more. The joint is tiny, so you'll probably want take-out."}
{"text":"Disgusting!!!! Ordered take out fish and chips. One of the worst meals I have ever NOT eaten. Heavy uncooked batter on what I think was fish. It smelled really bad. Fries greasy, small, and some burnt odds and ends. The coleslaw made me gag. I think they put some kind of yellow condiment in a minuscule container that was supposed to be tarter sauce.  I did not eat the food. I returned to the place but it had closed for the night, early, go figure. I'm going back today with the uneaten food for a refund.
Very disappointing considering this place, years ago, with the original owners was amazing......very sad. 
Doesn't even deserve one star."}
{"text":"Inedible food! We went to Lachine festival event on Sunday June 11th 2017. Had looked up mtl food blog which had rave reviews of Mommys fish& chips. When we saw their booth at the festival we got so excited to have some... and we were super hungry as we had saved our appetites for the event. The poor quality of the food was shocking!! I have never not been able to eat any of the items I had been served but this was a first. I ended up throwing away almost all of my meal. Fish burger trio was almost $10 --- fish was so hard & old I could not bite into it nor chew it. Fries were soggy and saturated with horrible tasting oil/grease. The staff -- although cordial, appeared to not be the original owners of yesteryear described in the review we read & their attitude exuded of \"we have this as an investment operation only -- we don't know how to cook, we don't care if you like the food or not, just buy it so we can make a profit from you. You are supposed to be a polite Canadian customer so don't ask us any questions, okay!\" We lost $27 to the garbage can. This restaurant is unethical & immoral in its serving of absolutely inedible food. Saw in real estate listing it is for sale, listed at $145,000!!!
They want to further gouge people in trying to sell it at such an inflated price. It should be shut down and left to the sands of time."}
{"text":"Hole in the wall.  Speciality is, in fact, fish and chips.  They use haddock for the fish, and the chips are more properly the richly brown, square-cut, sweetish Québec fries one finds in poutine shacks than the archetypal blond British chips one imagines fitba' hooligans and coal-heavers eating out of a rolled-up newspaper overseas.  Doesn't matter.  They do a good job on both.

There are a dozen-odd seats in the place, and a clean, usable restoom, but the bulk of their supper trade does seem to be pickup takeout.  Have some Guinness or an English ale waiting at home if you drive up to take away the fish specials;  either is perfect with it.  And a bag of their fries, vinegared, salted, and eaten still-steaming while strolling along the riverside a block away on a cold October afternoon...well, there are many worse things."}
{"text":"This place is pretty bad, I can't get over that all of the fish are the exact same shape, and to add insult to injury they are very suspiciously the exact same shape as the frozen captain high liner ones from the grocery store across the street. 

The French fries are fresh cut but the fish is pretty small and very generic batter. I can't recommend this place"}
{"text":"Don't expect anything fancy, it's a real hole in the wall. This place has been in business since the early 70s and I understand why. 

Food : amazing. I absolutely love it. Their specialty is fish n chips and you can taste the Scottish authenticity. I hadn't gone in over 5 years, yet I did not taste any difference.

Decor : reality is, there is none. Some posters of Scotland, but that's it. 

Note : they are located on the waterfront. I always go pick up my food and eat on the beautiful and scenic view of the waterfront. I suggest you do the same."}
{"text":"They've been in business for YEARS and now I know why!! 
I am not a big fan of fish and chips. I find them generally super greasy, way too much batter and over cooked. Not at Mommy's! 
Not only that- but only $5.80 for 1 piece of fish with fries and coleslaw? Merci!! 
I think they need to do something about the coleslaw, but I doubt many are complaining :) 
Even better, they are right on the canal so you can pop over to a picnic table on the water and enjoy :)"}
{"text":"J'ai ENFIN essayé le Mommy Fish N Chips! 

Les avantages : 

- C'est mignon
- Abordable
- Réconfortant

J'ai opté pour l'assiette du pêcheur parce que je suis une maniaque du poisson et des fruits de mer. Grosse déception par contre pour le goût et la friture. J'adore la friture comme tout le monde mais cette friture là n'est pas catholique! Beaucoup trop épaisse et le poisson ne goûte pas du tout. Les crevettes sont Ok et les pétoncles aussi!

Mon invité a choisi le cheese burger qui était vraiment délicieux ... du genre cheese burger de party BBQ chez les amis l'été. La poutine par contre était mauvaise ... c'est vraiment un sacrilège de raté une poutine de cette façon et j'accuse la sauce trop liquide et sucré pour aucune raison.

Bref, si vous n'êtes pas du genre à vous sentir coupable de manger super gras et que vous aimez quand ça goûte le beigne lorsque vous rotez, je vous recommande cet endroit ;)"}
{"text":"I expected so much more from a place that has been open for so long. Just coming back from a walk by the Lachine canal, I ordered a 2-piece fish & chips plate to-go (12+$). When I opened up their takeout box, I was shocked by the small portion size! On top of the small amount of food for the price I paid, the fish was unpleasant. I didn't like the fish that they used (not soft or flaky at all, but almost chewy??) and it was so greasy, like a burst of grease in my mouth upon biting into the fish. On top of that, I didn't like the taste of the oil that they used to fry the fish and fries, it had a strong, distinct flavour that wasn't very enjoyable. 

\"Mommy Fish and Chips\" gets 2 stars instead of one because the coleslaw included in the meal is surprisingly delicious. Just the right balance of sweet and acidic, and shredded into small little pieces (not too small to become a uniform purée though, it has just the right amount of texture). So embarrassing to have a free side overshadow a restaurant's specialty item, though. I've had better fish & chips at Cage aux Sports... :("}
