{"text":"We were starving and came across this place, and because of the cheap prices for lunch, we decided just to eat here.  Lunch came with choice of soup, rice, and an egg roll.  We had the singapore noodles with shrimp that costs 4.25 and the hunan beef which cost $6.  Both were actually quite flavorful, however we could have done without the egg roll which was essentially just stuffed with bean sprouts.  The wonton soup and hot and sour soup were also nothing special.  At least we came out full...both our bellies and our wallets!"}
{"text":"Came here for lunch after the dimsum line at Maison KamFung was too long. I had asked a random person on the sidewalk for a recommendation and was led to here. Growing up in Queens, I've eaten at a fair share of Chinese restaurants and am used to the brisk attitude of the help but this was the absolute worst dining experience I have ever had.   1. The waiter refused to take our order, instead giving us a piece of paper and telling us to write down the number of the items that we wanted. I had thought that maybe this was a restaurant practice but saw our very own waiter take down somebody else's order. On top of this, he was scowling the entire time and took his fair time fulfilling our requests for water and tea.  2. The wait. We ordered around 8 dishes and they were brought out with in sets of two or three for no particular reason with 20-30 minute intervals in between. The restaurant was not full and it was not a banquet style meal.  3. The food. Typical take out Chinese food with an emphasis on oil, msg and sweet and sour sauce. The sweet and sour chicken had about 15% meat, the rest was all fat.  4. There was a lunch special menu that was purposely not given to us due to the fact that us ordering a la carte was more profitable. Taking a quick look around, it was given to all other parties. When I brought this up to the manager, she simply gave me a blank look and said so. I was not looking for money back but an apology or explanation would have been sufficient.  Stay far away from here, I regret wasting one of my meals in Montreal at this place. I would given it negative stars if I could."}
{"text":"No frills Chinese food, good prices and good portions.  Lunch specials are great value!   Can't go wrong with the Cantonese Chow Mien or the whole lobster when in season.  For those of you who aren't used to the \"curt\" attitude of the waiters, don't eat in Chinatown and pay double at an restaurant in a strip mall in the suburbs."}
{"text":"Where a zero star when you need one? Do yourself a favor and literally eat anywhere else in Montreal. Anywhere else. Find a Tim Horton's even.  After we were pointed in the direction of our table, we were given a piece of paper to write down our order. Makes less work for them, right? After about 10 mins someone saunters over and answers our questions with abrupt yes and no. There was even a disdainful comment from her to my young child about not knowing the difference between Chow Mein and Lo Mein! The travesty continued - we order an appetizer and I inquire about one of their wines. We were then told that entrees have to be ordered as well.   Fast forward to about 15 minutes with no one coming back to the tables about beverages or my question about the wine. All of sudden, one of the main courses arrives and she leaves before we have a chance to ask what happened to the appetizer. Couple of minutes later the second course arrives. Upon asking she says the appetizers are being made right now and will come out when they're ready. Good thing we didn't order dessert because that might have come out first! After we are halfway through, the appetizer suddenly shows up. We finish everything and half of the plates are cleared away and 10 minutes after that third and final course shows up. When we tell them that our dinner is wrapped up, they act surprised about why we don't want to start eating again after we are done. Yes, still no mention of the wine I had asked about.   To end the experience I was forced at the desk to pay a more appropriate tip for all the \"service\" we received. There is a reason this restaurant had hardly a crowd during rush dinner hour. Easily the worst services I've had my entire life with very mediocre quality food. Avoid at all costs"}
{"text":"I had been walking all around the city all day with some visiting relatives, and we were starved.  Mon Shing had a fairly decent crowd inside, so we figured it must be good.  The entrees all came out at once -- except for mine.  Though my family members offered me a few bites from their giant plates, we hadn't planned to share full-scale, so I mostly just sat and waited for my food, feeling too hungry to even engage in conversation.  We tried to get the waiters' attention to ask if my entree was on its way or if it had been forgotten.  The first couple of times the guy blew right by us.  When he finally did come to our table, he seemed angry, and he blamed the kitchen for not making my dish.   At last my food came out.  Actually the waiter FLUNG it on the table with a loud clattering sound, not saying a word.  So I started eating my dinner around the time everyone else at my table was finishing theirs.    The dish was tough, grisly MSG chicken -- and I know I shouldn't have expected more from a cheap Chinese place, but after that long wait I had really counted on something good.    Two stars because the unappetizing food doesn't cost much, and there's a lot of it."}
{"text":"Food: I was craving good ol' General Tao on a night out. I have not visited this place in years, although their GT was one of my favorite dishes from here. I recall it being more spicy and red. To my disappointment, my GT was brown and not spicy. I took a few pieces of chicken but did not finish it or take it to go as I was satisfied. My date ordered the sesame beef dish and highly disappointed as well. He said it was full of sugar and lacking flavor.  Environment:There was no toilet paper in either of the washrooms, there was no soap to wash our hands. The water was freezing cold and no paper towels. We would suggest that they re-fill the inventory often in order to keep their toilets clean and sanitary."}
{"text":"Food is excellent! Looks very inconspicuous but really great tasting dishes. We ordered lobster with ginger, general tao, beef flank with flat noodles, and fried mustard greens."}
{"text":"Bad food and horrible services! Absolutely not recommend this place! I will give no star!!!"}
{"text":"I asked the server what kind of sauce was the XO sauce.  He told me it was an Asian sauce.  I was thinking, \"DUH, I'm in an Asian restaurant!\"  So the server was not knowledgeable and a little condescending.  That's okay though because the mixed seafood with XO sauce was good.  I think there were way too many snow pea pods on the dish but for the price it was worth it.  I think this place is better for groups than a solo diner."}
{"text":"Horrible restaurant. Food was average to not good. Super greasy. Service was horrible: by chinese restaurant standard. Waiters were slow, exhaling to show my baby's high chair was in the way: the waiter was 4 feet tall and can go through a hole so not sure why he was complaining like that. Horrible experience, will never eat again even if they pay me to."}
{"text":"Came here tonight after being disappointed from Congee Queen in Toronto. Food here was quite delicious!!  Interior: Not uuberly roomy, but enough seats that we didn't need to wait at 9:30 at night.  Food: To start, Bu Bo tofu soup. it wasn't the tastiest :(, gotta add the white pepper. The lobster (ginger scallion cooked), crispy chicken, snow pea leaves, tong choy, yeung chow fried rice, and salt pepper pork chop were all fantabulous!  Service: Prompt and accommodating   Overall: 4.2 stars, but 5 stars cuz it's definitely better than 2.5"}
{"text":"Je pensais vraiment faire une bonne affaire en allant manger là le midi....Question \"qualité/prix\", mais je me suis trompé. Bien que le menu soit intéressant et peu dispendieux, (entre 6 et 10$ pour une soupe, rouleaux et plats)...Ce n'était pas très appétissant. La soupe ne goûtait pas grand chose et il y avait seulement UN won ton...J'ai commander des nouilles croustillante, poulet et légumes. Le poulet goûtait le poulet bouillit blanc...et les légumes le congelé....Le rouleau...mmmm je ne sais pas ce qu'il y avait dedana...c'était louche...Bref... Pour finir...PAS d'INTERACT....   Si vous êtes en mode Low budget...allez-y de la nourriture ça reste de la nourriture, mais sinon...il y a d'autres resto dans le quartier chinois bien meilleur..."}
{"text":"We went to Mon Shing after doing groceries this weekend. The restaurant didn't appear very promising at first glance, with its bland decor that probably hadn't changed since 2000, but prices were affordable and we were really hungry.   We were craving for chow mein and each ordered a plate. The portions were larger than expected, and the taste was much better too. There were more vegetables than meat (especially for the seafood chow mein), but everything was fresh and well prepared. I particularly liked how the noodles were slightly crunchy on the sides and soaked in sauce in the middle. We were a bit too late for the lunch time special prices, so the total came to 30$ for two people. The whole meal only took about 25 mins; the service was quite fast!  I admit that I was surprised. I thought it didn't forebode well as I went in, but in the end I liked it. I'm giving four stars for now and update as I go. We'll probably be back to try their fried rice and whatnot. If you're all about authentic Chinese food, I wouldn't recommend Mon Shing.They serve typical American Chinese cuisine, which is what you would find in most North American chinese buffets, e.g. General Tao and Chop Suey. I'm personally fond of American Chinese food because I used to go to buffets as a child. To feel like eating at Mon Shing is a bit like craving for fast food. We all know it's not the most authentic place, but it's good all the same.   There's should be no shame in liking American Chinese cuisine!"}
{"text":"While wandering around Chinatown looking for a place to have lunch we stumbled into Mon Shing.  I ordered the watercress/shrimp ball soup and my husband got some Singapore noodles, we also shared shrimp dim sum. I loved my soup, it was great and so were the dim sum, the noodles were okay - nothing special, I drowned them in sriracha which helped a great deal. The service is a little on the cold side but I didn't really care, it wasn't bothersome. Prices are very reasonable.  We will be back, because I want to try more of their soups (bird's nest for one)."}
{"text":"Mon Shing, where bad service is the thing...  So we had finished up a morning of exploring the Jardin Botanique and were thinking Chinese food so a trip to Chinatown was in order.  And Mon Shing seemed promising enough at first, with a $28 feast for two people that would satisfy our cravings.  The place seemed authentic and there were plenty of locals happily lunching. It's a testament to the diversity of Montreal that in a Chinese restaurant you can hear so many different languages spoken.   I should have known to retreat and flee the scene when the waiter yelled to me, after asked if they have bottled water, \"Across the street!\" and motioning to some other establishment.  There was enough oil and grease on the initial spring roll to have been left over from the BP spill.  The shrimp ball soup was actually tasty and was the highlight of the meal (not including our exit, of course).  The fried shrimp was way too salty and left a bad aftertaste in my mouth.  The rice that accompanied our main course of chicken consisted of shrimp, pork and peas. The peas were barely defrosted, as in, I could still taste the freezer.  Our chicken was tough, stringy and obviously a cheap cut.   Poor service combined with sub-par food makes for a 1 star review. Fortunately the aftertaste of this place was washed away by the gourmet food festival going on at Poinet-a- Calliere museum."}
{"text":"Absolutely the worst chinese food I have had in a long while.  - The tables were dirty as hell. - The service was very very very slow. We waited for at least 40min to get 2 dishes. We ordered one veggie and one tofu, and it was at 9PM on a Wednesday night. What took them so long? Who knows - The food did not taste authentic (my mom and i are both chinese and we both hated the food). The veggie dish was way too oily and the tofu dish was tasteless - it literally only tasted like tofu and that was about it. - The price was affordable but definitely NOT reasonable. it costed us $36 in total for 2 dishes with no meat, and 2 bowls of rice. The owner recommended us their lobster dishes, and some seafood soup - they sounded pricy and they probably are. I did not feel I got what I paid for.  DO NOT GO TO THIS PLACE FOR CHINESE FOOD."}
{"text":"If it were up to my 9 year-old daughter, we would have eaten lunch there everyday. A bit of a hole-in-the-wall restaurant but a great find. Shrimp ball soup was delicious as was the pepper tofu.My son ordered the sweet & sour chicken (run of the mill yet good) and calamari (delicious). My husband and I ordered the baby mustard leaves as well as an order of vegetable in broth; both were extremely tasty and pleasing. Someone mentioned the \"cold service\" and, although would agree upon our first visit, the second time we stopped there for lunch (on the pleading of our daughter), the service was warm and extremely attentive.   The place seems very popular with the local Chinese community and the restaurant was practically full on our second visit. A few other locals but little to no tourist. Very enjoyable atmosphere.   We recommend Mon Shing without hesitation and look forward to a future trip to Montreal where we will dine here again."}
{"text":"This is probably the worst place for Chinese food!! I had their lunch special and I didn't like it at all.. the smell of the food was gross and of bad taste. Now I understand why it is so cheap, because they don't care about their food quality. I wouldn't return here at all and wouldn't recommend it to others. Service is horrible and I wanted to change the menu from the Thai chicken to fried rice combo, I was just told no which is unfair.   They accept cash mainly and minimum of $10 for debit or credit! I'd never return. I was disgusted by the flavours and I've had so many Chinese dishes in my life, this is the first one that I have tried and didn't enjoy it. To be honest, the plain rice had such a strong smell and probably stale. I had only bite and left it!"}
{"text":"The best thing this place has going for them is that they are opened late until 4am on weekends. I can speak Chinese and usually get the Beef chow fun, or Singapore Mai fun noodles which they do a pretty good job on.    I would never eat here in the daytime or even before midnight but after a night of going out, this is the spot for dining in or takeout."}
{"text":"The food here was delicious, the prices were amazing, but we had a terrible experience.   Prices: $27 bought us a 4 course menu (soup, egg rolls, two entrees, fried rice, and oranges/fortune cookies). We only had about $35 Canadian left on our last night and this was definitely the way to get the most out of it. They had 5 different 4 course menus so you could pick your combination of food. Unbeatable.  Food: Delicious. We had been to the restaurant next door the night before so had a pretty fresh comparison. To start we had the shrimp cake soup with greens. The soup base was under seasoned (we added soy sauce) but the shrimp cakes were extremely flavorful and the greens were bright and still had a bit of a crunch. The eggrolls were way too oily and just had salted bean sprouts in it...gross. The salt and pepper shrimp was incredible. I removed all the fried parts from mine and the flavor was still incredibly strong. The shrimp themselves were high quality.  The fried rice was flavorful but subtle ( soy sauce wasn't the main ingredient). Finally we had a chicken stir fry - amazing. The chicken was so moist and high quality and the vegetables were perfectly prepared. The food was so good and so high quality, I wondered how they could afford to basically give it away.  Service: Terrible. I am usually a very generous tipper, but this was a no tip situation. We got our first two dishes relatively fast. Then a huge party sat behind us, the place got a little busy and they forgot about us...for half an hour plus. When we were finally able to get the waiters attention(we were in a corner) he came over annoyed and waved us away as we tried to explain that we hadn't gotten our main dishes. He brought the dessert serving and then the check. When we tried to explain again that we hadn't gotten our main courses, he didn't believe us, had to bring another waiter over to verify before finally getting our food 10 mins later. Seriously, why would we lie about not being fed?? They brought the food with no apology. Terrible.  We get that our experience may be isolated, so take it with a grain of salt. Great deal, great food, questionable service."}
{"text":"Sometimes the best places are the most unassuming. Mon Shing certainly falls under that category.  Our family of 5 ordered two combo meals with the menu indicating that each meal was large enough to feed two people.  The amount of food not only fed us all, but we had ample amounts of food left over for dinner the next day.  This restaurant was also very reasonably priced.  I would highly recommend this place if you have a craving for solid, reasonably priced Chinese food."}
{"text":"I have a little secret to share. I have this thing where I like to go to Chinese Restaurants in Montreal and try to order \"off-menu\" meaning, disregard what the menu says and ask if they can create something that I know would be awesome.  This also lets me get a good idea if I'd like their food or not because sometimes the chef is fine, but it's just the dishes that I find not so appealing. Believe it or not this works in about 90% of the Chinese Restaurants here.  Sometimes I just dont feel like a spring roll, or general tao or something in peanut sauce.   I came here and ordered a crispy noodle chow mein, with tofu, chicken, chinese mushrooms, broccoli and in a sauce that was slightly spicy and not sweet. I got exactly what I envisioned and it was delicious, my friend got a quarter duck (quarterquack) , bowl of rice. We both had a filling meal, and the service was great. The server accommodated to what I wanted with no problem. We joked around for a bit. Prices are very affordable, and best of all we showed up at quarter to midnight, and sometimes there is not a lot of selection when it's that late. Mon Shing is open til 4am! There were a few tables of people that were there as well, so it seemed like the place to go for some midnight eating."}
{"text":"Bouffe ok, mais très mauvais service! On nous ignore, on lance presque la nourriture sur la table et si on veut rapporter ce qui nous reste, on doit tout emballer soit même. Nous avons laissé 1$ de pourboires pour indiquer que nous n'avions pas apprécié le service et la caissière a repris les biscuits de fortune! Évitez ce resto!"}
{"text":"La bouffe est au mieux correct, mais plus souvent qu'autrement, elle est carrément mauvaise.  Le service est terrible aussi. Le Bejing juste à coté est 3x mieux alors..."}
{"text":"I've been to this place a few times, and keep wanting to go back. If I had to recommend one dish, I'd suggest you try the Pekking Duck.   Go for tasty Chinese comfort food, and bring good company. In the multiple times I have been there, I have never had rude service, in fact it has always been decent (in reference to other reviews).    Last time I went I wrote a review that you can read here:  http://www.forgetthebox.net/mag/wine-dine-montreal.php"}
{"text":"Cheap, lot of food, lunch special combinations is what I can say about this place. I was so hungry that I could have even ate a horse. There were several restaurants around in the china town and this restaurant got my eye and I immediately dropped in. The waiter who waited on me looks very rude and pissed off. He saw me and asked if I was the only person dining in, I said yes, he looked at me and took me over to a table.   He got the menu and threw it on the table in front of me. I was hungry and I didn't had the patience to give him the taste of my fiery fists. just kidding. I simply ignored his discourteousness. I went ahead and took a lunch special which includes plain rice served with egg roll, a side dish (I opted for sweet and sour chicken) and a small bowl of soup (Chose hot and sour chicken soup).   As soon as I ordered, he grabbed the menu card, barged into the kitchen, got a kettle of tea and placed it on the table and moved on with his business. I poured myself a cup of tea and started sipping.   He served me the bowl of soup which was thick and fantastic, I really thought of having one more bowl but wasn't able to tolerate his behavior. So, I just waited for the rest of the meal to be served.   The egg roll was too oily but tasted good and the chicken was too sweet. Disappointed with the service, with the food and the ambiance. Nothing was special there except for the soup.  I finished my food quickly, sipped one more cup of tea, paid the bill at the counter. Even the owner of the restaurant is one boorish impudent living soul. Just handed her the money and left.   I would recommend you all not to come to this place if you want to keep away from the mannerless, ill-behaved service. I would give this place a zero but aah, maybe just the soup deserves a small brown star!"}
{"text":"Ok Montreal isn't known for their Chinese food. That honor goes to Vancouver.  We attended a family dinner here. The restaurant is a  Iittle divey and run down. Service was perfunctory.   Food was totally mediocre. I ate it because I was hungry not because it was good. The steak cubes were raw. Not marinated red but raw meat red. Overall not very memorable."}
{"text":"I was in Chinatown for a quick bite and randomly got in this place before checking the reviews.  After I ordered, I checked the reviews and got nervous about my meal. Fortunately, I probably got their best dish. The waiter recommended me the seafood chow mein, literally fried noodle. I liked it.  It came in a combo with soup and egg roll, for 8.7$+tax.  The soup was tasty, maybe more spicy than other place which I preferred. The portion of chow mein was generous and with high quality seafood.  I am glad to try this place out and round them up one star. The food and the service I got today was worth the 4.5 stars."}
{"text":"My friends and I were in Montreal for the weekend, and we decided to check out Montreal's Chinatown. It was around 5pm on Saturday, and after walking around for a bit, we decided we were hungry and wanted dinner. It was hard to tell which of the restaurants were good, since it was too early for the restaurants to be crowded, and some of them looked sketchy from the outside. We eventually settled on Mon Shing.   We ordered spring rolls, fried wontons, yang chow fried rice (pork & shrimp), beef with chinese broccoli, mapo tofu (tofu with pork, scallions and spicy sauce) and 1L of the house white wine. The wine came out first, and was actually really delicious, and only $22. The food came out quickly and was good. Not the best Chinese food I've ever had, but definitely good. There was SO MUCH food. We finished the appetizers, wine and broccoli, but left half the fried rice and 3/4 of the tofu. It was all really delicious- we just couldn't finish it. With our check, they gave us 8 slices of oranges and 3 fortune cookies. Yummy! The meal took just the right length of time, and as we were leaving, there was a decent line of people waiting to be seated.  Definitely go if you're hungry and looking for solid, cheap Chinese food. With tip, the meal cost us about $20 each for a liter of wine and more food than we could eat!!"}
{"text":"I ordered from Mon Shing for delivery one night and I probably won't again anytime soon. I read reviews online about generous portions, but all I got was a takeout container that was around 1/4 full of only bokchoy and a few mushrooms, which was absolutely ridiculous because it cost almost $14. The food was okay, nothing special whatsoever. I also ordered rice, which tasted fine but you can't really mess up steamed rice.  My biggest issue with this establishment was by far their horrible customer service. When I get delivery, I always wait until my food arrives before I tip. When the man delivering my order arrived, he stood in the doorway and kept pointing to the receipt because I hadn't left a tip online. I was fully intending on tipping him, but was extremely close to just grabbing my order and shutting the door after what he did.   Overall, the food is fine and also extremely overpriced. The customer service is absolutely horrible. There are a bunch of Chinese restaurants in Montreal, so I would suggest ordering from one of those."}
{"text":"My elderly relatives chose this restaurant for dinner during my visit. I was automatically concerned when I saw the reviews on Yelp, but hoped for the best.   The duck platters were delicious, but everything else was heavily salted. One of the waiters even joked about the large amount of MSG they use, but afterward I realized he might have been telling the truth."}
{"text":"Normally I would not have tried this restaurant as it only has 3 stars. When searching for a Chinese restaurant in Montreal I had a list of restaurants in the area. However, my best friend really wanted pork chops with Peking sauce and nine of the places on the list had it on there menu. We ordered shrimp and pork shumai, fried rice, string beans, and of course the pork chops with Peking sauce. Everything was delicious. This place really merits at least one more star and I'm not sure why it doesn't. The food is very tasty and the service was good. I will definitely return when I am in Montreal and will recommend it to others."}
