{"text":"A treasure in unique Monticello. We dropped by tonight to try out our town's newest establishment and was not disappointed. I had a flight of all of Monarch's brews. My favorites were Caldwell Kolsch, She Loves Me Not IPA, and Zihautanejo Stout. The food was excellent and our server was attentive and kept making sure we were happy. The atmosphere is also really neat. The owner did an awesome job converting the old Methodist church into the brew house. Beautiful stained glass windows, original church pews, and the pulpit used as the hostess station complimented by the new flooring and bar really work well together. Well done. This place is a destination in itself."}
{"text":"This restaurant has promise.  We went on Saturday night with a live Irish band which was great except the acoustics in the place are truly horrible.  The hardwood floor is beautiful but the resulting sound environment is a disaster.  We got there one hour before the band began.  We were told the wait would be 45-60 minutes.  90 minutes later we were seated.  No big deal. We weren't in a rush. But later we watched a number of people waiting (and one group turned away) while several tables were empty.  The hostess counter didn't seem to be run correctly.  They were slow to fill empty tables.  Not good for customers and not good for maximizing business.   The beer and drinks were good.   The shrimp appetizer was truly wonderful.  Somehow they missed serving us the bread rolls that other tables received.  My wife's burger lacked flavor.  The fries were good but seemed to have been cooked some time earlier, limp, not crisp.  I ordered the mussels and seafood which was excellent.  But 6 of the mussels (about 1/3) hadn't opened which I think means they had died before cooking.  They gave a generous discount off the bill for that.  We will definitely be back.  The chef has talent.  They need to work on the service and the acoustics."}
{"text":"Came her about a week ago for the first time with my wife and two friends.  I am a home brewer and love the recent increase in local breweries in the area, so was definitely excited to try this place out.  Venue / Ambiance - 4.5 stars.  Very cool place in general.  Old church that had been beautifully restored.  Nice bar and what appeared to be original stained glass windows.  I deduct a half star as the place felt a little cavernous and the seating arrangement was a little awkward in the main dining room.  We opted to sit at a high-top at the bar just because the energy seemed better.  Service -  5 stars.  Excellent, everyone was extremely nice and enthusiastic.  Not much else to say here.  Food - 4 stars.  The menu was relatively small, but everything we ordered was of good quality. I took a flier on the mussels which were surprisingly good.  Portions were generous for the price.  Beer - 2 stars.  By far the biggest disappointment.  They had 4 house beers (Kolsch, Pale, Stout, and Wit) and they were out of the stout.  I tried the Kolsch and Pale and both were a little thin with no distinct flavor.  Seemed like they had rushed them a bit.  Their guest beer list was extensive and included local (Triptych, JT Walkers, etc.) and national brewers.  However, for some odd reason, over half of the 28 beers or so on tap were stouts or porters.  I like both, but not in June.  I think there were two IPA's on the entire list, which was very surprising to me.  I think they will figure this out over time, but it just seemed strange given the time of year to offer so many stouts and porters.  Overall a good option, especially if you live in and around Monticello.  Looking forward to them expanding their menu and varying their beer list. Not sure they will ever be on par with a Triptych or JT's though in terms of house beer quality unless they make some major changes."}
{"text":"Bogus review by evident troll (& perhaps envious competitor) notwithstanding, I have never been disappointed with the food and beverage quality or service. For a relatively new establishment especially they excel. The menu and beer selections are bold and eclectic, and inevitably no one person will love it all. But for those seeking the new an different server in a skilled, gracious, and evidently conscientious manner, this place is for you.  First time on the lunch menu this Saturday afternoon, which differs from the dinner menu (beer menu changed weekly or less). I was sad to see Mashawi's close in CU and was pleasantly surprised that Monarch's falafel in one of their tacos was probably better, and the pita (fried dough?ยก?) and veggies tasted very fresh. Arancini, and much more all delicious.   Time for another of the 28 draft craft brews (more bottled) to wash it down.   Mmmmmmm ahhhhhhhh"}
{"text":"My daughter recently had her wedding reception there.  The place is just beautiful, old stained windows and the choir area which overlooks the main floor.  Ivan, the GM, did a wonderful job of accommodating us and keeping everything in check.  The entire staff did an awesome job of serving our needs.    I only gave this place 4 stars because I didn't get a chance to get the food since I was so overwhelmed with everything else!"}
{"text":"This is a new restaurant in Monticello Illinois.  This was our first time but will return.  It's in an old church and has been converted into a restaurant and brewery.  Very nice transformation.  It is loud but I'm sure that because of the high ceilings.  I had the PEI Mussels steamed in Whit Wit Beer with tomatoes and andouille sausages and toasted crostini.  The rolls brought at the beginning of meal were wonderful.  My husband had cream of broccoli soup which was wonderful and a Caesar Salad.  The have a small menu but a variety of things. The fries looked home made and the burger looked good too.  Waiter, part owner Matt and hostess all stopped by and were very attentive!"}
{"text":"We went to Monarch the other night for dinner with 2 of our kids.  The food was amazing and their beer is equally as good.  For $2 you can try a 5oz serving of any beer you want.  The owners were wonderful and our server was so helpful and kind.  Very kid friendly yet classic.  I would say it is the best restaurant in Monticello!"}
{"text":"It is so loud in here. In the worst way. Other than that beer is okay. (They have blind pig on tap though... )  They were close but no cigar on ambience. If you want to be trapped in a fish bowl with dueling bachelorette party screams then this is your spot.  Food was subpar but I think they are improving. Service is actually great though. Karen knows her beer. She's great we'll buy ear plugs and come back... :)"}
{"text":"Location is an old Methodist Church which really adds to its ambience, and allure.  It is also quite spacious, but warm feeling at the same time.  Although they don't have a parking lot there is plenty of spacious street parking available. They have live music every Friday and the acoustics are really good, and they have a nice dedicated stage for the venue.  It was great that the manager came over and gave us a personal greeting after we were seated, and the story about the brewery.  The service was great aside from a mis-communication with the kitchen that caused a little longer wait then normal to get our food.  However, the food was fantastic, and the manager gave us 10% off.  The desserts are fantastic and good size."}
{"text":"While visiting friends in Monticello I had the pleasure of visiting this establishment.  The ambiance and experience in this small town brewery did not disappoint.  The food was very good.  I had the pulled pork sandwich special with slaw and fries.  My only complaint was it was not hot... Just warm.  They had a nice beer selection, both guest tap and house brews.  The restaurant and bathrooms we're clean.  The staff was friendly.  And although I didn't partake, there appeared to be a great selection of arcade games in the backroom to play.  I'd recommend this brewery to anyone traveling through the area."}
{"text":"The space is unique, honest to its roots and has a great vibe. The home brews were awesome and food was fantastic. The manager rounded on us and was extremely friendly. We will be revisiting this place and telling our friends!"}
{"text":"Ordered the fish tacos and the cod portions were very generous but it was lukewarm and on the mushy side. Hand cut fries were a little limp. Also ordered  the coconut lime salad which was very good although maybe a little too much dressing but still the shrimp were very good and it was very tasty."}
{"text":"Food presentation outstanding. Cauliflower great. All veggie sides were enjoyed by patrons at table. Good beer, pretzels appetizer a nice option. Emily the waitress was a great resource and pleasure to talk with. Chris delivered food in a timely manner with a smile. Highly recommend to all"}
{"text":"Great venue, excellent menu, terrific food. Only complaint is that the noise level was a little bit high"}
{"text":"This place looked so cool, which made it disappointing that the beer and food was so mediocre. Everything about this place just felt like it was missing the mark. Our waiter spilled water all over my baby and me. Our waiter didn't apologize or get us napkins or do anything to help. We tried all five of their beers they had on tap in a flight. We ordered them and one of the beers was no longer on tap, but instead of telling us this and asking if we'd want something else, our waiter just picked another beer and added it to the flight (you don't order a flight of beer at this place, you order five ounce pours and if you get four at a time they put them in a box... I ordered five, so it wasn't like they had to throw one in to fill out the box). I ordered tacos. They didn't taste good. It's hard to put my finger on it, but mostly the steak and pork tacos just tasted bland. I got chips and salsa as a side. The chips were not tortilla chips. They were fried dough, like for an elephant ear, that were cut into the shape of chips, fried, and then salted. This could have been good if they came with chocolate or caramel or ice cream... But they came with tomato paste that was pretending to be salsa. A lot of the beer tasted watery. The prairie sky tasted like it had skunked. The coffe stout tasted like water with coffee in it from a hotel lobby that had sat out all day. It was not a good experience. One bright spot, the Frequency Coffee Black IPA was great. I would rate it as being a 9 out of 10. It feels like it could turn a corner and everything will click and work, plus the place looks so cool, but currently it's just not very good."}
{"text":"Service was 5 stars.  Building is 5 stars.  Renovated old church building.  Beautiful inside.  Great bar area with TVs for local sports.   Food on our visit was just ok.   Burgers good, not great.  Wings were small but cooked well.  Fries were good.    Best part of the meal, pretzel bites appetizer.  And the girls really liked the flavored lemonade."}
{"text":"Truly disappointed with the experience I had when recently eating at Monarch. My family and I had to wait 15 minutes (which turned in to almost 25 minutes of waiting) to be seated. Now, this would have been okay if the place was packed. There were at least 6-8 tables completely empty. The reason for our wait was so the kitchen could keep up and for us to have a good experience. (The place was not very busy)! Unfortunately, that did not happen. It took one hour for us to get our food, which all came out cold. (There were 5 of us total). The restaurant was freezing and it took our waiter 20 minutes to bring us rolls. My family and I have been very good customers here but unfortunately, this experience ruined it for us."}
{"text":"We really enjoyed our meal! Started with the pretzel appetizer with beer cheese, delicious! The fish tacos were good and the Sheppard's pie was very tasty. The portions was so big, you  can easily split.  I chose Brussel sprouts as a side, so good! Our service was excellent.  For dessert, my husband ordered the bread pudding with cinnamon ice cream - excellent as well! We will be back. I know they have great beer, according to guests around us, but we don't drink beer, so can't comment on this!"}
{"text":"The one star was only to select a rating but really this place gets 0 stars from me! If you want to disappointing food and staff then by all means knock yourself out. Constantly told by management that \"they are still working out the kinks.\" Do yourself a favor and opt out of this nightmare."}
{"text":"There now brewing there own beer. It's a really cool place in Cynthiana. Usually a food truck there, If not local restaurants will deliver."}
{"text":"I was excited to try this restaurant today with my husband and young son. While the location is pretty, the wait staff was slow, not customer friendly and forgot many things we asked for. For example, my son got the kids corn dog, fruit, lemonade and chocolate icecream. The waitress NeVER brought his drink and commented as we were paying that it was free anyways (makes no sense). She forgot the icecream until we made a point of it as well - this was the yummiest part of the entire experience. With only 1 - 2 other small groups of people in the restaurant, the wait staff was simply not attentive. Further, both my chicken and wrap itself was BURNED - literally tasted burnt on both, which isn't appetizing. I am disappointed by this experience today."}
{"text":"Great remodel of church, looks awesome inside. 28 beers on tap, plenty to choose from. Small Menu but we all enjoyed our dinners."}
{"text":"Great place to relax and hang out with friends. Just came in for a few drinks and tested out the homebrews. They were all amazing. Highly recommended!"}
{"text":"Loved the beer 28 taps. The food was excellent. I would recommend the fries or the chips and salsa as a side. The ambiance is enough to keep you coming back but the food, service, and beer were top notch. Will definitely be going back and looking forward to trying their brunch.  **update: brunch is ok but not competitive with other equally priced spots in the CU. Good spread just didn't live up to expectations."}
