{"text":"I LOVE this place. I've been coming here for about 5 years, mostly for breakfast, but occasionally for lunch and dinner, and I've never had a bad meal. There's almost never a wait, great service, and you'll get your food quickly, even when the place is full. We even came on Mother's Day and waited maybe 7 minutes, had great service and wonderful food. This is rare in the Madison area. The owner, Nick, is hilarious and a great businessman. All of the staff are friendly, funny, and professional.   I usually get an omelet or skillet for breakfast. Either one will leave you full - I usually can't finish the skillet. Lots of fresh and delicious ingredients across the board. They have a great club sandwich that I often get for lunch, along with burgers, french dip, and many other standards. Lunch is usually served with fries and your choice of soup (or a salad with a slight upcharge). Coffee is good and your mug will be kept full. Oh, and they just started offering fresh squeezed OJ which is truly delicious!  Dinner comes with a bread basket, as well as the soup and fries or other side. They have really nice looking senior specials that are extremely affordable. That being said, the whole menu is extremely affordable. It's a great place for a casual meal."}
{"text":"Oh maaan, I wish I could give more than five stars to this restaurant.  It is my absolute favorite place to eat breakfast, I don't even know how to start, the owner and the staff are so friendly and efficient, the food it is done so fast and so well all the time! And that is so hard to achieve specially when the place is already full and they still have more people waiting to be seated, they even have a cool machine to make fresh orange juice, wow, to me, that's awesome.   My top combos are, the garden skillet, which comes with hashbrowns, onions, red and green bell peppers, broccoli, mushrooms and tomatoes, choice of cheese (for me cheddar is the best bet) and I asked for my eggs to be scrambled (always nice and fluffy) and last you choose from toast or pancakes (I always upgrade to an English muffin) it is well toasted and shiny with butter ;)  My second one would be two scrambled eggs with sautéed onions and green bell peppers, Canadian bacon and of course my english muffin, which was the one I had today even though I am not a mommy yet ;)  I recommend this place 100% to anybody who is looking for a simple breakfast place with great fresh flavors, fair prices and a wonderful customer service."}
{"text":"Monona's best eatery. From the excellent staff to the simply great menu. Need a banquet eoom? Don't go anywhere else. The owner, Nick, runs a well oiled place, and keeps his people happy."}
{"text":"Ok. I have to say this place is a bit overrated. It's true that the prices are decent. The food for the most though is just mediocre. The coffee is so-so and most everything is too greasy for my taste. If you like oil and grease, you'll like it here."}
{"text":"Took the family out for Friday fish; pleasantly surprised.  Not fancy, but clean & comfortable. Mixed crowd, most over age 50.  Owner was foreign, not sure of nationality.  Starter was fresh baked sour dough bread.  Still warm so the butter melts, mmm good!  Meals include soup & salad & desert.  Soup was homemade veggie pasta - pretty good.  Salads were standard, but very fresh/crisp. French dressing - nice & creamy.  Broiled cod - a little bland & dry.  My wife's beer battered tasted great.  Fries were standard, fresh cut - OK.  Coleslaw was creamy & sweet - better than most.  My daughter's kid spaghetti was a rather full plate, noodles cooked well, average sauce.  Rice & bread pudding come warm & incl. whipped cream & cinnamon if you wish. Rice was nothing special, bread was the bomb.  Daughter's chocolate ice cream was good quality & incl. whipped cream & a cherry.  Older waitress that knew what good service is.  Owner was everywhere & was also host & cashier. Bit of a wait, but nice guy.  Bottom line:  $10+/meal = a ton of food.  It will become a regular for the family.  We'll sort through their menu & find our favorites.  Can't wait to try their breakfast!"}
{"text":"I was a little worried when my friends told me that they wanted to meet here for breakfast.  Just from driving by in the past it never really caught my eye as a place I would want to try.  They had the breakfast staples that you would expect at a diner.  I got the corned beef hash and scrambled eggs.  The friends got an omelette and a scrambler.  All came with toast or an english muffin.  Everyone was pleased with their meals.  Coffee was good and the service was great.  Our server was back to top us off any time we were down to half a cup.  The restaurant was very clean and our server was polite and continued to top off our coffee even though we sat around and chatted for a little bit after we had finished our food.  Prices were very reasonable."}
{"text":"Really good food. Very reasonably priced. The owner is very nice and the wait staff is awesome."}
{"text":"Stopped by for a late, late breakfast.   Saturday the place is open until 3 pm and breakfast is served all day.    Friendly staff and very reasonable prices.    Ordered garden omelette, cottage cheese with wheat toast and skillet with pancakes.   Tasty!"}
{"text":"Met here for a business breakfast meeting.  Sat immediately and our server was friendly and efficient.  I had the Armenian omlette, which was very good. Freshly squeezed orange juice rocked.  Typical dinner atmosphere with a lot of regulars.  I'll come back next time I'm town."}
{"text":"Sadly, I cannot rate the food here.  We were in town for a wedding and attempted to come here for breakfast before heading home based on the other reviews.  The place was semi-busy but there were open tables and no one waiting to be seated.  When we walked in, we were not greeted.  The man at the register proceeded to cash out other patrons, ignoring us.  A server walked by us twice, ignoring us.  When we asked the man at the register if we should seat ourselves, we told us he'd be with us soon and then proceeded to staple some papers together and then cash out two more customers who were leaving - there was time in between each person - plenty of time to seat us.    They obviously didn't care for our business so we left and went somewhere else.  I wouldn't recommend this place to anyone."}
{"text":"The places is entoxicatingly friendly and that's what keeps us coming back.  Unfortunately, a great deal of the food here seems either ill prepared or carelessly prepared with subpar or possibly frozen ingredients at times. The restaurant really seems to come from another time it reminds you of the eighties boxed, intoxicating, the friendly cheer, and reasonably edible food but unfortunately the prices are comparable with some of the possibly higher end hipster places in town but the food sometimes isn't. A great deal of the food here seemed either ill prepared or carelessly,   with sub par or possibly frozen ingredients at times. Having said that we go back and we've gone back more than once they have that gooey American cheesy of style omelette they have pancakes I mean if the choice comes down between Denny's or this pick this."}
{"text":"Every time I was here they are so nice and remember me, even where I like to sit at, the food is amazing and the staff are always nice and coffee is always filled up, I love the specials and the home cooked food there, is close to home and I never have to wait for food service. Family restaurants are where you will receive large portions, home cooked, small businesses is where I love to go to support my community."}
{"text":"Simply the best ever Classic! Great service!!! Lots to choose from well priced Lovely family run business just a wonderful wonderful place to have breakfast lunch or dinner"}
{"text":"My boyfriend and I come here all the time after sleeping in on the weekends. The food is pretty great and the manager is wonderful. Some of the wait staff is unattentive, took awhile to be greeted, get more coffee or water, etc."}
{"text":"Stopped by for breakfast after church on Easter morning.  There was no wait for a table and we received an incredibly warm welcome.  My wife is 40 weeks pregnant and we requested a booth.  The gentleman that hosted us was nice enough to make sure my wife was comfortably seated.   All of the waitstaff had smiles on their faces, despite working on a holiday.  Our waitress was attentive and kind.  My coffee cup was hardly empty.  I ordered the walleye and scrambled eggs with hash browns and a side of pancakes, while my wife ordered the breakfast burrito with hash browns.  Everything was fantastic.  My wife's burrito was satisfying and flavorful with the compliment of fresh salsa.  Her hash browns looked golden brown and perfectly cooked.  My hash browns were crispy and the pancakes were just what I was expecting with three options for syrup.  The real star was the walleye; it was well-seasoned, deliciously flaky, and something I would be happy to get on any Friday night fish fry.    I typically like to cook breakfast in my own kitchen, but this place is one of my first choices for that morning when I just want to go out to eat.  The food tastes good and is affordable.  There is a warm, comfortable, small-town atmosphere.  We'll be back, for sure."}
{"text":"I recently did a little experiment where I went out for eggs, toast and hash browns to every place from Sun Prairie to Monona I could think of. I took notes and rated each restaurant on that meal. (Yes, I'm a dork.) Monona Garden was one of my favorites.  The owner is East European and a real dry wit. My first time there, customers admired the big open space with all of the tables, and he said, \"Yeah, on Thursday night we pull out all the tables and have line dancing lessons. People put on cowboy boots and hats, and we have a regular shin dig.\" \"Really?\" they replied. \"No, I'm just pulling your leg,\" he said in his deep, Bond villain accent.  The food is good. I've had the simple breakfast I mentioned above, then a veggie omelet on a 2nd visit. The omelet was a little bland, which dropped them to 4-stars. The prices are reasonable. The restaurant has a cool, open feel. I say it seems like a Wisconsin supper club, but my wife insists it's got a family restaurant vibe. You decide. It's worth a try if your own culinary survey takes you near Monona."}
{"text":"I cannot say enough good things about this place. I was in town on business and stopped by for breakfast with a colleague. This restaurant has it all - and all of it good. It is clean and comfortable, service is splendid, and the food is terrific.  We were seated promptly and tried the coffee right off the bat, and it was excellent. The cups are small but they were never empty; the service was that prompt. We must have drunk six or seven cups apiece over the course of the 45 minutes or so that we were there.  I tried one of their breakfast skillets (the Meat Lovers). I am a big eater and I was unable to finish it. It came out piping hot and it was absolutely delicious.  The next time that I get back to Madison, you can bet your boots that I am going to try to get by the Monona Garden.  Last but not least, right inside the front door is a large American flag with a tribute to the men and women of the US military. Even if the food had not been good, that alone (especially in a city like Madison) would have been worth at least three stars. My kind of place!"}
{"text":"Very friendly and funny owner greeted us right away, service was quick and also friendly and the food was great and didn't cringe when we got the bill. The owner also thanked us for coming. A great choice!"}
{"text":"Service is great, the dish I got was disappointing, but the server had it taken off my bill without me asking or suggesting to take it off.  Any establishment that does that is top notch in my eyes, they remember how important the guest experience is to people."}
{"text":"Wow. What horrible service. Took us 10 minutes to order our food and they weren't busy. There were like 5 tables full and 5 waitresses available. The food came pretty quickly after but after we got our food the waitress never came to check back with us. Maybe she would have realized I never touched my food. I've never ordered a chicken Caesar wrap at a restaurant and have it have onions on it and I hate onions. The broccoli cheddar soup looked like it came out of a can. My fiance ordered the fajita skillet and it was decent but the hashbrown we're soggy. Because of the service we will never come back."}
{"text":"Absoloutly what you want from a family diner style restaurant. The coffee was plentiful and fresh, the menu was massive. Everything was cooked as requested.  It's not ground breaking cuisine, but if you want a traditional diner breakfast, this fits that bill perfectly."}
{"text":"Good food, family dinner,  not expensive and a lot of food for your hard earned dollar."}
{"text":"How does this place have a four star rating.  Very average at best. Staff was nice and good came out fast but I've had much better breakfast. Look elsewhere!"}
{"text":"I like it here. Walked in at around 8AM and was promptly greeted and sat at a nice booth. Almost immediately after that we had a couple waters put on the table and the offer of coffee or juice was given.  And when I say immediately I mean within 20 seconds of being sat.   Then the actual server came by and took our order. Food came out quickly and it was a really good breakfast.  The only complaint I have is the maple syrup is the artificial stuff and not the real stuff. That's such a minor thing I don't think it's worth mentioning...but the wife was disappointed so here it is.  I'd go back, she probably would too."}
{"text":"Really cute homey diner! Gave you your money's worth and great comfort food!! Awesome service!!!!"}
{"text":"Friendly owner with vague Eastern European/Greek/middle eastern accent? Yes.   Surly & mostly edentulous waitress taking your order? Yes.   Gyro meat included in the meat lovers skillet and/or available as a side order? Yes. (Although this may have changed with a menu revamp. Whatever, order a side of gyro meat and add it in.)  Efficient coffee service with hot refills essentially after each sip of coffee? Yes.   Fresh-squeezed orange juice machine that never seems to be juicing oranges prominently displayed? Yes.   Monona Garden Family Restaurant as your go-to brunch place to bring your family when you don't want to do your makeup or get dressed up? Yes, please."}
{"text":"You are close to being a four-star affair, Monona Garden, but there are just a couple of things that are keeping me from bumping you up.   I totally, totally get why people love this place, primarily because of the (presumable) owner - he looks and sounds like Alan Arkin but with a bit of an accent and a joy not found in most of Mr. Arkin's characters. His near-monotone voice doesn't fit his actions - he greets everyone that comes in, shakes the hands of children, and cracks jokes. It's like Eeyore emceeing a party. He made my day.   My food was good, but not great. I got the apple fritter french toast, and it was hearty and different - it looked like they baked a loaf of apple-studded bread and then battered it like traditional french toast. My boyfriend was convinced I was going to get pieces of white bread with apple pie filling on top, and I am glad he was wrong. I also got a side of hash browns, and they were incredibly under-seasoned and limp. I could probably count on two hands the number of times I salt my food in a year, so if I pick up a salt shaker you know it's pretty bland.   My boyfriend got a country-fried steak and biscuit breakfast, and said that it was good, but not the best he's had in Madison. He did appreciate that the steak seemed to be freshly battered and not a pre-made frozen version like you often find.   My biggest qualm is that the pricing seems to be out of line with the quality - for the two of us it ended up being around $25 - for a family restaurant breakfast that seems a bit steep, especially when the food wasn't spectacular. I'm not opposed to returning, but at that price point we'll probably keep exploring."}
{"text":"Great service good food at reasonable prices very clean staff great with kids even ice cream with kids meals"}
{"text":"Great classic local breakfast place. Heaping amounts of all of the plates. I personally recommend the skillets that are gut-busters to finish. I have also had the chop steak and bloody Mary's. They also have a FULL BAR!! the atmosphere is pretty solid and they have an awesome orange juice squeeze automated machine as soon as you walk into the place. Would recommend!"}
{"text":"nothing special.  typical of this type of family restaurant.  many pages of menu items, from liver and onions to eggs & bacon.  Worked pretty well in the 70s.  Not so sure now."}
{"text":"Just discovered this place--nice find. Generous breakfast, nice service, bright and open large dining room. Good place to linger over a traditional American breakfast with friends."}
{"text":"Typical diner style restaurant. The menu is big and has lots of options for all meals. I came for breakfast and got the biscuits and gravy. The gravy was good and had plenty of sausage. The biscuits were mediocre and undercooked.   The staff is friendly, but not always the best service. The prices are on the less expensive side. If you're looking for a diner experience, this is worth a try."}
{"text":"This family style restaurant is a gem of a place! It's always clean. The ambiance is bright and cheery. Service is prompt always and super friendly! Love the owner who is so welcoming to greet you upon entering! And then there's the FOOD! Breakfast past noon makes this one of our favorites! Salads are fresh and very big! Soup is homemade style. And you cannot beat the senior menu! My dad just ordered a roast turkey/dressing. It comes with soup, salad, roll, coffee and dessert all for $9.25!!!!! That's amazing! You should try this place, it too will become one of your favorites!"}
{"text":"Went for dinner.  We had the lumberjack burger, and the roast beef & Italian sausage sammie. Both were quite good, and very large portions.  Neither of us could finish.  No room for dessert!"}
