{"text":"Stayed at the Monte Carlo inn in Oakville and it was a pleasant stay.   The hotel is located close to the Highway and conveniently located in Oakville.   They have a beautiful fountain in the front entrance and have a nicely landscaped grounds."}
{"text":"Monte Carlo Inn is a good place to stay when you do not want to spend much money. It is not fancy, but it is clean and pleasant. The staff is okey. Check in and check out is fast.   The room we have gotten was really good for the price (around 60-70$). The fan in the washroom is extremely loud and unable to turn off, which was a bit annoying.   The location around the hotel has some food places and stores near by, but you would definitely need a car to get to them.   Overall I had a pleasant experience and I would recommend this place."}
{"text":"Good location close to the highway. Shopping Mall close by as well as a variety of restaurants. Mini-fridge, safe, microwave and coffee maker in room. Good continental breakfast. Reasonnable price."}
{"text":"Stayed at this Monte Carlo Inn after staying at the one in Barrie.  Improvement over the Barrie location: Actual high speed internet! Aside from that, the rooms were pretty much the same.  Pros: No grumpy people on staff. Clean rooms, no bedbugs, quiet despite all the children staying at the hotel that week. Decent location, with lots of food options nearby.  Cons: Same noisy bathroom exhaust, with no way to shut it off and still have the light on. That meant there were no stealth bathroom trips in the middle of the night, unless I wanted to wake everyone up. The free breakfast had only the most meager options available, and there was no hot breakfast upgrade like the Barrie location. No dairy alternatives for your coffee if you're lactose intolerant; although, the rooms all have fridges and there's a Whole Foods nearby. So you can bring your own.  Nice clean place. The friendly staff would keep me coming back."}
{"text":"We went to toronto for new years eve so we decided to unwind in the Roman style suite on new years day. To our surprise the restaurant and all was closed. The front desk was not all that helpful but he seemed as though it wasn't his regular position, as it was a holiday. The room was clean and the hot tub in the room was wonderful. Very close restaurants and shopping within reasonable distance. Would stay here again."}
{"text":"I stayed in Oakville for a work trip and my coworker chose this hotel. I wish he would have read a few reviews before he committed! Most of the time, hotels are pretty empty during the day and the parking lot fills up at night when everyone returns - nope, not this one. They were empty all the time. To summarize my stay:  Cons:  NO SECURITY LATCH ON THE DOOR IN YOUR ROOM!!! Outdated hotel decor Bathroom fan is loud A/C unit in the room is loud Elevator is dark and creaks Hallway has a musty odor Paper thin walls (I could hear the person in the next room clipping their nails  Pros There's a microwave in the room Free breakfast (nothing hot except water and coffee)"}
{"text":"Pulled in way late heading home after a busy couple days in Toronto. Initially stopped at another property with more vibrant signage but they were full up (advertising pays) and got directed here. Night clerk was kind and put us in a suite for the standard room rate, a little better deal than the Yelp check in offer. Yea discount! We were in an actual suite too, not just a big room; sitting area separate from the sleep. Crisp clean beddings on a comfortable not too firm king with a choice of pillows. Carpets are patterned and clean - when I spilled my sewing kit I only found buttons, bobbins, and such. Nice straight back in the sitting room; the upholstery and cushion have plenty of life remaining. Julie(?) tends to breakfast; clears tables and keeps the counters stocked with juice and coffee, croissant, pastry, boiled eggs, fruits, yogurts... better than many hot breakfasts I've had on the road, and probably healthier too."}
{"text":"I bought the Groupon for the Monte Carlo Inn in Oakville back in the spring and thought we'd finally use it for a fun staycation date night with my husband.  The Groupon was $129 and included room, 3 course dinner at Pomodoro Restaurant and a bottle of wine (taxes and gratuity extra).  So our Wednesday night date featured a smooth check in, room as shown on the Groupon with jacuzzi tub and a warm bottle of house white which was from Kittling Ridge (not too bad!) but no cork screw. So we obtained a corkscrew and some ice to add to our wine and chatted until we got hungry.   We brought a nice bottle of wine with us and were planning on bringing it to dinner (since the \"restaurant\" is really just a room in the hotel) but were told by Tom, our waiter, that no outside wine is allowed. Understanding this rule we ordered the most tolerable $27 bottle of pinot grigio we could find on the wine list. The wine arrived, while our water glasses remained empty for another 15 minutes. Tom poured our glasses 2/3 full and set the bottle on the table. Some time later, he took our food orders - antipasto plate and calamari to start, and spicy sausage penne and seafood fettucine for our mains. Starters arrived in a timely manner and the calamari portion was HUGE, easily enough for a main course. When the mains arrived, they were even HUGER! It was ok pasta and ok sauce, generous serving of mussels and shrimp. We were getting thirsty and hadn't seen Tom in some time, so I went and refilled our waters at the bar. He said he could do it when I got up there and I said this was easier. Our second trip to the bar to refill our water revealed that Tom was doing a crossword puzzle while sitting on a chair. Desserts were eventually ordered and arrived. I felt like a coffee so my husband went and interrupted Tom's crosswording again to request some. At the end of it all...get this! Tom asked if we would like to open OUR bottle of wine now! Ha ha ha ha. Good thing the $9.03 gratuity was included in our room fees because he certainly didn't receive one from us.  Ended the evening with a nice jacuzzi bath and a good laugh about it all. Monte Carlo Inn Oakville is fine, Pomodoro is atrocious, and the breakfast was very substandard (toast, jam packages, cereal, coffee, whole apples). Enjoy!"}
{"text":"I went to the Monte  Carlo inn in Oakville for a one night stay and the sofa and bed was infested with bedbugs My partner  and i didn't  sleep at all . We were so itchy we had bites on our body . We had already  paid for the room and couldn't  get a refund. So i definitely  would not recommend  the inn for a special getaway.  However the pro was that the food was great and pleasent staff."}
{"text":"Perfectly acceptable hotel, if a bit run down. It's not the most tasteful hotel I've ever stayed at, but it's comfortable, very clean and the staff are helpful. Great location near the GO station and the highway.  As other reviewers have noted, check in was easy and quick. Free Wi-Fi throughout the hotel is a bonus.  I got a deal through Hotwire and it was good value."}
{"text":"I stayed at this location for about a week. Was on a business trip and decided to stay outside of Toronto.   I enjoyed my stay here. It isn't a 5 star or even a 4 star hotel. It's what you would need...a clean place to stay at and sleep at night. The staff was friendly and the check-in and check-out procedures were painless. There was the continental breakfast included...I don't like those because all you get is toast, bagels, cream cheese, and some tea/coffee. Nevertheless, it was a quick breakfast.   The location is quite good because of the GO transit close by, the main mall, and then the highway all in close proximity."}
