{"text":"The service at Montfort today was so pathetic that I find it almost useless to write a lengthy review for a place that can only and inevitably receive  score of 1 star. My sole comment will be on the epic failure that was the chicken and vegetable soup I ordered. According to the menu, Montfort takes soup seriously and they are (nearly) world famous for their wonderful soups. Intrigued by this (false advertisement), I ordered. Pfffff! The chicken looked like beef cubes or some mystery meat but the waiter swore it was chicken, the veggies were 'from frozen' and the broth was just unappetizing. The rest of the food was decent, everyone ordered the Montfort chicken and it didnt disappoint but it also was nothing to write home about. As for the service, how can one comment on something that never happened...?   I definitely would not go back unless desperate and ordering to-go. Montfort, you are the weakest link."}
{"text":"This is the same Montfort Restaurant chain that is located on   60 Dundas St E (Dundas and Hurontario) 5130 Dixie Road (Dixie and Eglington)  This new location is definitely newer and spiffy. I came here for dinner with a friend expecting the same Mediterranean cuisine as the other locations.  However, with the \"new-ness\" of this location, the service is very professional and the food is very well prepared.  Its a different feel than the other 2 locations.   They have the same menu but with a few adjustments and deductions. So make sure to ask first.  The chef is great, I asked for something that was off another dish and he was kind enough to make me a side of caramelized onions on the house. (it didn't come with my entree, but he sent it anyway).  we both had the chicken souvlaki dinners (plates) with rice and salad.  Delicious.  The trademark red onion tomato mixed sauce + garlic sauce is served prior too.   I also love the Hummus dip here. The pita is soft and traditional middle eastern style.  I am not a big fan of the shawarma here, but highly recommend the plate dinners.  Only order the plate if your HUNGRY. The serving is quite large and filling.  so its also a good sharing entree if you order an appetizer.   I also tried the lentil soup-  red lentils and quite thick. I personally love lentils so I was happy with it.   The Mango juice is classic and easily refreshing with the meal itself.   overall, I was quite happy, a plate dinner for 2 + appetizer+drinks comes to around $30.00. not including tip.   :) FYI - good place for a dinner date.   xoxo M."}
{"text":"Friendly service and tasty food in just the right portion size for lunch."}
{"text":"Went there for dinner and I wouldn't have been disappointed about the food if it wasn't for the steep prices. It really wasn't worth what we paid, and I will not be back."}
{"text":"If you are craving Mediterranean food you have come to the right place! No matter which location, they will deliver the same delicious meal! It was my first time at this location and the food was amazing just as I expected. This is a brand new location so it's all new and fancy but still the same approachable friendly people you expect. Portions are fairly large, had the regular size lamb entree and it was more then enough for myself.  Couldn't afford eating here every day ( although I wish I could ), but well worth the money! :)"}
