{"text":"Solid, but dated, hotel and conference centre located at the nexus between Mississauga and Brampton.  I came here for a business event held by the Miss./Brampton Board of Trade, and the first thing that stuck out to me was the fast and friendly service. My colleague and I were immediately greeted by the frontline staff, along with a pair of restaurant workers who appeared to be getting things set up for the event on the sixth floor (and were wearing jerseys in recognition of the Humboldt Broncos tragedy).  This building is definitely in need of modernization. While the event itself was well-catered (and set up nicely by the aforementioned workers), the A/V quality was poor. I'm unsure if this was on the organizer's end or from the hotel's own equipment, but there were constant malfunctions with the sound system and the speakers' voices were tinny and washed out, not to mention that audio couldn't play from a laptop wired into the sound system (and forcing the speakers to verbally communicate what was being said in the videos because no one could hear it).  Being across the street from a police training academy, it doesn't seem like this place has any crime or vandalism incidents, but prior reviews do mention that the staff refuse to keep an ATM on-site because it attracts \"unsavory\" people. This seems to be a cop-out excuse, considering they're literally a 30-second walk away from the police officer who sits at the front desk of said academy, but what do I know?  The rest of the experience was technically proficient. A clean lobby with a nice restaurant area (which was closed that day), comfy recliners and chairs to sit in, lots of nice tchotchkes to take home (really nice pens that worked right out of the package and notepads), and some wry technicians who seemed bemused that the A/V wasn't quite working right after so much finessing.  This Monte Carlo is a competent spot for events and the like, but I find myself agreeing wholeheartedly with the reviews that say it needs an upgrade, because there are a whole host of hotels down the road that offer much better experiences and don't cost much more."}
{"text":"I am visiting for the day for an event and I am that annoyed by the poor or lack of customer service I received in a minute long talk to express to people that you should never subject yourself to this inn. They don't even have an ATM??   Edit: note that the management only acknowledges that they do not have an ATM for personal reasons (not taking in to consideration if someone needs cash FOR NON HOTEL RELATED PURCHASES) which frankly is completely irrelevant as my original reviews pain point was their poor, or LACK OF customer service which they so clearly flaunted in their comment completely disregarding the staff issue :)   DO NOT WASTE MONEY ON THESE PEOPLE. SAVE YOURSELF."}
{"text":"It never bodes well when you drive into a hotel's parking lot and have to dodge the rats running all over the place (including right under my car as I was parking). Despite that, I checked in (since I had prepaid on Priceline) and hoped for the best. The staff were efficient and friendly and the lobby was clean and inviting but those are about the few positives I can offer. As soon as I opened the room door, the smell hit me in the face....chemically, like walking into an indoor pool building. The room was *very* tired and had chips/nicks/cracks in all the bathroom fixtures. The bed was comfy and I got used to the loud noise of the archaic in-room a/c system. Not the worst place I've ever stayed, but I won't be booking again."}
{"text":"We were disappointed by our stay at the Monte Carlo Inn.  Downsides: 1. Rooms were small and dingy.  2. Nice view - of industrial wasteland. 3. Breakfast consisted of coffee and pastries. 4. Heavy traffic between here and downtown, seems to be pretty much constantly.  Upsides: 1. Close to 401 2. Cheap."}
{"text":"The other two reviews here as of today have pretty much covered everything. We were visiting family in town and they put us up here, so the old adage is true.   I will say the bed was firm and nice. I wasn't looking for much more, so I wasn't really too pressed by anything else. We checked in with a number of bags which nobody offered to help with. Because of that, although no one here was unfriendly or rude, I'd have to say the service level is marginal or poor."}
{"text":"I was at this property in Toronto for a business meeting.  Rooms were slightly below average in terms of cleanliness.  Decor was very outdated.  Bathrooms were small and contained what I would dub as \"the worlds shortest toilet\".  It felts as though my knees were above my head when I sat on it.  Shower was small but clean.  Air-conditioner controls worked but it did not cool the small room down during my stay.  If I had known there was a Hampton Inn across the street, I would of stayed there."}
