{"text":"Great new place around the corner from Ossington. Food is delicious. We started with fresh baked bread and dandelion herb butter.  Amazing!  Also tried creamy potatoes, lake fish in a decadent butter sauce, mussels, duck hearts, and raw vegetables served with a light and delicious spinach dip.   The food is meant for sharing. I recommend going with at least four people so you can try a lot of dishes.  The three of us were stuffed by the time we left. Some of the descriptions on the menu were underwhelming (cooked lettuce in broth - sounds blech; tasted great). Luckily, our server was patient and walked us through the menu.   There is no chocolate on the dessert list so we skipped dessert and walked up Ossington in search of ice cream sandwiches.   The kitchen is open and in the front of the restaurant which is kind of different. The dining room is cozy but sparsely decorated. Still giving five stars because the food and service more than made up for the \"in development\" feel."}
{"text":"My friends and I experienced the tasting menu last night. The tasting menu is a good way to try majority of menu at a decent price, including the main entrée (i.e. duck breast, shoulder steak, trout), sides (I.e., mushroom, zucchini, green bean, radishes) and appetizers (I.e., cheese, ham). Of all the items, our group found the duck breast and shoulder steak, mushroom and cheese are remarkable. There was nothing wrong with rest of the menu but I expected them to be more refreshing and serving their purpose as appetizers. Courteous service but description of menu was a bit superfluous."}
{"text":"Beautiful food and room. Perfect service. Each ingredient was perfectly showcased and beautifully handled. Standouts were black oyster mushrooms, incredible baked celeriac, delicate but intensely flavoured trout and financiers (perfectly buttery) and amazing sour cherry puree. The duck was also perfectly cooked and served with an slightly sweet and intensely flavoured miso accompaniment. Thank you for this sophisticated food and restaurant - it reminded us of Luksus in Brooklyn, so nice to have a restaurant of this calibre here in Toronto."}
{"text":"Welcome to the neighbourhood!  I feel the love. Montgomery's is a new restaurant by Guy Rawlings, chef and previously director of operations for Bar Isabel and Bar Raval (big fan of both). Back in the kitchen here, Guy pioneers his staff to create Canada-celebrating food with ingredients that are as local as possible. I came with a friend for a very early eve, Thursday night. We walked right in, but it's only a matter of time before word truly gets out and this place is swarmed (in a beautiful, deserving way).   The atmosphere soothing and earthy, yet with white walls and Scandinavian furniture. Some may walk by Montgomery's and not immediately spot it. The entrance is open kitchen first, with a cozy dining room in the back. Do not make that mistake! When I saw the doors closing on the previous business in the space (a diner), I had a deep feeling that something good would be coming in its place. Such a prime corner!   Service was lovely. They held our hand through each course. We started with bread with garlic and dandylion butter, which went amazingly with a homemade cottage cheese dish. We also shared the eggplant dish with caramelized whey, hibiscus and anise hyssop and ordered the salmon collar. The salmon collar is served simply, fresh and oh so tender. A nice and light supper for us.    With the care you see in each little dish, I consider this very good bang for your buck. The wine list is very nice, and it will be interesting to see what comes out of this kitchen in the coming weeks. Perhaps a cocktail program? Who knows! Looking forward to it."}
{"text":"Been back a few times since the first time we visited.  Still love it.  And the beer list has improved since the last time I was there which is a nice bonus.  A couple of stand outs from our recent visit were the trout (really excellent and delicate for a fish that can often be quite overpowering) and the honey cake with wild ginger."}
{"text":"Went here for an impromptu dinner, we had the tasting menu and I can honestly say this was one of the best dining experiences I've had in awhile- so much so that I decided to leave my first ever review. The food was delicious and the atmosphere is very warm and cozy. Thanks for a great evening!"}
{"text":"The dining room is in the back, behind the kitchen, and is pleasant, wide tables, suitably spaced apart.  The service throughout was cheerful, and informed. The cooks took part in serving. The staff recognised that the menu was somewhat unusual and held one's hand throughout the process.  We were less ecstatic about the food than some of the other reviews here.  The bread was crisp and delicious but we didn't experience anything exceptional about the butter.  The goose cretons were rich and strongly flavoured with clove and the mustard, supposedly smoked, didn't taste smoked and somehow the goose seem to be missing.  The trout had a strong muddy flavour but was bland in the presentation and accompaniment. We chose the leeks to help it out, which were excellent, but only a very small portion.  The stewed lettuce as a dish to separate the courses was unusual, but the lettuce was bitter and the stock nothing exceptional.  The beet tagliatelle were excellent, flavourful and with crunchy texture. The highlight of the evening.  The accompanying thin slices of beef shoulder were fine but again nothing exceptional.  We finished off with the pecan financier and pear compote - a tiny portion.  Almost all of the wines on the wine list, I'd never heard of before, and the three that we tried were expensive for what you got  The music was weird and slightly unsettling, we managed to have it turned down.  Overall; unusual, but not good value. ( Our bill was greater than $300 for two all in )"}
{"text":"Not sure what the hype is about - great service but the food was bland and boring. The roast broccoli was 2 large chunks of broccoli boiled and charred with no seasoning served on an oversized platter with nothing else on it. The potatoes with cheese were gummy and the celeraic tasted like it was dressed in miracle whip.  The tarte tatin were decent but the financiers were extremely oily"}
{"text":"Interesting menu items, chill and laid back atmosphere, no liquor (wine and beer only). Cute date spot."}
{"text":"I have been to Montogery's twice since it opened its door last year. Both meals were easily one of the top 5 meals I have had in Toronto. The intimate space might not look much and even confusing with their layout and decor but the food and wine is really the star of the entire space.   Their menu is simple and vegetable focused. They offer 3 different types of butter plus dip and terrine for their famous sourdough bread. The dandelion butter gives a pleasant grassy punch and the cultured butter has a lovely butter milk aftertaste. I also am a big fan of the  toasted lentil dip w/ miso & sprouts . You wouldn't expect the umani flavour of miso goes so well with their cold press olive oil and the freshness of the sprout. However I do wish the bread came warm instead of cold. For entree, the sunchoke (Sunchoke, water buffalo fresco, green apricot, sorrel) and celeriac (Salt baked celeriac, garlic aioli, celery & parsley salad)  are my absolute favourite. Guy Rawlings really celebrates the uniqueness of the vegetable by complementing it with surprising flavours and execute it his highly skilled french cooking technique. We also ordered a fish entree, the pickerel, bone sauce & kale. The pickerel was cooked to perfection, very generously season with a almost smoky taste of the bone sauce. We wiped the plate clean with the bread. For dessert, I have tried the Black walnut financiers & blackberry coulis, 'Rhubarbo' mousse, raw rhubarb & toasted oat and Tatin aux pommes à la Passard. My favourite would be the black walnut financiers, its a perfect way to end the meal with coffee or wine to go with this little taste bomb full of almost gasoline, earthy flavour from the black walnut.   I would have to check in to get a Rawlings fix regularly every now and then. Its one of the most sophisticated, confident, creative yet authentic restaurant that is absent in the Toronto food scene. I recognize this place might not hit the spot for everybody. But I would highly recommend this little gem to anybody who has a diverse palette and interested in the authenticity of the humble ingredients."}
{"text":"I haven't been blown away by a meal in Toronto in ages. This meal though, this blew me away. It's very simple fare, at least to the eye, but the flavours were complex in every dish but allowed the amazing quality of ingredients to stand out on their own. We got the $65 tasting menu and were not disappointed by any of the dishes   Some highlights:   The duck (fall off the bone!) The trout (cooked to perfection) The charred cabbage (just trust me) The tarte with ice cream   The wine (bottle of Pais) was interesting and perfectly matched our meal   The service was attentive, honest, not intrusive. The chef, Guy, watched over the dining room to ensure every table was taken care of and felt like he tailored each diner's experience. It's clear he has put his heart into this restaurant. Its a tough industry but I sincerely hope this restaurant will be successful and stay around for years to come.   Overall I am very impressed and will be back!"}
{"text":"Amazing creative food that is bursting with flavor. We had a flawless meal full of delights. The Moulin a Vent was divine. Impeccable service and a warm welcome from the owners."}
{"text":"The food here was delicious, really. Fresh, creative, a diverse set (we got the tasting menu). Huge points off for portion sizes though. For 6 of us, we were served appropriate portions for about 3 people. Left hungry. About 1-2 bites of each dish for a $700 meal was disappointing."}
{"text":"Great service! I like how they spread out the guests amongst attached tables.. best mackerel yet! Try the tasting menu"}
{"text":"We tried the tasting menu that happily accommodated both veg and non-veg alike.  Every dish was memorable and liked that the ingredients were locally sourced.  Wait staff was welcoming and friendly, and the atmosphere was cozy and romantic.  Highly recommended!"}
{"text":"Lord yes. After wandering a while in the wilderness of overhyped Toronto restaurants, a friend suggested we try this place. Turns out that Montgomery's is one of the best meals I have had in Toronto in the last year.  Montgomery's is that subtle place that sneaks up on you unawares. You enter into a kitchen/front of house area that looks like a school lunchroom, yet are taken to a warmly-lit, elegant dining area in the back of the house.  The menu is built around sharing plates. I shared a pork and duck terrine with mustard, lettuce broth, a cabbage dish, mushroom and black truffle dish, and a trout before heading on to the honey cake and financiers for dessert. Everything was delicious and pleasantly surprising. Lettuce broth? Sounds terrible, yet turns out to be amazing. The fish was cooked perfectly; the financiers- omg; and those mushrooms were out of this world.  The dining room seats approximately 30-40 people and has a fairly low-key vibe. There is no loud bar or music blaring, so the place makes for a good romantic or business dinner where conversation is important.  They have a respectable wine list and a helpful sommelier. Wine prices by the glass are a bit high though. Most start at 15$. A nice, cheaper red option, both by glass and bottle would be nice. (Even Scaramouche manages a cheaper bottle or two.) For dessert they have a sumptuous glass of Moscato d'asti that is 10$. Goes well with the honey cake.  I left here feeling completely satisfied. This is a culinary delight that can serve vegetarians a delicious meal as well. I can't wait to go back."}
{"text":"Incredible food.  Cannot say more than this is a must go and a very unassuming place.  The entrance looks more like a variety store (which it actually used to be) and while I was confused walking in, I almost hope they do not make any major changes to the facade. It is such a wonderful treat to walk in and see a very open concept kitchen with the chef working away right in front of you. The back opens up into an almost most between and old wood English pub style restaurant and ones family living room.  The washrooms are great!  And the food!!!  This was an incredible experience.  The Wait staff know their stuff and are more than happy to give you their recommendations.  Not cheap but well worth it!"}
{"text":"I'll admit the menu confused me at first. The first section looks like apps, but it's all just things to put on the bread... Including smoked lard (which table mates claim was amazing).   It's a small food menu, with a large (and pricey) wine one. The food has little focus on presentation, and the decor is only a small step up from a church basement food hall.   BUT, the stuff. Has. Flavor. Everything we had was amazing, strong flavors, and even though portions were modest, the tapas style made it so we were a satisfied party of three having ordered every veggie dish available.   Note! The veggie dishes are NOT vegetarian. They're open about that, but just FYI ahead or you'll be relegated to the (fantastic) desserts."}
{"text":"Party of 4..  We all ordered the tasting menu..  We shared a bottle of wine...  Left for home... Arrived home.. Promptly grilled a hamburger.. Ate it with two pickles. Ahh.. Only then was I satisfied.. Get the point?   I arrived hungry and I left hungry.. Felt ripped off and had the runs for two days because of all the fermented food I had during that dinner.   The duck sample was good though.. All the other pretentious stuff that had a muddy odour to it?   Blah....  And shame on the food critics that gave this place good reviews.. You are just as pretentious as the food.  Spineless critics.  3 days to make bread?  On what planet?    I could have done so much more with the hard earned money I spent in this place...  I mean.. Who hangs a carpet on the wall?  Sorry..not sorry.. Just being honest.  Fitting that it's across the street from the old Toronto Asylum.. You have to be insane to want to pay this money for this \"food\".   This spot was my choice... Our friends insist next time it's their pick.. In fact, I owe them multiple picks."}
{"text":"A small resturant with very cozy decor.  The kitchen is right at the front entrance so you know what they are doing.  Both the food and wine menus are small but unique.  Portions are made for sharing and expect to order and average of 2-3 dishes per person.  Really like the trout, nothing super fact it was very tender with lots of flavours.  The need shoulder meat steak was the best should Ive had.  Surpassed my expectations.  Didn't order the duck, but saw it being prepared by the chef, looks amazing.  Now we move to the alcoholic beverages.  It is a list with about 30 wine selection, separated by sparkling, rose, white and reds.  You are not going to find big name wines here, instead they are names that you do not usually see on menus.  Everything is available by the glass, so I am sure you will find something that suits your palate.  Overall, the service is very sincere.  I give it 4 stars because I feel there are always areas for improvement."}
{"text":"Went for dinner here with foodie friends on a double date. My first thought was that this is the perfect place to bring a date. Stylish with romantic, soft lighting. Sexy. Ambience plus. The menu, which is meant for communal dining (sharing!) is compelling & interesting but unpretentious. Lots of local fare (including ingredients grown on the rooftop garden!) great drinks list. Hits all the marks. I'll be back."}
{"text":"Outstanding new restaurant on Queen St. Everything about the restaurant s unassuming and understated, which makes the food that much more surprising when it crosses your lips. You can taste the immense talent behind everything. Even raw vegetables taste special coming out of this kitchen. I've never had such complex, spicy and tasty radishes as I had in the crudites. Another standout for me was the beans and pork sausage, which seems like a riff on the Brazilian dish feijoada. The sausage itself is homemade and so good, and the bean stew around it so well composed. I also loved the marinated mussels, the broccoli, the torched mackerel and every other damn thing. It's hard to even write a review because Montgomery's is so different from anywhere else. It's a place you can tell is loved, deliberated about... it's new but seems lived in. It has passion behind it and it shows. Go here!"}
{"text":"Guy Rawlings is literally in the spotlight at his new Queen West restaurant. Diners are welcomed into the sprawling, open kitchen (a rarity in most downtown spaces) and standup bar area, where, if you're lucky, Rawlings will flash a quirky smile and say hello. This is the intimate welcome I crave at most downtown Toronto restaurants and Rawlings gets five stars for first impression.   Montgomery's really knocked it out of the park with service, too. I dined with three others and from entrance to exit, we were all taken care of in a genuine way. Our server was attentive, but not overbearing. She suggested some of her favourite dishes from the menu when we asked. She was also extremely accommodating to one diner's allergy.    In terms of the dining space, it's best summed up by: hipster bomb shelter (textured off-white walls, dim lighting, low ceiling, kitschy salt shakers) meets grandma's kitchen (Corelle-like dishes, giant wall-mounted rug, dried herbs and flowers strung across the space and that indescribable \"grandma\" scent of lavender and something else I can't quite put my finger on).   Ambiance and service set the bar high. The food, on the other hand, lowered it slightly. Coming from Bar Isabel and Bar Raval, I was expecting an epic meal. Montgomery's food and wine menus were both refined and well curated, which made the selection process easier. The Canadian-inspired menu incorporated local and seasonal ingredients such as leeks, PEI beef and freshly baked sourdough served with a variety of butters or lentil dip. At the server's recommendation, we tried the bread and butter, broth and lettuce, mussels, celeriac, mushrooms, leeks and whey, duck and beef. Although the servings were on the small side, they were priced well considering all the local ingredients. The duck was cooked to perfection, complete with crispy skin and delicious garnishes. The leeks and whey were also a palate pleaser, but there was nothing novel about how they were prepared or presented--they were essentially melted leeks with a sprinkling of fresh herbs. The broth was underwhelming and very bland (should have given the salt a shake). Our group also found the beef undercooked and a tad on the chewy side. What I loved most was how each dish was presented with beauty and care (something I always value as a trained chef). The food was pure and simple, showcasing the ingredients for what they were instead of hiding them under garnishes and sauces.   All in all, the tastes were too familiar for my liking (I was expecting more of a culinary adventure from Rawlings--an \"update\" on grandma's cooking, so to speak). I wouldn't go rushing back for the food, but I'd consider grabbing a drink at the bar to watch some live kitchen action. Kudos to Rawlings and Montgomery on their new space--I had a lovely evening. :)"}
{"text":"My partner and I ate at Montgomery's for a special occasion, having not known much about the restaurant but being recommended it by the staff of a nearby retailer. Subtlety seems to pop up as a theme in many of the reviews of Montgomery's, and it's an appropriate descriptor. Everything from the entrance, to the dining lounge, to the plating is  understated, but also decidedly beautiful. The open kitchen that greets you when you walk in is a great touch, and literally puts the food at the front of the experience.    We ordered the sharing menu, leaving the selections up to the restaurant. We both agreed that there wasn't a miss in the entire meal.   The dishes arrived in four (bountiful) courses, and while the plates are small there is no way we could have left hungry. The sharing menu allowed us to sample a significant amount of the menu.  The snacking plates that started our menu were fun and creative, while the later courses (including both the trout and the incredible aged duck) were refined and close to perfectly executed.   The drink menu was also pleasantly concise, while still being quite interesting. Rather than sheer breadth it seemed to really focus on wines and drinks that matched the spirit of the restaurant.  Montgomery's was one of our very favourite meals we have had in Toronto. Wonderful ingredients, expertly and simply prepared, but always interesting."}
