{"text":"Very good coffee.  Cool products.  Good baked goods and delicious pies (sweet and savoury).  Super nice staff and owner.  I like the scones especially as they are not overly sweet like some places.  Glad they started adding some lunch friendly offerings like soups etc.  Hopefully that menu expands with time."}
{"text":"So I've never been to the shop, but I see this lady at the Montgomery Inn farmers market.  Sometimes I get a scone or a butter tart and they are always delicious (earl grey and white chocolate scone... Mmmm so good). So I have been having a craving for a slice of cherry pie since my birthday (beginning of Feb).  I'm not gonna lie, I was imagining the overly sweet sugar coated crust with canned filling... Not sure why?  So, last week I'm going in for my scone when what do I see.... A mini cherry pie!  At $7 I'm thinking what a steal to fulfill my birthday dream!  I have enjoyed this amazing little pie on two different occasions with one little piece still remaining.  I'm overjoyed every time I take a bite.  And it's not that super sweet processed cherries from a can pie I'd envisioned.  It's the real thing!  Perfect amount of sweet, real cherries and a great crust.  Happy birthday to me."}
{"text":"The owner is very friendly and they have lovely baked goods and coffee. They also sell meat pies.  Check out this great neighbourhood coffee house. It opened about 3 months ago and it's a welcome addition to the area!"}
{"text":"Louise is the owner and I cannot say enough how patient and accommodating she was. She made 4 different pies for my husband's birthday celebration and they were to die for. Apple with crumb topping, peach-blueberry, chocolate pecan and a gluten free cherry. The review on the chocolate pecan is worth mentioning i.e it was not overly sweet which is usually the case with chocolate pecan pie. Absolutely delicious!! I also purchased 2 kinds of biscotti: cherry almond and pistachio and probably the best biscotti I ever tasted.   Louise also made quiche for the morning of the birthday and again probably the best quiche I have ever had. Very fluffy and creamy fillings. I ordered a bacon onion, ham and red pepper and 2 spinach mushroom one of which was gluten free. Please support More Than Pies for your dessert and breakfast needs!  Thank you Louise for making my husband's birthday so memorable!!"}
