{"text":"motherland never fails to make me happy I ordered Ogbono soup, vegetable soup, jollof rice and moi moi with plantains on two different occasions soup fish goat meat and all on point!"}
{"text":"First time eating Nigerian - food was delicious!! Good conversation and casual service. Dola was wonderful! Will be back."}
{"text":"Very disappointment. My friend and I looked at the menu. It said the entree including moin moin. When getting the bill, we got charge $6 extra for 2 moin moin. Which mean the entree worth $13 including 5 pieces of goat meat and rice, unbelievable. Then I got charged $2 for two bottles of water. We had to wait total of almost 30 minutes until the water came back to ask for a drink since he did not ask or offer anything when we sitting. Giving how shitty the location is, charging $1 for a bottle of water is ridiculous. We ended up spend a lunch for two worth $36 with some unexpected extra charge. I could really go to a nice restaurant with much better food and service than this. Never come back again for sure."}
{"text":"I'll give it four stars because of the authenticity of the food. However, I do believe there are some areas of improvement. For one, the food is not always consistent. One day it might be great another day different. The wait time is too long if it's not a sit and serve model. You have to order and wait 10-20 minutes to get your food after ordering. Most importantly the price isn't always consistent. Now I don't mind a few bucks, it's not about the money, plus i want this place to do well. But I do believe there should always be consistency especially when it involves money. I will still continue to be a patron but they have a long way to that 5 star."}
{"text":"This place is AMAZING. The food is full of flavor and made with love by the owner. She was so kind and made us feel like we were sitting in her home. You must visit this restaurant, I'd be there everyday if it wasn't so far from where I live"}
{"text":"Went here with a group of people that frequents authentic cuisines in the Charlotte area. I'd never tried Nigerian food or knew what it was about - but I can tell you this is about as authentic as you can get. Clearly family owned and operated - which was really sweet.

We did go in with a large group of people (nearly 20), which I know they aren't accustomed to 20 people ordering all at once. That was the only thing that made the food slow.

If you're looking to try authentic foods around the world, I'd recommend this place. I had the fried goat and a meat pie. Both very tasty. Several of my comrades had the soup and it was really good too."}
{"text":"Fantastic Nigerian food!  The service was amazing and the food was fresh.  We had the okra, egusi and pepper soup.  Everything was delicious!   I would definitely come here again!"}
