{"text":"service is quick, efficient and right as expected. beers are a plenty and the food menu is above par for standard bars. like how I can bring my children here for a good breakfast that doesn't break the bank and are separated by the glass. we will be back for sure."}
{"text":"Yes, prices are TOO high for poor food quality... this is a slot joint with cheap high priced food."}
{"text":"This place has been a favorite for some time till the menu changed and places prices went gourmet. The food taste doesn't fit the prices for a bar. The staff used to be good now servers on laptops at the bar or cell phones right in front of your face. Servers behind the door in kitchen talking up a storm at night when the items u just asked for aren't making it to the table and u have to ask the other server for it. Servers that can't remember a simple order when they have a pad of paper in there hand to easily right it down. The lack of seasoning on the food mostly the dinner menu. Overcooked rice. No seasoning on steak. Under cooked veg... it's just sad tacos used to be in flour now there deep fried. There chicken tenders taste like the fish always. coffee is mostly always cold. Very slow to get food to table. The bartenders seem to be the ones to order from they pay more attention. Breakfast is not good hash browns are always greasy.   There selection isn't great limited on dinner menu. 30 bucks for a steak dinner when it taste bland.  Needs a overhaul."}
{"text":"A couple things I wasn't happy with: (1) there were tables available in the nonsmoking dining area but because we didn't have a \"reservation\" we were sat in the smoking bar dining area & (2) our server was SUPER SUPER slow - took her 45 min to get us menus, drinks, & to TAKE our order. However, once we got rolling, it was fine. The bottle of wine we got was good, the fried pickled chips were surprisingly super good, the ribs & pasta & salad were super good too. Extremely reasonably priced for the amount and quality of food.  We had a really good time, good food, nice place."}
{"text":"The food is not up to par, nothing seems fresh. Something tells me the microwave is working overtime in the back. Went to just drink one night with my husband and the bartender was less than attentive. Would really recommend a whole menu overhaul."}
{"text":"I dont know why I keep giving this place a shot. Third time in 9 months Ive tried the food and pretty much its not worth the price tag and is, for the most part crappy. Ordered a burger, it was over cooked and the bacon was next to raw. After I finished I found a hair to boot that def wasnt mine. Drinks are ok here but that's it. Much better places to eat in town."}
{"text":"This place has fantastic food!  All made fresh in house and Paula is a phenomenal waitress!   Very knowledgeable and friendly."}
{"text":"My family and I were looking for a reasonable place to eat, while staying at the Westin Lake Las Vegas and this was it.  Prices were reasonable, clean, food was good, out of the sun.  I took off a star for a little slow service, but it was nothing that would keep me from going there again."}
{"text":"Save your money and frustrations. We didn't go in the bar, but the server and food in the restaurant are terrible. Seats were sticky too. Won't be coming back."}
{"text":"Been here at least a dozen times and have never had a bad meal. With a beautiful view of the strip it is hard to beat in Henderson. The only reason they are not five stars is because their food is slightly expensive, and I'm bitter I haven't won money there. Great place will continue to keep coming in."}
{"text":"Excellent food always served HOT to your table. Pizzas are great and so is everything we've tried on the menu.Service is also efficient. Nice atmosphere and an awesome view of the Strip after dark. Open for breakfast, lunch, dinner and late night snacks. Nice fireplace with low seating. Outside seating area with shades and heaters. Rarely very busy ... not sure why as this is a real gem."}
{"text":"Favorite! Great food and staff! They are always friendly and make you feel welcome. Highly recommend it :)"}
{"text":"One star for extremely slow kitchen service. 40 minute wait for soup and salad....really? Wasn't a busy night at all. Three tables.  Four stars for taste of food although my wife ended up with Diarrhea afterwards. If it weren't for the extremely slow service, we'd come back. I've eating here three times and it has always been slow.  I think they have the absolute best chili around with big chunks of sirloin in it. The salads are tasty too. Go if you don't mind waiting."}
{"text":"Poor introduction for my first time here.  Went in to have lunch but left instead.  The restaurant and bar were both very slow. Sat down expecting a server to approach our table....so we waited and waited. When we got up to leave the server then decided she was done gambling at the bar and it was time to get back to work. When she approached us she was surprised we were leaving.   For the prices they charge (i.e. 2 eggs with pancakes for 10.99) I would expect much better service. Don't recommend."}
{"text":"Ate pizza at the bar late last night and I have to say it was delicious!  We were given our choice of thick or thin.  The crust was chewy and the cheese was plentiful and delicious.  We devored the whole pizza in minutes.  The ingredients were fresh and nothing tasted frozen.  We be ordering the pizza often"}
{"text":"Love the atmosphere ! The food was fresh and really good. Server was pleasant and timely . I will definitely come back."}
{"text":"Really had a great time here.  The bartender was super cool, great selections of beers, it did feel a tad bit smokey inside, but I could live with it, knowing its NV.  Had a great time there and looking forward to the next!"}
{"text":"Usually hit up this place on the way back from the lake. It's pretty decent but I think the prices are a bit high. $15 for a burger & fries? Love their sweet potato fries. Service has always been good as we usually are only 1 of 2 tables in the joint."}
{"text":"Beautiful restaurant with a great view.  Foods is good, not great, but its a diner kinda food.  Come here a lot, but hate it when we walk in and no one wants to wait on you, and there is an older blonde waitress thats almost always there and she is always always rude, so much so, we have looked to see if she is there and leave, lol!"}
{"text":"Found MountainSide on Yelp.  Service was awesome and hats off to the chef who prepared one of the best breakfast burritos we have ever eaten!  So big we should have ordered only one as we ended up taking half of each burrito with us!  Amazing!  Coffee was delicious!  We will be back. Yum!"}
{"text":"This establishment is very close to my residence so for the past 7 years, I have made it my regular place for business and social dining. The view is the same view that inspired the purchase of my home and I certainly enjoy that. Therefore, I am quite at home in this restaurant for the location, the ambiance and view. The rustic elegance features an impressive fireplace which is a pleasure in the colder months to enjoy cocktails. The sports bar is enclosed by a glass wall that ensures a smoke-free dining experience in the restaurant. The menu has plenty of variety, prices reasonable, staff is always friendly and courteous and they are open until 11PM. Apparently the Mountainside has been doing things right because it is the only restaurant in this area that has survived over the years."}
{"text":"Come in the early evening and order a beer. Stare off and be zen. Few bars have a view like this. It is quiet. Cool beers to choose from. Seating is comfortable. Cool appetizers, but they do not serve them late. Parking a perfect and the bathroom is lovely and accessible for when you break the seal. Too bad it is way out in Hendo. Be safe when you leave because it gets really dark out there. Also do not go when everyone is at the lake. The traffic can be awful."}
{"text":"We live in the hills behind this place. Great building, design, view, but- I never liked it, We went there because its isolated out here on the edge of town right in our neighborhood. I think I had something black floating in my drink every time we went here too, and had switched to bottled beers, gross. Service is the worst, machines are super tight, owner checks the machine holds right in front of customers and then plays the machines right in front of you. Manager who works at night is a total d-bag, there was a nice dayshift girl though. Beautiful view, and very lovely bar though."}
{"text":"If i could give this crappy place negative 500 stars I would.   Waitress gets our order wrong.   Asked her about it says we ordered it wrong.    Took her 20 min come back take our order to begin with in a not very busy place to start with.  Daughter who is 6 orders a kid plate of spagetthi.  Gets garlic bread w cayenne pepper on it.   Again tell waitress who doesnt care says her back is hurting and at this point I demand a manager.   Seriously cayenne pepper on kids garlic bread?   What if kids are allergic?   And then attitude from a waitress?    Manager comes happens to be leaving for the evening and we catch her out the door.   She adjusts the bill in full and apologizes for the inappropriate behavior and the badly chosen cayenne bread given for a small child.  As we are getting in our SUV im the lot the waitress is cleaning a table on the patio and she starts harrassing us in the lot.  Saying we have nothing better to do yelling screaming at us.   Trying to start like a fight.   All of this with a 7 and a 6 year old children and a 5 month old baby in tow.   While I see the manager pull away in her sports car.   Never ever will I go here.   Please do yourself and anyone a favor.   There are a million places to eat in Henderson and the Vegas area.   Dont waste your money here.  They dont care about what they serve children.   Or how they treat you.   Unless your dog poop."}
{"text":"This was our Superbowl choice since it was close to our new place that we just moved in to. The football game special was $1 beers and deals on food as well. Pretty quiet for Superbowl Sunday, but that is how I like bars anyways.  The regular food menu sounds really good, and I will be stopping in here for a full meal at some point. The staff was great and welcoming and even gave away free gifts.  Our second experience in here was just as good. Our tab had three beers, an order of fries and a martini and the bill was $12.  The interior is very nice, and has a completely separate bar area from the dining area which works well for games if you are trying to just have a quiet meal in the other room."}
{"text":"We visited this place a few months ago and the service was very slow, we were the only ones in the restaurant so it didn't make much sense to me.   Anyways, we decided to give it another shot for dinner hoping that would go over better. It did not. This is seriously the worst service we have ever received. We got in and were told to \"sit where ever\" since there were only two other tables. We ordered our drinks and they took a while but that was still okay. We ordered our dinners and both got steak with a salad. We ordered our food at 6:05 PM and didn't receive our salads until 6:45, and when I asked if we could have them out waitress said they were still \"working on them.\" The salads came and within two minutes our main course came. The only thing hot on my plate was my baked potato.. We finished eating and waited another 20 or so minuets for a bill, paid and left the money on the table because I didn't want to wait any longer for our change. They are severely understaffed and our waitress didn't seem like she knew how to handle any sort of \"rush\" (4 tables). We will not be returning ever again."}
{"text":"Nice enough people and decent decor but the food was sub-par to say the least. Salad was straight out of a bag. No tomatoes, no croutons, nothing. Chicken sandwich was pre-cooked and cold. Cold bun, although reasonably fresh. Fresh avocado was the highlight of the meal. I wouldn't say never come here, but definitely don't come for the food."}
{"text":"Hidden gem! Great location, ambiance and food. Prices are very reasonable. I was disappointed to find not very many guests there this Sunday afternoon. Folks must not realize what they are missing...but we will be back , perhaps to enjoy a view of the Strip at night :)"}
{"text":"Excellent and friendly service and best breakfast burrito and salsa ever. Humongous. Nice atmosphere too. Love this place."}
{"text":"We live near Mountain Side so were very excited to watch it being constructed.  There isn't much out on Lake Mead yet (a Little Carmines across the street, yech) and it saves us a drive in to Lake Las Vegas.  They have a bunch of good beers on tap and the food is interesting (above and beyond your standard bar food) and consistantly good (not outta this world wonderful, but solidly good).   They have a great patio that affords a view of the entire valley.  We sat out there on July 4th (the line into LLV was ridiculous) and could see every fireworks show in the valley.  Inside dining is nice and quiet and separated from the smoky bar by glass windows.  Great spot!!"}
{"text":"We just moved in down the street from Mountainside and every time we go to Sonic, we're like, \"We really need to try that place\". So glad we did tonight!   Walking in we immediately loved the ambiance. Kind of a modern cabin feel to it. Rusticly Modern we'll call it. Maybe I just coined a new style. The main room is cut in half by a large glass wall. The bar and some tables on one side and the dining room on the other. The bar side is smoking and the restaurant is non-smoking. There are a lot of TV's in the bar and a 70\" in the dining room over a large fireplace. The bar has a pretty large selection of brew on a tap, can't quite remember if any of them were local. They have Moscato and Riesling for the sweet wine drinkers. The dining room is super low lighting so bring your reading glasses if you need em'.   Our server was Luanna and she was great. Very personable and knew the menu well.  Food is a notch and a half above normal pub food. They do a great job of enhancing regular pub grub, without making it \"trendy\" or \"cliquey\". My wife had the American Burger sans cheese. She bit into it and said with mouthful of goodness, \"Oh. My. Gosh.\"  And then shoved it in my face to have a bite. I gotta tell ya, even with no cheese on it, in the words of Jules, it was a very \"tasty burger\" (for all you Pulp Fiction fans). It was damn good. Very well cooked and great flavor.   I had the Pepperstrami sandwich with the Cheesy Tater Tots. Oh. My. Gosh. I mean seriously, pepperoni and pastrami? On the same sandwich? Who the hell does that?! Mountainside does. And it's freaking awesome. It's on the spicy side which is fine with me, but if you have a sensitive pallet, your gonna want something to cool it down with it. I'd recommend a Sierra Nevada Pale Ale. And cheese, INSIDE the tots? What the hell is going on?! They were awesome.   Great prices! Dinner for two and four drinks, $55.   We are super stoked to have found this place and are really excited to come back. Good drinks, great food, great atmosphere, and a great experience.   Our only rub? It was SUPER hot in there. Not sure if the a/c wasn't working, but we totally had to hog the one fan they had going in there to keep from sweating. But the food was worth it!!  We'll be a back Moutainside. You just made regulars out of us!!"}
{"text":"Wow.....where do I begin...The one rating was for the lady wearing The Vegas Knight Jersey other than that...service? boy oh boy....a negative all the way..she did not look happy at all....very slow and this ONLY server had a RBF look from beginning to end. Food for the price??? Sonic will give you better service n better quality food. Unhappy"}
{"text":"Love this place!  Food is always great and the service top notch!"}
{"text":"We just ordered take-out because this restaurant is close to where we live. We ordered chicken tenders as well as chips and salsa. Three tenders came with the appetizer and the chips and salsa had barely any salsa as well as chips. The tenders are paper thin and cost 10 bucks and only come with 3 tenders! There were barely any chips and barely any salsa...yet these were 6 bucks! We will never eat here again as there are other places even closer in Lake Las Vegas that are actually a bargain and you get your moneys worth! Very disappointed!"}
{"text":"Mountainside is a solid sports bar with reasonable prices and good food. The wait staff is attentive and friendly. I ordered the Side Burger, which was excellent. Not an all-time best sports bar (that's why it receives four stars) but a solid spot where I plan to return."}
{"text":"Went and tried to eat here twice and it sucked both times. The second time I went they didn't have coffee. It was breakfast time and they dod not have coffee. Don't waste your time."}
{"text":"Food is always good. Service is always spotty. Tonight's lack of service brought to you by Kristina. She had 2 tables to serve and she spent her time with friends. When she did bother with us it was to fling plates of food onto our table without breaking stride before resuming socializing with her friends. The bartender finally came to ask how our meal was since Kristina had disappeared outside with a \"friend\". We didn't even know her name until she dropped the check on our table with a curt \"a have nice night\". Thankfully Kristina scribed her name with a heartfelt \"thank you\" on the bill. If the food was bad we wouldn't be back. We know we are always taking our chances with the service."}
{"text":"I come here with my parents from time to time. The menu is huge--everything from tilapia to taco salads to burgers and more. I appreciate having the variety so close by, and my dad appreciates being able to smoke while he watches a sports game and eats a meal.   I will say that the food is a touch on the pricey side for arriving off a truck and being heated up and assembled. Whatever though. It's alright to eat a $15 meal out of the freezer every now and again, huh?"}
{"text":"This restaurant is like a beautiful woman with no personality.   When I stepped in I was quite frankly shocked at how expensive the decor appeared. It reminded me of a high-end cabin in Aspen. Even the bathroom was ridiculously over abundant. There seems to be an irritated air about the decor that just rubbed me the wrong way. I would prefer something a little more cozy - a little less over the top.  Either way I had time to kill as my car was being washed next door so I was directed to a large booth \"party of one\" by the host/waitress. As I was eating for just myself and I wasn't starving I decided to order nachos and a side salad with ranch dressing. The salad was delicious. They did something \"Ingenious\" that most restaurants don't seem to think of...they actually cut up the red onions so that I didn't have to eat the whole ring at once. The dressing was great and I was excited to receive my nachos.   When the nachos came out I was stunned. Someone was trying really hard to be creative, and it didn't quite pay out. On my plate there were several chips piled high with cheese, onions, diced tomatos and a chunk of beef. I would have preferred to have the ability to put what I wanted and how much of what I wanted on a chip than to have someone do it for me. They were overloaded and it was hard to eat. On top of it there was one giant chunk of beef on each chip. What is that for? How am I supposed to eat that? The flavors were consistent but there was 1. Too much cheese 2. the diced tomatoes had no business being there 3. shred the beef don't just give me a giant chunk 4. allow one to serve the nachos the way they would like - because of the toppings not only was it hard to eat but the chip was soggy.   Overall I really don't think I'll be coming back. It was VERY overpriced. $3.00 for a raspberry iced tea that was ONE glass, $5 for a small plate of regular salad $10 for 7 soggy ill-prepared nachos. For one person my bill was over $20. There are way too many eateries in Henderson/Las Vegas that have better food for less price. My opinion - skip this one."}
{"text":"There never was all that much out this far East, and with some recent closures there is even less these days. MountainSide is a great option for us Hendertucky residents.   The ambiance here is fabulous. Awesome views of the city at sunset. Big tvs, separate bar areas and eating areas (both of which have good sized flat screens for game watching).   Service isn't the best ever but not horrible either. Some waitresses are a little quicker then others, but they have all been friendly and helpful the multiple times I have been there.   The food is pretty standard in my opinion. Decently sized, could be a little cheaper but won't break the bank either. Salads are nothing I'd write home about, burgers are pretty good. We got the the fried mac and cheese appetizer for the first time on our last visit and I was pleased.   Best part of the MountainSide for me is the beer selection. They have some great beers on tap here."}
{"text":"Excellent. It's a little hidden gem very close to Lake Las Vegas, and beside CVS and Sonic. Great food, daily soups, and indoor and outdoor fireplaces. Service is a little slow, but worth the wait."}
{"text":"My two visits have been to the bar area, but I also ordered food one of the times.   The most notable thing about this restaurant/bar is the effort they made to allow smoking in the bar area. There is a large, sealed off wall between the bar and the dining area. Holy smoke, literally. The wall means that there is a room with nowhere for the smoke to go. Be prepared to wash everything you wore in when you get home because it harbors the smoke like no other bar.   The bar has gaming like most Vegas bars if you are into that kind of thing. As with other gaming bars they'll comp basic drinks for gaming. Both times I came in the bartenders were friendly. It seems like this bar has a lot of regulars. I ordered a Sex on the Beach and found it to be perfectly prepared. The second visit I went with a beer on tap and no complaints with that either.   As far as food goes, one item I ordered was good and the other was barely edible. The Nachos were good. They were individual chips with chili topping and melted cheese over the top. On the side there was salsa and sour cream. The sliders were not good at all. The meat on the sliders was rubbery and off-putting. It just didn't seem like a food product and I didn't even finish one of the sliders in the order."}
{"text":"My husband and I drive by this place daily and today we decided to stop in for a late lunch.  First, the building is beautiful.  I love the warm feel and the complete separation from the bar.  Really nice!   We were the only ones in the dining room area but there were probably 10 people at the bar.   The waitress was sweet and attentive.  She recommended several dishes that seem to be favorites.   I chose, upon her suggestion the artichoke flatbread.  It was delicious.  My husband ordered the steak wrap w the cheesy tater tots.  He said it was ok....a little bland but would probably order it again.  The tater tots were good!   I ordered a soda and he had 2 draft beers.  Our bill was $42.00.   We will probably go back.....as it is super close to our house and a great atmosphere....however, I wish it was not quite so pricy!  $5 for a draft beer seems a little high.   This place has great potential and should be packed everyday!  Give it a try!"}
{"text":"I literally live Across the street in Tuscany.  If you are familiar with the area then you know there are no restaurants in sight.  I have only been to mountainside and times where I have been absolutely desperate One time I ordered cheesy grades and when the woman brought them I could not believe that the great we made with feta cheese Every time we have been in there the service is terrible everything is so overpriced I can't believe the nerve of this place.  I have to admit I am very shocked at this please didn't go out of business years ago"}
{"text":"Fantastic food. Great service. Wonderful deals. If you come here know that the experience will be exemplary!!!"}
{"text":"We frequent the car wash next store and have had good experiences stopping in for breakfast while we wait for our car. Today my son and I stopped by for a \"snack\" in the late afternoon. Granted, I should have said something at the moment and didn't, but what a horrible experience. For one thing- we were the only people in the restaurant and it took us a while to even figure out if they were open. We then ordered spinach/ artichoke dip and sliders to share. When I say the $15 sliders were not edible- I mean they were dripping with blood under cooked. It turned my stomach and I asked for the check right away so we could just get out. If you had any interest in customer service you might have noticed our haste or asked if we needed boxes, etc...! Not this waitress... Totally disinterested and oblivious. We left all, but a bite of the sliders and the majority of the cold $10 spinach artichoke dip. We learned a valuable lesson and will share- don't go to get the car washed while hungry! The overpriced bill and undercooked food did not make for a good Mom/Son date."}
{"text":"I have been coming to mountain side for over 7 years and never have I strayed from that they do their best to accommodate you food wise and service wise as well. Angie has been our waitress for over 4 years and we love her we have seen customers be mean to her for no apparent reason I mean it's not her fall if the credit machine is not working or if she's the only one working and there are 7 tables everybody and your reiews seriously need to give them a break. Also a great local haunt"}
{"text":"As many of the yelpers have noted, Mountain Side is usually not crowded.  I like this.  The servers are very friendly, but can be slow in the dining room.  The waitress assigned to the dining room at night usually has to work in the bar too, so that divides her attention.  I will see our most recent time eating there, neither one of our glasses was empty, so that's a good sign.  And, the bar was decently crowded.  The wings are large and the wing sauce is good as well.  They appear to make their own bleu cheese dressing, very good.  If you are a cheese fry person, try the filet chili cheese fries with the cheesy tots or \"barrels\" as they call them.  Excellent.  We eat here for breakfast too.  Huge breakfast burrito, very large portions.  I feel like you get more bang for your buck at breakfast, but the food is very good all day. My wife loves the biscuits and gravy, the gravy has a nice \"herbiness\" and the biscuits are nicely toasted without being burnt.  Overall, great neighborhood bar and place to get any meal.  Recommended."}
{"text":"I mean not the best place in the world, but I KNOW it's the best place for a hangover.  A couple of friends and I came to this place after our company Holiday Party the night before.  Talk about a MAJOR hangover!!  The place is big.  There's an area for dining and a bar area where you can smoke.  This place is out in the middle of nowhere which means it's never busy.  That Sunday was no different.  There's a lot of windows which offer lots of natural lighting.  Lastly, there's huge screen TVs in the dining and bar areas for the game.  For our hangover meal, I got the Breakfast Sandwich for only $5.99!  Steal.  Two eggs cooked your way, served with your choice of bacon, sausage or ham, piled onto your choice of Rye, Wheat, White, Sourdough, Texas Toast, or English Muffin. Served with a side of hash browns.  I chose the sausage and on wheat bread.  Lots of eggs piled in.  The sausage were links cut in half and fanned on the sandwich.  The hash browns were crispy and nicely cooked.  Since the meal was so cheap, I also got the short stack side for $2.99.  Two huge pancakes with whipped butter, warmed up syrup and an orange wedge.    This place is super close to me and really helps me get my fix on pub food.  I think the prices really work for my wallet and my stomach really thanked Mountain Side for the great hangover meal.  Go check them out if you're on the way to Lake Las Vegas!"}
{"text":"I love the staff here. They're always friendly and the food is really good. Its nice to grab a quick cocktail and relax before I head home. My husband and I really enjoy this establishment."}
{"text":"My husband and I have been here many times. Food is always excellent along with the service. I would recommend it highly."}
{"text":"This is the second time we've had dinner there and both times the food was decent, but the service was horrible. Only a few tables had other customers and it still took 20 minutes to order our food and another 40 to get the check once we were done. Our waitress never took the time to fill out glasses and was MIA for most of our dinner."}
{"text":"My wife and I have frequently stopped by across the last 16 months. Mostly during graveyard (post food), but also during happy hour and \"regular dinner hours.\"  We gamble socially, and have had more negative than positive experiences across our time at Mountainside. We've come back because the bartenders (Angie and Ryan - who is no longer there) make our experience enjoyable - and Kirk/Curt? was no different tonight. However, this last time was the end for us. Not only were the machines very tight, but my steak wrap was anything like I was used to. There is just no reason for us to return. (Side note - I was hoping to share a picture of my steak wrap, but I have yet to see an opportunity do so. If you see a wrap with a single piece of steak, please associate it with this review.)"}
{"text":"Excellent service, amazing chili, cold beer. We will definitely be back for their wood fired burgers and I have to try all of their house made soups!"}
{"text":"If I could put zero I would. I've been coming here since it opened and it has went down hill for sure. Drinks are half azs and service is just as bad. At least nights are terrible.  If you are looking for a place to play and get a drink I would recommend to look at other bars. The night shift bartender does not take care of the players but he does take care of his friends that hang out there. My drink taste fine but alittle warm for it being wine. I promise one thing as long as the bartender I had tonight is there we will not be going back. So many other choices in this town than a place that caters to bartenders friends and not people that can bring this place other paying customers!!"}
{"text":"Mountainside is probably one of the better gaming bars I've been to in all of Las Vegas/Henderson. It's rarely packed, and the crowd is usually not the super rowdy type (which I really appreciate). With that in mind, if you're into places with a younger crowd, this is NOT it. Perhaps it's the area, seeing as this is really the only bar near Lake Las Vegas that isn't at the Village.   The liquor selection is great; vodkas include multiple varieties of Chopin and Grey Goose, gins include Bombay Sapphire and Tanqueray 10. They used to have Nolets, but apparently that was a one time thing (which is too bad). Multiple craft beers are also offered, as are beers on tap. Surprisingly, all drinks are CHEAP. Although I am not certain of the beer prices, drinks are typically $5-6 each, which is amazing considering what most bars charge.   I cannot speak for the food, although there is a full menu offered. The dining room is separate from the bar so that you can have dinner without being exposed to the smoke from the bar. There never seems to be anyone dining in the dining room, so that may provide insight on the quality of the food.   Overall I really like Mountainside and would probably come more often if I drank on a regular basis. I would definitely recommend checking this place out of you're in the area. My only gripe is that it can get smokey when a lot of people are in the bar area, and service can be a bit mediocre depending on who is tending the bar (see my photo of the garnish I was given and never received replacement)."}
{"text":"Stopped in here for a few beers after playing golf at Reflection Bay (yes it's open) and they do have some quality bar food here. The Cheesy tater tots with the garlic ranch sauce is yummy. I had a cheese pizza, which is not the typical cardboard mini pizza, but a 10\" medium crust that's pretty good. Friends ordered burgers and a french dip, all were good according to them.   I used to eat here frequently when I worked out at Lake Las Vegas, and the food was good then, and still is. This is pretty much the only decent food spot out in this area. Its a nice bar area with gaming, glassed off from the dining room so smoking in the bar, and no smoking outside. There's also an outdoor patio area.  Take a ride to MountainSide. I will return for sure."}
{"text":"Today 7/2/2016 8:30 am time frame visited with very few customers and the staff was untrained and did not know the process of drink refills, food/drink delivery process/timelines, just remembering what we ordered was a challenge, taking the orders was very confused I'm not sure if she was hungover sick or what but it was the worst experience ever the food was cold it was just horrible the entire experience not sure I'm going back after this one. Sad because it's conveniently located. My husband never complains about bad service or bad food ever ever ever and he verbally let her know how horrible it was it was just horrific disgusting. He ordered milk with his pancakes that were eaten cold before the milk ever came Our Guest that was with us ordered a muffin that was cold taking back and never brought back it was removed from the ticket, no refill of coffee for a $3 cup, my son and I showed up I ordered a Diet Coke that she couldn't remember and asked me twice what I had ordered to drink which never came I finally cancelled the order and my son and I walked across the street to Sonic and eat there.  They didn't even offer a discount after he complains and he was so upset still and it's now 5:32 this evening and requested me to do it Yelp complaining so there you go I know it's family owned you probably don't care sad because we are really good vocals and know a lot of people and it's not going fly with us and our referral to others"}
{"text":"Stop in every once in awhile to gamble and have a beer or two. Won't be coming back after last night. This place doesn't take care of those who are playing the machines like other bars will do. Gambled $40 plus on the keno machine non stop playing for over an hour still charged us for a beer and glass of wine. Every other time I've been in here gambling my beer is taken care of at the very least. Bartender seemed more concerned with gossiping and hanging out with his friends at the other end of the bar who weren't gambling at all and didn't look to me like they paid for a thing the whole time I was there. No thanks will go elsewhere."}
{"text":"Used to love this place.. every time i went in i was greeted by a great bartender (woman with a southern accent is amazing) but this time was different. Every time this particular bartender is working I've not had a good experience. Today the \"card of the day\" was jacks. Luckily i hit 4 jacks and this never happens.. but i was excited about it and i asked the bartender what happens when i hit jacks and she said nothing and took the card down... what is the point then? Yes i won a 4 of a kind (which isn't quite what i put in) but no incentives for the \"card of the day\" makes it so i dont even want to try for it.."}
{"text":"The food is decent but the servers are not personable and there is not rhyme or reason for a theme to the place. It's kind of a strange atmosphere.  It looks very clinical from the outside. I wish there was something to draw me to it more."}
