{"text":"Recomiendo este sitio, la comida es muy sabrosa y fresca,  La atencion al cliente es excelente aunque los precios no son accesibles"}
{"text":"A tiny hole in the wall. It's a little expensive for what you get, but the fish tacos are fresh and pretty tasty.  Pay with cash to avoid the debit charge."}
{"text":"Pros: Fast, very friendly staff.   Cons: A little bit expensive for the quality of food, no VISA and they charge for using debit.  Verdict: Would recommend."}
{"text":"It's a good day when I find a halal Mexican place.  The ladies mending this little shop are so sweet and the food was great. The place is very clean and the menu was very simple and easy to make a choice at a glance.  I wish they accepted credit cards though!"}
{"text":"I just had a Shawarma and I can't believe how good it was. I went in not really knowing what to order so I asked what was good. The lady asked a few of my preferences and made a suggestion which I went with. I was not disappointed!! I will be eating here regularly from now on. And its directly across the street from Sick Kids Hospital so super convenient."}
{"text":"I do feel quite bad writing this review because the lady who runs the place is awesome, but sadly her food isn't. I walked in on my way to Queens Park and decided to satisfy my burrito craving I had that day. Skipping the long lunch lines at Chipotle had me feeling like I was winning, but after tasting my food it was apparent they had the last laugh. I ordered the chicken burrito and while I would like to say something good about it, I can't think of anything. The burrito itself was cold and I believe they used Franks Red Hot as the hot sauce. While the same place does offer Shawarmas and other Middle Eastern dishes; those might be better. I would give the food a one star, but I'll give it a two for the great service."}
{"text":"I suppose it's my fault for ordering a shawarma plate at a \"burrito place\", but there were some reviews that seemed positive and I was looking for something quick and close by. A chicken shawarma plate and bottle of water came out to $15 for some very mediocre food. There was no spit in sight to roast the chicken fresh so it was the precut kind sent from their other location. At this point it was too late to back out of my order. The quantity was decent but I've had better for the price point. The salad was sad with a few leaves of cilantro representing the tabouli and the chicken itself was alright with some flavour and some unnecessarily fatty pieces. The rice was good with lentils in it but they heated it in the microwave. All in all, I wish I'd picked something else or walked a bit further down the street. Maybe their Mexican food is better but I'd avoid the shawarma."}
