{"text":"I've been to most of the Mr. Greek's and have very fond memories of the Danforth site (original / first store) which I went to recently and have nothing but good things to say about.

We went on a sunday @ 5 pm to the Mr. Greek's by the airport.  There are better places around but due to the convention; we expected long line ups at the other sites.

However, this franchisee/site by the restaurant was very disappointing today on all accounts.

Wait staff.  Our waiter was an older south asian man that bordered on surly and quite unapologetic.  Had to walk in to ask for bread 20 min. after the food arrived.  Didn't check in on us during the first 30 min. of the meal which we had to take outside as the inside of the place was completely smoke-filled today due to defective ventilation.  Had to ask to have knives brought out.  Not deliberately rude but if I could sum it up, it would be \"service with a frown.\"  

Food.  Ordered their chicken souvlaki.   Microwaved/reheated.  The centre was still cold!  The rice and salad sides were fine though.  Maybe they didn't want to grill things due to the ventilation problem.

I hope I don't get food poisoning from inadequately cooked/reheated food.


I have 24 years of experience with dining at Mr. Greek's.  Right from when the danforth site was their only one.  Fond memories of the first date with my wife, grade school friend's birthday dinners there, etc...  IF this was the type of food to be had at the time, I would never have gone back.

I think food competition has really been heating up and their expansion was really rapid in the 90's with some sites that just aren't that viable; especially with these super big restaurants; they may just be having financial difficulties.   The Mr. Greek's closer to me home in Richmond Hill make a great take-out but most of the time, the large dining area is almost completely empty.

I still heartily recommend the danforth site but their is such a large middle eastern/mediterranean community now with similar food choices; it will be hard to go back.

Having said that, I find most of the food chains by the airport to be just a half step below similar franchises elsewhere.  Unfortunately, service today was a full step (or two) behind even average expectations.

Really, I would give this place 1.5 stars.  It's not hazardously bad; but bordering on it.  For Toronto, you can expect better."}
{"text":"I loved this place. Food is great, portions are generous and the atmosphere is nice. Will definitely go again."}
{"text":"I've been to other Mr. Greek locations, so usually know what to expect. Ordered take-out from this location and unfortunately the food was beyond awful, barely edible.  

Ordered the gyro and chicken souvlaki meals.  The chicken was undercooked, and pink inside.  I ordered veggies as one of the sides, and at all other locations, I get grilled zucchini, carrots, onions, etc.  Not this location - just a handful of green beans, so tough and stringy, you could barely eat.  (and I usually love green beans, make them all the time at home)

At other locations, I consider the salad to be okay, nothing exciting, but I at least finish it.  But at this location, the salad was tasteless.  I'm pretty sure the dressing they gave me was just water.  

The sign might say Mr. Greek, but I promise you, they're not serving the same stuff as other locations.  Can get much better food at a mall food court."}
{"text":"Came here with a friend for dinner after some shopping and trampolining. Food took about 10 minutes to come. I got a soulvaki wrap and my friend got a salad with salmon.

She liked her salmon but was not impressed with the salad as it didnt look fresh and was loaded with lettuce as suppose the other good stuff.

The wrap was okay..it has a lot of taziki sauce which is the only thing that added to the flavor of the chicken.

Would recommend other restaurants in the area as suppose to this."}
{"text":"Good food but this location is a bit too \"express\"... the seating is super uncomfortable and the dishes were dirty. The food was good though so I would recommend take-out."}
{"text":"I have been to the Mr. Greek in Vaughan several times, but this was the first time I have been to this location.  The decor is a little (ok ... A lot) dated so I probably would not take someone here on a date or a business lunch, but it was just fine for takeout.

I got my usual - the gyro platter - which comes with LOTS of food.  I got the rice for my side.  It also comes with a salad, plenty of gyro meat, z sauce, and a pita.  There is enough for two meals, so I think I will ask for a second pita next time.

The takeout was well packaged and accurate with cold items separate from hot and they did not forget the napkins or plastic ware.  I would visit this location again for take out."}
{"text":"We ordered a family dinner from here for delivery tonight and overall it was a positive experience. Initially the girl on the phone was very abrupt and hard to hear, but by the end she was nicer to talk to. The total for 5 people was just over $100 which is pretty good for $20 per person but some of the portions were  pretty small. The Greek dip trio was quite small but the individual meals were very filling. My only concern is value, I've paid about half the price for the same amount of food in other places. Delivery took about an hour (which is exactly how long the girl on the phone said it would). The food was overall pretty good, nothing special and my gyro was a bit dry, but we did get lots of tzatziki which helped and was yummy either way. Like I said overall pretty good. But next time I might consider ordering from somewhere else for better service and better value."}
{"text":"This evening we had ordered delivery for 6 people.
Placing the order was the worse part. As the food was made fresh most of it tasted good (chicken skewers and salmon was very dry )and delivered in a reasonable time. 

The major issue here was that as a regular, whenever I place an order or am out (anywhere) I double check what's gluten free, or safe and when someone is unsure, they contact the kitchen, the manager or read the ingredients on something to be safe then sorry. I always make it clear I am not celiac, but I do react to direct contact. (That process alone is draining)
So today; when we called we placed our orders and once it came to my order I simply wanted a village salad and either chicken, salmon or shrimp on the side. As I recently learned the Rice and Potatoes are not gluten free, (and I appreciate being made aware of this on my last order) so since the family felt like Greek, I wanted to keep it simple... well it wasn't.
The man taking my order said there is something gluten free here! Nothing but the soup. I can't take the chance and so on... he seemed shook up and aggressive, i mentioned that we've ordered before and I should be fine- but to be sure has something changed in the ingredients? In the chicken salmon or shrimp!? Well first of all he says they do t serve or have shrimp (although it's on the menu) and with everything else, he claims he doesn't know how it's treated or what's it's contacted with at head office ..?? It certainly sounded that my business was not welcome and he did not want to deal with it... I remained calm and asked, can you please tell me what goes in the ingredients in the restaurant, he says- salt, pepper oil and oregano! 'Ok...' I said . ' what isn't gluten free about any of that?' .... he says 'I don't know' well- I told him , that I know, and that it would be fine, as long as the grill is clean, he says it's not- we grill bread and pita etc... and 'if this is a life threading allergy and I can't guarantee anything ... etc' (along those lines) I said, excuse me: no one said this is life threatening, it is an allergy none the less and I cannot have direct contact. If you clean the grill, and season as you say then everything will be perfectly fine.


In conclusion, this was a very unnecessary conversation, and the tone was definitely unappreciated, this man ended up Passing the phone to a young lady to go over the order to confirm all items, (as if he no longer had the patience to speak to me. Although I was the one offended and pushed away, and I simply had questions.
Typically when someone is not sure, they speak to a manager ( which I think that's who he was) or contact the kitchen... I just don't understand how restaurants are still so untrained today. The staff had no clue, people still think rice has gluten! Kitchen staff dont clean prepping areas or are too lazy... business' need to understand How a simple change can bring in so much more business and keep clients happy! 
It was an uncomfortable experience and it stuck... of course whenever we will feel like feel like Greek  we can simply go across the street to Astoria- where this is never a problem and they understand a simple fix can provide a lot of positive changes for the business.  

And the funny thing is; the food was very good great improvements from before! (except the salmon I ordered was very dry and over cooked- no one asked how I'd like it cooked...)
The portions were great. And it even arrived in good time. So if only the staff had a little better understanding and customer service skills they could have easily earned 5 stars today! - seeing as how this location is struggling with the ratings it could have been a good start.
But...Better luck next time. I hope ?"}
{"text":"Looking to have dinner while waiting for a friend's appointed time to meet, I came here knowing around this time a place like Mr. Greek EXPRESS will not be fully booked.

I was right as I walked in trying to determine my meal from the menu board while the cashier waits.  It's Mr. Greek Express did I mention that?  

Menu is typical of the food court Greek establishments but priced SLIGHTLY higher which is what FREAK me out the FIRST time I came(and TURN 180), and apparently this time it also made an Asian couple turn around after discuss quietly in front of the cashier.

Gyros, Souvlakis, etc.... and because it's EXPRESS, you'll have to forego the pleasure of OPA! this time around but I came in for a CHILL meal to waste some time and it did the job unlike during Lunch time when it does have a few more patrons.

I took a seat at one of the MANY 2-Seater Booths which isn't really made for comfort.  There's GREEK music and a couple photos and torchiere lamps that make it feel like you are in a cheesy Greek place.

The cook called me up as I took my $9+ plate of Original Chicken Souvlaki(2 Skewers).  It looked like a bit of food as I DUG into what looked like Tomato Sauce Rice but it wasn't...

I know that Red Sauce somewhere then I remembered my University days living out of Campus.  It was Campbell's ALPHABET Soup base, so much memories.  I was WEIRD to taste this flavour on the rice but I also reminded me of my past and to think outside of the box sometimes.

The typical Greek Salad filled half the plate while I eat 2 pieces of what SEEMED to be Pita's of some sort.  The Tzatziki tasted more like a Mayo than a Yogurt-base.  

The Chicken was actually the highlight as it was nicely MARINATED and had Grilled Flavours.  It wasn't DRY like I would expect at a Fast Food place.  I almost had TROUBLE finishing the plate until I realized I tighten my belt 1 notch extra this morning, STUPID ME!

Let's just say I had MIXED feelings about this place at the moment.  I still like this place more than the other EXPRESS I had near Warden/Eglinton."}
{"text":"Eat here all the time while in Toronto. Great lunch spot.  Their gyros are awesome.  Fed give it a try if you are in the area"}
{"text":"WTF. The quality of food in this place has gone to the $hits, worse than the famed Mexican ones. I came here many years ago when it first opened and it was pretty good for a chain. But years later,  you just gotta shake your head and say why?

Rice was overcooked and tasted like it's been sitting there for hours. The roasted veggies were taken out the fridge and they were charred to make them look like they were probably grilled - they were a quarter cooked and you can taste the gas. Chicken was over done and drier than sand paper. Terrible terrible terrible. 

I won't come back anymore. I'll stick to finding the small mom and pop shops and fork out the extra cash for better quality food. These chains need to just be gone already."}
{"text":"Food is standard Mr Greek.   Service is terrible.   People behind the counter need to realize that they are serving humans and not dogs.   I will never return."}
{"text":"Food is ok. 

If you get take-out make sure to check it before you go, they don't follow instructions very well, particularly if you ask  for something complicated, like no cheese."}
{"text":"Yeah i may have made an unfortunate choice.  But i got the tomato soup and the greek salad (no cucumber).  The good news : they got the salad right and there was no cucumber.  Also i ordered from the Marriott next door and it was fast, and very handy hence the 2 stars (and it was almost 10 pm and they still delivered, so thanks !).  
As for the food.  I ate 2 spoonful of the soup and put the remainder in the trash.  Yeah, it was that good. The salad was ok.  The bread was beurk, i threw it away too, and i love bread...
So if you have to, yeah go for it, make better choices than mine."}
{"text":"Came in to this place very half-heartedly. I wish I took a picture though, because I felt like I was walking into an eatery from Miami in the 80's. Walls were orange and blue, and the floor was full of mosaic tiles. I dug the outdatedness of it all.

Anyway, we sat down and were welcomed by an older waiter who was kind of clueless but friendly. I ordered the spanakopita and salad, while my friend got the chicken souvlaki. Mmmmmmeh. The salad was soggy, and the spanakopita didn't seem fresh. My friend's souvlaki was pretty good, though. Overall, nothing special. Head to the opposite end of town for some good Greek eats!"}
{"text":"I ordered a couple wraps from here recently. The gyro wrap is pictured below. 

It wasn't good, at all. As you can probably tell from the picture, the gyro was dry and leather-y. As a whole, the wrap lacked any real flavour - the tzatziki was bland and the meat was overdone."}
{"text":"FYI - for unsuspecting vegetarians...

The rice in the \"vegetable souvlaki\" contains chicken stock, well in fact all their rice does.. ..meh...evil!! Don't eat the rice!! They really should advertise this more as a lot of people might not know to ask."}
{"text":"Considering the slim pickin's for really good food around the airport, Mr Greek actually presents a pretty decent option. I've been here several times - both dine in and take out and have been pleasantly surprised each and every time. But that's most likely because I've never expected that much. 

On my last visit though, I was particularly hungry (as you'll see by what my friend and I ordered for just the two of us) and especially surprised by how good the food was. It was dinner time and the restaurant was pretty busy, but the service from our dedicated server was just delightful. 

What we tried and loved: light  crispy fried kalamari (with an emphasis on light), warm grilled pita served with a healthy mound each of hummous and taramosalata, perfectly pink in the centre and oozing with juice lamb souvlaki, and the swirliest spanakopita (which interestingly resembled a Shanghainese green onion pancake) I've ever been served . All Greek, all good.

The one thing that really didn't do it for me though, was funnily, the arguable Greek resto staple Greek salad. Laid out over a bed of greens, there were an unimpressively few kalamata, tomatoes, and cukes. 

I'm not saying drive your butt all the way out there right now, but if you happen to be in town and are easily impressed by bartenders who are fluent in multiple languages (No offense to anyone, but these folks were from America), come on down!"}
{"text":"This Mr Greek is obviously under new management and unfortunately, the only thing Greek left is the name. My first disappointment was the *lime* daiquiri with no lime in it, very bitter and sour and heavy with alcohol. I asked them to remake it with lime in the mix and though it had more lime in it, it was still bitter, sour and unflavourful. It cost $6.50 and was so NOT worth it. Next was the lamb chop dinner that was supposed to come with Greek roast potatoes and sauteed vegetables. The meals on the menu don't even come with Greek rice with the Greek roast potatoes anymore. The roast potatoes didn't taste Greek style at all and the vegetables were a huge heap of tasteless broccoli and carrots--how NOT Mediterranean. I asked for a diet coke with a slice of lime and the waiter delivered it with no ice. It took me 3 times to make the guy understand I said lime, not no ice, and to bring it back again. Waitress came by part way through our meal, not to ask how everything was or how the food was, but whether we wanted any more DRINKS, and she made it clear she wasn't asking about SOFT drinks, but the overpriced alcoholic kind. I guess people come to this airport area restaurant just to get drunk, not to eat. They didn't offer to refill our bread basket ever, which real Greek restaurants always do. End of the meal, I wanted to pay by debit and this must be the last restaurant in the city that doesn't have a portable debit machine and makes you come to the bar to pay. And guess what, the bar's ATM wasn't working and they had to send me to the OTHER bar to pay. My mood was not improved by the fact that the cashier after inputting the ATM, said, \"How are you doing, DARLING?\"  I was appalled at this remark and hoped it was directed at the middle aged woman standing next to me.  Talk about unprofessional familiarity! Needless to say, I will NOT be back to this Mr. Greek location. It's a shame because I love real Greek restaurants. This one isn't anymore and they are no longer a good restaurant, period."}
{"text":"Not even worthy of a one star...I ordered a chicken souvlaki for delivery however the person delivering it went to the wrong address and I had to wait. To make things worse, for a $17.95 plus tax meal I didn't even get a drink. It came with garlic bread on the side as well as ceasar salad and overall the ceasar salad tasted better than everything else. The garlic bread is literally a stick bread cut in the middle with garlic sauce spread inside and not even toasted. The chicken was dry and the rice wasn't that good either. Didn't even finish half of it before throwing it out. I normally don't write reviews but the food was just so bad for the money ):"}
{"text":"I LOVE Greek food.  I don't like salads, but I'll definitely make an exception for Greek salad.
However, I was a bit disappointed by this restaurant.  First of all, I didn't understand why the restaurant was called \"express\".  It took around 15 mins for us to get the food.  
It would take around the same amount of time at the regular restaurant and we would get bread while we wait.  We didn't get anything during the wait.  
We ordered:  Original Chicken Souvlaki.  (I recommend going with the potatoes)"}
{"text":"This place it up and down. Been coming here for years with family and work colleagues.  Generally a food experience, good moussaka and lamb and taramousalata ..but sometimes the service is spotty and very slow.  Everytime we come back we are hopeful"}
{"text":"We were hungry and driving by, so just decided to park in and eat something.

Mr Greek resulted to be a fairly typical \"hotel-embedded\" restaurant - with laminated plastic menus, absentminded kitchen and service folks wandering around, mostly empty, with food court look and feel.

Portions were fairly big, though - and not expensive. Our server was polite and only a tad bit intrusive - but nothing really horrible about that. Just too many questions regarding our roots and destination in life...

If you've ever been to something like Opa Souvlaki or similar chain, you'll have an idea about Mr Greek's food quality - exactly the same stuff, except for a dollar or two more, and a bit more abundant.

I won't suggest dreaming about your first visit there, but being in the area and hungry, looks like an ok place to eat at."}
