{"text":"I went there last week to try out their buffet lunch. I sampled most of the food and they are good at this price: (14.95 or something around that) but they are not exceptional. The Courtyard (downtown) offers better food.  However, I will likely come back for my cabbage roll fix, cos it's probably the only Hunguarian restaurant in Markham."}
{"text":"Mr Hungarian has been around for many years on Markham Main Street.  It's a tiny little restaurant that looks like one of those places that has a little niche market of patrons.  I like those places. They usually are the most authentic places.    I went to Mr Hungarian as part of a wedding. They were having the rehearsal dinner here.  The inside of the restaurant is small and a little on the dark side. To the right, there's a medium size room that for our purposes they turned into a mini banquet room.    The food was served buffet style. There were two long tables, one for main courses and one for desserts.  They also had a full service open bar there, which many people took advantage of.  The food overall was ok. There were mainly meat dishes there, which I presumed there would be, so I was prepared.  I can't say my experience with Mr Hungarian made me fall in love with Hungarian food, but it was a crash course introduction.  I have since tried more Hungarian food, with a much more positive outcome!"}
{"text":"Went there this morning, for their Brunch. It is a pleasant restaurant in \"Old Markham\", which is clean and bright (sunny day). It features the ubiquitous red tables clothes, and a slightly dated decor. It will not win any 'snotty reviewer's prizes' for the decor.  It is well run, and well organized. It is a family business and it shows in the execution. The staff is attentive and prompt, and they are extremely attentive the replenishing the buffet which is their Sunday Brunch Feature (11:30 to 3:00).  I tasted most of the key items on the buffet and all of them were good. Judy, who is from that central European cooking tradition, found the offerings tasty and authentic. This is a great compliment on a buffet that featured Schnitzel, which was always tasty. Their Goulash Soup was outstanding, and their Cabbage Rolls amazing.  The brunch is a good way to be introduced to this cuisine and I heartily recommend. It made my tummy very happy. We will certainly return!"}
{"text":"The owner of Mr. Hungarian is a liar and a cheat. I was at the restaurant next door one night, I came out and someone had hit my car. I have an independent third party witness that saw him hit my car. He lied and denied everything. Do not patronize this establishment. Food isn't good either."}
