{"text":"Are you in a pinch and need your Greek food fix on the run?  Well Mr. Souvlaki is the place to go if you're downtown Toronto.  The food here is made with care and you can't beat the price.  The portions are enormous and one order is definitely enough for your lunch and dinner (maybe even breakfast too).  The staff are also super friendly and always serve you with a big smile on their face and are ready and willing to make your order just right.  Cheap food, huge portions, nice staff, what else can you ask for right?  When I am in Toronto I always make sure to stop by here for a quick bite.  This is definitely the spot for Greek food in the downtown area!"}
{"text":"This place is standard fare in the way of Greek options. The food is nothing extraordinary.  What makes this little place earn a 4th star in my opinion is the owner. He's hilarious, kind and knows almost everyone in the food court lol.   The people who work here are also very kind. If you engage these guys in conversation, you will walk away with a smile :)"}
{"text":"At first... i saw non-greek people cooking and serving and make me skeptical on how authentic the place will be. And boy was i wrong. This place has the best greek food in downtown Toronto. Yes, i have tried Zorba, Jimmy, Penelope etc (i have worked in downtown Toronto for over 10 years and have tried every place, yes every place) and this place serves the yummiest meal for the best price. Service is good which makes it even better. Why not 5-star you ask.... the food court has limited seating. Love this place."}
{"text":"Excellent Greek food in the food court of the Sheraton Centre hotel.  The food was freshly made to order, the staff friendly and helpful, and the results above expectations for food court dining.  Highly recommend the spicy chicken plate.  The seasoning was just right, and the grilled chicken skewers were moist and tender.  Skip the potatoes and/or rice and get extra Greek salad instead."}
{"text":"Huge portions, cheap prices. Mr. Souvlaki at this food court is way better than Jimmy the Greek. Adding on extra protein or rice doesn't cost that much either. The owners are Filipino (I think) but they've got that Greek flavour down. Fast and efficient service every time and they're really friendly too."}
