{"text":"Came in once for prime rib, sat down, ordered, only to find out 20 minutes later that they were out of prime rib.   That should have been a sign, but my husband and I decided to give it another chance.   We sat the bar for dinner. It was obviously a busy night because it took around 10 minutes to get our drink order. We understood it wasn't the bartenders' fault. They had to wait tables as well as the bar top.   We finally got our prime rib and it wasn't anything to get excited out. Tasted very similar to prime rib that you would get at a buffet.   Would not come back for the food. But would return for cocktails. This place offers a nice happy hour atmosphere."}
{"text":"As a group of Drag Racers we go to the MRKT every time we race in Vegas . This place is off the hook delicious!  Awesome Steak and Seafood cooked to perfection and if you like Baked Potato  OMG you have to try one here . I've never seen a larger more delicious potato.. Good service and yes it's a little pricey but it is so worth it . I tell everyone at the track who always looks for a good meal in Vegas after a long day at the track they have to try this place . We will be back in October and November and looking forward to another great meal."}
{"text":"This place has slowly gone downhill and tonight's dinner was it for me.  My scallops were not fresh, they had a fishy odor and taste to them and also they were extremely salty.  I'm sensitive to this now since I have high blood pressure.  My husband had a chicken entree and it was salty too!  Was the cook in a mood tonight with the salt?  We most likely wont be back.  We had found this to be a convenient place to eat when we come into town to see shows/concerts in the Access showroom."}
{"text":"My friend and I are cheap. We went here because we had a bogo offer. This was during my sole sober moment of this trip to Vegas.  We asked the (super nice!) waitress what to order since at that point, I was tired from having driven from Vegas to I think somewhere in South Canada and didn't feel like reading the menu. She got my a shrimp cocktail that she said was the greatest thing on the menu (it was not. Nor was it well cleaned.) and a really bland swordfish with some surprisingly awesome corn... thing. My dining buddy had a steak that he said was better than ok. I didn't quiz him on if he remembered it 20 minutes later, though. Service is awesome, station casinos are pretty nice if you're in the area, food was ok. probably worth it for bogo entrees."}
{"text":"Had a really good Filet Mignon, tasty mashed potatoes, great service.   Our party enjoyed themselves."}
{"text":"I drive by Aliante Station everyday  and the billboard sporting a juicy bone in piece of steak advertising this joint had been torturing me for months.  So, I finally gave in and made a reservation for fear of crashing into the car in front of me every time I drive by.  I always like to order my favorite cut (filet mignon - cooked medium) at every steakhouse I visit for the first time so I can always do a fair comparison.  I have to say I wasn't impressed; the steak was...decent.  The service was boring and the place felt empty and lifeless (it was dinner time both times I went, the second time I ordered the rib eye and it was decent as well).  While the actual \"land\" portions I had were forgettable the MASHED POTATOES were quite memorable.  They were probably some of the best I've had in a long time.  I contemplate every now and again if I should call in and see if they'll do a to-go order of mashed potatoes :)    The decor was your typical modern motif but nice none the less.  FYI, I hate when you go to restaurants that are all done up sometimes (looking super expensive with all these cool chairs and dark woods and funky art sculptures) because you almost always expect the food to be just as dressy (haha) and delicious.  In this case, MRKT was definitely \"more looks than brains\" (minus the mash).  I know we were taught to never judge a book by it's cover, but when restaurants try to put up a high class/quality front..well then, they better deliver.  I know it's a double standard for the \"hole in the walls\" we all love but hey, who said life was fair?   So in a nutshell, if you go during happy hour or for their current special of the moment (sometimes they have 2-for-1 entrees) then it's worth a fork and maybe a knife too.  But, I would never pay full price."}
{"text":"Our server, Ricky, was STELLAR!!!  Chef Carlos and Mike, the manager, came to our table to ensure that we were having an amazing experience.   I was a little worried about the heat, but the misters kept us more than comfortable.  Do yourself a huge favor and try this place!!"}
{"text":"I love this place! I hate that they got rid of the butternut squash side dish. That's the only reason I couldn't give them 5 stars. The atmosphere is nice, the prices are great, and the service is excellent!"}
{"text":"3 stars. maybe 2 stars... I'll let you decide.   I kept MRKT bookmarked for awhile now based on Yelp reveiws. My husband and i decided to have dinner tonight for Valentines Day early.   So glad i made reservations cuz the restraunt was empty. Once we were seated, a younger greaser looking busser took our drink order which was just bottled water. (After laying out all day we were dehydrated.) then our server came to our table, asked us how we were and filled our glasses with water from a pitcher. As soon as he walked away, the busser returns with bottled water and my husband made a joke about the pitcher water. The busser said the server was terrible, doesnt ask or pay attention and that he suprised he has a job. My face said 'haha ill jus brush that off' while my mind said 'holy shit - unprofessional'.   We ordered the crab cakes to share, 2 - 7oz filet mignons, green beans and Mac & cheese. The food overall is really good!! Everything tasted fantastic. The only thing... We didnt order gnats and we got 2. 2 gnats flying around our table, 1 was tragically smooshed at the hands (or thumb) of my husband.   I guess i would eat here again. I mean, even though the service was low quality and the bugs... The food sang a greater tune.   Next time, i wont spend so much time dressing up (But it was our Valentines dinner so i did) - the lady at the table next to us wore jeans and a flannel. But now i know where to get a good steak dinner in jeans, chucks and Nirvana t-shirt."}
{"text":"We dined here for a romantic weekend, it was great. Romantic setting. We had a large booth close to the fire place. Spent about $260 with drinks, it was a little pricey for what we typically do spend on dinners but was well worth it. We went beginning of the year so I cannot exactly remember what we had but I remember being very happy with everything."}
{"text":"Been here four times in past few months!! Service is great, food is great!!! Skip the Charcoal room at Santa Fe ! the Market is 100 times better for both food and service! Scallops, salads, steak, fried chicken delicious.  I have not had dessert yet!!!"}
{"text":"Nice seafood, this hotel has some decent values for dining.  Little ways off the strip but worth it."}
{"text":"We had an awesome experience at MRKT.  Very minimal waiting time, less than 5 minutes. The environment was peaceful and relaxing. Our server Robert was great he was very attentive and made recommendations which me and my husband loved. We ordered a New York steak with asparagus and lobster mac and cheese, it was AMAZING! There garlic cilantro sauce is a must. The time to receive your food is about 20 minutes which is not bad at all. The high quality of the food made the price reasonable. Overall our experience was great. Everyone has to try it at lease one."}
{"text":"Nice decor. Modern with retro colors. The service was mediocre. Half off wines on certain days was a  great deal. Don't order the all you can eat crab legs. Mostly scraps and it's like having a fight with a rose bush. Bring your garden gloves if you are determine to get the crab legs. Too many sharp points on the crab legs. Over it was good if you don't have to drive too far get to it like we did to check it out."}
{"text":"Great rib eye steak. Had the loaded mashed potatoes and mushroom sides. They were good too"}
{"text":"Waited 20 minutes with a reservation even though half the tables were empty. Fiancé ordered a Moscow mule (which they were out of?) then ordered an Manhattan with no tonic water. Manhattan came out with half the cup full of water, sent it back to then be told they cannot and will not make it without water but still going to charge us for the drink that he sent back. Then had to wait an HOUR for a glass of milk, really?! The food was flavorless with no seasoning and the waiter was no where to be found the whole night. For four people it took 3+ hours and around $250...crazy. Would never go back!"}
{"text":"Food is awesome. If you like pretzel bread, they have it in their bread basket. Also got lobster ceviche (id skip it but wanted to try it). French onion soup, filet and lobster. My wife got shrimp scampi. It wasnt cheap but I thought it was well worth it. It was pretty empty, im just not sure that area and casino are busy enough. The bar area had a decent crowd. I made reservations on yelp and was perfect."}
{"text":"Has Potential - Menu pricing caters to local Gamblers with Comps or Coupons. Otherwise over $ 50.00 per person without alcohol.  Everything A La Carte plus additional for Salad.   Nice atmosphere - however comparable to numerous other restaurants in the same price range.   Ordered - Chopped Salad  Blackened Mahi-Mahi  Blackened Swordfish (not on Menu ; however no problem to order)  Au-Gratin Potatoes  Button Mushrooms  Bread (Raisin, Pretzel and Sourdough) was served   The service was simple, professional and unfussy  The Bread was Excellent  The Potatoes and Mushrooms were perfect  The Blackened Seafood is heavy spices with no actual Blackened Cooking. ( Blackened Seafood should be cooked in a white-hot cast-iron skillet with Blackshirt and Red Peppers coating the fish and flash cooked with butter )."}
{"text":"My friend and I had dinner at The Market after a movie.  We both had the petite filet medium rare with a side  of asparagus and a very nice Malbec afterwards strawberry short cake.  Mo, our waiter, was the best!  I would most definitely rate this an establishment to frequent."}
{"text":"For locals looking for a great meal that is not overpriced.  Stop looking.  This is the place.    The calamari is wonderful.  The crab cakes are adequate. ( I am from Maryland so nothing compares to Maryland crab cakes) but the grand prize goes to the Rib Eye steak.  It's massive and delicious. The sauce that is served with it is yummy.  Finish your meal with the cheese cake.  Go hone stuffed and feeling like you got your money's worth.  All in all a great experience.  Enjoy."}
{"text":"I was craving for some good steak and so I had my husband go to this place as we only lived a few miles away from it. I will probably not come back. For 1 steak and a side item, my husband ended up paying $65 with tip. I don't mind spending that amount on food if the food was outstanding; however, the food lacked in flavors. I really wanted to like the place but it was just too expensive of a restaurant and the food just wasnt great."}
{"text":"We wanted steak and didn't want to leave the hotel, so we had dinner here. There was a singer in the bar that sounded good. But he quit at 9 and we arrived at 8:55 so not much to hear. The hostest  Sat US Quickly  AND We Checked Out The  menu. We had the calimary it was a large  portion, a little greasy  but good and then our entries  arrived. My wife had prime rib and said it was good but two large of a portion  for her. Her baked potatoe was very big it was a la cart. I had the tuna seared it was huge and unseasoned. The staff was very nice but untrained for a 40.00 a plate restaurant.  For the money I'd rather dine elseware."}
{"text":"My wife and I stayed at Aliante for the 2nd time on June 2nd, 2016. I didnt like it the first time as there were a few problems of cleanliness. My wife convinced me to return. We decided to eat at the MRKT restaurant. Big Mistake. My steak was way undercooked and the quality of the food was mediocre. And... I believe strongly that I ended up catching Giardia from the restaurant (its an intestinal parasite). I would strongly recommend you avoid Aliante and MRKT ! And, yes, I did file a report with the Health Dept. That was my last stay at Aliante."}
{"text":"I love this place the food is always good, nice atmosphere and great entertainment. My husband and I went last night I had the prime rib, my husband had the filet and lobster, we shared the mac-n-cheese and the house chopped salad and once again the meal was spot on, worth every penny. The staff is great especially the hostess Chanel she is professional and friendly. Our waiter Will was also great, he new the menu, was friendly and efficient."}
{"text":"I love this place.  Its very elegant without making you feel the need to get really dressed up.  The steak is so good and their sauce they give you with the steak---AMAZING!!! I normally get the bone in ribeye with a Cesar salad and a baked potato.  Stella is normally my beer of choice.  They also do a happy hour which is good too.  Sit at the bar and hang out or get a table.... either way the food will leave you satisfied."}
{"text":"For the price it's an above average steak house! Food is good I normally get the bone in rib eye. Either way make sure you get the rib eye sauce for whatever steak you get! Ask for will or moe great service"}
{"text":"Had a 6:00 pm reservation and let them know that I was attending an 8:00 pm concert in the hotel. Service was terrible. We didn't receive our salads and soups until 6:55 and our entrees didn't come until 7:35. The steaks came rare which is not  what was ordered and the shrimp was way overcooked. This place is way too expensive for such crappy service and food."}
{"text":"Went to Mrkt Tuesday night, late around 10. Dinner area was already closed and I didn't have reservations. The bartender (who was closing) still let me and my gf sit at the bar and order dinner. She was so helpful! I had the 16oz prime rib and she had the filet steak and lobster tail. Both were cooked to perfection and so tender. The drinks were great and the bartender (Emily) was extremely nice and helpful. The only thing that could of made this better was sitting in the dinning area. Next time I'll be on time!"}
{"text":"I really enjoy my experience at MRKT , so much that I kept coming here . I liked the big portions.  I have lemon pepper chicken a few times , they gave me almost a whole chicken.  I liked the atmosphere and live musician. Shout out to Will ,the best waiter I ever had.  One issue is long wait time,but the staff makes up for it with a free appetizer."}
{"text":"Ok. I ate here on a whim. I sat at the bar and had a glass of house merlot which was not bad. There was live entertainment. The gentleman was quite good with a guitar and piano. Why not ask him to play some Jason Mraz? My bartender was Abigail, she was hot and reluctantly quiet. I browsed through the menu and I ordered a bone in ribeye ($31), medium rare of course. The steak looked really good when I first saw it. The char marks were petfect. I took a bite and it was seasoned well. It was a little chewy, I was not sure if this was USDA prime meat. I did not ask but I'm certain that it was not. It did not have the consistency of prime. I am a steak eater and it just did not seem prime. Don't get me wrong this place is nice but for $15 more you can go to Ruth's.Chris and have a sure bet spectacular steak. Three and a half stars. Just because of price to service/food quality ratio."}
{"text":"Friday date night. My boyfriend and I decide to try MRKT. Initially we were pleased with the hostess and atmosphere. They had piano player which was also nice. Our service was good & attentive. Food was ok, nothing to rave about. I ordered a pomegranate martini (delicious) until I saw the bug in it. They made me another right away, but offered me a slice of cheesecake as apology. The unpleasant part of the evening came when we got the bill. The charged us $3 extra \"bump\" for every martini I had and $2 extra \"bump\" for his Jack. This was an extra $15 on the bill. When we asked what it was for they said ice in the drinks. Because of the ice they have to pour extra alcohol.  I've never had to pay for ice and there isn't any extra alcohol. So our $10 cocktails were actually $12 & $13. I found this to be distasteful and sneaky. That was our first, last, and only time there."}
{"text":"I liked this place.  It was filled so I sat at the bar for dinner.  I noticed immediately how friendly everyone was.  The atmosphere was great. The servers were attentive. It seemed everybody knew everybody--it was like a local \"cheers\" hangout with really good food.  Maybe I hit it on a good night, but it was festive and fun.  I had the whitefish, which was a very nice, fresh chunk of halibut.  They prepare it anyway you want it: pan seared, grilled, etc.  Mine was cooked perfectly.   The sides are ordered separately. I had the green beans and the portion was enough for two. Cooked firm--the way I like it.  A little pricey, but it is a nice restaurant. My bill for the halibut, beans, and 3 Stella's was around $50.  I will likely go back."}
{"text":"The restaurant ambiance was pleasant without the sounds of service and diners. The tables were spaced so there was a quiet elegance.  Our party ordered filet mignon, prime rib, shrimp scampi and salmon, the wedge salad, MRKT chopped or spinach and feta salad.   The presentation and flavor were enjoyed by each diner.  We shared the slice of moist and flavorful carrot cake. The French press coffee was prepared table side was accompanied the cake well. Our server, Joseph, was pleasant, competent, and attentive. Will recommend this restaurant to friends."}
{"text":"This restaurant is located inside the Aliante casino/hotel. We stopped for dinner on the last day of the year. The place seemed relatively busy. We tried to ask for a table but, apparently, everything was reserved. We ended up sitting at the round counter. We started with the drinks and I wanted to try an apple cider. The options were reduced to a single choice which was Redd's apple cider. I saw it before but I never tried it so I decided to have one. I ran through the menu and I saw things that I liked but I felt that many of them were overprized. I ordered a 16oz New York steak and grilled asparagus. The cider was good, definitely clear and fresh. The steak was well cooked just like I requested. It was not dry nor juicy, more of somewhere in between. The asparagus were good and flavorful. After the meal my girlfriend and I decided to share a dessert and we got a crème brûlée. I was not impressed since it was too creamy and it lacked consistency. All in all I had a good dinner. I listened to a talented musician sing and play his acoustic guitar in the background. We were assisted by Chrisalyn for the night. She was polite and friendly. I only had 3 issues with the place. The first is that the cider was poured in a big glass so it sort of lost its temperature as I ate my dinner. A smaller glass would have been a better choice. The second is that I think the lights at the round counter have a wavelength that makes you feel hot (probably on purpose so you order more drinks). The third thing is that a steak, priced $34, although good, it was definitely overpriced."}
{"text":"I had the surf and turf and found the lobster to be under cooked and unfortunately made me sick later that night."}
{"text":"Ah-mazing!! Everything was delicious!!  Had the crab cocktail as an appetizer. The Crab was fresh and delicious! Loved the spicy mayo sauce on the side.   Chopped salad was fresh and perfectly dressed! I don't care for bacon but with the other ingredients it so good.  Ours mains were the Ny Steak, lobster, Mac and cheese and sautéed mushrooms as sides. Everything was cooked to perfection and wonderful!  Service was top notch! William was our server mised our table for every coarse and even split our salad for us without us having to ask!! I would defiantly ask for him again!!   Over everything was fantastic and reasonably priced! Will be back for sure!"}
{"text":"Overrated and terrible service. No more needs to be said.  Waitresses was the worst. Salmon was overcooked"}
{"text":"MRKT Sea and Land is a bit like the Aliante Casino (part of Station Casinos) that it sits in - it is stylish, a bit trendy (as the vowel-less restaurant name suggests), and it provides a ton of value for the price. Both casino and restaurant also tend to be overlooked when the average Vegas tourist thinks about desirable places to eat and gamble while in the Sin City.  Atmosphere: Thumbs up. Service: Sideways thumb (was a bit slow when I was there)  For the appetizers, we had the calamari and the pan seared ahi tuna. The calamari was neither soggy with oil nor rubbery, and the pan seared ahi tuna was cooked well.   The surf and turf is a great way to experience the restaurant's namesake, as the Filet Mignon was tender (I requested rare) and the Lobster tail was huge! My girlfriend had the Pan Seared bone in rib eye (we were feeling like bloodthirsty carnivores that night, obviously) and it was a great deal for $31.   Give it a shot off the beaten path - you won't be disappointed. I recommend making reservations on the phone rather than online - it seems to be more likely to stick that way."}
{"text":"Wonderful dinner this evening, even better service from our server Gabriel.   Thank you!"}
{"text":"Had dinner at MRKT because my aunt and uncle live in Las Vegas and it was a convenient place to meet them.  Well, convenient for them of course - and that's the way it should be.  It's a looonnnng drive from the strip from where I was staying.   We were there upon opening - early birds.  There were perhaps 8-10 people in the place total.  I'm sure it gets crowded later.   I had a fantastic NY Strip, with broccoli. The strip was prepared perfectly, tender, very very good. The broccoli was the same.  The obligatory bread basket prior to the meal was great as well.  No complaints at all on the food and I thoroughly enjoyed it all.  The rest of the table had filet mignon and all were happy with their meals.  I didn't taste, but they looked great.  Aunt and uncle shared a salad and there was more than enough for two.    Prices were typical for a Las Vegas steakhouse. We normally go to the Charcoal Room and this was very comparable in every way.  I'd return if it was closer to the strip where I usually stay.   Service was fantastic, even putting up with our crazy requests with a smile."}
{"text":"Very nice atmosphere, good but pricey selection of wines.  Service good but not great. However, still looking for a decent steak in Las Vegas. The New York was dry and no seasoning, the baked potatoe while large was not cooked and the well done butterfly filet was medium rare. Would I go back, probably because they have a piano bar and the place is lovely but I would skip the steaks. The question is is there a decent steak in LV unless you go to Ruth Chris or Morton's I don't know? ,"}
{"text":"The Aliante Hotel & Casino sent me a $50 certificate to use either at the buffet or here. I've been to their buffet many time so I thought I'd give this place a try.   The decor is nice, but it does not make up for the mediocre food. Our server seemed like he has not been a waiter for that long.   Steaks were $24+ and did not come with any sides. They give you complimentary Pretzel, Raisin, and Sourdough bread.  What we ordered:  1 Jumbo Crab Cake - ok 2 Prime Ribs (rare) - a little tough and not tasty at all 2 MRKT Brick House Chickens - ok 1 Scallops - old and tough 2 Asparagus - boiled and bland (they should serve em grilled)  1 Sauteed Button Mushrooms - bland 1 Baked Sweet Potato - ok, super big  The bill came out to $162 before our deductions. For that amount of money, I would expect better tasting food."}
{"text":"We went at 6pm on a Saturday night. It wasn't packed so it was very comfortable. We were seated promptly and the staff was superior! Our waiter was very knowledgeable and gave great suggestions. I had the 12oz prime rib with mashed potatoes. Others in my group had the scallops, and 10oz fillet mignon. We had asparagus, roasted cauliflower and butternut squash gratin. The food was served quickly and perfectly temped. I'm from Kansas so beef something I'm very familiar with. This was excellent beef! Flavor on all the beef was beyond expectations! The only thing I wasn't completely in love with was the gratin. It was good but not the caliber of the other dishes. All in all I will be going back!"}
{"text":"Oh my goodness, what a delight!   First off, the service is excellent.  There's s great menu variety.  They specialize in steaks and seafood.  A basket of bread and butter came out to the table.  Freshly baked, don't eat too much though.  The lobster bisque was so creamy and flavorful. With a nice sized piece of lobster in a flaky pastry dough made it off the charts wonderful. I had the prime rib special which was a nice piece of perfectly cooked meat, whipped potatoes and green beans.  For $18 it is a good early bird deal.  Added the side of Brussels sprouts.  Roasted, with bacon and drizzled with balsamic vinegar.  The $7 side dish is enough for at least 2.  They also have a 5 oz filet and 5 oz lobster tail special for $25.  My bite of the lobster was well cooked.  Filet was not cooked to my liking but I didn't order it!  Rave reviews on it as well.  Chocolate cake was recommended but there's no room, so it'll have to go home for later.  Something tells me it will be yummy. For a casino, this is a good steak place. Will definitely be back."}
{"text":"Service is TOP NOTCH! Food was very good and the bread was amazing. Wife and I had steak and lobster, no complaint at all.. Service I believe is what separated my visit from good to great. We also added a cheesecake slice at the end, plenty for 2 people, wife and I couldn't finish it."}
{"text":"Upon arrival you are greeted with a very nice center bar and then led back to a dining area that offers a wide open dining space with private booths along the walls.  The decor was nice and the service was decent.  The food, however, was excellent!  For starters, we ordered the Calamari.  Next up I had the 12oz. lobster while my wife had a pound of the Alaskan King Crab Legs.  Everything tasted just as it should have... delicious.  We're definitely coming here again!"}
{"text":"Dined here twice during our stay at Aliante. Both experiences were great. We had great service. And the food was very good. We tried the crab cakes (not easy to find good crab cakes) & they were fantastic, full of crab not bread filler. The cioppino was also very good & plenty for 2 people to share. Love the bread basket of sourdough & pretzel bread with whipped butter. And $8-10 for good, strong drinks."}
{"text":"Excellent service, food is delicious we came back the next night.  Highly recommend the crab cake for appetizer, sea bass and shrimp scampi for entree.  Steaks are typical, seafoods are fresh."}
{"text":"By far the best seafood and steak restaurant I've ever been to in my life! For it being located inside the Aliante Casino, I've would've never guessed for MRKT to be so elegant and fancy on the inside.  The breads they provide as an appetizer before your meal is amazing! Fresh and warm from the oven and its a basket with four different styles of bread. I came here with my fiancé twice already and both visits were great! We both ordered the filet mignon with Alaskan lobster tails. They both came with fresh mashed red potatoes and steamed asparagus. The food was beyond extravagant.  The hostess was beautiful and very nice and well dressed. There's a full bar as soon as you walk in and first thought would be \"is this a lounge\"? Lol, but further back is the sinning area which is all candle lit. Made me look like a big shot for my fiancé. Lol thanks MRKT.  There's also a live acoustic guitar player who's very talented and performs classic music that anyone enjoy.  MRKT is pricey. For the two meals and 1 alcoholic beverage was $145 but I'll definitely eat here again if I was rich lol. I'll only be here for special events such as my birthday because it'll be free! :)"}
{"text":"This is a beautifully designed restaurant nestled in the Aliante Hotel. Absolutely wonderful experience. Great location for groups, romantic dinner. Service was phenomenal, food was delicious and flavorful. I will be returning."}
{"text":"My husband and I eat here at LEAST once a month. I have never had anything I didn't like. Pork chop was phenomenal! I usually have filet, it's wonderful. Asparagus is a must, capachio appetizer, baked sweet potato..... just go there, ask for Cristalynn. Great service with her-"}
{"text":"Service was okay, food was just okay. There was nothing special about this place. It was pricey for a local casino steakhouse."}
{"text":"Super slow service and the food is not good. I would say our steaks were over-cooked but they were murdered. Death by wood fire. Terrible. And the lobster tails, also over-cooked. Poor lobsters. You didn't stand a chance here. You were destined to be rubber. The only reason for the 3 stars opposed to 2 is because our server was actually quite pleasant and also the bartender and very busy. She didn't get much help from her other bartender or her supporting wait staff so I give her a little break but 2 hours wore on my patiences."}
{"text":"Not quite sure about all the negative reviews. Our 6:00 reservation on a Friday night was handled flawlessly. The hostess was very sweet, and sat us in a romantic booth, as requested. The filet mignons were cooked to perfection. Corn soufflé was very yummy, not thrilled with the Brussels sprouts. Pretzel bread was warm and delicious, and the pomegranate martini was well made. A bit on the pricey side for the neighborhood, but well below what you would pay on the strip."}
{"text":"If I had known that this musical act was relocated from the ETA lounge in the Alliante  to the restaraunt we never would have dined at Sea and Land The weekend musical act in this restaraunt, Dave Ritz, is joke.  Neither he or his guitar carried a tune all night.  He made a good dining experience painful. MRKT Sea and Land is one of our guilty pleasures with its ambiance and friendly staff but it seems as if the prices have gone up while quality has gone down and with the so called music in the background we will no longer be patronizing this restaraunt on the weekends."}
{"text":"Went here for our anniversary. Was not a big fan of the hostess but not a big deal. Our server was super friendly and the food was great. I got the petite filet and tr flavor was great. Their house sauce was amazing. My boyfriend had the Ny steak that was also really good. The server recommended a great wine to go along with our steak. We had the spinach and au gratin for the sides. I really like how the spinach was cooked. The desert was just okay. Something you could get at any casual restaurant. Nothing too special"}
{"text":"We went to MRKT last night and had a wonderful experience.  I'd heard good things about it, and we definitely weren't disappointed.  We showed up about 20 minutes early for our 8pm dinner reservation, and the hostesses seated us anyway and we had a cozy booth near the back of the restaurant.  The ambiance is beautiful -- not as high-end as T-Bones or Hank's (other Station casino steakhouses) but still very nice.  The live music performer in the bar area is a nice touch and the music plays throughout the restaurant.  Our server was excellent; very attentive, knowledgeable about the menu and he even hooked us up with $5 martinis even though it wasn't happy hour anymore (martinis were very tasty and pretty big -- try the Orange Julius one or Summer Passion!).  We were really impressed with the food all around; the bread basket was loaded with 4 different breads and served with plenty of whipped butter.  We shared the crab cake appetizer, which was 80% huge pieces of crab and 20% filler holding it together, and overall delicious.  For steaks we got the prime rib and the 12 oz. filet, both cooked to perfection.  The sides were all quite reasonable ($6 or $7; most steakhouses charge $10) and the creamed corn and potatoes au gratin were amazing.  I'm just sad we didn't have room for dessert!  Overall we had a great time here and would definitely go again; it's worth the drive up to Aliante!! :)"}
{"text":"Boy, the reviews have gone from one extreme to the other. We went to see Iron Man 3 at 4PM and planned on dinner afterwards. Since we were already at the casino we decided to eat at one of the restaurants there. We had an experience at one of them, the food was awful, but wanted more than a fast food dinner. As I live 5 minutes away and see the ads all the time, we went to MRKT. Have never been before and had not looked up any reviews so we were not swayed in our opinions.  Well, it was nice to get a good surprise after the last time we ate at a restaurant at the casino.  To start the service was excellent. We ordered drinks that you knew actually had alcohol in them. Seems that a lot of restaurants dont put much alcohol in their mixed drinks so you are paying for an expensive drink with very little alcohol. I ordered shrimp cocktail as an appetizer. Four huge shrimp with delicious sauce. My daughter ordered crab cakes which she said were the best she had ever had. I then ordered the salmon. The biggest piece of salmon I have ever had in a restaurant. Cooked to perfection. My daughter ordered prime rib that she could cut with her fork. We split mashed potatoes with garlic added. Perfect. The only bad thing I can say is that the dinner was so good that we didnt have any room for dessert and if it was as good as it looked going by on the dessert cart what can I say. Based on our experience we will be going back. Dont know about the other reviews???? Was nice to be able to walk into a restaurant not having any reservations and getting seated immediately and this was a Friday night. Cost of dinner $124 tip not included. Well worth it for a delicious meal."}
{"text":"Two stars for the nice decor and that's about it. We ordered the fried shrimp and prime rib. Neither had ANY flavor. The service was ok. The waiter seemed irritated that I asked about the menu prior to ordering. The place was pretty empty on a Saturday night. That should've been a red flag. I wouldn't dine here again."}
{"text":"MRKT, what to say about MRKT. How about this; \"MRKT Sea & Land is a restaurant in search of an identity.\" I do not say this lightly, but this is really the case and it was quite apparent as the dining experience went alone.  My wife and I decided to step out to a \"Higher End\" restaurant for our 2nd anniversary. We had $25 restaurant.com discount (knowing this bill would probably be about $100) so we felt like we could order freely without worrying about price. So armed we sallied forth.  With the exception of \"being given the eye\" when we walked in the staff was on the whole polite and helpful. When things didn't quite work out they were very accommodating and understanding. The restaurant itself is well designed and inviting with a music track that is up-tempo without being too loud. The booths were not easy to get into and out of, but I call this a quirk. Lighting could have been a little more subdued to add to the \"higher end\" restaurant experience they were after, but again I call this a quirk of their choices. It did all add up to something I call \"AKC\" (more later) atmosphere, but it was easily handled.  This restaurant has all the trappings of wanting to be a marquee 5 star restaurant but just does not know how to do it, and it was all the little things that gave them away. For example, when refilling our Iced Tea the server poured the tea over the table towards us, a no-no in fine dining. The second time I lifted my glass and set it away from me so the server should get the hint, but still he left the glass on the table and refilled the tea. But then he made another mistake and lifted the glass next to the rim and set in down in front of me. Oops. (Would you like to drink from a rim of a glass where the server just touched? Didn't think so.) It was not until later that our server (who was also tending bar) refilled our drinks correctly by lifting the glass by the base, filling it away from the table and returning back by the base. These kind of details were all missing from the experience.  So let's talk about the food. My wife ordered the Prime Rib (16oz. cut), generous for the price of $25 and the Potatoes Au Gratin ($7 more). I order the Bone In Rib Eye (also 16oz.) for $38 and a simple Baked Potato (also $7 more). Obviously the ordering is all al-a-carte, something I personally do not like because I feel it is just a scam to up your bill. Also there ends up being so many plates on the table it interferes with the dining experience.   When you are in a casino there are many kitchens, a dedicated kitchen for a specific restaurant and a more general kitchen for the hotel overall. Sometimes you can get crossover between kitchens and the taste can be reflected in the food. I think this was the case here. I feel like there was crossover because the recipes and preparation were so old school it left little to enjoy. Item by item: The Prime Rib was good but lacked any kind of real taste and had a huge piece of fat in the middle. (Yes, I know there is supposed to be an eye of fat, but this was at least 5oz.) So the Prime Rib was your standard buffet Prime Rib, a bit disappointing. The Potatoes Au Gratin were made with AMERICAN CHEESE AND THE POTATOES WERE INCIPIENTLY OVER COOKED. We sent it back and hope they get a better recipe for the future, not something from 1978. Now for the Rib Eye; I kinda asked for it I guess, I asked if the steak was aged or not. When the answer came back \"it was fresh\" I knew right there that there may be trouble. Indeed, as the steak cooled and I got to the center it became apparent this piece of meat had been frozen at some time. (If you are a steak lover you know what I mean as the texture of the steak become mealy. In fairness I do not know this to be fact, but in my opinion, and that is what matters here, it was frozen at some point.) For $38 I would hope for an aged steak, especially a Rib Eye that shines the longer it is aged. It was not 2 weeks ago that I had a 21 day aged Porter House and the flavor blew my head off it was so good, so I had something to compare it to. Are you seeing where I am heading here, this was fair food from a buffet, but NOT a restaurant looking to be something better.  I say this with all the love from my heritage and totally tongue and cheek; \"AKC\" stands for Alter Kocker Certified. This is a restaurant that is primarily patronized by our senior citizens because the food is the same as it was in 1962 and generally does not challenge the diner. You know these establishments when you see them, and unfortunately MRKT is AKC in disguise; nothing challenging but nothing to make it noteworthy. The only thing outstanding when all is said and done is the price, and if they keep this cooking (not cuisine) they will not be around long."}
{"text":"all I want to say is - if a patron tells the waitress the steak sauce is salty, don't tell me its always made that way because there's salt in the butter. please don't make excuses when I'm paying $46 for a steak. Our son's chicken was also salty. If I order green beans almandine, bring the side dish. I understand to err and forget is human but it just added to her lack of service. And lastly, if you're going to be a sour waitress, stay a sour waitress, don't become perky and interested in us as they dinner winds down nearing to the check and your tip. MRKT if you're reading this, the waitress is Laura, I believe. And I want to give a big thumbs up to Derek, the new guy who stopped by our table to say hello as he was our waiter for the previous night at Bistro57. Perhaps Laura, if that's her name, should shadow Derek and relearn customer service. btw, we're locals. we eat at MRKT fairly often and usually enjoy the food and service."}
{"text":"Prime rib was huge and cooked to perfection. Cream corn au gratin as a side was delicious. A HUGE slice of NY Cheesecake finished the meal perfectly. Our waitress, Erica, was friendly and knowledgable. Perfectly attentive without being overbearing."}
{"text":"We have been here a couple of times before this, and it has always been a great experience.. Both my husband and I ordered the ribeye steak, it is huge!! We order them done differently and both of our steaks were cooked perfectly!! My husband ordered the hash browns  for his side, and there was plenty there for sharing. My husband ordered the cheesecake for desert, i tried a taste and it is delicious!!  I ordered the chocolate cake, it was simply sinful!!! I will order that again, definitely!!!  We love the fireplace wall they have in this restaurant!!  It is a very nice place to dine.. People come in there dressed up and people come in there in their blue jeans also... The service has always been very good. The bread they give you while you are looking over the menu is very tasty and warm, they serve it with butter.  It is a little spendy, but worth it!! You get very large servings and everything I have ever had there has been delicious!!!!"}
{"text":"Just classic old school Las Vegas fine dining and service. You feel important without being smothered. Excellent prepared quality food. Excellent service from *Mo."}
{"text":"The Skinny: Although the preparation of their chicken and beef is great, the main issues are their sides (3) Service: was amiable and the ambience is very casual which is surprising for a $30 entree steakhouse (3.5) Value: being a steakhouse, it is definitely overpriced for what it is but given our coupon ($50 off on a $100 meal) it didn't hurt quite so bad  - portion sizes are large though(3).  Let me preface this by saying I usually don't like steakhouses. Generally, the fare is boring and pretty straightforward. We would not normally have gone but the hubs had a coupon for $50 off $100 so we decided to give it a try.  Of note, is the schizophrenic ambience of this restaurant. Set in an ultra contemporary setting with plump pillows and plush seating, it was a little shocking to see the wide variety of dress here - including a fellow dressed in a faded t-shirt, plaid swimtrunks and flipflops. At a place that serves $30 steaks, it was a little bit disconcerting.  While Alanis Morissette singing \"Jagged little pill\" blared in the background, I felt sorry for the one young couple dressed to the nines attempting to have a nice romantic dinner.    We ordered the lobster bisque with puff pastry ($11) and caesar salad ($7) to start. The lobster bisque was decidedly one-note - flavoured strongly of lobster but little else. It's watery texture paired with the rather lackluster puff pastry make this a menu item to skip. The caesar salad on the other hand was a better rendition of a classic steakhouse staple. The dressing had a nice amount of acidity which lightened a regularly over-heavy salad. Unfortunately, the romaine was cut too small which marred the crispness of the lettuce.  For our proteins, we ordered the brick chicken ($19), bone-in New York($34),  and accompanied this with potatoes au gratin($7), mushrooms($7), green beans($6).   I cannot speak highly enough about the brick chicken. They served a marvelous whole deboned Jidori chicken with a lovely crisp skin and perfectly moist meat on the inside. How they manage keeping it moist with very little bones, I have no idea. It is definitely a steal at $19. (FYI - it may, at first appear a little bland, however I believe it is served that way because you are supposed to dip the meat in the accompanying au jus). The bone-in New York was also good albeit not as outstanding as the brick chicken.  Tthe sides were our main beef (so to speak). Anemic button mushrooms (not a lovely toasted colour) were flavourless. The wonderfully fresh haricots verts (thinner longer variety of green beans) were rather bland considering it was swimming in some sort of garlic and butter concoction. The potatoes au gratin lacked a proper golden crisp crust and too heavy on the garlic.  Finally dessert. Although it wasn't really bananas foster ($7) in a traditional sense, it was rather lovely. The banana was tempura fried and came with a nice rum sauce poured overtop and served with vanilla ice cream. The ripeness of the banana was perfect and crunchy coating make nice textural contrast.  Overall, given the average steakhouse cuisine, this place does somethings better than most (ie, the brick chicken, bananas foster) while dismally failing in other departments (the sides and the starters). That's why it gets a 3-starred review."}
{"text":"Decor is absolutely beautiful! Love the fire tubes! The raisin bread in the assorted bread basket was sweet, chewy, crunchy and delicious. Summer salad with apples, goat cheese and candied walnuts was very fresh and light; calamari was very well seasoned and fried perfectly. Petite filet was juicy and had a delicious smokey flavor; creamy good mac & cheese; yummy grilled asparagus with a very light cream sauce. The cheese cake was really good- well of course it was, it was from the Carnegie Deli in NY, ha, ha (we had to go to Vegas for something we can get locally?!?). Server was friendly and attentive. Being from New York and having high culinary expectations, we were not disappointed, but not blown away either. Overall we really enjoyed ourselves :-)"}
{"text":"My husband and I were Impressed when we came here to celebrate Mother's Day ; ) This place has a very good vibe,classy and cozy.We totally enjoyed the food we ordered! It was so delicious! Not to mention,they give the Best Customer Service!! This place Rock!"}
{"text":"This is our go to place. We have been very fortunate to be able to experience gordon ramsay steak 3 times which we loved- and we love Mrkt just as much! The hostess ( we feel terrible we don't remember her name) is always so friendly and welcoming. And we always sit in Mo's area. Mo is amazing! Remembers every detail about what we like to drink down to what favorite appetizer is! The food has always been top notch for us. Pricing is very reasonable for what you get plus you don't have to deal with the strip!"}
{"text":"I Got The Chicken, It Was Kinda Dry. But The Gravy Made It Better. This Place Is Pricey! But Very Elegant And Nice"}
{"text":"Had a strong hankering for prime rib. Was staying at the Aliante Hotel Casino Resort and thought why not try their signature steakhouse.  Upon walking in you are surrounded by a spectacular oval bar with shimmering glass, a huge wine bottle display, high vaulted ceilings, staff dressed to the nines. Seating area is dark browns with lots of tans and ivory, steakhouse vibe for sure.  My meal started off with warm pretzel sticks and whipped butter, nice opening round.  I kept it simple, ordered the perfectly seasoned prime rib dressed with au jus gravy and horseradish.  The steak was juicy, succulent and melted in my mouth.  The wheels came off the bus somewhat during my sides of macaroni and cheese and creamed spinach.  While their tastes were steakhouse quality and yummy, they were served to me almost cold, I sent them back for a reheat.  They were better when returned, but the head chef can't let that happen for this quality of restaurant.  And speaking of that, why have we in America gotten too casual.  This is a fine dining establishment, with 5 star service, and yet the majority of diners were in casual shorts, hoodies, and sweat pants, it's a disgrace.  Europeans would be appalled. Now that my rant is over I finished my meal with a proper creme brûlée that was creamy, sweet and dressed with fresh fruit, a very appropriate ending to an excellent meal. Some final thoughts to the MKRT team, heat your serving plates and tell me be careful, your plate is very hot.  Offer me some melted butter to dip my steak in, and serve that au jus gravy boiling hot, not lukewarm.  If there are temperature issues, served the food covered before presentation.  The steak should also extremely hot when first served, think Ruth Chris hot.  So with all that said, I loved the vibe of this place, it's very close to going to a higher level."}
{"text":"Great Steak and Seafood here!! Pricey, but you get what you pay for! This is Vegas, the one thing you DON'T Want to gamble with, is your food/health. Don't take the risk of a huge buffet (with stale seafood, or worse!) I never worry about getting sick eating here, very upscale and quiet. Fresh bread served with your drinks and the Chop Salad is great!! I had the Chicken Dumpling Soup (last time) because I didn't feel very well and it was delicious!!   My boyfriend and I always look forward to eating a nice dinner here when we're in Vegas (Aliante Hotel) and it's always been wonderful."}
{"text":"High quality dining with perfect service. I have been here twice and the food is very good. Most recent visit was on valentines day. I had scallops and mushrooms, My scallops were cooked perfectly! My boyfriend ordered the jumbo fried shrimp and mashed potatoes. Shrimp was slightly overcooked. Potatoes are rich and creamy. Sides are large enough for sharing. Pretzel bread is delicious too. Caesar salad is good and fresh and a large serving also enough for sharing."}
{"text":"This place is wonderful! My boyfriend talked me into going her after a movie to try the place out. We wanted steak but wasn't sure about what to order. Our server was a delight! She was informative, patient and had a great sense of humor. We order the ribeye steaks with murshrooms and asparagus, these steaks were hugh and delicious, it melted in your mouth! This was a terrific end to a great evening! We will be back with friends very soon!"}
{"text":"Had an excellent experience tonight. Ambiance was nice and quiet. My wife and I had the wedge salads. I had the filet mignon and wife had the prime rib. Everything we ate was cooked perfectly. Server was excellent. We skipped dessert because we were full but the selections looked great as well."}
{"text":"I came here for my birthday dinner and overall I enjoyed the service and food. I had made reservations so I was quickly seated with my husband. I ordered their special at the time which was a petite filet mignon and a lobster tail for around $50. This changes monthly so it's a good idea to check out what they're offering before you go. My husband ordered the ribeye, lobster mac and cheese, and a pound of king crab. Everything was cooked to perfection and so tasty."}
{"text":"The bread basket is awesome. I love the prime rib. Flavorful and cooked perfectly. It can expensive so I try to go when there is a buy one get one free. I like the mrkt salad and the nut salad."}
{"text":"On a recent Saturday evening, I surprised by husband by taking him to MRKT for his birthday dinner.  I wanted to avoid the hustle and bustle of the Strip, and he mentioned in the past that he wanted to check this place out.  I made a reservation early in the day, which turned out to be a pain.  A couple minutes worth of holding, being transferred, being disconnected, etc., etc., but finally was able to make the reservation after about 10 minutes.  We arrived on time, to find nobody at the hostess stand.  We made our way to the bar, located in the center, and a bartender finally called over the hostess.  She was pleasant, but didn't seem engaging or happy to assist.  She couldn't locate our reservation, but it wasn't too busy so we were seated right away.  We were led to a horseshoe-shaped booth which faces the bar, towards the back of the restaurant.  I was pretty disappointed because it didn't seem intimate/private, especially because there were sports blaring on the bar TV, and music pumped out of the speakers mounted overhead.  Also, I noticed several stains on the booth seat, and the table linens seemed dingy.  After about 5 minutes, the waiter came over and presented us with menus.  I asked to see a Wine List, and he kind of stumbled and said he would check and see if they had one.  He came back with the Wine List after a few minutes, and awkwardly stood by waiting for my bar selection.  Not wanting to feel rushed, I just ordered a soda \"for now.\"  He left without asking my husband what he wanted to drink.  My husband and I laughed it off.  About 5 minutes later, he came back with a soda and promptly left.  About 5 minutes after that, he came back and asked my husband what he would like to drink.  It was so strange that we were wondering if he was messing with us, but over the course of his service we realized that he was probably just *ahem* high as a kite.  We liked the bread basket offerings.  After snacking on the breads, we ordered the Seafood Platter for 2.  It was decent, except the lump crab seemed less-than-fresh.  We split a 10oz filet mignon and grilled asparagus.  These items were okay.  Not great, not awful, just okay.  Nothing memorable.  I ended up requesting a glass of champagne, and the waiter told me he didn't think they had any.  I showed him the 2 options on the menu, and he went to \"go check.\"  He came back with the champagne, and left me the bottle and glass to pour myself.    All in all, we experienced long wait times, so-so food, less than marginal service, and sub-standard practices (i.e. not clearing away dirty dishes before serving new plates, etc.).  And I was very sad not to be offered a birthday dessert.  I am accustomed to receiving (or at least being offered!) a dessert for a birthday celebration.  We were very courteous, patient, and kind, and definitely didn't do anything to annoy anyone.  We just think this place must be hit or miss, depending on the staff on hand.  It was definitely a miss for us.  It will be back to the Strip for his birthday dinner next year!"}
{"text":"Philly cheese steak with grilled jalapeño is the way to go! Isabel is perfect and awesome! I have never been disappointed with the selection of meals. Great job!!!"}
{"text":"Not good,  poor quality.  disappointment.  Tried rins and Brussels sprouts and no amount of alcohol helped.!"}
{"text":"My experience at MRKT was nothing short of spectacular. It's eye pleasing decor and impressive bar will occupy your brain as you walk in enjoying some famous tunes sang by the cool lounge singer at the piano. The ambiance is really nice... not loud... kind of calm in fact. Our server Jose was the best in the business. He took care of us from start to finish. This guy has a wonderful personality and he kept drinks full and he made empty plates disappear like he was Chris Angel. Thank you Jose.  The food was excellent! They start you off with some pretzel bread that quickly becomes your latest addiction. The rib eye was delicious and the scallops were cooked to perfection. If you can't decide which sides to go with... Let me help you... don't leave without the bacon mac n cheese.  It's beyond delicious . It may be the star of the show. Polish off the meal with a slice of New York cheesecake and then smile because you just had a great night!"}
{"text":"So good! I've been a couple of times and the food is really good! But tonight I came here with he hubby to unwind and have a drink and didn't realize their amazing happy hour specials!!! The bartender provided great service! The steak and fries we so damn good! I think this will be our new spot to chill and not go broke!"}
{"text":"We eat here ALL the time and always have the best steaks! Their rib eye sauce is amazing. We request Mo for our waiter and he is awesome!! Such a great place for a nice, delicious steak and not paying strip prices."}
{"text":"THE BEST RIB EYE I HAVE EVER HAD!!!  Comes with rib eye sauce (garlic cilantro)  Also ordered loaded mash and green beans  Mikes service was great and atmosphere was pleasant"}
{"text":"If you want a better steak then this place has to offer go to the grocery store and microwave one at home. Horrible liquid smoke taste and horrible cuts and the side were just as horrible. Also the service is even worst we walked in and no one was there so we walked to the back to see if the place was even open then we greeted by the hostess (who was sitting at the bar) and asked if they were open and she said ummmm.... ya we are open till 10 (it was 8) then to top it off we had a server named Mike and he was not helpful at all and not a very pleasant person to deal with. Wayy over priced!!"}
{"text":"This place is excellent.  You definitely get what you pay for here.  This restaurant offers immediate seating and casual clothing is ok....just don't arrive looking like a bum/hobo or else you might not get service.  A great place to eat if you just hit a jackpot/progressive at the casino.  Also, they make outstanding drinks! ;)"}
{"text":"What. Happened.   This was easily the best restaurant in the area. Then something happened. I'm not sure how a steakhouse can manage to serve three filet mignons ordered in exactly the same fashion three different temperatures. On four separate occasions. Boggles my mind. Steak is kind of your thing. You should have that on lock.  No exceptions.   The ribeye sauce/house steak sauce is amazing. The chicken dish is really good. They ditched the wedge salad, much to the disappointment of my family.   Get it together so I don't have to go downtown in search of a decent steak. Please."}
{"text":"This place was awesome! My husband and I tried bone marrow for the first time and he loved it! The wait staff are very attentive and courteous. The took care of our needs without being intrusive. I had the filet and it was delicious! We also loved the chopped salad, but the truffle fries were not great.  They brought us a dessert for our anniversary :)"}
{"text":"It's a bit pricey but what Resturant isn't now days?My girlfriend had the potter house steak which was excellent. I had the fish of the day that was a bit undercooked (but everyone makes mistakes.) The creamed spinach and creamed corn was amazing. The mac n cheese was ok. I heard the shrimp cocktail was good from what our guest ordered. As for the service - I'll say it was busy so they were not as attentive."}
{"text":"Awesome fine dining on a budget. Price was not horrible, but the food was great!   Value here is very good for a pricier meal.   I loved the Surf and Turf $25 meal with lobster and filet, both perfectly done.  All the fixins were good too, venue is nice a romantic, but also great for big family meals , wine , beer, they have it all.  Loved it..  will go again!"}
{"text":"Fabulous service and dinner last night celebrating our 20th Anniversary.   Thank you Jose for extraordinary service...we will be back!"}
{"text":"A decent restaurant in a neighborhood that desperately needs decent restaurants.  A well balanced menu between surf & turf, with a focus on seasonality, make this a must go for dinner.    I would recommend avoiding the restaurant when they have live music on the bar - it can be bothersome and occasionally out of tune.  The food is quite good, even if the service is absent."}
{"text":"So my family and I ate here for dinner on a Saturday night. I liked how it was very spacious on the inside and it was not crowded so a party of 8 plus a child was accommodated rather quickly. They serve complimentary bread, which according to my family was very delicious. They serve a small menu so each dish is cooked to perfection right? WRONG! Apparently they are only able to do that with 7 out of 8 dishes. My family ordered Steaks, and Salmon which according to them were very good. I was the only one who ordered the Shrimp Scampi, and the one who had the worst dish. The shrimp was cold and flavorless and the rice pilaf was cold and dry. The server ended up taking it back and having it redone. Our server even commented that the 2nd plate she brought out even looked a lot better. At this point I'm wondering why she even brought me the first plate if it looked so bad?? For $28 for a few shrimp and a scoup of pilaf I did not think I would have this kind of issue. There were no comps or apology from management for this incident. The plate ended up tasting just OK, it was nothing worth recommending. On the plus side our server was friendly. I MIGHT consider eating here again but I would definitely not go out of my way to come here, so they get an OK rating."}
{"text":"We had a woderful time at MRKT Sea & Land. It was definitely a splurge for us, as we can only afford this price range once a year, but it was well worth it! The food and drinks were delicious! We had the beef carpaccio appetizer, I had a garden salad and the petite filet mignon, my husband had the porterhouse, a berry mojito and some wine and we shared three sides (the sides are meant to be shared here). Everything was cooked perfectly; our medium and medium-rare steaks were also rested, which made them super juicy and soooooooo good! Oh my gosh, I can't say enough about my steak! Yummm! :) Anyhow, the service was also excellent and our seating was really comfy - we chose a booth, which came with pillows. :)  Of corse, the place was clean and the ambiance wonderful. Just a great place to eat."}
{"text":"Had a lovely meal with my mom last night. Seated immediately in a comfy booth. Our server Will was very attentive. Answered questions about the menu. Ordered the beet salad (Will had it split for us which was nice.) Lovely salad. My mom is still talking about it. Mom had the surf and turf-perfect size portion and cooked perfectly to rare, just like she liked it. I had the scallops which were cooked perfectly and nice size/fresh. Enjoyed the music provided by the solo artist in the bar. Very talented.  Will eat here again when back in town."}
{"text":"Went here last night with the husband for dinner. Had the bone in ribeye and it was one of the best steaks I have ever had. Comes with a side of garlic butter sauce that makes it melt in your mouth. Had the creme brûlée for dessert, which was also amazing. My husband had the prime rib, which I usually get, and was still very good but could not compare to the ribeye. Mike was our waiter. He was very efficient and friendly. Overall awesome experience and will go back.   Cost was $118.00 for one beer, two steaks, one mac and sheesh, two salads and one dessert"}
{"text":"WARNING: THE RIB EYE SAUCE IS A HIGHLY ADDICTIVE SUBSTANCE!  It should be illegal, then that way i won't have such easy access to it. but to my wallet--and my waistline's dismay, mi casa is only 5 minutes away from it. it use to be a once-a-week habit for me. heck, i was so popular there i was even on their FB page! Then some personal shtuff went down and i found myself having to pay for other neccessities such as toilet paper and medical bills, to name a few, and money for my rib-eye steak habit just kinda dwindled.  now, i come to MRKT about once a month and i always order my bone-in rib eye with 2 thingies of the rib eye sauce. its great to pour over your side of mushrooms, asparagus, or just to drink straight-up. seriously, its that freakin' good!!  a few other mentionables:   Blue nut (tehe) salad Lobster Bisque en Croute (sp) Pretzel Bread New York Style Cheesecake --My NYer friend told me that this is true NY cheesecake b/c of the crust. it reminds me of the flakey stuff that chinese moon cake is made of.  Anyhow, i like to sit at the bar and usually go on a Thurs night when the cute musician guy is playing. Abby is always wonderful and the managers and sometimes the chef will come around to make sure everything is good. which it always is for me, every time."}
{"text":"Didn't try the food but the restaurant was very upscale and cozy. 5 dollar margaritas which aren't too weak. They even played Morrissey and Depeche Mode! All in all not a bad place to grab a drink or two.  The service was nice and friendly."}
{"text":"The food is delicious and at a reasonable price.  solid breakfast spot, pancakes were on point, the wife loved her chicken fried steak"}
{"text":"This little piggy went to MRKT; although, this little piggy maybe should've just stayed home and eaten whatever was in the fridge.  MRKT falls FLAT. The ambiance, the contemporary decor, yes, it's all appealing, but look beyond that and you'll find sub par cuisine.  Dinner started off with a bread basket consisting of two pretzel breads and some mundane bread rolls, served warm.   For my entree, I ordered the scallops which were tender; however, they didn't taste fresh. For sides, my boyfriend and I shared orders of the mushrooms and grilled asparagus. The asparagus was fine, but overall the mushrooms were probably the best item I had that evening.   We ordered desserts, which took 20 minutes to arrive. Our waiter told us that the pastry chef was out sick, and that the kitchen was backed up with orders. OK, well I call BS. If there wasn't a pastry chef available that night, then how come we still received our orders? What we received were out-of-the-box desserts. My chocolate tart was flavorless and didn't taste like chocolate, but caramel. In addition, I ordered a side of vanilla ice cream, which had the distinct flavor of Hershey's \"chocolate\" syrup drizzled on top -- um, wtf? I wasn't expecting liquid crap all over my ice cream. Furthermore, my boyfriend's strawberry cheesecake was partially frozen.   It's amazing how this restaurant has remained open for this long, considering the mediocre food. MRKT has to step their game up if they want to compete with other local steakhouses."}
{"text":"I don't even know where to begin. I used to frequent this place and I came back for this first time in about six months. The service was extremely slow and there were about 4 errors regarding our food. I hardly ever complain about food or service, but this was just bad. As a local, it saddens me to say that I will definitely not be returning. There are many other restaurants in the casino where you can find better food and service."}
{"text":"The host Priscilla is the worst!!! When we come here she is not attentive at all. My entire family went for a birthday celebration(reservation) tonight, but ended up at TGIFs. We walk up and Priscilla was on the phone completing a reservation, however after 8 minutes of waiting to even be acknowledged she still had not finished the call.  It is really unfortunate because the food is out of this world good, but most people may never experience the food if they are turned off at the door due to poor customer service."}
{"text":"The service here was pretty slow and the bartenders lacked giving quality attention, but the food was tasty and the live piano music was nice.  We grabbed a couple seats at the bar and were not greeted or given menus in good timing. We waited around and were finally able to give a drink order  while several bartenders hustled behind the bar and then had to be reminded that we wanted to order food as well. The gentleman to our right, who was a Veteran after speaking with him, asked a question about a whiskey bottle and one of the female bartenders with dark hair and she told him she was really busy and he would have to wait. We were so taken back by her rudeness we asked the bar back to answer his question and he did with good manners. We proceeded to buy this patron a drink because we felt he deserved more respect than that as an American hero and as a paying customer.   We ordered a wedge salad and a Philly cheese-steak to share along with a few beers and a glass of wine. The Philly was delicious. Tender steak, a great cheese sauce but the fries were greasy and soft not crunchy and cooked properly in hot oil the way they should be.   Aliante lacks the luster when it comes to quality restaurants, and being that MRKT had tbe best reviews out of all of their dining establishments, I left feeling a little disappointed."}
{"text":"Beautiful ambiance, uninspiring food, worst service ever. We waited one hour for our first round of drinks to arrive on New Year's Eve. One hour for drinks. All of the courses took a long time to arrive and the food was not nearly as good as I would expect. Even after one partygoer of ours complained, management still could not speed service.  -Bland scallops -Winter squash soup more like pumpkin pie -Burnt coffee  For a $200+ meal for two, I expect better quality, even on a holiday. The management completely failed to create a decent holiday experience (which I know is possible because First Food and Bar did it so well this past Thanksgiving, and at half the price).   The company was great."}
{"text":"I would have never thought this restaurant would be this amazing, this outstanding!!!! We live near the area and being locals, my husband and I always go above and beyond for date nights. When my husband announced that we had reservations at Mrkt, I was a bit skeptical... thinking 'a local area??'  But i thought... oh well what the heck, let's save some gas. The minute we walked in we felt welcomed with a warm greeting, we were seated at a lovely booth (which we always enjoy) and greeted by our server (Michael) who helped us out with the menu AND our delicious Moscato  (we bought the bottle and finished it!) I ordered the shrimp scampi which is seasoned really well. My husband ordered the filet mignon, and the pound and a half Alaskan king crab legs (which we shared) and boy... was it mouth watering!! We are already talking about spending mothers day here with the family. I definitely recommend this restaurant to all locals, good price, great food, and the bonus... you don't have to dress up!! Ok, boutique to enjoy our dessert!!"}
{"text":"Came here to try the new patio lunch offering with a group of 5 people. Everyone said their food was excellent. The service was on point, I particularly liked the update when the food was 3 mins from being brought out. The mister system and shade make it a great lunch place on our hot sunny Vegas days. I would highly recommended."}
{"text":"MRKT is a more upscale steak and seafood restaurant at the Aliante Hotel & Resort although there were several customers in very casual attire. The restaurant has great ambiance with contemporary décor, lush comfortable booths and a separate bar area with plenty of seating along with live entertainment.  Since we made reservations we were promptly seated and our server introduced himself and told us the daily specials and provided a breadbasket that included pretzel &sourdough bread along with warm butter. Since we had dined at MRKT previously we were already prepared to order: for my birthday dinner I opted for the chilled seafood platter as my entrée while my Hubby selected a bone-in steak along with a baked potato and mac & cheese with bacon. Seeing that my Hubby prefers his steak well done we knew it was going to take a bit longer to cook but our server still checked in with us and made sure our drinks were refilled. We also had fun eyeing what other patrons had ordered and I must say the crab cakes looked delicious! We had bypassed appetizers as most of them were some sort of seafood which my Hubby doesn't eat and the non-seafood options just didn't appeal to him. When our meals arrived everything looked delicious. My seafood tasted fresh and not frozen and our server had brought me raw horseradish upon request. I did overindulge in the mac & cheese with bacon but that's kind of expected.  Although my Hubby's steak looked well-done, after eating the outer portion of the steak the inner part was medium rare much to his dismay. Since we had other plans for the evening he muscled through it. After dinner our server brought over the dessert cart and much to our delight I was offered a free birthday dessert. Everything looked enticing but I opted for the strawberry cheesecake 'to go' as we were both very satiated. So with the exception of the under cooked steak and lack of non-seafood appetizers it was a very nice romantic dinner."}
{"text":"I took My Girlfriend here last week and was very happy with the whole experience. We started off at the bar getting 2 drinks, since we had to wait for a seat (about 10 min) at which time the hostess came over and politely lead us to our seats.  We started with the calamari appetizer ($9), which was very good if not a rather large portion; they also fry up sweet potato strips that come mixed in with the calamari. The calamari had a nice texture, good flavor and was not overcooked or chewy.   I ordered the herb crusted prime rib ($24) and a baked potato ($6) and I have to say I really enjoyed the prime rib. It came hot and med rare just as I ordered it. It was tender and I loved the herb crust, it is a nice difference from the general pepper crusted prime ribs you generally find around town. The baked potato was not the best it looks and tasted like it had been sitting around for a while.  My Girlfriend ordered the bone in New York ($34) and mashed potatoes ($6) and We were both floored by the flavor of that steak. It had great grill marks, had great flavor, was a thick cut, and seasoned properly. It also came medium just as she ordered it.  (I will be ordering this next time lol) the mashed potatoes are really nice and I would call them garlic mashed potatoes since they have it in them but its not to strong.   She also ordered a glass of wine which was nice and I had a few beers myself, which went well to compliment and stand up to the intense flavors of our meal. We finished off with a cappuccino for each of us.  The wait staff was very friendly; always close enough to check on us without being in the way. I ended up tipping the server $20+ since he was probably the best server I have had in some time and it went along with the bill ;)  If you have the inclination to try MRKT Sea & Land, I would recommend you do. I know I will be revisiting this place myself."}
{"text":"MRKT is a solid option for breakfast. The pricing is quite affordable. The pancakes I ordered tasted way better than your average Denny's.   They also offer dishes like steak and chicken fried steak. They all had pretty decent quality while the staff delivered excellent service."}
{"text":"MRKT is a nice quiet off strip option if you are looking for a quality meal. The prices are fair and the steak was phenomenal. I had the porterhouse that was cooked perfect to my medium request. Aliante is an easy property to get in and out of. If you are up north...it's a nice option!"}
{"text":"I have visited this place a few times since it has been open and for the most part I like the ambiance and food.  Dinning room service is a bit lacking for a Las Vegas Steakhouse but not horribly bad.  Had a great server there that we followed from Austins but alas he has moved on to greater things.  I would definitely recommend forgoing the dinning room and just pull up a seat at the bar.  You get the same great food and drinks but in a more relaxed environment.  The bonus is you are served by some top notch bartenders.  They pour a mean martini...  As far as food, the Prime Rib is so so, but the Filet and Ribeye are superb.  The creamed corn and the spinach and cheese tomato are their best sides.  And the seafood is not half bad, $50 for a lobster tail is a good deal for a steakhouse."}
{"text":"Amazing. I would have never guessed this place would be this nice and decadent inside Aliante Casino. To start the bread alone was amazing. We ordered the special, Australian lobster tail and Filet mignon with asparagus and mashed potatoes. Just walking in I was taken back by the decor and friendly and professional demeanor of the staff. Dinner for two with 1 alcoholic drink was $145. Id go back all the time if I could afford to. Live music was a plus."}
{"text":"Have eaten Here several times.. Always excellent. Like some doses better than others - poke appetizer is large and the best I've ever had. Seared tuna is also wonderful. Baked beans...no so. Service is \"over the top\"...thank you Will !. We will continue to eat here and highly recommend it to others."}
{"text":"My wife and i went for valentines on feb 13 so we probably missed the crowds. beautiful decor throughout the casino and restaurant.  i had prime rib, grilled asparagus with chopped bleu salad, all were excellent. she had petit filet, au gratin potatoes and french onion soup. these were even better. service was excellent without being \"hover- y\". erica responded promptly to every request and eric the mgr came by several times. i highly recommend this restaurant. i would give it five stars but the \"muzak\" belongs in a food court full of 14 year olds."}
{"text":"Absolutely atrocious service! Had a reservation for 9:15pm. Sat at 9:30pm. Waiter didn't ask for drink order for 20 minutes. Then cam back after we were sat 45 minutes and asked if we wanted appetizers. While eating them he said we needed to hurry since the kitchen would be closing soon. The couple next to us complained of the same issues. The 3 stars are for the food. Very good. Go if you're ok with a 3 hour dining experience."}
{"text":"So  I gave this place another shot since it's changed hands from Station Casinos to an independent owner/investment group.  The bar was was well stocked with patrons on a Wednesday night but the restaurant was really dead.  I thought we would be lucky to get in without a reservation but it was like a ghost town in the back.  The decor hasn't been changed but the menu and steak supplier has.        So as dead as this place was the service was still sketchy.  The hostess was nice but I don't understand the skimpy clothes, when she walked away I saw bottom biscuits.  I mean come on, I was with my family.  When we told our server we didn't need the wine menu they must have heard we didn't want anything to drink at all.  Beverages requests were taken after our food orders.  I was charged for a side I never received too.      The bread was the same as before but it was obviously old.  Seems like they changed the type of cheese in the mac and cheese too.  I kept meaning to ask if it was goat cheese, the whole thing just tasted kind of off.  I had the prime rib, hubs had the fillet mignon.  Good but not crave worthy.  Kind of boring with just a slab of meat seeing that the mac and cheese was not going to be eaten and the potatoes got lost in translation.  At least the Caesar salad was good and they were nice enough to split it up for us to share.  Took a good fifteen minutes to get my card back, and I was just happy to leave."}
{"text":"While staying at Aliante Hotel my brother and I came to this restaurant and we had a delicious meal! He ordered the steak and I had the steak and lobster deal with us sharing potatoes and brussel sprouts! Delish! Now that I'm living here will go back there soon!"}
{"text":"Overall ambiance great, value great, service great and food great. My only disappointment was that the creme Brule dessert was really thin. I love bread and they didn't disappoint. Great pretzel bread. Will definitely go back."}
{"text":"Food is always bland with no taste.  Good steaks though just not seasoned well.  Nice atmosphere.  I've ate here several times and the food is average for the high prices."}
{"text":"We decided to plan a family Birthday here, made reservations with their great online system. Our group of 5 and were seated promptly at a good table. Only 6 other tables, so we were expecting the best. Nope.  Server was great and first off we ordered a round of shots for the Birthday boy, this took 10 minutes. No biggie. She finally came back and we ordered appetizers, Seafood platter and 2 Roast Beet Salads.  This seemed to take forever again. Finally after 40 minutes she returned and took dinner orders.  More bread baskets, more drinks, no bus service, dirty dishes stacking up.  After 1 hour and 40 minutes, meals finally came out, 2 of were plated wrong, watched as the server removed a Lobster Tail off one plate and relocate to another. After the confusion of trying to convince the food runners who ordered what, we were set.  I ordered the French Onion soup, was very good. Also had the Filet, which was good too. Wifey had the Prime Rib and hers was good as well. Our friend had the Petit Lobster tail. It was cooked down to mush. Sent back. Our Son had the Surf n Turf. Steak was good, jumbo Lobster Tail was raw in the middle, sent back. Another 15 minutes, they brought back the Lobsters, the small one was perfectly cooked, Jumbo was of course still raw and cold in the center...we were running on 2 hours by this time and he just ate the cooked parts.  The Manager made an apology and comped the Lobsters. So felt a little better. But if I'm dropping 500 bucks for dinner, kinda hoping for just a little better then Outback Steakhouse and Glacier slow service.  Won't be back."}
{"text":"The service was okay, however, the food and presentation was superb. I ordered the MRKT app platter.  Presentation means everything and this lived up to expectations. I was full, but had to try the Ciopinni. Flavorful hearty and lots of fresh meat of every type. Could not finish it all, so they packed it up in spill-proof containers. While dining we were pleasantly entertained by a guitarist\singer who made the meal even more enjoyable. Great restaurant in North Las Vegas."}
{"text":"Do not waste your money at this place , 3rd time giving it a chance cause it is close to the house  and every time they over cook my fillet , why call it a steak house when cooking a fillet med means well done .. Went there last nite they over cooked the fillet ,brought a bottle of wine for 120 , me n my wife both got the fillets , got appetizer in for 230 dollars , you think the mgr would have came over and said sorry or something , no nothing just had the waiter say that they were gonna take my fillet off .. So with that said bill was 209 dollars and I guess mgr doesnt care about customer service nor how the food is prepared... I will drive to get a nice meal for those prices at flemings...."}
{"text":"This restaurant has a lot of potential. The times I have come here the hostesses were rude. Told us there was a 40 minute wait even though I could see a bunch of empty tables! what is the deal with that? The place looks very nice and well decorated. The menu has a lot of good food on it but when the food comes out to you, you will notice it lacks in taste. Like I said nice place but it could use some work..."}
{"text":"My wife and I eat here all the time. The service is excellent (we always request Mike). The food is really good. The prices are about what you would expect for this type of restaurant. It usually isn't that busy on week days so getting a table is not a problem. If you're ever on the north side of town and craving a steak give them a try."}
{"text":"Great restaurant!!!! The food is amazing and the service is excellent. I recommend the steak and lobster Mac and cheese. The decor and atmosphere is very relaxing and classy. I highly recommend this restaurant for a nice date night."}
{"text":"I gave this 4 stars for the service.... The food... A bit on the bland side... We asked the waiter for extra cocktail sauce n he ended up ordering another appetizer lol... But hey it's my birthday I'm not gonna let this ruin my day :) overall great service!!!! But so so food :)"}
{"text":"My husband and I celebrated his Birthday here.  We had the prime rib special.  The waiter brought us the rib-eye sauce to go with it  It was delicious.  The spinach and cheese tomatoes were very average. I had the crab cake which was very good and fresh with a lovely sauce.  We had the blue nut salad and scallops potatoes as well and both were very good. For dessert we got the bananas foster and the chocolate lava cake. The bananas foster was awesome, but the lava cake was dry and we would not order it again.    Our booth was lovely, but we felt the music was too loud and not appropriate for the romantic atmosphere. It was top 40 pop ( which I love), but not for a romantic dinner.    Also, my husband's birthday was not acknowledged and I told them about it twice when I I made the reservation and when I confirmed it.   Our service was wonderful in the beginning, but as the restaurant got busier, our service wained and we sat for over 30 minutes once we finished our dessert.  Overall we really enjoyed our experience and would return again.  The 2 for 1 specials are a great deal as are the half price martinis."}
{"text":"Decided to come to MRKT in the Aliante casino cause of $25.00 off any meal coupon I received in the mail. I I really enjoyed the Prime Rib 16oz. Its a great substitute for Lawry's prime rib and I plan on coming back cause its the closest place by my house for good prime rib."}
{"text":"This is the second time we've visited here.  The first time I ordered the Filet 10oz and the Lobster 12 oz. Man ordered the prime rib. Sides are seperate and we ordered mashed potatoes and asparagus. Everything was delicious. So amazing, so we made it a point to want to visit again. We did tonight.   This time we were seated in the front half where there was a bit more people and less quiet. Kind of preferred the private ambiance of the back area, but this was alright. Waiter was polite, got our drinks immediately and was patient while we decided which foods we were going to try this time. Ended up on settling on having the lobster and Filet again, but sharing.... Maybe.   My lobster wasn't as buttery as the last time but it was still pretty good; side of butter was slightly bitter but the lemon was fresh. Filet was absolutely on point. I would suggest that to anyone and everyone. Mashed potatoes because we like starches.   Our drinks never made it to half way empty, Waiter kept them full and was very polite. If I wasn't moving away, and made of money, I'd visit more often. =)"}
{"text":"Been here to MRKT a couple of times, great steaks and sides. Service is missing just a notch more of attention to guests. We were here near closing, and side work was being done in dining room and nearby, did not feel welcomed. Don't sit people if you want to close.  Nice room, and bar.  Problem is guests in tshirts and flip-flops takes away from a semi-classier experience."}
{"text":"Great service but the food was standard casino steakhouse. Heavy on fat and salt and not very imaginative. We had a great evening with my nephew though and really enjoyed our waiter."}
{"text":"I really enjoyed my meal there. The food was excellent and the atmosphere inside the restaurant is great. The only bad part is that you have to walk through the casino which reeks of smoke."}
{"text":"Good place. We had scallops and a bone in New York steak, creamed corn and twice baked potato. Large side portions. Steak and seafood were delicious.  Good atmosphere. Wait staff was attentive.  Chocolate Gonosh dessert was ok. Coffee was very good."}
{"text":"Had a great meal. Nice to have a reasonably priced meal that tastes amazing. Wish we would have realized this steak restaurant so so good. Plus the $25 coupon makes it even better."}
{"text":"I'm finally pleased that my boyfriend and I could finally get out and dress up for a night and not only have an amazing meal, but fantastic service. Thanks Lynn, you kicked ass when we could see how busy you were.   We started with calamari, MUST TRY,  then the chopped salad with no bleu cheese. Then for our main, we both ordered a 7oz filet and shared lobster mac n cheese, and cauliflower. The entire meal was to die for. The steak was cooked perfectly to MR and we were stuffed.   But not stuffed too bad after seeing the dessert cart because we ordered the fresh berries and a cheesecake to go!!   Thank you Lynn and thanks Aliante casino for having such a great steakhouse that we can go to that is less than 4 miles away! :)  See you again, soon."}
{"text":"Break basket was really good.  Steak was meh.  My girlfriend didn't like her beer and when she asked if she could have a glass of wine instead our server seemed as if she would faint.  Was a fine experience.  I probably wouldn't eat here again though."}
{"text":"What a nice surprise to see such a beautiful restaurant, with a more than capable staff. I took photos of the menus to give a glance of all your options.. Which are many. I always order the lobster bisque, if a restaurant offers it, it's my favorite thing to try. Unfortunately, this particular recipe tasted like it had a gravy base. That being said, it was the color of brown gravy. So psychosomatic, or not, tasted like gravy.  We were very excited for the marrow they serve. It sounded amazing. For the size of the bone, we used a fork for clams... It was delicious, but not worth the price. There isn't nearly enough marrow for anyone... especially to share. They do serve you a delicious assortment of breads, which include am interesting pretzel option. The waiter was very helpful with the wine selection, as I do enjoy Moscatos. He introduced me to a red moscato that was divine. I ordered the special of lobster tail and filet and it was amazing. The lobster and cut of meat were perfectly portioned for me and I thought it was mouth watering as is. The prime rib was cooked exactly as asked, and was also an explosion of greatness in your mouth. We ordered the brussel sprouts, which I heard were very good. The twice baked potato looked better than it was. It was actually a twice baked potato on top of a baked potato. So when I ate the top I was left with a whole potato with no toppings.. The service was wonderful, and they have a delightful area outside you can ajourn to. It was great, but it wasn't bad."}
{"text":"The steaks here are excellent!!!  I have been going here for a few years for dinner.  The bone in ribeye and the filet have great flavor.  The appetizers and sides are great too.  Michael is an excellent server and the rest the staff a great job too. Enjoy!!!!!"}
{"text":"I was very disappointed with my experience at MRKT, to begin we saw that there was not many people there for a Friday night this was great, we were expecting to get the food out quick, after waiting 15 mins from being sat down by the hostess the waiter came to the table he was very kind and I ordered the Calamari and a friend ordered the chopped salad, it literally took 45 minutes to receive our APPETIZERS, since we were very upset seeing as how there weren't more than 5 other tables spread throughout the whole restaurant, we ate and immediately I knew something was wrong with the calamari, it was severely undercooked I had no choice but to send it back but I became very Ill, I took the prime rib home and got the check. I ended up spending the night in the ER with horrible food poisoning overall terrible experience."}
{"text":"Service excellent.  Food is below average, mostly due to very inconsistent meat temperatures.  When you pay these prices for steaks, you have an expectation of accurate meat temps.  The sauce that goes with the ribeye is fantastic."}
{"text":"Who's the live entertainer??? 5 stars for this guy! My hubby and I enjoyed some great drinks and appetizers with his beautiful LIVE music... hopefully management realizes he's a keeper!!! It's 7.14.17 and this guy needs to stay here! He's a fill in... what?"}
{"text":"Terrible. Monday night, sloooow service, had to ask that both courses be served due to 30 min wait. All Food was completely under seasoned, broccoli was under cooked, Mac and cheese was cold.  Server apologized but failed to improve service after admitted fault."}
{"text":"Good food and plenty of it. Their lunch special is priced under $5 bucks and the soups are really good."}
{"text":"Awesome filet minon and awesome bone marrow w/ bacon jam. Also had the Mr. Daniels whiskey flight."}
{"text":"We visited MRKT on a Tues night for Restaurant Week and the experience was great, except for one incident.  Our party of 5 ordered apps and then the special set menu.  The apps were great, the shrimp huge, the lobster bisque was tasty and the Caesars salads well prepared (although a bit small).  The steak and lobster was great, however, the lobster was flattened and fried, which was unusual and that was not depicted on the restaurant week menu.  The service was outstanding, drink refills were prompt and the waiter was very professional.  The incident occurred during dessert; halfway through a berry bowl, my wife noticed that a blackberry was moldy, not good.  That is where they lost the 5th star, need to be more careful."}
{"text":"As usual, the steak is amazing! I typically order the bone in ribeye with the imperial style sauce. Again, amazing. My husband and I have been coming here for special occasions for the past 3 years. MRKT never disappoints. To add, Jose was the best waiter we've ever encountered. What a fantastic way to start the New Year! Thank you."}
{"text":"Fantastic meal. Steak may have been the best I've ever had. Great atmosphere.Superb dining.Affordable for the quality."}
{"text":"Went here for my husband's and was very impressed! Started with a Southern Peach Iced Tea. Strong and delicious! I got the 16 oz New York and he got the 7oz filet mug on AND the 1/2 lb king crab. Then we finished with a creme brûlée and chocolate mousse cake. Everything was absolutely incredible, as was our service! Shout out to our server Derek! Prompt, kind, awesome suggestions. Free birthday dessert too, which we didn't know! :) so that's even better. After the free dessert, all of our food etc AND tip included, we left paying $130. Totally less than I thought it'd be! The environment is beautiful and classy. Steak was perfectly cooked. Will return!! OH AND GET THE GARLIC CILANTRO SAUCE WITH YOUR STEAK. You'll thank me later."}
{"text":"I really love this place and will miss it now that I have moved.  The staff is always very polite and helpful.  I have never left there complaining about the food or service.  Breads are great, wines excellent, and mixed drinks strong.  The prime rib is out of this world and all degrees of doneness seem to be available always.  I'm not a fan of a la cart menus but the food and service make it worth going.  Be prepared to spend some money here though."}
{"text":"I really enjoyed Tony and Christalyn. Their attitudes, service, and spectacular uniforms. They handled rude customers with amazing grace and served all with a smile and getting. They made our visit, as usual, a great time. We missed Erica and small handed Dev. You guys always Rock!"}
{"text":"i've been a few times and it's really hit or miss.  The ambiance and food can be great, but the service is always pretty iffy.  And the time that they \"accidentally\" threw away about $200 worth of leftovers and only gave us one tiny steak to take home as an apology was pretty insulting.  It's too bad - could be a great spot if they could ever get it together."}
{"text":"They're computers were down last Friday evening when we dined. But they managed to continue service flawlessly. The scallops were terrific as well as the braised short ribs. Service was top notch, definitely will return."}
{"text":"Beautiful restaurant, good service, and really good food. The complimentary bread basket has some DELICIOUS pretzel bread and very yummy raisin-nut bread in it. We had calamari, that was really good. And (on our first visit) we stuck to steaks, which were perfectly cooked and quite tasty. They had live music (on our second visit) performed by Dave Ritz, and he did some cool songs, with some mash-ups, guitar & piano playing. Thoroughly enjoyable."}
{"text":"We have eaten here many times in the. Past and it has and still is a great place for steaks, seafood and wine!  Highly recommended!"}
{"text":"It Fathers Day and EDC weekend madness on the strip so we decided to settle for a steakhouse closer to our area. We all had a long week and failed to make reservations so we decided to just walk in as the Cavaliers aka Lebron won the NBA finals. The hostess was very polite and accommodating. It's Ramadan for us so everyone was fasting and our server Gabriel took that into account as we placed our order. Sunset was at 8:02 so his timing from serving the appetizers to main entrees was impeccable! We did the whole 3 course meal. The shrimp cocktail, beef carpaccio and ahi tuna something was fresh and tasty! The steaks and fish entrees were very filling and tasteful! The garlic steak sauce was my favorite between the red wine and chimichurri  sauce. The Lobster Mac & Cheese was my favorite!!!! My mouth waters as I'm writing this. Jk, kinda maybe so. The Cheesecake is out of this world and the Crème brûlée was world of this universe. Okay your probably thinking this girl was fasting so of course everything was 5 out of 5 but hunger aside it was one of the best meals my family and I have had at a steakhouse. The ambiance was nice and quiet and they were too busy so it was a really nice dinner with amazing service. The servers checked on us often and the pricing was still steak house pricing but worth every penny! If your celebrating something special or would just like to have a nice quiet delicious dinner than check this spot out! (:"}
{"text":"Went in here for a nice dinner last night. Lovely ambiance!   Ricky, our waiter, was AMAZING (he deserves a raise!).  His interaction with us was friendly and honest, never trying to talk us into anything and making wonderful recommendations!   Our food was fantastic!  Ricky even checked the entire property for a brandy my husband likes.  We WILL be back!"}
{"text":"My favorite place, Joe the GM is hands down the best in the business. The food is awesome , the coffee rub rib eye is awesome.  I would 5 star recommend this place 100%"}
{"text":"This was my second time at Market and Sea. Both times, I had, I had a wonderful time. The food is great, but everything on the menu is served a la cart, which can become quite expensive. This is not a cheap restaurant, so please come prepared to spend at least $100. But overall this is a great restaurant!"}
{"text":"Great restaurant in the northern side of North Las Vegas.  It's located on the NW side of Aliante Casino and Hotel.  There is always plenty of parking.  The entire establishment was built for locals and visitors to larger events in the northern side of the Valley.    MRKT is a nice clean establishment and really for the higher end visitors.  They have a variety of drink selections from wines, liquor and beers.  Their menu has a variety of selections.  If you order an entrée, it won't come with a side so you have to pay extra ($7-$10).  I had the New York Steak ($34) with grilled asparagus ($8) with raspberry ice tea ($3) while my son had the Shrimp Scampi ($25) with loaded mashed potatoes ($9) with raspberry ice tea ($3).  We were seated immediately in the main dining room.  Our waitress was Lynn and she was very pleasant plus attentive.    The food came out about 25-30 minutes after our order was taken.  When it to our table, everything on the plates were at the right temperature and seasoned well.    Overall, I would recommend this restaurant.  It is a great place to have a business or family meals.  Yes, it is pricey, but the portions are very large.  I think next time an appetizer with a side would probably do the trick."}
{"text":"My husband and I were on the prowl for a nice place to eat, and we literally stumbled upon MRKT, which is located in the Aliante Casino in North Las Vegas.  We were extremely impressed with the service, everyone was very nice. Prices were very reasonable considering the upscale atmosphere of the restaurant. Our server was nice and answered all of our questions about the different offerings.  The food was great, cooked exactly to order.   With all of the amazing restaurants in Las Vegas, this one definitely held it's own against all of the competition. We'll be back!"}
{"text":"The food was pretty good. For the price though I would've expected spectacular food, but unfortunately it fell a little bit short there. The lobster macaroni was a decent side to get and I would recommend it. The oysters were very mediocre at best. Overall the steaks that we all had were cooked almost perfectly, and that helped bring up the overall satisfaction of the night."}
{"text":"Randy was a great server! The prime rib was awesome and the calamari was delicious. I loved the truffle fries I didn't love the mac and chesse. My only complaint was it was pricey  $25 for the prime rib and add $ 7-8 for a side dish. The atmosphere is beautiful."}
{"text":"I saw the menu and really wanted to give it a try. The bar had some individuals there but the back was kind of empty. Although it did full up later. Lynn was our waitress and she was more than pleasant. Very attentive and just very sweet and helpful. Everything that was ordered was applauded. I had the surf and turf. I will be back for sure. Give it a whirl, they won't let you down."}
{"text":"The Patio for lunch. We ordered all 5 appetizers (pictured) and were very pleased with the variety of flavors & dishes. Presentation was nice. I ordered the steak & fries for lunch that was surprisingly served with a ton of red wine sauce on top that was nowhere mentioned on the menu. The menus printing needs to be updated. You can't just surprise a customer with a sauce drenching their steak without their knowledge. My friends lobster roll was served in between a sliced open piece of toast bread. She was disappointed in the lack of \"authentic lobster roll\" like mentioned on the menu. Chef explained that the bread company sent the wrong bread that week so that was the reasoning for the toast. Overall the service was actually very great. Our waiter took our orders and was very patient with us. As well as the other waiter who refilled our drinks constantly which was great because it was warm outside. Front of house did an excellent job. Very pleasant experience with slight surprises but nothing to be upset about to the point of never returning. Look forward to the next visit."}
{"text":"Sat with my wife for 30 minutes without drinks. Menu looks good and while expensive, it wasn't unreasonable. 2 other patrons stormed out while we waited... there were maybe 4 tables seated. Walked out. No wonder why it was empty."}
{"text":"The atmosphere is terrific, the food not so good. My prime rib was barely warm and very chewy. The filet mignon was not much better. Both the baked and twice baked potatoes were not cooked enough. We expected so much more for the prices that were charged."}
{"text":"Its not a 5 star steakhouse but a solid 4-4.5. Good professional service, the waiters definitely take pride in their jobs. The bone marrow was excellent, steak well prepared. The whiskey sampler was well priced and welcome. Would definitely come back, and would recommend others to come. Its the surprise steakhouse on this side of town"}
{"text":"We had our wedding reception at MRKT and could not have had a better time! Mike McTigue, the General Manager, was so easy to work with, and he and his staff went above and beyond to make all of our guests feel like VIPs. Chef Ray Mansour provided an amazing, creative, and delicious spread, and offered much-appreciated personal attention throughout the evening. Would rate 6 stars if Yelp would let me!"}
{"text":"This place is a hit or miss establishment. Once we had the best Shrimp Scampi but tonight this place was way off their mark. I ordered a chopped salad and Lobster Mac n Cheese. The salad had way too much dressing but the Mac n Cheese was a total bust. It must had been under the heat lamp for an extended period of time. The macaroni on the top was hard and dry and to be honest, Not very good. I will never order that dish again. The chopped salad i ordered should have come with Thousand island dressing but was served late into the meal and was not what i had asked for. The Server was not very inattentive in what i said \"the mac n Cheese is not very good\" but i should have called for the Manager. In short. Not a good meal for the price."}
{"text":"This place is by far one of the best restaurants close by for locals and tourists. Located close to the front entrance of Aliante Casino this, fine restaurant would be a mistake to past up. The bread basket alone was a great way to start up the savory meal. I had to go with the ribeye with two sides mash potatoes, and macaroni and cheese. Both sides delicious and went excellent with the steak. Great server, peaceful environment & most importantly great eats"}
{"text":"This was my third, and last time to MRKT. The food was great as usual, the problem was with our waiter. It was apparent he was lacking in training. He didn't know the menu (my MiL has a garlic/onion allergy), didn't solicit for drinks, forgot to mention half the specials, and talked more like he was hanging out with his friends. Don't get me wrong, he seemed a really nice guy and he was attentive, but if I'm going to drop $150 on a steak dinner, I'd rather have a professional waitperson instead of someone who acts like they're working at Denny's. And when I went to talk to the manager, they didn't have one on duty. Seems odd to me that a high end restaurant that's only open 6 hours a day doesn't have a manager on duty, but maybe that's normal."}
{"text":"We had our Anniversary dinner tonight here and wasn't too impressed. I took the waiters recommendation and went for the stuffed lobster and Filet Mignon special.  It was too salty and for the price of $38.00, compared to the regular Early Bird Special, it wasn't worth the try I should have ordered what we actually went there for. $25.00 Steak & Lobster and Prime Rib for $18.00.  The prime Rib was awesome hubby stated."}
{"text":"Phenomenal!  Great choices of whiskey and beer! Beautiful women with awesome attitude and very professional. Will come back again and again...."}
{"text":"The food was delicious. We had the scallops. They were just scallops with some sauce on the side but these scallops were just delicious by themselves. The buffalo shrimps were the winner of the night though. These scrimps were covered in really good buffalo hot sauce that I can still taste them until this day. The drinks were a little light but throughout the night they kept getting stronger. I guess the staff notice that I was still sober after drinking that much. The lady that was singing and playing the music was just awesome. She played so good I couldn't get her voice out of my head because she sang so beautiful and she had an awesome attitude. There was three older guys who kept trying to speak over her so that wasn't pleasant for me or anyone else as I could see the crowd looking at these numskulls. They kept trying to hit on the poor bartender but good thing they left right away after I got there because they were definitely ruining the ambiance."}
{"text":"We came here on a weeknight and we had to sit at the bar. The place wasn't packed but it was booked, and that was why we had to sit at the bar. The bar attendants weren't as good as a waiter or waitress. It took them forever to take our orders so, we had their manager who happened to be there took our order instead. The service was slow and not as good as I would expect at a place like MRKT, but my 16oz Prime Rib was very good."}
{"text":"I have visited this restaurant three times and sat at the bar. I ordered the steak and fries twice during happy hour and it was delicious. I ordered the ribs once and they were no to my liking. Great atmosphere and great happy hour prices. I would have given this restaurant a 4 or 5 star but the service at the bar is ridiculously slow. I have been there with a few people and I have been there with the bar full and it takes forever for someone to ask what I need. Once you get a drink it takes forever to place your order and forget about placing something immediately. The bar staff is nice but slow and not very attentive to me. I could easily make this a regular restaurant that I frequent but not with slow responses from staff. Great place but not quick enough for me."}
{"text":"My family and I frequent this place every other month.  Food is scrumptious and server, Mo adds to the greatness of our dinners.  Mo is extremely attentive and restores ones hope for fantastic customer service.  We started out having Ahi tuna poke and shrimp cocktails for our appetizers, which were both phenomenal.  My husband had the porter house and I had the lobster stuffed with crab.  Sides were sautéed spinach, mushrooms and brussel sprouts. For dessert, we had bread pudding and chocolate cake; YUMMY!!"}
{"text":"Great place for steak. You feel very comfortable from the moment you walk in the door!  The shrimp cocktail is the best ever! The shrimp are crisp and so fresh, and the sauce is amazing!  I wasn't fond of the chopped salad, but that's because I think it was chopped very fine in a food processor and I wasn't expecting that, but that's just me.  The pretzel bread sticks are the bomb!"}
{"text":"We come here at least once a month for their delicious RIB EYE steak! The sauce that comes with it is simply to die for!! The service is excellent and their drink menu is exceptional!"}
{"text":"This is our second time here in recent months. The pretzels in the bread basket are to die for  I ordered the scallops and both times there were AMAZING! The hubby and son both had rave reviews on the NY steak. Everything is a la carte, but the sides are big enough to share."}
{"text":"First time eating at MRKT, and had a beautiful dinner. Me and my boyfriend had the early bird special which was the prime rib that came with green beans, and mashed potatoes for $18.00 . Also loved the free warm table bread which was a roll and pretzel bread everything was delicious. Beautiful restaurant great happy hour, and great service. We were served by the bartender I forget her name but she made sure our glasses were never empty, and if we enjoyed everything. We will definitely come back."}
{"text":"The ambience is upper class and fancy, and the customer service when a friend and myself went was excellent. We really enjoyed ourselves, especially with their selection of many wines.   Why the two stars then?  The food honestly doesn't match what the restaurant is supposed to be. I ordered the salmon, veggies, and mashed potatoes, and the meal was something akin to what I could be having at Applebee's or Outback Steakhouse. Their menu seemed bland and typical. It wasn't like the food tasted horrible, but it was mediocre to the atmosphere. Our bill was well over $100, and felt like I could have gotten a much cheaper dinner (and identical meals) at the two restaurants listed above.   I was expecting much more than what was experienced, especially in a place that's supposedly elegant dining. Hopefully in the future they add more unique, different items to their menu. I do have to note though their wine list is worth glancing over."}
{"text":"The MRKT inside the Aliante was very refreshing.My wife and I had been searching for a good steak and seafood place for a while. Our search is finally over the MRKT had every thing we wanted and more.When we first walked in we were greeted by a wonderful hostess and seated immediately.Our server was Gabriel he was very nice and helpful and very attentive to our needs.The ambiance was very subtle and relaxing .To start off we don't drink alcohol so Gabriel suggested an awesome virgin drink that we could enjoy.they started us off with pretzel bread sticks and warm sourdough with butter which were great. They kept them coming until we were ready to order. When we were ready to order I ordered the 10-ounce filet mignon king crab oscar style and my wife ordered the bacon mac and cheese and the onion soup. While we were waiting for our food they kept our drinks coming and Gabriel kept us notified on how long until our meal was ready. When are meals came out to us they had a great presentation. Words can't describe how good my steak was and my wife is very satisfied with the onion soup and mac and cheese. When it was time to leave Gabriel took care of our food to go. We were so impressed that we will definitely be going back."}
{"text":"Second up for me during Restaurant Week was MRKT Sea & Land.  Here, in a cavernous and contemporary woodsy and flame-accented dining room situated inside the Aliante Casino & Hotel, we were presented with excellent Pretzel Bread and soft butter.  Then I enjoyed a very fine French Onion Soup with nicely melted Gruyere and Swiss Cheeses, followed by a serviceable Caesar Salad with fresh Romaine leaves.  For my main I enjoyed a 5-ounce medium-rare Filet and a fairly sweet 5-ounce Lobster Tail.  This RW special was accompanied by moist but thankfully not runny Sauteed Spinach and creamy Mashed Potatoes.  Service was good, except a friend did not receive his requested steak sauce until a second request was placed.    For included dessert, I selected a good-sized slice of N.Y. Cheesecake that had been flown in from Junior's in NYC.  It was a decadent ending to a superior, very reasonably priced meal, for a good cause.  xxxx-1/2 overall!"}
{"text":"Best lobster I have ever had, large and actually grilled a bit and yet still moist and tender with a tiny bit of crunch on the ends but the flavor was spectacular. Their raisin bread and fresh pretzels were interesting too. Gorgeous decor, with tornado fires as a centerpiece. I had the whole place to myself on a Monday night, how wonderful. The music was very good, all my favorites, very young, not quite one would expect from such a nice formal restaurant. Service was good."}
{"text":"This restaurant is too overly priced and it isn't great.  Its A OK."}
{"text":"Never a bad meal here. I usually sit at the bar and the bartenders are always attentive no matter how busy they are.."}
{"text":"Me and my wife came here for a romantic date night and enjoyed all of our food. A plus was they had my favorite wine which I had to get a bottle of. Service was prompt and attentive although he let my wife pay for the check we enjoyed everything. I had the porter house which was so tender"}
{"text":"Amazing spot. My husband and I have ate here twice and had an amazing experience. Week nights are perfect as the restaurant is not crowded at all. If you love cozy booths, this is your spot! Perfect lighting and atmosphere, and good for a romantic night out or a casual dinner. We've ordered the porterhouse, Ribeye, shrimp Scampi and French onion soup. All amazing. The sides are def large enough to share. We never have room for desserts but they look phenomenal. We'll have to take pictures next time. We actually enjoyed our experience so much we stayed off our phones and actually talked the whole time lol."}
{"text":"Overall a good experience especially the attending staff. The scallops are absolutely amazing. Prime rib should have cuts with less fat and the martini's are amazing! All the bartenders are fantastic and provide an exceptional experience!"}
