{"text":"I called three days prior and asked if they needed reservations.  A young woman answered the phone and said they do not need reservations for under 5 people.  Upon arriving they asked for our reservation (3 people)  and said we could not get the tea service without one but still could get lunch.  When someone calls and asks a TEA HOUSE if they need a reservation its probably for the TEA service and the staff need to be able to communicate that to the caller or at least ask what they are wanting.  The wait staff didn't wait on us, but the buss boy did and he was great.  The food was just average.  Maybe the tea service food would be better, but alas we didn't have a reservation.  Very disappointed."}
{"text":"This place is overpriced and not worth the trip even though I live across the street.  I had the worst BLT Sandwich I've ever had.  The bacon was thick but with very little meat on it and mostly fat.  I pulled off half the fat and would not look at the rest of it.  I did not even leave the restaurant before I could feel the grease coming up on me.  My friend had lettuce on her sandwich that had a funny taste to it.  She had diarrhea when she returned home.  Service was very slow .  Not worth it.  Save your money and go someplace else.  If I could give this a minus star I would."}
{"text":"I would definitely recommend Ms. Thomas' Lovely Tea House to anyone.  Whether if your young or old, guy or girl, or just looking for somewhere new and different to eat. My experience at this tea house was pretty cool and I look forward to eating there again sometime. I went with my friend Brittney and my little brother to get some lunch. We felt welcome because of the way we were treated right away at the front entrance. Inside the tea house was overall very well designed and decorated, and set the mood. The hostess was very pretty and conveniently answered any immediate questions we had in mind. She handed us the menu which has a breakfast and lunch section, and take note that breakfast is not served all day. The server was very nice and welcoming as well and had superb timing when we needed something. When time came to order the server did not have us under the impression that we needed to hurry up and make a decision. After the server took our orders she left us in a relaxing impression and said our food would be out shortly. Shortly later our food did arrive in these really neat, fancy plates. It smelled really delicious and better yet actually tasted wonderful. I had ordered a chicken dish with greens and an option to have mashed potatoes or kettle chips; I went with the mashed potatoes! The chicken tasted amazing and the mashed potatoes tasted well-seasoned. I had a tough time choosing what I wanted to eat because everything sounded so tasty.   And the tea flavor list seemed endless with options, which was cool. I would recommend the Paris flavor tea to anyone. Overall I recommend this place for anyone to enjoy for themselves, for the guys out there it is a great place to take your girlfriend out on a nice date. Even if you are not on a date the service and the food is well worth it. They even have a bakery section in the tea house for all you out there who love pastries and things like that."}
