{"text":"I've been here for breakfast a number of times and always enjoy it.  It's typical diner-style breakfast food, comparable to Pamela's or DeLuca's but without the crowds and long lines.  The food is pretty good, and you get large portions for a relatively inexpensive price.  The staff are always friendly and personable, and they never rush you out the door.  I would definitely recommend it, I know I'll be back again."}
{"text":"Poor service, sub par food.  Small portion and place looks like it has not been cleaned since it opened.  My wife had to pour her own coffee.  Just don't."}
{"text":"Dive may be an understatement, but the breakfast soars. Huge portions, served quickly and piping hot. And prices consistent with the ambiance. Two blocks from the bike trail is a plus."}
{"text":"I hate to post anything negative,  but seriously, this place was one of the worst.  We weren't expecting top of the line anything,.but everything about this place was bad.  The place was pretty dirty, the coffee was like water, we waited close to an hour for our food (apparently the cook decided to leave for about 45 minutes), the waitress-owner was more interested in drinking beers with another set of customers (at 9:30 in the morning!!) than checking on us.  The food was beyond bad-oh'...and ice cold.  The waitress, the one time she came over, literally spilled.a good amount of coffee on our table and just walked back to her drinking buddies.  It was like getting a shitty breakfast in a local sub dive bar."}
{"text":"The spinach feta omelet was delicious!  I also enjoyed the season home fries, topped off with a cold beer!"}
{"text":"This diner is a hole in the wall location but the food is excellent.  They are open until 2pm each day and serve breakfast all day. There is plenty of parking right next to the restaurant."}
{"text":"The food was okay. They were out of home fries and my friend's hash browns were burnt. Oh and my breakfast wrap was served with potato chips.. We said nothing because we wanted to be away from the awful, racist, emotionless waitress ASAP.   A young Muslim woman wearing a hijab walked in to confirm an online order. The waitress responded rudely and the young woman walked outside to wait. The waitress then proceeded to TALK TRASH about the young woman's name to another customer. She also said that \"everyone here should be able to speak good English.\" I wonder how she would've treated me if she knew my name was Sevgi!! We heard everything she said and we wanted to leave but we were tired and didn't want to walk to another diner.   If you aren't white you might not want to eat here."}
{"text":"Ah, Mullin's. No not Mullen's, which is something I always have to clarify when someone asks if I want to meet them for lunch at one of these places while I'm at work.   This isn't the bar and grill located near PNC Park; it's a little diner that stands alone on a corner as you drive past the Warhol and continue towards the David McCullough Bridge. It's easy to miss or just drive on by, which is kind of a shame because this is a pretty nice spot to eat, I think. It can admittedly be a little offputting to walk in if you're not expecting their seating arrangement, which consists of a mix of booths, regular tables and fold-up tables (along with chairs that you're more likely to find in a school than a diner).   But food wise, this is definitely the place to go for cheap, greasy diner eats. They make breakfast as well as lunch, and I have to say their breakfasts look pretty good (three egg omelets with a side dish? Holy crap!). I've mostly ordered their sandwiches and burgers and thought they were pretty good overall. As long as you come in expecting diner food and nothing else, I think you'll like what you find!  A note - this place charges a fee for using a credit/debit card when you spend under $10, and their food is so cheap that you can spend less than $10 very easily. So bring cash!"}
{"text":"Heading back for another American breakfast. The service is great and the food screams home."}
{"text":"I wanted to like the place more. Cool location. But- Its small. Dark. Cold. Average price. Good portions. All the F bombs were a little much for children, but the waitress was friendly."}
{"text":"It's a true, local, family-style diner in the city. Don't expect Pamela's or DeLuca's in the strip. It's dive-y, but the portions are big, the service is friendly, and (at least for breakfast) the food is very good. The location is centralized so if you're looking for a good place to meet up with friends, they can hop right off 28 or the bridge from strip to get there. Saw Randy from Randyland there too one time. That was pretty cool. He was providing a good morning to everyone and the wait staff joined in. I like Mullin's. You will need to split or box the hangover special because it's a lot of food (very good though)."}
{"text":"Do not expect anything fancy! Expect a phenomenal breakfast. Us Irish are picky with our potatoes and these are some of the best home fries of my life! Huge portions, accurate picky order, reasonable prices, lots of parking, and great staff!  One of my new fav breakfast spots."}
{"text":"Off the beaten path but a delightful little hole in the wall place. Breakfast was huge and tasty. Eggs over easy almost perfect and the pancakes were quite good   Free parking and breakfast under $20 for two makes this an excellent value!"}
{"text":"Their sign says, and I quote, \"Mullins Diner,  OPEN ALL NIGHT, EVERY NIGHT!\" Those all-night every-night hours?? 7am to 2pm. I guess we have different definitions of ALL NIGHT, EVERY NIGHT, huh."}
{"text":"I would not recommend eating here. The breakfast food was fine, but nothing special. Overall it was a bad experience. I like divey places and am not picky but the service was terrible - basically non-existent.   Everyone in my party got their food besides my one friend, who got it about 5-10 minutes later. We saw her finished food on the counter but it took the waitress quite some time to actually bring it over. Also I should note we were the only people there - so they were not busy at the time. I got over-easy eggs, and one of them was completely raw (they did make me another one, and I switched out my plate).   Finally, one of the worst things, towards the end of this visit, two staff sat at a table and started smoking inside the restaurant! Once again, would not recommend going here."}
{"text":"My wife and I stopped here for breakfast since we had some business in the north side of Pittsburgh. The restaurant is an older building but it has its charm. It is one of those hole-in-the wall places that has excellent food. My wife had the Philly omelette and I had the corn beef hash with eggs. My hash was nice and crispy and my eggs were cooked perfectly. The menu said two eggs but I got lucky and was served three eggs. My wife's Philly omelette was huge with a generously portion of home fries and toast. The service was great, the staff was very friendly, and the endless coffee was good."}
{"text":"Absolute best breakfast on our trip!!! Blueberry chocolate chip pancakes! Great service and was right on the way to the ballpark to see the SF giants play Pittsburgh.   Real hometown Irish atmosphere in a great location."}
{"text":"We went to Mullins for breakfast on a day they were having a large party for a separate group so I think the staff were not sure how to handle the rest of the customers.  So we entered, the waitress made eye contact and did not say \"seat yourself\" or anything.  That was really just awkward.  A few minutes latter we just sat down.  Thankfully a fellow irishman who I assume owns the place saw that we had sat down and directed a waitress to take our order and he seemed to have to remind her to take care of our stuff.  I don't think they would have bothered otherwise so thats the -1 star. Maybe that's normal. Maybe its because they had a large group.  However, since we were taken care of the food came out quickly. Let me tell you it is worth it.  The food is cheap, hot good and plenty of it.  I mean this is the best breakfast I have had locally.  I got the \"big breakfast\" option.  Awesome.  Hot cakes, eggs, sausage all done just right.  and CHEAP. I mean I had a weeks worth of calories for two people for under 25 bucks with tip.  The decor is not shale we say nice or even matching and has an odd irish theme but serves no irish themed food.  Who care.  Just go get yourself a big plate of hash."}
{"text":"This is a good place to stop when you ride the bike trail.  The food was filling and really good.   They ran out of some things, but that's not a big deal to me.   It's not the cleanest. Plenty of parking room on the street."}
{"text":"They are a true mom and pop establishment,  the place that would not even come up on typical search ! You would know about from a local person,  that is exactly how I found about . I think it's good sometimes to go back to old times and ask people for recommendations instead of applications. It's a diner as it says on name , small , old and hid . I had a cheeseburger with fries , it was really good .  I am giving them four stars because they need to clean up the place and spend little money to make it look nicer , it would definitely bring more people . If you happen to be in the area you should check it out ."}
{"text":"For the last two years that I've lived in my house in Bellevue, and did my weekly shopping trip to the Strip, I have driven past this intersection before the 16th Street Bridge and saw the sign 'diner' pointing to a totally unassuming little building beyond the gravel lot to the right. I often thought that I'd like to try it 'maybe', but with my experiences with local diners, I've kind of been put off from even walking in the door, only to discover price gouging for lousy food. Most local 'diners' are either pretentious grease pits that yokels stand in line to drool over (Deluca's and Pamela's come to mind) or they've cut costs, portions, quality and raised prices and are really not much more than low-level Denny's or Ihops (Ritter's?)  But, by luck this morning, my friend and I decided...hungry...try!  Ok 'foodies', bow your heads in shame...because all I can say about this diner is...  THIS is what a diner is SUPPOSED to be!!! THIS is what this older UN-'trendy' classic guy remembers as a true DINER!   It is a very small hole in the wall, with a totally unimpressive 'atmosphere'. No kitsch, no sentimentalism for the old world diner. No phony nostalgia. It's a collection of tables and chairs, a small counter, and a kitchen window, with one TV on one wall. No frills.  Our waitress, Courtney was right there for us, and as friendly and 'diner' as could be. Pulled up a chair and sat right down with us to take our order. Coffee (which was actually pretty good. No foame-latte-latte-mocha-chino...it was black coffee in a solid white coffee mug. With a good dose of coffee in the coffee. Not water dressed in brown, but a nice smack of coffee)  The menu had a pretty decent variety of typical breakfast and lunch deals, combos, platters, eggs, pancakes, meats, etc. I chose the breakfast burger...1/2 lb ground beef patty, with bacon, egg, cheese, lettuce and tomato, and according to the menu, served on French Toast. The French Toast did not appeal to me so I asked Courtney if I could get it on a regular bun. She looked at me and frowned and shook her head sternly with a 'NO'. I gulped. Then she smiled and said 'Of course, I don't like it with the French Toast either!'  My friend ordered French Toast AS French Toast, with a side of sausage links and some hash browns. My burger was to come with chips, but I decided hash browns sounded better. Check.  The burger arrived and was actually ground beef formed into a patty, and NOT the Sysco truck frozen hockey puck patty. SCORE! They cooked it mostly to order (not as pink as I would like, but it did ooze juices when bitten into - SCORE again!) The hash browns were NOT frozen and out of a bag, but I could tell they were all real potato freshly shredded. SCORE again!  My friend's French Toast was very nice sized bread (not Texas toast, but not Wonderbread either), and were beautifully golden with a touch of brown. And when he bit into his sausage links he let out a rather orgasmic moan of goodness. He liked the hash browns, as did I, but I would ask for a little extra crispy next time.   Courtney kept our coffee topped off, was attentive without being a hounding drone, and very friendly.   So, while people are standing in lines just across one bridge for mediocrity with a bigger price tag, we both got a VERY filling and beautifully made meal, around regular folk in a very comfortable spot with a much smaller price tag. And we didn't have a Marvel comic book with flappy ear holes and a Ferdinand the bull nose ring serving up our food! SCORE again!  AND...we had no wait. BIG breakfasts for two, which we upgraded, with two very nice cups of Joe, $25.04.   So...you stand in line at Pamela's for...what exactly?  For those who like breakfast before or during your trip to the Strip, I highly recommend avoiding the hipsters and wandering zombie suburbanites, by ducking into Mullin's instead.  THIS is a diner...doing it right."}
{"text":"Terrible service. Our waitress took our order and immediately left the building. Half an hour later we went up to the cashier and asked about our orders, nothing had been put in.  Profusely apologizing for the service, we decided to give them another chance and opted for delivery. (Our office is a 5 minute walk from the diner). We tried to pay with a card and the manager did not know how to work the register, she even asked us to help walk her through it. One of us paid in cash and we agreed to pay the rest once the food arrived. 40 minutes later we called and asked about our order, we were rudely told that the deliverer had been there and was calling us, we did not leave a number for them in the first place. I really wanted for this experience to go well, especially since all the other reviews are good. But it's hard to have sympathy for a business when the manager does not know how to work the register or keep track of employees."}
{"text":"Awesome place. Have been having weekly breakfast with my daughter for 10 years now. Huge omelets, awesome coffee and one of the better cheese burgers around for that price range. I know every time I walk in that I will have a great meal."}
{"text":"Nice server and food came out pretty quickly. The place was not crowded. My daughter was happy with the oatmeal and I left quite stuffed from the hangover special."}
{"text":"Mullin's is a blue collar breakfast spot with a gritty and greasy charm. I fucking loved every minute of it."}
