{"text":"One word to describe this place: meh. Typical average Italian faire, nothing great, over priced. Staff are very friendly however."}
{"text":"The food was good, it is a step above most Italian restaurant in the West Island, and so is the price.  But it's worth sometime it I think.  They have private wine selection. We had a nice red from a small Italian producer that was very good for $55.  

Note of caution, Friday nights hosts a tenor that sings about anything.  He his very good but the place is not big enough for such loud entertainment.  You have almost no choice but to listen as it impossible to have a conversation around the table, and he is on for most of the evening.  I almost lost my voice by the end of the evening, shouting to  my friend sitting next to me.  I think the staff was also annoyed by the show and it was reflected in the somewhat slow and clunky service.  This nonetheless seemed to please some of the other guests, which danced and sang along.  Very much an \"older crowd\".

I probably will go back again but not on Friday"}
{"text":"So much wrong with this meal: 
1- we sat at our table for literally 22 minutes before anyone came to serve us
2- the service was generally sloppy the entire meal. They basically threw our bread on the table and half the bread was burnt. 
3- we had to octopus starter ($20) ands it was incredibly tiny. The octopus at Milos is a much larger (much more delicious) portion for a couple dollars more...total ripoff 
4- and then the pasta..I had the gnocchi and while the portion size was good the pasta itself was incredibly bland. 
Strongly recommend against."}
{"text":"An excellent dining experience and a great spot in the West Island. 

I had the lamb shank it was delicious, slow cooked and tender it melts in your mouth. They have a wide selection of wines. I dined with close friends and family we were a party of ten having dinner during the week. Everyone was very satisfied and happy with their meals. 

The service was excellent, the waiter constantly checked up on our table. Definitely coming back."}
{"text":"I'm not the biggest fan when it comes to restaurants in the west island, but Mundo surprised me in a very pleasant way. Great food and service, with an outstanding wine list. This restaurant is certainly a diamond in the rough. Will definitely being going back."}
{"text":"I'm not a biggest fan of the restaurant: Service sucks terribly!!!! 
That's why I'm giving this restaurant a one star rating. 

Food Rating: 
Entree- Lobster Ravioli- Ok. 
Tiramisu Dessert is excellent."}
{"text":"Always treated like kings. Of course, Vito and his staff are ultimate professionals, simply amazing generous people. I'm blessed to have known them for years and it is always a pleasure to see them. Every dish is a delight with whomever I'm honoured to share my table with. So tonight:

Antipasti misti : 9.5/10

Primi: linguini aglio & olio 9.4/10

Secondo: filet mignon 9.3/10 + veal scallops 9.3/10

Dessert : my date gave the tiramisù 10/10

Good people, good food, good wine & good place to take your beautiful significant other out."}
{"text":"Some friends and I from work had dinner mid week. I had my 3 year old son with me. This was one of those rare occasions when it was hard to tell what was better the food or the service. Great wines, amazing entrees. Just a fantastic evening."}
{"text":"A small, elegant and pricey Italian place in a surprising strip mall location. My work associates and I came here on a quiet weeknight with good appetites, and we were not disappointed.

The menu was simple but had lots of good choices, plus there were four or five specials that night. I chose the red snapper special, and it was excellent, large, and perfectly cooked.  A delicious bottle of light chianti for the table, and we were set.

Ambiance was very pleasant: Red curtains on one wall, birch branches in vases, elegant photos and prints surrounded us. The service was also excellent and attentive. I'll make an effort to return if I'm in the area again."}
{"text":"Loud, beyond belief!
Food was unacceptable and returned to kitchen. Service was lacking, and unapologetic."}
{"text":"Voici un endroit tout à fait correct pour un lunch d'affaires ou un souper un cran au-dessus de la moyenne.

La cuisine est très honnête et conviviale, menée par la mama et son fils. Les plats sont très bien exécutés même si plutôt simples, ils restent goûteux et généreux. Service excellent. La liste de vin est bien mais la qualité des vins au verre est ordinaire.

Côté prix c'est un brin cher à mon avis mais à l'occasion, ça va.

Un bon choix dans ce quartier assez peu charmant."}
