{"text":"This is one of the most consistent bars I've been to in terms of food and service.  The menu has a lot to offer.  Nothing overly creative, but I'd still say it's on the upper end of bar food.  The Friday night fish fry is good and has quite a few options (perch, cod, blue gill, and walleye).  I'd recommend this bar for a casual night out or a good place to grab a beer and sports game.  We go back often."}
{"text":"One of the better fish frys in the madison area.  Reasonable prices and the service is always great"}
{"text":"We have been to Murphy's a number of times. Service is excellent, prices are reasonable, food is great. Their burgers are huge and delicious; the buns are especially good. The sweet potato fries are to die for. I've had the pan-fried walleye several times and it never disappoints. We do prefer to eat in the bar, as the dining room, while quieter than the bar, is overly bright and does not have much atmosphere. However, the great food and outstanding service are well worth a visit to Murphy's."}
{"text":"We've eaten here twice. The first time my partner and I went in for fish on a Friday and it was PACKED! We decided to order our food to go and have a drink while we waited. One of the owners was there and ended up chatting with us. He was very appreciative of our business and we had a nice conversation. While we were talking a table in the bar opened. He offered to seat us at it and then changed our \"to go\" order so we could eat there. It came out right away. The hashbrowns were delicious! The second time we were feeding 6 people so we ordered fish fry (again) for takeout. We called ahead and everything was ready right on time. Great service and the food was great again. I am looking forward to trying other items from the menu next time we go there."}
{"text":"We stopped here today with our son and his girlfriend who live in Chicago and our daughter who lives in New York. We were greeted with stares from the locals and a bartender who said when I asked if the Stella was beer or cider, \"I have no clue. I drink Miller Light.\"  We certainly did not feel welcome and would never stop here again. Disappointed in what we have come to expect as \"Wisconsin hospitality.\""}
{"text":"My family had lunch at Murphy's today.  We all really enjoyed our food.  Friendly and efficient staff, even though there was a very large party already seated.  My sister and I are vegetarians and both of us enjoyed the veggie burger.  The bunch of us tried regular fries, waffle fries and sweet potato fries.  All were crispy and great.  We all said we'd go there again.  Good place!"}
{"text":"One of the best fish fries in town.  Get there before 9pm, because they close the dining room by then and if you get there 10 minutes before, the waitress will hide in the back until after 9pm and say the room is closed.  Oh well, no tip for her, but the bar serves dinner still!  They have a wonderful selection of wine and mixed drinks, which is refreshing since some bars carry 1 white bottle and 1 red bottle of wine.  The portions are awesome, since its ALL You Can Eat and boy o boy go hungry, because the food is great.  Just a pinch out of town, but it is worth the adventure!"}
{"text":"Needed a place for the Badger Game aired on the BTN. Murphy's fit the bill. Only open a month or so it's got potential. They cleaned up the place pretty nice. Plenty of TVs  7 in the bar area. We had burgers which I thought were pretty good. Plate presentation was the best but who cares.  Pretty good tap selection and the staff was friendly."}
{"text":"Good place to dine for lunch and an early dinner and one of the few places that takes reservations for a Friday fish fry. If you go too late it tends to be too noisy"}
{"text":"Went to Murphy's for the Friday fish fry, it's a nice place inside! The place was busy so they gave us a number and looked us up when our table was ready. Murphy's has a friendly neighbourhood feel to it and fish fry portions and hash browns were large and very tasty!"}
{"text":"Had a soccer game in Waunakee and stopped here before the drive back to Milwaukee.  The waitress was incredibly friendly and provided great service.  Overall - Fantastic Burgers and even better service!"}
{"text":"We've been back twice and both times food was delicious especially the shrimp!  Service is friendly and prompt.  Friday nights are busy and you may have to wait a short while to be seated."}
{"text":"Murphy's is a solid choice. Very Wisconsin. TV's showing all the games, strong drinks, a good fish fry, homemade soups and daily specials. Very popular with north side locals and folks from Westport and Waunakee, a nice mix of people."}
{"text":"It is too bad that I didn't get a picture of the dining room (or restaurant part), as I could show you, the reader, how nice it is. Comfortable booths line the walls and assorted tables, with the room in muted colors, not a beer sign in sight. Very nice, clean space. The waitress who waited on us couldn't have been nicer or more attentive. We had the Supreme pizza (nice thin crust, freshly made, just the way we wanted it) and one of the burgers with the waffle side fries instead of the default chips that come with all the sandwiches. Nice selection of beers on tap and picnic tables outside by the sand volleyball court. I'm a little disappointed that the view of the lake isn't better, but maybe when the sun is out. Be aware however, that you are in suburban country, so expect that a large group of noisy kids with their handlers may make it tough for you to enjoy a nice beer after your meal. We will definitely be back during the week when the \"kiddos\" are in school."}
{"text":"Meh... this place used to be JJ's Top of the Swamp and has since been recently remodeled.  My sister and I thought we would check it out for lunch.
Atmosphere... typical bar... nothing really noteworthy.  Seems like maybe they are still in midst of the remodel... sister noticed the floor near the ladies restroom seemed a bit suspect and in need of some repair.  The food prices seemed reasonable, However once again... nothing really too noticeable about the menu; typical deep fry bar fare.  My sister got the blackened chicken melt... which she said was pretty good.  I ordered the Yeti burger... yes that is correct...Yeti.  It could be pretty good.  The waitress asked how I would like it prepared.  I am at a loss as to why she asked when the burger came out over well done and dry.  It also comes with a fried egg... well... a solid fried egg.  Our waitress was nice and seemed amiable.  Maybe they are still working stuff out with the menu or the cook was having an off day...
Honestly, I probably won't go back as there really wasn't anything to make this place a destination.  I hope your experience is a bit better than ours."}
{"text":"Great service, varied choices for Friday night fish and shrimp options, deep fried shrimp too heavily battered. Great coleslaw and baked potato, soft fresh rolls, tasty lake perch. Nice atmosphere. family friendly."}
{"text":"My wife and I came here recently for Monday Night Football after a couple bar flops in our town (Waunakee). The bartender greeted us right away and the place wasn't full so we sat right at the bar to watch the game. The bartender was also quick to take our drink orders. We were pretty surprised with their extensive menu since we assumed it would be only a handful of bar food apps. We ordered the Murphy's sampler and half size nachos. The food was surprisingly good. Greasy, yes, but not overwhelming. The nachos were decent but my wife enjoyed it. The bartender was also nice enough to turn the music off so we can hear the game.  Definitely not a bad place to hang out and get good service."}
{"text":"Stumble into Murphies any given day or night and you'll be overwhelmed by how fun this little joint on a swamp can be. Locals everywhere tell stories about their experiences on the lake or catfishing in the bay. Murphies has cheap drinks and satisfying bar food to soak up the booze. The ambiance is a little too bright for me, I like it dark so I look better, but who cares? Pull tabs Yay! Flat screen TV's Yay! Juke box yay! Super clean modern bathrooms YAY! Volleyball hip hip hooray! This is a nice bar to visit for any occasion... Watch games on TV, volleyball, drinks with friends, drinks with friends, drinks with friends. Did I mention drinks with friends? Oh yeah. Murphies you have my heart"}
{"text":"\"I really like this place!  That was her quote after just a few minutes inside this spot.  We are northside Madison residents and watched the transformation to Murphy's but just couldn't get out this way.  We finally did at the end of November.   Great neighborhood bar without a neighborhood.  Might have helped that we were between a Badger football and basketball game, so plenty of fun in the bar.  Great dining are if with kids, but the bar was happening so we found a table.  Nice selection of taps. i went with the Yedi burger.  Outstanding.  Another fine burger with an egg.  Really enjoying these around Madison.  She had the reuben with sweet potato fries.  great, but too much food. :). Already planning a return."}
{"text":"They just opened on 7/15 and we stopped in on Friday the 19th for lunch. It looks really nice inside. I got the fish sandwich which was the Friday special. It was good, but it came out with no Cole slaw which the sign said it came with. It was also missing tartar. My wife got a burger that she ordered medium well that was bloody when she got it, but she said it was still good."}
{"text":"I ate at Murphy's tonight as part of a large group. I ordered the Walleye, which I have ordered several times before and always enjoyed. When my meal was served I could definitely smell a foul odor from the fish. My wife also noticed that the fish didn't smell good. We made the waitress aware of the issue and she took my meal back to the kitchen. When she came back she offered to either bring me something else or prepared another Walleye dinner using a fresh fillet from the supply they had received earlier today. I elected to have them prepare another Walleye dinner using the fresher fish. The second meal was fine and they did comp my beer. While I appreciate the fact that they prepared another meal and comp my drink I am still bothered by the fact that they served the original meal. I would have thought that either the cook or the waitress would have noticed the foul smell."}
{"text":"Went to the Friday night fish fry this time. As usual it's a nice friendly place and pretty crowed this night. I am glad they are making here in this neighborhood. The based cod was nothing fancy but came quickly and had a very good coleslaw with it. My partner had the walleye and was not happy with it. She said it was very garlicy and after tasting it myself I agree. Hey you cooks out there don't get creative with a nice piece of fish. Salt, pepper, and a little paprika is all you need. Sprinkling a little garlic powder on it ruined it! She did like the hash browns and that was all she would eat. Still give it four stars and would go back."}
{"text":"We were in town for a family event and my children do not live far away from this spot.
We had driven up north, returning hungry.
I ordered a Veggie burger which indicated it was black bean burger and I added avocado.  The sandwich was amazing: most veggie burgers are aligned with cardboard texture or without any kind of flavor either.  This black bean burger was hot, had some great spices going on and the bun was more of a delicate cross between a croissant and a bun, so very light and tasty. Avocado was perfect, and chips came along side it.
My sis had the BLT which was ok.  We brought home a chili which I will enjoy at lunch today and let you know very soon!
The staff were welcoming and friendly.  We got to see a bit of the Series on TV, being the Boston girls we are.  The crowd was a nice mix of age ranges and the open design of the place made it nice, not dark and dreary.
p.s. we are from a Murphy clan back east so we stopped by because of the name but will return because of the food and the service.  Thankfully we are anticipating a new baby in the family this December/January so plenty of chances to come on by.
p.p.s. I had the second half of the veggie burger heated up this morning for breakfast... yes I know... and it was just as great this morning.......
Go Murphy's!"}
{"text":"We have come back several times for the great food and great service.  The staff....including the bartenders are awesome.  Very accommodating and friendly.  For your Friday fish fry, they offer several options. Come early, because there can be a wait."}
{"text":"I have loved this place, but I'll never be back after today. Pretty busy/loud bar, waitress had to ask my drink 3 times because she couldn't write it down (no notepad.) Ordered food through another waitress. She came back to clarify the toppings on my pizza (sausage, onions, jalapeño-still not writing anything down.) While I was telling her the toppings she walked away mid sentence. 20 minutes later my pizza comes out with my friends food (chicken wrap). Wrong toppings (sausage, pepperoni, onions) She takes the pizza back and says another will be out 10 mins (friend sarcastically says it'll be the same pizza) I asked to get it to go because my friend was done eating. They bring the pizza out, IT WAS THE SAME PIZZA!!! They PICKED OFF the pepperoni, added jalapeños and more cheese, cooked it again, then cut the burnt crust off. Bartender takes off our two beers and $5 off the bill, doesn't even BEGIN to make up for it. I will never return and never suggest this place to anyone ever again. This entire restaurant should be ashamed and the owner should take a serious look at this issue."}
{"text":"Saturday prime rib is solid. Came with soup, potato, and I can't say this enough, please for the love of god, get the damn shrimp. The shrimp man, the shrimp! You can fax me your thanks...the shrimp are 5 stars. Murphy's is named after a sweet little dog, but this place is a Sconnie jewel."}
{"text":"It absolutely kills me when businesses are criticized for being unable to be all things to all customers. 
Yes..The menu is mostly your standard bar fare of burgers and fried food. Thats the point! They're a local bar and grille. They have great pizza and do a nice job. preparing all the usual suspects. (Clubhouse/BLT/wraps/melts etc.) Suggestion: Order extra crispy fries and a mushroom Swiss burger and give the inner critic a rest.  The owner is a great guy, the atmosphere is always friendly, and I always have fun when I'm there. Translation: I'm sold. 5 stars."}
{"text":"Nice bar food.  The sweet potato fries are really good!  I had a cheesesteak sandwich, and the beef was tender and lean.  So good!  Much love to bartenders as well. We ate at the bar, and they took great care of us."}
{"text":"We stopped in for a Bloody Mary and found they don't make a house mix but instead use zing zang. About the best premade mix on the market but it's still just a mix, so that's lazy and boring. The bartender was nice, accommodating and timely. The bar was newly remodeled within the last few years and looked tidy and clean. They had big sand volleyball courts in back when the weather permits. My hubby ordered their wings and found them to be exactly average, which I suppose is an okay thing. When I asked the bartender what they were known for she didn't have any clear direction. Not sure this place has much of a distinction, if any."}
{"text":"Ok food, ok service. Went on a Thursday and it wasn't too busy and waited for 5 minutes to get a drink."}
{"text":"Friendly staff, very clean place, well lit, music wasn't too loud. We came for lunch, and I had the club melt--turkey, bacon and cheese on grilled bread, with an upgrade to waffle fries. I have to say that $2.49 is a pricey upgrade for ten waffle fries. Not that I wanted more fries, because they weren't that good. Maybe for sweet potato fries, but dang! Not for regular waffle fries.

The club sandwich was good--perfect lunch size, plenty of turkey and bacon in it. It hit the spot. And out server was just the right amount of attentive. I'll definitely be back for lunch."}
{"text":"I am glad my family and I stopped at Murphy's for lunch. The owners were a pleasure to talk to, and the food was wonderful. The wait staff forgot to ask how I wanted my burger cooked, so the Kitchen Manager came out and asked. I was being a smart A@& and told her I would like it cooked good. She said okay and The Exploding Pig was just that--very good. Next time I eat at Murphy's, I am going to try the Yedi burger. Nice clean fun bar with delicious food."}
{"text":"Cold beer and decent food. No major complaints.  For a while I was coming here fairly regularly and received overall OK service.  

That said, while overall good, it was never exceptional, even after being here many times with the same staff serving me. I never got the friendly \"hey how are you? Good to see you again!\" vibe with any of them.  Kinda seemed like they vaguely acknowledged me and were just showing up for work; not being personal at all with their customers. Little or no effort really to make me come again.  I'll probably be back but won't hurry or go out of my way."}
