{"text":"Exactly what was missing in that subway station. One of the best coffee I've had in Montreal!"}
{"text":"Chocolatine moelleuse et savoureuse! Café filtre bon, juste pas assez dans mes goûts pour que je donne 5*. Quand même une bonne option quand on est pressés, juste avant de prendre le métro à Mcgill!"}
{"text":"Really good blend of coffee. A great alternative to chain coffee shops. And it's quite conveniently located right at the entrance of the McGill metro. Also, the baristas are always really nice."}
{"text":"I've been getting my morning coffee fix there for quite a while now, and you know when something is good why not share it with everyone? The service is perfect, for someone who's not very talkative in the morning, being welcomed with a smile is a plus. 

I always order their dark chocolate mocha which comes in one size and is always succulent (5$). They also have an interesting variety of pastries which are very affordable and tasty. I strongly recommend if you're near the McGill Metro Station!"}
{"text":"Take out, third wave coffee in McGill metro offering mostly the same beans and goodies you also find in Dispatch so if you like Dispatch, you know you will surely love this place. Prices are standard specialty coffee type, large coffee is $2++  but the size of the cup is not the tall ones you are imagining. I love their roast and come here often since its on my way to school. Great for the morning caffeine fix. Best part about this cafe (other than the cutest name) are their baristas. All of them are so nice and polite. I always end up having great conversation whenever I stop by."}
{"text":"I get my coffee there almost every morning. The staff is very welcoming and the coffee is excellent. They also have a great selection on baked goods."}
{"text":"I am by metro McGill almost every other day to go to gym, but unfortunately never noticed this cute coffee counter called My Little Cup. Since it's in my barista passport that I got from Restomania, I went to discover this adorable place. 

I just simply love the name of this coffee counter. The two gentlemen that were working today, they were really sweet.

I got a detox tea and my sister got a cranberry/ maple syrup juice. 

It's a nice place to pickup your everyday coffee in their cutest cup to go."}
{"text":"Comptoir de passage dans la station de métro McGill. Très bon café latte. Ils utilisent entre autre le café Phil&Sebastian. Service chaleureux."}
{"text":"Your coffee is delicious, your lids are ridiculous!!! Please, revert to normal lids that don't flood your face with burning coffee when you take a sip! (Talking about big lid) pastries look amazing too; will try them this week"}
{"text":"Adorable coffee shop right in the center of the hustle and bustle of the McGill station. It makes the place smell so much better, to be honest. We tried a cuppa today and it was good.

Apart from coffee, they also sell Chemex coffee makers, Hario coffee drippers, portable coffee makers, and more. It is worth noting that they use Chagnon milk. I also strongly approve of their Kusmi tea selection!"}
{"text":"I was surprised that I never noticed this cute little pit stop for coffee in mcgill metro. What an adorable name! What great coffee and what great service. The kind man behind the counter gave me a very good cup of coffee and recommended other coffee shops to explore with my barista passport. He also educated me on the different types of coffee. Its always nice having a conversation like this while your coffee is being made. Definitely a go to place for coffee on the go!"}
{"text":"My friend and I stopped by a quick cup of iced coffee (cold brew) and we were both disappointed with the watered down, flavorless coffee given to both of us. I swear I could make coffee better, and I suuuuck at making coffee. I've heard their latte is really good so maybe we were just unlucky or their iced coffee is not as good as their other items. 

We might give this place another shot since it's so conveniently located and the service is quick. Hopefully it'll be better next time!"}
{"text":"Le matin, c'est pas toujours facile. Des fois on sort du lit à reculons, t'as pas le temps de déjeuner; des fois, même qu'il pleut. Tu rentres dans le métro, t'es tout tassé, et ton voisin d'épaule écoute Hello d'Adèle ben trop fort en repeat. Y'a des matins où tout à d'l'air poche, vraiment.

Au travers de ce chaos matinal, y'a un petit soleil. Tu passes les tourniquets de McGill, la foule se dissipe, et tu le sens. L'odeur de café te guide vers My Little Cup. Sous l'il de Bertrand, caféinomane venu tout droit de Belgique pour nous transmettre sa passion, tu passes ta commande à la caissière qui mets un baume sur ton matin de marde avec son doux sourire. T'es pressé mais tu discutes un peu quand même, tu sens que les gens sont heureux d'être là, ils sont même pas stressés de la file qui se crée en arrière de toi. Tu bois une gorgée de café, soyeuse et délicate, chaude juste correcte; qui te donne l'impression de sortir du lit pour une deuxième fois. 

Sauf que cette fois-ci, tu te réveilles avec le sourire."}
{"text":"J'adore passer à My Little Cup! 

Entre deux courses au centre-ville ou avant une réunion qui nécessite un passage tout près, je n'hésite pas à descendre niveau metro pour me gâter. 

Le café est EXCELLENT, le stand est vraiment mignon et le staff est plein d'humour et de beaux sourires. Quoi demander de mieux?"}
{"text":"A very convenient and cute little cafe right in the metro! Location is great and service is very quick! I went in a few circles thanks to my gps to find this place and to my surprise it was right in front of me. 

I had a small latte in a customized little cup which is very cute!! I had a beautiful leaflet foam. They do have some baked good options and drinks options. Definitely stopping by here in the future before going shopping!"}
{"text":"The latte's here are my guilty pleasure when I'm on my way to 8:30am class at McGill and need something to keep me awake for the morning. It's perfectly located right outside of the McGill Metro on the way up towards the street level. The people are very friendly, efficient, and the coffee is great. If you arrive during rush hour there may be a bit of a line but if you have the time, it is totally worth it. If you want to order your coffee ahead of time to avoid the rush their app, Crema, can come in handy.
Love this place :)"}
{"text":"Great coffee and scones. I also use their app Crema to order the latte in advance to avoid lineup during rush hour"}
{"text":"J'ai eu la chance de découvrir My Little Cup à la foire Papier 2017 à l'Arsenal où ils assuraient le service de café et je dois dire que ça a été une superbe découverte. Leurs viennoiseries sont tout simplement décadentes (en particulier les scones qui sont disponibles en 10 saveurs) et leurs cappuccinos qui sont de loin les meilleurs que j'ai eu la chance de savourer à Montréal! L'équipe de service est également hyper sympathique et j'ai déjà hâte d'aller visiter la succursale officielle :-).

Définitivement un commerce qui vaut le détour !"}
{"text":"My Little Cup is a little kiosque located in McGill metro serving up third wave coffee for those who are looking for an alternative to the usual Starbucks and Second Cup.  They also have a small variety of baked goods should you be in the mood for food.  The prices are a tad expensive but that is to be expected from a third wave coffee place.

They serve up Dispatch coffee which admittedly isn't my personal favourite but it still beats the major chains by a long shot.  I got a latte and the espresso was on the sour side which was expected as Dispatch espresso usually is that way.  The milk diluted that sourness though so it wasn't too bad.  I also was in need of a snack so I got a chocolate chip cookie to satisfy my hunger.  The cookie was fresh and moist and ever so delicious!

What really makes My Little Cup stand out from its competitors is the level of their customer service.  The owner and the other guy who served me made a real effort to start up conversation and connect with myself and the other customers who were being served at the same time.  I really appreciate this and it definitely motivates me to come back here when I am in need of a caffeine fix."}
{"text":"My Little Cup serves the best espresso in Montreal -  and it is only $2 ! The owner (Bertrand) is dedicated to having different roasters and only charges two dollars for the espresso in order to encourage people to try coffee in this way! Such a nice and dedicated team. Ask for a tonic espresso if you are looking for an off-the-menu drink. Hands down best spro in town, but if you like milk drinks, they have steady hands for latte art."}
{"text":"Excellent cappuccino, grains provenant de Dispatch. Probablement le meilleur cafe du Montréal souterrain. Service rapide et sympathique. Ils ont des pâtisseries également qui semblent délicieuse. Laissez faire les chaines et encourager ce petit cafe!"}
{"text":"This is a new coffee pit-stop that replaced the small chocolate shop (which was pricey but great). If your are getting of the McGill metro or on your way to the metro and need your caffeine dose this is the place for you. Its is very close to second cup but since their coffee is superior people that know their coffee go there. True you will have to spend a little more (2.25$ for a small filter, 3$ for an Americano and 4.25$ for a latte or hot chocolate ) but if you want cheap coffee go to Tim's if you want good coffee come to \"My Little Cup\". Their filter was nice and they change it (the type ) once in a while I had the Ethiopian one. They also have great Pastries(3-6$) the Banana-Cranberries cupcake(3$) was amazing. Bottom line great coffee pit-stop near the metro what could be better ?"}
{"text":"Cafe in the McGill metro station. Friendly and fast service. I had the latte and was very satisfied. If you are at McGill metro definitely stop by."}
