{"text":"We love this place! So much better than the others like it. Super fresh and super delicious!"}
{"text":"Delicious pizza with lots of options for toppings and a friendly staff! What's not to like?"}
{"text":"I'd go for two stars since it says \"Meh. I've experienced better,\" but I suppose the staff here is more deserving than that.

Pros: Again, the staff. They're really outgoing and accommodating. Also, the interesting pizza choices and toppings are pretty nice. If you want to drink, they have beers and wine.

Cons: Gotta especially say \"eh\" to the pizza. The woman and I went in with a buy one get one coupon, and ended up paying about $10. The pie itself is probably around 8-10 inches, but it's one of those places that has the really thinnish crust and the toppings are kinda scant for that price. I get that they're new and maybe there's some overhead being in that place or something, but I dunno. Speaking of the place/atmosphere, it's not so bad; except it's pretty small and pretty much all the seating is directly in the afternoon sun, as the storefront is all glass and they have no blinds or anything. 

Anyway, back on the pizza: It wasn't really that good. Somewhere inbetween a Kashi frozen pizza and maybe Brixx or something. Also not sure what's so innovative about their \"concept\" that the other reviewers are talking about; pretty sure you can get pizza made however you want at any other pizza place.


All-in-all, I'm probably not going back but I won't say it's a horrible place or anything."}
{"text":"This pizza place is so delicious!!! They always have fresh baked pizza, and the store is conveniently located! They also have very good cookies. Fresh baked and whenever I get one, the chocolate chip are melting!!!!  I highly recommend it!"}
{"text":"If you are ever in the mood for some good quality fast pizza then I highly recommend My Pie! They have such amazing signature pizzas and you also can create your own. This location in particular is my favorite! The staff is super friendly and I always have a stellar experience every time I go. If you haven't checked them out yet then you are definitely missing out!"}
{"text":"I have eaten at a lot of other pizza spots like fire pie, mod pizza...etc. This is by far the best and my new favorite place to grab a quick, but delicious lunch. Customer service is great, place has a nice set up. I highly recommend it."}
{"text":"Coming from the east coast you have a certain expectation with pizza. My Pie provided authentic thin crust pizza and a great selection of beers. My girlfriend tried the Mr. White it was wonderful. From my perspective, someone who doesn't like white pizza, it was a very balanced pie. No flavor overwhelmed the other, the olive oil and cheese together making a delicious pie. I ate the Spicy Butcher. As a fan of mixing lots of meat with cheese, this pizza did not disappoint. The meats and sauce provided as the name implies a spicy but delicious experience all around. To top off this great food, the staff was warm and welcoming. Will definitely return and would recommend to my friends."}
{"text":"I thought that the pizza at MyPie was adequate. They have fresh ingredients and it takes about 2 minutes to get your pizza. When I got my pizza, I thought it looked very appealing and smelled like sweet tomatoes. It was a small pizza but they're only supposed to be for one person. They have a bunch of sauces to select from, though I wish I would have chosen something a bit tastier. I had the regular pizza sauce and I could taste the added sugar. I am not a fan of sweet pizza sauce. However, I really liked that they have the option of wheat crust and gluten free. I probably should have chosen a better sauce but other than that, it was a pretty good pizza. The service was good, since they were very efficient in making my pizza and getting it to me in a reasonable time. It is not really a sit down place but more of a fast food pizza, although you have the option to eat there if that is what you want. It is a really small space inside the restaurant, but you can also choose to eat outside. It is pretty popular for students to come here before or after classes since it is literally right next to ASU. I thought the location of MyPie was very convenient, and they also give a discount to ASU students! I gave it three stars just because I liked all of the different options there were for the pizzas."}
{"text":"Great pizza! We got the garlic knots for free from checking in Yelp. They were delicious! We ordered the My Uncle Nicky pizza, featuring Kurt Warner marina sauce, with sausage, fresh mozzarella and ricotta cheese. The pizza was so  delicious. Everything tasted so fresh. Our food came out super fast, this is a plus with our hungry toddlers. We got a free Caesar salad, that was also really fresh and the dressing was just right, not overly drowning in sauce. Staffs were friendly and attentive. The restaurant has a very cool decor and very clean. I'd would definitely come back here, and recommend family and friends."}
{"text":"Our family fav! We always make up our own and enjoy every bite! They have fresh good quality ingredients and pizza comes out in a flash! Perfect when dining out with 3 kids!"}
{"text":"Always a great place to have some pizza and beer and relax. Sunday - Thursday specials gets you in and out for about $15! Can't forget about points, always getting free stuff. The food is great and the employees are awesome!!"}
{"text":"Go to Fired Pie, the service is much better and custom pizzas seem to cost less. The service here has often been a miss.  Recently had the pleasure of someone not using gloves to put on additional toppings after the pizza was cooked! And this is the second time the pizza crust has been burnt.  As much as I love the concept, the service has been inconsistent and often poor."}
{"text":"Great pizza. Made fresh and nutso fast!  The space was clean and tasteful with a really interactive and friendly staff. 
Great place for kids too with a great patio space. Also had a super tasty gluten-free crust option. 
The power pie, pesto chicken, and pear-fect pie were all great."}
{"text":"Mypie is really good place too eat and very cheap for the price . I would recommend this place too my family and friends"}
{"text":"I was in the area and saw a new business in place of an old one. I love trying new places out in hopes it will be my new go to lunch spot. I wasn't planning on eating there but wanted to ask them for a menu. Upon opening the door, I was greeted by almost the entire staff. They were so polite and asked if I would like a run down on what they're all about! I then learned this is a \"build your own\" pizza place. They are the hands and you are the artist. My mouth was watering at all the pizza toppings I decided to give them a try. I built an amazing pizza with 3 of my favorite toppings! 

TAKE MY ADVICE: do NOT go over board on your toppings. It won't cook properly and it won't taste as great as you think. The lighter the toppings, the better the flavor. 

At the cash register, I handed them a $20 and wasn't expecting to get much more than $1 back. You wouldn't believe that it was only $11 bucks for a pizza any way you want and a drink. That's just a crazy good deal. 

I went and got my AMAZING iced tea and as I was about to sit down I couldn't believe my pizza and side salad was sitting at my table fully cooked in under 3 minutes. Definitely going to be my lunch break go to! 

I usually don't write reviews but I talked with the owner and manager and I see how hard they're working on this small and expanding business. Shout out to this amazing business with great authentic recipes!"}
{"text":"My Pie is hands down my family's fav pizza place! Ingredients are so fresh, staff is friendly & the price is very reasonable! I highly suggest the buffalo chicken pizza... I like to add spinach to it!love this place!!!!"}
{"text":"Ordered two pies to go for an impromptu lunch with friends. Pepperoni and Mushroom and the Pear Pizza. Loved them both, as did our guests. Excellent crust and quality ingredients!"}
{"text":"My Pie... My gosh. I ordered a Spicy Butcher with extra sausage, because unlike other pizza establishments the \"My Pie\" pizza truly is my way, with no extra charge. Ah, I just realized that is why it's called My Pie. Adorable. 

I have such a big fascination for New York style pizza establishments, I rigged the cleaning mode on my kitchen oven to allow me to cook at 900 degrees. Unfortunately, I don't have the benefit of the fresh ingredients and sauces available at My Pie, so I'm closing the book on that chapter of my life and just eating here from now on.

As you can see in my picture, the pizza came out perfect, and the texture and crunchiness of the crust was a perfect contrast to the sauce and toppings. I'm usually a responsible adult that never over eats, but I had gone so long without a pizza like this I just couldn't stop myself. I ended up ordering an Angry Bird to take home, as the thought of Buffalo Chicken on top of a barbecue sauce pizza intrigued me, and it was the right choice. I'm not a huge fan of ranch sauce, but they really nailed the consistency on their ranch drizzle. Went perfect with the Buffalo Chicken and red onions.

I didn't try the garlic knots, but I watched someone else eat them and would've been very jealous had I not gone to town on a Spicy Butcher."}
{"text":"Amazing pizza!! Always fast and always yummy. Great location and love that they always have sports playing! Wonderful staff!"}
{"text":"My pizza and garlic knots were AMAZING. They have beer and wine to enjoy with your meal, and the customer service in the dining room was fantastic! The manager (I assume) came and personally checked on me THREE times and even filled my water without my asking. I will definitely be back here again."}
{"text":"Great prices, good food as well. It's a fun place for a quick salad or pizza!"}
{"text":"My Hubby and I love to try new places for out date nights, so we chose My Pie on Tatum Blvd.  We were impressed with their cozy atmosphere. While there, the garage style doors were open which gave the restaurant a feel of being outdoors, which we enjoyed. They have a charming little patio area with heater lamps which is enjoyable in Phoenix.   Ashley greeted us as we entered and pointed out recommendations after knowing what we like on our pizzas. Many great choices to pick from! We chose the Pesto My Chicken and the Spicy Butcher! The ingredients are fresh and the thin crust was perfect! Yum!!  They offer a create your own pizza option, so we look forward to creating our own concoction! The team was very friendly and Kyle, who rang up our order was very kind and made us feel welcomed.  We will definitely be returning to My Pie!!"}
{"text":"I absolutely love coming here! The service has always been great. I love the build your own pizza for the price with unlimited toppings you can't get much better. I'm also one of those people that suffer from being lactose intolerant and they have VEGAN CHEESE upon request! Also love the wine pricing and the cabernet sauvignon was delightful  I'm very excited to come back durring the winter as well because they have big garage sliding doors that look like they open when its cooler outside. Will definetly recommend this location."}
{"text":"I love the concept of being able to customize my food right before my eyes, so when I came across My Pie, I was intrigued! The concept is simple - lots of fresh ingredients, piled on thin crust and baked and ready to eat super fast! I like that you can choose from their pies or you can create your own. 

I chose the Greek pizza and I was not disappointed. I love Mediterranean food and this one was one of the best. I think the secret is the balsamic drizzle that they put on after the pizza comes out of the oven.  And if you're a picky eater, the people there are so nice, they're ok with \"a little this, a few of that\" too. They make you feel like your best friend. 

To sum it up - If you're looking for a casual place to grab a dinner, you've found it. I can't imagine anyone walking away disappointed!"}
{"text":"I go here all the time because it's close to the bus stop on University. I don't think i've ever had a bad experience with them. You can get a custom pizza or select from some presets. A few of their pizzas are $5 on weekday afternoons, which is nice.

The pizzas are affordable, ready in a few minutes and taste great. The calzones take a bit longer, but they're just as good. The garlic knots are good for taking home. The meatballs are good, too, but expensive. 

The only things I don't like; it's very small (very little seating) and it closes pretty early. The food is great, though."}
{"text":"Since our trip to Italy in 2012 -- my wife and I have been looking for a local place that took pie seriously. We've stopped looking. 

The menu selections are well crafted plays on traditional American favorites (my wife had the \"Hot Hawaiian\" and I had the \"Spicy Butcher\"), but cooked with old world craft. The crust was crispy, the cheese (chunked, not shredded) was melty, and the sauce was flavorful (beware of the \"fra diavolo\" sauce -- it packs a punch). 

To top it off -- the garlic knots were good and the cookie (imported all the way from David's in Brooklyn) was the perfect touch to end the meal. 

My biggest complaint -- too few napkins on the tray to mop up the sauce in my beard."}
{"text":"Great pies!!  Love the cookies too!  Patio is a great place to hang out, with dogs, kids, whatever.  Quick service and very friendly.  They do what they can to make you feel at home."}
{"text":"From the day that they opened we have been huge fans of this place.  The service is always friendly, and the pizza is amazing!"}
{"text":"Love the food, but the service is inconsistent. One time I asked for them to deliver to my work which is walking distance, and they did it with no problem. Then I called another time asking for another delivery and they were all of the sudden \"not allowed to do that.\" Yesterday I went in to use a coupon that I used before on the same type of pizza, and they wouldn't let me use the coupon! It was not a used coupon, it was from that five stars app. Right when I thought I was going to save some money and they hit me with the \"oh we can't take that coupon because of the type of pizza you ordered.\" Like okay but you were able to take it last time? Not too happy. You guys are lucky you have good food to keep you in business."}
{"text":"Great service from Savannah, Cody, and Dino! The garlic knots are THE best! I enjoyed the pizza too. Ingredients are always fresh and higher quality. I also like that the store is clean!"}
{"text":"Excellent pie and great service. The crust was my favorite part of the pizza! I highly recommend this place."}
{"text":"Love this place! A few good selecting of beer on tap and anyways with the half price seconds keeps me coming back! But the pizza rocks, as well, and the people are always friendly there...employees & patrons alike! It's always fast and fun here. Keep it up!"}
{"text":"Nicely greeted by the staff as soon as you walk in. They explained how the process goes when ordering. Our first time here, very impressed with the taste of the pizza and the toppings on the pizza are all fresh ingredients. The restaurant is very clean and has a great atmosphere. Definitely be back again."}
{"text":"Love this place. It's casual, good, fast pizza, half price refills. The best part about this place is the service and they play super fun music."}
{"text":"Best pizza and service! Crust is perfect and all the toppings are as fresh as you can get. Their other restaurant Crust is just as fantastic as My Pie. My favorite pizza place hands down!"}
{"text":"This is the best place to get fresh made pizza for a good price. They have a bunch of sauces & toppings to choose from, and there is no limit. I love mixing the Alfredo sauce with their spicy sauces. Best place for pizza!! I come here a couple times a month."}
{"text":"Must have the caprese! Great starter assisted with a $4 Hop Shock. The Pesto My Chicken pizza was excellent and even better I was able to wash that down with a $2 refill of IPA. Great place with nice little patio. Store is super clean and a great concept. Happy Hour all day Every day, Boo-Yah!"}
{"text":"I have been here a few times and it never disappoints. There is a phenomenal selection of options. It's quick, easy, and delicious! 

The staff is by far the most friendly I have ever seen at any restaurant. They genuinely act like they want to be there."}
{"text":"Good stuff! After a four plus hour drive from Page we pulled in with 10 hungry adults and kids. The place has a cool vibe and the pizzas were great. A lot of different choices plus the classics and BEERS!"}
{"text":"Tasty pizza. Little pricey. Good Coke! Reasonable sized servings. 

Take that back, signed up for rewards and getting deals now!"}
{"text":"Recently I had my first experience with My Pie. My Pie has two locations in Phoenix, one in Scottsdale and one in Tempe. My Pie is a contemporary pizza restaurant on College Avenue nestled between Panda Express and Port of Subs. I eat at this restaurant with three of my classmates. The theme of the restaurant is that you order a type of small of pizza or you can make your own. You then watch or direct the employee makes your pizza. You also have the options of other snacks like cookies and drinks. The service was very hospitable and the employees nice and hard working. My favorite part about the experience was that another customer in line told me about the special they have between 5pm - 7pm about 5 dollar pizzas. If you don't come at the time of the special however there is always a dollar off if you are able to present an ASU id. I used the 5 dollar special to order a pepperoni pizza but I still paid I bit extra to get gluten free crust because I was eating mindfully. When my classmates and I got our fresh pizzas we went outside to eat. I enjoyed my pizza and eat the whole entire pizza. The pizza was tasty but the crust was too thin for my taste, it was very thin. The whole pizza enough was not enough to satisfy my appetite but I still appreciated the taste. I was the only one out of my classmates who decided to actually eat, they all took their pizzas home. One of my classmates took 5 pizzas home! Overall My Pie is a good tasting pizza but not worth the price if your really hungry."}
{"text":"Fast food pizza and relatively healthy. However, my choices rarely fall within the healthy category, I have been here twice and both times I have chosen the spicy butcher on a ahem...white crust. They do have gluten free and whole wheat options. They also have salads. On my last visit I had the Mediterranean salad and it had quite a few toppings. The staff is super friendly. If you eat there, the floors are concrete and the ceiling is open so there is an echo and it can be difficult to carry on a conversation. In addition, the music was so loud so that adds to the difficulty of conversing in the space."}
{"text":"Love this place!
My pie is a perfect-sized-thin-crusted masterpiece. I love how all the ingredients are out like in subway restaurants. There are so many choices & they do not charge for substitutions or add-ons! Garlic knots appetizer is amazing and if you have room, get a homemade cookie. Staff is always super friendly and service is crazy fast"}
{"text":"My pie my way!!! Fresh, hot & very tasty. I have eaten here a number of times and it's always good. Recommend you try the garlic knots and a cookie."}
{"text":"Great customer service! Been coming here for a couple years now and they definitely improved! And love that they support our community with school events!"}
{"text":"Love this place! It's an awesome idea and they have all my favorite toppings. The view is nice and it's never overly crowded. Pizzas always come out cooked perfectly and their fresh brewed tea is delish!"}
{"text":"I love the option to build your own pizza.  I think I just suck at making pizza but it felt like something was missing flavor wise.  Friendly place.  Hard to find.  Google maps is wrong.  Look for a banner by Sprouts grocery."}
{"text":"I must update this review, a mistake was made and through that mistake I found an owner who was more than impressive with his customer service.
Ryan did a fantastic job of communicating and remedying the situation. I was offered a refund which truly wasnt what made me change this review, it was Ryans outstanding service to remedy in any way.
Thank you Ryan for putting customer service #1!"}
{"text":"Absolutely fantastic. Had a lot of gluten free pizzas in the area, by far the best one is My Pie. BBQ sauce was sweet with just a little spice, any ingredients you want for one set price. I will be going back, just wish I lived closer."}
{"text":"First time eating here. Pizza was very good. Staff were very friendly and helpful. My wife's?pizza was to spicy for and and they replace it without any issues. We will be back for sure."}
{"text":"Received a text for the grand opening.  50 percent off entire menu. Pizza, salad, garlic knots,  iced tea and a beer for 12.61. Great food at regular prices, even better today."}
{"text":"Great spot to eat a yummy personalized pizza! I had it before the ASU game and it hit the spot. Plus it was really quick."}
{"text":"First time here and everyone was really friendly. The food came out fairly speedy and taste GREAT! Happy hour is such a great deal and very affordable for all us college students!!! Would definitely recommend to all my roomies and friends! Can't wait to come back."}
{"text":"Mie Pie has it all right... They love all the locals and remember you :).  Super friendly and amazing food..."}
{"text":"I have had the pizza here twice now and can tell you that I will *definitely* return for more!  The boxes/packaging is very clever, the ingredients are very fresh, everything is made to order right in front of you.  

It is said that actions speak louder than words and this is so true!  The fact that they care about ensuring that each customer is satisfied definitely shows!  

I haven't tried their gluten free however the fact that they offer gluten free gets two thumbs up from me!!!  

I ordered the New Yorker both times I was there, the second time I tried their garlic knots. One word:  YUMMY!!!  Mouthgasm!  

For one like me who eats one or two slices and is full, their pizza provided four meals so a definite bonus!  Delicious cold too...  Generous with sauce, which was AMAZING by the way...  

Haven't tried the ice cream cups yet, perhaps next time when I try a pizza other than the New Yorker.  Now to decide which friend to bring...  Hmmm...  Decisions, decisions...  

Seriously, you have GOT to check them out!  Everyone is so friendly, courteous, outgoing, helpful, and NICE (they all really seem to truly enjoy their job and it shows).  

\"Live long and prosper\" --Spock ...........It applies here!"}
{"text":"I come here for lunch a lot. Great pizza and super easy! You can customize your pizza and get it however you want. It's quick and delicious."}
{"text":"hey, just wanted to give some feedback.  if i'm noticing this, i'm sure other customers are as well.  
in the last month, not only has service but also food quality has declined drastically.
we are regulars and the last 3 weeks the pizzas have been either overcooked or over oiled.  i've seen a few times where you've had customers with allergies have to continually tell the pie makers to clean their gloves or refrain from cross contaminating.  your pie makers should know proper handling for allergens since your restaurant boasts about the ability to compensate.  it would be pretty awful if someone got sick.
most recently my pizza was an oily mess.  it was a gross-pearfect.  the prep area was disgusting, salami in the chicken bin, fresh mozzarella had all sorts of crap in it.  the sense of pride has declined drastically as has the cleanliness.
we are seriously contemplating refraining from coming again."}
{"text":"Great garlic knots. Good pizza. Did I mention the garlic knots? I'll go back for those alone."}
{"text":"Boyfriend and I come here all the time and we are always so happy with the  costumer service and food! Everything is always super tasty and fresh and we always leave feeling better than we did before. We get the same guy, Jesse who makes our pizza almost every time and he makes the best pizzas and deals with our complicated build your own pizzas haha! He makes us feel so welcome. We love this place!"}
{"text":"Fast, friendly, funny but professional group.  Think Subway for pizza lovers.  They will build what you want right there in front of you or choose one of their combinations.  Pizza is delivered to you within 10 minutes and it is delicious!!  Crazy wicked good!!  Gluten Free crust available as well and it is by far the best gluten free crust I have tried at a restaurant.  OH!!  And they have some fantastic freshly baked chocolate chip cookies that are warm gooey and delicious.  My husband always gets one and I take a bite to kill the craving of sweets.  Geez, I love this place!!   Highly recommending you try them out as soon as possible.  You won't be sorry."}
{"text":"It was delicious!   We went out if the way to try it and did not regret it. If you like pepperoni make sure to ask,  we forgot to add them . Even then, our pizza was very flavorful."}
{"text":"I have been to this place a few times before and it is consistently good. Tonight we had the Hawaiian pizza and the health nut salad. The kids shared the cheese pizza. The whole wheat crust is great. All the food was great. My pie is a wonderful option for a weeknight when you don't feel like cooking!"}
{"text":"Finally, a pizza place.... myway!

You start off by choosing your bread (they even have Gluten-Free!), then you pick your sauce (very good), and then you pick ANY and ALL toppings! They put it in the oven, and after a quick 5 minutes, they bring you your tasty pizza, just the way you want it.

If you go in Hungry, it would put a serious dent in your stomach.

BRAVO!"}
{"text":"Pizza is phenomenal! You can tell how fresh there ingredients are just by tasting the food. I love this place and the concept is great."}
{"text":"Sooo good!  The pizza came out super fast and tasted delicious.  The kids loved their little mini pizzas.  Great garlic knots and the chocolate chip cookies were a hit.  4 dollar pints of beer with $2 refills? Yes please!  Also the staff was very friendly and helpful.  We will be back!  Oh and kids meals are only $1.99 on Mondays!"}
{"text":"This is a great little pizza place, almost no wait and close to campus, quality pizza in around 2 minutes."}
{"text":"So tasty, fresh and fast! The crust is thin and has the perfect amount of crunch. We've tried 6 of the specialty pies and they are all good. The price is so affordable it's easy to get one for the kids and the parents can have their own, no compromise! 

It's family friendly so you don't have to worry about your kids being a bit crazy. We've been there many times and everyone from groups of adults to teenagers are enjoying a meal together. 

The restaurant moves people through very fast, the staff is extremely friendly and it's very clean."}
{"text":"This place had some of the best pizza and to top it off their gluten free crust is delicious also which is hard to find. Ending the night with wine and a gluten free brownie.. the owner of this place is top notch .. what a great guy"}
{"text":"We love the pesto pizza. Friendly and fast service. Small place and busy. Can get noisy if crowded. Have outsides eating available"}
{"text":"So, I happened on this place by chance cause I eat Vegan 95% of the time.  Found out they have vegan cheese.  Now, I was the first person ever to order the calzone with the vegan cheese....We all (employees and I) were amazed how the cheese melted perfectly in their actual pizza oven. It's not one of those conveyor belt ovens.. it's the real deal.  Well, I've been back many many times since.. The owners and staff have always been great! They always remember me and my vegan diet.  The garlic knots? have always been on point!   I'm sad that I'm moving from Chandler to Tucson, because they do not have a location there.  Now, I'm gonna have an easy excuse for a road trip!  Thanks guys!"}
{"text":"Fun family night. Great food!!  Kid and pet friendly on patio.  Definitely go back for date night or worn kids. 
Awesome value. Great ipa."}
{"text":"Tried My Pie for the first time tonight. Wanted to try it out because they promote a dog-friendly patio, and we have a sweet 1-year-old Aussie that we like to take everywhere with us. The food was good and the beer was ice cold with a $2 dollar refill (nice!) The staff was really nice to us and our pup and the owner chatted with us for a bit. Definitely a good place to try with a loved one, date or homie. Laid back, chilled and satisfying. Try the Bread Knots!!!"}
{"text":"Good pizza, pretty quickly too.  The garlic knots are really good.  Reasonably priced, friendly staff."}
{"text":"I've been to fired pie and pieology and they are pretty much McDonald's quality compared to this place. The crust is better, the sauce is better and the ingredients are top notch. This is definitely my new pizza spot."}
{"text":"Love love love this place!! I think this is probably a weekly restaurant for my family. I love all the variety and how you can make your own pie or salad just how you like it. The chocolate chip cookies are out of this world and it's always nice to have a glass of beer or wine and sit on the patio since we can take our fur baby as well!!! Don't forget to sing up for five stars because you always get specials!!!!"}
{"text":"What more can you ask for from being from out of town, late, tired and need a place to eat with a 2 year old???? This place is amazing!!!! The prices are affordable and you can't beat $4 draft beers and wait for it... $2 refills???? What is that??? We must introduce that to Los Angeles!!!!  As soon as we walked in Grant greeted us and told us about the favorites! Then moved on to Kyle who told us about the drafts and his recommendations! The guys here are very hospitable and very attentive to our needs and kept checking on us to make sure we are ok. We arrived close to closing but Grant made us feel at home and didn't rush at all!!! We are here for a good 2 months and this is the best place to unwind after a long week and eat great tasting pizza, salad, addicting garlic rolls, tasty crisp draft beers, and OMG the chocolate chip cookie, YUMMY!!! Love this place and the staff!!! Grant is the best host!!!!"}
{"text":"This place is amazing! Both in service and food! My best friend is a vegan but we are able to order here no problem, their pizza is custom and phenomenal. I would also recommend the garlic knots and the cookies. Service is super friendly and they often come up to check on how you're doing and if you need anything. Definitely coming back!!!"}
{"text":"I love this place!  Great atmosphere. Staff is always friendly and attentive. I typically create my own pizza and add the toppings that I want. I highly recommend the 'spicy fra' sauce!  I also love their meatballs - they take a big meatball and break it up into your pizza.  It is a thin crust pizza, so if you only like pan pizza you won't get it here!  It takes about 5-7 min to cook and they bring it to your table. If you haven't tried this place,TRY IT!  You will like it."}
{"text":"Went here for the first time today and I was blown away! The reviews that call it the \"Subway of pizzas,\" they're completely right.  So many options for fresh veggies & even gluten free crusts(for an extra charge). I walked in and I was greeted by a very friendly employee. He immediately told me I was there during happy hour, which was a $5 pizza. yippee!! I got a $5 margherita- which was made with fresh ingredients & cooked in nearly 3 minutes. I came home and it was still piping hot and super delicious. If you miss happy hour, you can flash your ASU student id & it's $1 off any pie. My pie is a pretty cool local joint and I'll definitely be going back there."}
{"text":"If you want authentic sauce and dough you have to check this place out. Great pizza and service. Just like nonna use to make."}
{"text":"My Pie is my new favorite restaurant!  The pizzas are made fresh and exactly how you want them.  You have a choice of white or wheat dough- I usually get the margarita on wheat.  So yummy!  I also have had the spinach salad and it was fantastic.  I highly recommend it!"}
{"text":"Just think like a Subway restaurant but pizza instead. You pick your dough, sauce and toppings. I can see they are getting into like a healthier version type of pizza. Gluten free etc. but honestly pizza taste mediocre at best."}
{"text":"I was pleasantly surprised with this little pizza place. We had two made to order pizzas which were made quickly by pleasant and helpful staff members who are not your typical pizza place workers. They are a notch above the rest. The pizzas can definitely serve two people but it's fun to get your own so you get exactly what you want. We each ate half our pizza and we took the rest home in adorable pizza boxes.  To our surprise, they serve wine which is reasonably priced at $6 with $3 dollar refills. This is definite our new fav!!"}
{"text":"The pizzas are delicious and the garlic knots are insanely good. We got a taster of the garlic knots and immediately went in instead of Panda. Look forward to coming back for more!"}
{"text":"Great service & food. Much better than any of the other create your own pizza places I've been to!"}
{"text":"I've now been there twice due to Groupon coupons.  There won't be a third time.  Yes, the staff is very friendly and helpful, but the pizza is not good.  The crust isn't at all crispy; the sauce and toppings are too bland to be enjoyed.  I'll go back to getting my pizza the Italian way -- from Red Devil!"}
{"text":"I am a pizza freak, I am pretty sure I can eat it every day and never get tired of it. & I can honestly say I love this place..... It is always fresh and everything tastes great. The employees are always courteous and friendly with positive attitudes and smiles on their faces. Definitely a type of pizza joint you would like to have in your neighborhood. Great environment for people of all ages.  If you haven't been here..... We'll lets just say your missing out. 

P.S. The ranch is delicious."}
{"text":"This is my neighborhood 'I just worked 10 hours and need pizza fast'  go to place.  The other kicker?  This is the best service you'll ever get at a pizza place.  

Eats:  My Pie has done an excellent job taking the pan pizza and giving it a new look.  There are several suggested pizzas they'll make for you (try the Spicy Butcher for a little kick or My Uncle Nicky to satisfy your meatball craving) or you can just make your own.  

The best part?  After ordering your pizza will be done before you can return a text, it's literally 2 minutes, yes 2 minutes.  Yowza! 

They also have a nice selection of local craft brews, not a ton, but a good offering.

Recommendation:
Sign up for their text marketing list (you do this at checkout).  I receive periodic texts for $2 off a pie."}
{"text":"Great pizza at a great price, and the cookies are awesome. Employees are always friendly."}
{"text":"I felt compelled to try this place despite the fact that every personal pizza place I have been to has been less than satisfactory.  The last decent place I went to was Nick-N-Willy's which is long gone here in Gilbert.  I've tried MOD, 1000 Degree, Red Brick, and Eclectic (which was by far the worst in my opinion).  I was incredibly surprised by how good this was, so much so I've been twice in the last week.

I would also like to add that I am no stranger to good Italian food.  My grandparents immigrated here from Palermo and Naples, respectively, in 1921.  And although that doesn't qualify me as an expert, I know good from bad.  First time I had the Spicy Butcher and it was fantastic.  I also tried the meatballs and I will say they are some of the best restaurant meatballs I have ever had.  My only complaint is they weren't warm enough when served. But the meatballs and marinara sauce were excellent.  They tasted like fresh, scratch made meatballs.  You made this Italian proud!  

The second time (last night) I had the Sneaky Salami, excellent and unique combination of ingredients.  I also had them add some spicy sausage and it made it that much better.  My wife and I shared another order of meatballs and they were just as good as the first time.    

Staff was friendly, food was great, definitely going back.  This is by far my new favorite pizza place.  Keep up the great work!"}
{"text":"Fix the air conditioning! This is Arizona! You can't expect people to come and eat without it in summer. Had to grab the pizza and run. Can't have my kids roasting in here."}
{"text":"Absolutely a highlight of our vacation to Phoenix. We ordered garlic knots and two pizzas and it was all delicious. 

Even better than the food was the excellent service. It was easily the best service we have received on our trip. 

I hope my pie makes its way to Denver soon."}
{"text":"Hands down for a place to get a great pizza at a great price I promise you will not be disappointed. The margarita pizza is awesome and your normal favorite pizzas the way you want them is unlike any other pizza joint . Bring your family or your coworkers you will NOT be disappointed. See you guys soon ."}
{"text":"Excellent service, great food! I tried the \"MY Uncle Nicky\" pizza, delicious; ricotta cheese on pizza is the best. Topped it off with a glass of wine; what a perfect way to end my day."}
{"text":"Everything we ordered was amazing!! Ordered the create your own pie with wheat crust, and garlic knots. The nice thing about this place is they don't charge per topping for the create your own pie. The food came out pretty quickly, and again was really good. Definitely will be back!!"}
{"text":"This is a great place to get delicious, inexpensive pizzas. They even have a stamp card (electronic) system so you can get a free pizza after purchasing a few. I wouldn't rely on just one pizza for feeding two people as the pizzas are small. It's like subway, but for pizzas. Yes, they bake them. The wait didn't seem horriblely long, even with a couple of people ahead of me."}
{"text":"This pizza was amazing! The crust was very good, both gluten free and whole wheat. The sauce was very tasty and the pepperoni was the perfect finish. It was a very tasty New York style pizza and would definitely recommend. Also, the cinnamon knots were pretty good, very filling."}
{"text":"Had a great dinner last night! Loved the Angry Bird pizza and warm chocolate chip cookie. Will come back here again!"}
{"text":"Good pizza and friendly service! Would come back again to eat a calzone! Would recommend coming with more than one person so you can share your meal."}
{"text":"Seriously this place rocks!  The pizza is pretty awesome, the prices are good (sign up for their reward program they have great specials), the service is really good and the restaurant is very nice.  Hello $2 refills on your beer!"}
{"text":"Very good! Not greasy. 

Warning: They do not have ranch. A fact that almost made me drop the rating. GET RANCH My Pie PEOPLE!"}
{"text":"Beats any of similar 'build your own' pizza places AND GREAT CUSTOMER SERVICE TOO! Their salads ans and other menu items are tasty. I highly  recommend trying it!"}
{"text":"Sooo good! I prefer the original crust, but the wheat is good also. The cookies.....what else can I say. They are warm and gooey and so chocolate-y!!! You can't go wrong with anything here!"}
{"text":"Mypie is always an awesome experience to go to. I've been coming there for years and have never been let down. The fact that you can create your own personal pizza is awesome, so you don't have to split it with anyone! 
  Also know the manager has it perks Ashley the new general manager over there is one of the sweetest girls you will ever meet she is always so customer oriented and will always bring a smile to your face! Also for the adult crowd there is always a happy hour there! Pretty sure it's half of refills so you can get a nice glass a wine or a good beer to go along with your own pizza. This is definitely worth checking out! Once you go you won't stop!"}
{"text":"The interior has been nicely remodeled and has a great indoor/outdoor living concept going for it.  Pizzas can be made to order or selected from the list. They have white, wheat, or gluten free crusts available. I'll definitely be back to try a salad or a yummy dessert!"}
{"text":"We have been waiting for a while for this pizzeria to open, and WOW was it worth the wait!! The staff was so extremely helpful and friendly, they make you feel so welcome and like part of the family. As for the food, the garlic knots are top notch, and their individual sized pizzas are out of this world, we were so impressed with how delicious the food was! Also, I was blown away that they have beer on tap there! I am so glad that this place opened so close to my house, I can guarantee I will be going to My Pie at least once or twice a week. As far as pizza is concerned, My Pie can't be beat in my honest opinion! I highly suggest My Pie to anyone and everyone, it doesn't get any better than this guys!"}
{"text":"Fast and yummy!  Came to Starbucks and ended up here instead:) Saw a new restaurant, and thought we'd give it a try.  Very helpful and patient with new customers employees;). Great new option for pizza in the area."}
{"text":"I didn't realize this was a chain when I casually sauntered in.  Immediately after my initial interaction with Randy, I'd just assumed this was a local small business and that he was a partner or the owner. Eeeeeverything about his presentation and accommodating presentation screamed this guy was invested.  There are a million places where I could spend my money.  In fact, I was on my way into another fast-casual when I made a detour into this place. Glad I did.  The pizza was delicious and the customer service outstanding. It had to be!  I've saved this note in my phone since this past June but was still committed enough to (eventually) follow through and give credit.  I believe Randy is out if Nevada.  He'll end up owning stores.  He hit me with the up sells in a way I not only did I not mind, but appreciated.  He even got me to enter my ph number to get their updates on my phone so that I'm in their funnel. I'm going to eat their again today. #pro"}
{"text":"This pizza place might be little, but they have great pizzas and other yummy appetizers. I love the fact that we can make the pizza our way. My fiancé love the meat lover pizza and I love the spicy Hawaiian. The workers are really nice and friendly. We have been going here a lot lately. This place will be our regular go to pizza place."}
{"text":"Staying in Vegas for the weekend to celebrate my b-day. I was looking for something to eat and a fam. member recommended this place. 

The place was very clean and had a friendly atmosphere. The workers there were super friendly and helpful being our first time there and all.

We ordered the pizza your way and a side of garlic knots.
OMG!!!!!!! They were amazing! The individual pizzas and the garlic knots hit the spot. Took a picture of my pizza forgot to take one of the garlic knots. We had dug in already. 

Highly recommend this place to everyone. Thanks guys for making such delicious food."}
{"text":"Overall: 4.5/5

Food: 4.5/5
Service: 5/5
Decor: Nice decor and clean
Price: Great!

Food:
Power pie - My favorite! I had my doubts when ordering something that sounded like a \"power bar\" type of healthy tasteless thing, but this pizza proved me wrong. Generous amount of garlic and EVOO and stringy melty cheese that works very well together with toasted almonds and the tomato. The crust was a default wheat crust which turned out really crispy, maybe even more then regular white crust.
Spicy butcher - Great crust with meatiness from pepperoni and sausage, though I could not taste the spiciness too much. 
Customized pie - White crust with BBQ sauce, it was then loaded with a lot of meat, chicken, sausage, bacon, that's all I can remember. Topped with mushroom, caramelized onions, and other good stuff. I hate to say it, but this one disappointed me, while the meat and caramelized onions were good, I could not pick up the BBQ sauce too much, and my crust was burnt on the bottom . 

Service:
Great, person making out pizza was friendly and gave us a quick intro to customizing pizza to your liking. Pizza only took a few minute to cook in the 800 degree oven. On top of that, no wait!

Decor:
The place was clean and you can watch the whole process as they make your pizza. The place a was a bit cramp near the entrance and the seating was squeezed too tight, but there are also outdoor seating if you like.

Price:
Each pizza was about $9, and 3 pizza was enough for 4 of us though we weren't too hungry. I'd say one pizza per person would be a good portion. 

Overall, I really like this place and would definitely come back again when I am in Phoenix. You just cannot beat the price and for a great crispy pie!"}
{"text":"Food was just okay.  We ordered a pizza (skimpy toppings, really bland), calzone (looked more like flatbread, no flavor), garlic knots (really good!) And a couple of salads that were pretty tasty. 

I ordered online & the process was great - food ready on time & staff was super friendly when I arrived to pick up.

Everything about the experience was positive except for the quality of the pizza/calzone, but for a pizza place, that means 2 stars to me."}
{"text":"Best gluten free pizza dough I have had. Lots and lots of topping choices.  Friendly, knowledgeable staff - that go above and beyond to make new customers feel welcome."}
{"text":"Super good! Came here for the first time today. I'm not to much of a fan of pizza, but they let you create it your own way. I put Gorgonzola on it."}
{"text":"Some days the pizza is excellent, but others not so much. The consistency just isn't there. I think they use this as their training center and that may be why it's not always good. I may not go back!"}
{"text":"This place is awesome! I bought a  Groupon  and want to use it, so my husband and I went there yesterday and so glad we did. Pizza was really tasty and the employees very friendly. Hope to come back soon."}
{"text":"We've lived here in AZ for a little over a year and this is the best pizza we've found in the area.  My family including the little's love it here!  We will be back it was so yummy."}
{"text":"Solid choice for lunch or dinner, one personal pizza can feed 2 adults. Beer is extremely cheap (for a restaurant), starting at $4, with refills being only $2 on tap for high quality IPAs like the local SanTan choice offered here. Very fresh, quick, and the workers have been friendly and helpful."}
{"text":"Great costumer service. Workers are really nice and know about their company and food. The pizza is absolutely outstanding."}
{"text":"This place is amazing! There's been quite a few different pizza places that have come and gone in this location, but hopefully My Pie is here to stay. I had the white pizza and one of their huge chocolate chip cookies and they were delicious! The manager of the place came by our table a few times while we ate to make sure everything was good and asked if we needed anything (which show cases their great customer service in my opinion). Stop by if you're in the area and try one of their many specialty pizzas. You won't be disappointed."}
{"text":"Mitch was incredible and honored my garlic knots!! Even though I made the mistake and my pie took care of it! Above and beyond delicious food, great service!!!"}
{"text":"The spicy pizza sauce is so good. We need one of these in the west valley. Absolutely no complaints, everything tasted amazing! I couldn't even finish the little pizza I had loaded it up with so many toppings. Great price for what you get!"}
{"text":"Gourmet Pizza that doesn't disappoint.  I was sure pleasantly surprised.  I thought I'd take my kids there to pick up some pizza.  Super-friendly staff, clean, and very speedy service.  I had the \"My Greek\" Pizza with the artichoke hearts, lite sauce, kalamata olives, onions and more, and kids had traditional Pepperoni.  We also got garlic knots that were the best I've had, loved them.  Highly recommend that you try this, there are so many selections, if you go to pizzayourway.com you can see their menu.  Will definitely be going there again.  They have wine too!"}
{"text":"I drive by this place all the time and finally decided to try it.  As I walked in I was greeted and asked if I had eaten there before.  After replying, \"No,\" everything was explained to me about how the pie is made and how quickly.  I made my choice, paid, and received my meal very quickly.  The pizza was great as well as the service.  I will be returning to try another pie."}
{"text":"Great food and service!! The general manager (Tyler) and his staff at this location were very friendly and accommodating to my kids food allergies. Overall, the food tasted fresh and satisfying!!"}
{"text":"So good! Fresh gourmet pizzas done fast and yummy. U pick what I want or get one of their specialties. Can't go wrong."}
{"text":"this place is always good, they have custom pizzas and I usually split one with my gf.. always filling and the perfect amount for both of us. the knots are good and the cookies are also a good add on."}
{"text":"We can't go a week without eating here. This is the bext pizza, consistently, we have ever had in AZ, and we are from the East Coast. We really missed East Coast pizza until we found My Pie. This better! My son loves the gluten free crust which they bring in from CA. My husband can eat pizza here since they have low fat cheese. The fresh garlic in extra virgin olive oil is incredible. The garlic knots are sublime. 

They deserve all the success they are enjoying!

The staff is great too!"}
{"text":"Great pizza, great kids pizzas and great staff. They were so good that when I mentioned that the coke machine was low on soda, they got me coke can while trying to fix the machine."}
{"text":"First, the things I loved. Love the concept - build your own pizza, how could a person go wrong? Love the prices, extremely reasonable for the amount of food you get. Love that it's fast and fresh.

Overall though, I can't say I was blown away by anything I had.  The pizza was pretty standard, but maybe some of their more specialty items would be more unique and tasty.  I did enjoy the garlic knots, but when they say garlic they mean it... these babies are powerful.  Finally, I'm a cookie person, and though the cookie was good, it didn't blow me away.

All this being said, I'd for sure go back and try more custom pizzas. For the price and service, I'd highly recommend giving My Pie a try!"}
{"text":"I've been ordering My Pie for ages that it's about time I leave them a review. The NY Roni is my favorite and it's always high quality.  
Quick, easy, and quality  what more could you ask for. I would recommend My Pie to anyone!"}
{"text":"IMPORTANT DISCLAIMER

With 75 total reviews, this marks THE VERY FIRST review I have ever updated. Providing fair, unbiased feedback for hard-working local businesses is very important to me and it is often the case that the true value of a concept cannot be judged by a single, subjective experience. In this case, My Pie is being whole-heartedly updated from a 3-Star review to a 5-Star.

A BRIEF EXPLANATION

After learning that the same team of owners who opened Crust Pizzeria also owned My Pie, I had to give My Pie a second chance. Crust Pizzeria is THE BEST pizza I have eaten since my childhood growing up down the street from a little New York style pizzeria in New Jersey.

So I ventured back to My Pie to see whether my initial judgement of the food was perhaps a bit hasty, even unfair. I was very lucky to run into one of the owners, Ryan, during my second visit and he spent a great deal of time with me, describing some notable highlights.

UPDATED OBSERVATIONS

For instance, I never noticed during my first visit that the entire interior of My Pie has been meticulously decorated so as to FEEL like a New York City pizzeria. From wall-length photos of the Brooklyn Bridge to subway-themed ordering instructions to the music playlist (featuring only big-name artists born in New York or New Jersey!).

Ryan also took time to introduce me to the ingredients My Pie has chosen to use including a Sicilian family recipe for the pizza sauce (also featured at Crust), pizza dough MADE FRESH DAILY from authentic Neapolitan pizza dough, high-quality canned tomatoes imported from Italy, and even cookie dough imported from New York and BAKED FRESH DAILY!

I learned that the pizza dough was specially rolled to produce the trademark NY-style crust after baking and that the ovens were firing these pies at 800 degrees F to produce that perfect oven-baked quality with only about 2 minutes of wait time.

And talk about DEALS! I should have mentioned this in my first review, but the pizza here is VERY fairly priced with \"endless topping\" options. Also a decent selection of beer on tap and even Happy Hour deals!

FINAL CONCLUSION

After eating here for a second time and being fortunate enough to speak with Ryan, I came away from My Pie feeling utterly impressed. I can't say I've ever met a more committed, passionate business owner than Ryan. The attention to minute details of food prep, ingredient quality, and overall experience goes over and above what most patrons will ever grasp.

As I mentioned in my first review, there seems to be a recent outcropping of \"fast-casual\" food concepts similar to My Pie, and I've been to several. NONE of them compares to My Pie. Visit this outstanding concept with your eyes open. An awful lot of time and thought went into it. Having seen that firsthand, I know I'll be back.

If you haven't been - GO! You won't be disappointed.

***Thank you, Ryan and the My Pie crew, for working so hard to create a standout experience from start to finish. I couldn't be more impressed with the finished product. Keep up the great work!!"}
{"text":"This is decent pizza but small for the pice  not as good as Costco or pizza huts I perfer them over My Pie"}
{"text":"Use to love coming here. But service hasn't been the same and pizza was noticeably smaller then before. Ordered 2 pies last night and noticed the size of the pies."}
{"text":"I've been here so many times I've lost count. I work right above them so it's my go to place for lunch when I'm not going for port of subs or panda. My favorite pizza by far is the angry bird which has buffalo chicken and ranch. The pizza is always delicious and big enough to save for later, which as a poor college student definitely helps me out ^.^ I highly recommend anyone to come on over!"}
{"text":"Great place for a personal pizza on the ASU campus! My Pie has a unique taste to it which is different than other places like Blaze Pizza. The pizza is pretty large and definitely will fill up 1 person. It's definitely a great place to stop by during lunch if you're in the area."}
{"text":"Another little hidden gem in AZ! This pizza not only is a bargain, but it also tastes very good! Great place for your family and an overall fun enviroment!!!! Highly reccomended. Staff are also very friendly!!!"}
{"text":"My Pie is VERY good.

I've tried three of their specialty pies and have been happy each time.  I'd say the Angry Bird is my favorite, followed by the Power Pie.  

If I was an ASU student or worked at ASU, this would quickly become my favorite casual eatery to stop by.  The wait is always short, the pizza is delicious, and the price is right.  Plus they have lots of specials as part of their loyalty program.

As someone who doesn't work or go to ASU, I would say the only issues are the small dining area (it seems better when it's slow and there's lots of room or if you're taking your pizza to-go), and the fact that you have to pay for parking, either outside or in a parking structure.

Other than that, go enjoy some tasty pizza!  YUM!"}
{"text":"We love this place!!! We always get spicy butcher and create your own pie! Their caprese starter is also really great! Crispy, yummy and fresh!"}
{"text":"I love their pricing for ASU students, and the deals going on during certain hours. Went in to get their New York classic pie and a freshly baked chocolate chip cookie. Both were extremely excellent, with the pizza reminding me of a Fired Pie pizza due to it's thin crust, spread around cheese and sauce, and also the fact of how quickly it was made. The cookie was just as amazing with it being extremely soft and warm, just melting in your mouth."}
{"text":"This place is like the chipotle of pizza joints.  Select your crust, your toppings, and sauce, then they fire it up in an 800 degree Fahrenheit oven in TWO minutes!!  The prices are very reasonable at around $9 a pizza and you can get as many toppings as you would like!  The pizza comes out perfectly crispy!

The staff was very friendly and knowledgeable and gave me outstanding recommendations.  I highly recommend the whole wheat crust.   The garlic knots are pretty good too.  Also they have a club where you get items for free after so many purchases and access to promotions that they send out.  Just for signing up I got a free cup of ice cream!  

If you need some pizza on the fly, this is a way better option than most pizza delivery chains in my book!!"}
{"text":"Yummy pizza! Can't wait to go back soon! Some of the best I've had in a while  oh and even have vegan brownies!"}
{"text":"Wow amazing pizza, yummo. Fresh tasting especially the basil and the marinara sauce, delicious. First time I tried garlic knots and they were free too. They came with a marinara dipping sauce, so fresh and tasty. I got  a gluten free pizza as well and it tasted great, good texture and didn't taste like a cracker. The staff were super friendly too, knew my order as soon as I walked in the door.

Highly recommended."}
{"text":"I stumbled on this place while shopping, funny i was getting ready to go to Blaze. My pizza was good. I like all the classic options. My receipt came with a $5 classic pie deal, that was awesome."}
{"text":"Our new favorite spot! It's affordable and has amazing customer service. Their employees remember faces and even names. We enjoy the atmosphere and the restaurant is always clean. You can tell each employee care about making every experience an excellent one. We love being able to customize our pizzas. They have so many different options and everything is super fresh. We always leave content and recommending it friends and have brought our family. What a great concept! The patio is delightful when the weather is nice as well. Keep it up Mypie!"}
{"text":"Had Pizza here for the first time. Good food great service. They make your pizza in front of you and it's not a huge wait. Very cool concept. Portion size was good. My only feedback is that the cookies didn't WOW me. But I was there for the pizza not the cookies lol. I will be back again!"}
{"text":"Great service, friendly atmosphere, delicious casual pizza to go or to stay.  Choose your crust, sauce, cheese (be sure to add ricotta) and toppings.  The pizza literally takes 2 minutes to cook.  Wine and beer special all day....make it a great dine alone or with a friend type place!"}
{"text":"For those of you seeing all the 5 star reviews and wondering if this place is really as good as people make it out to be... yes, yes it is. I ordered 2 My Pies online (\"Pesto My Chicken\" and \"My Greek Pie\") and my wife made a pit stop on her way home to pick up our order. She said the staff knew who she was as soon as she walked in the door. As soon as she got home with the My Pies you could smell the richness of the herbs and dough. The flavors and quality was phenomenal. I especially loved the \"My Greek Pie\"! They are the size of a small pizza and are about $9... definitely worth every penny."}
{"text":"The pizza here was great...you can choose what kind of crust you'd like, whether it's regular, wheat, or gluten-free. Each pizza is made personally for you, and it's actually very good. I was a little skeptical, but I ordered the Power Pie and it was absolutely delicious! There was a little too much oil for my taste, but other than that, it was very good. The prices are also very reasonable. I will definitely be going here again!"}
{"text":"Quick, organic and yumm. Called in and had order ready in 10 min. Cookies are unfair calorie trap. Try to resist buying one!"}
{"text":"Delicious! Super great topping selection. Welcoming and friendly staff! Will visit again when we are in the area! Come to Tucson soon please!"}
{"text":"We popped in here on a Friday night after finding it on Yelp! and it was absolutely wonderful!! The staff was friendly and very helpful once we told them it was our first time. We ordered the garlic knots (to die for!), 2 crazy delicious pizzas, salad, a glass of wine (2, rather since refills were like $2!) and cookies that I can't stop thinking about. 

The food was fast, fresh, and most importantly, one of the best tasting pizza joints I've been to in a long time! We ate inside, but hey have a really nice quiet patio area as well. We just wish the place was bigger because once it picked up a bit, the place was full! People know about this place and are coming back for a reason!! We will definitely be coming back too!"}
{"text":"Another new concept and this time it is one that actually works mostly. If you sign up for the text club, they will send you pizza discounts and this is when you should go get your pie. I had a $7 any pizza text and decided to give it a whirl. The thing that needs improvement is that they only have one oven and it looks like only three pizzas can fit into that said oven at once. If your pizza can't fit, it sits on the messy table (in my case only 3 minutes) and it waits and waits to enter the oven and when its busy who knows what can land on that pizza with the open air arrangement. Anyway, after the pizza my way came out, it ended up pretty good. The chicken needs some improvement and the meatballs are pork and beef combined (not a fan), but I like the fact that it is the same price for anything you throw on there. The staff is kind of young and goofy also, maybe someone who looks over 21 would give the place more respectability."}
{"text":"Good pizza!!! Had a salad and it was good as well.  Best to go and order, don't phone ahead for pick up-have several crusts and lots of ingredients to choose from. Very casual atmosphere- stayed at embassy suites and this is super close!"}
{"text":"Ordered through Uber eats. Not enough toppings with the salad compared to how much lettuce is given but it was fresh. I also ordered it with chicken which was forgotten. Pizza was OK."}
{"text":"Mypie has the BEST gluten free pizza crust I have ever tasted. I've been gluten free for about 3.5 years and have tried tons of different pizza's, but this my friend takes the cake! It's a beautifully delicious work of art. I've tried the Hawaiian last time and it was legen...wait for it....dairy!
 I have visited this place twice, and now expect to be a regular customer. This place has a wonderful vibe and ambience too! The only thing that they could use improvement on is the staff. For the most part a lot of them are wonderful, but there are a few with some not so friendly faces. 
  Overall, I love this place and I'm so glad to be able to call it my favorite."}
{"text":"Love! Love! Love my pie! Custom pizza with fresh toppings. Made fresh before your eyes! Great staff always helpful and accommodating. You can have a glass of wine or a beer if wanna. :) Patio seat for when it's not hot as hell. Community minded. Really one of the only pizza places I can eat at. Delicious!"}
{"text":"Great pizza and wonderful service. The chocolate chip cookies are warm and yummy. Several different pizzas to try with some neat and different stuff sometimes."}
{"text":"Love the fast service and great music atmosphere. The my pie crew is especially attentive to making sure you have what you need and are enjoying your pizza too!"}
{"text":"Good Pizza, comes out fast and tastes great! I like the concept!"}
{"text":"Don't let this quick-service pizza place fool you, it is one of the BEST pizzas I've ever had. Such reasonable prices, build your own and get everything you like on it or pick one of their combos. My personal favorite is the pear-fect pie which has pears, balsamic vinegar, and Gorgonzola cheese. The combo may sound gross (I thought it did, until I tried it) but it is AMAZING. You can get it half and half with something else too if you don't want to commit. All in all, 5 stars for food and the service has always been good and friendly. Wish there was one on the west side!!"}
{"text":"Awesome! I love how you can customize your pie. Staff is friendly and the gluten free pizza is pretty good!"}
{"text":"Service. Simply phenomenal!! Food always comes up quick, hot, and simply amazing!! Management truly stays on the employees  and they make sure the staff persons"}
{"text":"Ah man, this stuff is great! If you can imagine a pizza version of subway (but good) then you'd have My Pie. It's inexpensive, quick and tasty as hell. I'm a repeat customer and any time I'm in the area I'll grab My Pie every time."}
{"text":"I haven't actually tasted my pizza BUT, my experience was great  There were two young men working and one girl with shorter hair. (Sun 2pm shift). They were pleasant, quick and attentive to my dairy allergy and questions. They even have VEGAN garlic knots, YUM! I'm excited to taste everything. I very much enjoyed the staff during my visit."}
{"text":"This place is heaven. 
Enough said.
My favorite, the spicy butcher.  

Spicy and delicious!"}
{"text":"This place is pretty cool and tasty. Inside has an industrial rustic vibe with a cool patio outside when the weather permits. Two large glass garage style doors can be opened up to the patio when it's time to party.

The ingredients here are very fresh and are better than what you get when ordering delivery. They have 5 different sauces, 3 different crust types, and several different cheeses that you can select. They even have a gluten free version and some vegan options. Nice!

The pizzas are about 11\" and are cooked super fast in their very hot oven. It was fun to watch them make the pizza right in front of your eyes. They will build it however you want or you can go with any of their signature pies.

Had to try one of the Spicy Butcher Pizzas while the wife went with a Margherita with fresh mozzarella. They both came out in 10 minutes or less and were brought straight to the table. The tenderness of the crust and the perfect balance of toppings made it a yummy treat and tasty good.

They also have Starters, Salads, Sweet Tooths, and cool selection of Beers and Wines. Right next to Sprout's and in the same parking lot as Out-N-In. See ya there next time. CHEERS!

4.5 STARS"}
{"text":"I'm from NY and its hard to compare pizza when the best slices are in your hometown, but this was surprisingly very good, def will be coming back!"}
{"text":"Great pizza pie's! Customized they why you want with lot of great ingredients to choose from and lots of sauces to try. They have regular crust, whole wheat and even gluten free. Must try fe those pizza lovers out there."}
{"text":"I order this often from grub hub. I love their food especially their calzones and chocolate chip cookies."}
{"text":"Individual size pizza, they have a few house combos or you can pick your crust and ingredients. Dough is made on the premises. They also have salads. Great chocolate chip cookies. Very friendly staff, glad to help with your order. Fast service."}
{"text":"Went to My Pie last night with my kids, absolutely AMAZING!!!!  I ate the meatballs and my kids ate their own personal pizza. We shared the garlic knots, which were out of this world. We decided to eat outside since they had the heaters on, what a perfect night.  We will definitely be back!!  HIGHLY RECOMMEND!"}
{"text":"Good pizza.  I really like the crust. It's an interesting concept -  walk in,  choose your crust,  then choose your toppings and they flash coom it at 800 degrees per the guy at the counter. It's not a filling pizza,  but it's tasty."}
{"text":"I've wanted to try this place since they opened. I have no interest in going back. Costco across the street would have been just as good. Service was friendly, the store appeared clean with a nice atmosphere. The selections sounded delicious, but the end result was a boring overpriced pizza. Since you order your pizza \"Subway Sandwich\" style, you can view all the ingredients. They didn't  look very fresh. The dough is formed ahead of time and sitting out on individual wooden boards. The blue cheese crumbles looked like they were dried out, translucent and filled too high to be at proper temp. The sliced sausages was grey, not reddish as a fresh batch should be. Granted I'm pretty picky when it comes to my food, but I do believe if your ingredients are going to be on display, they should at least be fresh."}
{"text":"Not the best gourmet pizza shop in this area, but definitely a good option. The coupons via the text messages are great... And most of the times we drop by, it's with one of these. My only complaint is that even a minor change or substitution to the classic pie takes it out of the classic pie price range and puts it into the custom pie range. Not really an accommodation to food allergies, in my humble opinion. However, a very good pizza option nonetheless."}
{"text":"Nice selection of pies! I ordered My Uncle Nicky, it was delicous. Served quick with a good selection of beers with $2 refill."}
{"text":"Love this place! Pizza any way you like within 2 mins. I especially like that they offer vegan and gluten free options. They also serve the biggest and best chocolate chip cookies.  Super friendly staff. When I think pizza, I think My Pie. All smiles every time."}
{"text":"My son and I are both big pizza fans so we figured Hey a new place why not try it.  Well I'm glad we did because it was amazing.  I had a pepperoni pizza which was among the best I've had in town, and my son had a calzone which he said was in his top 3 of calzones in town. 
 The staff was very friendly the menu is very simple to use and they make everything right in front you a great experience.  They also have freshly made cookies which were amazing. Great price point, great service, great staff, great food. My Pizza  Is very appropriately named because it will be my pizza place on my side of town from now on."}
{"text":"What better way to start the new year than to have a 5-star food experience. This place makes really good pizzas fast, and the make-your-own concept is pretty simple: choose the kind of crust you want, then choose the sauce, the cheese, the topping, and finally the protein. All ingredients are displayed in front of you, which makes it easier to choose and  decide. You get the pizza a short time after ordering, thanks to the high heat of their oven. I chose a gluten-free crust, marinara sauce, mozzarella, peperocini, and pepperoni, and paired that pizza with a Grand Canyon pilsner. The pizza was so good (and having come from a gym workout, I was pretty hungry) that I ordered another pizza! This time it was a classic Margherita, and it was equally delightful. The guys staffing the place were really friendly, the pizzeria had a comfy dining space, and free WiFi completed the awesome pizza dining experience."}
{"text":"First time trying My Pie Pizza and we were blown away. Ryan and his staff were awesome, very helpful and friendly. I brought home the Spicy Butcher, Power Pie, Margherita, The New York, and garlic knots. From the spice of the Butcher to the traditional Margherita's creamy mozzarella...the flavors were spot on! Sooo delicious. We've tried many similar pizza places and have not been back. My Pie Pizza has raised the bar and we will be back for sure!! Thanks for an awesome dinner."}
{"text":"So happy we tried this new place out! It's in a great location in the Walmart shopping center. 

*Customer service was on point! All of the staff that helped us out were super nice and recommended amazing pizzas! One of the owners,  Richard brought our food out to us & he was extremely friendly! Happy to see good people succeeding! 

*Pizza was delicious! Their sauce recipe is out of this world! Coming from a family of chefs .. the sauce can make or break a pizza! They had tons of creations already listed or you can make your own. Love having the options!
*Love that they offer gluten free and wheat dough but I think a low carb cauliflower pizza would be SO awesome!!!*

*Garlic knots were AMAZING! Usually I don't get any sides and garlic knots aren't my go to but thanks to the staffs recommendation we went for it and were not mad about it! 

 *Beer on tap!  YES! 


Overall, this pizzeria may be like some others in the area however, they really do stand out once you give them a try! Highly recommend!"}
{"text":"Super delicious! Went here for Father's Day and had an amazing pizza experience. Staff was very friendly. Gluten free pizza was bomb!"}
{"text":"Price, freshness, speed great prices. This is a great place.  Love the concept.  Only thing I would change is that they need prosuttio as a topping."}
{"text":"LOVE this place! Their pizzas are delicious. I love coming here with my family. The quality of food is amazing. The staff is friendly and respectful. I wouldn't go anywhere else for pizza."}
{"text":"Hands down: Amazing! The menu, the service, the team, the flavor profiles. This isn't your standard Za joint - it's high quality ingredients in a fast-casual environment. Do yourself a favor, and treat yourself to a glass of vino and a pie! You can build your own pizza, or let them make a recommendation based on your pallet description! Love me some My Pie."}
{"text":"This place was awesome !!! Garlic knots, Caprese, the Angry Bird and Spicy Butcher. Yumm!!!"}
{"text":"I've been wanting to eat here since it opened. Not impressed.  Had a calzone and my daughter had a margarita pizza. It looked awesome being made and I starting to eat it and it was so bland. I had pepperoni and olives mushrooms and sausage and I couldn't tell anything apart. I've had. I had better pizza at Little Ceasars. I'm defiantly disappointed."}
{"text":"It seems like there are a growing number of these ready to make pizza restaurants recently which is definitely not a bad thing! Although the pizza was quite good, the garlic knots were the real winner in my opinion and the marinara sauce included really complimented the garlic knots. The service was friendly especially the guy who was making my pizza at the time had a great attitude, forgot his name though.

If I didn't live so far from the location I would stop by more often, though I may have to try out the Tempe location sometime. They do have some deals going on every now and then so I'll probably come back at some point in time."}
{"text":"My Pie has become my \"go to\" place for pizza.  The pizza is delicious and the perfect size for one person.  I usually get it to go as I'm stopping by on my way home from work and want to get into my pjs as soon as possible.    

The staff is so friendly.  I like that they recognize me as a regular.  I use to order the same pizza all the time but they have encouraged me to try new ones and even got me hooked on their salads."}
{"text":"Yeah, we love it.  Just went again last night.  Not a ton of seating if it is too cold to sit out.  This is from the same folks as Crust.  Picture the assembly line at Chipotle but making terrific pizzas instead.  Pizza is done in less than 5 minutes, no idea how."}
{"text":"Love this place, it is from the same people that own Crust, so I was happy when we chose it for our last twins mom night out.  Their HH is amazing, I think I had my pizza and a beer for less that $12.  The concept is really neat.  You choose your crust, they offer white, wheat and gluten-free and then your can choose your toppings.  If you are not up to making those decisions, they have some suggestions on the board.  They also offer salads.  Tim is always so helpful with the wines or beer.  The first time I went we were a large group, so it took a bit to get all the pizzas out.  We were 20 women, we took over the patio area, Armando was also very nice helping us with refills for our drinks.  I enjoyed my experience so much that I had to bring my hubby. The weather is so beautiful right now that we couldn't resist but enjoy the patio.  He chose a wheat pizza, so I had the opportunity to taste the crust.  It was really good.  I might get it next time.  Although their regular crust is so yummy and chewy.  We'll see."}
{"text":"So fast and good! Love the ingredients there are to customize your pizza. Mr. White is my favorite. The only thing I didn't really love was my garlic knots. Pretty mediocre. But the pizza is delicious."}
{"text":"Taste from Italy new York style love it. My new pizza joint for sure great for my family"}
{"text":"Tried this out last night, after some disappointing attempts to find reasonably priced and good pizza in the area. I was thrilled to see their setup and loved the intro and explanation of things from the person taking our order. The pizza is thin-crust, so if that's not your thing, this probably isn't the best place for you. Thankfully, I love thin-crust pizza. I had the My Greek - and it was awesome. The crust was perfect, ingredients tasty, overall flavor was on point. We also tried the Sneaky Salami, Hot Hawaiian, and the cheese and pepperoni kids pies. All really good. Both kids ate their whole mini-pizza, which never happens. Garlic knots were awesome - lots of flavor and super garlicky. Took some chocolate chip cookies to go - also good. Finally, a good thin-crust pizza place! Would definitely come here again."}
{"text":"Lunch hour ground zero:  Tatum and Cactus.  Pretty much whatever you want is available within 3 minutes of the epicenter of this seismic fault line of culinary delights.

This is a battleground that actually toppled a Culvers. I didn't think that was possible, it was like seeing the Statue of Liberty washed up on the shore in Planet of the Apes.  Whoa, is that what I think it is?

In other words, game on and My Pie has game.  Simple concept, walk in and order one of their specialty pizzas or have them put together a masterpiece that only you come up with.  I had the Spicy Butcher and it was a terrific pizza. Served fast and right out of the oven, made for a tasty lunch.  I overindulged a bit and in addition to scarfing the entire pizza in one sitting (I think it's big enough to share or take half home), I also devoured one of their monster chocolate chip cookies that they shamelessly and without a hint of remorse have at the counter for weak-willed, belt-expanding lost souls like me.  I sat there and literally counted the calories somewhere in the Y2K range (why indeed).  I always try to cleanse my palate with a morsel of chocolate after lunch but this took it to a new level.  I had a months worth of cleansing in one sitting, and don't think I won't want more chocolate tomorrow.

Solid four stars and I'm going back again this week.  Liked the vibe and the service was friendly and helpful, give it a shot if you enjoy great pizza."}
{"text":"Was great service at first which brought us back the second time.  Then realized the pizza was small and undercooked after the well done request.  I suggest try once and see for yourself.  I'm now in search for the cheesiest nummiest greasy pizza to fulfill the pizza desires.  Oh and PS don't give them your phone # they text you all the time....annoying."}
{"text":"My wife and I love heading up to My Pie for their $5 Monday classic pizzas. Their pizzas are delicious and an outstanding value, especially at that price. Our favorites are the Mr. White and Grandma's Pie. All of the specialty pizza's we've had are also great. My favorite on that list is the Spicy Butcher. 

I think the thing that puts My Pie on top is their ingredients. And they don't skimp, so you have to be careful not to get carried away and put too much on your pizza creation! 

My Pie has a dog friendly patio and have offered my dog a pizza pan of water every time she's come with us. :D

Make sure to sign up for the deal program. They really do give you great discounts and free stuff, not just marketing."}
{"text":"Great management at MyPie. After writing my review the manager quickly contacted me and offered my a gift card so I can get a pie on the house. I decided to go with a pre-made pie that was on the menu, I chose the Hawaiian one. It tasted great and the service I received was great as well. I definitely don't regret giving this place a second shot. Thanks to the manager for his great cooperation."}
{"text":"Angry Bird pizza was amazing! Chocolate chip cookie was excellent! Customer service is world class!"}
{"text":"Decided to give them a try.  Good pizza and good salads.  Prices not bad.  Servings are generous. Tried the garlic knot bread, yum. Staff very friendly, knowledgeable and helpful.  Would eat here again for sure."}
{"text":"my two girlfriends and I came here on a whim after our first choice was closed (why we didn't check Yelp hours until AFTER we got there, I just don't know).  It was a great find! They make individual pizzas to your order and everything tastes great and fresh! It's a little more expensive than your typical chain pizza place but since everything is made to order, worth it."}
{"text":"This place exceeded my expectations! Ordering and everything went smooth. Upon enjoying our pies, my wife found her pie, not quite what she expected (more spicy than bbq, which was what the name implied and listed bbq sauce as the first ingredient). Ryan came by to ask how we were enjoying everything and my wife commented that they should add more bbq sauce and less Frank's hot sauce-simple constructive criticizm. He then insisted she pick another pizza that she would enjoy. He insisted, and brought it out free of charge. We left with more pizza than we ate. Great service and they work hard to make their customers happy! Will be back."}
{"text":"I came by here last week for a one o'clock lunch and was impressed by the quality and taste of their pizza. 

We've been to Crusts a bunch of times and have never made it over to their new quick individual pizza place near the PV Mall. It's actually few doors down from where the old Atomic Comics use to be.

I find MyPie is very similar in setup to Fired Pie on Northsight. http://www.yelp.com/biz/fired-pie-scottsdale#hrid:aWt21x1Kt7IlKg41opmbug  But the taste is better at MyPie in most instances and they excel -- way over the top at customer service. Crazy nice!

I went with the Margherita ($7.49) pizza (photos) with some sweet italian sausage ($1.00).  It was very good, so I ordered a regular one without sausage for home.  That pie wasn't as special as this, but overall slightly better than the one at Fired Pie.

Recently, the WSJ had an article on how Chipotle Mexican Grill Inc. has quietly joined a growing group of restaurants aiming to change how we eat pizza. http://m.us.wsj.com/articles/SB10001424052702304403804579264220659257040?ref=/news-lifestyle-arts-entertainment  

My friends in SoCal tell me these are very similar to Pieology: \"Pieology prides itself on providing the best tasting, healthiest kustom pizza in the world. Using only the freshest ingredients, Pieology provides smoking hot pizzas in under 5 minutes.\"  

Whereas, Fired Pie says: \"Fired Pie, a fast, casual, rich in flavor customizable pizza and salad made from scratch using fresh ingredients just the way you like it - all at a respectful price.\"

No matter!  I like My Pie slightly better than Fired Pie, but both are very good.  Expect to pay $10 to $12 for a very tasty individual wood fired pizza.  So Four Stars, and yes I am a Fan.

Enjoy!"}
{"text":"Good artisan pizza. But a tad small on the inside (small children in the restaurant... It's easier to get take out)."}
{"text":"Fast and delicious.

Build your own or pick one of their creations. Opt for the sales pitch from the server if it is your first time there as they will explain it all and offer up their recommendations. I opted for the Uncle Nicky with ricotta and meatball. The crust is perfect. Crispy yet chewy. The sauce was a little bland but overall the pizza was good. My husband had the plain NY and really enjoyed his. I tried a bite as his sauce was different than mine and I found that it was better but still not great.

We ordered, grabbed a soda and then ate outside on the patio as the weather was perfect. My husband devoured his pizza but I still had half of mine left. They have small to go boxes ready and waiting so you can pack up your leftovers and be on your way."}
{"text":"Fantastic pizza. The garlic knots though... amazing!

The owner and staff were very pleasant and professional.  I will definitely be a regular customer here."}
{"text":"Pizza is great. Beers are great. Garlic knots are delicious. Owner is soooooo friendly and gave me a free (and delicious) chocolate chip cookie for being a first timer."}
{"text":"LOVE My Pie, I come here on my break at least once a week and I have yet to be dissatisfied. Grandma's pizza really tastes how I imagine somebody's grandma's pizza being. 5/5, would recommend!!!"}
{"text":"I cannot get enough of this place. Before I left for a year abroad, one of the employees started to recognize me and would remember my pizza when I'd come in. As you could probably tell, I've been here a lot. I just never got around to writing a review until now, a few years after my first visit.

When I tell people about this place, I usually tell them \"It's like Subway, but with pizza.\" You can choose one of their menu pizzas, or you can make your own (which I love)! I get a chicken alfredo pizza from them regularly (white crust, garlic+alfredo sauce, parmesan, mozzarella, and chicken, if you're curious), and it's just amazing. I could eat it every day.

If you like pizza, give it a try! You can decide what you want, so it's hard to be disappointed."}
{"text":"Seeing the other reviews and the fact that this is in my neighborhood I thought I'd finally give it a try. To be honest (and to date myself), this location has always been a pizza place. Way, way back it was called Sammy B's Pizza. Loved it then.

This is a small place, not much seating inside but more outside. Everyone I interacted with was very friendly and explained how it all works. I got a pizza, half salad, order of garlic knots and a cookie - TO GO.

The service was good from everyone except the 2 guys whose job it was to cook the pizza's and get orders out.  There is not a lot of room back where they are and they seemed to be constantly in each other's way. This seemed to slow them down too.

I saw my pizza come out first and then sit while one of the guys just kept ignoring it to deal with inside orders. WTF?!  It sat and got cold until one of the other worker's told the guy to get the rest of the order going. It took them way too long to get the salad (lettuce, cheese and dressing), and garlic knots together to finish my order. This is my biggest disappointment of my experience. 

Price - fair for what you get

Food - pizza was fine. I think I will have to play with getting some other toppings so it tastes a bit better. It wasn't bad pizza, but it also wasn't the best pizza either. Somewhere in the middle. Good for takeout and to satisfy a quick pizza craving.  The garlic knots were decent as well. Again somewhere in the middle. I've had better elsewhere. These seemed to be lacking enough garlic flavor, they were more just oily.

I will definitely try this place again and hope for a more satisfying experience with food and service. Fingers are crossed!"}
{"text":"Manager reached out to me about my review and thanked me for the input.  What a nice thing to do!  He is dedicated to addressing any and all issues.  They value customer feedback.  Thought it was the right thing to do to let everyone know this is a company that values their customers and wants to be successful!"}
{"text":"I've been here twice and have loved the pizza and salads both times and will definitely be back!  It has the same concept as MOD pizza, where you can build your own, but executed WAY BETTER! It's so much better! Seriously, this pizza reminds me of New York pizza and it's Really good! The crust has the right texture that I miss when I'm not in New York and being able to customize is great! The sauces are tasty and the toppings top notch! The service was good and the food came fast. I'm really impressed with My Pie! They even stayed open late for us. Thanks My Pie!"}
{"text":"Tasty tasty. The garlic knots are amazing and so are the pizzas. Good crust, all kinds and dairy free cheese is available."}
{"text":"Great pizza.  Monday is $5 for their basic pizzas which is a really good deal."}
{"text":"Better than Blaze Pizza. More sauce choices and much better salads. Garlic knots, the New York pizza and Southwest Chicken salad were really good. Plus, if you order a beer or wine ($6) , it's only $3 refills! Staff was super friendly , kitchen looks brand new and restaurant was very clean. Hope they add a TV or two"}
{"text":"don't give this place your cell number because they will text you to death. pizza tastes like rubber tube.."}
{"text":"Of the line-order pizza places,  this one is by far the best!  Great crust, tasty sauces and quality toppings.  The dough cooks perfectly and their form press makes it so your pizza is consistent.  Had an issue with this at one of their competitors where the pizza was half the size as normal because of the person who stretched it.  

Actually had an issue on one of our visits,  the kid bringing out the pizzas accidentally dropped them.  They were very apologetic,  expedited new pizzas for us, gave us free pizza coupons for the next visit and gave us some complimentary Garlic Knots - WOW!  Great customer service and we've been back several times since.  Also, now that we know how good they are,  we cant go in there and NOT order the Garlic Knots.  They are the best we've had anywhere. 

Only downside is it is not a huge place so they can be pretty full and hard to get a table at times."}
{"text":"Our favorite \"dine in\" pizza joint. 
Great food and customer service. 
Best music play list around!!!
Spicy butcher, garlic knots and the Margherita are some of our favs!
Don't forget the cookies...."}
{"text":"After coming to this place consistently for months now I have to pay tribute to their consistency.  My girlfriend and I come here what seems like at minimum once a week sometimes more.  The pizza is pretty much spot on every single time.  Most of the employees seem to stick around as we haven't seen much if any turn around since we started coming here which says a lot for any type of restaurant.  

I am always trying to tell people about this place any chance I get.  I don't think I can ever order a pizza delivery service again because I will always compare it to MYPIE now.  

One thing I would love to see them offer though would be maybe a garlic cheese bread mini pizza option or maybe a type of dessert pizza which would be awesome.  Never the less this place will be a weekly stop for about as long as they are open which I hope is a long time."}
{"text":"Deliciousness in a pizza....the MR WHITE is great! LOVE that they offer Gluten Free crust.  Now, if only the garlic knots came gluten free....I'd be in heaven. Sometimes, when they are busy, the service can suffer a little bit. But on the whole a great place.  Side note...the real genius of this place is the fact that they get you to STAND in line...freeing them up to operate in a small location....business brillance!"}
{"text":"Pizza with limitless options. White, wheat or gluten free crust; different sauces and cheese and countless toppings. They charge you one price for a pizza, so you can go to town with the toppings. 

Salad options are a limited, but I manage. Great, weeknight dinner!

True test is the line out the door. It does take time to get through, but worth it."}
{"text":"I really like this place. At first I was a little confused about the concept . . . I could choose my price and select as many toppings as I wanted for one price?!  It seemed too good to be true~ just to test them I went to town and selected 5 different toppings. The good stuff too like caramelized onions, grill chicken breast, some delicious hot peppers, portobello mushroom, ham on a wheat crust and sure enough it was around $10. Unbelievable!  My son had their ham and pineapple on white crust and he loved his pie!  The serve was quick and friendly and I loved the smell of freshly baked chocolate cookies. I saw them on many people's orders~ who can resist?!  This is a great place to come for casual dinners especially for families with picky eaters. You can make your own pie, just the way you like it without breaking the bank!  As mentioned in several of the other reviews, their HH is incredible. I haven't been here during HH but I'm looking forward to giving it a try!"}
{"text":"By far the best build your own pizza place I've tried. Crisp crust, but not crunchy like a cracker, more crisp and chewy. Very good. I was happy to see the diya cheese, my food allergy kid is going to love this place. Only change I would've made is adding mozzarella to the perfect pear pizza. It is reminiscent of my long lost pear and gorgonzola pizza from CPK! Cant wait to go back and try something else!"}
{"text":"Okay I actually love this place and the food and come here a lot but do not come in the summer. It's way too hot I had to take my pizza to go. The employees must hot as well because they are covered in sweat."}
{"text":"Great food and great concept!  I loved my meal and loved the ability to build my own pizza and have it ready in 2 mins.  I hope they open more locations!"}
{"text":"This is such a great concept executed to perfection! Love the fresh homemade crust and garlic knots. My fave is to get a grandma's pie and customize it with a little kalamata olive, roasted red pepper and artichoke. I definitely recommend their classic pies but if you do customize don't over top. this style of pizza isn't meant for the whole kitchen sink. Also I like the Mediterranean lover salad you can tell everything was chopped in house that day. We need more restaurants like this! You can't beat affordable and fresh!"}
{"text":"I love this neighborhood place....you can get one of their classics or customize your pizza and it's pretty much along the lines of how I've had pizza in italy for a really decent price. The rewards club is awesome.....free pies or cookies. One thing I have yet to try is their salad. Today was my birthday and I came in ordered my pizza and my beer with a cheap $2.00 refill tge paid......well after eatting and sitting here....one of the guys comes up to me....hands me a pizza and say's.....this was extra....have lunch tomorrow.....right on!"}
{"text":"We enjoyed the atmosphere, the staff and the food.  You have a lot of options for your pie.  You can also get salads, calzone, panini and dessert.  We will be back!"}
{"text":"Grant and emerald were awesome!  

Very professional and the pizza was great like always."}
{"text":"New pizza place in Centennial Hills in the Walmart parking lot. It reminds me of Blaze pizza. Kind of pricey for the kind of pizzas we got. I had the Pesto My Chicken pizza. I was a bit disappointed when they used diced chicken pieces like CiCi's. They don't have a whole lot of toppings to choose from. On a side note: The garlic knots were really good! I would recommend the garlic knots for sure!"}
{"text":"This place is really awesome. One of those fast pizza joints that you can either make your own or choice from one of theirs. The sauces are really good especially the spicy one. The app is dope since they accept Apple Pay and that's awesome! Price is great and the cookies are dope too."}
{"text":"I brought my 11 year old and he's been begging to go back! Pizza was good. Price was ok. Service was excellent! I always appreciate friendly and helpful staff when I go somewhere for the first time. I noticed they serve wine. I will be back, either to take my kids, or casual meet up with a friend."}
{"text":"One word. DELICIOUS. 

I got a build your own with double pepperoni, tomatoes, pizza sauce, garlic and oil, and mozzarella. It was one of the best pizzas I have had in a long time. I especially love the pizza dough they use. I would highly recommend it to any fellow pizza lovers."}
{"text":"I have been going to this place since a long time. I always come here when I have breaks between classes cause it's close to campus, they never disappoint. The spicy tomato sauce they have as base is the best. They also have cookies that they make fresh everyday. It's a small place with great food."}
{"text":"Great pizza done my way, love it! Also excellent music playing during our lunch. Fabulous....Ill be back for sure and I hope a ton of people discover this strip mall gem!"}
{"text":"The made to order pizza fad is in full effect in downtown Tempe.  My Pie is one of my top pics. for a few reasons.

Great crust, even the wheat crust is light crisp and has a decent flavor.

Good deals especially on class pies after 3 or with the $1 off for ASU students

Distinct flavors. I just tried the \"grandma pie\" and the sauce was tart, the cheese was salty sweet and the garlic pungent, just ask my co workers in my meeting afterwards.

I also like the fact they get the condiment lids correct, slots on the red pepper and holes for the cheese."}
{"text":"First off my wife needs to have the glutton free options due to being celiacs.

So when she wanted to order a pizza from them I didn't think the crust would be any good, I was very wrong. Now I don't need glutton free but when we order pizza I like to share whatever we order. The crust was really good and the pizza options were plentiful. Love the garlic knots, but you better like garlic or you will not like it."}
{"text":"We've wanted to try this place for a while and wish we hadn't waited so long! Great pizza! Love being able to choose the type of crust, sauce, & toppings I want - or, choose one of the menu items. We opted to go for the menu selections since it was our first visit. Spicy butcher lives up to its name - spicy! With hangover heat! But very flavorful. The margarita pizza was delicious. We're already thinking about what to get next visit."}
{"text":"Really tasty pizza and a good price. Very quick and friendly service, you can choose to have it on wheat as well. I would come back. I would go with the \" spicy butcher\" pizza."}
{"text":"All these stars given by fellow Yelpers are well deserved for MY PIE. I've probably visited this place with different friends and family members a dozen or more times and I've never been disappointed. One price for pizza and you can become a combo wizard with just about any great topping you can think of. They offer a great gluten free crust as well that I understand is bought from a California company after an exhaustive search. The crew here is professional and extremely helpful and willing to go the extra mile to make sure you're getting the pizza you want. There is one gentleman in particular that deserves kudos. He appears to be always working and is so good with the patrons. My wife comments on it every time and hopefully the owners know what an asset he is. If you're in the area, you have to stop and grab a My Pie...it will only take you 5 minutes max and make sure to throw in a chocolate chip cookie...those are dangerously good and gooey."}
{"text":"The food was decent. But lacked an edge or uniqueness. Service was slow given we were the only ones in the store at the time."}
{"text":"This place is awesome. The pizza was fantastic and was very tasty. Met the management as well and they are committed to a good customer service experience. Will be back!"}
{"text":"They provide a great tasting Pizza Pie and they're all very friendly and happy to help.

I'll definitely be coming back again."}
{"text":"I had passed this place numerous times while shopping at Sprout's and/or Gamestop.  Today I decided to stop in and check it out.  The restaurant features personal pizzas for all tastes.  The dough is white, wheat and gluten free with toppings ranging from mozzarella, grilled chicken, ham, bacon, pablano peppers, etc.  The price range is under $10.00. 

I must say that the ingredients are fresh and high quality.  I ordered a gluten free pizza since I have a subtle reaction to gluten. It was simply delicious and filling.  The pizzas are 11\" in size and come in a custom box.  If you enjoy a personal pie now and again, this is your place.

The staff is friendly and outgoing.  The restaurant has a San Francisco Bay Area feel to it.  There are charging cables for phones and electronics and LED lights above.

A gem in an otherwise over franchised neighborhood."}
{"text":"We were randomly choosing a place for lunch and this was a total hit. They serve build your own pizzas and salads. We had the pear-fect pizza which was light and delightful--it didn't have much (or any?) sauce and only used Gorgonzola cheese but it was delicious. Everything tasted really fresh. We also got the health nut salad which was even better than the pizza. The chicken was fresh and tender and the salad was really well balanced. I got free garlic knots for checking in which were also yummy. The ambiance was great too. Highly highly recommend."}
{"text":"Best my way pie ever!!!!! Great employees!!!! It is worth the drive!!!!"}
{"text":"This place seems to have upped it's game. Very friendly staff, good food and I love the app that sends me texts when discount deals are live. Dessert knots are delish!"}
{"text":"Great pizza. Great service. Cool interior. Loved the garlic knots! My daughter loved playing with the dough they gave her."}
{"text":"The pizza was delicious. We ordered a make your own. Fresh mozzarella, basil, tomato. Wow very good 
Also, we ordered a salad with balsamic dressing that they make in house. That was so good I will order that again. 

Now, the garlic knots..... OMG,  I wanted to order another. Amazing , cooked perfect! I've never had garlic knots as good as these. 

On a scale of 1-10 

I give all three that we ordered..... 10! 

I'll be back again and I will bring others who will be hooked on their food as well!"}
{"text":"Bought a Groupon for this place and I'm glad I did! The staff were all so friendly, atmosphere is great and the pizza is delicious! Would definitely be coming back"}
{"text":"We've been here twice now and I've only had one pizza I like- the power pizza with onions instead of almonds. My boyfriend has tried the angry bird, mr white, and some other meat type that were all less than good. It's fresh and fairly fast. I love the thin crust and customer service has been good. everything tastes fresh. The best: sauce with Evoo, it makes the crust more moist which beings out the Flavors. I'll likely continue to only order the power pizza. Wish there were more good pizzas. Oh and they're fairly small too! Enough for one hungry person or two less hungry people to share and split a salad."}
{"text":"This is my grandpa's favorite pizza place so today after hearing they have Gluten free crust and toppings, I decided to stop in... After just learning about my sensitivity, the staff made everything super easy for me! They are friendly, kind, funny, personable and made the experience that much better! The Gluten free is amazing! Looks great, tastes even better! I'm definitely excited to come back! A HUGE thanks to everyone there today(-:"}
{"text":"Wife and I had a pizza craving, so we came here to attempt to satisfy it.  Staff was friendly and the restaurant was clean.  Had a Chipotle style feel only with pizza.  After building the pizza the food came out in about 5 minutes.  The pizza was average at best for me and the garlic knots that everyone claims are so good were also average.  I am not a fan of thin crust pizza, so Im not sure this pizza had a chance with me.  I can say my wife enjoyed hers."}
{"text":"I really like this place.  I like pizza and at my pie I can have it made quickly just the way I like it.  The prices and service have always been great each time I pop in."}
{"text":"I genuinely do not understand the good reviews for this place. The pizza had ZERO flavor! I was actually impressed by how boring and tasteless this pizza was, considering how easy it is to make a decent pizza (frozen is even better than this place). Do not recommend."}
{"text":"I came here a couple weeks ago with the husband for lunch using a groupon? the place is very much like a chipotle for pizza so it was kinda fun to be able to put more than two toppings on. The pizza was definitely more than enough for both of us.

I am not the biggest fan of pizzas in general so thats probably the main reason i,wont be running back but they also have really good daily specials so maybe on one of those days when I have either pizza craving"}
{"text":"Delicious custom pizza, reasonable price, friendly and fast service...will definitely be returning ! Thanks My Pie!"}
{"text":"I ordered over the phone and had a Groupon.  It was my first experience but will not be my last! I ordered Margarita and Granny pizzas. Everyone working there greeted me with a refreshing smile and seemed sincerely glad that I was there. The pizzas were fantastic. I am so glad to have this wonderful place close to where I live. I savored the customer service component because it made the whole experience so nice. Cheers to the great team of people working there!!!!"}
{"text":"Aaarghhh, I am not going to honor my word... let me explain.
We came here for dinner again like 1.5-2 weeks ago.

I love this pizza! Well, I love my combinations that I can select : P
Donald I believe is the person that took our order and made our pizzas... he is an angel, so nice and patient.

Hubby had the spicy butcher, and I had the same plus tons of vegetables (artichoke, mushroom, spinach, olives). I love it.

Daughter had some chicke pizza with ricotta cheese... it was fun to watch how they dispense the ricotta cheese in like a big syringe : )

Now, about me not honoring my word, the crust was black and burnt again : (

Hubby's was OK, mine was so so, totally black in some spots but it was not that bad, daughter's though was a little more burnt and she said a few bites tasted bad : (

I will make sure to mention next time when placing the order, see if that works : )"}
{"text":"Oh yes to My Pie!  I met a friend here for an early lunch with our teenaged sons. It was so good. I had the Pear a Pie with the drizzled balsamic sauce and it was divine. We stayed for a long time and our sons played a board game at all our table which got quite loud and did not seem to bother anyone.  We had the patio to almost to ourselves on a sunny winters day. The staff was so knowledgable and my friend got a gluten free pie.  They even had a gluten sensitive pie crust choice for the next level of gluten free dietary needs
.  My son had a Caesar salad and we had the bread knots and to die for chocolate chips cookie.  I will go back it was so yummy!"}
{"text":"I used to live off this pizza when I was going to college. The staff are really cool, the ingredients are fresh and the price if you have a sun card is pretty great."}
{"text":"Great new pizza spot with a very nice staff. The food is great and they have some vegan options which is hard to find in the pizza world."}
{"text":"We had a coupon to try this location, in Tempe. It's tiny but clean. There are several pre-designed pizza's, and strikingly, a few for vegetarians and even for vegans! You can create your own pie as well. 
I like that it is so quick, but is actually very tasty. The crust is thin and cooked way better than say a quickie like several of the other chains. And to our surprise, after we ordered, we were prompted to sign up for their pizza club and would get half off our next pie. So we just ordered another veggie pie on the spot. 

It wasn't packed yet, as school was not back in, but i'm sure when ASU fires back up, it might be hard to find a seat!"}
{"text":"Heading to My Pie Pizza has become a Sunday evening tradition as my girlfriend and I share a pie each weekend along with some delicious garlic knots.  The first time we stopped by, we really didn't know what we were doing as we tried a new place.  Now, it is something we look forward to during the week.  The food is delicious, the service is superb, and the customer experience is overall very positive.  

Each time we head there, the line moves very quickly, and we have never needed to wait more than two minutes to place an order.  The staff are very patient even when my girlfriend and I cannot agree on a topping and end up having two completely different halves.  The staff provide recommendations (perhaps as I ask so many questions).  Word of advice: ask for the garlic knots to be placed in the oven as you're ordering your pizza pie; do not wait until you are at the register.  After you finish ordering your pie, it goes into the over, but often with paying your bill, you may only be waiting for a few minutes for your order to come out of the oven all ready for you.  I always am offered a cup if I'd like some water while I am waiting, and I've even been offered a sample of one of their DELICIOUS melt-in-your-mouth cookies, which I highly recommend.

Get the FiveStars app on your phone, and register your phone to earn points for free appetizers, pizza pies, or even full meals.  Sometimes, when you sign up, you can get a nice sign-up point bonus.  Plus, Yelp has appetizer deals.  It's easy to make the already reasonably priced meal at My Pie Pizza even more reasonable!"}
{"text":"Make/design your own pizza pie, love the concept! Great patio and good beer choices! Good prices too!"}
{"text":"I love the pizza here! They have plenty of options to chose from! they have pizzas to choose from or you can make your own. The gluten free pizza is probably the best I've ever had. It only takes two minutes to cook so its super easy for a quick meal. the employees are super friendly and helpful. Overall, I love this place!"}
{"text":"Pizza was okay. This place reminds me of fired pie, but not even close to as good. Pizza was okay. Seemed way more expensive than it should of been. Their was no where to sit. The seating at this location was horrible. We went on a Sunday at 2 o'clock. I was shocked that 6 of us couldn't find a place to sit together. This was my one and last visit."}
{"text":"This is what you call customer service! I've only been to my pie a hand full of times and the vegan pizza is what I go for! I didn't know that the place was not open at the time I walked in! The gentlemen STEVE asked me if I needed help and I said that I will like to have the vegan pizza. His response was we are not open! I was kind of bummed out so I figure that I will just go to chipotle next door and get a veggie burrito. No more than a few seconds STEVE said I can do it. I was like no it's okay I'll just head over to chipotle and it's fine. STEVE took charge and decided to make me my pie! \"I was shocked\"! The place had a couple hours to open and this guy is willing to make my pie for me. STEVE went beyond the call of duty and made an executive decision to make me my favorite pie and I felt honored that this guy wanted to satisfy me the customer! I've been to multiple places where they rejected my service due to the business wasn't open at BUSINESS hours! When I say STEVE took it to another level, I mean the man took it to another level! I will drive from where ever I'm located to this establishment because not only the pie, but because of STEVE! Dude you made me a permanent CUSTOMER for life! Thank you #MyPie and especially you STEVE! You the man sir! Thank you again. I support #MyPie and recommend this place to anyone and everyone whether your vegan or not!"}
{"text":"Best place to eat good quality pizza in North Phoenix. I was help d by Rachel and had amazing customer service and she was super friendly and kind. I will definitely be coming back here often, I recommend this place to anyone"}
{"text":"First visit to MyPie. Went on our last day before we left home to Chicago. They pizza was very very good. Our server Grant was very nice and helpful. Definitely eating here when we return. Highly recommend."}
{"text":"Great fast pizza. Think subway but for pizza. Staff is friendly and attentive. We will go back."}
{"text":"Loved checking out the gluten free pizza here! FANTASTIC! They also have the best gluten free, nut free, dairy free brownie I've ever had! Great fun customer service too! Looking forward to coming back often!!"}
{"text":"Wish I could rank the food and the service separately. The pizza was very good. MIL and I split a San Gennaro: thin crust, bright sauce, slightly spicy sausage, peppers, and caramelized onions. MIL didn't like it as much, but she doesn't do spicy, even a little bit. I would definitely have it again.
The best part of the experience, though, was the service. 5*! Both the young woman who made our pizza and the man (probably the owner?) were super nice and solicitous. He even gave us a free order of garlic knots and sauce for coming in - they were REALLY yummy! - and checked to make sure all was well. I'd return in a heartbeat because there are lots more choices on their varied menu I'd like to try - and to see their faces light up."}
{"text":"If u want good pizza this place is the place. They have such a great selections of toppings to choose from. Lots of different sauce to customize your pizza with. The garlic knots are so delicious, my mouth is watering talking about it.:) place is nice a cozy. And they pizza is done so quick!!! Must go try!!"}
{"text":"Food was okay- service was pretty bad - cookie was decent but all in all This is my least favorite \"fast\" pizza place. Eclectic Pie was a lot better and will be where we go from now on."}
{"text":"Not a great first experience at My Pie Pizza. The pizza itself was decent but the Caesar salad was not fresh at all. Most of the lettuce was turning brown and wilted. It was unappetizing enough that my daughter had two bites and I didn't eat any if it. Although there was only one group of three seated when we got there, we couldn't find a clean table and had to ask them to clean off one for us.  I'm new to the area and live just minutes away but I will definitely check out the alternatives before I bother going back."}
{"text":"Choose your crust ( white, wheat or Gluten Free), sauce, cheese (dairy or dairy-free) and as many fresh toppings as you like and for $8.95. Yes please! I like this concept you cannot phone in your order but you can order to go. These are thin crust pizzas but they are tasty! Thank you My Pie for opening up near my home."}
{"text":"Pretty good pie but it will take $50 to feed four.  We went because of vegan option which was about 7/10.  We would return."}
{"text":"Delicious! We made our own pizza, had garlic knots, and a GIANT cookie. We kept half to reheat for later! Delicious!"}
{"text":"Delicious! Real neopolitan style pizza for a song. Very fast, too. Great concept, hope it stays around."}
{"text":"Excellent pizza!  Loved the wheat crust option, and they have gluten free and vegan options as well.  The warm chocolate chip cookies were delicious.  Highly recommended!"}
{"text":"We are regulars here.  My boys love it.  Refills on wine and beer is great deal.  Wish they would bring back Bella's Crust wine. Or at least something similair."}
{"text":"If you want a healthy option for pizza and like different choices come to My Pie. I have brought many of my friends here because it's so small you can miss it. (At night it's pretty though with colored lights out on the patio) You can build your own pizza or choose one of their great selections. I got the Greek pizza with yummy fresh ingredients. My husband got a great pizza as well called the Uncle Nicky. We signed up for their texts and got a pizza and drink for $7. John loves that he can get beer for $4 and a refill for $2. 

I am happy every time! With pizza, extreme garlic knots, and melt in your mouth chocolate chip cookies this is one of my favorite places."}
{"text":"My pie pizza is an incredibly open and friendly atmosphere. I come here not only because it is close to my house, but because I enjoy the people that work here. Keep it up!"}
{"text":"Friendly, fast service makes this place a neat choice for dinner.  Be sure to follow them on Facebook for specials.  Our garlic knots were free tonight.  Hubs and I really enjoy coming here because we get to design our own pizzas and watch them made right before our eyes.  My pizza tonight was an assortment of meats and pears.  I've never tried pears on a pizza but I was impressed and will do it again."}
{"text":"Brought the kids here today... They had to build your own pizzas I had the calzone... Super good and great friendly service... Definitely will be back soon!!"}
{"text":"The first time i ordered here I ate in the restaurant. The employees are nice, the place is clean, and I enjoyed the music. I had a pizza with garlic knots and the garlic knots are great, the pizza is good. The issue of had with the pizza is that in the middle the dough is a little soggy and that is why I can't give them 5 stars. 

The second time I ordered was through grub hub. I had the for cheese calzone and a chocolate chip cookie. The calzone was cooked perfectly and the crust to cooking ratio was on point. The cookie was also very good. It was a giant soft cookie. The grub hub delivery was also very fast from them. I definitely would recommend this place."}
{"text":"I go to mypie all the time because I work in the building! It's fantastic personal pizza, and great Garlic Knots and meatballs as well!"}
{"text":"I really like this place. Service is excellent as is the service. Prices are very reasonable and they have daily specials but you have to go in to see them or try calling as they aren't available online.  I don't care for the greek pie but all others are great!"}
{"text":"Super good pizza from the folks who brought you CRUST. Sort of a Chipotle-like setup where you pick what you want on your pizza (crust, cheese, toppings). They cook it quickly, to order -- we went from ordering to eating in about 5-10 minutes. Nice open-air environment on a gorgeous Friday night. Bonus points for having San Tan Hop Knot IPA on draft. $4 for the first and 50% off for the 2nd. Service was just o.k., they \"lost\" our friends' orders, but eventually worked it out. Great place."}
{"text":"This place was really good. The best part of the meal was the garlic knots. They were cooked perfectly, and seasoned with a TON of garlic....I also really like the marinara sauce that they were served with. 

The pizza was good, although the dough was a little bit thicker than I would have liked....but still delicious. I got the margarita pizza and added meatballs to it.....pretty great meal."}
{"text":"Hubby and I came here for lunch after going to the museum on Sunday and neither one of us were very impressed at all. I did like the fact that you could order your pizza with whole wheat crust though and we both did in fact. I decided to go for their Power Pie. It came with chicken, spinach, mushrooms, and tomatoes. Hubby decided to go for the San Gennaro which came with sausage, green bell peppers, roasted red peppers, and caramelized onions. Both of our pizzas were just Ok. Neither one of us thought they were great and in fact we both had to add plenty of salt and garlic powder to add flavor. They just seemed to be very bland and tasteless. We also ordered a Mediterranean Lover salad to split and it too was just OK. Although it was good-sized, it was mostly lettuce as the toppings appeared very scarce. So as I stated before neither one of us were very impressed and will probably never be back which is a shame because I loved the concept."}
{"text":"Love this place. In my opinion they're way better than MOD ... And I LOVE MOD. 

I work across the street but only come into the office once a week and for the past 3 weeks ... This is where I go. 

100% recommend this place if you're in the area. Their rewards program is awesome too!"}
{"text":"I am so obsessed with the \"angry bird\" pizza so incredible! We love coming with a large group because everyone can get what that want and the counter service is so convenient. Also their super sized cookies are out of this world."}
{"text":"First time I've tried this place and it was delicious! I always build my own pizza and the ingredients were fresh and the dough was cooked perfectly. The employees are very courteous too. Try it out as it will not disappoint!"}
{"text":"Update: I'm a huge fan when owners/managers take critical criticism seriously and tries to improve to make customers happy and returning. Ryan, VP of Operations, reached out to me and apologized for the experience. He wanted me to try them out again and hopefully my experience has improved. We recently had my relatives place a to go order for us for three pizza pies and a salad.  This order fed five of us and we even had leftovers. Everyone including myself enjoyed the pizzas. There was one that had a gluten free crust and it wasn't bad. Overall, if you are looking for a place that is quick and inexpensive, this is a good restaurant to get a quick pizza. Thank you Ryan for trying to make me a fan, but you did better - you made five fans! 

I had high expectations visiting My Pie because of the 4.5 overall star rating. We walked in to an empty restaurant for lunch and we were surprised to see they were set up like the \"Chipotle\" concept. There's another pizza company that does this around the valley and we are a big fan so we can't help but to compare.

We order the San Genaro pizza with mushrooms on white crust with a regular Healthy nut salad and two chocolate chip cookies. The pizza and salad just didn't cut it for us. I wasn't a fan of the crust, but the food just didn't taste and look fresh. The greens in the salad looked like it had been sitting out for days and it had a brown tint to it, there was too much dressing and the chicken was flavorless. The chocolate chip cookie though was good."}
{"text":"Just opened in our Walmart shopping center in centennial. Instead of driving to Blaze, we decided to give this a try. So glad we did! We were immediately greeted by Dwayne. He was so welcoming. After asking if we were new to My Pie he explained how they work, let us know the favorites as well as his. He made great suggestions which were much appreciated. He's awesome!! Someone else checked us out. Equally friendly. I had 1/2 My Greek Pie, 1/2 Spicy Butcher. Hubby tried 1/2 pepperoni, 1/2  Hot Hawaiian. Both were delicious. The food was actually brought to us. Bonus points! We will definitely come again!"}
{"text":"A make your own pizza pie place.  They offer standard pizza, a variety of specialized pizza or walk through the line and pick your own ingredients.  We opted for the last choice with pizza sauce, a bit of spicy sauce, sun dried tomatoes, bacon on half, spinach, 3 cheeses and garlic.  A server will bring your pizza to the table in a few minutes.  The pizza was great, and service with a smile.  There are other selections in the menu such as salads, 
There is inside and outdoor seating.  Good value and quick service especially if you're in the run.  

Back at My Pie.  Last visit I gave them 4 stars.  The owner, Ryan, contacted me and asked what My Pie could do to get 5 stars.  I made a few suggestions and he came through.  I was very impressed by the great customer service.  We ordered pizza and spicy sauce, Parmesan, mozzarella and fresh mozzarella, olives,tomatoes, red peppers, sausage on half, and oregano  Our pizza came quickly as usual.  Great service and excellent pizza.  Thank you Ryan and fellow workers.  You made our visit enjoyable."}
{"text":"LOVE the service - always SUPER nice and friendly!!! And their pies are pretty awesome too!! They make it exactly the way you want it. Fresh ingredients and their crust isn't too bad. (I'm a NY pizza kind a girl)  I've been here more times than I want to admit...publicly -lol! Serious great little place, with yummy food, friendly service & affordable prices!!"}
{"text":"Pizza was good I like the create your own style and prices we reasonable they have a really nice patio area as well!"}
{"text":"I really liked the restaurant my pie, the concept of creating a pizza entirely the way you like for the same price is very appealing. Also great how fast the cooking time is. I got a wheat pizza crust with fresh mozzarella, and half buffalo chicken half meatballs. It was so yummy!! I took the kids I nanny for and they shared a pizza, it was plenty big for the two of them. I had leftovers to bring home from mine as well. The staff was friendly and helpful, and the restaurant casual but clean and nice. Would recommend!"}
{"text":"Awesome place, awesome pizza, perfect. Have been coming here for years and the ingredient are really fresh and everything tastes amazing everytime. One of the best things is the location right on college across from ASU"}
{"text":"I'm just here for the garlic knots. haha. No seriously, thee BEST garlic knots ever!!! I come in often just for an order of them! I don't even get a pizza, all I want is the knots. Its a close drive to home so its easy to drive by and grab some and then enjoy at home. The garlic knots are perfectly soft and prepared with right amount of olive oil, garlic, and basil. I usually have them add more parmesan on the end but that's because I'm a parmesan addict. I guess I should mention the pizza too being that this is a pizza place? I love the custom pizza options and the ability to venture out and try something new without having to take a vote on what others want -- because its your own personal pizza! But back to these garlic knots -- go get you some!!!!"}
{"text":"I love the pizza from here as well as the garlic knots! The staff is always really friendly and helpful and the environment is also enjoyable! I'd definitely give this My Pie and try if you haven't already done so!"}
{"text":"My husband and I went for lunch.  We ordered the Mamma's Meatballs and the NY Roni pizza.  The Meatballs were very good and the pizza chips that came with them was super yummy.  The pizza was amazing.  The service was also amazing and fast.  We will definitely be returning."}
{"text":"We decided to try My Pie tonight as my husband and I want to customize our pizzas due to dietary restrictions. My husband can't have dairy and I skip dairy in solidarity with him. So, we created a to-go order online. We were pleasantly surprised that they offered Daiya (dairy-free) cheese. Since my husband likes Daiya he got that and I decided to get no cheese (I didn't check any cheese option online, they didn't offer a \"no-cheese\" box to check).
I guess my husband should have checked the pizzas before he left the store because when he got home we saw that my pizza had mozzarella on it and his was missing his chicken. 

The food itself was just ok. The toppings seemed just... flat,  not much taste. Maybe it was just a Sunday night and things weren't as fresh?

Having them forget/mistake ingredients plus the taste being just bland was pretty upsetting considering the cost. I think next time we will try a different make your own pizza place. 


Updated: after I left my review the owners almost immediately contacted me to apologize and make amends. I really appreciate them trying to fix their mistake & will think of going there again"}
{"text":"Pizza crust was thicker, so they have to cook it longer to cook it through. Most of our pizzas came out over cooked. One was really bad, and when one of their guys came out to ask how we were doing, we let him know how bad the one was. He cooked up a new right away that was perfect. Overall a good spot, but not much different than any other 'build your own' pizza spot."}
{"text":"The dough, ingredients, price - really best made-to-order pizza around.  Give'em a shot."}
{"text":"Joe is the best! In fact you all are! Greetings with smiles is always. The pizza is superb! I think I have tried most of them now. Onto the cookies!"}
{"text":"Okay pizza for grabbing a quick bite. Cashier won't tell you if happy hours are going on (happy hours go from 3 to 6 pm)."}
{"text":"First time customer, very pleased. Clean fast and the staff was super nice. I'll be back.  I will drive past a similar type of pizza place in my area just to come here. Oh and the pizza was delicious thanks keep it up!!"}
{"text":"Really good deals on the $5 pies. The wait was less but it was worth it.

The grandma's pie is"}
{"text":"I'm a fan on this pizza place. It's close to campus and it has tons of options, pizza wise.
I had a custom pizza, which came out to be 8 bucks after tax and tips.
The staff is helpful and polite and the foot tastes pretty darn good. It tastes like pizza.
What I wouldn't get here is the salad.

My friend had some kind of salad, the Health Nut Salad. The vegetables were not fresh, it was wilted and in some parts had rotted already.


I had Pizza with, sauce, two cheeses, artichoke hearts, spinach, onion, sausage and ham.
Classic Pizza: MARGHERITA
Health Nut Salad

Conclusion: The pizzas are great, the salads are to not be bought without looking at carefully first."}
{"text":"Been here once before. Was a bit intimidated the first time as it is build your own pizza, tons of choices and a line forming behind me.
But pizza was really good.

Tonight, second visit, no line behind me, took my time and got my custom pizza just the way I like it! Fabulous.
Yes, the reviews of the garlic knots are spot on. Yum! 

Good value
Great service
Really nice staff (Grant) 
Beer special is worth looking into.
Will be back!!
Check Groupon for specials"}
{"text":"I am vegan, and my family was in town visiting and they are not vegan. After deliberating for a while on where to eat the other night, we decided on My Pie. That way I could still eat pizza with them because they offer vegan cheese. I gathered everyone's order, paid for Uber eats to deliver, and then got a call saying they were out of vegan cheese. It was a big disappointment, since we picked this place based on the fact that they offered vegan cheese. We were all so hungry and already ordered so I just ate mine with sauce and veggies. Pizza was still alright, just not the same."}
{"text":"I really have no complaints. My significant other and my parents would be shocked! Lol seriously the ingredients are fresh, portions are huge, staff is friendly. Kind of a DIY/subway-style ordering lineup -which I was honestly weary about- but pizza was popped In the oven and done within minutes and I was given the chance to see just how fresh each ingredient was before it even touched my pizza. And get the garlic knots to start. Yum!"}
{"text":"First time there today to grab a pie to go. Friendly Service. Fast Service. The Pie was pretty darn good. I'll be back sometime soon. Give the place a try. I think you will like it too."}
{"text":"This pizza spot is nice! Super accommodating to friendly gatherings or single dining. Staff is very informative and helpful when it comes to choosing the right pizza- Pesto My Chicken"}
{"text":"If you want a made to order pizza, without the wait, there is no better place to come than My Pie.  The food is fantastic, and lightning fast.

The array of options is awesome.  Every time I go there I end up getting something new and I'm never disappointed.  The atmosphere is kinda kitschy -- it looks like it used to be a Pennzoil station with the roll-up garage doors, but all in all it adds to the charm.

And you really can't beat the prices.  You get to watch them make your order right in front of you, and you can customize it in basically any way.  I recommend at least giving the gluten-free pizza a try, especially if you have never had anything gluten-free before.  It will not let you down.

Friendly staff completes the four-star review."}
{"text":"This place is ok , by all the 5 star reviews I thought it would be amazing ! The concept is pretty cool , but the end result isn't that great in my opinion . The Garlic knots were not good at all  funny flavor , can't explain it. Pricey in my opinion , although beer and wine prices are good. Friendly service. I wouldn't go back by choice but if I was with someone who wanted to stop in I wouldn't say no. 
If you want GOOD pizza go to the original Crust pizza place ! That place is AMAZING !"}
{"text":"Takes approximately 15 minutes for the pizza to cook. That is awesome! in my opinion. The wait isn't bad, the food is decent.  Fairly priced. I forget what pizza we got, but we had the wheat dough which was really good. We liked it a lot.

The garlic knots i would say pass on these. We just wanted to try them out. Nothing special about them at all. I would have preferred it be more garlicy.(is that a word?)"}
{"text":"Tasty pizzas and great customer service!  What I like about the pizzas are that they can be customized, are thin crust (less carbs), and they are not heavily weighed down with cheese or greasy like alot of other pizzerias.  All the staff were friendly, cheery, and helpful. I will definitely return!"}
{"text":"This place has the absolute best garlic knots and great topping choices for their pizza."}
{"text":"This is a build your own pizza place and it is set up like a Subway or Chipotle and we love it! They have vegan options listed on the menu and you can also custom build your pizza. They have vegan cheese if your pizza must have cheese. The pizzas are personal, but they are pretty big and could be split (my hub can eat a whole one and would think this splitting suggestion is silly).

We typically order vegan garlic knots, which come oozing with oil and chopped garlic, custom vegan pizzas, and salad."}
{"text":"I adore Crust, and have been anxious to try MyPie. Ironically it is located in the old Sammy Bs location which used to be one of my favorite pizza joints back in the day. They revamped the place with a modern, hip interior. It's a little overwhelming when you first walk in, but the super friendly employees explain the process and make you feel at ease. 

I ordered the Greek pizza after much deliberation. I was worried about time because I had less than 30 minutes before I had to be somewhere. But my pizza was cooked freakishly fast. Right after I payed and got my drink my pizza was brought to me. 

The pizza was a very good size for a personal. I couldn't finish it. Even though I wanted too because it was deeeelish. The crust was amazing... it rivals a certain pretentious pizza spot with a 4 hour wait. Crispy with just the right amount of chew. The toppings were fresh and plentiful. My only complaint would be that I don't care for the balsamic drizzle on top... it didn't mesh well with the Greek flavors. 

This place is going to be put into my rotation. It is a great place to bring anyone... a date, your kids, etc. Also great for a (very) quick lunch. Can't wait to explore more combinations!"}
{"text":"One of our favorite places to come!! The food comes out fast and is delicious, the staff is always extremely welcoming, and they play great music! HIGHLY recommend you come here, sit outside and relax, and enjoy some pizza and wine!"}
{"text":"Great pizza. Great atmosphere. Great service. Good place to grab a quick pizza and not have to worry about a wait time. Close enough to campus to not have to drive."}
{"text":"Yummy, fresh, customizable, and convenient. I love eating lunch here on my break at work, they are quick enough for me to get back in time and just so good! Definitely small portions, not meant to take home for all the guys on gameday or anything! and slightly pricey for how small they are. But delicious nonetheless, with a very friendly staff!"}
{"text":"Been here quite a few times with my fiancé, and we have yet to be disappointed! I do wish they had some more veggie options, because I love veggies on my pizza. The employees are always very nice and attentive. A bit expensive for what you get, but still good!"}
{"text":"Possibly the BEST \"build your own pizza\" chain in the nation? I have tried Pieology, Pizzarev, Blaze, and 1000 Degrees Pizza, and can frankly say My Pie is way up from the rest."}
{"text":"This place is by far the best pizzeria in Las Vegas. Since moving here from NY 3 years ago, I have yet to find a worthy pizza place...until today.  The food is excellent. Sauce is delicious, the cheese is high quality and super fresh.  The staff is extremely nice and accommodating.  If pizza is your thing, then you will definitely love this place. I highly recommend it!"}
{"text":"Called in an order and once I got there was told it wasn't \"processed\" because the guy took the call in back, Had to wait once I got there 15 minutes after calling in for my pizzas. We call in so we don't have to wait. Not one concession or item offered to us to compensate for their error. Oh, and then they almost gave us fewer items than we ordered (1, not 2).

Horribly run. Never going again, even though I'm a regular.

LEARN CUSTOMER SERVICE!"}
{"text":"I do not even go to ASU (yet) and I have been to this pizza place several times. I have never had a bad experience and the pizza is perfect every single time. I love that I can choose my own toppings and that they put a decent amount of each topping. I love that they are so quick at making it too. The people working here are so nice and helpful. I'm becoming a Sun Devil this fall and I cannot wait to come there more often."}
{"text":"Brand new, best place to go get your pizza craving satisfied! All there specialty pizzas are delicious. You also can't go wrong with classic pepperoni and cheese. All the ingredients are fresh and delicious. Prices are very reasonable to grab some lunch and dinner. A lot better than Blaze and Pieology. They make you feel welcomed and special, just like family."}
{"text":"I love this place! The food is great and great service. The pesto my chicken is bomb and the workers are chill. 10/10 would recommend!!!"}
{"text":"The cookies are amazing!  The pizza is really good too. I love the big outdoor patio-perfect night to sit
Outside b"}
{"text":"Stopped by this place for lunch.  I thought I saw a sign for a 5 dollar pizza but nothing I saw on the menu board was 5 dollars.  I was too lazy and it was too hot to go somewhere else.

I don't know if that was normal but the order and pizza making seemed slow.  I decided on the Pesto My Chicken pizza.  There are numerous other choices or you can create your own pizza.

My pizza was very tasty surprisingly.  I could have had the crust to be a more crispier but I ended up finishing the pizza anyway.

I think it was expensive but still good."}
{"text":"Love this place, their Very Vegan is awesome. Everybody is super friendly! Free pie after 10, I'm already at my second free one."}
{"text":"My friend and I both got the spicy butcher, but we both altered it. The place was so packed that we had to find a place to sit outside. Wish they had patio seating. Love there crust! way better than blaze that's forsure! I'll be coming for Pie day! Lol"}
{"text":"This place continues to impress me , the staff is amazing , the food is consistently scrumptious , the cookies are hands down the best in the universe !!! You have to check this amazing local business out ! Tell them I sent you :)"}
{"text":"Love the food and concept my only complaint is the restaurant is always hot and the music is blasting. But great food especially for the price."}
{"text":"I love My Pie! They make pizza seem healthy while still tasting good. I had the Chicken Pesto Pizza and ate the entire thing. If you are hungry don't plan on sharing a pizza. You can order a signature pie/salad or make your own pie/salad. The price in very affordable for what you get. They have great ambiance with big open bay door. They are certainly trying to make the best out of a small space. I would return and recommend."}
{"text":"I love My Pie. I've been here a ton of times and the quality of pizza is way more consistent than any other fast pizza place around. My favorite is the Angry Bird pizza. And make sure you grab yourself a cookie -- insanely good!!"}
{"text":"Excellent! I love the Spicy Butcher pizza. Or you can build your own. My sister has had to go gluten-free due to her health, and they cater to that. Bonus! Get a cookie, and try out their garlic knots. Friendly staff ready to explain everything to you!"}
{"text":"Just moved over to this area and was pretty impressed with the pizzas! My roommate and I ordered some for pick up. They are made for individuals (one size personal pizzas) and have a great variety of toppings. The sauce was tasty and it was cooked perfectly!"}
{"text":"From SoCal and found this place. Great food and great service. Had a pie Taylor made and it was excellent. The dough is house made and the ingredients fresh. I asked for a little crispy and that's what I recd. Ask for Chase if you go, but every person was really helpful. Oh yeah, beer-me on the side to wash it all down."}
{"text":"Delicious! 
Fast!
Clean!
Excellent customer service.
The gluten free was the best I have ever had!
Pear-fect pizza was amazing
A must go to!!"}
{"text":"This is far and away my favorite lunch spot in the area. You get a delicious pizza for 2 (they call them personals but even at my hungriest 4 of 6 slices is enough) for 9 bucks, and you can put whatever you you want on it. The beer is inexpensive and tasty.
And holy balls the service. When I walked in the first time, all the staff treated me like an old friend. They're great for conversation and like what they do. Today, when they brought me my pizza, they explained that the pie crust  had folded a bit when going into the over. They brought me that pie, plus a whole other pie that was up to their standard.
This place is an all around excellent experience."}
{"text":"Excellent crust, sauce and service. So wuick too. Love the gluten free crust too. Try iy, you'll like it.
People with kids should have the kids pick choices prior to getting in line."}
{"text":"Update:
 
I just got off the phone with the owner who reached out immediately after my review to offer an apology, some clarity on the situation, and for the opportunity to turn this into a positive experience for us. For that call alone, I am changing my review from two stars to four stars--any owner who is willing to stick their neck out for their team and be open to hear a reviewer's side of the story is doing the right thing and clearly leading by example. 

Needless to say, I am impressed by the leadership and am eager to give My Pie, Tyler the manager, and the team at the Gilbert location another shot. 

Previous review: 

Let me open with this: the food was great! Crisp, thin crust, quality toppings, and a decent variety of them as well. In fact, I would probably put the final product over both Fired Pie and Mod Pizza (as well as Eklectic Pie, a distant fifth in a race of four). 

But the two-stars are for the service, or really the intentional standoffishness of the manager (or whomever was running things when we visited this location)--I'd give one-star, but the food really is that good.

So here's what went down: we decided to try out yet another Subway/Chipotle pizza place, in no small part to an incredible Groupon deal that My Pie was offering. (My wife and I each had separate Groupons and intended to pay separately so we could try this place out on a budget.) The manager (see above) was acting as cashier, and when I told him we both had Groupons, he immediately said \"It's one per visit.\" I replied that we were paying separately (we've done this numerous times before when we are trying out informal semi-sit down joints, so didn't think much of it), and he seemed put off by that remark. That said, he still had to complete his side of each transaction. As he rang us up, he adamantly tried his best to upsell sides and drinks so we could \"maximize\" our Groupon. But when your meal costs $8.95+tax and the Groupon is for $10, why go for more? I'm frugal, that's the point of Groupon! And mind you through this process, there were no niceties, no small talk or banter on his part. I mention that because ALL other customers before and after us had little chats instigated by this manager, but to us Groupon-carrying folk, he was a stoic, pizza selling machine. 

In fact, during our meal, he continued to make his rounds throughout the place and checked in with ALL other patrons, asking how the food was, etc., and even saying goodbye to ALL leaving patrons. But no, not to us humble Groupon'ers. I even left slowly to see if he would change his colors and soften a bit, but dammit, he was sticking to his guns. So good on you, manager, for passively shaming the newbies and sticking it to the deal-hunters. And to the owners/franchisees who offered the Groupon: get your people in check, or stop offering deals. 

Moral of the story: you can defeat here at full price and enjoy it, but be warned lest ye use a Groupon."}
{"text":"The staff was pretty friendly,I couldn't hear them over the music. :/ my pizza was just meh. The cheese wasn't melted , the dried tomatoes were so burnt ,and the crust wasn't anything special."}
{"text":"The owner is so pleasant and accommodating! It's so nice to still be able to enjoy pizza as I've switched to a plant based diet and I'm still able to load up my pizza with veggie with the added benefit of having vegan cheese! Happy belly happy customer"}
{"text":"Found this pizza shop by accident.  I was in the mood for two slices of pizza.  Unfortunately they don't sell pizza slices, but they do sell small pies for people looking for slices.  My Pie Pizza offers a plethora of pizza toppings made to order.  I really enjoyed the pizza and plan on returning."}
{"text":"Happened upon this place on a busy Friday afternoon.  The meal and hospitality were top shelf.  Heartily recommend this restaurant for anyone seeking great pizza and fair prices."}
{"text":"I can honestly say that I have never enjoyed a pizza so much before in my entire life. My Pie essentially takes Subway's model and translates it into personal pizzas. You can either choose from a variety of different preset options or simply create your own mixture of ingredients before the chefs throw it all on a personal pizza and into the oven. 

Not long after, your own personal pizza comes out exactly as you wanted it. Maybe I'm a little biased, but the pizza I created on my first trip here was perfect. For us poor college kids, it's not too expensive either."}
{"text":"The pizza here is really good !! I always go with friends cause its an awesome place. The only thing I think its wrong is the establishment charging for Ranch... But besides that I super recommend this place its good and not too pricy."}
{"text":"This is the go to spot for pizza on/near campus. Can make your own pizza or pick from their menu. Many toppings to choose from. Pizza was baked to perfection and crust was delicious."}
{"text":"Dinner at MyPie. 

Stopped in at this pizza place on the way back to our hotel after a day of sightseeing for a late dinner. It was highly reviewed on Yelp and right on the bus route back to our hotel. 

They had a kids special pizza which my oldest assured me she needed her own pizza. Reluctantly I got them each a pizza and my fiancée and I each got one of our own. A great decision as my oldest are her entire pizza and part of my youngest. The older one had a pepperoni pizza and the youngest a plain cheese. My fiancée and I had one Greek pizza 3.5/5 and one vegan 3.5/5 (substituting the vegan cheese for mozzarella). 

The place itself to was setup much like a mucho burrito in the new tradition of assembly line like ordering. Normally I would have made up my own combination but we hoped to catch the next bus so we went off the menu. Next time I'd hope to have more time to choose my own combination of toppings sauces and cheeses."}
{"text":"Made to order pizza fired up in a volcano hot oven, straight to your table in less than 10mins. Can't beat it. 

I loved the crust which is crispy and chewy without any greasiness. My husband wasn't a bit fan of the crust as he is a big time Pizza Hut deep dish pizza lover. But no worries, I ate his pizza too! 

We got the Hot Hawaiian and the Spicy Butcher. In my opinion, the spicy butcher has much more flavor going on than the Hawaiian. I loved it! The Hawaiian was a tad boring... Sorry. 

The garlic knots were sorta so so... A bit too bland for me. Don't get me wrong, the fresh garlic is enough to keep a family of vampires at bay, but there was some flavor lacking. 

Can't beat the $4 beers either.
Overall, staff was friendly, facilities were clean and food was tasty. I will be back sans hubby."}
{"text":"This restaurant is a little hard to find but is an excellent concept for a custom-made personal pizza that is served quickly and is delicious. The easiest way to find them is to look for Today's Patio and they are located just to the north. We are huge fans of their sister restaurant Crust on Tatum and decided to try out this new place with a coupon deal we bought. We stopped in on Monday for lunch with a coupon deal. The pizzas are about 12\" in diameter and there is a choice of crusts including a gluten-free one. The toppings and cheese choices are included in the price of the pie and you can load on as many as you'd like. They also have these delicious chocolate chip cookies that they keep warm near the register you just have to try! I tried their margherita pizza which is slightly more than $8, but most of their pies are $7.75. Their salads are only $4.50 and are definitely \"side salad\" size. Once you order, they give you a number to take to your table and the drinks, etc. are all self-serve. They have the garage door concept instead of walls of windows and the day we were there, the whole restaurant was opened up to the patio. They have happy hour all day, everyday for beer. If you spend $4 for your first beer, refills are only $2 and they are not peddling your every day Budweisers and Millers. I was only able to eat half my pizza for lunch and there are boxes available at the drink station to take your leftovers home. I can see where they might get jammed up if they are busy since everything is handmade, but in my opinion, the pizza is worth waiting for."}
{"text":"Not many people know this, but the salads at my pie are just as tasty as their . Had a 'pizza your way', with fresh + shredded mozzarella, pepperoni and black olives and it was great! Also tried an Italian Antipasto : pepperoni, salami, fresh mozzarella, pepperoncini, roasted red peppers, balsamic vinaigrette dressing. I loved every bite, but the only bad thing about it, was that I only ordered one lol 

They also have 1/2 price salads on Wednesdays, which means this whole thing was only 4.95! I did have to go back in because they charged me full price, which was a little annoying, but not a huge deal in the big picture 

I highly recommend you try one out next time you stop in for 'za"}
{"text":"I came in because I had a Groupon and figured why not try it. The food was okay, nothing extraordinary. There was barely any chicken on my pesto chicken pizza--if you count the microscopic diced up chicken. Again--okay food but nothing to rave about. The line is fast to get through and food came out quick. My issue was that the seating area is beyond small. They have a lot of room outside but maybe 6 tables inside. This will not be good when the summer rolls around."}
{"text":"My pie is the best! The pizza is so good, and I love how it can be individualized! The atmosphere is always uplifting and the staff is very professional. If you sign up for their rewards program you eventually get a free pizza, and you get text messages regarding some awesome deals they have. Sometimes they will have a pizza and a drink for $7. You can beat that! My husband and I love coming here and will continue to do so."}
{"text":"Great quality food, prices can't be beat, and Pizza is prepared fast and is absolutely delicious. Will be coming back in the future for sure."}
{"text":"What makes this place better than other custom pizza places - taking your customization to perfection. We ordered 3 custom pizzas and the final product was perfectly baked and juicy. Liked their original cheese cake as well."}
{"text":"Quick and easy. 
A decent corner shop that I'll visit during my low days for a pick me up. 
Clean.
Semi-quiet. 
Free wifi, if you need a quick place to get something done."}
{"text":"It was my first time walking in and I was immediately welcomed by the friendly staff:))))))))))))) thanks guys ur the bestest, i was super hungry but you didnt let me starve"}
{"text":"The pizza was really good! We couldn't dine in as were in a hurry, so we ordered take out. The process was very easy, we did the build-your-own-pizza thing. The people were great too."}
{"text":"Best pizza place in town!! Hands down.  You can taste the fresh taste and effort they put into making their pizza for you.  Very convenient place to order from as well.  Their staff makes you feel like a regular every time you come in too.  Things I recommend is the Spicy Butcher and my girlfriend loves the Power Pie.  Also do not forget to order the garlic knots and the mouth watering cookies.  Just had that cookie last night and its beyond words!  To give you an idea of how much I love this place.  I just signed up for Yelp just to spread the word of how great this place is! I always read yelp to see about other places so I hope this helps everyone.  GO TO MY PIE NOW!!"}
{"text":"My Pie literally allows me to make MY Pie the way I want it, and as a vegan that means a lot. 

My Pie is similar to Chipotle or Subway concepts where you pick your crust, your sauce, your cheese, then your toppings and they cook it in an oven that's like 850 degrees. You have your pizza in like three minutes and it's amazing and crispy. 

It makes me super stoked that they have vegan crust, sauces, and cheese. The marinara is fabulous. 

Another perk is the buy-one-get-one-half-price beers. Buy one for $4 and get a second one for $2. They have several local drafts and cans. 

The location is in a shopping plaza but My Pie itself is pretty cool and modern with opening garage style doors to allow the patio and inside to combine. 

The staff is always friendly and quickly work you through the line. 

Best $9 you can spend!"}
{"text":"The service here was some of the best I've had. The gentleman behind the counter went over the menu, discussed the popular options and best sellers. The teamwork environment was very tight and I love to see that. They worked together flawlessless to recommend, start, and provide the BEST vegan pizza I've had. Another gentleman helping top our pizza even gave us recommendations on the vegan cheese to make sure we knew it was a little more savory tasting so they use it sparingly. The cashier did a great job up-selling cookies, brownies, and drinks to us. We will be back to try the spicy butcher next!"}
{"text":"This was my first and last time ordering from My Pie. I was so excited to finally find a place that uses vegan cheese, but I was sorely disappointed. The pizza's crust was burnt on EVERY piece! And whoever topped this pizza was throwing topping haphazardly at this thing.. I'm not one to complain about portions, but seriously... 6 pieces of pepperoni and a handful of pineapple tossed only on one half of the pizza? 

Pizza places are a dime a dozen in AZ, choose somewhere else that will at least top your order in a decent fashion."}
{"text":"Visited again recently with my wife.  As usual, we had a wonderful lunch, and this one was so much better as the service has improved substantially, and is not so pushy with the add-ons like cookies and ice cream.  Good Form, my Pie!"}
{"text":"Great service and the pizza is super good! Must try the vegan pizza and Mr. White (for those that are dairy inclined). Make your own pizza from their ingredients, cooked in 2 minutes in their 800 degree oven. We will return again and again, it's really that good!"}
{"text":"First time with this pizza experience where you make your own pizza just the way you like it. It's great how you get to choose everything from the dough, to the sauce, and all the toppings you want, for the same price! Well, if you go a little overboard, they will let you know that once you start piling the toppings that the pizza won't cook all the way. The guy that helped us explained the whole process and explained the different sauces to us also. He was very helpful and enthusiastic about it, which made the experience even better. Because I am indecisive I went with one of their creations and added some extra toppings just to make it perfect. It's not the best pizza in the world but it's pretty good for the price you're getting it for. You can join some type of membership at the cashier by entering your phone number in. We did that and got a coupon for a $5 pizza. I'll be coming back real soon, especially bc I live 5 minutes away"}
{"text":"This was a nice establishment. The pizza tasted fresh. The crust is thicker compared to Fired Pie, Pieology, and MOD.  The fresh mozzarella was better here than the shredded mozzarella they offer.  I thought this place was going to have crumbled sausage (like I saw in Yelp photos) but it only had sliced sausage. I received free garlic knots for \"checking in\" on Yelp.  They also offer a program to receive points for free food. The customer service was great and it was easy to find parking."}
{"text":"The staff here are so friendly and I love that they have happy hour at three! Which means $5 pies and my favorite pie on their menu is the pesto my chicken! I am addicted to it and did I mention that they have yummy garlic knots with marinara sauce? Give them a try if you're craving tasty pizza!"}
{"text":"The question is what is better My Pie or Fired Pie? Both have the same concept. Special pies or make your own pie. Walked in to this very little spot. A few two seater tables and friendly staff greeting us. 

They have great options for crust, sauces, cheeses, veggies, and meats. I think I ordered the white crust with marinara sauce, parmesan and mozzarella cheese, mushrooms, black olives, tomatoes, sausage, and pepperoni. Just picked whatever with no rhyme or reason. They put it in that 800 degree oven and BOOM. Lunch is ready. 

I thought it was really good. Nice fresh ingredients and a really nice friendly staff. So my question who is better, My Pie or Fired Pie. I think they are the same. They might have a few small differences but nothing that stood out. I think it's a personal preference. To me they are both good and whichever is closer is probably the one I will go to. 

So if your hungry for a quick pie, this is the place to go. No more Pizza Hut, Dominos, Pappa Johns or any of those other pizza places. It's either My Pie or Fired Pie. Yum yum enjoy."}
{"text":"Does anyone know if the gluten free pizza contains egg? Their gluten free pizza is great! I like to get it a little well done."}
{"text":"Great crust, 2 minute cook time, and unlimited toppings. The only caveat here is that if you load up on too many toppings the top of the pizza may not brown in time with the bottom. 

Overall though this is a great lunch spot and if you nab their $7 pizza and drink combo a relatively good deal."}
{"text":"I don't hesitate to call My Pie the best among all the \"Choose Your Own Adventure pizza shops\" that became all the rage in Gilbert in the past year. We were told upon arriving that all sauces and dough are made on site from homemade recipes (compare to the franchises which bring in ingredients and only have to pay kids to cook them). They have the typical variety of topping options available, but also options I have not seen elsewhere like wheat dough (I abstained but admired the option). The crust was crispy and NY-style, and the prep work on the veggies was great - diced instead of sliced, so each bite had a little. The mushrooms seemed to be cooked ahead of time which is excellent because otherwise all the moisture causes the crust to be soggy.

Oh and they have big chocolate chip cookies that, while expensive at $2.50, were tasty. I did wish they were doing baked-to-order though (like Oregano's does).

When reached for a quote, The Terminator commented that \"I'll be back\". I concur with him."}
{"text":"Love this place and so does my pregnant girlfriend for obvious reasons. Staff is friendly and on point. The pizzas are made to order and the ingredients are fresh as #$&%! PLUS, beer is cheep and you get $2 refills. Enough said."}
{"text":"Great value. Good pizza. Attentive staff. 
Quick service.  
Why have I not been coming here more often??
I just fed myself and two kids for $20."}
{"text":"The pizza and the value are amazing. Made to order, student discounts, and great selection. Only problem is employees use their cellphones while handling food, and touch food while handling transactions. The friendliness of employees also needs improvement."}
{"text":"Fantastic pizza, salad, and garlic knots!! Oh, and the cookies...hell yeah!!  The staff is friendly and always willing to make suggestions if you are having a hard time deciding what to put on your pie! 

Pro tip...ask them to keep your cookie on the heater until you are done with your pie!

Also, engaged owners!"}
{"text":"Amazing service! Delicious food! They offer gluten free and dairy free options as well!"}
{"text":"Heard about it from a stranger... Stopped in with the fam... So glad we did!  Got to make MY pizza and the husband and kids could get whatever they wanted since they would rather die than eat feta and spinach!  Good music... Friendly staff... And manager very attentive... Oh and your pizza is done in 2 minutes... ;) This will be a regular stop."}
{"text":"I got the \"Mr. White\" and added spinach, onion, tomatoes and chicken, and I'm IN LOVE. So many different flavors, and a lot of Garlic. One of the best pizzas I've ever had, and I just got back from Italy so that's saying something!!: D
Husband got the BBQ pizza and liked it, but wasn't as in love. Next time he comes with me, he's going to get the one that I had! Highly recommend!"}
{"text":"This is no joke $8.95 load it up with anything you want on it. They place it in the 800 Degree oven 2-3 min later Oh My what a pizza. Employees are very knowledgeable and very helpful. I will be back for Spring training see you soon."}
{"text":"My daughter and I stopped by \"My Pie\" last night for a quick bite to eat.  We had never been there before but thought it was your typical pizza place  We were pleasantly surprised when we went in there to find a very friendly staff who prepared your pizza in front of you.  You could choose from a list of pizzas or make your own.  It's like \"Build your own pizza\".  The guy checking us out at the register was so friendly, he just chatted with my daughter and I about miscellaneous things, before we were even rung up our pizza was done.  It was so yummy.  They had such a variety of items.  My daughter and I had a pizza with chicken, bacon, and pesto sauce on it.  They offered gluten free items, they offered vegan choices.  I cannot wait to go back.  I am so glad that we \"fell upon\" it."}
{"text":"Yum! I was super happy to finally try this place! Love the idea of custom pizzas. I ended up getting the vegan pizza with Daiya cheese. The SO built her own with white sauce, spinach, tomatoes, and feta. I had the GF crust. They were very mindful about contamination. That's really something I appreciate. It showed great customer service and awareness of the varied dietary restrictions and preferences. 

The pizza itself was definitely tasty. You bet I'll be back here! Also love that they serve beer and desserts!"}
{"text":"Great pizza joint.  Fantastic deals on pizza, easy format, great crust and toppings.  Beer for $4.00 and $2.00 refills, say what?!?!?  And great beer at that...  Friendly service, great patio that is dog friendly.  Great place to hang out for dinner.  No complaints and 5 well deserved stars."}
{"text":"Ate here again and was impressed. Looks like they worked the kinks out from their opening. They have a good variety of pizzas and friendly staff, keep up the good work."}
{"text":"Really enjoyed my meal. I love the endless options at this build your own pizza place. The pear and chicken pizza on the menu is amazing. Staff has always been very friendly, attentive and has assembled my pizza quite nicely. The warm chocolate chip cookie is like a dream...what a treat! The pizza crust is good--not thick and fluffy, but it's not thin and crispy either...it's right in the middle. I got the garlic and olive oil base instead of red pizza sauce. And 3 out of the 3 times I've eaten here it's been dripping with olive oil. That was my menu selection so it's partially on me, but employees should know how much of an ingredient to put on the pizza too. Or take the olive oil+garlic base off the menu because it doesn't work. Just once the crust was a tad under-done and that's probably because I loaded on the toppings! Overall a really good experience. Great price ($9-$10 for a 1 person pizza), good pizza, good text rewards program, excellent employees. Pizza comes out fast, piping hot, and so delicious."}
{"text":"Another great restaurant opening in the NW!

This one a bit familiar in concept, but standing apart from the rest using the freshest ingredients, house made dough, every sauce and seasoning prepared in-house daily, etc!!

Surprising in this setting, but once you taste the difference, you'll understand why they prep hours before open and the lunch rush to ensue shortly after.

Multiple draft choices at an ALL DAY happy hour pricing. Tenaya Creek Brown Ale and Peroni are great options depending on your pie toppings. Refills are only $3 even on the imports....yes, only $3 :)

Recommended :

Spicy Butcher Pie : Fra Diavolo Sauce, Parmesan, Fresh Mozzarella, Pepperoni, Sausage, Pepperoncini & Basil. My favorite of the day, love pepperoncini on pizza, and the pepperoni and sausage is delicious here! Can't go wrong here!

The San Gennaro : Pizza Sauce, Parmesan, Mozzarella, Sausage, Green Bell Peppers, Roasted Red Peppers & Caramelized Onions. Tons of flavor, peppery and delicious :)

Angry Bird : Savory BBQ Sauce, Mozzarella, Gorgonzola, All Natural Spicy Chicken, Red Onions & Ranch Drizzle. Great buffalo chicken style pizza, just the right amount of heat.

Don't forget the vampire worthy Garlic Knots...excellent!! You'll want to sop your pizza crust in the medley hiding below :)

Enjoy!"}
{"text":"This is my favorite pizza place in the valley! The food was awesome! If you like an authentic New York pizza this place is definitely for you! Take it from a native New York girl! Not only that but the staff and management of this place are very considerate and caring of what you think and will treat you with the utmost gratitude and appreciation! I will definitely go back for sure!"}
{"text":"Edited: When we went back to give it another try, the place was much cleaner, the staff much more attentive without being \"in your face\" and the food was much better.  We still prefer our food to have a little more \"zest\" than this does--it's fine but not exceptional--but they have certainly addressed the issues and we would go there again for a quick lunch or dinner--we would just order double extra garlic on our pizzas for more flavor.  


We went there for lunch today for the first time.  We won't go back.  My husbands pizza was fine, but certainly nothing special.  

My salad was pathetic.  Greens were fresh, carrots were fine, tomatoes were fine.  Then it all went downhill.  This was a \"meal\" salad at $8, not a side salad.  It was called the \"Health Nut\" but geez--just because I am trying to eat healthy doesn't mean I am not hungry and don't want a decent sized lunch.  Half of one red onion slice.  4 slices of an almond (as in less than 1 almond).  Less than a teaspoon of sunflower seeds.  About 1 ounce of chicken at best.

Halfway through our meal, the gentleman who appeared to be in charge came over to see how things were.  I told him I felt for a salad that was supposed to feature chicken and nuts, it should have more substance to it, that I would be going home hungry and have to eat when I got home.  His response \"More chicken next time--check\" and he walked away.  That was it.  I had to go home and eat a hard boiled egg, some nuts and fruit because I was still hungry.

Also, mold in the bottom of the soda machine (where the ice melts--we were just having ice water but eww... if they are letting you see that, what is inside?), area around trash can opening was disgusting and floor is dirty--you can tell they never move the furniture to mop.  

Absolutely cannot recommend or go back."}
{"text":"These \"build your own pizza\" places are becoming some of my favorite places to go.

The space is small but laid out well and I enjoy the large patio seating they have. It gets pretty busy but the line moves quickly.  

Make sure you read the menu, there are a few basic options for a cheaper price, or you can go for the make your own, load on as many toppings as you want awesome feast. 

The ingredients tasted fresh and I really like the option of the wheat crust! I felt the sauce could have been a little more prominent, but overall a good pie!"}
{"text":"1st review                                                                             This a perfect place for a mom son date night. He was so happy to get pizza for dinner, I loved the topping choices. He went with uncle Nicky which is ricotta meatballs and mozzarella. I did my own creation of fresh mozzarella, sausage olives mushrooms and meat balls. It was just what you would expect. The garlic knots were a hit as well. The salad was really light on dressing and didn't have much to it. The atmosphere is fun and laid back. The staff is super friendly and helpful. It's a great mix of kid fun with grown up taste.                                                       

2nd review 
So - I'm a little disappointed. The last time I came the pizza was much better - it seems they may be trying to save a bit of money and are cutting way back on ingredients- and flavor - the uncle Nicky - which was our favorite tasted like very little - there was just nothing in the sauce - it is still a cute little place, that is really comfy- it looks super clean and the staff is friendly- but in the end it all comes down to the food - even my 12 year said there wasn't and flavor in the food - good luck My Pie - I hope you get it fixed"}
{"text":"I really enjoy going to My Pie. This was my 4th visit and I'm always satisfied with my food. I love being able to add as many toppings as I want for the same price, along with choosing my crust and sauce. 

The guys behind the counter are always very friendly. The only issue is, it's not a 2 minute process. A lot of their marketing around the restaurant and on their website boast about it taking 2 minutes, not accurate. If you order a salad along with your pie, it could take 10 minutes, no exaggeration. It's still fast considering, and I can still get it to go, but it's not 2 minutes."}
{"text":"Finally something all democrats and republicans can agree on! My boyfriend and I decided to meet on our lunch break at MyPie. Let me tell you, we were not disappointed. Being a pizza connoisseur isn't just a self given title but also a responsibility to inform the masses that the best pizza on earth is in this building. They also have beer."}
{"text":"Fresh ingredients, tasty pizza, always perfectly cooked. I love to try the seasonal and specialty pizzas! They have friendly service,  too. You can tell that the employees really care if you enjoy your food and have everything you need.  And.... they do half price \"refills\" on beer and wine!  Seriously, a great place for casual dinner. It's our go-to after kids' sports games."}
{"text":"This is my new pizza place. Gone are the days when you get only what a pizza place telling you can only have this. At My Pizza you can have it all, any toppings, different sauces and cheeses. Nice welcoming staff guides you through all the ingredients, beer and other offerings not just pizza. I will be back too make my new favorite pizza creation!"}
{"text":"Build your own pizza for $8.95, employees do not really encourage nor does it say unlimited toppings, but you can pretty much get as many as you want. The crust seemed a lil more thick compared to the other build your own places which made it seem like a more traditional pizza, not a thin crispy cracker crust. Hot, fresh and tasty. Parking is a challange, I used the parking garage next door, took it to go, and there was no charge for going in and out. B+"}
{"text":"Very good pizza.  I did the Pizza My Way, with a whole wheat crust & a whole lot of meat!  They promised that it would be all ready in 2 mins & they made good on that promise.  It was hot, cooked just right & right tasty!  I also had an order of the meatballs which came with pizza dough.  They were great as well, although the dough that came with them was a bit overcooked, but that didn't stop me from eating it.   Would definitely go again!"}
{"text":"Delicious pizza and awesome  specials on beer.  Yay for peroni!!! The staff is very friendly and the restaurant is nicely styled.  It'll be awesome in the fall/winter because they have these cool garage roll up windows and a sweet open air patio.  I am for sure coming back more often!!!"}
{"text":"Very bad management. In a Friday evening at 5:30 they were all out of wheat dough. Not one person in restaurant. All surrounding restaurants were packed. Terrible mananagement.Ate there once before and they are very stingy with the toppings. Don't expect this place to be open in 6 months. I will never be back"}
{"text":"GREAT pizza.  Great prices.  You tell them what you want.  The selection of crust, even GF, and sauses and toppings is excellent.  SO fresh.  GREAT beer too.
Enough shade for lunch outside with our dog today.
Thanks!"}
{"text":"I absolutely love MyPie. There is nothing better than being able to perfect and customize your pizza order exactly to your liking. Additionally, the fun staff behind the counter seem enthusiastic to help create your order - it certainly sets the mood for an enjoyable meal. 

Customer service is top notch. A true example of going above and beyond to leave a positive, lasting impression on each and every customer. The last time I dined here, a small piece of my pizza fell off in the pizza oven. It really wasn't a huge deal; but the staff immediately created a new pizza and threw it in the oven - and THEN told me what happened. While my original pizza was perfectly fine (and absolutely delicious), they insisted on giving me one to go as well. Not necessary, but absolutely appreciated and impressive.

Great place to meet friends, take the family, or swing in by yourself. Everyone can order exactly what they want - so everybody's happy."}
{"text":"Love that I can customize my pizza and get it served to the table really FAST. Sausage was really good and they have Kalamata olives. What really impressed me was the service and the management. When I told them I was a new customer, they really took great care of me. I will be back. In fact, I think I will have them provide the food for my next department luncheon. Great service goes a long ways with me."}
{"text":"This is the same place as the old Za they just changed the name.  I like the old name better but the pizza is still just as amazing as before.  They have a ton of options for you to customize your pizza the way you want it, including white sauce, gluten free, and whole wheat.  The topping are awesome too, I like the buffalo with the fresh mozzarella.  

The pricing is very reasonable, the staff are super friendly and the eating area very clean.  All together it's hands down favorite pizza place in Tempe."}
{"text":"Fresh ingredients and flavorful. Great service, a must try. Large portions and you can customize your own pizza."}
{"text":"This place is delicious!!! Such a great bang for your buck! Staff is friendly, place is clean, and prices are fantastic! Will be back!"}
{"text":"This place is amazing! The food was delicious and the atmosphere was very welcoming. The staff was very helpful when we they were making my pie. They also had wine and beer on tap with half price refills!"}
{"text":"I've tried Fired Pie,  Mod Pie and THEN  I tried MY PIE! Service was excellent,  quality of food was fresh and delicious.  There children's meal and pizza play dough for the children to play was was cute.  Ashley is the GM there and was very helpful and attentive! A  must try if in the PV Mall area.  An added bonus is how soon your order is ready.  Very satisfied and will definitely return."}
{"text":"Great little place for a brick oven pizza.  The pizza was delicious. It was very reasonably priced and the staff was extremely polite and friendly.  They have inside dining as well as a nice patio area to enjoy a beautiful day.   I'd recommend this to anyone."}
{"text":"We both ordered a build your own pizza which you can choose from these:

1. CHOOSE YOUR CRUST
white, wheat  gluten free

2. CHOOSE YOUR SAUCE
pizza sauce , spicy fra diavolo , marinara ,  alfredo cream, savory bbq, pesto

3. CHOOSE YOUR CHEESE
mozzarella, fresh mozzarella, ricotta , feta , gorgonzola , vegan

4. CHOOSE YOUR PROTEINS
pepperoni, sausage, meatballs, salami , ham, applewood bacon , hormone-free chicken and spicy chicken

5. CHOOSE YOUR TOPPINGS
tomatoes, mushrooms, fire roasted red peppers, red onions, garlic,fresh spinach, black olives, kalamata olives, pepperoncinis, jalapeño, green bell peppers, caramelized onions, pears, pineapples, artichokes

Pizza was just alright, nothing amazing. I can think of some better pizza chains that I would rather go to. I really loved that they had a dog friendly patio and the way the place was decorated."}
{"text":"Had a great experience at this hole in wall pizza place! Great and friendly service and good food and drink. Garlic knots and Kurt Warners marinara sauce were awesome. Good choices for my friend who is a vegan, also!  Clean and great value and music - Will be back!"}
{"text":"The Pastor is nothing short of the most awesome culinary experience one can imagine from a slice of pizza. The flavors are many and are unique, but this is definitely pizza. I also had a slice of traditional New York with sausage, pepperoni, mushroom and spinach... it was delicious as well. I will be back on a regular basis. The staff was courteous and helpful in helping me to pick the best pizza for me."}
{"text":"Nice place, line location is a little odd, it's easier just to walk right through to where you need to order. Few complaints I have is management seems to be micromanaging too much, system well there really isn't one and everything should be labeled. Also waited at one register for a bit to be told to go down to the other heisted and had someone come from the back to help me while my pizza sat there 

Other than that great service and good pizza will try in a few months in hopes they get a better system down."}
{"text":"Have the Five Stars App. Got 2 pies for $12. Great bargain, delicious and quick!  Staff is amazingly friendly!  They have a delicious chocolate chip cookies!  Nice patio and close to home."}
{"text":"My pie is MY favorite of these new pizza concepts that are popping up everywhere! 

First of all, as a vegan who finds it tremendously hard to eat out, and enjoy pizza like most others do, I LOVE that My Pie has vegan cheese!  Added bonus they have a vegan predesigned pizza on their menu! Love their mindfulness! 

Also like the fact that they have a choice of white or wheat crust, added bonus!  Their selections of sauces and toppings are on point and their salads & cookies look as tasty as their pizzas!  

Wonderfully satisfied with my experiences here each and every time!"}
{"text":"Wow! I was blown away by the quality of their pizza and knots. I have tried a few other similar concepts in the valley, nothing worth Yelping about, they don't hold a candle to My Pie. The dough was slightly thinner than hand tossed, the sauce had the perfect amount of sweetness (due to the high quality imported Italian tomatoes they use that were on display). Their toppings were fresh and their spicy sausage was delicious. I had the Spicy Butcher recommended by the staff, that was very helpful and confident in the recommendation, rightfully so. I also added garlic knots to my order. The garlic knots were unreal! a generous portion and came with a side a marinara that will make you double take (tastes like \"grandma\" made it). I will definitely be back, next time I will bring my coworkers!"}
{"text":"This place is great. They offer lunch specials $5 dollar pies. Pizza is quality thought and through. It's close to campus and completely affordable. The coomie and the garlic knots are good. Overall great food for the price."}
{"text":"This place needs to update hours on their website or stop closing just for the hell of it. Seriously, the last two times I showed up here, they were closed. The first time was the Saturday before Labor Day. I was bummed, but I understood. I mean, I think it's a little ridiculous to close for 3 days for Labor Day when you're a restaurant, but whatever. Well today I had a craving pizza and decided to come back since my last attempt was a failure, but apparently they are closed at 5pm on Sunday, even though their website says they're open until 6. Well I'm sorry, I won't be making a third attempt to get pizza here."}
{"text":"I went here with a large group and was pleasantly surprised at how quick their hot pizza oven cooks up the yummy pizzas. Loved the Gluten free pizza also. Atmosphere is super cute. Love their other restaurants - Crust Pizza too!"}
{"text":"So we went to \"My Pie Pizza\" after receiving a promo text about a $5. Monday Night Pizza Deal.  Turns out these specials do not include a Vegan Cheese Pizza. We were told that Vegan Cheese costs 3 - 4 times more than so called normal cheese and our personal pizza would be like $9.  Please don't send me your promo texts anymore!   No Thank You!"}
{"text":"Thin crust. Pizza made in front of you. HOT and decent vegetarian options. Little too much oil."}
{"text":"It was decent. 
I absolutely love pizza so its kinda hard for me not to love any place that serves up my preferred meal for brunch, lunch, snack, and dinner. I wanted to love this place but after being completely spoiled by Lou Malnatis in Phx (the best pizza ever) and Gus's single slices (cheap and easy) I just can't see myself coming back here. 
The idea is great and I get why people come here but $9 for a pizza? Nah
I had their version of Hawaiian pizza. The pineapples weren't very flavorful, the ham was very thin, the center was soggy, and their tap water is disgusting. I can't really blame them for the water tho cuz ASU simply has nasty tap water. The crust was decent. I like mine crispy and the outer crust was crispy, however the center was slackin' 
Might be a good date spot but lunch for a single gal? Nah. This single girl will stick to single slices. #Relatable"}
{"text":"I call this place \"Pizza Subway\" because the pizzas are assembled like a sandwich at subway -- fast and with whatever ingredients you picked. They have gluten-free crusts for an extra cost. I got the Mr. White pizza on gluten-free crust and added jalapeño and olives (an extra $1 for toppings). It took longer to cook than 2 minutes, mostly because the gluten-free crust is frozen. Overall taste was fine for the price of the pizza."}
{"text":"Loved this place! They have several pizzas on their menu to choose from or you can opt to build your own. They make your pizza in front of you and it comes out very fast. I got the margarita pizza with mushrooms and it was DELICIOUS! All the pizzas are thin crust, so if you're not into that then you might not like My Pie. I however, LOVE thin crust pizza so this was great!

They also have happy hour all day! $6 for a glass of wine and then $3 unlimited refills? Umm, yes please. 

It's nothing fancy, but if you're looking for great pizza and booze on a Friday night then I'd suggest you try My Pie out!"}
{"text":"We went back to have dinner again tonight so I could try more pizzas and a salad. This time I had the chicken my pesto pizza. Crust was not burned. Came out a little cold but taste was good. I also had the Going green salad which was good. My husband had the Spicy Butcher and enjoyed it. 

I won't bore you readers with the other drama that went down. Going out to eat is more than the food. It's the service, attitude, food, parking and more.  I go by these rules. Rule #1: The customer is always right. Rule #2. If the customer is wrong refer to rule number #1. Suffice to say Michael again saved the day. He saw us, he came over said hi. Good to see you. Welcome back. I like this guy. And I will continue to go back and try more pizzas. And ignore the drama."}
{"text":"I love how quickly they can bake your pizza and I love having the control of deciding what goes on my pizza. This is a great little spot to grab a quick meal during lunch. The ingredients are a great variety and look mighty tasty! I like to change up my order when I come here...the choices are endless!"}
{"text":"I've been wanting to try this place for awhile, and finally went there for lunch. It did not disappoint. I got the Spicy Butcher on wheat and added fire roasted peppers, and my wife made a custom pie with regular tomato sauce, pepperoni, caramelized  onions and ricotta on wheat. The pizzas were a decent size for a personal or to share between two people. The prices were reasonable, especially considering that you can add as many toppings as you want for free. My pie was quite tasty and piled high with toppings, and I especially loved the zesty spicy sauce. My wife's was also very good. We also shared a fresh baked chocolate chunk cookie and ice cream cup, and the cookie was warm and gooey. While we didn't get any drinks, the beer and wine were cheap, $4 with $2 refills. Overall, I was very impressed and will definitely go back."}
{"text":"This place is so good! I'm usually not a big pizza person but I thought I would give the new neighborhood food stop a chance. 

I got the Pesto My Chicken pizza on wheat dough and it was amazing. The crust isn't too thin and isn't too thick. My boyfriend got the Hawaiian pizza and it was really good too. 

The pizzas only take two minutes to cook. Seems like as soon as we sat down on the patio our pizzas were out. The patio is also dog friendly!

They are the perfect size. I would say most guys could probably eat one alone and girls could split :) 

Definitely will be regulars here!"}
{"text":"I love the Whole Wheat crust pizza. So crunchy and perfect.  The kids love ordering their personal pizzas exactly how they like them.  I like that there are gluten free and vegan choices, too.  And a Dog friendly outside patio!  I wish we had My Pie in Louisiana...Please expand there!!"}
{"text":"I love this Pizza. The crust is amazing!  Great place for kids, too!!  Definitely our go to spot now!!"}
{"text":"Fantastic place. Was visiting Scottsdale and ventured down to My Pie since we are east coasters and always crave the best pizza.  My Pie did not disappoint.  The ingredients are so fresh and my wife, kids and myself all thought it was incredible.  Great concept, awesome decor and fun atmosphere.  Besides the pizza, the meatballs were amazing too. Hoping one of these opens up in Louisiana where we currently live.  Highly recommend"}
{"text":"Have eaten in the other locations and pumped one opened in Gilbert. Amazing food! Pizza was fantastic, meatballs were amazing. Fun place, great food and fun atmosphere. Will be back often"}
{"text":"My husband and I love this place!!!  All of the ingredients are fresh and organic.  The staff is super friendly.  The great thing about My Pie is they don't charge you per topping, so you can build your own pie with as many toppings as you want!  My favorite is the MY Greek Pie, but we've ordered several different pizzas and they've all been delicious!!!  I highly recommend this place to everyone!!  And they have great beer and wine prices all day, every day!"}
{"text":"I will admit that at first I thought the idea for this restaurant was kind of dumb... build your own pizza.... aren't all pizzas build your own? BUT I was wrong. The idea behind this place is build your own pizza with as many toppings as you want for the same price... I can get down with that! I built a ridiculous pizza... wheat crust, spicy sauce, fresh mozz, ricotta, tomato, pears, caramelized onions, garlic, basil, spinach, and bacon..... ohhh yaa! It was good. Also, it was huge and I ate two giant lunches from the one pizza (probably could have stretched it to 3). Further, it was 9$. You heard me, 9$! I pretty much couldn't be happier. The people who work here were friendly, helpful, and patient with me (even when adding a zillion toppings). I would definitely come back if I were in the area!


PS this place is owned by Crust.... so if you like their pizza, you'll probably like this place."}
{"text":"Best cookies ever!  Luckily the pizzas can be made to be quite light and healthy-so you can indulge in the cookies for dessert!"}
{"text":"My daughter and I decided to go back and give this place a second taste.  Hmmm seems like the Cook had a magic touch, because our early dinner was fantastic.  The prices are reasonable for such generous portions and once again, we had to request a doggy bag to take home. I hope I'll be able to upload our meal pictures.

We missed meeting the Owner.  Ha Ha, a reason to return and munch some more while hearing My Pie's history."}
{"text":"Good pizza and salad. I had the NY Roni and Caesar salad. Beer on tap is well priced and only $2 for refills!

Extremely friendly staff and relaxed atmosphere. Great patio area that's well shaded in the evening. We had a spill and they cleaned it up and topped us off without a fuss. 

I wish the pizza was a bit more crispy, but that's just my personal preference for thin crust. I look forward to coming back and trying a pie with more toppings to see how it compares."}
{"text":"I just left an interview and was feeling pretty good about it. So, I thought to myself, \"Let me get pizza.\" I have been here before and all the staff is great and today they were just as amazing as ever. They were prompt and even offered me wine. I didn't get any (since I was taking it to go) but I did get one of their chocolate chip cookies because let's be real, they are to die for! Huge chunks of chocolate and super warm/gooey.

My pizza was made just as I ordered it and boxed for me to take with me. If you haven't been here, you should totally check it out. $9 for a personal pizza with your own choice of toppings? What's stopping you?!"}
{"text":"The only place I'll go for pizza from now on.  Fast, cheap, and delicious.  The crust is bomb, and having as many toppings as you want clinches it.  The garlic knots are fantastic as well.  The pizzas are 10 inches and six slices each - great for one really hungry person."}
{"text":"Alright, so I woke up yesterday morning and my stomach was like, \"Damn, Andrew, you should get a salad\" and I was like, \"Damn, man, I fittn for a salad\". Immediately the bitter sweet thought of paradise bakery came to mind, with their impeccable southwest chicken ceasar salad + bacon + blue cheese + corn salsa. Why bitter sweet? Because their salads are so good, but so dang expensive, and I thought \"Man I am not fittn to pay $10 bucks for a damn salad\" - nah ming?

So I said to myself, \"well let's check out what yelp has to say about salads near me\". So I pull out my phone and I open up yelp and I type in salad. You wanna know what pops up #1 in salads on my yelp app? Mypie. That's right, Mypie. I'm thinking to myself \"What the eff is this place? I ain't never heard of it.\" so I open it up and look for pictures of salads to see what it is I might be gett'n into. Sooner or later it hits me, \"hey this place ain't so much a salad place as it is a pizza place.\" that gets me thinkin' and readin' some of the reviews and sure enough this place has a 4.5 out of 5 on yelp. I'm like daaaaaaaaaamn, this place must be gooood.\" So I think a litte further and I'm like, \"you know, I might be down to get down on some pizza rather than a salad.\" So I get into my car and cruise down to that shit.

I can't find it. So I pull over into Island's restaurant parking area and am lookin' on the map and I'm right where the blue dot says i should be, but I don't see Mypie. I'm thinking, \"Man, this place better still be in business, cause I am not down to go to paradise bakery and spend $10 bucks for a salad.\" So I give them a call, and I'm like \"Yo - where you guys be?\" The nice guy on the phone be like \"Aight, we be dwellin in the same area as sprouts and in-n-out\" and I was like, \"alright, thank you.\" So I drive over into that area (i was kind of already in that area, but whatev) and some how I still can't find it. So I keep driving and I pull over by the cold stone creamery, and start looking around, and BOOM, the overcast clouds opened up in one spot and shined the heavenly sunlight right upon the storefront of Mypie. Man I was glad I made it. So just so you know, Mypie is a tiny ass store located a couple of stores TO THE RIGHT of gamestop. I took a picture of it and uploaded it into yelp, so you otha paradise bakery ditchers wouldn't have to trek 20 miles to find this place - I hope you press the like button on the picture - show some love.

So I walk in and am instantly impressed. The place looks cool, there's cool music playing - im pretty much instantly in a great mood. So I look at the menu for a while and I decide on the spicy pig, or whatever it's called. I go up to the counter, which btw had no line, and they're like, \"what kind of crust\" - I say \"white\", then they're like, \"what kind of pizza\", I say \"spicy pig\", then I'm like, \"what kind of pizzas do you like?\" and he says \"spicy pig, spicy butcher, and afdaklfda\" I don't remember the last one he said. As he's doin his thing, I'm thinkin \"Man this pizza is look'n damn good.\" So I get up to pay, I pay, I get my drink, and I sit down - and boom my pizza is out and in front of me - fully cooked. I'm thinking \"wtf - it's been only like 2 minutes\". Yeah that's right, you're pizza takes like 2 mins to cook.

And did I say, the pizza was effin great? No joke, this is probably the best pizza place in phoenix. The pizza is around 8-10 inch, for around 8 bucks. Make sure to sign up for their discounts by texting mypie to 91944.

I guess when you taste something as sublime as Mypie, you want it for breakfast the next morning, ya figgadeal me? So I went and had that spicy butcher for breakfast this morning. Fu#$in great.

P.S. if you read my profile, you know I don't just give 5 stars to anyone. Mypie - you deserved this one."}
{"text":"Great pizza, had the Angry Bird. The garlic knots are excellent, so are the cookies."}
{"text":"Had my first experience at MyPie and I cannot say enough good things about the service. Both Rachel and Grant were more than gracious and welcomed us in with a smile. Two of the nicest employees I have ever dealt with and they truly made this meal worthwhile. MyPie has gained two new customers all thanks to the excellent service from Rachel and Grant. Not to mention, the pizza was delicious!!"}
{"text":"I ordered from here on Uber Eats. 

The pie was BOMB! Seriously one of the best I've had in Phoenix. It was quick and excellent service. I will definitely be ordering from here again."}
{"text":"My wife had a Groupon for this place.  We arrived and was greeted in a friendly way. They explained the process and the whole time friendly and helpful.  Now for the good stuff the pizza. I had the spicy butcher and man it was AWESOME!!! LOVE IT!!! we will be back."}
{"text":"Around ASU pizza places are a dime a dozen, but My Pie is one place that far above its competitors for the same considerable price. The restaurant is small with New York city vibe, and it always has today's top music hits playing. I would say the only downside is that they close pretty early so after a night out it definitely isn't an option to stop by and get a quick bite to eat. The Tempe location definitely caters to the college atmosphere and the majority of their customers are students mixed with some ASU faculty that are located in the area. It is a great casual place to get some great pizza while saving some time and money. 
      On one of the walls they have a decal that says \"WARNING: We cook at 800 degress the hottest two minutes of your life!!!\" This definitely shows their personality as a restaurant but it also tells a quick story about their food. Another example is their creative name for their pies, instead of basic names they add a twist. It is such a lively environment! Their staff is great and are willing to accommodate special requests. Their goal is that once your pie is in the oven you will be out the door in two minutes. They sell personal sized pizza on a thinner crust. The best part about this place is that it is made fresh and to each person! Even if you are getting one of their \"Classics\" or \"My Pies\" they will still make it fresh for you as you order. They offer appetizers that include meatballs, caprese, and garlic knots. The garlic knots are out of this world!! The meatballs are a great filling choice if you are not in the mood for pizza. They also sell salads these salads are pretty large in size for a reasonable price. While all of these entrees are delicious the cookies are the real show stoppers. I personally have been in to just get a chocolate chip cookie, they are large in size and they keep them warm throughout the day.  
 Another perk about My Pie tempe location is that if you have an ASU ID you can use it to get a dollar off any Pie anytime of day except during the happy hours. The deal during happy hour is even better, you can get any of the classic pies for $5 and a drink for $1! This is definitely within any college kids budget and we don't have to give up any quality for the price. 
 The most common pizza I get from My Pie is on the \"My Pie\" section of the menu, which means it is already created and a chef inspired. It is called the \"Spicy Butcher.\" You can choose whether you want a white or wheat crust, and then they add the spicy marinara sauce, then they add some basil in the mix, on top of the basil is fresh mozzarella, after the cheese has been added banana peppers go on next then finally to top it off is the pepperoni and sausage. This is my all time favorite if you love spicy food it is perfect for you. Definitely give My Pie a chance when you're in Tempe you will not be disappointed!"}
{"text":"This is hands down my new house to pizza place.  I love the fact that they have a great selection of pizza choices to making your own creation. Make sure you get the huge, delicious chocolate cookie."}
{"text":"Pies come out quick!  Service was good and friendly. Ordered a Pesto My Chicken, Hot Hawaiian, and a Mr. White. Got a white crust on all three. Crust was disappointing without any flavor, basically inert on all three.  Mr.White was overpowered by garlic and the buffalo mozzarella was tasteless and of low quality.  The Hot Hawaiian was probably the best of the three but nothing special as the pizza sauce was pretty bland.  The Pesto My Chicken was meh, mostly because the chicken itself was flavorless and suffered from the same bland sauce. Overall, I would say that more effort needs to be put on to developing the flavors of the individual ingredients for these pies to really soar. Great concept that is currently falling a bit short."}
{"text":"Amazing fresh made to order pizza! The service was great and the ambiance was chill! 
I had the angry bird- I added fresh mozzarella. On point!"}
{"text":"Very good \"make your own\" pizza place. All of the pizzas I have tried are delicious, my favorite is the Pesto Chicken. It is also nice that you can get as many toppings as you like without a price increase so you never feel like you can't get what you want. It is recommended to get your own pizza but if you get a side or have a smaller appetite you can definitely share with one other person. It is also nice because if you aren't in the sharing mood or your boyfriend only like ONE topping, you can each get something you want."}
{"text":"Love the pizza and the service but hate that the garage doors are always open.  Tonight it was freezing and twice when we we've gone for lunch, it was like eating in wind tunnel."}
{"text":"Whenever I am in Phoenix, I try to stop here. My Pie Pizza is a place where you can customize your pizza in pretty much any way you want! The prices are very reasonable too. In addition, they have great side orders like garlic knots, and even yummy cookies for dessert.

I love the fact that even though it's a casual food place, the servers will also bring your food to your table if you like! Lots of places in the same price range don't do that, so it's an extra bonus IMHO.

Clean, accessible restrooms. Comfortable casual seating, both inside and out. But most importantly, friendly servers who go the extra mile to make sure your time and your money are well-spent! Give My Pie Pizza a try - you'll love it!"}
{"text":"With all of these subway-type-of-make-your-own-pizza joints, it's almost hard to tell them apart. You really can't mess up your own pizza creation...can you? 

My pie has great pre-selected \"My Pies\" for those that don't want to sit there and choose and need some inspiration such as the \"Hot Hawaiian\" which is mozarella, ham, pineapple and jalepeno.  

The real fun comes with loading your own topics! They recommend not going over about 7-9 toppings, as well the toppings get watered down and heavy, it also takes longer to cook. 

Here are the steps: 

1. CHOOSE YOUR CRUST
white,  wheat , gluten free

2. CHOOSE YOUR SAUCE
pizza sauce , spicy fra diavolo , marinara ,  alfredo cream *, savory bbq , garlic and evoo , pesto

3. CHOOSE YOUR CHEESE
mozzarella,  fresh mozzarella (balls of mozarella which I recommend!) ,  ricotta ,  feta , gorgonzola , vegan

4. CHOOSE YOUR PROTEINS
pepperoni,  sausage, meatballs , salami , ham , applewood bacon ,  hormone-free chicken and spicy chicken

5. CHOOSE YOUR TOPPINGS
tomatoes * mushrooms * fire roasted red peppers * red onions * garlic * fresh spinach * black olives * kalamata olives * pepperoncinis * jalapeno * green bell peppers * caramelized onions * pears * pineapples * artichokes

6. ADD ANY APPETIZERS

I recommend either the garlic knots or the meatballs. The meatballs came with 4 huge meatballs and some side bread. Meatballs were tender, juicy and soooo good. Cookies, while I didn't get any looked super fresh and delicious. 

7. PAY UP 

Pay at the end, and grab a stick with the number. They bring out your food to you. 
-----------------------------------------------------------------------------------------------------------------
I got the wheat crust with mushrooms, pineapples, red peppers, mozarella balls, red onions and artichokes and every ingredient was fresh, and super tasty! If if you don't know which red sauce to get, I mixed both together! You can also do half and half. The wheat crust was so good, I couldn't even tell it was wheat crust. 

Service was friendly, the guy explained the whole process to us and called it his \"speel.\" We enjoyed it and listened to it all. The other staff recommended the meatballs which I got and recommend as well. 

Parking was easy pease...in a huge giant parking lot. 

Enjoy...your...i mean ..MY PIE!"}
{"text":"When advertised as a Crust Restaurant was not sure I was real excited about this place. 
Different pizza concept where you select certain predetermined items or build your own which was the most appealing idea. Was like ordering pizza and going thru Subway sub shop. Tell them what crust you want between white, wheat or gluten free. What sauce and then start selecting what toppings you want. 
They point out that their oven is at 800 degrees which explains why you pizza is ready in 10 minutes.
The employees are helpful and friendly and prompt in their service.
Price is around $9.00 per pizza and if you sign up for their text message specials you can get some pretty good deals.
Will come back and try some other pizzas, tried the Spicey Butcher with mushrooms and olives which was good but had to take off the jalapeños after eating half"}
{"text":"Our favorite build your own pizza concept,  we enjoy the pizza crust here better than the others plus they are more apt to letting you build what you want and less limit on how much you put on the pie. 

We generally go to the the location by Paradise Valley Mall and if you create an account will sent you notifications about specials and when you earn a free item.

Mondays have the classic pizzas for $5"}
