{"text":"The very best Southwestern Restaurant and New York Pizza joint got married and had an amazing miracle baby named My Slice of the Pie.  This little gem in  Arcadia never disappoints, and owner Randy is always in to make sure of it.  Try my favorite- the Supremo pizza, it has southwest sauce, Pollo Asado, chopped garlic, chorizo sausage, green chilies, roasted corn, red onion, Asadero, mozzarella, and Cotija cheeses topped with chopped cilantro, it's AMAZING!  Though beware, you'll be addicted after your first visit.  Keep up the good work guys!!!"}
{"text":"I ordered from here 3 or 4 times. My family likes NY style pizza and this place is right in our neighborhood. I like that the pizza has fresh basil and good flavored cheese. However, my kids are not a fan. They dont like the sauce, too pastey. The also dont care for the basil.  The crust needs some work as it  has had too many air bubbles and over cooked....way too crunchy. Impossible to eat left overs as the crust hardens like a brick."}
{"text":"Excellent new pizza joint!  Great service with friendly people.   The owner, Randy, is cool and genuinely appreciates the customer.  We had the Southwest Veggin Out, a Traditional NY Style and an El Blanco.  All three were delicious and the El Blanco was out of this world.  The tag line; \"Where NY meets the Southwest\" is right on!  My Slice of the Pie will quickly rank among he best in Greater Phoenix and don't be surprised if you see more of them all over the valley.  Can't wait to try more options on the menu and they are starting to deliver so I can get it right at my door! Go before there is a long wait!"}
{"text":"I ordered 2 pizzas and I'm in love. By far some of the best pizza I've had in phx and I've been here 20 yrs. I can't wait until my next cheat day. I had the original supreme and I believe the ...idk but it was delicious with a good amount of kick. I'm picky about my pizza so this is my new place. Price around $12 per pizza can't beat it with a stick."}
{"text":"Great pizza but an extremely long wait, call in advance and add ten minutes to the expected wait time"}
{"text":"This is a great place! Had my birthday party there and all my friends really enjoyed the pizza, salad and drinks! Definitely my favorite pizza place!"}
{"text":"Pizza was very tasty. The manager was so dedicated to serving a product with such a high level of standard, that he replaced our order without even having to. Top notch product AND top notch customer service is a win win. I definitely suggest coming in if you're ever in the area."}
{"text":"Me and 2 coworkers went in for lunch and it was incredible. The service makes it worth it alone. Everything about the pizza was awesome. Popeye salad was great! We definitely just found our weekly regular place together. Thank you again for everything sir!"}
{"text":"Just a quick review.  Best customer service ever! I was greeted by a very nice gentleman (possibly the owner), took the time to explain the menu to me and even showed me my food when my order was up to make sure I was satisfied!  I decided to try their Pepperoni and al Pastor, loved them both but OMG the Pastor was Amazing!!!!  I would definitely recommend this place to anyone with a sick obsession for Pizza like myself!"}
{"text":"The pizza here is delicious and their ranch is also good which as we all know is extremely important. Their white pizza has some funky flavors so I probably wouldn't order that again (it was just really different from what we expected) - but even down to the basics like a cheese pizza, it has become our go to pizza joint!"}
{"text":"This pizza is not good. It's like a Fresh veggie plate on a pizza. Wings are great but he the pizza is NOT GOOD.  If your in the area go to Gino's."}
{"text":"This place is SO GOOD. Came because of the 5-star rating on Yelp, coming again and again and again because of the delicious pizza. The southwest sauce is something else and definitely is an option everyone should try!"}
{"text":"We stopped here one night after I noticed that they were the \"Hot New Trending\" business on Yelp! We walked in on a Sunday about 30 mins before closing and received (IMHO) stellar service.  We were greeted by the owner who was patient enough to give us an overview of the selection process and the toppings (not every topping is self explanatory; he's got a varietal of meats and sauces and could suggest what works best together). After we ordered, our slices arrived about 15 mins later and it was well worth the wait. The artwork on the wall tells a story of it's own which will have you staring off while you chomp down on your meal.  There is no way to come up short in a place like this. The options are in abundance from the toppings to the sauces. You drive what goes in your mouth here. Either select from a creation on the wall or craft your own masterpiece.   It was definitely nice to buy slices vs. an entire pie, even though you have can do that as well. Doing so allowed us the chance to explore their menu options without the commitment of an entire pie. Mr. B. and I love pizza and will definitely keep My Slice of the Pie on our list of contenders."}
{"text":"Fantastic pizza.  Not only was the pizza awesome, the owner was super friendly.  I always like to support smaller, local restaurants, and this one is on the top of my list."}
{"text":"My husband & I stopped in for a pizza today at lunch. Saw reviews on Yelp thought we'd give it a try. We miss hand made crust. Tired of the chain stores pizza dough. We live in Sierra Vista we were up here to go to the airport. Worth going out of our way. Good pizza crust & toppings. Good service & friendly employees. Recommend."}
{"text":"What a great new local business! The pizza is excellent  and the service is unmatched at this price point. A great addition to the neighborhood."}
{"text":"Absolutely loved this new pizza spot! My 5 & 4 year old asked if we could go back the next day. Pizza was really good but the customer service and experience was even better! I believe it was the owner who brought out dough for my little ones to play with. I would recommend this place to anyone who wants to try something different (the menu has an awesome variety of pizzas) and is looking for a kid friendly environment"}
{"text":"Pizza was delicious, owner really nice, my daughter learned how to play checkers with me on the table top boards they have, was a great experience.    I'm a plain cheese pizza snob, and this place does it right, some basil cooked under the cheese and all the right texture, consistency and taste.  Awesome job!    Also the Al pastor, holy crap good.  I'm going for the Carne asada next time.    I wish this business well and many, many years with us in Arcadia!"}
{"text":"I'm from NYC, been in Phoenix for one week and I'm fairly sure I've found the best pizza in the city. We had the Supremo and the El Blanco, both absolutely delicious. The crust was ALMOST the perfect amount of crunch. I'm coming back for the El Pastor. Keep in mind they can make you gluten free pies upon request!"}
{"text":"In neighborhood full of wonderful restaurants, My Slice of the Pie Pizzeria is a welcome addition. We discovered My Slice of the Pie after getting a flyer put on our door and it was a match made in heaven. Its so nice to have a good 'ole pizzeria around the corner. The pizzas are all delicious and we love the creative combinations. Sandwiches are hearty and extremely filling. The owner, Randy, answers the phone and always greets you with a smile. Can't say enough good things about My Slice of the Pie."}
{"text":"Randy the owner is a super nice guy.  The food is amazing, try their meatball sub it's great"}
{"text":"This place is awesome!! The pizza is delicious! The crust is amazing! The atmosphere is inviting and friendly! I am pleased with the customer service. The Checkers games at select tables added a nice touch. The prices are reasonable."}
{"text":"This review is well overdue but I can only speak to the quality of the pizza and their delivery.   When they first opened I called hoping for delivery but Randy the owner hadn't had a chance to set that up but he said he'd deliver it himself.  (They now have delivery service and they are all awesome) . We ordered what has become our standby (New York crust with sausage, onions and garlic, Caesar salad with anchovies on the side) 40 minutes later Randy comes through. Super great guy and here is one of the many reasons why: I paid in cash and he said \"no need for a tip\", well I'm always tipping for great service whether you own the business or not and gave him the money.  The pizza is as good as it gets around here, great sauce, crust and ingredients.   The next day, I think it's around 11 am,  Randy knocks at the door, I said \"hey what's up\" and he hands me $20 and says: I don't think you meant to be this generous\"!   Yah, no I didn't but who does that sort of shit these days?  So there ya go...great food, an amazing owner who deserves and earned my loyalty and I'm guessing you'll experience the same!  Sometimes they forget the extra sauce or something minor but it's easily overlooked,  last night the delivery guy said he'll be right back with the sauce and within 10 minutes, he was!  Okay?  Enough said?"}
{"text":"Legit place. Great New York style pie! Plus right next to a bar where they hand deliver to!"}
{"text":"The name of the business says it all :) On a short trip my friends and I have had the chance to eat here twice but I was very happy with our choice of The Supreme Being Pizza along with wings. It wasn't perfect but definitely delicious and satisfying and that's all that mattered. the price was good, the venue was comfortable and we had a great time there. I would definitely eat there whenever I visit Phoenix."}
{"text":"When you come from a place known for a certain type of food, trying new places can be fraught with anxiety. What I've learned about Yelp is that everyone has an opinion and often they are very different from mine. So I went to \"My slice\" with cautious optimism that it was a decent pizza based on the yelp praise...Well to say it was awesome is an understatement. It is genuine, authentic kick-ass pizza!  Come to find out its owner is the brother of an old friend, just made it even better. You want great pizza in Arcadia, there is only one place to go!"}
{"text":"This is by far my favorite new pizza shop. If your in the arcadia area, I strongely recommend stopping by and having a slice or two. The al pastor, and  anything with the southwest style sauce is delicious, as was everything else that I've tried. I dont think I've ever experienced better customer service.   After being there a few times now, its become obvious that their owner Randy is doing an outstanding job running this shop and he's just fun to talk to. Last week we ordered a pizza for carry out and once I got home I realized that they accidentally forgot to include an ingredient on our pizza. This didnt bother me, as the pizza was still delicious. As I sat down to eat, I got a call from the shop acknowledging that they had realized this. I was promply offered that my next visit would be compensated, which I happily took advantage of tonight.   They definitely go the exta mile when it comes to customer service, and their quality of pizza is hard to beat. Oh, and they have checkers boards built into the table to play while you wait for your food."}
{"text":"Terrific pizza! Good yeasty but thin crust. The El Bianco was delicious. Good friendly service too."}
{"text":"This place has legit pizza!  Met my husband here for a quick bite and was thoroughly impressed.  Most of the pizza in Arcadia is so-so....this was totally different.  Their specialty pizzas are creative and sound wonderful.  My husband had a slice of the Al Pastor, and it didn't disappoint.  I got a slice with numerous toppings and it was loaded!  The bottom is super crunchy, but the crust and middle are also chewy, great combo.  We will definitely be back and will take advantage of BYOB."}
{"text":"Great pizza, and the owner is personable.  Not going anywhere else.  Always have to root for a guy starting up a place and running the day to day.  Also, I was born and raised in New York.  Closest thing out here so far."}
{"text":"Fantastic pizza! To reiterate the other reviews, the Al Pastor is amazing and pretty much anything with the southwest sauce is delicious. Also the staff are super friendly and are more than accommodating!"}
{"text":"Wow!!! I was blown away at how good this pizza was! If you are a pizza person then this is a must try!!!"}
{"text":"So excited to have this joint next to my favorite bar in Arcadia.  The pizza and service is great.  Owner there working his tail off to make everything right.  The southwest style is new to pizza.  I cannot believe nobody else has done this.  The al pastor pizza is a must.  Wife had a salad and loved it.  Thanks to everyone there.  We'll be back often.  Please add delivery soon.  In the meantime I'll use postmates."}
{"text":"Pizza was really  good . We will be back. I recommend it come check it out . Great customer  service"}
{"text":"Loved My Slice of the Pie Pizzeria! We ordered an 18 inch pepperoni with basil for take-out and when we arrived to pick it up, the gentleman gave us an extra slice because he thought the pizza had looked a little small. We were both shocked because nobody had ever done something like that before! He was very friendly, not just to us, but to all the other customers there (I'm assuming he was the owner). Loved the pizza! Great flavor, not too greasy, and big slices. Didn't think it was on the smaller side at all ,but greatly appreciated the extra slice of deliciousness!! Will definitely go back!"}
{"text":"I'm so excited this pizza place opened in my neighborhood. I love the perfect sauce and crust on their New York style pizzas. We ordered delivery several times and picked up pizzas as well. Every pizza has been delicious, and prices are reasonable. If you live in the area, skip Dominoes, Pappa Johns, and Little Caesars and order your next pizza from here instead. You won't be sorry."}
{"text":"We ordered a pizza and salad on Sunday night.  Had it delivered for $3.  The best pizza we've had in a long time!  great thin crust, crunchy on the edge, perfect! Fresh ingredients too.  Large pizza with lots of stuff only $15 and a really yummy spinach w blue cheese salad.  Our go to place for pizza as of Sunday!  Try it you'll like it!"}
{"text":"Great Pizza !. Had a slice of pepperoni and jalapeno. Great crust, sauce and toppings."}
{"text":"The Al Pastor pizza is insanely good! It may sound a little out there but I 100% recommend it - you won't be sorry!!"}
{"text":"New York Style with fresh made ingredients. Ordered a 18\" 1/2 cheese 1/2 pepperoni and sausage. The pizza came out pretty quick and was very good. The Small Caesar salad was good size for it's price."}
{"text":"The best pizza place hands down.  You must try the Al Pastor... it is phenomenal! A perfect mixture of sweet and spicy, and the slices are huge. The owner is there literally every day and wants to make sure you have the best experience ever. 5 stars!"}
{"text":"Bomb.com tell your mom.com pizza and cute guys working there!!!!! Next level!!!! If you're unsure about going here, don't be!! Oh and you can bring your own alcohol. Perfect for a pregame. One love"}
{"text":"The pizza was awesome. I went in for just couple of slices but they stop selling by slice after 5pm so I ended up buying the 12\" pizza and I'm glad I did. You gotta try it!!!"}
{"text":"This is by far the best pizza place to ever his Arcadia, at least in the 23 years I've lived and worked around here.  Randy the owner is a great guy and the service is always great, whether you eat in, carry out or get delivery.  We eat here at least once or twice a week."}
{"text":"We just picked up a pizza from My Slice of the Pie and I can't believe we haven't eaten here yet.  I met the super nice Owner Randy who was so friendly and truly takes great pride in making sure the service and pizzas are top notch.  They opened in March and I've been wanting to try it since they opened.  We got the Veg pizza and it is amazing.  The menu is extensive and has something for everyone including gluten free.  They are BYOB so you can bring your own beer, wine or cocktail here or buy it next door and bring it in.  (No more sneaking a flask in to dinner) To me, that seals the deal for all future pizza.  I'm so happy to find a local pizza place that cares about the quality and experience. My Slice of the Pie blows away any chain or franchise pizza."}
{"text":"Came In for the first time yesterday had their Carne Asada and Al pastor pizza and let's just say we're never ordering pizza from anywhere else again this was the best pizza we've ever had can't wait to try the rest of the food on their menu! We also had their wings with Pineapple habanero sauce and their mole BBQ sauce OMG we were in heaven  I'm not a huge BBQ sauce fan but this one had me licking my fingers! Not only was the food AMAZING, But the staff was incredibly nice,  All smiles great vibes !"}
{"text":"Arcadia we have a pizzeria. This definitely feels like a local joint. I got a cheese pizza because I am a simple person but I thought it was awesome. The sauce not too sweet. You fold it in half and eat it and do that for 4 slices. Give it a whirl. We also met the owner who is passionate about the product which makes it even better."}
{"text":"If you're a New Yorker missing \"real pizza\", go here! The staff is very nice, and friendly. Don't expect N.Y. back talk.  The pizza crust is nice and thin but with a substantial bite. Good tomato flavor and perfect spice in the sauce. Usually with other pizzas I put more seasoning and parmesan cheese but this doesn't need it. You may want to ask for red pepper chili's if that's your thing?  Remember, a real N.Y. style slice has lots of grease to drain. So if you take out, throw that box in the garbage because I highly doubt it can go in recycling.  There are plenty of other adventurous choices and delicious looking desserts. I cannot comment on because I haven't tried them.  While waiting for take out pizza some months back,  my friend and I observed excellent, attentive service to seated guests. The decor and ambience is laid back, casual if you decide to dine in."}
{"text":"Their carne asada pizza is one of the best pizzas I've ever tasted. The flavor combo is amazing. Great service and friendly peeps too, they'll bring your pie over to the Whining Pig if they're not too slammed."}
{"text":"Being a pizza snob from Jersey...this place is legit! Brings me back to the east coast which is rare in AZ! Everything is amazing but to be totally honest all you need is a slice of cheese pizza to be blown away! But definitely explore the menu cause everything is top notch!"}
{"text":"I thought this place was very good! Great customer service! I believe it was the manager or the owner helped me out. I asked if they delivered he said not officially for a week or so but I'll go ahead and deliver for you!! Truly amazed I was...I offered to pick up my order but he said no I can bring it to you!! I was satisfied with the food and the service! Just wish I got buffalo hot wings that's my bad but it was good! I recommend this place indeed! Thanks for delivering I appreciate it a lot!!!"}
{"text":"We were visiting Phoenix to check out college for our son. We looked on Yelp and it had a 5 star rating and we were not disappointed! They had great regular pizza and some great southwestern flavored pizza, with an awesome cucumber ranch with pepper dressing! It was so tasty. I would recommend anybody in the area to check it out!"}
{"text":"Yeah,  sorry that's a no go.  Great idea and selections, unfortunately poor execution.   First clue should have been how few people were there.  Followed by a 20+ minute wait for 2 slices. Finally,  Pizza so overcooked it should have never been served.  My recommendation for good pizza... avoid going to My Slice of the Pie."}
{"text":"I am a Chicago native, so please let that reflect on my review. I am currently on my third slice of The Supreme Being, and have already had a serving of The Rising Phoenix salad-- both are quite delicious.  My Slice Of The Pie is a really, really great \"I've Had A Long Day and Just Really Need Some Quality Pizza Delivered To Me\" type of place-- I've not been in the restaurant, so can't comment on that.  The tomato sauce on my pizza was yummy in a slightly sweet way, the amount of ingredients was very generous, and the seasoning was just right.  The salad was really delightful and unique, refreshing with a kick.  Customer service was also great: the fellow who took my order on the phone informed me that I was out of their delivery range, but made an exception because they weren't super busy (Tuesday night)-- I did not expect this at all, and found it quite generous of them.  Even my delivery guy was very polite and friendly!  When I judge things, I judge them based on what they ARE-- I've seen some reviews of this place that seem to expect My Slice to be a gourmet, white tablecloth kind of pizza. That's not what this is trying to be. There are different kinds of great pizza, this is the everyday \"go-to\" kind that I will order on nights when I just don't really feel like cooking.  Oh! Also (to that point) VERY awesome pricing for the food that you get.  Even if I need to carry out in the future, I'll definitely be returning."}
{"text":"So I had a craving for some pizza and wanted something in the area.  I checked Yelp and it lead me to this establishment.  I've read some of the reviews and wanted to give this place and try and I'm very glad I did.  So I work in the biltimore area, there are a lot of good places for lunch, but not a lot of options for slices of pizza, cause who's gonna smash a entire pizza during  their lunch break.  So my buddy and I stopped by today for some pizza.  I asked the worker up front what does he recommend, and he told us we should try the Al Pastor What and the Carne Asada pizza in which we both did.  The pizza was delicious.  I've had pizza all over the country, but haven't sampled these flavor profiles I was getting from these slices of pizza.  They are pretty damn awesome.  The slices are NY style and can hold all the ingredients well.  The crust was still crispy and had a nice chew to it.  Very pleasant on the palate.  My co-worker and I were very impressed and highly recommend this place.  On top of it, the customer service was outstanding.  My co-worker is allergic to avocados and requested no guacamole on the pizza, well they accidentally serve him the pizza with it, but they quickly offered him a new slice for the error.  The manager walked around and checked on the guest and even offered to refill the patron's soda's.  In conclusion, I would highly recommend this place for awesome and very flavorful pizzas!  i can't wait to stop by this weekend and bring a pie home for the football games!  Great food and awesome friendly customer service!"}
{"text":"The BEST pizza in Phoenix ! AMAZING hospitality and refreshing to see an owner that is so passionate about his food and the ingredients ! Got to tour the kitchen and products and it was great! Thanks for the experience ! Very unique menu as well, not your traditional pizzeria"}
{"text":"This is a fantastic hole-in-the-wall Pizzeria a lot of different spices to choose from I have a carne asada slice and the cheese slice the cheese slice was great love the flavor the sauce just the right amount of sweet cheese taste great too and the dough after you taste like bread not like flour and water like most New York style pizzerias the carne asada pizza was okay Mavis let it sit too long it's got really soggy I just ended up eating the toppings didn't care for the sauce on it either but definitely will be back I want to try their elote Pizza or flatbread whatever it is great little place"}
{"text":"Phenomenal pizza and excellent customer service! Owner is local and super friendly. Pizza is high quality and clearly made with love! Al Pastor is unbelievably delicious!"}
{"text":"Owner was the nicest guy who really cares about his customers and makes sure they are well taken care of. The pizza is excellent! And the southwestern take on the pies was really well executed. I will definitely be coming back for more!"}
{"text":"My wife and I were craving pizza so we decided we would give it a try. The atmosphere was great and the pizza was amazing. We had the supremo. I would call it a spicy sweet treat! Will definitely be back!"}
{"text":"Awesome pizza! Had the Al Pastor Pizza and it's perfect. Just the right amount of spice and the ingredients are quality. Different than any other pizza place in AZ in a good way, and the staff are really great too. Five stars without a doubt!"}
{"text":"Very average. I cannot recommend this place. The pizza was excessively mediocre. The service was great. I don't eat service."}
{"text":"Al pastor pizza is amazing, nothing like I have ever had before. There other pizza is really good, as well as the wings"}
{"text":"The pizza was really good and the service was even better! We stopped in on our way to a show at the celebrity theater, and I'm so happy we found this place! Next time we're in Phoenix, we'll be back for sure!"}
{"text":"For an easy to go pizza this place is fantastic; they experiment with different flavors and have no issues making any changes to your choice of pie."}
{"text":"This is the best NY style pizza in town. The crust is perfect, sauce is awesome and there is a good portion of toppings. In a town with a lot of good pizza, this places reigns supreme. In addition, the customer service is exactly what other restaurants should aspire to achieve. The owner cares about his customers and makes sure your pizza and experience are memorable."}
{"text":"We order from here at least once a week and they deliver! Consistently good and very friendly people work there. The crust is just the right amount of crispy and chewy. Lots of toppings to choose from and giant slices to satisfy."}
{"text":"Great customer service, decent prices, and tasty food. I will definitely be back in the near future."}
{"text":"I have tried almost every pizza spot on Indian School Road. This location has the best east coast style pizza by far. When I try a new pizza place I order a simple cheese pizza, because I believe that is one the best way to taste the sauce, cheese, and crust. My Slice Of The Pie Pizzeria has excellent sauce, cheese, and crust in which all three create a very flavorful pie. Also a very friendly staff and family eating environment!"}
{"text":"What a gem this place is - Pizza crust was thin and just the right crispiness. We ordered a 12\" El Blanco pizza, very tasty and hard not to eat all at once and side salads... the green chili ranch dressing is delicious and definitely a must try if you like the ranch style varieties.  Dessert - oh my, we had the raspberry jalapeno cheesecake, so good so crave-able - another must try if you like savory/sweet combination. Had a little sting to it but that didn't stop us from polishing the plate.   On top of all this delicious food is one of the friendliest owners. Randy was very attentive, gave us samples and kept our drinks filled.   Will definitely go back and try the Al Pastor and the Carne Asada and the wings."}
{"text":"Great food, great service. Visiting from the northeast & loved the NY style pizza for the kids & impressed by the flavor of the southwest style. Loved playing checkers with the kids while we waited. Definitely recommend this for pizzas of all kinds & sandwiches too!"}
{"text":"This is by far the best pizza I've had. I love the atmosphere and the customer service is outstanding! My go to place in AZ!!"}
{"text":"Created an excuse to make it to this part of the city today as the pizza was calling me. I ordered the southwestern veggie and the al pastor for my dinner tonight. On the ride back to Cave Creek I had a small pizza emergency and had to have a piece of each while they were hot. They are both amazing, nice crust that is slightly toothy in an perfect way and the topping were balanced and flavorful. Quite frankly regretting not getting two large pizzas even though there are only 2 of us for dinner tonight. Thank you for a high quality pizza with top shelf ingredients. You guys are twisted to say the least!"}
{"text":"We are visiting from out of town and always use Yelp.  We enjoyed the pizza, but it was in the salty side.  We had the pepperoni pizza!  Additionally we ordered the mild wings, damn they were really good.  If we ever found ourselves in the area again, we would give them a call."}
{"text":"Finally had a chance to try this spot, and I'm already thinking about the next time I get to stuff my face again! We ordered the infamous El Pastor pizza, and the only thing I hated was that I got the 12\" and didn't have enough leftovers. Everything about it is perfect. We also ordered a custom pizza, and the red sauce was so flavorful. The dough/crust on both pizzas were chewy with a snap, and never got soggy. Again, can't wait for our next pizza night to try more creations! Bravo!"}
{"text":"I have only ordered delivery, but I must say the pizza is amazing! I'm from buffalo, so I'm picky about my pizza and wings... this place rocks!"}
{"text":"No complaints here.  Had a wonderful experience.  Pizza baked fresh when ordered. The young kid at the register was super awesome and made great suggestions.  Blue cheese dip for the crust just sealed the deal of an awesome experience.  Be back soon"}
{"text":"Before even talking about the pizza, the customer service is awesome! We just moved here from Ca and this was the first pizza we've had out here in Az. We were very satisfied with our food. Randy was amazing! Very outgoing and welcoming. He helped us by providing sample sauces before we choose our wings(hard decision but went with the sweet and sassy and LOVED it) Great food great atmosphere and the best of all great service!!!"}
{"text":"The employees here are polite, welcoming, and patient. Eli was helpful and accommodating.    Pretty relaxed vibe. Feels like the east coast for sure (including PBR and checkers built into the tables).   Everything is really fresh here. All pizzas are made to order even the slices, which is great.   Regular slices are delicious. Good sauce, cheese, and crust crispiness ratio. Mouth feel was like a 7.    Elote flatbread will change your life. It was amazing. No need to waste anymore words. Do it. Now. Get it.   Kinda sad we missed the raspberry chipotle cheesecake, but original and spiced pumpkin are here. Will be checking back soon for the raspberry though!   Mexican cokes, cocktails in a can, and pellegrino are in the cooler."}
{"text":"Don't write many reviews but this is too good to not spread the word!  Just tried my first Al Pastor and You Gotta Carne Asada slices.  Your taste buds will dance and your mind will be blown!  NY/ Southwest fusion done magically well!  I will be craving this stuff!"}
{"text":"Ok I had high hopes for this place based on the reviews. The dough was great, thin and crispy how I like it but the pastor pizzza, which I think is one of their most famous one was not that good. The wings were delicious and we also had the supreme pizza. That one just needed more cheese. The pastor pizza in my personal opinion was not that great and this could be because I am Mexican and know what real pastor should taste like but this was no it  Everyone was very nice and the food did come out fast plus they have Mexican coke bottles which I love. But to be honest the pizza was not anything to get excited over.  There was just something missing"}
{"text":"Such a good blend of available pizzas, salads and wings. Haven't had anything that wasn't absolutely wonderful."}
{"text":"We decided to try this place out  on a Saturday since we always see their pizza special sign and because we had pizza on our mind since Friday night. Went with classic pepperoni and I must say it was delicious despite being a little too salty. We also ordered garlic cheesy bread that was equally delish and would have been better if the marinara sauce was warm. On the plus side, it had fresh basil in it...YUM!  We ordered for carry out and my husband was impressed that he brought out the order and opened to box to show us our order. Something about that gesture made us more comfortable with our pick. The Supreme Being sounds interesting so.....we will be back!"}
{"text":"Me and my boyfriend stopped in here prior to going out and I must say this is the worst place I have ever been too. Not only is the food gross but the employees are rude. We waited 20 mins for two slices of pizza and garlic bread. But after waiting 20 mins to only receive one edible pizza cause the other pizza slice they brought out was burnt and had a huge hole in the middle. They said they would remake the pizza. We waited another 15 mins. Then when I asked where the pizza was as we had waited another 20 mins and they said it would be another 5 more mins. I was so unhappy as the pizza wasn't good and my boyfriend didn't even get his pizza. I then told the lady at the counter never mind we weren't going to wait anymore on a pizza that didn't taste good and that we waited almost an hour for it. She then got an attitude. I will never go back again. The sign on the wall best pizza on YELP. What a lie. Not only that but every customer that came in to get pickup orders had to wait there as well. They are slow and food taste gross. I also sampled the ranch and that tasted like watered down ranch."}
{"text":"i decided to give this place a try based on a friend's suggestion. I had tried the previous pizza by a different business in the same location and was thoroughly unimpressed - so I was a bit skeptical. We like pepperoni & pineapple pizza and this pizza did not disappoint. Really nice crust and wonderful flavor. The pepperoni was a tad spicy, but delicious! I want to try the Bianca next time. We ordered a slice of cheese for my finicky daughter and she loved it. The gentleman behind the counter was very helpful. And the owner, Randy, was great! We will definitely be coming again."}
{"text":"Today was my second time going and it is great. I've had the pepperoni, Al Pastor and Carne pizzas. I think I like the Al Pastor the best...so far. Very affordable and good portion size. Not far from home and the owner is a lovable guy. Thank you!"}
{"text":"The Southwestern Veggie Pizza (\"Southwest Sauce, Mozzarella, Asadero, Roma Tomato, Diced Green Chili, Roasted Corn, Red Onion, Fresh Garlic, Queso Fresco, Cilantro, Cotija\") was perfection. The Carne Asada Pizza was okay, I mostly just tasted the meat and cheese, not much else despite there being other toppings - the meat must have been too overwhelming and muted the other flavors on the pizza.   Service was great! But the prices were high. For an 18\" specialty pizza it came out to $28. So if you do order that one I recommend sharing it with at least two other people. Also, the bathrooms were dirty and needed some TLC.   I do like the mural, locally inspired and comic relief at the same time - Camelback Mt. as the hump of a camel."}
{"text":"We got this pizza for pick up and it was super tasty. Perhaps not quite as quality ingredients as others, but definitey satisfying. We got one pepperoni & extra cheese and it was the quintessential greasy classic pizza. I found it delish, but my body didn't like it as much...if you know what I mean. Great for a big pizza party. :)"}
{"text":"Recently had a pizza here and it isn't the same pizza that I fell in love with when this place first opened and I would drive across town to have some. Not sure what has happened."}
{"text":"Gotta love it when the friendliest people serve really large, hang-down-the-side-of-the-plate slices with a good chew and great flavor, just like the huge slices I enjoyed in my years in the Bronx, Manhattan, and Brooklyn. They don't skimp on the toppings either, and the best way to prove that is to order their spectacular Supreme Being pizza. Certainly I'll be coming back for more, and definitely for the al pastor pizza that everyone is raving about."}
{"text":"This was my first time eating here. I ordered the rise like a phoenix salad and it was one of the best salads I've had in a long time! I ordered it for pick up, it was ready when I got there and they were friendly to make it better!"}
{"text":"Love love love My Slice of the Pie. Simply the best pizza in the Valley. It's consistently cooked to perfection, especially when ordered Southwestern style. Along with the cravable food, the service is amazing. The owner and cashiers are always friendly and helpful. Hidden gem in the Arcadia neighborhood."}
{"text":"We dropped in for a late lunch after reading the yelp reviews and were very impressed with the pizza. I ordered a slice of the carne asada pizza and a slice of the el pastor. First off... The pizza crust is amazing. French inspired, and according to the owner who's obviously a foodie is inspired... We talked about their process which takes 2 days for the dough. Not thin, not thick crunchy outside with a bit of breadiness and yeast risen flavors in the middle. Crunchy and firm bit soft and fluffy. On top the sauce was not pizza sauce but an unconventional spicy salsa like base. Layered on top the flavors you'd expect from a world class asada or el pastor are layered with cilantro avacodo cream etc. It's fusion pizza and it's very good. The owner spoke with us and said America's taco shop was his previous gig and the asada and pastor are prepared the same way prior to being integrated into the pizza. They were also testing new food, saw a sweet potato chorizo pie and were given a pastor egg roll test samples by the owner before we left. I have no idea how good their cheese, pepperoni or sausage slices are  but their more Daring slices are so s of the best I've had. Go out and try this pizza, it's amazing."}
{"text":"So my little brother was going out of town and had left over Carne Asada and Al Pastor slices in his fridge from the day before.  He insisted I take them and I am so glad he did!  DELICIOUS!!!  I reheated them in the oven added hot sauce and some fresh cilantro and YUMMMMMM!  I can't wait to go back and try some fresh pies!  That Carne Asada is the star !"}
{"text":"The pizza here is average for the Phoenix metro area.  The pizza had the perfect level of cheese, meat and oil, yet the crust was a complete letdown.  The crust simply lacked flavor and was tough to chew through.  The meat and cheese included in the salad were delicious, but overall the salad was bland."}
{"text":"PSA: THIS IS NOT YOUR AVERAGE PIZZA JOINT!   AND i'm absolutely obsessed with it.   My husband and I live SO close and JUST NOW made it in. I'm kicking myself for taking so long! We had the pleasure of meeting and chatting with the passionate owner about his journey as a small business owner and how he came up with this remarkable concept. We left SO inspired. He is truly an amazing guy!  No onto the food! To start, we split the Against-Pasta salad and it was SO delicious. Extra crispy and COLD lettuce with meats, cheeses, GRILLED in-house artichoke hearts, cucumbers, red onion, green peppers, and black olives. It is a BIG salad so I highly encourage splitting it if you're getting pizza too (which duh, you better be getting pizza too!).   I ordered a slice of their Carne Asada pizza because I had planned on eating more salad (trying to be healthy, you know - this whole new year, new you thing is really getting to my head!). ;) And after the first bite, I wished that we had ordered an entire pizza. YOU GUYS - the carne asada pizza is literally one of the best things ever! Do yourself a favor and get it. There were so many tasty ingredients on top that I can't even begin to list them all but trust me, you'll be obsessed too. THE CRUST. That was one of the best parts. It was the perfect combination of crispy and chewy, with a little char on it. YES. I LOVE that they incorporate so many unique sauces and flavors when coming up with their pizza combinations.   DANG, MSOTPP, you're onto something! We can't wait to come back!! We'll definitely be getting a slice of that cheesecake next time, too!"}
{"text":"Not your average pizzeria! Absolutely fantastic slices. Really enjoy the Mexican twist to some of the menu options. I would recommend trying the al pastor and carne asada."}
{"text":"This is a pizza place worthy of eating for dinner and then polishing off the box during a drunken stupor later that night. I've ordered a small one at the pig's meow next door before and been delighted to enjoy take out pizza at the bar.   We ordered this for our office today. We got the Al Pastor, the Veggie, and Cheese. On the side we got the salad with green chili dressing. Amazing! Huge salad for only $6.   The veggie pizza was a little soggy but such is the case with the majority of veggie pizzas. Amazingly filling - one slice of the large veggie and I was satiated.   I can't wait to go back and make my own combination. I might ask for the pizza extra crispy, but I like it that way!"}
{"text":"Hands down best NY style pizza in the valley. Glad I found this place. Blows NYPD and all the others out of the water. You can't compare this kind of pizza to LGO, Biancos and Pomo, they are in different food groups. People who understand that and like NY or NJ style foldable slices with the right crust, sauce and cheese combo need to try this. They will understand.  Well done."}
{"text":"Quality pizza, crisp bottom, worth the wait. Great pizza by the slice. Good customer service. Never would've known about this place without Yelp."}
{"text":"I love this place! Eat in or take out, the pizza is perfect. Crust is great, sauce is amazing, and lots of excellent cheese and pepperoni. I can't believe they weren't mentioned in this months Phoenix Magazine. They deserve a shoutout"}
{"text":"The carne assada pizza was delicious and freshly made. The delivery was quick and easy with very kind staff. We will be eating here again."}
{"text":"Try the pastor pie for somethings different and delicious. The owner Randy was very nice and it's good to see someone so passionate about their business. Coming back for sure."}
{"text":"Such a nice surprise and departure from all the chain pizza places popping up, even the \"fancier\" chains. Great to see a New York style place with a little flare in Arcadia!"}
{"text":"From the greeting when I walked in the door to the delicious pizza, I was pleased with this place. Will definitely be back!"}
{"text":"Randy the owner comes out and greets every single guest. Not only is it incredible pizza it's incredible service. A rare find and a must if you're in Phoenix!"}
{"text":"I love this place! My favorites thus are are the Al pastor and the El Blanco (topped with sriracha ). Still needing to try the carne asada pizza."}
{"text":"I've tried this place 3 times for delivery. Pizza is 20% more expensive than any of the other local options. Crust has been hard as a rock each time... And I hate to say this, but the pizza is just average.   Also a $3 \"delivery\" fee that doesn't go to the driver. Sorry My Slice of Pie; 3 strikes, you're out."}
{"text":"Good pie!  Killer lunch slice special!  Make sure to try something with the southwest sauce - sort of an italian pizza sauce/enchilada sauce blend - it works!   I tried one regular slice - with meatballs, and one southwest cheese slice. The regular sauce is really good, and the meatballs were not bad! The southwest sauce had a really interesting flavor - makes me want to go back and see how it blends with various toppings. The crust was pretty darned good, too!  The owner is a really cool guy (and a legit east coast accent :-)), and the guy working the front was friendly and helpful as well.  Make sure you check out the checkerboards that are built into the high-top 'community table' in the middle - neat idea!"}
{"text":"Amazing!!!!!! Great food and some of the best customer service I've ever received. This place is a perfect addition to our neighborhood and I cannot wait to go back."}
{"text":"Love the NY style pepperoni and jalapeño pizza!!!! I drive all the way from Chandler to eat it, so delish. The Al pastor pizza is also a must there."}
{"text":"This place was very different because they have some chef specialties. Wow it was yummy for me but my son didn't like all the extra toppings in the carne Asada pizza. But I really love it myself. I would say if u want a one of a kind pizza, you found it. The pizza crust was delightful aswell."}
{"text":"This place is the best plain and simple.  Wings are incredible.  Pizza is incredible. Sauces are incredible. Can't wait to try everything on the menu."}
{"text":"Al Pastor, What?  I think I love you!!!    \"When the moon hits your eye like a big pizza pie That's amore...\" -James Marsden  Southwest sauce, mozzarella, Asadero, Al Pastor, red onion, grilled pineapple, cilantro, cotija, fire roasted jalapeño purée.  Created with passion by Randy!  I decided to try them only because on Sundays I have very limited options on what is open after 3pm within walking distance of my work. I generally don't eat pizza very often due to the fact I was traumatized in high school yearbook & newspaper classes (haha really!!!!). So I have to be really hungry or it has to be made well.   I initially ordered wings but after perusing the menu & seeing the different southwest ingredients (spicy ohhhhhhh) & listening to Randy's passionate description of his creations; I had to try a slice of Al Pastor, What? too. I ended up wrapping up the wings for later because I must finish that slice of yumminess. It was very filling but I wanted the whole pie not just a slice.  Lol. It was that goooood!  PS:  had it delivered the 2nd time because was craving it!"}
{"text":"Fantastic! We were visiting the Phoenix area and stumbled upon this diamond via Yelp. You will be so pleased. The pizza is excellent (try Al Pastor, you won't regret it) and the staff was very kind and flexible. Thanks for an awesome night."}
{"text":"My absolute favorite pizza in Arcadia!  The Southwestern Veggie is to die for and their wings are great as well!"}
{"text":"My mom sent me your Yelp link and I was drooling looking at pictures. She ordered two pizzas, one pepperoni and one mushroom and sausage. The pizza had good flavor, but the crust is nearly impossible to bite through or even chew because it is SO chewy! She isn't a big crust eater, but I am, and even she thought the crust was difficult to eat. Of the three pieces I've eaten so far, I eat the pie and toss the crust because it just isn't worth breaking my teeth. Two fairly small pizzas for $32 and they were less than perfect - not sure we will order pizza from here again. :("}
{"text":"We tried this place tonight for the first time! Got the supreme being, the el pastor, and a sausage and mushroom. We loved the al pastor but the green sauce was a little too spicey for us. The pizzas were delivered right on time and super hot given we are a good 10 minutes away!"}
{"text":"Seriously amazing pizza.  A must try! I dont typically care for speciality pizza...but I was adventurous and tried the Al Pastor pizza. I could eat that pizza for the rest of my life! This place is doing something right! Super friendly staff too"}
{"text":"HOLY MOLY, that's a good pizza pie. Lol. But seriously, Arcadia is a hot bed for good pizza and these guys are cutting themselves a pretty good Slice of that business by being awesome. The Pizza was really good, with fresh ingredients, and it's larger than their competition at LGO and Nook for about the same price. I'd get in there now before everyone realizes how amazing this place is and you have to wait... the dining room is on the smaller side and they don't serve booze, but they are only a few doors down from The Pigs Meow and I have it on good authority from their ownership their that you can bring these delicious mouthwatering pies into their bar.     They say New York style, but the staff and ownership are way to nice to be New York, \"style\". The wait was gonna be a little long on our pie so the owner(I think he was the owner) gave us a slice of cheesecake... DAMN it was tasty, and local to boot.    I will be going back and I'm happy to say that this is defiantly one of the best pizza places in Phoenix and probably my favorite now."}
{"text":"Excellent service when you should have your pizza and be ready.. Excellent quality products these guys are quite creative try their Carna Esada it's to die for!!!  EL Pastore pizza is the one I get all the time.. they're is no one in town that has this too.. try them out for sure! So h"}
{"text":"Awesome New York style pizza! Huge and tons of cheese. Extremely nice staff and fast delivery."}
{"text":"The flavor of the sauce and the crust are great but I only got sausage and mushrooms on mine and the crust could not hold it.  The middle was one big mess, definitely needs a fork and knife for it.  I prefer pizza on 40th more, I gave it another try and I just can't agree with the reviews."}
{"text":"This pizza was phenomenal! We ordered five different kinds and each one was not disappointing! Their use of Mexican flair still has my mouth watering! My favorite was the southwest veggie out!"}
{"text":"I travel a lot, my favorite Pizza was Rays in Time Square NYC, My Slice of the Pie Pizzeria has won my business hands down. Must try, you'll be so happy you did."}
{"text":"Soooooo good. I lived in Brooklyn the past 10 years and can say this is by far the closest to a good regular NY slice I have tasted by far. I've always said you can get good fancy pizza anywhere, like a $18 single serving brick oven pizza but what New York has that nobody can seem to match is just a regular slice. All that being said what I'm really enjoying now is the awesome selection of Southwest special pizzas they have. Green chilis, corn, cilantro who'd have though but they are so very tasty. My favorite so far has been the southwest veggin out which is crazy because I'm a serious meat eater."}
{"text":"This is by far the best pizza in town. The crust is super thin and crispy. When you pull a slice is doesn't flop around. The crust tastes amazing and seriously the rest of the ingredients are just as amazing. The owner makes sure to talk to everyone and the staff is friendly too."}
{"text":"Checkers while your waiting and byob is pretty great! Love this please great genuine customer service"}
{"text":"Best pizza I have had in a long time. The southwestern sauce is to die for, you need to try this place asap!  -Jesse"}
{"text":"We ordered a supreme being pizza and it was delicious. Lots of good stuff on there and fresh crust. Homey and comfortable atmosphere. Staff was very friendly and accommodating. The owner is so nice and makes sure you are enjoying your visit."}
{"text":"Read some reviews on Yelp before heading over. In town for Spring Training and wanted good pizza. We walked in and there was only one other person there. I thought we'd made a mistake and picked an over-hyped pizza joint. The owner said he expected a slow night since it was St Patrick's Day. He took our order, we sat down and the front door didn't stop opening and closing from all his customers after us!  Slow night?  Wow! Oh boy, was he WRONG!    Now, about the pizza. OMG!  We got a slice of the Al Pastor and it was delicious!  Great combo.  We also ordered a small pepperoni, sausage and cheese. Outstanding quality and crispy crust. The cucumber ranch dressing was yummy on our salad. Since I'm a pumpkin addict, I was ecstatic to see pumpkin cheesecake available in MARCH!  Overall, great food and cool environment."}
{"text":"Wow. Probably the best pizza I have had in Phoenix in a long time. Thin crust, crispy, and just the perfect amount of sauce and cheese. I'll be back"}
{"text":"Great pie! Great art! Great owner! We were gushing over his creativity and he then suggested the dessert. With all the amazing pizza we didn't even think of getting dessert but wow we were happy we did! The cleanliness could use some work but its a pizza place and our tummies were happy so its hardly worth complaining about. I can't wait to go back. Thank you!!"}
{"text":"Recommend based on a few slices my wife and I tried. The owners and employees were very engaging and appears they truly love working there. This place should do well, looking forward to next trip to Arcadia for some additional slices"}
{"text":"the best pizza ever!! no more words need said.  Well...looks like Yelp needs more words said... we love pizza, we've lived in 4 different areas of the valley and no one compares. You will not be dissapointed!"}
{"text":"best pizza, best ceasar sald, best cheesecake and outstanding staff!!! go go go"}
{"text":"On the surface it seems like a pretty standard NY style pizza joint.  But what earns it the extra star is the customer service and the fresh infusion of southwestern flavors into the standard pizza menu.  Try a slice of the Al Pastor and you'll know what I mean."}
{"text":"Carne asada pizza was awesome...Al Pastor pizza too. Nice touch with the BYOB offer. Definitely coming back next time we're in Phoenix area"}
{"text":"Little hole in a strip mall place, but great pizza! Southwest flavors that work really well on a nice crispy crust. Really liked the southwest sauce with a hint of spice that sets off the salty cheese and toppings like cilantro and roast corn.  Southwest seasoned meats like adobo chicken, al pastor, and chorizo also worked well. Yes, I realize I used southwest four times now, but that really describes it well, like their slogan \"NY meets the southwest!\""}
{"text":"In my 37 years, of the best pizza places I ever been to. Great authentic New York pies to specialties like their Al Carbon."}
{"text":"In town from Wisconsin, based on yelp reviews we ordered 2 large for our girls weekend!  The pizza was AMAZING!  Had a margarita and c/p/m/t.  We loved them both!  The owner delivered and followed up.  Love it when owners take that much pride, and give great service."}
{"text":"Great service and even better product! I absolutely this place! Probably the best pizza I've had in Arizona! You have to go here! If you're close, you have to come, if not, it's Worth the drive!"}
{"text":"YUM! Best pizza in town! the owner is so kind and professional you can tell he really cares about his business and accommodates everyone who walks through the door. I've been hooked on there pizzas for a year now and there is no turning back!"}
{"text":"The Al Pastor pizza is amazing, and the staff is super friendly.  I love this place.  Best pizza around."}
{"text":"Came here because of good reviews and location. We were hopeful to have their new carne asada Pizza but they had sold out of it (the meat?). We tried the Al Pastor (and a small pepperoni) and both were good.   The place is cute, tucked back in a strip mall, my reason for 4 stars is the wait time. It was very very slow and others were in there who seemed to be having the same experience. Since it was our first visit I don't know if this is normal and would absolutely visit again - but do so knowing it might take a lot longer than advertised."}
{"text":"More like My Slice of Heaven! This place is awesome!   We tried a white pizza that was custom made, a traditional cheese, a traditional with a few toppings and the most delectable cheesecake ever. Owner Randy was behind the counter. He chatted us up while he made sure our order was perfect. Another gent was on site taking care of delivery orders. There's a fun table with built-in checkers boards, too, which was fun for the kids and the adults. The food came up quickly, the prices were great and the pizza was FABULOUS! With a whole side of the menu featuring Southwest-inspired pizzas, two more cheesecakes to and a bunch of delicious sounding salads and sandwiches, we'll be back many times."}
{"text":"Found my new pizza spot! I definitely cannot wait to try out their other selections of their pizzas. We live about 5 mins away and we kept seeing this place but never stopped until now. I loved the environment and found their prices to be extremely acceptable, especially because of the quality of their food."}
{"text":"I've eaten AT My Slice of the Pie Pizzeria before and found the pizza to be very tasty, the combinations to be innovative, and the service to be very friendly.  I had an impromptu card party at home so I tried ordering through the Yelp app.  The process was pretty easy and intuitive.  The order arrived right on time and the delivery person was courteous.  Pizza was very good and the Caesar salads were fresh and cold."}
{"text":"Ok the FLATBREAD!!! Holy moly seriously so unbelievably delicious. Must try ! Plus it's on special so who knows how long it will be around ;) also the fact I can make my own pizza. This guy knows what he is doing and his team is so unbelievably kind ! I cannot express how obsessed I am with this place ! Hidden MF gem .. AND THE CHEESECAKE holy mother of god... If you haven't checked this place out yet I highly suggest you get your butt to 38th and Indian school  ASAP. ask for randy. He will accommodate and make sure your experience is completely unbeatable. I love you My Slice of the Pie !!! thank you for the outstanding service ALWAYS!!!"}
{"text":"Lots of variety but simply delicious. Perfect crust texture and taste. So happy to have this addition in the neighborhood"}
{"text":"I love this pizza. Love love love.  I just moved to Phoenix and have been trying as many pizza places as I can ( I'm preggers, don't judge).  I was working in the area, used Yelp to find a place nearby. Arrived.   Really great staff- Randy is awesome!!! I tried something simple- just a slice with pepperoni. They cook the pizza with the cheese first, then add toppings, recook- this way everything is yummy and delicious. They had the proper amount of sauce, stellar cheese and overall great flavor.  I hung out for a bit and Randy brought out a meatball for me to try- so good. I can be pretty picky about this whole pizza situation, so I was surprised I was so impressed.   They also cater! I put an order on for 20 people for the following day. Randy was punctual ( huge deal for me), and the food was great. The location I delivered to was blown away that they delivered all the way to Avondale. They all loved the food.  They do some southwest style pizzas. They use a cream type habanero sauce base. Not too spicy. Awesome! They also do an El Pastor style pizza. Killer!! Try it. I ordered a large as part of the catering order- it was gone in a second. Great flavors and not gimmicky.  The salads were very good too. I cater tons and have to eat lots of sub par salads that just seem to come with the meal out of obligation. The antipasto salad was very flavorful. Each bite was yum- if I wasn't trying to sample all the varieties of pizzas that I ordered I could have easily eaten just the salad.   Can't wait to eat here again. Awesome place."}
{"text":"This was my first time here and I did half Al Pastor and half El Blanco. The pizza was soooo delicious and I cannot wait to try the others."}
{"text":"Great pizza.  South western  veggin' out  is the bomb! These guys know pizza. Fresh  ingredients and nice staff."}
{"text":"Omg. GREAT customer service. Very informative at the counter. Excellent, flavorful salad and pizzas!"}
{"text":"Dough isn't the best in terms of flavor but the toppings are amazingly awesome. Will definitely be back."}
{"text":"This was my first time ordering from them. I had the Carne Asada pizza. Given my LOVE for pizza and Mexican food, I was intrigued.   The pizza's flavors blended together seamlessly. They honored my request for thin crust as well. I definitely will be back to try the rest of the menu but it will be hard to top this choice!  I had a friend pick up my order so I cannot comment on the cleanliness or ambiance of the establishment."}
{"text":"Oh, THIS is what pizza with fresh ingredients tastes like! Went with pizza classics for the kids but will dive into the incredibly creative menu next time.  Special place."}
{"text":"Heard about this place while listening to Jon J. and Rich on the radio so I decided to check it out while visiting for a Diamondbacks baseball game. First off, the pizza at this place is awesome! Don't be discouraged by its location or size. There are plenty of options on the menu, but if you are going to try anything go with the El Pastor pizza, it is by far the best one!"}
{"text":"Wow!!! Amazing pizza and service. Randy is as genuine as they come. We can't wait to try every pizza on the menu. Cheers!"}
{"text":"Crisp, light crust with generous toppings. Unique Southwestern fusion flavors, lovingly prepared and constantly monitored by the owner. Great value. Must-try al pastor and carne asada pie by the slice. Looking forward to trying the sandwiches."}
{"text":"Great Pizza Great Price!!! There are a lot of pizza choices in Phoenix, and this place is pretty new, but give it a try.... You won't regret it! The owner was super cool, and we will definitely be back!"}
{"text":"I have N E V E R waited this long for a pizza to arrive. I ordered via Postmates and my pizza came with black olives, though I clearly requested no black olives. I waited about an hour for this pizza, which was fine, til it was incorrect.    I called the restaurant to get the pizza replaced. I was told it would be on its way in 30 minutes.  Here's the timeline:  12:40 - initial order placed.  1:30 - first pizza arrived, wrong. 2:50 - received correct order.   The pizza itself was okay at best. Lots of toppings, which is good. We ordered The Supreme Being, no black olives. It tastes like a Papa John's pizza with better quality toppings. The crust, however, is very chewy and pretty much inedible.   The price isn't bad, either.   Based on the overall experience, I highly doubt I'll be ordering from this restaurant again."}
{"text":"The pizza is SO SO good. The sauce is excellent---not too sweet or bitter, it's just perfection.  Crust is chewy but deliciously crispy on the outside. Cheese melted perfectly. We probably order takeout from here once a week---it is consistently delicious.  We order the NY Style, haven't gotten any of the specialty pies yet.  Definitely our favorite pizza in town. And owner Randy is super nice and personable---was delivering 15 pizzas for charity last time we were there. Just a great neighborhood spot and fantastic pizza."}
{"text":"We've been meaning to go here for months, so when we decided to try a place we hadn't been tonight - My Slice of The Pie was our destination.  We walked in and ordered at the counter. Our order? A Caeser Salad, The Al Pastor, and the Southwest Veggin' Pizza.  The salad came out quickly and had the good, dark green romaine lettuce that I love in a caeser. We both enjoyed the salad and it was quickly followed by the pizza.  I liked the Al Pastor a little better than the Veggin and my wife was the opposite. It was interesting getting the real al Pastor flavor on a pizza. We both enjoyed the meal, but didn't think it was fantastic. The concept of the place is cool and we will likely be back, but surprisingly, the counter service was meh. I'm always disappointed when the employees seem disinterested in a small place like this. They didn't seem to care whether people were in there or not.  Also - this place is BYOB (beer), and BYOW (wine) , AND BYOL (liquor)."}
{"text":"Honestly chose this this pizza place because of the 4-5 star reviews. Ordered \"The Supreme Being\" and I'll say it's a straight up 5'er for me. The crust and toppings had a perfect balance, good amount of cheese I may add. Next time I go I'm going to try the Schriener's Sicilian link sausage with pepperoni. Staff was friendly and on point. Definitely recommend."}
{"text":"Amazing pizza and customer service!! We love The Blanco pizza and the Rise Like a Phoenix salad!!"}
{"text":"Every time my hubby and I are hungry, we always think about the pizza that we ordered at My Slice of the Pie Pizzeria. I had it bookmarked for awhile, but recently decided to visit since it was picked ROTD a few days ago.   Luckily, it wasn't a long drive for us and the pizzeria wasn't busy. We did come around 4pm on a Sunday. The owner is really friendly and he gave us menus to review. We decided to order a 12\", half Supreme Being (mushroom, pepperoni, sausage, green bell peppers, red onion, bacon, garlic and oregano) and half Al Pastor (southwest sauce, mozzarella, asadero, al pastor, red onion, pineapple, cilantro, some other good stuff...). On busy days, the owner stated he wouldn't be able to order half specialty pizzas, but since there was only one other person other than us in the restaurant, he decided to place the order.   Honestly, I really thought a 12 inch pizza (8 slices) would be too much for the two of us and we would have leftovers. However, when we finally got our pizza, the flavor was so amazing that we kept eating slice after slice and the next thing you know, we had 2 slices left. We really could of eaten the last two, but I knew I would get hungry later since it was still early so I decided to box up the last two slices as a late snack. Prices are reasonable - around $13-16 for a 12 inch specialty. Owner also stated that they offer pizza by the slice before 5pm - cheese pizzas are $2/each and specialty pizzas, I believe are $3.95/each.   Overall, I'll be back. I KNOW i'll be back because my stomach is growling so I think I'm gonna head over right now..."}
{"text":"So good! Some of the best meatballs and slices around! I keep coming back and bringing my friends!"}
{"text":"Without doubt the best pizza in the neighborhood!  Always friendly and always the way you order it and just as import, an honest delivery time.  If they're busy they'll tell you an hour.  If not it's here in 35-40 minutes."}
{"text":"We've lived in the neighborhood for quite some time and were sad to see Slice of Sicily close shortly after Mamma Mia's in the last couple years.  We saw the menu for My Slice of the Pie and were somewhat skeptical given the non-traditional combinations and flavors, but I must say I walked away very impressed with the quality of the food and the fresh spin on something you've eaten your whole life.  We got a few specialty slices and when they were packaged up and ready to go, Randy dropped them off to explain the inspiration behind the items and the backstory behind the toppings.  It's great to see a new place in the area that is ran and operated with the passion and energy of something our generation rarely gets to experience - a locally owned pizza shop and someone who truly cares about what they are doing.  Keep it up, Randy!"}
{"text":"Peg and I checked this out a couple of nights ago and found it to be a great find! Caesar Salad was outstanding with shaved parmesan even!  Wings were meaty and delicious. Thin, chewy charred crust on the pizza adds texture and flavor to wonderfully fresh ingredients, including Schreiner's sausage. Randy could not be nicer and the overall vibe was very welcoming!  A lot of carryout but there are several tables available. Customer service is very good! Food quality was checked by Randy or others up front.  Great place for a great bite!"}
{"text":"I heard about this place on the radio. JOHNJAY from 1047 was talking about it so I had to try.  I ordered 3 pizzas and 2 dozen wings for my father's day pool party with the family. Not only was the pizza delicious (and unique!) , the customer service was even more impressive.  I had a special order and it got slightly miscommunicated but they were so quick and helpful to fix (and I actually got more than I paid for) the small flub. Ill definently be back! Try the El Pastor!"}
{"text":"This is my first time here, and I think I just found my new favorite pizzeria! Had 2 slices of the Al Pastor, and they were very good. I'll definitely be back!"}
{"text":"This place is absolutely incredible. From their custom creations to their more simple pepperoni pizza, there's no going wrong. Pizza is thin and crispy, topped with delicious fresh mozzarella and a tasty not over bearing sauce.   Their wings left a bit to be desired but next time I'll just try one of their amazing sounding sandwhiches instead. The wings weren't as crispy as I like and they were a bit skimpy with the sauce, but all the different dipping sauce options are delectable.  The location itself is spacious, situated nearly behind a Bosa donut shop, in a large strip mall. Many of the tables include a built in checkers board so the wait for dining in flies by. Their menu is written on a large chalkboard behind the bar and to the side, its definitely overwhelming with all the delicious culinary options to try from. Without a doubt some of the best pizza in town, especially in Arcadia."}
{"text":"Delicious. They are serving up some top notch New York style pies with friendly service.  The place is a bit small but has a very down to earth and chill vibe. Cool murals on the wall and several checkerboards built into a table which spans the length of the restaurant. Bring Your Own Booze policy on alcohol it seems.  I got an 18 inch \"the supreme being\" which was loaded with toppings (like a deluxe or supreme). Very tasty. The veggies tasted fresh and the meats were quality.  To go pizza nerd status, the dough had good cell structure and very little or no gel line - remarkable for a pie with so many toppings. I did take a slight issue with the topping distribution on the onions (one slice had none, and the next over had many) but a minor point.  I saw that they had many interesting options and somewhat unusual toppings available. Knowing that a basic pizza is delish I'll definitely be willing to give their more interesting creations a try.  One last note, they are a bit on the expensive side. I'd say it was worth what I paid though."}
{"text":"Awesome Awesome..Awesome place We love My Slice of the Pie!! The pizza is so tasty, the sauce and dough is perfect. the salad is great and  the wings are the kids favorite.  The kids love playing with the pizza dough. Keeps them busy before the food arrive. The kids want pizzeria all the time. The staff is very friendly. Keep up the good work Randy. We will see you soon"}
{"text":"I had always struggled to find pizza as good as in Melbourne bit this was it! Beautiful, crusty base without being too oily. We ordered the supreme being and it was excellent!"}
{"text":"This is my hands down, favorite, go-to pizza! I end up with a to-go pepperoni almost weekly!  There is so much love in the food here, and you can taste it! I've had the opportunity to meet the owner, and his passion for pizza is warming and authentic. The Al-Pastor What is pretty amazing when I want to switch it up, but you really can't go wrong here! I love to support local, and places like My Slice of The Pie are the perfect reason to do so! Happy Pizza Eating!"}
{"text":"My wife and I recently moved to Arcadia and are always looking for local spots to try to something new. My Slice of the Pie Pizzeria did not disappoint. I happened upon the menu, mostly due to google maps. This \"Pizzeria\" tucked away in a strip mall with its subtle sign shouldn't fool you. Upon initially walking in, the wall art is engaging and enough for the trip alone. But obviously the whole reason you go to a Pizzeria is, well PIZZA. The New Times 2017 best of the Valley is well deserved. Their Oh My Al Pastor is one of the most unique pizzas & delicious creations ever. For the first time, I feel like Arizona can distinguish is own style of pizza based on what these guys put forward. The two times I've been, the staff has been very chatty, friendly and provide excellent customer service. Their habanero sauce, jalapeño sauce, even their regular marinara is house made and delicious. Needless to say, I will continue frequenting this place."}
{"text":"Just down right good NY food. Great vibes. Fresh topping sauce and dough. Definitely worth stopping in and checking out"}
{"text":"This is my favorite pizza place in Phoenix, although I haven't tried them all, to be fair.  The staff is super friendly, and the roasted green chili is the star of the menu."}
{"text":"Had to try this place out heard about it on the John jay an Rich . It's a small little place that belongs on dives diner drive inn. I ordered the south west veggie pizza it's absolutely exploding with flavor delicious !!!! Crust is good too !! I will definitely be a repeat customer , blows Lou malnatis and Genos east out of the water!!"}
{"text":"I've been here several times... It's truly a unique and delicious experience.  The owner is very personable and passionate about his business.  I hope he grows and eventually opens a place on the westside also.  I'd love to get it on the weekend but they're a bit too far for me to justify the drive."}
{"text":"Darn it, indeed.  I so badly wanted to like this place.  The owner/operator so very friendly...the bar next door has the best bar name of 2016...so what happened?  My first visit was in the afternoon, just for a slice.  The crust was just odd, it didn't snap like it should have on the first bite.  It didn't chew like it should have all the way through the slice and the sauce was forgettable.  The sauce should not be forgettable.  I was certain that the slice must have been old, and really, that's the way it tasted. Old. I thought it was not a good representation of their pizza and that the next time had to be better, and a large pizza of my own creation would be the ticket.  But, same result.  The crust is not to my liking.  The more exotic pizzas they feature might be terrific, but I want what I want and it isn't this owner or that owner that will determine that for me, menu or otherwise.  Here's the deal: if I go to a function and someone has ordered that whimsical ham-&-pineapple pizza, I'll have a slice.  Why not?  It's a slice.  But I'm not ordering that as a whole pizza.  So, I'm not ordering a \"white\" pizza, or My Slice of the Pie's idea of an exotic or specialty pizza.  Now, to be fair, if you read these reviews, it might just be me.  9/10 (or more) love this place, so, again, it's probably me.  You go there, you try it.  I wish Randy well but he'll have to do it without me."}
{"text":"Traveled to Arizona for work and craved some pizza.  This pizza definitely lives up to all of the raving reviews.  I had the Al Pastor and will be quite sad that I won't be in the state to have it again for quite some time.  The owner is super friendly and a real easy person to connect with.  The delivery person David was nice to speak to as well while waiting for the food.  Not only is the pizza flavor amazing, the crust is also top notch.  I totally would recommend this to family and friends.  Thumbs up!  Keep on doing what you are doing."}
{"text":"The crust is a must! Great traditional style pizza. The service is fantastic from the person that answers the phone to the delivery guy who brings my dogs treats!"}
{"text":"Enjoyed the Supreme Being for lunch with a nice cold soda! Hit the spot on this hot day."}
{"text":"Great little local pizza place with amazing reviews.  I was pretty impressed the whole experience.  The Pie itself was also pretty solid.  I also tried a few wings and they too were pretty damn good.  I can see why this place is a local favorite. Well done!!"}
{"text":"It's been a long long long time since I've had a good single SLICE of pizza, but no longer.  They have really good slices, and it's not sitting under some heat lamp instead they half bake the crust pre-hand and then make the toppings made to order and it totally works.  Now if they would just open a store on Roosevelt Row which is a slice desert."}
{"text":"Southwest style pizza is where it's at. Staff and owner are friendly. Haven't tried anything else on the menu but that sauce is bomb"}
{"text":"Got Pizza's take out. To new to rate but our first experience was awesome. Must try. It was my second time and I must say in a very competitive pizza market they really stand out. I would highly recommend"}
{"text":"Alright Arcadia-ites....we have a new big dog on the block, and he's ready to rumble with some sweet tasting pizza pies! ;)  I've been hearing the buzz about My Slice of the Pie Pizzeria since it moved next to Pig's Meow about a month ago, and now I understand what it's all about.  When you walk in, the shop itself is unassuming (small restaurant with a giant mural on the wall and a chalkboard menu up front), however when you get to the nitty gritty of it all, it has just what you are looking for: d@mn good pizza!  We ordered the Supremo, which sounded different and amazing, and is was.  The crust was nice and crispy, and it was topped off with chorizo, chicken, green chili's, roasted corn and a southwest sauce.  Holy yum!!  It was unlike any other flavor combination I've had on a pizza, and I cannot wait to order it again for another go at it.    If you're in the neighborhood, it's definitely worth checking out My Slice of the Pie for a slice....or 2...or 3...."}
{"text":"Darn it! Was really hoping for a great pizza place but sad face here!  I did enjoy the limbo challenge on the way to their front door. Their banner hangs way low and you have to duck under it to enter. It was kind of fun, but then you are hit with a wall of writing that is all kind of run together..  ordering was a little confusing, but no big deal.  Our \"to go\" pizza came out in a timely manner, and the chef proudly displayed it to us. It looked good, couldn't wait to get it home.... Here comes the real sad face part... the first bite was a little burned tasting so I flipped it over and yuk.. the whole bottom was burned. Keep in mind we just paid 25 dollars for a pizza and the crust was inedible. We ate the top and moved on.  Probably could have went back and asked them to redo it but, but life is short and my time is worth more than that. We just will pass on this place and hope the new one they are building down the street can do better."}
{"text":"Great NY style pizza. I have been looking for traditional east coast style pizza since I have moved out here. They have nailed it, also if you want to kick it up a little try the southwest style pizza sauce."}
{"text":"This place offers a unique spin on pizza combining delicious southwestern/Mexican flavors on a pizza crust with special, subtly spicy sauce or a traditional pizza sauce if you prefer. Definitely try the Al Pastor and Carne Asada slices! While the food is great, I also love supporting small businesses. The service is stellar!"}
{"text":"The Pastor is nothing short of the most awesome culinary experience one can  imagine from a slice of pizza. The flavors are many and are unique, but this is definitely pizza. I also had a slice of traditional New York with sausage, pepperoni, mushroom and spinach... it was delicious as well. The crust on both was thin and perfect."}
{"text":"Been coming here since ever since! The Al Pastor is a family favorite, you can bring your own bottle of wine and they will even open it for you and provide you wine glasses. The owner is so personable and friendly and seems to know all of his guest and his pizza. This place really has that neighborhood pizzeria feel to it and everyone that works there make you feel like you're either  family or friends over for dinner."}
{"text":"Had the El Blanco and was my first order. Heard alot of great reviews and decoded to order. Pizza looked amazing the way I imagined it. Within 5min of taking the pizza home it was cold not warm or hot as well. I enjoyed it a lot just wish the pizza was hot or at temp*"}
{"text":"I saw these stellar reviews and  I wanted some pizza! I am just out of their delivery range 5 miles away at a hotel by the airport; Randy said no problem and is delivering me my dinner! Great customer service."}
{"text":"This place is phenomenal you walk in and greated with a huge smile! I ordered the elote flatbread wow! This is so good, I truly recommend it. I also ordered the supremo and half of supreme being it was as good as it looks! Oh my Goodness, I will be back!!"}
{"text":"Tonight was my first visit, and I'm sold! Randy provided over the top service to say the least. Best new spot in the neighborhood in my opinion. Food was on point, too. I had the meatball sandwich, which tasted great and was served on a delicious fresh roll. My girlfriend had the Southwest Veggin Out pizza and loved it (she's a pizza snob).   As if a convenient location, outstanding service and fantastic food wasn't enough to be pleased with...this is on their wall. Double sold. Thank you, Randy and crew!  * \"this\" is the picture posted, which i now realize probably doesn't post along with this review. Enjoy!"}
{"text":"great pizza & amazing guest service! wide variety of pizza sauces, toppings & styles. Also salads, sandwiches, wings & desserts.   beers on tap and a happy hour."}
{"text":"This pizza is the best pizza in town! I could eat it everyday if I wanted to.  My baby cousins devoured it!!! Thanks Randy for the awesome food and service."}
{"text":"Absolutely fantastic pizza. Tastes just like my favorite places on the east coast that I've been to. They also have awesome southwestern and other variations that you must definitely try. So happy to see a place like this open in Arcadia!"}
{"text":"For a traditional or southwestern twist on a NY style slice, my experience here was awesome. Had a really spicy slice with jalapeños, crema and habanero pepper. My little 7 year old buddy had a cheese slice with tomato sauce. Hot, fresh, reasonable prices and friendly. Mine was awesome.Cant wait to try a whole fresh pie! I'll be a regular.  Tried the Southwest Veggie pie. Wanted my half super spicy. These guys know how to make a non-traditional SW pizza! Will definitely be back."}
{"text":"So So so good!!!  WOW. So happy I finally tried this amazing place. And it's so close to us. My NEW pizza spot"}
{"text":"So many amazing specialty pizzas to fall in love with. Their traditional NY style is my favorite. Best pizza in the neighborhood hands down."}
{"text":"I'm from New York and this pizza is the closest I've had to NY pizza in Phoenix! Love this place! You will not be disappointed"}
{"text":"Great pizza place.  Only tried it once yesterday, but the pizza was great.  They remembered the ranch, extra pizza sauce on side and peppers we asked for.     UPDATE:  reason for sogginess was because Uber Eats doesn't have pizza bags.  Updated to 5 stars because the pizza was amazing! Only suggestion is to use a thicker corrugated cardboard for the pizza to sit on when packed in a to go box.   The bottom of our pizza was really soggy in a few areas.   It really makes a huge difference when a pizza joint invests in a quality method to ensure the bottom of the pizza isn't mush when it's delivered.  Fix this and this place just earned its 5th Star in my yelp book.     We got the supreme and it was awesome.  Half of it was just cheese and we weren't a fan of that.   But that's a personal preference.   They used a lot of seasoning and some stinky cheese mixed in w/ the Mozzarella.   It's for our Son who likes plain stuff right now, so he wasn't a fan.    Again, more of a personal preference and am sure they'll make how we like next time if we just ask.    Used Uber Eats so didn't have a good line of communication with staff.   Next time we'll go there and try something different and ask for our really plain cheese pizza.   Manager did call me though, left a voicemail, and checked to make sure everything was perfect because they're apparently new to Uber Eats.  That was nice.  All was great so didn't call him back.    I have nothing but good things to say.   We've tried SO MANY local pizza places and are constantly disappointed.   So this place is a breath of fresh air.   Highly suggest giving it a shot."}
{"text":"The al pastor pizza was amazing!!!!! The hot wings with the cucumber sauce were great too. I can't believe we have never tried this place before. We will definitely be back!"}
{"text":"Super friendly staff!  Ordered two salads--against pasta and rise like the Phoenix--along with a 12\" pizza-the supremo. The salads were a larger size especially for the price!  Everything was super fresh and flavorful. The salads and pizza how'd tons of ingredients with a balanced taste!  The dough was perfect in that it was crunchy and moist!  Definitely my new favorite shop!!"}
{"text":"This place is the absolute best. I've had pies all around the country, Maine to New York City to California, all kinds of styles, this is among the greatest of the greats.   The presentation of the pizza is New York style, but elevated way above your average hole-in-the-wall food. When you fold it, grease doesn't flood out the back, and that's how you tell that what you taste is real and unadulterated.   The cheese is perfect, gooey and stringey with that signature mozzarella chewiness. The sauce is perfectly spiced and thick, and there's just a hint of oregano on top of the whole thing. That little extra step ties things together, and the toppings come in for the knockout. The toppings are fresh, well-prepared, and full of flavor.   Basically, this pizzeria rocked my socks off. They don't need any crazy gimmicks or experimental ingredients because they're just that damn good.  The people running it deserve every bit of good business that comes their way, and generally seem like cool, down-to earth guys that care about their product."}
{"text":"This new, cute little place can be easy to miss as it is tucked in the corner of a small strip mall on Indian School road.  The staff were very friendly and patient while we decided what to order.  Since they don't serve beer, they informed us that we could go to the pub next door and bring it in while waiting or eating.  We took them up on it.  We ordered a 12\" pizza with bell peppers and sausage on one half and just cheese on the other half.  Also added was extra cheese to the whole thing.  The pie came out piping hot as we just finished our game of table top checkers.  The toppings were very good but the crust is a little too tough to chew for my tastes.  Not sure if that's the style or not.    That said we would try them again maybe ordering a larger pie to see if that bit of dough can be stretched just a little farther.  Give them a try!"}
{"text":"They do have slices in evenings now. I got a mushroom slice and a pepperoni slice. 2 slices filled me up. Good crust  and great sauce. Friendly cashier, and the cook came out to ask if everything was ok. He did that to all tables not just me. Maybe the owner?"}
{"text":"The staff is incredibly nice, and always chats with the customers. Fun atmosphere the cheesecake was delish, salad hit the spot all around great spot. I'll def be back."}
{"text":"In town and looking for some pizza, the reviews looked good and it was convenient.  Don't let the looks of this place deceive you....it was some of the best pizza I've had in a while.  Was definitely not disappointed.  There were great choices and the staff was very friendly.     Will be back the next time I am in town!"}
{"text":"Man, I really wanted to like this place.  I'm always weary of these \"NY style\" pizza joints because 99% of the time they're not NY style at all.  Clue number one that I would be disappointed - the cheese didn't stretch. Plus the sauce had no flavor. OK fine, won't be NY style but it will still be edible right?  Well as several other reviewers have mentioned, you have to put in work to eat the crust! So hard to chew after one slice that my jaw hurts.I was hungry but I had to throw in the towel after that first slice."}
{"text":"Tried this place out after hearing about it from another friend in the neighborhood - and really glad I did.  Pizza was fantastic and there's enough variety in the menu to keep us trying out new combinations for many trips to come.  (I do highly recommend getting  the jalapeño spread on your pizza)  My only issue, seems to be one that was mentioned by few other reviewers.  The wings are coming out just a bit dry.  On one hand, it's nice that they have a crunch to them - hell, some places utilize potato starch with the whole goal of obtaining / maintaining that level of crunch once sauced.  But in my opinion, the whole issue could be fixed by thickening up their buffalo sauce.  Start with a light roux base before adding in the cayenne pepper and then supplement the burn by adding additional peppers (or pepper sauce) - because let's be honest - roux will reduce it a bit.    By thickening the sauce, it'll stick to the wings better and allow them to come out with a better texture.  That said, love this place.  Will be back. Will bring friends."}
{"text":"This is fantastic pizza. Crust, toppings, proportions, all perfect to a T. Even if they didn't have the amazing carne asada, al pastor and chorizo pizzas, it would be a worthy choice. It's almost unfortunate those are so good... I don't think I'll ever have a chance to try everything else they make.   For a bonus, have them deliver the slices next door to Whining Pig for pizza and beer (or take advantage of what they have on tap right there).   Phoenix has a pretty great upscale/brick oven pizza scene (yeah yeah Bianco is great) but a serious dearth of good slices on the quick. Having lived in Tucson and Flagstaff, I have been looking for my Nimarcos, Brooklyn, Empire pizza substitute here in Phoenix. And now look no further. Now I just wish we had one in South Scottsdale!"}
{"text":"Okay, so I\"m craving an Italian sandwich.  You know.  The kind with ham, salami, capocollo, mortadella, pepperoni, and/or other meats and cheeses?  It is about my favorite sub.  It's also hard to find one in this neighborhood.  Enter My Slice.  Well, I've had their pizza and I was not really impressed, but maybe they do sandwiches better?  Sadly, I don't think so.  So anyway, the Italian sandwich came on a bolilllo roll.  Ham, salami and pepperoni with red onion, roasted red pepper, pepperoncini and provolone cheese.  It was okay, but nothing to write home about.  On a bright note, it was accompanied with a quite large salad of fresh greens, crouton and shaved Parmesan.  Finally, huge banner over the front and painted on the window, #1 Pizzaria on Yelp!.  I'm thinking you can do a search for a pizzaria and find ten with higher ratings and many more reviews.  PIzzaria Bianco comes to mind, a place that has won several awards including a James Beard, a 29 Zagat rating and has been proclaimed the number one pizza in America.  1773 reviews with an average 4 stars, is not something to spit on.  Note:  the owner wrote me and claims that if you put \"pizza\" in the search, his restaurant comes up first. Yes, but do search results determine popularity, or is it number of reviews/stars?  Regardless, while it may be true, I think it is a bit disingenuous and misleading, but that is his call.  Subtract 1 star."}
{"text":"This is a brand new hip neighborhood pizza place that opened up in the the little corner spot tucked behind Bosa Donuts that previously housed an Italian pizza place that had been around forever, but in decline for awhile. This space has been thoroughly scrubbed and jazzed up with new paint and furniture and a cool wall mural.   I don't think they've even had a soft opening yet, but they were serving food and nice as can be. This is a family owned place, and it's definitely designed to cater to the Arcadia area. The owner clearly has had previous restaurant experience.   The menu has the sort of standard fare you would expect from a pizza restaurant, but they have managed to stick in a lot of interesting twists for each category. So you can eat traditional or find something new. There's a lot of creativity behind the menu, and many of the clever dishes sound delicious.   I only had time for a slice, and since I'm boring, I had a traditional pepperoni and sausage. It came out quickly, but also piping hot and fresh - it certainly didn't taste like a slice that had been sitting around. The crust was airy and light. It was also flavorful and crispy. The sauce was very distinct and flavorful as well. Toppings were top quality - right down to the gooey stringy cheese.   I'll certainly be back. I'm told they will be offering delivery eventually."}
{"text":"This is a great addition to the neighborhood and they did a great reno to the place.  Top notch service, fun atmosphere  and the chow is good."}
{"text":"After hanging out at the Pig's Meow, and sampling some of the pizza, we decided to try out this new place for dinner. The owner was very friendly and even brought out samples of the pizza sauce. We ordered, and the owner delivered our order to the Pig's Meow while we had a glass of wine. We ordered the Veggie pizza, and the Italian deli sandwich. Both were surprisingly delicious, fresh, and has nice flavors. We will definitely be back!!!!"}
{"text":"My Slice Of The Pie Pizzeria and the owner, Randy are amazing!  He personally delivered my order of pizzas, Italian sandwiches and salad for my son's birthday party.  The Supreme Being pizza (ton of toppings) is our personal favorite and our guests agreed that it was awesome.  The large Casa salad was gigantic and filled with veggies.  And the Italian sandwiches were tasty and full of flavor.  I highly recommend getting your next party catered by My Slice Of The Pie!"}
{"text":"Great pizza spot!  My four young children and I visited this establishment around 5pm on a Thursday evening.  We ordered a large cheese pizza and a small gluten-free vegetable pizza along with the anti pasta salad and a bowl of meatballs....all were exceptional.  The food was great but the service was spot-on!  The owner even brought out our meal and continued to cut the kids food up in \"kid bites\" to help it cool.  He was very attentive and kind.  We will go back!"}
{"text":"So there I was, off to find a pizza replacement for the old Frank's. Didn't think it would be possible. But boom! There it was. Better than than the last. Yep, I can't say my house is terribly hard to please with pizza but I am. My Slice of Pie Pizzeria made snapped me out of my loss over Franks pizza real quick. This pizza has a perfect crust and they are so nice. Thanks for coming to Arcadia!"}
{"text":"Great food with really original pizza choices. But all the classics too and it's all great!"}
{"text":"As a Pizza lover from New Jersey who has been searching for pizza \"like home\" I with out a doubt will ONLY be getting my Friday pizza night, Pizza from here! By far he best pizza in the the valley.   Randy the owner is super friendly and has come out to see how everything was both times I have dined in. They totally deliver too in case you want to stay in or order lunch!   I recommend everyone check it out and tell everyone you know! You won't regret it."}
{"text":"Came by around 6:30pm for a slice.  Server was great and explained a lot of the menu options they have.  Wasn't busy at all but I'm thinking they may do a decent amount of delivers for their full size pizzas.  When the slice came out it looked fantastic.   Now for the taste test - crust was very good, a little heavy on the sauce, lots of pepperoni, could have used a little more cheese.  Will certainly return if I'm in the area!"}
{"text":"Okay, I'm updating because tonight on my second journey here I was lucky enough to meet the owner Randy. You can totally tell he cares about customer service. I was able to try something he was testing, Carne Asada Pizza, OMG it was the most amazing thing I've ever had. I'm not kidding. So flavorful and honestly better on a pie then a taco. If you haven't tried this place, I suggest you get there fast!!!"}
{"text":"AHHHHmazing pizza! Just ordered today for a company meeting and the pizza was phenomenal. We're new to the neighborhood and they threw in extra cheesecake for us to try, along with cheesy bread and a carne asada pizza. Such a welcoming gesture! Overall can't speak more highly of the pizza at My Slice of the Pie Pizzeria."}
{"text":"After hearing about this local mom and pop pizza place from Johnjay, I knew I had to try it.   Their menu is a little hard to read and sometimes you don't know where it begins or where it ends and can be overwhelming if you don't know what you want, but don't let that stop you from visiting!   I tried the Al Pastor pizza and it tastes sort of like a taco on a pizza dough. It was pretty damn good. They sells slices of each pizza so if you didn't want to bring home an entire box you have that as an option.   They have so many creative flavors that I'll have to come back and try. I do wish there pizza was a little thicker and that their crust was a bit softer. The crust was a bit hard to bite into."}
{"text":"Really good pizza. They were busy and seemed a bit understaffed but those that were working were busting their butts off to get through all the customers. Will go back."}
{"text":"I have been telling everyone I know about this place. The pizza is amazing! My favorite is the Al Pastor What?! - try it for yourself! The staff is incredibly friendly which is a huge plus too.   Do yourself a favor, order a pizza from here and have it delivered to the bar next door:)"}
{"text":"I have been loving this place since the day they opened. All of their specialty pizzas are excellent and tend to be my go to. I love their southwestern flair. The crema on the the Supremo is always a  winner. The other day I was just wanting some pepperoni and got the Supreme Being. OMG, I was in heaven. I can't recommend them strongly enough."}
{"text":"Sandwiches are the best come with a salad and well worth the price. Pizzas are awesome and original. Randy is knowledgeable and informative on all menu items."}
{"text":"First time trying this place ordered a large specialty pizza. It was overcooked it would have been really good.  And I believe that the managers or even the cook should have noticed that it was burned. They all seem like very nice people and maybe if you dine in you can have the input on if your pizza was overcooked. Unfortunately because of this experience I can't return in good faith spending money on something that was not worth the price. I hope the manager reads this review and takes this into consideration even looking at pizzas that are being boxed on outgoing orders and making sure they aren't burned."}
{"text":"Was looking for some food last night on Yelp and was shocked to see a nearby pizza place with 5 stars. Decided to order a large pizza and a meatball sandwich. The large pizza is bigger than you'd expect, which is great since you'll have leftovers. It's also a damn good and managed to still be good even after being re-heated in the microwave the next day, which is rare for any pizza. The meatball sandwich was decent but didn't really blow my shorts up. Honestly, the pizza was good enough that I don't care and will definitely be back. Check this place out if you want an excellent pizza without spending a fortune."}
{"text":"This place was absolutely fantastic. My family and I loved coming in and tried two different pizzas, the original cheese and the carne asada. Randy and his staff knocked it out of the park on both. The cheese slices is perfect. If you're looking for new York style then come to this place, honestly the best new York style that I've had not only in Phoenix, but honestly anywhere on the west coast. I absolutely love this place and will be back again really soon. It's also a great value, a cheese pie starts at $15 for an 18 inch pie. You can't beat it!"}
{"text":"Just had a pie from here for the first time. Went simple with a large pepperoni and it was excellent. I'll definitely be ordering again!"}
{"text":"My husband and I live in Arcadia.  It's no secret that we are spoiled with an amazing choice of great restaurants.  The pizza competition in this neighborhood is tight and I think we have a clear winner.  This is our family's #1 pick for pizza.  The food is amazing and beyond that the owner and his staff take customer service to the next level.  I have come all hours of the day- afternoon, evening, dined in, carried out.  Our 4 year old loves coming here because Randy will offer her dough to play with and then bake it for her.  We are pizza \"purists\" and have always gone for the NY style, but I recently decided to try the carne asada and ohhh...emmmm...geeee... it's a party in your mouth.  Do yourself a solid and the next time you are in the hood, stop in and ask for the carne asada."}
{"text":"Best service/pizza in town. I called Eli at the Pizzeria and he placed my order for a large pizza, salad and wings. The order was ready within 25 minutes. Cutest Pizza place ever and the nicest most genuine people work here. I thoroughly enjoyed my first experience here just picking up my food. Eli even through in a large slice of the most delicious cheese cake with my order, complimentary. I will definitely be coming back here. Thank you again for the great food and service!"}
{"text":"Can't get enough of this place! Very friendly staff and AMAZING pizza! Al Pastor pizza is our favorite"}
{"text":"Sometimes a girl just wants a slice of pizza. This joint gives that and SO much more. I tried their original slice with my favorite toppings, pepperoni & black olives. I've tried this flavor combo in pizza joints all over the place so I can fairly compare to say that they have their pizza down! I also tried the southwest slice with chorizo and queso fresco. I think I died a lil when I took my first bite because the explosion of flavor took my breath away. I'm really looking forward to trying all the amazing slices offered. A lil birdie told me they're working on some new flavors to come too so I'll definitely be coming back for more!!!"}
{"text":"We've ordered from here twice and both times the pizza was really good. We ordered the el blanco and it was good but maybe next time we'll add a type of meat. When we picked up our order the owner gave us a sample of a new pizza he'll be adding to the menu, it's was amazing. Second time we ordered the al pastor it was tasty but they forgot the jalapeño purée. Will definitely be back."}
{"text":"2.5 stars.  I had this place bookmarked for awhile, and was in the mood for some pizza.  I was in the area so I decided to place an order for pickup.  I went with a 12 inch El Blanco, cooked well done.  The guy on the phone told me about 20 minutes.  I drove down there and arrived within 15 minutes.  Real cool dudes that run the spot.  Very friendly, courteous, laid back and cheery.  I paid for my pizza and they offered me a cup of water while I waited.  My pizza was ready about 10 minutes later.  I took it to go and here is how it was................  El Blanco-  This pizza sounded delicious!  It was a white pizza with a \"roasted jalapeno garlic olive oil\" base, and then topped with a four cheese blend, tomatoes, fire roasted artichokes, roasted red peppers, ricotta, garlic, basil and cotija cheese.    I pulled over on a side street and found some shade and decided to dig in.  First bite in, I really liked the toppings.  The artichokes, tomatoes, cheese etc tasted great.  Not really sure with the jalapeno olive oil base though.  Never had one hint of jalapeno flavor and no real \"heat\".  After I got past the delicious toppings, I was unimpressed with their crust.  I did order my pie \"well done\", and the bottom of the pie was pretty brown (not burnt, but much more well done on the bottom crust than on the top of the pizza with the toppings), but it had a super weird chew to it.  It was almost like they used too much flour in the dough and it had no \"spring back\".  It also had absolutely no flavor!  Almost tasted like it was stale.  I made it all the way to the crust, and that too was very weak.  It had some nice char on it, but once again, no flavor.  My favorite part of the pizza is the crust, and honestly, this was some of the worst crust I have ever had on a pizza.   I ate 5 slices (minus the crust...and I NEVER leave the crust), and wound up giving the other 3 slices to a homeless fellow by the 17 freeway.    Overall, I am glad I stopped by to check it off my list of new (to me) Phoenix pizzerias I hadn't tried yet.  The toppings and the friendliness of the staff were the positives.  The dough and crust were brutal though, and unless this was a \"one off\", I don't see myself coming back.  Meh!"}
{"text":"Didn't know what to expect but it is a very low key-cozy spot to eat at or to pick up and take it back home. I had a pep/shroom/sausage side of pizza, after biting it I immediately wanted to order 2 more slices but they were out of slices as I went there kind of late. But I will be back for those slices!  Great tasty pizza and good wings!  Highly recommend this spot. 5 star"}
{"text":"I ate here a few months ago and had the Al Pastor What? Pizza which was amazing. I took my family here tonight and had the Blanco and the \"off the menu\" Carne Asada which was even better than the Al Pastor.  If you are looking for pizzas that are just the run of the mill, this is not your place. Southwest meets New York is a great description. Randy, the owner, makes sure to meet everyone that walks through the door and that personal touch makes the experience even better. Hidden gem."}
{"text":"Just discovered this great little place less than a mile away from my house. Very friendly staff and the pizza is fantastic, especially if you're a fan of New York style. Definitely recommend."}
{"text":"My wife and I have eaten here twice and both times we've been very impressed. First time was by the slice and the second time was a full pizza. Crust is perfect and toppings are fresh and flavorful. They catered to our special request because it wasn't very busy. Price is good as well. It is obvious Randy and his staff are passionate about the product that they put out. Best pizza we've found in Phoenix."}
{"text":"Good in the beginning,  now just okay cheese is weird and chunky ish and the sw sauce is good but no longer easy here for to inconsistency in quality."}
{"text":"I'll flesh this review in more as I have more experience with the pizzeria but it's promising so far.  Fair prices, Coke products, nice decor and a very inventive Southwestern fusion menu.  I ordered my pizza well done. When I order a pizza well done, I expect a well-toasted cornicione and a stiff bottom that shouldn't flop under the weight of the toppings. Clearly, the pizza man has some ability because my pie checked both boxes and had a nice balance of a tart, savory sauce and mozzarella.  I will go back, which is the best review I can give."}
{"text":"Great NY style pizza with a flair!!! If you live in the neighborhood it is a must try. Start with a simple pepperoni and then work your way through all of the varieties."}
{"text":"Went here today for lunch and had a great experience! We tried out the Rise of the Phoenix salad, as well as the Al Pastor and El Blanco pizzas. If you've ever had the al pastor at America's Taco Shop (which I love), it's the same stuff! Everything we got was super fresh and delicious. We loved the Mexican flavors combined with the crispy-yet-chewy crust.   The staff was really helpful and the service was good. The interior was clean and had a great local feel to it. We'll definitely be back!"}
{"text":"This place is awesome!! Super kid friendly, games and a fun staff. Very accommodating and engaged service. The owner seems like a great guy, he brought out dough for the kids to play with and then baked it for them. We got the southwest veggie pizza, lots of flavor and very delicious! We'll be back with our friends soon!"}
{"text":"I just went to My Slice of the Pie the other day for the first time. They have salads and sandwiches in addition to entire pizzas, but my dining partner and I both opted for slices. I got a slice of the Al Pastor and a slice of pepperoni. My partner got a slice sweet potato and chorizo and also a slice of pepperoni. Everything was tasty! The gentleman who took our order even gave us happy hour pricing on our drinks because it was our first time dining there. We dined in, but we did see lots of folks come in a pick up pies to go. I will definitely be coming back!"}
{"text":"\"We serve a lot of New Yorkers. They agree we serve a New York slice.\"  I chuckled and placed my delivery order. Five slices later - shhhh it was delish - I have to agree. (Even the two slices I warmed up were yummy.)  Thank you Yelp for pointing me to My Slice of the Pie Pizzeria. They've got some seriously good stuff happening over there. Their delivery guy was a hoot. Total chill, \"Hey man. Can I have my pen back?\" Yeah of course. \"I might...\" (I look at him.)   \"Need it.\"  We all need a slice from this place in our lives. Big thumbs up!"}
{"text":"We tried the supremo and im hooked.  Also, B.Y.O.B which I thought was cool.  The food was awesome and the service made for a great experience.  Thanks for a wonderful dinner! We will definitely be back"}
{"text":"Maybe I had low expectations.... The decor of this restaurant doesn't scream delicious pizza, after all, and the restaurant used to be a more traditional pizza place (that was awesome), but I really wanted to try this restaurant due to the positive reviews. I was shocked at how good it was! First of all, they sell slices at night... brilliant! Second, they have some interesting pizza options that are too weird to pass up. I had to get a slice of Al pastor pizza and a slice of carne asada pizza....ya, you read that right. The slices are reasonable (about 3$), especially because they are quite large. There was some confusion when I got my slices because we waited a looooong time for them, but I think this is not typical for this joint. Anyway, the pizza was incredible. The Al pastor was good (you know...pork...pineapple...can't go wrong there), but the carne asada was amazing. The jalapeno sauce was just right complimenting the tasty meat. You have to try this.... I know I'll be back!    PS 1800!"}
{"text":"one of my favorite pizzas ever. incredibly fresh, delicious and spicy.  Lots of choices for toppings and i ended up picking an unlikely combination of pepperoni, cilantro, red onion and basil and it just knocked me out.  We'll be eating there again soon."}
{"text":"Great taste and great pizza! Man this place had really good sauce options for wings as well as pizzas. The manager was great and let us try out all their options. Overall, this was a great experience. It's also a very cozy restaurant, a place I really enjoyed being at. Great ambiance, great aesthetic, amazing pizza!"}
{"text":"The place is offering is either traditional or with a twist using some sonoran southwestern influence which surprisingly works incredibly well. The owner is high energy and passionate about what he is doing and the difference in the pizza shows. The place small but cute and clean. There is some real effort in the food being some of the best toppings and combinations I have ever had. I love that they are in my neighborhood and I am in love and may never be able to eat other pizza. Well earned accolades for the food in this place!"}
{"text":"Tried the cane asada and al pastor pizza!  It was awesome!  Also tried a traditional pepperoni, and was awesome as well!  Try this place!"}
{"text":"Here's the thing.. I don't even know what just happened. My taste buds are still in shock.. a little back story.. I just got back from Italy earlier in the year, and the pizza at My Slice of the Pie Pizzeria, just gave all of Italy a run for it's money. The only thing I'm mad at, is that I didn't order more. I'm almost in tears it was so damn delicious..  I was in the mood for pizza tonight, and believe it or not, I was about to order dominoes.. (yuck) instead, I clicked on the yelp app and clicked on the \"pizza takeout\" button.. My Slice Pizzeria was the first thing that popped up, they had great reviews, so I decided to order through yelp.. super easy.. I just clicked on the $2 New York slice option, then added fresh garlic, pepperoni, and mushrooms on one slice, and another slice with artichokes, garlic, and pepperoni. (Many other options/sauces/specialty sauces) it came out to only around $7. the order was ready way before the estimated time of 40 mins. When I picked it up, the guys were so friendly and welcoming, I felt like I was an old friend! When I said I had never been there before, one of the guys grabbed a plate and let me sample all 6 or 7 of their in-house-made sauces (all of which were their own style of scrumptious) without me even asking!.. I will recommend this establishment to literally everyone I know, and I am a pizza lover who will be back for more! TEN STAR experience!! Keep up the good work guys!"}
{"text":"My FAVORITE pizza place in all of Phoenix! We usually order it when we are having a few drinks next door at The Pigs Meow and they even deliver it to your table!  Don't stray, you won't be disappointed"}
{"text":"I grew up eating pizza in NYC, so I'm biased and prefer the unique taste and crispyness of their dough.  \"My Slice\" is  closest pizza I've found with a combination of fresh ingredients and crispy crust. . . There's only one other pizzeria in downtown Phoenix that I'll go to... won't mention the name on this post but New Yorkers know which one I'm referring to.    But I also love the southwest pizzas My Slice has perfected.   The owner is a true foodie who knows his craft, enjoys what he does, and I can taste the love!"}
{"text":"My boyfriend and I are from back east and this is by far the best pizza that delivers to us. The people there are super nice and it's delicious. We always get the roasted garlic but our delivery driver tonight gave us recommendations for other options that we didn't know about. Love this place!  To the business: delivered to us at shadys. Nice guy! Keep him around."}
{"text":"After reading all the five-star reviews on Yelp, I decided to give My Slice of the Pie Pizzeria a try. I used to like the restaurant that was located there before, Slices of Sicily, so I was hoping the pizza would be similar or better. The restaurant had been remodeled and looked nice inside, so I initially had some hope the dining experience might be better too.  Unfortunately, My Slice of the Pie Pizzeria turned out to be a disappointment. Things did not get off to a good start when I found out they do not offer slices for dinner. This seems strange given that the word slice is in the name of the restaurant.   I could accept the lack of a slice option if the pizza had been good, but the pizza I ordered with regular sauce lacked taste and was salty. My friend got two varieties of the wings and did not care much for either. The salad I ordered was OK. Given the prices and the lack of taste of the food, I will not be returning, especially with Pizza on 40th up the street as a better alternative."}
{"text":"YUM! YUM! YUM!   This pizza is so good!  Love that you can get a fresh made single slice.  Hard to say what makes it so good...is it the crust?  Perfectly thin and light not doughy or dense.  Or is it the sauce?  There is definitely some sort of addictive secret ingredient in here!  Huge selection of both standard and unique toppings. All fresh and fabulous.  Your imagination is the only limit.  Eat it there, it's cozy and laid back or have it delivered if you are in a 3 mile radius of E Indian School and 36th Street.  The owner is also super passionate about his business and customer service.  You won't be disappointed!"}
{"text":"Kids said they will come here vs PPP!! That's saying a lot! Pizza is delish here plus friendly staff :)"}
{"text":"The wings here were good, but I came here for the pizza. It wasn't my favorite pizza. We ordered three different pizzas and none of them were impressive to me. I didn't even get to enjoy the crust."}
{"text":"Been in Phoenix since last year and have been trying different pizza places and this is the best I've found so far. Went for home delivery and it can piping hot. Got an Al Pastor and a regular pepperoni. Al Pastor is a vegi with some unique ingredients. It tastes great and has some spice to it...great. The pepperoni was excellent. The best thing is the crust, thin but at the end it is very chewy and tasty. Definitely will go again"}
{"text":"This is a really cool place. I was in love with the tattoo artist's mural on the wall. It is a pizza place with a SW flare added in. We had the Blanco pizza and two salads which were all delish. I am not the biggest fan of white pizza because I love Ny style  but I have to admit our pizza was very good. I will go back to try their speciality Al Pastor and a regular NY slice. I usually also do not like ranch dressing very much but their SW style ranch dressing is oh so yummy!  Oh yeah, and the thing that we really raved over was their Raspberry, Jalapeno Chipotle Cheesecake. Oh gosh! So good!   The service is amazing. The owner will wait on you and he is a delight!"}
{"text":"I got delivery today for my team at work to recognize them. I spoke with Randy the owner and he was just a pleasure to deal with. As far as the pizza is concerned , it was very good. I'm from Brooklyn and I have very high expectations for pizza. That being said I was pleasantly surprised at how good this pizza was. He mentioned that he uses a French technique on the dough and I liked the texture. This is one of those situations in which different is good. The biggest problem that I have with pizza outside of New York is the sauce. Well that's not a problem with this pizza because the sauce is well seasoned and delicious. On the first bite I was happy end of story"}
{"text":"This was the perfect spot for our Figure Skating Club Pizza Party. It's just a few minutes drive from the Arcadia Ice Rink. I called ahead to place our pizza order and they had the pizzas ready within 25 minutes.   The tables were easy to push together to create a spot for our group of eight. Since it was a Thurs night at 8 pm there were lots of open tables and we could have seated about 25 people if needed.   The giant mural on the back wall makes for a fun atmosphere. They also have a TV showing sports events, but it didn't hinder conversation.  The pizzas were outstanding. We had \"The Veg\" in the 18\" size and for the kids we did half-and-half cheese and pepperoni in the 18\" size. The kids also enjoyed the gourmet cheesecake selections.  They make their ingredients fresh on site and the owner was a high-end restaurant chef and takes orders and interacts with customers making it a great experience!"}
