{"text":"This used to be called The Sandwich Box and used to be excellent. Management has changed. I paid $10.45 inc. tax for a chicken salad sandwich that tasted lousy, the bread was far too thick and filling was skimpy and worst of all, the accompanying \"salad\" was a bunch of wilted, mostly rotting greens.  Same greens were used as \"lettuce\" inside the sandwich.  I phoned to tell them because my office was too far away to return same day (Friday) at lunch time. Was invited to return, which I did on Monday and they refused a refund. So what was the point?  I agree with Henry D's review. Steer clear."}
{"text":"First off, this place reminds me a lot of Sandwich Box just down the street.  Someone correct me if I'm wrong, but they might have the same owner as they had mentioned there was another location in the city.
This place was tucked into a plaza-ish sort of building with different units.  A friend and I were visiting one of my favourite donut places, bakeryhaus, which is also in the same building and noticed this place next to it.  We were hungry so we decided to just go for it :)  Don't be turned away by the appeal, which is clean and simple.   
I have been there twice and pleased immensely with the food and service.  They have daily specials that they change up, which are probably helpful if you're unsure of what you'd like or if you're feeling overwhelmed.
The build of the sandwich is:  protein + 2 toppings + spread.  The first time I went there I got rosemary focaccia bread with roast beef, provolone cheese, portobello mushrooms and basil pesto spread.  The man put a light coat of olive oil and put it on the press.  Be warned, if you don't like your bread crispy ask him to put it on for less the amount of time.  
My sandwich tasted amazing and it's one of the best sandwich places I've tried.  Really liked that they used fresh ingredients and I could really taste the meat.   And just because I love deals, for $2.5 I added a broccoli puree soup. Definitely a fan of their soups, which are almost all purees.  Also, you get a small side of salad included with a sandwich purchase.
Usually, it's a quick grab and go kind of spot.  Managed to talk to the owners the second time around and they are very sweet people.
I'll definitely be coming back here when I am in the area.  I would say it's priced relatively the same as other specialty sandwich shops, but you get good bang for your buck.  You're paying for fresh ingredients and a good quantity of food - Sandwich, salad, and soup for $13."}
{"text":"This place is right across the street from my work so I've picked up food from here a few times. They do salads and sandwiches and I love the little setup there's tons to pick from for both. I wasn't obsessed with the salad I got there once but I think that was my bad because I added green apple slices and kind of regretted it. The sandwich I got there was life changing. You get to pick your bread, meat, sauce and 2 toppings (either 2 veggie or a cheese and a veggie) and of course you can pay to add more. First of all their breads are all from ace bakery which is the best!! I got olive bread but the rest looked delicious too, tons of options for meat, sauce and veggies. All together I got the black olive bread, avocado chipotle mayo, turkey, carmalized onions and sauteed mushrooms.

 All I can say is that if this combination sounds good to you GET IT!!!!! It was the best sandwich I've ever had, like one of those food so much that you eat slowly so it doesn't end, yup that was this sandwich. 

So yes if you're ever in the mood for a great (slightly overpriced) sandwich...i think mine costed like 10 or 12 all together, be sure to check out My Sandwich! Just be warned that there's nowhere to really sit inside that building so it's better for take out unless you're cool with those standing up tables I think they have a few of those, but there's a nice park nearby if you walk a bit north on John!"}
