{"text":"Have an  elitist  craving ?  Wish to drain that wallet of your cash ?   Don't come to this place hungry....or thirsty...
yes, the ambiance has the eye candy looks ...all manner of delicacies displayed  and cooked for you ...ala time-share.

You arrive and a card is given to you...you approach a food station with a plate, gesturing for your selection like Oliver Twist ..the Food Barista will punch your card with the appropriate value of the meal hidden in \"code\" 

At the end of your meal, your  \"code\" is calculated and you then pay $$$.  
 
My meal began by seeking out a table not reserved or occupied...the  crowd this day was in the majority of Grandparents treating their  offspring and children to a feast before their flight leaves to Florida....or Hungary...or the Baltic's.....
This trough appeals to the nouveau rich from the 'berbs, you won't find the downtown crowd here....a selective location with  BMW's , Benz  and Lexus populate the parking lot. 

The dress code is casual. . .and disabled friendly.....If you are  uncomfortable by gazes or jostles from strangers, seek another venue to satisfy your personal space. 
 They have food-to-go  , and the dessert selection tempts everyone unless surgery has removed your senses.
 Being frugal by nature,  I have never seen any coupon or discount offer issued by this cash-cow...."}
{"text":"I don't understand this place. What's the point? As you walk in, you will be given a card with which your orders will be calculated. Then you walk up to various stations and select foods you want. Foods are not even good. They don't taste fresh or delicious. Most of them feel like leftovers. And many feel like they were just defrozen. If you are not careful, you will be spending too much on your foods. They are overpriced and each plate doesn't contain enough food either."}
{"text":"Having visited many times I'm a fan. Love the variety. The addition of the bar is where we like to sit, and enjoy the conversation with the friendly staff."}
{"text":"Came here the other night with the family (12/20/10) for some grub. 

Movenpick Marche is the nearest family resto from my home and does the trick when I don't feel like cooking. Located in the York Mills Shopping Centre, there are ample amount of free parking spaces. As there is a grocery store, a coffee shop, and a bank, I usually can kill 2,3,4 birds with one stone. Imagine that!

There are daily specials that are posted at the entrance. I love their pizza as it's thin crust... I always order the children's cheese pizza, which seems to be the perfect size. Another fave of mine is the rosti ... drool. I could eat that any time. The desserts are mediocre imo ... I ordered a mixed berry crepe the other day... BIG mistake. They obvi use frozen fruit and it was still frozen. Grosse. The cakes are too sweet and too big. 

Pricing could be slightly cheaper, but besides that there's no reason to keep me away from MM."}
{"text":"Crepes and waffles and cakes, OH MY! The Marche is a great place to give into your sweet tooth and enjoy sugar and spice, everything fattening but yummy and nice!

The food Marche serves for appetizers and main courses for brunch, lunch and dinner are pretty good too! Personally, if I were to go for an actual meal, I would recommend it as a good place for brunch.

They have a full omelette station set up, where you pick from many toppings to dress your eggs and the chef cooks it up to crispy to soft or running perfection - whatever is your egg fancy!

They also have a large array of freshly squeezed juices to wet your palette.

All of the food is great but my huge faves about this place is the desserts and the hot beverages that compliment the sweet treats.

Marche makes homemade crepes with sweet and buttery batter, which is stuffed with your choice of ice cream, fruit and garnish sauces such as chocolate, vanilla or the rare caramel that sometimes makes an appearance.

If you prefer an even bigger dessert that is going to fill you up, you can take all of the ingredients of the crepe and put them on a waffle instead!

The crepes are around $8 and the waffles are $9 or maybe a litlte bit more.

On top of their well known crepes and waffles, they always have amazing cakes and cookies to choose from.

My personal favourites are the Napolean (a strawberry-custard thing), the NYC style fruit cheesecake (usually with mixed berries or plain blueberries) or the pudding cake, which is a mix of chocolate and vanilla puddings with nuts and chocolate chips.

To accompany your dessert, grab a latte! Their lattes are HUGE and are only $3.15. They come in a massive bowl cup and can definitely keep you sipping on it for at least an hour.

As much as people may not like the set up or the idea of helping to serve themselves, it is a cool concept because you can check out all of the stations, take in the delicious scents and really feel out what you are craving for your meal or your dessert.

And to make Marche super accessible, they have a few locations around the city!"}
{"text":"This place is a huge waste of money. It's close to me and so I would make a point to come once and awhile, when I needed a quick meal and didn't want fast food. But it's the WORST!

You get a card when you go in...different colour for eating in, or taking out. Then you go around and order your food from different booths and they swipe your order, adding it to the card. If you're eating there, you can sit down with your caf trays, or they will package your food up to go.

You can get pasta, roast beef and other meats, pizzas. The reason I would go would be for the schnitzel, which is quite good. But they ALWAYS run out. And honestly, NOTHING else here is very good. You can make your own pasta, but it's all very generic tasting and uninspired. 

The prices are NOT good for what you get, but they aren't four $, like what is currently showing below. Nothing close to that. Someone is grossly exaggerating. 

The service has never been particularly good, you have to wait quite a while for the food and the food has never been stellar. So I've stopped going. Not worth it."}
