{"text":"I really enjoyed my experience here. The only reason this get's a 4 star and not a 5 star was that my glass of wine almost cost as much as my entire meal ($16 for 9 oz)! But hey, I still got it anyway, when in Rome, I mean... N'awlins!   My party of 4 women came here after Kit Kat wouldn't accommodate our group of 4 - they placed us as a round table right by the kitchen entrance... not ideal. Neither restaurant was exceptionally busy (being that it was 4:30 on a Friday). But N'awlins sat us as a great table, no problem!  We got our drinks, the waitress was friendly and even took a touristy photo of us. But the food was just wonderful! I got the Mississippi mussels and bruschetta, my friends went for the seafood dream pasta, bourbon st. pasta and one of the salads with chicken and mushrooms. Portion size was really excellent for the prices, we all left a little behind because we were so full! It was really well seasoned (not too much salt), aromatic, spicy when needed and apparently the pasta was cooked perfectly!  I would recommend this place to anyone! I also hear there is great live music 6 nights of the week when you go at a later time!"}
{"text":"Went over to N'awlins for drinks and appetizers.   Ordered mississippi mussels, gumbo and crab cakes. The mussels were excellent, the right amount of spice in a tomato broth.  The gumbo did not pack a punch that we were expecting. It was way too saucy with very limited rice.   As for crab cakes, this was disappointing. The cakes were almost burnt, and lacked freshness."}
{"text":"The food wasnt necessarily bad, but it wasn't good either. My husband and I paid 40 bucks for a pretty disappointing takeout meal. The gumbo was probably the tastiest thing we got, however it was pretty bland. The crabcakes were tiny. (10 bucks for two tiny crabcakes!) The coconut a shrimp was menial, and i wouldn't really call it coconut shrimp. It was more like 5 sad shrimps smothered in coconut milk and coconut and sugar. I would not recommended this place."}
{"text":"Best part about this place was the music. Food was overpriced for what you get, lighting was so dark I could barely see my plate. Unbelievably overcrowded, couldn't even lean back without being at someone else's table. Service was pretty poor for the price of the food, had to ask for new cutlery between courses. I would say just go for a drink and enjoy the music but the mixed drinks were $17 dollars. Wont be back!!"}
{"text":"uhmmm..ok came here for the music and wasn't disappointed. But the drinks menu was sad and so outdated...I mean, it's 2016 for god's sake. Martinis with melon liqueur, sour apple, blue curacao, pre-made barlime and etc are soooo early 2000's. I had to go for a glass of wine. Service was passable i'd say, even though it felt a bit disconnected (\"Hi, do you know what you want to drink?. There you go\", and back to executing service orders right in front of me, but no attempt to start a conversation. IT'S THE HOSPITALITY INDUSTRY PEOPLE!! You are supposed to be hospitable - 4 people sitting at  the bar). Good spot for music still, but if you are mostly into cocktails and appreciate engaging service, you won't be happy here. Will come back whenever my friends feel like some good Jazz again."}
{"text":"Great food! I had some pasta with chicken and a white wine cream sauce. Amazing!!! the staff is super nice and helpful. We wanted to try the alligator for an app but they didn't have it that night :( there was a live jazz band playing while we were there.   The place is small and narrow. You need to either get there early (before 8) or make reservations to get a table.   Overall pretty decent place. I would def go again and get the alligator next time!"}
{"text":"N'awlins is always great for a chill night of live jazz. I sometimes come in and sit at the bar for a couple of drinks and sometimes come in for dinner. The portion sizes are great and the food  delicious. Service is prompt and friendly."}
{"text":"Great ambience, interesting jazz art on the walls, live music which was great the night I was there. Servers were friendly enough but too many missteps. We had our menus open, chatting about what to have and had to send the wait staff away 3 times 'cos we weren't ready to order. (Hint, if the menu is open, we're still deciding). The place was empty so it wasn't that they were trying to turn the table. My friend ordered a margarita with no salt. Had to send it back when it arrived with salt. Replacement drink was great. Next round the salt was in the drink - back it went. Crab cakes were really over cooked and did not taste of crab. Calamari was tender but sauce had little flavour, a bit of heat but no flavour. Two of us ordered coffee, one of those decaf. Three coffees arrived, none of them decaf. Half way through coffee a wait staff arrived with full entrees and had to be directed to another table. Bill arrived with a bottle of wine charged to the table which we had not ordered.  Will go back to listen to music and have a glass of wine. Kitchen staff needs to be turned over and wait staff, while friendly, needs more training. It was no surprise to find that all the nearby restaurants were packed that night and Nawlins had 3 tables filled."}
{"text":"A weekend visit to Toronto and a lack of Internet service to search for a restaurant recommendation found us just picking something on King Street.  N'awlins ended up being a good choice . We chose to sit on the small patio and enjoyed casual conversation with other diners. The beer choices were good, the Caesar salad dressing was very tasty and both pasta choices - salmon and mushroom - were very good. The caramel chocolate tart was superb. Recommend you give this restaurant a try."}
{"text":"Absolutely love this place! Although the place itself is a bit congested and the tables are way too close to each other, the live music is always great. I feel like I'm in New Orleans every time I come here."}
{"text":"I love an intimate restaurant with an authentic vibe. I've been twice with the women in my family, and have had an awesome experience both times.  The fish seems to be just slightly overdone (don't do the lobster tail - stick to shrimp, white fishes and salmon), and the 'blackened' seafood seems a little ashy in the end, but overall the flavours are good. I could stand a little more spice, but enjoyed the dishes both times I've been. The names of the dishes are on-theme, the staff are very likeable (and I'm pretty sure they're all aspiring actors), the music is central, as it should be, and Nawlins is home to the very best martini my mother has ever had (the Sarah Vaughan).  I'd definitely have an event at this location - the vibe, the intimacy, the musical 'stage' and a good chance for a menu enjoyed by all.  Do recommend, just order wisely and ask for hot sauce."}
{"text":"We recently went here for dinner before heading over to see Kinky Boots and I have to say the food was very very nice.  I had the seafood medley, love the mix of seafood, beautiful presentation and it was a generous size. My only complaint about this dish would be that it had a bit too much butter, personal taste I guess.  The space is a tad small, overall I would go back and if you're looking for a different style of food, visit N'Awlins."}
{"text":"Stopped in for a pre-show dinner, partially because it was across the street and partially because the menu was intriguing.   Started off with Aligator Skewers; four skewers of tasty goodness. The meat was a bit on the small side, but it was moist and flavorful, and the accompanying sauce was an excellent match. A bit pricy, but worth it for the bragging rights.  My wife chose Chicken Marsala as her main, and I just ordered the gumbo soup. Chicken was fantastic, and portion was huge ... it easily served two people. Sauce was creamy and mushroomy. Gumbo soup was also a good portion size, and had the right mix of spice.  Desert was a tasty caramel carrot-cake thing that for the life of me I can't remember the name of. Our waitress mentioned that their deserts were brought in from a local bakery, but it was fresh"}
{"text":"We went out to the first seating (there are two: 6:30 and 8:00P.M.) and it was not too busy.  The choice is surprisingly extensive for such small place with a teeny kitchen.  The food arrived quickly and was great.  My husband had the seafood medley for one, which he though was very nice and I had the steak, which was also really enjoyable.  I would have served it on a smaller plate or added some garnish, as it did look small as presented, despite there actually being more than enough meal.  Not a big deal; just noticed it.  We moved to the long bar after dinner to catch the first set of the jazz band playing that night and loved it.  A really nice place with great ambience."}
{"text":"Great appetizer deals. Fun bar atmosphere right on King Street. Only caveat: the servers are a little distant at times, like they don't want to engage with the guests at the bar."}
{"text":"I went there last night for a friends birthday. I had the snails to start which were yummy. Then I had the seafood pasta which was average!  The atmosphere when we arrived was good although our table was not ready and when it was I had to wait for a seat because there were 9 of us. Halfway through our meal the power went out so we were eating by candlelight which wasn't their fault but no manager came out to explain what was going on."}
{"text":"Didn't eat any food here because we just came to chill, drink and listen to the music. This place was great and will definitely come back."}
{"text":"This place is great! The food is excellent (Bourbon St Penne, as well as the Rockefeller Oysters are the stand out items in my opinion.) I have been to this spot three times and we have never been disappointed. The live music is a huge plus. I am looking forward to my next dinner here."}
{"text":"Came here for dinner with some colleagues. Had the gumbo soup, veal chop, chicken Marsala and Cajun chicken breast.  All very delicious and generous portions.  I would have rated 5 stars but they have a great live band and although they are very good and the music is well done, it's a little too loud while trying to enjoy dinner and converse with your table."}
{"text":"Came here with my girlfriend. We really enjoyed the food, as we sat outside. It tasted really good and the menu had a lot to offer. Music was really eventful and entertaining.  Service could be better and faster."}
{"text":"Would never go back.  My friend who won't send things back did not eat her salmon and the server never asked if there was something wrong with it.  It really smelled off.  I ordered a pasta without the protein and there was no adjustment on the price.  Meals were really so, so.  Then the topper.  Our bill came and it was $261.00 taxes in but before tip.  Obviously we were not on a budget.  We were sitting chatting with our friends and my husband ordered a refill of ice tea.  The server then printed off a new bill for $4.52!  Unbelievable."}
{"text":"Jason B and I first ventured into Nawlins when looking for a romantic place to eat one evening on the King West strip. Nawlins advertised live jazz and blues music with your dinner, which immediately drew us in.  A female jazz vocalist performed classics with a small band while we dined, dare I say heaven? I ordered the Seafood Dream Linguine... I can't remember what my sweetheart ordered as he was quite busy eating from my plate instead! Needless to say the Seafood Linguine was quite good.   Nawlins itself is quite a narrow restaurant (as are most on that King West strip). Seating for us was very tight (we sat at a teeny tiny 2 seater table near the main entrance). On the plus side, our server was great - very quick and attentive.   A few months following this dining experience, Jason and I took a trip to the real Nawlins (aka the city of New Orleans).   After the trip, we did eventually venture back to Nawlins restaurant (when we started missing New Orleans oh so desperately). Sadly, I'd have to say that Nawlins just doesn't compare to the real thing. Food in New Orleans is so much spicier, the seafood is much fresher, the jazz music is so much more raw... King Street just is no match for old world dirty magic that is Bourbon Street.   But, if you've never been down to New Orleans, Nawlins in Toronto is probably the closest that you can get to the real thing, so I recommend trying a little taste of New Orleans at Nawlins in oblivious bliss :)"}
{"text":"My husband and I are a big fan of Jazz and Blues.  It's a small restaurant with a \"squeezed\" feeling but the decor, music and food make up for it.  A bit on the pricey side, but considering location, quality and music I believe it's worth it.  I'd recommend reservations, because we've tried getting a table on a Friday or Saturday night with no luck (bar only).  When we have dined here, we both enjoyed the seafood medley, and asked the waitress to make it mild (although it still had that spicy kick).  It's as \"cajun\" as can be....for Toronto.....and was an incredible meal.  The portions were large, it was loaded with a ton of seafood and was very flavourful.  Friendly waitress, and the Jazz/Blues has always amazing (never had a 'bad band').  We agreed to return here, often."}
{"text":"Lovely atmosphere, free live music, and fantastic food. My only question is this: Why don't they have crawfish on the menu?"}
{"text":"I love this place. I accidentally came across this little gem while aimlessly walking through theatre district looking for somewhere to eat with an artsy ambience. Located in the heart of theatre district in downtown, it has a very cozy and old classic atmosphere with live music. I sat near the window and had the seafood medley while listening to live jazz and watching the passersby. It really reflects the creative side of Toronto and my favourite was the live pianist. A lot of theatre and movie goers stop by here for dinner. It's located right across the street from the TIFF theatre.  I enjoyed myself so much so I came back the next evening and sat in the same spot and ordered the exact same thing lol. I can never get sick of live jazz and delicious food! Especially lovely during winter seasons when the snow falls. Will go back next time I visit Toronto again!"}
{"text":"I came here for Winterlicious 2017 with a few friends and overall, it was a fine experience. At first, I thought N'awlins would be this upbeat, crazy and rowdy restaurant full of restless energy. I thought the whole restaurant would be itching to get up from their table to just dance it out with the jazz players. But no. This restaurant wasn't like that at all (at least, my Wednesday night at the restaurant was quite mellow). The space is very tight and a lot more formal than I imagined. There were not a lot of people there (granted, we were eating dinner at 8:30), but a sole pianist (I was reminded of La La Land).  But let's talk about the food. I had the soup of the day which was leek and potato soup? I don't exactly remember - but there was a sort of film on top of the soup. It tasted pretty good even though the presentation wasn't too impressive or anything. Also the film tasted a bit plasticy although I disregarded it because I mixed it into the soup until it disappeared. Also, the seasoning was SPOT ON.   For the main course, I had the blackened catfish. The only set back here was that we waited close to an hour for our main course. But damn! The portion was huge! However, the 'jambalaya' was a bit misleading. To me, it was just spiced rice as opposed to the shrimp and sausage I was supposed to get. The spiced rice was great though, I was very happy with my main dish.   The dessert was probably the best course. I had the tiramisu cake, which was light and fluffy and tasted great. It wasn't too sweet or anything, though I would have preferred if the cake wasn't drizzled with caramel.    Anyways, I would come back again - not for Winterlicious though. I'd probably get the seafood medley or the jambalaya next time.  TLDR; Nice and cozy, large portions of Cajun food. Won't come for Winterlicious/ Summerlicious, but I'll definitely come back for one of their regular menu items."}
{"text":"I visited N'awlins for a surprise birthday dinner for a friend. The vibe was lively and upbeat. Our server was wonderful and made sure that all of the guests attending were well taken care of, as well as the birthday girl.  Our server requested that the band play happy birthday, and they very also gave special mention to a couple celebrating their anniversary.   The food was good, but some portions were small for the price. For instance, I ordered the fish of the day special at $26+, and the portion was literally half of the size of other plates my group ordered, such as the Fusilli pasta with Bacon & chicken at about $19. The crab cakes were small, but packed with great flavour, and the coconut shrimp was awesome and not like anything I've had anywhere else. The shrimp isn't fried with a coconut batter, but sauteed in sauce and loaded with shaved coconut on top. We actually ate spoonfuls of just the coconut sauce!     On the not so great side of things, their website states there will be a \"15% gratuity is added to parties of eight or more\", and in a party of 6, we were charged this same automatic gratuity.    Overall, we had a good time and I'd probably visit again."}
{"text":"No idea if the food is good but the live music is true new Orleans. Only here for less than an hour, but the service was great and the music is real."}
{"text":"This restaurant should actually call themselves \"The Louis Armstrong Paradox\" because the music & vibe is SO DARNED GOOD and the food is so darned bad. Having been to N'awlins (the real city), I have a pretty good idea of what the dishes should taste like. The gumbo soup was straight up Campbell's, and I know because I bought some of it last time I got back from New Orleans with the frail hope that it would be similar (it was not). It was runny, absent of thickener (OKRA, WHERE WAS THE OKRA???), and tasted like tin, with the teeniest flecks of chicken and ground pork. My bf's creole chicken was dry af. I really wanted it to blow the Cactus Club creole chicken out of the water, I really did, but Cactus wins. We ordered the alligator to start, and the bartender said \"sure, I'll just make sure we have it\"- he never told us they didn't, so we assumed it was coming but it never showed up lol. Bf asked for an old fashioned, half sweet, and it was mega sweet and he didn't finish it (guess the bartender thought he was just pretending not to want a sweet old fashioned... good one dude). I'm the daughter of a jazz musician and grew up in bars, and I ran into a musician I knew here - the one saving grace of the whole evening, that the owners have better taste in music than they do food."}
{"text":"Awesomely cramped little restaurant. Had the cajun cat fish, was a little under cooked but still very good. My friend had a pasta dish and it was also extremely good. The live jazz made the night fantastic (friday and Saturday nights). The only down fall is they don't have debit. Add the debit and it would have been a perfect night, lots of fun :)"}
{"text":"I have been to N'Awlins three times and my first two experiences, sipping brandy with my boyfriend by the bar were stellar - the bar tender was a little bit rushed but I'll put that down to my personal preference.  The third time I went to N'awlins we decided to have a meal, the crowd was extremely boisterous but the band was amazing. We both ordered a vegetarian pasta dish, (the pasta was VERY al dente) and spent the night dodging dancers left and right who all but sat on our table (and food) with the heavy dancing in an extremely cramped space.   Not only did our server not do anything with regards to this, she also brought me the wrong glass of wine, which having taken a while to arrive I accepted regardless. In addition to all of this they do not take debit only cash or credit, at the end we put down 100$ cash (all we had) for a 90$ bill and decided to leave the rest as tip only for the waitress to come back and rudely say \"I would rather not\" - Needless to say considering the mediocre experience and horrible service, I will never be back.   The band was good - but I will keep to frequenting other live jazz bars that have less entitled staff."}
{"text":"I really enjoyed this stop. The Yelp reviews don't do this place justice. In town visiting and wanted a place to grab a quick bite. The portions are large and ordering from the appetizer menu was PERFECT! The live band on Saturday night was good and added to the Cajun vibe. The only con is that the seating is very few but makes sense because the food is delicious. I ordered the mussels Mississippi style a MUST TRY!"}
{"text":"My bf and I wandered into this narrow, appropriately dim little bar/restaurant after FanExpo at the TO convention center. After originally planning to sit on the small but quaint patio we moved in to the bar to enjoy their half off happy hour apps (no alcohol purchase necessary, a bonus in the 85+ heat we were walking in). I've read since our meal that this place can be very crowded, but at 5:30ish on a Sunday it was completely dead for most of our stay.   Ambiance - The place wreaks of old jazz/blues, from the multiple photos of classic musicians in the genres to the giant painting of Billie Holiday to the dark, rich wood work and small, intimate tables. The restaurant is dominated by a long, comfortable bar which had a narrower depth of counter for drinking customers and a deeper depth for those wanting food with their libations.   Food - We decided to order a variety of apps, as we were having trouble settling on entrees anyway, and the half off special sounded too good to pass up. We both got gumbo - a flavorful enough broth, but thin and soupy compared to what I've come to know as gumbo with very little rice and almost nothing else in it. My date's grilled veggie platter was out of this world - a heaping rainbow of bright colored produce, all fresh and tasty, with a creamy dip. I couldn't stop snagging stuff off it! My oysters, served in the shell with a mix of cheese, seasoning and bread crumbs, were rich, delicious and done just right. The real eye opener were the alligator kabobs - gator medallions rolled in seasoned breading and cooked to perfection on skewers. The taste of the meat was like nothing I'd had before and was complimented rather than overpowered by the coating - not too salty, not greasy, and with excellent texture. The gator and oysters both came on beds of mixed greens that were super fresh - if these are intended as garnish they should really take it down a notch. There was SO much I squeezed my lemon wedges on it and ate it as a side salad (bonus for me, but not good price points for the restaurant). The desserts, carrot cake for myself and apple toffee cheesecake for my date, were excellent and made in house. Fresh, great texture, strong flavors, not overpoweringly sweet.   Service - Service easily deducted 2/3 of a star (the other third lost on the weak gumbo). The server was nice enough and okay with speed, but spent 3/4 of our meal sitting at the other end of the bar, eating and talking with his super loud, obnoxious friend (another waiter off duty, or just not doing anything, who wouldn't shut up about his football \"knowledge\" and dropped multiple f-bombs - I'm not sensitive but that can really be a turn off to some customers). Our waiter also repeatedly made comments to his friend about how empty the place was and insinuated the business was dying a slow death. Not professional. Eventually a waitress showed up, just in time for the first table of folks for the dinner rush to get sat. After she placed their orders she too plopped at the end of the bar and joined in with the loud, non-workplace appropriate conversation which quickly turned to her dating/partying experiences - it was like Jersey Shore after five minutes. I would have lost my job after about two shifts of this at food service places I've worked at, even chain restaurants."}
{"text":"I was only in town for one night and wanted a decent meal on the cheap that wasn't cookie cutter, like I could eat just anywhere.   I walked up and down the street looking at all the menus. What really lured me into N'awlins was a posting that they had half-priced apps from 6-9. The menu was appealing, so in I went.  I took a seat at the bar and was greeted by Craig, a waiter, and by Jessica, the attractive bartender. (Yes, that sounds sexist. Craig was attractive, too!) The place was sort of empty, but had a pleasant and clean atmosphere.    First up was a pint of beer. I'd forgotten how large these are. Ordering a Heff, I was happy to see Jessica knew to place an orange slice on the glass and not a lemon, like so many places do.  I ordered two appetizers, blackened calamari and oysters Rockefeller. A bread basket with soft herbed butter was presented to me. The food came fairly quickly and I was a bit shocked at the small portions. The value was there, since things were half price, but I would have been steamed had I paid full price for the portions I received.  The oysters were really good. What's not to love about creamy sauce with bacon and cheese? There four to the order, served on a bed of lettuce.  The calamari was really extraordinary. I'm so used to it always being fried. This was blackened and served in a spicy red sauce. It was tender and the sauce didn't hide the wonderful taste of the blackening. The peices were large and once gone, I sopped up the sauce with the remainder of the bread.  What was really nice, was the staff. When I arrived, a woman began playing blues piano, which lent an appropriate aire. Craig and Jessica carried on an intelligent and fun conversation (I was the only person at the bar).  While I would love to return, I must admit that there are so many restaurants in this area, I'd tend to want to explore more. That said, if you can take advantage of the half price happy hour, I do recommend this place."}
{"text":"Had lunch here with a girlfriend. We ordered the Alligator Skewers (HIGHLY RECOMMEND) and the Bourbon St. Penne.  Everything was delicious! And our server was amazingly friendly.   Loved the ambiance of this place. Definitely coming back here!"}
{"text":"We came here during TIFF17 since it was right on King Street and we wanted to sit outside. The food was underwhelming and not worth the price in our opinion. It was lunch time so we got a caesar salad which was watery and basically no taste. The one winner from the meal is the coconut shrimp dish which was creamy and delicious (although I would've liked more shrimp since they add so much coconut shreddings and sauce.   I believe the waitress told us this place isn't usually open for lunch but the food still wasn't worth a second visit. The customer service was great though - very attentive, super friendly, and helpful with the menu. It's a cool location and I like the idea of the live music so I wish I liked it more but the food wasn't up to par."}
{"text":"Enjoyed the music  Brooke Blackburn trio were performing great band worth going if they are performing you won't be disappointed.  Food was ok, ordered the calamari and penne.  Calamari was salted with a Cajun dry rub that was reasonably spicy.  Portion was small but could be shared between two.  Penne was perfectly al dente, the rose sauce was creamy and full of bacon.  I rate them down for the table we were given upon arrival which was right infront of the door that leads downstairs to the washroom.  The door hits your chair every time someone opens it.   I understand it's a tight space but having a table there makes no sense and as a patron I was turned off when seated there, especially when there were other tables available.  My guest and I asked to be moved right away.  Service was very good our server was pleasant.  Prices are decent for a touristy area."}
{"text":"I am so glad I found N'awlins!  As an American with a few trips to New Orleans (N'awlins) under my belt, I can tell you it was a real treat to find authentic Cajun fare at the right price in Toronto.   I had the Cajun Calamari, Alligator Skewers (seasonal), and the Goat Cheese salad with Tiger Shrimp. Whoa, is this food good!  It was a real treat eating here. They had Guinness on draft, among others, and they have live music most nights during the week. They have  great Scotch and wine lists. My server, Rachel, was a pleasure to spend time with. She knew a lot about the menu, and was a very accomodating and pleasant."}
{"text":"N'Awlins was a great stop on my trip to Toronto. Had a change to get a few drinks, listen to some live jazz and eat some tasty Cajun food. I had the Cajun surf and turf, which was right up my alley. Some good wine topped off the meal.  I recommend you make reservations as it's not a large dining room."}
{"text":"Oh N'awlins!!!   This place is just awesome because it's such a departure from the typical day to day cuisines that are found everywhere.  A taste of New Orleans right in Toronto's backyard.  I'm not the kinda girl who has the bills to make it rain and spend it on expensive main dishes. But I am the kinda girl who likes to stretch the dollar so naturally I'm ALL ABOUT HAPPY HOUR! which is great because their appetizers are AH-MAZING!  Happy Hour for appetizers is around 4-8pm but don't quote me. That's when ya'll gotta go peeps!! Their coconut appetizer is THE BOMB! My husband and I ordered 2 orders of that and tried 4 other appetizers.  Baked Oysters Rockerfeller. YUM Calamari. YUM Mussels. YUM Crabcakes. YUM  My mouth is watering as I'm typing this review!  The only thing is the drinks is what will top the bill over. But you don't feel so bad, when you're paying half price for all this great food!  I LOVE N'AWLINS!!"}
{"text":"I was lucky enough to order the alligator skewer at dinner and it was delicious. Very moist and flavourful. It's a seasonal item so they sometimes don't have it available. Prices for their main entrees are a bit pricey."}
{"text":"Now this place is a really night out! The food was Amazing! We got a bunch of items and shared family style. Everything was fantastic...one thing that is well outside of my comfort zone was the chicken livers...i know sounda gross but they were so good!!! You will almost 100% need a reservation unless you are willing to wait. Now to the BEST part of the night...the music. Live music I feel is becoming more and more difficult to find. The guys that night blew us away. This is so cliche but they definetly had soul. You could heat and feel it. Will be back!"}
{"text":"Genuine and authentic... too small but it is worth the visit. And food is delicious ! If you want to talk with your friends, it is not really possible during the jazz concert obviously loud, ask for eating outside ok terrasse."}
{"text":"I came here last night for the summerlicious menu. I ended up ordering outside of the menu, but the hubby stuck with it.   I got the calamari, which isn't your typical fried calamari. It was about 5-6 pieces with creole seasoning and in a bowl of spicy tomato sauce. It was okay. Definitely got the spice factor.   For the main i got their creole catfish. I've never had catfish but I truly enjoy seafood. It doesn't taste that good, to be honest. And the jambalaya rice is just rice, lightly coated with tomato sauce. It was NOT jambalaya. It was extremely disappointing.   The hubby got their bruschetta, which was delicious and he got the creole chicken. The chicken was 100% better than the catfish but their jambalaya was the exact same as the catfish and the \"creole\" sauce tasted like it came from a can of Campbell's tomato soup. It was no bueno.   The best part of the meal? The pecan pie. I would go back for the pecan pie. But that's it.   The service was good. I appreciated the waitresses attention. But the meal gets a 2, service and dessert gave the extra star."}
{"text":"Celebrated my birthday at Carmen and then followed up with drinks at naawlins.  I was completely blown away by what a fabulous night it turned out to be!  I was welcomed in with the sounds of finger-snappin foot-tappin live jazz and comforted by the smiles and laughter of the many new friends we made. Summer, our awesome gorgeous bartender made us some great drinks and gave me my favourite -  flaming shots! Woohoo !  Of course I had to follow this up with sexy dancing next to the guitarist,  singer, and pianoman and they were enjoying it just as much as I was. The band also took requests which made the experience even better.  I didn't try the food but Lord knows I'll be back to do that.  N'awlins is my new home away from home!! FYI: 30+ crowd, moderately expensive,  weekend RSVP recommended for dining area."}
{"text":"I really like the Penne... the seafood medley rice could have done with more flavour, seasoning or veggies... otherwise, it was nicely presented, shrimps, scallops, calamari, lobster. The band wasn't playing but i'd like to return and check it out when they are playing..."}
{"text":"Literally the worst meal I've had in a long time. The service was sub-par, the calamari was fishy and chewy, the blackened chicken was tough and dry on top of tasteless vegetables and rice. We paid over $160 after tip and I would have much preferred to eat off of the McDonald's value menu."}
{"text":"Beautiful restaurant, nice staff, great little patio, great pasta.  We had the Bourbon pasta and the Tiger Shrimp pasta. Both excellent and very filling. Nice selection of small plates also."}
{"text":"One of the worst Cajun places I have been to. The atmosphere, decore was very nice. Servers were not very attentive for a littlely packed place. But the food was not good at all. We only order appetiser. The Gumbo tasted out of a can' the chicken liver had no seasoning, the calamari was over cooker in a bland tomato sauce, the crab  cakes were made out of fish, and the mussels bland."}
{"text":"Very crowded place at night but somehow lucked into a table for 4 of us.  Crab cakes, mussels, gumbo, pasta with chicken, seafood linguine, were all very good, not spectacular.  I'm usually happy with \"very good\" though.  I don't remember the name of the band but they were good.   Vocalist was great - sounded like a white Stevie Wonder.  Would definitely return"}
{"text":"Best jazz bar in the city and one of my favourites in the world. Great for dates, group dinners, patio in the summer, and birthdays. Gets a little crowded when at/near capacity, but you're distracted by the tunes (especially if it's Blackburn). Great pasta and desserts, but they usually won't seat you at a table if you're just going for drinks. There's a small bar area in the back with a poor view of the band, so dinner reservations would be best."}
{"text":"Love this place! Being from Chicago I expect everywhere I go for food to taste good. The food was \" Great\" and the music was amazing. The service was good as well, no complaints from me. If you don't like dark intimate places then don't come. You are literally elbow to elbow with others. Great energy and a must visit place!"}
{"text":"We came here randomly last night and it did not disappoint. The place was a little tight but once we settled in the service was pretty good. they do give preference to those who are going to a show after dinner however. We started with several sea food cajun appatizers, all were great. Our meal was jambalaya! and it was extremely good. the portions were fairly big as well. For dessert we got chocolate mousse cake. For drinks we got martinis (which were higher priced then I thought), but they also have a nice wine list.   Overall I would recommend trying this place out. They play nice jazz and blues music and the food is flavorful."}
{"text":"I'm a big fan of Cajun food and N'Awlins is a dandy little restaurant to enjoy it.  Boasting itself as a jazz bar, it attempts to capture the feel of a New Orleans bar with as authentic cuisine as you can muster.  I've not been to New Orleans so I can't do any comparisons, but from how I'd stereotype it, I'd say N'Awlins is probably close.  The décor certainly lends itself to it, the music that supports the dining area is pretty authentic, and the menu runs the gamut of Cajun and Creole plates that I'd assume are pretty close to the bone.  I'm a sucker for catfish when it's done well, and this place does it well.  Putting it along side a plate of jambalaya is not going to make me unhappy either.  The one thing I've noticed is that this place gets busy on theatre nights.  I've been to a lot of theatre in my life, but I can't imagine I'd want folks sitting beside me after I've had a load of catfish.  I'll do everyone a favour and walk the long way home."}
{"text":"Read reviews that complained about the service, and was prepared to suffer a similar experience. Quite the contrary. We got there just as the theater crowd was leaving. Quite crowded but the hostess was very accommodating and allowed us to change tables three times. We ended up with a perfect spot near the band.  The food was uneven. I had the seafood medley rather than the fish special. A mistake based on the waitress saying this was the most popular dish. The scallops were very good, the shrimp were tasty, but the lobster tail was dry and the calamari was tough and chewy. I would have complained but the waitress never asked how is everything, and the music by the Blackburn Brothers was making it a most enjoyable night. They were so good that we ended up staying for three sets and downloaded their Music from iTunes. I suggest you go for the music and eat a light fare or just have drinks."}
{"text":"We came here for winterlicious. Unfortunately we did not look at when the live music was to be playing and came too early for it which was admittedly was our fault. Perhaps, that would've helped to lift the evening. That being said the food just missed the mark in every respect when weighed against the total cost for it. The cajun calamari had little taste to it with a hit of heat at the end. It was rubbery and had that fishy taste no one wants. The blackened chicken was very dry and came with odd dipping sauces. Felt more akin to Popeyes chicken which clashed heavily with the warm candlelit ambiance the restaurant has. The best part of the meal was the desserts by far. The cheesecake was quite good. All being said for the 140 dollar price (winterlicious for two plus one drink) the experience was not worth it."}
{"text":"If you've ever been to New Orleans, you know that the only place to get great cajun food is in New Orleans!  Went to Toronto for the weekend and me and my lady got into town late.  We wanted to eat somewhere close to our hotel that didn't seem too trendy or usual. My gf picked this place.  It wasn't bad, but we didn't anticipate sitting near the jazz band whose set began 10 minutes after we had walked in.  The music was a pleasent surprise for me, but not so much for my girlfriend (who isn't a big jazz fan).  The service was a little slow, but it may have been because we got there later in the night.  I would recommend this place if you just want to grab something to eat, but I wouldn't go out of my way."}
{"text":"Food was okay.. Great band. Small. Not good for a large group.  Need to add more on the menu and I suggest  to add White Zifandel to their drink menu."}
{"text":"Amazing experience! We lucked out and were seated right in front of the musicians. Food was excellent- had the mushroom pasta, Cajun shrimp, and gumbo. A little privacy but a great deal if you factor in the live music. Would 10/10 recommend."}
{"text":"Awesome atmosphere. Small, cozy and great live Blues. Service was great. Food was pretty good. Could have been a little bigger portion. Ordered lamb chops but could have given me a full rack for the price. Overall great experience and glad we tried it."}
{"text":"The food here is to die for, the band was off the charts and so amazing The big blonde girl behind the bar was absolutely horrible and the service deplorable. Next time we'll sit at a table and enjoy this restaurant for what it has to offer!"}
{"text":"This a very quaint little (seats may 50-60ppl) restaurant in the centre of the King West entertainment district. We went for the Summerlicious promo & we're glad we did.   The salad dressing that came with my salad was delicious! Just the right amount of garlic & balsamic. Off to the Gumbo soup which was Fabo as well. Just the right balance of bite with flavour combo, a great start! The main was Cajun Chicken breast. It was a full 1/2 breast which was perfectly cooked & spiced. The roasted garlic mashed were perfection on my plate. Real potatoes too...had lumps! Came with perfectly cooked bell peppers & asparagus!!   For dessert we had one of each of the four. Cheesecake, chocolate cake, strawberry cake & Pecan Pie. I tasted them all & all were good/great.   Our server \"Ashley\" was efficient & relatively fast and had a great sense of humour. The in-house Jazz band was the perfect mix of great music & volume. Not too much to drown out the conversation.   If you're looking for a great meal while listening to some cool Jazz....go here. You won't be disappointed!!"}
{"text":"Great place ! Small and quaint but the food and drinks were great! The band was rocking and the server we had was quite nice and attentive. It is very dark inside for those who might not like that type of atmosphere but I loved it. The jazz band was off the chain and was the main reason my friends and I came through. I ordered the mussels on the appetizer menu and it was BOMB. the bread they bring to the table was also good and fresh. And went well with the sauce from my mussels. Also my friend ordered the potato leek soup and it was good. The other ordered the bruschetta and it looked amazing and filling. Food came in about 15 minutes wilhich was great because they were packed ! Can't wait to go back--Bring cash to tip the band because we certainly forgot to bring some :(bathrooms are downstairs and were fairly clean when I first got there but an hour later they were struggling lol. But didn't ruin my experience at all!"}
{"text":"Don't get me wrong: their food is very good, the problem is the price.   I went there after an awful day when everything went wrong, so I decided to indulge myself a bit and have a nice dinner.   Their bread-and-butter is delicious, really. Loved the butter and almost ate the butter alone. I asked for some shrimps as appetizers. Got five HUGE shrimps, cajun style. Delicious, really.   I did not find many seafood options on their menu and decided to order the poultry, as I don't eat red meat. Again, it was BIG and both of us could share the dish.   I thought the service was kind of slow (there were only two couples at the restaurant), and the prices were really expensive for the kind of restaurant/food. I felt like I was paying for the \"jazzy\" stuff - you know, people who enjoy jazz are trendy and cool and must be rich.   But they offered me good comforting food on a day I really needed that kind of stuff. I'm thankful :)"}
{"text":"No money to go to New Orleans for some delicious Cajun cuisine? No problem. Just check this little joint out. Not only is the food yummilicious, but you don't even have to solely rely on your taste buds to get the New Orleans feel; the decor and chilln Jazz playing in the background complete the package.   The wait staff is friendly and attentive. The kitchen staff is fast and oh-so very good at what they do. PLUS you get a nice wine list to choose from.  Although this place will hold you off until you save up for New Orleans, you really need to check out the real thing when you can."}
{"text":"Stumbling across this little gem was somewhat of an accident. A group of us set out to try the place next door called HUSH, but as it turns out they are closed on Monday nights. Right next door to HUSH is a little restaurant with a very inviting facade called Nawlins. There was a patio, but it was closed due to the arctic temperatures outside. The inside was a bit snug, but they were able to seat a party of 5 with no problem on a Monday night. The tables all had white linen, and would be quite nice for a date night for two people, but the recorded music was quite loud. It appeared from time to time they do offer live music. Everyone was extremely pleased with their appetizers, but they were out of Crocodile which was the first pick of at least 2 people at the table. Moving on to the main course we discovered they don't even offer Jambalaya as a dish. Other than the crocodile being out and the non existence of Jambalaya the food was very good, but for those two reasons I can only offer them 3 stars."}
{"text":"One thing I always worry about when there is live music its that it is always too loud, but that wasn't the case here. The music was at just the right volume, you didnt have to yell at the top of your lungs to hold a conversation."}
{"text":"Nawlins is an an usual combination, a jazz bar and an Italian-Cajumn restaurant.  It's not bad and during happy hour you can gorge yourself and a range of wonderful Cajun starters...blackened alligator, catfish etc at half price, or at least it was when I was there, all of which I followed up with moire of the same in the form of the seafood medley main course.  There is live music and it's a fine place for an evening repast if you're in that part of town.  If you're not, it's worth a visit too.  If you don't feel like anything on the menu, you can have a beer, listen to the music then go next door to Kit Kat which is also excellent."}
{"text":"After spending a week in New Orleans this past February, this restaurant happened to catch my eye and my hopes for being at least borderline authentic in terms of assuaging my love of both New Orleans jazz and creole southern comfort food.  After the prices on the menu made my eyes pop out of my head, I decided to save my visit for a special occasion, and ended up going last night for my 25th birthday dinner.  It was a very rainy and miserable Tuesday night, so I sort of scoffed at the idea of making reservations, but went ahead and did it anyway.  Good thing we did as the place is SMALL. And when I say small, I mean so small and narrow there was room for one table of 6 - 8, and 6 or 7 2 people tables that practically touch each other. We were seated next to the bathroom door, and we're constantly being hit in the back by the door opening and closing, which was as pleasant as the volume of the live band, which, although very good, caused us to have to scream over the table at each other the whole meal. The place is simply too small, in my opinion, to have a live band and allow the patrons to enjoy and converse comfortably at the same time.  Despite the cramped space and deafening volume, I was committed to the food I had been eagerly looking forward to for months. We ordered the cajun crab cakes ($10) off the appetizer menu to start, and a martini ($8) each. The crab cakes were about the size of my palm, and we were initially dismayed to see there were only 2 on the plate. At $5 each, they had better be the best crab cakes this side of the border. Disappointingly, they were slightly burnt and overly breaded. While the inside was light and full of warm, seasoned crab meat, the aftertaste of the char was what was left in your mouth.   Ok, so at this point I was feeling quite disappointed and considered wandering King Street in the rain in search of salvaging my birthday celebration. Then the main event arrived - I had ordered the Seafood Medley (at a whopping $34 a plate) and my boyfriend the BB Pasta (linguini I believe). This arrived just as the band started playing happy birthday to me, and a special song to us afterwards as we ate our meals. The Seafood medley was FANTASTIC, spicy, rich in creole seasoning, and with a lobster tail on top (bonus!). Not a good as I had in New Orleans, BUT, comparable. My boyfriend's pesto linguini was literally the best pasta I've ever tasted, and I don't even like pasta. Pecan pie for dessert was warm and choc-full of pecans, and came with a birthday candle on top.  Overall, the entrees and the special birthday attention coupled with an overly-loud, but talented band that temporarily transported me back to the French Quarter salvaged my experience at this too small, overly-priced eatery. Will consider returning to drinks only at the back bar to catch the live music, and save the food for special occasions, perhaps mid-day when the crowds die down.   Note: The restuarant is 19+"}
{"text":"Wonderful small jazz Italian restaurant close to second city. Appetizers were excellent: brouschetta excellent and right size. Escargot good tasty garlic sauce. Sat at bar and service great up until dinner. Had 8 show time arrived at 6. By 7:20 main course not delivered. Left paying just for drinks and apps. Live music piano player woman real raspy jazzy voice. Would I go back.  Maybe. Toronto has so many choices."}
{"text":"Dark place, white table cloth, live music, decent food.  They serve Cajun and Italian (?).  I had the seafood medley which was all kinds of grilled seafood over jambalaya rice.  Pretty good, or was I just hungry.  Good service but really a pretty small space.  Good enough I suppose."}
{"text":"**3.5 stars**  Imagine how distraught I was when I wanted to try this restaurant out and only found a few reviews from 2013. I must say, I was hesitant without my trustworthy sources but it motivated me to check this place out and report back to my fellow Yelpers!  We arrived as a party of 2 on a Friday night around 7:30 with no reservations. They managed to squeeze us in right away at a table just beyond the entrance. The live music starts at 8:00 p.m. and the place fills up between 7-8 so I would try and arrive by 7 if you have a bigger party than 2 or make reservations. They do online reservations if you give at least 24 hours notice.  We were excited to try the Alligator skewers but they were \"sold out\". It seems from other reviews, this happens often. Definitely a disappointment and missed opportunity for them to highlight one of their more unique dishes on a busy Friday night. Instead, we opted for the Cajun Calamari and Grilled Vegetable plate. The veggies are not worth mentioning and not worth ordering - you can make this at home on your own! The calamari was delicious and full of Cajun flavoring - worth a try. Lastly, the Cajun Catfish is definitely on the must try list if you visit this New Orleans inspired restaurant. It is as authentic as a dish can get here.  Their selection of scotch was impressive. I was at dinner with a scotch lover and it seemed fitting to sip on a glass (or two) post dinner to enjoy the live music. As a lover of jazz, I really enjoyed the cozy ambience. The space itself is not huge so the music carries nicely across the restaurant. If you are here for a date where you want to get to know eachother, I suggest arriving before the music starts because it gets pretty hard to chat once the band gets going.   I would definitely like to come back to Nawlins to enjoy a glass of wine and listen to the live music. I think next time it will have a solid 4 stars when I rate it only on the drinks and entertainment."}
{"text":"I was in Toronto for business and N'awlins was recommended to us as a cool dinner place. It was a weekday night and I noticed as I was walking in to the restaurant that it's quite empty comparing to the adjacent restaurants.  I ordered \"Avocado Salad Avocados with mixed green & a cilantro lime vinaigrette\" and \"Cajun pan-fried Catfish\". The salad sounded refreshing but the mixed green was a little dry and I barely tasted cilantro. The catfish was a little oily but tasted okay. My coworker had a bowl of Gumbo soup and said it's spicy but surprisingly bland. The service was slow as expected. The jazz musician was next to us so it was a bit too loud.  The overall experience was underwhelming."}
{"text":"my girlfriend is really into jazz and for valentine's day we decided to make a reservation at n'awlins.   the first impression we had was how crowded it was. too many tables in that little dining room. when the food came we noticed that the portions are so small that we were a bit upset that we chose this venue for our dinner. granted everything was really good, we tried the alligator, oysters, shrimp and the seafood jambalaya. we didn't drink and ended up 100 dollars lighter.   in all i guess the music saved the day, the band on that night was really good. don't think i'm coming back pretty soon though..."}
{"text":"Excellent. All around American, thorough and classic. Excellent fresh seafood, classy but casual vibe.   Arribiata w/ calamari (split by the kitchen, without asking), mussels and goat cheese + portobello salad."}
{"text":"This place is small and narrow.  They apparently play live jazz, but last night (sat) before 8pm, there was no live jazz.  The service was decent, we had reservations and were quick to be seated.  The food quality was really good, and the prices are fair.  I ordered the chicken ($20) and it was the best i've ever had.  If you have a smaller budget, there are food items to accomodate you, namely the pasta.    Like someone else said, the bread and butter was delicious.  I had to eat the whole thing even though I wanted to save room for dinner!  We ordered dessert, which is posted in the photos.  The dessert was great.  They had 3 choices of dessert.    I recommend this place for couples, or small groups of friends.    Derek"}
{"text":"Nawlins is one of my top choice spots in Toronto. The music is excellent and the food is just as good. The calamari is the bomb. EDIT: The more I go here the more I realize the only thing that keeps me coming back is the atmosphere and the music but that in itself is worth it. I suppose Ive gotten tired of the menu and customer care."}
{"text":"Good vibe. The service was great. The Veal was awesome but outside of that the food was just ok."}
{"text":"Half price apps from 4-8 is the bomb especially the seafood platter. Loved the catfish and would definitely go there again"}
{"text":"I've been there twice . I enjoyed myself Both times . The service , the vibe and the food - all great . I like the decor and the fact that it's very clean . Candlelight dinner and Blues ? Yes please !  And don't forget to try the goat cheese salad . Mmmm."}
{"text":"Ordered seafood surprise. Quite insipid. Decor and service is warm. Background jazz music gives it a great feel. The food is awful and i rarely say this."}
{"text":"Cozy and intimate restaurant with a live jazz/blues band! We showed up on a Friday night and got seated within minutes. We all opted for pasta: seafood dream, piquant rigatoni and calamari. I haven't had Italian food for so damn long, so this totally hit the spot. Everything was full of flavor and portion is just right. Our waitress was friendly, as many Canadians are! We enjoyed the lovely music for the entire time the band was playing. I'd come back to this spot next time I'm in Toronto!"}
