{"text":"The food was similar to a homecooked version I've had so I liked it. 

The restaurant's decor is modern and definitely stands out from the rest of the ones in the plaza. 

To order, you pay at the counter and find a table until your food is ready. There's a bit of confusion when the bell is rung because no one knows whose meal it is until you go up to check.

Overall, not a bad lunch spot but probably won't be on our regular rotation."}
{"text":"Except for a handful of items on their menu, the food tastes exactly like Bamiyan Kabob. 

Things that are different - less busy, smaller, parking lot is a big mess on a Friday/Saturday night. Arrive early or you're going to be parking across the street. This restaurant shares a parking lot with a few other establishments, hence why the lack of parking. 

We came with a group of 10 and were lucky that we got a table. A few other parties came in after and had wait for a spot to sit.

The food took 20 minutes to arrive, but it was good - slightly less in terms of portion size compared to bamiyan, but it was good. Their chicken breast and tikka chicken was good. I did not enjoy their beef kabob - bamiyan is that winner here. 

Good, friendly service - will come again!"}
{"text":"Visited this restaurant a few weeks ago and tasted a variety of their kabob plate combos. My family and I enjoyed their baby lamb chops and the boneless chicken thighs the most - moist, delicious and large servings! (we also tried the chaplee, chicken breast kabob and shish kabob). Again, the combos offered are of very good value...good amount of meat, a large piece of naan (which was a little bland and not as soft as the Indian naan we're used to) and good serving of fresh salad with every combo. 

The people working there were also very nice, welcoming and helpful. Will return and try the tandoori chicken they also offer. Note: their website mistakenly says they open at 12pm everyday, but when we arrived on Sunday, they did not open until 1pm!"}
{"text":"Oye I'd give this place 5 stars if they could be a bit faster producing the meals.

I love this place, nice fill for people with high metabolism in need of a good meal.

Good price to size quantity value. 
Good staff and service, but kitchen is a bit slow because this place is very popular for lunch, and the wait it just takes forever.

My suggestion to avoid the long wait, order ahead of time even if you are to eat right there.

The food is delicious, very juicy meat, good complimentary salad and sesame naan.
If that is not enough to fill you add a Bolanee fresh and delicioso."}
{"text":"Enjoyable dinner and really loved the naan.  The restaurant has a comfortable and open decor. We'll definitely be back."}
{"text":"we went to their other location, just opened 2 weeks ago, we were driving and stopped by, very cheap and very nice, best naan i had in years , well baked
i still had a bit of heartburn from the spices but the food was not as oily as other places, i just hope they start selling deserts soon!"}
{"text":"Amazing! Double thumbs up! It is probably the best afghan restaurant I have been to. 

Everything from the appetizer to the \"tealicious\" tea was amazing. 

Recommendations: Munta for appetizer. If you're a tea lover, the tealicious tea blend is a must try! 

Overall, if you're looking for good Afghan food, this place is a must try! Bon Appetit!"}
{"text":"I've been eating Afghan food for years and when I tried this place I was very impressed. I don't consider myself an expert in Afghan cuisine, but I do know good food when I taste it. 

It's a small restaurant in a little plaza in scarborough, probably the last plaza you'd expect to find good food in. It was redone by the food network, and I think the decor is spot on. It has exposed brick, with bright orange chairs and wooden tables. It's a mix of modern and traditional, and the eating area is always kept clean and tidy. 

I always order a grilled kabob wrap which comes in a tortilla like bread, with veggies and a really good sauce. The plates include rice and a salad and a skewer of grilled meat on top and a naan. I don't get the plate because it's too much rice for me and I can't finish it. My husband always orders a plate and he has never had complaints. We always make sure to come by this place when we are in Toronto because it's the absolute best, and to be honest the prices are pretty inticing too! A wrap is $4.99 for a huge portion of food, an extra skewer is $4.99 too which is better priced and better tasting than other places in the city. 
The chicken is always extra juicy and packing so much flavour from the perfect grill job. 

We occasionally order the Boulagnee, which is always made fresh and delicious. There is always a wait after ordering because it is all made fresh to order, and that's how I like my food. The staff is nice, they take your order with a smile and have never messed up our orders in the many times we have visited. 

LASTLY- this place would get 5 stars if it weren't for the bathroom. To get to the bathroom you have to pass by the kitchen behind the counter, and go down a steep flight of stairs. The washroom is not dirty, but it is messy. Often there is toilet paper on the floor, and water as well which isn't nice at all. It's a single person washroom, but it's just very uncomfortable to use. I don't ever use it anymore unless its a dire emergency. 

Overall, an extremely delicious, even healthy fast food option in the city with amazing prices. Definitely a place to try out when you're in the area, and I believe they have another location as well!"}
{"text":"I  order from Naan and kebab on a weekly basis
I love the service at the Scarborough location, they are always friendly and give advice on food selection.  
The food is always fresh and full of flavor

When ever I place an order it is always ready and exactly what I ordered.

I would highly recommended their breast kebab meal. It is my favorite dish"}
{"text":"Wow. What a find. Great experience. Food was wonderful and good value for money. Very clean and washrooms were spotless. Quite nice decor for an eat-in/take-out combo. Music was good too!"}
{"text":"The place is in the corner of Lawrence and pharmecy. The food was great, so was the service. I took Qabli Pulau ; wish it was a bit more spicy. Apart from the food, I must say, the interior decoration was simple, but noticeably good."}
{"text":"Took off a couple stars because of slow service and how dirty the tables were. We came in and ordered take out and it took 30+ minutes to prepare one order of chicken breast kebab. We sat at a table while we waited and it was a complete mess. Rice all over the table, empty pop cans, even a spoon left on the floor. We looked around and noticed all the tables were unkept and it wasn't even busy so we're not sure why it couldn't have been cleaned up. Besides that, food was good. Rice was dry. Probably won't be coming back here."}
{"text":"A good place to get delicious meals. I recommend everyone to try their lamb shank meal and the tandoori chicken and for people who love spicy food, try their hot sauce it's super tasty."}
{"text":"I've only been to Naan and Kabob for take-out so I can't comment on the dine-in experience.  The wait time for me is about 10 minutes and each time I'm there, it's during a quieter time where I'm the only customer.  Given that they grill the meat on the spot, I think the wait is worth it for freshly grilled food.  I've been to Bamiyan many times and I would say the wait is about the same.  If you want \"fast\" food where you order and food is ready right away I would say go to McDonald's or something along those lines (even then you might not get your food right away).  I come to Naan and Kebab when I'm in the area and feel like something tasty but somewhat healthier.  I've had the chicken kebob wrap and the tandoor breast kabob dinner and both were fantastic.  The meat is tender, juicy and flavourful.  The kebab wrap is only $4.99 + tax and so delicious.  Portion wise, it's perfect for me but not sure about a male with a bigger appetite.  Either way, it's great food at a reasonable price."}
{"text":"My experience here was very positive. Food was great. I ordered take-out and all the different parts of the dish were packaged neatly into separate boxes (I appreciated that). I ordered a typical tandoori chicken and beef kabob with rice plate. It was very flavourful - the rice was a little plain tasting (but who cares it's just rice). The salad was delicious. My one complaint would be the naan I was served was a little hard - crispy around the edges. Then again, I literally walked in as they were opening so I understand that it may not have been the freshest. 

The staff was nice too. Helpful and polite. 

Would recommend and would definitely pay them more visits in the future when looking for cleaner/healthier options than your typical fast food chains."}
{"text":"Lemme tell the truth.  This place needs a menu on the wall or sth at least. And one cashier to take orders is just not enough. Most of the people waited for at least 20 mins to just place an order. cashier will be so nice to all the customers so he will chat with each one while u wait. Beef is very not fresh. Chicken and bread are good. Very nice hot sauce. Price is fair. Well, U get what u pay for."}
{"text":"Expensive and the food is so so .. We ordered the lamb and chicken dinners. The chicken curry was sooooo not worth it."}
{"text":"i went with family--6 adults & 2 kids. it was clean, had nice background music playing. you order at the counter and pay, and they call you when your order is ready. we ordered a variety of dishes--different kinds of chicken, beef, lamb--and all of it was delicious. the meats were cooked perfectly, the seasoning very flavourful & bright. the naan was out of this world, too!
prices were so reasonable. i'm definitely going back--soon!"}
{"text":"Ever since this place opened we keep coming back for more. I can't believe I haven't reviewed this place yet! When me and my husband eat out we prefer to eat somewhere that is relatively healthy and this fits the bill. Grilled food and salad is the way to go.

The staff are friendly, cheery and helpful.

The store is cute and clean. It was on the food network as a plus!

The food is beyond delicious. Our fav go to light dinner place that's for sure. Their chicken is tender and moist and their tikka kabob are such tender cuts of beef. Their rice is fluffy and delicious and their naan is to die for.

Their pricing is average. As of late they have been relatively busy and we like to order for pickup because it is becoming harder and harder to find a place to sit.

Their washrooms are clean (although located in the weirdest spot!) and that keeps me reassured of their kitchen cleanliness practices.

Overall DEFINITELYYY go here. It will keep you coming back for more."}
{"text":"Poor customer service!  Horrible experience.   My friends and I sat down for 10 mins and nobody serve us or acknowledge us."}
{"text":"BEST PLACE TO HAVE AFGHAN FOOD! Whenever I try any new afghan restaurant, I always think back/compare their taste to Naan and Kabobs. My bf first took me here on our 8 month anniversary and ever since then I couldn't get enough of it. Besides amazingly fresh ready to eat food, the customer service was amazing, the cashier was super friendly and very helpful, and she also gave us extra sauces lol. So in all the place is definitely a 10/10. Love going there often."}
{"text":"Great food. Yummy ...nicely plated. We had chicken and steak. It was tasty and quantities were large enough to bring left over home. 


Inside of restaurant is casual but clean. Staff was friendly"}
{"text":"I should've gotten the plate. The wrap was really soggy. It was only a few min between the time it took for them to pass it to me and for us to find a seat."}
{"text":"Extrem friendly staff the waitress came so many times to ask us if everything is ok :) that's what I like the most the food was very good and didn't took so long to get it we went with 6 people and everyone got the food at the same time. I asked for some more sauce and they brought a lot to the table.the place was clean would definitely go again and recommend it for lunch dinner with co workers... keep it up good job"}
{"text":"The food here is so yummy and filling! I always leave with a satisfied tummy! The tandoori chicken plate w/o rice is my #1 choice at this cute little Afghan restaurant. I've also tried the Waziri combo (one skewer of beef and one skewer of chicken) and it's so good. I NEED the recipe for marinated tandoori chicken. I mean.. it's that good! The atmosphere is charming and the decor is tasteful and simple. 

Plus, I don't think this place has been discovered by the masses yet, hence the lack of reviews. I definitely recommend!"}
{"text":"Great food and ambience. Definitely a nice date spot. The service is a little strange, no waiters/waitresses. You order and pick up in the front (burger priest style). The restaurant could definitely benefit from actually having waiters/hostess/servers. This would make it a gem in Scarborough for sure!"}
{"text":"awesome food & service!

first time trying afghan food, and it was delicious! 

really enjoyed it here and will definitely return. 

very nice and clean!"}
{"text":"Located @ 1780 Markham Rd, Scarborough, ON M1B 2W2, Canada
Date visited : Sunday April 29, 2018

My wife and I ended up here out of curiousity, since we originally had planned to go to Harvey's since we had a coupon.  At the last moment, since both restos are located in the same plaza, we chanced to give Naan & Kabob a try.

We are sorta new to fusion type restos.  This appeared to be a fusion of Afghani Cuisine and some Indian mixed in.

Service : service was okay, staff was friendly enough.  You place your order at the counter prior to sitting down.  You get wireless gadgets to bring to your table that will vibrate to inform you when your order is ready for pickup at the counter.

Food : My wife ordered Chicken Kofta platter and I opted to try the chicken breast skewer platter.  Both dishes come with a healthy serving of seasoned rice, a simple salad (iceberg lettuce and red cabbage).  Along with a small tomato salad (there might be a specific name for this)?

My wife enjoyed her Chicken Kofta dish, she received 2 kofta skewers (lean ground chicken with onions, seasonings and herbs), I found the kofta a bit spicy.  On the down side with my dish, I only received 1 skewer worth of cubed chicken breast meat (lightly seasoned and slightly charred).  I normally find grilled proteins to be on the drier side, if they aren't well marinated well before cooking.  My dish also came with 2 large pieces of naan that were cut in 1/2 so 4 pieces altogether (talk about carb load!!).  Likely for future visits will opt for the Chicken Kofta platter as well.  The rice was moist and seasoned in a subtle fashion.  We were both stuffed after we finished consuming our dishes.  She had some left on her plate so I happily polished that off.  We took our leftover 2 pieces of Naan home with us.

Beverages : we just had water on this visit, since they serve in chilled in kewl looking bottles with caps.  Seems like something we've seen before at Ikea.

Repeat visit : yes

Method of Payment : cash/debit, credit cards not accepted, likely due to they don't wish to pay the merchant fees."}
{"text":"Good place, a little small and service is a little all over the place. Had to ask for water three times. But food is good and worth the price."}
{"text":"This place gets a solid 4 stars from me. The reason I had to knock off a star is because they don't accept credit! O_O!! For a franchise with several locations in the GTA, I was surprised & shocked when the cashier told me this. They do take debit & cash, but really? It's 2018. 

Luckily I have all forms of payment, but my preferred way to pay not being available was definitely a downer. 

Food & price: Prices are a touch high for lunch time, but the portions were fair to the price. The price range at our table was around $14-18 each before tax and tip if you're giving. No one was able to finish their meal (we're all female if that matters). The food itself was soooooo good. I like that the meals are made to order here. Meaning the meats were all juicy, tender and hot. They also gave everyone their own warm naan & dip. After coming to their brick and mortar location at markham rd., I will not be going back to their STC location even though it's closer to my work. I will most certainly be back for more of their food. 

Bottled (in a carafe) tap water is available for free, upon request if you don't want to buy a drink. 

Service: Everyone was polite and handled the lunch rush well. You order your food and pay first. You are given a pager and your receipt. You get to sit anywhere in the restaurant and they will page you once your food is ready. You pick up your food at the counter. The time spent in the restaurant was what I expected for a made to order joint. Don't expect to be in and out too quickly as the place does get busy at lunch. 

Atmosphere: The decor was nice. Seats were comfortable and plenty even when they were busy. Washroom, seating and tables felt clean and new. 

Overall: I will be back here for lunch. I may even become a regular if they keep this same food quality and service up. I hope they eventually get credit as a payment type."}
{"text":"My family and I went there excited to eat some authentic Afghan food while traveling and we had a horrible experience. 

-Started when the manager/owner started to reprimand the young lady who was ringing us up. Something about how she did it wrong and now they have to void it and re-do it. Please don't put your employees down in front of your customers. Take care of the matter and move on. It's uncomfortable for both parties.

-We got our appetizers 2 minutes before 2 of our meals, and waited another 3-4 minutes for the 3rd meal. We then had to ask them three times for our bread. All they kept saying was \"it's coming\". GET IT TOGETHER. I'm not there for a 4 star experience but McDonalds has better service.

-We spoke with the manager about the bolani (appetizer) because all it was basically all dough and no potato/onion filling. She brushed it off and said \"that's how much we put in it\". After showing her the inside of the bolani, she said \"oh yea, they didn't put much inside of this one\" then she walks away. No apologies and no mention of a refund.

A good manager/owner would take this opportunity to make their customer happy and satisfied especially after agreeing that they were in the wrong. But instead she walked away bitter and upset.

I would never eat there again and wouldn't recommend it. If you like Afghan food, find a restaurant that serves food with some flavor and taste, not just a plate full of food to make you full but not satisfy your taste bud. And above all, find some place with good customer service."}
{"text":"I found food taste is changed & it was better before
Staff should be more friendly!! 
Though the location is convenient at STC"}
{"text":"This place is the best for middle eastern food. The decor is quite chic as they were shown on Restaurant takeover. Love the big tables and the sharing of meals with friends is necessary. Their dumpling dish is a go-to item and the grilled chicken kebob plate is our favorite."}
{"text":"Great atmosphere and great food. Love coming here for the sultani kebab. The rice is sort of dry but other than that, everything is great."}
{"text":"Nicely decorated (I believe they'd been Food Network's Restaurant Takeover), clean place. Has the familiar items you'd expect at an Afghan place (think: Kabobs, rice and flatbread).

I'd only say that the meat seems slightly more bland and overcooked compared to other Afghani places I've been to. Not way off...but still a bit disappointing.

The meat is cooked to order. It makes it a bit of a wait but naturally ensures freshness too."}
{"text":"I went to this location with my family and i was impressed. We got the family platter which consisted of a variety of kebabs served on a roti/pita, with rice and naan bread. This also came with two types of sauces. The food was really flavourful and the portions were generous. The mango milkshake is delicious and it's a must with the meal!
The atmosphere is very neat and is spacious. 
The family platter is enough for 5 adults and it costs around $70 which is reasonable!
I will definitely go back! :)"}
{"text":"Excellent fresh food and fresh baked bread.  The owner's quite nice too  Great decor and love the Indian music.  I highly recommend it."}
{"text":"I got the tandoori chicken and it was DELICIOUS. so juicy and tender and cooked fresh. I didn't get the rice with my dish as they provide naan and it was more than filling. The hot sauce wasn't that spicy but went well with the tandoori chicken. Must try!"}
{"text":"Great food. It's not the cheapest food you can get but the portion is huge. There's easily enough food for 2 people if you get 2 skewers with rice. Comes with salad and their awesome naan bread.

I have been to the Sauga location. Same great tastes. Only difference is that the Scarborough location is in a really ghetto area. It's like a hidden, beautiful gem that might be doing better if they opened in a more upscale area. I really didn't expect to find this place in this area.

Like most middle eastern places, don't expect much service. They just get you the food. That's all that I ask. I like not paying tips lol."}
{"text":"The Mango Smoothies were very thick and dense.  They were quite good.

The Bolanee was lightly grilled naan, stuffed with potatoes, green onions and herbs, and served with a side of homemade yogurt.  I liked it!

This was my first time having Mantu.  This was like Asian dumplings since the styling and presentation were the same.  These were hand-formed dumplings, filled with sautéed onions and ground beef, drizzled with seasoned yogurt, split peas and more filling.  This was a good appetizer.

The Tandori was good!  It was boneless-skinless chicken breast skewer, marinated with rich ingredients for a juicy, tender, and spicy taste.

The Tandori Half Chicken, tender marinated in original fresh tandori spices, was rather good.

The Classic Chicken Breast: boneless-skinless, marinated for tenderness and succulent taste.  This was tasty!  It wasn't rough or dry at all.  

The Naan was really good too!  It was simple traditional flat bread but it was freshly baked and went perfectly with the other dishes.

This Firni dessert was an Afghan pudding of milk and starch flavoured with cardamon.  It wasn't too sweet."}
{"text":"Very good fast food. Had the tandoori chicken. Well prepared good value.  Stumbled across this in a plaza. Could be the next Middle East franchise who knows. Healthy food good service. Naan bread is much to be desired. Walmart like but everything else was good. When it comes to Indian food Naan bread makes the meal. Otherwise we would have given it an extra star."}
{"text":"I ordered a shish kabob with brown rice, Naan and a salad. First impression of the restaurant was their beautiful interior Afghani/Modern design that actually makes you feel like your in a really expensive High-Class restaurants but Naan & Kabob's food prices are super affordable. 

Their employees are super nice and feels you feel like your a valued customer to their restaurant and I got my order in less than 10 minutes! 

I started to try out the shish kabob I ordered. I must say, It was the best shish kabob I have ever tasted. It's juicy, full of flavor and provided a premium quality taste.  I definitely would try their shish kabob If your coming for the first time in their restaurant. 

Everything I ordered was super fresh and tasty. The naan was amazing, The brown rice was made perfectly with tasteful seasonings. and their salad was spot on. 

Overall experience was absolutely wonderful. Great customer service! I will definitely come back for my next visit to Naan & Kabob."}
{"text":"I came here with my family for dinner, and I was excited to try the food after seeing so many good reviews. The decor is modern, clean, with Afghan accents dispersed - definitely stands out for a restaurant in a strip mall in Scarborough. Unfortunately that's the only thing that sets it apart from all the other restaurants... it leaves me wanting more. 

Food: 3/5 
The food is A-OK... it could  be better. The mantu was 5/5, and we loved every bite. The kebabs could use a bit more love. The rice was fine. The rice:salad ratio felt a little off, as I had a heap of rice on my plate, not enough salad. Overall, I found the taste to be bit more on the bland side. I expected more. 
The naan... I didn't love. Maybe I am used to the Indian butter naans with the different textures, and this one was mostly bready and not much taste to it. 
Overall - the food could be better. 

Set up: 2/5 
The ambience is lovely, and when you walk in, you expect to be greeted. But no... it's self service. You place your order at the counter, pay, and get a buzzer for when your food is ready. It's casual (and I have no problem with that) but it's a bit annoying when you have to go back and forth from your table to the counter to get your drinks or cutlery that the staff forgot to give you. There were quite a few take out orders, so the girl at the counter was busy, and it's definitely not her fault. They really should have another person as food runner/ host/ busser. 

Overall, I really wanted to like this place, but somehow the elements just don't fit well. It's a tad pricey for self-serve, o.k. middle eastern food. I'd rather they charge an extra dollar across the menu, and hire a server/host for basic front of the house duties.
 
Also: CASH AND DEBIT ONLY."}
{"text":"I really want to give this place 4 stars, but the service is so inefficient, it would be a complete lie.

This was my second time ordering. Both times I ordered for take out, although this time I called ahead and ordered for pick up so that I wouldn't have to wait 30-45 mins for my order to be ready.

So I get there and my order looks ready but then I realized I needed to add to my order, which I do. I'm told it will be awhile before this one item is done. Fine, I expected as much after my first visit.

However, I got charged more than what was on the menu. When I mention this to the cashier, she tells me the menu I'm holding is old, pulls one from the back of the pile and says the prices have changed. She didn't offer to even give me the old menu prices when there were several copies of that menu there for customers to look at. That's not to even mention how off the prices are on their website! Soooo yea, not too happy about that. Or how slow they are in the kitchen.

I've tried different kabobs (chicken, tikka, beef, lamb) and they are okay. It's a bit dry. I haven't tried a wrap, but my dad really liked his chicken wrap. I enjoy the bolanee, which is described as a naan stuffed with potatoes. I wouldn't really call it a naan, but one order is enough to share between 2-4 people depending on how much you like to eat.

I tried this appetizer, the mantu, which are Afghan beef dumplings. They were sooooo good. I've decided I'm only going to get apps here. And I doubt I'll ever order in store again, for take out or dine in. It's way too inefficient for my liking. I will just order for pick up."}
{"text":"What to expect...  

Fast-food type atmosphere but decor is modern casual,  very casual.  Prices don't reflect this though. Be prepared to pay $12-$15 per meal item.  Serve yourself basically!  And don't expect Afghan hospitality because you won't get a trace of that!  They may even seem rude given the lack of personability. Seemed only to have two-three people working- one on register and one-two in the kitchen.  Service is bound to suffer. 

Clean and hygienic place.  But, don't touch the railings or walls on the way down to the washroom.  It was gross!

I go here for the Mantu and Bolanee.  The dugh isn't bad either.  But the rest is nothing to write home about.  It lacks flavour but not spice (for Afghan standards)...  

The last person I went there with said there were other places much better.  I have had much better priced catered food that was unbelievable in taste and value.  Depending on the item, it's hit or miss here.  Meat items seemed dry. Still I would say, it's worth a try!"}
{"text":"I have been trying to eat a lot healthier these days and as a result I'm hooked on Afghani food specifically kabobs.

So I decided to check out Naan and Kabob based off a recommendation from a friend from Afghanistan.

I decide to go with the Chicken Breast Kabob with rice ($9.99), it comes with two grilled skewers of marinated boneless pieces of chicken breast with rice, diced tomatoes and shredded lettuce and a naan bread. If you want the more traditional Afghani rice served with fried sweet carrot strips and raisins, it will cost an additional $2.00.

The rice was nice and moist but nothing special. The lettuce and tomatoes were crisp and fresh. The chicken breast kabob was nicely seasoned and tender. The naan bread was whole wheat, lightly toasted and soft. The chicken breast kabobs were good but I still think Afghan Village does the best chicken breast kabobs from my experience.

If your looking for authentic Afghani food in Scarborough, I would highly recommend Naan & Kabob, keep in mind I only tried the Chicken Breast Kabob dinner and there are many other traditional Afghani dishes on the menu that I have yet to try but look really delicious based off the pictures on their menu.

The place is small, the decor is really simple and from what I could see, the place is really clean."}
{"text":"Well what do you get when your restaurant gets a makeover from professionals? Naan Kabob

As avid purchasers of the Missoula location when we moved east we were pleased to know one of our favorite restaurants was still a short 5 minute drive away.

Having sampled the food from both locations I can conclude that there is zero difference in the food or portions which is no easy feat for multiple locations to accomplish (cough McDonalds) 

The only critique I have about this location is that when you call it's a pain to get a take out order today (Jan 16) is the first time I have ever been asked for my name or phone number despite the fact the restaurant is ALWAYS busy. 

It's seems that for all the excellent food they serve and the remake of their brand the same lack of common customer focus that plagues bigger chains and franchises may lose them customers in the future"}
{"text":"Loving this naan and kabob option in the new food court.  Fewer options than their sit down restaurants, but the food is fresh and fairly justifiable for the plates, which are about $10. 

The mantu is pricey, but delicious. Mantu is like a steamed, wonton-esque meat-filled dumpling topped with yogurt, hot sauce, what I believe was lentil curry, and cilantro. They're 5/$6.99, or 10 for $9.99 or $10.99 (I forget). Lots of flavors going on here. Goes really well with the naan from the plate we ordered.

The plates are fairly customizable. They have two rice options and four veggie options. A choice of protein,  rice, one veggie, salad, and naan come with each plate. I got the kofta kabob plate ($9.99) with the basmati rice with golden raisins and shredded carrots, and the sweet and sour eggplant. The kofta was tender and flavorful. There were two skewers of it. The skewers were thinner than I'm used to, but I'll survive. The rice had a hint of cinnamon and I love re-hydrated raisins in rice. The sweet and sour eggplant was also delicious, and not particularly strong on the sweet and sour flavors. However, went amazingly with the rice. The salad was fresh and the mild salsa and the white sauce that went with the salad (and everything else) were tasty as well.

Service is fairly friendly, and either they're grilling the kabobs to order, or they just don't display them in the hot table at the front. 

Total cost for the mantu (5 pc) and the plate was $19.19 after tax. That fed two people for lunch with a tiny amount of leftovers.

Once again, I love that this is in the food court at STC. I'm not at STC a lot, but if I'm back and I'm grabbing a meal, there's a good chance I'll be back."}
{"text":"I really liked this place. It's unassuming, but the interior is pretty modern and chic (decor and seating arrangements) and it's low maintenance which I like. You order the food, and everything else is self serve. You get paper plates, cups and everything else up front and they give you a jug of water for free which is great. I hate relying on the waiter/waitress or someone behind the counter to get water. 

For the price, they give you a ton of food, and for me to say that is saying something because I eat a lot. Big heaping plates of rice and meat. I got the chicken tandoori and kabob. The chicken was actually some of the best chicken I've had. It was really juicy and tender and perfect consistency and texture. The beef kabob was also very tasty, the flavors were really bold. This is definitely on my list when I'm up in Toronto."}
{"text":"My boyfriend and I decided to give this place a try since he loves Afghani food and I love the food network (Naan & Kabob was featured on Restaurant Makeover in Nov '12). I don't know what this place was like before, but I'm so glad we gave this place a try because it is now one of our new favorites. 

When you first walk in the decor is lovely, very simple and clean. Ordering was a bit of a task at first, since it took us a minute to realize this was not sit down service and that you have to order your food then take a seat, fast food style. There is no menu board, you just order off of their takeout menu. Not to worry though, the people working behind the counter are very friendly and helpful, the service was excellent.

We both like to eat healthy but I usually find Afghani food either too bland or too dry, the meat being overcooked at times. Definitely not the case here where everything was so flavorful and the meat very juicy. We wanted to get a feel for the entire menu so we decided to sample a variety of dishes that allowed us to do so including the Mantu, Waziri, and Sultani. Our total with 1 can of soda was $34. It was A LOT of food but we over-ordered on purpose because my boyfriend likes having leftovers. 

The Mantu appetizer was a steamed dumpling with ground beef and lentils and was SO delicious. I only wish it was bit spicier, but then again, I tend to like my food VERY hot. The next 2 dishes allowed us to sample the chicken breast kabob, shish kabob, and the tikka kabob. We couldn't decide which was our favorite. The meat was all perfectly seasoned and grilled, tender and juicy. Our dishes were served on a bed of brown rice (which I LOVE, because you rarely ever see anything but white rice at any middle eastern or asian restaurant) and with a side salad with a really tasty, creamy, yogurt-based house dressing. 

The food was all so good that we found ourselves with cravings, wanting to go back again the next day. The food plus the ambiance and the excellent service makes this place a definite winner and we will absolutely be returning again and again."}
{"text":"Heard alot of good reviews about this place. Not what i expected. I ordered the sultani kabob and it was just average. Meat is kind of bland and the rice was okay."}
{"text":"Count it a BIG blessing to have foodie friends who can recommend eateries for you to check out. Our friends were the ones to first introduced us to Naan and Kabob: we had take out and I devoured the shish kabob (ground beef) and Beef Tikka (veal sirloin). I knew I had to visit the actual place after glancing at their enticing online menu.

This is a beautiful eatery, but don't misunderstand: this is NOT a sit down restaurant with full table service. You order at the counter, seat yourself then pick up your order when it's ready (you get a pager). Food comes out in about 10-15 minutes even with a steady steam of customers during a weekday lunch period. Staff is friendly and helpful and they do check on you while you're eating to make sure everything is alright. 

RECOMMENDATIONS:
- Shish Kabob (seasoned ground beef)
- Chopan Kabob (marinated, grilled lamb chops) comes with yummy rice and a small side salad. Not a fan of the taste of lamb, this was hubby's meal, but it was super tender!
- Beef Tikka (veal sirloin) nicely seasoned grilled steak cubes.
- Mantu - square dumplings with sautéed onions and ground beef topped with split peas and drizzled with seasoned yogurt.
- Naan - much thicker than Indian Naan: crisp on the bottom and soft on top. Best eaten as soon as you get it.

It was apparent that the food tasted much better dining in, as opposed to getting take out and waiting till you get to work/home to eat it. Well seasoned, filling food in a beautiful and clean setting: Naan and Kabob is a delicious alternative to fast food."}
{"text":"Friday, Awesome, food is so delicious; I ordered with a brilliant woman chicken curry (kuri) was 11.50 including tax for salad, such tasty chicken and brown rice, I generally hate brown rice so not sure if this is coloured white rice or if they've mastered this either way damn good. 

I'm Indian so I missed my green chillies however there was no taste missing.

Saturday update, if you didn't know now you do - curries always taste better the next day. 

NO CREDIT CARDS"}
{"text":"Cheapest location of NnK in the GTA. I got the plate and asked for a spoon of chick peas - they charge like $2 for that, unreal. The staff are also very stingy when serving plates. Food is ok, definitely not as good as the other chains."}
{"text":"It has been some time since they opened now and the service and times have improved quite a lot. It is a much better experience now and the food still tastes great."}
{"text":"Naan & Kabob is an Afghan street food restaurant in Scarborough. It feels more like a fast food restaurant but the food quality definitely doesn't feel like one. 
We ordered the Ramadan platter for the hungry group and they were unbelievably good! The grilled chicken was really juice, and the spicy beef was just right. Even the rice with carrots and raisin was super good. 
Definitely a good find!"}
{"text":"The food is okay, we had a few different kabob dishes and they tasted just alright. Definitely not worth the money and next time we want afghan food, we'll go to Kandahar Kebab. However, the mango shake and mango soft serve are absolutely amazing- we would recommend stopping by just for this! Restaurant setting is lovely, though, and the servers are nice."}
{"text":"Absolutely delicious! 

We've tried this place 4 times since first review, and always takeout. They do have seating area, every time we went to pick-up they'd have a group of people.

We normally walk and order, sometimes call ahead, and we've found calling ahead is the best option.

We've tried Mantu, Waziri Kabob, Waziri Tandori, Beef Tikka, and of course Lamb shank and Qabli Meat with Veal. Every order is always fresh, authentic, and just delicious. Yogart and mango drinks made in-house are fresh!

The team working kitchen/ordering are outstanding, and you can tell they work well together which results in great tasting food at affordable prices! Qabli Meat with Veal for $10.99 is ludicrous - because it's worth $20 no questions asked. 

You MUST try this place if you want authentic Afghan specialties made by wonderful people."}
{"text":"Absolutely delicious.  Always very fresh and tasty.  Friendly staff.  Modern décor.  Our new go to spot for afghan food."}
{"text":"Had enough recommendations to try this place out from my Desi Muslim friends so I had to get here to find out what the fuss was about.  They all mentioned to me that this place was like Bamiyan Kabob so I had to be the judge on that.  Could it taste as good?  Let's see.

We arrived Saturday afternoon at around 4 PM.  The restaurant is located in this dingy plaza on the corner.  We entered and it had a nice setting.  It was not busy at all.  They do not take credit cards, only debit or cash.

I ordered what I usually order from Bamiyan and was the Half Chicken Dinner with Rice, my absolute favourite.  It was also the same price as Bamiyan as well.

It came out within 10 minutes and I picked it up from the front.  Coming back to our seat, I was totally excited.  Looked amazingly delicious, just like Bamiyan's.  And it was.

There was something about it that tasted different though and for once, I can't really describe it.  It had something like more of an oily taste to the chicken.  I don't know, I just was really impressed by how it was made.  The dish I felt was more tasty, spicy and juicy.  Bamiyan's was a little more dry and blander although their salad and salsa was a bit more grander (ha! Another rhyme!).

At any rate, I gobbled it up and still had left-overs to take home.  I will most definitely return here and maybe even the Mississauga location which is close by to my parents' house if I ever feel the craving for some commercial Afghani food."}
{"text":"Out of all the Nan kabob places in the nearby vicinity, this one falls at the last. I have tasted chicken Tikka and rice and it falls quiet short from their competitors. Even the rice is of lower grade in my opinion but the place has a nice decor. Unfortunately the food wasn't memorable enough to warrant a revisit."}
{"text":"Good food!! Nothing special in the menu....just common Afghan dishes. The food is flavorful and worth the money. Overall its a decent place for a good lunch."}
{"text":"Great place with the great tasty food! I have recommended this place and I myself keep going every time for a quick bite. Price affordable!"}
{"text":"Cash only. Nice place, not dirty or run down inside. 

Food is great. Meat is flavorful and juicy, bread is fantastic."}
{"text":"I like kabob but many restaurants cooked the meat very dry . This was my first time having the kabob which was soft and juicy . The naan was very good too. It was soft and tender. It was very different which I tried in the past .  Most of them are dry and hard. The price was good too. Sure will come again"}
{"text":"Pros:
Good portions
Meats grilled very well

Cons:
Not a true restaurant in the sense

We were looking to try a new place for lunch and my wife suggested this place.  I think she had read about it from one of the blogs she frequents.  You've probably seen Naan and Kabob at a food court somewhere before.  This location is a stand alone they've opened.

So first things first, they've really kept the food court approach when it comes to this place.  You come in and you seat yourself.  You order at the front and they give you a pager.  When it rings you come back to the front and pick up your food.  There are rare instances where the staff will bring the food to you though.  

I ordered what basically is a mixed grill platter and my wife ordered a beef dish.  The portions here are pretty good.  They also give you a lot of rice.  If you're a big eater like me, you like that very much!  The taste was amazing on the meats.  You could really taste the different spices they use on each one.  The grilled chicken was very juicy too and never dry.  It was very enjoyable to the last bite.

Even though it's more a food court feel, the staff will still come by a couple of times to make sure everything is alright.  I found them very helpful and friendly throughout our meal here.

I would totally recommend Naan and Kabob to anyone looking to try something new.  I'm not sure if the food court locations are as good as this one is, but this stand alone is a very good bet."}
{"text":"Chicken breast kabob wraps, chicken breast kabob dinners and all the other dinners are consistently good. The one complain I do have is that their wraps are always falling apart and tend to be bland tasting so ask for hot sauce. This location is small and seating tends to fill up quickly during the main lunch and dinner hours."}
{"text":"Really liking how they opened a Naan and Kabob in the mall. Very convenient while shopping and a great option for those looking for good halal food. 

We ordered 2 chicken breast Kabob rolls with a bottle of water that came up to about $18, pretty pricey. The chicken was stuffed into naan that didn't taste fresh. The chicken though, was nicely grilled and had fresh tomatoes, onions and sauces to go with it. I think the wraps at the actual Naan and Kabob restaurants are far better. Will go back here to try the plates."}
{"text":"This location is nice, big and very well decorated. We ordered the Chicken Kabob plate, Bulani and Chicken Kabob wrap. Everything tasted fresh and yummy. Been here quite a few times and they have always been consistent with their food. This time around we tried the mango smoothie and it was the best! Just the right amount of sugar and mango. Will continue coming as the food is always good every time."}
{"text":"Comes next to my favourite Bamiyan, I've had their veal, chicken and tandoori chicken dinners and they've all been cooked tender! They're also generous with their naan but I find Bamiyan's fresher since it's always hot when we get it."}
{"text":"Would I recommend this place??? 

Only if you were Mother Teresa or Ghandi reincarnated.

We went as a party of 3. Nice and clean locale, not too busy. Ordered the 
Qabuli Palau, tandoori chicken and regular chicken kabob.  I Also ordered  Bolanee, lettuce salad since the Qabuli doesn't come with lettuce salad, it came with chicken curry.
To start... there was a whole lot of confusion getting the order through the cash machine. They didnt  add all 3 dishes, so had to ring it through which lead to them billing us again twice. They fixed that. We went to sit... waited for our meal...3 plates showed up. We waited a bit for the naan for a bit. We asked what happened to the bread , said they'd bring it to us.  Since I had asked for my salad, I went back up again to get it.. I get a mixed salad with the  tomato chutney that comes with all the meals. I say that's not what i ordered. i just wanted a salad that had  lettuce white dressing and cabbage.. I:m given the salad again... there is no cabagge. At this point Im so angry.. Im almost done my food , I haven't received my bread nor is the salad right.  Finally get the chicken curry... its floating in oil....almost done our meal... we get up again.. I see a tray of bread... I ask is that mine? The girl says she doesn't know.  bread is cold ...now  I'm  mad.  But thirsty too.  my husband gets up to ask for a mango shake, poor guy comes back with a warm mango shake!!!!!!!!!!! A WARM MANGO SHAKE!!!! WHO DOES THAT?????? I go back to the counter and I ask.. are you serious? Im paying for the tiniest  cup of mango shake and its warm... not room temperature. WARM.  'Oh yeah, you are right, I'll make you another one\" no apology, not even batting an eyelash... total fuckery and no acknowledgement.  I decide... McDonald's next time. I know that when I get the tray all my food will be ready for me... I wont have to get up  countless times to remind them that they gave my order incomplete. The taste? Its okay, but doesn't compare to other places I ve been to."}
{"text":"One of the best Afghan restaurants in Toronto at really good value. Considering that a standard fast food meal these days will run you anywhere between $8-12, getting food of this quality from $10-$15 is definitely worth the few extra dollars. 

I really enjoyed the ambience of the restaurant, it's not too busy or loud and it's very relaxing and enjoyable to sit in even while waiting for your food. There's a  Naan & Kabob sign either directly facing you or adjacent to you which is nicely designed and not too bright. The service was fast and friendly and they always ask you if you'd like more sauces for your meal even without you having to ask.

My go to dish here is the chicken tandoori plate which comes with rice, salad, and naan bread. You can top it off with red chutney sauce (highly recommended) and their white dipping sauce for chicken and kebabs, adding both of those to your dish takes it from great to mind-blowing in my opinion. Overall, there's a good balance of everything on the plate. Generous portions of rice, plenty of salad, and most importantly at least 5-6 pieces of delicious tandoori chicken.

It took about 7 minutes for me and my friend to get our meals which was more than fine. You're getting relatively fast service and a great filling meal for about $14 including taxes. Not shabby!"}
{"text":"Yum. I had a mixed platter all to myself. Good enough to serve two people. Around $15. Also had the mango shake.
Very tasty food. Well seasoned. Very very well seasoned.

Good service. We came during an iftar and they were very active with serving the customers although it was crazy loud and busy. They were very friendly and came around to check to make sure we were pleased and asked if we needed anything.

They brought us chilled water in a nice serving bottle when I asked for some water.

I would return and I would recommend this place. 

*By the way they only take cash and debit. I hope they soon take credit card."}
{"text":"A decent spot for your kebab fix.  In the the few times that I have been there I had ordered mainly the Tandoori chicken and the Chapli kabab dinners.  Both are somewhat average, with the latter being more on the dryer side.  Flavour wise not a whole lot to write home about with the chicken being somewhat neutral and the chapli being slightly more flavourful than Bamiyan.

Service is usually pretty quick, so when I am in a rush for some protein it's not a bad option.

3 stars"}
{"text":"When this restaurant opened, they were giving reasonable portion sizes. But now the portion size has reduced by half. Their food is not as great as Kandahar Kabab, and the rice is very oily for my liking. I don't go back to Naan and Kabob anymore."}
{"text":"Naan and Kabob is conveniently located at the Corner of Markham Sheppard with ample parking. 

Plenty of seating if you choose to dine in. You order from the counter and given a buzzer that will let you know when your food is ready.

Shish Kabob ($9.99)  - Two skewers of ground beef Includes salad & fresh naan
Doogh ($2.29) - Traditional mint yogurt drink

Carb heaven and enough to feed 2 people. 

Service was fast and friendly.  Cashier did mix up my order as take out as I prefer eating in. She did apologize for the mixed up."}
{"text":"I'm glad I reviewed this after the transformation. It was still quaint, but the renovations have provided more comfortable seating with their booths.

The menu is very extensive compared to before. Before, they had predominantly afghan dishes but now it features some Arab and Indian entrees or appetizers.

The food is absolutely delicious. Plates typically come with rice, meat, salad and bread. The carbs themselves are perfectly done - Afghan rice and bread are murderous (in the best way). Kababs are seasoned well, juicy and fresh. I particularly like the chicken breast kabab and beef kabab, which is why I usually opt for the Waziri classic. If you're sharing with someone else or want more variety, the N&K grill has 3 different types of meat. If you haven't ever tried it, the lamb shank with carrots & raisins is a treat and a definite staple of afghan cuisine. Also, the mango smoothie will complete your life! I'm ashamed to say it, but I drank both my own and my friends in the same night. Please don't judge me. 

Not to mention, if you've got quite a few people they also have the family platters for 4-5 people. The price point is amazing. There was 4 of us who split it and there was still a lot of food left over. I'd say you could share the food comfortably among 5 or even 6 people. The family platters also come with many different dishes so you get to try a variety.

Only thing that's lacking somewhat is the service. You go up to order and pick up your food, which is fine. However, I always find that I get up at least 2 times to ask for something else whether it's napkins, extra cutlery, water, etc. I hate taking breaks in between inhaling my food so it can be annoying, but nothing that turns me away."}
{"text":"Okay, so I can def. say I have tried better. One thing I would probably come back for is the mango shake. It was absolutely delicious! The food.. not so great. As amazing and delicious as the food looks, it did not taste like that. The rice tasted like it wasn't done well, meaning it tasted so watery. The tandoori chicken was not horrible, yet not amazing. I feel like the plate did not have flavour to it at all. Thank god for the salad and naan. The naan was good, and done well. 

The staff were friendly, however throughout our lunch, we only got asked how we were doing once. Also, they did not give us water (I realized that a customer a few tables away had a glass water jug infront of him once he received his meal)."}
{"text":"The decor was nice made for a really comfortable setting. You have to order at the register. I ordered the Sultanj and Kabob which is 1 skewer of beef tenderloin and 1 shish kabob. I got mine with rice for an extra $2 so it came to $12.99. Meat was tender and flavourful. It came with a large piece of naan. The side salad and what I can describe as pico de gallo was really refreshing and tasted great with the rice and meat. Let me tell you the portion sizes were huge I couldn't finish my naan. I liked my dish however I had a bite of my friends tandoori breast kabob and that was way too spicy for my liking. But if you like spice then that won't be a problem."}
{"text":"Haven't tried Afghan food before but it is awesome! Very similar to Irani food but they have a bit of a twist with things like Bolanee and Tandoori chicken. Highly recommend for calm lunch in a spot with very modern/simple decor. Prices are reasonable as well for the large portions they give you. Free wifi was available at the time I went in case you want to being a laptop to work on a few documents."}
{"text":"Best Afghan food in North America. Chicken was perfectly cooked (soft enough to cut with a plastic knife), bread was fresh out the oven, and rice was warm and soft. Definitely doesn't get better than this."}
{"text":"Delicious food. Quick takeout. Clean restaurant. Friendly service.

Overall a great restaurant!"}
