{"text":"In order to justify the dilution of the already over saturated Vietnamese restaurants downtown, this new addition will have to be pretty darn good... which it is not. It is okay. Okay food for more cost than the other surrounding options (with smaller portions) is not going to cut it. I really like Vietnamese food and this restaurant (if not surrounded by other places) would be a decent place - but I will likely just go back the pre-existing options already struggling for our dollar."}
{"text":"I've visited the restraunt 3 times, and liked it successively less each time. The spring rolls were the busy part of my Bun. The meat tasted old and was smothered in sticky sweet sauce - with no lemongrass flavour. The staff are friendly and fast. Edible, but not worth the money."}
{"text":"I would have given NAM 1 star however I have frequented it multiple times and normally it is quite good.  This past time I visited (it is just down the street from my place) was terrible. I had the beef pho. The broth which is generally a good consistency was brutal.  It was essentially slightly brown water. I can confidently say that because I watched them water down the broth. Also, the beef could barely cook in the broth because it was lukewarm.  For a pho place, it is quite expensive and therefore i expect to get good quality food each time.  This past time was a complete disappointment and I will likely look elsewhere for pho downtown."}
{"text":"Had the Sate Beef Pho and was average. Nothing super exciting or to make me want to return if I wasn't in the area but didn't feel that it was as good of quality as other Pho in town."}
{"text":"The Pho definitely hit the spot on a cold winter day.  While the broth is not the most flavorful I have tasted in Calgary it is still worth stopping in for a nice bowl of noodles."}
{"text":"Fantastic Pho - the Satay Pho was really flavourful and had a nice spicy kick to it (the sauce is not as heavy as the traditional satay peanut sauce, so the Pho kept its usual soupy consistency). The salad roll was nice and fresh and plentiful with prawns. The staff were great...definitely will be going back to try more off of the menu."}
{"text":"A couple friends and I were hunting for a quick meal on a Friday night. We stumbled across NAM and decided to check it out. We got them right before closing, but they couldn't have been friendlier and accommodating. I always feel bad going to a restaurant right before the end of the night, but the fact that they didn't rush us in our decision making left a great impression. 

I got a Beef Satay Vermicelli bowl. It was huge! The whole dish felt very fresh (pickled carrots are my fave) and was quite delicious.I will definitely return next time I'm in the Beltline area."}
{"text":"My first time here I ordered Beef Satay Pho, and they give me chicken even if they phoned back to ask if I wanted the beef cooked or raw. And I come in and they're still saying chicken when the cashier corrected them and said it's supposed to be Beef. They just ignored the comment and still give me chicken. Really annoying and inconvenient if you don't have that much time on your lunch break. There is no time to \"exchange it\". Not coming back to this sub-par Pho place. Probably better to eat in then take out so they can fix their order mistake right away."}
{"text":"AMAZING FUCKING SOUP!!!!! 10/10 would eat a million times again. Super espice. Burned esophagus. Tums/pepto required."}
{"text":"A-Okay Vietnamese food at NAM.

Cute name, cute restaurant, decent Vietnamese food. 

Hopefully this will turn out to be a great lunch place for the working Beltline.

T."}
{"text":"The interior is very modern.mediocre vietnamese food for its price,ive had better viet food.its not the first place i would go for if ur craving for a good vietnamese food"}
{"text":"This place was discovered by my \"foodie in training\" So, when I went to go try it out for myself I must say I was quite impressed. 

The restaurant itself is super cute inside. Clean, stylish and modern but with a Vietnamese flair.

I ordered a chicken satay vermicelli bowl and we sat down at a long communal table. The tables already had every sauce you might need for your dish (sriracha, hoisin, fish sauce etc.) which was handy! 

When our food was ready a friendly kitchen staff member came out and delivered our food to us. I found my bowl to be full of flavour and quite a large portion. I would definitely come here again, it could even become a fav!"}
{"text":"Environment: Modern feel with a touch of vietnamese culture. The place was very clean and tidy. 

Food: The food is excellent! By far, the best vietnamese food I have had in Calgary. The Pho dish was quite delicious and flavourful. I ended up sipping the entire broth, which I tend not to, but I made an exception with their Pho because it was that good! The appetizers were also very delicious! We ended up ordering all their spring rolls and 1 fresh roll. I would definitely come back to this place and again and recommend it to my friends.

Service: The servers were quite friendly and the service was quite fast. They were very knowledgable of what to recommend for my friends who are first timers with vietnamese cuisine."}
{"text":"Minimal decor, barely noticeable signage and an endorsement from Duncan Ly makes for a great new spot to get pho craving satisfied. 

Went here the other night after not realizing it existed. Its located kiddie corner to Mountain Equipment Co-op and next to Sucre (a new French bakery). You wouldn't notice it as their signage is tiny and high above the average pedestrians line of sight. 

The decor is very minimal. Seating for about 20-25 max in there. We went at 6pm for dinner and it was fully occupied. You order and pay first at the counter and they bring your food to you. 

Lets get onto the food: We orders the Beef Sate, Chicken Vermicelli, Beef salad rolls and shrimp salad rolls. 

Price: $40 ($13 entrees and $7 appetisers). Yikes you might say. Vietnamese food typically doesnt command such a premium. But this was worth it IMO. 

I personally had the Beef Sate and it is hands down my new favourite in the city. Besting places like Basil and Pho Dau Bo. The aroma of the broth was delightful. Had a slight char to it. The flavours of the soup was delicious. It doesn't have any coconut milk in it like other restaurants, which is what I prefer. I basically drank all the broth after I was done. 

Salad rolls were ok. Same as any other place. The rolls could've been tighter. They were a bit floppy. Fill em a bit more and roll em tight for a better looking roll. Shrimp was the same. Beef was a nice alternative. Beef was marinated and very tasty. I'd go for just the Beef salad roll next time. 

My wife said her Vermicelli bowl was nice too. Her comments was the spring rolls were nice and crispy even after she doused it was fish sauce. 

Overall a great new place to try out. In the area you also have Tao and Balo for Vietnamese but I can tell you that Nam is much better (although a bit pricier). Heard they have an app too. 

Will be coming back again. Thanks!"}
{"text":"I stopped by this place at random using Yelp as my guide. My god am I happy I came here! This place has the best beef and meatball soup I've ever tried! The broth, the meat, everything meshes together for perfection like no other. I don't wanna try anything else now, what have they done to me??"}
{"text":"Seems they've opened a smaller outlet in Market Mall in the past 6 months or so, and so thought I'd try their sate beef noodle soup. 

Nothing to write about or return for. Is so watered down that my request for more flavour or after the addition of their sauces did little to improve it. 

Am so sick of mediocrity in mall food courts: also steer clear of the fake thai and korean kiosks run and cooked by chinese. 

Instead, at Market Mall food court, I'd recommend that people try Bourbon Street or Wok Kitchen for mixed meat and veggies not far away, or DirtBelly across the court. Or walk to Moxies for a decent steak sandwich."}
{"text":"Really like this place. They do a $13 rice bowl with chicken or steak. I've got that all three times I've been there. Good for lunch and dinner."}
{"text":"I'm hesitant to leave this review because right now I think this is a little hidden gem. But I can't help sharing this awesome place!

Best pho I have had in a long time! I've been twice and tried both the beef and chicken satay pho and both were excellent. The broth is amazing. Also had the shrimp salad rolls which were tasty and fresh. Will be coming back here whenever my pho craving hits! The environment is modern and clean. You order at the counter and they bring the food to your table. Service was very fast and very friendly both times (one time was also during the weekday lunch rush). Highly recommend this place! Online ordering too!"}
{"text":"Nam Vietnamese Kitchen is \"fast food pho\" pit stop on 8th Street SW.  Food is ordered at the counter and served to your table by staff.   Probably best for lunch, or if you can't get to somewhere more authentic... for whatever reason that might be.  

The menu is simple, the staff are nice, and the space was modern and clean.  I stopped in at about 5-ish on a Sunday, which is likely not a peak time.  It got busier after I arrived.

I ordered the beef salad rolls and the chicken satay soup.  Both were fine."}
{"text":"Clean fresh and modern! Great food and great service! It was worth hopping on the train for! Beef satay was to die for!"}
{"text":"Found this place while wandering around looking for a place to eat during CUFF and was very pleased!!
It is very small inside but one of the more modern looking Vietnamese places. The menu is simple and small (assuming this place gets pretty busy). We were there on a Saturday at about 7ish and it was empty (which was great). Service was great and the food came out very quickly. 

Prices were a little more expensive than usual but definitely worth it. Tried the satay beef pho and it was ridiculously good! Very rich and the spices in it were extraordinary.  

The only reason it does not get a five is because they were missing the little red peppers (which are a must for me in pho) and because finding this place was a little difficult. Other than that, I would highly recommend this place for pho lovers! It was definitely in my Top 5 for sure!"}
{"text":"I have a standby favourite for Vietnamese dining in Calgary but I am always on the lookout for something new and preferably close.  There are great options in the south and north east but not much in my NW central hood.  Being right in the Beltline this location is great for me from home or work.  The restaurant itself is small with limited seating so you may find it better for takeout but that's okay.  I ate in on a Saturday afternoon.  It was a bit busy but one of us snagged a table while the other ordered.  The menu is short sweet and to the point but offers exactly what you want.  Buhn or Pho.  Noodle or soup.  Meat and vegetarian options and sauces add some spice.  Licensed so you can have a beer too or stick with a good selection of pop, tea or juices.  I had chicken beef and shrimp with vermicelli noodle.  The veg was crisp and fresh, meat grilled nicely and the noodles were perfect.  Service was fast and very friendly.  We noticed they were quick to tidy up when someone left and the floor was being swept quickly too.  Bathrooms are big and clean!   I think I found my new favourite for Buhn and Pho downtown."}
{"text":"I was in town for work and decided to give this place a try. This restaurant is very clean, modern and the food was absolutely delicious! It's some of the best Vietnamese food I've had. It was so good I came back a second day. On top of that the service was outstanding. I look forward to coming back when I'm in town again."}
{"text":"I was really hoping that this place would blow my mind on account of the fact that it's so so close to home. It's located in a very modern building, and the décor and style was modern, tasteful, and comfortable, unlike most Vietnamese restaurants that tend to be a little less clean. 

It's a walk up to order style restaurant, with a very small menu - which generally means they make sure each item is done very well. The staff are friendly and service is fast. 

To me, the mark of good Vietnamese food is how well they do their pho, and specifically the broth. On my first visit, I opted for the Beef and Beef Balls Pho ($11). It was a much smaller bowl than I'm used to - probably 65% the size of most phos I've had, which is fine if its delicious. I also liked that instead of chopped green onion, they had shredded - that was a great touch. The broth - was actually pretty good. It wasn't too salty, and there wasn't one particularly overpowering spice that I could identify. Both the beef and beef balls had not much to note besides the fact that it seemed reasonably fresh. 

Overall, while the broth was pretty good, I found the pho to be generally unremarkable and didn't leave much of an impression, which if you consider the high price and small portion size, makes it a challenge to be enthusiastic about this place. 

Don't get me wrong - I don't mind paying a bit of a premium for proximity, a modern feel, and cleanliness, but it's hard to justify paying extra for less food, especially when pho size increases from a material cost perspective is very cheap (as everything is premade). 

Additionally, I find the limited pho options to  be a bit perplexing as it is extremely easy to have a lot of \"topping\" options for pho in a pain-free way. 

Because of it's proximity, I'm sure I'll come again, and perhaps I'll try something else next time that really will get me excited about this place, but as it stands, it's nothing to call home about."}
{"text":"Well I would say this place is ok. The soup is very clear. I would consider this place as almost like the fast food version of pho noodle restaurant. So came here with my colleague because we passed by here couple times. Its good that its on 8 street so it makes it easier getting here from downtown. 

So I ordered the beef and meatball pho noodle. The food was good. Price is basically downtown price but its on the Beltllin. Décor is interesting and definitely a more cleaner and much more brighter Viet Restaurant."}
{"text":"It's still good, but no longer five-star good.

Stopped in for dinner tonight. Was a bit put off by complete lack of music- was sure there was music on previous visits. Just the sound of other customers' conversation. Music is important- and it's hard to strike a balance between too loud and too quiet, but something should be there so that it doesn't feel as if you're in a doctor's waiting room.

I had the chicken fresh rolls and I thought I'd also order the vermicelli bowl with bbq pork... more on that in a minute. The rolls were very sloppy, with the noodles inside spilling out when I bit into them. The taste was okay, little of the good strong herb flavour that I enjoyed the first time I visited Nam, but the peanut dipping sauce was very nice. My noodle bowl somehow ended up being a rice bowl when it arrived at my table. It was similarly inoffensive, but wasn't what I was pretty sure I'd ordered. 

This wasn't a bad meal, far from it, but with such fantastic close-by Vietnamese options, especially Pure Vietnamese Kitchen, I'm not sure I'll often return."}
{"text":"It's exciting to see @namvietkitchen open. NAM is a Vietnamese Kitchen that values a complete dining experience.  Calgary is saturated with Vietnamese restaurants that have decent food but incongruent decor, staff that don't care, bad service and dirty restrooms.

Enter Nam Vietnamese Kitchen. I'm guessing the proprietors saw the void and wanted to fill it with their great design details, coherent branding, contemporary dining room and great Vietnamese food.  My wife and I decided to try it out last night and we were impressed with our experience.  You order at a counter with a well laid out menu and even a few LCD screens above to view what you want.  Once you order you are given a number and you can have a seat.  Meanwhile, while you wait you can stop by their condiment and water station to prep for your meal.  The dining room is well laid out with a bunch of bench seats and tables for two which can be joined to accommodate larger parties.  The decor is contemporary with a lot of natural light.  There are a few interesting details scattered about showcasing Vietnamese coffee cans, bottles of Sriracha (fact: Sriracha originated in Thailand) and Maggi fish sauce.

We shared an order of the spring rolls (deep fried) and it came out with a very nice 4-roll presentation.  The fish sauce was flavourful and had the right amount of spice, the rolls were a perfect size and crunchy on the outside, hot and soft on the inside.  What we really liked is the pickled carrot spirals on the side to accompany the spring rolls.  Most places leave a bunch of wilted lettuce leaves.  This was a nice touch.

We both ordered bowls of the beef and meatballs pho.  My wife has a severe nut allergy (including peanuts) and when we mentioned it they said they would take extra precautions not to have any cross-contamination.  BONUS POINTS for that!  My bowl was rightly sized and came with an individual side of bean sprouts, herbs, red chili and lime wedge (most places pile them onto one large plate for the table).  I really liked the thought of having one plate for each person.  For $11 you usually get an XL bowl of pho at another restaurants but I don't mind paying more for less if you are getting quality ingredients.  NAM delivered on the quality ingredients part.  Their noodles were cooked to the right consistency, not too soft and not too hard, just right, as Little Red Riding Hood would say.  Their thinly sliced beef was also cooked to perfection and was soft to bite into as it slowly cooked in the broth in front of me.  The meatballs I'd have to say are the best I've ever had at a Vietnamese restaurant.  Usually you get a rubbery ball of meat, not here; their meatballs tasted fresh, had the right consistency and were spiced with the perfect amount of pepper.  Bravo!

The only thing I think they could improve upon is the beef broth.  Although it was flavoured right, the soup base seemed a tad bit too salty for my taste.  I mentioned it to them and they happily said they would look into it.  I could hear that it was communicated to the kitchen which I'd have to say is a welcome and refreshing thing to see.  Most Asian restaurants will scowl at you for giving them any type of criticism.

I'm definitely looking forward to trying out their rice bowls the next time I'm in and perhaps upping their review from a 4-star to a 5-star!"}
{"text":"This place is delicious! I've only gone twice so far and both times the food, staff and atmosphere were great. Tasty noodles, clean restaurant and very friendly staff. Will totally come again to dine and definitely recommend to others!"}
{"text":"The Chicken Pho is just ok. The broth isn't great. The restaurant style is very uncomfortable and hipster."}
