{"text":"I am so happy I decided to pop into this place on a rainy afternoon.  At first it was mostly for shelter, but it ended up being so much more. I ordered the Palak Paneer, and it was one of the best things I've ever had the pleasure of eating.  The flavours, the cheese, not spicy, but full of spice. it was divine! Then I ordered the tandoori salmon, another masterpiece.  Salmon was done perfect, came out sizzling on a hot plate and added to the crunchiness of the meat being seared by the oven.  The rice was cooked perfectly, had a lovely smell to it.  Prices were reasonable.  Atmosphere was fine (not trying to be pretentious for being in Riverdale), the waitress constantly checked in on us, seeing if we needed anything, or to top up our water glasses.  I will definitely be back to my new favourite restaurant!"}
{"text":"Been back a couple of times and it's been consistently good, though the vindaloo is the mildest I've ever had. Tasty, but lacked the kick I was looking for."}
{"text":"We discovered Namaste Nepal during Taste Of The Danforth, just by chance because they were doing their best job as carnval barkers to sell food, and giving out samples - we tried their channa masala and butter chicken and were impressed enough that a few days later when we were down to the Danforth again we went for dinner.

We went with a few options to try to get a good sample - a chicken biryani, a Nepalese \"chow mein\" like dish that was more akin to Singapore noodles (though quite unique), panak paneer, more channa, and naan.

It was more food than the three of us could eat, but it all reheated beautifully, and for the price we were totally blown away. This place is pretty simple, not overdone with decor or ostentatious, it's almost a little spartan at first glance, but what matters is the food and they do it right. This is a new favourite for me."}
{"text":"The best kept secret on the Danforth. Not sure if it's because their sign is so small, or because they're tucked away in a small storefront with raised steps, but this amazing restaurant seems to be generally overlooked. For $6.99 not only do you get an all-you-can-eat lunch buffet (which consists of some of the freshest, best Indian food we've ever tasted, and believe me, we've tasted a lot, living relatively close to Gerrard and Coxwell for more than two decades), but they provide a heaping basket of freshly made naan with each meal.   The buffet has the perfect selection - two meat dishes and the rest is varied and utterly delicious vegetarian (not so spicy that you can't enjoy it - one of my main complaints about some of the restaurants on Gerrard).  Dessert is simple but perfect - those yummy semolina honey balls - believe me, you won't need more after sampling that buffet. It's clean, cheerful, inexpensive and SO good   -  my husband and I now make at least a once weekly trek to have lunch there, and we're drooling by the time we make it to Pape! Kudos!"}
{"text":"WOW!  What a wonderful surprise!!  Came here on a coupon deal and was very unimpressed--lousy radio playing top 40, slow service, lame decor, and the appetizer didn't arrive before the main course.  Drink and water service were slow, the orders were slow to be taken, the ambiance was missing in action.  I just figured this was our first and last visit.  BUT THEN THE FOOD CAME!  Yum!  Wow.  I've had a lot of South Asian food in Toronto, and this was right up there with the best. 

Here's the rundown: 
1.) Naan.  Decent--nothing special.  Ditto for the onion version.  
2.) Kukhura Sekuwa.  This \"appetizer\" arrived after everything else and was a huge portion!  And it was totally scrumptious!!  Highest recommendation.
3.) Eggplant bharta.  Our lowest grade.  Too much tomato?  Not sure. Baigun bharta is usually a sure-fire bet, but not here.  A bit too acidic?  Not sure, but it did not work for us, and we usually get this dish at South Asian places. 
4.) Shrimp/prawn curry (I think that was the name).  AWESOME!  Delectable. A phenomenal dish.  
5.) Veggie korma.  Pretty good.  B  or B-.  Nothing special, but worked all right. 
6.) Special pulau (pea pulau?  Can't remember).  Not worth the extra cost beyond rice.  Generous amounts of green peas, but really not much more than the taste of rice.  
7.) Mango lassi.  Delicious.  Not too sweet, nice texture, fresh mangoes, lots of pulp.  
8.) Beer selection--pretty weak.  Just a bunch of bottled lagers for about $6/each.  No ale, nothing on tap.  
9.) Wine.  My wife had a decent Chilean cab-sauv for $6, and was satisfied.  

I suggest a kid-menu, for picky ones like mine. How about a \"naan pizza\"?  

Hopefully these guys can spruce up their service, music, and decor.  But I don't even care, if the food is this good.  I'm definitely going back.  Without a doubt my new favourite South Asian place in Toronto."}
