{"text":"Got a fried chicken breast salad ($7.75) from here today and am incredibly disappointed. I've only heard good things about this place so I figured why not. Big mistake. The salad came with 5 fries on it, which were soggy with grease and tasteless other than the overwhelming flavor of old grease, and 5 incredibly small pieces (if you even can call them pieces, more like the trimmings off an actual chicken breast) of the saltiest, driest chicken I've ever had. Some pieces were as hard as a rock, others crumbed from lack of moisture. I started to stir the salad around and at the bottom of the container was rotten lettuce. I'm sure you can imagine my frustration. I called them and was told that, \"that's just how I make my salads\" and that I could, \"come and get another salad\" (who would want to pick up another salad when your original was terrible) but when I asked for a refund instead (since I did not eat the rotten, salty, dry salad past the initial tasting of the chicken and fries when I got it), I was told, \"yeah, that's just something we don't do.\"  Please reference the pictures below to also see the lack of \"cucumber, tomato, and red onion\" that's advertised as being on the salad but mine barely had any.   Overall, if you're into paying $8 for iceberg lettuce, soggy greasy fries, and choking hazard dry chicken, I'd highly recommend Nana's.   *They did apologize for the rotten lettuce, though*"}
{"text":"OMG, this is the best food I've had since my own Nana cooked it!  I'm in Shadyside helping to take care of my  new grandson, but actually live in Latrobe. Itis that good, that I'd come back to babysit just to get their delivery! Hope that they never change."}
{"text":"If you are looking for a delicious Southern cooking/meal, go to Nana's. Nice little take out place in Bloomfield.  The menu and the super sweet lady behind the counter said, \"it would take about 20 minutes to prepare my order\".  I ordered chicken wings without any sauce and they were cooked perfectly with some very moist and tasty chicken.  For sides I ordered the mac & cheese and yams.  The mac & cheese was delicious with a lot of cheese, one of the better I have had.  The Yams were forgotten, did not get them with my order.  A corn muffin came with the meal, too.  The walls are painted red and there are a few pictures of Nana on the wall.  There are plenty of nice soft chairs to sit and wait, or call ahead.  The menu has some fish sandwiches, a salad, and a few dinners including Beef/gravy, Ham, Turkey.  Saturday ribs are available.  If you are looking for some southern comfort food, good chicken and mac & cheese, this is your spot.  Cash only!"}
{"text":"This place is classic soul food! They serve large portions that are full of flavor. The prices are reasonable, and the staff are friendly.  I had fried catfish, macaroni and cheese, and yams. The fish was fried really well. It was salty and flavorful, not greasy. The mac and cheese was really cheesy, and the yams were drowning in maple syrup. My husband had smothered chicken and cabbage. The cornbread was crumbly. It was messy but yummy.  It's definitely not diet food, but it's a great place for a treat"}
{"text":"Delicious Southern Soul Food at its finest. And I mean finest like shout out loud to the skies fine! The things I've ordered here and love, love, love are as follows: Mac and cheese that's sure to please. There's no messing around with this homemade, authentic cheese and noodle goodness.  The smothered chicken...OMG I need to be smothered in those seasonings and sauce from head to toe. Baked ham dinner makes me feel like it's Sunday dinner at grandma's house...so amazingly scrumptious!"}
