{"text":"Unbelievable, you can have the most delicious chicken thigh here! The atmosphere and food quality are extremely good! You would want to come the second time. I had been there twice and love the chicken thighs so much, they are soft and juicy, the salad sides come with chicken is so match, and it only cost $13 dollars! You absolutely want to try this!"}
{"text":"We ordered take-out from this location last night, and although we really normally love Nando's, we found this location to be really poorly run and inconsistent with the quality that we have come to expect.

Upon arrival for pickup, we were told there were a couple of items that still needed to be added to our order. We sat and waited for at least 15 minutes and watched as an almost comical amount of food sat, waiting on the expo line. All of the staff seemed to be confused, bumping into each other, all while the food just sat there. The restaurant itself was half-empty, so it was hardly busy and yet it was utter chaos on the line. 

It took more prompting to ask about our order, which they had clearly forgotten about. It took 3 staff to grab the missing items, shoved haphazardly into our bag -- we'd ordered cold items (salads), which were also thrown in with all of our hot food. Again it took more prompting to ask for those items to be separated. Weary, we decided to thoroughly check our order before leaving -- and sure enough, food was missing.

The manager/supervisor was very apologetic, shoving several coupons into our bag before we left. Supposedly there was an issue with the printer, but that didn't really seem like the problem as orders were being printed. 

Coming home, the chicken was over cooked and dry, and all of the food was cold. We likely will not be returning to this location as this whole process was lengthy and inconvenient (the opposite of picking up a quick dinner to go)!"}
{"text":"Wasn't like I remember growing up. I must say this place is way overpriced for a fast food joint."}
{"text":"The food and service isn't as good as the location on 32nd NE but im glad there's a location on 17th for when I want grilled chicken."}
{"text":"I orered a large amount of food off the catering menu for an office lunch and it was fantastic! The food tasted great, it was ready on time, and the value for price was good. All of the staff were great to deal with and even helped me take the food out to my car. 

Everyone in the office really enjoyed the meal - excellent chicken (very moist and well seasoned) and tasty sides. We had rice, peri fries, coleslaw, salad, garlic bread and custard tarts, plus 3 whole chickens. It was just enough to feed 12 people. I'd recommend all of it!

The only thing I wish they had was delivery, since it can be tricky to get parking on 17th on a weekday."}
{"text":"I'm inclined to give this 2 stars but it is 'a-ok.'
 
After a hyped lead-in at an Edmonton branch near Oliver Square, we were quite seriously let down by sauces that didn't distinguish the bland chicken fare all that much above ordinary deep-fried or grilled bird. As well, the sides were unremarkable.

Although it's supposed to be authentically Portuguese, on the second visit, it hadn't improved at this 17th Ave. SW outlet in Calgary, and pretty well deters us from ever returning. Only 3-5 blocks away - depending on what side of 17th you are travelling down - is a much better bet at Simply Irie jerk chicken with flavours that are somewhat remarkable.

Ah, skip this Nandos. For the average foodie, it's just not there."}
{"text":"Their chicken has good flavor though I'd prefer it if the flavour sips in the chicken. The restaurants pleasant with nice decor. Very modern art and furniture, relaxing too. The servers are friendly enough and the serving time isn't so bad too. Though the CasaSalad I found wasn't really fresh- the lettuce were sagging and seemed to be out for awhile. I also tasted soil/dirt from it. I'll come back here for when my grill chicken craving kicks in again!"}
{"text":"We discovered this chain in Washington DC.  
Same chic urban concept and pretty decent food quality.
We had seen fairly suspect reviews on Yelp for this location compared to the 32nd ave location but were pleasantly surprised.  Service is not the most cheerful but hopefully they can work on that part of their business otherwise they will get branded as one of those low service but good food places.
Atmosphere is way trendier than the 32 ave location.  Not as chaotic likely because less busyness of the NE area with large family type clientele.
Chicken is so much better than Swiss Chalet.  Sides are tasty especially the mashed potatoes.  Garlic bread is fresh and tasty.  Fries are average.  Prices are reasonable.
Bottomless coke Pop machine is a bonus!"}
{"text":"I've heard everyone speak so highly of this place (basically because where it originated from, it WAS actually good) but bringing it here has clearly ruined it. Still, I gave it a try... my boyfriend and I both did. We found it decently overpriced for what it was, and didn't understand why there was so much staff??? There was easily 10 employees at a time just standing in the way with nothing to do. ANYWAY, THE MAIN POINT IS - WE GOT MAJOR FOOD POISONING FROM THIS PLACE SO WE WILL NEVER GO BACK HERE AGAIN - AND WILL FOR SURE BE CORRECTING ANYONE WHO TRIES TO SPEAK HIGHLY OF IT ANYMORE. boo."}
{"text":"The chicken was excellent! (Perfect amount of spice - I'm thankful for the levels)... and the mashed potatoes were unreal. I'm not a fan of the space - it feels like a cafeteria and not comfortable. That's why it gets 4 stars instead of 5."}
{"text":"Just as great as the Nandos in the NE. Fun two-storey interior and lots of seating. Love the Coke Freestyle machine!"}
{"text":"First timer at Nandos Resturant. Where to begin, well it took over 2 hours from start to finish to complete the meal, and it only took 15 mins to eat it! We were seated quick enough, but it took over 15 mins to put our chicken order in at the counter cuz no one was there to give it to. They forgot our drinks, they ran out of cups. My chicken was given away to another patron, the veggie wrap was not GRILLED vegetables but a cold salad put into a wrap.  People, go to another location to get the right meal with drinks."}
{"text":"This was my first time here.  It was excellent. The medium spice nailed hot but not too hot.  Service was above and beyond.  When they realized this was my first time here, they gave me a Nandos sauce and several coupons.

The chicken was tender and fell off the bone, skin crispy and charred to perfection.  I had two sides, rice and slaw, and both were great--Flavorful and complimented the chicken well.

As the photo shows, I devoured everything.

Top marks for price point.

Thanks Nando's."}
{"text":"It's too bad this place is such poorly managed because the food is great. The staff has no clue what is going on. We watched as food sat on the line for over 10 minutes and staff just walked by it with very confused looks on their faces. There was only 5 tables full in the place! They only had one cashier working with a decent sized line and she couldn't figure out how to change the paper in the debit machine....I stood there for 5 minutes while she fumbled around with it.

This place needs to re-train all their staff to work as a team otherwise I see the doors closing in no time."}
{"text":"Poorly operated. Waiters stand around waiting to take food the tables even though it is ready and under the grill. Complete chaos when it's busy, you will end up waiting for ages. The uptown location is run much more efficiently. Don't go here if you value your time and service."}
{"text":"LOVE LOVE NANDOS, the food is fantastic, I have been going to Nandos for years in different cities all over the world. Never had any issues with the food, I am always with a group so I get the platters, and order the Chicken Livers(enjoy the hot or at least medium). The garlic bread is awesome and the peri fries. Also seasonal but my other favorite is the corn. Delicious! But why my 3 stars is that I have had mixed service and pickup experiences at this location, it's a hit or miss, but lately much better. But I will eat there for the rest of my life, it is one of my best places to eat anywhere in the world. Don't forget to add the garlic sauce to everything!!"}
{"text":"If you are in search for spicy and flavourful chicken you can't go wrong with peri peri basting and sauce. It's heartwarming. Beat the winters with this amazing flame grilled chicken. A big break from all that fried stuff out there. Something different. I first tasted in U.K. They are expanding in Canada aggressively. Nandos the way to go."}
{"text":"The veggie wrap was extremely oily. The space was freezing cold to the point where everyone was eating with their coats on. The bathroom floor was dirty and considering how new this place was, it looked like it wasn't being properly cleaned on a regular basis (dirty walls and dirt built up in corners). Staff was friendly and my guest's chicken was great."}
{"text":"The food is excellent. The amount of effort to try the food wasn't. 
I was attempting to order through Skip the Dishes and have the food delivered to work for a work meeting, but Nandos link to their system wasn't working, so I tried ordering through Nandos online portal, which also did not work. 
Anyway with a bit of off-roading and zig zagging I was able to order over the phone and pick up the food myself on the closed off 17th ave. 

I ordered a 3-4 person chicken platter and another half chicken entree, as I usually find when restaurants says it feeds 3-4 it really only feed 2. This cost just over $100. The chicken was excellent, moist and very flavourful. The portions of chicken were actually more than enough for the 5 of us eating. 

The sides however were only enough for 2 people. The side options were mashed potatoes, rice, garlic bread, coleslaw and corn. We received a single corn on the cob. And maybe two half up sized scoops of mashed potatoes, rice, coleslaw. 

Would I eat here again? I would, I think the flavours are there and I'm interested to see what other dishes are like. My experience to get the food was terrible."}
{"text":"This place is terrible, disorganized and not customer service oriented. Came here to grab dinner and it took FOREVER to get service, and OVER 45 minutes from
the time I came through the door to eat. Still no dinner at the time of this writing. !!!!"}
{"text":"Atmosphere was great, and service was excellent! I love the interior of the restaurant and the chicken is to die for! I will definitely be dining here again."}
{"text":"@NandosPeriPeri is a chain of Portuguese, original flamed-grilled chicken PERi-PERi restaurants.  When the first on in the NE opened up it wasn't very memorable.  Since then the one in the NE has renovated and has improved their food and service tremendously.

When I heard a Nando's was opening up in my neighbourhood I was quite overjoyed!  I believe their food is priced right and for larger parties the party meal (2 chickens, 3 nando's sized sides and 5 portions of bread) is quite a deal ($61 and some change).

Being a new location that just opened up on 17th ave they need to work out some small issues.  Their liquor license hadn't yet been approved and some of their staff are still in training so asking them questions it was a bit difficult to get a straight answer.

Overall the food was great, chicken was flavourful and in my opinion they have the best coleslaw in Calgary.  I'd skip the potato wedges, they were just \"OK\".  The yams weren't seasoned that much and came out a bit bland.  The service was great but our table was never really cleared of empty plates and we were struggling a bit for room (six of us shared two small round tables put side by side).  Also, the music was a tad bit too loud, I could hardly hear people in my table talk.

I'll definitely go back and perhaps the 3-stars will turn into a 4 or 5 soon."}
{"text":"I loved the Chicken but it seems that levels of flavor all taste the same as well as the dips: al spicy. Loved the self serve pop machine though."}
