{"text":"Ordered the rigatoni and it was excellent. Had the baba for dessert also excellent. Service is great and will be back soon. Owner came out and proposed a toast which was truly awesome. 

Great atmosphere! Will return soon"}
{"text":"Laughably overpriced for the quality. Pizza di roma quality food disguised as fancy with the $$$$ price tag. Don't waste your money here. Greenbush is miles ahead and 2-3x cheaper. Osteria papavero for a better truly \"fancy\" italian meal, & it's still a tad cheaper than Naples (smaller portions though). Sorry, wish it was better!"}
{"text":"Like the last review, this place has potential.  We had dinner here on the Saturday before V-day.  My husband made reservations and they were so busy the only available was very early.  We thought this would mean less crowds and better service....

The service was very lacking, I feel in part because they did not have enough staff for the amount of tables so our waitress was spread thin on a busy holiday night.  The place quickly filled and every table was occupied.  

We did not go with the prix frixe menu, instead ordering a pizza app and 2 entrees.  This seemed to be a good idea because as we watched the other tables slowly get their orders, the amount of food was not worth what would have been a doubled check total (our bill came to less than half what the prixe fix was).

The margarita pizza was very good, although only had a single sliver of basil (I like more).  My husband really liked his Gamberi e Capesante and I thought my Ziti al Re di Napoli was good.  They were both served on very large, chipped ceramic platters, which I thought was overkill especially with the small table size.   

I am familiar with real, authentic Italian food, and this place does remind me of such quality, but I feel the overall experience was lacking.  Prices are somewhat high but expected.

Unlike the previous review, we were not there when the Chef came out and filled glasses but I doubt that would've made a difference for us.

We will still consider this place in the future, and maybe give it another try on a less popular night!"}
{"text":"Had a memorable dinner there.  Everything was better than great.  Very authentic---might as well be in Naples.  I hadn't had meals this good in Italy---only comparable restaurant is in London----anyone near or in Madison should visit if you enjoy food .    Salvatore is a wonderful host.   It is hard to impress me and the master chef did."}
{"text":"One of the top 5 meals in my life.  The atmosphere is romantic, the staff is excellent and the food is out of this world.  Our waitress made several recommendations that were spot on.  She was even from Italy so very authentic experience.  We could not have been more pleased with our meal and the entire experience.  

For those who complain about the prices, realize this is a high quality dining experience not a trip to Perkins.  If you are looking for cheap, go elsewhere, if you are looking for high quality and excellent value, (given the quality) this is the place to go.  Clearly the best Italian in Madison, and probably the top Italian food I have had on this side of the Atlantic!  But don't expect a $50 meal for $10..."}
{"text":"They served a wonderful dinner for our UW class outing. Lots of wine, and truly unbelievable food made for a great night. We were there for 3 hours and loved every minute. Chef Salvatore sure knows how to serve a toast too!"}
{"text":"The red sauce is to die for. The one is amazing. The pizza on* believable.
Woodfired Pizza has no equal. The calamari was amazing. The service unequal."}
{"text":"The owner Salvatore visited our table and we happily left our dinner in his hands and let him choose for us.  We had such a fabulous experience and the food was absolutely lovely!!  I highly recommend this place!! It was perfect for my work colleagues but would also be a great date location!  Grazie Salvatore for the hospitality!!"}
{"text":"We had a very good experience here for dinner just after coming back from a trip to Italy.  I liked the food here better than what I experienced in Italy.  We had the Ragu and a seafood pasta (forget the name).  Both were very tasty and the right portion, i.e. not overloaded with the pasta like some other Italian places.  We also had the Eggplant Neapolitan.  Also very tasty and recommended.

We are planning to go back for lunch and will be taking more people with us!"}
{"text":"BOOOOO!!!!!!

Let me explain:
We had a Groupon for Naples15 for $40.

When we arrived, we were looking over the wine menu when our waitress (who was very good) notified us that many of the wines had changed. After trying to see what ones were available, they suggested a red.  It was good so we went with it.

We ordered a capresa salad and two pizzas.

The food was good.  Although I thought the $14 price for the salad was a bit steep, it was good. 

We finished the salad and waited easily another 30-45 mins for our pizzas.  I ended up ordering another glass of wine, while we waited. 

When the pizzas came, they were also good. They are cooked right in the front in a wood oven.  Very cool. 

So up until now, we were like \"We'd come back....with a Groupon\". 

Then the bill came...taking the $40 Groupon off it came to $63!  So the total bill was $103.  Also note, we go out frequently and $100 tabs are usually fine, but this was not a $100 meal.  More like $50-60 meal.  

The wine ended up being $12/glass, even though we were asking for their $7 glasses they have on the menus.  

This is a Groupon ripoff. Take your $100 and visit, Cento, Novata, Pizza Brutta or Cafe Porta Alba."}
{"text":"What an incredible experience.  Eating here is like you are extended family coming for dinner.  Salvatore made a great evening for our group of nine people.  My Partner called ahead of time to make the reservations and Salvatore made sure that our experience was great, he asked about any food allergies to make sure that we all enjoyed our meals.
He shared with us why he created this restaurant and where here sources his products, he was so friendly it was like coming home for dinner with family.  The wine selection is great and had many wines from Italy.  He made the evening one of the best was have had in our dinner group.
The food was great as well, we all looked at each others appetizers and entrées, it was a feast for the senses.  The Margarhita's Pizza was delicious.  We are going back just to try that and some other pizzas as well. The appetizer \"Gateaux alla Napoletana\" had potatoes and prosciutto, it is to die for, I'm having that again.  The creaminess of the potatoes and the salty prosciutto is a delicacy.  Since there were 9 of us there was quite the variety of dishes.  I personally had the Scallops Diaz which were served with roasted garlic, hazelnut oil served over paccheri pasta.  I loved it.
You have to admit that It is a very special restaurant where the chef/owner takes the time to meet his guests and makes you feel like at home.
Give Naples 15 a try, you will love it!"}
{"text":"Agree with other reviewers.  The food and owner were fantastic but the service was sub-par.  You expect premium service when you're paying top dollar.  Felt like we were being rushed the entire time, as we came about 45 minutes before closing."}
{"text":"The food is good, but nothing here that I saw warrants the prices. $15 for appetizers is ridiculous. One is basically mashed potatoes and cheese in little mounds- three of them on a plate with a sauce. It is delicious, but not so good that it justifies the price. There are other good Italian restaurants in Madison. I think the reason people give this one such high ratings is because they don't want to acknowledge that they overpaid."}
{"text":"I love Naples 15 and go often. The staff are very friendly. The pizza is fantastic. Really authentic Italian with unbelievable crust. Definitely the best pizza in Madison, WI. The dessert Baba is also delicious."}
{"text":"Delicious food but gluten free pasta had gluten according to Nima sensor.  Not safe for Celiacs."}
{"text":"this is some LEGIT italian cuisine! Salvatore the owner and cook is a wonderful host, the food is out of this world... my family is italian and i haven't had such good southern italian cuisine in years! the place has great music that doesn't interfere with conversation, the place has a great vibe, not pretentious like other places.
our first time there there had been an issue with some of the waiters, so the service was super slow, but salvatore convinced us to stay and give him a chance, and we loved the food so much that we went back with friends and service was great!
not a cheap eat, but well worth it!"}
{"text":"Naples 15 serves the best pizza I've had in Madison. The dough is perfectly chewy and incredibly flavorful and the toppings are delicious. I stopped in last night for the first time, and I was blown away by the quality. 

The wine list has a lot of options from Italy that aren't seen on other menus in town. I sampled three of the Italian reds and would have been happy with a bottle of any of them, but I chose a glass of a grape varietal that I had never heard of before. 

The service was good, and I enjoyed the ambiance as well!"}
{"text":"Last night we went to Naples 15 with a large group of 12.  From the moment we walked in the door we were welcomed by the owner/chef and his staff.  We were treated to pizza sample appetizers and wine and tiramisu tasting, while we waited for our fellow guests to arrive.  We ordered appetizers and entrees based on the recommendations of the chef's.  After dinner he treated us to a glass of champagne and flaming after dinner drinks.  It was such a fun dining experience with a large group!  The chef and his staff were amazing. They truly enjoyed preparing great food for us!  Fun evening!"}
{"text":"I wish I had the option to rate the food and the service separately. Yelp - you should implement this.

I'll start with the good. I know owners and employees read these reviews, so note to you: stop reading when I say \"And now for the bad...\".
I'm a member of Capital Fitness, and walk past this place all the time. I always think to myself \"man, that place smells like it has some good food\". I was right about that. The food was incredible. INCREDIBLE. I told my manfriend that it was probably the most delicious pasta I've ever had. I ordered the lobster ravioli: it had a nice balance and wasn't too seafoody, which some seafood pasta tends to be. The sauce was a cream sauce and wasn't overpowering, and it had a nice little kick. My friend had the cheese tortellini, and it was very good as well.

And now for the bad...

We dined here tonight (yes, tonight. I'm so angry that this couldn't wait until the next day on Valentine's Day). The only reason we picked this place was because we're both not huge Valentine's Day fanatics, and I had just finished a yoga class and saw that they weren't that busy... can't imagine why *sarcasm*. I am legitimately speechless about the experience outside of the food. They had a set menu for all the lovers out there, which consisted of an over the top seven course meal. The waiter agreed with us that it was entirely too much food, and it was $70 per person. I had no intention of spending $140 dollars on Valentine's Day dinner. So we opted for two of the five pasta options they were offering that night (not on a menu, and the waiter didn't say prices.. I'll get to that later) and two cheaper glasses of wine ($8 a pop). As we waited for our wine and food, the waiter brought out \"a few pieces of bread\", which were two, three inch triangles of what I'm assuming was their pizza crust. \"OK, maybe they're just trying to give their customers a taste of authentic Italian simplicity\", I thought. There was no side salad. \"OK, so the pasta dishes must be a pretty good size\", I thought. We get our entrees, and if you've read my paragraph on the food, you'll know it was delicious. I got five raviolis and felt good afterwards, and my friend was \"comfortable\" after eating all of his. I figured, why not get some desserts for this kind of but not really special occasion. I had heard a different waiter telling the table behind us that they had red velvet cake or angel food cake soaked in a creamy liquor. YUP, doin' that. Well, when I asked our waiter about dessert, he said \"well, I can't really offer you anything, but we do have red velvet cupcakes\"... Can't offer me anything? Ok, snootypants, I'll go get desserts for us from Monty's Blue Plate (we did). 

During this whole hour long experience, the man who I'm assuming was the chef, was absolutely doting on a table of two people he must have been acquainted with. He brought out their wine, their salad, etc. etc. He walked past us a few times and said hello to the table behind us and \"how is everything tasting?\" to the table next to us... didn't even look our way. \"OK, maybe he sees that we didn't spend the $70 per person on his specialty menu and hates us\", I thought. I chalked it up to him being busy with his \"regulars\" (although, one way to make new regulars is to BE NICE to new customers).

The waiter then brings the bill out. To my shock, it was $84.00. EIGHTY FOUR DOLLARS AND YOU CAN'T \"OFFER ME\" ANY DESSERT OR STOP AT MY TABLE TO SAY \"BOO\"? uuuuh, no. Containing my anger was no easy feat, and the second we got outside I was yelling.

The only reason this review is two stars and not one, is because the little food we got for $84 was delicious, and I was a big enough idiot to not look at your menu prices online before we came here. Needless to say, I won't have to worry about that, again."}
{"text":"Naples 15 is wonderful and Chef Salvatore is a culinary artist and great host.  My husband and I had an excellent dinner this past Monday and will be returning to try more dishes.  Our service was top notch and our veal and lobster ravioli were sublime.  This is not a fancy place but is warm and cozy and inviting.  We even took some of our entrees home with us as the portions are so generous, but that did not stop us from sharing a cannoli that was a real treat.  Chef brought us a slice of pizza to try and we will definitely be exploring the pizza menu on return trips.  Thank you Chef Salvatore and Naples 15 for a memorable dinner on a very cold night!"}
{"text":"Wonderful food and great service!! Great variety of authentic dishes with wide variety of wine selection.  Will definitely be back."}
{"text":"In a Nutshell: Naples15 has seriously improved since the old Yelp reviews. The service was great, food enjoyable, menu extensive, and atmosphere all-around colorful. 

I received a $50 gift card from Capital Fitness to dine at Naples15. I arrived with seven friends and no reservation on a Friday around 6PM and they sat us immediately. Service was prompt. Food is prepared quickly without sacrificing quality. My red wine was okay; nothing too special. 

Unfortunately, my experience was ruined by the congregation of fruit flies that call this restaurant home. I didn't stop waving my hand over my food or wine from the moment it was set on the table. I suppose if you were to sit outside, you may be able to escape the little devils. 

All in all, it was worth a few hours of my time (the gift certificate didn't hurt). But you have been warned: sit outside or get it to go."}
{"text":"This was my second time to this establishment and both times I thought the pizza was really good.  On my first visit, I had the #5 hot salame pizza and on my second visit I had the #15 Neapolitan stuffed pizza.  Both were excellent.  I aspire to eat my way through their pizza menu...seriously.  One small thing bugged me.  We ordered the Naples 15 salad as a first course.  The menu states it comes with strawberries but instead it came with grapefruit.  I suppose it's probably a seasonal thing but that should be noted on the menu or by the server.  Nonetheless, I will be back!"}
{"text":"Are you kidding me?  Their prices are outrageous!  Go to Lombardino's (Italian) or Sardine (French).  Their prices are much more reasonable and they have impeccable reputations to prove their food is worth what they charge.  Naples15 has no such reputation.  At a glance, you can see the incredulous price differences between the ever popular Sardine and Naples15:

Sardine:
$6-$15 Appetizers (example: giant plate of steamed mussels in a light cream sauce with French fries and aioli $14)
$16-$28 Entrees (example: grilled lamb chops, rosemary goat cheese croquette, kale, roasted tomatoes, oil-cured olives and veal jus $28)
$6-$7 (example: warm banana bread pudding drizzled with caramel sauce - large enough to share $6)

Naples15:
$15-$18 Appetizers (example: fresh pear with parmigiano reggiano $15)
$15-$40 Entrées (example: egg noodles with tomatoes and cheese $30)
$9-$12 Desserts (example: 1 small cannoli - not enough for 1 person - $9)

Feel free to compare prices for yourself:

http://www.naples15.com/menu/full-menu/
http://www.lombardinos.com/menu.html
http://www.sardinemadison.com/index.php

And I can assure you that Sardine and Lombardino's use only the finest quality, freshest ingredients available.

We will not be returning to Naples15.  Ciao!"}
{"text":"The food was excellent but the service was absolutely TERRIBLE! We waited 35 minutes to get water and our first round of cocktails. 2 people in our group never even got their cocktails. When they did, they were wrong. The bill was completely wrong and took 30 minutes to correct. They were obviously short staffed but they should have explained this to us. We'd try it again but not on a Saturday."}
{"text":"We had a great night - outstanding food and service as my husband and I celebrated our 30th... Imaginative menu, good wines, friendly staff  - we were treated like kings and queens. Looking forward to returning. Thanks Sal!!!!"}
{"text":"So authentic.the food and prep are the best Italian food I've ever had.the flavors are excellent"}
{"text":"A truly great evening.  Though initially skeptical, a friend's recommendation worked out great.  The calamari special was fantastic.  The Ziti al Re di Napoli is certainly a must.  As well, Margherita's Pizza was to die for!  All in all service was exceptional.  The chef even came to our table to chat and offered free drinks."}
{"text":"I went back and was pleasantly surprised. I had a pasta dish that reminded me of my Italian grandma's cooking, it was excellent! the citrus salad was also very good."}
{"text":"Ok, you know, I really wanted a restaurant to work out in this location, mainly because it would be super convenient for me because I work out at Capital Fitness. I did not get a good vibe from this place simply walking past it, but I bought a deal at Elevation Spa that included a gift card to Naples 15 so, okay fine, we'll try it.
Big mistake! The waitress was...I really don't know how to put this. I felt sorry for her because she was SO out of it. She would stop talking to us mid-conversation to stare off at the windows. She apologized a few times for being \"out of it\". Honestly she might have been high because otherwise I can't explain her behavior. At one point she ran into a chair. Regardless, she knew nothing about the menu and they were out of several items. When the bartender (FINALLY) brought us our wine, he REEKED of cigarette smoke. I am not judging him for his choice to smoke, but please. He smelled like an ashtray and it was very off-putting in a restaurant environment.
The menu here is a confused mess. They have this big beautiful pizza oven that turns out very mediocre and un-exciting pizza. They also have pasta. They ALSO have...lobster. WTF? Some diners near us ordered lobster and mussels and they were treated SO well. The chef came out to bring them free drinks and desserts and everyone basically fawned all over them. Sorry, but if you are a new restaurant, you should treat everyone well, not just the rich folk that order the lobster.
Nowhere on their menu does it say where any of their ingredients come from. If I'm going to get lobster, I want to know where it came from! Otherwise, in this case, I'll assume you got it from HyVee.
This place will fail just like several others that suffered the same fate in this location.
Overall: weird service, bad food and tacky environment. I wouldn't recommend this place to my worst enemy."}
{"text":"We stopped in here on a chilly, rainy weeknight and had a nice, cozy experience. The service was prompt and attentive (which may have been because of the few other tables there were that night). When the wine I had ordered was out of stock, I appreciated the gesture of bringing a taster of a similar wine to the table as a suggested alternative. Our group of four split the scamorza al prosciutto crudo, which was tasty and cheesy but a little small for the price, in my opinion. Additionally, we split two pizzas, which was plenty of food for our group."}
{"text":"From the time I made the reservation, I knew that dinner at Naples 15 would be a special event. Salvatore Di Scala (Executive Chef & Owner) promised to take care of our group and proceeded to tell me about the culinary tour we would take over the course of the evening. He didn't disappoint.

Our meal was crafted with such care and love that each bite was a joy. However, listening to Salvatore and watching him interact with his supporting cast was the real treat. This is a man who is passionate about his work and dedicated to creating a dining experience."}
{"text":"Read the reviews on Yelp and decided we wanted to give Naples 15 a try. What an experience! We arrived 15 minutes before our reservation time but we were seated quickly. We had a party of four. It was a beautiful summer evening, 68 degrees and breezy but inside the restaurant it was warm, very warm to being uncomfortable. After being seated we waited 20 minutes before our waiter showed up and brought some water, Then another 15 minutes before he took our order for appetizers and a bottle of wine. Another 30 minutes later we got our appetizers and we then placed our entree orders. 

40 minutes later our main courses arrive. Also, all the while we are waiting, and during our meal our waiter never asked if we needed anything or how our meal was. The place was very busy and in my opinion understaffed and poorly trained. On a positive note, they offered free desert and an after dinner drink because of the long wait time. 

The food is expensive but average in taste and quantity. The owner was very friendly and our waiter said that business had picked up because they have been rated #1 on Travelocity for Madison restaurants. My response was \"with service like this you won't be #1 for long\". 

Hopefully they can resolve their service issues soon. We won't be coming back again."}
{"text":"My husband and I decided to try Naples 15 on Friday night for dinner.  I had read a few good reviews of the restaurant and was hopeful that I would find some decent Italian food (scarce in Madison).  I was sorely disappointed in what we were served.

We ordered the Scamorza al Prosciutto Crudo for an appetizer.  What appeared on our table was a ceramic dish full of melted cheese that was burnt to the sides and almost inedible.  The prosciutto on top was burned to a crisp.  I am not exaggerating about this, the prosciutto turned to charcoal when I touched it.  Also, I thought his dish was traditionally meant to be server on bread.  There was no bread.  

For a main dish my husband ordered the Scallops Diaz which was OK.  It did not have much flavor but the scallops were cooked properly at least.  I ordered the Risotto alla Pescatore for my main course.  When the waitress came to deliver or entrees, I noticed immediately that this was not risotto.  Risotto is made with Arborio rice and is cooked in stock.  The rice absorbs the stock and becomes very plump and creamy.  What I received was plain, long-grain, white rice with a thin fishy broth poured over it.  There were 3 clams and 2 mussels sitting on top of the rice and a few very small shrimp.  

The entree was priced at $31.95.  I would not have paid $3.95 for this dish.  Either the kitchen ran out of arborio rice for the risotto and tried passing the white rice off as a substitute rather than just asking me to make another entree choice or they do not know what risotto is.  If the former is the case, I feel terribly insulted that they would try to pass of plain rice as risotto.  If the latter is the case, then they need to stop calling themselves an Italian restaurant.  Either way, I was less than impressed and will not ever dine at this restaurant again.  They are ridiculously overpriced considering the quality of food they are producing."}
{"text":"Brilliant food and excellent service. An escape to the old world and authentic Italian food right here in Madison Wisconsin. Alla saluté."}
{"text":"Awesome authentic food. Very friendly chef who will suggest you some good options. After meal espresso is fantastic."}
{"text":"Naples 15 is hands down one of the best, most authentic Italian restaurants that my family and I have ever been to. Growing up in Italy for 8 years and comming from an Italian family it is hard to find a true authentic Italian/Neopolitan restaurant. The owner and Chef Salvatore is also the nicest most caring person you will ever meet. My wife and I did two massive family dinners at Naples 15, a rehersal dinner and another dinner the day before the rehersal dinner with our family. Salvatore was an amazing host who cooked us the best food course after course. He did a special toast for my wife, family and I and got both of us very nice gifts from Italy to celebrate our special day. If you are reading this you absolutely must go and I strongly insist you have Sal order your food for you. He took us in the back of the restaurant where he keeps everything and literally everything from his pastas, pizza flour, mussles, clams is imported straight from Italy. You must, must, must go to Naples 15. Salvatore thank you again for everything! We will see you soon! Ciao!

-John and Sarah Christensen"}
{"text":"This is the real deal. Authentic Italian food. All ingredients imported from Italy.  Best pizza ever. Polo chicken pasta in white sauce is the bomb. Service is outstanding. Hands down worth the visit. Salvatore the chef gets out and mingles with his guest. Nice personal touch!"}
{"text":"Wow this is one terrific place.  The food is outstanding, the Owner and Chef Salvatore s a terrific gentleman.  a great host who cares about his food and his customers. The staff is very friendly and courteous.  You get an authentic experience, charming and old word.  Plan to stay for a while.  Enjoy the wine and the ambiance and indulge in some terrific food.  Tonight we brought the family.  The kids had gnocchi (the best in town), My wife had the eggplant, and I had the Sea Bass which was the special (encrusted in salt and served by Salvatore at the table).  For starters we had the Caprese salad and the Naples salad both were excellent and the ingredients flavorful and fresh.  Will be back again soon.  A gem in Madison."}
{"text":"being new to the area, we were looking for a typical East Coast style Italian restaurant and when we got here we knew we had found it.
Live piano player with several excellent singers candles in wine bottles and a full Italian menu.
The only thing missing was red and white checkered tablecloths.
everyone who greeted us was friendly and spoke with an Italian accent, foreshadowing to the authenticity of the food we're about to eat.

although they were out of the Sea bass when we got there,  the salmon dish was delicious as were the several pasta dishes we sampled.
the Caprese salad and the prosciutto and melon were both well-crafted and ample in size.
The wine list is filled with unusual Italian blends.
our waiter chose for us well and brought us samples of several to choose from.
all in all a wonderful experience in a great friendly atmosphere with an excellent menu.
 we will return here every time we visit Madison."}
{"text":"We had a large group dinner at Naples 15 and it was fantastic! Salvatore was super helpful in planning a menu, welcomed the group and explained all the courses and the food was amazing! Was such a nice dinner- great food, location, service. Will definitely be back :)"}
{"text":"Making a reservation over the phone was somewhat vague, however the gregarious Italian gentleman was most gracious and very accommodating. There were 4 of us to dine for the first time. Upon arrival, my first impression was \"oh yes a great Italian hole in the wall.\" The ambience was a haphazard atmosphere of charm elegance and whimsy.  We sat at the bar, and ordered our first cocktails. Our bartender was attentive and made excellent drinks. As we sat down to dine, we realized how intensely warm it was in the restaurant, feeling the heat from the kitchen coming out and most likely lack of air conditioning. Our server  was efficient and polite. It seemed that the restaurant was a bit short staffed, as our server was constantly busy. The complementary bread, was delicious almost like a tasteful and flavorful pizza crust with EVOO. Entrée included lobster ravioli and a white sauce that was delicious with just a bit of spice and tang. The beef tenderloin meatball special was awesome. Another entrée, the salmon ( charred and dry) with puttanesca was flavorful. The restaurant was full, and diners seemed happy and well attended to. We definitely will be back! I must also add, that the Groupon was very helpful as the items on the menu are pricey."}
{"text":"I have gone here 2 times. The place is interesting and authentically Italian but don't expect value. We ate there tonight and was put off by the price of wine. Not to be a whiner, or a winer, but $12 for the house merlot? I mean a glass, not the whole bottle. The pizza is not bad. There are interesting entree's in the $30 plus range."}
{"text":"Counting the days until we have the privilege of enjoying another meal at Naples 15. The owner and chef was incredibly gracious and the food was delicious!"}
{"text":"I love Italian dining and my first experience with Naples 15 was extraordinary. The entire experience was awesome. I was most impressed when the chef came to the table -- and that kind of service so rarely happens. Both the service and the cuisine are exceptional. It is truly an authentic experience.  I'll be back!!!!!!!!"}
{"text":"I've been to Naples 15 to dine-in 6-7 times and taken away pizza on many occasions. Overall comments:
- service can be great or can be slow/forgetful depending on your server, I've experienced attentive and friendly service as well as 'are they ever going to come back with our wine?' kind of service. 

- the pizza is phenomenal - the tuna pizza is my favorite and I've tried several of the others, but the tuna is what I'd go for in a heartbeat. They have authentic ingredients and not the typical 'Italian-style' that US establishments are known for. The crust is also great - superb Neopolitan-style pizza. If nothing else, come for the pizza or call in to order and pick it up. 

- the entrees are hit or miss - I've had both Ziti dishes and while they were good, I just don't think they merit a $30 price. The Paccheri however is great and a better-tasting dish in my opinion at $20. 

- wine list is decent - I've only ever purchased by the glass, but there are several options to choose from. 

In summary - I don't think you can go wrong with the pizza!"}
{"text":"Like being in Naples, only safer.  Great meal, baby octopus tender and flavorful, sea bass a pleasure for eye as well as the mouth, lobster ravioli was sinful, the service and ambience was as good as the food.  Thanks Salvatore and staff for a wonderful impromptu evening."}
{"text":"We were a party of 10. It was not busy. 7 meals served and the others came only after the first were finished. Terrible. This place is a joke. Apparently they don't have enough burners in their kitchen to make this many meals at one time. Pizza Hut does a better job."}
{"text":"I was excited to try Naples 15 as I love Neapolitan Pizza. We went here for our one year anniversary but unfortunately it ruined the night. When we sat down I sat on broken glass that hadn't been cleaned up. I got a minor cut on my hand that wasn't too bad but bleeding none the less. We asked for a bandage but the didn't have any. I ended up holding it in a napkin all night. For the inconvenience of cutting my hand and not even having a bandage they gave us one round of drinks. I feel they handled the situation very poorly and gave me no reason to come back. Most places would of given us our entire meal for free in that situation. I ordered a mushroom pizza that was supposed to have a few different styles on it. If it did I could not tell and there must have been one of each. The crust how ever was very good. There was a large group there that monopolized the staff's time including the owner which made the service pretty bad. I believe the food is good but it's too expensive for the service we got. Leaving with a $70 bill and a bleeding hand means I can't recommend your establishment."}
{"text":"My first visit last night left a lasting impression.  With each new dish, I could not believe the next could be any better, but it was.  The food was amazing.  The wine was paired perfectly with my dinner.  I felt like I was visiting family as I was welcomed by everyone in the restaurant.  We had a perfect date night and plan to return often."}
{"text":"Honestly, this place does not deserve all the 1 star reviews.

Is it the best place I've ever been to? No.

The service was pretty slow, but to be honest it seemed like our waiter serving the whole restaurant. This seems like a trend in the past reviews and I would strongly suggest that the restaurant train their waiters better.

But the food! So good!

First of all, the bread appetizer was really delicious. A wonderful bread with rosemary baked into it. Awesome bread.

Entrees: My boyfriend and I got the specials. I got a monkfish pasta and he got a seafood risotto. And the presentation was beautiful! Really top notch! And the food was even better. The monkfish had this wonderful smoked taste and the marinara sauce was so good. The flavors all really complimented each other well.

My boyfriend's seafood risotto was also good, but not AS good as my monkfish. It's really tough to make a perfect risotto, but this one was good enough.

Price: The prices were a little on the higher side, but we got the specials, so it's expected and the food tasted really good. I was very impressed.

Great restaurant. Looking forward to going again when I come back to Madison. But please! PLEASE! Improve on your service and wait staff. Dining is not only about the food, but the experience!"}
{"text":"Lived in Milan for 12 years - knew a group of napoletani - this is the first time this side of the Atlantic I have had real pizza! No need to go to little Italy - it's all here! Salvatore e il miglior chef che abbia mai incontrato - uno che lavora davvero! Se higuain avesse mangiato da Salvatore, sarebbe ancora al Napoli!"}
{"text":"This place is the most authentic Italian restaurant in Madison. The food is delicious, and my family being Italian, executive chef, Salvatore, gave us a personalized experience. From the moment we entered and started a conversation with him, he gave us a personalized choice of food, showed us all the seafood, which he gets fresh from Italy, and gave us choices and options that we have only seen in Italy. It was my mother's birthday, and Salvatore proceeded to bring a birthday cannoli, baba, which is a type of warm dessert, and champagne for the entire restaurant, which was on the house. Very hospitable place, felt like being in Italy. 
The seafood, pizza, and desserts are accurate Italian dishes. The restaurant has an amazing story and amazing food. Tradition ran deep throughout the restaurant, giving it a very enjoyable atmosphere. If you want to taste traditional Italian food, this is the go to place in all of Madison. 

I must say that if you have Italian heritage, especially if you speak fluent Italian, you must come to Naples 15 for a great experience of Italy."}
{"text":"Wonderful food with a friendly staff

The restaurant bills itself as \"Neopolitan\", but the food was much better than what we got in Naples.

We ordered the Five cheese ravioli (a special), Eggplant parmesan appetizer, Eggplant parmesan lasagna, White pizza (with arugula).  The five cheese ravioli was amazing...perfectly cooked, with excellent flavors.  The mushrooms in the sauce were just chewy enough and had a strong flavor to complement the cream sauce...there were just enough to keep the flavor changing (not one in every bite).  This was one of the best dishes we have had anywhere.  

The eggplant parmesan appetizer was excellent, though it was pureed so well that it almost became a marinara sauce (but a really excellent marinara sauce, worth eating on its own).  The pizza really took advantage of the stone fired oven.  The crust was excellent, with just enough yeasty flavors and a bit of the smoky flavor from the oven.  The cheese and arugula topping were clearly very fresh and flavorful.  My wife thought they should have added some of their amazing marinara sauce, but I think it stood out as being nicely different as a white pizza (but their pizzas with the tomato sauce must be great as well).

The eggplant lasagna was good, but was more flat pasta noodles with the marinara sauce...it tasted good, but wasn't quite what we were expecting.  Another review made a similar comment, there wasn't enough variety of textures; some larger pieces of eggplant would have helped.

The service was very friendly; my wife thought the waitress was almost to the point of being cloying.  The chef dropped by and was very friendly, and gave my daughter a free desert for her birthday.  It was a pear and rum cake conception; very good, but perhaps needed a little contrast to the sweetness (tart berries  or chocolate?) to make it really memorable."}
{"text":"The freshest and most authentic Italian in Madison. We went to Italy for our honeymoon and every time we come here it takes us back to our amazing vacation. Chef Sal gives an amazing vibe and makes everyone feel like familia. He is a true professional that cares more about your experience than anything. You can taste the passion in the dishes. Hands down my favorite restaurant in Madison. Wish I could give 10 stars."}
{"text":"The food was superb, but the highlight was the warmth and attention of Salvatore the chef and owner, who treated us like we were guests in his own home. Looking forward to our next visit."}
{"text":"outstanding dinner!!!
I had the veal and my husband had the seafood platter with pasta!!!  OUTSTANDING food  and waiter.
cannot wait to come back :)"}
{"text":"Legit Italian food as come to Madison. This head chef is direct-from-Sicily (with the accent to prove it) and stopped by our table several times to see how we enjoyed our experience. I eat out a lot (A LOT), and here's what I think:
-Naples 15 has some of the best, most authentic Italian food in Madison. This is real deal Italian. We ordered the cheese appetizer, as well as an eggplant ragu appetizer. Both were comforting and exploded with fresh flavor
-Pizzas: Generous and hearty. Loved them. Crust has struck the perfect balance--it's soft and chewy but not soggy; lightly blistered, but not burned. 
-Menu: TONS of options. Actually, I found it a little overwhelming and think the restaurant would do well to cut back and focus more on its pizzas, pastas, and apps, but if you love a wide range, you'll appreciate it.
-Pricing: I think the restaurant is too pricey for the area it's in (near the square but not on a main walk way and surrounded mostly by housing), but I don't by any means think it's not WORTH the price; just know that if you order anything besides a pizza, your bill can climb quickly. Grab a pizza for a casual night, or drop $70 for two to have a more \"fine dining\" experience
-Atmosphere: A bit quirky with the Christmas lights, but I loved all the charming pictures of Italy and quotes, as well as the fireplace. They've done a lot with the space, and I think it would be great for either a group of friends or a romantic date.
-Service: Exceptional!

VERDICT: Come and check it out, for sure. Great wine list, amazing food--and you can splurge on a few apps and some of the more expensive entrees if you are in the mood, or just stick to the fab pizzas."}
{"text":"While I wouldn't take a large group to Naples, I think it's perfect for two people.  They have some of the best pizza (if not the best) in Madison.  The pizzas are large enough to split if you get an app or dessert.  We haven't explored the apps but the cannoli is excellent.  The chef does make seasonal adjustments that I'm not always sure are explained so if you're allergic or a vegetarian, you better ask.  It never seems to be busy (due to its strange location) but the food is excellent.  Entrees strike me as being a bit pricey but the pizzas are $14 to $21.

Parking sucks so plan on walking a bit."}
{"text":"Well...where to begin?  We traveled to Italy a few years ago and ate the most amazing food of our lives. We never expected to find true Italian food stateside but after a 3 year search it exists right here in Madison. We enjoyed a lingering meal with exceptional service. We will not be wasting our time with any other Italian restaurants after this wonderful date night!"}
{"text":"Came here because we had a $100 gift certificate from Elevation Spa...I work out at Capital Fitness upstairs in evenings and always see it rather empty

Please note, I've worked in corporate restaurant marketing for huge chains before (family style, fast casual), so I know a thing or two about what works and what doesn't

Decor: It was \"blah\"...weird lighting, bad windows, very low ceilings, oddly-placed stickers on the floor

Service: Average...server was very nice but would disappear for long periods, never refilled water (which was served in tiny glasses)

Menu: Good variety with detailed descriptions...however, to the average consumer it was probably tedious to read, there were also a few misspellings, and the design of the menu itself was confusing, not to mention old/ragged

Product: The food itself was good...we split a tasty salad and two kinds of ziti which were great...however the canolli was terrible

Beverages: I have to mention this separately because they were \"out\" of every single bottle of wine under $50 (we asked for 4 different ones and each time the server came back with \"sorry we're out\")...also, they only have two kinds of beer, Peroni (which they were also out of) and Spotted Cow.  Beverages are huge check drivers, profit contributors and pair great with Italian, how could you be out???

Price: This was the worst of all...everything was probably 30-50% too high...$32 for a ziti?  Nothing on this menu should've been more than $20

I wouldn't come back here, you can find better value (benefit x price) in the great restaurant scene in Madison."}
{"text":"The food was sooo good! Tasted like authentic italian food. I will definitely be back! I've read other reviews and am shocked at the terrible things they had to say. Don't listen to all the complainers. Well worth a visit! I'll be back."}
{"text":"If I could give this place 0 stars, I would. The service-- poor, inattentive, and inexperienced.. The decor-- tacky. The food-- nearly indigestible. The pizza was greasy and was nothing like what the menu or pictures suggested. It took FOREVER to get our good. The waiter presented (and by presented, I mean \"threw down\") a cheese/charcuterie plate on our table and left without giving us any indication of what he just served us (it contained some pedestrian meats and cheese that came from a package in some cheap supermarket). The pizza was literally all bread, and when we asked for the arugula that was supposed to come on it, the waiter brought a plate of roughly an ounce. He had us pour our own wine after he struggled to open the bottle, and then mentioned that he \"doesn't really work here\" and that he couldn't really recommend anything.

Ugh. Don't go here."}
{"text":"DELICIOUS pizza.  The eggplant parm app was unbelievably scrumptious, perfect with their bread.  We had a girls night there, it was perfect.  Just classy enough without being too expensive."}
{"text":"This place is unreal. Best authentic Italian in Madison. The service was wonderful and the food was out of this world. An absolute must try. The eggplant Parmesan app is different than usual and so delicious. The lobster ravioli is also very very good. We will be going back very soon."}
{"text":"I was down on Butler street about an hour early for my hair cut with John at Studio 21 sitting on one of there sidewalk tables,thinking boy am I hungry.Being gluten intolerant there isn't allot of places I can go and eat ,but I thought maybe I can go into Naples 15 and get a salad. When Sal came out and told me he had gluten free salad,lasagna and pizza I ordered the salad and lasagna I only waited about 10 minutes for the lasagna the salad came right away  It was the best salad the lettuce was cold and crispy with a salad dressing that was awesome. When the lasagna came Sal said it had homemade noodles and 3 different meats ONE bite and I was in heaven. I have been craving Italian food for a couple of years and  the places I have tried were horrible will tell all my friends if they want a fabulous lunch or dinner go see Sal at Naples 15 on Butler street"}
{"text":"Terrible dinner. Service, drinks and food were awful. Ordered an Aperol spritz, warm and flat. Returned that drink and ordered Campari and soda, came in a huge wine glass and was warm. Cooled it off with ice from the ice bucket holding our warm when it arrived San Pelligrino. First course, Caprese Salad, a bowl of basil leaves with cherry tomatoes and small pieces of mozzarella. Bizarre. Next, Margherita pizza and Ziti Napoli. No sauce on the pizza, cheese and cherry tomatoes. Ziti was bland, over-sauced and over-cooked. Our waitress got electrocuted getting our beer out of the cooler and threw a fit in the restaurant. Beer was warm. Can't believe the cooler had electricity. Couldn't get out of there fast enough.

In addition, the food was way overpriced. Been to Italy many times and never paid $32 for a plate of ziti. It's a primi piatti, and it was nothing special. 

The chef spent most of the evening out front entertaining a large table, while we waited over an hour for pasta and pizza."}
{"text":"The most fantastic Italian food in Madison---do not miss!  I asked Chef Salavotore for fish soup not on the menu and he made me q beautiful Cioppino on the fly!  Check out my picture!"}
{"text":"We went to Naples for the first time last year for my college graduation and returned last night as a reunion of sorts. I still maintain that Naples 15 is the most authentic Italian restaurant in Madison. Both times I've been here, the chef makes a point to come around and talk to each table (and often gives away free drinks). 

We started our evening off with a bottle of Col Di Sasso 2014 cab sav. I'm not a wine snob, so I'll leave the description of it as \"smooth and tasty.\" Complementary bread and olive oil was served while we waited for our meals. I ordered the Paccheri Naples 15: pasta with large garlic cloves, San Marzano tomatoes, salted pork, basil, EVO, garlic and onion. The pasta came in a HUGE bowl. The bowl dwarfed the large noodles, but the dish was nonetheless extremely filling. You know it's real Italian when the simplest blend of ingredients can satisfy the palate so much. The friendly chef, the wine, and the pasta are all reasons to dine at this established eatery. Do note however, that the prices are not as welcoming as the staff. Most entrees will set you back $20-$30."}
{"text":"First off if you have not been here GO! it is hands down the best Italian restaurant in Wisconsin. Im serious, unbelievable. This is true Napoletano food.  

With that said, when you grow up in an Italian household italian food is something you hold special, almost sacred in some regards. You often feel that no one will make it like nonna or momma. Well...Salvatore does. He makes dishes that you just simply cannot find anywhere outside of Italy or someone's grandmother's house. 

I read a negative review earlier and could only think to myself that these people are probably used to the never ending breadsticks of Olive Garden. I have eaten here many times and everytime the food keeps getting better.  

This is a special place. It is 1000% worth going. If you have never been to Italy go to Naples 15 and you have.

This is as good as it gets."}
{"text":"The previous 5 star reviews are clearly the owner's friends. I've been there twice with a group of people (10+) and had the same bad experience.

The first time I was there, it was the opening night and they did not have a full menu. I got there a little later than the rest of the party, and ordered one of the pizzas that was recommended by the waitress (Italian sausage pizza). About 40 minutes later, half of the people with me get there food, while the other half (including me) are still waiting. Finally the pizza arrives after about an hour, and to be fair it was 'okay', not special but not too bad either (although it was a little undercooked). After ordering the check, it took the waitress a good hour or so to get the bills right, and after being there for a good 2+ hours (8:00pm to around 10:30pm) we finally left. Not very impressive, but hey it was the opening night.

Although the first time wasn't that good, I decided to give it another shot after a friend insisted that we try it again. Fast forward 1 week, and there I am again with around 8 people. Half of the people order a dish (pasta, Salvatore chicken, etc...) while the other half (including me) order pizzas. Around 30 minutes later, all the people who did not order a pizza get there food. 

Now let me take a minute here to address this TERRIBLE food service mistake that at this point has already happened twice! You NEVER bring out  half of the order! NEVER! That's food service 101! If something is going to take longer to cook, then the chef should time the food preparation in a way that ensures everyone gets their plate at the same time. When food is brought in batches, here's what happens:

1) The people who got there food, either wait out for the rest of the food to arrive and eventually end up with cold plates themselves, OR they start eating their food and finish earlier than everyone else.

2) The people who are not so fortunate, are stuck there with nothing to do but to stare awkwardly at the first group.

Ok back to the evening, so we wait and wait hoping that the pizza will soon follow. Well it doesn't. 30 minutes! Yes 30 minutes after the first batch of food get served, still no pizza. Of course by then everyone else is done with their plates. Mind you, that meanwhile, the chef (who is also the owner) takes the time to come out and personally serve a cake to the table next to us (family friends) and all the restaurant staff sings happy birthday. Yay?! not really, read on. 

Ater serving the cake, the chef swings by our table and asks my friend if we need anything (euh.. how about the rest of the order?!!!  You can't tell that half the people don't have any plates?!!). She, my friend, says that we still need the pizza, he nods, leaves for 2 minutes, then comes back with two slices from a pizza that has already been served and puts them on her plate! Now I understand that he was trying to be friendly, but COME ON!!! By the way, she was one of the few people who had already gotten there food, and he still didn't catch on to the fact that everyone else was still waiting.

At this point, I call the waitress and ask about our order, she says that it's on the way and goes in to check. She comes back saying that our pizza order got mixed up and they're remaking it! I ask her to cancel my order (we've been sitting there for a good hour or more and the chef clearly had more important things to attend do). She cancels the order, and I leave 5 minutes after that with no apology from her or the chef/owner whatsoever. I go to a nearby pizza place, grab two slices and head home (took me around 30 minutes including the walk home). Ater doing that, one of my friends who stayed there sends me a text message saying: \"That's one of the worst meals I've had, I should have left with you\". Apparently, they still had to wait 30 more minutes to get the pizza. It's a thin crust pizza for God's sake!! it takes 10 minutes to cook!!

So in short, went there twice, okay food (when I managed to get it), nothing too fancy or delicious that would justify the 1 hour+ wait. Terrible service with unexperienced staff. Not going there again."}
{"text":"This was the best Italian food outside of Italy that I have ever had! The lobster ravioli was amazing! Such a quaint place with so much personality and history intertwined into the decor. The host/ owner made us feel like we were inside his home with the way we were treated. I'm from out of town, but will definitely come back every chance I can."}
{"text":"I had a really hard time rating Naples 15, between a 4 or 5. 

We went here last night for my dad's birthday. Parking at the restaurant is difficult, unless you use the Madison parking ramp kitty corner to the place. Generally, the location, is very good.

We asked for a 6:30 reservation, in a booth. They got us that. The environment of the place was super cool, low light, with candles and artwork everywhere. 

The server was personable and friendly. He gave us an entire history of the restaurant because it was our first time being there. We appreciated that. We asked for a wine suggestion and he brought us out samples to try, instead of chosing or narrowing options for us. This was great! We ended up picking a Spanish wine on special.

I wish I could remember the name of appetizer, but we started off with a bread that had a smoked cheese for dipping. It was off the wall good. 

Then, our server came out with small glasses of champagne, on the house for my dad's birthday! That was so nice of them. 

Each of us ordered our dinners. Highly suggest the lobster ravioli, filet mignon or either of the Ziti options. We all were super happy with our tasty food. I give the food a 5 star! There was some sort of communication mix up with my boyfriends seafood pasta dish, but he was still really happy with what he received anyway. 

The only thing I can say I didn't like, was that our waiter never refilled our pitcher of water. I am an avid water drinker with my meals and especially with drinks. We poured all of it immediately after being seated and it was never refilled, even with the waiter coming back multiple times. He was fantastic otherwise. 

I highly recommend Naples 15! Best Italian I can ever recall having locally."}
{"text":"The owner chef is a hoot.  He came out and greeted our 4 top and gave us his enthusiastic reco's.  

The pizza was a great start.  The pasta was prepared fresh and the sauce and meatballs delicious although i suspect the meatballs were prepared and frozen. 

The service was great and we enjoyed this little gem!"}
{"text":"People of Madison, you are in for a real treat.  If I could, I would shout it from the rooftop for everyone to please try Naples15.  My mom and I decided to lunch here after a belated Mother's Day outing at Elevation Spa and Salon (just two floors above Naples15).  With no real expectations we were blown away by the customer service, attention to detail, and dynamite cuisine.  

We began our experience with samples from the exceptional wine menu, recommended by our server, complete with descriptions of the grapes and regions of origin.  We then choose from the lunch menu ($10 pizzas/$5 salad/$12 pasta dishes) and split one of each.  Not sure of any other place with such authentic, gourmet food, with such a reasonable price.  Let me just say this IS the best REAL pizza you will find outside of Italy!  (I have spent two weeks there.) This family-run business does as it promises and brings Napoli to us with charm and flavor.  The salad was fresh and unique, and the Ragu with fresh cooked pasta was perfectly prepared.  

As if it was possible, we spoiled our palates even more with the special desert of baked pear over a pound cake with a delicious cheese/cream sauce.  The chef completed our experience with an espresso. 

Grazie, grazie, we will return!

p.s.  Love the Italian music,  the \"pizza\" cutlery, and beautiful serving dishes!"}
{"text":"Salvatore has an incredible passion for his food and that shows in each dish he serves. The meatballs were the best I've ever eaten and the pizza took me right back to Naples. I can't think of anywhere else you can get such authentic or deliciously Italian food here I madison."}
{"text":"It has been a long time since I was so irritated that I decided to Yelp.  

Well, my wife and I decided to try Naples15 after all of our friends have raved about it...or should I say tried to try.

So we showed up and there were very few people in the restaurant.   The hostess sat us immediately and decided to tell us the story about the owner...which is fine.   That's the last we ever saw anybody at Naples 15.   Not any food ordered, drinks, handshake, nod, glance or sniff.   We finally left after sitting there for 30 minutes. 

Now...you have 5 people in restaurant, you know we are there, can clearly see us, walk by us, and then see us leave and do not even acknowledge us as we are leaving.   

So...Naples15...you are responsible for the return of me to Yelp.   My followers thank you and my haters..."}
{"text":"This place is such a hidden gem! It is like little Italy in Madison. The gluten free pasta is absolutely divine. Most gluten free pastas become mushy and tasteless, but at Naples, it is perfectly al dente. The portions are HUGE! It is a bit pricey but for how much food you get and how deliciously authentic it is - totally worth it! This is one of the most underrated restaurants in Madison and is a must!"}
{"text":"Pizza is amazing. Sal is fantastic. The whole experience is always great. I recommend 1 pizza and 1 caprese per two people.  You'll never go wrong.  

Again, the pizza is amazing."}
{"text":"I have been to Naples 15 over ten times in 2012 and 2013. I dine all around Madison regularly.  L'Etoile, Old Fashioned, Jac's, Brasserie V, Taj, Tornado, El Pastor, Coopers, Pizza Di Roma, Cafe Porta Alba, Pasqual's and Morimoto's are some of my favorites so you can decide for yourself if you share my tastes.  N15 is a very good restaurant. Might have had some issues with uneven service early on, but it is a friendly place, boisterous and fun most nights, and has an excellent bartender (Sergio) and great chefs in Sal Di Scala and Vince.  The pear and cheese appetizer is light and delicious.  Ask for extra bread to dip. The wood oven pizzas are excellent. The pasta is cooked perfectly if you like it al dente. If you like it another way just ask, they will accommodate anyone. My friend is vegetarian and has always been made to feel welcome, and dishes made to her taste. The fish specials are alway light and masterfully prepared.  Yes, they have LOBSTER dishes.  Is it an indulgence- yes.  But reasonably priced for a nice cold water tail with home made pasta rings and the lightest cheesy cream sauce you might ever find. They know how to serve lobster. 
Not sure where the negative reviews came from. I have been to N15 enough to know it is RELIABLY good, which is important when one is spending money to dine out.  I hope Madison supports the place because the Staff deserves it. Try it. Have a \"chef style\" espresso after your meal - they whip in a secret ingredient and it is awesome. Try the tiramisu.  I have had the dish all over the country and some of Western Europe, and it is the lightest, we'll balanced I have ever had by far.  Enjoy the company of a Chef that cares enough to be out front and interact with his customers and make sure they are having a good meal and a good time. Introduce yourself. He'll remember you on your next visit.  But mostly go for the food. It is great."}
{"text":"I feel bad writing this honest review but I had reasonable expectations and they were far from being met.  I had never been to Naples15 and I had a Groupon for $40 and was eager to try.

The Pros: the staff was knowledgeable and friendly.  The bread was unique and exquisite.  The gratis caprese salad was delicious.

The Cons: when I asked about the special, which sounded wonderful, I was told it was $29 but $39 if I were using a Groupon.  What's the point of offering a Groupon then?  Made no sense.  The house wine was not very good but would have been acceptable had it not been for the price.  Pricey for a house wine at $41/bottle.  The prices on the menu were what I would consider extreme for this level of restaurant.  This is not a LeToile. There were entrees in the $15-20 but many were in the $29-39.  I would still be willing to pay these prices but the decor and ambiance were mid-level at best and our entrees...the seafood tasted old and overall it didn't meet expectations for the price.  

The pizza on the menu looked good and we were told by the wait staff that it is excellent.  If you're going, I'd stick with that suggestion."}
{"text":"amazing amazing food and vibe and chef!!! great vibes and met the chef. he sat with us and wined and dined us. love this place, will definitely be back!! come here if you want to eat and dine like a true italian!"}
{"text":"Food was delicious and extremely authentic. Loved that Salvatore came and introduced himself to everyone at my table. Felt like I was back in Napoli..."}
{"text":"My server spilled red wine all over me. Accidents happen, but the fact that I didn't get an apology or any sort of compensation really ruined this place for me. Think I have to throw my favourite shirt and trousers out. Obviously had to go home after, rather than go out as planned. Perhaps I should have complained, but I didn't want a scene. The linguine I ordered was good, so thanks to the chefs. Freshly made, in house pasta would improve it, and for the prices here I kind of expected that. The flavours of the sauce were good. All in all, I think it could be great but the server ruined my night."}
{"text":"Very authentic Italian. Chef Salvatore was very friendly and came to our table to let us know about the specials. They have vegetarian options. Baked potato with cheese was very good. 
Pizza was amazing and so was all the entrees we ordered."}
{"text":"We had walked past Naples 15 several times and finally decided we needed to try it. Upon entering the restaurant we were struck by the smell. It was very much the odor of a fish market. This left us with mixed emotions as we both enjoy seafood, but not necessarily the fish market smell. Luckily, as the evening progressed we stopped noticing it.

We didn't have a reservation but it was early and they were able to seat us at a table. Our waiter was friendly and fun to chat with. He seemed inexperienced, but he was attentive and helped create a memorable experience.

Upon perusing the menu, we were surprised by how expensive most items were. The prices seemed to be quite a bit more than we would typically see at other Italian restaurants. We ended up ordering the special grilled calamari appetizer. It was by far the best calamari I have ever had. It was also $20 for the appetizer sized portion. We ordered the gnocchi and a pasta dish which were among the least expensive items on the menu. They too, were amazing. Textures and flavors were spot on. The prices though just seemed considerably more than one would pay for a similar dish elsewhere. I don't mind paying more for fine food, but there is a limit and I had very mixed feelings about whether or not I had reached that line.

I do recommend Naples 15. Our waiter was great, our food was delicious. But go with the expectation that you will be paying fine dining prices and go hoping they have the odor under control."}
{"text":"Enjoyed a pre-race carb loading. Started with the eggplant carpattio which melted in our mouth. I had the ziti with veal meatballs and my husband had the lobster ravioli special. Salvatore the owner was so hospitable. It was liking being invited for his home for dinner. Dessert of pear pound cake was a perfect ending. We will definitely be back and tell our friends."}
{"text":"I really wanted to like this place. We arrived to find lipstick on our water glass and a dirty table cloth with candle wax on it from previous nights. When you looked around at the tables, they all had very wrinkled table cloths - that was the first impression. We made reservations for last Saturday night, which happened to be UW Graduation. When we arrived we were told there was a 55.00 per person pre-fix menu, order a la carte and 2 specials. We were not notified of this when we made the reservation. We decided to order 3 a la carte options. When we got the bill, we were shocked. Each entree was 40.00. We got our bill and it was 175.00 - and the food was not that great. Very disappointing."}
{"text":"The most incredible dinner experience I've had in Madison hands down. Line Naples 15 up next to the great culinary staples of downtown Madison and it runs with the best of them. Sal is one of the nicest, most welcoming, and genuine chefs/owners I've ever met. Lobster ravioli, lights out, it may be the best dish I've ever eaten. Bye-bye, you're traveling to your happy place. The patio, wow, the ambience is storybook. What an absolute pleasure. 6 stars."}
{"text":"Yes and no. 
I'll go again but that's basically because my husband said his first meal there was amazing.
We went on New Year's Eve, so right there things are goofy in the kitchen. Our sever was awesome. Awesome: as in we really liked him. Not awesome at his job. Seriously, he took our order while on the phone...like he had his cell phone up to his ear. 
Annnd I'm pretty sure he forgot we existed. It was a solid 30 minutes after we finished our dinner to when we got the check. Generally not a big deal, but I wasn't drinking that night and 30 minutes is a long time to just stare at someone while waiting."}
{"text":"Used a Groupon, tried the pizza and Pollo alla Salvatore pasta. Both were very flavorful. Server was great and the chef was present in the dining area and friendly to us. Fun atmosphere!"}
{"text":"Recently ordered take-out and got their Mushroom and Parmesan pizza, which was quite delicious! Also, it's obvious that they take time to curate their wine list. I greatly enjoyed their house red. It's on the more expensive side, but also one of the better food options in Madison. It's definitely a step-up from most offerings in the area."}
{"text":"This was my most memorable dining experience of any Italian restaurant I have been to outside Bucca Di Beppo in Milwaukee as far as WI goes. Everything from the venue, the ambience, and cultural appeal of the restaurant to the amazing best friend like service you get from staff and of course owners and executive chef Salvatore himself who I got to meet and talk to. Top notch across the board. 

My meal was wonderful. The chilled eggplant was my first non eggplant parm version I had and loved it. 

The insalata alla Naples was so simple but so very robust in flavor due to the natural and authentic ingredients and recipe they adhere to. 

The Margherita pizza was also simple in concept but big in flavor! All comes down to the San Manzano tomato, Italian imported flour in the crust and the stone oven they use to bake it in. The way real Neopalitin pizza was always meant to be. 

The monk fish entree was also amazing. It did have far more pasta with it then I expected as compared to actual fish but the fish, red sauce, pasta, olives, parma cheese......just delicious! A very unique dish unlike I have had any place else. 

Sal even gave me my pick of a house wine to have to end my meal and of course I went with my red! Wow was that good! Nice end to a nice meal and experience. 

I will try and make this a stop every time I come back to Madison to see family around holidays for sure. Better yet, I'll bring them in with me! This place is meant for families to gather around good food just as it would make for a ideal date night."}
{"text":"Went to Naples 15 for the first time last night.  Went with some friends who've been there several times before.  I go to Italy often (more than 35 or so times total over the last 45 years) and really think I know and understand Italian food.  My relatives in Piemonte cook for me and we go to many fine restaurants.  Understandably, I usually don't seek out Italian restaurants in the US.  They are often, in my opinion, \"fake\" Italian-American food.  (No, Italians do NOT eat spaghetti and meatballs as an entrée; meatballs are rarely seen but when served, they are always on their own, with perhaps a vegetable side dish---never with spaghetti and a big red sauce!)

Well, I had a very pleasant surprise at Naples 15.  The chef/owner, Salvatore, is a super-friendly guy and clearly cares passionately about his food.  He greeted us at the door (recognizing my friends, apparently).  I greeted him in Italian and he responded with delight and offered us some wine at the bar for a quick, preliminary toast.  Immediately after we were seated at our table, we received a complimentary small slice of Margherita pizza.  It was just the best pizza I've had in the United States!  It had been our intention to have a pizza night but after that we got carried away and ordered an appetizer, 3 entrees, and two desserts.  During the meal, we received complimentary bubbly due to a nearby birthday celebration (everyone dining shared the celebration with a glass of lovely pink wine).  We really enjoyed all three of our generously-sized entrees (two of us had take-home portions) and then were overcome by the desserts.  They were expensive but large and totally delicious.  I ordered the sfogliatelle which I've had in southern Italy.  These were top-notch!  We all tasted the two desserts and found them delicious.  Salvatore explained he used his own house-made ricotta in the filling of the sfogliatelle.  He brought a sample of the ricotta to the table.  I'd return to the restaurant just to have that ricotta again!  I found myself later dreaming of it topped by some sliced fresh strawberries.  Yum!  

My only criticism is that the pricing on the menu seems inconsistent.  Some items seem very reasonably priced and others seem very high priced, considering the ingredients.  Maybe a cost/price analysis of the entire menu would be a good idea.

The atmosphere is very \"old country\" and comfy.  We hope to go back next week for a pizza night!  Bravo, Don Salvatore!  A qui si mangia bene!"}
{"text":"Naples 15 is a lovely restaurant. It is the perfect place to celebrate with great food. Better off to come here when you're not planning on budgeting. It's not crazy expensive, but pricey enough to warrant an occasion rather than a casual dinner out.

The food is phenomenal. We ordered the #8 pizza and the lobster ravioli to split between two people. Cannoli for dessert. Everything was delicious. Would like to come back to try more of their pasta.

The staff here are extremely friendly and conversational. However, the meal was timed weirdly with the pizza arriving well before the ravioli, and having to wait quite a while to order dessert.

Bottom line: Come here with plenty of time and money. Enjoy yourself! :)"}
{"text":"Salvatore is the best host and the pizzas are the best!!!
The real taste of italia! Even better than in italia!
Bravo"}
{"text":"A super night at Naples 15! Wonderful food and atmosphere. Salvatore (the owner) celebrated several 12th night birthdays by cutting the corks off champagne bottles with a really big knife! After dinner at the bar we celebrated with basketball legend Rasheed Griffith and special drinks. A fantastic lovely delicious evening in an authentic neopolitan restaurant with a big hearted owner!"}
{"text":"My mom loves this place but the last time she came was a year ago. We came on a Tuesday night and maybe it was a fluke for the food and experience. The place was empty, the napkin we had wine stains on it. We ordered the pears and cheese appetizer and what came out was a liquid soup of pears and cheese. Not quite what I would expect, I was expecting a little more finesse from a $$$. Then was the entree we ordered the pasta with octopus. The octopus was subpar and the dish's best quality was the sauce and the olives. I'm not sure what happened compared to the other reviews here. But I probably won't be back, we're visitors from WA out here in Madison for family. Parking here is difficult expect to walk for a little bit if you can't find a spot."}
{"text":"Supposedly one of the better places in town.  I was overall unimpressed.  They ran out of pizza dough apparently.  Also my waiter ignored me (dining for 1) while he had a party of maybe 8 next to me."}
{"text":"Three of my friends and I went here for dinner tonight.  It was my birthday and they had told them ahead. Apparently they arranged a happy birthday song and dessert.  2 hours and 20 minutes later I left almost $50 poorer and sans birthday jubilations.  

Per our server, who I don't really fault for this situation (and is the only reason I am giving a 1), the owner/head chef made 3 separate reservations the house was not aware of.  This included a table of 12 that sat right next to our booth of 4.   

The table of 12 must have been pretty important because the owner spent about 60% of his time at the table, as did our waiter to keep the table of 12 fed.  The server told us he was having to put food together.   

Things that kind of sucked:
-20 min to order and 40 min to get our food
-1 hr and 20 min to eat and get the check/pay.  We were ready to go before this due to other issues.
-table of 12 was super loud 
-the sound system kept going in and out right next to us... softer music then blaring music.  Music also changed from rock to Italian to musical Italian.  The music was having a real identity crisis.  
-there was a centipede crawling around by us (it wasn't the worst because I know they are around no matter what, it just didn't add to the mood)
-no birthday jubilation
-no dessert (server didn't ask and I just wanted to leave at that point).  
-2 drinks offered for the entire time we were there (thankfully he finally bright a carafe of water 2/3 of the way through). 
-server would leave before we finished telling him something we needed and then wouldn't return for 10 min or so
-other tables in different sections were seated after us and left before us (a lot of them!)

The front of the house did not seem to be communicating with the back of the house.   They seemed under staffed.  The food was ok, but not worth our time and having significantly less service then another group of people.   

The server did replace a meal that was not as expected.   It was the fastest service we got that night too.   Again - the server is the reason I gave a 1. 

I won't be back.   The food and experience was not worth what I paid."}
{"text":"It's hard to write this particular review because we did have problems with service and food.  I wanted to like it because it seemed so warm and inviting in the beginning, but then our food order was completely messed up in that we didn't receive our salad for 40 minutes of which are entrees didn't come out for another 10 minutes after that.  The waiter apologized several times and even comped some of our drinks, but the mix-up was a little disappointing.  It was extremely nice of him to try to make up for it and for that, I gave three stars.  I just think the servers/cooks got overwhelmed with the amount of people there - even though it wasn't packed?

But then our food was only so-so.  We started with the Insalata alla Naples - spinach / oranges / strawberries in a balsamic dressing.  It was good.  I then had the special Ziti al Re di Napoli - ziti with pork, beef, San Marzano tomato, mozzarella, ricotta, fresh basil, Parmigiano Reggiano, and extra virgin olive oil.  The meat ragu was a little overwhelming and took away from the pasta part.  The pasta itself was good and overall - very filling, but the meat was too much.

My husband had another special - the Aragosta alla Don Salvatore - Fresh lobster tail served with cherry tomatoes, garlic, and parsley - baked in the wood oven.  It was fine, but nothing he thought was memorable.

Maybe they were having an off night?  Others around us seemed to like their meals, so maybe it was just our meal / experience."}
{"text":"Disappointing. Wasn't a busy Tuesday evening, had reservations,  seated quickly, received water, menus, and ordered. The waiter brought our glasses of wine then forgot about us until we asked 40 minutes later when our salad would be served.  He brought our pasta order, it was warm,  not hot. Brought out salad after a bit (now on the house). Charged us incorrectly (higher) for the wine.  Disappointed, won't be going back."}
{"text":"The food is top-notch.  My wife and I had the pizzas, which are definitely authentic Neapolitan style.  The crust was tremendous, slightly charred on the bottom.  It was thin with a rim of delicious crust around the edges.  She had the Reginella, which she said was the best pizza she's had since her travels through Italy.  I had the Funiculi Funicula with added sausage.  it was spicy and tremendous.

Now, I must say, if you're looking for the typical American pizza with lots of sauce and gloopy cheese, this isn't the place for you.  Their pizzas feature a delicate balance between cheese, crust, and fresh grape tomatoes (no sauce).  I had never had a pizza prepared this way, but I loved it.

So why only four stars?  The service was painfully slow.  We were headed to a concert that started at 7:30.  We got here at 5:45.  We ended up having to prod the waiter to hurry and we were still late for the concert.  The gentleman was very friendly and knowledgeable, and on another more relaxing night, this pace might have been just fine.  But just be forewarned.

I can't wait to return and try some of their other dishes that sound delicious."}
{"text":"We finally had a chance to check out Naples 15 last night, and I can say we were not disappointed! We had visited Italy this past spring and were really hoping that Naples 15 would live up to the Italian cuisine we had experienced in the actual home country. What we found was food that was truly loved by it's chef and food that was truly authentic to the Naples region.

The story of Naples 15 was also something we enjoyed learning about. The chef calls out 15 of the people who inspired him most. This as you can surmise is that 15 you see in the restaurants name. The chef also has a portion in the menu to tell you about the history of his experience as well as the history of the food of Naples.

So how about that food? We ordered the calamari, which was refreshing experience from the calamari you receive at most Italian restaurants. It was not fried, but it was cooked to perfection and tasted amazing. We followed that up with two pizzas - and oh . my . gosh! My mouth is watering thinking about it. I'd have to say Naples 15 is truly one of the top places in Madison to get some za!"}
{"text":"Arguably the best restaurant in Madison. The service is fantastic and the food is even better. I can't recommend this restaurant enough."}
{"text":"Disappointing. Pizza was runny. Gluten free noodles were undercooked. Pasta and sauce are just okay. Bread looked like yesterday's loaf sliced and toasted.  Server was very helpful and efficient tho."}
{"text":"As someone who travels for a living I am always on the lookout for amazing food and Naples 15 delivers!!!! 
The food is out of this world amazing! I have NEVER had better Italian food in my life!!
The staff is friendly, and the location is perfect. 
I will definitely be coming back every time I am in Wisconsin."}
{"text":"By far the best restaurant for Italian in Madison (and a top pick for all restaurants in the area!!).
 
The food - phenomenal!  We are originally from the Gulf coast states and visit our families on the east coast regularly. Meaning, seafood is a very big deal to us... the seafood (2 diff plates) were delicious. We had the lobster ravioli. The pasta was homemade, tasted just like my grandmothers. The desserts are all great - Especially the flaky lemon thing... My g/f who is a dessert baking 'expert' was blown away by its delicate texture and subtle sweetness.  The parmesan is really delicious also. Our favorite pizza is the tuna and onion pizza both times (weird combo but def. worth a shot). 

The service - On all four occasions within the last year, its been great. The chef and staff treat you as if you were in their home and prime royalty. He brought us a bottle of champagne for our Christmas party on the house; gave us samples of his meatballs (which were excellent) and even took the time to personally walk us to the door after our meal. What's more is that the chef emphasizes the idea that no matter when you arrive, you're allowed to stay as long as you like. We walked in at 10pm (they close at 10:30) on our second visit - and didn't leave until 1am... as they gladly seated us the waitress said, \"please stay as long as you like, there is absolutely no rush this evening\".  No matter the party size, expect to be treated like well. 

Other reviews may diss the Christmas lights but I think it adds character to the place. Plus you'd probably miss it if it wasn't for the lights in the window. There is a balance of romantic elegance and a comfortable vibe in the restaurant. It's in a great location. If you want to eat junky Italian food and save a few bucks, go somewhere else. This place is a hidden jewel and worth the extra 10-15 bucks for a high quality meal that leaves your taste buds and stomach feeling good about your decision."}
{"text":"I came here last week for dinner with 2 friends since I had gotten a voucher from Capitol Fitness. I had looked at the menu in advance, and noticed that it seemed pricey. Since there were 3 of us and we didn't want to spend too much money, we ordered 2 pizzas, and a pasta dish to share. The deepfried pizza was really tasty, and unlike something I'd had before. The Supreme pizza was very interesting, and had a lot on it. The pizzas, however, were both about $15, which I felt was a little too much for them. The pasta dish we shared was Linguini alla puttanesca, which was alright but very simple, and also overpriced. The ambiance of the restaurant was very classy and soothing, but I didn't love that it was right next to the gym. Overall, I don't think I'd come back unless I had another gift certificate."}
{"text":"The good and the bad..
Made reservations but the man did't ask for a name? I gave mine anyway and guess what? No reservation when we got there. Bar is small and they allow eating dinners at the bar on a Saturday night which annoys me. The service was really slow for some unknown reason, it wasn't all that busy. Salads got there before our appetizer, the bread is that flat stuff greasy stuff which I hate, is served on a plate full of olive oil and pepper.( The bread doesn't wipe up the sauce which is part of the deal in my book). The Caprese Salad was a really big disappointment. Two big balls of very good mozzarella with a couple of cherry tomatoes cut in half, a couple of lettuce leaves and very little sauce. What were they thinking? It needed a mix of this stuff. One ball of the cheese with more lettuce and tomatoes and sauce would have done it. The meals that we had were good but not great. The special was supposed to have three meat balls in it and had two. Our waitperson was nice but never there when we needed something and we spent lots of time rubbernecking for her. It is expensive here but the meals are big. We shared ours. The average price was thirty bucks but our special was around twenty this night. Again it was good but there are other places just as good or better that are not so expensive.. I do like the cosy space and it wasn't too noisy which was a relief. Do not plan to return any time soon but you might like it. If they served a good Italian bread with butter I might consider it. Petty I know but wiping the plate with bread is the Italian way isn't it?"}
{"text":"This place has potential.

My first experience with Naples 15, and it was for the fixed menu Valentine's Day dinner.  Excitement was high as we walked toward the establishment and the air was filled with an intoxicating aroma from what I could only assume was the wood-fire oven.  As we walked through the door, we were hit with scents of garlic and basil.  We were sure to be in for a treat.  That's where things began a gradual decline.

We were seated at the table and informed of the Valentine's Day menu (of which we were already aware from research on the Internet, but I had assumed we could order off the regular menu).  The fixed menu included two glasses of champagne per person in the price.  For an upcharge of $60 dollars, we could have ordered a bottle of choice red or white wine.  We decided against this option and opted to enjoy a cocktail with dinner.  

Started off with a slice of the Margherita pizza that was amazing.   

Second course was a single scallop provençal baked with herbs and olive oil, that had set the meal on a delicious progression.  
-at this point, we had finished our complimentary glasses of champagne and asked the waiter for a drink menu... which was a wine menu... with no other choices for beverage.  Still not sure if a patron could order anything to drink other than wine.  

Third course was a Caprese Salad that was uncomplicated but tasted good.   
-before the fourth course was brought out, we had to remind the waiter that we would like to order a glass of wine, which arrived fairly quickly.  

Fourth course, I went with a Lobster Ravioli in a cream sauce while my wife went with the Five Cheese Ravioli with procini mushrooms and fresh cheese.  Both were phenomenal, and I found myself skimming my plate with a fork to get every last bit of sauce.  

Fifth course was the most disappointing.  I went with a dish that consisted of various shellfish and paccheri pasta (pasta shaped like large tubes).  My wife went with the ziti served with a slow-cooked two-meat ragu.  My wife's dish was unremarkable and reminiscent to her of canned beef stew.  My first bite of shellfish pasta was fishy. I understand seafood pasta will taste like seafood, but this was overwhelmingly fishy.  As I continued to eat, I had gotten a mouthful of grit and the occasional broken shell.  There was one smaller peeled shrimp on my plate along with one larger unpeeled shrimp.  The smaller shrimp was like rubber and I had to get my hands dirty to clean and peel the larger shrimp.  To cap it off, inside the last piece of pasta there was a little, sad, gray shrimp head staring at me.  Not exactly my idea of rustic.  

Finally, dessert was described on the menu as flaky pastry topped with roasted pears and a cream sauce.  What we got was three Costco-brand creme puffs in a bowl (that were still frozen in the middle) topped with a slice of strawberry and watered-down condensed milk.  My wife best defined it as cereal milk left over after a bowl of Lucky Charms.  I ordered a cappuccino to enjoy with dessert that I actually finished before our final course arrived.

At the end of the evening, the Chef came out to the dining room and cut off the top of a bottle of champagne to pour for everyone at the tables.  He then offered roses to all the women in the restaurant, followed by shots of Amaretto for everyone.  

Overall, it could have been a better experience.  I don't know if we will ever return.  But if we do, it will be for carrying out the pizza.  This feels like a restaurant that is going through an identity crisis.  If entrees are going to range from $15 to $40, drop some bread on the table with olive oil and balsamic vinegar.  Shave some parmesan cheese table-side.  Scrub the shellfish so the patrons won't get mouthfuls of sand.  Make me feel like I am walking out of the place with a positive dining experience, and not that I just had dinner sitting at high school library chairs in the ground floor of a strip mall."}
{"text":"Absolutely delicious and the chef, Salvatore, is not only a great chef but also a really nice, warm person. The pizzas are simple and perfect, the pasta sauces are complex and leave you craving more. Fabulous spot!"}
{"text":"We had  a Groupon for this restaurant and we were very excited to try it as we had not been there before.  Unfortunately there was a large group that was also in attendance and it seemed all the attention was on them.  We waited a long time for a waitress and when she finally arrived she seemed rushed as she was also attending to the large group next to us.  The calamari appetizer was quite good but my seafood linquine did not have any flavor and the noodles were not quite done.  My pregnant daughter also ordered a seafood dish with red sauce and not only the pasta was not done but the seafood was not thoroughly cooked.  Since pregnant she didn't want to chance the possibility of eating undercooked seafood so asked to order a meat dish instead.  That dish had flavor but again the pasta was not al dente and undercooked.  We were both very disappointed at the quality of the food and the slow service.  Probably would not go back as there are many other wonderful  places to eat in Madison."}
{"text":"the best italian restaurant on earth. if you rate anything lower than a 5 star, you're a fraud."}
{"text":"Authentic Italian food.   So, so, so good.    Go hungry because you will want everything on the menu.   We had a fish dinner cooked perfectly and a traditional inland pasta.   Also had the eggplant Parmesan, which I do not traditionally like.  It was fabulous here.   Dessert are all good.   Just go.  You won't regret it."}
{"text":"This restaurant is simply the best Italian food and friendly place in Madison True Neapolitan and authentic cuisine Bravo chef Salvatore Di Scala"}
{"text":"What a fabulous evening at Naples 15.  It was the first time the four of us had been there, and boy we've been missing out!  The Eggplant Parmesan and Gateaux alla Napoletana appetizers started the evening out right.  We followed with a Margherita Pizza, Lobster and Crab Ravioli special, Ziti al Re di Napoli, and Scallops Diaz  for our main courses.  Each of us licked our plates clean!  Dessert consisted of Cannolis and this unbelievable Sfogliatella which was a shell shapped pastry filled with a sweet ricotta filling - even though we THOUGHT we wouldn't like the ricotta, we decided it was the best Italian dessert we've ever had.  Ann was our waitress and she was so knowledgeable about the menu.  It doesn't hurt when Executive Chef Salvatore visits your table to answer questions as well--what a treat!  The atmosphere just made us want to dance around the tables and sing, \"When the moon hits your eye like a big pizza pie, that's Amore!\"  VISIT NAPLES 15, WE PROMISE YOU WON'T BE DISAPPOINTED!"}
{"text":"The pizza here is INCREDIBLE, but pricey. It's the only place in Madison you can find authentic Italian pizza. My boyfriend and I order from here all the time, and the margharita pizza is my favorite."}
{"text":"Excellent Italian food served and made authentically. Everything is delicious, but the pizzas are the best deal. Amazing food!"}
{"text":"Far and away my favorite Madison dining experience of 2017. My wife and I went in for a Friday dinner, and arrived a half hour early so we took seats at the bar. The bartender (Sebastian I believe) was very nice, and recommended a wine that wasn't listed on the menu. It was fantastic, and made better by him telling us the backstory of the vineyard. 

Once we were seated, the meal was amazing from start to finish. We started with the calamari, which is baked in the wood fire oven, not breaded like most places. Phe-no-me-nal! For entrees, my wife had the veal with pasta, and I had the whole red snapper (friday special). Both are highly recommended. It was all so good I didn't even remember to snap any pictures, which is rare for me. 

The owner, Salvatore, is larger than life and goes out of his way to make everyone feel at home. We felt like we were part of the family dining there. Service from top to bottom was incredible. 

We spent a month in Italy earlier this year, and have been yearning to find a place that reminds us of the food, the wine, and the general feel of some of the trattorias we encountered on our trip. Naples 15 exceeded all of our expectations and made us feel like we were back in Italy, sipping wine and overlooking the coast. Thank you Salvatore and Sebastian for a wonderful experience. We will definitely be back."}
{"text":"I went to Naples 15 on the Friday of Memorial Day weekend and then I spent the rest of the weekend telling every person I saw how amazing Naples 15 is. The Neapolitan pizza is fantastic and my friends and I ate two immediately. The sauce was so fresh and the crust was so delicate that you could tell they put a lot of effort into their food. We got the baba for dessert and it was unbelievable. Our waitress was the sweetest and was super attentive. Go to Naples 15 and you will not be disappointed!"}
{"text":"Take-Away: Lovely ambient date spot near the Capital suffers from poor value and mediocre food. This up-scale Italian restaurant boasts a promising menu with more misses than hits. The service was great and the food was garbage.  

Food: The food was beyond mediocre and very expensive. 

First we had the INSALATA ALLA NAPLES 15. It sounded great on paper but was poorly dressed, lacked much of the fruit in the description, and the oranges in the salad were covered in pith and very bitter.

For an appetizer we had their Calamari which was okay but could have been hit with some salt. 

I had the PAPPARDELLE ALLA MARINA GRANDE - which amounted to a bowl of poorly dressed arugula (not seasoned well at all) with a minuscule amount of ricotta, a touch of parm, three or four halved cherry tomatoes and a bit of under al dente egg noodles. Guess how much? Nearly $30!  Horrible Value.

My dining companion had the Four Cheese Ravioli in Cream Sauce which was fine, because it's really hard to screw up cheese ravioli. 

We had Negronis with our meal which were watery and not very good. You'd think an Italian joint could make a good negroni. 

Ambiance/Service: Very nice ambiance with lots of fun Italian paraphernalia. Our server was incredibly charismatic and knowledgeable. She was perhaps the highlight of a mediocre meal.

In the restaurant's defense, I have had great pizza here in the past but my review reflects my most recent experience. I didn't have time to relate my experience to the restaurant but imagine they would do a good job with recovery. 

For better Italian try: Osteria Papavero - Lombardino's - Greenbush"}
{"text":"Came here on a weekday evening with reservations. The restaurant was cozy, with two open rooms and a couple of booths. There were both high tables as well as smaller, lower tables. At a certain time, the lights dimmed and the candles were lit, which added a nice romantic ambience. To start, we were given some bread drizzled with olive oil that was very tasty. We ordered two seafood dishes (linguine al limone ai sapori del mare and gamberi e capesante) and a pizza (half ischia - rocket and half santa lucia lutana - mushroom).  The pizza was tasty and the price was fine for the quality (I know previous reviews have mentioned the higher prices, but this is no fast food chain so higher prices are to be expected) - we had a lot leftovers for the next day! The pastas were excellent and is hands down the best seafood I have had in Madison thus far. The portions were large and the pasta was perfectly cooked. I enjoyed the gamberi better than the linguine, as the flavor of the linguine was a little light for my own personal preference. 

One thing to note is after we were finished with our meal, we wrongfully assumed that the check would be brought out to us. After about 20 minutes, we realized that we had to call our waitress for the bill, so keep that in mind if you are ready to leave and just waiting! Definitely will be back."}
{"text":"What a gem of a restaurant on Butler Street.  This is the best authentic Neapolitan food, and hospitality in town.  Thank you again Sal for a great afternoon lunch."}
{"text":"This is by far the best Italian meal I have ever had in my entire life! (And I'm Italian!) I highly recommend the number 15 (the best calzone I have EVER HAD!!!!) The head chef came out to give us his recommend dish... Boy was he right! This is the perfect place to bring a date or loved one. But be careful you may be blown away on how GREAT the service and food is!!!"}
{"text":"Giving this a three based only on the food quality.. This  was without a doubt the worst service I have ever experienced in a well reviewed restaurant. The wait staff appeared very sparse and not trained. Personable but not handled well. The dishes for our party trickled out over what seemed like an eternity but was probably 15 minutes. The waiter served the wrong dishes to several of our party....more then once. It might have been funny if it wasn't a special wedding dinner. 

I didn't pay so not sure if any consideration was made iwth the bill. But even that was slow coming. 

Not sure I would go back. Madison has lots of options"}
{"text":"I don't speak Mexican so I couldn't understand the pizza dude but man the food was phenomenal! I hate eating anything other than fast food but I had a gift card from speedway and wow wow wow"}
{"text":"Cute place, very expensive, food is too far inland to be fresh.... it was about $80 for two people WITH OUT drinks.. just two entrees (salmon) the salmon was obviously farmed because it tasted so bland... I would pass this place up. -waste of my .. plenty to see in Madison besides this place. But hey, If you want to eat in this area, everything is over priced unless you have snobby friends and/or a trust fund you don't mind dipping into"}
{"text":"Loved this restaurant. Delicious food, great service and enjoyed meeting Salvatore. We tried everything from the caprese salad to pizza, seafood pasta, baked calamari and more! All wonderful dishes."}
{"text":"I was in Madison with two of my brothers visiting a fourth. We wanted Italian food. We visited Naples 15 and were very pleased-good food and excellent service. The menu was a little busy for us so we asked our server, a nice young maned named Emiliano, to surprise us with some appetizers. One of the dishes he brought was margarita pizza. I would not normally order a pizza appetizer, but it was very good; nice, fresh bread crust and good sauce.  Meatless lasagna, scallops, and the desserts were all excellent. Excellent place off the beaten Madison path."}
{"text":"I've been looking for a place like Naples 15. The pizza is so authentic. It reminds me of the pizza I had it Italy. The gnocchi is fresh. The wine is fantastic.

I went with a bunch of girlfriends for our foodie club and we had a blast. There was live music (friday night) and we were able to get a table (recommend making a reservation). We split about 4 bottles of wine, two pizzas, one pasta dish, and one salad. It came out to $30/person (table of 6). 

Service was attentive. It was a lively and loud atmosphere. Families galore celebrating different things. People catching up with each other. This is such a great, family friendly establishment. It would probably be great for a second or third date.

I am definitely coming back to try their other pizzas (which are reasonably prices). Pastas are a bit pricier, but worth it. They have specials (which you have to ask about sometimes). 

Parking is limited to the street (good luck)."}
{"text":"I came here on a groupon deal, which by the way is really great! This place is authentic and I love the atmosphere inside. The owner is super friendly and personable. He visited every table and talked to his customers. I think this added a really friendly touch to the whole experience.

Onto the food, it was amazing! We had a pizza as well as two pasta dishes. (I can't remember what the names were). Being in Madison, I am always craving seafood so I ordered the two pasta dishes with seafood. They make a strong case for the best seafood in town! Loved it. We were also able to personalize our pizza a little bit and I really appreciated that."}
{"text":"Last night I had the pleasure of celebrating my dad's 60th birthday at Naples 15 and our experience was fantastic. I cannot begin to recommend this restaurant enough. 

This place would be perfect for a date night, they have a cozy atmosphere complete with a grand piano, a wood fired oven and lovely set tables by candlelight.  The service draws you in, its personal and with impressive attention to detail.  Our server made sure we knew about the specials, not because he wanted to sell them, but because the chef had taken the time to make an extra special veal meatball and had brought in a shipment of wild boat for the week. The pasta, we were told, is a side with many entrees but they don't specify which kind.  That's because it's will be whatevers fresh, they take their time to do things right here. You won't find 20 types of pasta because that just screams precooked or old. Our server shared so much with us in a way that felt like family, he really made it special. 

The food was fabulous too. Our tangy cheese and proscuitto crudo was perfect for enticing the palate. The pacing here was on point, as we had plenty of time to digest, enjoy and even anticipate the entrees to come! I had the boar chops with pasta and the pasta truly blew me away. You may think you know pasta, but then you try truly al dente pasta, fresh, with a home-made sauce and THEN you will know.  Muah! My dad had a lovely medium rare filet and my mother had a luxuriously creamy lobster ravioli.  That was easily my favorite. If I didn't already make a cake for our treat, I'm sure we would have ordered a few desserts, everything so far had just been so good! Our server made us feel welcome to stay, though, the table was ours for the night.

I haven't captured well enough how much nicer this place is than every other Italian restaurant I've tried in Madison, but I challenge you to give it a shot.  If I lived here this would be in my steady rotation."}
{"text":"Great food, Great service. This is a place you go to have a nice dinner. THe negative reviews I have read seem to be more fast food people then diners. Relax and enjoy what you are eating and this is the place for you. In a hurry grab a great pizza and go. Don't miss out. Yum!"}
{"text":"Quick, friendly service. Unreal appetizers and entrees!!! You can't beat this place...5 stars without question."}
{"text":"This was our first time going to Naples 15. Everyone was very friendly and our server recommended a few of the popular dishes. The atmosphere was very cozy and the menu looked very authentic. My husband had the pollo a la Salvatore and I had the ziti al re di Napoli.  Both dishes were phenomenal. We had an amazing dinner. As we were about to leave, the chef came by our table with a post dinner drink, which was very refreshing. I would definitely recommend Naples15 and will for sure come back again."}
{"text":"Naples 15 is such a good find.  Wonderful food and even better service. This restaurant features an extensive wine menu with rare selections from Italy chosen specially by head chef Salvatore di Scala. Sal is obviously passionate about his food, drinks, and clientele, and offers the best in hospitality. 

Come here for an excellent, personable dining experience you'll want to return to! Chic."}
{"text":"I had noticed a sign for Naples15 one time when I was walking over to the farmer's market, and then this evening decided to take my family there on a whim.  We were initially a bit skeptical, even on a Friday night the restaurant wasn't full, and we were able to be seated immediately.

Upon being seated, the guy who seated us (who seemed to be a maitre'd//busboy) talked us through many of the items on the menu.  He had a heavy accent, may have actually been Italian, I'm not sure.  While we didn't really understand everything he said, what was apparent was just how passionate and proud he was about the food they served, and with good cause.

We started with the cheese and prosciutto appetizer which was very good.  One review mentioned this, but said that their prosciutto was charred.  I think it was actually the basil leaves, which do get a bit charred, but the dish was delicious.  The cheese was mild, but salty, and really went well with some bread.

The the main dishes arrived, I had the Pollo alla Salvatore, which had a really unique, smokey taste which I wouldn't have expected I'd like, but ended up tasting excellent.  My parents had the two ziti dishes that are slow-cooked for 6 hours.  Both were great, but the Ziti Reginella was the clear favorite of all of us.  Everything in there was flavorful and tender, and the sauce was...brothy...I suppose, but in a really good way.  I would highly recommend any of the dishes we had, but expecially the Reginella.

Hands down, this was the best Italian food I've ever had.  I've not been to Italy, but I have an inkling this is probably true, authentic italian.

The service wasn't great, not bad either, but with food as good as this, I'd place the order myself and walk back to the kitchen to pick it up.  My parents, who live in Chicago, left proclaiming that they'd be making monthly visits now just to go to Naples15."}
{"text":"Authentic, not dumb down Americanized-Italian food. My wife and I are so glad we dined here. Their veal actually tasted like veal, and their seafood is fresh. Friendly wait staff and the best part is, chef and owner Sal, he comes out to great you and offer you free drinks."}
{"text":"The best authentic Italian in Madison. Di Scala oversees the cooking with an expert eye, and the food is fresh and delicious without being too heavy. Service was friendly and attentive, and the atmosphere makes it feel like you really took a trip to Naples! Perfect for drinks, fancy dinner, or tasty antipasti before a night out. We will definitely be coming back to Naples15!"}
{"text":"This place is awesome. Salvatore Di Scala, owner and Executive Chef greeted us at the door. One of the best Italian restaurants in the area! If you are looking for a restaurant that offers large portions, fresh EVERYTHING, and a clean and friendly atmosphere - is the place to dine. The service is excellent and the setting is romantic. Most important, the food is A+. I felt right at home. If you love Italian food, you have to try Naples 15. Great wine selection! HIGHLY HIGHLY RECOMMEND!!!"}
{"text":"Ok here's the deal- This place is right by my house. I see them all the time. All. The time.

 Which leads me to need to comment that please, please for the love of god take your Christmas lights down after Christmas this year. Flashing, blinking, multi-colored string lights are not really in a good vibe with white tablecloth dining, especially in the spring. They've spent over an entire year up in your windows now, and for a place that's trying to be classy, its so tacky it makes me feel sorry for you. Especially since so often your open sign is off when you are open, and on at night when you are closed. But those lights... those lights are eternal.  (Edit- February is now almost over, and those lights are still up. All hope is lost.)

My overall impression is that they survive on the gift certificates that are handed out at Capital Fitness, in the same building. It's rather expensive, too. They seem to have some very tasty food, but terrible service and an overly complicated menu that they are incapable of preparing all at once if you order any 2 different kinds of food.  If you don't mind an adventure of not knowing what the hell will be on your plate when you get it, and can just trust that it is going to be tasty (and don't have any dietary restrictions to make this a gamble) then it might be worth a try.  They do seem to have a decent wine list, so just start drinking and let the Fates decide your meal. 

Anyway, when I came in with two friends, there was a clump of staff at the bar, who looked at us in terror and fled. We waited for someone to talk to us, eventually the bartender who was the only person actually in the middle of doing something, greeted us and said someone would be right out.  That turned out to be the Chef, in his whites. That's nice and all, but shouldn't you not be on the floor seating people? Shouldn't one of the other 3 people standing around have done that?  More importantly, he said something accidentally hilarious to us right away.  (His English is not perfect and that's fine, but it resulted in true comedy when he said, \"This your first time? It will be your last!\")

He took us to a table and spent several minutes leaning on it and explaining the ENORMOUS menu to us. Truly, it was a huge portfolio with several pockets of stuff to remove and take up more space than I had at my seat. Lots of variety and choices, at least.  He explained that even though each item had lots of ingredients listed, (including things like oregano and excitement.  ... what?) what you would actually get would be whatever he felt like was best right now to go in your food. I took this to mean \"we make seasonal adjustments like what mushrooms are in season, etc.\" That's fine. Only that turned out not to necessarily be the case...

Eventually a server came out, and had to shout over the music playing so loudly that the speakers were crackling. (Eventually the people at another table asked them to turn it down.) He had no idea what mushroom would be in the pasta I inquired about. (It said it had morels, which were out of season so I asked what they actually had.) And when he eventually asked, he said the chef just said \"The little ones. \"  You know, little one mushrooms.  Okay.

The real trouble was for my vegetarian friend, who ordered an item that did not list any meat in the ingredients. He said it was delicious, but then got to a layer that was composed of a huge piece of prosciutto.  So that was the end of that dish for him.  I tried it, it was good! But... really they should say if they are going to just throw some meat in there today for good measure. 

My boyfriend ordered the same chicken dish he had enjoyed the last time he was there.  (He tells me it was terribly bad service to the point of comedy when he first went, but that the food was good which is why we went, to give it another chance.) His dish came out looking completely different from the first time he had it, and with a different type of pasta. But he said it was tasty so hey, why not. 

Inconsistent is not a term you want to associate with a restaurant. Especially when you're in a space that has a long history of being a death-trap for cute little well-meaning restaurants."}
{"text":"Unbelievable, what a gem. Fantastic food, the chef was amazing and made our experience very personalized. What a wonderful evening, thank you Salvatore! Everything was perfect."}
{"text":"My boyfriend and I just went to Naples 15 on an ULTRA busy night and they accommodated us and provided excellent service. HUGE thank you to Sebastian for recommending a delicious wine and entrees! He has been our server multiple times and always works so hard throughout our time at the restaurant. We have seen him going beyond what is needed to serve the customers and it is much appreciated. Additionally, it is refreshing to see the owner of an establishment so involved with the activities on a Tuesday night. I ALWAYS look forward to my experiences at Naples 15 because they are delicious and irreplaceable. Thank you for being my family's go to restaurant for celebrations. Much Love!"}
{"text":"A true gem of a restaurant in Madison, WI.  A must try for true Italian cuisine.  I would consider my evening more of an event, that consisted of trying many wonderful dishes.  Main courses were the red snapper and sea bass.  All the items we had were selected by Chef Sal and I loved each one.  I am not a cappuccino, or coffee person and even loved that!  Great job Chef Sal I will be sending my friends to your restaurant!"}
{"text":"We went to Naples 15 for my birthday on June 1st.  It was the most inviting and personal experience we've ever had at a restaurant.  Jeremy our server and bartender was extremely knowledgeable and attentive.  We started with one of the pizzas that was divine then each had an entree Jeremy recommended.  Sal the owner made a special stop at our table to visit as I have been to his home of Ischia.  He went out of his way to make a tasting of the lobster ravioli for me and finished our meals with the best coffee we have ever had.  I plan on taking all friends and family to Naples 15 as the service, atmosphere and especially the food are top notch!  Thanks guys for making my night so memorable!"}
{"text":"The food is very good, so I feel bad giving fewer than 4 stars. This is actual authentic Italian food, which isn't that easy to come by in the Midwest (sorry people). Everything from the pasta to the pizza to that baked cheese appetizer is great.

The ambience is really nice too! I like the raised area for tables. 

A few issues that made me consider giving three stars:
- horribly slow service. there were maybe two other occupied tables on a weekday evening but we were still basically ignored.
Took forever to order, get our drinks, etc.
Like an absurd about of time for things that, unlike food, have no reason to take a long time.
- NYC prices in Madison. I get it, you're a good restaurant, but you just won't be successful when there are plenty of other great places that are much more affordable. Seriously more expensive than A Pig in A Fur Coat and Heritage..."}
{"text":"Came here for a friend's birthday. Had the appetizers and pizza. The food was delicious. Also had dessert and they played the piano for happy birthday for the birthday girl. Overall a great experience. It shows that they really care that their guests have a great time and love the food."}
{"text":"Nice atmosphere very much like a true trattoria in Italy. Food was really exquisitely good. Appetizer with mashed potato with Parmesan cheese baked in the oven was out of this world. I had one of the chef's signature dishes, the ziti with 3 meat ragu sauce. Fantastic and big portion.  The desserts were also delicious. So food was great.

Now why not a 5 star?  Part of all Italian meals is bread, particularly to mop up the great sauces. The waiter brought two tiny pieces about 2 inches across and 1/4 inch thick. When I asked for more bread, he acted peeved and brought 2 more tiny pieces. Second, the restaurant is overpriced for all but the pizzas, even considering how good the food was. $15 appetizers should've $10-12. Main courses of pasta at $32 should be $20-25. Last, service was a bit slow.


I will likely return because the food is so good, but hopefully the chef/owner gives out bread more freely, especially at those prices!!"}
{"text":"Ate at Naples15 on Saturday night and had a wonderful experience!  Nice atmosphere although very slight smoke from the wood oven was noticeable bit not bothersome. 

Food was amazing!  Tried the fried pizza at their recommendation for an appetizer which is an different and fun dish to share.  For entree, we enjoyed the Lobster ravioli from the special which was outstanding with nice chunks of meat and perfect amount of sauce (not too little!!).  Splurged for dessert with the baba which is a nice change from the typical cannoli's or tiramisu at every italian place and was perfect to share. 

Service was perfect not overbearing but attentive and offered great recommendations.   Also a great touch to have the chef stop by with each course to check in to see how we were enjoying everything. 

Definitely look forward to returning to Naples15 in the future."}
{"text":"My friend and I ate at this little gem last night. Our waiter was excellent and took time to help us with their gluten free options. We had the delicious marinated eggplant for an appetizer and split the paccheri con Polpette al Ragu di Pomodori with gluten free ziti pasta and it was by far the most delicious Italian food I've ever had. The sauce was to die for! This is the real deal authentic Italian that is hard to find in a restaurant outside of little Italy in Chicago (and this tops most of those). You can really taste all the fresh ingredients and the sauce tastes like it is simmered for a long time. We loved the vibe of the place! Our meal ended with a complementary after dinner drink. Salvatore, the owner, Maude us feel like family and we will definitely be back the next time we are in town! Within walking distance from the Hilton/convention center. You must try this amazing food!"}
{"text":"I have known Salvatore for years and was eager to try his classic Italian restaurant. Beautiful atmosphere and classic Italian pizza. It reminded me of my trip to Italy years ago. Definitely worth checking out.  His passion for great Italian food is awesome!"}
{"text":"Salvatore is an excellent chef! My husband is from Italy and he even agreed that the food was amazing!  We WILL be back!  The owner chef was present and sociable like an actual restaurant in Italy. Our server was knowledgable and very friendly. If you do not experience Naples 15 you are missing out!!"}
{"text":"Hidden Jewel in Madison

While visiting our daughter in Madison we had dinner at Naples 15 at her recommendation. Residing in San Francisco and Manhattan our expectation were not too high. What a pleasant surprise. One of the best Italian dinners we ever had and that includes Italy. The frutti di mare appetizer was fresh and very tasty. the veal meatball pasta which was served al dente with amazing sauce.Best I ever had. The Neapolitan pizza was authentic and delicious. Great wine and deserts. A perfect meal. The service was outstanding and the atmosphere very pleasant. Highly recommended and will definitely come back."}
{"text":"Visiting from LA and Naples 15 was highly recommended by a friend living in Madison.  This restaurant has also been voted #1 restaurant in Madison and no wonder.  It is by far one of the best Italian restaurant I've ever been to . Started off w/ricotta cheese pizza and oven baked calamari. Delicious!  My husband had veal and linguini in cream sauce and my daughter had the lobster ravioli (she said it was the best lobster ravioli she's ever had and I have to agree after she gave me a bite or two.:)) I had lobster w/linguini in cream sauce and it was absolutely delicious. Best cream sauce linguini I've ever ever  had.  Finished off w/their warm sponge cake w/pear and it just melted in my mouth.  So so good!! So sorry we weren't staying longer because We'd love to come back again!!  Thanks to our wonderful waiter, George, who made such great recommendations and was extremely helpful in choosing our entrees."}
{"text":"Probably the best all around food in Madison. The pizzas are amazing. The lobster ravioli is to die for. We are never let down every time we come here. Such great authentic food."}
{"text":"Wonderful food, service and environment. Couldn't be any happier with our first visit to Naples 15. Highly recommend the pizzas and gnocchi!"}
{"text":"I've been to this restaurant a few times now, and looking back on it, I have a few helpful tips to ensure a good experience:

- Order a glass of wine: There are SEVERAL options to choose from, and don't be afraid to ask questions about what to drink based on what you're hungry for. 

- Don't get disappointed by simple dishes. That's real Neapolitan! So often I think people want some crazy, multi-ingredient meal, but the best dishes are the ones with fewer, high quality ingredients. Some of the best plates have only a few components and are definitely worth trying!

- They have amazing seafood options that taste very fresh! I love the lobster ravioli!

- Definitely, if nothing else, order a pizza. Those have never been disappointing. They're crispy and hot and topped with authentic Italian ingredients. 

- Service can be touch and go depending on the experience of the waitstaff, so going during less-busy hours gives you more time with your server and will definitely ensure the best time.  Sometimes the chef, Sal, will come around and say Hi! He is by far the best part of the restaurant. I love his passion for food, his love of the restaurant, and his care for everyone's experience.

If the food alone were enough, I'd give it 5 stars. I just wish he had a better trained staff for the busy nights. It's sometimes hard to justify $40 for a seafood dish when the server doesn't even know everything about it, or can't spend much time with each table because they're understaffed. Making a restaurant feel as luxurious as it is requires much more intimate and knowledgable servers."}
{"text":"This is authentic Neapolitan cuisine at its finest. Salvatore di Scala is a master of his craft. Everything is prepared to perfection, with love and attention to detail.
Pizza, genuine Neapolitan pizza, comes from a beautiful wood-fired oven. If you have been to Italy and asked yourself why pizza can't taste that way in America, it does here. 
Portion sizes are often enough to feed two people generously. Take home leftovers if you must, but don't skip dessert. The baba is especially brilliant."}
{"text":"I had a hard time rating Naples 15 between a 2 and a 3.  The ambiance and the overall effort of the staff (yes we got free champagne for my Dad's birthday as described in other reviews) put us at a 3, but the food was truly average.  Additionally, the PRICE is what curbs this restaurant back to a 2.  We started with the special appetizer, calamari on the wood oven.  It tasted great!  However, it was $21 and our party of 4 each got 3 calamari's.  My mother and I both ordered a linguine with scallops, shrimp and clams for $22.  Very little flavor and I got literally 1 scallop and 1 shrimp, and that was why I ordered the meal.  The bread was delicious and i'm sure the pizza is great, however we will not return for this overpriced lack luster Italian flair."}
{"text":"Stopped in for dinner with a friend of mine who had a hair cut appointment upstairs.  I have several food allergies so we stopped in to take a look at the menu and see if I could find something to eat.  The chef/owner came out to talk to us and ended up making me a fabulous risotto!  We ate outside, had wonderful food, a lovely glass of wine... all in all it was a wonderful dinning experience."}
{"text":"Horrible! Went with a Groupon prior to a show at the Overture. We had one waiter then he moved on and we  received a new waitress. I ordered a glass of Proscecco and it came flat and almost warm. I asked about the Monk fish and was told it was a favorite dish and would come with linguini. It arrived with small pieces of fish, 2oz would be generous, with pacheri noodles. My partner ordered Gamberi e Capesante and asked for clams as a sub for scallops as he is allergic.He received 2 medium size shrimp and a very small portion of clams. Both dishes were basically the same. We never had the chef stop at our table although he visited every table around us. My partner is a chef and I have experienced these dishes in Milan we felt the service was poor, they were out of most Italian wines or so we were told. We will never go back and will tell everyone we know what a awful dinner and overall experience we had. Not sure if it is telling them you have the Groupon but if this is how they treat Groupon customers they are better off not offering them!"}
{"text":"Holy cow, was this a find!  We were a party of 10, and the owner made a lot of \"family style\" suggestions (e.g., \"order 3 Gateaux alla Napoletana for the table; order two pizzas for the table).  Everything was fabulous, from his showmanship opening the bottle of complimentary champagne with a knife (!) so we could all toast each other, to the care he took in guiding me in my gluten-free choices.  This was my first visit, but I will definitely come back.  And come back.  And come back.  Oh!  One more thing!  The waitress got every check absolutely right, including the drinks each of us ordered.  Amazing."}
{"text":"Sometimes its harder to find a \"real\" restaurant than you think. There are those places that seem to be legit, but for some reason have made shortcuts somewhere along the way. They might have all the ambiance necessary for a great restaurant, but then there is something that makes it fall short. Naples 15 is what I would call a \"real\" Italian restaurant. The ambiance is great, just the right amount of noisy with a very intimate atmosphere at the same time. It also seems like a great place to grab a drink. But let me talk about the food. My goodness the food. This is a place that makes me feel like in a REAL Italian restaurant (am I an expert on the subject, I suppose, I've been to alot of Italian restaurants) This place does not seem to cut any corners. I tried a caprese salad that seemed like everything was picked from their personal garden. The appetizer bread seemed like straight from their ovens. For the main course I had the Pacchetti Lardiati, and my goodness gracious, that thing was delicious too. One of my main criteria for a \"real\" Italian restaurant is their tomatoes. They've gotta be fresh, and man, this place has got those fresh tomatoes you only find at a real Italian restaurant. The meal was wonderful and huge, enough for leftovers the next day. The service was great too. My only issue was (and it is NOT enough of an issue for me not to come back) was the price. The bathroom was also not the cleanest I have ever seen and a little small. I would DEFINITELY go back though."}
{"text":"We were here once a few years ago when it opened as a new pizza place.  They have redecorated and it is cute and cozy.  My husband and companions had the lobster ravioli and they all said it was the best meal they have ever had.  The entrees were served on platter plates, each a different design and one with chips on the edges, just like you would get in Europe..  I ordered a pizza and enjoyed it as well.  Complimentary slices of pizza crust is served on a plate (like a bread basket) and it was tasty.  Service was excellent.  A couple of us ordered cannoli to go.  As we were waiting for our bill we were brought complimentary glasses of French amaretto which really topped off the meal well.  I may order that for dessert next time!  We differently want to go back and try some of the other items on the menu and other delicious sounding desserts as well.  We very much enjoyed our evening with friends and delicious food."}
{"text":"Special occasion restaurant prices but the overall experience doesn't quite live up to the pricing. While the food was generally solid, service wasn't, and the cost is high.

We went to Naples 15 to have a celebratory dinner as a change of pace from Lombardino's. My wife made the reservation and from the menu online I knew it wasn't going to be cheap. When we arrived, it took a good 15+ minutes after we were seated before our server noticed us. A different server had come to the table next to us several times, I tried and failed to get his attention, and eventually our server came over and asked if we had been helped. Nope!

We started out with a pizza, the exact name of which I forget. Had roasted red peppers, olives, etc. It was very good, but also cost $15.95 which is several dollars more than most of the other brick oven Neapolitan style places in town.

My wife had the pasta putanesca, which is basically spaghetti and tomato sauce with olives and capers, and it was like $17 or $18. I ordered one of the two ziti and meat sauce entrees which was *$29*. I got a generous portion but still. Both of these pasta dishes were good but not $29 good. 

We did manage to get a bottle of pinot noir for $35ish but it was a twist top bottle so I can only assume the restaurant had a healthy markup on it. When it came time for the check, the server informed me that actually, I had been given a different ziti and meat sauce entree special that's not on the regular and costs another $5, which they didn't charge me for, but they wanted me to know in case I wanted to order it again. 

The night ended with complimentary little shots of amaretto which was a nice touch.

Overall, I enjoyed the food in spite of the few misses with service. I just wish it were more reasonably priced. Basically any seafood or meat pasta dish is 30 bucks or more which I don't think this is quite at the level of."}
{"text":"I desperately wanted this to be good because I need more Italy in my life. It was not to happen. I can honestly say that I have never had a worse dining experience in my life. 

Where to begin?

Decor - Ugh, those lights! Bright spotlights on some tables. Total darkness on others. I was in a dark spot and could barely read the menu. And there were a lot of loud, angry sounds coming from the kitchen, like someone was having a tantrum featuring pots and pans in the back. 

Chef - This poor man. He was doing EVERYTHING. Making the espresso, visiting the patrons, *bussing the tables*, and yes - making the food. He appeared to be the only one working. I honestly felt for him.

Wine - We brought our own wine and asked that we open it there and pay the corkage. This threw them for a loop. They had never heard of a corkage fee. It took almost a half hour before the wine was opened. There was much drama during this time (and no food). 

Wait time - We were there for almost 2 hours (we did not order an appetizer nor a dessert). We went a full hour with only 1 small slice of bread each. 

Service - Oh my. So here's the deal: Our waiter was clearly higher than the Empire State. Highly agitated. Completely disorganized. Forgetful. Stunk of cigarettes. 

And then there was the grand finale. While delivering food to a nearby table, he balanced the tray in one hand while aggressively, loudly pushing chairs that were in his way with the other. With the final chair, he chose instead to kick it. Hard. The chair toppled over and went flying across the restaurant and into the back wall. There were audible gasps. I've never seen anything like it."}
{"text":"Authentic - sure.  Tastes good enough, but not mind blowing.  Shared a pizza and two pasta dishes.  Could tell the ingredients were good, but just didn't shine through for some reason.  Didn't feel this was a good value for the prices charged."}
{"text":"Food is pricey, quantity moderate and quality mediocre.  Make sure your willing to scream at your table mates.  I SAID  MAKE SRE YOUR ARE WILLING TO SCREAM AT YOUR TABLEMATES since it is sooo loud.
Would not recommend"}
{"text":"By far the best restaurant I have been to in Madison, Wisconsin. I ordered the Pollo Alla Salvatore and it was quite simply the best AUTHENTIC Italian dish I have ever had. The sauce was amazing, pasta cooked to perfection, roast bacon was delightful, and the sage blended in perfectly. The only thing the menu does not mention in the dish were the pear slices, (which the waiter was kind enough to inform me about as soon as I ordered it), but they added a sweet element to the dish. The service was very prompt and efficient. The atmosphere was very quiet, dress was casual, and I would say it is a very appropriate for just about any occasion. 10/10 would recommend, will definitely visit again."}
{"text":"The food here is still delicious and beautiful.  The server was helpful, friendly and attentive.    It should have been 4 or 5 Stars.  But a restaurant that has twenty to thirty dollar entrees should have a working bathroom.  My friend went to the restroom upon arrival but came directly out.  She mentioned to our server that one toilet was clogged and the second toilet was missing it's handle,  Thirty minutes later she attempted to go to the restroom again and both were still not working.

I really want to love this place but the functionality of the space paired with the imported food prices is a hard to sell to my friends.  Groupons help though."}
{"text":"A very nice Italian restaurant in Madison, I've lived in a Italo-Scottish area in Edinburgh for many years and have been to Italy a couple times. And I think the dishes I tried at Naples 15 were good and authentic. The pasta were not over-cooked, and not too creamy like many other restaurants. We also enjoyed the season dishes and desserts. The owner/chef makes the dining experience even better, he'd come out and chat with customers, and he even gave us a couple dishes/drinks free of charge. Almost felt like being in a family restaurant somewhere in Italy. I give it a 4 star because I've been a few times when the owner was not there, and the standard of the dishes were a bit let down."}
{"text":"If I could give 4.5 I would. Best Italian in Madison the 4 years I've been here. The truffle meatballs on special were to die for, and even the ziti and tomato sauce (which must have been homemade) were delicious. My wife got the lobster ravioli, and I had major food envy. The cream sauce makes me salivate just thinking about it, and the ravioli were packed full with lobster. No skimpin here. Pretty pricey, but the lobster ravioli was worth every penny. Look for them on Groupon! The only downside for me was ambiance."}
{"text":"A friend recommended this place as \"the best Italian food in Madison\" and I couldn't agree more. We had an incredible night! Our waiter was amazing and we had the best service and best food. We ordered a eggplant parmigiana and artichoke pizza... they were very accommodating to my \"no cheese\" preference. Thank for you tor an amazing Friday night Sebastian! The food was GREAT!"}
{"text":"This was my 2nd time here at Naples 15 and the food was amazing! Sal and his staff greeted me immediately when I walked into the restaurant. I had the lobster fettuccine and it was delicious. The restaurant makes you feel like you are in Italy. I would recommend this restaurant to everyone if you are in Madison, WI."}
{"text":"Good food at price of great food.  Pizza were good but at best on par with Pizza Brutta or Dolche Villa.  They did not have much selection of beer. Maybe the other authentic dishes are exceptional but I have not tried them. The vibe I get is they want to be close to Letoilla in image but they are not. For this place to work long term, mostly everything on menu needs to come down 40%."}
{"text":"Best Italian I've had in the USA as well as outstanding service. We had the lobster ravioli, wild boar with a pasta side. Both dishes were devine! The head chef and owner Salvatore went out of his way to make us feel welcome."}
{"text":"I have been looking for true Naples style pizza in Madison and this is it!!! So delicious and the owner is so personable!! He said to his bartender \" drink on the house for these nice people!\" It was awesome!!! Food is to die for!!!"}
{"text":"Wonderful experience and we will be back soon! The staff were amazing and attentive. The atmosphere was romantic and cozy. The chef came out to recommend what we should have for dinner, I went with his recommendation, Wild Boar. I have never had it before, enjoyed every bite. Would highly recommend, you feel like family."}
{"text":"Being Italian and frequently visiting Italy, I have struggled to find REAL Italian food in the states. Naples 15 is THE BEST ITALIAN RESTAURANT for an authentic experience and the best Italian food I have ever had outside of Italy.  The owner, Salvatore, was not there during my visit BECAUSE HE IS IN NAPLES!  Not Naples Florida but Naples, ITALY.  In other words, the real deal.  The manager, Jeremy,  stopped me on my way out and offered me a Sambucca.  The perfect end to a perfect meal.

If you want to experience real Italian food, this is the place!"}
{"text":"My first visit was for a rehearsal dinner and overall it was fantastic.  The owner was a wonderful host and the food was great.  He opened all of the champagne with a huge machete!!  We had a variety of pizzas and each of us got to select an entree.  The lobster ravioli that I had was amazing.  Very rich and the pasta was perfection.  My husband had the ziti with tenderloin meatballs and tomato sauce.  Unfortunately the sauce had been slightly burnt so it wasn't as good as it could have been.  It was a really fun experience.  We will definitely be back."}
{"text":"We had an amazing anniversary dinner at Naples 15! The atmosphere was charming and authentic. And, it is true Italian food! We ordered several items from the menus and we really liked them all. You can tell the owner is truly passionate about everything he and his staff create. We can't wait to return again to introduce our friends to this diamond in the rough."}
{"text":"Went there to celebrate my son's graduation from UW Madison.  Terrible Experience!  The waitress did not seem knowledgeable about the items on the fixed menu.  Three of us decided to order a la carte and my husband chose the 5 course prix fixe menu.  My son only wanted a pizza as his entree.  The waitress brought his pizza with the appetizers for the rest of us.  She also brought the second course for my husband BEFORE she brought the first Course!   As we are having our appetizers, she brought our entrees!  I said to her that you're not suppose to bring the next course until the previous one has been eaten and taken away and she said \"sorry about that, the kitchen is really messed up tonight and i didnt want your food to get cold\" and she walked away.  Of course the food got cold sitting on the table while we finished our appetizers.  The food was good for most part although the chicken was dry.  Very disappointing experience which was suppose to be a night of celebration"}
{"text":"Another great Madison find! This was a work dinner with a set menu. Everything brought out was very good. From the egg plant to the pizza.... it's all good.

Service was excellent as well.

Great stop for any Yelper"}
{"text":"As you can see by my profile, I don't Yelp as often as I could. It takes a lot to motivate me. That said, and this is saying a lot, the experience my wife and I had last night at Naples 15 is the best dining experience I have ever had in Madison. Seriously. 

We walked in for our reservation and, because we were early, we sat at the bar. There, we struck up a conversation with the bartender, Sebastian, who was great. He suggested a fantastic red for my wife and a tasty white for me, and when he found out it was our anniversary, flutes of complimentary champagne. We had so much fun we would up sitting down to eat a half hour later than expected. 

No matter. Once we were seated, Sebastian followed us over and said that he doesn't usually wait tables but, since we'd made such a fast connection, he would be taking care of us. He did. We gave him our order and in almost no time we were staring down bowls of some of the best Italian food I have ever tasted. Authentic, homemade pasta in a flavorful sauce featuring melt-in-your-mouth sausage. 

The problem is Naples 15 also has an outstanding selection of wood-fired pizzas. Solved it by ordering one to go for later (it, too, was fantastic, by the way). 

Halfway through the meal, Sebastian came back with a bottle of red that he explained had been ordered the previous night for a party, but that the group had left without taking it along. He reopened the $120 bottle and served it to us ... again, complimentary. 

From there we finished the meal, and we're offered dessert. We had absolutely no room (despite the dessert menu looking phenomenal), so the host stopped over with complimentary shots of the best Amaretto I've ever tasted. Had to sip is to savor the taste.

Upon finishing our meal, we noticed owner/executive chef Salvatore Di Scala seated at the bar. We walked over to thank him for such a wonderful experience for our special day. When he heard about the anniversary, he went behind the bar and poured four more Amaretto shots - for me, my wife, himself and Sebastian. He also gave us his card so we could set up a later meeting for some cooking lessons. 

The evening was perfect, our treatment was beyond outstanding and the food phenomenal. 

In a city where there are unlimited dining options, I make it a point to not become a regular at any one place. But we most certainly will return to Naples 15 ... and very soon."}
{"text":"By far the best Italian restaurant in Madison.

Authentic, delicious Neapolitan cuisine. I must've said at least 5 times that the meal tasted just like my italian grandma's...one of the best compliments I could give.

Shared a linguini puttanesca and a ischia paese mio pizza. Both were amazingly delish. The tomato sauce on the linguini was incredible and the crust on the pizza was to die for.

Ended the meal with a warm sfogliatella. Out of this world. I'll definitely be back!"}
