{"text":"A good Chana Masala and everything is right in the world. Never has this been more true than at Nataraj in the Annex. What a great place. 

I'm a fan of many cuisines from afar, but Indian food is by far my favorite. While my dinner companion might have died during the meal (a little too spicy, perhaps) I wasn't aware, because I was too caught up with the deliciousness of our Kadai Gosh (lamb cooked in a cashew paste with onions, potatoes and red peppers) and Baingan Ka Bharta (mashed eggplant, amazingly spiced). 

I had the best time. This place is super inexpensive. super tasty and  provides portions that are way too large (of which we left over plenty). Staff are courteous and knowledgable. The decor was mediocre at best, but those lucky elephants that adorn the place make up for everything. 

Added bonus-  pakoras on the house to start. We were there late and perhaps some had been accidently left in the deep fryer ;) 

Highly recommend."}
{"text":"I have been eating here for more than 5 years. Business and Pleasure. Solo and with groups. Excellent Indian Food. Consistently top quallity, made to order, very satisfying. Decor is pretty good for the area but dated. Service is solid and effecient.  My favourites selections would be the fresh NAAN, TANDOORI chicken, beef or lamb masala, and either the okra or eggplant."}
{"text":"This is the best Indian restaurant that I've ever been to. I've been here countless times and their food is always excellent. They are, imo, authentic indian cuisine. I even celebrated one of my birthdays here once. Their Chicken Tikka Masala is to die for and Mango Lassi's are very refreshing. Staff is nice. Decor needs a little updating tho."}
{"text":"I find it ridiculous that reviews are based on ONE visit. I've been going there for possibly 10 years or more and it has ALWAYS been good. The lunch buffet is not as nice as ordering off the menu but good if you have kids with you. If you order food extra mild that kind of defeats the whole idea of eating in an Indian restaurant. This food does have a bit of kick which you would expect. The portions are NOT small, they are average. I am vegetarian and the vegetables dishes are always great, especially the Tandoori Cauliflower. The price may be a bit higher than other Indian restaurants but not overpriced. The naan is very tasty and beats the pants off other local Indian restaurants. The food has a good taste and is not loaded down with unnecessary butter."}
{"text":"I stumbled into this place one night with my uncle who recalled having a less than pleasurable experience at Mt. Everest across the street. I'm sure glad we came in here! The place was packed, so it was a little slow, but it was worth the wait.

The kadai murgh and gosht biriyani are both absolutely delicious. It's also a terrible idea to come here without ordering some of the fresh naan. I don't have a lot of experience with Indian restaurants, but this is my favourite so far. (Even in comparison to the host, which is quite a bit more pricey.)

Writing this review is making me want to head over right now!
(UPDATE: I did!)"}
{"text":"Went today for the $8.99 lunch buffet.

Very good chicken tandoori and chicken saag -- both had good flavor with some bite. The goat curry was mild but tasty, with few bones.

Everything was fresh and of good quality, so I would definitely recommend Nataraj for the lunch buffet."}
{"text":"Sort of a two and half/three star place.   The food is all right.  Basic Canadian-Indian stuff, if a bit greasier than most of the Indian restos we go to (which is saying something, as Indian food's not noted for its dryness).  The naan's quite good, the curries are small for the money.

Tables are a bit squished together, so you get to know a bit too much about folks at the next couple of tables.  

Definitely not a date resto, unless you're into sharing intimate moments.

It makes it to a three from a two and half because it's clean.   

Not a place to avoid, but not someplace you'd take someone who wants to learn about Indian food.   There are better places accessible by TTC."}
{"text":"I don't know if there's been a change in management since I last went to Nataraj, but the quality of the food has decreased significantly.  

Samosas are hard to mess up, and so our appetizer was fine.  I ordered my favourite Indian dish, Navratan Korma.  I've ordered this in nearly every Indian establishment in the city, and I frequently make this dish at home as well.  I love seeing the different variations in preparation, often based on region, but when it arrived at our table at Nataraj, I was appalled.   You know that frozen vegetable mix of small diced carrot, corn niblets, string beans, and peas that you can find at any supermarket?  It was that, in Korma sauce, with a few cashews.  That's it.   I've never seen a lazier version of this dish.  I'm almost certain it wasn't prepared that way the last time I ate there, but that was nearly 2 years ago.  My dining partner has rarely ventured outside of butter chicken in the world of Indian food, but even he commented on the poor quality of his meal.  Very disappointed."}
{"text":"It's true, this place isn't the best place in T.O. but that being said, it's pretty good. 
I went most recently and got two orders of naan and the paneer makhani, take-away for a total of $15 (very very small tip included)
I love these naan. They are super big and just amazingly delicious. My paneer dish was yum but I could have passed on the almond slivers. I think it was a pretty decent amount of food for one person which could have been two meals if only it weren't so yummy. 
I've been here before to sit and eat with my family as well, our general concensus about this place it that's it's not bad. The main reason to go here vs. across the street is price, they are cheaper here. That being said, the food is more tasty across the street. 

Bottom Line: good for take-away."}
