{"text":"My Husband and three other couples went for dinner Sunday evening to celebrate our anniversaries. It was highly recommended by some friends in Sun Lakes. We were so disappointed. Several of us ordered the spaghetti and meatballs. The pasta was like glue and the meatballs cold. We did not complain, the server was so nice and attentive I just didn't have the heart. We were the only people in the entire restaurant from 6 till we left at 8. I can see why. We will not be returning."}
{"text":"We decided to give Natalias 1912 a try after having seen the restaurant a couple of times while getting pizza.   Wasnt sure what to expect after reading the other reviews but its a nice restaurant. Thre bread is really good (I mean European style good, not overly sweet, greasy US style) and the garlic butter is pretty tasty.  The salad bar only featured fresh items and is included with every (dinner?) entree.  I had the beef stroganoff and my wife the cordon blue. It was actually the first time we saw items such as the cordon blue, wiener schnitzel and beef stroganoff on a menu in the Gilbert area and they tasted very good.  The service is the only thing I was not too pleased about. I think we only got one refill of our drinks over the hour and a half period we were there so at times we felt neglected. Other than that, give it a try and you wont be disappointed"}
{"text":"food was below-average, prices above-average, portions very small. Everything tasted as if it had been heated in a microwave. I went on a Friday night, only 5 other tables occupied in the restaurant. This should have been my first clue.  The service was horrible. It was bad enough I should have insisted the waitress tip me.  There were three servers and 6 tables, it wasn't like they were over-worked.  The suggestion I would make to the reader is to eat someplace else."}
{"text":"Very disappointing.  Our first visit and likely our last to this place - wishing  I had read reviews before  trying. We were asked if we had reservations upon our arrival - it was early evening on a Sunday and there was one other table with a group of  four who seemed to be friends or family of the \"chef\".  We asked about patio seating, and were told we could but would have to get table cloth and service set up - it seemed like it was going to be a hassle, so we said ok to sitting in.  We were brought water and a bread basket  - I don't know what other reviewers consider great, but this was just \"ok\". Not hot or flavorful - just grocery store French bread. We ordered drinks, then decided to try the veal.  I had the veal piccata, my husband the veal Marsala.  Our salads arrived - a plate of romaine lettuce with two cherry tomatoes and a partial slice of red onion.  The lettuce was crisp, but you could hardly qualify what we had as a salad.  On to our entres.  Very chewy veal - I had a few bites that were edible - my husband did not do quite as well.  My sauce was overly lemon-y and featured an abundance of capers, but no other flavor.  My husband's sauce was very lacking in flavor.  Both of us chose linguine, and it was fine, but since flavor depended on the sauces, another disappointment.  We were polite to our waiter and the chef, but did let them know we were not very pleased with our food.  The waiter offered to redo my plate, but I really did not want to waste another 30 minutes. No other offer of compensation was made. We paid our bill, over $60 after tip, and made a hasty exit.  No other customers came in during our time there."}
{"text":"This place has a great french dip... Really enjoyed the food."}
{"text":"This is a hidden gem! Twas the night before Thanksgiving. We decided to grab some dinner and went to a restaurant nearby, but they had closed early for the holiday. We noticed Nathalia's was open and we walked in. We were greeted by the hostess who made us feel welcome and our party of six was seated. The menu is fairly large and Italian cuisine is the main fare.  I ordered veal parmigiana and spaghetti, my wife had the beef stroganoff. Another in our party has scallops and pasta, and two others had the veal piccatta. The meals include the salad bar, which had fresh-looking selections. The chef even came out to the dining room to check on us a couple of times.  The veal was moist and tender and the chef's special sauce was terrific. My wife enjoyed the stroganoff. The scallops were large and juicy. In fact, we were all pleased and surprised by this hidden gem in an otherwise nondescript strip mall/office plaza. We were all thrilled to \"discover\" this restaurant so close to home.   We will definitely return for another visit. I want to try the scallops myself."}
{"text":"Ok, just discovered that apparently, YELP \"evaluates\" reviews and then either \"recommends\" or \"not recommends\"...I never knew this.  I discovered this by accident when a friend went to read my review and couldn't find it. I have used YELP numerous times, for research, but had never been moved to write a review.   So my first review gets \"shuffled to the bottom\" and relegated to the \"not recommended\" section. For the life of me, I cannot figure out why.   I then discover that all of the other \"not recommended\" reviews are quite similar to mine. Had I known of all of these, I never would have patronized this business.  So, it's my hope that by adding to my previous review, and unwilling changing my review to two stars, my review may revert back to recommended , thus saving others from the experience I had.   Please, if this review stays viewable, look at the not recommended reviews for not only this site, but all others. You may be surprised."}
{"text":"Great food! Very nice atmosphere. Will return with friends. Salad bar very nice and Greek dressing and olives were great. Service was good. I would recommend. Pat H  Sun Lakes, Az"}
{"text":"Well unfortunately on the 8/17 reviewer, sorry to hear you say you won't try this place again. We had been to Natalia's probably about 6 times with the previous owner, and the last two times were not good. The first 4 were decent, but we had decided after two bad meals in a row, we were done. So we saw the \"grand re-opening\" in the San Tan News and decided to try it. Service was super slow in the beginning, almost like we sat at a table that didn't have a waitress. Finally one of the two waitresses realized we had not been helped and came to our rescue. My husband was told right up front that the prime rib was 'grilled' - something that came as a shock, so he decided to order the veal parm instead. We asked the waitress if the marinara was changed from the previous owner and she had said no but if we wanted it spiced up she could request that. We did. I ordered the eggplant parm. The salad was crisp and very good. Wine is at a good price. $14-24 for a bottle.  Both of our meals were delicious. They had an exceptional singer that sang a lot of frank sinatra style songs and it thoroughly enhanced the evening.   The place was not packed at all and I can only hope once this horrible summer heat subsides, they will be busier. They have seating for a LOT of people outside on a nice patio.   4 stars instead of five was for the fact that the restaurant was half full and the two waitresses were running around like crazy. They need to hire more for sure. If they get a big crowd, it will be a disaster. Our waitress apologized for our meal taking awhile (it really didn't at all), saying that the chef was \"slammed\". I don't see how with 1/2 the restaurant full she was slammed.  Without our wine and with an appetizer our meal would have been $40. Definitely worth that."}
{"text":"Outstanding!!! We went to Natalia's with two other couples not really expecting great things.  When we entered, we were delighted to see a space that was warm and inviting, without twenty TVs substituting for ambiance.  Our waiter seemed to be new and a little overwhelmed, so the service was spotty. And then the food!  They started with the best bread I've had in a long time, and sauteed mushrooms that were so delicious I had to stop myself from devouring them all.   There is a really fresh salad bar that was well stocked.  The the server brought out a surprise little cup of lemon sorbet to cleanse our pallets.  We thought we were on a cruise ship!  I ordered the prime rib which was supposed to be 12oz but turned out to be closer to 16oz, so tender you could cut it with a fork, and VERY tasty.  The sides were also great accompaniments to the main dish.  Our friends had veal scallopine, wiener schnitzel, a fish dish and veal picatta.  Everyone loved their choices.  Natalia's may just become our new favorite place to dine."}
{"text":"Fantastic prime rib on Saturday. Service was great and the place looks nice."}
{"text":"If you're hungry go somewhere else. we were seated right away even on a Friday night. first of all that should have told us something... took almost 20 minutes just to get drinks, nothing fancy just coke. I'm an hour later when we finally got our food it was plated very nicely.. The food was mediocre bland at best. thank God we had a Groupon 20 for 40 worth of food. our bill for just a simple dinners would have been in the 60's."}
{"text":"This place has great potential.  It is worth going to.  It is in a hard to spot location that I'm sure doesn't help.  They feature Prime Rib on Friday's but were out when we were seated just after 7:00.  I ordered a rib eye and while the steak I got was very good, it was not a rib eye.  It was also mush larger than the advertised 12 ounce.  All entrees were good and service was good.  The entree size was inconsistent - the pasta dish one of our party received was a very small portion while other portions were large and tasty.  The salad bar was fresh.  The singer was a bit much.  The restaurant only was turning people away at 8:00 pm.  With the business I saw, they should try to stay open longer on at least Friday night.  I think they should possibly simplify their menu, make better use of the floor space - take out the salad bar and just give a fresh salad with meals - put in a few more tables.  Given their Friday business, I would look to stay open later with perhaps less staff after 8:00 to match what they see in business - turning people away is not a way to encourage business growth.  I gave it 4 stars.  It rates 3.5.  It has very good potential and we will return.  Reservations on Friday are essential."}
{"text":"We waited for nearly an hour to get our appetizers. Waiter was supposedly new. Appetizers were very tasty, though. My son ordered the pork schnitzel which was raw, red, and bloody. Here's hoping he doesn't get sick after eating one bite. Good thing they comped all of our food. Main courses were ok. Place is way too busy and they need more staff in place to handle the customers properly. Don't recommend eating here."}
{"text":"If the owner isn't cooking the food is average at best.  I've been now at lunch and dinner and won't go back for lunch. Service has gotten worse since last year  Lot of potential, but I think the low volume and lack of customers has them pinching pennies and it shows.  This is still the place where I had the best new york strip ever, so it is hard to write this review."}
{"text":"My Husband and three other couples went for dinner Sunday evening to celebrate our anniversaries. It was highly recommended by some friends in Sun Lakes. We were so disappointed. Several of us ordered the spaghetti and meatballs. The pasta was like glue and the meatballs cold. We did not complain, the server was so nice and attentive I just didn't have the heart. We were the only people in the entire restaurant from 6 till we left at 8. I can see why. We will not be returning."}
{"text":"Why a singer at 6:30 so loud you can't talk. Poor service and food quality . Very disorganized and poorly managed.  Will not return until majors changing happen. They will probably close with this type of management and food"}
{"text":"Husband and I went in on a Saturday night for the first time.  We were sat right away and the waitress was prompt with service and attentiveness. Husband ordered veal parmesan that came with a side of pasta with meat sauce and I ordered baked pasta. They both came with salad bar and bread with delicious garlic butter. The veal parmesan was very good and serving was huge. My baked pasta was tasty and hot... with a touch of spiciness in the homemade meat sauce. I ate it all. The bread with garlic butter was delicious. Prices were reasonable and we would definitely recommend and visit again."}
{"text":"We have eaten here about five times. We found it by accident. The decor in very nice, clean and new. Just a bit grandma but good.  T he food is really really good. The ingredients are high quality and well presented. Good taste. I love the scallops and the beef strogeneugh. My husband loves the steak. They are e usually not busy, I guess they haven't been discovered yet. I would hate to lose this resturant due to lack of business. Prices seem very reasonable. White tablecloths good special place.    Rob s"}
{"text":"I found out about this restaurant because of a mix-up with Don S. I'm embarrassed to this day but Don was a great sport about it. Anyway, I finally went there for a lunch/business meeting the other day.  Now, at this point, I must digress and say that Natalia's is in an unfortunate location. In the 2 1/2 years we've lived in this area three restaurants have gone in and out of that space. And the location isn't getting any better as housing empties out in this part of Chandler.  But, as I was saying, I was excited to go based on Don's review and my reading of the menu. So I was a little disappointed when the first two things I order were unavailable. I wound up with an open-faced turkey sandwich and fries. It was pretty good. Upside - they used real turkey, downside the portion was on the smaller side (much smaller than the picture Don S posted) and it was predominantly dark meat.  The place is lovely and the service was good. I hope they iron out the kinks with the menu."}
{"text":"This was our first trip to Natalia's.  I had the pasta fagioli and the baked pasta dishes, and my wife had the prime rib dinner.  The portions were large and well prepared.  The complimentary bread was great.  All the food tasted fresh and wasn't loaded down with salt like chain restaurants.  I normally order 2 glasses of wine at other restaurants, but only needed 1 here, who doesn't love a generous pour?  Our waitress was great and even offered up free pasta for out 16 month daughter to eat.  Prices were reasonable for what you get.  We will be going back many times assuming nothing changes.  We were there on a Friday and you will most likely need a reservation if you arrive later than 6."}
{"text":"We had reservations, but at 6:30 only two tables were occupied. We ordered the baked pasta (ziti) and the beef stroganoff both of which were perfectly prepared. The beef was tender and the pasta was cooked al dente. Unfortunately, neither dish was seasoned, at all! At least salt and pepper your food. Our reservations were confirmed.  We took most of our dinners home and seasoned the stroganoff with salt, pepper, dill and lemon and fixed the pasta with oregano, sage, garlic and thyme.  That was very tasty the second time around.  I will not go back for bland $16 meals and by the way, very slow and annoying service."}
{"text":"first off... how the HECK does this place get even close to 4 stars? Something is seriously wrong with the rating system... you won't dupe me again!   My husband and I had dinner recently from here.  The staff is very friendly and welcoming and the decor is very nice, warm, and also welcoming.    I was really looking forward to my linguini pesto with shrimp.  Hubby got veal marsala.  Sadly, we did not have a good impression... our food was very blah... highly blah.  All 6 of the shrimp in my dish were overcooked, chewy, and flavorless.. the \"pesto\" was invisible, as I saw only glimpses of green in my linguini.. this was not pesto sauce, it was sprinkles of herbs.  Hubby's veal marsala portion was quite small and uninspired flavor... his mashed taters seemed like they could be good but were missing something.  I really wanted to like this place because there are so few non-chain restaurants here in S Chandler and you get so sick of seeing all these Texas Roadhouse/ Fatburger/ Red Lobster chains taking over our neighborhoods, but this place needs to seriously up their game.  Everything I tasted from our order was not flavorful... not inspired... needed more ingredients... and needed salt, except for the zucchini with caramelized onions, which were actually very pleasant  Short story, for the almost $40 I paid to eat here, I will not be making that mistake again... the portions and amount of ingredients does not warrant such an expensive meal for two when it's this disappointing.    oh yeah and, no, we are not from Sun Lakes.... if you couldn't tell... :-P"}
{"text":"well folks it is unfortunate, but as a former employee, i had to leave over disagreements about what good kitchen practices are. On more than one occasion Tony Imbezi, the restaurant owner and self proclaimed \"chef\" has pulled rotten food out of the garbage can that i placed it in and asked me why i threw it away. I kid you not folks 4 days ago i threw away a bag of green bell peppers that had black mold growing on them and he chastised me for \"wasting product\". seeing as how i went to school specifically to learn how to run a restaurant, I knew that even if you cut the mold off of an item such as a vegetable or meat, the cytotoxins left behind cannot be cooked off. he disagreed. i was fired for this and to be honest, it sucks but all i can do now is raise awareness to what a criminal he is. if this post saves one person from being poisoned, i will have done something good for our community."}
{"text":"We really wanted to like this place since it's not too far from our house and it's not a chain. Sadly, we were disappointed. I ordered eggplant parmesan and it was luke warm and the salad was so lacking. All it was was a bit of lettuce, 3 small tomatoes and a little onion. So sad. My husband ordered the Seafood Fra Diavlo. Also a disappointment. It seemed a very small serving size compared to other dishes in other places. My husband said that the scallops were mushy and the clams were tough. When he told the waitress, (Sarah) she said she was sorry and that was it. No attempt to make it right. Like oh, too bad, but please come again! I don't think so. And I really did so want to love the place. I had a beer and my husband had a soda and the bill was $43.00! Way too much for the quality and quantity of the food."}
{"text":"What's up with this place.  Their telephone recording says they will be closed until July 14 for vacation and medical reasons.....but today is the 17th and the same message is on the recorder....and the message says do NOT leave a message because they will not retrieve them.  Is it reopening??? Is it closed for good?"}
{"text":"I saw the overall rating of 4 stars and so we went for it.  Bleh.  Our meals were all served at room temperature and it took forever to actually get our food.  The food was bland.  And at $12-18 a plate, it certainly was not worth it.  We were really disappointed.  I'm sad to have to leave negative feedback.  The only up side was a very pleasant and attentive server, but the food wasn't good at all, sad to say.  I hope Natalia's reads these reviews and works on improving."}
{"text":"i just want to start off by saying that my boyfriend and i ONLY visited this place because of the good reviews posted on yelp.  We are the type of people that will try a mom and pop type place over corporate any day... with that said, i do expect the restaurant and its employees to put their food first. I was immediately disappointed to see a salad bar in a sit down restaurant not called \"super salad\". We were sat right away had a few mins and ordered a bottle of wine. The menu wasn't anything special, nothing really stood out as unique. I decided to go with the filet and pasta and the boy went for the prime rib (on special). We both were informed we would have the option to make our own salad from the salad bar. Lets just say the salad bar was limited... no eggs, no bacon, no 1000 island,  i guess if caesar was the type of salad you wanted it would be fine. We were given lemon sorbet before our meals came which was good, however served in plastic shot cups. When our food came everything looked AMAZING! I cut into my filet and realized it was not cooked to the medium temp that i ordered it, but was barely cooked enough to actually be served to the public. Obviously i sent it back to be cooked a little bit more. My boyfriend's prime rib looked delicious! Beautifully pink horse radish and au jus on the side. We both had pasta as our sides... the Alfredo was awful. I also added an extra side of their tomato which was equally as unpleasant. Flavorless to be exact. When my steak came back to me it was completely cooked, well done. I fought having a new one prepared for me, but when i realized it was too unbearable to consume i asked the hostess/busser to ask our server to come back, she was out side smoking. I gave her my steak and said i'd rather have a new one. She was gone for a new mins and came back to tell me that the kitchen was closed and it would take 40 mins to heat the grills and prepare me a new steak. Lets just say she tried to save the situation.... unfortunately for her and the owners of this establishment i am very aware of HOW things such as \"ovens\" and \"grills\" work. An already hot oven does not take my quoted \"40 mins\" to reheat. In fact  if you had just given me an over done steak cooked on the grill it would have still been hot... the steak that was returned to me had no re-sear marks on it and was rubbery... i do not appreciate being given a steak from the microwave. I have been in the restaurant industry for over 10years. I think the thing that upsets me the most is that this place has inexperienced COOKS working for them, i did have the pleasure of watching the kitchen staff run out of the restaurant 10 mins after they basically told me to take my steak and f*ck myself with it. The tattooed dark haired lady also felt it necessary to yell \"F*CK THIS\" upon exiting while my boyfriend was finishing HIS meal. So lets just say my over all experience was disgusting, i expect these things when im drunk at denny's, but i was prepared to drop a lot more money into this meal. I do not appreciate having my server shout at me lie to me or not fell it necessary to involve a manger in this ordeal. there is no way this place will survive. It was8 pm on a saturday night for crying out loud!"}
{"text":"If you live in this area of Gilbert/Chandler, you're in for a treat. Natalia's is a great concept. Apparently they serve nothing that is pre-packaged or prepared; they make it all from scratch right there. And the food is good...with an upside to become even better.  I went here with my family, and between us we tried: Grilled Ham & Cheese Sandwich, Manhattan Clam Chowder, Hot Open Face Turkey Sandwich, & Stacked French Dip Sandwich. It was all very tasty. The Ham & Cheese was a little salty...as were the Crinkle Cut French Fries. But besides being too salty the fries were delicious!  More Notes: + The bread on all the sandwiches was top notch. Very fresh and flavorful. + The service was attentive and friendly. + The Prime Rib and Turkey was made in-house. They were both superb. - Coffee was \"meh\" and not strong or super fresh. - Did I mention how salty things were. + Prices were VERY reasonable...especially for the quality of food they serve.  Overall, I'd say this is a solid 3.5 Stars...with the potential to become 5 star excellent. We were all well satisfied though, and I'm sure we'll be back."}
{"text":"Sorry, I don't usually bash mom & pop places, but unfortunately, this place needs it.  I had veal scaloppini, the noodles were glue, the veal dredged in soggy breading & good God - tires would be easier to chew!   Bread was (I'm sure) the frozen par baked kind, not the fresh, aromatic bread I associate with Italian dining.  My date kind of summed it up with \"I'll be fine if we don't go back\".  Up-side...  service was good."}
{"text":"i gave this place about a couple tries only because it's close to home...Unfortunately I was quite disappointed each time. Every time I went in it seemed like the crowd was much older...I felt out of place but that didn't stop me from trying their food.   Their service was okay but sometimes it took forever. I think they are too focused on the older crowds then the younger crowds...? or maybe that's just how I felt the past couple of times I've been there. I know that they have an open salad bar and it's all you can eat per person if you order an entree. (Which I did not know and they did not go over) & just the last time I've been there I shared the salad with my bf and the waitress saw that and came up to our table and told me they will have to charge me for that which I thought she could of politely have told me after I ask for the check...not while I'm trying to enjoy my dinner....Couple min. later she brought out the wrong entree and didn't even apologize. In my head I was thinking to myself hmm...she better have that salad on the house since she messed up on the order. And guess what she did but yet she still didn't get an apology for that wrong order. lol....  I tried a couple of their entrees and honestly it's nothing special. Their pasta is good but how can you go wrong with pasta? Nothing really seemed to stand out for me to go back once more unless I felt like eating pasta & their bread."}
{"text":"This was easily one of the worst dining experiences of my life.  We arrived in the early evening, and there were four tables occupied, maybe 12 total patrons.  The 18-year old waitress said she'd \"be right with us\".  Five or so minutes of being ignored later, we found ourselves a seat.  Another five or so minutes of being ignored later, I went to go find menus.  This was to be the theme of our entire dinner.  Any time we needed anything, we had to get up and force the waitress to attend to it while we stood over her.  She was nice, but this is her first job, and with only four tables, she was in way over her head.  Seven tables of dirty dishes were all around us, and none of them were touched in the hour we were there.  The salad was a very small amount of cheap lettuce with a few shredded carrots, nothing else. Our appetizer and main courses arrived at the same time after nearly 30 minutes.   Escargo were mediocre, just the snails in butter, no cheese, no bread.  The veal parmesan was a large portion, but I suspect the \"veal cutlet\" they serve comes to them frozen by the case from Costco. The sauce was watery and bland, and the entree was cool enough that I suspect it sat in the kitchen for a long time before the waitress finally got around to bringing it out.  Even with a Groupon, this place was pretty horrible. A group of ten arrived as we finished our main course, so we decided we'd better skip the dessert, pry our check out of the waitress and get out of there fast.  I can't imagine how anyone could give this place more than one star, or want to come back.  I'd give it negative stars if I could."}
{"text":"The chef at Natalia's clearly learned how to cook in heaven. Everything I have tried that has come out of their kitchen is fantastic. And for the price, this is a must-try.  If you make a reservation, they will give you a free marinated mushroom appetizer. The mushrooms are drenched in a Marsala-type sauce, that is excellent for dipping your bread into. Both times I have been there I have had the Veal Parmigiana as my entree. It is perfectly breaded, the cheese is well done, but not burnt, their sauce flavorful, and the meat is tender and cooked to perfection. It is  hands down the best I have ever had. My husband tried the Prime Rib last weekend, it was tender, juicy and again cooked to perfection. That is so cliche to say, but there is honestly no better way to describe the food.  The service is pretty decent as well. My servers have been timely and professional. They seem to know the menu and are able to make nice recommendations. I mean, I think the chef from heaven probably makes that piece of their job pretty easy, but I still appreciate it!  Bonus - their wine selection is far from vast, but all of the bottles are about $12. The wine I had was great at that price point.  If you are in the Gilbert/Chandler area, and looking to excite your taste buds, for sure give this place a shot!"}
{"text":"I just had a great evening celebrating my son`s 20th birthday at Natalia`s 1912 Restaurant.  It was our first visit and we were vey impressed.  There was a nice live music.  The waiter`s were very nice and attentive.  The food was very good the helpings were generous.  I would highly recommend.  It is locally owned and the owner came over to meet us and check on out needs.  We will definitely be back!"}
{"text":"My daughter and I were in the neighborhood on a bike ride so we decided to stop in for a bite to eat. Check yelp reviews and out of the two Italian restaurants next to each other, this one had half a star better of a review, so we went for it. Lucky us, it was senior citizen karaoke night! Completely thrown off but pleasantly surprised at the talents of the obviously frequent patrons. I seriously thought Whitney Houston was in the house!  Quaint little restaurants and bar. Plenty of open seating and very clean. The staff was very courteous and friendly. Not sure if he was the owner, but he had the fancy little white chef suit on, relaxing with some of the patrons and he even sang a ditty to please the crowd of 15.   Let's talk about the food..... Sporting a little Italian heritage, The bar for excellent Italian food has been set high thanks to Mama Lynn. It's got to knock my socks off to be epic enough to cancel a homemade Italian meal and brag about it. That being said, this place had an excellent atmosphere but nothing really to brag about food wise. Dinner salads were small and it's presentation was boring. Fried cheese sticks were really good though! I ordered a grilled ribeye medium and received a grilled ribeye well done. The waitress informed me that it's really hard to grill a steak medium..........Considering I've been guilty of grilling steaks for quite some time now, I'm having a hard time fathoming this. Let me chew on this like a well done steak for a while and see if I can digest it. Needless to say, I could not finish that steak because it just lacked a certain desirable taste. My daughter ordered the chicken Alfredo fettuccine and it was decent. Sauce was good but the noodles were a bit hard. All in all I'm going to say that unless the elderly come in town to visit on a Wednesday and want to karaoke this probably will not be my jam."}
{"text":"OK ambiance.  That's the only negative thing I have to say.  Great food, excellent service and great prices!  Meal for two w/ a nice bottle of pinot grigio for under 60 bones.  Seriously!"}
{"text":"Super good food! The chef is also the owner and he takes great pride in his work. I would highly recommend this place."}
{"text":"Went for dinner w/ family. Waitress was poor, maybe it was her first day? Food was bland and borderline awful. They need a kick in the arse from Gordon Ramsey. Night entertainment was a train wreck. Washed up lounge singer w/ a karaoke machine. Final thoughts...kill me now!"}
{"text":"Wow!  What a fabulous find!  My husband and I just happened upon this place and were delighted!  Ambience is great!  We started with European Mushrooms-Outstanding !  Manhattan Clam Chowder and fresh baked bread with garlic butter was delicious!  Their side salads were fresh and wonderful.  My husband raved about the liver with fettuccine Alfredo and my Chicken Picatta with Penne and Red Sauce with Mushrooms was fabulous!  Everything was so outstanding (including our. 6 cocktails) that we ended our dinner with sharing their 7 layer chocolate cake with sides of raspberry and carmel!  What a meal and all this for affordable prices !"}
{"text":"Delicious hidden treasure.  The ambiance is nice and inviting, not all loud and annoying.  The prices are about 15/entree with fresh bread and salad bar. The husband had spaghetti with mushrooms,  and I had chicken scallopini with tortalini--YUMMY! I am surprised that they close so early though, especially on Friday night."}
{"text":"Last night we dressed for dinner and drove over to Natalia's as we got a groupon.  We walked into a completely empty restaurant and a young man greeted us.   First words out of his mouth was do you have a groupon?   At that, he said that groupons are no longer welcome here. And groupon will give you refunds  WOW!  You had two paying customers in front of you and kicked them to the street.  We were so hungry we would have paid for the meals, but the greeter was so bent of groupon and the place empty kind of scared us off."}
{"text":"MUST GO!!  Natalia's is what most restaurants strive to be!  The quality of the food is top notch and you can absolutely tell in the flavor!!!  We've been there 6 times since we've just moved to the area and will continue to frequent it.  Mouthwatering = the chicken dijon, the chicken marsala, the scallops.  For lunch we have been left craving the french dip sandwich and the burgers.  It really is all about the quality and freshness of the food ingredients they use and we are hooked!!!  We'll continue to spend as much money as we can here to keep it at this location!!  :-)    Also worth noting is an excellent salad bar....again, fresh ingredients all around.  Oh and the hot bread!  And the desserts!!  LOL.  Ok, I need to sign off now because I'm getting hungry and we're not going there until tomorrow night so I need to stop torturing myself!  :-)  If you are in the area, give this place a try.  You won't be disappointed...  Sorry, one last thing....GREAT, friendly service each and every time we've been there.  Thank you, Natalia's!!"}
{"text":"What a terrific place that happens to be in our backyard! The place is truly a hidden treasure. The food is unique, fresh, authentic, and simply...excellent! The chef is also the owner and truly talented. In a day and age if crummy and barely mediocre restaurant food, hopefully an amazing place like Natalia's will survive."}
{"text":"They \"over sold\" the groupon. I know this is a lie. I have a business and groupon sets it up to how many the business wants to sell. Groupon does not set the amount .  Went to make a reservation and they are not taking any with groupons offer..  Stay away"}
{"text":"The food is NOT fresh like they claim...I ordered a chicken ceaser wrap and it was made of boxed croutons and packaged lettuce, I was eating the wrap waiting for chicken, but there was no chicken....I expressed concern to the waitress and she said, well you ate it....which I ate half of it because I was starving, so I asked to speak to a manager and the tattooed \"cook\" walks out and tells me, too bad, you ate it and we PRE PACKAGE 4 oz of chicken....wait pre package? Your menu says cooked to order and fresh....they didn't even try to make my meal better...they didn't offer free dessert or anything, they basically told me they didn't care and they were not going to do anything about it and they didn't!!!  I was shocked!!! The worst customer service and food, so now I'm still hungry and angry at the entire experience. Word to the wise...DO NOT EAT HERE, consider yourself warned!!!!! I am forced to give this place one star because a zero rating in Yelp doesn't exist!!!!!!!!!"}
{"text":"Couldn't tell you about the food since we didn't even get that far before we walked out.  When we walked in the hostess greeted us...more or less.  When we asked to sit at a specific table we got a ton, and I mean a ton, of attitude from the hostess.  She took us to the table and basically threw the menus on the table and then walked away.  Strike one.  Next, as we were waiting the wait staff were cleaning menus with windex.  We asked them to stop or go elsewhere (really??  I'm getting ready to eat and you want to put the smell of windex into the air next to my table??).  More attitude.  Strike two.  So to this point two strikes, aren't even close to ordering yet.  We threw in the towel.  We weren't going to spot them the third strike.  Just an observation here, but there at least two tables that had card table chairs (you now the fold up type) in the restaurant.  Weird."}
