{"text":"Nations truly has it all: asian groceries, western groceries, a western deli, an asian counter, a bakery, a live seafood section, takeaway food (dim sum, sushi, fast food), and even a bubble tea counter. The store is huge and very clean. It has become my one-stop shop for all food related needs aside from Costco, where I buy bulk things like yogurt. You could find anything from prosciutto to mochi ice cream and in between at Nations. So far it is the only place I've been able to find GOOD Filipino-stye ube (purple yam) bread in the GTA. Bonus: huge parking lot so you never have to circle around for a spot. 

Now for the downsides. This place like most Asian stores is cash or debit only. The produce (veggies not fruit) is not as fresh as what you'd find at BTrust, another grocery store in Mississauga."}
{"text":"Quite disappointed with this \"upscale Oceans.\" There may be a lot of food choices but these kind of food can be found at T&T, and BTrust. Seafood section is so unappealing. There was so much water, if one is not careful you will slip and fall. Too crowded with merchandise."}
{"text":"This is a really nice grocery store. The whole east meets west is real. Unlike other chinese grocery stores that have a strong whiff of fish as soon as you enter, this is clean and much more organized.
Inventory is tremendous, bakery selections are delicious as well. I havent tried the food court butthe smells are appetizing. 
Overall, the pricing for those delicious ramens and famous japanese candies is also great.
It truly is a place for everyone. Good work!"}
{"text":"This place is owned by Oceans  but are higher end . Meaning cleaner and smells better .
The parking lot can be a bit of a pain .
Just as bad as Oceans . Meat counters much cleaner but comes with a higher price .
If you look at the staff you might think that you are at a Loblaws .
The thing that made me not like this store was they CHARGE FOR BAGS  NO ASIAN STORE DOES THAT .
call me old fashion but Btrust win my heart 
I will only go back for sales. 
Store does look nice."}
{"text":"Looking for Asian condiments, rice, vegetables, fresh and dried noodles etc., then this is the place to shop. I spent at least an hour checking out all the prepackaged goods needed to cook your own dishes.
The seafood department had a great selection, with good prices and no fishy stink. In fact the entire store was clean and spacious. Great selection of pork and chicken but there was a lack of quality beef.
Produce was plentiful and for the most part very fresh. The only downside and this is the same at most Asian grocers, is that things such as Asian greens are all prepacked and often way more than I need. 
For me, the best part of my shopping expedition was the cooked and ready to eat items. You name it, they had it. My favourite part was the hot tables where you pay by weight. Someone was tending to these items all the time and the food was kept at safe temperatures. Had some good jerk chicken, Shanghai and Cantonese noodles and much to my surprise and delight the beef pot roast was delicious and tender.
They had everything you can find at Oceans and T&T and a whole lot more. This is now my number one food destination and I hope they maintain their high standards."}
{"text":"Cooked food here is good value but gets too crowded in the evening. People will stand near the cooked food and not moving or ordering. The cake here is very blend if you like cake with no sweetness then here is the place for you. Store is very clean, isles are long and roomy."}
{"text":"One of the newest location in the Nations supermarket family, it has a lot of things you expect in this brand. Lots of hot food items to choose from and all pretty delicious. Their dim sum selection is good and bbq is quite acceptable. The supermarket (for now) is clean. Large open spaces haven't been crammed in with makeshift displays of boxes of food stuffs. Overall the best (well also the only) large scale Asian supermarket in West Mississauga."}
{"text":"Nations Fresh Foods is a real neat grocery store with a fantastic food court!  They call themselves a \"multi-cultural grocery store\" and they are just that (how Canadian, I know, haha).  They have food items from all over the world under one roof, so cool!  What I love most about them though, is their food court!  They have burgers, fries, pizza and pasta.  They have dim sum, as well as more substantial Chinese offerings.  They have sushi.  They have a salad bar and a \"hot food bar\" where you pay by the weight, and you can get jerk chicken, Italian meat balls, cabbage rolls, and so much more, there's just so much variety and so many different cuisines.  They also have a lot of prepackaged salads with nice combinations beyond the usual \"Garden, Caesar, Greek and Cobb.\"  These are very reasonably priced.       

The place is very big and clean and nicely decorated.  The eating area is upstairs, and they even have some booths.

Food court prices are really cheap (except for the pay by the weight stuff).  The Chinese food combos are $7.49 for a rice/noodle, 2 mains and a soup (your choice of hot and sour or wonton).  The rice/noodle sides are really good and actually have protein and vegetables in them, they are not just plain rice or plain fried noodles like at most places.  Like you can get Singapore noodles as your noodle side (!)  I got one of these combos for lunch and everything was great, especially for the price!  Much better than places like Manchu Wok, Tiki Ming, etc.  

They also have a deli section and a bakery.  Their fish department is separated (encased in glass with sliding doors) as to contain the smell.  

I discovered this place thanks to Yelp and I'm so glad that I did."}
{"text":"This store is clean and  good in general, lot of Asian or Chinese products but my main concern is HALAL Food which I don't feel comfortable to buy from this store as they are selling Pork and many products with \"Haram\"  Ingredients,  handing of food is good,"}
{"text":"Food court is amazing! They have Asian, Middle Eastern and Western foods, price is good, quality is good! I love their shawarma, my kids like sushi and wife likes the Asian food. Clean and free from pungent smell that you find in other similar stores. 3 stars only because I think their fruits are not fresh. Btw, it is the only Asian grocery where you will find folks from other races all working together! Nice Job!"}
{"text":"I went to check this place out for the first time in a few weeks.  To be honest, I like being in these massive Asian grocery stores because it's almost like an experience. 

Nations is run by the Oceans chain however like most people have said, it's cleaner and bigger.  The hot food section is massive and has Canadian food and a wide array of Asian food as well.  This is literally a food court within a grocery store.  

With regards to the produce (the only thing I care about), it all looked fresh, they had some reduced items that still looked edible and prices are comparable to B-Trust and T&T.  

The only downside I see to this grocery store is that you have to pay for your shopping bags (which is common in all North American grocery stores, but not so common in Asian ones). I don't really mind being an environmentalist and all, but there should be a heads up. 

Verdict: If you live in the west end of Mississauga, this is another option other than B-Trust."}
{"text":"Amazing selection and prices!

You can get something to eat if you're hungry made fresh!

So multicultural in grocery selection you usually only find in super mega grocers but more expensive than here.

Really impressed!"}
{"text":"An amazing variety of food and really good prices. 
If I was still in high school I would probably come here everyday for lunch. 
You buy meals that are cooked on the spot which I find incredible! What a time to be alive"}
{"text":"I live a stone's throw away from this place therefore we buy a lot of cooked food from here since it opened early this year.  Food in general taste good. Kids love their fried chicken.  Service is usually great. Just have to say the other night I went in around 730pm to buy dinner and since it was \"soup weather\", I picked up a small container of chicken noodle soup but it was already placed in containers.  I went home with a container of broth with barely any vegetables and 1 small piece of chicken without any noodles.  I suggest for next time if there is nothing left in the soup except broth then package it as \"broth\" and not \"chicken noodle soup\"."}
{"text":"Ever since they opened up an Asian supermarket close to my house, Nations has been my go to for fast and convenient cooked hot and cold foods. I go during nonpeak hours to avoid the crazy parking lot, crowds and lineups. 
There hot food selection it is quite extensive and offers Foods from all over the world. The Chinese food is sold in combination or full packages. The selection is amazing. The international food hot table is also quite diverse offering foods like jerk chicken to meatballs. You pay by the weight of your container so load it up. If you got a craving for hamburgers, they got your back. Gelato, they got your back. Noodle soup anyone? Their sushi has never given me a problem and the dim sum is pretty good too. 
So if you're hungry and looking for a quick bite to eat, check it out."}
{"text":"Only take cash or debit and have to pay for bags, but I got used to it. Parking Lot can be a disaster on weekends, but the parking lot used to be completely empty with just Rona around.

I like their sushi better than T&T's. Their read to go food is also way better than T&T. I wouldn't call it upscale. 

I got about once a week and they seem to having some restocking issues on some items that I usually buy."}
{"text":"Ratings:
Selection: 8/10
Service: 8/10
General Aesthetics: 8/10
Hygeine/Cleanliness: 9/10
Value: 9/10

I came here cause people kept suggesting I check out an \"upscale\" Asian supermarket. It is huge and definitely has a look to make one think it's upscale. 

The selection of items here isn't exactly the best, since it tries to have everything in one building, but it has most of the regular things that people go to other supermarkets like T&T or Loblaws.

The design is quite huge as it probably used to be a warehouse. But they've managed to make it pretty nice. There is a lot of space in the shopping area, but the prepared food section is always crowded with people, making it seem smaller. Upstairs has a nice little sitting area.

Most everything here is quite clean, since it is new, I'm not surprised, I hope they do keep it up though

The cost is pretty reasonable and you can get most things of quality at prices comparable to other Asian supermarkets.

Side note: They don't accept credit cards, yet. Not sure if this will change in the future, but as of this post they don't."}
{"text":"Love this place for lunch this grocery store has a hot food section at that is very big they have all types of food from your regular Asian take out to Japanese Teriyaki they have a burger station then they have a buffet where you can choose your own food they have pizza sushi Shawarma there's something there for everybody and it's all reasonably priced it's so affordable sometimes it's more affordable than bringing my lunch

Not all the food taste great but I would highly recommend their Teriyaki it's a really good and they're Burger and Fries special at lunch I believe it's around $3.5 it's less than $5

This review is only on the hot food section I have never done groceries at this chain or any other location"}
{"text":"Love the food court!!!!! The food is fresh there and the portion is big. We come here when we are both lazy to cook. It is also very convenient."}
{"text":"Food and selection amazing. On May 4th 2018 around 5:00 p.m. their credit/debit machines suffered a power outage. None of the staff were informed in what to do. Instead of trying to inform customers, the cashiers left their tills unattended, trying to find a supervisor. Supervisors didn't know what to do. The line ups grew, no information. Customers became so irate many left with no even paying for their products. Ordeal lasted about 30 mins. Lack of customer service outrageous. 

If your looking to escalate you issues at the store. Good luck. Your better off talking to a mannequin."}
{"text":"I've you've been to the Toronto location at stockyards.  Don't hold it to the same standard.

This one is reminiscent of the Oceans at Eglinton and Hurontario.  It's not bad but it's not great.

The cashier told me the weekends it's very busy but on a saturday afternoon it wasn't busy at all.  The foods in the hot buffet seemed as if it'd been there a while.  There was a person doing sampling and they didn't even talk to customers as they walked by.

The seating area upstairs is ok.  But not wheelchair assessible.  There were three tables downstairs with handicapped stickers on them but it didn't look comfortable as it's directly under the stairs.

Given how cold the weather is, the hot food area isn't a good spot because the billowing wind and cold air made the hot food cold quickly.  

Make every effort you can to go to the Toronto location.  That one's alot better imo.  Food was meh.  Here alot of the hot foods are halal to cater to the clientele."}
{"text":"Conveniently located and better selection than some other Asian supermarkets. Hot food area is cheap and convenient"}
{"text":"Nations is an authentic, ethnic grocery store targeting foods from mostly Asian countries. But this review is for the take out, the dine in lunches, the sprawling buffet and the diverse hot food counters that I've found myself indulging in almost every other day that I'm at work (embarrassed to admit I eat out so much, but not really..). 

Shawarma, fresh rustic pizza slices, Chinese food, buffet of pastas, chicken, veggies, rice, fish and a counter for fries & burgers of the chicken and beef variety. I've tried it all. Not one complaint. 

When you enter the store, you can find all these delicious options pretty much at the front to the right. There are two buffets; one where you can make your own salad with all the fixings (and I do mean all) and another for mixed hot foods. You can guarantee they will have at least 3 types of chicken, fried fish, roasted potatoes, two types of pasta including meat & veggie lasagna, and steamed veggies. It's always stocked up, hot and fresh. It's only $6 per pound of WHATEVER you want, you could literally just fill your container with chicken wings if you want. A lot of the time they have sales on their buffet, $2 off per pound!! 

You can also \"order\" Chinese food at the long counter along the wall: noodles, chicken, pork, rice, egg rolls, you get the point. At the counter right by the front door order an amazing burger and fries for only $3 between the hours of 12:00-2:00!!! Try their Spicy Chicken Burger, it's 100% the best I've ever had in all my life. 

I'll add more photos as I splurge! Oh yes, there will be more."}
{"text":"Ethnic (primarily Asian but they have some other stuff) supermaket which is cleaner, brighter and more interesting than some others.   Prices are not amazing but they have some good specials.  As others commented, they have a food court and buffet (which I did not try) and a lot of take-out options.  I purchased some chicken (uncooked) from them to use and it was fresh and clean.  It's a bit too far for me to go on a regular basis but would be interesting to visit from time to time.  Checker was polite and friendly, unlike some Asian markets - presumably they are hiring legally and paying fair wages."}
{"text":"nice and clean supermarket with multicultural staffs in all departments. I will come back again because I like supermarkets. I know they just opened recently. The cashier was a bit slow looking up the codes when checking out products."}
{"text":"The salad tastes stale and they don't accept any credit card payments only cash or debit. Very inconvenient if you don't want to use either."}
{"text":"(Only Debit or Cash Here) 
Was really excited for this place to open!
It has everything you need! I love their many food options. End of day sale is great! Very crowded I must say but that's expected!! They have a great build your own pasta option... delicious! Great deals of the days and happy hours. The fries are really good here if you get fish and chips or a burger and fries! What I did not like was this first time I got chicken wings at their end of day sale and on the label it said crispy wings.. I opened it up and the wings were covered in some gravy that was perhaps for another meat.. anyways it wasn't that great tasting. Other than that I have not been disappointed since. Good food and Great prices !"}
{"text":"TIP:  Don't forget to bring your own reusable shopping bags as they charge for plastic bags here!

Prepared food heaven!

I expected this place to just be another Chinese grocery store, so I was overwhelmed when I literally stepped into a FOOD COURT with choices like:  burgers, sushi, your usual Chinese food, \"Western food\", dim sum, salad, bakery, etc.

I'd say half of the store is geared towards people on-the-go.  Cooking?  Ain't no one gotz time for that!  However, if you do, Nations still has you covered!

Owned by Oceans, I found this store much cleaner, better lighting, & better smelling.  Layout of merchandise is better, but there were still boxes in between aisles with stuff, but for some reason it didn't look as sloppy.  I think the lighting helps A LOT.

Although the place was crowded and busy on a Saturday afternoon, the shoppers weren't as ghetto rude as Oceans.

If you lack patience, park further away, towards the back or Rona!"}
{"text":"Some food is relatively cheaper. This place is pretty much the same as any Chinese supermarket with a little bit more hot meals. The reason I gave 3 stars is that they only takes cash and debit. Also the cashier is very 'laid back' with slow motion of checking out everything. Unlikely going back there again."}
{"text":"this rating is based on the food court only.

I am knocking it down 1 star 3 reasons
- Parking here sucks
- they dont take credit card - cash or debit only
- some of the food is a hit or miss - live and learn and know what you like and stay on safe side.

I swing by here at least 1-2 times a week on my lunch break and the prices is aligned to how much you want to spend and get when you're buying lunch at any other food court.  so if you have a budget of $10 for lunch you will definitely get your moneys worth. $15-20 daily lunch budget damn that's more than enough for you and a fellow colleague.

FOOD Court - yes this place is like the International Buffets you visit when you go to a High End Vegas Buffet.  Only thing you're individual paying for the food which is not bad cause everything is price reasonable.

it's got everything that you eyes want to see in an International food court. Pizza, sharawma, dim sum, chinese buffet, ramen, pasta,fast food burgers, fries, fish and chips, salad bar, bbq section it's got it all.  As per my Seafood city comparison to Nations.  Nations OVER Seafood city ALL DAY EVERYDAY 100%

This is the only place where i can eat Butter Chicken, Dim sum and Ramen soup at the same time and then top it off with Bubble tea or gelato ice cream for dessert.  It's a 1 stop shop.

Every visit is a new experience because you have a lot of options to try out new things.

Definitely check this place and dine in since they have some tables on the second floor for you to eat your food.

PRO TIP - before they close each day they sell all the hot food at a price plus a discounted price.  good way to pack your self a lunch for work.

You're a Welcome"}
{"text":"Don't get me wrong. I love Nations. And I am very excited that it opened up close to home. I am literally there twice a week minimum. Their fish and produce are always fresh and well priced! On the day to day, Nations is a solid 4-5 stars for me.

However. I was there yesterday and browsing their refrigerated salad dressings and dips in their fresh area. I came across expired product dating back 1-3 months. The oldest product I found was a yogurt based dip that had a BB of June 22/17. And I wanted to buy that dip too!

Fortunately, I am someone who religiously checks BB dates. I work in food and I know better than to just trust people. But, if someone were to have eaten any of those products without checking, it could have been a huge issue. 

It was a bit confusing as every time I am in Nations there are tons of employees around. Surely someone could audit that refrigerated bunker on a weekly basis to prevent this kind of oversight from happening! I alerted Management before I left and hopefully they took care of it. I guess I'll find out on the weekend when i go back for my weekly bigger shop."}
{"text":"I'm so happy they opened up an Asian supermarket right next to my home. I find the fruits and veggies here very fresh and reasonably priced. They also have a fine assortment of Asian milk bread that typically goes on sale near closing time. I also enjoy the fact that they open until 10pm every day, so it's convenient for me to go do my groceries after dinner time."}
{"text":"Absolutely love this grocery store! So many ethnic products that you can't find in any other store - in addition the regular grocery store items. Plenty of exotic fruits and vegetables. And not to mention the fantastic prices! I find it is comparable if not cheaper than your typical grocery store. And if you're in the area for lunch or looking for a ready meal for dinner, they have an enormous hot table section of ready to eat meals, salads and snacks. Can't say enough about this great store! If it was closer, I would do all my grocery shopping here!"}
{"text":"Oh wow!  This place is quite impressive.  Authentic Chinese food mixed with other international cuisine.  Plenty of prepared food from which to choose.  The have a large seating area on the second level to eat.  The fruits and vegetable departments are extensive.  Large seafood section also.  Awesome bakery that carries La Rocca cakes.  They have Chinese BBQ unlike their sister store Oceans.  They also have a real fruit smoothie shop.  This place has a lot to offer.  I like that it's new and clean."}
{"text":"Omg!  Love this place!  It has just opened up in February.  I have been waiting for so long for this supermarket to come to Toronto.  Whenever we are in Hamilton, popping in to Nation's is a must!  

I love their super deals on customized pastas... $3.49 for a large container.  Wow!  You have a choice of meat sauce, Alfredo sauce or tomato sauce.  You get to choose 1 meat, chicken or sausage or shrimp and then whatever veggies you want.  Excellent deal!

There are 2 hot counters of food to choose from.  1 is International and the other is Chinese cooked food.  You can get noodles, rice, lots of selections of different   Meats; General Tao Chicken, Szechuan chicken, Beef with mushroom or broccoli and lots of other ones.  Fish and pork selections are also available.  All hot and ready to go.  They also have a gelato counter and a Bubble tea counter too.  

Oooh!  Love this place!  If you want to just get your groceries, you can do that but if you want to just hop in and buy dinner so you don't have to cook, you can do that too!"}
{"text":"I love this place and I'm super glad it opened in the area! I no longer have to drive to T&T or Btrust to get my Asian and International necessities. 

The inside of the place is very clean and nicely maintained, and they literally have everything you want.. And at affordable prices. They also have flyers with deals on meal combos. 

I highly recommend coming here closer to when they close every night - they have a bunch of end-of-day sales on the cooked food. For those of you who hate preparing breakfast or lunch, you can grab various prepared meals for very cheap to pack the next day (e.g. mini caesar salad boxes for less than $2.00, salad and snack boxes for less than $4.00, 3pc cooked chicken drumsticks for $3.00) - the prices vary each day and with each food but there is always a good deal. A friend of mine and I had a late dinner here once and feasted until we were full for less than $10 each. Worth. There is a food court seating area here where you can feast :D

The one thing I didn't like here is the bubble tea - it's definitely not the greatest but it's not bad for the price. 

This place has become a staple to my week and I'm a regular :)"}
