{"text":"what a disappointment, I was wondering what would come in this spot after starbucks left. Watery, badly poured espresso shots. Obviously the focus is the milk , which explains why my wife's mocha tasted like warm milk with little to no flavour. It was literally an off white colour.  last time I will waste  $4 here.  Staff also seemed less than engaged. we asked for them to make it again saying it was weak and watery. we got another weak and watery nothing coffee."}
{"text":"Awesome coffee place with affordable drinks and a great area for getting work done and reading.  Since most cafes don't open as late as Starbucks, it's good to find a place that has longer opening hours.  It's good to plug your phone into the wall mounted USB chargers and while the afternoon away on a worthy book or simply get some work done.  Drinks are your usual fare, and I like the option of getting a combo of a glass of milk and a cookie as well."}
{"text":"I came here with a media invitation and gift card. Not only were they missing half of the menu items, they also didn't take gift cards. The cashier and I were frustrated by the auto-slide menu screen, because it wouldn't stay on one page for long enough for us to read it!"}
{"text":"Service is A+.  Decor is cool. Food choices at 11 am are spot on and varied. I really want the Cadillac sandwich. There is plentiful fresh fruit as well as a couple of yummy yogurt and granola offerings for us calorie counters.   I picked up a skim milk latte and a mocha, my latte was just the right temperature when it was served up. Which meant I got to enjoy it right away. The milk was unsurprisingly, perfectly warmed and tasted perfect.  The mocha apparently was good. Not too chocolaty, which he wasn't thrilled about,  but is my preference.   At the end of the day, it's a chain, the staff are A+, the offerings are yummy and mainstream. The place is a bit souless, but much more convenient then mabels and the Mexican coffee joint in terms of layout etc for a quick pick up or a sit down and use the lap top for a couple hours.   My suggestion are go for a quick snack and coffee during the day, or stick around and enjoy the nifty seating and supreme milk choices(I think 10 varieties), but don't expect over priced but mind blowing quiche or a heart attack strength coffee.   In a neighbourhood that loves it's mom and pop, artisanal, local, small batch items it will be a nice thing to have something a little more laid back like this I suppose."}
{"text":"I've been to Natrel milk bar 4 times now and here was my experience.    1st visit:   I was at Natrel for their grand opening and it was spectacular!   The shelves was full of great looking sandwiches and baked goods, great coffees where you can choose lactose free milk and even their signature Maple Syrup milk.   It's basically a coffee and dessert bar that features Canadian Natrel milk.....which is my favourite milk and the best tasting lactose free milk on the market.  Don't believe me?  Do a taste test.....natrel lactose free vs neilson lactose free......neilson tastes like really gross sweet sugar water.    The grand opening also had a latte artist who did an excellent latte art of my pup....made great milk shake, and I came home with a nifty TO-RON-TO t-shirt that has milk cartons for our cityscape that is still a favourite of mine.    2nd visit:   Not many people in the store, but we had just had dinner at the Drake Hotel and wanted some dessert.....I had them make an Adffogato (expresso on ice-cream) that was AWESOME!   Hubby had a smarties sundae which he enjoyed...that was great!  They were missing a bunch of menu items but I figure it's because they just opened and that's okay.  3rd visit:   A friend and I was waiting for an event to start in the area and so I wanted to show her this Natrel Milk bar.   Went in at 8pm, it was empty...nothing on the shelves, one person working there...it looked quite sad.  The sign said they opened till 10pm I think, but yeah since it was so desolate we didn't stay there...we went to Poutini's and had a snack instead.     4th visit:   It was 8pm again....and we were in the area for another event around the area with a new friend, I wanted to check it out with her and show her the cool Milk carton shaped seating areas.....  It's not even suppose to close till 10pm I think....but it was closed.     So had it not been the last two visits, I would've given this place a solid 5 stars....but they started out strong and shortly after, kinda just disappointing."}
{"text":"I absolutely loved the decor, so original. I had a blueberry muffin which was pretty good except it only had all of 3 blueberries in it. It definitely would have been better if it had more blueberries, after all that is what I paid for."}
{"text":"A new addition to the neighbourhood had me curious to what it had to offer an area already teeming with coffee, food and hang out options. The answer seems to be milkshakes, wifi, and a really good red velvet cookie. Came in on a random Thursday night after dinner to find the stylish space relatively empty. Several people were staring at their laptops, plugged into the easily located power sources (the laptops, not the people).   We were looking for dessert, so we skipped the many sandwich options available and ordered a milkshake and cookie instead. The vanilla espresso milkshake was made from ice cream from the soft serve machine and a freshly pulled espresso, along with the usual ingredients. The red velvet cookie was so soft, it's basically cake shaped to look like a cookie in order to sandwich the cream cheese icing. It was a bit expensive for what it was, but really good so it made for a good treat. Will remember this place the next time I need a place to get get some work done!"}
{"text":"The Natrel Milk Bar by java u cafe recently opened in downtown Toronto on the corner of Queen & Dovercourt. Natrel has partnered up with Montreal-based café chain java u to bring forth this concept café in hopes of drawing coffee lovers to their newest endeavor. The Natrel Milk Bar by java u cafe offers a selection of 7 varieties of milk, allowing customers to create their own personalized coffee to their liking. It is the place where coffee lovers can have a delicious, and an original coffee experience.  As mentioned above, the concept café features a great selection of milk, including skim, 2 percent milk, and lactose-free. I know many people who are lactose-intolerant, and they try to avoid many of the coffee chains as they don't always offer lactose-free products.   I liked that they also have a seasonal menu including a variety of milk shakes and ice-cream that are now available for the summer. I opted to try the Strawberry Milkshake, which wasn't too overly sweet but kinda bitter.  There's wifi, which is always a plus."}
{"text":"Things this place has going for it:   + It's quiet  + The booths are comfy. + The outlets are plentiful. + The croissant sandwich with gruyère is YUM.  Things I didn't love:   + The staff is less than enthusiastic. + The Americano is watery. At least for me. I got a double shot but it came in a medium sized cup full to the top. I could have done with almost half this amount of water.  + It went from having no music and being weirdly quiet, to having top 40, and back again, in the 45 mins I spent there.  + The ambience is a little generic for my tastes. I could definitely sense that corporate milk money situation throughout the space."}
{"text":"Starbucks is gone, and the neighbourhood felt a big sigh of: Yes! The chain gang are moving out! That's the best part of Toronto, as a neighbourhood gets cooler it doesn't get more Starbucks, it kicks em' out. But wait, what's moving in?  Natrel Mik Bar. Yes, like that Natrel, like the big boys of milk. Huh. That's random. We popped in and had a milkshake, which was pretty meh. Made from strawberry syrup and milk, I believe. Nothing to write home or to Yelp about.   But the interior... Dang, I'll give it to them. Sleek booths, long couches, little tables and so many outlets for your remote working needs. What about AC? Yeah that, too. Wifi? Champion levels. So, I guess I will be back for a coffee and an egg on somethin' one morning because this place is A-OK."}
