{"text":"As a Fonthill native and regular attendee of the town's weekly Farmer's Market, I've spent years oogling the baked goods that Nature's Corner sells there and years daydreaming about their delicious carrot cake.  Recently, I went to the actual location for lunch and have since been 3 or 4 times - it's THAT good.

Normally I like to try a variety of different things when I go to restaurants but here, I've fallen into my groove.  Their ham and maple cheddar panini, with mango chutney, is to die for and I can't bring myself to order anything else!  They have quick, friendly service, a nice location, and a great variety of food and drink options.  It's a great place for a quick lunch or snack!"}
{"text":"Nature's Corner is a cute little bakery/cafe located in the tiny Village of Ridgeville, Pelham. They make breads, muffins, squares, cupcakes, pies and seasonal treats. They also serve sandwiches and soups. I can vouch for their soy chai lattes, muffins and veggie sandwich (the latter comes full of sprouts and vegetables on thick, fresh baked bread). The cafe also doubles as a fair trade shop with all kinds of food and gifts from South America (bags, jewelry, teas, coffee, condiments, etc.). 
A nice little nook for reading or having lunch with friends. In warmer months, there's an outdoor patio."}
{"text":"A beautiful little spot with coffee and treats to hit the spot!  So glad we found this place on our trip today.  Very friendly staff and great food!  (The Blueberry Sausage breakfast sandwich was to die for!)"}
{"text":"Was quite impressed with this road side cafe. They sold endearing odds and ends that decorated the store front. 

Menu does have vegetarian and gluten-free friendly options. All parties with us were impressed with their meal and presentation. Carnivores alike were pleased.

Almond milk is avail :D which I had place in my matcha tea latte. Their soup of the day was  squash based that did not immediately sound appealing but was SO GOOD and creamy. 

Server was prompt and friendly. If you are on the freeway and need to grab a bite before sightseeing Niagra like we were. Give this cafe a try."}
