{"text":"Discovered this place about a year ago and I've been several times since... I completely fell in love with this place. I haven't tried one dish yet that wasn't good the quality of the food is amazing. Most dishes come with salad bar , soup and fresh pitas with hummus for below 25$ per person.   Its a little gem that really blew my mind and I really hope it never changes.  To top it all off it's bring your own wine!!"}
{"text":"This place is a hidden gem! I was looking for byob places in Laval, and came across Nazareth, specializing in middle eastern food. The decor is simple and clean - dark wood tables, banquets against the walls, and photos and artwork on the walls. Many dishes come with the salad bar - which is awesome! This is not your typical salad bar - there was fattoush,tabbouleh (refreshing but a little salty), cucumber salad, possibly the best babaganoush I've ever had, pickled turnips, olives, tomato-based slaw, and more. Everything was great. We were brought piping hot fresh pitas (house-made!) and delicious and smooth hummous.  Our waitress was pleasant and funny, and recommended the Nazareth chicken ($11), which she said was delicious. It was! Mildly sweet and incredibly juicy. At our table was also the shish taouk plate ($9.50), kafta plate ($11), and filet mignon brochette plate ($13). Everything was very good - the kafta was flavouful and packed with crispy pieces of onion and fresh parsley, and the filet was nicely cooked, though there was a little grizzle. There was a bit of confusion with the orders in terms of ordering half rice/potatoes and only receiving potatoes, but the rice was good so I didn't mind. The value/quantity/quality ratio is pretty hard to beat - I wish I knew about his place earlier!"}
{"text":"Excellent Shish kabab ( le Khash Khash). Bar à salade à volonté et de bonne qualité. Excellent rapport Qualité-prix pour un resto apportez votre vin."}
{"text":"It's one of the best of the best restaurants ever . Everytime is the same food quality. It is a hidden gem that must be exposed to the world"}
{"text":"This restaurant is a hidden gem in ste-rose. BYOW+Lebanese food+bar salad, what more can u ask ?  Great service ! You can tell the owner is a passionate  I had the chicken which was really good"}
{"text":"I've visited a few times now and I recommend it for those looking to experience this type of cuisine. They do have a buffet menu but I always ordered off the menu.  I recommend the following:  Fattoush Soujouk Meat plate (shish-taouk, kebbe, filet mignon)  Wasn't a fan of:  Calamari Limited garlic sauce.  Price tag is reasonable and service is pretty good. Plates are pretty generous. The salad overflowed."}
{"text":"The small restaurant is packed as the food is delicious. My 3 stars are due to the bad service. There was only 1 waiter who could not keep up with the number of guests."}
{"text":"Nazareth is a small but very pleasant BYOW restaurant.   Their food is really tasty and the staff is really nice. Almost everything on their menu comes with a salad bar and soup. The salad bar was very good. They have  a variety of middle eastern salads like fattouche and tabbouleh but also stuffed vine leaves, baba ghannouj and much more. You also get hummus and pita on your table.   We were a big group and everybody was satisfied with the quality and the taste of the food.  Totally recommend this place!"}
{"text":"Excellent petit restaurant du Moyen-Orient à Laval. De l'extérieur, le restaurant semble n'être qu'un petit resto de quartier de centre d'achat...   Mais à l'intérieur, Nazareth nous offre une expérience fort différente. Excellente nourriture à un prix imbattable (brochette de filet mignon pour 14$) avec bar à salade et soupe.   Nazareth nous offre la possibilité d'amener notre vin ce qui offre un rapport qualité-prix encore plus intéressant!.  Un petit bijou bien caché à Laval!!!"}
{"text":"Wow!! Vraiment excellent! Bar à salade varié et délicieux, soupe, pita avec hummus maison,  des assiettes bien garnies et délicieuses pour un petit prix. Nous allons revenir souvent :-) et en plus c'est apportez votre vin! Je suis vraiment impressionné"}
