{"text":"Love shopping here! One of the best commissaries I've been to! Always well organizes and always have what you need."}
{"text":"I shop here weekly since I live on base. I like the store itself but two of the cashiers are awful. I try to use self checkout to avoid them but sometimes they're standing right there running their mouths and saying things that shouldn't be said, perhaps it's a cultural difference because they're Asian but I'd rather they didn't talk to me at all."}
{"text":"So coming from Fort Myer, Virginia to this base's commissary was like going from trailer park waitress to lottery winning princess. My husband is still stationed at Fort Myer, came onto base during vacation to buy groceries for my mom. Upon walking into this place, it's huge and bright and was like a wonderland for me. Myer's commissary is like the children's section of the library, you know why it's there but it's not meant to satisfy adults.I loved everything about this commissary; food was great, prices were great (except for eggs, those were expensive), service was great. I would go on vacation again just to buy groceries from this place. It's amazeballs!"}
{"text":"Venue:  Nellis AFB Commissary

Decor: Like most commissaries

Service: Nice, Friendly, Helpful

Environment: Laid back

Food: Variety, Options
 
Prices:  Seemed good,Awesome
 
Debbie Downers:  I'm not sure....I liked what I saw.
 
Conclusion: Affordable, a lot of variety, plentiful parking, helpful staff, clean. a Winner
 
Overall: B+ / A-"}
{"text":"This place is amazing and I would recommend going to this grocery store as opposed to any other if you can. 

First off, there is a variety and diversity in the foods/produce. For example, there are the common produce you would see in normal grocery stores, BUT there are additional items such as white squash, Japanese sweet potatoes. 

There is also a giant selection of healthier brand foods (I've never even heard of). So in addition to what you normally see, there are healthier options. 

Not to mention that the items are tax-free. 

There is however a \"surcharge\" which is a % of your spending that goes specifically towards the commissary. It's not much, our bill was 104 and the surcharge was $5"}
{"text":"Love the prices and selection. Healthy choices also, and very convenient for us."}
{"text":"They really do the most to make sure you feel like you've been given a great deal. One of my main reasons for shopping there is the seasoning options/prices. I'm a very diverse eater so being able to change things up so often without having to spend too much is awesome."}
{"text":"The organic selection keeps getting larger!! Who needs expensive \"whole foods\" if the com has everything you need for cheaper price."}
{"text":"I really enjoy coming to the commisarry...on non pay day weeks. DECA raises prices around the 1 and 15,take notice and you'll see! However,the produce is always fresh and meat is really affordable here.  You can often find me swooping in for my lunch when I don't feel like packing a lunch! 


Return factor: for sure!"}
{"text":"First time here and the service was extremely slow. Only two registers were open and both lines were long. Then there were three for express lanes open."}
{"text":"Good quality meat that's cheaper than anywhere else.The only thing I hate about this place is how small the aisles are.On a busy day it's very hard to get to what you need specially since they put the doors on the cheese and yogurt section.I find that most of the stuff there is cheaper than anywhere else,but I do wish they would have more variety.I would like to see more international,and organic items."}
{"text":"The commissary is clean,  well organized and easy to navigate.  Everyone is very friendly and helpful. No long lines or aisle congestion.

They have a lot of different  cultural selections that are hard to find elsewhere. I was able to easily find all the spices and oils that I needed. I think the selection of bulk items like candy bars and other snacks is also a good deal. They also carry quite a few gluten free products ! The deli has a great variety of selections, and the bakery offers beautiful cakes. My daughter enjoys the Sushi .

Everything else, price wise is comparative to what I pay at my local supermarket. That includes fruit and produce, meats and dairy.  Personally as I do not live nearby, it's not that much of a savings once I factor in gas. If you are in the area though, enjoy !"}
{"text":"This is a medium size commissary.  That being said it is not too bad.  The selection of items is decent.  The vegetable department had some really good deals.  We always load up on fresh veggies when we come here.
   I do not buy much from the fresh meat department.  They have lower quality beef and the Clubs have better prices and better quality.   
   The deli section does have some good deals and nice quality items.  We also like the can good,  spices, sauces and dairy sections.  There are some pretty good deals to be found.
   The frozen section has some of the better deals.  The frozen veggies,  frozen meals and ice dream are everyday amazing deals.   When they have a sale it can be 50% less then the out in town grocery stores.  
    The service is pretty good.  The cashiers are always friendly and the bagging staff are pretty nice.  The baggers work for tips but I always feel they earned it.  Overall a great place to safe on the standard staples."}
{"text":"I like coming here to do grocery shopping once a week, it's pretty cheap as far as a lot of brand items go compared to other grocery stores and walmart, and it let's me get gas and do a bunch of things on base. I've been going to the Commissary since I was a little child and has been usually the main source of groceries for my family for many many years now. 

I do however recommend keeping look outs for sales out in town though, when that happens, it turns out to be a lot cheaper shopping their than the Commissary for that purpose. 

There is a 5% surcharge on all grocery, including food and non-food items. I know out in town you don't get charged taxes on food items, but non-food you do. So really you need to watch out for the prices of things. I shop everywhere, but when it comes to Pet food, non-food items, and produce I generally shop at the Commissary because it's a LOT cheaper."}
{"text":"There muffins are awesome!  Banana nut is my favorite!"}
{"text":"My husband retired from Nellis AFB we have always shopped at the commissary. We shop every weekend and 
Love it!!"}
{"text":"Nice and big. They have everything you can need in one store, except good employees. Well let me not say all of them, mainly the elderly ones and the ones that guard the self checkout like Fort Knox. First off, it's a Air Force base, what happened to our core values of integrity first that you must treat everyone like a criminal and interrogate them? Second, I have to scan my id to even use the self check out so then don't jump on my back about my id, and third if you would stop chit chatting and gossiping you could bring yourself to see my id when I scan it not 10 minutes after I already put it back in my pocket. So there go find what your looking for, but I'd rather go to the express aisle to avoid the dungeon master at the self checkout"}
{"text":"Not sure what happened to my original First To Review?? But I guess I'll write it again:(  

The Commissary is the grocery store on base to serve families who are typically living on base.  However, those who have served and are still on active duty living off base reap the benefits of shopping at this grocery store too, which offers lower prices than the typical grocery store.

It's not convenient for me but the prices on produce, meat and dairy are worth the drive.  No taxes charged here, so great savings. Alcohol is purchased at the LIquor store not at the commissary, and its located just down the street. 

I always carry some cash with me to tip the helpers that carry the groceries out to my car. Around .50 cents a bag I heard is acceptable. 

I can't find all the items I need/want here but when I'm on base I load up with meats which are wonderfully priced. Bakery always has nice AF themed cakes too. You need a valid Military ID at check out when purchasing your groceries so don't forget it!"}
{"text":"I have a love/hate relationship with the Nellis Commissary. I was going about once a week but have tapered off to every other week. 

What I love/Why I go:
They've increased their organic fresh vegetable section to include romaine lettuce, cherry and/or grape tomatoes, carrots, oranges, apples and bananas. They have whole coconuts too!

I love getting fresh deli meats sliced and they carry Boars Head. The Boars Head sliced roast beef is the business!

They have various ethnic foods which caters to the diverse population. They even have trip-tip and andouille sausage, two of my favorites. They recently started supplying true free range eggs vs. the factory farmed cage free varieties. They have some bulk type items (Costcoesc) for really good pricing. 

Its enjoyable to try new products because their pricing isn't enough to dissuade my curiosity.

They have seasonal sales to include case lots of popular selling items and seafood sales where you can buy your weight in scallops, crabs, catfish, lobster tails and other fish. 

What I hate:
They have inconsistent stock. Meaning I may try a new product and become in love with it but after a few months, they don't stock it anymore?! Three examples: Maple Grove waffle mix, Frontera Salsas by Rick Bayless and La Banderita tortillas.

You try and request items or get information on getting new items and you are directed to a black hole; meaning nobody knows isht (nothing).

There are young and elderly baggers who will help you bag and carry your groceries to your car in exchange for a tip. Why do I hate this? Because it feels like subliminal pressure to pay someone who may have made bad choices if their loading groceries way past retirement age.
Sometimes there are more baggers than employees. I think most just do it to get out of the house but at the end of the year all that money adds up and I am able bodied and can use the exercise myself. This is my own personal judgment even though there is nothing wrong with what they are doing. 

I am happy that the commissary is available to me/us and will continue to use it as long as it is available."}
{"text":"Good selection, great prices...
More and more healthy choices, gluten free, organic, low carb... Ect.

Outstanding deli!"}
{"text":"This commissary has been in my family's rotation for quite sometime. I have seen it change a lot as well. I even used to frequent it before it changed locations on the base. 

Overall you'll be able to find your necessities here, along with a few specialty items you may need for that special dish you'll be making during your work week. The spacious commissary offers wide aisles for numerous people to be milling their ways through their shopping trips. Of course, the commissary is known to me for doing my monthly shopping, so I need plenty of space and time to get all my groceries.

The produce section is quite large and they sometimes bring in fruits and veggies that aren't so run-of-the-mill. I do find their bakery section to be disappointing sometimes, as I have tried to look for fresh pita bread here once and they did not have any. However, next to the bakery is a great place to pick up a sandwich or a sub, they make very good ones there and you'll find the service members often here on lunch breaks getting a sandwich. There is also a sushi place, which I have yet to try, but my husband says it is good. I'll take his word for it, for now.

Since the renovation they have added \"fast\" and \"self checkout\" lanes, which is quite nice. But since I'm normally here buying a whole basket full of food, I rarely use them.

Cashiers are typically very nice and the baggers are too. Don't forget to bring a tip if they're helping you out to your car!"}
{"text":"You can't beat some of the deals at the Commissary - so much lower than off-base.  Maybe not exactly the selection of  other major grocery store chains, but it's definitely worth it, and they aren't missing much. Lots of fresh produce, seasonal stuff - they've got it covered!  Plus, they're definitely keeping up with technology, as they even have self-scan.

And where else can you get a pink Nellis tshirt for $7  Oh yeah."}
{"text":"I'll be the first to admit, I'm a little choosy about where I grocery shop. I look for three major things - quality produce, quality meat and prices. 

I have a growing family and we shop weekly and for me that usually consists of 2-3 trips to separate stores because I refuse to buy meat and produce at Walmart.

For whatever reason, my husband suggested checking out the commissary and as a mother and wife it was practically heaven.

First stop, produce section, very clean and everything looks fresh - there's a great variety as well. 

I stopped by the deli counter (they carry Boar's head) and was impressed with the quality there as well. 

I wasn't super pleased with the meat department (it's not Walmart quality but I'm weird) I was able to pick up a huge pork shoulder for $10 and couldn't pass that up.

What was best for me was that they carried literally everything I would've normally made a separate shopping trip for...sippy cups? Shampoo? Even the dog food that we normally have to travel to Pet Smart for!

They were well stocked and very organized with the upcoming holiday.

If you have the privilege of coming in here, definitely make the trip."}
{"text":"Everything you need and more is at the commissary.  If it wasn't for the commissary I would have to drive 20 minutes out to buy groceries haha.  rating 5 stars"}
{"text":"This is still our go-to place for groceries even though we own a Costco membership for years. We've compared prices from meats to produce to basic household items and the commissary prices are very competitive (not to mention tax-free). The produce aisle are always full with fresh vegetables, which may not always be the case in other commissaries, so Nellis definitely ranks high in my list (other top-quality commissaries include NAS San Diego and Travis AFB). However, we still go to Costco for fruits as they usually have better berries, apples, and grapes. 

Their \"international\" aisle is limited but occasionally I would find good finds, such as on New Year's eve, I was ecstatic to score a gelatinous rice flour mix so we can make \"palitaw\" (traditional Filipino food that should be cooked when the clock strikes midnight). 

The cashiers and baggers are helpful and warm. I also just want to reiterate that the baggers in all commissaries ONLY work for tips as they are not salaried employees, so please make sure you give them a few bucks when they help you take your groceries to your car."}
{"text":"Great selection for food shopping here! And the prices are unbeatable! I get my organic fruits, salads, grass-fed gr. beef, coconut water, fresh herbs, organic brown eggs, cheeses from 'round the world, hummus, fresh-baked artisan bread,Irish butter, Greek yogurt, etc etc etc, all at this commissary. Now, if they'd only bring back the organic goat milk & some real New Mexico green chile stuff, I'd pop that 5th star right in! ;-)"}
{"text":"Here is the deal:

No tax on purchases, but there is a service charge.  Items are competitively priced, especially produce and meat. If you don't live in the area, it's quite a drive, and may not be worth the trip to save a few bucks.

Avoid this place at all costs around the 1st and 15th of each month (payday) - you will regret it if you choose to shop at these times.

It's a large store and you will find everything you could ever need, all in one spot.  The staff is friendly, considering the crowds they deal with.

TIP YOUR BAGGER! I believe that they only work on tips, and they work hard."}
{"text":"Great place with exceptional customer service! I am back on the Mainland! Huge store with a vary large variety and great prices. Coming from Hawaii we are used limited to what came in the shipment. Here, that is not the case! As a visitor, this commissary was a welcome sight. Great place with exceptional customer service!"}
{"text":"I love the commissary! Especially when they have their white tent sidewalk sales! Seriously, you can't complain about cheaper prices and tax free shopping!(although there is a minor surcharge that's nowhere close to paying tax) They're always fully restocked every morning (the best time to shop!). 

My only mehhhh is that the self checkout is really slow when it comes to coupons, like a minute processing time per coupon! So when people go through with coupons, it really backs up the wait time for those in line."}
{"text":"Good selection, great prices.  Very happy to see they are getting larger organic sections, and now have (from time to time) organic ground beef.  That saves me a trip to Trader Joe's!

Baggers could use some training....they make the bags WAY too heavy, even when you ask them not to.  We use nothing but those green zippered insulated bags sold there, and once when I got home, I found (yes in one bag):  5 lb bag of flour; 10 lb bag of sugar; one of those extra large containers of coffeemate creamer, and a large bottle of Ocean Spray juice.  IN ONE BAG!  They also put things together that shouldn't be.  When I got home another time, I had a bag that had a bottle of Simply Orange juice that had been sitting on a box of Dove ice cream bars.....guess what happened to the ice cream bars....yep - crushed.  I don't understand it.  We are there on a pretty much weekly basis, and always tip $5.  What gives?

I won't let the bagger situation sway my rating for the Commissary itself.  I think it's nice and clean, with good selection and great prices.  (Now if only they would do away with that gal on the weekends who always has a special \"at the back of aisle 17\" LOL ... those of you who shop on the weekends know what I mean!!)"}
