{"text":"Thank you, Yelpers.  I wouldn't have tried this place if it hadn't been for your reviews.  Came here for a quick dinner with my husband.  Ordered off the specials menu; prices in the $5-$6/dish range. Had the green beans with ground pork,  chicken wings, and singapore rice noodles.  Chicken wings were average. Everything else was tasty and hit the spot.  Service was surprisingly friendly (I never expect Chinese restaurants to have good service--I can say that b/c I'm part Chinese).  Highly recommend to anyone looking for good, reasonably priced Chinese food in this part of town."}
{"text":"We had a great time at New Treasure. The food was great, good service and we came away *stuffed* for $15. Very convenient location makes it a good place to drop in for a quick dim sum fix.  Visted: July 20, 2014"}
{"text":"Awesome dim sum.  The best sticky rice I have had.  Really good BBQ pork, shrimp and beef vermicelli.  Owner is very polite and service is excellent.  Been coming here for years - always a treat."}
{"text":"Went here after reading good things about it for take-out for dinner and got some vegetable chow mein. Overall pretty good for vegetable chow mein, and the place was much cheaper than the nearby Spadina Garden (and I'd say on-par for quality of food  -at least for what I got). The staff didn't know english very well but they were a lot friendlier than the staff at Spadina Garden, in my opinion. A good, cheap place, I'd come here again!"}
{"text":"Very reasonably priced and extremely friendly service.  We got there lateish and interrupted the staff lunch, but they still made us feel welcome.  Dim sum was ordered off the sheet because we were too late for carts.  Our selection:  sticky rice, cheung fun, har gow, sui mai, barbeque pork buns, shark fin dumplings...all arriving hot and fresh.  Best was the shark fin dumplings.  No real shark fin in it, of course...it only references the shape of the dumpling (and I refuse to eat real shark fin for obvious reasons), but tiny nuggets of shitake mushrooms make it yummy."}
{"text":"Dim sum is great for the price!  Much better than some of the other options in the are and Chinatown :)"}
{"text":"If you are a fan of real Chinese food and dim sum, this is the place to go.  I can eat Har Gow all day and they do it good here.  Also ordered some regular items off the menu.  Everything was good, the Pan fried noodles were great and I also really liked the Chicken in black bean sauce.  Definitely a place to check out."}
{"text":"The price is right but the place located in a basement, the food was hot and fast but not of great quality. The dim sum menu was limited even though that's the main thing they offer \"all day dim sum\". I had the pork buns (badly formed and ok flavor), the steamed shrimp balls which were good, the fried shrimp balls (good) and the pork ribs, which were average. The green tea was also not that hot or good."}
{"text":"This New Treasure is a reliable dim sum place at Bay/Dundas, a ways away from the manic scramble of the dim sum rush on Spadina. I've been here during the lunch crunch where every table is filled with business-looking type professionals, and also during much slower hours (as in 3pm).  A compare and contrast:  During the busy lunch hour - hustling and bustling, and occasionally a short line appears. Carts (yes, take that Rol San!) circle the underground resto with a range of your basic dim sum goodies, plus some seriously good dumplings. The atmosphere is lively (for a place without windows), food is abundant and tasty, and satisfying to have dim sum without the added stress.  At 3 o'clock pm - the place is empty, and I have to stick my head in the kitchen to call for someone. However, when she arrived she was a jolly smiling Chinese woman and I felt like I was having dim sum in an old family joint as she chatted away with her Mandarin-speaking friend in the corner. Dishes ordered on a form (no carts, alas), but came nicely altogether. Stuffed. Wish the soy sauce was light, not dark.  Recommendations: sticky rice Do not recommend: fried calamari"}
{"text":"Came during off hours so had to order off menu which is tricky because I am not good with most of the proper names. Food was hot and tasty.   The atmosphere is a little odd. This is the kind of place where clearing the table consists of bundling up the dishes in the plastic table cloth. The location below street level makes it seem a little dingy and depressing."}
{"text":"Great little joint, the veggie chow mein had a great assortment and quantity of fungi and Asian vegetables! Got some bean curd pork and shrimp rolls which were a good addition to the noodles. This place has a cozy feel during off hours as its location is out of the way and the owners (old Asian couple) are very polite and make it feel truly like I'm eating at home =)  The food itself while good is not exceptional enough to earn anything over the average 3 star level as competition from Richmond Hill, Markham, and Chinatown make for a high standard to breach. Nonetheless I would definitely go back especially for lunch as the specials are a great price!!"}
{"text":"I didn't eat in - just did a pick up order. The food was good and it was easy to place the order over the phone - I had to look online for a menu. Prices were cheap and it was ready fast.  I recommend the General Tsao's here as I often end up with it being too sweet - at this place it wasn't - it was just right with lots of meat."}
{"text":"Restaurant: New Treasure Cuisine: Chinese Location: Downtown Address: 150 Dundas St W Price Range: ~$10  1: Poor 2: OK 3: Good 4: Very Good 5: Excellent  Food: 2 Service: 4 Ambiance: 2 Overall: 3  Extra information:  *Closed on Sundays *Located underground *Specialize in DimSum  New Treasure seemed to be the Dim Sum spot to go if you were craving it but didn't want to travel all the way to Chinatown according to some online reviews. It was rainy and I was too lazy to drag myself to my usual spot for DimSum (Rol San) in Chinatown so I decided to check this place out. The restaurant is underground and they don't have elevators so keep that in mind. I arrived around 12o'clock and it was already busy at the restaurant. When we walked in, we were quickly seated at this table covered with white plastic bag.   First thing I noticed here is that the cart ladies are very aggressive here...and I love it! The moment we sat down and as I was taking my jacket off, the cart lady charged at us and asked if I wanted anything from her cart. By the time I sat down, took off my jacket and checked in on Yelp, there were already 4 dishes on our table. If you are not Chinese, I am sure you had moment where you find the system quite intimidating (I did 10years ago, now I am pro!) because the food is covered with silver lid and sometimes you can't really understand what the cart ladies are saying. But not at New Treasure, they open the lid for you even without you asking them to and actually explained each dimsum (not that I needed the info) PLUS they smiled at me which I don't expect from most busy Chinese restaurants.  Ordered: SPRING ROLL 1/5 *2 large pieces *they pour soy sauce for you on top so make sure to ask it on the side if you don't want it *Crispy outside but can't really tell what's inside *It wasn't very hot and the inside was kind of mushy  Ordered: SHU MAI 2/5 *4 pieces *Pork Shu Mai (no shrimp or seafood inside) *It came luke warm  *Nothing Special *It was very bouncy for some reason..  Ordered: HAR GOW 2.5/5 *Small in size *Shrimps inside and it was decent *Thin dumpling skin  Ordered: DEEP FRIED SHRIMP DUMPLINGS 3/5 *4 pieces in total *Luke warm again *Served with mayo under the dumplings *This was my fav dish out of everything  Ordered: CHICKEN FEET 4/5 *Sweet Red sauce *Very juicy and plump *Was actually one of the best chicken feet I've had so far *Would have been better if it was served hot *Everytime I eat this I am freaked out by the feet...but it's so good  Ordered: STICKY RICE 3/5 *Unlike other places, this was not wrapped in Bamboo leaf *There were 2 pieces of sausage on top and some meat inside  New Treasure didn't impress me with their food, mostly because it was served luke warm. Which is unfortunate because their food was decent with good flavor but it just didn't feel very fresh or right out of the kitchen. It would have been awesome if there food was served steaming hot cause they are so conveniently located!  However, the service at New Treasure impressed me very much even for a Chinese restaurant where they are usually known to have quick efficient service. There were 2 older managers, 1 younger manager, 2 young busser and 3-4 cart ladies. They were all about quick service and the moment you look up, they were there to notice you and approach you. They even checked our teapot even before we asked and refilled our ice water as well. I was actually looking around the restaurant to count how many people were working there in total and the one of the managers noticed me and asked me if i needed anything.  Summary: New Treasure is the spot for quick, cheap dimsum if you don't have time to go all the way to Chinatown."}
{"text":"How did this place get rated so high?   This place is horrible. It's so dirty. It's been shut down by public health several times.   I went here once several years ago. Food quality was horrible. There was a larvae on the sautéed vegetables. Disgusting!"}
{"text":"Unsuspecting basement restaurant. Dimsum was average, tasted frozen. Lemon chicken was awful. Wonton noodle soup was good. Dirty bathrooms! Fried rice was good. No spirits, but wine and beer available."}
{"text":"Dim Sum?  Yessum!!!!!!  New Treasure is probably my favorite dim sum restaurant in town.  Food is fresh, served on carts and of high quality - what more can a dim sum craving person ask for?  (plastic table cloths of course - but they have those too!)  I go for lunch during the work week and it gets busy around 11:45 AM - be sure to get there before hand or you will wait."}
{"text":"This being my first time in Toronto, I wanted some good authentic Dim Sum as I walked around the city. This place had good reviews, so I tried it out and I was disappointed. The service-was just okay. The restaurant itself was in a cool spot. The Dim Sum-nothing special. The decor-common. I excepted better, honestly. The prices-not bad, tho!!!  **Note: If you are dating someone with a mediocre taste pallet, they Never had Dim Sum before and you are pretty much low on cash then this place is not so bad....Just know that there better Dim Sum out there, OK!  So, check it...I ordered the BBQ pork buns, which were not the best but....I also got their shrimp and pork dumplings, which was not bad. The hot tea was good and the beef short ribs were tasty...But I wasn't satisfied to say the least...you feel me?"}
{"text":"Passed by this place for years and finally came here with a bunch of coworkers on my last day of work. Food was super mediocre (maybe I'm too spoiled by dimsum uptown?)..I mean nothing was horrible, but some of the ingredients don't seem that fresh. Service was also a bit weird to me. I'm not used to servers just putting down random plates of food hoping you want it. We also came here during lunch hours so service was pretty slow. We had to give a lot of effort just for them to notice us. Overall, although not bad, there's definitely better places for dimsum."}
{"text":"I have been here twice. The first time, I learned not to come here for dinner. The second time, I went during lunch for dim sum. And that turned things around.  It wasn't perfect, but it was pretty damn good dim sum for the price ($10-15/full, happy person), and fresher tasting than what I remember of dinner. Sui mai and har gow were decent, as was beef short rib, especially in consideration of the rol-san-like prices (and the quality here is better, with more filling and less rice-wrapper). I do remember that the calamari stood out to me though... I love seafood but don't especially like it deep-fried, and I liked that their calamari was still reminiscent of squid. The friends I came with also enjoyed the food.  Side note: it's underground, so pretty hard to find (probably why it's usually fairly empty). Look for a green sign that goes underground near a Subway on dundas near university.   Also, they charge per pot of tea.  If I am craving cheap dim sum, this is my first stop."}
{"text":"A no frills Chinese restaurant.I came here twice two years ago while visiting Toronto and my dad and I enjoyed the food here. Rating this amongst other non-fancy Chinese restaurants.  Sat down to eat again this year and still found the food quite good. The dish with beans and pork was definitely cooked with high heat (\"wok hei\")and very tasty with garlic! This was from their special menu where dishes are $6.95, and most of the dishes are catered to the North American palate. They serve dimsum here as well which is interesting for dinner but all-day dimsum seems to be a trend here in TO. I was looking for a beancurd dish but all the ones on the main menu were actually soft tofu, so ordered off the dimsum menu. It was good and meaty. I love that sauce.   Wouldn't recommend this for a fancy date, just a casual meal. Old-fashioned decor with plastic bag-like tablecloths. Nothing out of the ordinary if you have been to Hong Kong/China before. It's very dead inside so they might just rely on delivery/takeout for business."}
{"text":"Meh. Run of the mill. Ok if you happen to be in the neighbourhood and want some average dim sum. Wouldn't go out of my way to eat here, though."}
{"text":"Ordered the Satay Beef Ho Fan noodle and Calamari. Calamari was good (8/10) but the Ho fan was a bit meh (5/1). They just poured the Satay Beef and sauce over the noodle (so wasn't cooked together).  Quality - 7/10. Service - 7/10. Value 7/10. Overall - 7/10 (not an average)"}
{"text":"Was taking the greyhound home and craved dim sum so I took yelp's recommendation and tried this place. the basement restaurant is very no-frills but  the food makes up for the lack of decor. Service was really good, the lady was super nice and constantly said thank you. We ordered for two: 6 dim sum dishes Chinese mushroom and tofu hotpot w/ rice    The dim sums were average....note that we went at 5pm so it was order off a menu, I read somewhere that if you go at Lunchtime it's Cartservice. The ones worth mentioning are the curry squid and the BBQ pork buns. Sooo yummy!  The hotpot was tasty too, we couldn't finish but wish we had the stomach!   Overall, would recommend to others looking for a quick and cheap dim sum fix."}
{"text":"Went there as a group of three.  My friend who is Chinese recommended the place.  Ordered some dim sum and dinner for two. Food was delicious  and the place was quite spacious. My dim sum picture got lost but they were good too."}
{"text":"Liked this place a lot! Great service, attendant remembered favorite dish from the day before, read my mind in an instant. Food tastes the way it should, everything ordered was well prepared. And fair prices to top it all.  Will return when I get the chance. Cheers!"}
{"text":"The only thing I don't like about this place is that it is in a basement.  Excellent dim sum served by very nice people.  Decor is actually not bad and the place is quite comfortable.  Extremely consistent.  Reasonably priced."}
{"text":"New Treasure has a few good things going for it... however decor is definitely not one of them. In fact, if you look up and find the phrase \"drab, pedestrian decor\" in the dictionary you will find the quote, \"please do not put a photo of New Treasure here, we have way more class than that joint.\"  Although in fairness, most places in Chinatown tend to be very much alike, however the one difference is that at least those other places have windows to speak of which allow a dash of sunlight to flow in.   New Treasure is underground and well hidden from street view. However this Dim Sum joint has one thing going for it: Reasonable okay flavour for the price -- which, just happens to be dirt cheap. Thus New Treasure is HUGE with the local office-minion-lunch crowd, so expect possible waiting times for your fix during midday.    To be honest, there are a number of places within a 15-20 minute walk which offer better Dim Sum, not to mention in a better atmosphere and offer a much larger selection...   BUT if you are in a rush and just want to get a quick fix, this place will do, and it seems that all the 1-Hour-Luch office workers who are employed nearby seem to think so too. :P"}
{"text":"I had dinner here with my dad recently.  The food was ok.  We had the Cantonese Chow Mein ($8), the General Tao Chicken ($6.95) and an order of steamed rice ($1.50).  Now I don't like salty foods and my usual complaint is that food is too salty, but even I thought that the Cantonese Chow Mein could have used some more salt.  It was so incredibly bland.  I honestly think the chef forgot to add the salt.  Other than the blandness though, it wasn't bad.  It was full of toppings.  It had lots of baby bok choy, chicken, BBQ pork, squid and canned mushrooms.  It also had 2 shiitake mushrooms and 3 shrimps.  The noodles were crispy and the gravy was a good consistency (not too gelatinous like it is at some places).  The toppings tasted fresh and would have been excellent if the dish wasn't so bland.    The General Tao Chicken was good.  It came with green peppers and onions.  The sauce was sweet and tangy and didn't have a strong Hoisin sauce taste like some General Tao Chicken does (which I don't like).  It wasn't as crispy as I like though and it wasn't all that hot (temperature).  I like steam coming out of my food!  It wasn't all that spicy hot either.   The steamed rice was good.  It wasn't mushy or dry.  Service was excellent.  The servers were nice and attentive.    This place is great for a cheap meal.  Prices are lower than food court prices and quality is much better than food court quality.  Decor is typical mid-range Chinese restaurant decor with plastic table cloths that are piled on top of each other and they remove the top one after each customer.  Lots of red and pictures of dragons and the \"double happiness\" Chinese character  abound.      This place is hidden away in a basement.  It's next to the Starbucks that's at the corner of Dundas and Elizabeth Street, near the bus station.  There's no parking lot, so street parking only."}
{"text":"I've passed by this place numerous of times. I keep thinking this place is very sketch because it's located at the basement of the subway on Dundas street so I was a little skeptical when my Co workers wanted to eat here. To my surprised it was actually really good and the this place still rolled the dim sum in carts!!  I haven't seen that in years. It's banned from all resturant uptown.  The food was good and cheap! Oh I will be back here for more!!!"}
{"text":"Good price for dum sum and service.  Not so great in food quality.  As an avid Yelper, I needed to try out some new dim sum places.  I like my dinges and dives but this place needed a renovation, bad.  The classic har gow and siu mai were small and disappointing.  The shrimp wasn't properly cleaned - 'nuff said.  The BBQ pork buns were ok.  All in all, great prices, around $2.50 per dish. And the service was super speedy and friendly.  They had the stir-fried snow peas, which were excellent.    All in all, not my fav in Toronto for dim sum.  There are better, for sure."}
{"text":"RUN away if you can before you go inside. If I could give it less stars than one I would.  The place stinks of seafood. Probably the worst meal I've ever had in my life...... it is terrible .......we took a few bites of a couple of items and the waitress never came to our table once to ask us how everything was or anything no wonder she was afraid to because it would tell her the truth the food is horrible. Best part of the meal was the beer !"}
{"text":"Very good dim sum and quite authentic. Dropped by for lunch on a Friday so it was busy but they accommodated our group. I like that they still have the carts!  And they came around pretty frequently so we were never waiting. There was a good variety and the food was pretty decent. The prices are very reasonable."}
{"text":"Let me start by saying I'm no dim sum expert but I like food and my taste buds work. I was happy with my experience there.  I enjoyed the variety of food carts that came around.  The place appears sketchy because of its location(basement restaurant on Dundas St W) but my experience with these hideaways is normally really good food. My only complaint was my $30+ bill. Wouldn't have been bad but I was alone. I didn't realize all these little dishes would add up.  Will definitely go back. Food was really good. My faves: chicken feet, and the shrimp rolls."}
{"text":"Visiting Toronto, I asked a local police man who happened to be Chinese of a good Chinese restaurant.  He recommend New Treasure.  Being Chinese, soon as I set foot there I knew this was going to be an experience that brought childhood memories to life.  A no frills restaurant, owners working in the kitchen and the floor.  The decor is nothing special by any means, but the food was excellent.  Not oily, fresh, low on the salt and delicious.  If I lived closer, this would be my favorite Chinese restaurant to go to.  Price was very affordable, true Chinese food."}
{"text":"Ok maybe I've been spoiled by suburban dim sum but this place was awful!  Feeling under the weather I was looking for some Congee (rice porridge) in the area, so I decided to try this place out since it's one of the few dim sum places in the Financial District.   Wow, first of all, it's in an old dingy basement, there's this weird stuffy feeling inside along with forced air draft coming from overtop. We sat near the cashier who was probably the boss cause she would literally yell at the staff as if no one was around, not a pleasant lunching experience.   On to the food, just to let you know it's carted around old school style, I prefer new school style of ordering from a tick menu so that your food is carted around getting cold. We only tried one dim sum which was tofu wrapped dim sum and normally it's crispy or steamed, but this was nor crispy nor steamed, it was in the middle so texture was weird, taste was bland and I think the bean sprouts were still raw.   Congee was not appetizing either, super watery and the rice was like the size of sand so odd taste and texture once again.   So to summarize, I'm never going back even they pay me."}
{"text":"If greasy, tasteless food is what you like, then run, don't walk to New Treasure. Had dinner here last night with a friend and it was possibly the worst dim sum I've ever had the misfortune of eating.   We ordered 5 different dishes and quite honestly couldn't tell what we were actually being served. Each plate was as indistinct as the next. The dim sum dishes had little to no differentiating flavours and every thing was swimming in grease. The most disappointing dishes were the pan fried eggplant stuffed with shrimp along with the tofu stuffed with shrimp. I'm not sure what the hell they did with the shrimp, but it was a colourless, tasteless blob stuffed into both the eggplant and the tofu. Seriously, salt anyone? Herbs? Like any kind seasoning?!   The only edible dish was the broccoli served with oyster sauce (I guess it would be pretty difficult to cock up a steamed vegetable dish).    The Tsingtao beers were the highlight of the meal.   The decor, or lack thereof, along with the permeating fish odour did little to improve this already disastrous meal.   I will never darken the doorstep of this establishment again.   All of the yuck!"}
{"text":"This is one of those restaurants that you could easily overlook but shouldn't. Me and my friend are regulars here partly because it's really close to my home but also because it's also a genuinely good place to go to.   Being regulars we also have our regular menu items, if you go dim sum it's almost mandatory to order the Har Gow and Siu Mai and there version it's simple, nothing fancy but still satisfying. Curry squid most of the time is good and perfectly cooked with a nice curry sauce but it could be more consistent (last time we went the sauce was on the watery side). Beef tripe, which may not be too everyones liking, is a favourite and doesn't disappoint with a nice garlic sauce that's just strong enough. The big reason we go there, however, is the deep fried wontons, quite possibly the best I've tried in the city. The New Treasure version is just stuffed with meaty goodness and bigger then what you normally find anywhere else. But again, the last time I went they seemed to have cut down on the meat and it's closer to the typical wontons you find elsewhere.   The level of service is great, the owner is very friendly and welcoming and the wait staff are very attentive, and prices are reasonable with the bill for 2 people (7 dishes) coming out to $25 once you factor in tax and tip. Plus this place is fast, we usually order from the menu and the food is out in 5 minutes. I recommend you go during lunch and avoid dinner if you want dim sum. We went for dinner once and the food tasted like it had been reheated.   Overall I very much recommend this place, especially if you work in the area and need a place to stop by quickly to satisfy your lunchtime cravings."}
{"text":"What a dissapointment - I remember this place used to serve some of the best traditional style dim sum in town.  It was a place I would go if I wanted no frills old fashioned Cantonese dim sum.  However, my visit last week has turned me off on this place permanently.    The har gaw and sui mai were terrible. The shrimp tasted chemically and definitely not fresh. Their other staples were all off. Their sticky rice wrap was terrible. It was a big ball of rice with a huge chunk of chicken - where's the pork, shiitake and dried shrimp? Overall the food was just bland and the flavours were all off.  We ordered 7 dishes and left with 5 dishes barely touched.  This place is probably surviving on the local lunch crowd that don`t have such discerning tastes when it comes to dim sum.  It`s just too bad New Treasure has gone so far downhill."}
{"text":"The trick of dim sum, tapas, or any appetizer-based meal is knowing what you're ordering.  Thankfully whenever I go to New Treasure, I'm either armed with Chinese people, or am in the company of people who know what we ordered last time.  It's a fantastic way to shake things up in the brunching hour when you find yourself getting tired of sunny-side eggs and strip bacon.  Right at Dundas and University, New Treasure lives up to its name.  It's hidden.  Well, down below street level, but you do have to keep an eye out for it.  Once you enter, you could not find a plainer setting.  Once you past the lobster and crab tank, a single room opens to you housing several round tables with plastic tablecloths (you'll know why when it happens) and several place settings.  Once seated, a perusal of the menu ensues.  Unless you know exactly what you want, this can take some time.  But as such, enjoy it.  Tea is brought about rapidly from excruciatingly efficient wait staff, and once prepared, the dishes hit the table with lightning speed.  Dumplings, pork buns, rolls, meats and vegetables show up steaming hot and ready to attack.  In the same manner that the décor is unassuming, the meal commands attention and is above all inexpensive, filling, and tasty."}
{"text":"I came here for lunch.  I had their dim sum and I really enjoyed it.  I came here based on the reviews on Yelp. The location is a little unusual in that it is below ground and so not very visible.  But the service was fast and attentive. I didn't have Canadian dollars, but the server gave me a very favorable exchange rate and I paid in American dollars.  Most of the dim sum, except the sweet buns, were made to order, so they arrived on the table hot and tasty.  I would come here again if I were in Toronto."}
{"text":"The first time I ate here was about 40 years ago. The Dim Sum is good and very reasonable."}
{"text":"Got some Chinese takeout food for Saturday lunch. New Treasure restaurant is an old rundown basement restaurant. There is construction material outside the restaurant which is ugly. I been here before for lunch and dim sum and the food was good.  We ordered beef in oyster sauce, shrimp in lobster sauce and some dim sum. The food was tasty, but I was wondering where was the oyster sauce with the beef.  Will we go back again? Maybe. But I rather go to the restaurants in the area."}
{"text":"Rating: 2.5   Dim sum was very average. Some was not as good as what I've tasted from other dim sum restaurants."}
{"text":"Yelp has the hours of operation wrong. It was open on Monday.  I got the siu mai, lotus leaf rice and Chinese broccoli for $15. Broccoli is good and pretty good value. The rest was okay.  They should offer deals during the day like all one price for $3."}
{"text":"Been here twice now and can't really complain. This is good but not amazing dim sum near my work so I will gladly go for the convenience! Also love that they have the push carts which makes it easier for my non-dim sum eating coworkers to see what each dish is before we order. The quality is good - Siu Mai and Lo Baht Go (pan fried turnip cake for all of you proficient in English descriptions of Chinese food) are excellent, BBQ pork buns, sticky rice, and Har gow are good, and noodle dishes are meh. Don't bother ordering the Shanghai noodles. The noodles were in small pieces, it was overly salty and a bit mushy, and also spicy (who makes Shanghai noodles spicy)?!   Both times, splitting the bill has worked out to about $15pp with tax and tip.   Obviously no comparison to places up north in terms of price and quality, but this is a solid dim sum restaurant and I will probably be back every few weeks!"}
{"text":"Not the best dim sum I have had, but very cheap. The place is no frills, the service is a bit slow, but I still enjoyed my lunch. And for the price, it was decent."}
{"text":"I had the wonton soup The chicken wonton so so bland no ginger garlic or pork Hot sauce on the table is basically tobacco Ordered Chinese greens it was so band and over cooked Hoisin on the side which is disgusting uncooked as a dip No garlic blah Then the last thing to seal the deal the dimsum fried dumpling were deep fried crumbling dry batter and tasted fishy but looked like ground beef goo I was there under 10 minutes and left paying $ 12 plus tip left it all uneaten Dissatisfied and disappointed but hey I chose the wrong place"}
{"text":"I dropped into this little hole in the wall coming off the Greyhound - it was exactly what I wanted. Service was fast and the food  was incredible - I'll definitely be back."}
{"text":"The dimsum menu is extremely small and there's not really push kart, so I was really disappointed (I posted the menu up on photos). The staples like har gow, siu mai, chicken feet, pork ribs are all there and good, though a little salty. The pork ribs with rice is really good. They dont use bamboo steamers so the food is a little dry as well. They don't have custard buns, so i was super sad.  We ordered about 6 dishes and the total was $18 after tax before tip.   It's okay - I'm still searching for the best dimsum."}
{"text":"This is our team's go to place, it is not expensive and it tastes fine. We come here regularly, every month almost as a big group. We always got variety of meat, shrimp, veggies. Eggplant was my favorite."}
{"text":"This (literally) underground Chinese joint is my top pick for Dim Sum in the city. Great service, lots of seating, and good for groups. The plates are served scorchingly fresh and fast, and they pride themselves on having a lot of options. If you like steamed pork buns, theirs are the best. You can order off carts or off the menu and the prices are reasonable. Definitely a winner.  Obligatory Title Pun: Hidden TREASURE on Dundas.  Menu Readability: In both Chinese and English.  Need to mention: Unlike some other places they don't get maddenly busy on the weekends.  What this place teaches me about myself: I'm a sucker for food on wheels."}
{"text":"Yummy food, super fresh and good prices, very friendly staff. The decor is simple but the place is spotless and the beer is extra cold.   I had the sweat and sour shrimp and it was delicious.   Recommend!"}
{"text":"This is the kind of place I would walk by and never pay attention too. It is low priced dim sum and its underground. Overall, I think its fair.  Not a place I would show someone around Toronto, but with some good company, it makes for a nice cheap lunch."}
