{"text":"My girlfriend and I have been going to bamboo house on a regular basis. Then they closed down and switched ownership. Since the new staff has come in the customer service has suffered. 
We have placed 2 take out orders in the last 2 weeks and both times we had to wait 20 minutes longer for them to prepare the food. Also they never offered us a drink or complimentary item for the wait. I wouldn't recommend take out or dine in. They told my girlfriend they would comp an item because they forgot to make it. They made her wait another 10-15 minutes and charged the card and didn't think twice. If you want to be cheated on your money, time, and service than go there."}
{"text":"We had a \"daily deal\" coupon so went to this restaurant on Saturday evening.  My first impression was that it looked decent but only one other table was occupied - we did notice several people coming in for take-out though. (It was raining so that may have made a difference.)  The service was excellent, the wonton soup great, the potstickers very good, but the entrees were just \"so-so.\"  We had garlic chicken and happy family.  Both were in a very bland brown sauce and did not look or taste fresh. The restaurant seemed clean enough but was somewhat dark and dreary.  We have spent a lot of time in China and do not find this restaurant reminiscent of the food we have had there.  We will probably not go back."}
{"text":"How disappointing.  Immediately noticed after entering at 12:30 pm something was not quite right if only 2 tables were occupied.  Service was awful.  Ordered Cashew chicken and received Almond chicken.  Upon informing the owner of the mistake, she took the dish back and placed cashews on top of the almonds and added pea pods.  What the heck??  Never offered a discount, much less took the cost of the wrong dish off the check.  If the dish was good tasting, perhaps it could have been overlooked.  But the food was tasteless.  Even the fried rice was bad.  How do you mess up on fried rice?  Will not be back."}
{"text":"I ordered via grub hub and convenience. I didn't have high expectations because it was take out and fast food. I ordered the soft shell crab; I received a spider roll. I called and spoke to Molly and expressed that I ordered the soft shell crab with ponzu sauce and that I had received a spider roll. She predictably rudely cut me off and told me that no I had ordered soft shell crab and that my order was correct. She didn't check anything; never once tried to fix it. I included the description. Overall terrible quality restaurant, terrible customer service, and deceptive descriptions. The 'crab puffs' are substandard (if there is even a standard for knock off crab Rangoon). The shrimp low mein resembled a frozen meal from winco. I spent $43 on 3 items and I can say that it's not worth your hassle. Midaswell pooch on over to fry's and get you some frozen meals."}
{"text":"Again.........Waited 25 mins past the time I was told our takeout would be done. This is the third time and we won't be back . I hope they put a BBQ joint here when it closes."}
{"text":"Wonderful service. Food was great. The cheese puffs were amazing.  
Atmosphere was very cozy.  The pepper steak and pad Thai were perfect . I also loved the complimentary hot tea."}
{"text":"We've been there a few times. The food has always been good. I get delivery from there often and it's never been wrong. We dined in the other day and while the food was fine, the thing that bothered me was the waitress wearing her earphone and listening to music while waiting on tables. At one point we asked for something and she had to remove her earphone to ask us to repeat ourselves.  Maybe things have changed since I worked in food service & hospitality but that's not something that was ever acceptable."}
{"text":"Had extremely high hopes that this third owner in less than 5 years would be the one, but alas I am very very disappointed. Used to get take out almost once a week when it was Bamboo House. Then Sam and family retired and there was a horrible new owner. She ruined the place and sold it to Moon Valley Cafe owner. Had hoped that it would be back to the neighborhood gem it used to be, new owner even said he had hired Sam's chef. 

I gave New Bamboo four chances to get it right. 

Ate there first week it opened. They brought us the wrong appetizer and no white rice with main dish. When we asked for white rice they brought us a little cup of it for the two of us to share. Portions overall were very small for the price. Service was not good, server was not familiar with menu. 

Because I so wanted this to be a good place and missed having good Chinese food nearby, I gave them three more chances and ordered take out three more times. Each time I was missing something, the food was cold and always missing rice. 

The last time I ordered I was missing the rice I specifically ordered again and my order was wrong. I called to ask them to credit me the missing rice and they said they would call me back. They called me back after they investigated my claim of missing rice and offered me something free next time I come in. Well, after four bad experiences I was not coming back, at last not for a very long time. I had had issues every time I ordered from there and it was my first time calling them in it and they did not treat me with respect. 

I am really disappointed as I had really hoped New Bamboo would be awesome, but I won't be going back. The massage happy hour has a weird vibe, the service has not been good at all and they should not attempt sushi, they need to get Chinese right. Maybe it is growing pains, maybe in a few years they'll figure it out."}
{"text":"Delicious food at a great price. Great service, my dishes were hot, fresh and tasty!  I had the moo goo gai pan and pork egg rolls. Both were excellent. I had them substitute napa for the squash that comes with it as I am not a squash fan. I was so happy they could make this switch!  My friends had the orange chicken and Kung pow--the orange chicken was fried perfectly and the Kung pow was delicious!  Happy hot prices were great, too!  This restaurant is under new ownership and that's a great thing. We will definitely be back!"}
{"text":"Went to try tonight !! Used to go all the time under former owner. Asked new owner a very simple question and he was extremely abrasive and rude! Actually we prepaid for a takeout order and was so upset we didn't even wait! I will take it off my credit card and never ever bother with any business this jerk own including the Moon Valley Cafe."}
{"text":"Very nice looking restaurant. Service very good waitress very nice.   Food was so so However IVF to find really good Chinese food in any phoenix restaurant.  Although the house fried rice was OK the beef in it it was Grizzley.   The ribs  I could not eat at. all. They were tough and stringy The happy family that that companion Got  was good it could be just me I'm used to East Coast Chinese so maybe this is as good as it gets.  I might or might not go back.  The restaurant did look nice though and the service was good"}
{"text":"So good!!!! This little place in a strip mall was quite surprising. Had the pu pu platter, house lomein and orange chicken. Meat was so tender and fresh. Great service. Happy servers. Can't wait to try other items on the menu. Will be back!"}
{"text":"Well was very disappointed order from here last night through grub hub. It took the full 55 to 60 minutes they said it would. Orders sesame chicken which was soggy when I got it not crispy like when you get it as the restaurant which tells me it sat too long in the box after it was made. The barbecue pork was just too salty for me it was in brown sauce thought it would have been red. Like when I go in to get foot or pick up my self but with grub hub I will not order from here again."}
{"text":"A little skeptical about the new ownership but it has been nothing but awesome every time. Fried rice is not very greasy which is hard to find. The egg rolls are large and always fresh."}
{"text":"My teen son introduced me to this place for sushi. We went in for lunch and the place was empty, which sometimes makes me wonder. But I was pleasantly surprised. Our server was very nice & on top of everything. One other table of 2 came in and ordered other food...it looked and smelled amazing. We will be back. Wish I would have taken pictures of our cute sushi plates...but they were gone before I thought about it. Next time Yelpers! 

Check them out, you won't be disappointed!"}
{"text":"Have been coming here since Sam owned it. Menu includes much of what Sam had plus some new stuff.  Biggest disappointment is the dining room. Always empty, though I hear takeout is thriving. The problem is it's lost its ambiance; feels more like a pizza parlor. They've scored a few extra tables at the expense of diner comfort. Too bad. No wonder their takeout thrives. Nobody wants to eat there. The owner owns the breakfast/lunch joint next door and has made a big mistake. While he's added more tables, they sit empty because it's not a comfortable environment for this type of food. Too bad."}
{"text":"Ordered General Tso's - quite possibly the worst I've ever had. There is no flavor, the texture is slimy. Awful. Will never go back."}
{"text":"Very impressed! The food was outstanding, the service was also good. One of the best eggrolls I've had in a long time. The egg drop soup was also very good. I had the shrimp with vegetables it had a wonderful flavor. The new look, new chef and new ownership makes a big difference. Will definitely come back again!"}
{"text":"The last time I went here it was the old Bamboo House restaurant and we weren't fans but on a white we stopped today for lunch seeing it said New Bamboo hoping it improved. It has!

We had the lunch special which includes a cup of egg flower/egg drop soup and the entree has a cream cheese wonton, an egg roll, and fried rice. The portions were large and the food was good. We tried the orange chicken and the sweet and sour chicken and enjoyed our meals. Actually, the egg rolls were very good.

The service was good but since there was only one other table I would expect it to be."}
{"text":"First time here. We live very close by. Waiting 30 minutes for our food. Not crowded so I am not sure. Just asked the waitress what the problem was. 

She said they were swamped with Uber Eats orders.  One would think the three tables they had occupied in their restaurant would take priority. 

We walked out. Very disappointed."}
{"text":"The last time I ate here or got take out was about 2 weeks before they noted they will have a different management. It wasn't bad at all, we had one sit in time and the rest take out. The lady was very nice, brought our tea and drinks out quickly. The serving size were alot larger than now and the price was fair. The price right now is very expensive, their online menu isn't updated because when I went to get my order, it range up pretty high. Most restaurants we got to, rice is already served with the entree. I was charged $1.50 per rice. The new employees are much younger as to the previous workers. Their food was a bit salty compared to the previous cooks that were there. It was \"okay\". Not really worth the price and portion size. The set up was well kept though. I just don't see us eating/ordering from here in the future."}
{"text":"When the new place opened my boyfriend and I came and it was very delicious. Egg rolls, chicken low mein, and Mongolian beef. It was great, so we came back again. We then came back a third time for just dessert, the strawberry tempura is amazing! Then......our love for this place sadly came to an end tonight. We came in, the place was fairly dead and we were seated at a booth. A couple minutes passed nobody came, a few more minutes passed the waitress checked on the table behind us and didn't stop by, then she stopped by the booth literally directly behind us again and did not even glance at us. After about 10 minutes I look at the bar and the two girls were standing there chatting we got up, loudly thanked them for ignoring us, and walked out. I don't expect to be attended to immediately if a restaurant is busy but I do not accept being blatantly ignored in a dead restaurant while you are chit chatting. Say goodbye to once loyal customers."}
{"text":"A remodeled version or the old bamboo house, great food , nice atmosphere , friendly staff ."}
{"text":"Extremely bland and not authentic. I ordered special chow fun, came with crunchy chow mein noodles, not actual soft noodles. So weird. Chicken wings were not very good. Only good thing was the meat was cooked perfectly, not overdone, but all dishes were flavorless. I will not be back."}
{"text":"If you want to spend 20$ on eating reheated dog shit be my guest and dig in. Food is awful, poor taste and presentation. The egg role was disgusting. Don't waste your time coming here, these people should be ashamed of themselves."}
{"text":"Sitting here with my parents.  Food is terrible. Even the egg drop soup was not edible. How do you mess that up. I ordered shrimp lo mein. Looks like congealed goop. Seriously afraid it's going to make me ill. Also another customer killed a scorpion in the dining area just before we arrived. Servers were very sweet though. Also obnoxious rock music playing."}
{"text":"We used to go to the old Bamboo House & loved it. After reading some of the reviews I felt some trepidation about how it would be.
It was GREAT!! The food was just as tasty as what were used to in the old place.
The tea was very good, sweet and sour chicken was all white meat with lots of pineapple, onions & green peppers.
The Lo Mein was very flavorful with beef, chicken & shrimp.

The waitresses were quick & friendly.

We will be returning. So glad that we checked it out, good food, good service."}
{"text":"I love their egg rolls. I also love curry. However, I did not like their curry shrimp dish. I are it, but I don't like to through food away."}
{"text":"I had high hopes and excitement. I've been back a few times for dinner, each time with bland food and poor service from people who are disorganized and a tad rude. Most frustrating, I've attempted (failed) to order lunch to go twice unsuccessfully. With the lunch, my phone call was put on hold and forgotten about for over 5 minutes. I finally hung up. Called right back, and the SAME thing happened again! Uh no- this place is working to not earn business back. 
Food bland each time I went to dinner. I gave feedback each time and yet no fix. The chefs experience in this place was hyped, and it's just all bad- the food is bad. Please pull it together, I want good close Chinese. This place will close if they don't make some drastic change- nobody will put up with bad food and service."}
{"text":"Newly renovated Chinese restaurant been around over a year . Craving Chinese food take out and actually second time around picking up food. Ordered egg fried rice, pork slices, orange chicken and Californian and tempura rolls. As you can see this was a family event! Tasty food in regards to the orange chicken,California and shrimp tempura rolls. The pork slices were not to my tasting and the egg fried rice was a bit dry. All in all a good experience and will be back to pick up more rolls and orange chicken."}
{"text":"I discovered this place a year and a half ago.  Immediately fell in love with it because the taste was the closest I found to being back home in the Midwest.  Recently (New Years Eve) I noticed a decline in the quality of food.  We ordered take out. The calamari was rubbery and the rice was old and stale. I didn't give up there,  I thought it was just a bad night bcuz of the holiday.  Nope! We went back tonight, our egg rolls weren't fresh as they had been in the past and my dish had 3x more water chestnuts than it did shrimp!  I'm so disappointed.  I would have told someone but I don't think it would have mattered. I just hope they noticed the plate full of water chestnuts I sent back when I was done with my meal.  Also,  it seems the service is slower than it had been in the past.  There were 3 tables I heard mention the timeframe it took to get there food or get waited on..."}
{"text":"First Experience and I Recommend, I enjoyed it! I order Orange Chicken, Mongolian beef, Shrimp noodles & noodles salad and white rice. I was so surprised. We order out and I was sitting down with my family and I said \" wow this is really good\". Everyone enjoyed it! Perfect sauce, Hot & Ready. We all definitely be back."}
{"text":"Not the best Chinese at all wouldnt order from again. Tons of vegetables and little meat in any dish-water downed Chinese food. My eggrolls had no egg/meat. My wonton soup was really bad with mushrooms (hate mushrooms) and hardly any pork in the wonton. Didnt taste authentic at all and my husband didnt like his chicken-he said it tasted weird. We threw away his food. How do u screw up Chinese food?"}
{"text":"I love this little place! Grew up going here 10 years ago as the Bamboo House. Came back when they changed owners to New Bamboo. Food was just the same as I remember! I got the lemon chicken as a kid, and had it again today.. Quality, simple, and delicious. Super sweet ladies working here. Very kind & they even boxed up my food for me. Wish more people would try.. it was very quiet here today. Can't wait to come back"}
{"text":"I live in Moon Valley and frequented this restaurant prior to the renovation/change of ownership. Food here used to be A++ and service/atmosphere was decent. I have been back 4 times so far since the reno and the first time the food was not very good. However, each time I have been back the food was better and is nearly back to the high quality it used to be. Service has been great and I like the renovations; it is more open and bright, used to be dark and dated which gave it a hole in the wall feel but not the best place to take the family or a larger group; now that has changed for the better. Also they now have more choices for kids which they did not have at all in the past. Prices are low as well- my wife and I just paid $30 for  lunch which included  appetizer, 2 meals and 3 drinks. Those of you who had a poor experience before should give it another chance ."}
{"text":"We were so happy to see it reopen, but our first trip back will be our last. What a sad turn of events for this place. New ownership is horrible. Owner was having a conversation with his kitchen staff about their pay in the dining room which was extremely unprofessional and uncomfortable for my party and the table next to us. The food was extremely bland and I got the feeling the servers wanted to be more helpful, but were not very well trained.  We will never go back and are done with Moon Valley Cafe as well."}
{"text":"Fresh and hot egg rolls on the happy hour, shrimp fried rice and chow main with steamed rice! House Cab is spot on especially just getting off a stuffy flight"}
{"text":"I enjoyed the first 2 visits i made here. Once for lunch and once for dinner however the 3rd time was NOT a charm.
The restaurant only had 4 other people there at 8pm on a Friday night which was not a good sign. Our server was not knowledgeable about the menu or specials.
The menu stated extended happy hour for drinks until 10pm but she said they \"didn't do that anymore\".
The restaurant was dirty. Bad service. We canceled our order and left. Definitely not going back. I have a feeling this place will be closed for business soon."}
{"text":"The new management made the best decision! This place is now AMAZING every time we come in or order take out. I've never had an issue and we go about 3-4 times a month for staff meetings or just a quick lunch. The sushi is an amazing addition. And the happy hour rocks!"}
{"text":"Definitely was a little disappointed in my visit . I had seen that it was under new management and was hoping for a better experience than previous reviews . I had ordered a to-go order on a Friday night . The orange chicken and the noodle soup . I was told a 20 min pick up time , no problem. Got there pretty much on time and you could tell me order hadn't even been started , no problem if the place would have been packed but it wasn't . 
No worries , that just means extra fresh right ? 
First : 
Noodle soup - no flavor .. like no seasoning , felt like water with veggies . minimal work to it . I had to add some Sriracha and soy sauce just to make it appetizing . Totally bummed .
Orange chicken ... major bummer . Like no orange flavor to it at all . It said there would be a kick . No kick at all . I even thought maybe it will tasted better the next day once all the flavors have had time to sit .. nope . Just felt like I was eating chicken in a thick bland sauce . The only positive I have to say about this was they did use white chicken that was moist and not all dried out (that's why it got a boost on the star ) 

I had hoped my extra wait meant it was extra delicious but was totally not worth it ."}
{"text":"Good food, and nice service. 
Better than the \"old\" Bamboo House, where the waitress seemed grouchy.
Everyone here is pleasant, and the food is delicious."}
{"text":"Food wasn't bad. Vibe was worse. I got the feeling that the owner was in total panic mode. At least that's what I drew from the pacing back and forth asking the waitresses if two of them on the floor was enough because that's what they asked for. Maybe it's just me but I'm also skeptical of an ethnic food establishment that doesn't have an actual person of that ethnicity on staff... well, there was that one guy in the back...

All in all, I might go back once they have an opportunity to get their stuff together. The professionalism needs to be severely polished!"}
{"text":"Just ordered delivery from here with high expectations as I have dined-in here before. Requested utensils and hot sauce with my order. You would think with an entree and soup utensils would be a given. Nope. Food was ok but when I have to drink the soup out of the container and use my fingers to eat my Mongolian beef and white rice I'm not completely thrilled. The simplest things can make a major impression. I wound order delivery from here again."}
{"text":"I decided to try the \"New\" Bamboo Asian Cuisine. The \"old\" one wasn't good. Unfortunately the new one isn't either.
If all you eat at a Chinese restaurant is really sweet sweet & sour pork or orange chicken...with a cream cheese crab puff, you'll probably be totally happy.
I ordered the Yu Shan beef lunch special. It should be nice and garlicky...but it wasn't...it was like a sweet brown sauce.
The egg roll was totally smushy inside. 
Fried rice was dry totally brown from soy sauce but tasteless.
Sorry to leave such a bad review, but the only reason I gave it 2 stars was that the server was nice.
Really unfortunate since this place is really close to my house. But I'll drive farther to get decent Chinese food next time."}
{"text":"Wife and I went on two occasions and food is consistent and delicious. Many different choices to choose from. Since it is near we will be able to try some of the interesting dishes, don't have to drive so far to get good Asian food."}
{"text":"We are customers at this location since before the old Bamboo House so we wanted to try the renewed restaurant. We like the renovations as it opens up the dining room. The entrance hallway has also been tidied up. The menu is much the same as it has been with of course Sushi as a new addition. We seated ourselves at a table and were quickly attended by the young girl who asked us what we wanted to drink. We noted the full bar & happy hour drinks but elected for iced tea. We ordered the crab puffs appetizer and we received 6 perfectly crispy stuffed goodness. Our main courses consisted of the lemon chicken, sweet/sour pork, & veggie lo mein. We opted for fried rice which was a nice choice instead of white rice. Everything was good with just one minor complaint about the lemon chicken because it should be crispy instead of soggy from the sauce. The young girl was very attentive and obviously just learning but she found out answers to all our questions. Very happy to learn that they use Grubhub for deliveries and we received coupons for a first time use discount. We took the takeout menus with us. We also were pleased to note that they have a lunch menu as well as a dinner menu and the prices are quite reasonable. It wasn't extremely busy but a steady flow of customers came & went. We are satisfied with our first visit back here since the re-opening & will takeout or eat in again for sure."}
{"text":"Worst experience ever.. Placed an order through GrubHub and the  restaurant didn't start it because I asked for no bell peppers. GrubHub called and asked if I still wanted the order and I said yes. The order arrived over an hour late, and ice cold. Everyone was starving so we ate the food. It was disgusting, soggy and made my family sick. I will NEVER ORDER FROM THIS PLACE AGAIN.  I wish I could get my money back. GROSS!"}
{"text":"Previously called Bamboo House!  Previous high ratings and reviews can be seen there.  They recently reopened completely remodeled and now they have sushi!
WOW food is always amazing and lunch menu is banging with awesome choices. Chili oil is homemade concoction-yummy. House soup is always full of yummy surprises.  Remodel looks great! Removing the old carpet was a fabulous idea. New floors look great!"}
{"text":"Went to Happy Hour for the fried calamari which I had two months ago. Was so good continued to dream about it. This time, not good. All the breading came off and supposed to be spicy chili sauce. Very bland. The \"combo for 2\" only had one skewer, one egg roll and one fried shrimp. The spare rib was tough.  I  probably won't come back. Service was good."}
{"text":"We thought we'd give this local Chinese place another try, since under new management. Somebody else bought it and cleaned it up AND got the original chef back. The food is just ok. They are redoing the ladies room and I had to use the men's room.....which was DISGUSTING!!!!  And I also had to wait for one of the kitchen staff to finish using the urinal. And there are no locks in the door so ......."}
