{"text":"I know my burritos and there's nothing \"burrito\" about what this place serves up. There's also nothing \"subway\" about what you want to get here, for what they *do* serve are some awesome warm wraps with freshly prepared,  flat-grilled skewered meats which were tender as heck, and if I had to guess, marinated. Yes, they have veggie stuff too, but I was in meatatarian mode.
The place isn't meant to be pleasing to the eye...the walls are painted yellow, the ceiling is sky blue and there are faded black & white posters of the new york skyline on one wall while the wall in the back actually has a faded photo of a sub.
Dino, the bearded Greek guy who prepares your hot skewered chicken burritos, has been working at New York Subway for fourteen of its fifteen year existence. The only other patron I talked to has been coming here for ten.
What else is there to say?"}
{"text":"looks sketch from outside but definitely dont regret walking in and buying some good quessadillas for $5"}
{"text":"Had a lamb satay burrito. Those three words sound delicious individually, but the result was disappointing. Meat was tough, in large chunks, and sauce was actually kind of bland. Not BAD but not worth raving about either."}
{"text":"I've passed by this place umpteen times and knew that a lot of people enjoyed the \"burritos\" here. Since I was in the area, I finally made my first visit today and got the beef burrito. Though I'm not sure about that pinkish mayo and I ordered it spicy (it wasn't that spicy), this was fast, tasty, and decent. About what you'd expect. Scrolling through the other reviews, I look forward to checking out this potato burrito.

Definitely get your meal to go - the street corner has better atmosphere than the interior."}
{"text":"Can't get enough of this place. Been coming for years and it's as good as ever. I usually get the chicken satay or the beef quesadilla. The new owner is a cool guy. All the food is magical!"}
{"text":"Phenomenal. Walked past this place a thousand times and I wish I had of gone in sooner. Definitely check this place out."}
{"text":"Perfect level of spicy for me. My favorite is Lamb and beef, always fresh and tasty, never disappointed."}
{"text":"Been going here for years for the grilled chicken burrito. Sure it's a little sketchy but the food is delicious."}
{"text":"The food? Delicious.
The service? Fast.
The selection? Excellent.

So why so few stars?  Because this place is DEPRESSING AS ALL FUCK--the wall calendar that's still turned to last month; the photo of the owner in his prime, wearing chef's whites, directly above the counter where, thirty years later, he slathers hot sauce on satay wraps; the splotchy wall paint and chipped tile and the cafeteria trays dishing up your sandwiches if you decide to eat there instead of taking your food to go.  It's pretty grim, guys."}
{"text":"On the surface New York Sub might not look like much when you pass by it on Queen Street West.  It might not even look like much once you step foot into the small and underwhelming restaurant but once you settle in and order your meal you will be in for a truly underestimated treat.  

The food you will find here is a mix of subs infused with plenty of Indian spices.  This is not your typical Mexican burrito place.  The subs here are made with fresh ingredients and plenty of love.  My usual favorite is the jumbo grilled chicken burrito, which comes with skewered chicken pieces beautifully cooked on the grill plate.  It is accompanied by a medley of vegetables such as potatoes, tomatoes, onions, lettuce and it is deliciously smothered with a tangy and spicy (it varies from mild to hot so be careful about how much spice you can handle) mayo based hot sauce that makes your senses dance with delight.  It is then all rolled up in a tight package of tortilla bread and crisped up on the grill.  The size of this masterful sub is something of an arms length portion, which for me usually means a yummy left over for next day's lunch.  Be warned you will not leave this place hungry so come with an empty stomach and ready to be amazed. 

With your first bite you will realize you have stumbled upon a real gem in the city of Toronto.  The explosion of flavours in your mouth will amaze you.  Never again will you crave another sub from anywhere else in the city once you try one of New York Sub masterfully crafted subs.  The aroma of Indian spices is delightfully coating every bite of your meal.  People are known to trek here from all over to get a bite of the most delicious sub in the city.  I have heard them say that over and over again much to my approving thumbs up.  

There are also other great items on New York Sub's menu such as the Roti which is equally incredible tasting.  I have tried both the chicken and the butten chicken and have loved every bite of it.  If you need a smaller sized option I usually opt for the quesadilla, which is smaller than the subs but equally flavourful.  The ground beef or chicken is my favorite and they come with cheese and tomatoes and of course the signature spicy or mild/medium mayo based sauce.  There are also both chicken and veggie samosas which I usually grab as workday snack.  They are wonderful and very reasonably priced.  Honestly, you will not find a better value for your money spent than New York Sub.  The prices are very reasonable and the owner and his staff can guide you through the menu and make you the best sub/meal you have ever tasted.  See some of the pictures I have taken over the years to get a sense of what you might be in for at New York Sub. 

So venture out to this hidden treasure in the Queen West area and you will be coming back here every chance you get.  I promise you.  And hey maybe you might even run into me as I am here at least 2-3 times per month.  Bon appetz!!!"}
{"text":"I would like to copy Ed S. from NY's November 14 2011 review verbatim!  It's SO much like how I feel about my experience at NY Subway that I'm actually beginning to believe that I may in fact BE Ed S. and not Mick M. as I have been led to believe by those I have trusted all my life.  I know my parents lied to me before so who's to say they were telling the truth about this?"}
{"text":"I love this place. There is really only one order: chicken satay jumbo burrito
Then you ask (nicely) to add potato 
If it's the older guy, also ask for extra lettuce, as I find nowadays he puts less ingredients then he used to.
Spicy is safe usually."}
{"text":"I liked the food! I got the bean burrito, and it was delicious. The spices were great and the portion was perfect for me, though I'm not a big eater. 
The service was not welcoming or warm. I felt awkward giving them business (as it is right beside Subway)
the location is great, the food is good, but beware of awkward service..."}
{"text":"Been to this place a few times by now. It's always quite good. The chicken and beef options are great, but where this place really shines is the vegetarian burritos. The cauliflower burrito is a little strange but worthwhile, but the potato burrito is truly transcendent. It's something that you wouldn't think would be very good, but it is. 

Also, that sauce they put in most of the burritos is so good. 

Order spicy."}
{"text":"If no one ever recommended this place to me, I would have never stepped into the place. Yes, it does look a little sketch and run down from the outside and the interior ain't the most inviting either...but their burritos are truly amazing. They wrap their burritos with Indian roti. The wrap is so soft but the sauce and juice from the filling doesn't seep through the soft roti. You also get to chose your own spice level, ask for little or no spice if you cannot handle spice. They also have veggie or chicken samosa as well as veggie pakoras. Do not let how the place looks deter you from their food!!!!"}
{"text":"The review is primarily based on taste alone. It located close to where I work.  The place may look like a junk outside looking, but it tastes pretty good and that's really all I care about in a wrap/sub place.  It's made to order so it tastes fresh and delicious.  You can also choose the spice level you want and I always opt for extra spicy which I don't find it spicy at all.  The portion is also very big and priced reasonably.  The deco may look old but it tastes much better than many of the so called chained burrito place out there.  It's fusion style and I think they use potato to replace rice/bead used in traditional Mexican burrito.  I'd recommend any of the jumbo burrito."}
{"text":"A magical place. I hope it sticks around forever. The samosas and lamb kabob have a special place in my heart. When the apocalypse comes, New York Subs will save the day (or night)."}
{"text":"\"Dingy\", \"ugliest\", and \"filthy\". Yes, fellow Yelpers, your comrades-in-arms have not led you astray here. This place is a dump, but something about its shabby-chic thing kind of authenticates its food as the real deal. None of this \"restaurant makeover\" nouveau-moderne faux-mexicano or exotic Indian crap! This is New York Subway and the name is totally misleading but it don't matter cause they are keeping it so REAL.

There are a ton of things on the menu - lamb, beef, chicken, even some random butter chicken rolls - I always just go in for the lamb or chicken, Medium spicy. Given, there are variations of both meats, but they've never asked us to specify, so it's just plain old, \"uhh... one lamb, and one chicken, please). Even with the size, they kinda just give us the up-down and somehow just correctly determine what we'd be happy with. And they always come out correct - as if we'd know any better - but it's part of the Realness. 

To come in here expecting a fat ball of a burrito a la Bandidos is barking up the wrong tree. These burritos are more torpedo-shaped and are spiced with just the right amount of Indian/Asian flavourings. Also - way cheaper than aforementioned Bandidos.

Genuine, mostly friendly folks (they even let me duck into the back to wash my hands once), and a definite staple for a satisifying grab and go in that weird block of Queen West."}
{"text":"Food is sub-par, the service is a fucking joke, and the place is not merely \"dingy\" (as though that's somehow endearing), but totally unclean. Do not bother unless you want to hang out in a dive with sticky tables and listen to shit music for 20 minutes while you wait for an unintelligible old man to hand you your \"burrito\". Oh, and since when do \"burritos\" come with something resembling Caesar dressing mixed with Miracle Whip and sugar water all over them? The beef \"satay\" (ordered spicy) was bland and gross, and my girlfriend's chicken (ordered medium) was passable but somehow spicier than mine.

If you're in a rush and for some fucked-up reason you need to eat on that block, Subway (the shitty chain restaurant) is next door. It's faster and costs about the same and your shirt probably won't stick to the table. (And nobody on Yelp will have falsely led you to believe that you're about to eat a decent meal.) Also, Subway (the chain shithole, not the garbage burrito dive) accepts debit and credit cards."}
{"text":"Used to come here years ago for a delicious inexpensive burrito. Came back today and they've still got it. The size, price, and flavour are spectacular. I get the spinach jumbo burrito everytime... medium spicy"}
{"text":"I agree with the other reviewers here.  I just wanted to add that the vegetarian options at New York Subway are at least as good as the meat options, if not better.

Vegetarians: this place is a gem for you too.  Get the mixed vegetable burrito and choose your top three veg's.

I do want to warn people about something though: the last few times I've been, the guy preparing the food was handling money as well - cash only.  It's pretty gross frankly, but the burritos are delicious."}
{"text":"Seriously THE BEST roti I have ever had. Really amazing burritos as well (I love the potato spinach)... and they are open late! Whenever I travel, the first thing I do when I come back to Toronto is have roti here."}
{"text":"One of those places I just kept walking by because it looked like a dirty Subway.

The chicken satay grilled burrito is excellent and simple. Chicken, spice, lettuce and tomatos. $7.99 later I have found a lunch option that competes with the best of Queen West."}
{"text":"Easily the ugliest place on Queen St. W. - but really who cares?

The burritos are absolutely amazing.  Mind you I never understood why they called them burritos, because I've never had any burritos that even come close to as good as this.

Being a meatarian, the best thing on the menu is the jumbo grilled chicken burrito - perfectly cumin-spiced skewered chicken that is then wrapped with tastily marinated potatoes in a tortilla and grilled again.  It's deceivingly filling, don't underestimate its heft or girth.  Get a fork to eat the bottom half.  The lamb burrito is worth a try, but I still prefer the chicken.

The staff is stern and the service minimal.  It takes a good ten minutes from start to finish to get your food.  As a teenager, the bearded guy scared me in a soup nazi kinda way.  Oh and take out is really recommended, unless you want to smell the grease you ate for the rest of the day.  

The only reason this doesn't get five stars in my books is on a hygenic basis.  Washing hands after handling money is optional in their books, and scratching of the hairy chest might be their secret spice.  And I have no idea what the Kyrgyz or Tibetan gent in the back is always doing.   

Despite all this, order your food, have a smoke, maybe pickup some beers, come back and get the best burrito in town."}
{"text":"Fantastic find for me today!

Happened across this little place, walked inside, and lunch life has been changed forever.

The place isnt much to look at but the food, oh man is it ever good!!!! Dont expected your averaging tasting mexcian burrito though, the ones they sell here have a flavourful kick of spices in your mouth.

The sizes of the burritos were huge! Jumbo means jumbo, and only for 8 bucks too!!! Because I'm a huge rotti fan, I could not help but to also get a butter chicken rotti (thinking I'll save it for dinner). The rotti I got was HUGE (fit a large take out box) and smelled so good I, of course, could not wait until dinner to go to town on this bad boy. Chicken was juicy and tender, and the potatos melted in ur mouth.

Needless to say I will b going back quite often for lunch from now on!"}
{"text":"Great cheap meal if you are in the neighbourhood. Line was a bit of a wait during lunch time, but food was great and service was good too."}
{"text":"When passing by this place it may not look that appealing. In fact the friend I was with was skeptical about it and avoided it based on how it looked once in the past. However, despite the interior the food here is fantastic. The samosas, The chicken tikka, The chicken burrito, we're all fantastic. Highly recommended."}
{"text":"Every time I visit Toronto I try to fit in a visit to New York Subway.  It's that good!  It's hard to describe: think about a cross between a burrito and a curry and everything that is good.  I always get the mixed veg.  I once tried something different and it just wasn't the same.  Even if you are a carnivore, trust me when I say the mixed veg is the way to go.  The jumbo is well. . . big!  If you are of an average appetite, you will be fine with the regular sized wrap.  If you are super hungry (or want to save half for later, though trust me when I say once you start chowing down you won't want to stop, so this is perhaps wishful thinking), by all means go for the jumbo.

The resto itself has undergone quite the transformation in recent years.  On my first visits to New York Subway I found the shop run down and needing some TLC.  Then on one visit I tried to visit and was met by the dreaded newspaper in the windows and the sign saying \"closed for renovations\".  Sadness!  Normally that means \"closed to never open again\".  So I was very very happy to discover not only did they renovate, but it was actually for the better, as the furniture is now newer (and cleaner).

What I miss however from past visits is the older gentleman who reminded me very much of the soup nazi from Seinfeld, except depressed instead of angry.  I haven't seen him recently, and wonder what has come of him.  This time it was a pair of younger people working there, and while they were polite and the wrap was delicious, something was missing."}
{"text":"I'm not really sure what all the hype is about. I tried the potato burrito and found the taste to be mediocre. Sure, it was interesting that they used Indian spices in the burrito, but it wasn't anything mind-blowing. Price came to $9 for the jumbo roll, but I would much rather go for Chipotle."}
{"text":"Tried this today for the first time and I will never be back again. Ordered the 'jumbo' sized eggplant burrito. It is thin and certainly not jumbo sized, there is barely any eggplant or ingredients and it is not very fresh. It was bland and tasteless. At $10.16 including HST it is horrible value. The lady at the counter was not friendly either. My stomach felt extremely uncomfortable and bloated afterwards. It may be food poisoning as I feel sick and unable to concentrate. Horrible experience."}
{"text":"I wanted to write this review while the flavors were still mingling with my tongue. And did they mingle, it's like a feisty fiesta in there. Each bite is layered with spice, and each spice is followed by harmonious medley of vegetables and fish.

This was a two day eat for me, day one was an introduction to a beautiful hybrid baby between a burrito and a curried potato roti. I had the white fish, it was flaky, moist and flavorful. I am a big fan of mushrooms in burritos, and for the first time I didn't feel like a freaky food pariah as mushrooms, potatoes, onions and fish played together peacefully. Each bite was a texture adventure, that carried over two days. 

Day two was a burrito rescue from fridge to microwave for a quick nuke. Just enough to take the chill off. Not only were the flavors heightened, but because of the parchment paper lining there was absolutely soggy surrender. Bite after bite was filled with fish no small feat as the burrito was sizable.    

Bottom line...as this was only takeout for me I can't speak to the restaurant ambiance, but if it is mirrored in any way by this delicious burrito, I'm in!"}
{"text":"Chicken Satay is my favourite and they've been serving these up for years and the quality is consistent and price is very decent. What more can one ask for?  
TIP: The spice level is kicked up a notch. I usually order my food at other places spicy or extra spicy. Here, that's a medium."}
{"text":"Sadly, Yelpers, I was disappointed with New York Subway.
True, like others mentioned, it was frigid in the little shop on late January visit around 1pm. Thanks, though, I never would have noticed if it had I not intentionally made plans to meet my cousin there based on your reviews. Indeed, it was dingy and ugly. And yup, we steered away from the subs and ordered burritos - from a very nice guy at the counter, then a stern man did cook them.

I paid much more than I'd expected, but I assured myself that Yelpers would ensure it would be worth it. As we sat, I anticipated big, honking, deliciousness in a hungry delirium. And then, anticipated some more...

It wasn't busy, but our order took about 25 minutes to prepare. When my cousin went to pick up our order from the counter, I thought she had returned only with hers because when I took a quick glance it looked (I hoped?) that I saw 1 super burrito. It was really 2 skinny side-by-side shlongs.
The shrimp in my jumbo shrimp burrito was cooked well; not too long as to be rubbery at all. But barely pink. Though I was impressed with the quality and quantity of the shrimp itself, it was bland in comparison to the finely chopped iceberg lettuce and mayo mix.  I had ordered medium, I guess by mistake, in this neighbourhood. It tasted like negative medium. 
My cousin said she liked hers. But then again, she only ate half and had been starving.

I might be back, if it were not for the fact that there is no such thing as jumbo chicken or jumbo beef. I thought that maybe I'd just read the menu wrong, or they left out the comma. Had what I ordered actually been called: \"jumbo shrimp, burrito\"? Grammar-schmammer. Time and taste can't make up for a mere pause."}
{"text":"I've passed this place a hundred times and never had any intention of ever eating here.  My Sister said she liked the subs here so I thought why not...I will try it with her.  It's been here forever and must be in business for a reason.  I ordered the lamb satay sub.  You won't be able to find a lamb sub anywhere else as far as I know.  It took awhile but it finally came.  Meat was seasoned nice and tasted good.  The bread was grilled and toppings are typical but I liked the spicy mayo.  I think the meat to bun ratio is off with too much bun and not enough meat.  I think if the bread was more fresh or baked in-house and they had more topping options and gave more meat this place would be a five star.  As-is they are a 3 star in my books."}
{"text":"I found this place on Yelp when looking for cheap delicious eats, and I was not disappointed. This place really delivers. Everything I have ever had has been amazing. The burritos are stuffed. Despite their awesome price, there is probably more meat than you'd find in your average burrito. They also make a mango lassi that's super yummy. The owner (I believe) is super sweet, and makes your food with love and care. It is a hole in the wall, but I find that sometimes they serve the best food. This is for sure the best deal in the area."}
{"text":"So before I say anything else, let it be known that I actually do recommend this place, but one must be able to look over some details in order to enjoy their meal. 

I'd been here years ago, before the \"renovation\" took place - though I can hardly tell what may have been actually updated/renovated in that time. We placed our order - one beef and one chicken burrito, regular size, and a diet coke - and sat down to wait for our food. 

First of all, the washroom is out of order, according to a quickly scrawled hand-written sign. In front of said washroom are two full garbage cans which probably held more garbage than a day's worth, based on the lunch-hour crowd (comprised of about three people). The only thing \"New York\" about this place are some faded framed and mounted NYC images - one or two of the skyline, Statue of Liberty, etc. All of them were peeling off their matting boards, or had frames which looked moments from falling apart. The whole place could also really use a fresh coat of paint. 

There's also a doorway at the back which seems to go into some sort of back-room area in which I think I saw some coolers and a folding table with a coffee machine and cups on it. Not sure what else is going on there. In addition, there are a total of three microwaves in the kitchen counter area, and though there's some sort of 90's CD player/radio set up, there was no music on at the time we were there. The sole cook behind the counter chatted away with a customer wearing an Uber toque in their native tongue. 

The food itself is fantastic. The burrito is certainly not Mexican-style and was comprised of some lettuce, sauce, ground chicken and beef, respectively, and onion all expertly wrapped up in a thin, soft roti. Decently priced and better than lots of quick-serve options in that area. I was also tempted to try out a samosa sitting in the display at the front (maybe that's what the three microwaves are for?) but was ultimately too full to do so. 

I mean, it's fantastic, go ahead and eat here, but know that it is the holiest of hole-in-the-wall places I've seen in Toronto. If that doesn't phase you, you'll have a great time."}
{"text":"left the yelp event and wandered east.. after my coffee craving was fulfilled at Timmys D' and i took a turn into my favorite mexi-indian fusion restaurant.

there is something magical in the almost snail like pace that the non smiling chef behind the counter brings to the food.

my favorite treat here is the mixed vegetable california roll with medium spice... the california roll here is not even related to its sushi counterpart... it is a grilled burrito style roll with Indian spiced roots..

mmm for $4.95 and the option to buy mango nectar its a hidden gem... the grease and old photos of new york with the twin towers add to the charm..

try and get the chef to smile.."}
{"text":"Before all those other fancy burrito places, there was New York Subway. 

When I was first dragged in here to try a potato burrito. I thought my friend was crazy. I soon discovered that potatos in a burrito were the best idea ever.  

It's a must try after an afternoon shopping along the Queen West Strip."}
{"text":"Get the lamb sub!!! It's incredible. Bread is warm and toasty, lamb chunks are tender and juicy, there's potato and vegetables to balance out the meat, and the flavour is amaaaaazing. I got medium spice level and it was perfect. Had just enough of a kick, but didn't burn my throat. 

Also tried the ground beef jumbo burrito...but compared to the lamb sub, it's pretty ordinary. I think if it was the only thing we tried, we would've still been really impressed though.

Guy behind the counter was nice, and food was made to order (it took about 15 mins for our food to be ready cause it was sizzling on the grill. Yum!). Only thing is the atmosphere, which isn't ideal for a sit-down meal, but great for take-out. 

With a name like New York Subs and Burritos, you wouldn't think it'd be Indian/fusian food, but it is, and boy do they do it right!"}
{"text":"I've been coming back for years. Friendly owner that remembers everyone, a unique menu that each item gets the same amount of love on. If you want kabob, come here, if you want a burrito, come here, if you want roti, come here. Mostly though, come for the roti. It's magic wrapped in a dream."}
{"text":"The plan for a group of downtown office servants with an hour to spare for lunch:

-leave work at the most convenient time for lunch, usually involves measuring when the 'lull' is most likely to occur in the day
-make call to NY sub and preorder-A MUST
-collect or confiscate ttc passes for the GO commuters in the group and run to the nearest streetcar stop.
-curse at sky meaninglessly if the car is taking it's time
-arrive at destination, no lineup a sign of good things to come! avert eyes slightly at the dingyness inside but no matter, good cheap food comes in all venues.
-pick up orders and allow 10 minutes to scarf down savoured burritos before eating the rest on the ride back. 

New York subway serves up subs yes but this is a bit of a misnomer because they are most well known for their fusion stylized burritos. You can get satay burritos which are grilled meats on the 'ol faithful grill they have running. They are spiced up, mixed together with lettuce, onions, hot sauce and a creamy mystery white sauce. I've had the lamb satay a few times now and it's really delicious, the meat is charred right and the fact that they grill their creations (like the boyz and the bandidos) after rolling them up is a plus. Burrito business wannabes take note: grilling the final roll is key, the grilling process creates a toasty crust on the outside which helps to make the entire burrito more solid and stable for eating. For the more hungry heffers, the jumbo burritos are monster wraps stuffed with meat and stir fried veggies such as potatoes, onions and a ton of mushrooms. $5.95 for a satay burrito and $7.95 jumbo burrito definitely make New York subway a more tasty and enticing deal than your pedestrian Subway combo.

Tummies happy and tastebuds tingling, our heroes shuttle back to the office to round out the rest of their day.

FIN"}
{"text":"This place is very rough around the edges but the food is freaking amazing. It's owned and operated by a very nice and friendly Indian couple. And it's practically and Indian food restaurant, not Mexican or subs haha. They serve burrito style wraps but the meat inside is cooked and season in an Indian style (with spices and curry flavors). It's something I had never tried before so it was a great experience and I highly recommend trying it out."}
{"text":"I must be missing something.  I have had many people tell me that the \"burritos\" here are top notch, and the reviews on Yelp state the same.
I've now been here twice but the first time I ordered a chicken burrito, didn't think it was that great but I was told afterwards \"You've gotta get the JUMBO burrito man!!!\", my bad.
Okay, so I go here again and get \"the Jumbo burrito\", hot of course.  This isn't a mexican style burrito at all.  It's more of a chicken dinner wrapped in a tortilla. I am writing this sweating more than I do at Moksha Yoga as it had some kick.  It was good, just not the style of burrito that I had expected.
I know I can't be the first guy to ask that no mushrooms touch my burrito, and sure enough I get home and this freakin' thing is full of the dirty fungus.
I think they've painted the place and did the yearly cleaning as it was better than the first time I went but I didn't see a \"PASS\" on the windows anywhere.
Staff was very friendly (except for the sneak attack on my burrito with mushrooms).
This would probably make a great \"drunk dining\" place except my A.D.D. would kick in while waiting the 20 minutes for my food.
Back to Burrito Boyz/Banditios for this guy."}
{"text":"When this place closed for a year - I was really SAD.
I couldnt believe how much I missed this place.
I always order the same thing (potato/veg) roti and I always inhale it.
Its such comfort food.
This hole-in-the-wall is truly one of my fav places to eat in the city."}
{"text":"Really delicious! Wasn't expecting much, we initially only came in bc it was one of few places open, but it was really really good. Bathrooms were whatever, but available."}
{"text":"From the outside New York Subway looks like a dingy old subway shop. Don't be fooled my friends, NY subway is like the inside of an oreo cookie - delish! 

Each sub is made to order on a grill - oh yeah hot and fresh. You can specify spiciness to your liking. Most burritos (technically that's what they are. I'm all about the technical correctness.. muhahah) come in two sizes, regular or large.  The burritos start off with a tortilla shell, and then the filling is put in.  Next they are grilled so the outside shell is toasty and the filling is nice and warm. There are a lot of selections for vegetarians. One of my favorites being the mushroom burrito (this one only comes in the large size, don't ask why. $6.95). Another good choice is the mixed veggies. 

A great little shop. Staff are extremely friendly.  Can get busy at certain times, considering subs take probably around 5 minutes to make start to finish. But well worth the wait...."}
{"text":"This was a great local spot. The food was great. I got the chicken and beef burritos. Everything is made fresh to order."}
{"text":"On a spontaneous whim - we were on Queen Street West and chanced upon New York Subway. From the outside - it looks like a plain sandwich shop. No glitz. No glam. No wow. 

Choices: Burritos, Subs, or omlettes?

We ordered \"burritos\". I like to go for the \"unusual\" or \"unique\" (whichever suits your fancy) and went for something I'd never heard of; \"the \"Spinach Burrito\" (small), while Mark opted for the Chicken Burrito (large). All items on the \"small\" menu are under $5!!! What a steal! The large items are anywhere from $7-$9 and comes with onions, mushroom, and tomatoes. 

Who doesn't love surprises? Especially delicious ones! Expecting my \"burrito\" to come as a mush of spinach in a wrap - I discovered a bite of Indian-Mexican heaven at every bite! The \"burrito\" tasted more like a thin toasted soft crepe, stuffed with soft creamy potatoes and loaded with savoury spinach and crispy lettuce, with a subtle touch of their in-house cream sauce! The combination was a simple satisfying creamy meal that completely hit the spot! I was stuffed for hours! (And THAT is unusual!)

NOTE: Not your typical burrito!

TIP: If you are in a rush - do not take your chances here! There is even a FRAMED SIGN stating that the \"order completion time\" is approx. 15 minutes (per person).  It is a one-man show here! There was only 1 cook in sight, who also runs the cash, takeout orders, and drinks. We only had 1 person in front of us and no one waiting, and it took 25 minutes after we ordered. 

Overall - the meal was delicious, filling, unique, and the chef/cashier/host, although unfriendly at first glance, turned out to be quite a nice guy.

I am coming back to taste their other goods!"}
{"text":"Walked into this placed based completely on the other Yelp reviews and it's confirmed, this place is a gem! I tried out the butter chicken roll and was quite satisfied...cheap and tasty!

As a word of caution though, the butter chicken roll does not contain any solid pieces of chicken...its some kind of paste and sauce together...I know this doesn't sound appetizing, but it's quite good!"}
{"text":"Never would of thought passing this place for years that New York Subway would of  been worth a visit. The place looks like a crappy dive inside and out. But I was so wrong. 

I had the large lamb burrito and it was fantastic. Possibly the best burrito I've ever had. Tons of fillings, great sauce and the lamb was great.

The only issue I had was it can be a little pricey. My large burrito was $10.00"}
{"text":"mmmm .. this is one grungy, dirty, filthy little place . i love hole in the wall restaurants but i wouldnt have dared to step into this place if it weren't for its exquisite reviews . this place takes hole in the wall to a whole new level . both the dirtiness & the yummyness wise .

i love mine half beef, half cauliflower, hot . its one of my most favorite things to eat in toronto . i felt pretty intimidated by the cook behind the counter, but once i read that hes like a soup nazi from seinfeld, i warmed up a little and surprisingly he did the same . or so i think . but i swear i think i saw him smile .

yea, this place looks pretty sketchy, but don't be a princess and give it a chance ! GO WITH AN OPEN MIND ! get the burrito ! half beef, half cauliflower ! YUM . oh ! but make sure you take it to go !"}
{"text":"I absolutely love the food at this place. It's so cheap but so fresh and the guys there are really nice. I work just around the corner and love getting the butter chicken roti for lunch."}
{"text":"Yup! What else can they call them but Burrito's, but not at all Mexican... the flavours are more Indian, like a Sri Lankan Dosa.

But what a lovely fresh feast for six bucks. Had the mixed veg. The mild was too spicy for my wife, but the spicy was perfect for me!"}
{"text":"I don't think I have much to add. It's small and you'd probably pass this place a billion times and not notice unless you were a careful student of Yelp. You'd probably also assume it specialized in subs. But inexpensive, no nonsense burritos are its forte. I had one chicken and one beef burrito (medium spicy... you get to pick). Each was under $4. The chicken I favor over the beef. They use ground beef vs pulled. But all 'n ' all both were a nice size for a nice price. My only gripe was it was -14c the day I went and the place did not appear to have any heat on. Maybe their grill was the establishment's only source of heat. It was damn cold. But you can't beat the price."}
{"text":"My ex-girlfriend introduced me to this place... Don't let the run-down appearance fool you because all the stories you've heard about how great this joint is are true. Also, don't be fooled about the \"Subway\" in the name because this is a burrito spot -- even though they are the size of subway sandwiches.

The one fellow who works there draws comparisons to the Soup Nazi because he's no nonsense and I've heard can be difficult with certain people, but he's actually a great guy and will treat you well if you return the favour. I recommend any of the jumbo burritos, especially the spinach one. Be prepared to wait a good 10-15 minutes or even more when the place is busy, but it takes time to create such delicious food. Those burritos are out of this world."}
{"text":"It's a burrito?
Nope.
It's a satay?
Nope.
And it's NOT a SUB! 

Then what the heck is it?!
Who the hell knows, but it sure does taste good!

Ordering goes something like this;
Steak, not hot. 

The 'burrito' comes in a massive wrap, and while it's make like a burrito, and comes with meat, lettuce and a gritty white tomato, the white sauce/dressing will throw you for a loop, but you'll enjoy it. Trust me. Just take a bite. And don't think about the cleanliness of the guy who made it. (or the fact that he just handled money, rubbed his hand on his dirty apron, and then rolled your 'burrito') 

Yeah, that's it.  
Then you wait for a long time. 15 minutes. *It will feel like a million, depending on how much you've had to drink. 

While you watch the guy (it's been the same dude for as long as I've lived in Toronto - 7+ years) cook, take orders, handle money, then go back doing what he does. 
It's not sanitary. His food handling situation is frightening, But I've never gotten sick, so who cares! To hell with Toronto Dine Safe! 
Like I said, these are worth the risk.

But listen, it's not a FREAKIN' BURRITO so stop calling it one."}
{"text":"I used to really like this place and went in on Friday's for many weeks.

Then I got FOOD POISONING from a rancid ras malai.

The moment I put it in my mouth I realized it was off.  I spit it out immediately.
Instead of a sweet milk it was a sour bread-like foam -- sort of like vinegar cheese.
I was heaving and spitting out food into their garbage bin for several minutes.

The guy at the counter made me pay for the rest of the food, which I could not eat.
IMO he should not have charged me anything for making me suffer so much.

When I got home my stomach was very upset, with mild food poisoning and I was commission for the day.

I won't go back.

Also, during the winter they don't seem to turn on the heat."}
{"text":"Definitely not the cleanest place in the city, but the burritos make up for it!  I've had the chicken burrito a number of times, and recently tried the mixed vegetable burrito.  Both are AWESOME.  I can't even describe the flavour, beyond the fact that it's some sort of Indian/Mexican fusion (more Indian than Mexican), and it's just awesome.  The guy who works the cash and the grill (at least on Saturdays, when my husband and I tend to go) is very nice.

I ALWAYS leave this place wanting more."}
{"text":"I have finally found a burrito place in Toronto to rival my love of Chipotle!

Cheap and tasty, what more could you want.  For a $6 burrito, it doesn't get better.  I had the beef satay burrito which comes with grilled beef chunks, lettuce, tomato, onion, hot sauce, and mystery burrito sauce.  Yum yum!

This place is a little more pleasant now too (on the inside).  It looks as though they've recently painted the walls and ceiling.  The fan on the ceiling is no longer a shade of grease but a pale blue shade.

Cash only!"}
{"text":"I used to frequent this place frequently years back.  The (now previous) owner was always super grumpy but the food was pretty tasty - not many vegetables on the Satay versions though, just lettuce and tomato.

Went in tonight to see it's under new ownership.  Big emphasis on adding Indian Roti food to the menu.  I wonder how they can afford to offer so many variations of food now... I think the quality will have to suffer in time.

Ordered the Satay Chicken Burrito.  It kind of tasted similar to what the old grumpy previous owner dude used to make, but this time they loaded it with way too much of the sauce (not hot sauce, don't like that, the regular stuff).  It made the burrito somewhat uneatable at the bottom.  Actually, I think the sauce on the burritos that is quite good is something like island dressing - may be it was all along?

The lettuce has changed too. Instead of shredded, now it's big chunks or romaine lettuce.

It's ok... but probably not going to be like before."}
{"text":"I don't know what people are raving about. I'm from NYC and while Mexican food isn't our claim to fame, we can still get much better burritos than this. I'm not even sure what's served qualifies as a burrito. 

I had the lamb satay burrito and my wife had the ground beef burrito. Neither had rice, beans, sour cream, guacamole, cheese, salsa fresca or salsa verde. It's also open on one end so basically what's called a burrito is more like a gyro using a tortilla instead of a pita.

Should I hold any of that total un-burrito like stuff against them? I'm willing to overlook all that if it tastes amazing. Neither did. The taste was basically average. Inoffensive is the best way to describe the flavor. Like I said, I have no idea what people are raving about. This is basically a 3 star quick wrap place, but a 1 star burrito place so I split the difference."}
{"text":"I had heard so many good things about this place over the years but by the time I finally got around to trying them they had shut down. Fortunately it was just for a short renovation and they are back open again. I went today with a fellow foodie that is a huge fan of this place. I tried the lamb satay jumbo burrito as this was reccomended by the lady at the cash.

The burrito: Well it's a little different from most burritos as they don't use beans and rice and I would compare it more to a jumbo fajita. At $6.45 it was great value and very filling. The taste of the lamb was really good though I think they could add some more spice to it and overdue it a bit with what tastes like thousand islands dressing. My burrito w/ 2 drinks (mango nectar and bottle of water) came to $10.44 which is quite good for the area. Most places it is hard to find lunch for under $15 nearby.

Conclusion: I would definitely return as the food was very good for the price I paid. I would give them a 7.5/10 for this experience."}
{"text":"Unlike it's neighbors on Queen Street West where you pay more for the ambiance than their food,   New York Subs & Burritos is a modest eatery with amazing food. I haven't
tried their pretty new Indian additions yet but their chicken and lamb burritos are totally yummy! This evening when I was there for dinner, the cook, who says is a family business, even bothered to find out from me if the level of spiciness in my lamb burrito was okay. and if my meal was alright. Will highly recommend this place to anyone who is looking for a budget, satisfying  meal!"}
{"text":"I've often wondered how this filthy little place on Queen St. Kept in business when each restaurant around it was trying to out-sleek the other.  The answer I came up with when I finally did try the fares of this sandwich/burrito shop was simple, it doesn't have to, it's just plain good.

Being a fake-atarian I didn't know what to choose so the proprietor was rather stern in telling me I should have the spinach wrap - \"try spinach, spinach is good...you want spicy?\".  When a man who has been standing in front of a grill for 30 years asks you if you want spicy, you say yes.  

Let me tall you, when the man finally handed me my giant burrito stuffed with cooked spinach (which tasted  a lot like Palak Paneer - one of my favorite Indian dishes), potato, some kind of delectable sauce, but no cheese - apparently you have to be there early for that, I was happy, very happy.   In other words, don't let its dirty façade fool you this place is top notch."}
{"text":"If you've not tried this place make it a priority to do so!  Our favourites are the beef burrito and butter chicken roti.  This beef burrito is unlike any burrito you'll ever have- it's where Mexico and Indian meet."}
{"text":"9/5 stars this is not a pretty place, its about amazing food and great value
highly highly recommend
get the jumbo beef burrito it will put a huge smile on your face"}
{"text":"Got the Jumbo Burrito with chicken, it cost $7.85.

The chicken was ground and not strips.  The burrito was pretty large, and enjoyable.  I got mild but noticed there was a bit of spice.  

It took about 10 minutes for it to be make (everything was made from scratch).

Locale: Very basic, would not recommend to use it as a place to meet, but good enough to finish the meal there."}
{"text":"The ultimate hole in the wall discovery- which I discovered back in 2005. Their wraps have to be seen and eaten as they're hard to describe. Not quite a burrito, not an east Indian wrap roti or a Trinidadian style roti either. They're...well they're grilled wraps, in a sort of tortilla or better is the style of thin pide you get with a Durum Doner in a kebab spot in Germany, but the fillings are all kinda sorta Indian... with French salad dressing- see I said they were difficult to describe, Suffice to say cheap, massive, and absolutely delicious."}
{"text":"Been coming here for over 10 years.   I now live 45 km north of the city but always try and come back when dt.  Love this place!"}
{"text":"A group of friends and I stumbled across this place after having some coffee elsewhere, and we were surprised to see a number of rather interesting mixed choices on the menu.This is a fusion place that uses mainly tex mex or Indian spice blends and fillings in burrito's. The also offer a variety of appetizers like samosa's, lassi and traditional sweets.

From what I've been told, the venue is much nicer than years past and though there have been some upgrades, I would definitely like to see more seating. A party of 3-5 people in many cases wont be able to dine-in. Prices are comparable with Chipotle, but this place is definitely one of a kind without any of the frills that come with being a chain.

Recommendations:

- Large Veggie Burrito
- Mango Lassi"}
{"text":"Good food, decent prices. I'm definitely a fan. Prefer this place to Gandhi's down the street based on taste and value.

Things to note:
Lots of veg options (you can do a combo too if you want like cauliflower & bean)
They take debit/credit.
I've never waited more than 10minutes (I go at lunch time though)
Yes it is a dive and the tables are sticky.

Mmm delicious!!"}
{"text":"I got the jumbo beef burrito. The menu is a bit confusing. There is a burrito, jumbo burrito, satay burrito, jumbo grilled burrito and subs. I ordered the jumbo beef as per yelp recs. It came to $9 flat. 

The beef is ground beef. Taste was nothing special. It was all ground beef, Mayo and lettuce. No tomatoes. 
I feel like I ordered the wrong thing. Next time I'll get a roti or lamb sub."}
{"text":"I have always passed by this place and thought nothing of it but my boyfriend insisted that we go there.

This is one of the best wraps I have ever had in my life, I think! The staff is really friendly and the portions are huge and affordable. The Potato/spinach and the ground chicken wraps are out of this world. I haven't tried the whole menu there but it looks amazing. The Mango lassi was also very good.

Its not the prettiest place, and there are a lot of other options in the area but the food is worth it!"}
{"text":"Been coming here for years.

Always the same steak burrito, it's quite different than many mexican style burritos all over the city, there is potatoes and other things in it and the steak is pan-friend.

Anyways, really tasty food.  Service isn't quick, it's one guy working there and it usually takes at least 15 minutes for each burrito.  

Point taken off for the sometimes loud Top 40 radio playing in there, know your clientele dude, nobody wants to hear Adele and Katy Perry loudly while waiting 15 minutes for a burrito."}
{"text":"Not a fan - a little too dingy for me and I really don't mind dingy places.  But the dinginess seemed to have crept into the way they prepare the food and that is just a turn off for me.  I had the chicken burrito and can think of 5 places that I would rather have a burrito at.  Given all the positive reviews on this place, I feel like I am missing something but I don't plan on going back.  Quite forgettable."}
{"text":"This place has been kicking it forever! It stands the test of time in a neighborhood quickly changing to a cleaner, pricier Queen St. West. I used to eat here regularly before moving away. Their grilled meat subs are awesome and dudes are super nice. Omnomnom!"}
