{"text":"Amazing food! Best service anywhere! My girlfriend and I went there for lunch and lost track of time chatting and they never rushed us!  They really know how to run a restaurant."}
{"text":"My sister and I came here for dinner and had an amazing experience! The staff was very friendly and we thoroughly enjoyed their company. The food was better then expected! Excellent size portions and the prices were affordable. We both ordered the steak and frites, and to start we had the escargot. We will defiantly be coming back! Thank you Nice Bistro!"}
{"text":"This place is fabulous. Came here for a graduation dinner with my parents. When I ordered a vegetarian dish, the waitress/owner asked if I was in fact vegetarian, and when I said I was, she offered a dish that is not always on the menu - a squash ravioli that is a favourite of the chef. When I asked about other vegetables, she offered to ask the chef to throw in some with the recipe, and I was served a dish of tasty ravioli, piled with fresh, hearty veggies. The chef also came out during the meal, and checked in with every table. The owner was cheerful and chatty, and great with the young kids that were at the next table. We each had a dessert - I had a bit of ice cream with pear and chocolate sauce - apologies for forgetting the French name for it - it was absolutely divine. The portions of both the meals and the desserts are just the right size as well. I'll be coming back here as soon as I can."}
{"text":"- Food was great  - Very cozy environment - Loved the authentic French feel - Server was very cheerful and helpful - Chef was committed to his customers, saw him come out every now and then to check up  on everything"}
{"text":"This is one of our favourite restaurants here in Durham Region.  A family owned and run business serving French cuisine where the chef/husband comes out of the kitchen and the wife waits the tables with a smile.  One of my favorite things is the non-alcoholic Apple cider they import.  The food is yummy, reasonably priced and the whole ambience is relaxing and friendly.  Haven't been disappointed yet."}
{"text":"This place is hidden away in Whitby, but boy does it deliver.  Legit French cuisine and a mom and pop environment.  I came here two nights in a row it was so good!  The owners really pay special attention to you and make you feel welcome.  It was a slow night one night and they let me have the special of the night (pork tenderloin) as part of the prix fixe even thought it was not.  Great little gem."}
{"text":"It was a great set of appetizers and a cheese tray followed by a meal that tasted like the chefs had a long day good but not as good as the apps. Based on everything else we tried we will dine here again. Our hostess was amazing and made us feel like family. After dining in France, Quebec and old Quebec this is a perfect melding of food meets atmosphere."}
{"text":"My daughter really wanted to try this place, as her french teacher mentioned it to her class. I took three kids for lunch and everyone loved it! The food was fantastic and the service was fantastic. The lady was very encouraging of the kids trying their french and she would speak both french and English to help them out."}
{"text":"Taking 3 children out for fine dining can be a little daunting.  Our kids are well behaved, but still, you get an unwelcome feeling often, even when you just walk in.  Not so at Nice Bistro...from the moment you walk through the door you are greeted so warmly, you feel like family.  The hostess / owner is wonderful, speaking to everyone in her mother tongue, but making sure the young ones understand.  Chef coming to chat and welcome you also.  Then the deliciousness begins.  It's not often we go out that every dish is fabulous, but that was the case.  Blackboard special jambalaya, steak frite cooked to delicious perfection, the bouillabaisse was amazing, and they even made a special omelette for one of our children who couldn't decide between the menu choices. My only wish was that I had more room for more! We managed to squeeze in some shared desserts....a delicious crepe, and possibly the best bread pudding I have ever eaten.  Our first trip here in 9 years, and we can't fathom why we waited so long.  It will definitely be a more regular feature for us."}
{"text":"t was Mother's Day and I took my father and grandmother to dinner. Nice Bistro is a French restaurant that's been around over for 20 years. It's family owned and everyone that works there speak French. Neat! They have the regular dinner menu and a $30 prix fixe menu with the daily specials. Bonus: Nice Bistro sources locally.  My father and I went with the prix fixe and my Nan had one of the specials. The starter we chose was the Zucchini and Carrot Soup. It was dairy-free and vegan friendly. I was worried that the soup would be too sweet because of the carrot, but it was well balanced and creamy. It was seasoned with black pepper and parsley and not a lump in sight. Nan stole a few bites of mine, so I wouldn't be surprised if I come over for her play on this dish!  Now for the mains. We all had specials: I had the Salmon, my dad had the Lamb and Nan had the Beef Bourguignon(do not ask me to pronounce it, please). The Beef Bourguignon is a pasta dish topped with stewed beef and veggies cooked in red wine. It was a large portion and you could really taste the red wine flavours in the beef. Nan enjoyed it. Dad's lamb was a sizeable portion. He was told he got the last serving and it was a good one. Tender, juicy and full of flavour, he didn't leave a morsel on his plate. My salmon was seasoned with a rub rather than a sauce; I've never had it this way! It was flaky and moist and the rub had a some heat to it; reminded me of a steak rub. The portion was small, but the spices packed a punch. The lamb and salmon were both accompanied with roasted veggies. So good!  For dessert, my dad chose the Tarte Tatin and I chose the Poached Pear. The Tarte Tatin was a fresh apple tart, very similar to apple pie, but compact and not too sweet. The apples were crisp and the pastry was great. The Poached Pear wasn't what I expected. I expected it to be very sweet and syrupy, instead it was beautifully displayed sliced in a martini glass with whipped cream, dark chocolate sauce and some the pear syrup. The dark chocolate and whipped cream cut through the sweetness in the syrup allowing the flavours of the wine the pears were poached in to come through.  The service was phenomenal. All of the staff are delightful and Chef Bernard stopped at every table to make sure everyone was enjoying the food."}
{"text":"Finding the restaurant was a bit of a challenge as the streets are pretty confusing in the 'burbs.  Between the one-way streets, division of streets by South or North... I didn't successfully navigate and find the restaurant on the first try.  So to save all of you some time, look for Wimpy's Diner, Nice Bistro is right next to it.  As it was a Tuesday night, there was ample street parking (free after 6PM).  If one had not actually known about Nice Bistro it is one of those restaurants that could easily be overlooked - after my dining experience, I'd like to call it more a \"Diamond in the rough.\"  Nice Bistro is truly a hidden gem.If you overlook the scenery that consists of local traffic through the window, you would believe that you were in the south of France.  The restaurant is run by a husband-wife duo.  Hubby (Bernard) slaves away in the back of the kitchen cooking up authentic French fare, while Wifey  (Manon) mans the front.  Once we had settled down and started perusing the menu, I overheard chatter from another 2 tables... and they were Francophones!  This was a good indication that the food was probably going to be as authentic as it gets.  Yay!  We ordered the Assiette de charcuterie, Salade César and the Pâté Cognac Maison to start.  Shortly after ordering we were brought a bread basket.  I am a bread lover, and so that bread basket didn't last very long, and a second was brought out for us to accompany the charcuterie.The Assiette de charcuterie came with: Hungarian and Italian Salami, Portuguese and Polish sausage, German ham and head cheese.  Head Cheese is a terrine, or meat jelly that is made of meat from the head of a pic and is often set in aspic (e.g. a gelatinous mixture of meat formed with a consommé of sorts). The Pâté Cognac Maison was served with an apple jelly and a mini-salad and a balsamic reduction.  Their pâté is not the traditional smooth, spreadable kind.  It is actually quite \"chunky.\"  It was simply prepared but you could taste the cognac and subtle hints of peppercorn.  The Salade César was punching a lot of garlic.  It was creamy, but the texture of the dressing was less viscous due to the generous use of anchovies in the salad dressing.   We ordered the following mains: Salmon Fillet, Steak Frites and Moules Frites. It should be noted that on Tuesdays, you can get a bottomless pit of mussels and fries as it is all-you-can-eat.  The Salmon Fillet was one of the night's specials and is cooked in its own natural oils and seasoned with Chef Bernard's spice mix.  It was served with seasonable vegetables which consisted of eggplant, red pepper and zucchini.  The vegetables themselves had a hint of sweetness to it.  The salmon was cooked to perfection; it was perfectly moist and tender and flaked off the fork with ease.    Doctor-to-be ordered the Steak Frites rare.  When the steak came, unfortunately it was cooked a little more than rare.  Manon recognized this immediately and offered to cook up a new one, but Doctor-to-be decided to just stick with it.  We were quite pleased with the initiative that was taken to ensure that we would get exactly what we ordered.  Ms. B ordered the Moules Frites which came in a giant mini-cauldron and a bowl of fries.  I thought that they were quite flavourful, but she did comment that she could not taste the wine.  When I tasted their fries I thought I had died and gone to heaven.  I was trying to figure out what the secret was.  Apparently, fresh potatoes was it. These are hands down, the best French Fries I have ever tasted.To finish we ordered the Gâteau Crêpes et Chocolat and the Nougatine Glacé. I personally preferred the nougatine as I love almonds, and it was bursting in almond goodness.  The chocolate crêpe cake was very moist and yummy as well.  It was Doctor-to-be's belated birthday as well, and it was nice of them to put a candle on his dessert and sang a little birthday song in French.  Even nicer, was when they comped his dessert.  They are such sweethearts!  We had coffee, cappuccino and an espresso to accompany dessert.  Verdict:  Nice Bistro has become one of my favourite dining experiences.  Both the food and service was provided with tender loving care.  For a 3-course meal, with a half-litre of white wine, 3 glasses of red wine, and dessert beverages, our bill came to about $60 per person.  I challenge anyone to find food of such high quality, and service that comes from the heart that would rival that found at Nice Bistro."}
{"text":"Last night was my first visit.  An extremely friendly, family run restaurant that is very diligent about service.  The father / chef came into the dining area quite often to check on all his guests.  It is obvious that this restaurant has a regular following, as he knew several tables.    Note: you can bring your own bottle of wine and just be charged a corking fee.   The food was very good, made from scratch.   Grilled apple salad with feta was excellent.  Will have to remember this for home.  Mussels in white wine sauce was perfect.  And dessert was amazing.  Maple syrup pie.    Finished off with a decaf espresso Americano.    Lovely evening.  Thank you."}
{"text":"I was in Whitby for work and decided to explore the downtown area for dinner. I happened to see this beautiful French bistro, and its charm drew me inside. I was the only guest on this cold week night, but I instantly felt as if I had entered a family home. The owners, originally from Montreal, all were lovely and gracious hosts, and the mother /wife was so wonderful and welcoming as well as passionate about the menu. Her husband made everything from scratch in the kitchen, while her son helped in the dining room. Over and over, she smiled and said \"merci' and broke her fine English with some beautiful French.  The food was outstanding. The French onion soup was extraordinary, and I loved the broiled salmon and veggies, marinated or sauteed in a light maple syrup glaze. The steak and frites, made either with hanger steak or sirloin, called my name, but I decided to be healthy instead.  What a beautiful place and good people. You gotta go."}
{"text":"Delicious, affordable French food. Friendly service. A good spot to eat in Whitby."}
{"text":"Great food. Great atmosphere. Great hosts. Wish the wine selection was a bit deeper, but other than that it's excellent."}
{"text":"We went to Nice Bistro for dinner. My GF had mussels in white wine, a Spinach salad  w cherry tomatoes, Boconcino and a Miso dressing. For her main, the daily catch was a fish trio; Salmon, Mahi Mahi, and Pickerel. She loved the Mussels and fish trio, but felt the Miso dressing was a bit too strong.  I had the escargot, house salad, and daily pasta special; chorizo provencale on spaghettini. The escargot were served piping hit, delicious and garlicky, perfect to my unsophisticated taste buds.  I've been enjoying Bernard's house salad for almost twenty years now, I love the vinegary dressing (unlike someone I know). My pasta dish was very nicely done; the veggies slightly caramelized but not overcooked. The Chorizo was good too. We decided to forego desert, but Manon packed up a sliver of the Tarte Citron to taste at home. Just like in southern France it was tart and citrony, a great way to finish up a great evening."}
