{"text":"Not very good food at all. Just spent $35 on takeout and it's all in the garbage. I'm pretty sure the chicken was bad."}
{"text":"Woohoo! As good as it gets! It's a very good restaurant that you should try it out!!!"}
{"text":"I was hoping a good shawarma place would open in the area. And it has happened with Nick's!

I got a chicken shawarma pita for lunch. It worried me a little that the chicken wasn't being sliced off the spit but came from a little package and cooked on the flat grill. It smelled great though. 

They have all the classic ingredients as I know them for the sandwich - hummus, lettuce, tomatoes, pickled turnips, parsley, garlic sauce and hot sauce. 

Although the pita was smaller than other places, it was packed full of taste! The chicken was super tasty. It was delicious from beginning to end. I would definitely come here every time I have a hankering for shawarma."}
{"text":"Nothing famous or good about this place.  Much better shawarma in Aurora.  Very disappointed with the food, it was cold tasteless and obviously not fresh."}
{"text":"My husband and I love to go here whenever we find ourselves without kids. We love the shawarma platter. The owners are so friendly and they remember us.
Our kids have figured out that it is a great place also. Love the garlic sauce and the hummus. Yum.
The sandwiches are good also and fresh. The chicken is grilled in front of you so it is definitely hot. Love this place."}
{"text":"Used to frequent this place for lunch a few years ago.. LOVE LOVE LOVE the chicken shawarma. The garlic sauce is awesome. I went so often the owner knew my order. She's very welcoming and very sweet, as is her husband (Other owner? May  or may not be her hubby)

Check it out!"}
{"text":"I pop by here every now and then for a lunch time bite close to work.  The owners are great people and are very friendly.  The food is always fresh and made-to-order.  The prices are fair and the yummy food comes quickly.  What more can I ask for?!"}
{"text":"Ever since the place changed ownership to a guy named Mike the quality and quantity has both hugely improved.  Food now comes out hot and fresh,  portions are good and justifies the higher price.  Is it the best shawarma you'll ever have? Probably not.  Is it worth the price and will it give you as  good time? Absolutely"}
{"text":"This place has been here for a while. It's a gem! 
I always get take out.

The chicken shawarma platter is about $17. It comes with a salad of your choice, two potatoes, chicken shawarma on a bed of rice, hummus and one pita cut into four slices! 

Their sauces are pretty great, and don't forget to ask for hot sauce."}
{"text":"This is one the best Shawarma places I have eaten at! 
I probably have this about 2 or 3 times a week and never disappointed! 
The service is great and very friendly environment."}
{"text":"Meh. Thought we would try out Nick's because it's the closest shawarma place to our house. Unfortunately we were pretty disappointed. We had the beef shawarma and the meat was super tough and barely seasoned. Portion size was ok. Garlic sauce was yummy and super garlicky though! Yum! All in all, 3 stars and we'll make the drive to at a better shawarma spot that's only a bit farther away."}
{"text":"Located not too far from my work, I tried this place a few weeks ago as I was tired of the usual stuff around the area and wanted something new.  

Located in a strip mall (beside the Second Cup) this is a great place for dine in/take out.  It's clean and there are enough tables to have a large family eat in.   It's not fancy, but it's clean and not run down.

I ordered the chicken Shawarma platter - the chicken is grilled in front of you so you know it's fresh.  The meat is so juicy and flavourful.  It's definitely one of the better chicken shawarma's I've had in recent memory.  The rice and potatoes (my choices) were cooked to perfection and were tasty.  The portions are pretty decent and the prices are a bit high but the quality, taste and friendly service makes up for it."}
{"text":"I had a delicious Chicken Shawarma platter when i passed by the other day.  Staff was friendly, food was fresh.  Pricing is a bit high, but quality is good.

Will visit again and try other dishes!"}
{"text":"Nicks makes good lamb kebabs, I need to go back to try more things off their menu.  The place is quiet, clean, loads of parking.  They have sumac in the onions.. and make a tight wrap that holds its shape as you eat it.  

The staff are super friendly and helpful."}
{"text":"I come to Nicks famous shawarma sporadically when I'm working in the area. Over the years I've probably been here 15 times. Every time I come it's the same. In a good way. The owners are very nice and they always remember my order. They put together a great meal for a great price and I'm always happy how it tastes. I have had shawarma in many places, and only one shawarma beats it (GAD in Cairo, Egypt.)

The owners are extremely friendly and the food is inexpensive, but great. What more could you ask for. Stop in and try the Chicken Shawarma."}
{"text":"We loved this restaurant until we found the manager clipping his fingernails in the kitchen. The restaurant was as busy as we had ever seen it and he still decided to clip his fingernails right there in the open by the hot tables. We won't be eating there again. Disgusting."}
