{"text":"The expression 'a diamond in the rough' was made to describe Nico's. At the outset, Nico's looks like a garage to fix cars in because of the large painted sign outside. However, inside there is a full bar with a restaurant and tables. The food is pretty good bar food and it's a karaoke hot-spot on Saturday nights. The karaoke crowd is pretty diverse and if you are really lucky you may catch Abba singing the Dawson's Creek theme song. Waitstaff is nice as well. 5 stars for the recovery room."}
{"text":"I loooove Nico's.  The people who work here are great and surprisingly welcoming to everyone, there's always a nice mix of locals and young people, the beer is cheap, and, okay, the wood walls are kinda awesome.  It's a great place to grab a few drinks with a pal and hunker down in a booth for a low-key evening."}
{"text":"My favorite corner bar. Locals, televisions, cheap drinks, the BEST karaoke in the city. There is very little this bar doesn't have.   Could use a pool table. Not sure where they would put it, but that would make me much more of a regular than I already am.   Outside of that, the drinks are cheap, owners and workers are a hoot, locals are always entertaining. And that karaoke... Seriously, come out on a Saturday night and see it for yourself!"}
{"text":"This will be simple... The karaoke had a very limited selection.  The DJ kept fiddling with the volume while you were singing.  Was way over-crowded with wanna-be hipsters who were attempting to be ironic which just made them look pathetic, especially since they kept taking pictures to most likely show Facebook people how much fun they were having and how great they are. There was only one server for a bar packed with people and was hard to get a drink.  Won't be going back."}
{"text":"The DJ there this past Saturday let one group have every song. Told our group there wasn't any room left in the list, then he himself sang 2 songs. Afterward I read a popular Pittsburgh blog claiming  they were one of the best karaoke bars in Pittsburgh. Not so much. Unless they get a new DJ."}
{"text":"Bar none the best karoake in Pittsburgh (Saturday nights). This is one cool dive bar, which in one room has a full 360 bar and the other room a bunch of tables and booths for sittin' and singin'! I've been here more than a dozen times and have always had a blast. I know it's not everybody's cup of tea, but there is no funner night that grabbing some pitchers with a group of friends and making a fool out of yourself behind a mic. And this is the perfect place for it. By no means is this a place for upscale cocktails with the coworkers: we're talkin cheap beer, (really!) smokey, loud, and just a damn good time! One the many reasons I was excited to move to Friendship Park was to be within stumbling distance of Nico's. Whether it is after work or a late night hangout with peeps, this has become my neighborhood dive bar and it perfectly encapsulates the spirit of Pittsburgh."}
{"text":"Reasonably dope spot p. chill most times. Can't turn up  here but can chill p hard. Classic. Food is p. dank and drinks are cheap but all around vibe isn't max dope but kinda dope. True head spot v. Pittsburgh. If you're looking for Pittsburgh (and not LITSBURGH) look here .   I attribute my success to this: I never gave or took any excuse. -Florence Nightingale"}
{"text":"This was my favorite spot to grab wings. Monday night was wing night and you could find us there at some point in the evening.  There are multiple sauces to choose from but celery and ranch are definitely extra. The bar tender usually doubled as the server which made for a looooong wait between refills and extra napkins.  The crowd is neither friendly nor non friendly. Servers were just about the same. If it was a busy night, they never picked up the pace to match. All in all, good food and alright service.  They have karaoke Saturday nights if you're into that sort of thing."}
{"text":"We used to go here a lot when I was younger, in the late 80's and early 90's. Nostalgically tried to go here today, Saturday, but the kitchen was closed when we got there, around 1:30 pm. We live an hour away. Just be sure the kitchen is open before you go."}
{"text":"I'm not going to lie - if a friend hadn't suggested this place for dinner and drinks, I never ever would have walked in. It's really easy to brush it off if you're walking by; from the outside it looks like a pretty standard bar. And when you walk in, it smells like a pretty typical bar - meaning that if this place ever closed, the next owner would have to rebuild the entire place to get the cigarette stench out. So yeah, I admit that my first impression was not a good one, and I actually thought to myself that if any more people showed up and started smoking I'd have to ask my friend to pick somewhere else for us to eat and talk.  Fortunately, between it being a Thursday, the snow and the bitter cold temperatures, very few people showed up and the majority of the smokers stuck to the main bar area. So I picked a booth in the far corner of the seating room and met up with my friend; while I waited for them I took a peak at the menu - nothing super spectacular, but the prices were pretty cheap overall. So hey, at we know this bar has cheap sandwiches and cheap burgers.  Once my friend arrived we both ordered some drinks, because of course you drink when you're in a place like Nico's. The beer and cider we ordered came in a glass and the original bottle respectively, and our water came out in plastic cups (something I'm admittedly not a big fan of - it's such a wasteful practice). We then split the fried zucchini and the recovery room pizza. The fried zucchini basket had four or five enormous stripes of zucchini and came with marinara sauce - it was quite tasty, although the sauce was pretty cold. Maybe it's just me, but I'd rather have warm marinara sauce than cold. The pizza, on the other hand, was absolutely delicious. The recovery room special is a specialty; it has gyro meat, feta cheese on top on regular cheese, mushrooms and green peppers. This was VERY good, and I'm sure the fact that they make the pizzas to-order was part of why I found it to be so yummy. And by the way, my friend and I both took some pizza home with us - it was an enormous meal and more than either of us needed. So don't let the prices on the pizza frighten you, they're worth it.  The good news is that overall my experience definitely got better as the night went on. The bad news is that I honestly don't think I'll go back to Nico's, at least not for quite a while. As delicious as the pizza was, nothing can make up for the fact that this place is a smoker's haven. With lungs as sensitive as mine, this is a dealbreaker, and I'm pretty sure it was only by pure chance that I came in on a night where no one was smoking near me; if the place had been any busier I'd've had to leave just so I could breathe normally, I'm sure. I'll still give the place an \"a-ok\" rating since the food was delicious, the prices were good, and our waiter (who I think was bar-tending as well) was very nice and very attentive overall. But with such a strong smoke smell an \"a-ok\" is all I can honestly give."}
{"text":"Nico's is simply the BEST neighborhood bar. Great staff, amazing fries, good food overall, super friendly people. Smoking allowed. You go there three times, and the bartender remembers your name. Just awesome"}
{"text":"Pay attention to the bill.  Curly haired male bartender intentionally added $20 of drinks to my tab. When I confronted him he blamed the extra drinks on my friends who hadn't been drinking those things in the first place."}
{"text":"HOLY SMOKE ALERT!   I am seriously still coughing from all of the chain smoking that was taking place in this bar. I guess I've been spoiled by all of the clean air in Columbus restaurants, pubs, and bars that I was just not prepared for all of the heavy smoke that would linger around me all night!   I have a couple likes and dislikes for this place...  Likes:  - Awesome, awesome crowd! I've found that Pittsburgh locals are super fun! I absolutely loved how everyone cheered the singers on during karaoke and sang along making it extremely comfortable to get up front and center!  - Healthy food choices! Instead of having to worry about adding a ridiculous amount of calories (in addition to the crazy amount I had already consumed for the day)...it was nice to snack on some hummus, fresh tomatoes, feta cheese, and pita bread.  - Very friendly DJ! - Bartenders were simply wonderful and always made sure you were taken care even with the enormous bar crowd. - Prices were very reasonable. I think I had six or seven captain and cokes (blush) and the platter for only $20?!  Dislikes:  - POLLUTED AIR. I now have to take my jacket to the dry cleaner, thank you.  - Location. There were no available taxis at any given time. We contacted two different taxi services and they never showed. We finally had a taxi pick us up after calling the hotel valet and asking them to send for us (I was a little desperate). - This place is very, very, very small. The karaoke room was closed off by 11 PM due to the room being so packed. If you were not in the karaoke room, you were smelling the person next to you's breath.   Aside the heavy smoke and tight spaces, I would recommend Nico's for a fun night of karaoke and cheap drinks with friends!"}
{"text":"This is a friendly, hipsters-and-yinzers-living-in-harmony kind of joint. Sports on the TVs, Yeungling on tap--quintessential Pittsburgh. The fried fish (with fries and coleslaw) is Lenten-Catholic quality. If I minded cigarette smoke, this place would be a four; but since I don't, perfect score. Like Scorpion once intoned...\"Get over here!\""}
{"text":"I don't understand why people love this place. I've been here a dozen times.  The beer selection is decent. The prices are good.  The bar food is typical.  It is just a standard bar to me.  If you want no frills beer and bar food, they are no frills."}
{"text":"Good prices, good people, good dive-y atmosphere. What else could you want in a bar?  The place smells like cigarettes, but I don't care. I got drunk here and rapped Rick Ross. Isn't that the American Dream?"}
{"text":"Atmosphere wise, this is pretty nice as far as a divey neighborhood bar goes. There's a ton of seating, or at least it seemed that way Monday night when things were pretty slow. Menu items were very reasonably priced. However, no beer menu. Weird.  A friend and I each ordered a pumpkin beer, after the waiter told us what was on tap, and we got the special for Monday night: Two dozen wings for 9 bucks! We got a dozen BBQ and a dozen with Cajun dry rub.  Unfortunately, the wings were deep fried for so long the meat was somewhat dry. The service was a little off too, maybe because it was a slow night but the bartender was playing double duty as the waiter. (Which I didn't realize until we were leaving.) He was really good, but he wasn't able to come by much.  Hoping to get back here again sometime, since my friend lives a few blocks away, but might just bypass all things deep fried."}
{"text":"Stumbled upon this place during a weekend trip to Pittsburgh. We had a less than stellar experience with another bar down the road and yelped our way to Nico's Recovery Room. Super divey atmosphere, in a comforting and welcoming way. Ordered some IC lights and a Sam Octoberfest on draft. It was apparently karaoke night which was pretty entertaining.  We ordered small fries with gravy which was only $3 (food menu was very decently priced). We were surprised when they came out with a large basket of handcut fries and delicious chunky gravy. Our bill came out to $19 for 4 beers and fries...can't beat that.  Only downside was that we came out of there reeking of cigarette smoke. Otherwise, we had a great time at Nico's and would definitely recommend for a local feel."}
{"text":"Nico's is one of my favorite Yinzer bars.  I've been going here off and on since I turned 21, even if it was just to stop in for fries at lunch, and it's one of the finest dives around.  We typically stop in here for a fish sandwich and some drinks after the Unblurred gallery crawl in Garfield.  Jason bartends on Friday nights, and he's the best.  He's one of those bartenders that remembers you after your first visit, and remembers what you drink and keeps the refills coming.  Their food is excellent.  The fish sandwich is church-fish-fry good, and the coleslaw is crispy and mayonnaise-d to perfection.  But the real treat of this place is the fries.  There's something about these fries that I just love.  I think they remind me of the homemade fries my grandpa used to make me in his deep fryer when I was a kid.  They're kind of like a thinner, jucy-er version of Potato Patch fries.  Seriously.  Go get some now.  And like other dive bars in Pittsburgh, the prices are cheap.  This is the perfect place to sit around with your fellow Yinzers and watch the Buccos or the Pens (or both, if it's that glorious time of year when both seasons are going - they have multiple TVs).  The only thing I don't like about Nico's is that it's one of the few smoking-permitted bars left in town (they, like Thunderbird and the Cage, keep the food prices low to skirt that smoking ban loophole).  I've gotten kind of spoiled lately by smoke-free establishments, and I hate coming home stinking like cigarettes.  But the dives in Pittsburgh are all pretty much maintaining the smoking thing, so I can't complain when comparing.  All that said, there's no bar I'd rather hang out at than Nico's.  :)"}
{"text":"Nico's is what it is.   It's your typical dive Pittsburgh bar.  it's the Jacks of Bloomfield.  I've never tried the food but the drinks are relatively cheap and it gets an awesome crowd that ranges from young hipsters to old yinzers.  Rumor has it that it's the #1 karaoke bar in Pittsburgh so I recommend giving it a try one Saturday night.  Whether your voice is terrific, mediocre or terrible, there is a great crowd more than happy to make you feel as though your voice really is terrific.  It does get really crowded for Karaoke, so if you want to sing, make sure to sign up earlier in the evening (I believe karaoke starts at 9).  The only thing that I really dislike is that you can smoke in the bar."}
{"text":"The regular bar food is the same as anywhere really but the greek specialties are outstanding.  Staff is always nice and drinks are affordable.  Great local hangout."}
{"text":"I am only familiar with Nico's when they have their Saturday night karaoke, but the merits of that alone solidify the place in my heart. It attracts a diverse crowd, from locals that primarily sit in the main bar area, to a quintessential hipster crowd. I was actually just there last night, and my friends and I noticed how the crowd has gotten more and more hipster as the months have progressed.   Fair warning: the guy who runs karaoke is somewhat lame. After every song, he will say \"all right!\" or \"good job!\" in a cadence that demands to be imitated. Additionally, he seems to have some favorites amongst the regulars, particularly one woman who I have seen butcher \"Me and Bobby McGee\" every time I've been there."}
{"text":"My husband has been saying he wanted to try this place for months now. We finally went in for breakfast today and I was very pleased with the food and service! I got the breakfast turkey club and my husband got an omelette. Both were excellent!!! Their breakfast menu is great. We can't wait to go back to try some other items like cornbread French toast, strawberry lemonade pancakes, and the cinnamon roll pancakes. They also have excellent prices! Although I didn't have one I noticed Moscow mules were 5.50 and they use Tito's vodka!!! They are 10 dollars every where else! The staff was extremely nice and personable. We will definitely be back!"}
{"text":"Best little dive bar in Bloomfield! Pizza is amazing as well! Dave the bartender is a complete sex pot he might even be down for a handy J. I always have a blast at Nicos"}
{"text":"I'm a pretty hard core karaoke fan, so I was excited to visit Nico's on a Saturday night after hearing about their awesome karaoke. Sadly, I was disappointed. The place is rather small and was packed by the time we came (about 10pm). It took ages to get a drink and it's hard to get around the bar with so many people standing around. That said, my drink was nice and strong and the prices are reasonable.   Now the karaoke crowd was pretty fun...mostly hipsters with a few good singers but mostly people trying to be funny with their song choice. The karaoke host was just lame. He was an older guy, and seemed rather cranky and jaded, which really kills the mood when you're a karaoke buff looking for a good time. And he had a CD setup -- seriously, CDs, in 2010. His song list was waaaaaay out of date. He had a tiny TV screen that was setup in such a way that if you needed to look at the words, you would be facing away from the crowd. It was just really lackluster in my opinion."}
{"text":"Bloomfield has some hidden gems and Nico's is one of those kind of places that is getting less and less common around the 'burgh. It's not a gastropub, it's not bohemian, Nico's is just an old time bar/restaurant that makes me nostalgic for a time before I was even born.   I always come here on Monday nights for the wing special. It's something like 24 wings for 8 bucks which is not a bad deal. There are definitely better wings around the city, but I still keep coming back to Nico's. Maybe it has to do with the friendly atmosphere (seems to be a family run place), and the divey feel. The location is great as it just pops up in the middle of a residential section in the heart of Bloomfield.  The patrons are always friendly, and on more than one occasion I've had random people start chatting me up like we've known each other for years. If you are feeling adventurous try out karaoke night on Saturdays, its always good for some laughs and fun times.  Long live the old school joints in Pittsburgh, I hope you last forever."}
{"text":"The Good:  Jason the bartender. Thanks for the Beautiful Widgets app tip. Jack and Coke. Smoking allowed. Friendly Phillies fans. Comedy Central Friendly. Locals Great horse shoe bar   The Bad: Karaoke disciples mixed with fat guys singing 'Billie Jean'"}
{"text":"Nico's is probably my favorite neighborhood bar.  The bar and wait staff here are all tremendously friendly.  There is not much of a beer selection, but nothing is expensive.  Generally in the late afternoon/early evening it is pretty quiet, with a handful or two of regulars.  A reading group that I am in frequently meets here around happy hour, and there are always plenty of tables and we can talk easily without having to yell.  Weekends it can get pretty crowded, although I've never seen it so packed that I had to wait more than a couple of minutes to grab a bartender's attention.  Karaoke on Saturday nights is a blast, with a great mix of working class, hipster, and trendy all belting out cheesy tunes.  The only food I've tried are the fries, but they always come out tasty and quickly.  Friends have told me the wings are good.  Would give it 5 stars, but for the smoking.  If you're a non-smoker, you WILL come home smelling like an ashtray."}
{"text":"This has got to be one of my favorite bars in Pittsburgh.  Yes, some nights it is smoky.  And some nights it is crowded and filled with loud and somewhat annoying hipster types.  But it's our little place.  This is the bar where my friends and I gather to watch sporting events, sing karaoke (albeit badly), and generally hang out.  The beer is decently-priced, not CHEAP CHEAP, but it won't cost you an arm and a leg.  Wednesdays are pizza and a pitcher -- we LOVE the Chili Pie and pair it up with Yuengling or the similar.  And the other food is pretty good too -- among our other favorites: the wings, Nico's Platter, and fried cheese.  YUMMY!  Jason and Nicole who both bartend and wait tables are both AWESOME, always friendly, always generous with the booze, and always quick with a smile.  They're great!  PS -- As a reply to reviews complaining about the guy who does karaoke: if they reviewed prior to early 2011, there is someone else there now and we think he's pretty great.  :-)  If he doesn't have a song that you want, let him know, as he's constantly adding new music and updating his collection."}
{"text":"At the higher end of the dive bar world you have Nico's. I say higher end because it's not as dank as most. It's older but has so much character (and I'm not just referring to the patrons). It's a neighborhood joint with stand up comedy and karaoke. Good food. The gyros are as good as any you'd get at a Greek restaurant. Nice little bar. The crowd ranges from millennials and hipsters to old timers and bikers. Eclectic mix of people."}
{"text":"Nico's was a place I heard I should visit, but I was always a little scared to go inside.  The outside is typical dive bar with block windows and no way to actually see inside.  Once you're inside though, it is a different story.  There is a huge bar area (filled with yinzers talking about the Steelers), and past that there is a decently sized sit down area with booths and tables.  Nothing fancy here, but good and attentive wait staff, and nice cheap beer, sports tv, and quick yummy food.  There was a large group of us, and we ordered the Greek Platter, and it was just right.  Everything from fresh feta and olives to spanakopita and grape leaves.  Nico's is on Friendship Ave and very close to the hospital (hence the 'recovery room').  I look forward to checking out the Saturday Karaoke to see what Pittsburgh local vocals will produce."}
