{"text":"Get the fish sandwich.  Best I've ever had.  The cole slaw is homemade and is awesome as well."}
{"text":"Classic food and a solid fish sandwich. The service is great. Though not quite my taste, they seem to have a large following for their live music offerings."}
{"text":"Atmosphere: classic local dive with one part bar, one part diner, and an outdoor patio and stage for live music on weekends. Great location at the end of Upper Lawrenceville on Butler.

Food: The claim to the best fish sandwich in town might very well be true here. The filet was perfectly fried, large and just right. Have the fixings any way you choose.

Service: we chatted with Amy, who welcomed us and made us feel at home, as it is practically her home as well; she has worked there nearly 30 years, and her mom and aunt were also there, with another combined 90 years of service at the famed establishment."}
{"text":"Chaotic and dirty. Wait staff appeared confused, disorganized and rude. 30 minute wait to get a drink after telling waitress 3 time and then to have drink slammed down on the table.   Food slightly better than average
Be afraid, be very afraid."}
{"text":"Nied's Fish Sandwichs are World Famous!!  This friendly Bar / Restaurant in Lawrenceville has been serving these HUGE and DELECTABLE Fish Sandwichs for over 75 Years! After serving 27 years in the military and eating around the world, I can't wait to get back to Nied's for a Fish Sandwich and an Ice Cold Beer.  This is an old town neighborhood \"workers\" establishment supported by the steel men and women and their families for generations--If you live or are traveling in Pittsburgh you have to make this a stop.  If you have their Fish Sandwich and a side of fries and cole slaw--you will be \"hooked\" for life. Grew up eating at Nied's and have been going back for 40 years.
While you are there, talk to the owner Jim Nied--there is not a nicer person on the planet!  You will be glad you stopped and next time will most assuredly bring your friends."}
{"text":"This place has the best fish sandwich I have ever had.  Better than Wholey's, better than Roland's.  Only sandwich better is a pickled herring on rye at a schnell-imbiss in Germany.

Walked in, and was immediatley amazed at how clean it is, and how old it is.  It is in Lawrenceville.  This is basically a hip little area of old Pittsburgh, where the young and happy have discovered they can live relatively cheaply, and have a neighborhood that allows them to bar hop, eat good food, commmute a couple miles into downtown Pitt and have a great standard of living.

It was Friday.  I wanted Indian food, but the wife's birthday is this weekend, and she had been saying for the past few weeks she wanted a good fish dinner or sandwich.  And I mean, this is not like a blue fin tuna with arugala on a brioche.  I mean it is like your basic standard Lent fish sandwich that you would find in your basic standard catholic neighborhood.  Nied's Hotels is the place!

It is a mixture of old style bar and fry restaurant, mixed with late night bar and bands.  You can come in at 7 a.m. and get a beer and a breakfast.  You can come in at 10 p.m. and get a beer and listen to a band and eat a clamwich.

We struck up a converstaion with the cook/servers.  I knew we were in a place that was worth it, when the one lady said \"Oh yeah, when we used to open on Sunday in 1975...\".  WOW!  One of those places where the employees have been there longer than Guy Fieri or Rachel Ray has been making the big bucks by telling folks how to make a hamburger.  

Anyways...  We both got the fish sandwich, with cheese.  $7.45.  And, yes, the fish was as big as the plate.  Twice as big as the bun.  And it was taken out of the fryer, drained, put on the bun, the cheese put on it (they melt the cheese on the flat top before they put it on the fish) and put it in front of you with a great big smile.

It was absolutely perfectly cooked.  The fish filets were covered in bread crumbs right before they fried them, then they served it righ to you.  There is absolutely NO WAY that you could get one fresher or better.  Well, you could.  But really, this was great.  If you dont like this place, you are just too trajically hip for your own good.

I like a blackened red fish on brioche as much as the next person.  But to me, to what I would think is your average person.  This is what you think about when you get a fish sandwich.  And, the way they make it at Nied's, is exactly correct.  Nied's fish sandwich is the best in Pittsburgh.  And I am guessing it is consistant.  The way everyone came and went, and the way the staff all interacted.  This place is great.  Just 20 blocks up from Round Corner cantina.  

Just to make it clear.  Nied's fish sandwich is the best sandwich in Pittsburgh.  Best fish sandwich I have ever had.  Best Best Best.  Period!!!"}
{"text":"Their fish sandwich is only famous for being awful!  Piece of fried fish on a plain bun, that's it!  No sauce, no condiments.  Lame.  Give them kudos for live music though!"}
{"text":"Great bar. The prices are very reasonable and the band isn't bad either. The fish sandwich rivals Armand's in deliciousness though it could not be more distinct from it.

I have heard the bar organizes a shuttle to Punxsutawney every year to see Phil. That sounds like a ball!"}
{"text":"Woohoo!  Haven't done a \"first to review\" in a while on here.  

Nied's is a Lawrenceville institution - in business since 1941.  They're known for their fish sandwiches, which are okay as far as taste goes and humongous, and I mean really humongous.  The only have IC beers, too.

Ambiance is very dive, but the staff is very friendly and service is great.  (I haven't seen much of the supposed \"nice\" out of locals since I moved here a couple of years ago, but Nied's embodies it.)

Keep in mind: this is four stars for a place that is very much a dive.  It's well above average for what it is and what they're trying to be, but it's not what you'd be looking for a little further down Butler."}
{"text":"This place was horrible. Went in on a Fri. night and ordered fish, clams, oyster sandwich, fries and shrimp. All fried food and we waited about 45 min to get our meals. We only got them after I told the waitress we would have to go so we could make other commitments. At that point I left half the party to take the other half to their art class. Upon my return to hook up with the people I left this oyster sandwich was waiting for me. The picture is what I waited 45 min. for. I won't be going back there ever."}
{"text":"Horrible food. Tasted like cafeteria food. The Mac and cheese was definitely Stouffer's that had been reheated. Never going there again and I don't know why anyone would."}
{"text":"Nied's isn't the kind of place you go to for a salad.  I learned that first hand.  This past Saturday after changing our dinner venue three times we ended up at this dive.  Shocker my group of 10 couldn't just walk into any restaurant on a Saturday evening and get a table.  Lousy planners.  

Neid's is definitely a dive, but that's cool.  They know it and show it proud.  Nothing too fancy going on in here.  We grabbed some beers and settled into a long card table awaiting to order food.  Our waitress was a class act, not to mention a natural born salesperson.  I found it funny how all her \"suggestions\" were so persuasively formed. \"How about two baskets of fries for each side of the table?\"  My party, um ok. Sure.  \"Great and you have to get the cheese too,\" as she continues to write on the pad undoubting the additional cheese.  \"Oh and your gonna want to get some provolone sticks, they are great.\"  Really they are great?  Looks like a standard frozen provolone stick to me.  My party, \"sure, sounds good\".  

Now me, Neid's is known for their fish sandwich, at least that's what's on their sign and what the waitress said.  \"It's the best\".  Of course it is, like the provolone sticks I'm sure. Regardless she tells everyone that if it's not the best they ever had she will not charge for it.  Well then maybe it is the best, perhaps unlike the provolone sticks.  I really wanted to try the fish, but I have been trying to eat very healthy.  No fried food, no simple carbs, or junk.  So Neid's menu is not for someone like me.  Primarily everything is deep fried.  They do have a breakfast, but I assumed at 6 pm on a Saturday, they weren't serving that.  I was so hungry too.  I had only had one egg in the morning so it was a full blown hangry attack.  I saw they have salads so I went with a grilled chicken salad.  

Stuff begins to flow out of the kitchen, or more like the fryer area in the corner of the bar.  Everyone at my table got something fried.  The two baskets of fries with cheese show up.  My friends fish sandwich shows.  The other people in our party food shows up. It very much seemed that they serve it as they make it, so one sandwich comes out. Then a minute later another.  Meanwhile, I and one other lady ordered the chicken salad, and it is nowhere to be found.  I did snack on two fries while I waited because I was starving.  I thought they were really good, or maybe I was just really hungry.  So everyone is about finished and still no salads.  My friend makes a joke, \"Ha ha, you can tell they aren't used to people ordering salads here!\"  Yea funny.  Salads show up.  Visually they looked terrible.   Mostly made up of yellow, bitter iceberg lettuce hearts.  I was so hungry though I just dived in.  I ate the whole thing and quickly but mostly due to my then current state of starvation.  

In conclusion, maybe the fish is great, I don't know. But the salad is not.  I would return if bar hoping in Lawrenceville, since I do like dive bars.   Maybe someday I will get to try that fish."}
{"text":"What is it with Pittsburgh and it's dive bars?  Please don't read that as a bad question to be asked.  I'm in love with the fact that Pittsburgh has so many amazingly dive-ish bars within the city limits that you could and can hit all of them up.  

I loved that the bar are is packed.  I'm not talking about there being a constant crowd of people in here, I'm talking about how much stuff they fit into this space.  It feels like it's a jumble mess of happiness.  The dining room isn't much different.  They seemed to have jammed as many tables in here as possible.  So if you are looking for a table, get here when there isn't a rush or be ready to dive bomb a table once a party is finished.  It's dim lit which adds to the dive feel.  Music blaring, people talking loudly to one another and the constant noise from the kitchen makes for another fine touch.

However Nied's is known for something other than being a fantastic dive bar.  Their fish sandwich.  When I worked nearby my coworkers would constantly order and pick up from here.  Why did I always find an excuse to not order when they did.  Oh well, better late than never to try one of these babies.  

This thing is too big to fit on the bun they give you, but it doesn't matter, you still find a way to eat every crispy morsel.  The tarter sauce is to die for and a must to be put on the sandwich.  You can either slather that all over the plank, or you can do like I do and give yourself a heaping pat with each bite.  Even though these fish sandwiches are behemoths we decided to order a couple of sides.  Basket of fries to share and some good old Cole slaw.  I have no idea why, but to me Cole slaw is a great side to a huge fish sandwich.  After eating this meal (a note, we did not finish everything), I needed a nap.  

The serving staff here are amazing.  Constantly making the rounds as they pick up or drop something off at a table.  Always smiling and talking with the regulars.

Something to note: they have an outdoor area where they have a stage.  Live music in the warmer months."}
{"text":"We went to the Nied's Hotel for an outdoor fundraiser.  The Nied's Hotel Band performed.  They rock!  They are always a good time. I highly recommend you check them out. 

That aside, the outside of the building states \"famous fish sandwich.\" Everyone ordered the fish sandwich at our table and we were not let down.  This fish sandwich was hands down the best I've had.  It is lightly coated on the outside so you don't feel like you are eating a bunch of breading. The fish is tasty and it's a really large sandwich. We will definitely be back and I won't be able to help myself but to order the same thing every time."}
{"text":"So much positive things to write about Nieds. I'll keep it simple and sweet. The service was beyond friendly and they have a great tasting fish sandwich. 
Swing in and grab dinner or a drink, or both!!!"}
{"text":"Definitely would call this place a dive. It's a very noisy bar with no kitchen;  they have a few portable deep fryers propped up on a table. The condiment table has no refrigeration. The waitress just spoons your tartar sauce in a plastic cup like someone would if you were at a picnic at the park. They just recently raised all their prices by about a dollar each. So if you think you are going to go get a cheap fish think again. With the a la carte fish now being $7.75 you are not going to get out of there for less than $12 per person after tax and tip plus a possible drink or side dish. Not my idea of what I want to pay at a dive bar. That's just my opinion. I'd rather go to a nice quiet restaurant with some atmosphere and pay that amount and get 2 side dishes and good service from a real waitress. The sandwich is good but not all that filling for the amount of money you end up spending."}
{"text":"This place has some charm. It's a curious combination of two separate rooms, so to speak--one is a standard bar area with live musicians (at least when I was there), and the other is an adjacent room with tables meant for dining in. At the time we went, the second room was quite occupied down the center by a large party, and there was hardly any room left on the side for the booths. 

We managed to squeeze into one of the booths and the waiter/waittress came and took our order shortly. Their menu isn't anything extravagant, but their sandwiches and such are surprisingly cheap. The fish sandwich is indeed a good option: very affordable, large fish fillet, and you can put all the veggies you want into it. They also have a bunch of other seafood sandwiches, cheese steaks, and burgers.

All in all a nice place for cheap good food. The only gripe I had was the pushiness of the band in coming around for donations, even though we weren't even in the bar room."}
{"text":"Great little old school place in upper Lawrenceville.  Ordered a fish sandwich for take out so didn't eat there,  but the sandwich was delicious.  Large portion and flakey texture.  Exactly the type of fish sandwich you'd want. Comes with the option of onions and pickles on top.

Bar and restaurant was decently packed for a 5pm weeknight.  People drinking beers while watching KDKA on the Tvs. Classic Pittsburgh. Would definitely order again!"}
{"text":"Went here on a very busy Lenten Friday and walked away very happy.  They were busy as heck but still took our order and got our food very quickly.  The owner was the person who took our initial orders.  Very friendly staff across the board.  Fish sndwich was more than enough.  I also got the fries which I didn't like as much.  They were also expensive, $2.90, for the amount that they give you."}
{"text":"grew up just up the street from here. Back in the REAL DAY, we would \"bum\" our nickels and dimes from our folks and head down to get our Friday night fish sandwich. Had fish from all across the country, still my favorite. Tell Jim, the owner, Chex sent you."}
{"text":"The prices here are cheap, but you don't even get what you pay for.  Everything tastes like it was frozen, freezer burned, then fried, and I felt a bit of apprehension bringing certain items to my mouth.  The famous fish sandwiches are large, but not worth ordering more than once.

Note: this is a rating of the food alone.  I didn't drink here, nor did I attend any musical events."}
{"text":"I'm a vegetarian and even I love Neid's. My grandfather loved this place, too. Best fries in town. Best fish, best bar food. Freshly made right in front of you if you sit at the bar and aren't an a-hole. My friends are now in love with this place, too."}
{"text":"I've come here twice for breakfast with my night shift colleagues after a long night at the hospital. Located at the intersection of 55th Street and Butler Street, the low-profile stone building houses the bar that boasts its tasty fish sandwiches. I walked in and the faint scent of fried fish hits my nose immediately. The bar and long bar table is along the right wall and the seating area, TV, and jukebox are along the left. There were christmas lights lining the walls, even though it was not that season. I spotted the signs to the restrooms, which were to the back and down the stairs.

We seated ourselves and were greeted by one of the employees (Dale was his name, I think). He introduced himself, the bar, and showed us the menu. The menu has two sides. The first side showed the breakfast menu (a la carte breakfast items, breakfast sandwiches, omelettes), sandwiches, cold sandwiches, and beverages (including beer and wine). The second side showed side items, salads, seafood (including their famous fish sandwich), burgers, hot dogs, and chicken. Many of their selections are relatively inexpensive; the most expensive item I've seen was their seafood platter for $13.50 and comes with fish fillet, crab cake, oysters, two shrimp, french fries, and coleslaw.

My group and I chose our drinks (I ordered the Angry Orchard hard apple cider) and food (I got the veggie omelette with cheese and breakfast potatoes without toast). Our drinks came very quickly. I took a sip of the Angry Orchards and I really loved it. Our food, however, took some time to arrive, probably because we had eight people in our group. Also, I think there was only one chef working at that time. So, considering these factors, I didn't get very upset, and within 30-45 minutes, all our food came.

I tried my breakfast potatoes and they were good like any breakfast potatoes. I cut into my omelette and saw good amount of vegetables. However, I was disappointed that the cheese they used was a slice of American cheese, which was placed right in the center of the folded-over omelette. It added an odd flavor to the omelette. I think I would have liked it better had I gotten it without the cheese.

Everyone else ordered omelettes--cheese omelette, western omelette--and breakfast sandwiches--egg sandwich, bacon and egg...with an extra side of bacon (haha). They all looked good, and the bacon was cooked very well and crispy.

This bar is well outside the route I would take to go home (Shadyside) from Lawrenceville. I wasn't blown away by the food or the ambience. I should probably try their other menu items. However, I can't envision myself coming here other than to decompress after a long stretch of night shifts with my colleagues."}
{"text":"Fish is great but lunch time service was to slow. Plan an hour for lunchtime. Just seems for the amount of years doing it they would be faster"}
{"text":"If you're in the mood for good ol' bar food with quick service, this is the place to go.  I've heard not much has changed in the past few decades, and it definitely seems that way.  We ordered the famous fish sandwiches, which were pretty darn good.  They were HUGE too!  

The highlight of the night was the Nied's Hotel House Band performing in the courtyard next door.  The crowd spilled onto the street.  The band was great!  Definitely a fun atmosphere."}
{"text":"Local dive. When my husband and I came in they were playing the local news followed by Wheel of Fortune. It made me think of growing up while my mom cooked dinner.
I have to say that I felt a bit of an \"outsider\" because we weren't part of the regulars, but our waitress was nice enough.

They have bottled beers that are pretty cheap. My husband had the famous fish sammich which was pretty tasty. I had the saltiest ham and cheese sandwich I have ever had. I felt my blood pressure rising - I could only stomach a few bites.

Decent little watering hole. I'd like to go back when their House Band is playing!"}
{"text":"Nied's is legendary to the region.  Music, good bar, separate dining room.  This is not a 5 star foodie place but a solid neighborhood bar/grill scene.  Nied's Hotel Band has set up an outdoor stage as well.  The place is a bit of a dive bar but the staff, and Jim himself, make it relaxed and friendly.  Celebs of the region frequent the place as well."}
{"text":"I cannot believe that I have lived in Lawrenceville for as long as I have and have just recently started going to Nied's. This business loves live music! How awesome is that? The first time we came here for a show and it was great. Even packed the service was on point. I was surprised and pleased by the friendliness of the bartenders and servers. Sometimes in those crowded or tight environments it can get crazy but these employees were on point. They were just doing great with the crowd. It was impressive. 

The second time we came here we came late because I get cranky when I don't eat and it was about that time. The choice was to either be in a bad mood and try to cook food or get something fast. Chris decided that get food in me fast and picked Nied's to do so. 

We walked in and it was dead in the dining section. I was worried that we wouldn't get served! But the waitress welcomed us in and assured us it was not too late to order. Boy, was I happy for that food!

Sides:
Fries: Um.. could I get a bigger basket of fries? Chris and I couldn't even eat all of the fries in the basket. It was crazy how much you got for $2.90. Thank goodness we didn't go for the larger basket size!

Provolone Sticks (4): Chris always likes to get cheese sticks. They were good, normal cheese sticks, nothing outstanding but good. The marinara was also pretty good that came with the sticks. Not too chunky but still thick. 

Dinner:
Number 1 Fish Sandwich: This thing was huge. Chris and I probably could have split it between the two of us. I watched them take an entire filet of fish, bread it, and then fry it. How great is it to be able to see the food you are eating being made? I know that what I ate, even if it was deep fried, was made fresh in front of me, nothing frozen. That to me is good food. 

I cannot wait to come back when they have the outside area open! I look forward to enjoying some food and listening to loud music. I will never again think to skip out on this place. I will suggest you go inside and see what it is about! The food is fast and good, but if you are looking for something healthy this might not be the place for you!"}
{"text":"Late this past Friday afternoon at the Lawrenceville Asylum For The Criminally Inane, a couple of my co-workers decided to get us some fish sandwiches from Nied's, a strange bar with a strange name. A nice Lenten treat is what I stumbled onto. Or did it stumble onto me?

Wildly fresh, thoroughly breaded, and consummately fried, the fish jutted out from each side of a bun that was just not big enough to hold it. 

This fish sandwich wasn't some frozen fallacy foisted onto unsuspecting lushes; this fish sandwich was made by someone who cares, someone who isn't afraid of people eating these sandwiches sober, someone who knows and appreciates craft.

\"I'll be waitin' for that review, Darren,\" one of my errr...colleagues said in a muffled tone with a smug grin on his face, which was full of bread and pescaterian excess. 

\"Gimme a few days,\" I replied, my mouth also stuffed with said barroom fare. 

\"Did you like it?\"

\"Call me Ishmael...\"

\"Huh? Call you what?\"

\"Nevermind.\"

I lost him after the Moby Dick reference. 

I don't normally eat fish sandwiches, but in the future, I'll keep Nied's in my mental rolodex when the urge comes over me."}
{"text":"There's nothing fancy about this place. This is a true Pittsburgh dive bar with excellent food and cheap prices. Most of the people know the staff and vice versa. The fish sandwich was large enough for a 200 lb. American male, but not so big that you feel over stuffed. It was nice and hot, not greasy. The only thing that could have been improved is a toasted bun. I will definitely be back for more fish sandwiches in the future."}
{"text":"I LOVE a good fish sandwich. With the emphasis on GOOD. Now I've heard all of the raves and seen all of the signs bragging about such-n-such an establishment's FAMOUS fish sandwich. Armand's FAMOUS fish sandwich. Wholey's FAMOUS fish sandwich. Roland's FAMOUS fish sandwich. And for years, I've driven past the dingy looking hole-in-the-wall with the neon sign out front 'Nied's Hotel' (which kind of looked like the dive bar my father worked at and found his second woman to knock up), with the 'Famous Fish Sandwich' sign...yadda yadda yadda.

Then, this particularly boring Tuesday evening, with foiled plans for something else, a neighbor and I decided to grab a bite. 'Let's try a fish sandwich at Nied's' I said. And off we went. 

My hopes weren't real high, having experienced far too many disappointments in da burgh, mostly due to a big ol' dead fish on a hamburger bun. SERIOUSLY people, you're not fooling anyone. Just because you plop a big ol' fish on a tiny bun, it doesn't make the fish look bigger. It just makes the sandwich tedious to eat. Six bites of 'sandwich', and a plate of leftover fish that will NEVER fit on a hamburger bun.

So we entered the darkened cave of Nied's Hotel, which really was kind of an ancient but charming 'dive bar' with a restaurant on the side. We scoped the menus briefly - burgers, doggies, chicken, seafood, sides, and - the famous fish sandwich (with or without cheese). We knew what we came for, and we ordered. 

It took almost no time to arrive, and our waitress was a good ol' kind of hometown gal, very friendly and accommodating, and happy to see 'new faces' coming in to give it a try.

Well...I have to say, after five years of just driving by and wondering...it was more than worth the visit.  The fish was large, flavorful (not fishy tasting like something that had washed ashore in the noon day sun), the breading was nicely firm and crisp, not too heavy and not too light, and the flavor of overused oil did NOT come into the flavor. The cheese was a couple of sliced of basic American cheese, and I asked for lettuce and tomato, which fit nicely on...THE BUN.

Ok, now I'm not going to rave (or rant) about the bun except to say that of ALL of the joints in town serving a fish sandwich, Nied's came closest to having a bun to kind of fit FISH appropriately. It wasn't a freakin' hamburger bun! It was a longer roll (still not long enough to fit a fish), and made a little more sense as a bun for a fish sandwich than most brainiacs in da burgh seem capable of conjuring up.

Hmmmmm. Up until now, my fave fish sandwich in town, somewhat appropriately, was at the Lesbian bar in Lawrenceville. But now, I have to say, Nied's has won me over.

Armand's can keep the feisty old lady and the greasy fish on a hamburger bun. Wholey's can keep their claficken (and if you didn't know, since everything seems fried in the same vat, that meat you're eating, whether clams, fish, or chicken, all tastes the same...claficken). When I'm now in the mood for a good bar fish sandwich...it'll be Nied's.

And, to top it all off, they have BOTH - Coke AND Pepsi! (now truly, how smart is that?)

The waitress was bragging about her Reuben special on Tuesdays. I'm going to take her up on that challenge. I LOOOOOOVE a good Reuben, but have yet to find one ANYWHERE in da burgh that can stand up to the least of a Reuben from New York. I go to NY for four days, 6 of my eight meals are Reubens, because I know that ANYWHERE I go in NYC, competition and a demand for excellence insists - ANY Reuben had better be a damned GOOD Reuben, and they always are.

I'll be taking this gal up on the Reuben challenge. But even if it fails, the fish sandwich is worth the trip. 

Nied's is a prime example of the type of place I will repeatedly hit for food...I don't give a rat's patootie how much you spend on 'atmosphere' and glitz...I go for the food. And often, the best food is found in the least likely places. 

And frankly,  the 'famous' sign might actually be worthy of its braggage."}
{"text":"The fish sandwich is good...nice staff...atmosphere is not great....overall good place to grab a sandwich and beer."}
