{"text":"Nighttime Nosh is hands down the best business out there!!!  I only wish they had been around when I was a student at ASU. They can satisfy all of those late night cravings with just the click of a button!  Ice cream, cookie dough, beer, wine, toilet paper.  You need it, they got it!!!!  Now they just need to expand valley wide!!!!"}
{"text":"Love that their delivery service is quick! The $5 combo meals are definitely worth it. You should probably have extreme munchies and no other way of getting your food before ordering from here. While the delivery men are always nice and efficient the size of the snacks that you are paying for aren't worth the money (unless you're starving or too drunk to drive)."}
{"text":"Such a quick and convenient way to get your late night munches! Love it!!!"}
{"text":"Holy crap I love nighttimenosh! I can always depend on them for emotional support and midnight chocolate and wine to compliment  my PMS and cats."}
{"text":"Awesome selection and quick delivery! These guys rock!"}
{"text":"Already love this place, they have a little bit of everything and proves that quantity and quality can coincide. Can't beat how fast they are either, not Jimmy Johns but still pretty good."}
{"text":"Wow! They have pretty much everything I can think of that I can find at a convenience store, INCLUDING CIGARETTES AND ALCOHOL! AAANNNDDD Deliver it right to my door. Got the munchies, need a beer, forgot a condom, out of toilet paper. BAM, they deliver it right to you. If you're in the area of Tempe, I highly recommend taking advantage of this awesome service. save yourself a DUI and just get it delivered."}
{"text":"Ben and Jerry's at 1:00AM on a Friday night, what more could you ask for? 

I live in an apartment that's designed like a rat maze and most people just get overwhelmed with fear and ask to meet at the front. 

These brave guys and gals are troopers and deliver that gooey chocolate goodness (Phish Food) right to my door.

They have healthier options out there, but who cares about that.  I just want a pint of chocolate."}
{"text":"I love this place. Friendly and easy experience every time. Online ordering is easy. Always quick and have whatever I need or am craving at the moment. Love that they are open late and they have saved me from many a hangover lol."}
{"text":"Can't believe they've been around since 2012 & I just found out about them!  Best service ever.  Minimal delivery time, prices are fair.  They carry anything you might need in a pinch.  Cigarettes, beer, condoms, toilet paper, feminine products.  OH - And yummy munchie food and pizza.  Delivery until 3AM on weekdays & 4AM on weekends.  I'm hooked!"}
{"text":"I love that when I've been drinking, or am just too lazy to leave my house late at night I can order from here.  I use their mobile app and it works great. One time they forgot my ice cream but called me the next day to tell me,  and offered to bring it that night. I didn't call back or order for a while after that (not because of that), and they remembered to include my item from before without me saying anything. I thought that was pretty awesome."}
{"text":"Nighttime Nosh is the best!!!!  Ice cream, cereal, and pizza at 3am after a night of celebration?! Most genius idea to ever hit Tempe area!!!! Online, phone, and an app ordering.....they couldn't make it any easier to have munchies after everything closes!!!  Try them for yourself! You won't regret it!"}
{"text":"I used to love night time nosh but their dispatch workers are just too rude and organized. Love the perks of their service, but their business has gotten rather sloppy"}
{"text":"We love Nighttime Nosh! Everything you could need they bring right to your door, and the delivery men I've had are polite and easy to work with. People don't believe me when I say you can have wine delivered to your door, but hello, you can have wine delivered to your door. One of the best services around, one of many reasons I enjoy living in Tempe!"}
{"text":"The menu looks amazing I must say, but of course, the one time I go to try this place out and make an order, the website is having an error with taking my order. I am so upset and I really dont want to get up and go the store to go get all this stuff :("}
