{"text":"The service is knowledgeable and prompt. I ordered their (signature) massaman beef curry with coconut sticky rice and a Thai iced coffee. It was delicious and all the ingredients are fresh."}
{"text":"I too love Thai food, and this is by far my favorite Thai place. I live downtown and will travel almost an hour on the TTC to come here. Food is amazing. I personally don't eat seafood so my opinions are solely based on non-seafood items, however have heard from friends that the seafood too is fantastic.
The prices are pretty decent as well. There's lots of different dishes to pick from. I love their Basil noodles and their spicy Thai chicken (YUM). The spicy Thai chicken dish is amazing and loaded with meat! The noodles are great too. Nice and mild basil flavour with a TINY bit of a kick.

The restaurant itself has a cute ambiance, it over looks the lake and the lights are usually low for a more I don't want to say romantic feel but it surely does feel more homey and gives the effect of being the perfect place for a date. 

I could eat here EVERYDAY!!!

Appies are yummy too. A great variety of vegetarian and non-seafood options."}
{"text":"Been to Nimman many times and is one of the go-to Thai restaurants in the Mimico (South Etobicoke) area. Lunch specials are a great deal at just under $10 (depending on options) and served every day, including weekends. It includes a spring roll, salad and soup. The serving for the main dish itself is also a good portion, so you can't go hungry after a lunch special.

Haven't tried the delivery service, but only because home is a convoluted mess to find and get to for delivery. I've had my birthday the past couple of years catered from Nimman and it's a hit with the guests. If your group is 15 or less, just order a bunch of individual dishes for everyone to try out. For larger groups, they can do the trays of each dish instead.

Haven't had any issues with the service, and staff have always been courteous and meals are usually quickly prepared. Although last weekend the lunch did take much longer than usual for a party of four. Takeout meals are also usually prepared within 20 minutes of calling in.

The dine-in ambiance is casual and doesn't get too noisy (depending on groups of diners that are present). Views are either of the parking lot of the strip mall or the park/playground and swimming pool on the lake side. 

Parking can be limited, depending on the time of day or day of the week. The strip mall has a pet grooming store, laundromat and a couple of other restaurants, not to mention the residential apartments on the second floor. Although no actual bike racks in the plaza, there are some areas bikes can be chained to (railings or in the nearby park). Streetcar stop is right at the front of the strip mall (Lake Shore and Mimico intersection).

Dishes I've enjoyed here are: garlic chicken or pork, panang (peanut sauce) curry with chicken, and cashew nut chicken. Beer and wine are also served here.

Overall, Nimman is a consistently good Thai restaurant for dine-in or takeout."}
{"text":"I used to like this resto, but now I dont feel like ordering their food anymore. Lately the food is not as good as that when they just opened their business. And today, they changed the noodle in the pad see ew (soya noodle) that i ordered to the one that is usually used in making pad thai. Eventhough both noodles are made of rice ones, the width of the noodles are different. And I have never liked the narrow rice noodle in pad thai. Hence, i am so disappointed upon seeing the pad see ew that I ordered via phone arrived looking like pad thai with dark soya sauce. I had been their regular customer since they opened this resto. They should have the decency to at least call n tell me that they run out of the wide rice noodle instead of making one with pad thai noodle."}
{"text":"Place is a winner. We eat here quite regularly ... both take out and eat in.  Either way, the aesthetic presentation of the food is perfect as is the food itself.   I've been a patron of many Toronto Thai restaurants and this is my favourite and only partially because I live in Mimico.  

I LOVE that you can dine while enjoying a view of the Mimico Linear Park and waterfront.  Without exception the service is great, in fact exceptionally attentive.  I was sorry to read Lillians review, but I've never had that experience.  They're pretty good with their 20 minute wait time, but it is tremendously busy on weekends (its the best restaurant in Mimico)  so maybe that was the problem.  

If I had one comment it would be about the ginger tea.  I used to love Golden Thai's homemade ginger tea and I'd prefer that over Nimman's use of sachets. That aside, its worth the drive to Mimico so go and enjoy the food and treat yourself to a walk by the lake after."}
{"text":"Have been here more than a few times. This is my another go-to place for when I feel like Thai. I mostly get Thai basil noodles or the Padthai and it's always flavorful and perfect for my taste. My friends are all meat eaters and their favourite things off the menu are  fried rice, Padthai, and wonton soup. The staff is great and so is the customer service. They even deliver which normally comes in like 35 minutes although when you place the order they say it takes an hour to 45 minutes. 
Ambience is pretty good too. Weeknights are normally quiet but very relaxing if u dine in there. I definitely recommend this place."}
{"text":"Downgrading by 2 stars as was made wait for 55 mins over estimated time on a pick up order. This is the 2nd time it's happened. It was busy, but after spending $80 I would expect some gesture of goodwill since they admitted they lost my order after 2nd time checking up on it. Phone order 6.50pm, got food 8.10pm."}
{"text":"If I could post zero stars I would. The customer service is horrible, we ordered online and waited over an hour for the delivery. After two calls to the restaurant they acted as if they didn't even know our order even though the first time we called they did. My advice: don't bother ordering, the food won't make it to your place anyway."}
{"text":"Tried nimman for the first time,  ordered a large variety of food for the family. It was all quite good, about average compared to the other Thai restaurants in South Etobicoke but not as good as some of the more popular places downtown."}
{"text":"Had a great shrimp curry, loved it. Quick and pleasant service.  Will be going back for more."}
{"text":"Best friendly service. Ordered through JustEat and delivery people were always extremely polite and genuine without asking for tip. Food is exceptional and honest people. Best genuine Thai food in the GTA."}
{"text":"This is a review on Delivery service, as I've never dined in. 

I highly recommend Nimman appetizer platter vs. Seafood platter. It's perfect for two people to share chicken satay skewers, seafood fried dumplings, spring rolls and a fresh roll cut in 3 pieces. Comes with 3 dips, appropriate for each type. It's a must with every order and and with your favourite soup it will make a perfect lunch. 

Thai and Pineapple fried rice entrees are as great as in any Thai place: fragrant, sweet and fresh tasting, with just the right amount of stickiness. I appreciate that Nimman always uses fresh pineapple. 

Pad See-Ew is also a nice soya flat rice noodle dish that lovers of Chinese Ho Fun would appreciate. 

Pad Woon Sen would be my general recommendation for anyone tired of rice and wheat noodles. Clear bean noodle strings with veggies, egg and seafood may feel like a cheat meal but it isn't. Beef and Chicken are equally as great and the seafood option is generous. 

Panang is another dish that may sound heavy but it isn't. Not one with a palate for any sort of curry, I figured Peanut Curry didn't seem as overwhelming in flavour as any other kind. It's very good! It's rich in deep, roasted flavour but the taste is sweet and the texture is light, with just the right amount of fragrance from kaffir lime. I've only tried Beef but I think a vegetarian option would be a great choice because it's very filling as is, let alone with rice. 

Having Nimman twice a month for the past three months has been a consistently enjoyable experience. I'm excited to try other dishes and would consider entertaining my guests with Nimman in the future. 

Thank you :)"}
{"text":"The phud Thai was okay. I found it had way too much sauce. The sauce just overwhelmed all the other flavours and barely any cilantro was in it! Probably won't be going back here."}
{"text":"Pass on this place.  Poor customer service, poor delivery service.  Lady at restaurant called us liars.  They just lost a regular customer!  Get your act together, save yourself the frustration and order elsewhere!"}
{"text":"I was in Toronto visiting relatives and we didn't feel like going out to eat one night. So we ordered in from this place due to the good reviews. It certainly did not disappoint! The pad thai was flavorful and the noodles were cooked perfectly. The curries we ordered were really good as well (Red and Masaman). We also had some Spring rolls, which had a good amount of filling and were nice and crispy. 

Overall, the food came in a good time frame and we were very happy with our experience. Definitely worth a try when in the Etobicoke area!"}
{"text":"SO GOOD! I've ordered for pick up maybe 5 times now. The outside looks kinda sketchy but once you're inside it's very clean and pretty. I always get chicken pad Thai because I crave it all the time. About a year ago I went for a dinner with my family and I do remember everyone saying they enjoyed it. Seriously if you like pad Thai I totally recommend this place. It takes about 15 minutes for pickup and you can taste just how good it is. Wouldn't personally recommend the lunch special though, the regular pad Thai is only a couple dollars more and the salad & spring roll aren't anything exciting. Definite must try! A nice gem in mimico"}
{"text":"Ordered a seafood red curry and Thai basil noodle for lunch , it was delicious ! We had it delivered, food came quick and hot. Everyone should try this place out."}
{"text":"I swear I order from here on a weekly basis! food is always fast, fresh and super yummy. the Nimman platter for 2, spicy beef soup, tom yum, and pea see-ew are amongst my faves. a must try if you enjoy Thai food!"}
{"text":"Just ordered from here for the first time and I was not disappointed at all. Portions were filling and tasted fantastic. Definitely gunna order from here again."}
{"text":"I had wanted to try this place for a long time and finally got around to it a few days ago. I use to get my Thai food at Thai Spring Roll which is a bit closer to my house and when they closed I was at a loss. I had take out and ordered the appetizer platter for 2 which was very good. Loved the variety, everything was very tasty, I am a huge fan of fresh rolls and they were great! Spring rolls were nice and crispy and you can't go wrong with chicken satay! For mains I had the cashew nut chicken and the red curry chicken.....keeping it simple for the first go around. Both dishes were very flavourful with lots of chicken and vegetables. Although I ordered take out the restaurant to dine in was also quite cute. Definitely my new GO TO for Thai!!"}
{"text":"This is my neighbourhood go to when I don't feel like cooking. All the dishes are tasty, fresh, and thoughtfully presented. The service is great whether you dine in or take out. I highly recommend Nimman for a low key dinner, quick afternoon lunch, or delivery!!!"}
{"text":"I got take away from here with a bunch of people so I got to try a number of items. 
Nimman Spring Rolls, Green Mango Salad, Bikini Shrimp, Basil Fried Rice, and Green Curry. The spring rolls and bikini shrimp were nothing special and the mango salad was kind of lacking in mango flavour but the green curry was probably the best I've ever had and I will definitely order that again."}
{"text":"So good!  Best thai on the lakeshore strip, from Mimico to New Toronto!  Khao Soi, Massaman curry & Pad Thai are excellent!"}
{"text":"We tried this place for lunch.  I had the pad thai and my wife had curry.  Both came with hot and sour soup which was excellent and a spring roll.  The curry came with steamed rice.  Both meals were very good and the portions were large enough that I didn't stop for a burger somewhere on the way home, which I occasionally do.  The service was very good as well.

We'll definitely be back."}
{"text":"Wow what a fantastic experience....we had the seafood platter for two followed by a beautiful fresh papaya salad...the batter was light and crispy without the dreaded greasiness which often comes with such a deep fried choice. Then came the traditional pad thai served very creatively within a thin wrap of egg.....chicken massaman curry with coconut rice had a sauce of such balance and deliciousness that if I was alone I would have licked the plate....Im almost afraid to give away this secret as Im afraid that this small place wont have room for us once the secret gets out....the service was prompt and friendly and the place was very clean including the washrooms...."}
{"text":"I have visited this restaurant many times and while the food is amazing, the service is not!!!  Today, I was served soup in a broken bowl and was asked if I wanted another one, rather than apologizing and replacing it immediately. After waiting for 30+ minutes, the server came and asked while taking away our fork, if they could if they could get us anything else...(I guess they were trying to move us along,). We both answered  \"we'd like the food we ordered\". It was a little weird.."}
{"text":"My husband and I wanted to try thai restaurant in our neighbourhood so, we drove by and found this place.

I am a big fun of pad thai so I ordered the authentic pad thai with thai iced milk tea!
Their service was wonderful. I also enjoyed having the iced tea!
Unfortunately, this place is not good as other thai restaurant in Toronto because the rice noodle was a bit soggy and blend."}
{"text":"By far the best Thai food in the area ..top quality freshness and taste.  Also very hospitable owners very recommended"}
{"text":"Best Thai place in Etobicoke area, and we've tried them all!  Great quality Thai food. Will go back regularly and order on UberEats."}
{"text":"Food is mediocre. We requested in the uber app for the Thai fried rice and pad Thai to be extra spicy. Also some hot sauce on the side. Non of our order was spicy, didn't get hot sauce, didn't get cutleries. We DID get the food cold. DON'T order through delivery from Uber eats. We ordered on a Monday, food came and it and was cold. We live 1 km from the restaurant, the food arrived cold. 

Uber sent the food again. The nightmare begins.

1.) uber driver got lost. I was on the phone with this driver for appx 15 minutes as he didn't speak English. I thought Uber eats drivers know how to drive and locate buildings.

2.) uber driver refused to even bring the food to the door.

We went down to the lobby to meet the driver. The driver refused to come out of his car. He stuck his hand outside the window of his beat up 2001 Mazda 3. It was the most horrific experience ever. I grabbed the food from the driver with the hand outside his car window.

I guess this restaurant doesn't really care about customer service. Would never order from this restaurant again."}
{"text":"Awesome and delicious food. Have only had the vegetarian options and have only had take out. So my rating would be five stars if that was all they offered. Will save my next star for the dine in experience. 

I've had all of their curries, pad Thai, Tom yum soup and the spring rolls. Curries are all delicious, fave is Panang. Mmm. Peanuttty. Love the spring rolls as they are made fresh, not gross water logged freezer burnt ones. And the dipping sauce? Made from unicorn tears. So tasty! Garlicky and sweet and tangy. 

Their shakes are delicious, no extra sugars added so the flavour of the fruit comes through. Also love the online ordering. Cuz I hate talking on the phone! Delivery is prompt and food arrives hot and fresh. 

Keep it up Nimman!"}
{"text":"**3.5**

I could have given this place higher ratings had I not been to Mengrai Thai Restaurant. 
The food here is good but just nothing amazing. They do have a very long menu, for people who love options this is great. We started out with the share platter of appetizers and it was good. The quantity was enough for four people. There was two spring rolls, fried wontons, fresh wraps and two chicken satays. 

For the main course we had a basil lamb, the broth of which was really flavoursome but the lamb was overcooked. Next came the Massaman Chicken curry, it was a sweet pineapple coconut flavoured curry. Not bad but a bit too sweet for me. Mr. H called for the Choo Chee Salmon, trying to stay healthy and all, only to realize that it was fried. Needless to say he did not enjoy the fried salmon but our friend wiped the plate clean. So I guess that just depends on personal taste. I also had a Pina Colada and it was OK. Can't really blame them, I just got back from Cuba.

Nothing here really got me excited enough to want to come back but if I'm in the area maybe I'll give it a try."}
{"text":"Visited this restaurant based on yelp reviews. Ordered the special pad thai. Taste was ok but definitely on the sweet side. Had to ask our server for hot sauce. Portion was large. I ended up taking half of mine home. It comes with shrimp and chicken but found only 2 pieces of shrimp and very little chicken in the dish. Arrived around 6:00pm on Saturday night. Restaurant started to get busy as we were leaving. Service was fast but minimal. There are definitely better places to try before coming here."}
{"text":"This is an amazing Thai Restaurant.  My husband and I found this incredible place last year when our daughter started at Humber.  Retuned her Saturday and this place is just a good as we remember. All the sauces are great, very flavorful. The service was fast even though the restaurant was full. We will return again and again."}
{"text":"My favourite veggie pad thai in the city! Large portion and amazing flavour. I also love ordering their deep fried tofu appetizer. Big puffy pieces of delicious tofu with a tasty peanut sauce for dipping. Would recommend it to a friend looking for a place to get pad thai."}
{"text":"Excellent value and quality. Highly recommended!. The cashew chicken is awesome!"}
{"text":"This is the best Thai restaurant in Etobicoke, hands down. We had a friend visit from out of town and we needed a place to eat, and found Nimman on Yelp. From outside it doesn't look like much, but once you step inside you're instantly impressed. The staff are friendly and inviting. The spring rolls are  crispy and fresh, the Pad Thai, Crispy Cashew Chicken, and Massaman Curry were all delicious. Definitely a place worth a second trip!"}
{"text":"Excellent food, at very good prices! Their lunch specials are especially good, as they come with a full entree (the green curry is highly recommended), spring roll, soup and salad, and all for less then $10."}
{"text":"I ordered from here tonight and both my husband and I were very pleased with the meal.

Their online ordering system is extremely efficient and the food arrived hot and within an hour. The delivery man was extremely polite. 

We had:
Authentic pad Thai - 3.5/5 I thought it was a tad bland, my husband loved it. I guess it depends on your preference. This dish tasted great when mixed with other entrees. 

Green curry chicken - 4/5 this was medium spicey and had a very nice flavour. The chicken was cooked well. 

Spring rolls - 5/5 

Basil beef 4/5 - very tasty 

After the meal we both agreed we did not feel heavy or like we overrate. The food was very good quality and well prepared. I will definitely order from here again!"}
{"text":"The green curry was the bomb! Not to be missed. Price is accessible and modest. Well done. I'll go back."}
{"text":"Delicious Thai food,  within walking distance of my new place?  It's a dream come true!
 We tried the green curry (spicy, fresh and a little coconutty)  And the Hor Kai Pad Tai- which was tasty and refreshing compared to the usual overly salty pad tai dishes around. 
The service wad quick and friendly. Prices are very reasonable. 
We will definitely be going back to try more of the rather extensive menu. It seemed that a lot of the \"classics\" were listed, as well as some new and less common things."}
{"text":"Come here for Mother's Day dinner, food was awesome and really authentic Thai food. We ordered massaman curry, mango curry, garlic lamb, pad Thai Hor Kai, pad Thai Kob, seafood platter, we also got free monther's day dessert for all ladies and girls! The service was very good too, we will come back try different dishes!"}
{"text":"Came with a group of 15 late at night after a walk. They were closing in an hour, and one of the staff warned us that we'll have to order quickly because last call is in 20 minutes and restaurant is closing in less than an hour.

It's quite a large restaurant, as they have taken over two units. The washrooms are in the basement, and it's a long walk down a corridor to the other end. Can feel quite sketchy. 

Since it was late, the restaurant was mostly empty. The staff pushed some tables together so that everyone can sit together. We ended up staying past 10, and they didn't rush us out.

The menu is quite large. Rice dishes, noodle dishes, curry dishes, meat dishes, vegetable dishes, and so on. Interestingly enough, several of the most popular dishes on the menu used descriptions such as 

\"Number 1 Ranked to be World's Most Delicious foods by CNN\"
\"One of the famous Thai dishes in United States\"

The thai iced tea and thai iced coffee are quite a steal at $2.50 for a large cup. Would be nice if they didn't have so much ice though; perhaps that can be customized if you mentioned.

I ordered the Massaman curry with beef, and I would say it was quite good. Very light flavor, with a little heat. Some others said it was too bland or not spicy enough, but I thought it was pretty good for my tastebuds. One issue I had was the curry doesn't come with rice; you'll have to order it on the side."}
{"text":"Coming here for a late dinner on a weekday it was quiet with only a few tables taken but the space itself is larger. The parking lot is easy to miss as this restaurant is all the way at the back and even then there is limited parking. 

We ordered a Thai Iced Tea, Pad Thai Hor Kai, Massaman Curry, and a bowl of coconut rice. This meal complimented each other very well, the Iced Tea was delicious and refreshing. It tasted very authentic. The Pad Thai Hor Kai we ordered because it won awards and got positive feedback on the menu, it was a good dish; the difference in this is that it is served with an egg on top. It's a different take but unique and doesn't do the dish any harm. The best part of my meal was definitely the Massaman Curry though, I was shocked to hear it didn't come with rice; usually curry's come with rice and it's expected to instead of having to order an extra order of rice on the side. In any case, I didn't mind because this dish came through. It had the right amount of flavour and a nice curry texture that not every place can nail. It was very authentic Thai food. 

I'm never in this area so I likely won't be returning but I had seen them in BlogTO and decided to take my girl out for dinner here to try it out. There's lots of good food in Etobicoke and this definitely is up there."}
{"text":"I really like their veggie and chicken pad thai. Probably one of the best pad thai's I've had here in Toronto! Their chicken satay appy is really good too in addition to their mango and papaya salads."}
{"text":"Food is incredibly tasty and delivery through a 3rd party app seems to be more efficient than picking the order up. 

Ordered lunch, was told it'd be ready in 15-20 minutes. Showed up exactly the 20 minute mark and I'm sitting in the restaurant 10 minutes later still waiting for my lunch."}
{"text":"Delicious, inexpensive and friendly. It's great for sober family dining or drunken take-out. The Nimman platter gives a nice selection of appetizers. All their curries are flavourful and satisfying. I've not had anything disappointing here."}
{"text":"Good food, but the speed of the service ruined the overall experience for me. I dined in and waited an hour to get my meal, which was a simple beef dish. The waiters never apologized or offered any sympathy. Also when bringing food to our table it was all very staggered. Not sure why that was, but by the time my plate was delivered, some of my friends were already done eating their meals. Maybe we just went on a bad night or something but I certainly won't be going back or recommending this place to anyone."}
{"text":"What a lovely place! I sat with a lovely park view and delicous food. One of the few places that has lunch specials also on weekends. 

A generous soup, salad and spring roll to start. I had the BBQ salmon which had the best crispy skin. We ordered extra veggies (steamed) and got a variety of veggies. The rice was pretty bland but the spring roll sauce was excellent. 

Everything is freshly made, the service is superb, very attentive and I love the liter of water on the table too. WIll be back."}
{"text":"I shared the Nimman platter and got the sweet and sour chicken on sticky rice. The food was pretty good, but the service was really poor. We ordered at 6:00PM, received our appetizers at 6:35PM and then received our main courses at 7:05PM. Everything was brought at different times. The timing of the main course delivery was awful, they brought you the dish without the rice and let it sit there for 10 minutes before we got the rice to eat it on. No apologies or anything...wouldn't re-visit."}
{"text":"I LOVE Thai food. So when heading to a nearby Indian restaurant and I saw this place, plans changed and we ate here instead. The restaurant is tucked into the back of a small plaza but surprisingly seats quite a few patrons. The ambiance is simple but effective, with photographs of various Buddhist and Thai-inspired images. 

My hubby & I perused the extensive menu which had helpful pictures and star ratings for their most popular dishes. There are quite a few choices of appetizers like satay skewers and green mango or papaya or shrimp salads although we opted to forego the apps in order to try more main dishes. We ordered the pork Penang, a beautifully peanutty, slightly spicy curry dish served with green beans. I really enjoy the Penang curry at Thai Basil in Richmond Hill but this version at Nimman is an equally (if not more) delicious version IMO by nature of the sauce being less thick and having that refreshing kick that keeps you coming back for more. 

We also ordered the chicken with long song sauce, and crispy cashew chicken. Of the dishes we ordered, the long song chicken was just ok but was served over rice and came with a bit of Thai shrimp paste, which added a slight saltiness and slight tanginess that elevated the dish. 
My husband has long been trying to find a Toronto Thai restaurant that can replicate his favourite cashew chicken (\"H6\") from a popular Houston Thai place called Kanomwan. Most restaurants have fallen short of his memory of his beloved Kanomwan cashew chicken. The crispy cashew chicken at Nimman is prepared with thinly battered chicken pieces, some bell peppers, onions, thinly sliced carrots, orange slices, and of course, cashews. Although Nimman's version was not quite the thick barely-there sauce that my hubby recalls, it was very very tasty. The crispy chicken pieces add a lovely texture contrast. We are excited to come back here to try it again with a custom order for the chef to make the sauce a bit thicker. 

I'm not sure about other patrons who have had challenges with the service, but we found the wait staff to be very attentive and helpful, especially as far as discussing and suggesting how to custom order the crispy cashew chicken to make it closer to the way my hubby wants it.

Food pricing is reasonable. 3 main dishes and an extra bowl of rice came to ~$43. Although Mimico is a good 40 minute drive from where we live, we will definitely come back.

(3/100)"}
{"text":"Had some lunchtime delivery with impressive results.
Usually the first time I try any thai restaurant I feel an obligation to get chicken pad thai and spring rolls. I can admit the pad thai was a bit bland but once adding an entire container of hot sauce to it, was enjoyable. Spring rolls were quite tasty and an order is $5.95 and comes with 4 decent sized rolls and dipping sauce.
I'd still probably be sitting on a 3 star review if it was based on that alone... However everyone else was super impressed with their selections (Garlic Chicken, Spicy Chicken, and a Spicy Shrimp Noodle dish of sorts), and one person had the Ginger Salmon which he said was \"the best salmon he's probably ever had\" and \"very tender\". So given there were no unhappy diners and I looked like a champ for suggesting this place, 4 stars it is!

Then throw in that I ordered about an hour and a half in advance and asked them to deliver for 1:15pm. Sure enough, literally 1:15 on the dot he was calling at our door and was quite friendly on the goods for payment exchange. I don't have many comparison points for thai food in Etobicoke, but this place makes a fair decision to go with if that's what you're looking for."}
{"text":"Hot & Sour soup had soggy tofu cubes. But this was complementary along with a spring roll and a bit of salad.

Ordered the Chicken Thai Basil Noodles. Have had better, but probably best in the area"}
{"text":"Pad thai was definitely one of the best I've tried.
Veggie Thai Rice was alright. It had a good amount of veggies, however, it felt extremely oily. 
The portions were not bad, and the service was great. 
I would for sure go back for Pad Thai though!"}
{"text":"Was s good experience.  Late arrival it we were greeted with a smile
Good was fresh and tasty. Goid flavour and quite.  Reccomended !"}
{"text":"I felt adventurous to try a new place for my birthday and I was very happy with my choice.  All of the dishes were delicious - from soups and appetizers to curry and pad Thai.  It's one of the best pad Thais I've tried outside of Thailand.  Also beautiful presentation - wrapping pad Thai in a thin egg/crepe layer.

My only complaint would be the amount and size of tofu pieces in the tofu and veggie curry - too small.  if you're craving tofu, this dish will not be enough :)"}
{"text":"Never tried green curry before, but this was out of my expectations, I just loved it, creamy coconut with the right touch of heat. I had it with chicken and steamed rice through uber eats, it was delivered hot and it's really fresh food. Fair portion and price was good. Curry was $9.95 plus $1 for the chicken, $ 1.95 for steamed jasmine rice my total was $14.58 after tax. I strongly recommend it and definitely would eat again from this place."}
{"text":"First time here. The restaurant itself was pretty dim.  I could not read the menu too clearly without a bit if extra light.  As well they had a note on the front page of the menu stating that because of the minimum wage increase of 30% the prices on the menu will be increased by 15% on your bill.  This made is a little confusing and I believe they should have just reprinted the menu with the proper prices.  

The staff were pretty friendly and helpful when asked what their favourite dish was and what they would suggest.

We had ordered the spring rolls to start and those came out nice and hot. We ordered the authentic pad Thai, thai grilled beef, mango curry and coconut rice...all were full of flavour and very tasty but it came out all at room temperature, none of the dishes were piping hot.

The restaurant was quite full so it seemed like a popular venue."}
{"text":"I usually order delivery from here, and picked up take out a couple times. The food is ready really quickly, and the delivery is fast also.

The quality of the food is outstanding, and the portions are reasonable.

I always get the calamari, which is to die for. And the mango salad is also another hit.

All in all, a wonderful thai place!"}
{"text":"I'd suggest checking out the lunch menu, affordable and you will be full (some soup, salad, entrée). Very fresh and great taste, I can see why it made best of Toronto list."}
{"text":"Always amazing food, fast, great service, consistently delicious.  Try the Red curry!"}
{"text":"Had a nice night here recently with a friend...it is close to my condo building. I wished the food was a bit spicier, but then again I could have asked for that which I didn't. Service was prompt and pleasant..."}
{"text":"New rolls are the best.  Especially the coriander sauce.  Can't get enough of them.  I always order extra sauce and eat it with everything."}
{"text":"Been there a number of times.  Consistently good on both service and food.  I find that green mango boys has a better taste though.  

Price is decent and is a nice atmosphere. 
The last time we went then pad sew ee was a little too sweet.  3 dishes and two Thai iced teas was about $50 after taxes and tip"}
{"text":"Cute restaurant with a nice atmosphere. The food is delicious, try the pad Thai that comes wrapped in a delicious edible package."}
{"text":"Nimman has some lovely food, light with that fresh taste of Thai. Service is good and the space is quite large. Food is very good but quite expensive. We ordered delivery one night for two mains and an app. Came to just under 50 bucks without tip.
We were organizing a party for a friend they wanted $42 per person.We ended up using a Zagat rated restaurant in the Village, amazing food (I need to remember the name), we ordered for 10 people and it came out at $20 per person, that's a pretty significant difference. Still very good food but not really take out or delivery prices."}
{"text":"Dear Nimman Thai you just lost loyal customers ! For a year now we order typically once maybe twice a week from you ( yes we don't like cooking ) and loved your chicken fresh rolls . Now we find out you only offer tofu or shrimp ... neither of which we like - yet there are many chicken dishes on the menu surely you can still use that in your rolls ? When we ask we are told \"no you have two options now pick one \" umm.... not good . Now we have to find a new place e to get our Thai rolls from . Really - how hard is it to put chicken in the rolls ?"}
{"text":"An excellent local Thai restaurant.  Reasonably priced, and great portion sizes.  So far, my favourite dish is the Green Curry; absolutely delicious!  I would also recommend the Cashew Chicken and the fresh rolls."}
{"text":"Came here looking for another Thai restaurant, other than the usual one I always go to. This place was a bit tucked away but spacious inside. We ordered a few dishes but the taste was not as authentic as other Thai places we have been to before. Service was good, friendly but the taste we were looking for was not there."}
{"text":"Food 3 stars.  Service and ambiance +1 star.  Overall 4 stars.

Hidden in a strip mall in Etobicoke is a good Thai restaurant.  The menu is extensive.  I like that there are many traditional curries, plus some curries with contemporary twists, such as Pumpkin Curry.  There is a good selection of local and imported beers.

We ordered one appetitizer and 3 entrees.  The Nimman Platter appetizer offered a good combination of skewers, fresh rolls, spring rolls and fried dumplings.  I liked the fried dumplings the most.  They tasted so rich.  The green curry tasted decent and authentic.  The Thai Spicy Seafood was mildly spicy.  The shrimps tasted fresh.  The scallops and squids tasted stale.  Based on this dish, for people who want to order a seafood dish, I would suggest them to stick to a shrimp dish.  The Tamarind Beef was a bit tough to chew through.  The beef was deep fried first, then stirred fried with vegetables.  All the entrees were saucy and went well with plain Jasmine rice. 

The services and ambiance really stood out.  The decor was pleasant, simple and tasteful.  The wait staffs were well mannered and effective.  It was a treat to be waited by them."}
{"text":"Wow! I was pleasantly surprised with Nimman. BF and I wanted to order take out on a Sat night. Ordering was easy with their website. Delivery was fast and most importantly, food was delicious!!! I ordered the pad Thai, my boyfriend ordered the grilled chicken. The food came fresh, neatly packed in black plastic take away containers. We also shared the appies platter for two, which was also really good. Portions were big so we had enough food for lunch the next day. Will definitely be ordering from this place again!"}
{"text":"I've been here a couple of times and the Thai dishes are always consistent! I highly recommend the curries (Panang being my fav) and can't go wrong with the Pad Thai.

Recently, I've this has been added to the menu but unclear of what the original prices are. So be careful when ordering as it doesn't specifically indicate how much each item will be, just an average increase of 15%, which if you check the bill is a little more than that."}
{"text":"We ordered via justeat and the delivery arrived half an hour later than the estimated time on a normal weather day. In addition, the Thai Basil Noodle was tiny in portion (1/3 of the box was raw bean sprouts and the rest of the box was hardly full). It almost looked like someone's leftovers. I am 110lb and I was hardly full. The Thai green curry was fine though. Overall, the food was tasty but the service and value for money needs work."}
{"text":"Good food and good service. Some takeout dishes get dry quick which was a bit disappointing.  Don't try the papaya salad....  it left some awful flavours in my mouth.  I usually stick with the pad thai hor kai with extra shrimp and chicken :)"}
{"text":"I know a lot of Yelpers seem to like this place but, truthfully, I don't think it's all of that.

Earlier in the summer we finally decided to try it so we ordered take-out from the lunch special menu.

I decided to go with Pad Thai (with chicken) since they note on their website that it was voted \"The Top 10 Best Pad Thai in Toronto\" by blogTO.  I asked for them to prepare the Pad Thai super spicy and my husband's green curry (with chicken) just regular.  The lunch specials come with soup, salad and a spring roll and the total was like $20.

The verdict:  hot and sour soup tasted like it was prepared in bulk; the spring roll was tiny and nothing to write home about; the salad was a few leaves of torn up head lettuce; Pad Thai was, unfortunately, a huge disappointment but the green curry was the star of the show.

I suspect that, in error, they made my husband's green curry super spicy and my Pad Thai super bland.  For the Pad Thai, the integrity of the rice noodles was lost because it was overcooked, they used chicken breast and sliced it nice and thin but there was no seasoning - I had to add a lot of salt.  It really needed sauce, cilantro, some lime, etc.  It tasted like it wasn't made-to-order but rather prepared in masses for the lunch special - a lot like food court style.  Anyway, again with the green curry, it was absolutely delicious; I've never tasted anything quite like that.  I usually don't order green curry because I find a lot of restaurants make it kind of sweet but this was so well balanced with different elements of flavour in every bite. Also, the rice was cooked to perfection.

I've also had the massaman chicken lunch special which, instead of the potatoes being in the dish, was served on mashed potatoes which I did not care for.  Curry was very, very bland even though I asked for it spicy.

If you're from the neighbourhood, you'll know the plaza it is located in - not the poshest but the restaurant itself is very nice inside.  It's clean, nice music was playing, smelled great - very inviting."}
{"text":"We ordered a few dishes on NYE from here. The food was authentic and delicious. All my friends enjoyed their dishes, along with the coconut rice. We ordered the seafood platter, green curry, panang curry, and khao soi, with mango sticky rice. All the dishes were really well liked and savoured. 

The only downside was the wait time, which isn't too surprising given New Year's Eve. The prices are a bit on the higher side ($13-16) given the dishes don't come with a side of rice but the portion sizes make up for that. Will definitely order from here again, and maybe try their lunch special menu this time!"}
{"text":"Ordered from here the night we moved into the area and food was excellent. The price was a bit high but we ordered a lot of stuff. Overall no complaints and they were much faster then what they estimated on the phone for delivery which is always nice."}
{"text":"Snagged some takeout to give this place a try. The restaurant itself is very tastefully decorated and visually appealing. We ordered fresh rolls, massaman,  Pad Thai, Tom yum soup and wonton. All of the food was superb. All takeout containers were very full, portions were great. They even gave us a few shrimp rolls on the house which we thoroughly enjoyed. I will definitely be recommending this place to friends and look forward to enjoying the food again."}
{"text":"Pretty tasty authentic thai food. I usually order the authentic pad thai. It comes with chicken and shrimp, but I usually just get it with shrimp and ask to replace it with extra shrimp. Substituting is not their forte. It's either you get the chicken and shrimp, or just shrimp, and expect less on your plate.

I asked for medium spice and that made the dish more interesting.  I loved the presentation because it comes in this dome like fried egg, that's stuffed with the pad Thai, and when you dive into it with your fork and spoon, that's right a spoon, no knife, you get this delicious aroma of thai spices and heat. 

To get to the washroom, you'll need a map. You have to go down a steep staircase, that takes you down a very long hallway. I would have felt more comfortable, had they put more lighting in the hallway.

Overall, it was good.  If I'm in that neighborhood again, I would come back."}
{"text":"Large location in small plaza, food was decent, we had many servers come to us every 5mins (a little excessive), we thought maybe the kitchen was closing and were eager to get all the orders in but we asked and that wasn't true. We were still waiting on our 4th guest and ordered/ate appetizers yet felt bombarded as many different servers kept coming to ask us to order. Maybe too much of a good thing? Then one of our waitress got our order wrong for our smoothie and was very apologetic but didn't offer to replace or reimburse us.

Other than that the prices have gone up 15% due to the minimum wage increase so the prices were quite expensive. 

Food tasted great, glass noodles didn't have the freshest seafood and tofu massaman curry were mostly vegetables and very little tofu."}
{"text":"I went here last week while visiting friends in the west end. The menu was extensive and the food was quite good.  If I was just rating on food I would give it 4 stars.

The issue was the service. Our waitress seemed to have trouble understanding us, and repeatedly asked if we were ready to order (even when only 2 out of 4 of us arrived and said we were waiting for friends). Then once our food had arrived, the waitress completely ignored us, even when we tried to make eye contact. She didn't ask about dessert or coffee, and in fact didn't clear our plates for our entire visit. We had to go to the counter and ask the only other person we saw for our bills. He was friendly enough, but I can't recall the last time I've been to a restaurant where we couldn't even get our plates cleared. Someone needs to do a little training on how to serve customers in a sit-down restaurant. There were other patrons in the restaurant but I didn't really notice if they got ignored like we were."}
{"text":"Excellent Cashew Chicken which arrived within 15 minutes or what seemed like 15 minutes as we were having a good time. 

Greeny Curry also looked quite delicious, although I did not try. Guest did say it was great. 

Pad Thai was a good call as well. 

I would recommend to anyone looking for some flavour in their meal."}
{"text":"I came here on a Saturday afternoon for lunch and I was pleasantly surprised by how delicious the food was, and how lovely the service was. 

The value for money is definitely there! Included in their lunch special, you receive a large serving of your main meal, as well as a small soup, spring roll, and salad as a starter.

I would definitely reccomended this place for great Thai food in Etobicoke"}
{"text":"So I have gotten delivery from this place dozens of times over the past couple of years and have never been disappointed by the food or portion size.  Went to the actual restaurant a week or so ago, and was pleasantly surprised that the food was just as good and the servers were extremely friendly.  The place was clean and service was relatively quick.  Would recommend this place to anyone who loves Thai on the west end of town."}
{"text":"This proves food is pretty legit and Thai authentic! Their sticky rice is amazing and to die for. Green curry equally on par with the sticky rice! Overall we had take out from them and ordered over 5 dish to which all of them were absolutely delicious. 

I'd definitely order from them again, and I'd also be down to have a sit in meal also!"}
{"text":"I have ordered take out/delivery from this place a few times.  
The portions are decently large and really tasty.  I got the pad thai, really delicious - there is none of that bad ketchup taste.

I usually ordered from just eat and then noticed that ordering from their website directly was cheaper.  (it was a monthly promotion) but I have a feeling that it will be back."}
{"text":"3.5* is about right.  Good food, especially for the area, but not The Best Thai that I've ever had.  

The Good:
-  there's parking!  It's in the same plaza as Maurya East Indian Roti
-  sauces for the various dishes
-  Pad Thai Hor Kai (authentic pad thai) presented wrapped in a thin egg crepe.  I haven't seen this on any other menu before.  Flavour was good, not too sweet/sour, didn't taste any ketchup which is a good sign!

The NI:
-  We ordered the Nimman Platter.  I see now online that it's meant for 2ppl, but either I overlooked it or it didn't state on the restaurant menu.  We were 3ppl, so it was awkward to share amongst the 3 of us.  We had to break spring rolls in half, partially eat chicken skewers, etc.
-  veg in Thai Spicy Beef were pretty close to raw.  Could've been stir fried a bit longer
-  noodles in Pad Thai Hor Kai were a bit undercooked
-  Nimman Long Song, one of the few dishes that came with rice, wasn't hot enough
-  wait time in between apps platter and mains was quite a while, like 15-20mins.  Seemed like there were a lot of takeout/delivery orders, but patrons who dine-in need to be looked after as well.  I noticed that a table who arrived AFTER we did, got their food before us

Portions were just right, no one took home leftovers.  So it's NOT huge portions by any means."}
{"text":"I absolutely love this place. Great Thai food and great atmosphere. I ordered the Basil noodles and panang curry and it went really well together."}
{"text":"We went for lunch a few days ago.  While it wasn't bad, it wasn't as good as our previous visits.  The food was alright but it just lacked flavour.  The service was good and the free parking is always a bonus."}
{"text":"I've ordered from her quite a few times, and I have never been let down.  The 'authentic pad Thai' is super delicious, and I just had the 'pumpkin curry with shrimp' which was so so lush, and had twice as much shrimp as I expected!

Delivery is always fast, and food is always fresh.

It's not the cheapest around, but you're paying for quality.

I can't speak to how 'authentic' the food is, but I can speak to how delicious it is :)"}
{"text":"Great staff, service and food, especially since it's a hard to find Thai food in the area. 

Started off the meal with the Thai Iced Tea which was super sweet and creamy - a bit too much for my liking so I let the ice melt a bit before finishing it. The Pad Thai is pretty darn good, not the best I've had but definitely not the worst. The thing that makes this restaurant so great is the large portions at such an affordable price, using the leftovers for lunch the next day.

This restaurant is pretty big but parking is limited - something to keep in mind if you're a large crowd."}
{"text":"Wow.. very good food. I got the chicken pad thai with extra sauce, cashew chicken and veggie rolls and crispy rolls. All were very tasty.  I would definitely order from them again. I ordered the banana milkshake and I got to taste a sip of it (before it fell to the floor) I was a bit pissed but meh.. they are really good"}
{"text":"been there twice now.  First time was very close to closing time and left not so great flavours in my mouth.  The peanut sauce was cold and clumpy, the pad Thai was just flat in flavour which seems hard to do.  Second time we went in the heart of dinner hours on a Saturday and reluctantly we waited for a table as I wanted to give it another try.  Success!  Flavours were great.  I had the house special pad Thai which replaces noodles with wonton skins that are deep friend thin and crispy.  Same flavours as what you want but with a twist.  I enjoyed it.  Not the cheapest of Thai places, but I actually felt is was a good value.  Their coconut rice is flavourful light a fluffy and the peanut dipping sauce was very delicious this time around.  Happy to report the first time was not the norm it seems."}
{"text":"I had dinner here which consisted of green mango salad, green curry chicken and green tea.

The location itself is not the greatest, it's in a tiny plaza that is off-set from the road (I drove past it the first time). Parking is limited and crammed as there are other businesses in this tiny plaza.

The food was hot and tasty - no complaints here.  The green curry chicken was plentiful with lots of chicken and veggies. Pricing is average, about $11 for chicken curry.  The staff was very friendly and did try to be helpful. It's a small environment, with maybe 8 tables.  They don't have a bar but do have some bottled beer.

Overall, pretty good experience."}
{"text":"really good food and very friendly service.  We ordered the spring rolls, mango salad, two curries w/rice and dessert, everything tasted great! 

It is also spacious and a nice family dining restaurant.

We will be back for more!"}
{"text":"While the food here is good, the take out service is awful. Every time we order, we are told it will be 20 minutes, and it turns out being over an hour. The last time we ordered, I reached the restaurant, and the server claimed I never called and they have no record of my order. I won't order from here again, unless I want to eat in."}
{"text":"One of the finest Thai food. The staff is very generous and humble. New place for the Thai food for us.. :) .. would love to come again with more friends."}
{"text":"Based on my experience, the food is somehow closer I authentic Thai food. Everything I tried tasted good but I feel that the chef kind hold back on the ingredients. Thai food us known for the bold sweet, sour, and spicy. Next time I need to tell them that I ant to taste the food I ate in bangkok. Ir has great potential to be my fave eat"}
{"text":"I never bother going online to give positive reviews, but I was so happily surprised by our takeout tonight I felt compelled. First, the woman who took my order was polite, helpful, articulate and friendly. The estimated time of arrival was accurate and when the food arrived everything was what we ordered. Now to the food. Honestly- I have traveled in Thailand and the curry, beef salad and mango salad we had rivalled my favourite places there."}
{"text":"Five stars because:
We were a big group and called ahead.  Table was ready upon arrival.  Food was delicious. Consistent taste with other Thai restaurants we've been to.  Requested spicy levels were honored.  All dishes arrived at once and were warm.  Servers were attentive. Overall worthy of full marks."}
{"text":"A large group of us came to this restaurant at the end of the evening just before they closed.  There were enough seats for all of us and the staff started taking our orders pretty quickly.  The food arrived at a decent time.  For the rest of the night we were left alone to our food.  
The food itself was ok.  I ordered Massaman with shrimps for $13.95.  A bowl of rice is not included.  Frankly i don't understand how a soupy curry dish does not come with rice.  The flavour is ok albeit a bit bland.  It's an ok experience for me."}
{"text":"My husband I chose this spot for lunch while shopping by grabbing the first Thai restaurant that Siri found. Great choice Siri!! The atmosphere is light and casual and the food was terrific! We had the spring rolls and deep fried dumplings to start and they were served promptly, well plated and hot!! The flavour did not disappoint. We then chose the Thai basil noodles with shrimp and the crispy cashew chicken both of which exceeded our expectations. Each dish was beautifully plated, well portioned, and packed with flavour. We will definitely come back!"}
{"text":"Ordered the Uber eat and the order went through smoothly. 
So far the best Pad Thai I've ever had!"}
{"text":"We were there for the 8.95 lunch special expecting a decent at best meal but were pleasantly surprised! The accompanying soup, roll and salad were top notch. The service was pleasant and timely. The basil noodle dish was exquisite. I'm generally not a fan of thai food at all but I'll definitely keep coming back to this place."}
