{"text":"For an AYCE lunch, Nine Up Sushi is just ok. Note that they also have a regular menu.   I was excited about visiting Nine Up because I had never been to a conveyor belt sushi before. I was a tad disapointed. It seemed to be the same few pieces of sushi going around and around on the conveyor; this might have been because most people just order the items they want from the menu so they didn't have a need to put much on the conveyor belt.   It was $12.99 for ayce lunch. The menu is OK. I noticed that it didn't have any sashimi options, but they had plenty of vegetarian options. Their dessert was limited to ice cream, mango yogurt and deep fried banana (which was delicious by the way).   The service is ok. The food came relatively quick and the waitresses were quick to refill your water.   The decor is OK. Again nothing special about it. There is plenty of free parking since it is located in a huge plaza.   The menu states that there is a $1 charge for each piece of uneaten sushi and there is a 1.5 hr seating limit.   I don't know if I will be visiting again, because I have been to AYCE places that are a lot better, both in terms of food and decor."}
{"text":"I love food, i really do. But i do not like sushi from this place.  The service is slow, the design of the place is small, you have to wait for seats and the conveyer belt is useless. We waited 40 minutes for the FIRST FEW orders to come. Most of our orders didn't come. They also ran out of octopus balls and green tea ice cream. The food was made poorly and so was the the hand roll. I do not recommend this place to anyone."}
{"text":"This area in Midland/Finch plaza is newly renovated area with lots of restaurant choices now, which is a good thing in Scarborough. We decided to give this place a try. They had their promo of $15.99 ayce with no grill items and sashimi, but if you wanted that option you pay $19.99 pp. We opted for the $20 special.  First thing to start off, I like the concept of the conveyor belt passing you the food you ordered, but these are small plate items.  Their special for that day was 'Sea Bass' grilled, and I've tasted this fish, and it takes like grouper.  Secondly, whenever we ordered whatever stuff we wrote on the paper, the tendency is something is forgotten and never arrived. The service style is they are cleaning more tables than serving guests that want to order food.  Thirdly, sadly here was the WORST spider roll I have ever digested in my life...They used very cheap soft shell crab...And let's say there was no crab!!! It was just really dried crunchy shells!!! We tried a piece and ditched it after.  Some highlights of the ayce is their sashimi is alright, and their capelin (almost like anchovies but bigger fish like minnow) deep fried with eggs inside, was not too bad. Their scallop roll was alright. I think this place has already hit the ceiling on potential of how good they can be....So I would pass on coming here to eat."}
{"text":"This sushi restaurant is probably one of the worst I've been to. Service is terribly slow. The servers seem to not have enough time to get away from you.   The rough estimated time for food to arrive with each order is 30-40minutes, not even miso soup. And sometimes 10-15 minute s between esch dish. Quality of food is bearable. No food served at restaurants should be just bearable.   The conveyer belt... conveys garbage around in circles. While you wait for your food.. I am currently sitting in this restaurant writing this review as I wait for the food to come.  Edit: we had to bring the order to the front counter and I had to also wait a while to pay the bill. They maybe under staffed."}
{"text":"Went here once for a A la carte unagi dish once and it was pretty good since it also came with complimentary miso soup, salad & mango shot desert.  Decided to go again for All you can eat lunch: BIG MISTAKE.  -The rice used in nigiri sushi was WARM and had way too much rice vinegar with no sugar so it was like eating a mouth full of sour rice.  -The rice used in maki rolls was NOT SEASONED AT ALL so there was no hint of sweet/sour to contrast the soy sauce.  -Our first cup of tea was never refilled and they did not leave a teapot on our table, although we could've asked for refills, I think they just want you to order soda instead.  -Unless specified, they only give you ONE piece of everything except for the cheap dishes or maki rolls which come in huge servings of 8 pieces. Example: as a party of 2, we got served ONE mackeral sushi, unagi sushi, shrimp tempura but got served FOUR gyoza. Every other AYCE sushi place I've been to will automatically serve at least once piece per customer at the table.  -After the first round of orders get served, they ignore or delay your subsequent orders. We went on a Saturday around 2pm so the restaurant was barely half full. They just didn't care about the AYCE customers and kept busy serving the al la carte people from what I observed. We waited a good 30mins for the last 2 Teriyaki/tempura dishes to be served but got fed up and just ordered ice cream then left.  Good points: -Soda is free and cold, most other places would've charged extra.  -The teriyaki/tempura/other cooked dishes were done relatively well but I've had better.  One of the worst AYCE sushi experiences I've had overall and everything looked so promising when I went for al-la carte before."}
{"text":"This is the first time I ate here. After this experience, i would not recommend this place. Went beacuse of the promotion (13.99/week and 15.99/weekend b/c anniversary or sth), but we end up eating the 19.99 all you can eat.  The food: sushi is normal (not good not bad), sashimi seems not fresh enough but okay, we all like their teriyaki food pretty much, the fried food is good as well, dessert: not the mango yogurt it tastes really wired to me (matsuda's is way better) The inside of the store looks nice. The conveyer belt only had two plates of sushi the whole time we were there. But the conveyer belt is their selling point. We ate for an unusually long time(2 and a half hour) because in the middle we were just waiting for our order for about half an hour.  After we asked where are food is the waitress just said that she will check and asked the kitchen. But the food did not come!!  So we just sat there and wait with nothing to eat for 15 minutes AGAIN.  Then we asked the waitress for the SECOND TIME about our food and she told us to re-order everything becuz the kitchen might missed out our order.Isnt that ridiculous?!?! Most importantly, the service is very BAD. Actually the attitude of the waitress is not bad but it takes forever to get the server to come.  If i want water for 10 mins later, i think that i have to hand up for 10 mins for them to see me or come to serve me.  It is not busy when we were there but it was just rediculously hard to get the waitress here.  In addition, she did not even serve us water when we first arrived. This should be the first thing to do when customers arrive. We  ended up asking for water ourselves.  We were planning to give less tips due to their really bad service, but they already added the tips to the bill already(which i really dont like) so we cant do anything with it. It was the first time that I am not full in an AYCE place and the LONGEST dining time ever. I was really mad about the service. My conclusion is, although the food was okay but because of the horrible service and slow speed, we will not go back again! p.s: this is the first time i ever write a review b/c they really made me mad."}
{"text":"My friends and I decided to try Nine Up Sushi for dinner. The food is served on the conveyor belt and the colour of the place it is served on determines the price of the dish.   The food was pretty good. We ordered shrimp tempura and some sushi off the menu but the majority of the food we ate was off the conveyor belt. Sometimes you have to watch for the dishes to make sure they haven't been going around for a while. I remember there were two dishes or so that were there when we arrived and it was never sold (one of them even had a sign that said \"fresh\" on it even though it clearly isn't fresh).   We also ordered dessert. I had a creme brulee (not that great, then again, i am extremely picky) and my friend had a fruit crepe, which was pretty good.  The total between all three of us was around $52, which wasn't too bad, but we aren't really fans of sashimi and salmon sushi or the more pricey dishes so it was good for us.   I think if you are a really big fan of salmon sushi, sashimi, and the more expensive items, you need to watch how many you end up eating/ordering/taking off the belt because it can get quite pricey. If you mainly go to sushi for the more expensive items and you're a big eater, you might wanna consider going to an all you can eat, but overall, the food was good."}
{"text":"Worst experience here ever. I came to Nine Up, extremely excited about the sushi on the conveyor belt. Service was ridiculously slow and most of our orders were forgotten. We sat there for a good two hours, and left on an empty stomach. The chef happened to have a cold, and my party witnessed him sneezing while preparing the food. Gross. Two of the eight in the party got food poisoning.   The quality of the food was poor. Servers took forever to bring drinks/napkins and whatever else we requested. We actually grew very frustrated with this establishment and  spoke to the manager who merely shrugged. Ridiculous. I would never go back there or recommend this place to anyone."}
{"text":"I went back to Nine Up Sushi last weekend and got take out for one of their lunch specials, not AYCE. I got one of the sushi sets with tempura shrimp & vegetables. The sushi was edible and entirely average, and the wait was reasonable (the lady quoted us 15mins but it was more like 10mins). So for lunch specials I'll say that it's passable, but not so much for AYCE."}
{"text":"Service is kind of lacking, and they don't even use the conveyor belts when it's supposed to be a conveyor belt sushi place. The sushi tasted really good though. It's one of the cheapest ayce places and was definitely worth the price"}
{"text":"I tried this place yesterday after all the reviews and it was GROSS!!  Let me just say the food was substandard and mediocre.  Service was horrible.  It's true what other ppl say about the servers not coming back for tea or even for repeat orders.  The sashimi was cut so small that 10 pieces = 2 pieces.  Save your $ and go elsewhere"}
{"text":"This restaurant is not my favourite AYCE sushi restaurant by far. It probably is my 4th or 5th option of AYCE sushi in Toronto. I usually go during lunch and get the AYCE option which is around $15 dollars. It's quite expensive and the food quality there isn't great. The servers don't look very happy to be there which is fine, but they often forget things that I've ordered. I always have to remind them to bring food that I ordered. The servers just are not up to par.   The conveyor belt isn't very impressive either. Do not go here if you're looking for a nice conveyor belt sushi experience because it's not very authentic. However, if it's close to home and you're just really craving sushi, nine-up is fine. I wouldn't go there for dinner because it's really not worth it."}
{"text":"went with a friend for lunch during a weekday and ordered from the lunch special menu.  I ordered:  - Combination Box A (6pcs Sashimi, 5pcs Sushi, 6pcs California Roll) It came with miso soup and salad as a starter. Both were of regular-sized proportions.  The sashimi (Salmon, Tuna) was fresh and very smooth. On the other hand, the sushi used warm rice - which slightly bothered me because it became a mixture of the cool piece of fish on the top and warm rice underneath.  Overall, I was satisfied with the food and I would go back to try the AYCE and the conveyor belt sushi."}
{"text":"I heard this place is pretty new and they had the first scarborough conveyor belt sushi, so I decided to give it a try. First of all, the place is poorly designed. Their isn't much atmosphere in this place due to its design, how small the place is, and their isn't much people that go to this place so the conveyor belt has poor sushi and sashimi. The food was just average I have tried many better place that has better sushi and sashimi. Actually I find some all you can eat sushi place better than this place due to this price. You could get sushi for 1.5-2.5 and sashimi for 3.5. They rarely put anything higher priced than this on the conveyor belt. Overall, I prefer eating sushi and sashimi downtown. I would not recommend this place."}
{"text":"Ever since this new plaza opened at Finch and Midland, I really wanted to try this place out. It is unfortunate that this new plaza is brimmed with AYCE sushi and bubble tea places that I wanted to go here.   I went to this place not knowing it was a rotating AYCE sushi place and it was worth it! It was rather a surprise when I first came in not knowing the place would be rotating sushi but it was somewhat an awkward moment when I was seated on those stools and was greeted by sushi coming by as I scratch my head.  The place wasn't that packed late at night and the service was slow considering there were two servers. However, they are quite accommodating and helpful - telling me that those cartoon characters represent other people's orders and since I was sitting near the snow white picture, my order would be placed within it. It was rather confusing but they also say that the orders that aren't with the cartoon characters are free to take.   However this was my sudden downfall as to other AYCE places, I often pick too much items and sometimes eat too much. And considering you could snatch any sushi of the conveyor belt (without the signs), ordering too much and that does not mix and I left bloated and full.   I ordered a lot of items; the sashimi on ice which wasn't that good and three, six rolls of sushi that I forgot what they called. Although, the quality of the sushi was not that good. The rice was loose and was mushy and warm and all the rolls lacked some flavour. Even the ones on the conveyor belt was decent and it really made up for it. I also ordered the ice tea which was the one who really saved me from getting nauseous after eating too much.   For the first AYCE conveyor belt sushi place in Scarborough, this place was quite a disappointing experience. The service was slow yet accommodating and the presentation of the sushi and quality was mediocre at best. For $20 after tax for an adult, it was a rip off plus items like sashimi and other sushi off the menu adds to the bill so watch out!"}
{"text":"My family came here tonight to check out the conveyor belt sushi. Unfortunately, my grandma isn't into high seats, so we ended up at a table instead for AYCE sushi.   I found the service to be very friendly, accommodating and polite. The food was okay. The rice didn't seem right. My brother thought that maybe it wasn't sushi rice, I thought it might just be overcooked and not flavoured properly. The sashimi was very good, as were the chicken skewers. The only rolls I really enjoyed were the Nine Up rolls, which were spicy and had a really great balance of flavours. My family seemed happy about the desserts (mango yogurt, green tea ice cream, deep fried banana with ice cream and ice cream with crepe).   The food took a while to come out, even though the restaurant was pretty empty. The atmosphere and service were good, but I think the food needs a bit of work. Also, they had a TV showing some Hong Kong music variety show, if that's your thing."}
{"text":"Went on Saturday with their current promo. 15.99 with no sashimi, 19.99 with, got with sashimi.  Their selling point is the conveyor belt sushi (kuru kuru sushi), which wasnt used the way it was meant. Not that big of a deal since it was ayce for less than $20.  PROS - They give exactly what was order. If you order 3 plates of ribs, you'd get 3 plates. Other places give only 1 plate regardless the amount of plates specified (TenIchi).  - Atmosphere and decor is nice. - Ribs and steak are good. - Has grilled sea bass  MEH - Service isnt as bad as other negative reviews made them out to be. It's decent, but the waiter could've smiled more. - Depending on the seating, the conveyor belt may or may not be utilized. We sat near the chefs so they gave us the food directly instead of putting it on the belt. - Sashimi isnt really outstanding. On hindsight, I would've gotten the 15.99 instead. - Comes with aycd ice tea.  CONS  (not negatives about the place, more like something to take note of) - They skimp on the cuts of the sashimi, but since it's ayce, it's irrelevant cause we just ordered more...although that applies to most ayce places (Dont order 10 at first, order 1 or 2 to see it it's any good.) - Dont order their crepes or jap pizza. Crepes wont be up to par since it's not a dessert place. The jap pizza is quite lacking toppings and most it was rice, the crust is nice and crunchy.  - The pictures of the food items are grossly exaggerated...more so than other places. - The mango yogurt at Tenichi/Matsuda is waaay better than the ones at Nine Up.   OVERALL It's not bad, not great considering the price ($25 post-tax). I'd go again.   If you want decent ayce jap, Nine Up is fine.  If you want a cheaper alternative to Tenichi/Matsuda, forget it. Pay the extra $5 and go to those places instead. If you want to experience the trill and excitement of kuru kuru sushi, make a reservation beforehand to request a table away from the chefs.  If you want to experience the REAL kuru kuru sushi, go somewhere else."}
{"text":"My family and I came here, having heard that the place was good. And not to mention we wanted to experience the conveyor belt sushi. Menu was plentiful, and I was so excited to try this place out. Worst mistake ever.  Our table had 7 people and we went there at 6:45pm and the place was pretty full. Service was slow. We had to ask for things several times before we actually got them. The green tea had NO taste and was clear when you pour it out.  We ordered 4 rounds, but it took forever for our orders to come out. The sashimi had a horrible aftertaste. And dishes were so tiny, which would be fine if they didnt take forever to make. There was only 2 chiefs working on the sushi/sashimi on a busy Saturday night. One of them actually sneezed twice without covering his mouth and washing his hands after. The conveyer belt was practically empty. We probably ordered about over 50 dishes since the portions were small. We probably recieved about 20. We did complain several times to our waiter nicely about the poor service and lack of food. When we left, we let our waiter know that we would never be back because it was just that bad, and he shrugged and walked off with no apologies whatsoever.  We left with a empty stomach 2 hours later(and a few of us with upset ones actually), and spent a bit over $200 on All You Can Eat. Absolutely horrible, we have never experienced something so bad.  I dined there about a year ago. I can't say I'm sad to see this place go.  0/5"}
{"text":"CONVEYOR Belt Sushi... Now just imagine if someone opens a Conveyor Belt Dessert!  :D  My Friends would wish the Belt ends inside their mouth.   Food going around and around and around in front of you continuously is quite fascinating actually. It's like a Sushi Catwalk and when you want you can take the item of desire. Nine Up Sushi, you're my very first Conveyor Belt Sushi so definitely will be in my memory bank for a long while.   It's quite NEW so I will review it as such while some of the Apprentice Sushi Chefs ask the experienced Chef to show them make a Temaki Hand roll. The service is nice and most seating are at the Conveyor Belt while there are a few away from it where you can order from the Menu itself.   Items on the Conveyor are Color Plated and as Nine Up is still relatively unknown, there are limited Customers which could mean for the limited items on the Conveyor while we were there. For some reason, I see mostly Hot Pink and Baby Blue! The median priced items but of course you can always ask for items straight from the Menu if wished.   The Food items are fresh and mostly of Maki, Nigiri, or Sashimi. The Partitions are there to block off the customers that would otherwise face you but I think they might be removable. That might help if you want to seat face-to-face with Friends or... Jump the Belt Line and get your Sushi.   I'm glad something DIFFERENT has been created in this Scarborough neighbourhood that can otherwise be the same ol'.  Also if you haven't noticed, many SPICY Chinese restaurants are overtaking the area.  I give extra Kudos to Nine Up for willing to make this Food Concept accessible outside of Downtown Toronto."}
{"text":"I met up with some friends for dinner here. As I drove up to the restaurant, I couldn't help but noticed only 4 cars in front of the store. I went inside the small but cozy decor, I was greeted by with friendly waiter. We were seated near the conveyor belt.  As we ponder whether to order a la carte or all you can eat, I can't help but notice that there were only 2 tables including ours at 8pm. That right there should've been the sign for us to get up and leave, but we stay to try the new restaurant out, bad mistake. We order a triangle tray which consists of 18 sashimi and 18 sushi pieces.   When it got here, you can see the fish was dried out from being put out in the open. It not only looked not fresh, it tasted like a week dead washed up fish that been cut and served. Made me regret not ordering from the cooked menu. As I looked around at the trays on the conveyor belt, we couldn't help but wonder how long they been sitting there.   It  is not a place we would come back to. We got our bill, and we were given a dessert mango yogurt served in a shot glass looking type of glassware. We thought \"oh maybe our meal could end with a higher note\", but like our meal, we took a spoonful and left the rest of it sitting on the table.   I would not recommend this restaurant to anyone in the present way it is being managed. I give this 1 out of 5, but if I could rate this restaurant lower, I would!"}
{"text":"Very good service. Great lunch special! They are currently offering $12.99 special for all you can eat. Children and seniors have various price ranges as well (See uploaded photo).   I love sitting by the conveyor belt! You can pick any sushi dishes that you want.  Quality of fish is fresh, we ordered quite a bit of cooked items since I came with my parents. Items I really liked...  Enoki mushrooms with beef - love the pepper, not drenched in soy sauce Salmon belly - crispy on the outside, moist on the inside Squid sushi - very cute  Deep fried banana with ice cream - yum...  I'm looking forward to go back and try other dishes. They don't have too many unique dishes, but you are kind I there for the thrill of the conveyor belt."}
{"text":"Came here for lunch for the conveyor belt service but all food that you order on the ayce menu is delivered to you. There has only been one item on the conveyor belt for the past 45 minutes. Rainbow roll had only 2 kind of fish on top, nothing like a rainbow. Eel sushi roll had the smallest piece of eel. Seafood Udon consisted of one small shrimp and one small piece of fake crab meat.  Maybe dinner would have been a better time for the conveyor belt service. If u want good sushi, this is not the place to go to. AYCE does not work well with conveyor belt."}
{"text":"Super late review. Been here last year and absolutely disliked the experience. The food belt wasn't used. Food was served slow and mediocre. Service was slow. Only reason we went was coz of the 15% off. Not worth going."}
{"text":"I came to Nine Up after hearing from a relative that the new Japanese restaurant in the Midland and Finch area was pretty good. My coworker and I went during our lunch break and we had the AYCE option.  The price was great, you can't really get better than $12.99 for AYCE sushi.  The ATMOSPHERE was interesting. The conveyor belt was something I had never experienced before; however, we saw the same dishes going around the conveyor belt throughout the whole hour we were there. I wondered how long they would keep it out until they tossed it or gave it away? The other interesting thing about the conveyor belt is that there are posted instructions on how the whole things works.  Apparently, after you order, you are supposed to grab the item that corresponds to the Angry Birds character at your table. We thought that this was pretty neat, but we ended up getting our dishes handed to us in person anyway.  The FOOD was meh.  The presentation was nice, and the salmon sushi tasted and looked comparable to most Japanese restaurants; however, as one previous reviewer mentioned, THE RICE. The rice is sooo important in sushi and they managed to mess it up by omitting an essential ingredient! There was no vinegar in the rice. I was quite disappointed because it tasted so plain, which is why I am giving this place two stars.  I believe I saw another Japanese restaurant across from Nine Up in the same plaza. I think I might try there next."}
{"text":"2.5 stars  My boyfriend and I came here for their lunch special today. The portions is rather large and quite cheap for what they serve you. But I don't think I would consider the food memorable or particularly good.   I would recommend this place to those that likes to eat a variety of Japanese food in one bento box for a cheap price. My chicken teriyaki box came with chicken teriyaki, shrimp tempura, 6 pieces of California roll, veggies, salad, miso soup and a little dessert at the end of the meal. My bf's sushi combination came with miso soup, salad, 6 pieces cali roll, 5 pieces sushi, 6 pieces sashimi, a spicy salmon hand roll and a little dessert at the end of the meal."}
{"text":"You get what you pay for.  Walked in since there was a sign that advertised $13.99 AYCE dinner. Menu was decent, included all the regular AYCE stuff with the exception of sashimi, sushi (fish on rice), and grilled meats (chicken teriyaki etc.)  Pros: - affordable price - decent variety of food to order from - seated directly beside the sushi bar, the chef was kind enough to pass us our own dishes  Cons: - was quoted a 20min wait on a Thursday afternoon (6:30pm) when there were clearly open spots for 2 people - sushi arrived warm, and not very fresh - all food was bland, very boring and unmemorable - ran out of green tea ice cream.... :'(  We left full, but with regret. Most likely not to return, unless all other sushi restaurants had closed down Wished we opted for our favourite, Niji instead."}
{"text":"My brother suggested that we go there so he can introduce me to the first rotating sushi in Scarborough. He said the prices are good and the sushi is not bad. Unfortunately, on this Saturday afternoon, luck was not by our side. Their lunch all you can eat or rotating sushi items stopped at around 2:30pm, as they are closed at 3pm and will reopen at 5pm for dinner.   We instead got their lunch combo specials. We ordered a sushi combo ($9) with green dragon roll, spicy salmon roll, and california roll, and the short ribs combo($8) with short ribs on rice, tempura, and california roll.  The quality of the food, admittedly, is really not that great. The rice is not vinegary, but mushy and warm and all the rolls lacked flavour. The short ribs were decent, but the portion is so small that you barely get a taste of the beef.  The price makes up for it though, since two combos with more than enough food for two people was about $20 after tax, before tip. I probably wouldn't come here for dinner prices."}
{"text":"Came to Nine Up Sushi for their Lunch Specials.   Conveyor Belt Sushi for $1.50 - $2.50 and Sashimi for $3.50. Since we came around 2:00 PM and the place was not busy.. so one can only see fake sushi revolving around on the belt. The best bet is to just order and they will prepare fresh for you!   Lunch menu has a mixture of Korean/Japanese cooked dishes.. they have all been modified in a certain way to fit the Chinese palate... As most of the customers here are Chinese!   Spicy Korean Seafood Soup ($6.95)  - quite sizable good for sharing  - the spiciness and flavour are not really intense..  - There were mussels, Shrimps, Squid and tons of vegetables and Korean glass noodle inside.. good value  - comes with rice and salad   Since it was not too busy, the services here was really polite and attentive...   Nine Up Sushi is a good place to go if you are in the area for a late lunch, since it is served till 4 pm!"}
{"text":"My friends and I decided to try Nine Up Sushi for their conveyor belt service. We've never tried it before and it was pretty good time as any to try it with their grand opening special of 10% off.   I love my sushi, which mostly consists of Salmon Sashimi, Salmon Sushi, Baked/Grilled Salmon, Salmon whatever. As soon as we were seated, the first dish to roll off the conveyor belt was a pair of Salmon Sushi. I grabbed it as quickly as possible. The Salmon was amazing, even better was the Sashimi, which just melted in your mouth. Their Salmon dish which was teriyaki salmon was priced around $10. pretty good deal since it had rice and a few veggies on the side.   The items do get costly with the whole conveyor belt concept, the pinks are ~$2 the red dishes are ~$3, and purples were ~$4. It might have been cheaper just to order the Sashimi as a combined amount, but I couldn't help the fact it was readily available in front of me.   As for dessert, my friend ordered the fried ice cream, which looked appetizing. They also had tofu Cheese cake, which was something I wanted to try, unfortunately they didn't have ti available.   The only drawbacks that we encountered was a couple mix up in our orders, but other than that the service was friendly and the meals were great.   If you want to try something different and love Salmon Sashimi, I definitely recommend this place. Just make sure you bring extra cash since it can get pricey if your not paying attention to your dishes."}
