{"text":"Food are Fresh, clean and good quality, price is reasonable. Kids half price up to 13 years old. Excellent services, and this is my 2nd time been here."}
{"text":"Came here for dinner on a week night later in the evening around 8pm. Only one other table was occupied. We were greeted and seated.   We ordered and the food came in a minute... The service was quick, but mind you it was basically just us at the restaurant.   The food was fresh but the same selections as other hot pot restaurants, the service was ok, the restaurant atmosphere was alright. The Decor could be a lot brighter and it took me 10 mins to find the restaurant because it is so small. It is right in between the tofu house and a viet restaurant. The outside lights were not working for the English sign and so you had to know what the number nine in Chinese was to find the place.   The nine cube is literally nine sectioned off pot with broth. We chose the same broth for it all."}
{"text":"I first came across this place on instagram and thought wow, that's pretty interesting, 9 different flavours in a pot. Of course, that wasn't the case when I realized that it's the same type of soup in all 9 squares. The pot itself is great for keeping track of food, not the soup.   This place does offer pots that provide up to 4 different types of soups. As long as there are multiple soups checked off on the order menu, that's what they'll give you. Soups overall were on the salty side. The Sichuan/mala soup wasn't that spicy (if you're a fan).  Food selection - typical on the meat, beef and lamb slices.... It was the dinner special options where it gets interesting. They offer shrimp paste, fish paste, shrimp, mussels, and some other seafood options. This is where I give it my two stars.   Service was slow and this staff spoke predominantly Mandarin. But they were polite and tried as best they could given lack of staff.   One last tip, seating is quite limited and not designed for groups larger that 6. Even the tables that could seat 6 only had one stove so cooking was slow."}
{"text":"I came here recently with the family for hot pot dinner on Family Day. It was freezing that day, and so we were all in the mood for some yummy hot pot to warm us up. We decided to try a new place, and this place had been recommended to my parents in the past. What really stood out about this place compared to all the other hot pot restaurants I have been to is the service. The restaurant is pretty small, and so that night, there were only two waiters working. And they both offered amazing service! Which is totally the opposite from any other hot pot places I've been too. Every time we had a question or needed something, they came quickly, were super friendly, and answered any questions we had patiently. When we placed ordered, the food came quickly. I think out of the entire night, they only missed two items that we ordered, and both times, when we asked them about it, they brought it out right away!  The price, soup base and food choices were all pretty on par with all the other hot pot restaurants in the GTA area. The one thing that did stand out was that the AYCE price included a selection of unlimited pop as well. We did not get the 9 cube pot. We stuck with the normal split pot, with one side as the spicy soup base and the other side with satay. Both soup bases were very good.  Because the restaurant is quite small, I wouldn't recommend this place for large groups. They only have tables of 4, and booths which probably only seats a max of 6 people. So if you come with a party bigger than that, you'd probably need to split tables."}
{"text":"I came here in a whim with my cousin. The $24/pp price tag was a bit steep, but we thought we'd check it out.   I found the soup very salty (beef satay and the house spicy 1). The meat was good, and they had a good variety of veggies.   In the end, we were chugging water due to the saltiness. For the price, I feel like the soup should be better and there should be more meat options."}
{"text":"so we went to this place for its Chongqing style hot pot. Which is actually very different than the typical Cantonese style hot pot. it is supposed to contain spices in many of its 9 dividers as seen in the picture i have posted. We went to this restaurant expecting the soup to be Chongqing style spice.               First of all, the server of the restaurant was actually nice, however unfortunately there were not enough servers because there was only one available for the whole restaurant.               Onto the food. The Soup which is the basis of hot pot, had a weird smell, and it seemed terribly not fresh. This would later be proven to be true as i will explain.               The sauce selection was fine, it had all the usual you would expect from a hot pot restaurant, and the price included pop for the guest. Now the Meat which is a very important part of hot pot was clearly not fresh, the beef had turned a dark maroon colour, and the other meats such as lamb was also clearly been around a little too long, either from sitting in room temperature too long or whatever. There was only beef and lamb as the meat choices so not as much as the other hot pot places around the area.             The seafood selection was shrimp and musseles. and they had a variety of balls as usual hot pot places did.  it was not very good quality in those food either.              The leaf vegetables looked okay, however other vegetables such as lotus root, looked like it was about to be rotten, and the corn as well seemed like it had been sitting out there for a little too long.   Overall after this restaurant when we got home, our group had one consensus which was stomach issues which gave us all quick trips to the bathroom. This would prove that the food was not only seemed  not fresh but will sent you to nature's call faster then you could believe.   I definitely would not recommend this restaurant to anyone, especially given that experience."}
{"text":"I came here on a Sunday evening with my boyfriend. We were quickly seated, we got the spicy 1 soup and the house original. The server told us the house original was a beef soup it's on the saltier side, while the spicy 1 was a good amount of heat. The quality of food I would say is the same as other hot pots like hi pot quality, overall an okay experience. The price is on the higher end side for average food quality."}
{"text":"Came here for dinner on a Saturday night at 6pm, there were about 3-4 other tables seated, throughout the night it didnt get any busier. The price is quite steep, you have to pay extra for the soup base which comes up to be about $30/person.   The concept is great, many squares with different broth, we ened up only choosing 2 broths (spicy and a clear one) The spicy broth is very spicy with lots of chilis floating.  However the electric burner at the bottom was WAY TOO SMALL! making only 1 centre cube out of the 5 cubes useable, the other 4 on the sides barely boiled and not hot enough to cook any food, so pretty much useless having these extra cubes. it ended up being really slow and inconvenient cooking all the food in the tiny middle square.  They did have a good selection of different items to choose from but not much more than other hot pot places, nothing stood out except that soft drinks are free and the service was decent. I left really full because of the ayce but not really satisfied."}
{"text":"Pros: We dine in around 6:30pm and there was only one server, he managed the entire restaurant with good service still. Pop drinks came in cans, not the watered down drinks that many other Chinese hotpot offers.  Cons: They don't serve dumplings, desserts, and other common items you can find elsewhere.  Each person paid about $30 and for the limited selection, it was not quite worth it. The house special soup base is very salty, and the spicy (one pepper marked on the ordering sheet) was very spicy as well.   The only special thing about this hot pot restaurant is literally the grid style pot."}
{"text":"Nine Cube was alright - The concept of the 9 cube hot pot (the pots are literally shaped in 9 squares) is a cute gimmick. But for practicality, it was actually kind of hard to cook the food.  The good thing about it was being about to differentiate where we put the food, or else everything will be lost once you throw all the foods in lol. Service was excellent.  The interior reminds me of a bubble tea shop - I was surprised to see very little ventilation since hot pot places gets steamed up quickly. The place was able to maintain little to no steam surprisingly D:  The beef definitely needs more fatty (personal preference). I loved the imitation crab meat though!"}
{"text":"came here for lunch on a friday afternoon. the options were pretty good. pop(coke/cplus/sprite/ginger ale) are included in the price, but ice tea and other drinks cost extra. there are a few dinner only option didn't really check, but lots of soy options for you vegetarian peeps. beef, lamb, most of the other standard hot pot items you'd expect. if u like to add egg to your sauce, you have to ask for it because it isn't on the menu.  we were the only people at the restaurant at 1:30pm on a fridday afternoon. when the bill came we found out why. on weekends (friday is included), lunch is 18.99 per person. pretty damn pricey. even 16.99 on regular days for lunch is pretty expensive. thats probably the one downside, in my opinion. i want to see some seafood at those prices."}
{"text":"This is my second time to this place. We ordered non spicy soup base. There are nine cube in the pot. However, only 4 out of 9 cubes are actually boiled. I do not understand why there are 9 cubes if you cannot use all of them. The food is below average. Most of them are not fresh. Comparing to last visit, this visit is very poor. Probably I won't come back anymore."}
{"text":"Don't even bother.  Crap pots that dont heat evenly, food doesn't look fresh, will not pass DineSafe test"}
