{"text":"This place is probably the best place I've had rice rolls at. My family was is this business after all so a think I know a little about what I'm talking about. I grew up eating rolls everyday.  The rice rolls (ordered the beef rice rolls) were so great. The unique style or shape of the rolls means there are no additives. Unlike the ones you get when you go to a restaurant for dim sum. The congee (we had the seafood) could have use a few more seafood pieces but overall the taste is great.  The size is a little small but there are place that charge more for a lot less tasty food."}
{"text":"I would come back here only for the rolls. It's not your traditional rolls. The rolls aren't actually rolled here like many places. They are made flat and pushed together in a wavy form. The texture is very smooth. I wasn't crazy about the congees. Personally I thought there were too much ginger."}
{"text":"Went there at 6 p.m. and a few congee and rolls already sold out but there was only one table occupied by two people. The rolls that we ordered were fine but the congee was very bad.  I ordered fish fillet congee and there were fish scales in every mouthful. The congee  tasted fishy and that meant the fish was not fresh or has already gone bad. It's the worst congee I've ever had."}
{"text":"I think Niwan Rolls King is very well named considering their rice rolls are indeed really flavourful and better than most dim sum restaurants. I can't compare them to the rice rolls in Sam's congee though since the type of rice roll they do are kind of different. But overall, great texture and flavour in the rice rolls and they are also very generous as well. I believe the avg roll is around 3.99 with specialty rolls being 5.99. Very decently priced in my opinion.   I also really recommend  their congee. As my dad pointed out, they actually took the time to make the congee base from scratch and apparently you can distinguish this visually when you look at the rice in the congee and see that they look like they've \"burst\" from their original grain form. Both my parents who are definitely not congee noobs said that Niwan's congee is in fact better than Sam's Congee with better tasting ingredients to boot.  The only thing I would steer away from is the variety of fried dough sticks they offer. Other places, in my opinion, do it better so I would really just stick to rice rolls and congee at Niwan. Additionally service was also fast and friendly which is what I always appreciate at my asian restaurants! Great addition to the new/not-so-new plaza at midland and finch!"}
{"text":"This place mainly serves congee and rice rolls, not much else. No fried noodle or fried rice.  I ordered: 1) beef and mushroom rice rolls 2) Tang Jai Jook (mix seafood congee) and 3) nam yu (red fermented beancurd) soup noodle with pork  Appearance of the rice rolls was very new to me. I've lived and dined in HK and southern China for 2 years and had not come across this type of rice roll. Compared to the usual type, this one looked messy and ugly, like it was done by amateur. Kind of clumped together. The taste is better than it looks, but I still prefer the usual ones. There wasn't very much filling either. On their laminated menu, they had crossed out the original price of $3.50 with $2.50. Hmmm....I don't think anyone would pay $3.50 for this little dish of rice rolls, that doesn't even look pretty.   Congee: seems homemade, but not in a good way. Taste like an amateur's try at making congee. Texture is not smooth. It is heavy and bland, and the portion is somewhat small for $4.50.   Fermented beancurd soup noodle with pork: this was a total surprised to me. The Chinese name wasn't very clear and I thought I was ordering something like a dry stir-fried noodle dish. Turns out to be a soup made with red fermented beancurd with  thick vermicelli and pork pieces. For $6.50, this was overpriced for what it is. There's nothing special to this item and I think anyone can easily whip this up in 2 minutes at home by dumping a clump of fermented beancurd into their instant noodle or something. My vermicelli was overcooked and soft when it should be firm. The pork pieces were boiled to death. This dish was disappointing. Most silly thing is that it was listed among their 3 \"Chef's Recommendation/Special\" section. The other Chef's Recommendation that was also on the menu was Ginger Scrambled Egg for $5.50. That doesn't sound like an appealing offer either.   Decor is bright and clean with tables and chairs from Ikea, but doesn't feel cozy to me.   I'm not sure if this type of congee and rice rolls is specialty from some specific region of China, but it's not for me. I prefer getting the more conventional rice rolls and congees; that most people are used to, and at places that offer more exotic tasting choices on the menu.   I will not come back."}
{"text":"The price for all the rice rolls was $2.5 (I think this is the new permanent price) The plain ones with peanut sauce was really big portion and was delicious, super soft and fluffy. The BBQ rice rolls was a bit smaller size and totally worth the price, it was delicious. The rice flour rolls here looks different, probably cause they made it so thin. It doesn't matter how it looks, cause it was delicious.  The Congee was really thick (not watered down) with lots of topping, it was not bleach white, it looked very homemade. The veggies was nice and fresh and the deep fried dough was nice and crunchy on the outside and soft on the inside.  The service was quick, and great value."}
{"text":"Interesting concept, at least for me--a place that specifically specializes in rice rolls. The way they make their rolls is a bit different from what I'm used to in regular dim sum; the rolls are not entirely smooth and cylindrical, but more so thicker and made with folds. As a result, some of the filling just comes outside of the actual rolls. While I did find the rolls themselves to be quite tasty, I wasn't too sure if I liked this style better than the traditional one--having some of the filling outside was somewhat strange. They have a few other things, like noodle soups and congees as well."}
{"text":"Ok, so I returned...  Rice noodle roll: The rice noodle rolls are now all 2.99. The rolls are still visually unappealing - most of the filling sits outside of the actual rice noodle rolls rather than on the inside. If I was spinning this - I would call this a \"deconstructed\" rice noodle roll.   However, the taste has improved. the texture of the roll is nice and springy, a bit thicker than before - and it holds up well even after it has cooled down a bit. I opted for the beef/chive/mushroom roll again, the filling was delicious! The beef was tender, the mushrooms were bite sized, and every now and again a subtle hint of ginger. I'm glad I made a return.   Congee: - plain congee (added thousand year old egg +1.00 extra) Lots of pieces of pai dan...so worth the buck! Consistency of congee is still quite thick, but thinner than before.     -pork kidney congee - good flavour - lots of pieces of pork kidney"}
{"text":"3.5/5, +.5 for service  One thing I wish before I start: This place closes too early! We arrived at 8:25pm and they were closing at 8:30pm! However they did decide to let us in as the kitchen wasn't closed yet and they were willing to take our order.  My dad heard stories from his colleagues about how the noodle rolls here are unique, and how the restaurant is similar to Sam's Congee, a very popular restaurant inside Market Village. We decided to try it out last night.  I ordered the vegetarian noodle roll, BBQ pork noodle roll, beef noodle roll, nu lei crisp, and the squid congee. Do note that the noodle rolls aren't the traditional ones you normally have in dim sum restaurants, but a bit more \"mainland\" style, so it does present itself to be a pile of disorganized food, but still edible and delicious! The squid congee is good as well; I don't see many congee restaurants that offer that to be honest, so it was quite unique.  The nu lei crisp was a bit of a disappointment. The presentation looked good, but the food itself was too bitter, and I honestly expected it to be a little bit more sweeter.  I wouldn't mind coming back for lunch, as their noodle rolls really are unique and quite delicious. For $3.50 it's not too bad of a price, but their portions are reasonable.  Oh, and great service here too!"}
{"text":"Came to this place with family cause they had a promotion for all steamed rolls $2.99 Honestly their congee is nothing special when compared to like other congee places and pricy I think for the portion size, we got 2 steamed rolls and I did not like it at all....the steamed rolls is like all broken up and the ingredients is so minimal, I still like my steam rolls at dim sum places  Btw this place is tinyyyy"}
{"text":"Being in the area, in dropped in to try their famous rice noodles accompanied by congee and a fried fritter.  I am not sure but everything was very bland.  The congee was not very thick, and there was very little taste of the contents inside.  The fried fritter was... Just fried and nothing special on taste but a little on the hard side, not crispy with fluffy inside to sop up the congee flavors.  Lastly their claim to fame, rice noodles, was OK. This is not your typical Hong Kong shop if that is what you are looking for.  Again, the flavours did not jump out and very light, the rice noodle texture was not as smooth as I expected it to be.  They do have a TV tuned to cp24 and free WiFi for patrons slurping away."}
{"text":"2.5 Star  Steamed rice rolls is one of the comfort food that I ate growing up, I still a little obessed with having it every chance I could get. So when my Yelp friend semt me a link about Niwan Rolls King grand opening special, I rolled down to Scarborough right away to try it out.  The menu here is really simple, a one page selection. I decided on   Beef with Chive & Mushroom ($3.50) Grand Opening Special ($2.50) - another one of those ugly looking rice noodle.. or rustic looking? Fortunately it tastes much better than it looks - loaded with mushroom and chive, beef has a hint of orange peel  Pig Blood Congee ($4.50) - Homemade style congee - heavy and bland - pig blood plentiful but overcooked  - I hope you like ginger and green onion as much as I do, if not please ask them to take it easy.  This is not the typical Hong Kong Cantonese style rice rolls or congee similar to Sam's Congee Delight or the rice rolls you have as dim sum. Just a different version from a  region in Guangzhou. A taste of home for some!  The interior is really nice as a congee place with the high ceiling and huge windows and so clean!!  Price wise, I am not sure if I would have pay $3.50 for the rice rolls...... and even the congee"}
