{"text":"I have read reviews about how large the menu is, or people having to use the restroom right after eating here. Well Chinese take out restaurants typically have a large menu, I.e. Hunan chicken lo mien, Hunan chicken chow mien, Hunan chicken with white rice, Szechuan chicken lo mien etc. The menu is not really that big it's the same chicken with different starch and sauce or spice level. Picture a bar listing every wing entree, buffalo wing, BBQ wings, buffalo flats, BBQ flats, buffalo drumettes, etc. So that should not even really matter into this review.   Now the bathroom comments, you eat, you go to the bathroom. That's nature. Maybe this time you get the \"runs\". Are you already under the weather? Should you even eat the spice you ordered? What did you eat earlier? Unless you are part of a serious outbreak, e-coli, bacillus, food poising, etc. these comments really have no need to be said either.   With all that said, this place is good, not great but good. The prices and the service speed is what makes this place have a value to me.  Everything ordered so far was good! I have had some bad tasting, sloppy looking, skimpy serving Chinese food. This place has not done that yet. However, human error will happen and I am sure I will be disappointed at some point but that will not effect my standing on this place."}
{"text":"Had lunch delivered to our home. The food arrived just barely warm and we both got 'intestinal discomfort' followed by a lot of time on the toilet later that day. Made the connection after the third time we got lunch from this place over the course of several months with the same result. For this reason, we have nicknamed them \"Number 2 Kitchen\"  and no longer go here."}
{"text":"The garlic beef was edible.. that's about as much as I would give this establishment. Workers eating and coughing in the back in plain view. The hostess was awesome!"}
{"text":"This place is right next door to the Carrick Shop n Save if anyone is ever looking for it.  I never really go inside, just mostly have had delivery.  They deliver with a minimum $10 order.   My orders have always been precise and timely.  It's a normal decent tasting Chinese restaurant.  The crab Rangoons are very tasty here though.  You really can't go wrong with the prices and they always honor the coupons on the front of the menu when you mention them.  I'm not the most adventurous when it comes to Chinese food, but the General Tso's, Sweet & Sour Chicken & the Lo Mein are always good."}
{"text":"I thought this food was very tasty! The dumplings were awesome and the prices were very reasonable. I would definitely get Chinese food from here again."}
{"text":"I think we need to call this what it is. Cheap, easy, Chinese food. I've never had any 'bathroom' issues out of the ordinary after eating any other greasy meal. They deliver fast, are fairly friendly and it's affordable. I don't think they're trying to be anything gourmet and this fits my Chinese needs perfectly."}
{"text":"No. 1 Kitchen has a staggeringly large menu that includes burgers, filet of fish, submarines, and even chicken wings! Despite that, my family kept it safe, going with General Tso's Chicken, Beef Fried Rice, Egg Rolls, Steamed Dumplings, Spare Ribs, and something called Spicy Stir-Fried Jumbo Shrimp. Blame a coupon that came in the mail.   The SSFJS should have been named Lotsa Diced Onions With Some Shrimp In A Sweet Red Sauce. Not that it was terrible, but I'm wondering if there was a mistake made in the kitchen for one. Secondly, the diced onions were way too abundant. The shrimp, however, was juicy and plump.   Their crisp, candied General Tso's Chicken was fine but wasn't at all a step beyond what I've had at other Chinese restaurants. The Beef Fried Rice was fluffy enough and had just enough strips of beef. Mildly flavorful is how I'd describe the egg rolls. Chinese Spare Ribs always seem to have that smoky flavor to them, and in that regard, No. 1's were up to par yet were somewhat gummy. As is often the case, the rich, doughy Steamed Pork Dumplings were the sleeper feature of the meal.   Thus was our fairish takeout meal. Sorry to bore you. Are you still with me?  Hell, am I getting bored with Chinese food? Man, it used to be such a novelty. *sigh*  Although, getting a steak hoagie from a Chinese restaurant is just too crazy not to attempt."}
