{"text":"I can only rate the dim sum experience, as I've never eaten any other meal there. I would recommend this place above Rol San only in that it's not as annoyingly crazy busy all the time. The food is very decent, and service is sufficient."}
{"text":"Noble Seafood is my current go-to place for dim sum in Toronto's Chinatown, ever since the closure of Gold Diamond.

The major downside to this place is its awful service.  All the female servers have very bad attitude -- they would throw a pot of hot tea down at your table and let it slide, never mind that it might crash on you and scald you.  You can wait five minutes waving your arms in the air like a madman and you still wouldn't get the check or a water refill.  Half the time I go there, I have to walk up to the counter with the order form and pay that way, rather than wait for the inattentive staff to notice me.

The good part is that most of the food tastes great.  This place has one of the best tofu wraps I've eaten anywhere.  Most of the time this item is filled with messy vegetables and very little meat, but at Noble you get shrimp, pork, and very fresh-tasting vegetables.  There is a rare item called fried milk which is unusual to find in most restaurants.  The rice-noodle wraps are sticky but with large, firm shrimps inside, and the soy sauce is just the right mix of salty and sweet, an essential in this dish.  The curry squid, noodle-wrapped fried dough and dim-sum staple shrimp dumpling are also very good.

I've eaten dinner here once and ordered the lobster e-fu noodles -- they are very tasty, but the price is pretty high, even for a small lobster.

Weaker dishes include the pork dumplings, which like most Toronto Chinatown places are big, fat and not very refined.  The fried shrimp dumplings are fried too hard and taste a little too burnt.  The worst dim-sum dishes at this place have got to be the fried squid tentacles, which are so tough that you'll feel like you're chewing on ropes, and the red-bean cakes, which taste like they haven't set, and look like they came out of a dumpster.

Overall, this place really needs to train its staff on service, but the food is good enough for me to go back."}
{"text":"I recently saw and advertisement for this restaurant. My family and I decided to give it a try. Upon entry, there was no hostess there. We had to get someone's attention, who signaled at someone else, who then seated us. Five women who worked there walked by us as we tried to get someone to take our order sheet. I don't think I will eat here ever again as we experiences a two issues. 

1. There was there was dust inside my bowl and some dried food left from the person who used that bowl before. 

2. We found a piece of steel wool and a small piece of plastic in our food. Upon notifying the manager, she looked burdened that we even told her about it. She only offered to replace the food after we suggested it. 

Overall, the food was decent. I just don't like finding things in my food that shouldn't be in there."}
{"text":"Serving all day dim sum with the restaurant being half full with patrons? There must be something good about this place, so I decided to find out for myself. 
It's a very typical Chinese restaurant with a reasonable dim sum menu. No cart wheeling here! Phew. I definitely prefer the server method as I like my food fresh and hot off the steamer, fryer or grill and personally deliver to my table. I'm a princess :)
It's a nice place for quick dim sum and two people can probably be stuffed for about $30 (tax and tip included). No complaints."}
{"text":"Horrible service...took forever to get any food. Food was ok but I was already in a bad mood."}
{"text":"I was a bit disappointed there.They told us they will accept US dollars,but we tuk more money than the Canadian equivalent of US dollars...And explained to us showing a 10 canadian dollars that they charge 10 usd for food worth 10 Canadian dollar purchase, which was not informed at the beginning. 
I cannot say we r not satisfied with their behaviour as a whole, I will say we got highly highly disappointed.... I will never ever recommend this place"}
{"text":"Steamed fish meatballs were really great. Steamed soup dumplings, not great, mushy actually. Beef ribs in black bean sauce was good, though chewy. The tripe was tender but the flavor was only ok.  The beef rice rolls were good and the spare ribs were good. And they were open early yay!"}
{"text":"Went on a Saturday in November, 2013 for Dim Sum.

Place was full, which is always a good sign, and the food was pretty good.

Because it's a seafood restaurant we found the various seafood Dim Sum dishes were the freshest and the best.  Har Gow, Curried Cuttlefish, and Deep Fried Octopus Tentacles were all delicious and fresh.  In fact anything with shrimp in it had the sweetness of shrimp meat that only comes when its fresh and has not been frozen and defrosted.

Non-seafood things weren't as good.  The Chau Siu So (BBQ Pork Pastry as opposed to the BBQ Pork Bun) had waaaaaaay too much pastry and very little pork.  The fried dumplings had simply too much greasiness and were clearly deep fried instead of fried lightly in a wok.  In fact I don't recall ever having anything in any Chinatown Dim Sum place that was that greasy.

We will definitely return, but will stick to seafood dishes since it is obviously their strength.  The bill for 2 people was about $30 which is a pretty good price for Dim Sum."}
{"text":"My family and I use to come here nearly every weekend! It's good and the price is right as well as the portions! 

I don't know why we haven't eaten here in about 1 year! Weird but all our memories are good!"}
{"text":"The best dimsum in China town. I usually go there once a week, of course before 11am. They have fried noodle very tasty n cheap too (after 11h30). Staff very friendly, just like home."}
{"text":"Meal was average.  Service fairly good. I saw shark fin soup on the menu and considered leaving as many places have banned the serving of this. You know something is wrong when they charge $55 for the \"delicacy\". 
Well we stayed. I had lemon chicken which was greasy. My son had duck which he said was ok. 
When we went to pay the $70 bill, we were told the credit and debit machine was broken, cash only. No sign. No warning when ordering. Had to scrounge the cash. 
Very disappointing."}
{"text":"Came here twice during my visit to Toronto, so clearly Noble is doing something right! The atmosphere isn't fantastic, but the prices and the food more than make up for that.

Recommended: sesame sticky rice balls, which have a sesame seed paste inside them (I guess you should be sure you like sesame before ordering); steamed rice and pork wrapped in a lotus leaf; and BBQ pork buns, which are very sweet."}
{"text":"My go-to Dim Sum spot in Chinatown has been Rosewood for a while, but I decided to give Noble a chance.

In a few words, it's OK. Nothing to write home about. The shrimp dishes like the Har Gow are good - I like the thin, translucent wrappers. But the rest are 'meh', not great but not terrible either."}
{"text":"Great place to have dim sum. I like that we order from the menu instead having the server pushing carts of dim sum. We get our orders we want fast without waiting for the carts of dim sum we want. 
They have a special discount for dim sum at certain hours. The food is great. The service is good. 

I see other places when the server comes out of the kitchen with the cart of dim sum, customers surround the cart and start to open the containers' lid of dim sum and checking it out. ( it is gross because they are breathing on it and not taking what they touch, how do we know their hands are clean?)"}
{"text":"Went here on Sunday when I just couldn't be bothered to wait in line for Rol San, which is the Dim Sum restaurant that converted me from a lifetime of belief that Dim Sum had to be served on carts.
While having low expectations may have helped, I was pleasantly surprised. Relatively clean, pick'em list of decent choices to ensure food is hot. List isn't as long as Rol San's and more of a \"best of\" list, so you won't find a new favorite. 
However, everything came out hot and tasting fresh. Wrappings are a bit thick, the Sui Mai was a bit gristly, but I would not hesitate to come back instead of waiting in line for the big RS."}
{"text":"When I'm craving dim sum, I always go to Noble. 
I feel uncomfortable when you order from the carts so this restaurant is perfect because you order from a list. The food comes fast too. 

I usually go on weekdays from 9-11am since the price is $1.80 each item. It's the cheapest in Chinatown and tastes great. 

Staff are very friendly. I highly recommend this place."}
{"text":"Lunch time specials are a must! I believe they start from 11am - 2:30pm M-F only. For 6 bucks I get a good amount of fried rice or fried noodles. Cash only, but there is an ATM machine. Dim Sum is good as well. 

Gets busy and the seatings are for groups so if you are rolling solo, it might look awkward."}
{"text":"Just a quick review here.

Not as busy as Rol San but just about as good, this is my first choice for dim sum. The menu's a bit smaller & tighter but the pricing is lower and the quality is pretty good.

The service is always great and speedy."}
{"text":"There are many other places that would be worth visiting, but definitely not this place. We came for dinner a couple weeks ago, and there were a lot of issues. Firstly, they were very stingy with napkins! Like come on, napkins! Secondly, they kept messing up the order - we ordered steamed lobster, which was terrible. We asked for a chicken dish and instead got something that was not what we had ordered. The wonton soup that we asked for didn't come, and what we got was corn soup. 

To add insult to our terrible experience, we were chased by a staff because we didn't leave a tip! Like come on - they kept messing up and expected a tip?! The guy demanded 10 dollars! 

Never coming here again."}
{"text":"Have been coming here pretty regularly for the last couple of years for my Chinatown dim sum fix. No cart service but I prefer the order cards anyway. Service always perfunctory, consider yourself lucky if they crack a smile. Quality of food for the most part really good.
Standout dishes are the BBQ pork buns and the Shanghai soup dumplings. Good egg tarts too.
As of November 2015 they have increased their dim sum prices... boo.
Will keep coming back anyway, the food is great and easy enough to snag a table, even on weekends."}
{"text":"I came here for dinner with friends.  We ordered four different dishes to share. Each dish came out of the kitchen quickly. The flavours were spot on. My favourite was the beef with steamed greens. The beef was tender and delicious, and the greens were cooked perfectly. The sauce was umami-delicious, and not overly salty.

The space is open, bright, and large--a nice looking place. I saw two TVs, and although they are commonplace in restaurants, I generally prefer a restaurant without them."}
{"text":"Went here on the recommendation of a friend.  We showed up around noon on a Sunday and the place was busy, there was a good mix of clientele, which is always a good sign.

Great portions, the service was prompt and the food was hot and fresh, it was also priced very reasonably.

I only gave Noble 2 starts because we didn't find the food to be that flavourful.  We had shrimp rice noodles, deep-fried shrimp rolls, pan-fried shrimp and chive pancakes, beef short ribs in pepper and of course har gow and shumai.  All were done traditionally and well, however they all lacked any kind of flavour outside of the basics, even the soy sauce wasn't sweet or savoury on the rice noodles.

Won't go back, but I wouldn't discourage anyone from trying it either."}
{"text":"Rol San's had a 30 min wait and so, we decided to come here instead. Sunday noon dim sum is the goal. Service is mediocre, typical unhappy employees but it's kind of what is expected from Chinese places no surprise here. Food was surprisingly good and really cheap - $2.08 for small and $3.80 for large. Our bill for two came under $20 so I'm a happy camper lol Place is getting old but decent and all-in-all, I suggests swinging by on the weekend/holiday for frugal dim sim!"}
{"text":"Food is amazing and service is decent. Both dim sum and dinner is really good. If you go for early bird dim sum, pricing is good for the quality of food you are getting. However, dinner is extremely expensive. Would recommend to anyone who is willing to spend the money for good Chinese food."}
{"text":"Haven't been here after its renovations so it was a good feeling walking into a clean and spacious Chinese restaurants. 

There were 7 of us and we ordered:
- the \"pei pah\" duck. Which really is crispy duck but yummier. Very crispy skin and good spices. 
- ordered a 4 people set dinner for $148 (don't quote me on the price). This came with a fish soup and green bean sweet soup as dessert and also mango pudding and some sweet cooKies. 
- added on an XO fried mushrooms with geoduck. ($35). This one was pretty good. Didn't skimp on the geoduck and very good flavour. We were so hungry, forgot to take pictures! 
- and then added on a tofu + bean curd dish. Not bad but simple 

Overall, it's a decent Chinese restaurants but definitely not cheap at all. Food was pretty decent."}
{"text":"Can't say no to cheap dim sum. Noble has been around for  long time! I remember coming here with my grandparents when I was younger - maybe like 16 years ago? I only come here for dim sum - happy hour or no happy hour. The quality is okay, nothing to rave about but it gets the job done.You order off a sheet and the food comes out hot. Sometimes they miss an order, so keep track. Sometimes they even tally the wrong size/number so keep an eye on that well! 

I really like their egg tarts (dan tat). Every time I've ordered it, it came smoking hot and the custard was so fresh!"}
{"text":"Newly opened dim sum and dinner joint just north of Pacific Mall.  

Modern Asian decor, clean and bright the restaurant was about half full at 1pm on the Saturday we went.  We ordered about 6 dim sum dishes, I found the food to be clean, not too salty, not too much MSG and not overly oily. If you like light yet flavourful then this may be the place for you! 

Early bird before 11am $3 special price for small, medium and large plates."}
{"text":"Decent enough Dim Sum place, been here a few times and the service is usually good and the wait for food not too long.

It is on the busy days which is pretty much sat/sun between 10am-12pm that the service is slow and the quality of the dim sum drops.

Good for groups if you can get a large table or a booth seating. One bonus is they give the hot sauce in a squeezy bottle instead of being stingy and bringing one small pot for 6 people."}
{"text":"After a hiatus of a couple of years going to this location, the current restaurant seems to have cranked it up a notch in the quality of food. Everything was delivered as advertised with steaming hot dim sum along with a couple of other entree orders that hit the spot including salt shrimp, so crunchy good with those salty shells and eyeballs looking back at me as they didn't stand a chance. The noodle dish was also competently executed. The tofu dim sum was perky and delicious. They serve wine and beer and the next table had a bottle of wine at their table, hmmm an interesting concept. Service was attentive and get this: they take credit cards, now how awesome is that for Alexander Park - Chinatown goodness?"}
{"text":"My parents are quite big fans of this place but I don't get it at all.  We came for dim sum.

Parking - a tiny parking lot made finding parking impossible.  Hard to understand why so many people like this place!

Decor - My parents said this place just underwent either an ownership change and/or a renovation.  Seriously guys?  Grey, blue, and purple do NOT go together this way.  Further, the lighting pieces change part way through the place, and scratches/dents in the wall.  Crammed tables & chairs together.  Finally, the use of white light bulbs instead of warmer shades make an industrial feel of the place.  I'm usually not the type of person that cares too much about decor, but this has to be the worst ever.  Those purple tablecloths can't be cheap to have bought or clean.  Polyester everywhere.

Food - Definitely lower tier for Toronto North standards.  Not much flavour or complexities in the food, especially for its pricing.  We left, and both my wife & I felt a bit dizzy from the food, which is our typical symptom of foods with a little too much MSG for us.  They even disappointed in my childhood classic favourite, \"deep fried milk\".  Mess that up, and forget it.  I don't want to come back.

The positive - My wife said they have a change table, and that made it easy for her to change our son on the way out."}
{"text":"Read good reviews online ordered stuffed crab claw bbq rib spring roll deep fried shrimp dim sum fried rice noodle on uber eat app 45$ plus delivery & it all sucked"}
{"text":"Checked this place out just because I'm still on the lookout for a good dim sum place. I don't go super often but when I do, I want a good go-to if possible. Came here with a friend on a weekend morning around 11am.

Place was a bit busy and stayed consistently busy for the duration we were there. A thing that kind of agitated me was that they were not heating the place thoroughly especially for the tables by the window. Maybe the glass wasn't well insulated but still. Putting people by the windows on a cold winter morning and not turning up the heat? On top of that, every time the entrance doors were open, there was a cool unwelcoming draft slipping through the restaurant...sure maybe they just have poor structural planning of the restaurant itself. If you want to make excuses...and just to note, even other customers asked to move away from the windows because it was too cold for them. 

Given the fact that there is now HST on everything, I GUESS the price here was reasonable? Again, not consistently having dim sum, I'm not sure if the prices were jacked up or just how most places have been slowly increasing since. I recall the time when dishes ranged between $1.5-$2.5 during the early bird time like around 7:30am-9:30am or something. But that was probably a good few years back...I was surprised that this place charged their dishes $3.20 each BEFORE 11am...

Service was per usual at any dimsum Chinese place and I'm glad I didn't have to deal with other obnoxious Chinese customers disturbing my meal which was nice for a change.

Overall, I don't see an issue with this place aside from the heating and their food was all right."}
{"text":"2.5 stars

chinatown has very few options for excellent dim sum. when i struggle hard to get up early to beat the crowds, i'll usually go to rol san, but when everyone else and their mother goes to rol san, noble is one of my back up spots. the dim sum is just ok, but if you are craving for some bbq pork buns and har gow... there is always less of a wait to get in. for example, i was in chinatown yesterday at about 12:30, and got the last table in the joint without any waiting :)"}
{"text":"It is possible to pay a little less in Chinatown, but Noble Seafood has big portions and they are generous with the shrimp/chicken/seafood/meat in the dish.    We ordered two shrimp dishes tonight, and there might have been over 20 shrimp in each dish.   Compare that against some other restaurants.

The 'spicy shrimp + eggplant' is bursting with flavour.   The 'szechuan shrimp' is spicy and chock full of mushrooms, red peppers, baby corns, water chestnuts and several other vegetables."}
{"text":"Service: very poor
Food: fish not steam well and the waitress know, we ask her to bring it inside and steam again, she said no. \"Very bad\" 

I won't go again. Rather go Hollywood cafe."}
{"text":"this is a 2.5*

was here for lunch; it has a very limited selection. 
dimsum choices were limited, lunch specials...there were only 10-12 items total. 
Prices were reasonable and food was ok, but slightly oily. 
big restaurant for limited choices. strange"}
{"text":"Solid dim sum spot if you don't want to wait for rol san. Service can be sketchy but there's never a line and it's cheap."}
{"text":"I went here today for the special, although the price increased from 1.80 to $2.00 for dimsum dishes, that is still a really great price for tea from 9-11 on weekdays! The dishes were all really good especially the deep fried squid tentacles, the siu Mai and the BBQ pork buns! Will definitely be coming back whenever I can wake up in enough time :p"}
{"text":"This review is based on dinner. 

I've been here for dim sum several times before and thought it was a decent place. 
But for dinner, please go somewhere else. 

Prices are really high and portions are small. What you're paying for is the comfortable seating.  

We ordered the 4 person set dinner. There were only 2 options.  Price tag was $148 or $200+ for mediocre food - that's crazy! For 1 soup and 3 dishes, I don't feel the food quality or quantity warrants the pricing. We were kinda hungry just a couple of hours later."}
{"text":"I rarely ever go down to Chinatown for dinner much anymore.  But recently have been downtown and needed to find a Chinese restaurant and nobles one of the few Cantonese places left.  

Noble's a classic old school canto place.  It's very much stuck in the 80s.  The food's solid if not overwhelmingly greasy, but I betcha that's because it's a mandarin chef back there.  

But one you've been up north to Richmond hill/Markham, you just can't go back downtown for real good Cantonese.  Sadly there's no real congee type places scattered everywhere in the burbs.

If you have a car it's worth the drive further north.  If not..then you're stuck on the 80s Chinatown."}
{"text":"succulent pig is very good, fish soup is also good, eight treasure duck is also good but you need 8 people because it is quite filling. Price so far been reasonable considering the environment and food quality. I will say comparable to Dragon Boat."}
{"text":"I came here with a few friends for some last minute dim sum before the end of my vocation in Toronto. I had low expectations to begin with but it went a lot lower during the service. 

The dimsum was decently priced with very small selection. We ordered around 12 dishes for 6 people, the food came fast but the quality was terrible. The food was edible but really bland and made badly. 

The one thing that really grossed me out were the bathrooms. Both the male and female bathrooms were wide open with urine and water all over the floor. Definitely will never come back here again."}
{"text":"???????????????
?????????????????????????????
?????????????????????????????????????????
?????????????????????????????????????????????????????????????
????????????????????????????????????????????????????
?????????????????
???????????????????????"}
{"text":"We came here for dim sum lunch today.  First of all the parking situation, in this plaza, is dire.  There wasn't any spaces, even after circling around for 10 minutes.  We ended up parking at the lot, across the road.
The place was around 70% full.  The tables are too close together, for a high end dim sum place.  Chairs were touching and we could hear the housewives' conversation, on the table next to us.
The food was ok, but not worthy again, of high end prices.  Rice rolls were too thick and not smooth enough.  Other dim sum were ok but had a bit too much MSG in them.  I was really thirsty afterwards.  We ordered a plate of suckling pig, at $32 I wouldn't order it again.  Meat was too piggy and not crisp enough.  Jellyfish was too soft, also.

I wouldn't really recommend coming here.  From no parking, to mediocre food and touching chairs.  It is trying to be high end and charge a premium for food and atmosphere but it fails on both parts."}
{"text":"Very cheap! Very below average. Haven't been there for a while and was disappointed to find that the quality has deteriorated meaningfully. It's a definite slippery slope from which many former glories may not regain traction."}
{"text":"I usually prefer dim sum that's rolled out to me in carts, but Noble Seafood does good dim sum to order.

The Steamed Shrimp Dumplings were large and plump. I found myself eating a whole basket of them instead of just sampling one of everything as I usually do during dim sum!

Rice Noodle Rolls (plain, shrimp, beef, and vegetarian) were also good, as were the Short Ribs, Chicken Feet, Pork Shumai, and Crispy Noodles with Chicken. Don't miss out on the Steamed Pork Buns and Salted Egg Custard Buns!"}
{"text":"I went there for dim sum. The Shanghai Dumplings were quite good. The egg tarts were delicious. I finished 3 at once. It is a decent place for dim sum, however no pushing carts, so have to wait for food."}
{"text":"We came here for family dinner...

Decor- very modern looking, a lot of purple... depends on your taste, some may consider it tacky but some may like it

Service - the service is pretty good.  They try to change your plates when they get dirty in between courses but sometimes they forgot when things get busy and you have to remind them.  I feel that like most Chinese restaurants, they bring out the course according to how fast the chef finishes preparing them, but not looking at the speed of how fast the patrons are eating. It seems that the dishes are competing with space on the table although it could just be that we ordered too much food. One time they brought out our steamed fish when we are still working on 3 dishes on the table and we had to ask the fish to be brought out later...then when that happened, the fish was just lukewarm. This is a common problem you see in Chinese restaurants though... not just this one. 

The waiters are attentive. At one point I counted 4 waiters at our table. 


Food...all the food are very well done, I like the geo duck- some type of shell fish. They prepare it 3 ways, sashimi, shabu shabu style and  deep fried. I find sashimi the best, the meat was crunchy and sweet. The left over broth from the shabu shabu was also great... it was sweet with a hint of the ocean. 

The meat dishes- beef with caramelized onion was very tender and juicy. The pipa duck was savory with mouthful of duck fat flavour and crispy skin. 

We also had lobster, the aforementioned steamed fish, as well as some fried rice. These were a bit less memorable as they were similar to other Chinese restaurants

For dessert we had some sort of mango yoghrty pudding that was very light and refreshing. I don't really know the name, but apparently it's something you have to order ahead of time.

I think overall, it depends on what type of dining experience you are looking for. Chinese restaurants are not known for their aimnience or services, but the food is definitely tasty if you know what to order"}
{"text":"So my friends and I originally went to another restaurant to find a table for 10. But that restaurant has a 30 to 40 mins wait time. Hence we chose this restaurant as alternative. We walked in and were told to wait for 5 mins or so from the get go. I like that. So wait time is acceptable. 

The venue is alright. Pretty clean and nicely decorated. However the space between tables seemed to be a bit tight. 

Food wise, nothing thrilling. We ordered a bunch of stuff and it's just average. So my rating for this place is a 2.5 stars."}
{"text":"Went back to this place to check if prior bad experience was an exception.  Well, no one approached me when I entered the restaurant and so I led myself to a table (and most of them were empty since it was before dinner time).  I took off my winter jacket and sat down.  I assumed that that would be a signal I had the intention of dining and I would promptly be given a menu.  I was wrong.  I don't quite understand the inattentiveness of the staff.  I put my jacket back on.  STRIKE THREE.  NEVER AGAIN!"}
{"text":"Well I guess I've been in a dim sum mood.  We went there last week or so and I forgot to write that I was pleasantly surprised that it was decent dim sum.  

the wrappers are better than ivan's or Number 2 restaurant on spadina.  The har gow were decent size but the quality of the shrimp were so-so.  What was really good was their turnip cake.

there were 3 of us and it cost us $40.  we usually get the deep fried tentacles, har gow, shrimp chun feung, turnip cake...maybe something else but I can't recall right now. 

Cheaper than driving up to Yang's we did this on mother's day but it's like comparing mcdonald's to a steakhouse.  yang's is the cherry on top and are in another category!

For the lower end calibre of dim sum, it's decent and on a pinch I'd go here and I think more than ivan's though I haven't been to sky dragon for a while and think I should go back to review it again."}
{"text":"Convenient, street-level location near the corner of Dundas and Spadina. Makes its money on Dim Sum where it is cheap on weekdays before 11 am (all items @ $1.85) but the quality is also very pedestrian. (notable: deep fried stuffed eggplant; siu mai; har gow; sticky rice; stuffed beancurd rolls). They do have a good lunch menu (12 - 3 pm) that offers a variety of fairly decent tasting rice and noodle dishes between five and seven bucks. Service is adequate. An OK Plan B where other, better restaurants are full or too far away."}
{"text":"Everything here is great except the turnip cake. That was terrible and had no turnips or shitake mushrooms in it...
Great prices, good location, comfortable seating. Go for the weekday deal, 2.50 every plate size."}
{"text":"I love the busy atmosphere of push-cart dim sum. But when I'm sitting there eating and seeing the same food lap the room again and again, I wonder how long the stuff I'm having has been sitting out. Noble is a la carte dim sum. It's made fresh and you can taste the difference. It's a little more expensive (barely!) than the neighboring places in Chinatown, but serves quality ingredients with noticeably better seafood. They have the best har gao!

I would have given a 5 star review if it weren't for the fact that they've recently changed their hot sauce to a worse brand. It's just not the same."}
{"text":"Never coming back to this place. We were waiting for a table of 5 and then a family of 5 comes in after us and the people working there gives the table to them first. We told them off and said we were here first and their reply was that the family had come earlier, left and came back. Don't even lie. The people who work here are full of bs. 

The food is not something amazing either. For the same price you're better off going to the dim sum place at silver star blvd which isn't too far from this place. Not much food selection to choose from. And on top of it the girl manager had difficulty knowing how to work the debit/credit machine."}
{"text":"I've been coming here fir several years. Had brunch here this morning. Great food, quick and good service. Can't wait to go back."}
{"text":"This is one of my favourite places for dim sum.  The food is fresh, the staff is courteous and fun and the setting is clean and roomy.  Har Gao, Siu Mai and the sticky rice are great but you have to try the chiu chow style dumpling.  Danny runs the place up front and can sort out most of what you need - except for the food coma that may follow your feasr"}
{"text":"Look at all those delicious dim sum!! Just like many other restaurant I really like their veggie dumpling. It has mushrooms and veggies in the dumpling. 

The bbq pork bun was a decent size and there was enough the bbq pork for every bite. 
The milk tart was very yummy. I personally don't like the to have so much edge so I removed most of it before I had it.
The steam rice noodle with bbq pork was good. Fried dough with the steam rice noodle and pork floss was not good. The steam rice noodle was very thick and they didn't have pork floss."}
{"text":"My worst dim sum experience. 

Food - no comment, at least it fills you up. 

Service - pretty good, that's why I give 1 star. 

They have before 11am special, S/M/L all 3$. We came around 11:30 so we missed the special. There was no other new customer after us. People only came because of the special, I think. I won't be returning. Even they for their special."}
{"text":"We've been coming here for years for dim sum.  I used to live in Markham and I'd say the dim sum here def compares.  The atmosphere is no frills, but the food is solid.  We usually come on my day off during the week for the cheap dim sum mon-fri where all dishes are the same price as a small before 11am."}
{"text":"I ordered via Uber Eats and it came to $30 for General Tao and some shrimp fried rice.  Price is a little high, but takeout would ease that total.

I'm not gonna sit here and pretend the food wasn't phenomenal.  Twas the real deal authentic chinese food (americanized obv).  I could taste the sesame oil.  There was only one giblet of rubbery fat but i flinged it to my cat so it is OK.  It also tasted great as leftovers.  I had it for breakfast.  Portion size was generous. I like that.  General Tao was SLIME FREE! (lookin at you tiki ming!) I like that.

My one gripe is that I didn't get a soy sauce packet or a chili packet.  At first I thought there had been some terrible mistake. You mean to tell me, you gave me the plum sauce packet for the spring roll, but you didn't grab the-- Okay. I'll take responsibility for not asking for extra packets, but how could you not hook me up with AT LEAST ONE soy sauce packet??? That light skinned fried rice needed the assistance.   

Fortunately, I had an emergency packet in my purse AND a handful of chilli packets I got from China Wok when the man's head was turned around cuz I was using the debit machine Sorry, yeah I did that, and I'll probably do it again. you KNOW those stupid no frills sri rachas DONT taste the same a those delicious wings chili sauce packets!  I called their corporate headquarters and I'd have to buy like 10,000 if I wanna purchase my own which isn't a problem at all, it's just the TAXES you gotta think of the TAXES! and the S&H.

Anyway, you still get 5 stars because UBER only charged my $20. I guess as an introductory savings. Will order again.

5 stars!"}
{"text":"I had dim sum here early afternoon on Saturday and was pretty disappointed. I had five or six things. Most of the dishes seemed really stodgy as if they had been reheated. The siu Mai were very dense and rubbery. I did like the Shanghai pork dumplings, and the chicken feet were tasty. It's reasonably priced, clean and comfortable but I wish the food had been better."}
{"text":"Fantastic Chinese, with much more than seafood.  The half duck, a specialty of the house, was very good - Moist, flavorful, we ate every bite. We also loved the large crab with ginger and green onions. Tender snow pea leaves were a perfect compliment, along with some chow fun (wide rice noodles). Everything was so good, the service was super fast and helpful as well. Definitely want to return."}
{"text":"This place recently changed hands, and the dim sum quality has sagged. Service still quick, but there are fewer soup dumplings with tougher skins per order and the har gow now are much less good. A pity, as this was my favourite place."}
{"text":"I would only come here for dim sum as anything I've ordered off the menu seemed inconsistent. Some portions bigger than others and they will only gone you complimentary soup if you fit their criteria of being Chinese. 

So dim sum:
- no fuss, no carts, just tick off what you want on the menu
- they have dum sum hours where everything is $1.80. Otherwise their all day dimsum isn't much more expensive. 
- decent English speaking staff
- cleaner than most Chinese restaurants in the area"}
{"text":"Good food but VERY RUDE service.

I've been here many times as a guest of VIP patrons but I WILL NOT BE BACK!! One of the black-suited female assistant managers should be fired or at least given a lecture on the definitions of \"service\" and \"tip\". Her behaviour was outrageous.

My family of 4 came here for lunch on a Saturday at 11 am. There was no line and at least 4-5 empty tables. That's already a bad sign for dim sum restaurants. 

We ordered 16 items and 1 special fried noodle dish. Not skimping at all. Our bill before tax and misc charges was about $90.

We bumped into our friend, the VIP patron, and she took our bill to the Manager to have the tea charge waived. We didn't ask him to do it. We didn't tell him that we knew Mrs. So-and-So. Of course, he did it immediately.

When it came time to pay the bill, my kids asked me what the $4 charge was for. In Chinese, it would translate as \"mustard sauce charge\". I told them that many restaurants charge for the small dishes of mustard or hot sauce. We realized that we had not received any sauces. That's when I had the misfortune of flagging The Waitress From Hell. She explained that $4 was for the table cloth, etc etc and began to rant that I must not go to Chinese restaurants much since all of them charge for tea and table cloths etc. HOW RUDE! I tried to smile and say thank you. Didn't bother to tell her that she was being a b1*ch. 

When she brought the change, she stood next to our table and watched to see how much tip I would give. The change was $18: a $10, a $5 and coins. My daughter told me to just take the $5 and leave the rest. That would have been giving a tip of $12 + the $4 mustard sauce charge. More than $16 tip for a meal of $90 is more than 15%. At a Chinese restaurant at lunchtime? 

When she saw my hand touch the $10 bill, the Waitress From Hell descended on me and began a 2nd lecture about the need to give at least 10%! She also badgered me about who had given us the tea-charge waiver. I told her that her boss had given it. She turned heel and immediately went to berate him.

As I left the restaurant, I could hear her complaining about me! WTF!

Oh well, I'm at home with my family now, enjoying my weekend. And The Waitress From Hell is still stuck in Hell or dragging other customers INTO Hell."}
{"text":"It was my last day in Toronto, so I had to try dim sum! I came across this place while exploring Chinatown. I like how they have dim sum all day since it's usually a morning thing. I sat down and had some tea. It was good but rather light. I ordered 4 small plates. The rice noodle with chinese doughnut, har gow, rice noodle with shrimp, and shanghai pork dumplings. My favorites were the pork dumplings and har gow. The item that was least authentic was the rice noodle and chinese doughnut. The doughnut tasted nothing like it should have and was super dry. Overall, the dim sum was good but not the best I've ever had. The place was clean for Chinatown but the service was lacking. The servers didn't speak to me at all. Only when I ordered. I guess that's pretty typical but I was hoping for a friendly hello/thank you! Prices are about average. I spent ~$15 total. I was also glad they took US dollars."}
{"text":"It's sort of hidden if you don't further west on Dundas at Spadina but it was easy to find. Came here with my girlfriend. 

What we ordered:
- Har Gow
- Siu Mai
- BBQ pork buns
- Squid Tenacles
- Onion Pancake
- Shrimp Rolls (Deep Fried)
- Shrimp Dumplings (Deep Fried)
- Cheung Fun? (Sorry if I butchered the name but it's the one with the shrimp rolled up in a white pastry and drowned in soy sauce)
- Mango Pudding

Pros:
- Cheaper menu items
- Less packed
- Speedy service
- Take out available if unable to finish 

Cons:
- Teapots that drip tea when being poured
- Workers lack English (some)
- Our waiter didn't return with our change and kept it as tip without informing us. It was $10 in change and he kept it until I flagged down another waiter to ask about our change. 

I would definitely come back IF the waiters weren't so greedy for tip."}
{"text":"The dim sum is mediocre to bad. 

They are a serial breaker of health inspection codes. This includes the always dreaded \"inadequate pest control\"

There are many better options in Chinatown"}
{"text":"Had their dim sum menu and it was good. From all that my friends and I tried their flavours were on point. The prices are average and location is great~ off of the main road but simple to find. We asked for steamed chinese broccoli which wasnt on the menu but they made it for us!"}
{"text":"My favourite dim-sum in the city! 

I love that it's all day, the food is great and the prices are fantastic. Service is always lightning fast, even when they're at their busiest. I go at least 3 or 4 times a month alone to hangout and read for a while and maybe once or twice a month with people. They don't seem to mind me holding up a booth on my own for a few hours as long as they're not busy (which is really only during the lunch rush) and don't bring me my bill or rush me out the door until I'm ready for it.

The regular dinner menu is also great. Good selection and quality for the price. If you're looking for chummy servers that pretend to be your friend for a couple hours, I would try Red Lobster. But if you want polite and efficient staff and to fill up for no more than $10 a person, Noble is awesome."}
{"text":"This is my favourite dim sum place in Toronto (not that I've tried them all or anything.. maybe someday). 
It's reasonably priced. During the week S/M/L dim sum dishes are only $2.50 each, XL dishes are slightly more. It costs more on the weekend, but not much more. 
Most importantly, the dim sum is super tasty. I find that the shrimp here tastes especially good- shrimp at other Chinatown spots sometimes has a kind of strange or slightly off taste, but at Noble it's very yummy. I usually end up getting a lot of shrimp stuff (har gow, crispy shrimp roll, shrimp and chives cake, rice roll with shrimp). Other non-shrimp favourites are the BBQ pork buns and pan-fried dumplings. I'm getting hungry just writing this review. I've only had dim sum here, so I can't say much about the regular menu dishes.
The service is fast and usually friendly. 
And, of course, it's way less busy than other well-known spots in the area (cough, Rol San, cough) ... but the trade-off is that it's not open as late."}
{"text":"In a scale of 1 to Chinatown to North Toronto/Markham, I would rate it as Chinatown. It is about what you expect for the area in terms of food quality, service, and price.

Wanting to break from always going to La Casita for dim sum (wonderful place mind you that's not well known compared to Rol San), I decided to take a friend here for dim sum before going to the ACC. As I said previously, I've already accepted the fact at this point the food quality won't be as good as the gems in Richmond Hill/Markham/North Scarborough.

We ordered the usual dim sum: Har gow, siu mai, curry cuttlefish, beef tripe, etc. The taste was about your average Chinatown quality, although the siu mai tasted a little \"off\" compared to your usual siu mai in other dim sum places. Hard to describe it in writing, but if you try it you'll know what I mean.

Service is about what you expect; they ask how many people, they take your dim sum menu, and they give you the bill when asked. That's about the extent of communication you'll get here."}
{"text":"3.5/5

Noble Seafood is, from what I can tell, not related to the one in Toronto Chinatown. It might be, but this place seemed way too upscale to make sense.

Either way, I came here for weekend dim sum after discovering a new restaurant hidden in the same plaza as Cafe Hollywood. At a Sunday at 3pm, this place was still about 3/4 full, so business is definitely there.

The dim sum menu is quite standard, which I was slightly disappointed as I expected a couple of unique items for a restaurant of this caliber (think Dragon Boat). Their steamed rice noodle rolls were very good, and I definitely recommend ordering at least one of them. The har gow and siu mai were also decent, as well as their chicken feet, beef balls, and curry octopus. However I didn't find the fried tofu a good combination with the beef tripe.

Price point was, not surprisingly, higher than your typical Chinese restaurant, although they're not as high as the $$$ places like Dragon Boat. I also found service a bit lackluster, considering a couple of employees only spoke Mandarin and not a word of English.

Overall it's a decent place for dim sum, it's something I wouldn't say no to. It definitely won't be my first choice though considering the options I have in Markham."}
{"text":"Came here for dim sum and for those who like it short and sweet, I will not be coming back again nor would I recommend this place to anyone. Even though it's downtown, the are still dim sum restaurants better than this one.

The steamed items were quite bland but to each's own. The fried items were horrific. The deep fried tentacles were insanely greasy and salty. All the deep fried items shared the same taste - nasty old unchanged oil flavour.

And to add insult to injury - service or lack thereof, even though it was a Monday afternoon and the restaurant was not busy."}
{"text":"Very casual restaurant.
Staff seem always in rush food is great for low price.
Staff seem to be a little inattentive, I had to wait 11 min for someone to take my order.

I had sizzling satay beef
Vegetable fried rice 
Coke
Hst
------
$27.08"}
{"text":"Me and my girlfriend went here to get dimsum in the morning and my experience there was good. The food is great and fresh, their dumplings is top notch and the best dumplings I've ever had in my life. The price is pretty cheap we had 11 choices and the total was $30"}
{"text":"Definitely more than just seafood! Had a pretty good meal today:
1. Soy Sauce Chicken - Had a half chicken that was smooth, juicy and flavoured really well.
2. BBQ Duck/BBQ Pork Plate - The pork was half lean and half fatty. I felt like it was a little overly fatty in this case. The duck was really good though, the meat had a lot of flavour. The sweet and sour dipping sauce was nicely balanced.
3. Sweet Pork - This was not your average sweet and sour pork. It was a darker sauce which made it less sweet and more savoury and tangy. The big chunks of meat, peppers and onions all sat on top of a crispy spring roll wrapper. There was also a garnish of lychees which was nice to cleanse the palette.
4. Steamed Garlic Lobster with Vermicelli - This steamed lobster was way better than I thought it would be! I'm used to the the ginger and onion lobsters that are slathered in sauce and that you can seemingly see the taste of it. The steamed lobster looked a little more demure but it was jam packed with garlicky goodness which also carried on to the vermicelli. 
For dessert we were treated to sweet purple rice soup with taro, coconut flavoured jelly, and lotus seed paste in flaky pastry. I'm told the desserts can change nightly.

The inside of the restaurant is pleasant. It's got some of that Chinese restaurant tackiness (kind of a retro colour theme) but the table linens were clean, the fish tanks were clear, and bathrooms were nice which was good enough for me. I will note that the bathroom taps don't have warm water which is kind of painful in the winter. We started our meal around 6:30pm and it there were some empty tables till about 7:30pm. Making a reservation for a big party might be the safe thing to do."}
{"text":"Everyone talking about lunch/dim sum, don't be overlooking their dinner as it's da bomb.
 
Large portions, inexpensive and their daily lobster special. 2 lobsters plus 2 dishes of your choice for under $60, that's right, you heard right, ain't no joke when it comes to lobsters.

Been to for dinner at least 3 times and never disappointed. Lobsters and steamed fish always cooked perfectly.

They even give you free soup at beginning of meal and free fruit at the end of meal.

Free parking in Chinatown after 2100 or pay $3/hour before, no excuses, get your lobster groove on

Don't believe me, look at my photos, the clock is ticking..........."}
{"text":"Very good dim sum , the early bird special is of good value, the rice rolls are done right, we came here for one of their dinner special at $598.00 for 10  people. Our table were totally wowed by the quality of the food, we immediately want to book another dinner, kudos to the chef, all items arrived piping hot. Andrew the manager check on our table throughout the evening, and our server Yan was very attentive, this level of service is rare to find. This restaurant has become one of my favorites."}
{"text":"3.5 stars. Decent dim sum, would go here again as a opposed to Rol San, just because it's not as crazy busy, service is better too. Food quality and pricing is the same (ok food, cheap price). Most dim sum menu items are \"large\" and cost $3.08.

We had the usuals, har gow, shiu mai, pork buns, shrimp rolls, squid in curry sauce and a mango pudding. No complaints about anything, it was all good, but nothing was outstanding."}
{"text":"3.4
Although the menu is shorter than several places around
the quality of the food is ok and better than places like Gourmet Restaurant."}
{"text":"Came here with my family, the restaurant is pretty spacious, this is the only restaurant in Chinatown where I didn't have to walk down to the basement to use the washroom. Great service and very tasty dim sum, loved the price !!"}
{"text":"I always get dumplings and dim-sum here, brought here by gluten-free friends for brunch.
Very busy at times lots of families, especially locals to the Chinatown hood which confirms your trust in its value.
Everything was great except for the hot & sour soup.
Love everything else!"}
{"text":"Dim-sum to order all day. Because of it's more hidden location just west of Spadina on Dundas, most people seem to know Rol San a lot better. To be fair, Rol San also has a lot more choices. 

The menu here is easy to navigate as they are divided out by fried food, steamed food, desserts, etc. They use a bamboo steamer and some stuff are pre-steamed (already sitting on the steamer), like the siu mai which came right away,and some stuff they steam it for you after you order it, although you can tell they've been pre-cooked and it's a bit mushy. The stuff comes out piping hot! 

Good place for my favourites like chicken feet and shrimp and chive dumplings. Portions are actually pretty big. The total for us was about $20 before after tax before tip. We had
- chicken feet (great)
- siu mai (great)
- chive and shrimp dumpling (good but mushy)
- black bean pork ribs (great)
- octopus cooked with shrimp paste (no good)
- scallop and seafood soup dumpling (no good)
- chicken sticky rice wrapped in lotus leaf (good,but small)"}
{"text":"Good:
1. Dim sum - Good portions, tasty food.  Mid-high end fare done right.

Neutral:
1. Seating felt kind of tight the few times that I've been with big parties.  The restaurant is not that big.

Worth it?
Not too bad.  I like the food here so don't mind the premium that much.  Spent close to $20 per person for dim sum so it's a little on the expensive side."}
{"text":"One of the better Dim Sum places in downtown China Town. Prices are good if you arrive before 11am on weekdays -it's their happy hour, less than $2 which is cheap in Dim Sum eating now a days. 

I always prefer Dim Sum restaurants because there are a lot of old people just chilling and enjoying the simpler things in life. As I have mentioned before, I have a sweet and soft spot in my heart for the elderly. You often see them walking in like if it were their home. They often fill up their tea mugs and take additional tea leaves home and this is completely fine with the restaurant owners which is a wonderful thing to see. 

Food is excellent. Hot sauce is just Spiracha -most people couldn't tell the difference anyway. It is not the typical Dim Sum hot sauce that most places provide unfortunately. Regardless, all of their food is very well cooked. Big large portions. I would recommend the Pork Dumpling, Ginger Chicken Steamed Rice and the Ho Fun -really light, delicate and shrimpy goodness. Their Xiaolongbao is also really good. This is pork dumpling with soup inside, just ask for it, it will make you look really cool and cultured..."}
{"text":"Noble Seafood is the newest restaurant that specializes in high end Cantonese cuisine. 

I love the brand new decoration. You won't even recognized the previous business Fung Lam Court. And the brand new menu. I hope you like sea cucumber, bird nest, shark fin for menu for 2....

We ordered a la carte instead.

Daily Double boiled Soup ????($10) 
House Special Poached Chicken ??? ($16/half)
Stir Fried Groupa with Veggie ??????($30)

The food all tasted good. Good ingredients and preparations. The taste is clean and fresh.

The complimentary dessert though was poorly executed. And even for someone that does not have a sweet tooth, I found them bland and watery.

Dim Sum Special daily with Early Bird Special till 11 am.

Hopefully they would have more set dinner special, what they offers now just a little too rich for me as my usual spot for casual dinner."}
{"text":"Great lunch time deals. Not bad for the prices. Dim sum was good enough. Congee was good too. I wouldn't go for dinner dim sum tho. Not worth it, the selection is smaller and the prices go up. Their regular food looked okay when I looked at the other tables."}
{"text":"Garbage restaurant. The waitor asked for tip. The food is overpriced and low quality. And when I gave low tip, he was very rude and asked me all kinds of questions as to why I gave low tip and raised his voice. Will never be back."}
{"text":"Was there on a busy night for dinner. Horrible service that is expensive. Unresponsive staff that are ignorant and dont care and seem to think they are entitled. Waited for so long for our food and the excuse we got was its busy. Well, its busy everywhere and we do not have to wait hours for our food. I saw other tables got their food before us and they arrived after us. They seem to have no system if a bad one in running the restaurant. This is probably the worse Asian Restaurant I've been to. Obviously I would not be returning. We have been t restaurants where the service was slow and we would complain the manager would go in the back and immediately rectify it and have our food out. This was not the case."}
{"text":"I've been here a few times for dim sum. It's not bad.  Pretty much standard dim sum. Not the worse, not the best, but definitely in the top half of places I've been.

Location. 
Kennedy in between the mess at steeles and 14th avenue

Parking:
Parking can be a problem apparently. There's such a turnover with patrons at all the restaurants in the plaza that I've never not found close parking

Decor:
Purple's. Silver accents. Feels like a modern retro vibe.

They have small 4 person tables and larger 12 person tables. 

There's the requisite seafood tank at the back. The geoducks still make me smile :)

Reservations:
Yeah, make reservations. You might have more luck with a larger group. I noticed an 8+ table free the whole time we were there. 

Food:
Typical dim sum stuff you find anywhere.
Love the rice rolls and pork bun was soft and fluffy. I find the pumpkin congee is watery though

Price:
We filled out bellies full and with tax and tip it was 11.50. not bad at all. 

Everyone enjoyed themselves.
Ill be back."}
