{"text":"I love being able to grab a real Americano steps away from the Bloor GO Station.  It's a tiny but super cute place with a friendly vibe and free wifi.  The only lady (owner?) I've met who works there is warm and genuine and I always look forward to going there when I'm in the West End.  I also love the perspective of the intersection when sitting in the window here.  I hope this place stays..."}
{"text":"Great staff on Thursday May 25..
Friendly, easy going.
Nice corner spot.
Excellent flat white."}
{"text":"My favourite coffee spot in the neighbourhood! I love their drip coffees and gingersnap cookies. The atmosphere is also great for a quick hangout or catching up on some work. I only wish they were open on Sundays."}
{"text":"Update: I've now had some of the food (sandwiches, egg cups, baked goods) and I can confirm that it's the best lunch spot in the 'hood."}
{"text":"Biking along Bloor looking to get my coffee fix, I happened onto Noble Café. For breakfast, an americano, a Sammy and a loaf. Enjoyed the Sammy with the Americano. Service was excellent. They have Wi-Fi. Wi-Fi speed tested at 37mb dl/9mb ul. That's better than most. I'll be back!"}
{"text":"Delicious sandwiches, scrumptious pastries, soul warming vegan soups and wonderful coffee. This place is an absolute gem. Amazing service, free WiFi and an entertaining view of confused drivers blocking the intersection outside. I go here nearly every day. The breakfast Sammy is highly recommended."}
{"text":"It's a blessing and a curse that I live around the corner from Noble. It is nice and cheap to make your own coffee and toast at home while you watch the daily show, but when your local Barista pours the best coffee on this side of the Atlantic, you almost want to always wake up an hour late for work.

First time I went in, I asked for an Americano, short on the water (because I'm too embarassed to have to explain what an Allonge is to every Barista), but then he corrected me with what I actually wanted and it was perfect. Every time, it's full and balanced tasting, never watered down or acridly sour tasting like so many shops around town.

Bless this place with their unpretentious vibe and serious skills behind the counter. Long may I have late nights and late mornings only to be saved by Noble."}
