{"text":"Although the food is good they are slow. Not just one or two times ... three times. What's the point of calling in your order if they give it away ... what's the point of calling in a order and they never even put it in their system. Even eating in is a long delay. Nobu Tei u need to fix this."}
{"text":"I am a repeat customer and I love everything they have to offer. They make great maki rolls. You have to try the crispy duck with curry. By far one of the best duck meals I've ever had."}
{"text":"Came in at 12:08pm and left with my take out at 12:18pm so I could get back to work and eat. 10 minutes for pad thai isn't bad at all.

Can't attest to the service (like it would be if I had dined in) but the bartender and server both seemed pretty friendly. I was in a bit of a rush so I didn't make any small talk, but there was a guy at the bar who was chatting with the bartender.

Pad thai was hot and really good. (Eat it while it's hot! The microwave is not worthy of reheating good pad thai, no matter how good it was before reheating.) The texture was just chewy enough but not overly sticky, and the flavor was great. I chose the non-spicy one and I really liked it.

Gave it 4 stars just because I didn't experience the full dining experience so that's how I rate."}
{"text":"It's no Wasabi or Bennihana. So in comparison to the popular sushi/habachi restaurants nobu lunch portions are small but gives you more meat were as the others I think give you more rice and vegetables. 
The yum yum is sweeter. And prices are a bit lower then the other popular spots. 
Decor and vibe had a young hip social feel, especially during the lunch hour. All in all I may come back to try dinner service, nothing extremely special about this place though."}
{"text":"My favorite sushi spot in Cleveland so far. Loveeee this place. The quality of the sushi is great."}
{"text":"I was recently on a business trip to Solon and this was close to my hotel- so why not- I'll give it a try. It did not seem authentic at all. I got the green curry fried rice. On the menu online the description says it has peas and carrots. Yea-no! The real version had neither. I ordered with shrimp. The shrimp was over cooked and rubbery. Also had the beef salad which wasn't bad. But nothing to warrant more than 3 stars. The only positive was if you want to order for delivery to close by hotels they do deliver."}
{"text":"A friend and I met for lunch recently. The restaurant is large and divided into three areas...front area, middle section with sushi bar and a backroom area.  We were seated in the middle area with the sushi bar. Tables are for two and very close together, we could hear the entire conversation next to us. Huge pet peeve of mine. Next time I'll ask for a booth in the front room, problem solved.

However, the food was very good. I ordered the ginger tea (freshly grated ginger with a bit of sugar) ..it's a bit on the spicy side because of the fresh ginger, but I enjoyed it.
Even though the Drunken Noodles are not on the lunch menu, the waitress said I could order a lunch portion. I ordered mine with tofu, large serving with a very dark, delicious sauce...not swimming in sauce, just the right amount.  It's a different recipe than most drunken noodle dishes, small slivers of green pepper & onions, thai basil tossed with that smokey brown sauce. Divine!

The green side salad is head lettuce with a ginger salad dressing...nothing earth-shattering, but the crisp salad greens and tangy/sweet dressing are a great foil for the spicy noodles.

I would go back once a week for those drunken noodles if I lived closer!"}
{"text":"No clue how this could be a 4.5 star rating. Not close. Had dinner carryout and the experience was not good on any level. I was rudely made to wait for almost 5 minutes when I called. They didn't even put me on hold and I had to listen to kids yelling and conversations for nearly 5 minutes. Ok... not the worst thing. Next, no sorry for the wait, just what is your order. I gave the order, she repeated it, said 20 minutes, thanks, click! Didn't even wait for me to say anything. Ok...not a good start... Went there and it was empty yet got no smile or warm greetings. Why was she so rushed on the phone? Maybe the food will make up for it. Nope. The Pad Thai was fair. Not bad but not classic Pad Thai flavor. Way too much lime and not enough fish sauce. Next was 6 different sushi rolls and salmon sushi (on rice). The sushi was all fair at best. The rice had a peppery salty flavor that we all disliked. The rolls were bland and textures weren't good. Even the plain salmon on rice was ruined by the off tasting rice. All in all not good. Maybe other dishes are better but if you can't make good Pad Thai or sushi rice you've got some issues. Definitely won't be back soon."}
{"text":"I'm so impressed with this place! The decor is beautiful and modern without being cold. The lunch menu is very reasonably priced and the bento boxes are a great deal (and delicious). Their Hibachi section is divided into private rooms which would be great for big parties. Most importantly though, the staff is unbelievably kind and attentive and the broad menu is good on all fronts."}
{"text":"This is a nice little restaurant tucked away in Solon with sushi, hibachi and Thai options. Their sushi is honestly not the best in the world and can be pretty hit or miss. In general I was satisfied with my Maki combo C but the combo A has huge chunks of fish and just isn't appetizing. The ginger fried rice is also REALLLY good and a must try."}
{"text":"This place was a very good restaurant. The flaming sushi was delicious and the Gyoza was also very excellent . They just got their liquor license too!  My son had habachi  and it was very good also. Definitely will come back."}
{"text":"As someone else wrote beforehand the Mama roll blew our mind and the moon fire roll was like off the BBQ. Sushi and sashimi deluxe was awesome. Quiet unknown place, for now..."}
{"text":"We absolutely love Nobu Tei, it's a gem. The service is great (especially Mona). We recommend the sushi, all of the soups and the green curry is top notch. It is our new favorite go to restaurant."}
{"text":"Nice people, a variety of seating arrangements, huge menu, good quality! Large assortment of tasty apps for after-movie munching."}
{"text":"If I can give rate it 0 star, I would. I've never been to a restaurant with such bad experience. The service is really bad like you owe them the money. Hey, we are the customers! There's even no one around to serve you after all the dishes been served. I leave them with no tips! Yes, first time no tips at a restaurant and they deserve it. Would never come back again!"}
{"text":"This isn't the worst Asian restaurant I've ever been to, but it wasn't good or even mediocre. The sushi was about a 6/10, which isn't bad, but the overall atmosphere was very whitewashed. This whole restaurant was playing things way too safe, and it felt like the food was geared towards white people that don't like foods from other cultures. 

The atmosphere was that of a depressing nightclub that wasn't successful enough for the Vietnam war veterans and suicidal emo kids. The music was rap music and crappy pop music, and they were playing Keeping Up With The Kardashians on the TV. Having TVs in a Japanese-Thai fusion place is kind of weird in the first place, let alone having a Japanese-Thai fusion restaurant to begin with, but if I'm eating some warm fish that tastes like some parasites are going to kill me from the inside out, over some rice, I don't want to look at some plastic looking balloon ass stretched across a flat screen TV."}
{"text":"My daughter and I stopped in for lunch. Upon entering the hostess was at the bar asked from the bar was it just the two of us, upon answering he motioned from the bar to follow him.  Once we were seated another couple came in was seated.  The waitress went to their table and immediately took their order, maybe because he was a regular.    Our waitress (whom didn't introduce herself) eventually made her way to us. We ordered and our food came out in a timely manner.  The food was good, the price was about average for sushi. The service no so good, we had to ask for chopsticks, soy sauce, eel sauce and water.  The have a very limited bar and no cocktail menu.  I would probably not go back to sit down and eat maybe order to go."}
{"text":"Just visited for lunch.  A little slow to get seated at 11:30am, but the food makes up for it.

Our group started with the Cowboy Sushi Roll, which hit the spot as a great appetizer. Especially the jalepeno pepper slices on top.

Continued with Green Curry Chicken.......spicy.....enough to generate a tear, but very tasty (I prefer spicy dishes, even the ones that challange me).  Other folks had hibachi bento boxes, which were also well prepared.

Not the most inexpensive place, but great for lunch.  I haven't been there for dinner, but will soon......"}
{"text":"Came at 4:30 pm no one greeted me lady look and said they jus reopen I said well do you want us to wait she basically look at us like no that's when I exit and never return"}
{"text":"These people are rude and discriminatory. The hostess is beyond rude and I came In to place a take out order and she told me they were not serving food today... as she put out food for another customer. Needless to say I got lunch elsewhere. Try Akira or shinano, both are delicious and have gracious kind people who appreciate their customers."}
{"text":"First time eating in after getting sushi to go once. Each time the sushi was really tasty and fresh. Hardly anyone here tonight, seems really slow. Definitely out of the way of normal Solon traffic but worth it. Really enjoyed it!"}
{"text":"Nice environment, but that's about it. Not sure why this place has high ratings. Maybe it's better at lunch?

The sashimi from the chef's special (~$20) was clearly relatively old. You know, when you can vaguely taste the underside of a boat, and all the fish start to turn the same brown color, even if it's yellowtail or whatever. Not nausea-inducing but certainly not worth shelling out the cash. Cruel, but I've had better sushi and sashimi at Giant Eagle for $5.

I had the bento box, which was completely underwhelming with a mushroom \"broth\"... that had on freeze-dried mushroom floating near the edge. So, this is just lukewarm salty water? Yep. The spring rolls were also overfried into blandness. Teriyaki shrimp was decent but slathered in sauce to taste oblivion. And on that note,  the \"ginger salad\" = a few slimy pieces of iceberg with about a cup of ginger sauce slathered on top. Just. No. PLEASE be more sparing in your sauces! My tastebuds are still relatively healthy and don't need to be blasted to oblivion.

Sigh. Maybe it was an off-day. I really, really wanted to like this place. Is it so hard to get fresh fish in NE Ohio?! Okay, I know the answer to that. (Yes.)"}
{"text":"First night in Cleveland and had to get some sushi. Ordered the angle roll and red snapper sashimi.  

Great atmosphere and nice staff."}
{"text":"Amazing sushi. Loved the two rolls and tuna sashimi. Found this place randomly but will be back! Only recommendation is that they play music."}
{"text":"Imaginative rolls that are so tasty. Great fresh salmon sashimi. Definitely recommend this place"}
{"text":"Loved this place.  sushi was great and the Chicken salad with Ginger dressing was good too!  Service attentive!  Will definitely be back!"}
{"text":"I ordered for pick up and they didn't even get my order right. So I had to wait untill they made what I ordered. Once the food came, it was to be honest not the most impressive pad Thai I've had at a Thai food restaurant. I give 2 stars because I was hungry and the place looks awesome inside."}
{"text":"A little sushi and hibachi on a Saturday night.  Service was above average and our hibachi chef was very nice and attentive and tracked our server down for us when we needed water.   

Their ginger salad dressing was one of the better dressings we have had as was the fried rice.  They used lots of eggs in the rice which I like.  

Hibachi filet was a bit salty for my taste but cooked perfectly otherwise.  A decent sushi option in the eastern suburbs."}
{"text":"The sushi was excellent and the staff were incredibly friendly and accommodating. The prices are very reasonable especially compared to local competition like Wasabi."}
{"text":"No, worst service. 
We walked in and from the beginning were mistreated. 
We had one women come up and ask for our 'non' alcoholic drinks 
Ten minutes pass and as a different waitress passes by we asked if we could order and get a drink menu.
Fifteen minutes pass and yes we were able to give our order to again another waitress ( we had probably 5 different women wait on us )
So our food was good. No complaints there.
But the service left me to not return.
My friends ordered a sake bomb and throughout our dinner had asked twice for their order and the waitress said she was waiting for after our meal......?
No it never happened.
So just a strange situation. 
My group and myself was quite disappointed.
And we waited quite some time for our checks; I mean we could have walked out and they wouldn't have noticed, that's how we felt."}
{"text":"First time here and went for lunch. I had the fried rice and pineapple with shrimp. It was very tasty. Service was quick. Can't wait to come back and try a different entre."}
{"text":"By far the best Hibachi restaurant in the area. You are automatically served fried rice without an extra charge. Sushi is pretty good too. Staff is very friendly and they are now serving alcohol."}
{"text":"I had a lunch special think it was bento box or something that was a good deal and variety with sushi spring rolls chicken teriyaki rice and a salad for like 9 dollars. Everything I had tasted good service was fast . I don't think they have alcohol yet. They were also kind enough to make my sushi without cucumber as I requested . Service was quick, went for lunch ."}
{"text":"Okay so, I can count on two fingers the times in my life ive posted a negative review and this is #2.  With eating at Noble Tae a number of times over the last several months since moving to Solon I've never had anything but positive praise for the restaurant.  Tonight's experience deserves anything but praise......

I went in to order food tonight the restaurant had two tables so not terribly busy the hostess was in the back room chatting with the cooks that's OK I waited until she came out and I asked for the menu so I could order to go.  First she handed me the small sushi menu so I asked for the full menu she handed me the temp in Yaqui menu, again I asked have you changed your menu and no longer offer dinners like pineapple fried rice?  She gave me \"that look\", seated another group that had walked in and then gave me the full menu.

When she came back from my order I started by ordering the pineapple fried rice chicken and chicken yellow curry, before I could order the dragon roll she schooled me that I could not order both items.  I said I've ordered both before, \"no you can't\",  says she, they are separate I said I understood that they did not come together and we've eaten there are a number of times.  

She then said you're going to have to wait 20 minutes because we ran out of rice.... (ran out of rice in a Japanese restaurant?????). I didn't actually say that out loud but she continued that there were several tables waiting for rice.  

After recovering from her comment I said it doesn't really sound like you'd like to take my order.  She said I thought I should tell you that you're going to have to wait 20 minutes for the rice.  I thanked her and said I think I'll order somewhere else and left."}
{"text":"Great service and delicious food.  I got the Yakisoba and was very pleased since the noodles must have been stir fried at high temp - so it's not quite replicable at home. The Tom Kha had strong coconut flavor and the red curry my husband ordered was very tasty as well.  Great find in Solon.
---
Have been back several times and still love the food."}
{"text":"This place is amazing! The drinks definitely give you what you pay for and more! The waitresses are bubbly and outgoing and can be hilarious if you get them to talking. I see a lot of regulars in there as well as myself and I always have an amazing time. I can see there are obviously some people who are hard to please but that will be every where I guess. The sushi is always super fresh and the hibachi is extremely entertaining. Love this place! Btw the cowboy roll is my favorite."}
{"text":"Overpriced and nothing special. Says its about 2 dollar signs but would rate it almost 3 dollar signs. The crab salad came out and had hardly any crab meat."}
{"text":"This is a wonderful little gem not to be missed! I want to say I've tried everything but after coming to the green curry crispy duck my heart skipped a beat and I've been hard pressed to continue on.
We usually get a bite before the meal as well- You can't go wrong with the cowboy roll. Also, try the lobster roll when it's on special. What can I say, it's special. :) I'm not overly impressed with the crab/cream cheese \"Crab Rangoon\". It's ok. 4 pieces that go down quick for 2. If you're looking for something light it will work. 
They do a fun and tasty Hibachi and their sushi never misses. Highly Recommend!"}
{"text":"Well designed restaurant.    Had \"Holly ginger\" chicken.   Spelled wrong on the menu.  Overly salty.  Long wait for food considering there were three customers."}
{"text":"My husband and I stopped here before a movie upon the recommendation of my cousin who raves about it. We ordered the drunken noodles and 3 different sushi rolls. We LOVED the food. The drunken noodles where excellent and the sushi was excellent as well (and we are picky with sushi)! We will go back again for sure!"}
{"text":"Very good sushi and hibachi! The staff is also very friendly. Highly recommend yum yum roll and kimono roll."}
{"text":"This place is about walking distance from the hotel we were staying at. Pricing of the food was good for the most part. Me and family had hibachi tonight. The apps were relatively small compared to what I'm used to back home but wasn't too bad. I would come again restaurant was very clean."}
{"text":"Yo. The fried rice here smacks. Otherwise disappointed. Waitress here is rude, but the service slaps cheeks. If I could I'd spend more time at this place. They have weird chairs. If you're going Chinese just get fucking hunan."}
{"text":"Very good takeout...drunken noodles, pad thai, rolls (not greasy as they often ate at other places).  Will definitely go back."}
{"text":"Nobu Tei is lucky that they're even getting a star; their food is SO good, but their service is the reason why I can't rate them any higher. My friend and I come her weekly, yet they always greet us rudely, and make us wait too long to get seated when there are four open tables (and no wait line). The lady who always has her hair in a pony tail and who I'm assuming is the boss is AWFUL. She is incredibly rude and unkind. She makes me feel unwelcome and uncomfortable. I'm sitting at Nobu Tei right now waiting for a table because my friend REALLY wants to eat here even though Red Bowl sounds A-OK, and we have been waiting for ten minutes to get seated when there's no one else waiting in line, and there's three tables open... this is ridic man. Get yo shit together."}
{"text":"Tried to eat here today and waited ten minutes by door during lunch. Several employees looked up to see we were waiting but never greeted us. This continued and no one stopped over to give any indication of what was going on. Will not go back to give second shot."}
{"text":"Fairly good sushi/hibachi restuarant in Solon.

We ordered the sashimi deluxe and vrious hand sushi. All of them were fresh but nothing really blew us away. The sashimi slices were quite large and came with a good assortment. I would have told them to hold the fake crab meat if I knew it was on there. Came with soup so I ordered the standard, pre-made, seaweed salad which was a nice size.

Service was good and prices were reasonable."}
{"text":"I tend to get Nobu Tei over my lunch break. Can't beat $11 for a Teriyaki Chicken Bento Box (teriyaki chicken, fried rice/noodles, sushi, and spring rolls). I almost exclusively get take-out, so can't comment on the service, but the food is commendable."}
{"text":"Very good!   Quick service.  I'll be back if I'm back. Try the chicken drunken noodles   They were awesome"}
{"text":"Wonderful atmosphere and fabulous food. 
My family had hibachi and between the 5 of us we tried the chicken, shrimp, salmon and veggie hibachi. Every one of us really enjoyed our meal. I love that there are two hibachi grills per room so it is a bit more private than other hibachi restaurants but still large enough for parties. Our chef was great fun and did some cute little humorous things for the kids and they loved it. Wait staff was very helpful. My husband said \"I think I was asked about a refill more in this one meal than I was at the last 5 restaurants we have eaten at.\" We will definitely be coming back."}
{"text":"Love this hidden gem! We love grabbing sushi before a movie. Fresh sushi and delicious hibachi - the service is great and they're all so personable."}
{"text":"This place is many things; a bar, a Thai restaurant, a sushi place, and a hibachi.

What I can speak to is their ability to make good Thai food. The chicken and vegetable  pad Thia are delectable. We went there for the lunch time special and was nice. Tea came out hot and fresh as soon as we sat down and the whole production came with a cute little misso soup to drink for our short wait"}
{"text":"Stopped in for take out. Sushi was good! The staff was very nice and gave me a tour. Will definitely be back."}
{"text":"Seems I cannot find a bad meal....nobou tei is yet another gem my girlfriend and I have tried. I had the north Atlantic roll, which is affordable and delicious. Thought it was odd that I received this first because I also ordered the \"crazy angel\" roll......WOW, if you like sushi, this one is outstanding. Long time sushi rock fan.....nobly tei is better in my opinion. Girlfriend  ordered the salmon bento box which is a fancy version of a tradinional takeout combo. Good food and hibachi or dining is available."}
{"text":"My wife and I love this place! We come here often. Mona is the best!!!! I had just about everything on the menu and while they went thru some growing pains, we have always had a good time. I recommend the Beef Basil Fried Rice and Sushi specials. We're fans!"}
{"text":"Great Sushi and service. Very clean and friendly. I got mainly for sushi bit tried hibachi last visit and it was excellent."}
{"text":"Dinner portion was unbelievable! Yum yum sauce is light and very tasty. Different from anyone else's. owner was extremely nice and gave me an impromptu tour! Can't wait for my family to come in town so I can share this new great find! Very sexy sultry adult atmosphere! I can see it being the place to be for happy hour!"}
{"text":"Friendly staff and great sushi! Clean and modern decor. Lots of sushi combos and they let you substitute."}
{"text":"Great Sushi!  Very creative Sushi roles.  I eat here at least one time whenever I am in town."}
{"text":"Horrible service. Always have to wait a long time to be served, manager is not friendly, and they are completely understaffed. I do admit their food is pretty good, but when your waitress just stares at you when you politely ask for something, it's quite a turn off."}
{"text":"Admittedly, my boyfriend and I are slight sushi snobs--we think Ginko in Tremont is hands down the best Sushi in greater cleveland, although we will go eat at cheaper places, like Sushi 86 downtown. So, after reading reviews for Nobu Tei, we decided to make the drive down to Solon. 

The sushi was awful--I got a sweetheart roll, one of their specialties, and while the tuna on top of the roll was pretty good, the spicy tuna on the inside was flavorless--other than a taste like wet dog. I also got a philadelphia roll and an alaskan roll, and each one was full of salmon with a ton of chewy connective tissue. The salmon in my alaskan roll also tasted really off. The avocado in my rolls was completely brown, which is still fine to eat but not appetizing. I couldn't finish any of it, which has never happened before. 

My boyfriend got a shrimp tempura roll, which was moderately okay. he also got a softshell crab roll, and the crab was burnt. He also got a yellowtail roll, and it was inedible because the yellowtail was freezer burnt. Sushi-grade fish should never be frozen, let alone freezer burnt, so he couldn't finish his stuff either. We were both afraid of getting sick.

We got their pork gyoza, fried dumplings, and they were stellar, hence the 2-star rating over a 1-star. Perhaps their hibachi is alright, but I don't know. Their service is a bit lackluster as well, with one server in charge of the entire restaurant, which is sizeable. If anything, just don't get the sushi."}
{"text":"Their sushi is just amazing.   One of our favorite places to go in town!"}
{"text":"Best sushi I've had in Cleveland. I'm from California and was so bummed out when I moved here because of the lack of good sushi BUT I'm a happy camper now :) the mama roll is fantastic and the fire roll is out of this world, we also did chefs choice of sashimi and sushi and it did not disappoint either. We will definitely be back again!"}
{"text":"Hibachi was good. Fresh sections, wait staff was good. Cook was entertaining. Was there with a party of 6. Sushi was pretty good. Need to keep it at 4 stars as I have experienced some 5 star hibachi and sushi locations."}
{"text":"This place has an incredibly extensive menu coving pretty much all Asian cuisine. So if you want that type of food, go there! I've only had their sushi but it is fantastic and made right in front of you at their sushi bar!"}
{"text":"What am I missing? I don't understand the 4.5 rating. Yelpers please tell me what's the \"right\" dish to order here!

We had 

Eel cucumber roll - it's ok. Not a whole lot of eel to be found in the roll.

Bento box-steak - not bad, but the beef is more \"steak-y\" at Akira

Pad Thai -  it's ok. The authentic pad Thai should come out pale. Here it was served bright orange here. Even peppermint's has more dimension of flavors (among the Americanized ones). Map of Thailand is still the most authentic.

The audience sitting at the hibachi section seemed to have lots of fun! There were lots of happy noises coming out of the room. I suppose that's what drives the 4.5 stars?

Random facts:

- this place is really new. We sat by the window and there was no air-conditioning. They still have equipments wrapped in plastic behind the counter.

- Our server said the chef here is Chinese who's worked in Thai restaurant 20 years. 

Portion is big. I walked away full but unsatisfied.

In conclusion, 
In this area, (Solon, beechwood, chagrin falls, pepper pike)
If you want sushi, I'd go Shinano. If closed, I'd go wasabi.
If you want Thai, I'd go peppermint's.
If you want bento with steak, I'd go Akira."}
{"text":"The service is really bad. All my friends have bad experience there. Once my friend ordered his food, but his food was told his food forget to cook. At that time, we are almost done and almost going to check out. My friend didn't even receive a SORRY."}
{"text":"Friendly and fast service.  The food was awesome and the presentation was nicely done.  Great atmosphere as well."}
{"text":"Came on a Thursday evening and they were painfully slow. Maybe a total of 5 guests in the entire place when we arrived. We were asked if we wanted to sit in the dinning area or hibachi. We said hibachi and the lady asked to give her a moment and she asked a bus boy to set the room up. They seemed a little annoyed about it, but then again we didn't have reservations and they were having to set the room up for only us (and probably only us the entire evening). They were still polite though. We got a California Roll and it was fantastic.   The hibachi was great and our chef didn't take forever to come out and start cooking. The pricing was great as well- for $55 we recieved 2 soups and 2 salads, a steak and shrimp dinner with noodles, a chicken and scallop dinner with rice and a California roll made of 6 peices. This place is a hidden gem."}
{"text":"Nobu Tei is nestled in the strip mall near the Solon movie theater, which doesn't lend too much to its personality. But its so rare to get new restaurants in Solon, that we simply had to try! 

When I visited Nobu Tei with family, we were the only patrons in the restaurant. Our service was really quite slow, which is why my review settles at the A-OK of 3 stars. A singular pot of tea was also pretty expensive for the generic tea offered, which struck me a little odd. 

Nobu Tei is a fair addition to the Thai/sushi scene in the Solon area. Perhaps I just haven't found their sweet spot yet, but the food was just decent. The pineapple-fried rice, however, had beautiful presentation. It literally came served in a pineapple, which was unexpected and fun. Because our appetizers came at the same time as our sushi and our entrees, it was a bit of an overload of food. The next time I return, I'll be trying their pad thai, and hopefully their service kinks will be worked out!"}
{"text":"Average food at best. The sushi is what you'd expect at a grocery store or gas station. They obviously don't buy their produce every day because everything on my vegetarian wife's plate has been wilted. 

I would be willing to overlook because let's face it, it IS a strip mall Asian joint so not expecting gourmet quality. 

What's the worse is the ungracious almost hostile owner/hostess. The first time we went, she was yelling at the staff and slamming dishes on tables. The last 2 times she reminded us we were only 30 min from closing & needed to order fast. Honestly, if I needed a glowering Asian lady at my table, I'd go to my in laws!

They've lost a customer here."}
{"text":"Overall: 3 stars.  They opened recently, and they have a nice atmosphere, but they need to work on the Thai food and customer service.

Food: 2 stars.  The Pad See Ew and Tom-Kha-Gai Coconut soup were very bland and very below average.  The crispy spring rolls were weak too.  I didn't try the sushi.

Price: 3 stars.  The Thai noodle dishes were very overpriced at $15.  Sushi seemed priced right.  

Service: 2 stars.  I had a bad experience with ordering carryout.  I asked for the total price and she was too busy to find get for me.

Atmosphere: 4 stars.  The inside looked good, but I didn't eat inside."}
{"text":"A very good Thai and Japanese restaurant in Solon. It's in a strip mall, easy access from the highway; nothing special from the outside, but very nice inside.  I recommend the Bento box.  
(They also have hibachi, but I didn't try that, so can't comment.)"}
{"text":"Coworker and I were the third customers outside of the soft opening and glad we stopped in.  Hibachi was very good, staff very attentive and polite.  We were given a free sushi roll which was a meal in itself called the American Dream and samples of four different side dishes.  Decor was trendy and clean looking.  Very contemporary with muted house/EDM music playing in the background.   They staff seemed to genuinely want to take care of their guests while establishing a new dining option in solon.  Although they are still waiting on their liquor license it did not detract from the meal.  If you like Hibachi or sushi this place is a must.  Bring your appetite portions are large and prices are reasonable."}
{"text":"I'm giving a three because the food really did taste good. The curry was well-prepared, and sushi rolls were nicely formed (not mushy, tight roll, even amount of ingredients). And I do think the prices for the sushi is absolutely fair for the quality. 

My biggest issue is that I ordered a sunshine roll, which comes with tuna, yellowtail, cucumber, and scallions. They did not put any scallions in it, which I noticed because I love scallions and yellowtail together. When I told them they made my roll incorrectly, all the sushi chef did was sprinkle on some scallions. In my experience, most places would make me a new correct roll. You know, it was their mistake so they should fix it. So that was kinda unappealing. Just take the appropriate steps to fix your mistake next time.

p.s Nobu Tei sounds like no booty."}
{"text":"We came in on a Saturday afternoon. We had Sushi. Good choice. The place is open, nicely decorated and the food is reasonably priced. The sushi portions were generous, and the waitress can suggest specialty rolls if you want help. Simona (our waitress) was great!"}
{"text":"Very decent sushi and Thai in Solon

The bento box was great for the price. It came with two small Thai rolls with a Thai chili sauce for dipping, fried rice or lo mein, a 4-piece California roll, and (I chose) chicken teriyaki. It also included a salad or soup. 

The teriyaki chicken and vegetables in the bento box were very good. The chicken seemed to be freshly chopped off of whole breasts and there was an impressive amount of vegetables (carrots, broccoli, onions, mushrooms and zucchini) included.

After a little negotiation I was able to substitute the included California roll for an up-charge. 

The salad was swimming in dressing and could possibly be confused as lettuce & carrot soup. I had to request chopsticks, and they were the absolute cheapest chopsticks they could buy.

I also ordered a Mama Roll off their 'special maki roll' menu. After I left I took a to-go menu with me and found they have a lot more sushi options than what was included on the lunch menu. If you are here for sushi you may wish to ask for a menu that contains more of the sushi options.

Both maki rolls were good. The raw fish was fresh and the rice was very good. It included a very small amount of unimpressive wasabi and pickled ginger. They did fashion my wasabi into a little leaf shape which was neat though.

I saw three servers serving about 16 people at 7 tables. The servers seemed to bounce back and forth between tables so I assume tips are shared. When my food was delivered the one server asked me if I wanted some low-sodium ketchup; he meant soy sauce, and that mildly amused me.

The whole restaurant seemed pretty clean. The men's restroom was dimly lit, but clean.

Overall, I had a very good experience and will definitely return."}
{"text":"Chicken Satay was good. Enjoyed what sushi we tried. My Pad Thai came with red onions, which is not displayed on the menu description of the dish.  Given that I am allergic this was a problem. 
The service was atrocious. There were four young people standing around in whatever they had fallen out of bed in, playing on their phones ignoring customers. Not that the head waitress wasn't trying; she was great and made an honest effort to pick up the slack. 
The air conditioning was off. Given that it was a 90 degree day outside you could understand the discomfort. 
I would try eating there again, I just wouldn't expect much of the service."}
{"text":"Stopped here while visiting from California and was so impressed with the sushi. Had the Mama Roll and it pretty much blew my mind!!! The entire Special Roll menu sounded fantastic! The sushi was fresh and tasty and the service was warm and prompt. Totally recommend this spot!"}
{"text":"I can't believe how this place has changed in such a short amount of time! I have been here a few times and even invited family/friends from Colorado to eat here when the visited Ohio. The first few visits here have been enjoyable so I'm glad I waited for my review here.  This LAST trip though was anything but professional and courteous.  
     First off, we arrived just after noon about 12:15 pm and there was no one at the front counter but a radio playing the current rap and pop music station.  We are standing at the front waiting for someone to seat us as the sign implied and a hostess I believe quietly asked us from across the other end of the bar, \"Only two of you?\".  I looked at my roommate and then back at the hostess because I wasn't sure that's what she said and she asked this same question just slightly louder from across the other end of the bar.  
We replied, \"Yes\".  
     From across the bar she picked up two menus from where she was standing, turned around and away from us saying what I believed to be, \"Follow me, I'll seat you.\"   Rude on so many levels!  
   The \"hostess\" we had to catch up to literally picked the table right behind where she was sitting at the bar for us.  Not a big deal right now but this whole \"visit\" gets worse.  MUCH worse.  
    Hostess placed the menus down and said, \"Your server will be with you in a moment.\"  She didn't ask if we wanted any water or anything to that extent.  
  The bartender apparently is also a server as she walked up to us and asked what we would like to drink.  We both asked for hot tea.  This was a mistake because that bartender must have NEVER made tea with a tea pot before because she filled that tea pot to very top with water so much so that I could see the water in the spout of the tea pot.  She laughed and said, \"Yeah, I filled it up a lot so you could share it!\"  Excuse me?  As soon as we pour the tea pot it will spill!  She didn't care about that, or even ask if we wanted anything else, like water, and literally disappeared for a moment in the back before coming out the bar again.  Before the bartender came back though, the hostess thought this would be a WONDERFUL time to take a break behind the bar and eat lunch or something at the bar table where the employees work and pour drinks!!!  Also, I have never been to an Asian restaurant with rap/pop music playing and BET playing Fresh Prince of Bel Air on TV.  I honestly don't mind this music or TV but this is supposed to be a relaxing place to eat.  NOT SO.  This music and television choice was obviously for the employees enjoyment and not the customers because the hostess was sitting/standing behind the bar table eating lunch and watching TV.  
   The bartender came back and took our order for food.  We both ordered Miso soup followed by the Pad Thai as we were pleased by it the last time, I ordered the Calamari and my roommate ordered a California Roll.  We were disappointed again.  The soup was slightly warm at best and my Calamari for $6.75 looked like 5 medium/large sized onion rings! DON'T BUY THE CALAMARI HERE!  It was overcooked and hard.  The California Roll though was the ONLY redeeming and well made item so far. 
   What happened next was so surprising I still can't believe anyone in the restaurant can be this rude!  The bartender came up to me and said, \"I can take that away now.\"  I had no idea what she was talking about.  I dipped my last Calamari in the sweet sauce moved it over to my plate and she took the plate away!  RUDE!  She could not wait a minute before I finished!  what if I wanted to dip again! Nope, she already had her hand on the tray and took it.  One thing I would also like to point out that is disturbing and disgusting is that the dirty dish cart/tray is right in the dining room so we got to see all the dishes ten feet away because these employees must be too lazy and careless to take them to the back kitchen.  They must hate dishes too because that bartender/server THREW, not placed, THREW those dishes in that cart making terribly loud noises anytime she had a dish to discard and return to bar and play with her phone along with the hostess as well.  They were constantly on their phones.  UNPROFESSIONAL!  
   The bartender later came up to us after the California Roll and said, \"Are you guys expecting more food?\"  WHAT?!?! \"Yes! Our Pad Thai!\"  She went to retrieve our food, came back and actually handed the tray to my roommate for her to set down!! WOW! RUDE and UNPROFESSIONAL!!
 The Pad Thai portion was also smaller this time, soggy and just disappointing.  Plus they overcharged my Pad Thai by $1. I ordered Steak Pad Thai for $9.50, I was charged Beef Pad Thai for $10.50 on the receipt. Throwing dishes, on their phones, eating behind the bar, watching TV and probably NO ONE there over the age of 25!  We will not be back anytime soon and I'm so disappointed in this place because we liked it in the beginning. Two stars just for the Sushi. Take out only."}
{"text":"I am really feeling this place! 

They are very new to the Solon area, so new that the alcohol for the bar hasn't even arrived yet.  We stopped in here for a lunch break for some take out.  I ordered the pineapple fried rice with chicken off of their pretty large lunch menu.  I am not an egg fan, so I got no egg in my fried rice which was fine because I was surprised to find the rice also had dried cranberries and cashews mixed in.  I really enjoyed that! The chicken was grilled all white meat with a light sauce it seemed to be cooked in.  I chose the green salad as my side, paired with ginger dressing.  The salad was kind of underwhelming, just some greens and shredded carrots.  You can also choose miso soup or a mushroom broth.  I would like to come back next time and try the sushi! There is really no where else to get fresh sushi in Solon, so this place is a good addition!
The service was good and the staff was very friendly.  Next time we will call ahead to pick up our order, so that we don't have to wait there.  
They also have private hibachi rooms for events or birthday parties."}
{"text":"Excellent food and great people that work their! Sushi was phenomenal also the noodle dishes are delish!"}
{"text":"I would definitely recommend this to anyone looking for a good hibachi restaurant. The place was not busy on a Friday night which was shocking to me because the food was great and it was really nice inside. We went there to celebrate a birthday and they put us in a nice private room which was cool. The Chef did a great job and was super entertaining. We ordered Hibachi and some sushi rolls for appetizers (mama roll and California roll) and everything was delicious."}
{"text":"Came here with a group of 12 for a birthday. We called in half an hour beforehand, and they were able to seat us. Not surprising because it seemed kind of empty. Pretty standard sushi. Nothing outstanding. Service was pretty good considering we had such a big group."}
{"text":"Stopped in for lunch. Place is clean and wait staff was attentive. Food came out quickly, my ticket time for my entree was like 8 minutes. Filet Mignon hibachi lunch was delicious, steak cooked perfectly med-rare as I had asked. I sat at the bar but didn't see any booze yet, he said they'll have their licence in about a week (full bar). They do a lot of carryout business at lunch!"}
{"text":"Love this place!  Always my lunch choice with colleagues. Green curry shrimp is delicious!!"}
{"text":"Really great sushi.  Everything taste fresh.  The Cowboy roll and Moonfire were the favorites.  Will visit again."}
{"text":"Great food and wonderful service. Enjoyed the sushi and curry dishes. Great flavors and menu choices."}
{"text":"I really like this place! I think it will be even better once they get the alcohol in. 

I went here with my family two times and we ordered a large variety of things. From the appetizers like the tempura, fried rice and chicken satay--to the entrees like the sushi, green curry, and bento boxes. Everything we ordered was at minimum, very good. The green curry and chicken satay though won rave reviews from my family--so much so that we ordered it twice!

I think this is an excellent choice for lunch or dinner and I seriously hope that this business succeeds because I think it makes a great addition to the Solon area!"}
{"text":"It's a quaint little place in Solon, and a fantastic little spot for lunch.  The decor is modern and chic, and I definitely like the design of the chairs surrounding the bar.  The lunch options were plentiful, all served with your choice of fried rice or lo mein, and of course your meat option.  It was less than 10 bucks - and it was a good helping, for sure.  I happened to be particularly hungry this afternoon and ate each bite, but many have been known to take leftovers.

You can start with soup or salad, let me not forget.  I chose the salad and what a tasty salad it was - a ginger dressing you can literally DRINK the remains of.  Seriously - people do it.  ;)

I had the chicken teriyaki which I must say, was jam packed in flavor more than many teriyakis I've had in the past.  It hit a nice little spot with me - not spicy, but not bland, and not that overly salty flavor you can occasionally encounter.  The vegetables were on point in texture and in variety, providing carrots, broccoli, mushrooms, onions, and the every now and again bite of zucchini.  The rice's texture was splendid as well - and flavor certainly on point.

My friends call this place NO BOOTAY - which is cute - but for someone who certainly has a bootay, I'll just say, they did not discriminate... har dee har har.

I would most certainly recommend this eatery for lunch in Solon.  It has been known to be hit or miss for service sometimes, but I know it's because they usually don't have too many working and probably get a nice steady crowd during those peak times.  If you let them know all the things you'll need ahead of time though, you should be set.  By this I mean silverware if you require it, lemons for your water, you know - certain people's staples.

Come one, come all - Nobu Tei awaits your company!"}
{"text":"I will definitely be going back. They offer Sushi, Thai, and Hibachi.  We tried the sushi rolls which were excellent and had some Pad Thai, which was also excellent (I've had Pad Thai from countless restaurants and this was up there in taste).  

They recently opened so give them a try.  Staff was extremely friendly and our food came out very quickly.  They are located between Di Bella's and Zoup off of Cochrane Rd in Solon.

Excited to have a new option for dinner."}
{"text":"Great sushi! Great service! Very friendly staff, and tasty and entertaining hibachi. Will definitely be back."}
{"text":"this place used to be pretty decent. not anymore. they have the worst wait staff i've ever experienced in my life. I gave them more than enough shots at redeeming themselves because my first few visits (over a year ago) were pleasant and the food was good. recently something has changed though. the woman who seemingly manages the place is always super rude. she throws menus at people, doesn't greet anyone, and makes people wait for ten minutes or longer as she plays with her phone. my most recent visit was around lunch time and the restaurant was empty. we were still made to wait extra long, even though the hostess had seen us. I decided to get her attention with a \"hello\", i thought maybe a little eye contact would accelerate the process, but no. she still sat there. we walked out."}
{"text":"Love, love Nobu Tei! Never disappoints whether dining in or out. We live in Beachwood and we go to Solon to get Hibachi, not a super far drive but we haven't really found a place here that gives us the same quality of food that Nobu Tei does. Would suggest this if you're a family looking for a good dining experience or looking to celebrate a birthday as well! The chefs are fun and very interactive--as most hibachi grills work but here they really make you feel welcome and overall it's a fun experience."}
