{"text":"Although I live in New York, I often travel to Montreal, and every time I'm there I have to go to Nocochi.   I've never had the food... I always go for one reason and one reason only: the cookies. They are little mounds of flavorful goodness that melt in your mouth. Because many of them are made with chickpea flower and cardamom, the densely packed, fine texture crumbles into a silky paste. They are flavorful, but not too sugary, and leave a clean feeling in your mouth. Although many of the pastries seem to be made with similar ingredients, each one is unique. It always takes me a while to choose which ones I want. Although the boxes of pastries are a bit expensive, there is a good deal where you can buy fifteen for 6.95. My all-time favorites are the mini baklavas, which have an extremely strong, exotic flavor, and the little white and brown balls with crumbled pistachios on top.   Although it is true that the service  between the counter and dining area is a bit confusing, the staff is always friendly and sweet."}
{"text":"Ordered the club sandwich with gluten free bread. It was absolutely delicious.  For dessert had the macaron and was regretting only getting two.  My friend had the corn coconut cake and it was awesome!!!  Also had the White Castle tea. It was sooooo good."}
{"text":"The \"white\" cafe's got its good points in Atmosphere, Service, and Food  Atmosphere:  Cafe Nocochi's has two prime attractions, it's location / decor and its pastries.  Nocochi is located on the conner of Sherbrooke and MacKay streets, right along the line of the high-end arts area of Sherbrooke street, which harks back to day when that area of Montreal used to be called the Golden Mile due to the riches it housed.  The decor is simple, clean, and egg-shell white (hence its nickname).  Very comfy seating, and arranged in such a way that conversations can still be intimate despite the relatively small size of the cafe.  Service:  Service is ok at cafe Nocochi.  Staff is usually made up of the local student population (Concordia University), and they tend to be pleasant and polite.  In truth, however, not much service is required aside from the staff bring orders to the tables, thus minimal interaction with the staff further solidifies the ambiance as a place one goes for a quite time!  Food:  Nothing special here - standard issue cafe menu is on offer with a selection of sandwiches, small pizzas etc.  Sometimes a hit and miss, depending on the cook's effort of the day, but most often there are more hits than misses.  Go to Nocochi for a  quite cup of coffee / tea and to sample their pastries (Iranian / French).  This is the biggest reason why you should visit.  They also sell their pastries to go in elaborate boxes and combinations, and these make for a terrific gift at the last minute.  A little pricy, but their presentation and taste gives them an aura of value that is always appreciated.  for a quite, tranquil time ~ a good place."}
{"text":"So many good things to say about this cafe. I have been here twice in the same trip while visiting Montreal and am already missing their delicious sandwiches, coffee, and best of all, petit fours. Nocochi has the BEST macarons I have had outside of France. They were perfect in every way- smooth, slight crunch outside, soft middle, and velvety fillings. Pate de fruit was also excellent. I had the raspberry, lemon, and currant. All tasted great. There was an interesting chick pea chocolate cookie with a tender crumb, a hint of chocolate flavor, and melt in the mouth texture that is a must try.   For lunch the three cheese baguette (chevre, emmental, mozzarella) with tomatoes, black olive tapenade and turkey did not disappoint. Also, the Nocochi chicken sandwich was very good and flavorful.   Overall, we had a great eating experience and enjoyed tasting the many petit fours after lunch. The only minus was the slow service. That's not to say service was bad, it wasn't, just a bit on the slow side. I wish there were more places like this one where attention to detail,  fresh flavors, high quality ingredients, and pride in craftsmanship is the focus. I can't wait to return!"}
{"text":"I had the eggs Florentine and a lemonade. The eggs were great - healthy yet tasty. The lemonade was very sour, but still good after I added some sugar."}
{"text":"Delicious omelettes and sandwiches. Croissants were excellent.  My daughter has celiac.  The staff was very accomodating. They had delicious brazilian cake that was gluten free.  They also had GF bread. Will definitely visit again."}
{"text":"Honestly, I've had more pleasing meals at McDonalds. Between the horribly uncomfortable chairs, the terribly slow service, and the cost, for me to give this a 3/5 would be generous. Then the food happened.  The tea never brewed properly, whether it was because it was stale or the water wasn't hot enough, I'm not sure. Either way, even after sitting for ten minutes it was insipid and boring. There were sugar packets on the table, but was there a single spoon in sight? Not a chance. I should have walked out at that point, but alas....  When I say 'the food happened', I don't mean that we had their food like one has a snack; it was more of an affliction of the mouth. We got baklava. Or rather, we got a small lump of soggy tastelessness that was called baklava. Now, don't mistake my meaning here, when I say 'small lump of soggy tastelessness', I really do mean every word. The piece was about the size of a quarter, perhaps smaller (and for 1,50$ no less!), and looked rather like a beigeish lump on a napkin. When I picked it up (apparently the have a policy of 'Bring your own cutlery', or at least it seemed that way) it just kind of...mushed in my fingers. I took a bite. It had less texture than cereal sat in milk too long. It was raining when we went in, and to be frank, it wouldn't have been any soggier sitting out on the patio; although it may have had more flavour, because as it was, it tasted like...well...nothing. I've had more pungent boiled potatoes and communion wafers. After the other half, I felt no fuller, had the texture lingering on my palate, and a stickiness on my fingers that I couldn't get off because the only napkin I was given was soiled by the 'baklava'.  To be quite honest, possibly the worst café experience I've ever had. And at 7$ for a pot of tea (don't forget the extra 1$ for a second cup!) and two bits of soggy detritus on a plate, I was feeling hungry for both my money back and something to eat when I left.  Perhaps it was a bad day, but I'll never know: There shan't be a second chance."}
{"text":"Very nice sophisticated feminine atmosphere! I would love to have a tea time with some of my female friends! They have a variety of tea selections as well as food menu including breakfast&brunch. I would like to come back and try the foods here.   As for desserts, I loved their tiny little sized of cookies which were displayed nicely. Just perfect in size so that I can try many things at a time. Since I visited this place right after a huge meal, I only tried 9 different kinds of their cookies(i am telling you these cookies are tiny) including the complimentary one they serve you when you order a cup of tea or coffee. They were pretty good, but not \"amazingly great\" because I do have pretty high expectation when it comes to baked goods. Personally, my favorite cookie among the nine was the squared chocolate dipped almond cookie. ;) The strawberry macaron was too chewy and stuffy.  I also ordered a decaf cappuccino and it was great, but again not a top notch. Next time when I come back I would like to try their espresso.   Overall, I really liked this place! What a lovely place. :)"}
{"text":"Came here for lunch while on the way to the museum.  Service, was very confusing.  They told us to have a seat and that they'd get to us.  We waited about 10 minutes, then realized no one was coming.  We ended up going back to the counter and ordering there.   While at the counter we saw all the delicious little pastries and cookies they have.  Couldn't resist and got a couple nut filled dates, nut filled apricots, marzipans and Turkish delight.  I also ordered the chocolate delight tea.   The tea and cookies came out way before our paninis, so we scarfed them up as appetizers.  The pastries were good, but the date and apricots concoctions I could easily have made myself (in fact I have) so probably not worth it.  The tea was not chocolaty at all, maybe a mild something chocolate, but barely noticeable.  Good, but not great.   Then came out the panini.  I got the turkey with cheese, pesto and grilled zucchini.  The zucchini was sort of lumped in one place, so what was pretty weird.  The pesto seemed non-existant.  The sandwich was ok, but pretty bland.  Nothing worth getting again.    Overall, based on my review it sounds more like a three.  Not sure why, but I really liked the atmosphere. Probably wouldn't come back here for sandwiches, but a great place for casual meetup with friends over tea and cookies (if that's your thing)."}
{"text":"Les boissons sont à recommander. The autant que cafe  La nourriture est calculée - pas généreux -et donc un petit-dej revient vite cher, d autant que tout est à la carte. Nous n avons pas essayé les pâtisseries mais les prix sont rébarbatifs."}
{"text":"Excellent, friendly service. Fantastic croissants and amazing (strong and smooth) coffee!"}
{"text":"I love the coffee here, and the pastries are very nice as well. Although the nocochi cookies are very overpriced and miniscule compared to other Persian bakeries."}
{"text":"I had really high hopes for this place, as its literally a block from my house... At the top of the street we've dubbed \"vegan alley\", Nocochi offers vegetarian and vegan brunch options and we decided to try that out today.  I had the two eggs with veggie bacon and sausage. It came with some tasty fresh fruit, some nice bread and preserves and a chick pea salad. There were also a tiny portion of hash browns.  First, the bacon and sausage were great. I'm pretty sure they were Tofurky brand.  The chickpeas and fruit were good, so was the bread and preserves.  The potatoes were massively over seasoned, far too spicy and luke warm, but they still weren't the worst thing.  During our time there, we never saw our server after our food was dropped off. Nobody came to check, or refill coffee, or ask how anything was - the only time we saw a server after food drop off was to collect our plates and pay.  If they HAD come by to ask, here's what I would had said - These are the worst eggs I've ever tasted, and that includes powdered eggs in army rations. They were wet, soupy, and weren't fully cooked, so you got that extra tasty raw egg flavour and texture.  Absolutely disgusting. I have no idea how you mess up scrambled eggs, especially when they were requested \"well done\"."}
{"text":"This is a pretty nice little cafe that's close to the Museum of Fine Arts. The food is decent (we had brunch on a Sunday morning) and the drinks were good too. It's a bit fancier than a normal cafe, so dressing a bit nicer is probably the norm here. The staff was very nice and service was prompt. As a heads up, it's also a bit pricier than some of the other cafes around Montreal, so be prepared when you come here. Overall though, it's a nice place and a good place to stop if you're heading over to the art museum."}
{"text":"I was charged over 7.50 for an almond croissant and a SMALL latte, which was nowhere as good as the lattes from Myriad down the street.   Seriously overprice and underflavored, save your taste buds and wallet for something else."}
{"text":"Great place for a summer lunch.  They are vegan and gluten-free.  I had the grilled vegetable crepe and my friend had the amerindian flatbread with avocado.  We also shared the Asian coleslaw.  Yummy and flavourful.  Light and delicious!  Two thumbs up.  Iced tea was ok but I really will come back and try the hot tea.  Quick service and nice patio."}
{"text":"Whereas most places around here seem fairly dim and recessed, Nocochi is bright and lively, with lots of natural sunlight and windows.  Friendly staff serves up pastries (try the Almond Croissants) that are devastatingly delicious."}
{"text":"Great place. The hot chocolate is really something special. These folks really know how to do macaroons. The only knock is the baked goods are really small."}
{"text":"A luminous and cute tea spot to contrast with a grey and rainy day. Nocochi is indeed a very cozy place, far from Myriade's buzzing atmosphere.   The choices of tea are very diverse, ranging from Persian, Chinese (the Tchai is recommended) is Japanese, without forgetting the English classics. Pastries and delicacies were also surprsingly good and will look like none of your usual teatime snacks. Indeed, Nocochi offers a mix of Middle Eastern and European biscuits and I strongly recommend their mixed platter if you are two.  Yes, Nocochi feels very cute and cozy. On top of excellent teas, the place offers a great and friendly service. Customers usually keep it low and thus contribute to making it a study/reading-friendly area. However, all ages are welcome and make you sure you hide in a blanket in the event you need to kiss your partners.  Moreover, the only grudge I hold is against the design. Although the white walls convey a very peaceful ambiance, the wall decors and painting are corny beyond imagination to the point of becoming disturbing.  Perhaps at its best on a rainy and lonely day."}
{"text":"Great food, amazing service. Was able to use my check in 20% off via yelp with no issues at all. Will go again once back in town."}
{"text":"I've been there for only a hot chocolate and a small plate of cookies. It was delicious.   Gotta come back for their regular/breakfast menu.  The place is nicely decorated. Service is good and quick."}
{"text":"Love this little tea/Iranian pastry shop. Very reasonable , & the service is very pleasant & courteous. Great way to spend an afternoon."}
{"text":"Good for breakfast but a little pricey for what we ate."}
{"text":"Staff was knowledgeable about Celiac n eating gluten. I was so happy. I had the Nonochi sandwich on gf bread and it was amazing. Their tea selection is very good. I had the white Castle tea n its so soothing. But the best part was their Corn n Coconut cake, you have to eat it to understand how amazingly good it was. I'm going back for more!"}
{"text":"I went to this cafe on a saturday at 3 o'clock. It wasn't too busy, which was nice. Their pastries were great and a they had a nice selection of gluten free ones which were specified on a separate list. Their mocha was delicious, a little small but worth it. Only complaint was the cost. It was a little high for the drinks compared to other coffee shops who give you larger quantities. Definitely going back."}
{"text":"The sweets were delectable, though the staff was the tiniest bit unfriendly. The nocochi s are like delicious dust balls. Eat them (despite that unappetizing description)!"}
{"text":"The desserts are tiny cookies, marzipan, turkish delights, and dates with nuts inside.  Very tasty and fun to look at. My favorite was the rose flavored turkish delight.   When i say tiny i mean tiny. I pretended to be a giant who just raided a pastry shop in a small european village after a day of pillaging. I could eat about 20 of these nocochis with ease.  I didnt try the food, only had dessert."}
{"text":"Love this very cozy place!    The coffee, atmosphere and service here are good.  Nocochi serves coffee with alcohol...a must try.  I tried their mini cookies.  They are so good and special but a little bit pricey.  I will certainly visit Nocochi again when I am next in Montreal."}
{"text":"Je travaille à deux pas et j'ai toujours voulu essayer ce café. Je suis donc rentrée un jeudi après-midi et j'ai commandé un thé berbère pour emporter. La tisane était délicieusement parfumée et venait avec un mini biscuit! Quelle délicatesse!  Pour les amoureux du thé anglais, on y sert le high tea, disponible en version végétarienne ou carnée. Il y a aussi toutes ces bouchées sucrées délicieuses, dont les loukoums, qui accompagnent à merveille votre boisson chaude préférée.   Seul bémol, les prix, qui sont un peu élevés. Cependant, la qualité est au rendez-vous. À essayer si vous êtes dans le coin avec des amis ou après une visite au musée des Beaux-Arts."}
{"text":"Just went here today! I had the pasta (pesto) and tbh it wasn't that great. I didn't really enjoy it that much but admittedly it may have just been a bad pick on my part. The iced coffee however was pretty good imo, a bit bitter but strong. If you're into vegan food than you'll probably enjoy this place a lot more than I did. +points for having a patio."}
{"text":"I'm not a fan of museum restaurants and usually avoid them if I can.  So it's no surprise that I ended up here for lunch after perusing the art at the Musee de Beaux Arts in Montreal.  It's right down the street from the museum in a corner basement space with great views of the street for people watching.  I was there for a late lunch so the place was empty.  There were several wait staff and although the place looks like they wouldn't do table service, they will.  The menu is more cafe style (soups, sandwiches, salads) than full meals, so don't expect to pig out at this place...unless it's on the desserts.   There is still enough on the plate to make the hunger disappear, though.  The food is an interesting mix of Italian and French (I had the vegetable panini with a rich cream sauce.) but it seems to go well together without being overly rich.  The cafe serves wine and beer but in limited quantities and considering the extensive list of tea and coffee, most people must order this.    I think why most people patronize the cafe is for the desserts.  Tiny elf-sized desserts in assortments like I've never seen.  Truffles, cookies, marzipans, baklava, and every thing in between.  Several people came in just for these delights while I was eating.  Intrigued, I bought a box of them to take with me, and we finished half the box on the subway back to the hotel.  The best thing about them is that they were not so sweet as to be cloying, but still tasty enough to last on the palate.  The elves working in the back must be baking kings.  For the rest of the cafe, the decor is minimalist white with modern furniture, but just about anyone in any kind of dress will feel welcome here.  You can get away with a light lunch for under $15 (including Montreal tax) which is dirt cheap.  The desserts are not so cheap and a box of 50 pieces was about 25 bucks."}
{"text":"Really cozy place for an afternoon tea. Staff are friendly. Pastries are delicious. It's a good place to rest after seeing the fine arts in the museums a few blocks away."}
{"text":"I ordered their roasted veggie sandwich on gluten-free bread. It was good but certainly not worth 14 dollars. I would suggest the gluten intolerant go elsewhere if you're on a budget."}
{"text":"Ayant entendu beaucoup de bien de cet endroit, je m'y suis rendue, surtout attirée par les spécialités perses. Malheureusement, je n'ai pas été renversée. Le choix de thé est intéressant. Les petits biscuits aux amandes sont savoureux. Toutefois, la boite variée que j'ai achetée en contenait certains dont la fraîcheur laissait à désirer. Pour 0,80$ l'unité d'environ 2 ou 3 grammes,  assez décevant."}
{"text":"We had a lovely afternoon snack here after a visit to the Fine Arts Museum.  Servers went above and beyond to accommodate our large party of 8 on the small outdoor deck.  I had the crab sandwich with side salad.  Not too much mayo and lots of real crab meat.  And the unexpected addition of capers?  Much better than the crab salad you get in America at most supermarket deli counters.  Many of my companions opted for the afternoon tea.  I initially thought these were a bit pricey for the amount of food served, but they were beautifully presented and just a small taste of the clotted cream on a biscuit was enough to offset my sticker shock.  Who knew there was something better than butter?"}
{"text":"The cookies are really cute and adorable looking. I oohed and aahed over them. They're soooo cute! About the size of an average person's pinkie from the tip to the first joint. They're tiny cute.  The cookies taste okay. They definitely look better than they taste. At considering they cost about .50 to .75 each, these are really expensive cookies. For this price, I want them to taste amazing. While I didn't dislike the cookies, I can't justify the prices for the taste.   The cafe is very sleek, modern, and lovely. It's definitely a nice place to sit with your girlfriends and have coffee or tea while gossiping the afternoon away."}
{"text":"We had their afternoon tea (nocochi + english) with 2 sweet teas (shining star + white castle) good for 4.5 ppl. Very quiet and debutante ambience. Service was delightful :)"}
{"text":"For my first TASTE MTL (#TasteMTL) experience, I was paired up with Montreal Blogger Janice (@KtchnHealsSoul) for dinner at Nocochi Bistro & Salon de Thé (@NocochiMontreal).  Let just say at first I was rather skeptical about it since it more like a cafe than a restaurant and I don't think I want a salad or sandwich for my dinner but was I surprise.  Located near the Montreal Museum of Fine Art, it has a very relaxing art gallery cafe feel to it. Known for their delectable gluten-free Persian pastries, European-style coffees and large variety of all natural teas. Their menu consist many vegetarian and gluten-free options.   The picture below show that the place was empty but it was taken at the end of the night when we were leaving but nonetheless, the place wasn't pack when I got there around 7:00pm. I guess TASTE MTL isn't as popular as our Summer/Winterlicious series in Toronto yet since it's only their 2nd year after all.  Taste MTL three-course dinner for $29pp ~ There was only 2 options for our 3-course prix fixe menu; meat and vegetarian. Since Janice decided to get all vegetarian dishes, I opted for all meat so we could try everything.  Beef Carpaccio ~ This was incredibly thin and creamy.  King Oyster Mushroom & Avocado Carpaccio ~ Love the idea and the flavors here but wish the oyster mushroom was cut a little bit thicker to give it more texture in contrast to the creamy soft avocado and creamy sauce  Sous-vide Fillet Mignon w/ Blueberry Sauce, Wasabi Mashed Potatoes, maple glazed vegetables & Charcoal Herbs ~ I do love the sous-vide steak since it gives you the perfectly overall cook steak without the grey area when its cook on the grill and it's usually seared to finish up with a crisp crust/outside.  ~ Here the sous-vide was done pretty well but they didn't give it a crisp enough outside which result in a rather one dimensional texture especially for a fillet mignon which is already extremely tender.  ~ Plus I don't think it was seasoned apart from the salt sprinkled on top. But I do have to applaud them for the presentation and I have to say I did like the wasabi mash.  ~ Plus props to the herbs charcoal powder idea but frankly taste wise, it had barely any herb flavor compare to fresh/dry ones and it sort of disappear when you have it with the steak.  Noodle Soup w/ \"onsen tamago\" eggs, vegetables and maple pearls ~ This was a rather large bowl of noodle and Janice couldn't even finish it although half of it was just veggies. ~  I didn't try this one so I can't say much about it but Janice seems to have enjoyed it and I love the idea of the maple pearls in it to give it that pop of surprise.  Maple ice cream, Hazelnut Crumble & Strawberry Coulis  Lime Mousse & Mint Pearls ~ Like it but wish they were some kind of crust to it   They had a whole menu just for teas, I sort of regretted of not having try at least one of them.   Handmade Persian and Middle Eastern Sweets with nuts and a touch of traditional spices. I bought a 2 of the small boxes at $16.00/ea (1st picture), one for myself and one as gift. Read a lot of good reviews online about them, I thought it does live up to their reputation and price tag. It was not the sweet treat that I somehow expected which I love and although of their long shelf life of 2-3 months, they were crumbling soft and love how it's all packed with different kind of spices.  Verdict: ~ I notice that their regular menu are more café style with salads, crepes, omelets, sandwiches and pasta which is totally different from what we had ~ Although there was some hits and some misses, I did enjoy my meal here. ~ The service was incredible attentive and friendly, would love to experience afternoon tea here."}
{"text":"An outstanding selection of teas and tisanes including tasteful blends.  Our favorites are the chai blend and the Serenity Tisane.    Bakery treats have origins that hail from around the world."}
