{"text":"i was trying to order a build your own poke bowl and the lady, confused, tried to give me one of their signature bowls instead. so i kept explaining that i wanted to build my own, and eventually she called over the chef, who understood. i found it disappointing that someone who works there doesn't even know their menu properly, especially since they're supposed to be the waitress taking orders. after ordering, the chef tipped himself without telling us. the food itself is mediocre, sushi rice has too much vinegar, fish is really fishy. my friend ordered torched fish with extra protein and they didn't torch the extra protein. also, when i brought up the 20% off in store voucher, the chef seemed confused. i didn't want to go in circles explaining myself again so i just let it slide."}
{"text":"Portions are big but the taste is not good. I got the classic blue fin tuna poke bowl with sushi rice, the rice was seasoned with way too much vinegar that it completely overpowered everything else. Every bite was just sour. The fish on its own doesn't taste very fresh either. Overall I would not return again."}
{"text":"I purchased a voucher from living social earlier this week and was excited to come here for lunch today.  What a disappointment.  When I arrived I was told they \"don't do business with living social anymore\" and wouldn't honour my voucher I had purchased 3 days prior. The guy tried to tell me it was because living social wasn't paying them. Regardless an extremely frustrating customer experience. I didn't eat there and went to Aroma across the street instead where I was fully satisfied with my lunch."}
{"text":"Got the Groupon and went for dinner. The service was really bad. The Salmon torched burrito was full of rice and hardly any Salmon- they are probably trying to save costs with the Groupon deal and it was definitely not worth $15. The picture of the burrito on the yelp site is completely inaccurate. Also, they very rudely assume that you will not tip if using a Groupon voucher and warn you upfront that you will be charged 15% tip if you dine in because apparently people who use Groupon vouchers don't tip. I decided to take out and still gave a tip so that they know to treat people better and not assume that everyone that steps in is cheap. Terrible service and for that reason I won't recommend them."}
{"text":"Worst sushi in Toronto, never fresh ingredients. I'm surprised it's even still open to be honest. Tourist trap for sure."}
{"text":"We were the only customer there at 7 pm on a Saturday night but no service for ten minutes, then at the end they added a 15% gratuity for two people; when objected the owner tried to embarrass you in front of your friend! Otherwise a bowl of rice with some chopped vege and few slices of \"beef\" would cost you $20 all in at menu price."}
{"text":"I had the salmon poke bowl. $15 for a large. 
Portion size was very good, large is definitely a lot of food!

The bowl itself was delicious. Lots of topping variety and the salmon tasted VERY fresh. 

Would definitely come back for my poke bowl cravings. 

One star docked because the man who was running this establishment (owner in assuming?) was yelling and swearing on the phone. He was nice to me but I felt a bit awkward dining in and hearing his many arguments over the phone about deliveries etc..."}
{"text":"First time ordered and LAST time!
We will never order from here again. The food was over 30 mins late, the food containers were carried so that the food slid out of the compartments, the food (soups and bento boxes) were ice cold, I called the restaurant at 20 mins late...said \"driver left a while ago\", I was looking out our apt window and saw the delivery guy walk along the long sidewalk to our bldg very slowly.  He saw I was very angry but did not apologize after I pointed out how late he was and even worse, I called the restaurant to complain and ask what they would do for us and the owner/manager offered a piddly $10 back on a $50 + order where I even edited the tip to driver to be 18%. When I told him that was not good enough, he hung up on me.
Oh and there was \"other\" hair on the food."}
{"text":"I should have read the reviews before I purchased the groupon. I never felt so uncomfortable. I came in to another customer arguing with the server about their groupon and right away I was worried because I was about to use the groupon. The servers were quite rude...they do not make your feel welcome and warn you asap that a 15% gratitude will be added to the groupon bills which is fine but the way they brought it up was not professional. The restaurant is out dated and quite dirty as a result I was worried about the food handling of the restaurant. The poke was alright not the best but not the worse. However, because of the service I would not come back."}
{"text":"This place is weird. 

You are given disposable cutlery and eat out of takeout containers. 

The quality of the dishes is similar to other cheap sushi joints nearby (not great). However, I didn't find Noka's prices as competitive. 

\"Minimal\" would be the nicest possible way to describe the decor. I suppose that would also be an apt description of the service.

Personally, I wouldn't recommend this place."}
{"text":"The Annex is a hotbed for inexpensive Sushi but Noka always stood out, lovely service, great presentation (lovely spiralized beet and carrot decorating plates) and one of the better AYCE options (nice looking rolls with the same careful attention to presentation). Well NO MORE. Apparently they are under new management and they are trying a new fast food concept with a focus on Poke bowls and Sushi Burritos. 

Went here today with friends after a film at the Bloor. We walk in and the guy greets us with this is our menu pointing to a big board on the wall and no offer of menus at the tables (this should have been my first clue to just leave). Having a hard time deciding and standing around he finally provided us 3 menus and we take them to a booth to choose. He told us to take our time and he'd just be over here when we were ready. When we'd decided I made eye contact, smiled and said we'd finally figured it out and then he said we had to go over there to order. Okay.....(should have raised alarm bells again but honestly I was so confused). 

My friends's food came super fast in plastic clam shell container. Honestly it was likely pre-done and sitting in the fridge like you'd find at the grocery store. She had asked for a glass of water and he brought her the water in the same styrofoam bowls as our miso soup saying that with their new concept they didn't have cups. WTF. 

Food was fine - although honestly for $21.95 for a sushi combo I expect better than plastic forks (brought for my husband's salmon teriyaki bento - again the bento box itself was all plastic and styrofoam) and water served in a bowl because you don't have cups. 

When you took over the business did you not get the dishes??

In an area with SO MANY sushi choices Noka you simply need to do better.

I'm not even going to get into what an environmental disaster this is - Noka you are basically punching mother nature in the face with all your takeaway containers for eat in!"}
{"text":"The place is tired and run down and service was unfriendly but good served quickly once they took our order. The spicy mango salmon bowl was great. I ordered the large. enough to share as the main for 2 people."}
{"text":"Got the Groupon and went for lunch. The service was really bad. The poke bowl was with very poor quality, and it does not worth 15 dollars. Worst place in the area I've ever been."}
{"text":"Saw Noka Poke on a food delivery app so I decided to try it out. They delivered early too, which is great. 

I ordered the Classic Salmon Poke Bowl with a salad base & their house sauce. First of all, the sauce was way too watery and nearing the end of my meal, it just pooled at the bottom and made everything soggy. Furthermore, the 'salad' was just iceberg lettuce which felt cheap and flavourless. The actual veggie toppings had not much flavour either, the corn & edamame tasted like they were just thawed from frozen. Otherwise, the amount of salmon was great & its freshness was ok, I liked the seaweed salad, and loved the avocado. For some reason their tobiko wasn't as crunchy or tasty.

Hopefully in the future they can use a better salad base & toppings and reformulate their house sauce!"}
