{"text":"Dont order from the slice app. Nonnis food is good but service is bad. They delivered to my house one week then the next week they say im out of there area."}
{"text":"Love Pizza Nonnis. They get it right!! Good pizza, decent delivery time, and great pickup specials!"}
{"text":"We ordered pizza from this place a couple of months ago. I'm just now getting around to writing this review because my fury is almost at a point which won't cause me to break my keyboard. My kid was getting ready to go away for 10 days, so we ordered pizza to have a laid-back family night in. Pizza got here. Delivery guy didn't leave for HOURS. He locked his keys and phone in his car-- which sat in my driveway running from about 6pm to 11pm. We brought him in the house and gave him a phone to use. No one would come to help him. My husband stood outside trying to help him break into his car to no avail. When I finally called Nonni's to tell them to get their delivery guy out of my house, they laughed at me. LAUGHED AT ME for trying to help THEIR EMPLOYEE. It wasn't funny. I wanted him out of my house so I could spend the evening with my kid. Nonni's thought it was all hysterical until I wrote on their FB page. Then they got uppity. Complete, utter farce of service. The pizza was cold by the time we had to opportunity to eat it and, frankly, it wasn't anything spectacular. Easily the most awful service experience I've had."}
{"text":"truly embarrassing. They offered me a pizza that they didn't make correctly at a discounted price, then screwed up 2 gyros. Running a restaurant isn't easy and these people are out of their depths. They've caught on to the bad reviews and have disabled them on Eatstreet. Hopefully google doesn't let businesses edit their own reviews. Terrible. Will not return. does not deserve 1 star."}
{"text":"I have ordered from Nonni's for a party we got 4 or 5 pizzas with bread sticks. They're pizza is very fresh very clean, we got 2 veggie pizzas and the ingredients were really good quality  not like other pizza places where the veggies are like rotten.   I ordered a single pizza for me and my siblings on a sports night and in Pittsburgh; all the pizza/food places get busy then but their delivery was very fast and again good quality.  As far as the customer services goes they're very polite and do what you ask for the pizza party we had they even gave us a discount which was nice of them. They're prices are a little lower than other places anyway.  I'm not saying they're the best pizza or pizza place but as far as how I was treated as a customer and the food I got for the price I paid for, I give them a five star."}
{"text":"Awful customer service, I received the wrong order. I then tried to call the restaurant but  since it was close to their closing time, nobody answered the phone. Management was contacted the next morning and said they couldn't do anything about fixing the order (refund or maybe a coupon for next time) until they received the wrong food back. I'm not sure what they were going to do with a 12 hour old pizza but okay... There are a lot of other pizza shops, I can easily go elsewhere."}
{"text":"Here is what I ordered after a cold day out in the rain. Beef veggie soup, which was horrible and tasted like a bag of frozen veggies with chewy beef & too much beef stock. and Sambousek with Baklava for dessert. What a waste I couldn't eat any of it and this was a waist of my hard earned money."}
