{"text":"We went into Seafood City to check out the new supermarket in town. We were approached by a very friendly young woman, Heather, who asked if we would like to sample the new restaurant. Hard to resist. We got a large shareable beef bowl, a bao, and 2 frozen soft drinks. You order at the counter. the soft drinks and the bao were given to us. The beef bowl is wheeled to the table on a cart (the food is in a metal bowl that is on a heater to keep it really, really hot). The beef bowl is a huge portion of chicken broth filled with large chunks of beef, tofu, minature bok choy, mushrooms, other veggies, and lots and lots of noodles on the bottom. Delish!! And way more food than we could finish for around $12. We will definitely return after the official opening on May 14th."}
{"text":"I was excited about this place and the food is good BUT.....I am tired of getting home to find out that I am missing part of my order or was given the wrong order specially when you waited so long!...It's frustrating and annoying!!  ALWAYS CHECK YOUR ORDER!  Happened 3x now so this time I called and was told to come back and they will give it to me. Another trip to make.  In addition, some of the condiments are empty, no lids for the condiment containers and soooooo slow!  Need to get organized and work faster or you will lose customers."}
{"text":"Off the bat, love how the presentation of the soups come out. Super stoked that there is now a seafood city in Henderson now!  Hubby and I were hungry and wanted some soup, and what a perfect place to satisfy your craving, we went to Noodle Street. 

I got the beef wonton Mami I think and came with so much vegetables and it was SUPER delicious. 
Hubby got arroz caldo and that you was yummy! I LOVED the soup, but didn't care too much for the siopao and the lumpiang shanghai which is what the 4stars was for. Other than that, it was yummy!! Will most definitely come back for more and more and more!!!"}
{"text":"The Beef Mami Hot Pot has an overall great taste but the very small portion of beef you receive was mostly fat.! Not worth the extra money. Service was quick and the employees were friendly.!"}
